{"paperId":2466449,"citation":[{"content":"Tasos Spiliotopoulos , Ian Oakley, An exploratory study on the use of Twitter and Facebook in tandem, Proceedings of the 2015 British HCI Conference, July 13-17, 2015, Lincoln, Lincolnshire, United Kingdom","paperID":"2783620"},{"content":"Basilisa Mvungi , Mizuho Iwaihara, Factors That Influence Social Networking Service Private Information Disclosure at Diverse Openness and Scopes, Proceedings of the 5th International Conference on Social Informatics, p.119-128, November 25-27, 2013, Kyoto, Japan","paperID":"2694826"},{"content":"Pedro Henrique Batista Ruas da Silveira , Cristiane Neri Nobre , Ana Maria Pereira Cardoso, A influência das estratégias persuasivas no comportamento dos usuários no Facebook, Proceedings of the 13th Brazilian Symposium on Human Factors in Computing Systems, October 27-31, 2014, Foz do Iguaçu, Brazil","paperID":"2738097"},{"content":"Basilisa Mvungi , Mizuho Iwaihara, Associations between privacy, risk awareness, and interactive motivations of social networking service users, and motivation prediction from observable features, Computers in Human Behavior, v.44 n.C, p.20-34, March 2015","paperID":"2802300"},{"content":"Tasos Spiliotopoulos , Diogo Pereira , Ian Oakley, Predicting Tie Strength with the Facebook API, Proceedings of the 18th Panhellenic Conference on Informatics, October 02-04, 2014, Athens, Greece","paperID":"2645817"},{"content":"Minsam Ko , Seungwoo Choi , Joonwon Lee , Uichin Lee , Aviv Segev, Understanding Mass Interactions in Online Sports Viewing: Chatting Motives and Usage Patterns, ACM Transactions on Computer-Human Interaction (TOCHI), v.23 n.1, p.1-27, February 2016","paperID":"2843941"},{"content":"Anicia N. Peters , Heike Winschiers-Theophilus , Brian E. Mennecke, Cultural influences on Facebook practices, Computers in Human Behavior, v.49 n.C, p.259-271, August 2015","paperID":"2778645"},{"content":"Emre KıcKıman , Matthew Richardson, Towards Decision Support and Goal Achievement: Identifying Action-Outcome Relationships From Social Media, Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, August 10-13, 2015, Sydney, NSW, Australia","paperID":"2783310"},{"content":"Amandeep Dhir , Puneet Kaur , Kirsti Lonka , Marko Nieminen, Why do adolescents untag photos on Facebook?, Computers in Human Behavior, v.55 n.PB, p.1106-1115, February 2016","paperID":"2874110"},{"content":"Stuart Reeves , Barry Brown, Embeddedness and sequentiality in social media, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820008"},{"content":"Eun Go , Kyung Han You , Eunhwa Jung , Hongjin Shim, Why do we use different types of websites and assign them different levels of credibility? Structural relations among users' motives, types of websites, information credibility, and trust in the press, Computers in Human Behavior, v.54 n.C, p.231-239, January 2016","paperID":"2840611"}],"reference":[{"content":"Ancu, M. and Cozma, R. MySpace Politics: Uses and Gratifications of Befriending Candidates. Journal of Broadcasting & Electronic Media 53, 4 (2009).","paperID":"None"},{"content":"Valerio Arnaboldi , Marco Conti , Andrea Passarella , Fabio Pezzoni, Analysis of Ego Network Structure in Online Social Networks, Proceedings of the 2012 ASE/IEEE International Conference on Social Computing and 2012 ASE/IEEE International Conference on Privacy, Security, Risk and Trust, p.31-40, September 03-05, 2012","paperID":"2411730"},{"content":"Eytan Bakshy , Itamar Rosenn , Cameron Marlow , Lada Adamic, The role of social networks in information diffusion, Proceedings of the 21st international conference on World Wide Web, April 16-20, 2012, Lyon, France","paperID":"2187907"},{"content":"Blondel, V. D., Guillaume, J.-L., Lambiotte, R., and Lefebvre, E. Fast unfolding of communities in large networks. Journal of Statistical Mechanics: Theory and Experiment 2008, 10 (2008).","paperID":"None"},{"content":"boyd, d. Why Youth (Heart) Social Network Sites: The Role of Networked Publics in Teenage Social Life. In D. Buckingham, ed., MacArthur Foundation Series on Digital Learning - Youth, Identity, and Digital Media Volume. MIT Press, Cambridge, MA, 2007.","paperID":"None"},{"content":"boyd, d. Facebook's Privacy Trainwreck: Exposure, Invasion, and Social Convergence. Convergence 14, 1 (2008).","paperID":"None"},{"content":"Brewer, D. Forgetting in the recall-based elicitation of personal and social networks. Social Networks 22, (2000), 29--43.","paperID":"None"},{"content":"Brooks, B., Welser, H. T., Hogan, B., and Titsworth, S. Socioeconomic Status Updates: Family SES and emergent social capital in college student Facebook networks. ICS 14, 4 (2011), 529--549.","paperID":"None"},{"content":"Moira Burke , Robert Kraut , Cameron Marlow, Social capital on facebook: differentiating uses and users, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979023"},{"content":"Butts, C. T. Revisiting the foundations of network analysis. Science (New York, N.Y.) 325, 5939 (2009).","paperID":"None"},{"content":"Dunne, Á., Lawlor, M.-A., and Rowley, J. Young people's use of online social networking sites - a uses and gratifications perspective. Journal of Research in Interactive Marketing 4, 1 (2010), 46--58.","paperID":"None"},{"content":"Ellison, N. and Steinfield, C. The Benefits of Facebook \"Friends:\" Social Capital and College Students' Use of Online Social Network Sites. JMC 12, 4 (2007), 1--28.","paperID":"None"},{"content":"Ellison, N. B., Steinfield, C., and Lampe, C. Connection strategies: Social capital implications of Facebook-enabled communication practices. New Media & Society 13, 6 (2011), 873--892.","paperID":"None"},{"content":"Eric Gilbert , Karrie Karahalios, Predicting tie strength with social media, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518736"},{"content":"Hanson, G. and Haridakis, P. YouTube users watching and sharing the news: A uses and gratifications approach. Journal of Electronic Publishing 11, 3 (2008).","paperID":"None"},{"content":"Hogan, B. Visualizing and Interpreting Facebook Networks. In D. L. Hansen, B. Shneiderman and M. A. Smith, eds., Analyzing Social Media Networks with NodeXL. Morgan Kaufmann, 2010, 165--180.","paperID":"None"},{"content":"Maritza Johnson , Serge Egelman , Steven M. Bellovin, Facebook and privacy: it's complicated, Proceedings of the Eighth Symposium on Usable Privacy and Security, July 11-13, 2012, Washington, D.C.","paperID":"2335369"},{"content":"Adam N. Joinson, Looking at, looking up or keeping up with people?: motives and use of facebook, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357213"},{"content":"Mayur Karnik , Ian Oakley , Jayant Venkatanathan , Tasos Spiliotopoulos , Valentina Nisi, Uses & gratifications of a facebook media sharing group, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441868"},{"content":"Katz, E., Gurevitch, M., and Haas, H. On the use of the mass media for important things. American Sociological Review 38, (1973), 164--181.","paperID":"None"},{"content":"Kaye, B. K. Going to the Blogs: Toward the Development of a Uses and Gratifications Measurement Scale for Blogs. Atlantic Journal of Communication 18, 4 (2010), 194--210.","paperID":"None"},{"content":"Key Facts - Facebook Newsroom. http://newsroom.fb.com/Key-Facts. (Retrieved 13 January 2013).","paperID":"None"},{"content":"Jennifer King , Airi Lampinen , Alex Smolen, Privacy: is there an app for that?, Proceedings of the Seventh Symposium on Usable Privacy and Security, July 20-22, 2011, Pittsburgh, Pennsylvania","paperID":"2078843"},{"content":"Knoke, D. and Yang, S. Social Network Analysis. Sage Publications, Inc, California, 2008.","paperID":"None"},{"content":"Cliff Lampe , Jessica Vitak , Rebecca Gray , Nicole Ellison, Perceptions of facebook's value as an information source, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208739"},{"content":"Cliff Lampe , Rick Wash , Alcides Velasquez , Elif Ozkaya, Motivations to participate in online communities, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753616"},{"content":"Lazer, D., Pentland, A., Adamic, L., et al. Life in the network: the coming age of computational social science. Science (New York) 323, 5915 (2009), 721--3.","paperID":"None"},{"content":"Lewis, K., Kaufman, J., Gonzalez, M., Wimmer, A., and Christakis, N. Tastes, ties, and time: A new social network dataset using Facebook.com. Social Networks 30, 4 (2008), 330--342.","paperID":"None"},{"content":"Paik, A. and Sanchagrin, K. Social Isolation in America: An Artifact (July 5, 2012). Available at SSRN: http://ssrn.com/abstract=2101146, (2012).","paperID":"None"},{"content":"Katrina Panovich , Rob Miller , David Karger, Tie strength in question & answer on social network sites, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145361"},{"content":"Papacharissi, Z. and Mendelson, A. Toward a New(er) Sociability: Uses, Gratifications and Social Capital on Facebook. In S. Papathanassopoulos, ed., Media Perspectives for the 21st Century. Routledge, 2011.","paperID":"None"},{"content":"Papacharissi, Z. Uses and Gratifications. In M. Salwen and D. Stacks, eds., An Integrated Approach to Communication Theory and Research. Lawrence Erlbaum, 2008, 137--152.","paperID":"None"},{"content":"Papacharissi, Z. Privacy as a luxury commodity. First Monday 15, 8 (2010), 2--5.","paperID":"None"},{"content":"Quan-Haase, A. and Young, a. L. Uses and Gratifications of Social Media: A Comparison of Facebook and Instant Messaging. Bulletin of Science, Technology & Society 30, 5 (2010), 350--361.","paperID":"None"},{"content":"Daniele Quercia , Renaud Lambiotte , David Stillwell , Michal Kosinski , Jon Crowcroft, The personality of popular facebook users, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145346"},{"content":"Raacke, J. and Bonds-Raacke, J. MySpace and Facebook: applying the uses and gratifications theory to exploring friend-networking sites. Cyberpsychology & behavior 11, 2 (2008), 169--74.","paperID":"None"},{"content":"Andrew D. Smock , Nicole B. Ellison , Cliff Lampe , Donghee Yvette Wohn, Facebook as a toolkit: A uses and gratification approach to unbundling feature use, Computers in Human Behavior, v.27 n.6, p.2322-2329, November, 2011","paperID":"2030892"},{"content":"Ugander, J., Backstrom, L., Marlow, C., and Kleinberg, J. Structural diversity in social contagion. PNAS, 109, 16 (2012), 5962--6.","paperID":"None"},{"content":"Urista, M. A., Dong, Q., and Day, K. D. Explaining Why Young Adults Use MySpace and Facebook Through Uses and Gratifications Theory. Human Communication 12, 2 (2009), 215--229.","paperID":"None"},{"content":"Valenzuela, S., Park, N., and Kee, K. F. Is There Social Capital in a Social Network Site?: Facebook Use and College Students' Life Satisfaction, Trust, and Participation. JMC 14, 4 (2009), 875--901.","paperID":"None"},{"content":"Watts, D. J. and Strogatz, S. H. Collective dynamics of 'small-world' networks. Nature 393, 6684 (1998), 440--2.","paperID":"None"},{"content":"Christian Yoder , Fred Stutzman, Identifying social capital in the facebook interface, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979025"}],"abstract":"This study explores the links between motives for using a social network service and numerical measures of that activity. Specifically, it identified motives for Facebook use by employing a Uses and Gratifications (U&G) approach and then investigated the extent to which these motives can be predicted through usage and network metrics collected automatically via the Facebook API. In total, 11 Facebook usage metrics and eight personal network metrics served as predictors. Results showed that all three variable types in this expanded U&G frame of analysis (covering social antecedents, usage metrics, and personal network metrics) effectively predicted motives and highlighted interesting behaviors. To further illustrate the power of this framework, the intricate nature of privacy in social media was explored and relationships drawn between privacy attitudes (and acts) and measures of use and network structure.","video":"http://www.youtube.com/embed/DDb3-pX6Ij8?rel=0","title":"Understanding motivations for facebook use: usage metrics, network structure, and privacy","filename":"CHI13/p3287","authors":["Tasos Spiliotopoulos","Ian Oakley"],"conference":"CHI '13"}