{"paperId":2466180,"reference":[{"content":"Johnny Accot , Shumin Zhai, Beyond Fitts' law: models for trajectory-based HCI tasks, Proceedings of the ACM SIGCHI Conference on Human factors in computing systems, p.295-302, March 22-27, 1997, Atlanta, Georgia, USA","paperID":"258760"},{"content":"Johnny Accot , Shumin Zhai, Refining Fitts' law models for bivariate pointing, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642646"},{"content":"Shiri Azenkot , Shumin Zhai, Touch behavior with different postures on soft smartphone keyboards, Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services, September 21-24, 2012, San Francisco, California, USA","paperID":"2371612"},{"content":"Xiaojun Bi , Barton A. Smith , Shumin Zhai, Quasi-qwerty soft keyboard optimization, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753367"},{"content":"Bi, X., Smith, A. B., and Zhai, S. (2012) Multilingual Touchscreen Keyboard Design and Optimization. Human-Computer Interaction, Volume 27, Issue 4, 352--382.","paperID":"None"},{"content":"Card, S. K., English, W. K. and Burr, B. J. (1978) Evaluation of mouse, rate-controlled isometric joystick, step keys, and text keys for text selection on a CRT. Ergonomics 21 (8), 601--613.","paperID":"None"},{"content":"Olivier Chapuis , Pierre Dragicevic, Effects of motor scale, visual scale, and quantization on small target acquisition difficulty, ACM Transactions on Computer-Human Interaction (TOCHI), v.18 n.3, p.1-32, July 2011","paperID":"1993063"},{"content":"A. Cockburn , D. Ahlström , C. Gutwin, Understanding performance in touch selections: Tap, drag and radial pointing drag with finger, stylus and mouse, International Journal of Human-Computer Studies, v.70 n.3, p.218-233, March, 2012","paperID":"2108781"},{"content":"Crossman, E. R. F. W. (1957) The speed and accuracy of simple hand movements. In The Nature and Acquisition of Industrial Skills, E. R. F. W. Crossman and W. D. Seymour (eds). Report to the M.R.C. and D.S.I.R. Joint Committee on Individual Efficiency in Industry.","paperID":"None"},{"content":"Crossman, E. R. F. W. and Goodeve, P. J. (1963/1983) Feedback control of hand-movement and Fitts' law. Quarterly J. of Exp. Psychology 35A (2), 251--278.","paperID":"None"},{"content":"Fitts, P. M. (1954). The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, 47, 381--391.","paperID":"None"},{"content":"Fitts, P. M. and Radford, B. K. (1966) Information capacity of discrete motor responses under different cognitive sets. J. of Exp. Psychology 71 (4), 475--482.","paperID":"None"},{"content":"Christian Holz , Patrick Baudisch, The generalized perceived input point model and how to double touch accuracy by extracting fingerprints, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753413"},{"content":"Christian Holz , Patrick Baudisch, Understanding touch, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979308"},{"content":"Seungyon Lee , Shumin Zhai, The performance of touch screen soft buttons, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518750"},{"content":"Lewis, J. R., Kennedy, P. J., & LaLomia, M. J. (1999). Development of a Digram-Based Typing Key Layout for Single-Finger/Stylus Input. Proc. of The Human Factors and Ergonomics Society 43rd Annual Meeting.","paperID":"None"},{"content":"MacKenzie, I. S. (1989) A note on the information theoretic basis for Fitts' law. J. of Motor Behavior 21, 323--330.","paperID":"None"},{"content":"I. Scott MacKenzie, Fitts' law as a research and design tool in human-computer interaction, Human-Computer Interaction, v.7 n.1, p.91-139, March 1992","paperID":"1461857"},{"content":"I. Scott MacKenzie , William Buxton, Extending Fitts' law to two-dimensional tasks, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.219-226, May 03-07, 1992, Monterey, California, USA","paperID":"142794"},{"content":"Sasangohar, F., MacKenzie, I. S., Scott, S., (2009) Evaluation of mouse and touch input for a tabletop display using Fitts' reciprocal tapping task. Annual Meeting of the Human Factors and Ergonomics Society HFES, 839--843.","paperID":"None"},{"content":"Welford, A. T. (1968) Fundamentals of Skill. London: Methuen.","paperID":"None"},{"content":"Welford, A. T., Norris, A. H., and Shock, N. W. (1969) Speed and accuracy of movement and their changes with age. Acta. Psychol. 30, 3--15.","paperID":"None"},{"content":"Jacob O. Wobbrock , Edward Cutrell , Susumu Harada , I. Scott MacKenzie, An error model for pointing based on Fitts' law, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357306"},{"content":"Wobbrock, J. O. (2007) Measures of text entry performance. In Text Entry Systems: Mobility, Accessibility, Universality, I. S. MacKenzie and K. Tanaka-Ishii (eds.) San Francisco: Morgan Kaufmann, 47--74.","paperID":"None"},{"content":"Shumin Zhai , Jing Kong , Xiangshi Ren, Speed-accuracy tradeoff in Fitts' law tasks: on the equivalency of actual and nominal pointing precision, International Journal of Human-Computer Studies, v.61 n.6, p.823-856, December 2004","paperID":"1056158"},{"content":"Shumin Zhai , Per Ola Kristensson, The word-gesture keyboard: reimagining keyboard interaction, Communications of the ACM, v.55 n.9, September 2012","paperID":"2330689"}],"citation":[{"content":"Daryl Weir , Henning Pohl , Simon Rogers , Keith Vertanen , Per Ola Kristensson, Uncertain text entry on mobile devices, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557412"},{"content":"Justin Mockler, UX suite: a touch sensor evaluation platform, Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, September 23-26, 2014, Toronto, ON, Canada","paperID":"2628431"},{"content":"François Bérard , Renaud Blanch, Two touch system latency estimators: high accuracy and low overhead, Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces, October 06-09, 2013, St. Andrews, Scotland, United Kingdom","paperID":"2512796"},{"content":"Quan Nguyen , Michael Kipp, Orientation matters: efficiency of translation-rotation multitouch tasks, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557399"},{"content":"Yang Li , Hao Lu , Haimo Zhang, Optimistic Programming of Touch Interaction, ACM Transactions on Computer-Human Interaction (TOCHI), v.21 n.4, p.1-24, August 2014","paperID":"2631914"},{"content":"Simon Voelker , Andrii Matviienko , Johannes Schöning , Jan Borchers, Combining Direct and Indirect Touch Input for Interactive Workspaces using Gaze Input, Proceedings of the 3rd ACM Symposium on Spatial User Interaction, August 08-09, 2015, Los Angeles, California, USA","paperID":"2788949"},{"content":"Jaime Ruiz , Edward Lank, Analyzing intended use effects in target acquisition, Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces, May 27-29, 2014, Como, Italy","paperID":"2598158"},{"content":"Xiaojun Bi , Shumin Zhai, Bayesian touch: a statistical criterion of target selection with finger touch, Proceedings of the 26th annual ACM symposium on User interface software and technology, October 08-11, 2013, St. Andrews, Scotland, United Kingdom","paperID":"2502058"},{"content":"Kyung-mi Chung , Dong-Hee Shin, Effect of elastic touchscreen and input devices with different softness on user task performance and subjective satisfaction, International Journal of Human-Computer Studies, v.83 n.C, p.12-26, November 2015","paperID":"2827180"},{"content":"Oscar Kin-Chung Au , Xiaojun Su , Rynson W.H. Lau, LinearDragger: a Linear Selector for One-finger Target Acquisition, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557096"},{"content":"Jian Zhao , R. William Soukoreff , Ravin Balakrishnan, Exploring and modeling unimanual object manipulation on multi-touch displays, International Journal of Human-Computer Studies, v.78 n.C, p.68-80, June 2015","paperID":"2784402"},{"content":"Daniel Avrahami, The Effect of Edge Targets on Touch Performance, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702439"},{"content":"Haijun Xia , Tovi Grossman , George Fitzmaurice, NanoStylus: Enhancing Input on Ultra-Small Displays with a Finger-Mounted Stylus, Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2807500"},{"content":"Yuexing Luo , Daniel Vogel, Crossing-based selection with direct touch input, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557397"}],"abstract":"Fitts' law has proven to be a strong predictor of pointing performance under a wide range of conditions. However, it has been insufficient in modeling small-target acquisition with finger-touch based input on screens. We propose a dual-distribution hypothesis to interpret the distribution of the endpoints in finger touch input. We hypothesize the movement endpoint distribution as a sum of two independent normal distributions. One distribution reflects the relative precision governed by the speed-accuracy tradeoff rule in the human motor system, and the other captures the absolute precision of finger touch independent of the speed-accuracy tradeoff effect. Based on this hypothesis, we derived the FFitts model - an expansion of Fitts' law for finger touch input. We present three experiments in 1D target acquisition, 2D target acquisition and touchscreen keyboard typing tasks respectively. The results showed that FFitts law is more accurate than Fitts' law in modeling finger input on touchscreens. At 0.91 or a greater R2 value, FFitts' index of difficulty is able to account for significantly more variance than conventional Fitts' index of difficulty based on either a nominal target width or an effective target width in all the three experiments.","video":"http://www.youtube.com/embed/vdRfKQavqo4?rel=0","title":"FFitts law: modeling finger touch with fitts' law","filename":"CHI13/p1363","authors":["Xiaojun Bi","Yang Li","Shumin Zhai"],"conference":"CHI '13"}