{"paperId":2466430,"citation":[{"content":"Yan Xu , Florian Perteneder , Joanne Leong , Eva-Maria Schwaiger , Michael Haller, Using grid visualization to organize visual data, Proceedings of the Second International Symposium of Chinese CHI, p.50-56, April 26-27, 2014, Toronto, Ontario, Canada","paperID":"2592243"},{"content":"Joey Scarr, Exploiting spatial memory to design efficient command interfaces, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468711"},{"content":"Carl Gutwin , Andy Cockburn , Joey Scarr , Sylvain Malacria , Scott C. Olson, Faster command selection on tablets with FastTap, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557136"},{"content":"Mathieu Berthellemy , Elodie Cayez , Marwan Ajem , Gilles Bailly , Sylvain Malacria , Eric Lecolinet, SpotPad, LociPad, ChordPad and InOutPad: investigating gesture-based input on touchpad, Proceedings of the 27th Conference on l'Interaction Homme-Machine, p.1-8, October 27-30, 2015, Toulouse, France","paperID":"2820623"},{"content":"Andy Cockburn , Carl Gutwin , Joey Scarr , Sylvain Malacria, Supporting Novice to Expert Transitions in User Interfaces, ACM Computing Surveys (CSUR), v.47 n.2, p.1-36, December 2014","paperID":"2659796"},{"content":"Joey Scarr , Andy Cockburn , Carl Gutwin, Supporting and Exploiting Spatial Memory in User Interfaces, Foundations and Trends in Human-Computer Interaction, v.6 n.1, p.1-84, December 2013","paperID":"2688147"}],"reference":[{"content":"Andrade, J. and Meudell, P. Short report: Is spatial information encoded automatically? Quarterly J of Exp. Psych. 46A (1993), 365--375.","paperID":"None"},{"content":"Baddeley, A. D. Human Memory. Lawrence Erlbaum Associates, Hove, 1990.","paperID":"None"},{"content":"Bryant, D. J. and Tversky, B. Mental representations of perspective and spatial relations from diagrams and models. J. Exp. Psych.: Learning, Memory, Cognition 25, 1 (1999), 137.","paperID":"None"},{"content":"Bülthoff, I. and Newell, F. N. The role of familiarity in the recognition of static and dynamic objects. Progress in Brain Research, Elsevier, 2006, 315--325.","paperID":"None"},{"content":"Bundesen, C., Larsen, A. Visual transformation of size. J. Exp. Psych.: Perception and Performance 1, 3 (1975), 214--220.","paperID":"None"},{"content":"Andy Cockburn , Per Ola Kristensson , Jason Alexander , Shumin Zhai, Hard lessons: effort-inducing interfaces benefit spatial learning, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240863"},{"content":"Cohen, J. Eta-squared and partial eta-squared in communication science. Hum. Comm. Research 28, 473--490 (1973), 56.","paperID":"None"},{"content":"Cohen, J. Statistical power analysis for the behavioral sciences. Lawrence Erlbaum, 1988.","paperID":"None"},{"content":"Cooper, L. A. Mental rotation of random two-dimensional shapes. Cognitive psychology 7, 1 (1975), 20--43.","paperID":"None"},{"content":"Czerwinski, M., van Dantzich, M., Robertson, G. and Hoffman, H. The Contribution of Thumbnail Image, Mouse-Over Text and Spatial Location Memory to Web Page Retrieval in 3D. in Proc. INTERACT'99, (1999), 163--170.","paperID":"None"},{"content":"Rudolph P. Darken , John L. Sibert, Wayfinding strategies and behaviors in large virtual worlds, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.142-149, April 13-18, 1996, Vancouver, British Columbia, Canada","paperID":"238459"},{"content":"Alan Dix , Janet Finlay , Gregory Abowd , Russell Beale, Human-computer interaction, Prentice-Hall, Inc., Upper Saddle River, NJ, 1997","paperID":"249491"},{"content":"Brian D. Ehret, Learning where to look: location learning in graphical user interfaces, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 20-25, 2002, Minneapolis, Minnesota, USA","paperID":"503414"},{"content":"Carl Gutwin , Andy Cockburn, Improving list revisitation with ListMaps, Proceedings of the working conference on Advanced visual interfaces, May 23-26, 2006, Venezia, Italy","paperID":"1133347"},{"content":"Wilfred J. Hansen, User engineering principles for interactive systems, Proceedings of the November 16-18, 1971, fall joint computer conference, November 16-18, 1971, Las Vegas, Nevada","paperID":"1479159"},{"content":"Hart, S. and Staveland, L. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. in Human Mental Workload, 1988, 139--183.","paperID":"None"},{"content":"Hick, W. E. On the rate of gain of information. Quarterly J. of Exp. Psych. 4 (1952), 11--26.","paperID":"None"},{"content":"Hyman, R. Stimulus information as a determinant of reaction time. J. Exp. Psych. 45 (1953), 188--196.","paperID":"None"},{"content":"Jiang, Y., Song, J. H. and Rigas, A. High-capacity spatial contextual memory. Psychonomic Bulletin & Review 12, 3 (2005), 524--529.","paperID":"None"},{"content":"Milner, P. M. A model for visual shape recognition. Psychological Review 81, 6 (1974), 521--535.","paperID":"None"},{"content":"Newell, A. and Rosenbloom, P. S. Mechanisms of Skill Acquisition and the Law of Practice. in Cognitive Skills and their Acquisition, Erlbaum, 1981, 1--55.","paperID":"None"},{"content":"Jakob Nielsen, Usability Engineering, Morgan Kaufmann Publishers Inc., San Francisco, CA, 1993","paperID":"529793"},{"content":"Postma, A. and De Haan, E. What Was Where? Memory for Object Locations. Q. J. Exp. Psych. 49A, 1 (1996), 178--199.","paperID":"None"},{"content":"George Robertson , Mary Czerwinski , Kevin Larson , Daniel C. Robbins , David Thiel , Maarten van Dantzich, Data mountain: using spatial memory for document management, Proceedings of the 11th annual ACM symposium on User interface software and technology, p.153-162, November 01-04, 1998, San Francisco, California, USA","paperID":"288596"},{"content":"Joey Scarr , Andy Cockburn , Carl Gutwin , Andrea Bunt, Improving command selection with CommandMaps, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207713"},{"content":"Ben Shneiderman, Designing the user interface (videotape), University of Maryland at College Park, College Park, MD, 1987","paperID":"61961"},{"content":"Steven, G. V. and Allan, R. Mental rotations, a group test of three-dimensional spatial visualization. Perceptual and motor skills 47, 2 (1978), 599--604.","paperID":"None"},{"content":"Susanne Tak , Andy Cockburn , Keith Humm , David Ahlström , Carl Gutwin , Joey Scarr, Improving Window Switching Interfaces, Proceedings of the 12th IFIP TC 13 International Conference on Human-Computer Interaction: Part II, August 24-28, 2009, Uppsala, Sweden","paperID":"1616249"},{"content":"Susanne Tak , Joey Scarr , Carl Gutwin , Andy Cockburn, Supporting window switching with spatially consistent thumbnail zones: design and evaluation, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042088"},{"content":"Wertheimer, M. Laws of organization in perceptual forms. A source book of Gestalt psychology (1999), 71--88.","paperID":"None"}],"abstract":"Relative spatial consistency - that is, the stable arrangement of objects in a 2D presentation - provides several benefits for interactive interfaces. Spatial consistency allows users to develop memory of object locations, reducing the time needed for visual search, and because spatial memory is long lasting and has a large capacity these performance benefits are enduring and scalable. This suggests that spatial consistency could be used as a fundamental principle for the design of interfaces. However, there are many display situations where the standard presentation is altered in some way: e.g., a window is moved to a new location, scaled, or rotated on a mobile or tabletop display. It is not known whether the benefits of spatial organization are robust to these common kinds of view transformation. To assess these effects, we tested user performance with a spatial interface that had been transformed in several ways, including different degrees of translation, rotation, scaling, and perspective change. We found that performance was not strongly affected by the changes, except in the case of large rotations. To demonstrate the value of spatial consistency over existing mechanisms for dealing with view changes, we compared user performance with a spatially-stable presentation (using scaling) with that of a 'reflowing' presentation (widely used in current interfaces). This study showed that spatial stability with scaling dramatically outperforms reflowing. This research provides new evidence of spatial consistency's value in interface design: it is robust to the view transformations that occur in typical environments, and it provides substantial performance advantages over traditional methods.","video":"http://www.youtube.com/embed/FIHtE7cXMRM?rel=0","title":"Testing the robustness and performance of spatially consistent interfaces","filename":"CHI13/p3139","authors":["Joey Scarr","Andy Cockburn","Carl Gutwin","Sylvain Malacria"],"conference":"CHI '13"}