{"paperId":2466268,"citation":[{"content":"Mark Cottman-Fields , Margot Brereton , Jason Wimmer , Paul Roe, Collaborative extension of biodiversity monitoring protocols in the bird watching community, Proceedings of the 13th Participatory Design Conference: Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts, p.111-114, October 06-10, 2014, Windhoek, Namibia","paperID":"2662193"},{"content":"Ann Light , Margot Brereton , Paul Roe, Some Notes on the Design of \"World Machines\", Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838832"}],"reference":[{"content":"Birdlife Australia. 2012. People. http://www.birdlife.org.au/who-we-are/our-organisation/people.","paperID":"None"},{"content":"Dickinson, J., Zuckerberg, B. and Bonter, D. N. 2010. Citizen Science as an Ecological Research Tool: Challenges and Benefits. Annual review of ecology, evolution, and systematics, 41, 1, 149--172, 10.1146/annurev-ecolsys-102209-144636.","paperID":"None"},{"content":"Donnelly, P. 1994. Take My Word for It: Trust in the Context of Birding and Mountaineering. Qualitative Sociology, 17, 3, 215-","paperID":"None"},{"content":"Gaver, W. 2006. Learning from Experience: The Humble Role of Theory in Practice-Based Research. In Proceedings of the CHI 2006 Workshop on Theory and Methods for Experience-Centered Design, Quebec, Canada, ACM.","paperID":"None"},{"content":"Hilary Hutchinson , Wendy Mackay , Bo Westerlund , Benjamin B. Bederson , Allison Druin , Catherine Plaisant , Michel Beaudouin-Lafon , Stéphane Conversy , Helen Evans , Heiko Hansen , Nicolas Roussel , Björn Eiderbäck, Technology probes: inspiring design for and with families, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642616"},{"content":"Jeff Kanipe, Modeling the astronomical, Communications of the ACM, v.53 n.5, May 2010","paperID":"1735230"},{"content":"Khatib, F., DiMaio, F., Cooper, S., Kazmierczyk, M., Gilski, M., Krzywda, S., Zabranska, H., Pichova, I., Thompson, J. and Popović, Z. 2011. Crystal Structure of a Monomeric Retroviral Protease Solved by Protein Folding Game Players. Nature structural & molecular biology, 18, 10, 1175--1177, 10.1038/nsmb.2119.","paperID":"None"},{"content":"Law, E. L. M., von Ahn, L., Dannenberg, R. and Crawford, M. 2007. Tagatune: A Game for Music and Sound Annotation. Proceedings of The International Society for Music Information Retrieval (Vienna, Austria, 2007).","paperID":"None"},{"content":"McFarlane, B. L. 1994. Specialization and Motivations of Birdwatchers. Wildlife Society Bulletin, 22, 3, 361--370.","paperID":"None"},{"content":"Nathan R. Prestopnik , Kevin Crowston, Citizen science system assemblages: understanding the technologies that support crowdsourced science, Proceedings of the 2012 iConference, p.168-176, February 07-10, 2012, Toronto, Ontario, Canada","paperID":"2132198"},{"content":"Rotman, D., Preece, J., Hammock, J., Procita, K., Hansen, D., Parr, C., Lewis, D. and Jacobs, D. 2012. Dynamic Changes in Motivation in Collaborative Citizen-Science Projects. ACM, 2012.","paperID":"None"},{"content":"Sauer, J. R., Peterjohn, B. G. and Link, W. A. 1994. Observer Differences in the North American Breeding Bird Survey. The Auk, 50--62.","paperID":"None"},{"content":"Sloane, P. 2011. A Guide to Open Innovation and Crowdsourcing: Advice from Leading Experts. Kogan Page Ltd.","paperID":"None"},{"content":"Derek Tingle , Youngmoo E. Kim , Douglas Turnbull, Exploring automatic music annotation with \"acoustically-objective\" tags, Proceedings of the international conference on Multimedia information retrieval, March 29-31, 2010, Philadelphia, Pennsylvania, USA","paperID":"1743400"},{"content":"Truskinger, A. M., Yang, H., Wimmer, J., Zhang, J., Williamson, I. and Roe, P. 2011. Large Scale Participatory Acoustic Sensor Data Analysis: Tools and Reputation Models to Enhance Effectiveness. IEEE Computer Society, Stockholm, Sweden, 2011.","paperID":"None"},{"content":"U. S. Fish & Wildlife Service. 2006. 2006 National Survey of Fishing, Hunting, and Wildlife-Associated Recreation. 2006.","paperID":"None"},{"content":"Andrea Wiggins, eBirding: technology adoption and the transformation of leisure into science, Proceedings of the 2011 iConference, p.798-799, February 08-11, 2011, Seattle, Washington","paperID":"1940910"},{"content":"Wimmer, J., Towsey, M., Planitz, B., Roe, P. and Williamson, I. 2010. Scaling Acoustic Data Analysis through Collaboration and Automation. IEEE, Brisbane, Australia, 2010.","paperID":"None"}],"abstract":"This paper investigates engaging experienced birders, as volunteer citizen scientists, to analyze large recorded audio datasets gathered through environmental acoustic monitoring. Although audio data is straightforward to gather, automated analysis remains a challenging task; the existing expertise, local knowledge and motivation of the birder community can complement computational approaches and provide distinct benefits. We explored both the culture and practice of birders, and paradigms for interacting with recorded audio data. A variety of candidate design elements were tested with birders.This study contributes an understanding of how virtual interactions and practices can be developed to complement existing practices of experienced birders in the physical world. In so doing this study contributes a new approach to engagement in e-science. Whereas most citizen science projects task lay participants with discrete real world or artificial activities, sometimes using extrinsic motivators, this approach builds on existing intrinsically satisfying practices.","video":"http://www.youtube.com/embed/TuiU5YaQtuw?rel=0","title":"Virtual birding: extending an environmental pastime into the virtual world for citizen science","filename":"CHI13/p2029","authors":["Mark Cottman-Fields","Margot Brereton","Paul Roe"],"conference":"CHI '13"}