{"paperId":2466258,"citation":[],"reference":[{"content":"Marion Buchenau , Jane Fulton Suri, Experience prototyping, Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques, p.424-433, August 17-19, 2000, New York City, New York, USA","paperID":"347802"},{"content":"Bill Buxton, Sketching User Experiences: Getting the Design Right and the Right Design, Morgan Kaufmann Publishers Inc., San Francisco, CA, 2007","paperID":"1526229"},{"content":"Alan Cooper, About Face 3.0: The Essentials of Interaction Design, John Wiley & Sons, Inc., New York, NY, 2007","paperID":"1207736"},{"content":"IDEO. IDEO Method Cards: 51 Ways to Inspire Design. W. Stout Architectural, San Francisco, 2003.","paperID":"None"},{"content":"Johnson, B. D. Science Fiction Prototyping: Designing the Future with Science Fiction. SynthesisLectures on Computer Science 3, 1 (2011), 1--190.","paperID":"None"},{"content":"Finn Kensing , Kim Halskov Madsen, Generating visions: future workshops and metaphorical design, Design at work: cooperative design of computer systems, L. Erlbaum Associates Inc., Hillsdale, NJ, 1992","paperID":"125433"},{"content":"Lameijer, E.-W. How to get one thousand ideas - or, the Pauling Principle. The Science Talent Project, nature.com, 2011.","paperID":"None"},{"content":"Bill Moggridge, Designing Interactions, The MIT Press, 2006","paperID":"1196347"},{"content":"Antti Oulasvirta , Esko Kurvinen , Tomi Kankainen, Understanding contexts by being there: case studies in bodystorming, Personal and Ubiquitous Computing, v.7 n.2, p.125-134, July 2003","paperID":"950501"},{"content":"Tischler, L. Seven Secrets to Good Brainstorming. Fast Company Magazine, 2001. www.fastcompany.com/articles/2001/03/kelley.html.","paperID":"None"}],"abstract":"Generating potential design ideas through ideation often benefits from the spontaneity of random ideas. Having potential users participate in this process can be beneficial, but is often difficult to implement. We present a new method for generating design ideas with potential users. The method uses scenarios with missing words, which potential users fill in to generate ideas for features and attributes of new technology designs, similar to the children's game of Mad Libs. We developed three different formats of DesignLibs, including 1) \"Mad Libs-style\": blanks presented before seeing the scenario, 2) \"Fill-in-the-Blanks\": blanks presented within the context of the scenario, and 3) \"Q&A\": blanks presented as questions and answers. We found that Design-Libs generated a number of new ideas, with the Fill-in-the-Blanks method providing the highest ratings for usefulness, feasibility, and diversity of answers. All three formats provided equal ratings for creativity.","video":"http://www.youtube.com/embed/7VndQ8esFWU?rel=0","title":"DesignLibs: a scenario-based design method for ideation","filename":"CHI13/p1955","authors":["Jared S. Bauer","Julie A. Kientz"],"conference":"CHI '13"}