{"paperId":2466163,"reference":[{"content":"Altamimi, R., and Skinner, G. A Survey of Active Video Game Literature. Journal of Computer and Information Technology 1, 1 (2012), 20--35.","paperID":"None"},{"content":"Bandura, A. Aggression: A Social Learning Analysis. Englewood Cliffs, N.J: Prentice-Hall (1973).","paperID":"None"},{"content":"Bandura, A. Social Learning Theory. Englewood Cliffs, NJ: Prentice-Hall, (1977).","paperID":"None"},{"content":"Bandura, A. Self-Efficacy Mechanism in Human Agency. American Psychologist 37, 2 (1982), 122--147.","paperID":"None"},{"content":"Bandura, A. Social Foundations of Thought and Action: A Social Cognitive Theory. Englewood Cliffs, NJ: Prentice Hall. (1986).","paperID":"None"},{"content":"Bandura, A. Perceived Self-Efficacy in the Exercise of Personal Agency. The Psychologist: Bulletin of the British Psychological Society 10, (1989), 411--424.","paperID":"None"},{"content":"Bandura, A. Self-Regulation of Motivation Through Anticipatory and Self-Regulatory Mechanisms. In R.A. Dienstbier (Ed.), Perspectives on Motivation: Nebraska Symposium on Motivation 38, (1991), 69--164.","paperID":"None"},{"content":"Bandura, A. Perceived Self-Efficacy in Cognitive Development and Functioning. Educational Psychologist 28, 2 (1993), 117--148","paperID":"None"},{"content":"Biddiss, E., and Irwin, J. Active Video Games to Promote Physical Activity in Children and Youth. Arch Pediatr Med 164, 7 (2010), 664--672.","paperID":"None"},{"content":"Fabio Buttussi , Luca Chittaro, Smarter Phones for Healthier Lifestyles: An Adaptive Fitness Game, IEEE Pervasive Computing, v.9 n.4, p.51-57, October 2010","paperID":"1907784"},{"content":"Taj Campbell , Brian Ngo , James Fogarty, Game design principles in everyday fitness applications, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460603"},{"content":"Sunny Consolvo , Katherine Everitt , Ian Smith , James A. Landay, Design requirements for technologies that encourage physical activity, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124840"},{"content":"Currie, C., Zanoti, C., Morgan, A., Currie, D., de Looze, M., Roberts, C., Samdal, O., Smith, O., Barnekow, V. Social determinants of health and well-being among young people. HBSC international report from the 2009/2010 Survey. Health Policy for Children and Adolescents No. 6, WHO Regional Office for Europe, Denmark. (2012).","paperID":"None"},{"content":"Daley, A. J. Can exergaming contribute to improving physical activity levels and health outcomes in children? Pediatrics 124, 2 (2009), 763--71.","paperID":"None"},{"content":"Dept. of Health, Physical Activity, Health Improvement and Protection. Start Active, Stay Active: A report on physical activity for health from the four home countries' Chief Medical Officers. London (2011).","paperID":"None"},{"content":"Dzewaltowski, D. A., Noble, J. M. and Shaw, J. M. Physical Activity Participation: Social Cognitive Theory Versus the Theories of Reasoned Action and Planned Behaviour. Journal of Sport and Exercise Psychology 12, 4 (1990), 388--405.","paperID":"None"},{"content":"Eiriksdottir, E., et al. Assessing Health Games in Secondary Schools. An Investigation of the American Horsepower Challenge 2009-2010. Georgia Institute of Technology Technical Report. Atlanta. (2011).","paperID":"None"},{"content":"Leech, N. L., & Onwuegbuzie, A. J. A typology of mixed methods research designs. Quality and Quantity, 43, (2007). 265--275.","paperID":"None"},{"content":"Lenhart, A. and Kahn, J. Teens, video games, and civics. Pew Internet and American Life Project (2008). Retrieved 23/12/11 http://www.pewinternet.org/Reports/2008/Teens-Video-Games-and-Civics.aspx","paperID":"None"},{"content":"James J. Lin , Lena Mamykina , Silvia Lindtner , Gregory Delajoux , Henry B. Strub, Fish'n'Steps: encouraging physical activity with an interactive computer game, Proceedings of the 8th international conference on Ubiquitous Computing, p.261-278, September 17-21, 2006, Orange County, CA","paperID":"2166299"},{"content":"Locke, E. A. and Latham, G. P. A Theory of Goal Setting and Task Performance. Englewood Cliffs, NJ: Prentice Hall (1990).","paperID":"None"},{"content":"Locke, E. A. and Latham, G. P. Building a practically useful theory of goal setting and task motivation: A 35year odyssey. American Psychologist 57, 9 (2002).","paperID":"None"},{"content":"Andrew P. Macvean, Developing adaptive exergames for adolescent children, Proceedings of the 11th International Conference on Interaction Design and Children, June 12-15, 2012, Bremen, Germany","paperID":"2307162"},{"content":"Andrew Macvean , Judy Robertson, iFitQuest: a school based study of a mobile location-aware exergame for adolescents, Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services, September 21-24, 2012, San Francisco, California, USA","paperID":"2371630"},{"content":"Nicholls, J. G. Achievement Motivation: Conceptions of Ability, Subjective Experience, Task Choice and Performance. Psychological Review 91, 3 (1984) 328--346.","paperID":"None"},{"content":"Philippaerts, R., Matton, L., Wijndaele, K., De Bourdeaudhuij, I., Taks, M., Lefevre, J. Reliability and validity of a computer-assisted physical activity questionnaire for 12- to 18-year old boys and girls. 8th Annual Congress European College of Sport (2003).","paperID":"None"},{"content":"Erika Shehan Poole , Andrew D. Miller , Yan Xu , Elsa Eiriksdottir , Richard Catrambone , Elizabeth D. Mynatt, The place for ubiquitous computing in schools: lessons learned from a school-based intervention for youth physical activity, Proceedings of the 13th international conference on Ubiquitous computing, September 17-21, 2011, Beijing, China","paperID":"2030165"},{"content":"Ryan, R. M. and Deci, E. L. Intrinsic and Extrinsic Motivations: Classic Definitions and New Directions. Contemporary Educational Psychology 25, (2000), 54--67.","paperID":"None"},{"content":"Song, H., Peng, W. and Lee, K. M. Promoting Exercise Self-Efficacy With an Exergame. Journal of Health Communications 16, 2 (2011), 148--162.","paperID":"None"},{"content":"Staiano, A. E., Abraham, A. A., and Calvert, S. L. Adolescent Exergame Play for Weight Loss and Psychosocial Improvement: A Controlled Physical Activity Intervention. Obesity Journal (2012).","paperID":"None"},{"content":"Strecher, V. J., McEvoy, B., Becker, M. H. and Rosenstock, I. M. The Role of Self-Efficacy in Achieving Health Behaviour Change. Health Education Quarterly 13, 1 (1986), 73--91.","paperID":"None"},{"content":"Tammy Toscos , Anne Faber , Shunying An , Mona Praful Gandhi, Chick clique: persuasive technology to motivate teenage girls to exercise, CHI '06 Extended Abstracts on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1125805"},{"content":"Yin, R. Case Study Research: Design and Methods (4th Edition). Sage Publication Inc (2008).","paperID":"None"}],"citation":[{"content":"Yeoreum Lee , Youn-kyung Lim, Understanding the Roles and Influences of Mediators from Multiple Social Channels for Health Behavior Change, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2685032"},{"content":"Yu Chen , Pearl Pu, HealthyTogether: exploring social incentives for mobile fitness applications, Proceedings of the Second International Symposium of Chinese CHI, p.25-34, April 26-27, 2014, Toronto, Ontario, Canada","paperID":"2592240"},{"content":"Andrew D. Miller , Elizabeth D. Mynatt, StepStream: a school-based pervasive social fitness system for everyday adolescent health, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557190"},{"content":"Amanda Lazar , Christian Koehler , Joshua Tanenbaum , David H. Nguyen, Why we use and abandon smart devices, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2804288"},{"content":"John Rooksby , Mattias Rost , Alistair Morrison , Matthew Chalmers, Pass the Ball: Enforced Turn-Taking in Activity Tracking, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702577"},{"content":"Pascal Landry , Narcis Pares, Controlling and modulating physical activity through Interaction Tempo in exergames: A quantitative empirical analysis, Journal of Ambient Intelligence and Smart Environments, v.6 n.3, p.277-294, May 2014","paperID":"2637610"},{"content":"Designing concurrent full-body gestures for intense gameplay, International Journal of Human-Computer Studies, v.80 n.C, p.1-13, August 2015","paperID":"2777907"},{"content":"Farnaz Irannejad Bisafar , Andrea Grimes Parker, Confidence & Control: Examining Adolescent Preferences for Technologies that Promote Wellness, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820028"},{"content":"Frank X. Chen , Abby C. King , Eric B. Hekler, \"healthifying\" exergames: improving health outcomes through intentional priming, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557246"},{"content":"Stuart Gray , Judy Robertson , Gnanathusharan Rajendran, BrainQuest: an active smart phone game to enhance executive function, Proceedings of the 14th International Conference on Interaction Design and Children, p.59-68, June 21-24, 2015, Boston, Massachusetts","paperID":"2771846"},{"content":"Expanding exertion gaming, International Journal of Human-Computer Studies, v.90 n.C, p.1-13, June 2016","paperID":"2928258"}],"abstract":"Effective exergames should increase the proportion of time users regularly spend in moderate to vigorous physical activity. There are currently few studies of exergame systems which evaluate the impact on physical activity over time. Those which do, show increases in light intensity exercise which although valuable, do not increase the proportion of moderate to vigorous activity required for optimal health benefits. Furthermore, longitudinal studies to date have encountered a plateau effect in physical activity as the novelty of the game wears off. This paper suggests how exergame designs based on deeper understandings of player motivations could address these problems.We report on longitudinal patterns of users' physical activity, motivations and behaviour when using exergames, based on case studies from a seven week long school based field trial. These new insights, interpreted through Bandura's theory of self efficacy, are of value to designers in the HCI community who wish to motivate users with a range of attitudes towards exercise to undertake regular moderate to vigorous physical activity.","video":"http://www.youtube.com/embed/VUEIpfFum1Y?rel=0","title":"Understanding exergame users' physical activity, motivation and behavior over time","filename":"CHI13/p1251","authors":["Andrew Macvean","Judy Robertson"],"conference":"CHI '13"}