{"paperId":2466143,"citation":[{"content":"Simon Ismair , Julie Wagner , Ted Selker , Andreas Butz, MIME: Teaching Mid-Air Pose-Command Mappings, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, August 24-27, 2015, Copenhagen, Denmark","paperID":"2785854"},{"content":"Julie Wagner , Eric Lecolinet , Ted Selker, Multi-finger chords for hand-held tablets: recognizable and memorable, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2556958"},{"content":"Carl Gutwin , Andy Cockburn , Benjamin Lafreniere, Testing the rehearsal hypothesis with two FastTap interfaces, Proceedings of the 41st Graphics Interface Conference, June 03-05, 2015, Halifax, Nova Scotia, Canada","paperID":"2788930"},{"content":"William Delamare , Céline Coutrix , Laurence Nigay, Designing guiding systems for gesture-based interaction, Proceedings of the 7th ACM SIGCHI Symposium on Engineering Interactive Computing Systems, June 23-26, 2015, Duisburg, Germany","paperID":"2774847"},{"content":"Fraser Anderson , Tovi Grossman , Justin Matejka , George Fitzmaurice, YouMove: enhancing movement training with an augmented reality mirror, Proceedings of the 26th annual ACM symposium on User interface software and technology, October 08-11, 2013, St. Andrews, Scotland, United Kingdom","paperID":"2502045"},{"content":"Huawei Tu , Xiangshi Ren , Shumin Zhai, Differences and Similarities between Finger and Pen Stroke Gestures on Stationary and Mobile devices, ACM Transactions on Computer-Human Interaction (TOCHI), v.22 n.5, p.1-39, August 2015","paperID":"2797138"},{"content":"Andy Cockburn , Carl Gutwin , Joey Scarr , Sylvain Malacria, Supporting Novice to Expert Transitions in User Interfaces, ACM Computing Surveys (CSUR), v.47 n.2, p.1-36, December 2014","paperID":"2659796"}],"abstract":"Gesture-based interfaces are becoming more prevalent and complex, requiring non-trivial learning of gesture sets. Many methods for learning gestures have been proposed, but they are often evaluated with short-term recall tests that measure user performance, rather than learning. We evaluated four types of gesture guides using a retention and transfer paradigm common in motor learning experiments and found results different from those typically reported with recall tests. The results indicate that many guide systems with higher levels of guidance exhibit high performance benefits while the guide is being used, but are ultimately detrimental to user learning. We propose an adaptive guide that does not suffer from these drawbacks, and that enables a smooth transition from novice to expert. The results contrasting learning and performance can be explained by the guidance hypothesis. They have important implications for the design and evaluation of future gesture learning systems.","video":"http://www.youtube.com/embed/rYqm9jjR0QY?rel=0","title":"Learning and performance with gesture guides","filename":"CHI13/p1109","authors":["Fraser Anderson","Walter F. Bischof"],"conference":"CHI '13","reference":[{"content":"Albaret, J. M. and Thon, B. Differential effects of task complexity on contextual interference in a drawing task. Acta Psychologia, 100(1-2), 1998, pp. 9--24.","paperID":"None"},{"content":"Caroline Appert , Olivier Bau, Scale detection for a priori gesture recognition, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753456"},{"content":"Caroline Appert , Shumin Zhai, Using strokes as command shortcuts: cognitive benefits and toolkit support, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1519052"},{"content":"Olivier Bau , Wendy E. Mackay, OctoPocus: a dynamic guide for learning gesture-based command sets, Proceedings of the 21st annual ACM symposium on User interface software and technology, October 19-22, 2008, Monterey, CA, USA","paperID":"1449724"},{"content":"Mike Bennett , Kevin McCarthy , Sile O'Modhrain , Barry Smyth, Simpleflow: enhancing gestural interaction with gesture prediction, abbreviation and autocompletion, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042113"},{"content":"Andrew Bragdon , Arman Uguray , Daniel Wigdor , Stylianos Anagnostopoulos , Robert Zeleznik , Rutledge Feman, Gesture play: motivating online gesture learning with fun, positive reinforcement and physical metaphors, ACM International Conference on Interactive Tabletops and Surfaces, November 07-10, 2010, Saarbrücken, Germany","paperID":"1936661"},{"content":"Andrew Bragdon , Robert Zeleznik , Brian Williamson , Timothy Miller , Joseph J. LaViola, Jr., GestureBar: improving the approachability of gesture-based interfaces, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1519050"},{"content":"Brydges, R., Carnahan, H., Backstein D. and Dubrowski, A. Application of Motor Learning Principles to Complex Surgical Tasks: Searching for the Optimal Practice Schedule. Journal of Motor Behavior, 39(1), 2007, pp. 40--48.","paperID":"None"},{"content":"Xiang Cao , Shumin Zhai, Modeling human performance of pen stroke gestures, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240850"},{"content":"Chapman, C. S., Gallivan, J. P., Wood, D. W., Milne, J. L., Culham, J. C. and Goodale, M. A. Reaching for the unknown: Multiple target encoding and real-time decision-making in a rapid reach task. Cognition, 2010, 116(2), pp. 168--176.","paperID":"None"},{"content":"Andy Cockburn , Per Ola Kristensson , Jason Alexander , Shumin Zhai, Hard lessons: effort-inducing interfaces benefit spatial learning, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240863"},{"content":"Fitts, P. M. and Posner, M. I. Human Performance. Brooks and Cole, Oxford, England, 1967.","paperID":"None"},{"content":"Dustin Freeman , Hrvoje Benko , Meredith Ringel Morris , Daniel Wigdor, ShadowGuides: visualizations for in-situ learning of multi-touch and whole-hand gestures, Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces, November 23-25, 2009, Banff, Alberta, Canada","paperID":"1731935"},{"content":"Tovi Grossman , Pierre Dragicevic , Ravin Balakrishnan, Strategies for accelerating on-line learning of hotkeys, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240865"},{"content":"Helsen, W. F., Hodges, N. J., Van Winckel, J. and Starkes, J. L. The roles of talent, physical precocity and practive in the development of soccer expertise. Journal of Sports Sciences, 18(9), 2000, pp. 727--736.","paperID":"None"},{"content":"P. O. Kristensson , L. C. Denby, Continuous recognition and visualization of pen strokes and touch-screen gestures, Proceedings of the Eighth Eurographics Symposium on Sketch-Based Interfaces and Modeling, August 05-07, 2011, Vancouver, British Columbia, Canada","paperID":"2021181"},{"content":"Per-Ola Kristensson , Shumin Zhai, SHARK2: a large vocabulary shorthand writing system for pen-based computers, Proceedings of the 17th annual ACM symposium on User interface software and technology, October 24-27, 2004, Santa Fe, NM, USA","paperID":"1029640"},{"content":"Gordon P. Kurtenbach , Abigail J. Sellen , William A. S. Buxton, An empirical evaluation of some articulatory and cognitive aspects of marking menus, Human-Computer Interaction, v.8 n.1, p.1-23, March 1993","paperID":"1461839"},{"content":"Kurtenbach, G., Moran, T. P., and Buxton, W. Contextual animation of gestural commands. Computer Graphics Forum, 13(5), 1994, pp. 305--314.","paperID":"None"},{"content":"Lai, Q. and Shea, C. H. The role of reduced frequency of knowledge of results during constant practice. Research Quarterly for Exercise and Sport, 70, 1999, pp. 33--40.","paperID":"None"},{"content":"G. Julian Lepinski , Tovi Grossman , George Fitzmaurice, The design and evaluation of multitouch marking menus, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753663"},{"content":"Oldfield, R. C. The assessment and analysis of handedness: The Edinburgh inventory. Neuropsychologia, 9(1), 1971, pp. 97--113.","paperID":"None"},{"content":"Tom Ouyang , Yang Li, Bootstrapping personal gesture shortcuts with the wisdom of the crowd and handwriting recognition, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208695"},{"content":"Park, J., Shea, C. H. and Wright, D. L. Reduced frequency concurrent and terminal feedback: A test of the guidance hypothesis. Journal of Motor Behavior, 32, 2000, pp. 278--296.","paperID":"None"},{"content":"Panzer S., Krueger, M., Muehlbauer, T. and Shea, C. H. Asymmetric effector transfer of complex movement sequences. Human Movement Science, 2010 29(1), pp. 62--72.","paperID":"None"},{"content":"Noel Rappin , Mark Guzdial , Matthew Realff , Pete Ludovice, Balancing usability and learning in an interface, Proceedings of the ACM SIGCHI Conference on Human factors in computing systems, p.479-486, March 22-27, 1997, Atlanta, Georgia, USA","paperID":"258995"},{"content":"Dean Rubine, Specifying gestures by example, Proceedings of the 18th annual conference on Computer graphics and interactive techniques, p.329-337, July 1991","paperID":"122753"},{"content":"Sainburg, R. L. and Wang, J. Interlimb transfer of visuomotor rotations: independence of direction and final position information. Experimental Brain Research, 2002, 145(4), pp. 437--447.","paperID":"None"},{"content":"Savion-Lemieux, T. and Penhune, V. The effects of practice and delay on motor skill learning and retention. Experimental Brain Research, 161(4), 2005, pp. 423--431.","paperID":"None"},{"content":"Schmidt, R. A. Frequent augmented feedback can degrade learning: Evidence and interpretations. In J. Requin and G. E. Stelmach (Eds.), Tutorials in motor neuroscience, 1991, pp. 59--75.","paperID":"None"},{"content":"Schmidt, R. Motor Learning Concepts and Research Methods. In Motor Control and Learning: A Behavioral Emphasis, 2011, pp. 325--346.","paperID":"None"},{"content":"Schmidt, R. A. and Bjork, R. A. New conceptualizations of practice: Common principles in three paradigms suggest new concepts for training. Psychological Science, 3, 1992, pp. 207--217.","paperID":"None"},{"content":"Schmidt, R. A. and Wulf, G. Continuous concurrent feedback degrades skill learning: Implications for training and simulation. Human Factors, 39, 1997, pp. 509--525.","paperID":"None"},{"content":"Schmidt, R. A., Young, D. E., Swinnen, S. and Shapiro, D. E. Summary knowledge of results for skill acquisition: Support for the guidance hypothesis. Journal of Experimental Psychology: Learning, Memory and Cognition, 15, 1989, pp. 352--359.","paperID":"None"},{"content":"Shea, J. B. and Morgan, R. Contextual interference effects on the acquisition, retention, and transfer of a motor skill. Journal of Experimental Psychology: Human Learning and Memory, 5(2), 1979, pp. 179--187.","paperID":"None"},{"content":"Sigrist, R. Rauter, G., Riener, R. and Wolf, P. Augmented visual, auditory, haptic and multimodal feedback in motor learning: A review. Psychonomic Bulletin and Review, 2012, pp. 1--33.","paperID":"None"},{"content":"Christof van Nimwegen , Herre van Oostendorp, Guidance in the interface and transfer of task performance, Proceedings of the 14th European conference on Cognitive ergonomics: invent! explore!, August 28-31, 2007, London, United Kingdom","paperID":"1362596"},{"content":"Winstein, C. J. and Schmidt, R. A. Reduced frequency of knowledge of results enhances motor skill learning. Journal of Experimental Psychology: Learning, Memory and Cognition, 16, 1990, pp. 677--691.","paperID":"None"},{"content":"Wobbrock, J. O., Morris, M. R. and Wilson, A. D. User-defined gestures for surface computing. In Proc. ACM UIST 2003, pp. 193--202.","paperID":"None"},{"content":"Jacob O. Wobbrock , Andrew D. Wilson , Yang Li, Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes, Proceedings of the 20th annual ACM symposium on User interface software and technology, October 07-10, 2007, Newport, Rhode Island, USA","paperID":"1294238"},{"content":"Mary Zajicek, Aspects of HCI research for older people, Universal Access in the Information Society, v.5 n.3, p.279-286, October 2006","paperID":"1178379"},{"content":"Zhai, S. and Kristensson, P. O. Modeling Human Performance of Pen Stroke Gestures. In Proc. ACM CHI 2003, pp. 97--104.","paperID":"None"},{"content":"Shengdong Zhao , Ravin Balakrishnan, Simple vs. compound mark hierarchical marking menus, Proceedings of the 17th annual ACM symposium on User interface software and technology, October 24-27, 2004, Santa Fe, NM, USA","paperID":"1029639"}]}