{"paperId":2466427,"reference":[{"content":"Anderson, J. R. (2007). How can the human mind occur in the physical universe? New York: Oxford University Press.","paperID":"None"},{"content":"Ayres, T. J., Li, L., Schleuning, D., & Young, D. (2001). Preferred time-headway of highway drivers. Proc. of the IEEE Intelligent Transportation Systems Conference.","paperID":"None"},{"content":"Cooper, J. M., et al. (2009). An investigation of driver distraction near the tipping point of traffic flow stability. Human Factors, 51, 261--268.","paperID":"None"},{"content":"Dingus, T. A., et al. (2006). The 100-car naturalistic driving study, phase II--Results of the 100-car field experiment. U.S. Dept. of Transportation Report #DOT-HS-810-593.","paperID":"None"},{"content":"Hidas, P. (2002). Modelling lane changing and merging in microscopic traffic simulation. Trans. Res. Pt. C, 10, 351--371.","paperID":"None"},{"content":"Shamsi T. Iqbal , Eric Horvitz , Yun-Cheng Ju , Ella Mathews, Hang on a sec!: effects of proactive mediation of phone conversations while driving, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979008"},{"content":"Kujala, T. (2012). Browsing the information highway while driving: Three in-vehicle touch screen scrolling methods and distraction. Personal & Ubiquitous Computing, #1617--4909.","paperID":"None"},{"content":"Redelmeier, D. A., & Tibshirani, R. J. (1997). Association between cellular-telephone calls and motor vehicle collisions. The New England Journal of Medicine, 336, 453--458.","paperID":"None"},{"content":"Salvucci, D. D. (2006). Modeling driver behavior in a cognitive architecture. Human Factors, 48, 362--380.","paperID":"None"},{"content":"Dario D. Salvucci, Rapid prototyping and evaluation of in-vehicle interfaces, ACM Transactions on Computer-Human Interaction (TOCHI), v.16 n.2, p.1-33, June 2009","paperID":"1534906"},{"content":"Dario D Salvucci , Kristen L Macuga, Predicting the effects of cellular-phone dialing on driver performance, Cognitive Systems Research, v.3 n.1, p.95-102, March, 2002","paperID":"2298874"},{"content":"Strayer, D. L., Watson, J. M., & Drews, F. A. (2011). Cognitive distraction while multitasking in the automobile. In The Psychology of Learning and Motivation 54 (pp. 29--58).","paperID":"None"},{"content":"Sugiyama, Y., et al. (2008). Traffic jams without bottlenecks- experimental evidence for the physical mechanism of the formation of a jam. New Journal of Physics, 10, #033001.","paperID":"None"},{"content":"van Winsum, W. (1999). The human element in car following models. Trans. Res. Pt. F, 2, 207--211.","paperID":"None"}],"abstract":"Recent studies of driver distraction have reported a number of detrimental effects of in-vehicle interaction on driver performance. This paper examines and predicts the potential effects of such interaction on other vehicles around the driver's vehicle. Specifically, the paper describes how computational cognitive models can be used to predict the complex interactions among several vehicles driving in a line when one or more of the vehicles' drivers are performing a secondary task (phone dialing). The results of simulating two distinct car-following scenarios illustrate that in-vehicle interaction by one driver can have significant downstream effects on other drivers, especially with respect to speed deviations relative to a lead vehicle. This work generalizes recent work developing computational evaluation tools for user interfaces in complex domains, and further serves as an example of how user interaction in some domains can have broader effects on the community at large.","video":"http://www.youtube.com/embed/Sb2CYrZ1m9s?rel=0","citation":[{"content":"Nicolas Louveton , Roderick McCall , Tigran Avanesov , Vincent Koenig , Thomas Engel, Assessing in-vehicle information systems application in the car: a versatile tool and unified testing platform, Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, October 28-30, 2013, Eindhoven, Netherlands","paperID":"2516576"}],"title":"Distraction beyond the driver: predicting the effects of in-vehicle interaction on surrounding traffic","filename":"CHI13/p3131","authors":["Dario D. Salvucci"],"conference":"CHI '13"}