{"paperId":2466263,"citation":[{"content":"Syed Ishtiaque Ahmed , Steven J. Jackson , Maruf Zaber , Mehrab Bin Morshed , Md. Habibullah Bin Ismail , Sharmin Afrose, Ecologies of use and design: individual and social practices of mobile phone use within low-literate rickshawpuller communities in urban Bangladesh, Proceedings of the 4th Annual Symposium on Computing for Development, December 06-07, 2013, Cape Town, South Africa","paperID":"2537066"},{"content":"Nimmi Rangaswamy , Melissa Densmore, Understanding Jugaad: ICTD and the tensions of appropriation, innovation and utility, Proceedings of the Sixth International Conference on Information and Communications Technologies and Development: Notes, p.120-123, December 07-10, 2013, Cape Town, South Africa","paperID":"2517938"},{"content":"Neha Kumar , Richard J. Anderson, Mobile Phones for Maternal Health in Rural India, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702258"},{"content":"Verena Fuchsberger , Martin Murer , Thomas Meneweger , Manfred Tscheligi, Capturing the in-between of interactive artifacts and users: a materiality-centered approach, Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational, p.451-460, October 26-30, 2014, Helsinki, Finland","paperID":"2639219"},{"content":"Aditya Vashistha , Erin Brady , William Thies , Edward Cutrell, Educational Content Creation and Sharing by Low-Income Visually Impaired People in India, Proceedings of the Fifth ACM Symposium on Computing for Development, December 05-06, 2014, San Jose, California, USA","paperID":"2674385"}],"reference":[{"content":"Callon, M. 1986. Some Elements of a Sociology of Translation: Domestication of the Scallops and the Fishermen of St Brieuc Bay. Pp. 196--233 in Power, Action and Belief: A New Sociology of Knowledge, edited by John Law. London: Routledge & Kegan Paul.","paperID":"None"},{"content":"Sundaram, R. 2010. Pirate Modernity: Delhi's Media Urbanism. Routledge.","paperID":"None"},{"content":"Manuel, P. 1993. Cassette Culture: Popular Music and Technology in North India. University of Chicago Press.","paperID":"None"},{"content":"Media Piracy in Emerging Economies, ed. Joe Karaganis (Social Science Research Council, 2011).","paperID":"None"},{"content":"Liang, L. 2005. Porous Legalities and Avenues of Participation. Sarai Reader 5: Bare Acts.","paperID":"None"},{"content":"Larkin, B. 2008. Signal & Noise: Media, Infrastructure and Urban Culture in Nigeria. Duke University Press.","paperID":"None"},{"content":"Latour, B. 1988. The Pasteurization of France. Harvard University Press, Cambridge Mass., USA.","paperID":"None"},{"content":"Latour, B. 2005. Reassembling the Social: An Introduction to Actor-Network-Theory. Oxford University Press.","paperID":"None"},{"content":"Ilahiane, H. and Sherry, J. 2008. Joutia: street vendor entrepreneurship and the informal economy of information and communication technologies in Morocco. The Journal of North African Studies. 13:2.","paperID":"None"},{"content":"Fountain, R. 1999. Knowledge: Theory of science.","paperID":"None"},{"content":"Monteiro, E. 2000. Actor-network theory. In Ciborra, C. (Ed.), From control to drift: The dynamics of corporate information infrastructure (pp. 71--83). Oxford: Oxford University Press.","paperID":"None"},{"content":"Callon, M. 1991. Techno-economic networks and irreversibility. In Law, J. (Ed.), A sociology of monsters: Essays on power, technology and domination. Sociological Review Monograph, 38.","paperID":"None"},{"content":"Law, J. 2008. Actor-Network Theory and Material Semiotics. In Turner, B.S. (Ed.), The New Blackwell Companion to Social Theory (pp. 141--158), Oxford: Blackwell.","paperID":"None"},{"content":"Kraal, B. J., Popovic, V., Chamorro-Koc, M. and Blackler, A. L. An actor-network research frame for analysing complex socio-technical situations. In 4th World Conference on Design Research, IASDR 2011.","paperID":"None"},{"content":"Jakob Tholander , Maria Normark , Chiara Rossitto, Understanding agency in interaction design materials, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208417"},{"content":"Johannes Gärtner , Ina Wagner, Mapping actors and agendas: political frameworks of systems design and participation, Human-Computer Interaction, v.11 n.3, p.187-214, September 1996","paperID":"1462960"},{"content":"Rogerio Abreu De Paula , Gerhard Fischer, The construction of usefulness: how users and context create meaning with a social networking system, University of Colorado at Boulder, Boulder, CO, 2004","paperID":"1087080"},{"content":"Taylor, A. S. Out There. In Proc. CHI 2011.","paperID":"None"},{"content":"Hanseth, O., Aanestad, M. and Berg, M. 2004. Actor-network theory and information systems. What's so special? Information Technology & People 17:116--123.","paperID":"None"},{"content":"Kocaballi, A. B. 2010. Towards Agency Sensitive Design, Participatory Design Conference, Doctoral Consortium, Sydney.","paperID":"None"},{"content":"Burrell, J. 2012. Invisible Users: Youth in the Internet Cafes of Urban Ghana. MIT Press.","paperID":"None"},{"content":"Heather Horst , Daniel Miller, The Cell Phone: An Anthropology of Communication, Berg Publishers, Incorporated, 2006","paperID":"1213375"},{"content":"Miller, D. and Slater, D. 2000. The Internet: An Ethnographic Approach. New York: Berg Publications.","paperID":"None"},{"content":"Beth E. Kolka , Cynthia Putnam, Computer games in the developing world: the value of non-instrumental engagement with ICTs, or taking play seriously, Proceedings of the 3rd international conference on Information and communication technologies and development, April 17-19, 2009, Doha, Qatar","paperID":"1812536"},{"content":"Nimmi Rangaswamy , Edward Cutrell, Anthropology, development and ICTs: slums, youth and the mobile internet in urban India, Proceedings of the Fifth International Conference on Information and Communication Technologies and Development, March 12-15, 2012, Atlanta, Georgia","paperID":"2160685"},{"content":"Thomas N. Smyth , Satish Kumar , Indrani Medhi , Kentaro Toyama, Where there's a will there's a way: mobile media sharing in urban india, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753436"},{"content":"Neha Kumar , Gopal Chouhan , Tapan Parikh, Folk music goes digital in India, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979151"},{"content":"Granovetter, M. 1983. \"The Strength of Weak Ties: A Network Theory Revisited\". Sociological Theory 1: 201--233.","paperID":"None"},{"content":"Whittle, A. and Spicer, A. Is actor network theory critique? Organization Studies, 2008(29), 611--629.","paperID":"None"},{"content":"Gell. 1998. Art and Agency: An Anthropological Theory. Oxford: Clarendon.","paperID":"None"},{"content":"Ahearn, L. 2001. 'Language and Agency', Annual Review of Anthropology 30: 109--137.","paperID":"None"}],"abstract":"Building on a growing body of human-computer interaction (HCI) literature on information and communication technology (ICT) use in the developing world, this paper describes the vast, growing mobile media consumption culture in India, which relies on the ubiquity of informal socioeconomic practices for reproducing, sharing, and distributing pirated digital media. Using an Actor-Network Theory (ANT) based approach, we show how piracy not only fuels media consumption, but also drives further technology adoption and promotes digital literacy. To do this, we first uncover the role of piracy as a legitimate actor that brings ICT capability to underserved communities and reveal the heterogeneous character of the pirated mobile media distribution and consumption infrastructure in India. We then emphasize the benefits of an ANT-based theory-driven analysis to HCI's efforts in this arena. In particular, ANT enables us to one, draw attention to the ties in the pirate media network that facilitate the increased decentralization of piracy in India; two, highlight the progressive transition from the outsourcing to the self-sourcing of users' media needs as this network evolves; and three, recognize the agency of human and non-human entities in this inherently sociotechnical ecosystem.","video":"http://www.youtube.com/embed/RNVODI1jP2Y?rel=0","title":"The mobile media actor-network in urban India","filename":"CHI13/p1989","authors":["Neha Kumar","Nimmi Rangaswamy"],"conference":"CHI '13"}