{"paperId":2466266,"citation":[{"content":"Daniel Martín , Benjamin Frantz , François Pachet, Improving music composition through peer feedback: experiment and preliminary results, Proceedings of the First International Conference on AI and Feedback, p.27-31, July 26, 2015, Buenos Aires, Argentina","paperID":"2907080"}],"reference":[{"content":"February Album Writing Month. http://fawm.org.","paperID":"None"},{"content":"Newgrounds. http://www.newgrounds.com.","paperID":"None"},{"content":"Scratch: Programming for All. http://scratch.mit.edu.","paperID":"None"},{"content":"Adamic, L., and Adar, E. Friends and neighbors on the Web. Social Networks 25, 3 (July 2003), 211--230.","paperID":"None"},{"content":"Alekh Agarwal , Soumen Chakrabarti, Learning random walks to rank nodes in graphs, Proceedings of the 24th international conference on Machine learning, p.9-16, June 20-24, 2007, Corvalis, Oregon","paperID":"1273498"},{"content":"Ancona, D., and Caldwell, D. Demography & design: Predictors of new product team performance. Org. Sci. 3 (1992), 321--341.","paperID":"None"},{"content":"Lars Backstrom , Dan Huttenlocher , Jon Kleinberg , Xiangyang Lan, Group formation in large social networks: membership, growth, and evolution, Proceedings of the 12th ACM SIGKDD international conference on Knowledge discovery and data mining, August 20-23, 2006, Philadelphia, PA, USA","paperID":"1150412"},{"content":"Bantel, K., and Jackson, S. Top management and innovations in banking: Does the composition of the top team make a difference? Strategic Mgmt. J. 10 (1989), 107--124.","paperID":"None"},{"content":"Yochai Benkler, The Wealth of Networks: How Social Production Transforms Markets and Freedom, Yale University Press, New Haven, CT, 2006","paperID":"1214507"},{"content":"Bonacich, P. Some unique properties of eigenvector centrality. Social Networks 29 (2007), 555--564.","paperID":"None"},{"content":"Susan L. Bryant , Andrea Forte , Amy Bruckman, Becoming Wikipedian: transformation of participation in a collaborative online encyclopedia, Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work, November 06-09, 2005, Sanibel Island, Florida, USA","paperID":"1099205"},{"content":"Moira Burke , Burr Settles, Plugged in to the community: social motivators in online goal-setting groups, Proceedings of the 5th International Conference on Communities and Technologies, June 29-July 02, 2011, Brisbane, Australia","paperID":"2103356"},{"content":"Byrne, D. The Attraction Paradigm. Academic, New York, NY, USA, 1971.","paperID":"None"},{"content":"Cattani, G., and Ferriani, S. A core/periphery perspective on individual creative performance: Social networks and cinematic achievements in the Hollywood film industry. Org. Sci. 19, 6 (November 1 2008), 824--844.","paperID":"None"},{"content":"Laku Chidambaram , Lai Lai Tung, Is Out of Sight, Out of Mind? An Empirical Study of Social Loafing in Technology-Supported Groups, Information Systems Research, v.16 n.2, p.149-168, June 2005","paperID":"1075315"},{"content":"Dan Cosley , Dan Frankowski , Loren Terveen , John Riedl, SuggestBot: using intelligent task routing to help people find work in wikipedia, Proceedings of the 12th international conference on Intelligent user interfaces, January 28-31, 2007, Honolulu, Hawaii, USA","paperID":"1216309"},{"content":"Steven Dow , Julie Fortuna , Dan Schwartz , Beth Altringer , Daniel Schwartz , Scott Klemmer, Prototyping dynamics: sharing multiple designs improves exploration, group rapport, and results, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979359"},{"content":"Emerson, R. Social exchange theory. Annu. Review of Psych. 2 (1976), 335--362.","paperID":"None"},{"content":"Faulkner, R., and Anderson, A. Short-term projects and emergent careers: Evidence from Hollywood. Amer. J. Sociology 92, 4 (January 1987), 879--909.","paperID":"None"},{"content":"Tom Fawcett, An introduction to ROC analysis, Pattern Recognition Letters, v.27 n.8, p.861-874, June 2006","paperID":"1159475"},{"content":"Feld, S. The focused organization of social ties. Amer. J. Sociology 86, 5 (March 1981), 1015--1035.","paperID":"None"},{"content":"Frushtick, R. Spoilers! Zork 'Walkthrough' rocks out. MTV Multiplayer (September 30, 2009). New York, NY: MTV. http://on.mtv.com/1rQiu.","paperID":"None"},{"content":"Daniel Fuller , Brian Magerko, Shared mental models in improvisational theatre, Proceedings of the 8th ACM conference on Creativity and cognition, November 03-06, 2011, Atlanta, Georgia, USA","paperID":"2069663"},{"content":"Gruenfeld, D., Mannix, E., Williams, K., and Neale, M. Group composition and decision-making: How member familiarity and information distribution affect process and performance. Org. Behavior and Human Decision Processes 67 (1996), 1--15.","paperID":"None"},{"content":"Hoffman, L., and Maier, N. Quality and acceptance of problem solutions by members of homogeneous and heterogeneous groups. J. Abnormal and Social Psych. 62 (1961), 401--407.","paperID":"None"},{"content":"Hogg, M. A., and Turner, J. C. Interpersonal attraction, social identification and psychological group formation. European J. Social Psych. 15 (1985), 51--66.","paperID":"None"},{"content":"Yun Huang , Mengxiao Zhu , Jing Wang , Nishith Pathak , Cuihua Shen , Brian Keegan , Dmitri Williams , Noshir Contractor, The Formation of Task-Oriented Groups: Exploring Combat Activities in Online Games, Proceedings of the 2009 International Conference on Computational Science and Engineering, p.122-127, August 29-31, 2009","paperID":"1633758"},{"content":"Yehuda Koren , Robert Bell , Chris Volinsky, Matrix Factorization Techniques for Recommender Systems, Computer, v.42 n.8, p.30-37, August 2009","paperID":"1608614"},{"content":"Kravitz, D., and Martin, B. Ringelmann rediscovered: The original article. J. Personality and Social Psych. 50, 5 (1986), 936--941.","paperID":"None"},{"content":"Ni Lao , William W. Cohen, Relational retrieval using a combination of path-constrained random walks, Machine Learning, v.81 n.1, p.53-67, October   2010","paperID":"1842823"},{"content":"Ni Lao , Tom Mitchell , William W. Cohen, Random walk inference and learning in a large scale knowledge base, Proceedings of the Conference on Empirical Methods in Natural Language Processing, July 27-31, 2011, Edinburgh, United Kingdom","paperID":"2145494"},{"content":"Lave, J., and Wenger, E. Situated Learning: Legitimate Peripheral Participation. Cambridge University Press, 1991.","paperID":"None"},{"content":"Levine, J., and Resnick, L. Social foundations of cognition. Annu. Review of Psych. 44 (1993), 585--612.","paperID":"None"},{"content":"David Liben-Nowell , Jon Kleinberg, The link prediction problem for social networks, Proceedings of the twelfth international conference on Information and knowledge management, November 03-08, 2003, New Orleans, LA, USA","paperID":"956972"},{"content":"Liden, R. C., Wayne, S. J., Jaworski, R. A., and Bennett, N. Social loafing: A field investigation. J. Mgmt. 30, 2 (2004), 285--285.","paperID":"None"},{"content":"Kurt Luther , Amy Bruckman, Leadership in online creative collaboration, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460619"},{"content":"Kurt Luther , Kelly Caine , Kevin Ziegler , Amy Bruckman, Why it works (when it works): success factors in online creative collaboration, Proceedings of the 16th ACM international conference on Supporting group work, November 07-10, 2010, Sanibel Island, Florida, USA","paperID":"1880073"},{"content":"Christopher D. Manning , Hinrich Schütze, Foundations of statistical natural language processing, MIT Press, Cambridge, MA, 1999","paperID":"311445"},{"content":"Mannix, E., and Neale, M. What differences make a difference? The promise and reality of diverse teams in organizations. Psych. Sci. in the Public Interest 6, 2 (October 2005), 31--55.","paperID":"None"},{"content":"M. L. Markus, Finding a happy medium: explaining the negative effects of electronic communication on social life at work, ACM Transactions on Information Systems (TOIS), v.12 n.2, p.119-149, April 1994","paperID":"196738"},{"content":"McKenna, K., Green, A., and Gleason, M. Relationship formation on the Internet: What's the big attraction? J. Social Issues 58, 1 (2002), 9.","paperID":"None"},{"content":"Mulvey, P. W., and Klein, H. J. The impact of perceived loafing and collective efficacy on group goal processes and group performance. Org. Behavior and Human Decision Processes 74, 1 (1998), 62--87.","paperID":"None"},{"content":"Newcomb, T. Varieties of interpersonal attraction. In Group Dynamics: Research and Theory, D. Cartwright and A. Zander, Eds. Row, Peterson, Evanston, IL, 1960, 104--119.","paperID":"None"},{"content":"O'Reilly, C., Caldwell, D., and Barnett, W. Work group demography, social integration and turnover. Administ. Sci. Quart. 34 (1989), 21--37.","paperID":"None"},{"content":"Page, L., Brin, S., Motwani, R., and Winograd, T. The PageRank citation ranking: Bringing order to the Web. Technical Report 1999--66, Stanford InfoLab, November 1999.","paperID":"None"},{"content":"Ren, Y., Kraut, R., and Kiesler, S. Applying communication identity and bond theory to design of online communities. Org. Studies 28, 3 (March 2007), 377--408.","paperID":"None"},{"content":"Robinson, G., and Dechant, K. Building a business case for diversity. Acad. Mgmt. Executive 11, 3 (1997), 21--31.","paperID":"None"},{"content":"Roschuni, C., Oehlberg, L., Beckman, S., and Agogino, A. Relationship conflict and feeling communication in design teams. In Proc. Int. Design Eng. Tech. Conf. and Comput. and Inform. in Eng. Conf. (IDETC/CIE) (2009), 87626.","paperID":"None"},{"content":"Rose, J. Presidents' songs: Of legends and mortal men. All Things Considered (October 8, 2008). Washington D.C.: National Public Radio. http://n.pr/QyWjPz.","paperID":"None"},{"content":"Salganik, M., Dodds, P., and Watts, D. Experimental study of inequality and unpredictability in an artificial cultural market. Science 311 (2006), 854--856.","paperID":"None"},{"content":"Schon, D. The Reflective Practitioner: How Professionals Think in Action. Ashgate Publishing, 1995.","paperID":"None"},{"content":"Shannon, C. A mathematical theory of communication. Bell Syst. Technical J. 27 (1948), 379--423, 623--656.","paperID":"None"},{"content":"Slavin, R. Cooperative learning. Review of Educational Research 50, 2 (Summer 1980), 315--342.","paperID":"None"},{"content":"Sutton, R., and Hargadon, A. Brainstorming groups in context: Effectiveness in a product design firm. Administ. Sci. Quart. 41 (1996), 685--718.","paperID":"None"},{"content":"Tajfel, H. Social Identity and Intergroup Relations. Cambridge University Press, London, 1982.","paperID":"None"},{"content":"Tibshirani, R. Regression shrinkage and selection via the LASSO. J. Roy. Stat. Soc. Series B (Methodological) 58, 1 (1996), 267--288.","paperID":"None"},{"content":"Triandis, H., Hall, E., and Ewen, R. Member heterogeneity and dyadic creativity. Human Relations 18 (1965), 33--55.","paperID":"None"},{"content":"Van Der Vegt, G., and Bunderson, J. Learning and performance in multidisciplinary teams: The importance of collective team identification. Acad. Mgmt. J. 48, 3 (June 2005), 532--547.","paperID":"None"},{"content":"Walther, J. B. Time effects in computer-mediated, groups: Past, present, and future. In Distributed Work, P. Hinds and S. Kiesler, Eds. MIT Press, Cambridge, MA, 2002, 235--257.","paperID":"None"},{"content":"Josef Wideström , Ann-Sofie Axelsson , Ralph Schroeder , Alexander Nilsson , Ilona Heldal , Åsa Abelin, The collaborative cube puzzle: a comparison of virtual and real environments, Proceedings of the third international conference on Collaborative virtual environments, p.165-171, September 2000, San Francisco, California, USA","paperID":"351035"},{"content":"Mike Wu , Abhishek Ranjan , Khai N. Truong, An exploration of social requirements for exercise group formation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518714"},{"content":"Yuki, M., Maddux, W., Brewer, M., and Takemura, K. Cross-cultural differences in relationship- and group-based trust. Personality and Social Psych. Bulletin 31, 1 (2005), 48--62.","paperID":"None"}],"abstract":"In online creative communities, members work together to produce music, movies, games, and other cultural products. Despite the proliferation of collaboration in these communities, we know little about how these teams form and what leads to their ultimate success. Building on theories of social identity and exchange, we present an exploratory study of an online songwriting community. We analyze four years of longitudinal behavioral data using a novel path-based regression model that accurately predicts and reveals key variables about collab formation. Combined with a large-scale survey of members, we find that communication, nuanced complementary interest and status, and a balanced effort from both parties contribute to successful collaborations. We also discuss several applications of these findings for socio-technical infrastructures that support online creative production.","video":"http://www.youtube.com/embed/dLXsceP65ro?rel=0","title":"Let's get together: the formation and success of online creative collaborations","filename":"CHI13/p2009","authors":["Burr Settles","Steven Dow"],"conference":"CHI '13"}