{"paperId":2466432,"citation":[{"content":"Robert Walter , Gilles Bailly , Nina Valkanova , Jörg Müller, Cuenesics: using mid-air gestures to select items on interactive public displays, Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, September 23-26, 2014, Toronto, ON, Canada","paperID":"2628368"},{"content":"Joey Scarr , Andy Cockburn , Carl Gutwin, Supporting and Exploiting Spatial Memory in User Interfaces, Foundations and Trends in Human-Computer Interaction, v.6 n.1, p.1-84, December 2013","paperID":"2688147"}],"reference":[{"content":"David Ahlström, Modeling and improving selection in cascading pull-down menus using Fitts' law, the steering law and force fields, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 02-07, 2005, Portland, Oregon, USA","paperID":"1054982"},{"content":"Johnny Accot , Shumin Zhai, Beyond Fitts' law: models for trajectory-based HCI tasks, Proceedings of the ACM SIGCHI Conference on Human factors in computing systems, p.295-302, March 22-27, 1997, Atlanta, Georgia, USA","paperID":"258760"},{"content":"Buxton B. Sketching User Experiences, Morgan Kaufmann, 2007.","paperID":"None"},{"content":"J. Callahan , D. Hopkins , M. Weiser , B. Shneiderman, An empirical comparison of pie vs. linear menus, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.95-100, May 15-19, 1988, Washington, D.C., USA","paperID":"57182"},{"content":"Stuart K. Card, User perceptual mechanisms in the search of computer command menus, Proceedings of the 1982 Conference on Human Factors in Computing Systems, p.190-196, March 15-17, 1982, Gaithersburg, Maryland, USA","paperID":"801779"},{"content":"Stuart K. Card , Allen Newell , Thomas P. Moran, The  Psychology of Human-Computer Interaction, L. Erlbaum Associates Inc., Hillsdale, NJ, 1983","paperID":"578027"},{"content":"Charney, D., Reder, L., and Kusbit, G. Goal setting and procedure selection in acquiring computer skills: a comparison of problem solving and learner exploration. Cognition and Instruction, 7(4), 1990, 323--342.","paperID":"None"},{"content":"Andy Cockburn , Carl Gutwin , Saul Greenberg, A predictive model of menu performance, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240723"},{"content":"Jinjuan Feng , Andrew Sears, Beyond errors: measuring reliability for error-prone interaction devices, Behaviour & Information Technology, v.29 n.2, p.149-163, March 2010","paperID":"1805074"},{"content":"Gan, K. C., and Hoffmann, E. R. Geometrical conditions for ballistic and visually controlled movements. In Ergonomics, 31(5), 1988, 829--839.","paperID":"None"},{"content":"Evan D. Graham , Christine L. MacKenzie, Physical versus virtual pointing, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.292-299, April 13-18, 1996, Vancouver, British Columbia, Canada","paperID":"238532"},{"content":"Tovi Grossman , Nicholas Kong , Ravin Balakrishnan, Modeling pointing at targets of arbitrary shapes, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240700"},{"content":"J. G. Hollands , Philip M. Merikle, Menu organization and user expertise in information search tasks, Human Factors, v.29 n.5, p.577-586, Oct. 1987","paperID":"38976"},{"content":"Anthony J. Hornof , David E. Kieras, Cognitive modeling reveals menu search in both random and systematic, Proceedings of the ACM SIGCHI Conference on Human factors in computing systems, p.107-114, March 22-27, 1997, Atlanta, Georgia, USA","paperID":"258621"},{"content":"Anthony J. Hornof, Visual search and mouse-pointing in labeled versus unlabeled two-dimensional visual hierarchies, ACM Transactions on Computer-Human Interaction (TOCHI), v.8 n.3, p.171-197, September 2001","paperID":"502908"},{"content":"Kori M. Inkpen, Drag-and-drop versus point-and-click mouse interaction styles for children, ACM Transactions on Computer-Human Interaction (TOCHI), v.8 n.1, p.1-33, March 2001","paperID":"371146"},{"content":"Victor Kaptelinin, Item recognition in menu selection: the effect of practice, INTERACT '93 and CHI '93 Conference Companion on Human Factors in Computing Systems, p.183-184, April 24-29, 1993, Amsterdam, The Netherlands","paperID":"260196"},{"content":"John I. Kiger, The depth/breadth trade-off in the design of menu-driven user interfaces, International Journal of Man-Machine Studies, v.20 n.2, p.201-213, Feb. 1984","paperID":"222"},{"content":"Masatomo Kobayashi , Takeo Igarashi, Considering the direction of cursor movement for efficient traversal of cascading menus, Proceedings of the 16th annual ACM symposium on User interface software and technology, p.91-94, November 02-05, 2003, Vancouver, Canada","paperID":"964706"},{"content":"Per Ola Kristensson , Shumin Zhai, Command strokes with and without preview: using pen gestures on keyboard for command selection, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240797"},{"content":"Gordon Paul Kurtenbach, The design and evaluation of marking menus, University of Toronto, Toronto, Ont., Canada, 1993","paperID":"193157"},{"content":"Gordon Kurtenbach , William Buxton, The limits of expert performance using hierarchic marking menus, Proceedings of the INTERCHI '93 conference on Human factors in computing systems, p.482-487, May 1993, Amsterdam, The Netherlands","paperID":"164977"},{"content":"Gordon Kurtenbach , William Buxton, User learning and performance with marking menus, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.258-264, April 24-28, 1994, Boston, Massachusetts, USA","paperID":"191759"},{"content":"T. K. Landauer , D. W. Nachbar, Selection from alphabetic and numeric menu trees using a touch screen: breadth, depth, and width, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.73-78, April 1985, San Francisco, California, USA","paperID":"317470"},{"content":"David M. Lane , H. Albert Napier , Richard R. Batsell , John L. Naman, Predicting the skilled use of hierarchical menus with the keystroke-level model, Human-Computer Interaction, v.8 n.2, p.185-192, June 1993","paperID":"1461837"},{"content":"Lee, E. S., and Raymond, D. R. Menu-driven systems. Encyclopedia of Microcomputers, 11, 1993, 101--127.","paperID":"None"},{"content":"I. Scott MacKenzie , Abigail Sellen , William A. S. Buxton, A comparison of input devices in element pointing and dragging tasks, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.161-166, April 27-May 02, 1991, New Orleans, Louisiana, USA","paperID":"108868"},{"content":"I. Scott MacKenzie, Fitts' law as a research and design tool in human-computer interaction, Human-Computer Interaction, v.7 n.1, p.91-139, March 1992","paperID":"1461857"},{"content":"J. Terry Mayes , Stephen W. Draper , Alison M. McGregor , Keith Oatley, Information flow in a user interface: the effect of experience and context on the recall of MacWrite screens, Proceedings of the Fourth Conference of the British Computer Society on People and computers IV, p.275-289, October 1988, Univ. of Manchester, United Kingdom","paperID":"54691"},{"content":"Mcdonald, J. E., Stone, J. D., and Liebelt, L. S. Searching for items in menus: The effects of organization and type of target. Proc. Human Factors Society, 1983, 834--837.","paperID":"None"},{"content":"Norman, K. L., and Chin, J. P. The effect of tree structure on search in a hierarchical menu selection system. J. Behaviour & Information Technology, 7(1), 1988.","paperID":"None"},{"content":"Norman, K. L., and Butler, S. Search by uncertainty: menu selection by target probability. Technical Report from the University of Maryland, 1989.","paperID":"None"},{"content":"Kent L. Norman , Ben Shneiderman, The  Psychology of Menu Selection: Designing Cognitive Control at the Human/Computer Interface, Greenwood Publishing Group Inc., Westport, CT, 1991","paperID":"574380"},{"content":"Oel, P., Schmidt, P., and Schmitt, A. Time Prediction of Mouse-based Cursor Movements. Proc. CHI 2001.","paperID":"None"},{"content":"K R Paap , R J Roske-Hofstrand, The optimal number of menu options per panel, Human Factors, v.28 n.4, p.377-385, Aug. 1986","paperID":"10862"},{"content":"Phillips, J. G., and Triggs, T. J. Characteristics of cursor trajectories controlled by the computer mouse. In Ergonomics, 44(5), 2001, 527--536.","paperID":"None"},{"content":"Philip Quinn , Andy Cockburn, The effects of menu parallelism on visual search and selection, Proceedings of the ninth conference on Australasian user interface, January 01-01, 2008, Wollongong, Australia","paperID":"1378353"},{"content":"Robertson, G., McCracken, D., and Newell, A. The ZOG approach to man-machine communication. Int. Journal of Man-Machine Studies, 14, 1981, 461--488.","paperID":"None"},{"content":"Krystian Samp , Stefan Decker, Supporting menu design with radial layouts, Proceedings of the International Conference on Advanced Visual Interfaces, May 26-28, 2010, Roma, Italy","paperID":"1843021"},{"content":"Krystian Samp , Stefan Decker, Visual search in radial menus, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042309"},{"content":"Krystian Samp , Stefan Decker, Navigation time variability: measuring menu navigation errors, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042094"},{"content":"Samp, K. The Design and Evaluation of Graphical Radial Menus. Ph.D. Thesis, 2011.","paperID":"None"},{"content":"Schmidt, R. A., Zelaznik, H., Hawkins, B., Frank, J. S., Quinn, J. T. Motor-output variability: A theory for the accuracy of rapid motor acts. Psych. Review, 86, 1979.","paperID":"None"},{"content":"Andrew Sears , Ben Shneiderman, Split menus: effectively using selection frequency to organize menus, ACM Transactions on Computer-Human Interaction (TOCHI), v.1 n.1, p.27-51, March 1994","paperID":"174632"},{"content":"Ben Shneiderman , Catherine Plaisant , Maxine Cohen , Steven Jacobs, Designing the User Interface: Strategies for Effective Human-Computer Interaction, Addison-Wesley Publishing Company, 2009","paperID":"1593001"},{"content":"Snowberry, K., Parkinson, S. R., and Sisson, N. Computer display menus. In Ergonomics, 26(7), 1983.","paperID":"None"},{"content":"Benjamin L. Somberg, A comparison of rule-based and positionally constant arrangements of computer menu items, Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface, p.255-260, April 05-09, 1987, Toronto, Ontario, Canada","paperID":"275639"},{"content":"Erum Tanvir , Jonathan Cullen , Pourang Irani , Andy Cockburn, AAMU: adaptive activation area menus for improving selection in cascading pull-down menus, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357270"},{"content":"Thompson, S. G. Effect on movement performance as a function of visual-motor scale and velocity: An investigation of the speed-accuracy tradeoff. PhD Thesis from the University of Louisiana at Monroe, 2007.","paperID":"None"},{"content":"Jo W. Tombaugh , Scott A. McEwen, Comparison of two information retrieval methods on videotex: Tree-structure versus alphabetical directory, Proceedings of the 1982 Conference on Human Factors in Computing Systems, p.106-110, March 15-17, 1982, Gaithersburg, Maryland, USA","paperID":"801764"},{"content":"Treisman, A. Perceptual grouping and attention in visual search for features and for objects. J. Experimental Psych.: Human Perception Performance, 8(2), 1982.","paperID":"None"},{"content":"Walker, N., Meyer, D. E., and Smelcer, J. B. Spatial and temporal characteristics of rapid cursor-positioning movements with electromechanical mice in humancomputer interaction. Human Factors, 35(3), 1993.","paperID":"None"},{"content":"Thomas G. Whisenand , Henry H. Emurian, Analysis of Cursor Movements with a Mouse, Proceedings of the Seventh International Conference on Human-Computer Interaction-Volume 1, p.533-536, August 24-29, 1997","paperID":"741842"},{"content":"Wright, C. E., and Meyer, D. E. Conditions for a linear speed-accuracy trade-off in aimed movements. J. Experimental Psychology, 35A(2), 1983, 279--296.","paperID":"None"},{"content":"Shengdong Zhao , Ravin Balakrishnan, Simple vs. compound mark hierarchical marking menus, Proceedings of the 17th annual ACM symposium on User interface software and technology, October 24-27, 2004, Santa Fe, NM, USA","paperID":"1029639"}],"abstract":"This paper presents a design space for graphical menus. We model the design space as a set of design goals, a set of design characteristics, and connections between the two. The design goals are based on novice and expert behaviors. The connections link the choices for design characteristics with the positive or negative effects that these choices have on the design goals. The paper further synthesizes the design space into a succinct form of structured design recommendations. A case study demonstrates how these recommendations can be used to assess and compare the strengths and weaknesses of two menu designs.","video":"http://www.youtube.com/embed/ap5qX2WrZv4?rel=0","title":"Designing graphical menus for novices and experts: connecting design characteristics with design goals","filename":"CHI13/p3159","authors":["Krystian Samp"],"conference":"CHI '13"}