{"paperId":2466190,"citation":[{"content":"Huawei Tu , Patrick Oladimeji , Yunqiu Li , Harold Thimbleby , Chris Vincent, The Effects of Number-related Factors on Entry Performance, Proceedings of the 28th International BCS Human Computer Interaction Conference on HCI 2014 - Sand, Sea and Sky - Holiday HCI, September 09-12, 2014, Southport, UK","paperID":"2742974"}],"reference":[{"content":"Aviation Safety Network, Accident description: Air Inter Flight 148, aviation-safety.net/database/ record.php?id=19920120-0, 1992.","paperID":"None"},{"content":"Benford, F. The law of anomalous numbers. Proc. American Philosophical Society 78, 4 (1938), 551--572.","paperID":"None"},{"content":"Ellis, N. C., and Hill, S. E. A comparative study of seven segment numerics. Human Factors 20, 6 (1978), 655--660.","paperID":"None"},{"content":"Federal Drug Administration. Possible dosing errors with the OptiClik insulin injection device. FDA Patient Safety News #60 (February 2007).","paperID":"None"},{"content":"Google, Search results for \"new ...,\" first 200 images where displays are visible, www.google.com, Dec 2012.","paperID":"None"},{"content":"Green, P., Goldstein, S., Zeltner, K., and Adams, S., Legibility of text on instrument panels: A literature review, The University of Michigan Transportation Research Institute, UMTRI-88-34 (NTIS No. PB 90 141342/AS), deepblue.lib.umich.edu/handle/2027.42/790, 1988.","paperID":"None"},{"content":"Gunderson, J., Gruetzmacher, G., and Swanson, N. Legibility of seven segment numeric LED displays: Comparisons of two fonts at various distances. In Proc. Human Factors Society 35th Annual Meeting (1991), 491--495.","paperID":"None"},{"content":"Institute of Safe Medication Practices, Error-prone abbreviations symbols dose designations, www.ismp.org/Tools/errorproneabbreviations.pdf, 2010.","paperID":"None"},{"content":"Donald E. Knuth, Digital typography, Center for the Study of Language and Information, Stanford, CA, 1999","paperID":"310691"},{"content":"Knuth, D. E. The Art of Computer Programming, vol. 4A. Addison-Wesley, 2011.","paperID":"None"},{"content":"Miguel Nacenta , Uta Hinrichs , Sheelagh Carpendale, FatFonts: combining the symbolic and visual aspects of numbers, Proceedings of the International Working Conference on Advanced Visual Interfaces, May 21-25, 2012, Capri Island, Italy","paperID":"2254636"},{"content":"Patrick Oladimeji , Harold Thimbleby , Anna Cox, Number entry interfaces and their effects on error detection, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042302"},{"content":"Roche Diagnostics, Accu-Chek Compact Plus® blood glucose meter owner's booklet, www.accu-chek.com, 2006.","paperID":"None"},{"content":"RVS Group, Computer-related incidents with commercial aircraft: The Air Inter A320 accident near Strasbourg, www.rvs.uni-bielefeld.de, 2005.","paperID":"None"},{"content":"Sassoon, R. Computers and Typography. Intellect Books, 1993.","paperID":"None"},{"content":"Harold Thimbleby, Calculators are needlessly bad, International Journal of Human-Computer Studies, v.52 n.6, p.1031-1069, June 2000","paperID":"347893"},{"content":"Thimbleby, H. Interactive numbers - A grand challenge. In Proc. Int. Conf. Interfaces and Human Computer Interaction 2011, K. Blashki, Ed. (2011), xxviii--xxxv.","paperID":"None"},{"content":"Thimbleby, H., and Cairns, P. Reducing number entry errors: Solving a widespread, serious problem. Journal Royal Society Interface 7, 51 (2010), 1429--1439, DOI: 10.1098/rsif.2010.0112.","paperID":"None"},{"content":"Van Nes, F. L., and Bouma, H. On the legibility of segmented numerals. Human Factors 22, 4 (1980), 463--474, DOI: 10.1177/001872088002200407.","paperID":"None"},{"content":"Wikipedia, Seven-segment display character representations, en.wikipedia.org, 2011.","paperID":"None"}],"abstract":"Seven segment number displays are ubiquitous and popular. They are simple and familiar. They seem to make economic sense, and with only seven segments they require little wiring and electronics to support. They are cheap to buy and cheap to use; they make seemingly effective and unproblematic products.This paper illustrates many examples of problematic uses of seven segment displays that could have been avoided. More generally, the paper raises design questions and some solutions to be considered when designing numerical displays, and certainly before uncritically using seven segment displays. Although there are markets and applications where cost may be an overriding consideration, for safety critical and other dependable types of use (including general purpose devices that may sometimes be used for critical tasks) more legible alternatives than standard seven segment displays should be preferred.","video":"http://www.youtube.com/embed/eK3oIYU060g?rel=0","title":"Reasons to question seven segment displays","filename":"CHI13/p1431","authors":["Harold Thimbleby"],"conference":"CHI '13"}