{"paperId":2466455,"abstract":"In a study of users' interactions with Siri, the iPhone personal assistant application, we noticed the emergence of overlaps and blurrings between explanatory categories such as \"human\" and \"machine\". We found that users work to purify these categories, thus resolving the tensions related to the overlaps. This \"purification work\" demonstrates how such categories are always in flux and are redrawn even as they are kept separate. Drawing on STS analytic techniques, we demonstrate the mechanisms of such \"purification work.\" We also describe how such category work remained invisible to us during initial data analysis, due to our own forms of latent purification, and outline the particular analytic techniques that helped lead to this discovery. We thus provide an illustrative case of how categories come to matter in HCI research and design.","citation":[],"reference":[{"content":"Barad, K. 2003. Meeting the Universe Halfway. Duke Press.","paperID":"None"},{"content":"Bowker, G. & Star, S. L. 2000. Sorting Things Out. MIT Press.","paperID":"None"},{"content":"Cooper, G. & Bowers, J. 1995. Representing the user. In The social and interactional dimensions of HCI.","paperID":"None"},{"content":"DiSalvo, C. & Lukens, J. 2011. Non-anthropocentrism and the Nonhuman in Design. In From Social Butterfly to Engaged Citizen. MIT Press: 421--437.","paperID":"None"},{"content":"Latour, B. 1991. We have never been modern. Harvard Press.","paperID":"None"},{"content":"Min Kyung Lee , Sara Kiesler , Jodi Forlizzi, Receptionist or information kiosk: how do people talk with a robot?, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718927"},{"content":"Nass, C & Brave, S. 2005. Wired for Speech. MIT Press.","paperID":"None"},{"content":"Romero, M. & Mateas, M. 2005. A preliminary investigation of alien presence. In Proc. HCII'05.","paperID":"None"},{"content":"Lucy A. Suchman, Human-Machine Reconfigurations: Plans and Situated Actions, Cambridge University Press, New York, NY, 2006","paperID":"1212951"},{"content":"Taylor, A. 2009. Machine Intelligence. In Proc. CHI'09.","paperID":"None"}],"title":"How categories come to matter","filename":"CHI13/p3331","authors":["Lucian Leahu","Marisa Cohn","Wendy March"],"conference":"CHI '13"}