{"paperId":2466123,"citation":[{"content":"Sebastian Gehrmann , Lauren Urke , Ofra Amir , Barbara J. Grosz, Deploying AI Methods to Support Collaborative Writing: a Preliminary Investigation, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2732705"},{"content":"Dongwook Yoon , Nicholas Chen , François Guimbretière , Abigail Sellen, RichReview: blending ink, speech, and gesture to support collaborative document review, Proceedings of the 27th annual ACM symposium on User interface software and technology, October 05-08, 2014, Honolulu, Hawaii, USA","paperID":"2647390"},{"content":"Dakuo Wang, How People Write Together Now: Exploring and Supporting Today's Computer-Supported Collaborative Writing, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2874352"},{"content":"Matti Nelimarkka , Vilma Lehtinen , Antti Ukkonen , Kai Kuikkaniemi , Giulio Jacucci, Threading and conversation in co-located chats, Computers in Human Behavior, v.53 n.C, p.324-331, December 2015","paperID":"2825346"}],"reference":[{"content":"Bales, R. F. Interaction process analysis: a method for the study of small groups. Addison-Wesley, Cambridge, MA, 1950.","paperID":"None"},{"content":"Eevi E. Beck , Victoria M. E. Bellotti, Informed opportunism as strategy: supporting coordination in distributed collaborative writing, Proceedings of the third conference on European Conference on Computer-Supported Cooperative Work, p.233-248, September 13-17, 1993, Milan, Italy","paperID":"1241950"},{"content":"Matthew J. Bietz, Effects of communication media on the interpretation of critical feedback, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460637"},{"content":"Jeremy Birnholtz , Steven Ibara, Tracking changes in collaborative writing: edits, visibility and group maintenance, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145325"},{"content":"Caspi, A. and Blau, I. Collaboration and psychological ownership: how does the tension between the two influence perceived learning? Social Psychology of Education, 14, 2 (2011), 283--298.","paperID":"None"},{"content":"Cody, M. J. and McLaughlin, M. L. Interpersonal accounting. In H. Giles and P. Robinson, ed. Handbook of language and social psychology. Wiley and Sons, London, 1990.","paperID":"None"},{"content":"De Croon, E. M., Sluiter, J. K., Kuijer, P. P. F. M., and Frings-Dresen, M. H. W. The Effect of Office Concepts on Worker Health and Performance: A Systematic Review of the Literature. Ergonomics, 48(2005), 119--134.","paperID":"None"},{"content":"Paul Dourish , Victoria Bellotti, Awareness and coordination in shared workspaces, Proceedings of the 1992 ACM conference on Computer-supported cooperative work, p.107-114, November 01-04, 1992, Toronto, Ontario, Canada","paperID":"143468"},{"content":"Clarence A. Ellis , Simon J. Gibbs , Gail Rein, Groupware: some issues and experiences, Communications of the ACM, v.34 n.1, p.39-58, Jan. 1991","paperID":"99987"},{"content":"Gijsbert Erkens , Jos Jaspers , Maaike Prangsma , Gellof Kanselaar, Coordination processes in computer supported collaborative writing, Computers in Human Behavior, v.21 n.3, p.463-486, May, 2005","paperID":"1672739"},{"content":"Goffman, E. Behavior in public places. The Free Press, New York, 1963.","paperID":"None"},{"content":"Goffman, E. The presentation of self in everyday life. Anchor Books, New York, 1959.","paperID":"None"},{"content":"Carl Gutwin , Saul Greenberg, A Descriptive Framework of Workspace Awareness for Real-Time Groupware, Computer Supported Cooperative Work, v.11 n.3, p.411-446, 2002","paperID":"586339"},{"content":"Hackman, R. The design of work teams. In J. Lorsch, ed. Handbook of organizational behavior. Prentice-Hall, Englewood Cliffs, NJ, 1987.","paperID":"None"},{"content":"Claudia-Lavinia Ignat , Moira C. Norrie, Multi-level Editing of Hierarchical Documents, Computer Supported Cooperative Work, v.17 n.5-6, p.423-468, December  2008","paperID":"1452801"},{"content":"Hee-Cheol (Ezra) Kim , Kerstin Severinson Eklundh, Reviewing Practices in Collaborative Writing, Computer Supported Cooperative Work, v.10 n.2, p.247-259, January 15, 2001","paperID":"568759"},{"content":"Leland, M. D., Fish, R. S. and Kraut, R. E. Quilt: A collaborative tool for cooperative writing. In Proc. ACM CSCW (1988), 206--215.","paperID":"None"},{"content":"McCroskey, J. C. and McCain, T. A. The measurement of interpersonal attraction. Communication Monographs, 41(1974), 261--266.","paperID":"None"},{"content":"McGrath, J. E. Groups: Interaction and Performance. Prentice-Hall, Englewood Cliffs, NJ, 1984.","paperID":"None"},{"content":"Christine M. Neuwirth , Ravinder Chandhok , David Charney , Patricia Wojahn , Loel Kim, Distributed collaborative writing: a comparison of spoken and written modalities for reviewing and revising documents, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.51-57, April 24-28, 1994, Boston, Massachusetts, USA","paperID":"191693"},{"content":"Christine M. Neuwirth , Ravinder Chandhok , David S. Kaufer , Paul Erion , James Morris , Dale Miller, Flexible Diff-ing in a collaborative writing system, Proceedings of the 1992 ACM conference on Computer-supported cooperative work, p.147-154, November 01-04, 1992, Toronto, Ontario, Canada","paperID":"143473"},{"content":"Neuwirth, C. M., Kaufer, D. S., Chandhok, R. and Morris, J. H. Computer Support for Distributed Collaborative Writing: A Coordination Science Perspective. In G. M. Olson and T. W. Malone, ed. Coordination Theory and Collaboration Technology. Lawrence Erlbaum Assoc, Mahwah, NJ, 2000.","paperID":"None"},{"content":"Sylvie Noël , Jean-Marc Robert, Empirical Study on Collaborative Writing: What Do Co-authors Do, Use, and Like?, Computer Supported Cooperative Work, v.13 n.1, p.63-89, 2004","paperID":"967837"},{"content":"Judith S. Olson , Gary M. Olson , Marianne Storrøsten , Mark Carter, Groupwork close up: a comparison of the group design process with and without a simple group editor, ACM Transactions on Information Systems (TOIS), v.11 n.4, p.321-348, Oct. 1993","paperID":"159763"},{"content":"Posner, I. and Baecker, R. How People Write Together. In Proc. HICSS (1993), 127--138.","paperID":"None"},{"content":"Alex Mitchell , Ilona Posner , Ronald Baecker, Learning to write together using groupware, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.288-295, May 07-11, 1995, Denver, Colorado, USA","paperID":"223941"},{"content":"Scott, M. B. and Lyman, S. M. Accounts. American Sociological Review, 33(1968), 46--62.","paperID":"None"},{"content":"James Tam , Saul Greenberg, A framework for asynchronous change awareness in collaborative documents and workspaces, International Journal of Human-Computer Studies, v.64 n.7, p.583-598, July 2006","paperID":"1149045"},{"content":"Jun Zheng , Elizabeth Veinott , Nathan Bos , Judith S. Olson , Gary M. Olson, Trust without touch: jumpstarting long-distance trust with initial social activities, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 20-25, 2002, Minneapolis, Minnesota, USA","paperID":"503402"}],"abstract":"Writing documents together using collaborative editing tools has become extremely common with the widespread availability of tools such as Google Docs. The design of such tools, rooted in early CSCW research, has historically been focused on providing awareness of the presence and activities of one's collaborators. Evidence from a recent qualitative study, however, suggests that people are also concerned about how their behaviors -- and they themselves -- will be perceived by others; and take steps to mitigate possible negative perceptions. We present an experimental study of dyads composing documents together, focusing in particular on group maintenance, impression management and relationship-focused behavior. Results suggest that communication is positively related to social relations, but only for synchronous writing in a shared space; the reverse can be true in asynchronous commenting and editing.","video":"http://www.youtube.com/embed/AEnPVyauMOI?rel=0","title":"Write here, write now!: an experimental study of group maintenance in collaborative writing","filename":"CHI13/p961","authors":["Jeremy Birnholtz","Stephanie Steinhardt","Antonella Pavese"],"conference":"CHI '13"}