{"paperId":2466233,"abstract":"The goal of this study was to extend and replicate an SMS health intervention for pediatric asthma patients. This intervention was designed using the Health Belief Model (HBM). Thirty patients were randomly assigned to one of three conditions. In the Knowledge condition patients were queried about their asthma knowledge every other day. In the Knowledge and Symptoms condition patients received a daily text message. They were queried about their symptoms and knowledge of asthma on alternate days. The Control group received no texts. Our main finding is that daily text messages lead to improved health outcomes.We explain our results in the context of interview data and the HBM. We conclude by suggesting that the HBM can be used to inform and evaluate system design for chronic care beyond asthma and by considering the role that replication studies can play in HCI research.","citation":[{"content":"Katarzyna Stawarz , Anna L. Cox , Ann Blandford, Don't forget your pill!: designing effective medication reminder apps that support users' daily routines, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557079"}],"reference":[{"content":"Akinbami, L. J., Analysis, O., Moorman, J. E., and Liu, X. Asthma prevalence, health care use, and mortality: USA, 2005-2009. National health statistics reports, 32 (2011), 1--14.","paperID":"None"},{"content":"Anhøj, J. and Møldrup, C. Feasibility of Collecting Diary Data From Asthma Patients Through Mobile Phones and SMS (Short Message Service): Response Rate Analysis and Focus Group Evaluation From a Pilot Study. Journal of Medical Internet Research 6, 4 (2004), e42.","paperID":"None"},{"content":"Anhøj, J. and Nielsen, L. Quantitative and Qualitative Usage Data of an Internet-Based Asthma Monitoring Tool. Journal of Medical Internet Research 6, 3 (2004), e23.","paperID":"None"},{"content":"Becker, M. H. and Maiman, L. a. Sociobehavioral determinants of compliance with health and medical care recommendations. Medical care 13, 1 (1975), 10--24.","paperID":"None"},{"content":"Becker, M. H., Radius, S. M., Rosenstock, I. M., Drachman, R. H., Schuberth, K. C., and Teets, K. C. Compliance with a medical regimen for asthma: a test of the health belief model. Public health reports (Washington, D.C. 1974) 93, 3 (1974), 268--77.","paperID":"None"},{"content":"Bender, B. G. Are Asthmatic Children Educationally Handicapped?. School Psychology Quarterly 10, 4 (1995), 274--91.","paperID":"None"},{"content":"Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.","paperID":"None"},{"content":"Bush, P. J. and Iannotti, R. J. A Children's Health Belief Model. Medical care 28, 1 (1990), 69--86.","paperID":"None"},{"content":"Carpenter, C. J. A meta-analysis of the effectiveness of health belief model variables in predicting behavior. Health communication 25, 8 (2010), 661--9.","paperID":"None"},{"content":"Coffman, J. M., Cabana, M. D., Halpin, H. A., and Yelin, E. H. Effects of Asthma Education on Children's Use of Acute Care Services: A Meta-analysis. Pediatrics 121, 3 (2008), 575--586.","paperID":"None"},{"content":"Sunny Consolvo , David W. McDonald , James A. Landay, Theory-driven design strategies for technologies that support behavior change in everyday life, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518766"},{"content":"Druss, B. G., Marcus, S. C., Olfson, M., and Pincus, H. A. The most expensive medical conditions in America. Health affairs (Project Hope) 21, 4, 105--11.","paperID":"None"},{"content":"Grimes, A., Kantroo, V., and Grinter, R. E. Let's play! ACM Press, New York, New York, USA, 2010.","paperID":"None"},{"content":"Hug, T. Didactics of microlearning: concepts, discourses and examples. Waxmann, Münster, 2007.","paperID":"None"},{"content":"Jan, R.-L., Wang, J.-Y., Huang, M.-C., Tseng, S.-M., Su, H.-J., and Liu, L.-F. An Internet-Based Interactive Telemonitoring System for Improving Childhood Asthma Outcomes in Taiwan. Telemedicine and eHealth 13, 3 (2007), 257--268.","paperID":"None"},{"content":"Janz, N. K. and Becker, M. H. The Health Belief Model: A Decade Later. Health Education & Behavior 11, 1 (1984), 1--47.","paperID":"None"},{"content":"Juniper, E. F., Guyatt, G. H., Feeny, D. H., Ferrie, P. J., Griffith, L. E., and Townsend, M. Measuring quality of life in children with asthma. Quality of Life Research 5, 1 (1996), 35--46.","paperID":"None"},{"content":"Juniper, E. F., Guyatt, G. H., Feeny, D. H., Ferrie, P. J., Griffith, L. E., and Townsend, M. Measuring quality of life in the parents of children with asthma. Quality of Life Research 5, 1 (1996), 27--34.","paperID":"None"},{"content":"Kung, H.-C., Hoyert, D. L., Xu, J., and Murphy, S. L. Deaths: final data for 2005. National Vital Statistics Reports: From the Centers for Disease Control and Prevention, National Center for Health Statistics, National Vital Statistics System 56, 10 (2008), 1--120.","paperID":"None"},{"content":"Lenhart, A., Ling, R., Campbell, S., and Purcell, K. Teens and mobile phones. Pew Internet and American Life Project. Pew Research Center. http://www.pewInternet.org/Reports/2010/Teens-and-MobilePhones.aspx. Accessed August 8, 2010.","paperID":"None"},{"content":"Lena Mamykina , Elizabeth Mynatt , Patricia Davidson , Daniel Greenblatt, MAHI: investigation of social scaffolding for reflective thinking in diabetes management, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357131"},{"content":"Moonie, S. A., Sterling, D. A., Figgs, L., and Castro, M. Asthma status and severity affects missed school days. The Journal of school health 76, 1 (2006), 18--24.","paperID":"None"},{"content":"Moura, A. and Carvalho, A. A. Mobile Learning: Using SMS in Educational Contexts. In N. Reynolds & M. Turcsányi-Szabó (Eds.). In Key Competencies in the Knowledge Society. 2010, 281--291.","paperID":"None"},{"content":"Neville, R., Greene, A., McLeod, J., Tracy, A., and Surie, J. Mobile phone text messaging can help young people manage asthma. BMJ: British Medical Journal 325, 7364 (2002), 600--600.","paperID":"None"},{"content":"Newacheck, P. W. and Halfon, N. Prevalence, impact, and trends in childhood disability due to asthma. Archives of pediatrics & adolescent medicine 154, 3 (2000), 287--93.","paperID":"None"},{"content":"Olin, G. L. and Rhoades, J. A. The five most costly medical conditions, 1997 and 2002: estimates for the U.S. civilian noninstitutionalized population. 2002.","paperID":"None"},{"content":"Ostojic, V., Cvoriscec, B., Ostojic, S. B., Reznikoff, D., Stipic-Markovic, A., and Tudjman, Z. Improving asthma control through telemedicine: a study of short-message service. Telemedicine Journal and E-Health: The Official Journal of the American Telemedicine Association 11, 1 (2005), 28--35.","paperID":"None"},{"content":"Pinnock, H., Slack, R., Pagliari, C., Price, D., and Sheikh, A. Professional and patient attitudes to using mobile phone technology to monitor asthma: questionnaire survey. Primary care respiratory journal: journal of the General Practice Airways Group 15, 4 (2006), 237--45.","paperID":"None"},{"content":"Program, N. A. E. and P. Expert Panel Report 3 (EPR-3): Guidelines for the Diagnosis and Management of Asthma-Summary Report 2007. The Journal of Allergy and Clinical Immunology 120 (5 Supp, (2007), S94--138.","paperID":"None"},{"content":"Rasmussen, L. M., Phanareth, K., Nolte, H., and Backer, V. Internet-based monitoring of asthma: A long-term, randomized clinical study of 300 asthmatic subjects. Journal of Allergy and Clinical Immunology 115, 6 (2005), 1137--1142.","paperID":"None"},{"content":"Rosenstock, I. M., Strecher, V. J., and Becker, M. H. Social Learning Theory and the Health Belief Model. Health Education & Behavior 15, 2 (1988), 175--183.","paperID":"None"},{"content":"Ryan, D., Cobern, W., Wheeler, J., Price, D., and Tarassenko, L. Mobile phone technology in the management of asthma. Journal of telemedicine and telecare 11 Suppl 1, (2005), 43--6.","paperID":"None"},{"content":"Skinner, E. A., Diette, G. B., Algatt-Bergstrom, P. J., et al. The Asthma Therapy Assessment Questionnaire (ATAQ) for children and adolescents. Disease management: DM 7, 4 (2004), 305--13.","paperID":"None"},{"content":"Solomon, M. R. Information technology to support self-management in chronic care: A systematic review. Disease Management & Health Outcomes 16, 6 (2008), 391--401.","paperID":"None"},{"content":"Strandbygaard, U., Thomsen, S. F., and Backer, V. A daily SMS reminder increases adherence to asthma treatment: a three-month follow-up study. Respiratory medicine 104, 2 (2010), 166--71.","paperID":"None"},{"content":"Tammy Toscos, Using data to promote healthy behavior in children, Proceedings of the 9th International Conference on Interaction Design and Children, June 09-12, 2010, Barcelona, Spain","paperID":"1810609"},{"content":"Wang, L.Y., Zhong, Y., and Wheeler, L. Direct and indirect costs of asthma in school-age children. Preventing chronic disease 2, 1 (2005), A11.","paperID":"None"},{"content":"World Health Organization. WHO - World Health Statistics 2011. World Health Organization, 2011.","paperID":"None"},{"content":"Tae-Jung Yun , Hee Young Jeong , Tanisha D. Hill , Burt Lesnick , Randall Brown , Gregory D. Abowd , Rosa I. Arriaga, Using SMS to provide continuous assessment and improve health outcomes for children with asthma, Proceedings of the 2nd ACM SIGHIT International Health Informatics Symposium, January 28-30, 2012, Miami, Florida, USA","paperID":"2110432"}],"title":"A text message a day keeps the pulmonologist away","filename":"CHI13/p1769","authors":["Tae-Jung Yun","Rosa I. Arriaga"],"conference":"CHI '13"}