{"paperId":2466210,"citation":[],"reference":[{"content":"Balandin S, Berg N, Waller A. 2006. Assessing the loneliness of older people with cerebral palsy. Disability & Rehabilitation 28:469 - 79","paperID":"None"},{"content":"Rolf Black , Joe Reddington , Ehud Reiter , Nava Tintarev , Annalu Waller, Using NLG and sensors to support personal narrative for children with complex communication needs, Proceedings of the NAACL HLT 2010 Workshop on Speech and Language Processing for Assistive Technologies, p.1-9, June 05-05, 2010, Los Angeles, California","paperID":"1867751"},{"content":"Jordan L. Boyd-Graber , Sonya S. Nikolova , Karyn A. Moffatt , Kenrick C. Kin , Joshua Y. Lee , Lester W. Mackey , Marilyn M. Tremaine , Maria M. Klawe, Participatory design with proxies: developing a desktop-PDA system to support people with aphasia, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124797"},{"content":"Braun J, Al Mahmud A, Martens J-B. 2010. Capture Me! Helping People with Aphasia to Capture and Share Life Experiences. In BCS HCI 2010. Dundee, Scotland","paperID":"None"},{"content":"Carmichael A, Newell A, Dickinson A, Morgan M. 2005. Using theatre and film to represent user requirements. In Proceeding of Include Conference Royal College of Art. London","paperID":"None"},{"content":"Demchak M, Rickard C, Elquist M. 2002. Using Cues to Enhance Receptive Communication. ed. NDSI Project. Nevada: University of Nevada","paperID":"None"},{"content":"Enders A, Hall M. 1990. Assistive Technology Sourcebook. Washington: Resna Press. 576 pp.","paperID":"None"},{"content":"David Fox , Jonathan Sillito , Frank Maurer, Agile Methods and User-Centered Design: How These Two Methodologies are Being Successfully Integrated in Industry, Proceedings of the Agile 2008, p.63-72, August 04-08, 2008","paperID":"1443570"},{"content":"Glennen S, Descoste D. 1997. The Handbook of Augmentative and Alternative Communication. Thomson Delmar Learning. 795 pp.","paperID":"None"},{"content":"Hoyt T. 2009. The development of narrative identity in late adolescence and emergent adulthood: the continued importance of listeners. Developmental Psychology 45:558-","paperID":"None"},{"content":"Krueger RA, Casey MA. 2009. Focus Groups A Practical Guide for Applied Research. California, USA of America: SAGE Publications","paperID":"None"},{"content":"Larsson M, Sandberg A, Smith M. 2009. Reading and Spelling in Children with Severe Speech and Physical Impairments. Journal of Developmental and Physical Disabilities 21:369--92","paperID":"None"},{"content":"Jonathan Lazar , Jinjuan Heidi Feng , Harry Hochheiser, Research Methods in Human-Computer Interaction, Wiley Publishing, 2010","paperID":"1841406"},{"content":"Mary Lukanuski , Michel Milano , Jeroen de Bruin , Miles Rochford , Reinoud Bosman, Agile or awkward: surviving and flourishing in an agile/scrum project, CHI '08 Extended Abstracts on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1358662"},{"content":"Luo F. 2009. Personal narrative telling by individuals with ALS who use AAC devices. http://gradworks.umi.com/33/42/3342143.html","paperID":"None"},{"content":"MacDonald BK, Cockerell OC, Sander JWAS, Shorvon SD. 2000. The incidence and lifetime prevalence of neurological disorders in a prospective community-based study in the UK. Brain 123:665--76","paperID":"None"},{"content":"McLean KC. 2008. Stories of the young and the old: Personal continuity and narrative identity. Developmental Psychology 44:254--64","paperID":"None"},{"content":"Alan F. Newell , Peter Gregor, “User sensitive inclusive design”— in search of a new paradigm, Proceedings on the 2000 conference on Universal Usability, p.39-44, November 16-17, 2000, Arlington, Virginia, USA","paperID":"355470"},{"content":"O'Keefe BM, Kozak NB, Schuller R. 2007. Research priorities in augmentative and alternative communication as identified by people who use AAC and their facilitators. AAC: Augmentative & Alternative Communication 23:89--96","paperID":"None"},{"content":"Jenny Preece , David Benyon , Open University, A  Guide to Usability: Human Factors in Computing, Addison-Wesley Longman Publishing Co., Inc., Boston, MA, 1993","paperID":"562852"},{"content":"Prior S. 2011. Towards the Full Inclusion of People with Severe Speech and Physical Impairments in the Design of Augmentative and Alternative Communication. University of Dundee","paperID":"None"},{"content":"Prior S, Betzler H, Waller A. 2010. The Participatory Design of a Talking Photo Album for Adults with Severe Speech and Physical Impairments. In RaATE Conference. Coventry, UK","paperID":"None"},{"content":"Redmond SM, Johnston SS. 2001. Evaluating the Morphological Competence of Children With Severe Speech and Physical Impairments. pp. 1362--75","paperID":"None"},{"content":"Riemer-Reiss ML, Wacker R. 2000. Factors Associated with Assistive Technology Discontinuance among Individuals with Disabilities. The Journal of Rehabilitation 66:44--50","paperID":"None"},{"content":"Helen Sharp , Yvonne Rogers , Jenny Preece, Interaction Design: Beyond Human Computer Interaction, John Wiley & Sons, 2007","paperID":"1215597"},{"content":"Todman J, Alm N. 2003. Modelling conversational pragmatics in communication aids. Journal of Pragmatics 35:523--38","paperID":"None"},{"content":"Waller A. 2006. Communication Access to Conversational Narrative. pp. 221--39","paperID":"None"},{"content":"Waller A, Dave OM. 2002. Aided communication and the development of personal storytelling. In Augmentative and Alternative Communication: Developmental Issues, ed. S van Tetzchner, N Grove. London, UK: British Library. Number of.","paperID":"None"}],"abstract":"Engaging with end users in the development of assistive technologies remains one of the major challenges for researchers and developers in the field of accessibility and HCI. Developing usable software systems for people with complex disabilities is problematic, software developers are wary of using user-centred design, one of the main methods by which usability can be improved, due to concerns about how best to work with adults with complex disabilities, in particular Severe Speech and Physical Impairments (SSPI) and how to involve them in research. This paper reports on how the adoption of an adapted agile approach involving the incorporation of a user advocate on the research team helped in meeting this challenge in one software project and offers suggestions for how this could be used by other development teams.","video":"http://www.youtube.com/embed/jshhpFFIooY?rel=0","title":"Use of an agile bridge in the development of assistive technology","filename":"CHI13/p1579","authors":["Suzanne Prior","Annalu Waller","Rolf Black","Thilo Kroll"],"conference":"CHI '13"}