{"paperId":2466197,"reference":[{"content":"Ala , M. (2008). Working with brain scans: Digital images and gestural interaction in fMRI laboratory. Social Studies of Science, 38(4), 483--508.","paperID":"None"},{"content":"Beaulieu, A. (2002). Images are not the (only) truth: Brain mapping, visual knowledge, and iconoclasm. Science, Technology & Human Value, 27(1), 53--86.","paperID":"None"},{"content":"Burri, R.V. (2008) Boundary work and symbolic capital in radiology. Social Studies of Science, 38(1), 35--62.","paperID":"None"},{"content":"Crary, J. (1990). Techniques of the observer: On vision and modernity in the nineteenth century. Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Golan, T. (1998). The authority of shadows: The legal embrace of the X-ray. Historical Reflections, 24(3), 437--458.","paperID":"None"},{"content":"Goodwin, C. (1994). Professional vision. American Anthropologist, 96(3), 606--633.","paperID":"None"},{"content":"Goodwin, C. (2000). Practice of color classification. Mind, Culture, and Activity, 7(1--2), 19--36.","paperID":"None"},{"content":"Goodwin, C. (2003). The semiotic body in its environment. In J. Coupland & R. Gwyn (Eds.), Discourses of the body. New York: Macmillan.","paperID":"None"},{"content":"Heath, C. & Hindmarsh, J. (2000). Configuring action in objects: From mutual space to media space. Mind, Culture and Activity, 7(1--2), 81--104.","paperID":"None"},{"content":"Hindmarsh, J. & Heath C. (2000). Embodied reference: A study of deixis in workplace interaction. Ournal of pragmatics, 32, 1855--1878.","paperID":"None"},{"content":"Hirschauer, S. (1991). The manufacture of bodies in surgery. Social Studies of Science, 21(2), 279--319.","paperID":"None"},{"content":"Hacking, I. Representing and intervening: Introductory topics in the philosophy of natural science. Cambridge: Cambridge UP, 1983","paperID":"None"},{"content":"Rose Johnson , Kenton O'Hara , Abigail Sellen , Claire Cousins , Antonio Criminisi, Exploring the potential for touchless interaction in image-guided interventional radiology, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979436"},{"content":"Joyce, K. (2005). Appealing images: Magnetic resonance imaging and the production of authoritative knowledge. Social Studies of Science, 35(3), 437--462.","paperID":"None"},{"content":"Kaplan, B. (1995). Objectification and negotiation in interpreting clinical images: Implications for computerbased patient records. Artificial Intelligence in Medicine, 7, 439--454.","paperID":"None"},{"content":"Kassirer, J. P. (1992). Images of clinical medicine. New England Journal of Medicine, 32(6), 829--830.","paperID":"None"},{"content":"Latour, B. (1990). Drawing things together. In M. Lynch & S. Woolgar (Eds.), Representation in Scientific practice (pp. 19--68). Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Lynch, M. (1985). Discipline and the material form of images: An analysis of scientific visibility. Social Studies of Science, 15, 37--66.","paperID":"None"},{"content":"Lynch, M. (1990). Drawing things together. In M. Lynch and S. Woolgar (Eds.), Representation in a scientific practice (pp. 19--68). Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Helena M. Mentis , Kenton O'Hara , Abigail Sellen , Rikin Trivedi, Interaction proxemics and image use in neurosurgery, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208536"},{"content":"Nishizaka A. (2000). Seeing what one sees: Perception, emotion and activity. Mind, Culture, and Activity, 7(12), 105--123.","paperID":"None"},{"content":"Pasveer, B. (1989). Knowledge of shadows: The introduction of x-ray images in medicine. Sociology of Health and Illness, 11(4), 360--381.","paperID":"None"},{"content":"Prasad, A. (2005). Making images/making bodies: Visibilizing and disciplining through magnetic resonance imaging. Science, Technology & Human Values, 30, 2, p. 291--316.","paperID":"None"},{"content":"Stafford, B. (1991). Body criticism: Imaging the unseen in Enlightenment art and medicine.Cambridge, MA: MITPress.","paperID":"None"},{"content":"Suchman, L. (2000). Embodied practices of engineering work. Mind, Culture and Activity, 7(1--2), 4--18.","paperID":"None"},{"content":"Ueno, N. (2000). Ecologies of inscriptions: Technologies of making the social organization of work and the mass production of machine parts visible in collaborative activity. Mind, Culture, and Activity, 7(12), 59--80.","paperID":"None"},{"content":"Vlaardingerbroek, M. & Boer, J. (1999). Magnetic resonance imaging: Theory and practice. New York: Springer.","paperID":"None"},{"content":"Warwick, A. (2005). X-rays as Evidence in German Orthopedic Surgery, 1895--1900. ISIS, 96, 1--24.","paperID":"None"}],"citation":[{"content":"Helena M. Mentis , Rita Shewbridge , Sharon Powell , Paul Fishman , Lisa Shulman, Being Seen: Co-Interpreting Parkinson's Patient's Movement Ability in Deep Brain Stimulation Programming, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702342"},{"content":"Helena M. Mentis , Ahmed Rahim , Pierre Theodore, Crafting the Image in Surgical Telemedicine, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819978"},{"content":"Helena M. Mentis , Amine Chellali , Steven Schwaitzberg, Learning to see the body: supporting instructional practices in laparoscopic surgical procedures, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557387"},{"content":"Torgeir K. Haavik, Keep your coats on: augmented reality and sensework in surgery and surgical telemedicine, Cognition, Technology and Work, v.18 n.1, p.175-191, February  2016","paperID":"2883794"}],"abstract":"Recent years have seen the possibilities of new imaging and interaction technologies for minimally invasive surgery such as touchless interaction and high definition renderings of three-dimensional anatomy. With this paper we take a step back to review the historical introduction and assimilation of imaging technologies in the surgical theatre in parallel with the productive and cross-referential nature of surgical practice and image use. We present findings from a field study of image use during neurosurgery where we see that the work to see medical images is highly constructed and embodied with the action of manipulating the body. This perspective lends itself to a discussion of the directions for new imaging interaction technologies.","video":"http://www.youtube.com/embed/VuCU00afAp4?rel=0","title":"Imaging the body: embodied vision in minimally invasive surgery","filename":"CHI13/p1479","authors":["Helena M. Mentis","Alex S. Taylor"],"conference":"CHI '13"}