{"paperId":2466216,"citation":[{"content":"Eric P.S. Baumer , June Ahn , Mei Bie , Elizabeth M. Bonsignore , Ahmet Börütecene , Oğuz Turan Buruk , Tamara Clegg , Allison Druin , Florian Echtler , Dan Gruen , Mona Leigh Guha , Chelsea Hordatt , Antonio Krüger , Shachar Maidenbaum , Meethu Malu , Brenna McNally , Michael Muller , Leyla Norooz , Juliet Norton , Oguzhan Ozcan , Donald J. Patterson , Andreas Riener , Steven I. Ross , Karen Rust , Johannes Schöning , M. Six Silberman , Bill Tomlinson , Jason Yip, CHI 2039: speculative research visions, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2578864"},{"content":"Enrico Costanza , Joel E. Fischer , James A. Colley , Tom Rodden , Sarvapali D. Ramchurn , Nicholas R. Jennings, Doing the laundry with agents: a field trial of a future smart energy system in the home, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557167"}],"abstract":"Doing research is, in part, an act of foresight. Even though it is not explicit in many projects, we especially value research that is still relevant five, ten or more years after it is completed. However, published research in the field of interactive computing (and technology research in general) often lacks evidence of systematic thinking about the long-term impacts of current trends. For example, trends on an exponential curve change much more rapidly than intuition predicts. As a result, research may accidentally emphasize near-term thinking. When thinking about the future is approached systematically, we can critically examine multiple potential futures, expand the set of externalities under consideration, and address both negative and positive forecasts of the future. The field of Futures Studies provides methods that can support analysis of long-term trends, support the identification of new research areas and guide design and evaluation. We survey methods for futuristic thinking and discuss their relationship to Human Computer Interaction. Using the sustainability domain an example, we present a case study of a Futures Studies approach - the Delphi Method. We show how Futures Studies can be incorporated into Human Computer Interaction and highlight future work such as rethinking the role of externalities in the validation process.","video":"http://www.youtube.com/embed/YV62RAx5oEM?rel=0","reference":[{"content":"Agre, P. E. Toward a critical technical practice: Lessons learned in trying to reform AI. In Bridging the Great Divide: Social Science, Technical Systems, and Cooperative Work, G. Bowker, et al., Ed. Erlbaum, 1997.","paperID":"None"},{"content":"Agre, P. E. Real-time politics: The Internet and the political process. The Information Society 18, 5 (2002), 311--331.","paperID":"None"},{"content":"Andersson, J. The future landscape. Technical Report 2008:5, Institute for Futures Studies, 2008.","paperID":"None"},{"content":"Jeffrey Bardzell, Interaction criticism and aesthetics, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1519063"},{"content":"Genevieve Bell , Paul Dourish, Yesterday’s tomorrows: notes on ubiquitous computing’s dominant vision, Personal and Ubiquitous Computing, v.11 n.2, p.133-143, January 2007","paperID":"1229069"},{"content":"Bell, W. What do we mean by Futures Studies? In New Thinking for a New Millennium, R. Slaughter, Ed. Psychology Press, 1996, 3--25.","paperID":"None"},{"content":"Bell, W. Foundations of Futures Studies: Human science for a new era: History, purposes and knowledge, vol. 1. Transaction Publishers, 2003.","paperID":"None"},{"content":"Eli Blevis, Sustainable interaction design: invention & disposal, renewal & reuse, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240705"},{"content":"Mark A. Blythe , Peter C. Wright, Pastiche scenarios: Fiction as a resource for user centred design, Interacting with Computers, v.18 n.5, p.1139-1164, September, 2006","paperID":"1221461"},{"content":"Carter, S., Mankoff, J., Klemmer, S. R., and Matthews, T. Exiting the cleanroom: On ecological validity and ubiquitous computing. HCI Journal 23, 1 (2008), 47--99.","paperID":"None"},{"content":"Dator, J. From future workshops to envisioning alternative futures. Futures Research Quarterly 42 (1993), 298--319.","paperID":"None"},{"content":"Dator, J. The future lies behind! Thirty years of teaching futures studies. American Behavioral Scientist 42 (1998), 298--319.","paperID":"None"},{"content":"Scott Davidoff , Min Kyung Lee , Anind K. Dey , John Zimmerman, Rapidly exploring application design through speed dating, Proceedings of the 9th international conference on Ubiquitous computing, p.429-446, September 16-19, 2007, Innsbruck, Austria","paperID":"1771617"},{"content":"Dourish, P., and Bell, G. \"Resistance is Futile\": Reading science fiction alongside ubiquitous computing. PUC (2008).","paperID":"None"},{"content":"Paul Dourish , Genevieve Bell, Divining a Digital Future: Mess and Mythology in Ubiquitous Computing, The MIT Press, 2011","paperID":"2018772"},{"content":"W. Keith Edwards , Rebecca E. Grinter, At Home with Ubiquitous Computing: Seven Challenges, Proceedings of the 3rd international conference on Ubiquitous Computing, p.256-272, September 30-October 02, 2001, Atlanta, Georgia, USA","paperID":"741327"},{"content":"Steven Feiner , Blair Macintyre , Dorée Seligmann, Knowledge-based augmented reality, Communications of the ACM, v.36 n.7, p.53-62, July 1993","paperID":"159587"},{"content":"Joel Garreau, Radical Evolution: The Promise and Peril of Enhancing Our Minds, Our Bodies -- and What It Means to Be Human, Broadway Books, 2006","paperID":"1206908"},{"content":"Gianchandani, E. Calling for proposals: Envisioning frontiers of computing research. The Computing Community Consortium Blog, September 2011. Archived by WebCite (http://www.webcitation.org/6DdA6MheT).","paperID":"None"},{"content":"Gibson, W. The science in science fiction, August 2012. Archived by WebCite (www.webcitation.org/69qsg0Nqh).","paperID":"None"},{"content":"Wayne D. Gray , Marilyn C. Salzman, Damaged merchandise? a review of experiments that compare usability evaluation methods, Human-Computer Interaction, v.13 n.3, p.203-261, September 1998","paperID":"1462991"},{"content":"Joan Greenbaum , Morten Kyng, Design at work: cooperative design of computer systems, L. Erlbaum Associates Inc., Hillsdale, NJ, 1992","paperID":"125470"},{"content":"Saul Greenberg , Bill Buxton, Usability evaluation considered harmful (some of the time), Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357074"},{"content":"Harber, R., Rodden, T., Rogers, Y., and Sellen, A. Being human: HCI in the year 2020. Tech. rep., Microsoft, 2008.","paperID":"None"},{"content":"N. Katherine Hayles , Katherine Hayles, How We Became Posthuman: Virtual Bodies in Cybernetics, Literature, and Informatics, University of Chicago Press, Chicago, IL, 1999","paperID":"553246"},{"content":"Hendrickson, C. T., Lave, L., and Matthews, S. H. Environmental life cycle assessment of goods and services: An input-output approach. Tech. rep., Resources for the Future, Washington, DC, 2006.","paperID":"None"},{"content":"Kirby, D. The future is now: Diegetic prototypes and the role of popular films in generating real-world technological development. Social Studies of Science 40, 1 (2010), 41--70.","paperID":"None"},{"content":"Kreis, M. Pictures of the future in a digital world: An international comparison of user perspectives. Results of the third phase of the international study \"Prospects and Opportunities of Information and Communication Technologies (ICT) and Media\", 2011.","paperID":"None"},{"content":"Ray Kurzweil, The Singularity Is Near: When Humans Transcend Biology, Penguin (Non-Classics), 2006","paperID":"1214678"},{"content":"Brenda Laurel, Computers as theatre, Addison-Wesley Longman Publishing Co., Inc., Boston, MA, 1991","paperID":"103681"},{"content":"Linston, H. A., and Turoff, M., Eds. The Delphi Method: Techniques and applications. H. A. Turoff and M. Linston, 2002.","paperID":"None"},{"content":"Meadows, D. H. The limits to growth: A report for the Club of Rome's project on the predicament of mankind. Universe Books, 1972.","paperID":"None"},{"content":"Miller, D. Stuff. Polity, 2009.","paperID":"None"},{"content":"Moore, G. E. Cramming more components onto integrated circuits. Electronics Magazine 4 (1965).","paperID":"None"},{"content":"Lisa P. Nathan , Batya Friedman , Predrag Klasnja , Shaun K. Kane , Jessica K. Miller, Envisioning systemic effects on persons and society throughout interactive system design, Proceedings of the 7th ACM conference on Designing interactive systems, p.1-10, February 25-27, 2008, Cape Town, South Africa","paperID":"1394446"},{"content":"Harold G. Nelson , Erik Stolterman, Design Way: Intentional Change in an Unpredictable World - Foundations and Fundamentals of Design Competence, Educational Technology Publications, Englewood Cliffs, NJ, 2003","paperID":"861852"},{"content":"Dan R. Olsen, Jr., Evaluating user interface systems research, Proceedings of the 20th annual ACM symposium on User interface software and technology, October 07-10, 2007, Newport, Rhode Island, USA","paperID":"1294256"},{"content":"Eleanor O'Neill , David Lewis , Owen Conlan, A simulation-based approach to highly iterative prototyping of ubiquitous computing systems, Proceedings of the 2nd International Conference on Simulation Tools and Techniques, March 02-06, 2009, Rome, Italy","paperID":"1537685"},{"content":"Pearson, I. D. The next 20 years in technology: Timeline and commentary. The Futurist (January 2000).","paperID":"None"},{"content":"Peirce, C. S. Pragmatism as the logic of abduction. In The Essential Peirce: Selected Philosophical Writings, 1893--1913, Pierce Edition Project, Ed. Indiana University Press, 1998.","paperID":"None"},{"content":"Quist, J., and Vergragt, P. J. Backcasting for industrial transformations and system innovations towards sustainability: Relevance for governance? In the Berlin Conference on the Human Dimensions of Global Environmental Change, Governance for Industrial Transformation (2003), 409--437.","paperID":"None"},{"content":"Howard Rheingold, Smart Mobs: The Next Social Revolution, Perseus Publishing, 2002","paperID":"579424"},{"content":"Rittel, H. W. J., and Webber, M. M. Dilemmas in a general theory of planning. Policy Sciences 4 (1973), 155--169.","paperID":"None"},{"content":"Jennifer A. Rode, Reflexivity in digital anthropology, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1978961"},{"content":"Yvonne Rogers, The Changing Face of Human-Computer Interaction in the Age of Ubiquitous Computing, Proceedings of the 5th Symposium of the Workgroup Human-Computer Interaction and Usability Engineering of the Austrian Computer Society on HCI and Usability for e-Inclusion, November 09-10, 2009, Linz, Austria","paperID":"1694094"},{"content":"Rowe, G., and Wright, G. The delphi technique as a forecasting tool: issues and analysis. International Journal of Forecasting 15 (1999), 353--375.","paperID":"None"},{"content":"Schneider, S. H. Patient from hell: How I worked with my doctors to get the best of modern medicine and how you can to. Da Capo Lifelong Books, 2007.","paperID":"None"},{"content":"Abigail J. Sellen , Richard H.R. Harper, The Myth of the Paperless Office, MIT Press, Cambridge, MA, 2003","paperID":"778158"},{"content":"Phoebe Sengers , Kirsten Boehner , Shay David , Joseph 'Jofish' Kaye, Reflective design, Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility, August 20-24, 2005, Aarhus, Denmark","paperID":"1094569"},{"content":"Phoebe Sengers , Bill Gaver, Staying open to interpretation: engaging multiple meanings in design and evaluation, Proceedings of the 6th conference on Designing Interactive systems, June 26-28, 2006, University Park, PA, USA","paperID":"1142422"},{"content":"Spigel, L. Yesterday's future, tomorrow's home. Emergence 11, 1 (2001), 29--49.","paperID":"None"},{"content":"Tversky, A., and Kahneman, D. Judgement under uncertainty: Heuristics and biases. In Judgement and Decision Making: An Interdisciplinary Reader, T. Connolly, H. R. Arkes, and K. R. Hammond, Eds. Cambridge University Press, 2000.","paperID":"None"},{"content":"Wagener, W. A., and Sagaria, S. Misperception of exponential growth. Perception and Psychophysics 18, 6 (1975), 416--422.","paperID":"None"},{"content":"Willard, W. Apocalypse When. Praxis, 2009.","paperID":"None"}],"title":"Looking past yesterday's tomorrow: using futures studies methods to extend the research horizon","filename":"CHI13/p1629","authors":["Jennifer Mankoff","Jennifer A. Rode","Haakon Faste"],"conference":"CHI '13"}