{"paperId":2466159,"reference":[{"content":"Veronika A. Vanden Abeele , Veerle Van Rompaey, Introducing human-centered research to game design: designing game concepts for and with senior citizens, CHI '06 Extended Abstracts on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1125721"},{"content":"AGS, BGS, Guidelines for the prevention of falls in older persons. American Geriatrics Society (2011), 49: 664--672.","paperID":"None"},{"content":"Gazihan Alankus , Amanda Lazar , Matt May , Caitlin Kelleher, Towards customizable games for stroke rehabilitation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753649"},{"content":"Arditi, A. Designing for people with partial sight and color deficiencies (Accessed Sept 2012). http://www.lighthouse.org/accessibility/design/accessible-print-design/effective-color-contrast.","paperID":"None"},{"content":"Brewer, B. R., Klatzky, R. and Matsuoka, Y. Initial therapeutic results of visual feedback manipulation in robotic rehabilitation (2006). Virtual Rehabilitation, pp. 160--166. DOI: 10.1109/IWVR.2006.1707546.","paperID":"None"},{"content":"J. W. Burke , M. D. J. McNeill , D. K. Charles , P. J. Morrow , J. H. Crosbie , S. M. McDonough, Optimising engagement for stroke rehabilitation using serious games, The Visual Computer: International Journal of Computer Graphics, v.25 n.12, p.1085-1099, October 2009","paperID":"1667556"},{"content":"Doyle, J., Bailey, C., Dromey, B. and Scanaill, C. N. BASE - An interactive technology solution to deliver balance and strength exercises to older adults. Pervasive Health (2010), pp. 1--5.","paperID":"None"},{"content":"Garcia-Marin, 1., K. Felix-Navarro, and E. Lawrence, Serious Games to Improve the Physical Health of the Elderly: A Categorization Scheme. In Proc. CENTRIC 2011, pp. 64--71.","paperID":"None"},{"content":"Kathrin Gerling , Ian Livingston , Lennart Nacke , Regan Mandryk, Full-body motion-based game interaction for older adults, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208324"},{"content":"Gillespie, L. D., Robertson, M. C., Gillespie, W. J., Sherrington, C., Gates, S., Clemson, L. M., and Lamb, S. E., Interventions for preventing falls in older people living in the community. Cochrane Database of Systematic Reviews (2012), (9): CD007146. DOI: 10.1002/14651858.CD007146.pub3.","paperID":"None"},{"content":"Kalapanidas, E., Davarakis, C., Aranda, F. F., Jiménez-Murcia, S., Kocsis, O., Ganchev, T., Kaufmann, H., Lam, T. and Konstantas, D. \"PlayMancer: Games for Health with Accessibility in Mind,\" Communications & Strategies (2009), vol. 73, pp. 105--120.","paperID":"None"},{"content":"Kujala, S. User involvement: A review of the benefits and challenges (2003). Behaviour & Information Technology, 22 (1), pp. 1--16.","paperID":"None"},{"content":"Lewis, J. R. Usability testing. In G. Salvendy (ed.), Handbook of Human Factors and Ergonomics (2006), pp. 1275--1316. New York, NY: John Wiley.","paperID":"None"},{"content":"A. S. Macdonald , D. Loudon , P. J. Rowe , D. Samuel , V. Hood , A. C. Nicol , M. A. Grealy , B. A. Conway, Towards a design tool for visualizing the functional demand placed on older adults by everyday living tasks, Universal Access in the Information Society, v.6 n.2, p.137-144, August 2007","paperID":"1283687"},{"content":"Microsoft Kinect for Xbox 360 (Accessed September 2012). http://www.xbox.com/en-US/kinect.","paperID":"None"},{"content":"Nintendo Wii (Accessed Sept 2012) http://www.nintendo.co.uk/NOE/en_GB/wii_54.html.","paperID":"None"},{"content":"Nyman, S. R. and Victor, C. R. Older people's participation in and engagement with falls prevention interventions in community settings: An augment to the Cochrane systematic review. Age Ageing (2011). http://www.ncbi.nlm.nih.gov/pubmed/21875865.","paperID":"None"},{"content":"Pain, H., Gale, C., Watson, C., Cox, V., Cooper, C. and Sayer, A. Readiness of elders to use assistive devices to maintain their independence in the home (2007). Age Ageing, 36(4): 465--467.","paperID":"None"},{"content":"Sherrington, C., Tiedemann, A., Fairhall, N., Close, J. C. and Lord, S. R. Exercise to prevent falls in older adults: an updated meta-analysis and best practice recommendations. N S W Public Health Bull (2011), Jun; 22(3-4): 78--83.","paperID":"None"},{"content":"Silver Fit Soft Kinetic rehabilitation (Accessed September 2010). http://www.silverfit.nl.","paperID":"None"},{"content":"Skelton, D., Dinan, S., Campbell, M. and Rutherford, O. Tailored group exercise (Falls Management Exercise - FaME) reduces falls in community-dwelling older frequent fallers (an RCT). Age Ageing (2005), 34 (6): 636--639.","paperID":"None"},{"content":"Skelton, D. and Todd, C. What are the main risk factors for falls among older people and what are the most effective interventions to prevent these falls? Copenhagen, WHO Regional Office for Europe, 2004. http://www.euro.who.int/document/E82552.pdf.","paperID":"None"},{"content":"Sugarman, H., Weisel-Eichler, A., Burstin, A. and Brown, R. Use of the Wii Fit system for the treatment of balance problems in the elderly: A feasibility study (2009). In Proc, Virtual Rehabilitation, pp. 111--116.","paperID":"None"},{"content":"Sveistrup, H. Motor rehabilitation using virtual reality. J Neuroeng Rehabilitation (2004) Dec 10; 1(1): 10.","paperID":"None"},{"content":"Thomas, S., Mackintosh, S. and Halbert, J. Does the 'Otago exercise programme' reduce mortality and falls in older adults?: a systematic review and meta-analysis. Age Ageing. 2010 Nov; 39(6): 681--7.","paperID":"None"},{"content":"Stephen Uzor , Lynne Baillie , Dawn Skelton, Senior designers: empowering seniors to design enjoyable falls rehabilitation tools, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208568"},{"content":"Stephen Uzor , Lynne Baillie , Dawn Skelton , Fiona Fairlie, Identifying barriers to effective user interaction with rehabilitation tools in the home, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042122"},{"content":"Vicon Systems (Accessed September 2012) http://www.vicon.com/products/viconmx.html.","paperID":"None"},{"content":"Walker, C., Brouwer, B. J. and Culham, E. G. Use of Visual Feedback in Retraining Balance Following Acute Stroke. Physical Therapy (2000), vol. 80 no. 9 886--895.","paperID":"None"},{"content":"Anthony Whitehead , Nick Crampton , Kaitlyn Fox , Hannah Johnston, Sensor networks as video game input devices, Proceedings of the 2007 conference on Future Play, November 14-17, 2007, Toronto, Canada","paperID":"1328210"}],"citation":[{"content":"Jan David Smeddinck , Jens Voges , Marc Herrlich , Rainer Malaka, Comparing modalities for kinesiatric exercise instruction, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2581367"},{"content":"Craig O'Neil , Mark D. Dunlop , Andrew Kerr, Supporting Sit-To-Stand Rehabilitation Using Smartphone Sensors and Arduino Haptic Feedback Modules, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, August 24-27, 2015, Copenhagen, Denmark","paperID":"2793705"},{"content":"Stephen Uzor , Lynne Baillie, Investigating the long-term use of exergames in the home with elderly fallers, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557160"},{"content":"Julie Doyle , Lorcan Walsh , Antonella Sassu , Teresa McDonagh, Designing a wellness self-management tool for older adults: results from a field trial of YourWellness, Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare, May 20-23, 2014, Oldenburg, Germany","paperID":"2686912"},{"content":"Mobolaji Ayoade , Lynne Baillie, A novel knee rehabilitation system for the home, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557353"},{"content":"Lin Wan , Claudia Müller , Volker Wulf , David William Randall, Addressing the subtleties in dementia care: pre-study & evaluation of a GPS monitoring system, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557307"},{"content":"Sinziana Mazilu , Ulf Blanke , Michael Hardegger , Gerhard Tröster , Eran Gazit , Jeffrey M. Hausdorff, GaitAssist: a daily-life support and training system for parkinson's disease patients with freezing of gait, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557278"},{"content":"Marén Schorch , Lin Wan , David William Randall , Volker Wulf, Designing for Those who are Overlooked: Insider Perspectives on Care Practices and Cooperative Work of Elderly Informal Caregivers, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819999"}],"abstract":"Falls are the leading cause of accidental injury-related deaths in the elderly; a fall can lead to a loss of independence, and a fear of falling. Rehabilitation programmes involving exercise have proved the most successful way to reduce the risk of falls. However, the limitations of standard care (e.g. booklets) could prevent home users from receiving the full therapeutic benefit that rehabilitation offers. Having consulted users and health experts, we developed games, and visualizations for falls rehabilitation that we believe could potentially overcome the main barriers to effective rehabilitation in the home. In this paper, we describe user studies that we carried out with older adults to evaluate the use of these visual tools versus standard care, both in the laboratory and in the home. Our main findings show that our visualizations and games were able to overcome the major limitations of standard care, and that they were usable and acceptable to the end users.","video":"http://www.youtube.com/embed/cyqcsx3ii88?rel=0","title":"Exploring & designing tools to enhance falls rehabilitation in the home","filename":"CHI13/p1233","authors":["Stephen Uzor","Lynne Baillie"],"conference":"CHI '13"}