{"paperId":2466464,"citation":[{"content":"Philip Sheridan Buffum, Examining the Impact Narrative Interactivity Has on Fostering Identity Formation in an Educational Game, Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, October 05-07, 2015, London, United Kingdom","paperID":"2810278"},{"content":"Alissa N. Antle , Jillian L. Warren , Aaron May , Min Fan , Alyssa F. Wise, Emergent dialogue: eliciting values during children's collaboration with a tabletop game for change, Proceedings of the 2014 conference on Interaction design and children, June 17-20, 2014, Aarhus, Denmark","paperID":"2593971"}],"abstract":"Research into the effects of serious games often engages with interdisciplinary models of how human behaviors are shaped and changed over time. To better understand these different perspectives we articulate three cognitive models of behavior change and consider the potential of these models to support a deeper understanding of behavior change in serious games. Two of these models -- Information Deficit and Procedural Rhetoric -- have already been employed in the design of serious games, while the third -- Emergent Dialogue -- is introduced from the field of Environmental Studies. We situate this discussion within a context of designing games for public engagement with issues of environmental sustainability.","reference":[{"content":"Ian Bogost, Persuasive Games: The Expressive Power of Videogames, The MIT Press, 2007","paperID":"1214315"},{"content":"Bogost, I. (2008). The Rhetoric of Video Games.In The Ecology of Games: Connecting Youth, Games, and Learning, K. Salen, eds. The MIT Press, Cambridge, MA.117 - 140.","paperID":"None"},{"content":"Engelhardt, C. R., Bartholow, B. D., Kerr, G. T. and Bushman, B. J. (2011). This Is Your Brain on Violent Video Games: Neural Desensitization to Violence Predicts Increased Aggression Following Violent Video Game Exposure. Journal of Experimental Social Psychology, 47, 5, 1033--1036.","paperID":"None"},{"content":"Frasca, G. (2003). September the 12th.Retrieved from http://www.newsgaming.com/games/index12.htm on September 12, 2012","paperID":"None"},{"content":"Games for Change. (2011). Games for Change: Play.Retrieved from http://www.gamesforchange.org/game_categories/envir onment/ on July 10, 2011","paperID":"None"},{"content":"James Paul Gee, What Video Games Have to Teach Us About Learning and Literacy, Palgrave Macmillan, 2004","paperID":"983348"},{"content":"Helen Ai He , Saul Greenberg , Elaine M. Huang, One size does not fit all: applying the transtheoretical model to energy feedback technology design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753464"},{"content":"Nasa. (2012). Recycle This!Retrieved from http://climate.nasa.gov/kids/games/recycleThis/index.cf m on September 14, 2012","paperID":"None"},{"content":"Robinson, J. (2004). Squaring the Circle? Some Thoughts on the Idea of Sustainable Development. Ecological Economics, 48, 369--384.","paperID":"None"},{"content":"Robinson, J. (2008). Being Undisciplined: Some Transgressions and Intersections in Academia and Beyond. Futures, 40, 1, 70--86.","paperID":"None"},{"content":"Salter, J., Robinson, J. and Wiek, A. (2010). Participatory Methods of Integrated Assessment - a Review. Climate Change, 1, 5, 697--717.","paperID":"None"},{"content":"The USA Environmental Protection Agency. (2012). Dumptown Game.Retrieved from http://www.epa.gov/recyclecity/gameintro.htm on September 14, 2012","paperID":"None"},{"content":"Treanor, M. and Mateas, M. (2009). Newsgames: Procedural Rhetoric Meets Political Cartoons. Proc. DiGRA 2009","paperID":"None"}],"title":"Three perspectives on behavior change for serious games","filename":"CHI13/p3389","authors":["Joshua G. Tanenbaum","Alissa N. Antle","John Robinson"],"conference":"CHI '13"}