{"paperId":2466453,"citation":[{"content":"William Odom , John Zimmerman , Jodi Forlizzi, Placelessness, spacelessness, and formlessness: experiential qualities of virtual possessions, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598577"},{"content":"Elisa Giaccardi , Elvin Karana, Foundations of Materials Experience: An Approach for HCI, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702337"}],"reference":[{"content":"Austlit, the Australian Literature Resource. Available at http://www.austlit.edu.au/. Last accessed August 30, 2012.","paperID":"None"},{"content":"T. Clement, ed. In transition: selected poems by the Baroness Elsa von Freytag-Loringhoven. Available at: http://digital.lib.umd.edu/transition/index.jsp. Last accessed September 2, 2012.","paperID":"None"},{"content":"A. Coleman. Scientific models as works. In Works as Entities for Information Retrieval. R. Smiraglia, ed. New York: Haworth Information Press,129--160, 2002.","paperID":"None"},{"content":"C. Cutter. Rules for a dictionary catalog. 4th ed. Washington: Government Printing Office, 1904.","paperID":"None"},{"content":"P. Eggert. Where are we now with authorship and the work? Yearbook of English Studies 88--96, 1999.","paperID":"None"},{"content":"E. Folsom and K. Price. Walt Whitman Archive. Available at: http://www.whitmanarchive.org/. Last accessed September 2, 2012.","paperID":"None"},{"content":"Silke Gegenbauer , Elaine M. Huang, Inspiring the design of longer-lived electronics through an understanding of personal attachment, Proceedings of the Designing Interactive Systems Conference, June 11-15, 2012, Newcastle Upon Tyne, United Kingdom","paperID":"2318052"},{"content":"Connie Golsteijn , Elise van den Hoven , David Frohlich , Abigail Sellen, Towards a more cherishable digital object, Proceedings of the Designing Interactive Systems Conference, June 11-15, 2012, Newcastle Upon Tyne, United Kingdom","paperID":"2318054"},{"content":"International Federation of Library Associations (IFLA) Study Group on the Functional Requirements for Bibliographic Records. Final Report. Munich: K.G. Saur, 1998. Available at http://www.ifla.org/publications/functionalrequirements-for-bibliographic-records. Last accessed August 28, 2012.","paperID":"None"},{"content":"H. Jung., et al. How deep is your love: deep narratives of ensoulment and heirloom status. International Journal of Design 5(1) 59--71, 2011.","paperID":"None"},{"content":"Joseph 'Jofish' Kaye , Janet Vertesi , Shari Avery , Allan Dafoe , Shay David , Lisa Onaga , Ivan Rosero , Trevor Pinch, To have and to hold: exploring the personal archive, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124814"},{"content":"David S. Kirk , Abigail Sellen, On human remains: Values and practice in the home archiving of cherished objects, ACM Transactions on Computer-Human Interaction (TOCHI), v.17 n.3, p.1-43, July 2010","paperID":"1806924"},{"content":"Matthew G. Kirschenbaum, Mechanisms: New Media and the Forensic Imagination, The MIT Press, 2008","paperID":"1355324"},{"content":"A. Leigh. Lucy is \"enceinte\": the power of an action in defining a work. In Works as Entities for Information Retrieval. R. Smiraglia, ed. New York: Haworth Information Press, 99--127, 2002.","paperID":"None"},{"content":"S. Lubetzky. Principles of cataloging. Report for U.S. Office of Education grant OE-1--7-071089--4284. Los Angeles,: UCLA Institute of Library Research, 1969.","paperID":"None"},{"content":"C. Marshall. Digital copies and a distributed notion of reference in personal archives. In Digital Media: Technological and Social Challenges of the Interactive World. M. Winget and B. Aspray, eds. Lanham, MD: Scarecrow Press, 2011.","paperID":"None"},{"content":"J. McDonough, et al. Twisty little passages almost all alike: applying the FRBR model to a classic computer game. Digital Humanities Quarterly 4(2), 2010. Available at http://digitalhumanities.org/dhq/vol/4/2/000089/00008 9.html. Last accessed August 28, 2012.","paperID":"None"},{"content":"S. McEathron. Cartographic materials as works. In Works as Entities for Information Retrieval. R. Smiraglia, ed. New York: Haworth Information Press,181--191, 2002.","paperID":"None"},{"content":"J. McGann. A critique of modern textual criticism. Chicago: University of Chicago Press, 1983.","paperID":"None"},{"content":"J. McGann, ed. Rossetti Archive. Available at: http://www.rossettiarchive.org/. Last accessed September 2, 2012.","paperID":"None"},{"content":"OCLC. WorldCat catalog. Available at http://www.oclc.org/worldcat/default.htm. Last accessed August 31, 2012.","paperID":"None"},{"content":"William Odom , James Pierce , Erik Stolterman , Eli Blevis, Understanding why we preserve some things and discard others in the context of interaction design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518862"},{"content":"E. O'Neill. and D. Vizine-Goetz. Bibliographic relationships: implications for the structure of the catalog. In The Conceptual Foundations of Descriptive Cataloging. E. Svenonius, ed. San Diego, CA: Academic Press, Inc., 167--195, 1989.","paperID":"None"},{"content":"Daniela Petrelli , Steve Whittaker, Family memories in the home: contrasting physical and digital mementos, Personal and Ubiquitous Computing, v.14 n.2, p.153-169, February  2010","paperID":"1731502"},{"content":"A. Renear and D. Dubin. Three of the FRBR Group 1 entities are roles not types. Proceedings of ASIST 2007.","paperID":"None"},{"content":"R. Smiraglia. The nature of \"a work\": implications for the organization of knowledge. Lanham, MD: Scarecrow Press, 2001.","paperID":"None"},{"content":"Elaine Svenonius, The intellectual foundation of information organization, MIT Press, Cambridge, MA, 2000","paperID":"336980"},{"content":"G. T. Tanselle. Textual criticism and scholarly editing. Charlottesville, VA: University of Virginia Press., 1990.","paperID":"None"},{"content":"Steve Whittaker , Julia Hirschberg, The character, value, and management of personal paper archives, ACM Transactions on Computer-Human Interaction (TOCHI), v.8 n.2, p.150-170, June 2001","paperID":"376932"},{"content":"P. Wilson. The second objective. In The Conceptual Foundations of Descriptive Cataloging. E. Svenonius, ed. San Diego, CA: Academic Press, Inc., 5--16, 1989.","paperID":"None"},{"content":"M. Yee. The concept of work for moving image materials. Cataloging and Classification Quarterly 18(2): 33--40, 1993.","paperID":"None"},{"content":"M. Yee. What is a work? Part 4: cataloging theorists and a definition abstract. Cataloging and Classification Quarterly 20(2): 3--24, 1999.","paperID":"None"}],"abstract":"To understand activities of personal collecting and preservation, HCI researchers have investigated why people become attached to particular objects. These studies have examined ways that people relate to physical and digital objects, observing, for example, that people tend to cherish physical objects more than digital ones. This paper proposes that the value of digital objects may inhere less in an object's identity as a particular item and more in the object's ability to provide access to an intellectual work. The work, a familiar concept in information studies and textual studies, designates a general product of intellectual creation that may be instantiated in many versions. (For example, Shakespeare's Hamlet exists in many editions and forms, which may differ in both content and carrier and yet still are all Hamlet.) The paper demonstrates how the concept of the work can extend research on the perceived value of digital objects. It also shows how a flexible definition of the work can reveal new aspects of a design situation.","video":"http://www.youtube.com/embed/G1PcZ_p0cZo?rel=0","title":"Beyond digital and physical objects: the intellectual work as a concept of interest for HCI","filename":"CHI13/p3317","authors":["Melanie Feinberg"],"conference":"CHI '13"}