{"paperId":2466129,"citation":[],"reference":[{"content":"N. Garrett, \"Computer-Assisted Language Learning Trends and Issues Revisited: Integrating Innovation,\" The Modern Language Jounral, 2009.","paperID":"None"},{"content":"S. J. Savignon, \"Communicative Language Teaching: Linguistic Theory and Classroom Practice,\" in Interpreting Communicative Language Teaching, 2002.","paperID":"None"},{"content":"G. Stahl, \"Building Collaborative Knowing,\" in What We Know About CSCL, 2004.","paperID":"None"},{"content":"D. Musumeci, \"The Use of Technology in High-Enrollment Courses: Implications for Teacher Education and Communicative Language Teaching,\" in Interpreting Communicative Language Teaching, 2002.","paperID":"None"},{"content":"S. Bax, \"CALL - past, present, and future,\" System, 2003.","paperID":"None"},{"content":"K. Charmaz, Constructing Grounded Theory, 2005.","paperID":"None"},{"content":"R. M. Emerson, R. I. Fretz and L. L. Shaw, \"Writing ethnographic fieldnotes,\" 1995.","paperID":"None"},{"content":"V. Cook, \"Using the First Language in the Classroom,\" in The Canadian Modern Language Review, 2001.","paperID":"None"},{"content":"R. Lyster and L. Ranta, \"Corrective feedback and learner uptake: negotiation of form in communicative classrooms,\" in Studies in second language acquisition, 1997.","paperID":"None"},{"content":"Izdihar Jamil , Kenton O'Hara , Mark Perry , Abhijit Karnik , Sriram Subramanian, The effects of interaction techniques on talk patterns in collaborative peer learning around interactive tables, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979393"},{"content":"Darren Edge , Elly Searle , Kevin Chiu , Jing Zhao , James A. Landay, MicroMandarin: mobile language learning in context, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979413"},{"content":"Tony Bergstrom , Karrie Karahalios, Conversation clusters: grouping conversation topics through human-computer dialog, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1519060"},{"content":"Madeline Balaam , Geraldine Fitzpatrick , Judith Good , Rosemary Luckin, Exploring affective technologies for the classroom with the subtle stone, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753568"},{"content":"C. Greene, K. Keogh, T. Koller, J. Wagner, M. Ward and J. van Genabith, \"Using NLP Technology in CALL,\" in STIL/UCALL, 2004.","paperID":"None"},{"content":"Philipp Koehn, Enabling monolingual translators: post-editing vs. options, Human Language Technologies: The 2010 Annual Conference of the North American Chapter of the Association for Computational Linguistics, p.537-545, June 02-04, 2010, Los Angeles, California","paperID":"1858077"},{"content":"Taehyun Park , Edward Lank , Pascal Poupart , Michael Terry, Is the sky pure today? AwkChecker: an assistive tool for detecting and correcting collocation errors, Proceedings of the 21st annual ACM symposium on User interface software and technology, October 19-22, 2008, Monterey, CA, USA","paperID":"1449736"},{"content":"Anne Marie Piper , Nadir Weibel , James D. Hollan, A pen-based toolkit for authoring collaborative language activities, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion, February 11-15, 2012, Seattle, Washington, USA","paperID":"2141597"},{"content":"O. Kagan and K. Dillon, \"A New Perspective on Teaching Russian: Focus on the Heritage Learner.,\" The Slavic and East European Journal, 2001.","paperID":"None"}],"abstract":"We present the results of a two-month ethnographic study of three introductory Russian classrooms. Through observation and interviews, we identify several distinct roles played by physical artifacts in the classrooms, such as providing a reference to necessary foreign-language material and serving as props in creative role-play. The range of roles taken on by artifacts and the attitudes students have toward them provide a basis for our discussion about how technology might be more effectively introduced into the socially negotiated environment of the introductory foreign-language classroom. We identify the need to balance between collaborative and personal technology in a stressful, but social, context. Our findings inform a range of roles that technology can undertake in replacing or augmenting existing classroom artifacts.","video":"http://www.youtube.com/embed/3OXyb8aJx00?rel=0","title":"Challenges and opportunities for technology in foreign language classrooms","filename":"CHI13/p1011","authors":["Katie Kuksenok","Michael Brooks","Qian Wang","Charlotte P. Lee"],"conference":"CHI '13"}