{"paperId":2466256,"citation":[{"content":"Katie O'Leary , Jordan Eschler , Logan Kendall , Lisa M. Vizer , James D. Ralston , Wanda Pratt, Understanding Design Tradeoffs for Health Technologies: A Mixed-Methods Approach, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702576"},{"content":"Bahador Saket , Sijie Yang , Hong Tan , Koji Yatani , Darren Edge, TalkZones: section-based time support for presentations, Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, September 23-26, 2014, Toronto, ON, Canada","paperID":"2628399"},{"content":"Andrew Garbett , Jamie K. Wardman , Ben Kirman , Conor Linehan , Shaun Lawson, Anti-social media: communicating risk through open data, crime maps and locative media, Proceedings of HCI Korea, p.145-152, December 10-12, 2014, Seoul, Republic of Korea","paperID":"2729508"}],"reference":[{"content":"Anandarajan, M., Paravastu, N. and Simmers, C. A. Perceptions of personal web usage in the workplace: A Q-Methodology approach. Cyberpsychology and Behavior, 9, 3 (2006), 325--335.","paperID":"None"},{"content":"Michael L. Best , Edem Wornyo , Thomas N. Smyth , John Etherton, Uses of mobile phones in post-conflict Liberia, Proceedings of the 3rd international conference on Information and communication technologies and development, April 17-19, 2009, Doha, Qatar","paperID":"1812577"},{"content":"Brown, S. R. Political subjectivity: Applications of Q Methodology in political science. Yale University Press, New Haven, 1980.","paperID":"None"},{"content":"Carroll, J. M. Five reasons for scenario-based design. Interacting with Computers, 13, 1 (2000), 43--60.","paperID":"None"},{"content":"Dunne, A. and Raby, F. Design noir: The secret life of electronic objects. August Media, Boston, MA, 2001.","paperID":"None"},{"content":"Dziopa, F. and Ahern, K. A systematic literature review of the applications of Q-Technique and its methodology. Methodology: European J. of Research Methods for the Behavioral and Social Sciences, 7, 2 (2011), 39--55.","paperID":"None"},{"content":"Friedman, B. Value sensitive design. In W. S. Bainbridge (ed.), Encyclopedia of Human-Computer Interaction, Berkshire Publishing Group, Great Barrington, MA, (2004), 769--774.","paperID":"None"},{"content":"William W. Gaver , Andrew Boucher , Sarah Pennington , Brendan Walker, Cultural probes and the value of uncertainty, interactions, v.11 n.5, September + October 2004","paperID":"1015555"},{"content":"Joan M. Greenbaum , M. Kyng, Design at Work: Cooperative Design of Computer Systems, L. Erlbaum Associates Inc., Hillsdale, NJ, 1991","paperID":"574738"},{"content":"Hassenzahl, M., & Wessler, R. Capturing design space from a user perspective: The repertory grid technique revisited. International Journal of Human- Computer Interaction, 3-4,12, (2000), 441--459.","paperID":"None"},{"content":"Holtzblatt, K. and Jones, S. Contextual inquiry: A participatory technique for system design. In Participatory Design: Principles and Practices, D. Schuler and A. Namioka (Eds). Lawrence Erlbaum, Hillsdale, NJ, (1993), 177--210.","paperID":"None"},{"content":"Finn Kensing , Kim Halskov Madsen, Generating visions: future workshops and metaphorical design, Design at work: cooperative design of computer systems, L. Erlbaum Associates Inc., Hillsdale, NJ, 1992","paperID":"125433"},{"content":"Kim, J., and Mueller, C. W. Factor analysis: Statistical methods and practical issues. Sage Publications, Newbury Park, CA, 1978.","paperID":"None"},{"content":"McKeown, B. and Thomas, D. Q Methodology. Sage Publications, Newbury Park, CA, 1988.","paperID":"None"},{"content":"Meloche, J. A. Q Methodology as a research methodology for human computer interaction. In Proc. OzCHI 1999, Charles Sturt University, (1999), 149--152.","paperID":"None"},{"content":"Moggridge, B. Futures and alternative nows. In Designing Interactions. M.I.T. Press, Cambridge, MA, (2007), 587--611.","paperID":"None"},{"content":"Lisa P. Nathan , Predrag V. Klasnja , Batya Friedman, Value scenarios: a technique for envisioning systemic effects of new technologies, CHI '07 Extended Abstracts on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, CA, USA","paperID":"1241046"},{"content":"Jakob Nielsen, Usability Engineering, Morgan Kaufmann Publishers Inc., San Francisco, CA, 1993","paperID":"529793"},{"content":"Katie O'Leary , Charles Delahunt , Patricia Dowden , Ivan Darmansya , Jiaqi Heng , Eve A. Riskin , Richard E. Ladner , Jacob O. Wobbrock, Design goals for a system for enhancing AAC with personalized video, Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility, October 22-24, 2012, Boulder, Colorado, USA","paperID":"2384964"},{"content":"Dan Shapiro, The limits of ethnography: combining social sciences for CSCW, Proceedings of the 1994 ACM conference on Computer supported cooperative work, p.417-428, October 22-26, 1994, Chapel Hill, North Carolina, USA","paperID":"193064"},{"content":"Stephenson, W. The study of behavior: Q-Technique and its methodology. Univ. of Chicago Press, Chicago, IL, (1953).","paperID":"None"},{"content":"Stephenson, W. Correlating persons instead of tests. Character and Personality, 4, (1935), 17--24.","paperID":"None"},{"content":"Watts, S. and Stenner, P. Doing Q Methodological research: Theory, method and interpretation. Sage, Los Angeles, CA, 2012.","paperID":"None"},{"content":"Watts, S. and Stenner, P. Doing Q methodology: theory, method and interpretation. Qualitative Research in Psychology, 2, 1 (2005), 67--91.","paperID":"None"},{"content":"Terry Winograd , Fernando Flores, Understanding Computers and Cognition: A New Foundation for Design, Addison-Wesley Longman Publishing Co., Inc., Boston, MA, 1987","paperID":"576359"}],"abstract":"A \"discount\" version of Q-methodology for HCI, called \"HCI-Q\", can be used in iterative design cycles to explore, from the point of view of users and other stakeholders, what makes technologies personally significant. Initially, designers critically reflect on their own assumptions about how a design may affect social and individual behavior. Then, designers use these assumptions as stimuli to elicit other people's points of view. This process of critical self-reflection and evaluation helps the designer to assess the fit between a design and its intended social context of use. To demonstrate the utility of HCI-Q for research and design, we use HCI-Q to explore stakeholders' responses to a prototype Alternative and Augmentative Communication (AAC) application called Vid2Speech. We show that our adaptation of Q-methodology is useful for revealing the structure of consensus and conflict among stakeholder perspectives, helping to situate design within the context of relevant value tensions and norms.","video":"http://www.youtube.com/embed/-QIYRgg_zD0?rel=0","title":"Q-methodology as a research and design tool for HCI","filename":"CHI13/p1941","authors":["Kathleen O'Leary","Jacob O. Wobbrock","Eve A. Riskin"],"conference":"CHI '13"}