{"paperId":2466124,"citation":[{"content":"Shad Gross, Material and Meaning in Tangible Interactions, Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, January 15-19, 2015, Stanford, California, USA","paperID":"2691609"},{"content":"Shad Gross, Glitch, please: datamoshing as a medium-specific application of digital material, Proceedings of the 6th International Conference on Designing Pleasurable Products and Interfaces, September 03-05, 2013, Newcastle upon Tyne, United Kingdom","paperID":"2513525"}],"reference":[{"content":"Bardzell, J. (2007) Creativity in Amateur Multimedia: Popular Culture, Critical Theory, and HCI. Human Technology 3(1), 12--33.","paperID":"None"},{"content":"Barnard, M. (2001) Approaches to understanding visual culture. PALGRAVE, New York.","paperID":"None"},{"content":"Leah Buechley , Daniela K. Rosner , Eric Paulos , Amanda Williams, DIY for CHI: methods, communities, and values of reuse and customization, CHI '09 Extended Abstracts on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1520750"},{"content":"Burgess, J. (2007) Vernacular Creativity and New Media. Doctoral Dissertation. Queensland University of Technology, Queensland.","paperID":"None"},{"content":"J. M. Carroll , W. A. Kellogg, Artifact as theory-nexus: hermeneutics meets theory-based design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.7-14, March 1989","paperID":"67452"},{"content":"Carroll N. (1985) Specificity of media in the arts. Jrnl. of Aesthetic Education 19(4), 5--20.","paperID":"None"},{"content":"Davies, D. (2005) Medium in art. In Levinson J (Ed.) The Oxford Handbook of Aesthetics, Oxford University Press.","paperID":"None"},{"content":"Nicholas Davis , Boyang Li , Brian O'Neill , Mark Riedl , Michael Nitsche, Distributed creative cognition in digital filmmaking, Proceedings of the 8th ACM conference on Creativity and cognition, November 03-06, 2011, Atlanta, Georgia, USA","paperID":"2069654"},{"content":"Doane M A (2007) The indexical and the concept of medium specificity. Differences 18(1) (2007), 397--408.","paperID":"None"},{"content":"Eglash, R. (2004) Appropriating Technology: An Introduction In: Appropriating Technology: Vernacular Science and Social. U of Minnesota Press.","paperID":"None"},{"content":"Gerhard Fischer, Beyond interaction: meta-design and cultures of participation, Proceedings of the 23rd Australian Computer-Human Interaction Conference, p.112-121, November 28-December 02, 2011, Canberra, Australia","paperID":"2071553"},{"content":"Fischer, G. (2000) \"Social Creativity, Symmetry of Ignorance and Meta-Design,\" Knowledge Based Systems Jrnl 13(7--8), 527--537.","paperID":"None"},{"content":"Harwood, T. (2011) Towards a Manifesto for Machinima. Jrnl of Visual Culture 10(6), 7--12.","paperID":"None"},{"content":"Kaye, J., Williams, A., Oehlberg, L. (2011) Tinkering, Crafts and Inventive Leisure Practices. Proc. CSCW'11. ACM.","paperID":"None"},{"content":"Kow, Y. M. and Nardi, B. (2010) Culture and Creativity: World of Warcraft Modding in China and the US. In Bainbridge, W.S. (Ed.), Online Worlds: Convergence of the Real and the Virtual. Springer, London.","paperID":"None"},{"content":"Stacey Kuznetsov , Eric Paulos, Rise of the expert amateur: DIY projects, communities, and cultures, Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, October 16-20, 2010, Reykjavik, Iceland","paperID":"1868950"},{"content":"Lowood, H. (2008) Found Technology: Players as Innovators in the Making of Machinima. In McPherson, T. (Ed.) Digital Youth, Innovation, and the Unexpected. MIT Press.","paperID":"None"},{"content":"Lowood, H. and Nitsche, M. (2011) Introduction. In Lowood, H. and Nitsche, M. (Ed.), The Machinima Reader. MIT Press, Cambridge.","paperID":"None"},{"content":"Lowood, H. (2006) Storyline, Dance/Music, or PvP? Game Movies and Community Players in World of Warcraft. Games and Culture 1(4), 362--382.","paperID":"None"},{"content":"Manovich, L. (2002) The Language of New Media. MIT Press.","paperID":"None"},{"content":"Martindale, C. (1990) The Clockwork Muse: The Predictability of Artistic Change. Basic Books.","paperID":"None"},{"content":"Nardi, B. and Kallinikos, J. (2010) Technology, Agency and Community: The Case of Modding in World of Warcraft, in Holmstrøm, J., Wiberg, M. and Lund, A. (eds) Industrial Informatics Design, Use and Innovation: Perspectives and Services. New York: Information Science Reference (IGI Global).","paperID":"None"},{"content":"Ogden, C., Richards, I.A. (1923) The Meaning of Meaning. Mariner Books, New York.","paperID":"None"},{"content":"Tyler Pace , Jeffrey Bardzell , Shaowen Bardzell, Collective creativity: the emergence of World of Warcraft machinima, Proceedings of the 25th BCS Conference on Human-Computer Interaction, July 04-08, 2011, Newcastle-upon-Tyne, United Kingdom","paperID":"2305380"},{"content":"Daniela K. Rosner , Kimiko Ryokai, Reflections on craft: probing the creative process of everyday knitters, Proceedings of the seventh ACM conference on Creativity and cognition, October 26-30, 2009, Berkeley, California, USA","paperID":"1640264"},{"content":"Sawyer, R.K. (2000) Improvisation and the Creative Process: Dewey, Collingwood, and the Aesthetics of Spontaneity. Jrnl. of Aesthetics & Art Criticism, 58, 149--161.","paperID":"None"},{"content":"Schneiderman, B. (2002) Creating creativity: User interfaces for supporting innovation. In Carroll, J. M. (Ed.) Human-computer interaction in the new millennium. Addison-Wesley, Boston, 235--258.","paperID":"None"}],"abstract":"In recent years, HCI has shown a rising interest in the creative practices associated with massive online communities, including crafters, hackers, DIY, and other expert amateurs. One strategy for researching creativity at this scale is through an analysis of a community's outputs, including its creative works, custom created tools, and emergent practices. In this paper, we offer one such case study, a historical account of World of Warcraft (WoW) machinima (i.e., videos produced inside of video games), which shows how the aesthetic needs and requirements of video making community coevolved with the community-made creativity support tools in use at the time. We view this process as inhabiting different layers and practices of appropriation, and through an analysis of them, we trace the ways that support for emerging stylistic conventions become built into creativity support tools over time.","video":"http://www.youtube.com/embed/Z9bTLj94460?rel=0","title":"Machinima production tools: a vernacular history of a creative medium","filename":"CHI13/p971","authors":["Shad Gross","Tyler Pace","Jeffrey Bardzell","Shaowen Bardzell"],"conference":"CHI '13"}