{"paperId":2466230,"citation":[{"content":"Celine Latulipe , Amy Gatto , Ha T. Nguyen , David P. Miller , Sara A. Quandt , Alain G. Bertoni , Alden Smith , Thomas A. Arcury, Design Considerations for Patient Portal Adoption by Low-Income, Older Adults, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702392"}],"reference":[{"content":"Andreassen, H.K. et al. Patients who use e-mediated communication with their doctor. Qualitative health research 16, 2 (2006), 238--248.","paperID":"None"},{"content":"Beckjord, E.B., et al. Use of the Internet to Communicate with Health Care Providers in the USA. JMIR 9, 3 (2007), e20.","paperID":"None"},{"content":"Beisecker, A.E. Patient Power in Doctor-Patient Communication. Health Communication 2, 2 (1990), 105--122.","paperID":"None"},{"content":"Charmaz, K. Constructing grounded theory. Sage Publications, London; Thousand Oaks, Calif., 2006.","paperID":"None"},{"content":"Yunan Chen , Victor Ngo , Sidney Harrison , Victoria Duong, Unpacking exam-room computing: negotiating computer-use in patient-physician interactions, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979438"},{"content":"Yunan Chen , Charlotte Tang , Karen Cheng , Sun Young Park, Bridging clinical and non-clinical health practices: opportunities and challenges, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2212705"},{"content":"Erik Frøkjær , Morten Hertzum , Kasper Hornbæk, Measuring usability: are effectiveness, efficiency, and satisfaction really correlated?, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.345-352, April 01-06, 2000, The Hague, The Netherlands","paperID":"332455"},{"content":"Goel, M.S. et al. Patient reported barriers to enrolling in a patient portal. JAMIA 18, Suppl 1 (2011), i8--i12.","paperID":"None"},{"content":"Katz, S.J. and Moyer, C.A. The emerging role of online communication between patients and their providers. JGIM 19, 9 (2004), 978--983.","paperID":"None"},{"content":"Liederman, E.M. et al. The impact of patient-physician Web messaging on provider productivity. JHIM 19, 2 (2005), 81--86.","paperID":"None"},{"content":"Liederman, E.M. Web Messaging: A New Tool for Patient-Physician Communication. JAMIA 10, 3 (2003), 260--270.","paperID":"None"},{"content":"Lin, C.-T. et al. An Internet-Based Patient-Provider Communication System. JMIR 7, 4 (2005), e47.","paperID":"None"},{"content":"Maddigan, S.L., Majumdar, S.R., and Johnson, J.A. Understanding the complex associations between patient--provider relationships, self-care behaviours, and health-related quality of life in type 2 diabetes. Quality of Life Research 14, 6 (2005), 1489--1500.","paperID":"None"},{"content":"Jim Milewski , Hector Parra, Gathering requirements for a personal health management system, Proceedings of the 12th ACM international conference adjunct papers on Ubiquitous computing - Adjunct, September 26-29, 2010, Copenhagen, Denmark","paperID":"1864464"},{"content":"Moyer, C.A. et al. Bridging the electronic divide. AJMC 8, 5 (2002), 427--433.","paperID":"None"},{"content":"Nagykaldi, Z. et al. Impact of a Wellness Portal on the Delivery of Patient-Centered Preventive Care. JABFM 25, 2 (2012), 158--167.","paperID":"None"},{"content":"Aisling Ann O'Kane , Helena Mentis, Sharing medical data vs. health knowledge in chronic illness care, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2223812"},{"content":"Ong, L.M.L. et al. Doctor-patient communication: A review of the literature. Social Science & Medicine 40, 7 (1995), 903--918.","paperID":"None"},{"content":"Osborn, C.Y., Rosenbloom, S.T., Stenner, S.P., Anders, S., Muse, S., Johnson, K.B., Jirjis, J., Jackson, G.P. MyHealthAtVanderbilt: policies and procedures governing patient portal functionality. JAMIA 18 Suppl 1, (2011), i18--23.","paperID":"None"},{"content":"Ostbye, T. et al. Is There Time for Management of Patients With Chronic Diseases in Primary Care? The Annals of Family Medicine 3, 3 (2005), 209--214.","paperID":"None"},{"content":"Laura Pfeifer Vardoulakis , Amy Karlson , Dan Morris , Greg Smith , Justin Gatewood , Desney Tan, Using mobile phones to present medical information to hospital patients, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208601"},{"content":"Ralston, J.D. et al. Patient Web Services Integrated with a Shared Medical Record. JAMIA 14, 6 (2007), 798--806.","paperID":"None"},{"content":"Rodin, G. et al. Clinician-patient communication: a systematic review. Supportive Care in Cancer 17, 6 (2009), 627--644.","paperID":"None"},{"content":"Rosen, P. and Kwoh, C.K. Patient-Physician E-mail: An Opportunity to Transform Pediatric Health Care Delivery. PEDIATRICS 120, 4 (2007), 701--706.","paperID":"None"},{"content":"mc schraefel , Paul André , Ryen White , Desney Tan , Tim Berners-Lee , Sunny Consolvo , Robert Jacobs , Issac Kohane , Christopher A. Le Dantec , Lena Mamykina , Gary Marsden , Ben Shneiderman , Peter Szolovits , Daniel Weitzner, Interacting with eHealth: towards grand challenges for HCI, CHI '09 Extended Abstracts on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1520476"},{"content":"Shilling, V., Jenkins, V., and Fallowfield, L. Factors affecting patient and clinician satisfaction with the clinical consultation Psycho-Oncology 12, 6 (2003), 599--611.","paperID":"None"},{"content":"Stewart, M.A. Effective physician-patient communication and health outcomes. CMAJ 152, 9 (1995), 1423--1433.","paperID":"None"},{"content":"Strauss, A.L. Social organization of medical work. Transaction publ, New Brunswick (N. J.); London, 1997.","paperID":"None"},{"content":"Sutcliffe, K.M., Lewton, E., and Rosenthal, M.M. Communication failures: an insidious contributor to medical mishaps. JAAMC 79, 2 (2004), 186--194.","paperID":"None"},{"content":"Tai-Seale, M., McGuire, T.G., and Zhang, W. Time Allocation in Primary Care Office Visits. Health Services Research 42, 5 (2007), 1871--1894.","paperID":"None"},{"content":"Teutsch, C. Patient--doctor communication. Medical Clinics of North America 87, 5 (2003), 1115--1145.","paperID":"None"},{"content":"Kenton T. Unruh , Meredith Skeels , Andrea Civan-Hartzler , Wanda Pratt, Transforming clinic environments into information workspaces for patients, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753354"},{"content":"Wade-Vuturo, A.E., Mayberry, L.S., and Osborn, C.Y. Secure messaging and diabetes management. JAMIA, (2012 Dec 15) {Epub ahead of print}.","paperID":"None"},{"content":"Walker, J. et al. Inviting patients to read their doctors' notes: patient and physician surveys. Annals of Internal Medicine 155, 12 (2011), 811--819.","paperID":"None"},{"content":"Walker, M.S., Ristvedt, S.L., and Haughey, B.H. Patient care in multidisciplinary cancer clinics. PsychoOncology 12, 3 (2003), 291--300.","paperID":"None"},{"content":"Xiaomu Zhou , Mark S. Ackerman , Kai Zheng, I just don't know why it's gone: maintaining informal information use in inpatient care, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1519014"},{"content":"Xiaomu Zhou , Mark S. Ackerman , Kai Zheng, Doctors and psychosocial information: records and reuse in inpatient care, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753592"},{"content":"Zhou, Y.Y. et al. Patient access to an electronic health record with secure messaging. AJMC 13, 7 (2007), 418-- 424.","paperID":"None"},{"content":"Zickmund, S.L. et al. Interest in the Use of Computerized Patient Portals. JGIM 23, S1 (2007), 20--26.","paperID":"None"}],"abstract":"The patient portal is a relatively new healthcare information technology that enables patients more convenient access to their healthcare information and allows them to send messages to their doctors. Our study examines the themes discussed in these messages and the different ways in which patients communicate with their providers via a portal employed in a large medical center. We also explore the differences between the patient portal and more traditional communication media, and investigated the advantages and potential problems of the portal system. Our findings show a wide variety of topics discussed in the communication messages (such as medication, appointments, laboratory tests, etc.) and how patients provide information, consult with their providers, and express psychosocial and emotional needs. We argue that the patient portal improves the accuracy of communication and could facilitate illness management for patients, especially over a longer term. However, messaging through the patient portal is not popular among patients and the simultaneous use of multiple communication media may create information gaps. More research is needed to better elucidate barriers to the use of patient portals and the optimal methods of communication and information integration given different contexts.","video":"http://www.youtube.com/embed/ulw2MnIaBdU?rel=0","title":"Messaging to your doctors: understanding patient-provider communications via a portal system","filename":"CHI13/p1739","authors":["Si Sun","Xiaomu Zhou","Joshua C. Denny","Trent S. Rosenbloom","Hua Xu"],"conference":"CHI '13"}