{"paperId":2466201,"citation":[{"content":"Gillian Smith, Understanding procedural content generation: a design-centric analysis of the role of PCG in games, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557341"}],"reference":[{"content":"Philip E. Agre, Computation and Human Experience, Cambridge University Press, New York, NY, 1997","paperID":"522884"},{"content":"Erik Andersen, Optimizing adaptivity in educational games, Proceedings of the International Conference on the Foundations of Digital Games, May 29-June 01, 2012, Raleigh, North Carolina","paperID":"2282398"},{"content":"Baber, C. Cognition and Tool Use: Forms of Engagement in Human and Animal Use of Tools. Taylor & Francis, London, 2003.","paperID":"None"},{"content":"Bellotti, F., Berta, R., De Gloria, A., and Primavera, L. Adaptive experience engine for serious games. IEEE Transactions on Computational Intelligence and AI in Games 1, 4 (2009), 264--280.","paperID":"None"},{"content":"Bodine, R., and Crawford, D. The Handbook of Conflict Resolution Education: A Guide to Building Quality Programs in Schools. Jossey-Bass Inc. Publishers, 1998.","paperID":"None"},{"content":"Boehner, K., David, S., Kaye, J., and Sengers, P. Critical technical practice as a methodology for values in design. In Proc. CHI 2005 Workshop on Quality, Value(s) and Choice, ACM Press (2005).","paperID":"None"},{"content":"Caroll, J. M., Mack, R. L., and Kellogg, W. A. Interface metaphors and user interface design. In Handbook of Human-Computer Interaction, M. Helander, Ed. Elsevier Science Publishers, 1988, 67--85.","paperID":"None"},{"content":"Nancy J. Cooke, Varieties of knowledge elicitation techniques, International Journal of Human-Computer Studies, v.41 n.6, p.801-849, Dec. 1994","paperID":"210576"},{"content":"Fernandez-Vara, C., and Thomson, A. Procedural generation of narrative puzzles in adventure games: The puzzle-dice system. In Proc. Procedural Content Generation in Games 2012. ACM Press, 2012.","paperID":"None"},{"content":"Batya Friedman , Peter H. Kahn, Jr., Human values, ethics, and design, The human-computer interaction handbook: fundamentals, evolving technologies and emerging applications, L. Erlbaum Associates Inc., Hillsdale, NJ, 2002","paperID":"772147"},{"content":"Gearbox Software. Borderlands. Feral Interactive, October 2009.","paperID":"None"},{"content":"Harrison, S., Tatar, D., and Sengers, P. The three paradigms of HCI. In Proc. alt.chi 2007 (2007).","paperID":"None"},{"content":"Kenneth Hullett , Michael Mateas, Scenario generation for emergency rescue training games, Proceedings of the 4th International Conference on Foundations of Digital Games, April 26-30, 2009, Orlando, Florida","paperID":"1536538"},{"content":"Interactive Data Visualization, Inc. SpeedTree, 2002 - 2012. Computer software.","paperID":"None"},{"content":"Interactive Data Visualization, Inc. Speedtree utilities. http://www.speedtree.com/support/speedtree_utilities.htm, September 2012.","paperID":"None"},{"content":"S. Kazmi , I. J. Palmer, Action recognition for support of adaptive gameplay: a case study of a first person shooter, International Journal of Computer Games Technology, 2010, p.1-11, January 2010","paperID":"1961534"},{"content":"Rilla Khaled , Gordon Ingram, Tales from the front lines of a large-scale serious game project, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207688"},{"content":"Raph Koster , Will Wright, A Theory of Fun for Game Design, Paraglyph Press, 2004","paperID":"1207478"},{"content":"Lakoff, G., and Johnson, M. Metaphors We Live By. University of Chicago Press, 1980.","paperID":"None"},{"content":"Lawson, B., and Loke, S. M. Computers, words and pictures. Design Studies 18, 2 (1997), 171--183.","paperID":"None"},{"content":"Lopes, R., and Bidarra, R. Adaptivity challenges in games and simulations: A survey. IEEE Transactions on Computational Intelligence and AI in Games 3, 2 (2011), 85--99.","paperID":"None"},{"content":"Thomas W. Malone, What makes things fun to learn? heuristics for designing instructional computer games, Proceedings of the 3rd ACM SIGSMALL symposium and the first SIGPC symposium on Small systems, p.162-169, September 18-19, 1980, Palo Alto, California, USA","paperID":"802839"},{"content":"Nelson, M. J. Encoding and generating videogame mechanics. Tutorial at the 2012 IEEE Conference on Computational Intelligence and Games. http://www.kmjn.org/notes/generating_mechanics_bibliography.html, 2012.","paperID":"None"},{"content":"Mark J. Nelson , Michael Mateas, Towards Automated Game Design, Proceedings of the 10th Congress of the Italian Association for Artificial Intelligence on AI*IA 2007: Artificial Intelligence and Human-Oriented Computing, September 10-13, 2007, Rome, Italy","paperID":"1422119"},{"content":"Mark J. Nelson , Michael Mateas, An interactive game-design assistant, Proceedings of the 13th international conference on Intelligent user interfaces, January 13-16, 2008, Gran Canaria, Spain","paperID":"1378786"},{"content":"Niehaus, J., and Riedl, M. O. Scenario adaptation: An approach to customizing computer-based training games and simulations. In Proc. AIED 2009 Workshop on Intelligent Educational Games (2009), 89--98.","paperID":"None"},{"content":"Nitsche, M., Ashmore, C., Hankinson, W., Fitzpatrick, R., Kelly, J., and Margenau, K. Designing procedural game spaces: A case study. In Proc. FuturePlay 2006 (2006).","paperID":"None"},{"content":"Chris Pedersen , Julian Togelius , Georgios N. Yannakakis, Modeling player experience in super mario bros, Proceedings of the 5th international conference on Computational Intelligence and Games, p.132-139, September 07-10, 2009, Milano, Italy","paperID":"1719323"},{"content":"Rizzo, A., Graap, K., McLay, R. N., Perlman, K., Rothbaum, B. O., Reger, G., Parsons, T. D., Difede, J., and Pair, J. Virtual Iraq: Initial case reports from a VR exposure therapy application for combat-related post traumatic stress disorder. In Proc. Virtual Rehabilitation 2007 (2007), 124--130.","paperID":"None"},{"content":"Schmitt, S. World Machine. http://www.world-machine.com/, 2012. Computer software.","paperID":"None"},{"content":"Adam M. Smith , Erik Andersen , Michael Mateas , Zoran Popović, A case study of expressively constrainable level design automation tools for a puzzle game, Proceedings of the International Conference on the Foundations of Digital Games, May 29-June 01, 2012, Raleigh, North Carolina","paperID":"2282370"},{"content":"Smith, A. M., and Mateas, M. Computational caricatures: Probing the game design process with AI. In Proc. AIIDE Workshop on Artificial Intelligence in the Game Design Process, AAAI Press (2011), 19--24.","paperID":"None"},{"content":"Gillian Smith , Elaine Gan , Alexei Othenin-Girard , Jim Whitehead, PCG-based game design: enabling new play experiences through procedural content generation, Proceedings of the 2nd International Workshop on Procedural Content Generation in Games, p.1-4, June 28-28, 2011, Bordeaux, France","paperID":"2000926"},{"content":"Gillian Smith , Alexei Othenin-Girard , Jim Whitehead , Noah Wardrip-Fruin, PCG-based game design: creating Endless Web, Proceedings of the International Conference on the Foundations of Digital Games, May 29-June 01, 2012, Raleigh, North Carolina","paperID":"2282375"},{"content":"Gillian Smith , Jim Whitehead , Michael Mateas, Tanagra: a mixed-initiative level design tool, Proceedings of the Fifth International Conference on the Foundations of Digital Games, p.209-216, June 19-21, 2010, Monterey, California","paperID":"1822376"},{"content":"Robert St. Amant , Thomas E. Horton, Characterizing tool use in an interactive drawing environment, Proceedings of the 2nd international symposium on Smart graphics, p.86-93, June 11-13, 2002, Hawthorne, New York","paperID":"569018"},{"content":"Anne Sullivan , Michael Mateas , Noah Wardrip-Fruin, Rules of engagement: moving beyond combat-based quests, Proceedings of the Intelligent Narrative Technologies III Workshop, p.1-8, June 18-18, 2010, Monterey, California","paperID":"1822320"},{"content":"Julian Togelius , Emil Kastbjerg , David Schedl , Georgios N. Yannakakis, What is procedural content generation?: Mario on the borderline, Proceedings of the 2nd International Workshop on Procedural Content Generation in Games, p.1-6, June 28-28, 2011, Bordeaux, France","paperID":"2000922"},{"content":"Togelius, J., Nardi, R. D., and Lucas, S. M. Towards automatic personalised content creation for racing games. In Proc. Computational Intelligence and Games 2007, IEEE Press (2007), 252--259.","paperID":"None"},{"content":"Togelius, J., and Schmidhuber, J. An experiment in automatic game design. In Proc. Computational Intelligence and Games 2008, IEEE Press (2008), 111--118.","paperID":"None"},{"content":"Toy, M., Wichman, G., and Arnold, K. Rogue, 1980. Computer software.","paperID":"None"},{"content":"Treanor, M., Blackford, B., Mateas, M., and Bogost, I. Game-O-Matic: Generating videogames that represent ideas. In Proc. Procedural Content Generation in Games 2012, ACM Press (2012).","paperID":"None"},{"content":"Anna Vallgårda , Johan Redström, Computational composites, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240706"},{"content":"Walls, J. Police Quest. Sierra On-Line, 1987. Computer software.","paperID":"None"},{"content":"Douglas Wilson , Miguel Sicart, Now it's personal: on abusive game design, Proceedings of the International Academic Conference on the Future of Game Design and Technology, May 06-07, 2010, Vancouver, British Columbia, Canada","paperID":"1920785"},{"content":"Georgios N. Yannakakis , Julian Togelius, Experience-Driven Procedural Content Generation, IEEE Transactions on Affective Computing, v.2 n.3, p.147-161, July 2011","paperID":"2052020"}],"abstract":"Procedural content generation (PCG), the algorithmic creation of game content with limited or indirect user input, has much to offer to game design. In recent years, it has become a mainstay of game AI, with significant research being put towards the investigation of new PCG systems, algorithms, and techniques. But for PCG to be absorbed into the practice of game design, it must be contextualised within design-centric as opposed to AI or engineering perspectives. We therefore provide a set of design metaphors for understanding potential relationships between a designer and PCG. These metaphors are: tool, material, designer, and domain expert. By examining PCG through these metaphors, we gain the ability to articulate qualities, consequences, affordances, and limitations of existing PCG approaches in relation to design. These metaphors are intended both to aid designers in understanding and appropriating PCG for their own contexts, and to advance PCG research by highlighting the assumptions implicit in existing systems and discourse.","video":"http://www.youtube.com/embed/kUm1jSSLqhs?rel=0","title":"Design metaphors for procedural content generation in games","filename":"CHI13/p1509","authors":["Rilla Khaled","Mark J. Nelson","Pippin Barr"],"conference":"CHI '13"}