{"paperId":2466462,"reference":[{"content":"Sarah Fdili Alaoui , Baptiste Caramiaux , Marcos Serrano , Frédéric Bevilacqua, Movement qualities as interaction modality, Proceedings of the Designing Interactive Systems Conference, June 11-15, 2012, Newcastle Upon Tyne, United Kingdom","paperID":"2318071"},{"content":"Alač, M. (2008). Working with brain scans: Digital images and gestural interaction in fMRI laboratory. Social Studies of Science, 38(4), 483--508.","paperID":"None"},{"content":"Böscher, M. (2005). Social life under the microscope. Sociological Research Online, 10(1).","paperID":"None"},{"content":"Gallagher, S. & Zahavi, D. (2008). The phenomenological mind: An introduction to philosophy of mind and cognitive science. New York: Routledge.","paperID":"None"},{"content":"Goodwin, C. (1994). Professional vision. American Anthropologist, 96(3), 606--633.","paperID":"None"},{"content":"Goodwin, C. (2003). The semiotic body in its environment. In J. Coupland & R. Gwyn (Eds.), Discourses of the body. New York: Macmillan.","paperID":"None"},{"content":"Goodwin, C. (2003). \"Pointing as Situated Practice.\" In Sotaro Kita (Ed). Pointing: Where Language, Culture and Cognition Meet. Mahwah, NJ: Lawrence Erlbaum, pp. 217--41.","paperID":"None"},{"content":"Gopnik, A., & Meltzoff, A. N. (1997). Words, thoughts, and theories. Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Richard Harper , Helena Mentis, The mocking gaze: the social organization of kinect use, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441797"},{"content":"Heath, C. (2000). Configuring action in objects: From mutual space to media space. Mind, Culture and Activity, 7(1-2), 81--104.","paperID":"None"},{"content":"Hindmarsh, J. & Heath C. (2000). Embodied reference: A study of deixis in workplace interaction. Journal of Pragmatics, 32, 1855--1878.","paperID":"None"},{"content":"Laban, R. & Lawrence, F. C. (1947) Effort. London: McDonald and Evans Ltd.","paperID":"None"},{"content":"Laban, R. & Ullmann, L. (1971). Mastery of Movement. London: McDonald and Evans Ltd.","paperID":"None"},{"content":"Latour, B. (1990). Drawing things together. In M. Lynch & S. Woolgar (Eds.), Representation in Scientific practice (pp. 19--68). Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Lian Loke , Toni Robertson, Moving and making strange: An embodied approach to movement-based interaction design, ACM Transactions on Computer-Human Interaction (TOCHI), v.20 n.1, p.1-25, March 2013","paperID":"2442113"},{"content":"Lynch, M. (1985). Discipline and the material form of images: An analysis of scientific visibility. Social Studies of Science, 15, 37--66.","paperID":"None"},{"content":"Merleau-Ponty, M. (1962). Phenomenology of perception. Routledge.","paperID":"None"},{"content":"Megumi Masuda , Shohei Kato , Hidenori Itoh, A Laban-based approach to emotional motion rendering for human-robot interaction, Proceedings of the 9th international conference on Entertainment computing, September 08-11, 2010, Seoul, Korea","paperID":"1881723"},{"content":"Nagel, T. (1974). What Is it Like to Be a Bat? Philsophical Review, pp. 435--50.","paperID":"None"},{"content":"Newlove & Dalby (2005) Laban for All. London: Nick Hern Books.","paperID":"None"},{"content":"Nishizaka, A. (1997). The Neglected Situation of Vision.: Sage.","paperID":"None"},{"content":"Nishizaka A. (2000). Seeing what one sees: Perception, emotion and activity. Mind, Culture, and Activity, 7(12), 105--123.","paperID":"None"},{"content":"Kenton O'hara , Richard Harper , Helena Mentis , Abigail Sellen , Alex Taylor, On the naturalness of touchless: Putting the “interaction” back into NUI, ACM Transactions on Computer-Human Interaction (TOCHI), v.20 n.1, p.1-25, March 2013","paperID":"2442111"},{"content":"Toni Robertson , Lian Loke, Designing situations, Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7, November 23-27, 2009, Melbourne, Australia","paperID":"1738828"},{"content":"Ross, P .R. & Wensveen, A. G. (2010). Designing behavior in interaction: Using aesthetic experience as a mechanism for design. International Journal of Desigh, 4(2), 3--13.","paperID":"None"},{"content":"Sheets-Johnstone, M., (1999). Emotion and Movement - A beginning empirical-phenomenological analysis of their relationship. Journal of Consciousness Studies, 6(11-12), pp. 259--277.","paperID":"None"},{"content":"Subyen, P., Maranan, D. S., Carlson, K., Schiphorst, T., & Pasquier, P. (2011). Flow: Expressing movement quality. The User in Flux Workshop at CHI 2011, Vancouver, BC.","paperID":"None"},{"content":"Suchman, L. (2000). Embodied practices of engineering work. Mind, Culture and Activity, 7(1-2), 4--18.","paperID":"None"},{"content":"Wittgenstein, L. (1968). Philosophical Investigations. Blackwell, Oxford.","paperID":"None"}],"citation":[{"content":"Shannon Cuykendall , Ethan Soutar-Rau , Thecla Schiphorst, POEME: A Poetry Engine Powered by Your Movement, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2856339"},{"content":"Jules Françoise , Sarah Fdili Alaoui , Thecla Schiphorst , Frederic Bevilacqua, Vocalizing dance movement for interactive sonification of laban effort factors, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598582"},{"content":"Omid Alemi , Philippe Pasquier , Chris Shaw, Mova: Interactive Movement Analytics Platform, Proceedings of the 2014 International Workshop on Movement and Computing, June 16-17, 2014, Paris, France","paperID":"2618002"},{"content":"Jonas Fehr , Cumhur Erkut, Indirection between movement and sound in an interactive sound installation, Proceedings of the 2nd International Workshop on Movement and Computing, August 14-15, 2015, Vancouver, British Columbia, Canada","paperID":"2791016"},{"content":"Shannon Cuykendall , Ethan Soutar-Rau , Karen Cochrane , Jacob Freiberg , Thecla Schiphorst, Simply Spinning: Extending Current Design Frameworks for Kinesthetic Empathy, Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, January 15-19, 2015, Stanford, California, USA","paperID":"2680567"},{"content":"Diego Silang Maranan , Sarah Fdili Alaoui , Thecla Schiphorst , Philippe Pasquier , Pattarawut Subyen , Lyn Bartram, Designing for movement: evaluating computational models using LMA effort qualities, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557251"},{"content":"Shannon Cuykendall , Michael Junokas , Mohammad Amanzadeh , David Kim Tcheng , Yawen Wang , Thecla Schiphorst , Guy Garnett , Philippe Pasquier, Hearing movement: how taiko can inform automatic recognition of expressive movement qualities, Proceedings of the 2nd International Workshop on Movement and Computing, August 14-15, 2015, Vancouver, British Columbia, Canada","paperID":"2791004"},{"content":"Sarah Fdili Alaoui , Frederic Bevilacqua , Christian Jacquemin, Interactive Visuals as Metaphors for Dance Movement Qualities, ACM Transactions on Interactive Intelligent Systems (TiiS), v.5 n.3, October 2015","paperID":"2738219"},{"content":"Sarah Fdili Alaoui , Thecla Schiphorst , Shannon Cuykendall , Kristin Carlson , Karen Studd , Karen Bradley, Strategies for Embodied Design: The Value and Challenges of Observing Movement, Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition, June 22-25, 2015, Glasgow, United Kingdom","paperID":"2757238"},{"content":"Baptiste Caramiaux , Marco Donnarumma , Atau Tanaka, Understanding Gesture Expressivity through Muscle Sensing, ACM Transactions on Computer-Human Interaction (TOCHI), v.21 n.6, January 2015","paperID":"2687922"},{"content":"Helena M. Mentis , Jarmo Laaksolahti , Kristina Höök, My Self and You: Tension in Bodily Sharing of Experience, ACM Transactions on Computer-Human Interaction (TOCHI), v.21 n.4, p.1-26, August 2014","paperID":"2617945"}],"abstract":"With the increased availability of movement based interactive devices there is a growing interest in exploring the potential design space for engaging movement-based interactions. This has led to the exploration of different ways to sense and model movement such as Laban Movement Analysis' Effort qualities. However, little is understood in how movement qualities are perceived and experienced by users. We explored this in an interactive improvisational dance performance setting. From video analysis with a Laban Movement expert and post-performance interviews with audience members, we discuss the differences in how a movement quality was perceived. From these findings, we discuss implications for further efforts in designing interactive movement-based systems that strive to capitalize on movement qualities.","video":"http://www.youtube.com/embed/i8SJM4_4wu0?rel=0","title":"Seeing movement qualities","filename":"CHI13/p3375","authors":["Helena M. Mentis","Carolina Johansson"],"conference":"CHI '13"}