{"paperId":2466421,"citation":[{"content":"Ben Heuwing , Thomas Mandl , Christa Womser-Hacker, Evaluating a tool for the exploratory analysis of usability information using a cognitive walkthrough method, Proceedings of the 5th Information Interaction in Context Symposium, August 26-30, 2014, Regensburg, Germany","paperID":"2637033"},{"content":"Chauncey Wilson, User Interface Inspection Methods: A User-Centered Design Method, Morgan Kaufmann Publishers Inc., San Francisco, CA, 2013","paperID":"2821582"}],"reference":[{"content":"Randolph G. Bias, The pluralistic usability walkthrough: coordinated empathies, Usability inspection methods, John Wiley & Sons, Inc., New York, NY, 1994","paperID":"189211"},{"content":"Jakob Nielsen, Usability inspection methods, Conference Companion on Human Factors in Computing Systems, p.413-414, April 24-28, 1994, Boston, Massachusetts, USA","paperID":"260531"},{"content":"John Rieman , Marita Franzke , David Redmiles, Usability evaluation with the cognitive walkthrough, Conference Companion on Human Factors in Computing Systems, p.387-388, May 07-11, 1995, Denver, Colorado, USA","paperID":"223735"},{"content":"David E. Rowley , David G. Rhoades, The cognitive jogthrough: a fast-paced user interface evaluation procedure, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.389-395, May 03-07, 1992, Monterey, California, USA","paperID":"142869"},{"content":"Rick Spencer, The streamlined cognitive walkthrough method, working around social constraints encountered in a software development company, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.353-359, April 01-06, 2000, The Hague, The Netherlands","paperID":"332456"},{"content":"Wharton, C., Rieman, J., Lewis, C. and Polson, P. The cognitive walkthrough method: a practitioner's guide. Tech report: http://ics.colorado.edu/techpubs/pdf/9307.pdf (1994).","paperID":"None"}],"abstract":"Agile software teams' frequent releases and fast iterations present a growing need for rigorous user experience research methods that are faster, lighter-weight, and more flexible. To this end, we developed the Informal Cognitive Walkthrough (ICW). This agile research methodology grew organically, over the course of three years, while working with a very large agile software development team. ICWs involve conducting one or more Simplified 'Streamlined Cognitive Walkthroughs' (SSCW), followed by one or more Simplified 'Pluralistic Walkthroughs' (SPW). In this paper, we present the ICW and provide a real-world example of its application. Preliminary experiences with the method revealed potential advantages over traditional lab studies, ranging from more quickly uncovering and fixing usability issues, to a stronger collaboration between the disciplines, and to acting as a forcing function in aligning diverse engineers to deliver on a common user goal.","video":"http://www.youtube.com/embed/a8FJA2NrtdE?rel=0","title":"Informal cognitive walkthroughs (ICW): paring down and pairing up for an agile world","filename":"CHI13/p3093","authors":["Valentina Grigoreanu","Manal Mohanna"],"conference":"CHI '13"}