{"paperId":2466428,"citation":[{"content":"Jennifer Wu , Erica Mattingly , Philipp Kraemer, Communication in virtual environments, Computers in Human Behavior, v.52 n.C, p.59-64, November 2015","paperID":"2822615"}],"reference":[{"content":"Proffitt, D. R., Stefanucci, J., Banton, T., & Epstein, W. (2003). The role of effort in perceiving distance. Psychological Science, 14, 106--112.","paperID":"None"},{"content":"Creem-Regehr, S. H., Gooch, A. A., Sahm, C. S., & Thompson, W. B. (2004). Perceiving Virtual Geographical Slant: Action Influences Perception. Journal of Experimental Psychology: Human Perception and Performance, Vol 30(5), Oct 2004, 811--821.","paperID":"None"},{"content":"Biocca, F. (1997). The cyborg's dilemma: progressive embodiment in virtual environments. Journal of Computer-Mediated Communication, 3(2).","paperID":"None"},{"content":"Sundar, S. S., & Marathe, S. S. (2010). Personalization vs. customization: The importance of agency, privacy and power usage. Human Communication Research, 36, 298--322.","paperID":"None"},{"content":"Sundar, S. S. (2008). Self as source: Agency and customization in interactive media. In E. Konijn, S. Utz, M. Tanis, & S. Barnes (Eds.), Mediated interpersonal communication (pp. 58--74). New York: Routledge.","paperID":"None"}],"abstract":"Visual perception is dependent upon one's physical state. The apparent inclination of a hill is overestimated when the observer is carrying a heavy backpack. But, what if the hill is a virtual one and the user is about to navigate the virtual environment through an avatar? In a 2 (user with a backpack vs. user without the backpack) × 2 (avatar with a virtual backpack vs. avatar without a virtual backpack) × 2 (customized avatar vs. assigned avatar) between-subjects experiment (N = 121), participants estimated the hill as being steeper when using a customized avatar rather than an assigned one. When the avatar is encumbered by a heavy virtual backpack, those with a customized avatar perceived the virtual hill as being more difficult to climb. Avatar customization and the physical resources of the avatar (operationalized here in the form of a 'virtual' backpack) were found to be key predictors of embodied perception in virtual environments (VE). This has implications for the design of games and interventions that make use of VEs.","video":"http://www.youtube.com/embed/_FGNVOlwjY0?rel=0","title":"I feel for my avatar: embodied perception in VEs","filename":"CHI13/p3135","authors":["Sangseok You","S. Shyam Sundar"],"conference":"CHI '13"}