{"paperId":2466267,"reference":[{"content":"Cecilia R. Aragon , Sarah Poon , Claudio T. Silva, The changing face of digital science: new practices in scientific collaborations, CHI '09 Extended Abstracts on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1520749"},{"content":"Bardzell, J. Creativity in Amateur Multimedia: Popular Culture, Critical Theory, and HCI. Human Technology 3, (2007), 12--33.","paperID":"None"},{"content":"Jeffrey Bardzell, Interaction criticism: An introduction to the practice, Interacting with Computers, v.23 n.6, p.604-621, November, 2011","paperID":"2070200"},{"content":"Barnard, M. Approaches to understanding visual culture. Palgrave, NY, 2001.","paperID":"None"},{"content":"Blackwell, A. Visual Representation. In: Soegaard, M. and Dam, R.F. (Eds.), Encyclopedia of HumanComputer Interaction. Available at: http://www.interactiondesign.org/encyclopedia/visual_representation.thml","paperID":"None"},{"content":"Eli Blevis, Digital imagery as meaning and form in HCI and design: an introduction to the Visual Thinking Backpage Gallery, interactions, v.18 n.5, September + October 2011","paperID":"2008190"},{"content":"BlizzCon 2011 Contest Winners. Available at: http://us.battle.net/blizzcon/en/blog/3725481/BlizzCon_ 2011_Contest_Winners-10_21_2011","paperID":"None"},{"content":"Amy Bruckman, Social Support for Creativity and Learning Online, Proceedings of the 2008 Second IEEE International Conference on Digital Game and Intelligent Toy Enhanced Learning, p.3-7, November 17-19, 2008","paperID":"1470386"},{"content":"Nicolas Ducheneaut , Nicholas Yee , Eric Nickell , Robert J. Moore, The life and death of online gaming communities: a look at guilds in world of warcraft, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240750"},{"content":"Eaton, M. Basic Issues in Aesthetics. Waveland, 1999.","paperID":"None"},{"content":"Fischer, G. and Shipman, G. Collaborative Design Rational and Social Creativity in Cultures of Participation. Human Technology, 7 (2011), 164--187.","paperID":"None"},{"content":"Stacey Kuznetsov , Eric Paulos, Rise of the expert amateur: DIY projects, communities, and cultures, Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, October 16-20, 2010, Reykjavik, Iceland","paperID":"1868950"},{"content":"Leeroy Jenkins. Available at: http://www.youtube.com/watch?v=LkCNJRfSZBU","paperID":"None"},{"content":"Lowood, H. and Nitsche, M. Introduction. In Lowood, H. and Nitsche, M. (Ed.), The Machinima Reader. MIT Press, Cambridge, 2011.","paperID":"None"},{"content":"Machinima: Microsoft and Blizzard. Available at: http://en.wikipedia.org/wiki/Machinima#Microsoft_and _Blizzard","paperID":"None"},{"content":"Mirzoeff, N. An Introduction to Visual Culture. Routledge, NY, 1999.","paperID":"None"},{"content":"Muppet Show. Minah Minah (1976). Available at: http://www.youtube.com/watch?v=XH2wGpl7UG4","paperID":"None"},{"content":"Oxhorn's Machinima Tutorials: WoW. Available at: http://www.wegame.com/watch/Oxhorn_s_Machinima_ Tutorials_WoW/","paperID":"None"},{"content":"Oxhorn. ROFLMAO! (2007) Available at: http://www.youtube.com/watch?v=iEWgs6YQR9A","paperID":"None"},{"content":"Tyler Pace , Jeffrey Bardzell , Shaowen Bardzell, Collective creativity: the emergence of World of Warcraft machinima, Proceedings of the 25th BCS Conference on Human-Computer Interaction, July 04-08, 2011, Newcastle-upon-Tyne, United Kingdom","paperID":"2305380"},{"content":"Powrie, P. & Reader, K. French Cinema: A Student's Guide. London: Arnold.","paperID":"None"},{"content":"Percula. The Craft of War: Blind (2008). Available at: http://youtube.com/watch?v=vYABYMIAKVI","paperID":"None"},{"content":"Rose, G. (2001). Visual Methodologies: An Introduction to the Interpretation of Visual Materials. Sage, 2001.","paperID":"None"},{"content":"Daniela K. Rosner, Craft, computing & culture, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion, February 11-15, 2012, Seattle, Washington, USA","paperID":"2141610"},{"content":"Daniela K. Rosner, The material practices of collaboration, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145375"},{"content":"Sawyer, R.K. Individual and Group Creativity. In: Kaufman, J. and Sternberg, R. (Eds.), The Cambridge Handbook of Creativity. Cambridge Press, UK.","paperID":"None"},{"content":"Shusterman, R. Pragmatist Aesthetics: Living Beauty, Rethinking Art. Rowman & Littlefield, 2000.","paperID":"None"},{"content":"Elisabeth Sylvan, Predicting influence in an online community of creators, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753614"},{"content":"Joshua Tanenbaum , Karen Tanenbaum , Ron Wakkary, Steampunk as design fiction, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208279"},{"content":"TankSpot's Guide to Icecrown Sindragosa (2010). Available at: http://www.youtube.com/watch?v=o89tT2o87r0","paperID":"None"},{"content":"Warner, J. The Legend of Leeroy Jenkins. Available at: http://www.westword.com/2007-03-08/news/thelegend-of-leeroy-jenkins/","paperID":"None"},{"content":"WoW Machinima: The basics. Available at: http://wow.joystiq.com/2008/08/28/wow-machinimathe-basics/","paperID":"None"},{"content":"WoW Machinima Tool. Available at: http://pxr.dk/wmt/","paperID":"None"},{"content":"WoW Model Viewer. Available at: http://www.wowmodelviewer.org/","paperID":"None"},{"content":"WoW Moviewatch. Available at: http://wow.joystiq.com/category/wow-moviewatch/","paperID":"None"}],"citation":[{"content":"Ian J. Livingston , Carl Gutwin , Regan L. Mandryk , Max Birk, How players value their characters in world of warcraft, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531661"},{"content":"Marcus Carter , John Downs , Bjorn Nansen , Mitchell Harrop , Martin Gibbs, Paradigms of games research in HCI: a review of 10 years of research at CHI, Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play, October 19-21, 2014, Toronto, Ontario, Canada","paperID":"2658708"}],"abstract":"In this paper, we look at the prominent World of Warcraft machinima community as an expert amateur online com-munity and present a multi-part study of a canon of the most successful works (i.e., machinima videos) produced by this community. By focusing our study on its roughly 300 most successful examples, the determination of which we explain in the paper, we are able to highlight the evolv-ing visual practices, tools, and aesthetic sensibilities of the community. Chiefly, our study identifies how creativity support tools and visual practices are inextricably linked and mutually support the in-kind development of the other. For WoW machinima and its producers, the affordance of creativity tools and the cultivation of visual skill synced at key moments and in powerful ways to support the rapid growth, experimentation, and refinement of amateur exper-tise at the individual and community levels.","video":"http://www.youtube.com/embed/vOBn9gg-My0?rel=0","title":"A tribute to Mad skill: expert amateur visuality and world of Warcraft Machinima","filename":"CHI13/p2019","authors":["Tyler Pace","Austin Toombs","Shad Gross","Tony Pattin","Jeffrey Bardzell","Shaowen Bardzell"],"conference":"CHI '13"}