{"paperId":2466447,"reference":[{"content":"Bagehahl-Strindlund, M. & Borjesson, K. M. (1998). Postnatal depression: A hidden illness. Acta Psychiatrica Scandinavica, 98, 272--275.","paperID":"None"},{"content":"Beck, C. T. (1998). A checklist to identify women at risk for developing postpartum depression. Journal of Obstetric, Gynecologic, & Neonatal Nursing, 27, 39--46.","paperID":"None"},{"content":"Beck, C. T. (2001). Predictors of Postpartum Depression: An Update. Nursing Research, 50 (5), 275--285.","paperID":"None"},{"content":"Bradley, M. M., & Lang, P. J. (1999). Affective norms for English words (ANEW). Gainesville, FL. The NIMH Center for the Study of Emotion and Attention.","paperID":"None"},{"content":"Brubaker, J. R., Kivran-Swaine, F., Taber, L., and Hayes, G. R. (2012). Grief-Stricken in a Crowd: The language of bereavement and distress in social media. In Proc. ICWSM 2012.","paperID":"None"},{"content":"Bucci, W., Freedman, N. (1981). The language of depression. Bull. Menninger Clin. 45:334--58.","paperID":"None"},{"content":"Chung, C. K., & Pennebaker, J. W. (2007). The psychological functions of function words. In K. Fielder (Ed.), Social communication (pp. 343--359).","paperID":"None"},{"content":"Munmun De Choudhury , Scott Counts , Eric Horvitz, Major life changes and behavioral markers in social media: case of childbirth, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441937"},{"content":"Gavin Doherty , David Coyle , John Sharry, Engagement with online mental health interventions: an exploratory clinical study of a treatment for depression, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208602"},{"content":"Richard O. Duda , Peter E. Hart , David G. Stork, Pattern Classification (2nd Edition), Wiley-Interscience, 2000","paperID":"954544"},{"content":"Fleming, A. S., Klein, E. and Corter, C. (1992). The Effects of a Social Support Group on Depression, Maternal Attitudes and Behavior in New Mothers. Journal of Child Psych. & Psychiatry, 33: 685--698.","paperID":"None"},{"content":"Golder, S. A., & Macy, M. W. (2011). Diurnal and Seasonal Mood Vary with Work, Sleep and Daylength Across Diverse Cultures. Science. 30 Sep 2011.","paperID":"None"},{"content":"Ashish Kapoor , Eric Horvitz , Sumit Basu, Selective supervision: guiding supervised learning with decision-theoretic active learning, Proceedings of the 20th international joint conference on Artifical intelligence, p.877-882, January 06-12, 2007, Hyderabad, India","paperID":"1625417"},{"content":"Adam D.I. Kramer, An unobtrusive behavioral model of \"gross national happiness\", Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753369"},{"content":"MacLennan, A., Wilson, D., & Taylor, A. (1996). The self-reported prevalence of postnatal depression in Australia and New Zealand. Journal of Obstetrics and Gynecology, 36, 313.","paperID":"None"},{"content":"Miller, Laura J. (2002). Postpartum Depression. J. of American Med. Association (JAMA) 287 (6): 762--765.","paperID":"None"},{"content":"Yair Neuman , Yohai Cohen , Dan Assaf , Gabbi Kedma, Proactive screening for depression through metaphorical and automatic text analysis, Artificial Intelligence in Medicine, v.56 n.1, p.19-25, September, 2012","paperID":"2364990"},{"content":"Nielson, Forman D., Videbech, P., Hedegaard, M., Dalby Slavig, J. & Secher, N. J. (2000). Postnatal depression: identification of women at risk. British Journal of Obstetrics and Gynaecology (BJOG) 107 (10): 1210--1217.","paperID":"None"},{"content":"O'Hara, M. W. (1995). Postpartum Depression: Causes and Consequences. New York: Springer-Verlag.","paperID":"None"},{"content":"O'Hara, M. W., & Swain, A. M. (1996). Rates and risks of postpartum depression - a meta-analysis. Intl. Review of Psychiatry, 8 (1), 37--54.","paperID":"None"},{"content":"Oxman T. E., Rosenberg S. D., & Tucker G. J. (1982). The language of paranoia. American J. Psychiatry 139:275--82.","paperID":"None"},{"content":"Paul, M. J., & Dredze, M. (2011). You are What You Tweet: Analyzing Twitter for Public Health. In Proc. ICWSM '11.","paperID":"None"},{"content":"Pennebaker, J. W., Mehl, M. R., and Niederhoffer, K. G. (2002). Pyschological aspects of natural language use: Our words, ourselves. Annual Review of Psychology 54: 547--477.","paperID":"None"},{"content":"Ramsay, R. (1993). Postnatal depression. Lancet, 341, 1358.","paperID":"None"},{"content":"Sadilek, A., Kautz, H., & Silenzio, V. (2012). Modeling Spread of Disease from Social Interactions. In Proc. ICSWM '11.","paperID":"None"},{"content":"Scott, K. D., Klaus, P. H., Klaus, M. H. (1999). The obstetrical and postpartum benefits of continuous support during childbirth. J Womens Health Gend Based Med. 8(10):1257--64.","paperID":"None"},{"content":"Spera, S. P., Buhrfeind, E. D., Pennebaker, J. W. (1994). Expressive writing and coping with job loss. Acad. Manag. J. 37:722--33.","paperID":"None"},{"content":"Steinfeld, C., Ellison, N., Lampe, C. (2008). Social capital, self-esteem, and use of online social network sites: A longitudinal study. J. of Applied Developmental Psychology, 29, 434--445.","paperID":"None"},{"content":"Tarkka, M.-T. & Paunonen, M. (1996). Social support and its impact on mothers' experiences of childbirth. Journal of Advanced Nursing, 23: 70--75.","paperID":"None"},{"content":"Weintraub, W. (1981). Verbal Behavior: Adaptation and Psychopathology. New York: Springer.","paperID":"None"}],"citation":[{"content":"Andrés Monroy-Hernández , Shelly Farnham , Emre Kiciman , Scott Counts , Munmun De Choudhury, Smart societies: from citizens as sensors to collective action, interactions, v.20 n.4, July + August 2013","paperID":"2486249"},{"content":"Munmun De Choudhury, Can social media help us reason about mental health?, Proceedings of the companion publication of the 23rd international conference on World wide web companion, April 07-11, 2014, Seoul, Korea","paperID":"2580064"},{"content":"Hyewon Suh , John R. Porter , Alexis Hiniker , Julie A. Kientz, @BabySteps: design and evaluation of a system for using twitter for tracking children's developmental milestones, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557386"},{"content":"Ryen W. White , Elad Yom-Tov , Eric Horvitz , Eugene Agichtein , William Hersh, Report on the SIGIR 2013 workshop on health search and discovery, ACM SIGIR Forum, v.47 n.2, December 2013","paperID":"2568405"},{"content":"Munmun De Choudhury , Scott Counts , Eric J. Horvitz , Aaron Hoff, Characterizing and predicting postpartum depression from shared facebook data, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531675"},{"content":"Munmun De Choudhury, Anorexia on Tumblr: A Characterization Study, Proceedings of the 5th International Conference on Digital Health 2015, May 18-20, 2015, Florence, Italy","paperID":"2750515"},{"content":"Munmun De Choudhury , Scott Counts , Eric Horvitz, Social media as a measurement tool of depression in populations, Proceedings of the 5th Annual ACM Web Science Conference, p.47-56, May 02-04, 2013, Paris, France","paperID":"2464480"},{"content":"Virgile Landeiro Dos Reis , Aron Culotta, Using matched samples to estimate the effects of exercise on mental health from twitter, Proceedings of the Twenty-Ninth AAAI Conference on Artificial Intelligence, p.182-188, January 25-30, 2015, Austin, Texas","paperID":"2887033"},{"content":"Munmun De Choudhury , Meredith Ringel Morris , Ryen W. White, Seeking and sharing health information online: comparing search engines and social media, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557214"},{"content":"Francisco J. Gutierrez , Barbara Poblete, Sentiment-based User Profiles in Microblogging Platforms, Proceedings of the 26th ACM Conference on Hypertext & Social Media, September 01-04, 2015, Guzelyurt, Northern Cyprus","paperID":"2791027"},{"content":"Jessica Vitak , Katie Shilton , Zahra Ashktorab, Beyond the Belmont Principles: Ethical Challenges, Practices, and Beliefs in the Online Data Research Community, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820078"},{"content":"Liang Gou , Michelle X. Zhou , Huahai Yang, KnowMe and ShareMe: understanding automatically discovered personality traits from social media and user sharing preferences, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557398"},{"content":"Emre KıcKıman , Matthew Richardson, Towards Decision Support and Goal Achievement: Identifying Action-Outcome Relationships From Social Media, Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, August 10-13, 2015, Sydney, NSW, Australia","paperID":"2783310"},{"content":"Munmun De Choudhury, Opportunities of social media in health and well-being, XRDS: Crossroads, The ACM Magazine for Students, v.21 n.2, Winter 2014","paperID":"2676570"},{"content":"Munmun De Choudhury, Role of social media in tackling challenges in mental health, Proceedings of the 2nd international workshop on Socially-aware multimedia, October 21-21, 2013, Barcelona, Spain","paperID":"2509921"},{"content":"Sungkyu Park , Inyeop Kim , Sang Won Lee , Jaehyun Yoo , Bumseok Jeong , Meeyoung Cha, Manifestation of Depression and Loneliness on Social Networks: A Case Study of Young Adults on Facebook, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675139"},{"content":"Sho Tsugawa , Yusuke Kikuchi , Fumio Kishino , Kosuke Nakajima , Yuichi Itoh , Hiroyuki Ohsaki, Recognizing Depression from Twitter Activity, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702280"},{"content":"Kunal Singh , Ajita John, A study of tweet chats for breast cancer patients, Proceedings of the 2015 International Conference on Social Media & Society, p.1-6, July 27-29, 2015, Toronto, Ontario, Canada","paperID":"2789193"},{"content":"Diana MacLean , Sonal Gupta , Anna Lembke , Christopher Manning , Jeffrey Heer, Forum77: An Analysis of an Online Health Forum Dedicated to Addiction Recovery, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675146"},{"content":"Meredith Ringel Morris, Social networking site use by mothers of young children, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531603"},{"content":"Javid Ebrahimi , NhatHai Phan , Dejing Dou , Brigitte Piniewski , David Kil, Characterizing Physical Activity in a Health Social Network, Proceedings of the 6th International Conference on Digital Health Conference, April 11-13, 2016, Montréal, Québec, Canada","paperID":"2896349"}],"abstract":"We consider social media as a promising tool for public health, focusing on the use of Twitter posts to build predictive models about the forthcoming influence of childbirth on the behavior and mood of new mothers. Using Twitter posts, we quantify postpartum changes in 376 mothers along dimensions of social engagement, emotion, social network, and linguistic style. We then construct statistical models from a training set of observations of these measures before and after the reported childbirth, to forecast significant postpartum changes in mothers. The predictive models can classify mothers who will change significantly following childbirth with an accuracy of 71%, using observations about their prenatal behavior, and as accurately as 80-83% when additionally leveraging the initial 2-3 weeks of postnatal data. The study is motivated by the opportunity to use social media to identify mothers at risk of postpartum depression, an underreported health concern among large populations, and to inform the design of low-cost, privacy-sensitive early-warning systems and intervention programs aimed at promoting wellness postpartum.","video":"http://www.youtube.com/embed/YISHujy9kg8?rel=0","title":"Predicting postpartum changes in emotion and behavior via social media","filename":"CHI13/p3267","authors":["Munmun De Choudhury","Scott Counts","Eric Horvitz"],"conference":"CHI '13"}