{"paperId":2466468,"citation":[{"content":"Mark J. Handel , Rena Bivens , Jed R. Brubaker , Oliver L. Haimson , Jessa Lingel , Svetlana Yarosh, Facebooking in \"Face\": Complex Identities Meet Simple Databases, Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2699337"},{"content":"Uichin Lee , Joonwon Lee , Minsam Ko , Changhun Lee , Yuhwan Kim , Subin Yang , Koji Yatani , Gahgene Gweon , Kyong-Mee Chung , Junehwa Song, Hooked on smartphones: an exploratory study on smartphone overuse among college students, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557366"},{"content":"Angelika Strohmayer , Rob Comber , Madeline Balaam, Exploring Learning Ecologies among People Experiencing Homelessness, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702157"},{"content":"Tejinder K. Judge , Carman Neustaedter, Studying and Designing Technology for Domestic Life: Lessons from Home, Morgan Kaufmann Publishers Inc., San Francisco, CA, 2014","paperID":"2769771"}],"reference":[{"content":"Anon. Estimates Of A.A. Groups And Members As Of January 1, 2012. 2012. www.aa.org.","paperID":"None"},{"content":"Anon. Facts about NA. 2012. www.na.org.","paperID":"None"},{"content":"Bufe, C. Alcoholics Anonymous: Cult or Cure? 1998.","paperID":"None"},{"content":"Cain, C. Becoming a Non-Drinking Alcoholic: A Case Study in Identity Acquisition. Anthropology Dept., UNC. 1991.","paperID":"None"},{"content":"Katherine Y. Chuang , Christopher C. Yang, Helping you to help me: exploring supportive interaction in online health community, Proceedings of the 73rd ASIS&T Annual Meeting on Navigating Streams in an Information Ecosystem, October 22-27, 2010, Pittsburgh, Pennsylvania","paperID":"1920344"},{"content":"Copeland, J. and Martin, G. Web-based interventions for substance use disorders: A qualitative review. J. of Substance Abuse Treatment 26, 2 (2004), 109--116.","paperID":"None"},{"content":"Cutler, R. and Fishbain, D. Are alcoholism treatments effective? The Project MATCH data. BMC Public Health 5, 75 (2007).","paperID":"None"},{"content":"Christopher A. Le Dantec , W. Keith Edwards, Designs on dignity: perceptions of technology among the homeless, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357155"},{"content":"Donath, J. S. Identity and deception in the virtual community. In Communities in Cyberspace. Routledge, New York, 1999, 29--59.","paperID":"None"},{"content":"Paul Dourish , Scott D. Mainwaring, Ubicomp's colonial impulse, Proceedings of the 2012 ACM Conference on Ubiquitous Computing, September 05-08, 2012, Pittsburgh, Pennsylvania","paperID":"2370238"},{"content":"Galaif, E. R. and Sussman, S. For Whom Does Alcoholics Anonymous Work? Substance Use & Misuse 30, 2 (1995), 161--184.","paperID":"None"},{"content":"Granovetter, M. S. The Strength of Weak Ties. American Journal of Sociology 7, 6 (1973), 1360--1380.","paperID":"None"},{"content":"Halloran, S. O. Participant Observation of Alcoholics Anonymous: Contrasting Roles of the Ethnographer and Ethnomethodologist. The Qualitative Report 8, 1 (2003), 81--99.","paperID":"None"},{"content":"Laudet, A. B. Addiction Treatment Clients and Clinitians: Toward Identifying Obstacles to Participation. Substance Use and Misuse 38, 14 (2003), 2017--2047.","paperID":"None"},{"content":"Lenert, L., Muñoz, R. F., Perez, J. E., and Bansod, A. Automated E-mail Messaging as a Tool for Improving Quit Rates in an Internet Smoking Cessation Intervention. J of the American Medical Informatics Association 11, (2004), 235--240.","paperID":"None"},{"content":"Ian Li , Anind Dey , Jodi Forlizzi, A stage-based model of personal informatics systems, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753409"},{"content":"James J. Lin , Lena Mamykina , Silvia Lindtner , Gregory Delajoux , Henry B. Strub, Fish'n'Steps: encouraging physical activity with an interactive computer game, Proceedings of the 8th international conference on Ubiquitous Computing, p.261-278, September 17-21, 2006, Orange County, CA","paperID":"2166299"},{"content":"Lorig, K. R., Sobel, D. S., Ritter, P. L., Laurent, D., and Hobbs, M. Effect of a self-management program on patients with chronic disease. Effective Clinical Practice 4, 6 (2001), 256--62.","paperID":"None"},{"content":"Moore, B., Fazzino, T., Garnet, B., Cutter, C., and Barry, D. Computer-based interventions for drug use disorders: A systematic review. J of Substance Abuse Treatment 40, 3 (2011), 215--223.","paperID":"None"},{"content":"Mark W. Newman , Debra Lauterbach , Sean A. Munson , Paul Resnick , Margaret E. Morris, It's not that i don't have problems, i'm just not putting them on facebook: challenges and opportunities in using online social networks for health, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958876"},{"content":"Prochaska, J. O. and Velicer, W. F. The transtheoretical model of health behavior change. American Journal of Health Promotion 12, (1997), 38--48.","paperID":"None"},{"content":"Room, R. Alcoholics Anonymous as a Social Movement. In Research on Alcoholics Anonymous: Opportunities and Alternatives. 1993, 167--187.","paperID":"None"},{"content":"Rosenstock, I., Strecher, V., and Becker, M. Social Learning Theory and the Health Belief Model. Health Education & Behavior 15, 2 (1988), 175--183.","paperID":"None"},{"content":"Sadock, B. and Sadock, V. Substance-Related Disorders. In Kaplan and Sadock's Synopsis of Psychiatry: Behavioral Science/Clinical Psychiatry. 2007, 381--464.","paperID":"None"},{"content":"Seidman, I. Interviewing as Qualitative Research: A Guide for Researchers in Education And the Social Sciences. Teachers College Press, New York, 1998.","paperID":"None"},{"content":"Tarasuik, J. C., Galligan, R., and Kaufman, J. Almost being there: video communication with young children. PloS one 6, 2 (2011), e17129.","paperID":"None"},{"content":"Tonigan, J. S. Alcoholics Anonymous Outcomes and Benefits. In M. Galanter and L. A. Kaskutas, eds., Research on Alcoholics Anonymous and Spirituality in Addiction. Springer, 2008, 357--369.","paperID":"None"},{"content":"Turkle, S. Aspects of the Self. In Life On the Screen: Identity in the Age of the Internet. Touchstone, New York, 1997, 177--232.","paperID":"None"},{"content":"Yi-Chia Wang , Robert Kraut , John M. Levine, To stay or leave?: the relationship of emotional and informational support to commitment in online health support groups, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145329"},{"content":"White, W. L. Sponsor, Recovery Coach, Addiction Counselor: The Importance of Role Clarity and Role Integrity. Perspectives on Peer-Based Recovery Support Services, (2006).","paperID":"None"},{"content":"Susan P. Wyche , Rebecca E. Griner, Extraordinary computing: religion as a lens for reconsidering the home, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518817"},{"content":"Svetlana Yarosh , Gregory D. Abowd, Mediated parent-child contact in work-separated families, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979120"},{"content":"National Institute on Drug Abuse. \"Addiction Science: From Molecules to Managed Care.\" 2008.","paperID":"None"}],"abstract":"Twelve-step fellowships are the most common long-term maintenance program for recovery from alcoholism and addiction. Informed by six months of participatory observation of twelve-step fellowship meetings and service structure, I conducted in-depth interviews with twelve members of Alcoholics Anonymous (AA) and Narcotics Anonymous (NA) about the role of technology in recovery. I found that there are a number of tensions in how technology is perceived and adopted. As technology and twelve-step fellowships interact, issues of anonymity, identity, consensus, access, unity, autonomy, and physical presence are foregrounded. I relate these findings to the broader research landscape and provide implications for future design in this space.","video":"http://www.youtube.com/embed/SwbbXMZWroY?rel=0","title":"Shifting dynamics or breaking sacred traditions?: the role of technology in twelve-step fellowships","filename":"CHI13/p3413","authors":["Svetlana Yarosh"],"conference":"CHI '13"}