{"paperId":2466122,"citation":[{"content":"Jinyi Wang , Mudassar Ahmad Mughal , Oskar Juhlin, Experiencing Liveness of a Cherished Place in the Home, Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video, June 03-05, 2015, Brussels, Belgium","paperID":"2745198"},{"content":"Peter Tolmie , Alan Chamberlain , Steve Benford, Designing for reportability: sustainable gamification, public engagement, and promoting environmental debate, Personal and Ubiquitous Computing, v.18 n.7, p.1763-1774, October   2014","paperID":"2674128"}],"reference":[{"content":"Auslander, P., Liveness: Performance in a mediatized culture. 1999, Abingdon: Routledge.","paperID":"None"},{"content":"Barnard, A. and J. Spencer, eds. The Routledge encyclopedia of social and cultural anthropology. 2nd ed. 2010, Routledge: Milton Park.","paperID":"None"},{"content":"Bassoli, A., et al., tUNA: Socializing music sharing on the move, in Consuming music together, O'Hara and Brown, Eds. 2006, Springer: Dordrecht. p. 151--172.","paperID":"None"},{"content":"Stephan Baumann , Björn Jung , Arianna Bassoli , Martin Wisniowski, BluetunA: let your neighbour know what music you like, CHI '07 Extended Abstracts on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, CA, USA","paperID":"1240929"},{"content":"Frank Bentley , Crysta Metcalf , Gunnar Harboe, Personal vs. commercial content: the similarities between consumer use of photos and music, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124871"},{"content":"Berker, T., et al., eds. Domestication of media and technology. 2006, Open University Press: Maidenhead.","paperID":"None"},{"content":"Brown, B. and A. Sellen, Sharing and listening to music, in Consuming music together, O'Hara and Brown, Eds. 2006, Springer: Dordrecht. p. 37--56.","paperID":"None"},{"content":"Bull, M., No dead air! The iPod and the culture of mobile listening. Leisure Studies, 2005. 24(4): p. 343--355.","paperID":"None"},{"content":"Bull, M., Investigating the culture of mobile listening: From Walkman to iPod, in Consuming music together, O'Hara and Brown, Eds. 2006, Springer: Dordrecht. p. 131--149.","paperID":"None"},{"content":"DeNora, T., Music in everyday life. 2000, Cambridge: Cambridge University Press.","paperID":"None"},{"content":"Lina Dib , Daniela Petrelli , Steve Whittaker, Sonic souvenirs: exploring the paradoxes of recorded sound for family remembering, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718985"},{"content":"Maria Hakansson , Mattias Rost , Mattias Jacobsson , Lars Erik Holmquist, Facilitating Mobile Music Sharing and Social Interaction with Push!Music, Proceedings of the 40th Annual Hawaii International Conference on System Sciences, p.87, January 03-06, 2007","paperID":"1255717"},{"content":"Haviland, W. A., et al., The essence of anthropology. 2nd ed. 2009, Belmont: Wadsworth, Engage Learning.","paperID":"None"},{"content":"Sari Komulainen , Minna Karukka , Jonna Häkkilä, Social music services in teenage life: a case study, Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction, November 22-26, 2010, Brisbane, Australia","paperID":"1952303"},{"content":"Larson, R., Secrets in the bedroom: Adolescents' private use of media. Journal of Youth and Adolescence, 1995. 24(5): p. 535--550.","paperID":"None"},{"content":"Lassi A. Liikkanen , Mikko Lahdensuo, Observing the mobile music phenomenon: one in nine commuters is wired, Proceedings of the 8th ACM Conference on Designing Interactive Systems, August 16-20, 2010, Aarhus, Denmark","paperID":"1858234"},{"content":"KuanTing Liu , Roger Andersson Reimer, Social playlist: enabling touch points and enriching ongoing relationships through collaborative mobile music listening, Proceedings of the 10th international conference on Human computer interaction with mobile devices and services, September 02-05, 2008, Amsterdam, The Netherlands","paperID":"1409299"},{"content":"Mackay, H. and D. Ivey, Modern media in the home. 2004, Rome,: John Libbey Publishing.","paperID":"None"},{"content":"Kenton O'Hara , Barry Brown, Consuming Music Together, Springer-Verlag New York, Inc., Secaucus, NJ, 2005","paperID":"1077095"},{"content":"O'Hara, K., et al., Distributing the process of music choice in public spaces, in Consuming music together, O'Hara and Brown, Eds. 2006, Springer: Dordrecht. p. 87--109.","paperID":"None"},{"content":"Gerard Oleksik , David Frohlich , Lorna M. Brown , Abigail Sellen, Sonic interventions: understanding and extending the domestic soundscape, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357277"},{"content":"Sacks, H., Lectures on conversation. 1992, Oxford: Blackwell.","paperID":"None"},{"content":"Robin Sease , David W. McDonald, The organization of home media, ACM Transactions on Computer-Human Interaction (TOCHI), v.18 n.2, p.1-20, June 2011","paperID":"1970383"},{"content":"van Dijck, J., Mediated memories in the digital age. 2007, Stanford: Stanford University Press.","paperID":"None"},{"content":"Voida, A., et al., Social practices around iTunes, in Consuming music together, O'Hara and Brown, Eds. 2006, Springer: Dordrecht.","paperID":"None"}],"abstract":"Music shapes our social lives. While previous research has provided a foundational understanding of the social affordances surrounding people's interactions with music, there is a need to update this understanding in light of recent key developments in our digital technological landscape. This paper describes a qualitative study of people's social activities and practices around music in households. It extends previous research by revealing the impact key technologies have on how, where, when, and with who people's interactions surrounding music occur. It also reveals people's creative attempts to design their musical experiences with others through reconfiguring and connecting to various digital technologies and digital platforms in order to pursue more opportunities for communicating, sharing, bonding, and celebrating lives with others.","video":"http://www.youtube.com/embed/OTKw6plRw4Y?rel=0","title":"Revisiting social practices surrounding music","filename":"CHI13/p951","authors":["Tuck W. Leong","Peter C. Wright"],"conference":"CHI '13"}