{"paperId":2466246,"citation":[{"content":"Luís Duarte , Luís Carriço, Persuasive Elements in Videogames: Effects on Player Performance and Physiological State, Proceeding of the 10th International Conference on Advances in Computer Entertainment, November 12-15, 2013, Boekelo, The Netherlands","paperID":"2696627"},{"content":"Ge Gao , Bin Xu , Dan Cosley , Susan R. Fussell, How beliefs about the presence of machine translation impact multilingual collaborations, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531702"},{"content":"Anca Dragan , Rachel Holladay , Siddhartha Srinivasa, Deceptive robot motion: synthesis, analysis and experiments, Autonomous Robots, v.39 n.3, p.331-345, October   2015","paperID":"2825781"},{"content":"Andy Cockburn , Carl Gutwin , Joey Scarr , Sylvain Malacria, Supporting Novice to Expert Transitions in User Interfaces, ACM Computing Surveys (CSUR), v.47 n.2, p.1-36, December 2014","paperID":"2659796"},{"content":"Sylvain Malacria , Joey Scarr , Andy Cockburn , Carl Gutwin , Tovi Grossman, Skillometers: reflective widgets that motivate and help users to improve performance, Proceedings of the 26th annual ACM symposium on User interface software and technology, October 08-11, 2013, St. Andrews, Scotland, United Kingdom","paperID":"2501996"},{"content":"Sevtap Duman , Kaan Onarlioglu , Ali Osman Ulusoy , William Robertson , Engin Kirda, TrueClick: automatically distinguishing trick banners from genuine download links, Proceedings of the 30th Annual Computer Security Applications Conference, December 08-12, 2014, New Orleans, Louisiana, USA","paperID":"2664279"},{"content":"Anshul Vikram Pandey , Katharina Rall , Margaret L. Satterthwaite , Oded Nov , Enrico Bertini, How Deceptive are Deceptive Visualizations?: An Empirical Analysis of Common Distortion Techniques, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702608"}],"reference":[{"content":"Nabil R. Adam , John C. Worthmann, Security-control methods for statistical databases: a comparative study, ACM Computing Surveys (CSUR), v.21 n.4, p.515-556, Dec. 1989","paperID":"76895"},{"content":"Arabe, K. C., \"'Dummy' thermostats cool down tempers, not temperatures,\" Industry Market Trends, Apr. 11, 2003.","paperID":"None"},{"content":"Armitage, T., \"Conversational UI: a short reading list,\" bit.ly/dFG77o, Dec. 10, 2010.","paperID":"None"},{"content":"Bell, J. B., and B. Whaley, Cheating and Deception, Transaction Publishers, 1991.","paperID":"None"},{"content":"Bok, S., Lying: Moral Choice in Public and Private Life, Vintage Press, 1999.","paperID":"None"},{"content":"Brignull, H., \"Adding delays to increase perceived value: does it work?\" bit.ly/i7lSCf, Dec. 16, 2010.","paperID":"None"},{"content":"Kirsten Boehner , Jeffrey T. Hancock, Advancing ambiguity, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124789"},{"content":"Brewer, B. R., M. Fagan, R. Kaltzky, and Y. Matsuoka, \"Perceptual limits for a robotic rehabilitation environment using visual feedback distortion,\" IEEE Trans. on Neural System and Rehabilitation Eng., 13:1--11, 2005.","paperID":"None"},{"content":"Camerer, C. F., G. Loewenstein, and M. Rabin (eds.) Advances in Behavioral Economics, Princeton Press, 2003.","paperID":"None"},{"content":"H. Rebecca Callison, A time-sensitive object model for real-time systems, ACM Transactions on Software Engineering and Methodology (TOSEM), v.4 n.3, p.287-317, July 1995","paperID":"214021"},{"content":"Kirsten Cater , Alan Chalmers , Colin Dalton, Varying rendering fidelity by exploiting human change blindness, Proceedings of the 1st international conference on Computer graphics and interactive techniques in Australasia and South East Asia, February 11-14, 2003, Melbourne, Australia","paperID":"604483"},{"content":"Ciancutti, J., \"5 lessons we've learned using AWS,\" Dec. 16, 2010, Available at: nflx.it/hrjm6J.","paperID":"None"},{"content":"Gilbert Cockton, Value-centred HCI, Proceedings of the third Nordic conference on Human-computer interaction, p.149-160, October 23-27, 2004, Tampere, Finland","paperID":"1028038"},{"content":"Gregory Conti , Edward Sobiesk, Malicious interface design: exploiting the user, Proceedings of the 19th international conference on World wide web, April 26-30, 2010, Raleigh, North Carolina, USA","paperID":"1772719"},{"content":"Andrew J. Cowell , Kay M. Stanney, Manipulation of non-verbal interaction style and demographic embodiment to increase anthropomorphic computer character credibility, International Journal of Human-Computer Studies, v.62 n.2, p.281-306, February 2005","paperID":"1066401"},{"content":"Nils Dahlbäck , Arne Jönsson , Lars Ahrenberg, Wizard of Oz studies: why and how, Proceedings of the 1st international conference on Intelligent user interfaces, p.193-200, January 04-07, 1993, Orlando, Florida, USA","paperID":"169968"},{"content":"Dark Patterns Wiki, http://wiki.darkpatterns.org.","paperID":"None"},{"content":"de Quetteville, H., \"Fake bus stop keeps Alzheimer's patients from wandering off,\" Telegraph, Jun. 3, 2008.","paperID":"None"},{"content":"Sanjiv Erat , Uri Gneezy, White Lies, Management Science, v.58 n.4, p.723-733, 04 2012","paperID":"2188276"},{"content":"Friedman, B., Designing Casinos to Dominate the Competition, ISGCG, University of Nevada, 2000.","paperID":"None"},{"content":"Batya Friedman, Human values and the design of computer technology, Center for the Study of Language and Information, Stanford, CA, 1997","paperID":"278213"},{"content":"B. J. Fogg , Jonathan Grudin , Jakob Nielsen , Stuart Card, Persuasive Technology: Using Computers to Change What We Think and Do, Science & Technology Books, 2002","paperID":"640634"},{"content":"Gottleieb, H., \"The Jack Principles,\" Jellyvision Inc., bit.ly/9pYnaM, 1997.","paperID":"None"},{"content":"Jeffrey T. Hancock , Jennifer Thom-Santelli , Thompson Ritchie, Deception and design: the impact of communication technology on lying behavior, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.129-134, April 24-29, 2004, Vienna, Austria","paperID":"985709"},{"content":"Chris Harrison , Zhiquan Yeo , Scott E. Hudson, Faster progress bars: manipulating perceived duration with visual augmentations, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753556"},{"content":"Irani, K. B, V. L. Wallace, and J. H. Jackson, \"Conversational design of stochastic service systems from a graphical terminal,\" Int. Symp on Comp Graphics, 1970.","paperID":"None"},{"content":"Johnson C. W., \"Looking beyond the cockpit: human computer interaction in the causal complexes of aviation accidents,\" HCI in Aerospace, EURISCO, 2004.","paperID":"None"},{"content":"Kay, A., \"User interface: a personal view,\" In B. Laurel (ed.), The Art of Human-Computer Interface Design, AddisonWesley, 1991.","paperID":"None"},{"content":"Klesen, M., M. Kipp, P. Gebhard, \"Staging exhibitions: methods and tools for modeling narrative structure to produce interactive performance with virtual actors,\" Virtual Reality, 2003, 7(1):17--29.","paperID":"None"},{"content":"Krugman, P., \"What price fairness?,\" The New York Times, Oct. 4, 2000.","paperID":"None"},{"content":"Lakoff, G., and M. Johnson, Metaphors We Live By, University of Chicago Press, 1980.","paperID":"None"},{"content":"Brenda Laurel, Computers as Theatre, Addison-Wesley Longman Publishing Co., Inc., Boston, MA, 1993","paperID":"529145"},{"content":"Luo, M., \"For exercise in New York futility, push button,\" The New York Times, Feb. 27, 2004.","paperID":"None"},{"content":"Marling, K. A. (ed.), Designing Disney's Theme Parks: The Architecture of Reassurance, Flammarion, 1997.","paperID":"None"},{"content":"Mattioli, D., \"On Orbitz Mac users steered to pricier hotels,\" Wall Street Journal, August 23, 2012.","paperID":"None"},{"content":"Mine, M., \"Towards virtual reality for the masses: 10 years of research at Disney's VR Studio,\" Eurographics, 2003.","paperID":"None"},{"content":"MitraŰinovi, M., Total Landscape, Theme Parks, Public Space, Ashgate, 2006.","paperID":"None"},{"content":"Nelson, T. H., \"The right way to think about software design,\" In B. Laurel (ed.), The Art of Human-Computer Interface Design, Addison-Wesley 1991.","paperID":"None"},{"content":"Norman, Donald, \"Some observations of mental models,\" In Gentner, Dedre & Stevens, Albert L. (eds.), Mental Models, Lawrence Erlbaum Associates, 1983.","paperID":"None"},{"content":"OCLC, \"Fourteen heuristics used in OCLC heuristic evaluations,\" http://www.oclc.org/, retrieved Jan. 2008.","paperID":"None"},{"content":"Plauger, P. J., \"Chocolate,\" Embedded Systems Programming, 7(3):81--84, Mar. 1994.","paperID":"None"},{"content":"Rams, D., \"Ten principles for good design,\" bit.ly/QUk4gY, retrieved Sept. 2012.","paperID":"None"},{"content":"Reeves, B., and C. Nass, The Media Equation: How People Treat Computers, Television, and New Media Like Real People and Places, CSLI, 2003.","paperID":"None"},{"content":"Richards, J. I., Deceptive Advertising: Behavioral Study of a Legal Concept, Lawrence Erlbaum Associates, 1990.","paperID":"None"},{"content":"Richard Rubinstein , Harry Hersh, Human Factor: Designing Computer Systems for People, Butterworth-Heinemann, Newton, MA, 1990","paperID":"574996"},{"content":"Schmandt, C., \"Illusion in the interface,\" in The Art of Human-Computer Interface Design, Addison-Wesley, 1991.","paperID":"None"},{"content":"Sandberg, J., \"Some cold employees may never find relief,\" Wall Street Journal Online, Jan. 17, 2003.","paperID":"None"},{"content":"Schull, N. D., \"Digital gambling: the coincidence of desire and design,\" Annals of the Am. Ac. Of Poli. And Soc. Sci., January 2005, 597(1):65--81.","paperID":"None"},{"content":"Stone, A., \"Why waiting is torture,\" New York Times, Aug. 18, 2012.","paperID":"None"},{"content":"Stuff, J. B., H. J. Kim, and C. N. Ramesh, \"Truth biases and aroused suspicion in relational deception,\" Communications Research, 1992, 19:326--345.","paperID":"None"},{"content":"Leila Takayama , Doug Dooley , Wendy Ju, Expressing thought: improving robot readability with animation principles, Proceedings of the 6th international conference on Human-robot interaction, March 06-09, 2011, Lausanne, Switzerland","paperID":"1957674"},{"content":"Tractinsky, N., A. S. Katz, and D. Ikar, \"What is beautiful is usable,\" Interacting with Computers, 13:127--145, 2000.","paperID":"None"},{"content":"Jaime Teevan, The re:search engine: simultaneous support for finding and re-finding, Proceedings of the 20th annual ACM symposium on User interface software and technology, October 07-10, 2007, Newport, Rhode Island, USA","paperID":"1294217"},{"content":"Bruce Tognazzini, Principles, techniques, and ethics of stage magic and their application to human interface design, Proceedings of the INTERCHI '93 conference on Human factors in computing systems, p.355-362, May 1993, Amsterdam, The Netherlands","paperID":"164946"},{"content":"West, Mick, \"Intelligent mistakes: how to incorporate stupidity into your AI code,\" bit.ly/Nq0sCL, September 15, 2012.","paperID":"None"},{"content":"Weyenberg, A., \"Is realistic UI design realistic?\" bit.ly/9b5Tr0, retrieved Oct. 2010.","paperID":"None"},{"content":"Zheng, L, \"Interview with Oliver Scholz: Vista Speech UX program manager,\" bit.ly/dCIRWH, Sep. 1, 2006.","paperID":"None"}],"abstract":"Though it has been asserted that \"good design is honest\", [42] deception exists throughout human-computer interaction research and practice. Because of the stigma associated with deception - in many cases rightfully so - the research community has focused its energy on eradicating malicious deception, and ignored instances in which deception is positively employed. In this paper we present the notion of benevolent deception, deception aimed at benefitting the user as well as the developer. We frame our discussion using a criminology-inspired model and ground components in various examples. We assert that this provides us with a set of tools and principles that not only helps us with system and interface design, but that opens new research areas. After all, as Cockton claims in his 2004 paper \"Value-Centered HCI\" [13], \"Traditional disciplines have delivered truth. The goal of HCI is to deliver value.\"","video":"http://www.youtube.com/embed/9HZU2pVfxyQ?rel=0","title":"Benevolent deception in human computer interaction","filename":"CHI13/p1863","authors":["Eytan Adar","Desney S. Tan","Jaime Teevan"],"conference":"CHI '13"}