{"paperId":2466181,"citation":[],"reference":[{"content":"Adam, J. J. (1992) The effects of objectives and constraints on motor control strategy in reciprocal aiming movements. J. Motor Behav. 24, 173--185.","paperID":"None"},{"content":"Emory Al-Imam , Edward Lank, Biasing response in Fitts' Law tasks, CHI '06 Extended Abstracts on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1125553"},{"content":"Ahmed Sabbir Arif , Wolfgang Stuerzlinger, Predicting the cost of error correction in character-based text entry technologies, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753329"},{"content":"Stuart K. Card , Allen Newell , Thomas P. Moran, The  Psychology of Human-Computer Interaction, L. Erlbaum Associates Inc., Hillsdale, NJ, 1983","paperID":"578027"},{"content":"Crossman, E. R. F. W. (1957) The speed and accuracy of simple hand movements. In The Nature and Acquisition of Industrial Skills, E. R. F. W. Crossman and W. D. Seymour (eds.). The M.R.C. and D.I.S.R. Joint Committee on Individual Efficiency in Industry.","paperID":"None"},{"content":"Dean, M., Wu, S.-W., & Maloney, L. T. (2007) Trading off speed and accuracy in rapid, goal-directed movements. J. of Vision, 7 (5), 1--12.","paperID":"None"},{"content":"Sarah A. Douglas , Arthur E. Kirkpatrick , I. Scott MacKenzie, Testing pointing device performance and user assessment with the ISO 9241, Part 9 standard, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.215-222, May 15-20, 1999, Pittsburgh, Pennsylvania, USA","paperID":"303042"},{"content":"Elliott, D., Hansen, S., Mendoza, J., and Tremblay, L. (2004) Learning to optimize speed, accuracy, and energy expenditure: a framework for understanding speed-accuracy relations in goal-directed aiming. J. Motor Behav. 36 (3), 339--351.","paperID":"None"},{"content":"Fitts, P. M. (1954) The information capacity of the human motor system in controlling the amplitude of movement. J. of Exp. Psychology 47 (6), 381--391.","paperID":"None"},{"content":"Fitts, P. M. and Radford, B. K. (1966) Information capacity of discrete motor responses under different cognitive sets. J. of Exp. Psychology 71 (4), 475--482.","paperID":"None"},{"content":"Gigerenzer, G. and Selten, R. (2002). Bounded Rationality: The Adaptive Toolbox. MIT Press.","paperID":"None"},{"content":"Gray, W. D. and Boehm-Davis, D. A. (2000) Milliseconds matter: an introduction to microstrategies and to their use in describing and predicting interactive behavior. J. of Exp. Psychology: A., 6 (4), 322--335.","paperID":"None"},{"content":"Gray, W. D., Sims, C. R., Fu, W., and Schoelles, M. J. (2006) The soft constraints hypothesis: a rational analysis approach to resource allocation for interactive behavior. Psychological Review, 113 (3), 461--482.","paperID":"None"},{"content":"Yves Guiard , Halla B. Olafsdottir , Simon T. Perrault, Fitt's law as an explicit time/error trade-off, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979179"},{"content":"Hancock, P. A. and Newell, K. M. (1985) The movement speed-accuracy relationship in space-time. In Motor Behavior: Programming, Control, and Acquisition, Heuer, H., Kleinbeck, U., and Schmidt, K. H. (eds). Springer-Verlag, 153--188.","paperID":"None"},{"content":"Howes, A., Lewis, R. L., and Vera, A. (2009) Rational adaptation under task and processing constraints: Implications for testing theories of cognition and action. Psychological Review, 116, 4, 717--751.","paperID":"None"},{"content":"Hudson, T. E., Maloney, L. T., and Landy, M. S. (2007) Movement Planning With Probabilistic Target Information. J. Neurophys 98, 3034--3046.","paperID":"None"},{"content":"Hudson, T. E., Maloney, L. T., and Landy, M. S. (2008) Optimal Compensation for Temporal Uncertainty in Movement Planning. PLoS Comput. Biol. 4(7).","paperID":"None"},{"content":"Kahneman, D. and Tversky, A. (1979) \"Prospect Theory: An Analysis of Decision under Risk\", Econometrica, XLVII, 263--291.","paperID":"None"},{"content":"I. Scott MacKenzie, Fitts' law as a research and design tool in human-computer interaction, Human-Computer Interaction, v.7 n.1, p.91-139, March 1992","paperID":"1461857"},{"content":"I. Scott MacKenzie , Poika Isokoski, Fitts' throughput and the speed-accuracy tradeoff, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357308"},{"content":"I. Scott MacKenzie , Shawn X. Zhang, The design and evaluation of a high-performance soft keyboard, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.25-31, May 15-20, 1999, Pittsburgh, Pennsylvania, USA","paperID":"302983"},{"content":"Meyer, D. E., Abrams, R. A., Kornblum, S., Wright, C. E., and Smith, J. E. K. (1988) Optimality in human motor performance: ideal control of rapid aimed movements. Psychological Review 95, 340--370.","paperID":"None"},{"content":"Meyer, D. E., Smith, J. E. K., Kornblum, S., Abrams, R. A. and Wright, C. E. (1990) Speed-accuracy tradeoffs in aimed movements: toward a theory of rapid voluntary action. In Attention and Performance XIII, Jeannerod, M. (ed). Lawrence Erlbaum, 173--226.","paperID":"None"},{"content":"Munichor, N., Erev, I., and Lotem, A. (2006) Risk attitude in small timesaving decisions. J. of Exp. Psychology: Applied, 12 (3), 129--141.","paperID":"None"},{"content":"Plamondon, R. and Alimi, A. M. (1997) Speed/accuracy trade-offs in target-directed movements. Behav. Brain Sci. 20 (2), 279--349.","paperID":"None"},{"content":"Reason, J. (1990), Human Error. Cambridge University Press, Manchester.","paperID":"None"},{"content":"Schoemaker, P. J. H. (1982). The Expected Utility Model: Its Variants, Purposes, Evidence and Limitations. J. of Economic Literature 20, 529--563.","paperID":"None"},{"content":"R. William Soukoreff , I. Scott MacKenzie, Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI, International Journal of Human-Computer Studies, v.61 n.6, p.751-789, December 2004","paperID":"1056155"},{"content":"R. W. Soukoreff , I. S. MacKenzie, An informatic rationale for the speed-accuracy trade-off, Proceedings of the 2009 IEEE international conference on Systems, Man and Cybernetics, p.2890-2896, October 11-14, 2009, San Antonio, TX, USA","paperID":"1732198"},{"content":"Trommershäuser, J., Maloney, L. T., and Landy, M. S. (2003) Statistical decision theory and rapid, goaldirected movements. J. of the Optical Soc., 1419--1433.","paperID":"None"},{"content":"Trommershäuser, J., Maloney, L. T., and Landy M. S. (2008) The expected utility of movement. Neuroeconomics, Academic Press, 95--111.","paperID":"None"},{"content":"Welford, A. T. (1968) Fundamentals of Skill. Methuen, London.","paperID":"None"},{"content":"Jacob O. Wobbrock , Edward Cutrell , Susumu Harada , I. Scott MacKenzie, An error model for pointing based on Fitts' law, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357306"},{"content":"Jacob O. Wobbrock , Alex Jansen , Kristen Shinohara, Modeling and predicting pointing errors in two dimensions, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979183"},{"content":"Jacob O. Wobbrock , Kristen Shinohara , Alex Jansen, The effects of task dimensionality, endpoint deviation, throughput calculation, and experiment design on pointing measures and models, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979181"},{"content":"Woodworth, R. S. (1899) The accuracy of voluntary movement. Psychological Review, Monograph Supplements 3 (2, Whole No. 13), 1--114.","paperID":"None"},{"content":"Young, S. J., Pratt, J., Chau, T. (2009) Target-Directed Movements at a Comfortable Pace: Movement Duration and Fitts's Law. J. Motor Behav. 41, 339--346.","paperID":"None"},{"content":"Shumin Zhai , Michael Hunter , Barton A. Smith, The metropolis keyboard - an exploration of quantitative techniques for virtual keyboard design, Proceedings of the 13th annual ACM symposium on User interface software and technology, p.119-128, November 06-08, 2000, San Diego, California, USA","paperID":"354424"},{"content":"Shumin Zhai , Jing Kong , Xiangshi Ren, Speed-accuracy tradeoff in Fitts' law tasks: on the equivalency of actual and nominal pointing precision, International Journal of Human-Computer Studies, v.61 n.6, p.823-856, December 2004","paperID":"1056158"}],"abstract":"One of the fundamental operations in today's user interfaces is pointing to targets, such as menus, buttons, and text. Making an error when selecting those targets in real-life user interfaces often results in some cost to the user. However, the existing target-directed pointing models do not consider the cost of error when predicting task completion time. In this paper, we present a model based on expected value theory that predicts the impact of the error cost on the user's completion time for target-directed pointing tasks. We then present a target-directed pointing user study, which results show that time-based costs of error significantly impact the user's performance. Our results also show that users perform according to an expected completion time utility function and that optimal performance computed using our model gives good prediction of the observed task completion times.","video":"http://www.youtube.com/embed/1ZqeXpqeyZ4?rel=0","title":"The effect of time-based cost of error in target-directed pointing tasks","filename":"CHI13/p1373","authors":["Nikola Banovic","Tovi Grossman","George Fitzmaurice"],"conference":"CHI '13"}