{"paperId":2466220,"reference":[{"content":"Jason Alexander , Mark T. Marshall , Sriram Subramanian, Adding haptic feedback to mobile tv, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979899"},{"content":"Bolanowski, S. J., Gescheider, G. A, Verrillo, R. T, and Checkosky, C. M. Four channel mediate the mechanical aspects of touch. Journal of Acoustical Society of America, 84(5) (1988), 1680--1694.","paperID":"None"},{"content":"Brown, L., and Kaye, J. 'J.' Eggs-ploring the influence of material properties on haptic experience. HAID '07.","paperID":"None"},{"content":"Byrt, T. How Good Is That Agreement? Epidemiology, 7(5) (1996), 561.","paperID":"None"},{"content":"Cahour, B., and Salembier, P. 2012. The user phenomenological Experience; evoking the lived activity with \"re-situating\" interviews, CHI 2012.","paperID":"None"},{"content":"Angela Chang , Hiroshi Ishii, Sensorial interfaces, Proceedings of the 6th conference on Designing Interactive systems, June 26-28, 2006, University Park, PA, USA","paperID":"1142415"},{"content":"Choi, K., and Jun, C. A systematic approach to the Kansei factors of tactile sense regarding the surface roughness. Applied Ergonomics, 38 (1) (2007), 53--63.","paperID":"None"},{"content":"Dagman, J., Karlsson, M. A., and Wikström L. Investigating the haptic aspects of verbalised product experiences. Intern. J. of Design, 4(3) (2010), 15--27.","paperID":"None"},{"content":"Mario Enriquez , Karon MacLean , Christian Chita, Haptic phonemes: basic building blocks of haptic communication, Proceedings of the 8th international conference on Multimodal interfaces, November 02-04, 2006, Banff, Alberta, Canada","paperID":"1181053"},{"content":"Gallace, A., and Spence, C. The Cognitive and Neural Correlates of Tactile Memory. Psychophysical Bulletin, 135(3) (2009), 380--406.","paperID":"None"},{"content":"Gescheider, G. A, Wright, J. H., and Verrillo, R. T. Information-Processing Channels in the Tactile Sensory System: A Psychophysical and Physiological Analysis. New York: Taylor & Francis, 2009.","paperID":"None"},{"content":"Gescheider, G. A., Bolanowski, S. J., Pope, J. V., and Verrillo, R. T. A four-channel analysis of the tactile sensitivity of the fingertip: frequency selectivity, spatial summation, and temporal summation. Somatosensory and Motor Research, 19(2) (2002), 114--124.","paperID":"None"},{"content":"Gescheider, G. A., Bolanowski, S. J., and Hardick, K. R. The frequency selectivity of information-processing channels in the tactile sensory system. Somatosensory and Motor Research, 18(3) (2001), 191--201.","paperID":"None"},{"content":"Takayuki Hoshi , Masafumi Takahashi , Takayuki Iwamoto , Hiroyuki Shinoda, Noncontact Tactile Display Based on Radiation Pressure of Airborne Ultrasound, IEEE Transactions on Haptics, v.3 n.3, p.155-165, July 2010","paperID":"1908041"},{"content":"Jansson-Boyd, C. V. Touch matters: exploring the relationship between consumption and tactile interaction. Social Semiotics. 21(4) (2011), 531--546.","paperID":"None"},{"content":"Johnson, K. O. The roles and functions of cutaneous mechanoreceptors. Neurobiology, 11 (2001), 455--461.","paperID":"None"},{"content":"Johnson, K. O., Yoshioka, T., and Vega-Bermudez, F. Tactile Functions of Mechanoreceptive Afferents Innervating the Hand. Journal of Clinical Neurophysiology, 17(6) (2000), 539--558.","paperID":"None"},{"content":"Johansson, R. S., and Vallbo, A. B. Tactile sensibility in the human hand: relative and absolute densities of four types of mechanoreceptive units in glabrous skin. Journal Physiology, 286 (1979), 283--300.","paperID":"None"},{"content":"Katz, D. The world of touch. Krueger, L. E. (Ed). Hillsdale, NJ: Erlbaum, 1989.","paperID":"None"},{"content":"Johan Kildal, Kooboh: variable tangible properties in a handheld haptic-illusion box, Proceedings of the 2012 international conference on Haptics: perception, devices, mobility, and communication, June 13-15, 2012, Tampere, Finland","paperID":"2352211"},{"content":"Lederman, S. J., and Klatzky, R. L. Hand movements: A window into haptic object recognition. Cognitive Psychology, 19 (1987), 342--368.","paperID":"None"},{"content":"Lennertz, R. C., Tsunozaki, M., Bautista, D. M., and Stucky, C. L. Physiological basis of tingling paresthesia evoked by hydroxy-alpha-sanshool. J Neurosci. 30(12) (2010), 4353--4361.","paperID":"None"},{"content":"Light, A. Adding method to meaning: A Technique for exploring peoples' experiences with technology. Beh. & Information Technology, 25 (06) (2006), 175--187.","paperID":"None"},{"content":"Mountcastle, V. B. The sensory hand: neural mechanisms of somatic sensation. Cambridge, MA: Harvard University Press, 2005.","paperID":"None"},{"content":"Mousette, C. Simple Haptics: Sketching Perspectives for the design of Haptic Interactions, PhD Thesis, Umea University, Oct-2012.","paperID":"None"},{"content":"Ochoa, J. L., Torebjörk, H. E. Paraesthesiae from ectopic impulse generation in human sensory nerves. Brain 103 (1980), 835--853.","paperID":"None"},{"content":"Conor O'Sullivan , Angela Chang, An activity classification for vibrotactile phenomena, Proceedings of the First international conference on Haptic and Audio Interaction Design, August 31-September 01, 2006, Glasgow, UK","paperID":"2165451"},{"content":"Jerome Pasquero , Vincent Hayward, Tactile feedback can assist vision during mobile interactions, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979427"},{"content":"Petitmengin, C. Describing one's Subjective Experience in the Second Person. An Interview Method for the Science of Consciousness. Phenomenology and the Cognitive Sciences, 5 (2006), 229--269.","paperID":"None"},{"content":"Sonneveld, M. H., and Schifferstein. H. N. J. The tactual experience of objects. In Schifferstein, H. N. J., Hekkert, P. (Eds.). Product Experience. Elsevier, 2008, 41--67.","paperID":"None"},{"content":"Hendrik N. J. Schifferstein, Multi sensory design, Procedings of the Second Conference on Creativity and Innovation in Design, October 19-21, 2011, Eindhoven, Netherlands","paperID":"2079270"},{"content":"Spence, Charles (2010). The multisensory perception of flavor. In the Psychologist (Sept. 2010), 23(9), 720--723.","paperID":"None"},{"content":"Syrdal, D., Dautenhahn, K., Koay, K., Walters, M. and Otero, N. Exploring human mental models of robots through explicitation interviews. RO-MAN '10, 638--645.","paperID":"None"},{"content":"Tosey, P., and Mathison, J. Exploring inner landscapes through psychophenomenology. Qual. Research in Organiz. & Management: Inter. J., 5(1) (2010), 63--82.","paperID":"None"},{"content":"Vermersch, P. L'entretien d'explicitation, ESF, 1994.","paperID":"None"},{"content":"Vermersch, P., and Maurel, M., Pratiques de l'entretien d'explicitation, ESF, 1997.","paperID":"None"},{"content":"Williams, L., and Ackerman, J., Please touch the merchandise. Harvard Business Review, 2011.","paperID":"None"},{"content":"Verrillo, R. T., Bolanowski, S. J. Jr. The effects of skin temperature on the psychophysical responses to vibration on glabrous and hairy skin. Journal of the Acoustical Society of America, 80(2) (1986), 528--32.","paperID":"None"},{"content":"Graham Wilson , Martin Halvey , Stephen A. Brewster , Stephen A. Hughes, Some like it hot: thermal feedback for mobile devices, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979316"}],"citation":[{"content":"Flynn Wolf , Ravi Kuber, Developing tactile feedback for wearable presentation: observations from using a participatory approach, Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, September 23-26, 2014, Toronto, ON, Canada","paperID":"2634230"},{"content":"Logan Kugler, Touching the virtual, Communications of the ACM, v.58 n.8, August 2015","paperID":"2788496"},{"content":"Manfred Tscheligi , Katherine Isbister , Kristina Höök , Marianna Obrist , Marc Busch , Christina Anna Hochleitner, \"Touch me\": workshop on tactile user experience evaluation methods, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2560471"},{"content":"Assunta Matassa , Leonardo Angelini , Maurizio Caon , Marianna Obrist , Elena Mugellini, Second Workshop on Full-Body and Multisensory Experience, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2854116"},{"content":"Marianna Obrist , Sriram Subramanian , Elia Gatti , Benjamin Long , Thomas Carter, Emotions Mediated Through Mid-Air Haptics, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702361"},{"content":"Ingrid Maria Pohl , Lian Loke, Touch toolkit: a method to convey touch-based design knowledge and skills, Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction, February 16-19, 2014, Munich, Germany","paperID":"2540957"},{"content":"Max Pfeiffer , Stefan Schneegass , Florian Alt , Michael Rohs, Let me grab this: a comparison of EMS and vibration for haptic feedback in free-hand interaction, Proceedings of the 5th Augmented Human International Conference, p.1-8, March 07-08, 2014, Kobe, Japan","paperID":"2582099"},{"content":"Graham Wilson , Thomas Carter , Sriram Subramanian , Stephen A. Brewster, Perception of ultrasonic haptic feedback on the hand: localisation and apparent motion, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557033"},{"content":"Marianna Obrist , Rob Comber , Sriram Subramanian , Betina Piqueras-Fiszman , Carlos Velasco , Charles Spence, Temporal, affective, and embodied characteristics of taste experiences: a framework for design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557007"},{"content":"Tom Carter , Sue Ann Seah , Benjamin Long , Bruce Drinkwater , Sriram Subramanian, UltraHaptics: multi-point mid-air haptic feedback for touch surfaces, Proceedings of the 26th annual ACM symposium on User interface software and technology, October 08-11, 2013, St. Andrews, Scotland, United Kingdom","paperID":"2502018"},{"content":"Assunta Matassa , Luca Console , Leonardo Angelini , Maurizio Caon , Omar Abou Khaled, Workshop on full-body and multisensory experience in ubiquitous interaction, Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers, September 07-11, 2015, Osaka, Japan","paperID":"2806201"}],"abstract":"A common problem with designing and developing applications with tactile interfaces is the lack of a vocabulary that allows one to describe or communicate about haptics. Here we present the findings from a study exploring participants' verbalizations of their tactile experiences across two modulated tactile stimuli (16Hz and 250Hz) related to two important mechanoreceptors in the human hand. The study, with 14 participants, applied the explicitation interview technique to capture detailed descriptions of the diachronic and synchronic structure of tactile experiences. We propose 14 categories for a human-experiential vocabulary based on the categorization of the findings and tie them back to neurophysiological and psychophysical data on the human hand. We finally discuss design opportunities created through this experiential understanding in relation to the two mechanoreceptors.","video":"http://www.youtube.com/embed/P8GzUGG7L9U?rel=0","title":"Talking about tactile experiences","filename":"CHI13/p1659","authors":["Marianna Obrist","Sue Ann Seah","Sriram Subramanian"],"conference":"CHI '13"}