{"paperId":2470753,"citation":[{"content":"Aitor Apaolaza, Identifying emergent behaviours from longitudinal web use, Proceedings of the adjunct publication of the 26th annual ACM symposium on User interface software and technology, October 08-11, 2013, St. Andrews, Scotland, United Kingdom","paperID":"2508475"},{"content":"Thomas Zimmermann, Software analytics for digital games: keynote abstract, Proceedings of the Fourth International Workshop on Games and Software Engineering, May 16-24, 2015, Florence, Italy","paperID":"2820146"},{"content":"Eddie Q. Yan , Jeff Huang , Gifford K. Cheung, Masters of Control: Behavioral Patterns of Simultaneous Unit Group Manipulation in StarCraft 2, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702429"},{"content":"Marcus Carter , John Downs , Bjorn Nansen , Mitchell Harrop , Martin Gibbs, Paradigms of games research in HCI: a review of 10 years of research at CHI, Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play, October 19-21, 2014, Toronto, Ontario, Canada","paperID":"2658708"}],"reference":[{"content":"Bryan, W. L., and Harter, N. Studies in the physiology and psychology of the telegraphic language. Psychological Review 4, 1 (1897), 27--53.","paperID":"None"},{"content":"Bryan, W. L., and Harter, N. Studies on the telegraphic language: The acquisition of a hierarchy of habits. Psychological Review 6, 4 (1899), 345--375.","paperID":"None"},{"content":"Gifford Cheung , Jeff Huang, Starcraft from the stands: understanding the game spectator, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979053"},{"content":"Dangauthier, P., Herbrich, R., Minka, T., and Graepel, T. Trueskill through time: Revisiting the history of chess. In Proc. of NIPS (2007), 337--344.","paperID":"None"},{"content":"d_ijk_stra. Statistical bonjwa theory: the history of bw. Retrieved August 1, 2012 from http://www.teamliquid.net/forum/viewmessage.php?topic_id=357124.","paperID":"None"},{"content":"Elo, A. E. The rating of chessplayers, past and present. Batsford, 1978.","paperID":"None"},{"content":"Brent Harrison , David L. Roberts, Using sequential observations to model and predict player behavior, Proceedings of the 6th International Conference on Foundations of Digital Games, p.91-98, June 29-July 01, 2011, Bordeaux, France","paperID":"2159378"},{"content":"Herbrich, R., Minka, T., and Graepel, T. Trueskill\": A bayesian skill rating system. In Proc. of NIPS (2006), 569--576.","paperID":"None"},{"content":"Hock-koon, S. Aordances of elliptical learning in arcade video games. In Proc. of DiGRA Nordic (2012).","paperID":"None"},{"content":"Kenneth Hullett , Nachiappan Nagappan , Eric Schuh , John Hopson, Empirical analysis of user data in game software development, Proceedings of the ACM-IEEE international symposium on Empirical software engineering and measurement, September 19-20, 2012, Lund, Sweden","paperID":"2372265"},{"content":"Keller, F. The phantom plateau. Journal of the Experimental Analysis of Behavior 1, 1 (1958), 1--13.","paperID":"None"},{"content":"Michael J. Lee , Andrew J. Ko, Personifying programming tool feedback improves novice programmers' learning, Proceedings of the seventh international workshop on Computing education research, August 08-09, 2011, Providence, Rhode Island, USA","paperID":"2016934"},{"content":"Jessica Lin , Eamonn Keogh , Stefano Lonardi , Bill Chiu, A symbolic representation of time series, with implications for streaming algorithms, Proceedings of the 8th ACM SIGMOD workshop on Research issues in data mining and knowledge discovery, June 13-13, 2003, San Diego, California","paperID":"882086"},{"content":"Winter Mason , Aaron Clauset, Friends FTW! friendship and competition in halo: reach, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441820"},{"content":"Reeves, S., Brown, B., and Laurier, E. Experts at play understanding skilled expertise. Games and Culture 4, 3 (2009), 205--227.","paperID":"None"},{"content":"Staron, R. S., Leonardi, M. J., Karapondo, D. L., Malicky, E. S., Falkel, J. E., Hagerman, F. C., and Hikida, R. S. Strength and skeletal muscle adaptations in heavy-resistance-trained women after detraining and retraining. Journal of Applied Physiology 70, 2 (1991), 631--640.","paperID":"None"},{"content":"Günter Wallner , Simone Kriglstein, A spatiotemporal visualization approach for the analysis of gameplay data, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208558"},{"content":"Ryen W. White , Susan T. Dumais , Jaime Teevan, Characterizing the influence of domain expertise on web search behavior, Proceedings of the Second ACM International Conference on Web Search and Data Mining, February 09-12, 2009, Barcelona, Spain","paperID":"1498819"},{"content":"Yan Xu , Xiang Cao , Abigail Sellen , Ralf Herbrich , Thore Graepel, Sociable killers: understanding social relationships in an online first-person shooter game, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958854"}],"abstract":"How do video game skills develop, and what sets the top players apart? We study this question of skill through a rating generated from repeated multiplayer matches called TrueSkill. Using these ratings from 7 months of games from over 3 million players, we look at how play intensity, breaks in play, skill change over time, and other games affect skill. These analyzed factors are then combined to model future skill and games played; the results show that skill change in early matches is a useful metric for modeling future skill, while play intensity explains eventual games played. The best players in the 7-month period, who we call \"Master Blasters\", have varied skill patterns that often run counter to the trends we see for typical players. The data analysis is supplemented with a 70 person survey to explore how players' self-perceptions compare to the gameplay data; most survey responses align well with the data and provide insight into player beliefs and motivation. Finally, we wrap up with a discussion about hiding skill information from players, and implications for game designers.","video":"http://www.youtube.com/embed/tP7sPfoGz7E?rel=0","title":"Mastering the art of war: how patterns of gameplay influence skill in Halo","filename":"CHI13/p695","authors":["Jeff Huang","Thomas Zimmermann","Nachiappan Nagapan","Charles Harrison","Bruce C. Phillips"],"conference":"CHI '13"}