{"paperId":2470669,"citation":[{"content":"Wei Li , Tovi Grossman , George Fitzmaurice, CADament: a gamified multiplayer software tutorial system, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2556954"},{"content":"Sarah Esper , Stephen R. Foster , William G. Griswold , Carlos Herrera , Wyatt Snyder, CodeSpells: bridging educational language features with industry-standard languages, Proceedings of the 14th Koli Calling International Conference on Computing Education Research, p.05-14, November 20-23, 2014, Koli, Finland","paperID":"2674684"}],"reference":[{"content":"Barab, S. A., and Plucker, J. A. Smart people or smart contexts? cognition, ability, and talent development in an age of situated approaches to knowing and learning. Educational Psychologist 37 (2002), 165--182.","paperID":"None"},{"content":"http://us.battle.net/sc2/en/blog/2053471, August 2012."},{"content":"Bauman, E. B. Game-Based Teaching and Simulation in Nursing and Health Care. Springer, 2012.","paperID":"None"},{"content":"Bransford, J. D., on Developments in the Science of Learning., N. R. C. E.-U. C., on Learning Research, N. R. C. E.-U. C., and Practice., E. How people learn : brain, mind, experience, and school, 2 ed. National Academy Press, Sept. 2000.","paperID":"None"},{"content":"Brown, J., Collins, A., and Duguid, P. Situated cognition and the culture of learning. Educational Researcher 18, 1 (1989), 32.","paperID":"None"},{"content":"Bruckman, A. Can educational be fun? In presented at the Game Developers Conference '99, San Jose, CA. (1999).","paperID":"None"},{"content":"Gifford Cheung , Jeff Huang, Starcraft from the stands: understanding the game spectator, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979053"},{"content":"codespells.blogspot.com, August 2012.","paperID":"None"},{"content":"Laura Dabbish , Robert Kraut , Jordan Patton, Communication and commitment in an online game team, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208529"},{"content":"degroot, A. D. Thought and Choice in Chess. Mouton, The Hague, The Netherlands, 1965.","paperID":"None"},{"content":"Dweck, C. Mindset: The New Psychology of Success. Ballantine Books, 2007.","paperID":"None"},{"content":"Katrina Falkner , Edward Palmer, Developing authentic problem solving skills in introductory computing classes, ACM SIGCSE Bulletin, v.41 n.1, March 2009","paperID":"1508871"},{"content":"Fisher, R. Thinking about thinking: Developing metacognition in children. Early Child Development and Care 141 (Feb 1998), 1--15.","paperID":"None"},{"content":"http://gamereplays.org, August 2012."},{"content":"Gee, J. P. What would a state of the art instructional video game look like. Innovate Journal of online education 1, 6 (2005).","paperID":"None"},{"content":"Gee, J. P., and Shaffer, D. Looking where the light is bad: Video games and the future of assessment. EDge (2010).","paperID":"None"},{"content":"Gobet, F., and Charness, N. Expertise in chess. In Chess and games. Cambridge handbook on expertise and expert performance, F. Gobet and N. Charness, Eds. Cambridge University Press, Cambridge, Massachusetts, USA, 2006, 523--538.","paperID":"None"},{"content":"Habgood, M. J., and Ainsworth, S. E. Motivating children to learn effectively: Exploring the value of intrinsic integration in educational games. Journal of the Learning Sciences, 1 (2011).","paperID":"None"},{"content":"Habgood, M. P. J., Ainsworth, S. E., and Benford, S. Endogenous fantasy and learning in digital games. Simulation and Gaming 36, 4 (2005), 483--498.","paperID":"None"},{"content":"Katherine Isbister , Mary Flanagan , Chelsea Hash, Designing games for learning: insights from conversations with designers, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753637"},{"content":"Joshua M. Lewis, Patrick Trinh, D. K. A corpus analysis of strategy video game play in starcraft: Brood war. In Proceedings of the 33rd Annual Conference of the Cognitive Science Society, T. S. L. Carlson, C. Hlscher, Ed. (2011), 687--692.","paperID":"None"},{"content":"Mehdi Kaytoue , Arlei Silva , Loïc Cerf , Wagner Meira, Jr. , Chedy Raïssi, Watch me playing, i am a professional: a first study on video game live streaming, Proceedings of the 21st international conference companion on World Wide Web, April 16-20, 2012, Lyon, France","paperID":"2188259"},{"content":"Conor Linehan , Ben Kirman , Shaun Lawson , Gail Chan, Practical, appropriate, empirically-validated guidelines for designing educational games, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979229"},{"content":"Malone, T. W. Toward a theory of intrinsically motivating instruction. Cognitive Science 5, 4 (1981), 333 -- 369.","paperID":"None"},{"content":"Laurie Murphy , Lynda Thomas, Dangers of a fixed mindset: implications of self-theories research for computer science education, Proceedings of the 13th annual conference on Innovation and technology in computer science education, June 30-July 02, 2008, Madrid, Spain","paperID":"1384344"},{"content":"Reingold, E. M., Charness, N., Pomplun, M., and Stampe, D. M. Visual span in expert chess players: Evidence from eye movements. Psychological Science 12 (2001), 48--55.","paperID":"None"},{"content":"Glen Robertson , Ian Watson, Case-based learning by observation: preliminary work, Proceedings of The 8th Australasian Conference on Interactive Entertainment: Playing the System, p.1-1, July 21-22, 2012, Auckland, New Zealand","paperID":"2336751"},{"content":"Sadler, D. R. Beyond feedback: developing student capability in complex appraisal. Assessment and Evaluation in Higher Education 35, 5 (2010), 535--550.","paperID":"None"},{"content":"Scardamalia, M., Bereiter, C., and Steinbach, R. Teachability of re\\'02ective processes in written composition. Cognitive Science 8, 2 (1984), 173--190.","paperID":"None"},{"content":"Schoenfeld, A. H., and Mathematical Association of America, Washington, D. Problem Solving in the Mathematics Curriculum. A Report, Recommendations, and an Annotated Bibliography. MAA Notes, Number 1 {microform} / Alan H. Schoenfeld. Distributed by ERIC Clearinghouse, {Washington, D.C.} :, 1983.","paperID":"None"},{"content":"Shaffer, D. W. Pedagogical praxis: The professions as models for post-industrial education. Teachers College Record 106 (2004), 1401--1421.","paperID":"None"},{"content":"Shaffer, D. W. Epistemic games. Journal of Online Education (2005).","paperID":"None"},{"content":"Beth Simon , Brian Hanks , Laurie Murphy , Sue Fitzgerald , Renée McCauley , Lynda Thomas , Carol Zander, Saying isn't necessarily believing: influencing self-theories in computing, Proceedings of the Fourth international Workshop on Computing Education Research, p.173-184, September 06-07, 2008, Sydney, Australia","paperID":"1404537"},{"content":"Simon, H. A., and Chase, W. G. Perception in chess. Cognitive Psychology 1 (1973), 33--81.","paperID":"None"},{"content":"Simon, H. A., and Chase, W. G. Skill in chess. American Scientist 61 (1973), 394--403.","paperID":"None"},{"content":"Adam M. Smith , Erik Andersen , Michael Mateas , Zoran Popović, A case study of expressively constrainable level design automation tools for a puzzle game, Proceedings of the International Conference on the Foundations of Digital Games, May 29-June 01, 2012, Raleigh, North Carolina","paperID":"2282370"},{"content":"Vygotskii, L. S., and Cole, M. Mind in society : the development of higher psychological processes / L. S. Vygotsky ; edited by Michael Cole ... {et al.}. Harvard University Press, Cambridge :, 1978.","paperID":"None"},{"content":"Wenger, E. Communities of Practice: Learning, Meaning, and Identity (Learning in Doing: Social, Cognitive and Computational Perspectives), 1 ed. Cambridge University Press, Sept. 1999.","paperID":"None"},{"content":"White, B. Y., and Frederiksen, J. R. Inquiry, Modeling, and Metacognition: Making Science Accessible to All Students. Cognition and Instruction 16, 1 (1998).","paperID":"None"}],"abstract":"We investigate the unique educational benefits of 1-on-1 competitive games, arguing that such games can be just as easy to design as single-player educational games, while yielding a more diverse and sustainable learning experience. We present a study of chess and StarCraft II in order to inform the design of similar educational games and their communities. We discuss a competitive game we designed to teach Java programming. We evaluate the game by discussing its user study. Our main contributions are 1) an argument that the use of 1-on-1 competition can solve two existing problems inherent to single-player games, 2) an analysis of the features that make competitive games effective learning environments, and 3) an early but encouraging description of the emergent learning environment one can expect from designing an educational game with these features.","video":"http://www.youtube.com/embed/YF5Y669UDxk?rel=0","title":"From competition to metacognition: designing diverse, sustainable educational games","filename":"CHI13/p99","authors":["Stephen R. Foster","Sarah Esper","William G. Griswold"],"conference":"CHI '13"}