{"paperId":2470769,"citation":[{"content":"Christian Reuter , Thomas Ludwig , Therese Friberg , Sylvia Pratzler-Wanczura , Alexis Gizikis, Social Media and Emergency Services?: Interview Study on Current and Potential Use in 7 European Countries, International Journal of Information Systems for Crisis Response and Management, v.7 n.2, p.36-58, April 2015","paperID":"2891021"},{"content":"Joanne I. White , Leysia Palen, Expertise in the Wired Wild West, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675167"},{"content":"Sheena L. Erete, Engaging Around Neighborhood Issues: How Online Communication Affects Offline Behavior, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675182"},{"content":"Megan Finn , Elisa Oreglia, A Fundamentally Confused Document: Situation Reports and the Work of Producing Humanitarian Information, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820031"},{"content":"John Harvey , David Golightly , Andrew Smith, HCI as a means to prosociality in the economy, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557367"},{"content":"Sophia B. Liu, Crisis Crowdsourcing Framework: Designing Strategic Configurations of Crowdsourcing for the Emergency Management Domain, Computer Supported Cooperative Work, v.23 n.4-6, p.389-443, December  2014","paperID":"2669442"},{"content":"Muhammad Imran , Carlos Castillo , Fernando Diaz , Sarah Vieweg, Processing Social Media Messages in Mass Emergency: A Survey, ACM Computing Surveys (CSUR), v.47 n.4, p.1-38, July 2015","paperID":"2771588"}],"reference":[{"content":"Bush, V. As We May Think, Atlantic Monthly, (July 1945), 101--108.","paperID":"None"},{"content":"Engelbart, D. Augmenting Human Intellect: A Conceptual Framework. AFOSR-3233, Summary Report. Stanford Research Institute, 1962.","paperID":"None"},{"content":"Douglas Engelbart, Augmenting society's collective IQs, Proceedings of the fifteenth ACM conference on Hypertext and hypermedia, p.1-1, August 09-13, 2004, Santa Cruz, CA, USA","paperID":"1012809"},{"content":"Franks, N. Army Ants: A Collective Intelligence: A neural network seems an apt analogy as a colony of army ants navigates the tropical rain forest. American Scientist, 77, 2 (March-April 1989), pp. 138--145.","paperID":"None"},{"content":"Fritz, C. E. & Mathewson, J. H. Convergence Behavior in Disasters: A Problem in Social Control, Committee on Disaster Studies, National Academy of Sciences, National Research Council, Washington DC, 1957.","paperID":"None"},{"content":"Giddens, A. Central problems in social theory: action, structure and contradiction in social analysis, University of California Press, Berkeley, 1979.","paperID":"None"},{"content":"Harvard Humanitarian Initiative. Disaster Relief 2.0: The Future of Information Sharing in Humanitarian Emergencies. Washington, D.C. & Berkshire, UK: UN Foundation & Vodafone Foundation Technology Partnership, 2011.","paperID":"None"},{"content":"John Haugeland, Artificial intelligence: the very idea, Massachusetts Institute of Technology, Cambridge, MA, 1985","paperID":"4694"},{"content":"Thomas Heverin , Lisl Zach, Use of microblogging for collective sense-making during violent crises: a study of three campus shootings, Journal of the American Society for Information Science and Technology, v.63 n.1, p.34-47, January 2012","paperID":"2336251"},{"content":"James Hollan , Edwin Hutchins , David Kirsh, Distributed cognition: toward a new foundation for human-computer interaction research, ACM Transactions on Computer-Human Interaction (TOCHI), v.7 n.2, p.174-196, June 2000","paperID":"353487"},{"content":"Hughes, A., L. Palen, J. Sutton, S. Liu, & S. Vieweg. \"Site-Seeing\" in Disaster: An Examination of On-Line Social Convergence. Proc. of ISCRAM 2008.","paperID":"None"},{"content":"Hutchins, E. Cognition in the Wild. Cambridge, Mass: MIT Press, 1995.","paperID":"None"},{"content":"Hutchins, E. The Social Organization of Distributed Cognition. Course Lecture, COGS 102a, UCSD, 2011. http://hci.ucsd.edu/102a/10Lectures/SODC-basics.pdf","paperID":"None"},{"content":"Hutchins E. & Klausen, T. Distributed Cognition in an Airline Cockpit. In Middleton, D. & Engeström, Y. (Eds.) Communication and Cognition at Work. (pp. 15--34) Cambridge University Press, 1996.","paperID":"None"},{"content":"Kendra, J. M. & Wachtendorf, T. Reconsidering Convergence and Converger: Legitimacy in Response to the World Trade Center Disaster, Terrorism and Disaster: New Threats, New Ideas: Research in Social Problems and Public Policy, 11, (2003), 97--122.","paperID":"None"},{"content":"Lévy, P. as translated by Bononno, R. Collective Intelligence. Perseus Book, USA, 1997.","paperID":"None"},{"content":"Malone, T. W., Laubacher, R. & Dellarocas, C. N., Harnessing Crowds: Mapping the Genome of Collective Intelligence (February 3, 2009). MIT Sloan Research Paper No. 4732-09.","paperID":"None"},{"content":"Marcelo Mendoza , Barbara Poblete , Carlos Castillo, Twitter under crisis: can we trust what we RT?, Proceedings of the First Workshop on Social Media Analytics, p.71-79, July 25-28, 2010, Washington D.C., District of Columbia","paperID":"1964869"},{"content":"PAHO/WHO. Earthquake in Haiti - One year later. Report on the Health Situation, January 2011.","paperID":"None"},{"content":"Leysia Palen , Sophia B. Liu, Citizen communications in crisis: anticipating a future of ICT-supported public participation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240736"},{"content":"Pape, J. W., Johnson, W. D. and Fitzgerald, D. W. The earthquake in Haiti - Dispatch from Port-au-Prince. New England Journal of Medicine 362 (2010), 575--577.","paperID":"None"},{"content":"Rogers, Y. & Ellis, J. Distributed Cognition: An Alternative Framework for Analyzing and Explaining Collaborative Working. J. of Information Technology, 9, 2 (1994), 119--128.","paperID":"None"},{"content":"Aleksandra Sarcevic , Leysia Palen , Joanne White , Kate Starbird , Mossaab Bagdouri , Kenneth Anderson, \"Beacons of hope\" in decentralized coordination: learning from on-the-ground medical twitterers during the 2010 Haiti earthquake, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145217"},{"content":"Sheridan, M. B., Wilgoren, D., & Leonnig, C. D. Patients Overwhelm Medical Teams at Haiti Clinics. Washington Post. (Jan 17, 2010). http://www.washingtonpost.com/wpdyn/content/article/2010/01/17/AR2010011701144.html","paperID":"None"},{"content":"Kate Starbird , Leysia Palen , Amanda L. Hughes , Sarah Vieweg, Chatter on the red: what hazards threat reveals about the social life of microblogged information, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718965"},{"content":"Kate Starbird , Leysia Palen, \"Voluntweeters\": self-organizing by digital volunteers in times of crisis, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979102"},{"content":"Kate Starbird , Leysia Palen, (How) will the revolution be retweeted?: information diffusion and the 2011 Egyptian uprising, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145212"},{"content":"Kate Starbird , Leysia Palen, Working and sustaining the virtual \"Disaster Desk\", Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441832"},{"content":"Starbird, K. & Stamberger, J. Tweak the Tweet: Leveraging Microblogging Proliferation with a Prescriptive Syntax to Support Citizen Reporting. Proc. of ISCRAM, 2010.","paperID":"None"},{"content":"James Surowiecki, The Wisdom of Crowds, Anchor, 2005","paperID":"1095645"},{"content":"Vieweg, S., Palen, L., Liu, S., Hughes, A., & Sutton, J. Collective Intelligence in Disaster: Examination of the Phenomenon in the Aftermath of the 2007 Virginia Tech Shooting. Proc. of ISCRAM, 2008.","paperID":"None"}],"abstract":"This study examines the information-processing activities of digital volunteers and other connected ICT users in the wake of crisis events. Synthesizing findings from several previous research studies of digital volunteerism, this paper offers a new approach for conceptualizing the activities of digital volunteers, shifting from a focus on organizing to a focus on information movement. Using the lens of distributed cognition, this research describes collective intelligence as transformations of information within a system where cognition is distributed socially across individuals as well as through their tools and resources. This paper demonstrates how digital volunteers, through activities such as relaying, amplifying, verifying, and structuring information, function as a collectively intelligent cognitive system in the wake of disaster events.","video":"http://www.youtube.com/embed/TCMJ1cTPFHg?rel=0","title":"Delivering patients to sacré coeur: collective intelligence in digital volunteer communities","filename":"CHI13/p801","authors":["Kate Starbird"],"conference":"CHI '13"}