{"paperId":2470663,"citation":[{"content":"Maia Jacobs , James Clawson , Elizabeth D. Mynatt, Lessons learned from a yearlong deployment of customizable breast cancer tablet computers, Proceedings of the conference on Wireless Health, p.1-7, October 14-16, 2015, Bethesda, Maryland","paperID":"2811951"},{"content":"Hilary Davis , Jenny Waycott , Shou Zhou, Beyond YouTube: Sharing Personal Digital Stories on a Community Display, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838771"},{"content":"Elizabeth Kaziunas , Ayse G. Buyuktur , Jasmine Jones , Sung W. Choi , David A. Hanauer , Mark S. Ackerman, Transition and Reflection in the Use of Health Information: The Case of Pediatric Bone Marrow Transplant Caregivers, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675276"},{"content":"Munmun De Choudhury , Meredith Ringel Morris , Ryen W. White, Seeking and sharing health information online: comparing search engines and social media, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557214"},{"content":"Norman Makoto Su , Leslie S. Liu , Amanda Lazar, Mundanely miraculous: the robot in healthcare, Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational, p.391-400, October 26-30, 2014, Helsinki, Finland","paperID":"2641216"},{"content":"Kevin Marshall , Anja Thieme , Jayne Wallace , John Vines , Gavin Wood , Madeline Balaam, Making wellbeing: a process of user-centered design, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2600888"},{"content":"Svetlana Yarosh , Elizabeth Bonsignore , Sarah McRoberts , Tamara Peyton, YouthTube: Youth Video Authorship on YouTube and Vine, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819961"},{"content":"Jina Huh , Leslie S. Liu , Tina Neogi , Kori Inkpen , Wanda Pratt, Health Vlogs as Social Support for Chronic Illness Management, ACM Transactions on Computer-Human Interaction (TOCHI), v.21 n.4, p.1-31, August 2014","paperID":"2630067"}],"reference":[{"content":"Barrera, M., Ainlay, S. The Structure of Social Support: A Conceptual and Empirical Analysis. Journal of Community Psychology, 133--143. 1983.","paperID":"None"},{"content":"Margit Biemans , Betsy van Dijk , Pavan Dadlani , Aart van Halteren, Let's stay in touch: sharing photos for restoring social connectedness between rehabilitants, friends and family, Proceedings of the 11th international ACM SIGACCESS conference on Computers and accessibility, October 25-28, 2009, Pittsburgh, Pennsylvania, USA","paperID":"1639674"},{"content":"Brubaker, J., Lustig, C., Hayes, G.R. PatientsLikeMe: Empowerment and Representation in a Patient-Centered Social Network. CSCW'10; Workshop on Research in Healthcare: Past, Present, and Future.","paperID":"None"},{"content":"Byungki Byun , Anurag Awasthi , Philip A. Chou , Ashish Kapoor , Bongshin Lee , Mary Czerwinski, Honest signals in video conferencing, Proceedings of the 2011 IEEE International Conference on Multimedia and Expo, p.1-6, July 11-15, 2011","paperID":"2193500"},{"content":"Charmaz, K. Loss of Self: A Fundamental Form of Suffering in the Chronically Ill. Journal of Sociology of Health and Illness, 168--195. 1983.","paperID":"None"},{"content":"Chou, W.S., Hunt, Y., Folkers, A., Auguston, E. Cancer Survivorship in the Age of YouTube and Social Media: A Narrative Analysis. Journal of Medical Internet Research. 2011.","paperID":"None"},{"content":"Deborah S. Chung , Sujin Kim, Blogging activity among cancer patients and their companions: Uses, gratifications, and predictors of outcomes, Journal of the American Society for Information Science and Technology, v.59 n.2, p.297-306, January 2008","paperID":"1331282"},{"content":"Fernandez-Luque, L., Elahi, N., Grajales III, F.J. An Analysis of Personal Medical Information Disclosed in YouTube Videos Created by Patients with Multiple Sclerosis. Studies in Health Technology Information, 292--296. 2009.","paperID":"None"},{"content":"Marco A. Figueiredo , Paola Prado , Mauro A. Câmara , Ana M. Albuquerque, Empowering rural citizen journalism via web 2.0 technologies, Proceedings of the fourth international conference on Communities and technologies, June 25-27, 2009, University Park, PA, USA","paperID":"1556473"},{"content":"Foucault, M. The History of Sexuality, Vol. 1: An Introduction. Éditions Gallimard. 1978.","paperID":"None"},{"content":"David Grayson , Lynne Coventry, The effects of visual proxemic information in video mediated communication, ACM SIGCHI Bulletin, v.30 n.3, p.30-39, July 1998","paperID":"565713"},{"content":"Griffith, M., Papacharissi, Z. Looking for You: An Analysis of Video Blogs. First Monday. 2010.","paperID":"None"},{"content":"Goffman, E. The Presentation of Self in Everyday Life. Anchor. 1959.","paperID":"None"},{"content":"Henderson, A. Abused Women and Peer-Provided Social Support: The Nature and Dynamics of Reciprocity in a Crisis Setting. Issues in Mental Health Nursing, 117--128. 1995.","paperID":"None"},{"content":"Ellen S. Hibbard , Deb I. Fels, The vlogging phenomena: a deaf perspective, The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility, October 24-26, 2011, Dundee, Scotland, UK","paperID":"2049549"},{"content":"Hoff, T., Mishel, M., Rowe, I. Using New Media to Make HIV Personal: A Partnership of MTV and the Kaiser Family Foundation. Cases in Public Health Communication & Marketing '08, 190--197.","paperID":"None"},{"content":"Hoffman, D.L, Fodor, M. Can You Measure the ROI of Your Social Media marketing? MIT Sloan Management Review, 41--49. 2010.","paperID":"None"},{"content":"Kori Inkpen , Honglu Du , Asta Roseway , Aaron Hoff , Paul Johns, Video kids: augmenting close friendships with asynchronous video conversations in videopal, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208400"},{"content":"Krause, N., Herzog, A.R., Baker, E. Providing Support to Others and Well-being in Later Life. Journal of Gerontology, 300--311. 1992.","paperID":"None"},{"content":"Kurtz, L.F. Self-Help and Support Groups: A Handbook for Practitioners. Sage. 1997.","paperID":"None"},{"content":"Lange, P.G. Commenting on comments: Investigating responses to antagonism on YouTube. Conference of the Society for Applied Anthropology '07, 1--26.","paperID":"None"},{"content":"Lange, P.G. Publicly Private and Privately Public: Social Networking on YouTube. Journal of CMC, 361--380. 2008.","paperID":"None"},{"content":"Markham, T. Hunched Over Their Laptops: Phenomenological Perspectives on Citizen Journalism. Presented at MeCCSA'10.","paperID":"None"},{"content":"Matthews, N. Confessions to a New Public: Video Nation Shorts. Media Culture Society, 435--449. 2007.","paperID":"None"},{"content":"Miller, E.A., Pole, A. Diagnosis Blog: Checking Up on Health Blogs in the Blogosphere. American Journal of Public Health, 1514--1519. 2010.","paperID":"None"},{"content":"Molyneaux, H., O'Donnell, S. Patient Portals 2.0: The Potential for Online Video. In Proc. COACH'09, 1--15.","paperID":"None"},{"content":"Bonnie A. Nardi , Diane J. Schiano , Michelle Gumbrecht , Luke Swartz, Why we blog, Communications of the ACM, v.47 n.12, December 2004","paperID":"1035163"},{"content":"Bonnie A. Nardi , Diane J. Schiano , Michelle Gumbrecht, Blogging as social activity, or, would you let 900 million people read your diary?, Proceedings of the 2004 ACM conference on Computer supported cooperative work, November 06-10, 2004, Chicago, Illinois, USA","paperID":"1031643"},{"content":"Gary M. Olson , Judith S. Olson, Distance matters, Human-Computer Interaction, v.15 n.2, p.139-178, September 2000","paperID":"1463019"},{"content":"Raun, T. DIY Therapy: Exploring Affective Aspects of Trans Video Blogs on YouTube. Palgrave Macmillian. 2012.","paperID":"None"},{"content":"Renov, M., Suderburg, E. Resolutions: Contemporary Video Practices. University of Minneapolis Press. 1996.","paperID":"None"},{"content":"Ressler, P.K., Bradshaw, Y.S., Gualtieri, L., Chui, K.K.H. Communicating the Experience of Chronic Pain and Illness Through Blogging. Journal of Medical Internet Research. 2012.","paperID":"None"},{"content":"Ridgeway, P. Restorying Psychiatric Disability: Learning from First Person Recovery Narratives. Psychiatric Rehabilitation Journal, 335--343. 2001.","paperID":"None"},{"content":"Schwartz, C.E., Sendor, R.M. Helping Others Helps Oneself: Response Shift Effects in Peer Support. Social Science & Medicine, 1563--1575. 1999.","paperID":"None"},{"content":"Sundar, S.S., Edwards, H.H., Hu, Y., Stavrositu, C. Blogging for Better Health: Putting the \"Public\" Back in Public Health. Routledge. 2006.","paperID":"None"},{"content":"Tan, L. Psychotherapy 2.0: MySpace Blogging as SelfTherapy. AJP, 143--163. 2008.","paperID":"None"},{"content":"Thoits, P.A. Stress, Coping, and Social Support Processes: Where Are We? What Next? Journal of Health and Social Behavior, 53--79. 1995.","paperID":"None"},{"content":"Mark Tremayne, Blogging, Citizenship and the Future of Media, Routledge, New York, NY, 2006","paperID":"1201002"},{"content":"Trier, J. \"Cool\" Engagements With YouTube: Part 1. Journal of Adolescent & Adult Literacy, 408--412. 2007.","paperID":"None"},{"content":"Turkle, S. Looking Toward Cyberspace: Beyond Grounded Sociology. Contemporary Sociology, 643--648. 1999.","paperID":"None"},{"content":"Valverde, M. Experience and Truth-Telling in a PostHumanist World: A Foucauldian Contribution to Feminist Ethical Relations. University of Illinois Press. 2004.","paperID":"None"},{"content":"Waldron, J. YouTube, Fanvids, Forums, Vlogs and Blogs: Informal Music Learning in a Convergent Onand Offline Music Community.International Journal of Music Education, 1--16. 2012.","paperID":"None"}],"abstract":"Health video blogs (vlogs) allow individuals with chronic illnesses to share their stories, experiences, and knowledge with the general public. Furthermore, health vlogs help in creating a connection between the vlogger and the viewers. In this work, we present a qualitative study examining the various methods that health vloggers use to establish a connection with their viewers. We found that vloggers used genres to express specific messages to their viewers while using the uniqueness of video to establish a deeper connection with their viewers. Health vloggers also explicitly sought interaction with their viewers. Based on these results, we present design implications to help facilitate and build sustainable communities for vloggers.","video":"http://www.youtube.com/embed/WCu5TUksuJU?rel=0","title":"Health vlogger-viewer interaction in chronic illness management","filename":"CHI13/p49","authors":["Leslie S. Liu","Jina Huh","Tina Neogi","Kori Inkpen","Wanda Pratt"],"conference":"CHI '13"}