{"paperId":2470665,"citation":[{"content":"Pedro Lopes , Alexandra Ion , Willi Mueller , Daniel Hoffmann , Patrik Jonell , Patrick Baudisch, Proprioceptive Interaction, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702461"},{"content":"Yuta Kataoka , Satoshi Hashiguchi , Fumihisa Shibata , Asako Kimura, R-V dynamics illusion: psychophysical phenomenon caused by the difference between dynamics of real object and virtual object, Proceedings of the 25th International Conference on Artificial Reality and Telexistence and 20th Eurographics Symposium on Virtual Environments, p.133-140, October 28-30, 2015, Kyoto, Japan","paperID":"2852331"},{"content":"Akira Nomoto , Yuki Ban , Takuji Narumi , Tomohiro Tanikawa , Michitaka Hirose, Supporting Precise Manual-handling Task using Visuo-haptic Interaction, Proceedings of the 7th Augmented Human International Conference 2016, p.1-8, February 25-27, 2016, Geneva, Switzerland","paperID":"2875216"}],"reference":[{"content":"Alexander, K., and Shansky, M. In\\'02uence of hue, value, and chroma on the perceived heaviness of colors. Attention, Perception, & Psychophysics 19, 1 (1976), 72--74.","paperID":"None"},{"content":"Yuki Ban , Takashi Kajinami , Takuji Narumi , Tomohiro Tanikawa , Michitaka Hirose, Modifying an identified angle of edged shapes using pseudo-haptic effects, Proceedings of the 2012 international conference on Haptics: perception, devices, mobility, and communication, June 13-15, 2012, Tampere, Finland","paperID":"2345620"},{"content":"Yuki Ban , Takashi Kajinami , Takuji Narumi , Tomohiro Tanikawa , Michitaka Hirose, Modifying an identified angle of edged shapes using pseudo-haptic effects, Proceedings of the 2012 international conference on Haptics: perception, devices, mobility, and communication, June 13-15, 2012, Tampere, Finland","paperID":"2345620"},{"content":"Bhalla, M., and Prof\\'01tt, D. Visual--motor recalibration in geographical slant perception. Journal of Experimental Psychology: Human Perception and Performance; Journal of Experimental Psychology: Human Perception and Performance 25, 4 (1999), 1076.","paperID":"None"},{"content":"Birren, F. Color Psychology and Color Therapy: A Factual Study of the In\\'02uence of Color on Human Life. Kessinger Publishing, 2006.","paperID":"None"},{"content":"Buckingham, G., Ranger, N., and Goodale, M. The material--weight illusion induced by expectations alone. Attention, Perception, & Psychophysics 73, 1 (2011), 36--41.","paperID":"None"},{"content":"Charpentier, A. Experimental study of some aspects of weight perception. Arch Physiol Norm Pathol 3 (1891), 122--135.","paperID":"None"},{"content":"De Camp, J. The in\\'02uence of color on apparent weight. a preliminary study. Journal of experimental psychology 2, 5 (1917), 347.","paperID":"None"},{"content":"Durgin, F., Baird, J., Greenburg, M., Russell, R., Shaughnessy, K., and Waymouth, S. Who is being deceived? the experimental demands of wearing a backpack. Psychonomic Bulletin & Review 16, 5 (2009), 964--969.","paperID":"None"},{"content":"Ellis, R., and Lederman, S. The golf-ball illusion: evidence for top-down processing in weight perception. PERCEPTION-LONDON- 27 (1998), 193--202.","paperID":"None"},{"content":"Ellis, R., and Lederman, S. The material-weight illusion revisited. Attention, Perception, & Psychophysics 61, 8 (1999), 1564--1576.","paperID":"None"},{"content":"Gordon, A., Forssberg, H., Johansson, R., and Westling, G. Visual size cues in the programming of manipulative forces during precision grip. Experimental Brain Research 83, 3 (1991), 477--482.","paperID":"None"},{"content":"Hayashi, T., Kawamoto, H., and Sankai, Y. Control method of robot suit hal working as operator's muscle using biological and dynamical information. Intelligent Robots and Systems, 2005.(IROS 2005). 2005 IEEE/RSJ International Conference on (2005), 3063--3068.","paperID":"None"},{"content":"Kim, J., Hong, S., Koike, Y., and Sato, M. and makoto sato: How the humans respond to the 'size-weight illusion' in virtual environments. The Eighth International Conference on Virtual Systems and Multi Media (VSMM2002) (2002), 300--309.","paperID":"None"},{"content":"Kim, J., Hong, S., Sato, M., and Koike, Y. Examination of the size-weight illusion by utilizing the spidar. Transactions of the Virtual Reality Society of Japan 7, 3 (2002), 347--354.","paperID":"None"},{"content":"Anatole Lécuyer, Simulating haptic feedback using vision: A survey of research and applications of pseudo-haptic feedback, Presence: Teleoperators and Virtual Environments, v.18 n.1, p.39-53, February 2009","paperID":"1502413"},{"content":"Lécuyer, A., Burkhardt, J. M., and Etienne, L. Simulating haptic feedback using vision: A survey of research and applications of pseudo-haptic feedback. In Proceedings of the SIGCHI conference on Human factors in computing systems, no. 1 in CHI '04 (2004), 239 -- 246.","paperID":"None"},{"content":"Anatole Lecuyer , Sabine Coquillart , Abderrahmane Kheddar , Paul Richard , Philippe Coiffet, Pseudo-Haptic Feedback: Can Isometric Input Devices Simulate Force Feedback?, Proceedings of the IEEE Virtual Reality 2000 Conference, p.83, March 18-22, 2000","paperID":"835776"},{"content":"Lee, K., Hicks, G., and Nino-Murcia, G. Validity and reliability of a scale to assess fatigue,. Psychiatry Research 36 (1991), 291--298.","paperID":"None"},{"content":"Mukai, T., Hirano, S., Nakashima, H., Kato, Y., Sakaida, Y., Guo, S., and Hosoe, S. Development of a nursing-care assistant robot riba that can lift a human in its arms. In Intelligent Robots and Systems (IROS), 2010 IEEE/RSJ International Conference on, IEEE (2010), 5996--6001.","paperID":"None"},{"content":"T. Mukai , M. Onishi , T. Odashima , S. Hirano , Zhiwei Luo, Development of the Tactile Sensor System of a Human-Interactive Robot “RI-MAN”, IEEE Transactions on Robotics, v.24 n.2, p.505-512, April 2008","paperID":"2212125"},{"content":"Takuji Narumi , Yuki Ban , Takashi Kajinami , Tomohiro Tanikawa , Michitaka Hirose, Augmented perception of satiety: controlling food consumption by changing apparent size of food with augmented reality, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207693"},{"content":"Öberg, T., Sandsj, L., and Kadefors, R. Subjective and objective evaluation of shoulder muscle fatigue. Ergonomics 37, 8 (1994), 1323--1333.","paperID":"None"},{"content":"Hiroki Omosako , Asako Kimura , Fumihisa Shibata , Hideyuki Tamura, Shape-COG Illusion: Psychophysical influence on center-of-gravity perception by mixed-reality visual stimulation, Proceedings of the 2012 IEEE Virtual Reality, p.65-66, March 04-08, 2012","paperID":"2224722"},{"content":"J. Rosen , M. Brand , M. B. Fuchs , M. Arcan, A myosignal-based powered exoskeleton system, IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans, v.31 n.3, p.210-222, May 2001","paperID":"2229716"},{"content":"Roy, S. H., and DeLuca, C. J. Evolving characteristics of the median frequency of the emg signal. Computer-Aided EZectromyography and Expert Systems, edited by J. E. Desmedt. New York: Elsevier (1989), 206--221.","paperID":"None"},{"content":"S, S., and L, S. Sensory modalities are not separate modalities: plasticity and interactions. Current opinion in neurobiology 11 (2001), 500--509.","paperID":"None"},{"content":"Sadoyama, T., and Miyano, H. Frequency analysis of surface emg to evaluation of muscle fatigue. European Journal Of Applied Physiology And Occupational Physiology 47, 3 (1981), 239--246.","paperID":"None"},{"content":"Stulen, F. B., and Luca, C. J. D. Frequency parameters of the myoelectric signal as a measure of muscle conduction velocity. IEEE Transactions on Biomedical Engineering (1981), 515--523.","paperID":"None"},{"content":"Viitasalo, J. H. T., and Komi, P. V. Signal characteristics of emg during fatigue. European Journal of Applied Physiology and Occupational Physiology 37 (1977), 111--121.","paperID":"None"},{"content":"Walker, P., Francis, B., and Walker, L. The brightness-weight illusion: Darker objects look heavier but feel lighter. Experimental psychology 57, 6 (2010), 462.","paperID":"None"}],"abstract":"The main contribution of this paper is to develop a method for alleviating fatigue during handling medium-weight objects and augmenting our endurance by affecting our weight perception with augmented reality technology. To assist people to lift medium-weight objects without a complex structure or various costs, we focus on the phenomenon that our weight perception during handling objects is affected by visual properties. Our hypothesis is that this illusionary effect in weight perception can be applied to reduce fatigue while handling medium-weight objects without mechatronics-based physical assistance. In this paper, we propose an augmented reality system that changes the brightness value of an object in order to reduce fatigue while handling the object. We conducted two fundamental experiments to investigate the effectiveness of the proposed system. Our results suggested that the system eliminates the need to use excess energy for handling objects and reduces fatigue during the handling task.","video":"http://www.youtube.com/embed/jcQlsuzV-YU?rel=0","title":"Augmented endurance: controlling fatigue while handling objects by affecting weight perception using augmented reality","filename":"CHI13/p69","authors":["Yuki Ban","Takuji Narumi","Tatsuya Fujii","Sho Sakurai","Jun Imura","Tomohiro Tanikawa","Michitaka Hirose"],"conference":"CHI '13"}