{"paperId":2470706,"citation":[{"content":"Yu Chen , Xiaojuan Ma , Alfredo Cerezo , Pearl Pu, Empatheticons: Designing Emotion Awareness Tools for Group Recommenders, Proceedings of the XV International Conference on Human Computer Interaction, September 10-12, 2014, Puerto de la Cruz, Tenerife, Spain","paperID":"2662269"},{"content":"Jussi P.P. Jokinen , Johanna M. Silvennoinen , Piia M.H. Perälä , Pertti Saariluoma, Quick Affective Judgments: Validation of a Method for Primed Product Comparisons, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702422"}],"reference":[{"content":"Bradley, M. M., and Lang, P. J. Measuring emotion: The self-assessment manikin and the semantic differential. Journal of Behavior Therapy and Experimental Psychiatry 25, 1 (1994), 49--59.","paperID":"None"},{"content":"Brave, S., and Nass, C. Emotion in human-computer interaction. In Handbook of Human-Computer Interaction, J. Jacko and A. Sears, Eds., Lawrence Erlbaum Associates. (2008), 77--92.","paperID":"None"},{"content":"Calder, A. J., Rowland, D., Young, A. W., Nimmo-Smith, I., Keane, J., and Perrett, D. I. Caricaturing facial expressions. Cognition 76, 2 (2000), 105--146.","paperID":"None"},{"content":"Kevin Capota , Marco van Hout , Thea van der Geest, Measuring the emotional impact of websites: a study on combining a dimensional and discrete emotion approach in measuring visual appeal of university websites, Proceedings of the 2007 conference on Designing pleasurable products and interfaces, August 22-25, 2007, Helsinki, Finland","paperID":"1314173"},{"content":"John M. Carroll , John C. Thomas, FUN, ACM SIGCHI Bulletin, v.19 n.3, p.21-24, January 1988","paperID":"1045604"},{"content":"Chambers, C., Giesbrechta, K., Craiga, K., Bennett, S., and Huntsman, E. A comparison of faces scales for the measurement of pediatric pain: children's and parents ratings. Pain 83, 1 (1999), 25--35.","paperID":"None"},{"content":"Liqiong Deng , Marshall Scott Poole, Affect in web interfaces: a study of the impacts of web page visual complexity and order, MIS Quarterly, v.34 n.4, p.711-730, Decenber 2010","paperID":"2017500"},{"content":"Desmet, P. Designing Emotions. Unpublished doctoral thesis. Delft University of Technology, Delft, The Netherlands, 2002.","paperID":"None"},{"content":"Desmet, P., Porcelijn, R., and Van Dijk, M. HOW to design WOW Introducing a layered-emotional approach. In Proceedings of DPPI'05, J. Jacko and A. Sears, Eds. (2005), 71--89.","paperID":"None"},{"content":"Ekman, P. Strong evidence for universals in facial expressions: A reply to Russell's mistaken critique. Psychological Bulletin 115, 2 (1994), 268--287.","paperID":"None"},{"content":"Ekman, P. Basic emotions. In Handbook of Cognition and Emotion, T. Dalgleish and M. Power, Eds. John Wiley & Sons Ltd., 1999, 45--60.","paperID":"None"},{"content":"Ekman, P., and Friesen, W. V. Constants across cultures in the face and emotion. Journal of Personality and Social Psychology 17, 2 (1971), 124--129.","paperID":"None"},{"content":"Feldman-Barrett, L. Feelings or words? Understanding the content in self-report ratings of experienced emotion. Journal of Personality and Social Psychology 87, 2 (2004), 266--281.","paperID":"None"},{"content":"Jodi Forlizzi , Katja Battarbee, Understanding experience in interactive systems, Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques, August 01-04, 2004, Cambridge, MA, USA","paperID":"1013152"},{"content":"Frank, M. G., and Stennett, J. The forced-choice paradigm and the perception of facial expressions of emotion. Journal of Personality and Social Psychology 80, 1 (2001), 75--85.","paperID":"None"},{"content":"Marc Hassenzahl, The thing and I: understanding the relationship between user and product, Funology: from usability to enjoyment, Kluwer Academic Publishers, Norwell, MA, 2005","paperID":"1139015"},{"content":"Marc Hassenzahl, User experience (UX): towards an experiential perspective on product quality, Proceedings of the 20th International Conference of the Association Francophone d'Interaction Homme-Machine, September 02-05, 2008, Metz, France","paperID":"1512717"},{"content":"Marc Hassenzahl , Sarah Diefenbach , Anja Göritz, Needs, affect, and interactive products - Facets of user experience, Interacting with Computers, v.22 n.5, p.353-362, September, 2010","paperID":"1837814"},{"content":"Hassenzahl, M., and Tractinsky, N. User experience-a research agenda. Behaviour & Information Technology 25, 2 (2006), 91--97.","paperID":"None"},{"content":"Richard L. Hazlett , Joey Benedek, Measuring emotional valence to understand the user's experience of software, International Journal of Human-Computer Studies, v.65 n.4, p.306-314, April, 2007","paperID":"1225519"},{"content":"Hicks, C. L., von Baeyer, C. L., Spafford, P. A., van Korlaar, I., and Goodenough, B. The faces pain scale revised: toward a common metric in pediatric pain measurement. Pain 93, 2 (2001), 173--183.","paperID":"None"},{"content":"Huguet, A., Stinson, J. N., and McGrath, P. J. Measurement of self-reported pain intensity in children and adolescents. Journal of Psychosomatic Research 68, 4 (2010), 329--336.","paperID":"None"},{"content":"Huisman, G., and Van Hout, M. The development of a graphical emotion measurement instrument using caricatured expressions: the LEMtool. In Emotion in HCI-designing for people: proceedings of the 2008 international workshop, C. Peter, E. Crane, M. Fabri, H. Agius, and L. Axelrod, Eds., Fraunhofer (2010), 5--7.","paperID":"None"},{"content":"Jinwoo Kim , Jooeun Lee , Dongseong Choi, Designing emotionally evocative homepages: an empirical study of the quantitative relations between design factors and emotional dimensions, International Journal of Human-Computer Studies, v.59 n.6, p.899-940, December 2003","paperID":"965949"},{"content":"Effie Lai-Chong Law , Virpi Roto , Marc Hassenzahl , Arnold P.O.S. Vermeeren , Joke Kort, Understanding, scoping and defining user experience: a survey approach, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518813"},{"content":"Gitte Lindgaard , Cathy Dudek , Devjani Sen , Livia Sumegi , Patrick Noonan, An exploration of relations between visual appeal, trustworthiness and perceived usability of homepages, ACM Transactions on Computer-Human Interaction (TOCHI), v.18 n.1, p.1-30, April 2011","paperID":"1959023"},{"content":"Lindgaard, G., Fernandes, G., Dudek, C., and Brown, J. Attention web designers: You have 50 milliseconds to make a good \\'01rst impression! Behaviour & Information Technology 25, 2 (2006), 115--126.","paperID":"None"},{"content":"Sascha Mahlke , Michael Minge, Consideration of Multiple Components of Emotions in Human-Technology Interaction, Affect and Emotion in Human-Computer Interaction: From Theory to Applications, Springer-Verlag, Berlin, Heidelberg, 2008","paperID":"1422708"},{"content":"John McCarthy , Peter Wright, Technology as Experience, The MIT Press, 2004","paperID":"1044942"},{"content":"Norman, D. Emotional design: Why we love (or hate) everyday things. Basic Books, 2004.","paperID":"None"},{"content":"Janet C. Read, Validating the Fun Toolkit: an instrument for measuring children’s opinions of technology, Cognition, Technology and Work, v.10 n.2, p.119-128, March 2008","paperID":"1356042"},{"content":"Byron Reeves , Clifford Nass, The media equation: how people treat computers, television, and new media like real people and places, Cambridge University Press, New York, NY, 1996","paperID":"236605"},{"content":"Robinson, M. D., and Clore, G. L. Belief and feeling: Evidence for an accessibility model of emotional self-report. Psychological Bulletin 128, 6 (2002), 934--960.","paperID":"None"},{"content":"Russell, J. A. A circumplex model of affect. Journal of Personality and Social Psychology 39, 6 (1980), 1161--1178.","paperID":"None"},{"content":"Russell, J. A. Emotion, core affect, and psychological construction. Cognition & Emotion 23, 7 (2009), 1259--1283.","paperID":"None"},{"content":"Scheirer, J., Fernandez, R., Klein, J., and Picard, R. W. Frustrating the user on purpose: a step toward building an affective computer. Interacting with Computers 14, 2 (2002), 93--118.","paperID":"None"},{"content":"Scherer, K. R. What are emotions? And how can they be measured? Social Science Information 44, 4 (2005), 695--729.","paperID":"None"},{"content":"Scherer, K. R. The dynamic architecture of emotion: Evidence for the component process model. Cognition & Emotion 23, 7 (2009), 1307--1351.","paperID":"None"},{"content":"Sonderegger, A., and Sauer, J. The in\\'02uence of design aesthetics in usability testing: Effects on user performance and perceived usability. Applied Ergonomics 41, 3 (2010), 403--410.","paperID":"None"},{"content":"Thüring, M., and Mahlke, S. Usability, aesthetics and emotions in human-technology interaction. International Journal of Psychology 42, 4 (2007), 253--264.","paperID":"None"},{"content":"Noam Tractinsky , Avivit Cokhavi , Moti Kirschenbaum , Tal Sharfi, Evaluating the consistency of immediate aesthetic perceptions of web pages, International Journal of Human-Computer Studies, v.64 n.11, p.1071-1083, November 2006","paperID":"1225977"},{"content":"Tractinsky, N., Katz, A., and Ikar, D. What is beautiful is usable. Interacting with Computers 13, 2 (2000), 127--145.","paperID":"None"},{"content":"Van den Broek, E., Janssen, J., Westerink, J., and Healey, J. Prerequisites for affective signal processing (ASP). In Proceedings of Biosignals '11, Springer (2009), 426--433.","paperID":"None"},{"content":"Van Dongelen, R. What is beautiful is good and usable. Unpublished master thesis. University of Twente, Enschede, The Netherlands, 2008.","paperID":"None"},{"content":"Martijn Vastenburg , Natalia Romero Herrera , Daniel Van Bel , Pieter Desmet, PMRI: development of a pictorial mood reporting instrument, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979933"},{"content":"Wallbott, H. G. Bodily expression of emotion. European Journal of Social Psychology 28, 6 (1998), 879--896.","paperID":"None"},{"content":"R. D. Ward , P. H. Marsden, Physiological responses to different WEB page designs, International Journal of Human-Computer Studies, v.59 n.1-2, p.199-212, July 2003","paperID":"861060"},{"content":"Ward, R., and Marsden, P. Affective computing: problems, reactions and intentions. Interacting with Computers 16, 4 (2004), 707--713.","paperID":"None"},{"content":"Wiles, J. A., and Cornwell, T. B. A review of methods utilized in measuring affect, feelings, and emotion in advertising. Current Issues and Research in Advertising 13, 1--2 (1991), 241--275.","paperID":"None"},{"content":"Zajonc, R. B. Feeling and thinking: Preferences need no inferences. American Psychologist 35, 2 (1980), 151--175.","paperID":"None"},{"content":"Haotian Zhou , Xiaolan Fu, Understanding, measuring, and designing user experience: the causal relationship between the aesthetic quality of products and user affect, Proceedings of the 12th international conference on Human-computer interaction: interaction design and usability, July 22-27, 2007, Beijing, China","paperID":"1772529"}],"abstract":"In this paper the development process and validation of the LEMtool (Layered Emotion Measurement tool) are described. The LEMtool consists of eight images that display a cartoon figure expressing four positive and four negative emotions using facial expressions and body postures. The instrument can be used during interaction with a visual interface, such as a website, and allows participants to select elements of the interface that elicit a certain emotion. The images of the cartoon figure were submitted to a validation study, in which participants rated the recognizability of the images as specific emotions. All images were found to be recognizable above chance level. In another study, the LEMtool was used to assess visual appeal judgements of a number of web pages. The LEMtool ratings were supported by visual appeal ratings of web pages both for very brief (50 milliseconds) and for long (free-viewing) stimulus exposures. Furthermore, the instrument provided insight into the elements of the web pages that elicited the emotional responses.","video":"http://www.youtube.com/embed/WFaSQWIspa0?rel=0","title":"LEMtool: measuring emotions in visual interfaces","filename":"CHI13/p351","authors":["Gijs Huisman","Marco van Hout","Elisabeth van Dijk","Thea van der Geest","Dirk Heylen"],"conference":"CHI '13"}