{"paperId":2470770,"reference":[{"content":"Dolin, D. J., Booth-Butterfield, S. Foot-in-the-door and cancer prevention. Health Communication 7, 1 (1995), 55--66.","paperID":"None"},{"content":"Effron, D. and Monin, B. Letting people off the hook: When do good deeds excuse transgressions? Personality and Social Psychology Bulletin 36 (2010), 1618--1634.","paperID":"None"},{"content":"Festinger, L. A theory of cognitive dissonance. Evanston, IL: Row, Peterson, 1957.","paperID":"None"},{"content":"Gladwell, M. Small change: Why the revolution will not be tweeted. The New Yorker, 4 October 2010.","paperID":"None"},{"content":"Guéguen, N. Foot-in-the-door technique and computer-mediated communication. Computers in Human Behavior 18, 1 (2002), 11--15","paperID":"None"},{"content":"Khan, U. and Dhar, R. Where there is a way, there is a will? The effect of future choices on self-control. Journal of Experimental Psychology: General, 136 (2007), 277--288.","paperID":"None"},{"content":"Land, M. B. Networked activism. Harvard Human Rights Journal. NYLS Legal Studies Research Paper 22, 09/10 (2009), #13.","paperID":"None"},{"content":"Mazar, N. and Zhong, C. B. Do green products make us better people? Psychological Science 21 (2010), 494-- 498.","paperID":"None"},{"content":"Merritt, A. M., Effron, D. A. and Monin, B. Moral self-licensing: When being good frees us to be bad. Social and Personality Psychology Compass 4 (2010), 344357.","paperID":"None"},{"content":"Miller, D. T. and Effron, D. A. Psychological license: When it is needed and how it functions. In Zanna, M. P. and Olson, J. M. (Eds.), Advances in Experimental Social Psychology 43, San Diego, CA: Academic Press/Elsevier (2010), 117--158.","paperID":"None"},{"content":"Monin, B. and Miller, D. T. Moral credentials and the expression of prejudice. Journal of Personality and Social Psychology 81 (2001), 33--43.","paperID":"None"},{"content":"Morozov, E. The brave new world of slacktivism. Net Effect - Foreign Policy. Slate Group, 19 May 2009. Web. 5 Apr. 2010.","paperID":"None"},{"content":"Nisan, M. (1991). The moral balance model: Theory and research extending our understanding of moral choice and deviation. In Kurtines, W. M. and Gewirtz, J. L. (Eds.), Handbook of Moral Behavior and Development. Hillsdale, NJ: Erlbaum (1991), 213--249.","paperID":"None"},{"content":"Ogilvy Public Relations Worldwide and Georgetown University's Center for Social Impact Communication. Dynamics of Cause Engagement. At http://csic.georgetown.edu/research/215767.html","paperID":"None"},{"content":"Olson, M. The Logic of Collective Action, Cambridge, MA.: Harvard University Press (1965).","paperID":"None"},{"content":"Pepitone, J. Text donations raise $7m for Red Cross Haiti effort. CNNMoney, January 16, 2010.","paperID":"None"},{"content":"Dana Rotman , Sarah Vieweg , Sarita Yardi , Ed Chi , Jenny Preece , Ben Shneiderman , Peter Pirolli , Tom Glaisyer, From slacktivism to activism: participatory culture in the age of social media, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979543"},{"content":"Sachdeva, S., Iliev, R. and Medin, D. L. Sinning saints and saintly sinners: The paradox of moral selfregulation. Psychological Science 20, 4(2009), 523--528.","paperID":"None"},{"content":"Shulman, S. W. The case against mass e-mails: Perverse incentives and low quality public participation in U.S. federal rulemaking. Policy & Internet 1, 1 (2009), article 2.","paperID":"None"},{"content":"Schwarzwald, J., Bizman, A. and Raz, M. The foot-in-the-door paradigm: Effects of second request size on donation probability and donor generosity. Personality and Social Psychology Bulletin 9, 3 (1983), 443--450.","paperID":"None"},{"content":"Sarah Vieweg , Amanda L. Hughes , Kate Starbird , Leysia Palen, Microblogging during two natural hazards events: what twitter may contribute to situational awareness, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753486"}],"citation":[{"content":"Adrian Holzer , Bruno Kocher , Denis Gillet , Samuel Bendahan , Boris Fritscher, DinerRouge: Bringing Wealth and Income Inequality to the Table through a Provocative UX, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2732716"},{"content":"Joanne I. White, Supporting the Information Management Needs of People Helping Animals in Disasters, Proceedings of the 18th International Conference on Supporting Group Work, November 09-12, 2014, Sanibel Island, Florida, USA","paperID":"2660441"},{"content":"Jane-Marie Fatkin , Terry C. Lansdown, Prosocial media in action, Computers in Human Behavior, v.48 n.C, p.581-586, July 2015","paperID":"2782082"},{"content":"Erin Brady , Meredith Ringel Morris , Jeffrey P. Bigham, Gauging Receptiveness to Social Microvolunteering, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702329"},{"content":"Vasilis Vlachokyriakos , Rob Comber , Karim Ladha , Nick Taylor , Paul Dunphy , Patrick McCorry , Patrick Olivier, PosterVote: expanding the action repertoire for local political activism, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598523"},{"content":"Joanne I. White , Leysia Palen , Kenneth M. Anderson, Digital mobilization in disaster response: the work & self-organization of on-line pet advocates in response to hurricane sandy, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531633"},{"content":"Clara Crivellaro , Rob Comber , John Bowers , Peter C. Wright , Patrick Olivier, A pool of dreams: facebook, politics and the emergence of a social movement, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557100"},{"content":"Ai-Ju Huang , Hao-Chuan Wang , Chien Wen Yuan, De-virtualizing social events: understanding the gap between online and offline participation for event invitations, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531606"},{"content":"Justin Cheng , Michael Bernstein, Catalyst: triggering collective action with thresholds, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531635"},{"content":"Marcus Foth , Martin Tomitsch , Christine Satchell , M. Hank Haeusler, From Users to Citizens: Some Thoughts on Designing for Polity and Civics, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838769"}],"abstract":"In this paper we explore how the decision of partaking in low-cost, low-risk online activism - slacktivism - \\'14may affect subsequent civic action. Based on moral balancing and consistency effects, we designed an online experiment to test if signing or not signing an online petition increased or decreased subsequent contribution to a charity. We found that participants who signed the online petition were significantly more likely to donate money to a related charity, demonstrating a consistency effect. We also found that participants who did not sign the petition donated significantly more money to an unrelated charity, demonstrating a moral balancing effect. The results suggest that exposure to an online activism influences individual decision on subsequent civic actions.","video":"http://www.youtube.com/embed/f61NYdYHO-8?rel=0","title":"Does slacktivism hurt activism?: the effects of moral balancing and consistency in online activism","filename":"CHI13/p811","authors":["Yu-Hao Lee","Gary Hsieh"],"conference":"CHI '13"}