{"paperId":2470674,"citation":[{"content":"Jonathan Hook , Jo Briggs , Mark Blythe , Nathan Walsh , Patrick Olivier, Repentir: digital exploration beneath the surface of an oil painting, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2479581"},{"content":"Jo Briggs , Mark Blythe, Apps for art's sake: resistance and innovation, Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services, August 27-30, 2013, Munich, Germany","paperID":"2493205"},{"content":"Mark Blythe , Elizabeth Buie, Chatbots of the gods: imaginary abstracts for techno-spirituality research, Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational, p.227-236, October 26-30, 2014, Helsinki, Finland","paperID":"2641212"},{"content":"Hyosun Kwon , Jo Briggs , Ben Freeth , Karim Ladha , James Thomas , Mark Blythe , Patrick Olivier, Wet pixels: from digital to analogue originals, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468459"}],"reference":[{"content":"Miguel Bruns Alonso , David V. Keyson, MusicCube: making digital music tangible, CHI '05 Extended Abstracts on Human Factors in Computing Systems, April 02-07, 2005, Portland, OR, USA","paperID":"1056870"},{"content":"Appleyard, B. David Hockney Interview, Sunday Times 30 Jan 2011, available: http://www.bryanappleyard.com/david-hockney-interview/","paperID":"None"},{"content":"Bardzell, J. Creativity in Amateur Multimedia: popular culture, critical theory and HCI. Human Technology 1 (2007) 12--33.","paperID":"None"},{"content":"Braun, V. A. and Clarke,V. Using thematic analysis in psychology. Qualitative research in psychology, 3 (77), (2006), 77--101.","paperID":"None"},{"content":"BBC. Streaming Revenues Up 40% globally in 2012. http://www.bbc.co.uk/news/entertainment-arts-19270362 (2012).","paperID":"None"},{"content":"BBC. A Glimpse At Piracy in the UK and Beyond. http://www.bbc.co.uk/news/technology-1959952 (2012).","paperID":"None"},{"content":"BBC. Obama \"Hope\" artist Shephard Fairey fined. http://www.bbc.co.uk/news/world-us-canada-19522210 (2012).","paperID":"None"},{"content":"Benjamin, W. The Work of Art in the Age of Mechanical Reproduction. In: Illuminations. Fontana, London, (1992 paperback ed.), 211--235.","paperID":"None"},{"content":"Mark Blythe , Jo Briggs , Patrick Olivier , Jonathan Hook, Digital originals: reproduction as a space for design, Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, October 14-17, 2012, Copenhagen, Denmark","paperID":"2399018"},{"content":"Bourdieu, P. (1986). Distinction: a social critique of the judgement of taste. Routledge and Kegan Paul, London.","paperID":"None"},{"content":"Bourdieu, P. (1990). Photography: A middle-brow art. Polity Press, Cambridge.","paperID":"None"},{"content":"Briggs, J. and Blythe, M. 20 No Oil Painting: Digital Originals and Slow Prints. In: Slow Technology: Critical Reflection and Future Directions, DIS '12.","paperID":"None"},{"content":"Briggs, J. and Blythe, M. Post Anxiety Art: Economies and cultures of digital painting. In Post Digital Art, Proc of the 3rd Computer Art Congress, Paris (2012) 161--168.","paperID":"None"},{"content":"Brushes App http://www.brushesapp.com/","paperID":"None"},{"content":"Brushes Gallery http://www.flickr.com/groups/brushes/","paperID":"None"},{"content":"Charmaz, K. (2006). Constructing Grounded Theory. Sage, London.","paperID":"None"},{"content":"Clippenger, J. H. and Bollier, D. (2005). A Renaissance of the Commons: How the New Sciences and Internet are Framing a New Global Identity and Order. In: R. A. Ghosh (ed.) CODE: Collaborative Ownership and the Digital Economy. MIT, Cambridge MA, 259--286.","paperID":"None"},{"content":"Day, E. (2012). Can You Make Any Kind of Living As an Artist? The Guardian. 2012. http://www.guardian.co.uk/culture/2012/jul/29/artists-day-job-feature.","paperID":"None"},{"content":"Samer Faraj , Steven L. Johnson, Network Exchange Patterns in Online Communities, Organization Science, v.22 n.6, p.1464-1480, 11-12 2011","paperID":"2071334"},{"content":"Gadgetspeak 5000 Free, Limited Edition Artworks to celebrate Trafalgar Square Sculpture Unveiling. 23 February 2012.","paperID":"None"},{"content":"Daniel Gallardo , Sergi Jordà, Tangible jukebox: back to palpable music, Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction, January 24-27, 2010, Cambridge, Massachusetts, USA","paperID":"1709922"},{"content":"Hughes, R. (1990). The Shock of the New: Art and the Century of Change. Thames and Hudson, London.","paperID":"None"},{"content":"Hughes, R. (2008). The Mona Lisa Curse. Director Chang M. Oxford Film and Television.","paperID":"None"},{"content":"Jaron Lanier, You Are Not a Gadget: A Manifesto, Knopf Publishing Group, 2010","paperID":"1824167"},{"content":"Lidwell, W. and Holden, K., (2003). Universal Principles of Design. Rockport Publishers Inc., MA USA.","paperID":"None"},{"content":"Michon, A., Flazinski, C. and Chalubert, C. On the Separation Between the Aesthetic and the Functional and how the Digital will Steal Form. In Post Digital Art, Proc of the 3rd Computer Art Congress, Paris (2012).","paperID":"None"},{"content":"John McCarthy , Peter Wright, Technology as Experience, The MIT Press, 2004","paperID":"1044942"},{"content":"Mayring, P. (2004) Qualitative Content Analysis. In U. Flick, E. von Kardoff, and I. Steinke (eds), A Companion to Qualitative Research. Sage, London.","paperID":"None"},{"content":"Peso, L. (2011). The Dancer retrieved from: http://www.youtube.com/watch?v=okhhY-sTe0k&feature=youtube_gdata_player","paperID":"None"},{"content":"s{edition} http://www.seditionart.com","paperID":"None"},{"content":"Phoebe Sengers , Kirsten Boehner , Shay David , Joseph 'Jofish' Kaye, Reflective design, Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility, August 20-24, 2005, Aarhus, Denmark","paperID":"1094569"},{"content":"Skågeby, J. (2010). Gift-giving as a conceptual framework: framing social behavior in online networks. Journal of Information Technology, 25(2), 170--177.","paperID":"None"},{"content":"Alex S. Taylor , Richard Harper, The Gift of the Gab?: A Design OrientedSociology of Young People's Use of Mobiles, Computer Supported Cooperative Work, v.12 n.3, p.267-296, 2003","paperID":"871459"},{"content":"Žižek, S. (2008). Living in the End Times. Verso, London.","paperID":"None"}],"abstract":"The paper reflects on three approaches to the dissemination and display of digital art. \\'1c\"s[edition]\\'1d\" is a novel, web-based service that offers limited editions of \"\\'1cdigital prints\"\\'1d. Analysis of user comments suggests that the metaphor of a \\'1c\"limited digital edition\"\\'1d raises issues and to some extent is resisted. The second approach is the Flickr Brushes Gallery, where digital painters post images and comment on one another's work. Analysis of comment boards indicates that the shared art and comments are a form of gift exchange. Finally, the paper discusses a field study in which artists exhibited their work as it develops over time in digital frames and also in an immersive digital projection room. Analysis of field notes and interviews indicate that the digital frame approach was unsuccessful because of aesthetic and environmental concerns. The immersive projection suggested that more experiential approaches may be more interesting. It is argued that there is an inherent resistance in digital media to previous models of art commoditization. None of the approaches discussed here resolve the dilemma but rather indicate the scope and complexity of the issues.","video":"http://www.youtube.com/embed/6_Um0KMbNAk?rel=0","title":"Unlimited editions: three approaches to the dissemination and display of digital art","filename":"CHI13/p139","authors":["Mark Blythe","Jo Briggs","Jonathan Hook","Peter Wright","Patrick Olivier"],"conference":"CHI '13"}