{"paperId":2470702,"reference":[{"content":"Google Custom Search: Health Search Engine. http://www.google.com/cse/home?cx=0109648065331 20826279:7vbttpkazxm","paperID":"None"},{"content":"Bastian, H. Health literacy and patient information: Developing the methodology for a national evidencebased health website. Patient Education and Counseling, 73, 3 (2008), 551--556.","paperID":"None"},{"content":"Bayram, N. and Bilgel, N. The prevalence and sociodemographic correlations of depression, anxiety and stress among a group of university students. Social Psychiatry and Psychiatric Epidemiology, 43, 8 (2008), 667--672.","paperID":"None"},{"content":"Bessiere, K., Pressman, S., Kiesler, S. and Kraut, R. Effects of internet use on health and depression: a longitudinal study. Journal of Medical Internet Research, 12, 1 (2010).","paperID":"None"},{"content":"Buhi, E. R., Daley, E. M., Fuhrmann, H. J. and Smith, S. A. An observational study of how young people search for online sexual health information. Journal of American College Health, 58, 2 (2009), 101--111.","paperID":"None"},{"content":"Cram, P., Fendrick, A. M., Inadomi, J., Cowen, M. E., Carpenter, D. and Vijan, S. The impact of a celebrity promotional campaign on the use of colon cancer screening: the Katie Couric effect. Archives of Internal Medicine, 163, 13 (2003), 1601.","paperID":"None"},{"content":"Edward Cutrell , Zhiwei Guan, What are you looking for?: an eye-tracking study of information usage in web search, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240690"},{"content":"Dolan, N. C., Ferreira, M. R., Davis, T. C., Fitzgibbon, M. L., Rademaker, A., Liu, D., Schmitt, B. P., Gorby, N., Wolf, M. and Bennett, C. L. Colorectal cancer screening knowledge, attitudes, and beliefs among veterans: Does literacy make a difference? Journal of Clinical Oncology, 22, 13 (2004), 2617--2622","paperID":"None"},{"content":"Dugdale, D. C. Muscle twitching. http://www.nlm.nih. gov/medlineplus/ency/article/003296.htm.","paperID":"None"},{"content":"Escoffery, C., Miner, K. R., Adame, D. D., Butler, S., McCormick, L. and Mendell, E. Internet Use for Health Information Among College Students. Journal of American College Health, 53, 4 (2005), 183--188.","paperID":"None"},{"content":"Fiandt, K., Pullen, C. and Walker, S. Actual and perceived risk for chronic illness in rural older women. Clinical excellence for nurse practitioners: the international journal of NPACE, 3, 2 (1999), 105.","paperID":"None"},{"content":"Fox, S. Health topics. http://www.pewinternet.org/ Reports/2011/HealthTopics.aspx","paperID":"None"},{"content":"Fox, S. Online health search 2006. http://www.pewinternet.org/Reports/2006/OnlineHealth-Search-2006.aspx","paperID":"None"},{"content":"The 1000 most-visited sites on the web. http://www.google.com/adplanner/static/top1000/#.","paperID":"None"},{"content":"Hardin, D. M. Acute appendicitis: Review and update. American Family Physician, 60, 7 (1999), 2027--2034.","paperID":"None"},{"content":"Helft, P. R., Eckles, R. E., Johnson-Calley, C. S. and Daugherty, C. K. Use of the Internet to obtain cancer information among cancer patients at an urban county hospital. Journal of Clinical Oncology, 23, 22 (2005), 4954--4962","paperID":"None"},{"content":"Kinnane, N. and Milne, D. The role of the Internet in supporting and informing carers of people with cancer: a literature review. Supportive Care in Cancer, 18, 9 (2010), 1123--1136.","paperID":"None"},{"content":"Knapp, C., Madden, V., Marcu, M., Wang, H., Curtis, C., Sloyer, P. and Shenkman, E. Information seeking behaviors of parents whose children have lifethreatening illnesses. Pediatric Blood & Cancer, 56, 5 (2011), 805--811.","paperID":"None"},{"content":"Carla Teixeira Lopes , Cristina Ribeiro, Context effect on query formulation and subjective relevance in health searches, Proceedings of the third symposium on Information interaction in context, August 18-21, 2010, New Brunswick, New Jersey, USA","paperID":"1840815"},{"content":"Parker, R. M., Williams, M. V., Weiss, B. D., Baker, D. W., Davis, T. C., Doak, C. C., Doak, L. G., Hein, K., Meade, C. D. and Nurss, J. Health literacy-Report of the Council on Scientific Affairs. Journal of the American medical association, 281, 6 (1999), 552--557.","paperID":"None"},{"content":"Peters, E., Slovic, P., Hibbard, J. H. and Tusler, M. Why worry? Worry, risk perceptions, and willingness to act to reduce medical errors. Health Psychology, 25, 2 (2006), 144.","paperID":"None"},{"content":"The Newest Vital Sign: A health literacy assessment tool. http://www.pfizerhealthliteracy.com/asset/pdf/NVS_Eng/files/nvs_flipbook_english_final.pdf","paperID":"None"},{"content":"Redelmeier, D. A. The cognitive psychology of missed diagnoses. Annals of internal medicine, 142, 2 (2005), 115--120.","paperID":"None"},{"content":"Samal, L., Saha, S., Chander, G., Korthuis, P. T., Sharma, R. K., Sharp, V., Cohn, J., Moore, R. D. and Beach, M. C. Internet health information seeking behavior and antiretroviral adherence in persons living with HIV/AIDS. AIDS Patient Care and STDs, 25, 7 (2011), 445--449.","paperID":"None"},{"content":"Gül Seçkin, Cyber patients surfing the medical web: Computer-mediated medical knowledge and perceived benefits, Computers in Human Behavior, v.26 n.6, p.1694-1700, November, 2010","paperID":"1853542"},{"content":"Sharp, L. K., Zurawski, J. M., Roland, P. Y., O'Toole, C. and Hines, J. Health literacy, cervical cancer risk factors, and distress in low-income African-American women seeking colposcopy. Ethnicity and Disease, 12, 4 (2002), 541--546.","paperID":"None"},{"content":"Sillence, E., Briggs, P., Harris, P. R. and Fishwick, L. How do patients evaluate and make use of online health information? Social Science &; Medicine, 64, 9 (2007), 1853--1862.","paperID":"None"},{"content":"Tversky, A. and Kahneman, D. Judgment under uncertainty: Heuristics and biases. Science, 185, 4157 (1974), 1124--1131.","paperID":"None"},{"content":"von Wagner, C., Semmler, C., Good, A. and Wardle, J. Health literacy and self-efficacy for participating in colorectal cancer screening: The role of information processing. Patient Education and Counseling, 75, 3 (2009), 352--357.","paperID":"None"},{"content":"Walji, M., Sagaram, S., Sagaram, D., Meric-Bernstam, F., Johnson, C., Mirza, Q. N. and Bernstam, V. E. Efficacy of quality criteria to identify potentially harmful information: A cross-sectional survey of complementary and alternative medicine web sites. Journal of Medical Internet Research, 6, 2 ( 2004), e21","paperID":"None"},{"content":"WebMD announces fourth quarter and year end financial results. http://investor.shareholder.com/wbmd/releasedetail.cfm?ReleaseID=651179&CompanyID=W BMD","paperID":"None"},{"content":"Weiss, B. D., Mays, M. Z., Martz, W., Castro, K. M., DeWalt, D. A., Pignone, M. P., Mockbee, J. and Hale, F. A. Quick assessment of literacy in primary care: The Newest Vital Sign. The Annals of Family Medicine, 3, 6 (2005), 514--522.","paperID":"None"},{"content":"Ryen W. White , Eric Horvitz, Cyberchondria: Studies of the escalation of medical concerns in Web search, ACM Transactions on Information Systems (TOIS), v.27 n.4, p.1-37, November 2009","paperID":"1629101"},{"content":"Ryen W. White , Eric Horvitz, Predicting escalations of medical queries based on web page structure and content, Proceedings of the 33rd international ACM SIGIR conference on Research and development in information retrieval, July 19-23, 2010, Geneva, Switzerland","paperID":"1835607"},{"content":"Witte, K. Fear control and danger control: A test of the extended parallel process model (EPPM). Communications Monographs, 61, 2 (1994), 113--134.","paperID":"None"},{"content":"Witte, K., Meyer, G. and Martell, D. Effective health risk messages: A step-by-step guide. Sage Publications, Inc, 2001.","paperID":"None"},{"content":"Ybarra, M. and Suman, M. Reasons, assessments and actions taken: Sex and age differences in uses of Internet health information. Health Education Research, 23, 3 (2008), 512--521.","paperID":"None"}],"citation":[{"content":"Munmun De Choudhury , Meredith Ringel Morris , Ryen W. White, Seeking and sharing health information online: comparing search engines and social media, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557214"},{"content":"Georg P. Schoenherr , Ryen W. White, Interactions between health searchers and search engines, Proceedings of the 37th international ACM SIGIR conference on Research & development in information retrieval, July 06-11, 2014, Gold Coast, Queensland, Australia","paperID":"2609602"},{"content":"Ryen W. White , Eric Horvitz, Captions and biases in diagnostic search, ACM Transactions on the Web (TWEB), v.7 n.4, p.1-28, October 2013","paperID":"2486040"},{"content":"Ryen W. White , Eric Horvitz, Belief Dynamics and Biases in Web Search, ACM Transactions on Information Systems (TOIS), v.33 n.4, p.1-46, May 2015","paperID":"2746229"},{"content":"Ryen W. White , Ahmed Hassan, Content Bias in Online Health Search, ACM Transactions on the Web (TWEB), v.8 n.4, p.1-33, October 2014","paperID":"2663355"}],"abstract":"Searching for health information online has become increasingly common, yet few studies have examined potential negative emotional effects of online health information search. We present results from an experiment manipulating the presentation of search results for common symptoms, which shows that the frequency and placement of serious illness mentions within results can influence perceptions of symptom severity and susceptibility of having the serious illness, respectively. The increase in severity and susceptibility can then lead to higher levels of negative emotional outcomes experienced--including feeling overwhelmed and frightened. Interestingly, health literacy can help reduce perceived symptom severity, and high online health experience actually increases the likelihood that individuals use a frequency-based heuristic. Technological implications and directions for future research are discussed.","video":"http://www.youtube.com/embed/7OVlGRLVXE4?rel=0","title":"The presentation of health-related search results and its impact on negative emotional outcomes","filename":"CHI13/p333","authors":["Carolyn Lauckner","Gary Hsieh"],"conference":"CHI '13"}