{"paperId":2470732,"citation":[{"content":"Brian A. Smith , Xiaojun Bi , Shumin Zhai, Optimizing Touchscreen Keyboards for Gesture Typing, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702357"},{"content":"Xiaojun Bi , Tom Ouyang , Shumin Zhai, Both complete and correct?: multi-objective optimization of touchscreen keyboard, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557414"}],"reference":[{"content":"Andrew, C. W., Maier, V., Green, P. (2004). From WER and RIL to MER and WIL: improved evaluation measures for connected speech recognition. Proc. of INTERSPEECH. 4 pages.","paperID":"None"},{"content":"Android 4.2 http://www.android. com/whatsnew/","paperID":"None"},{"content":"Android Developers. Tools: Andorid Debug Bridge. Accessed April 13, 2012. http://developer.android.com/guide/developing/tools/a db.html.","paperID":"None"},{"content":"Shiri Azenkot , Shumin Zhai, Touch behavior with different postures on soft smartphone keyboards, Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services, September 21-24, 2012, San Francisco, California, USA","paperID":"2371612"},{"content":"Xiaojun Bi , Ciprian Chelba , Tom Ouyang , Kurt Partridge , Shumin Zhai, Bimanual gesture keyboard, Proceedings of the 25th annual ACM symposium on User interface software and technology, October 07-10, 2012, Cambridge, Massachusetts, USA","paperID":"2380136"},{"content":"Damn You, Auto-Correct! http://www.damnyouauto correct.com/. Accessed April 13, 2012.","paperID":"None"},{"content":"Leah Findlater , Jacob Wobbrock, Personalized input: improving ten-finger touchscreen typing through automatic adaptation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208520"},{"content":"Joshua Goodman , Gina Venolia , Keith Steury , Chauncey Parker, Language modeling for soft keyboards, Eighteenth national conference on Artificial intelligence, p.419-424, July 28-August 01, 2002, Edmonton, Alberta, Canada","paperID":"777159"},{"content":"Asela Gunawardana , Tim Paek , Christopher Meek, Usability guided key-target resizing for soft keyboards, Proceedings of the 15th international conference on Intelligent user interfaces, February 07-10, 2010, Hong Kong, China","paperID":"1719986"},{"content":"Per-Ola Kristensson , Shumin Zhai, SHARK2: a large vocabulary shorthand writing system for pen-based computers, Proceedings of the 17th annual ACM symposium on User interface software and technology, October 24-27, 2004, Santa Fe, NM, USA","paperID":"1029640"},{"content":"Lewis, J. R. (1992). Typing-key layouts for singlefinger or stylus input: initial user preference and performance (Technical Report No. 54729). Boca Raton, FL: International Business Machines Corporation.","paperID":"None"},{"content":"Lewis, J. R., Kennedy, P. J., & LaLomia, M. J. (1999). Development of a Digram-Based Typing Key Layout for Single-Finger/Stylus Input. Proceedings of The Human Factors and Ergonomics Society 43rd Annual Meeting.","paperID":"None"},{"content":"Lewis, J. R., LaLomia, M. J., & Kennedy, P. J. (1999). Evaluation of Typing Key Layouts for Stylus Input. Proceedings of The Human Factors and Ergonomics Society 43rd Annual Meeting.","paperID":"None"},{"content":"Lewis, J. R., Potosnak, K. M., & Magyar, R. L. (1997). Keys and Keyboards. In M. G. Helander, T. K. Landauer & P. V. Prabhu (Eds.), Handbook of humancomputer interaction (2nd ed., pp. 1285--1315). Amsterdam: Elsevier Science.","paperID":"None"},{"content":"MacKenzie, I. S. and Soukoreff, R. W. (2002). A Model of Two--Thumb Text Entry. In Proceedings of Graphics Interface '02, pp. 117--124.","paperID":"None"},{"content":"I. Scott MacKenzie , R. William Soukoreff, A character-level error analysis technique for evaluating text entry methods, Proceedings of the second Nordic conference on Human-computer interaction, October 19-23, 2002, Aarhus, Denmark","paperID":"572056"},{"content":"I. Scott MacKenzie , R. William Soukoreff, Phrase sets for evaluating text entry techniques, CHI '03 Extended Abstracts on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"765971"},{"content":"I. Scott MacKenzie , Kumiko Tanaka-Ishii, Text Entry Systems: Mobility, Accessibility, Universality, Morgan Kaufmann Publishers Inc., San Francisco, CA, 2007","paperID":"1296062"},{"content":"I. Scott MacKenzie , Shawn X. Zhang, The design and evaluation of a high-performance soft keyboard, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.25-31, May 15-20, 1999, Pittsburgh, Pennsylvania, USA","paperID":"302983"},{"content":"The New York Times, iPhone Keyboard Secrets. http://pogue.blogs.nytimes.com/2007/06/27/iphonekeyboard-secrets/","paperID":"None"},{"content":"Jochen Rick, Performance optimizations of virtual keyboards for stroke-based text entry on a touch-based tabletop, Proceedings of the 23nd annual ACM symposium on User interface software and technology, October 03-06, 2010, New York, New York, USA","paperID":"1866043"},{"content":"Dmitry Rudchenko , Tim Paek , Eric Badger, Text text revolution: a game that improves text entry on mobile touchscreen keyboards, Proceedings of the 9th international conference on Pervasive computing, June 12-15, 2011, San Francisco, USA","paperID":"2021993"},{"content":"Rumelhart, D. E. and Norman, D. A. (1982), Simulating a Skilled Typist: A Study of Skilled CognitiveMotor Performance. Cognitive Science, 6: 1--36.","paperID":"None"},{"content":"Wobbrock, J.O. (2007). Measures of text entry performance. Chapter 3 in I.S. MacKenzie and K. TanakaIshii (eds.), Text Entry Systems: Mobility, Accessibility, Universality. San Francisco: Morgan Kaufmann, pp. 47--74.","paperID":"None"},{"content":"Jacob O. Wobbrock , Brad A. Myers, Analyzing the input stream for character- level errors in unconstrained text entry evaluations, ACM Transactions on Computer-Human Interaction (TOCHI), v.13 n.4, p.458-489, December 2006","paperID":"1188819"},{"content":"Zhai, S., Hunter, M., & Smith, B. A. (2002). Performance optimization of virtual keyboards. Human-Computer Interaction, 17(2,3), 89--129.","paperID":"None"},{"content":"Shumin Zhai , Per-Ola Kristensson, Shorthand writing on stylus keyboard, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642630"},{"content":"Zhai, S. and Kristensson, P.O. Introduction to Shape Writing (2006) IBM Research Report RJ10393 (A0611-006), November.","paperID":"None"},{"content":"Shumin Zhai , Per Ola Kristensson, The word-gesture keyboard: reimagining keyboard interaction, Communications of the ACM, v.55 n.9, September 2012","paperID":"2330689"}],"abstract":"The time and labor demanded by a typical laboratory-based keyboard evaluation are limiting resources for algorithmic adjustment and optimization. We propose Remulation, a complementary method for evaluating touchscreen keyboard correction and recognition algorithms. It replicates prior user study data through real-time, on-device simulation. We have developed Octopus, a Remulation-based evaluation tool that enables keyboard developers to efficiently measure and inspect the impact of algorithmic changes without conducting resource-intensive user studies. It can also be used to evaluate third-party keyboards in a \"black box\" fashion, without access to their algorithms or source code. Octopus can evaluate both touch keyboards and word-gesture keyboards. Two empirical examples show that Remulation can efficiently and effectively measure many aspects of touch screen keyboards at both macro and micro levels. Additionally, we contribute two new metrics to measure keyboard accuracy at the word level: the Ratio of Error Reduction (RER) and the Word Score.","video":"http://www.youtube.com/embed/CBcaLH9FqPA?rel=0","title":"Octopus: evaluating touchscreen keyboard correction and recognition algorithms via","filename":"CHI13/p543","authors":["Xiaojun Bi","Shiri Azenkot","Kurt Partridge","Shumin Zhai"],"conference":"CHI '13"}