{"paperId":2470725,"reference":[{"content":"Amann, K. and Knorr Cetina, K. The fixation of (visual) evidence. Human Studies 11, 2 (1988), 133--169.","paperID":"None"},{"content":"Barad, K. M. Meeting The Universe Halfway. Duke Univ. Press, 2007.","paperID":"None"},{"content":"David Benque , Sam Bourton , Caitlin Cockerton , Byron Cook , Jasmin Fisher , Samin Ishtiaq , Nir Piterman , Alex Taylor , Moshe Y. Vardi, BMA: visual tool for modeling and analyzing biological networks, Proceedings of the 24th international conference on Computer Aided Verification, July 07-13, 2012, Berkeley, CA","paperID":"2362280"},{"content":"Matthew J. Bietz , Toni Ferro , Charlotte P. Lee, Sustaining the development of cyberinfrastructure: an organization adapting to change, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145339"},{"content":"Bietz, M. J. and Lee, C. P. Collaboration in metagenomics: Sequence databases and the organization of scientific work. ECSCW '09, Springer (2009), 243--262.","paperID":"None"},{"content":"Bowker, G. and Star, S. L. Sorting Things Out. MIT Press, Cambridge, 1999.","paperID":"None"},{"content":"Carlson, R. H. Biology is Technology. Harvard Univ. Press, Cambridge MA, 2011.","paperID":"None"},{"content":"Nathalie Chabrier , François Fages, Symbolic Model Checking of Biochemical Networks, Proceedings of the First International Workshop on Computational Methods in Systems Biology, p.149-162, February 24-26, 2003","paperID":"754693"},{"content":"Byron Cook , Jasmin Fisher , Elzbieta Krepska , Nir Piterman, Proving stabilization of biological systems, Proceedings of the 12th international conference on Verification, model checking, and abstract interpretation, p.134-149, January 23-25, 2011, Austin, TX, USA","paperID":"1946295"},{"content":"Byron Cook , Andreas Podelski , Andrey Rybalchenko, Proving program termination, Communications of the ACM, v.54 n.5, May 2011","paperID":"1941509"},{"content":"Fisher, J. and Henzinger, T. A. Executable Cell Biology. Nature Biotechnology 25, 11 (2007), 1239--1249.","paperID":"None"},{"content":"Jasmin Fisher , David Harel , Thomas A. Henzinger, Biology as reactivity, Communications of the ACM, v.54 n.10, October 2011","paperID":"2001289"},{"content":"Funahashi, A., Morohashi, M., and Kitano, H. CellDesigner: a process diagram editor for gene-regulatory and biochemical networks. Biosilico 1, 5 (2003), 159--162.","paperID":"None"},{"content":"Giere, R. N. Is computer simulation changing the face of experimentation? Phil. Studies 143, 1 (2009), 59--62.","paperID":"None"},{"content":"Hacking, I. Representing and Intervening. Cambridge Univ. Press, Cambridge UK, 1983.","paperID":"None"},{"content":"Ideker, T., Galitski, T., and Hood, L. A new approach to decoding life: systems biology. Annu Rev Genomics Hum Genet 2 (2001), 343--372.","paperID":"None"},{"content":"Keller, E. F. Models of and models for: Theory and practice in contemporary biology. Philosophy of Science 67, (2000), S72--S86.","paperID":"None"},{"content":"Keller, E. F. Making Sense of Life. Harvard Univ. Press, London, 2002.","paperID":"None"},{"content":"Krohs, U. and Callebaut, W. Data without models merging with models without data. In F. C. Boogerd, ed., Systems biology: Philosophical foundations. Elsevier, Amsterdam, 2007, 181--283.","paperID":"None"},{"content":"Latour, B. The whole is always smaller than its parts: A digital test of Gabriel Tarde's monads. British Journal of Sociology, (in press).","paperID":"None"},{"content":"Law, J. After Method. Routledge, London, 2004.","paperID":"None"},{"content":"Leahu, L. Representation without representationalism (Doctoral dissertation). Cornell Univ., Ithaca, NY, 2012.","paperID":"None"},{"content":"Myers, N. Conjuring Machinic Life. Spontaneous Generations 2, 1 (2009), 112--121.","paperID":"None"},{"content":"Pickering, A. The Mangle of Practice. University of Chicago Press, Chicago IL, 1995.","paperID":"None"},{"content":"Rheinberger, H. J. Toward a History of Epistemic Things. Stanford Univ. Press, Stanford, CA, 1997.","paperID":"None"},{"content":"Daniela K. Rosner, The material practices of collaboration, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145375"},{"content":"Suchman, L. Agencies in technology design: Feminist reconfigurations. Workshop on Gendered Innovations in Science and Engineering, Stanford Univ. (15 April, 2005).","paperID":"None"},{"content":"Lucy A. Suchman, Human-Machine Reconfigurations: Plans and Situated Actions, Cambridge University Press, New York, NY, 2006","paperID":"1212951"},{"content":"Alex S. Taylor, Machine intelligence, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1519022"},{"content":"Alex S. Taylor, Out there, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979042"},{"content":"Verran, H. Science and an African logic. Univ. of Chicago Press, Chicago IL, 2001.","paperID":"None"},{"content":"Mikael Wiberg , Hiroshi Ishii , Paul Dourish , Daniela Rosner , Anna Vallgårda , Petra Sundström , Tobie Kerridge , Mark Rolston, \"Material interactions\": from atoms & bits to entangled practices, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2212408"}],"citation":[{"content":"Byron Cook , Jasmin Fisher , Benjamin A. Hall , Samin Ishtiaq , Garvit Juniwal , Nir Piterman, Finding Instability in Biological Models, Proceedings of the 16th International Conference on Computer Aided Verification, July 18-22, 2014","paperID":"2735083"},{"content":"Stacey Kuznetsov , Aniket Kittur , Eric Paulos, Biological Citizen Publics: Personal Genetics as a Site of Public Engagement with Science, Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition, June 22-25, 2015, Glasgow, United Kingdom","paperID":"2757246"},{"content":"Lori Carter , Tim Little , Claire Mathews, Undergraduate programs in computational science, Journal of Computing Sciences in Colleges, v.30 n.4, p.83-91, April 2015","paperID":"2752647"}],"abstract":"Representing a new class of tool for biological modeling, Bio Model Analyzer (BMA) uses sophisticated computational techniques to determine stabilization in cellular networks. This paper presents designs aimed at easing the problems that can arise when such techniques - \\'14using distinct approaches to conceptualizing networks\\'14 - are applied in biology. The work also engages with more fundamental issues being discussed in the philosophy of science and science studies. It shows how scientific ways of knowing are constituted in routine interactions with tools like BMA, where the emphasis is on the practical business at hand, even when seemingly deep conceptual problems exist. For design, this perspective refigures the frictions raised when computation is used to model biology. Rather than obstacles, they can be seen as opportunities for opening up different ways of knowing.","video":"http://www.youtube.com/embed/e7BwJUq1VR0?rel=0","title":"At the interface of biology and computation","filename":"CHI13/p493","authors":["Alex S. Taylor","Nir Piterman","Samin Ishtiaq","Jasmin Fisher","Byron Cook","Caitlin Cockerton","Sam Bourton","David Benque"],"conference":"CHI '13"}