{"paperId":2470678,"citation":[{"content":"Jonas Schild , Joseph J. LaViola, Jr. , Maic Masuch, Altering gameplay behavior using stereoscopic 3D vision-based video game design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557283"},{"content":"Nora Broy , Stefan Schneegass , Florian Alt , Albrecht Schmidt, FrameBox and MirrorBox: tools and guidelines to support designers in prototyping interfaces for 3D displays, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557183"}],"abstract":"Creating graphical user interfaces (GUI) for stereoscopic 3D (S3D) games is a difficult choice between visual comfort and effect. We present a S3D Game GUI Design Space and a list of S3D-specific attributes that emphasizes integrating visually comfortable interfaces into the game world, story and S3D view. To showcase our approach, we created two GUI concepts and evaluated them with 32 users. Our results show quality improvements for a combination of bottom position and visual attachment for a menu. In a referencing interface, placing the reference near to the target depth significantly improved perceived quality, game integration, and increased presence. These results confirm the need to create S3D GUIs with perceptual constraints in mind, demonstrating the potential to extend the user experience. Additionally, our design space offers a formal and flexible way to create new effects in S3D GUIs.","reference":[{"content":"Ernest Adams, Fundamentals of Game Design, New Riders Publishing, Thousand Oaks, CA, 2009","paperID":"1804572"},{"content":"Benyon, D., Turner, P., and Turner, S. Designing Interactive Systems: People, Activities, Contexts, Technologies. Addison Wesley, 2005.","paperID":"None"},{"content":"Bill Buxton, Sketching User Experiences: Getting the Design Right and the Right Design, Morgan Kaufmann Publishers Inc., San Francisco, CA, 2007","paperID":"1526229"},{"content":"Fagerholt, E. and Lorentzon, M. Beyond the HUD User Interfaces for Increased Player Immersion in FPS Games. 2009.","paperID":"None"},{"content":"Alexander R. Galloway, Gaming: Essays On Algorithmic Culture (Electronic Mediations), Univ Of Minnesota Press, 2006","paperID":"1202101"},{"content":"Hoffman, D., Girshick, A., Akeley, K., and Banks, M.S. Vergence--accommodation conflicts hinder visual performance and cause visual fatigue. Journal of Vision 8, 3 (2008), 1--30.","paperID":"None"},{"content":"Geoffrey S. Hubona , Philip N. Wheeler , Gregory W. Shirah , Matthew Brandt, The relative contributions of stereo, lighting, and background scenes in promoting 3D depth visualization, ACM Transactions on Computer-Human Interaction (TOCHI), v.6 n.3, p.214-242, Sept. 1999","paperID":"329695"},{"content":"Hutarew, G., Moser, K., and Dietze, O. Comparison of an auto-stereoscopic display and polarized stereoscopic projection for macroscopic pathology. Journal of telemedicine and telecare 10, 4 (2004), 206--13.","paperID":"None"},{"content":"Häkkinen, J., Kawai, T., Takatalo, J., Leisti, T., Radun, J., and Hirsaho, A. Measuring Stereoscopic Image Quality Experience with Interpretation Based Quality Methodology. System 6808, January (2008), 27--31.","paperID":"None"},{"content":"Häkkinen, J., Kawai, T., Takatalo, J., Mitsuya, R., and Nyman, G. What do people look at when they watch stereoscopic movies? Displays 7524, (2010).","paperID":"None"},{"content":"Wijnand IJsselsteijn , Huib de Ridder , Jonathan Freeman , S. E. Avons , Don Bouwhuis, Effects of Stereoscopic Presentation, Image Motion, and Screen Size on Subjective and Objective Corroborative Measures of Presence, Presence: Teleoperators and Virtual Environments, v.10 n.3, p.298-311, June 2001","paperID":"1246713"},{"content":"Kim, N., Kim, G.J., Park, C., Lee, I., and Lim, S.H. Multimodal Menu Presentation and Selection in Immersive Virtual Environments. Science And Technology, (2000), 1--8.","paperID":"None"},{"content":"Arun Kulshreshth , Jonas Schild , Joseph J. LaViola, Jr., Evaluating user performance in 3D stereo and motion enabled video games, Proceedings of the International Conference on the Foundations of Digital Games, May 29-June 01, 2012, Raleigh, North Carolina","paperID":"2282350"},{"content":"Lambooij, M., IJsselsteijn, W., Bouwhuis, D.G., and Heynderickx, I. Evaluation of Stereoscopic Images: Beyond 2D Quality. IEEE Transactions on Broadcasting 57, 2 (2011), 432--444.","paperID":"None"},{"content":"Lambooij, M.T.M., IJsselsteijn, W.A., and Heynderickx, I. Visual discomfort in stereoscopic displays: a review. Proceedings of SPIE 6490, May 2010 (2007), 64900I-- 64900I--13.","paperID":"None"},{"content":"Noel Mahoney , Andreas Oikonomou , David Wilson, Stereoscopic 3D in video games: A review of current design practices and challenges, Proceedings of the 2011 16th International Conference on Computer Games, p.148-155, July 27-30, 2011","paperID":"2192230"},{"content":"Marcoux, L. AREA Autodesk. Stereoscopy in 3ds Max with StereoCam Modifier, 2009. http://area.autodesk.com/blogs/louis/stereoscopy_in_3ds _max_with_stereocam_modifier/.","paperID":"None"},{"content":"L. M.J. Meesters , W. A. IJsselsteijn , P. J.H. Seuntiens, A survey of perceptual evaluations and requirements of three-dimensional TV, IEEE Transactions on Circuits and Systems for Video Technology, v.14 n.3, p.381-391, March 2004","paperID":"2323583"},{"content":"Marianna Obrist , Daniela Wurhofer , Florian Förster , Thomas Meneweger , Thomas Grill , David Wilfinger , Manfred Tscheligi, Perceived 3DTV viewing in the public: insights from a three-day field evaluation study, Proceddings of the 9th international interactive conference on Interactive television, June 29-July 01, 2011, Lisbon, Portugal","paperID":"2000154"},{"content":"Kevin Saunders , Jeannie Novak, Game Development Essentials: Game Interface Design, Thomson Delmar Learning, 2006","paperID":"1202894"},{"content":"Schertenleib, S. (SCCE). Optimization for Making Stereoscopic 3D Games on PlayStation. 2011.","paperID":"None"},{"content":"Jonas Schild , Joseph LaViola , Maic Masuch, Understanding user experience in stereoscopic 3D games, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207690"},{"content":"Schild, J. and Masuch, M. Designing Stereoscopic Information Visualization for 3D-TV: What can we learn from S3D Gaming ? Proc of SPIE Vol. 8288: Stereoscopic displays and applications XXIII, (2012).","paperID":"None"},{"content":"Shibata, T., Kim, J., Hoffman, D.M., and Banks, M.S. The zone of comfort: Predicting visual discomfort with stereo displays. Journal of vision 11, 8 (2011), 1--29.","paperID":"None"},{"content":"Stuerzlinger, W. and Wingrave, C. The Value of Constraints for 3D User Interfaces. In Virtual Realities: Dagstuhl Seminar 2008. Springer, 2011, 203--224.","paperID":"None"},{"content":"Taylor, P., Kennedy, R.S., Lane, N.E., Berbaum, K.S., and Lilienthal, M.G. Simulator Sickness Questionnaire : An Enhanced Method for Quantifying Simulator Sickness Simulator Sickness Questionnaire : An Enhanced Method for Quantifying Simulator Sickness. International Journal, 912873516 (2010).","paperID":"None"},{"content":"Colin Ware , Peter Mitchell, Reevaluating stereo and motion cues for visualizing graphs in three dimensions, Proceedings of the 2nd symposium on Applied perception in graphics and visualization, August 26-28, 2005, A Coroña, Spain","paperID":"1080411"},{"content":"Wirth, W., Schramm, H., Böcking, S., et al. Entwicklung und Validierung eines Fragebogens zur Entstehung von räumlichem Präsenzerleben. Halem, 2008, 70--95.","paperID":"None"},{"content":"You, J., Jiang, G., Xing, L., and Perkis, A. Quality of Visual Experience for 3D Presentation -- Stereoscopic Image. In M. Mrak, M. Grgic and M. Kunt, eds., HighQuality Visual Experience. Springer Berlin Heidelberg, Berlin, Heidelberg, 2010, 51--77.","paperID":"None"}],"title":"Creating and analyzing stereoscopic 3D graphical user interfaces in digital games","filename":"CHI13/p169","authors":["Jonas Schild","Liane Bölicke","Joseph J. LaViola Jr.","Maic Masuch"],"conference":"CHI '13"}