{"paperId":2470670,"citation":[{"content":"Erik Harpstead , Christopher J. MacLellan , Vincent Aleven , Brad A. Myers, Using extracted features to inform alignment-driven design ideas in an educational game, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557393"},{"content":"Claudia Müller , Dominik Hornung , Theodor Hamm , Volker Wulf, Practice-based Design of a Neighborhood Portal: Focusing on Elderly Tenants in a City Quarter Living Lab, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702449"}],"reference":[{"content":"Elliot Soloway , Shari L. Jackson , Jonathan Klein , Chris Quintana , James Reed , Jeff Spitulnik , Steven J. Stratford , Scott Studer , Jim Eng , Nancy Scala, Learning theory in practice: case studies of learner-centered design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.189-196, April 13-18, 1996, Vancouver, British Columbia, Canada","paperID":"238476"},{"content":"Design-based research collective. An emerging paradigm for educational inquiry. Educational Researcher, 32, 1 (2003), 5--8.","paperID":"None"},{"content":"Bereiter, C. and Scardamalia, M. Learning to work creatively with knowledge. In E. de Corte (Ed.), Powerful learning environment, (2003).","paperID":"None"},{"content":"Shari L. Jackson , Joseph Krajcik , Elliot Soloway, The design of guided learner-adaptable scaffolding in interactive learning environments, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.187-194, April 18-23, 1998, Los Angeles, California, USA","paperID":"274672"},{"content":"Koedinger, K. R. Toward evidence for instructional design principles: Examples from Cognitive Tutor Math 6. In Proc. PME/NA XXXII (2002).","paperID":"None"},{"content":"Mayer, R. E. The promise of multimedia learning: Using the same instructional design methods across different media. Learning and Instruction, 13, 2 (2003), 125--139.","paperID":"None"},{"content":"van Merrienboer, J. J. G., Clark, R. E. and de Croock, M. B. M. Blueprints for complex learning: The 4C/ID-model. Educational Technology Research and Development, 50, 2 (2002), 39--64.","paperID":"None"},{"content":"Koedinger, K. and Corbett, A. Cognitive Tutors: Technology bringing learning science to the classroom. Cambridge University Press, 2006.","paperID":"None"},{"content":"Albert T. Corbett , John R. Anderson, Locus of feedback control in computer-based tutoring: impact on learning rate, achievement and attitudes, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.245-252, March 2001, Seattle, Washington, USA","paperID":"365111"},{"content":"Albert Corbett , Holly Trask, Instructional interventions in computer-based tutoring: differential impact on learning time and accuracy, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.97-104, April 01-06, 2000, The Hague, The Netherlands","paperID":"332412"},{"content":"Corbett, A. T., Koedinger, K. and Hadley, W. S. Cognitive tutors: From the research classroom to all classrooms. Lawrence Erlbaum Associates, 2001.","paperID":"None"},{"content":"VanLehn, K. The relative effectiveness of human tutoring, intelligent tutoring systems and other tutoring systems. Educational Psychologist, 46, 4 (2011), 197--221.","paperID":"None"},{"content":"Corbett, A., Koedinger, K. R. and Anderson, J. R. Intelligent tutoring systems. Elsevier Science Publishers, 1997.","paperID":"None"},{"content":"Martina A. Rau , Vincent Aleven , Nikol Rummel , Stacie Rohrbach, Sense making alone doesn't do it: fluency matters too! ITS support for robust learning with multiple representations, Proceedings of the 11th international conference on Intelligent Tutoring Systems, June 14-18, 2012, Chania, Crete, Greece","paperID":"2345868"},{"content":"Amy Ogan , Vincent Aleven , Christopher Jones, Pause, predict, and ponder: use of narrative videos to improve cultural discussion and learning, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357081"},{"content":"Corbett, A., Kauffman, L., MacLaren, B., Wagner, A. and Jones, E. A cognitive tutor for genetics problem solving: Learning gains and student modeling. Journal of Educational Computing Research, 42, 2 (2010), 219--239.","paperID":"None"},{"content":"Ritter, S., Anderson, J. R., Koedinger, K. R. and Corbett, A. T. Cognitive Tutor: Applied research in mathematics education. Psychonomic Bulletin & Review, 14, 2 (2007), 249--255.","paperID":"None"},{"content":"Siegler, R. S., Carpenter, T., Fennell, F., Geary, D., Lewis, J., Okamoto, Y., Thompson, L. and Wray, J. Developing effective fractions instruction: A practice guide. U.S. Dept. of Education, 2010.","paperID":"None"},{"content":"NMAP. Foundations for Success: Report of the National Mathematics Advisory Board Panel. U.S. Government Printing Office, 2008.","paperID":"None"},{"content":"NCTM Principles and Standards for School Mathematics. National Council of Teachers of Mathematics, 2000.","paperID":"None"},{"content":"Schraagen, J. M., Chipman, S. F. and Shalin, V. L. Cognitive Task Analysis. Erlbaum Associates, 2000.","paperID":"None"},{"content":"Ryan S. J. D. Baker , Albert T. Corbett , Kenneth R. Koedinger, The Difficulty Factors Approach to the Design of Lessons in Intelligent Tutor Curricula, International Journal of Artificial Intelligence in Education, v.17 n.4, p.341-369, December 2007","paperID":"1435399"},{"content":"Vincent Aleven , Bruce M. Mclaren , Jonathan Sewall , Kenneth R. Koedinger, A New Paradigm for Intelligent Tutoring Systems: Example-Tracing Tutors, International Journal of Artificial Intelligence in Education, v.19 n.2, p.105-154, April 2009","paperID":"1734245"},{"content":"Charalambous, C. Y. and Pitta-Pantazi, D. Drawing on a Theoretical Model to Study Students' Understandings of Fractions. Educational Studies in Mathematics, 64, 3 (2007), 293--316.","paperID":"None"},{"content":"Hugh Beyer, Contextual Design: Defining Customer-Centered Systems, Morgan Kaufmann Publishers Inc., San Francisco, CA, 1997","paperID":"523184"},{"content":"Große, C. S. and Renkl, A. Effects of multiple solution methods in mathematics learning. Learning and Instruction, 16 (2006), 122--138.","paperID":"None"},{"content":"Yang, D.-C. and Reys, R. E. One fraction problem, many solution paths. Mathematics Teaching in the Middle School, 7, 3 (2001), 164--166.","paperID":"None"},{"content":"Reed, J. A structure-mapping model for word problems. Journal of Experimental Psychology: Learning, Memory, and Cognition, 13 (1987), 124--139.","paperID":"None"},{"content":"Thußbas, C. Beeinflussen Cover Stories mathematischer Texaufgaben analogen Transfer in der Mathematik? Zeitschrift für Experimentelle Psychologie, 48, 4 (2001), 272--289.","paperID":"None"},{"content":"Catrambone, R. and Holyoak, K. J. Learning and subgoals and methods for solving probability problems. Memory & Cognition, 18 (1998), 593--603.","paperID":"None"},{"content":"Thorndike, E. L. The psychology of arithmetic. Macmillan, 1922.","paperID":"None"},{"content":"Pett, D. and Wilson, T. Color research and its application to the design of instructional materials. Educational Technology Research and Development, 44, 3 (1996), 19--35.","paperID":"None"},{"content":"Jakobsdottir, S., Krey, C. L. and Sales, G. C. Computer graphics: Preferences by gender in grades 2, 4, and 6. Journal of Educational Research, 88, 2 (1994), 91--100.","paperID":"None"}],"abstract":"Designing interactive learning environments (ILEs; e.g., intelligent tutoring systems, educational games, etc.) is a challenging interdisciplinary process that needs to satisfy multiple stakeholders. ILEs need to function in real educational settings (e.g., schools) in which a number of goals interact. Several instructional design methodologies exist to help developers address these goals. However, they often lead to conflicting recommendations. Due to the lack of an established methodology to resolve such conflicts, developers of ILEs have to rely on ad-hoc solutions. We present a principled methodology to resolve such conflicts. We build on a well-established design process for creating Cognitive Tutors, a highly effective type of ILE. We extend this process by integrating methods from multiple disciplines to resolve design conflicts. We illustrate our methodology's effectiveness by describing the iterative development of the Fractions Tutor, which has proven to be effective in classroom studies with 3,000 4th-6th graders.","video":"http://www.youtube.com/embed/JTPD_9Mjogk?rel=0","title":"Why interactive learning environments can have it all: resolving design conflicts between competing goals","filename":"CHI13/p109","authors":["Martina A. Rau","Vincent Aleven","Nikol Rummel","Stacie Rohrbach"],"conference":"CHI '13"}