{"paperId":2470698,"reference":[{"content":"Alexander, M. S., Foldin, B. W., and Marigold, D. S. Prism adaptation and generalization during visually guided locomotor tasks. J Neurophysiology, 106(2011), 860--871.","paperID":"None"},{"content":"Frank A. Biocca , J. P. Rolland, Virtual Eyes Can Rearrange Your Body: Adaptation to Visual Displacement in See-Through, Head-Mounted Displays, Presence: Teleoperators and Virtual Environments, v.7 n.3, p.262-277, June 1998","paperID":"1246764"},{"content":"Cobb, S.V.G. Measurement of postural stability before and after immersion in a virtual environment. Applied Ergonomics, 30(1999), 47--57.","paperID":"None"},{"content":"Harris, C., S. Adaptation to displaced vision: Visual, motor, or proprioceptive change? Science, 140(1963), 812--813","paperID":"None"},{"content":"Hoffmann, E. R. A comparison of hand and foot movement times. Ergonomics, 34(1991), 397--406.","paperID":"None"},{"content":"Li, A. Experiencing visuo-motor plasticity by prism adaptation in a classroom setting. The Journal of Undergraduate Neuroscience Education (JUNE).","paperID":"None"},{"content":"Martin, T. A., J. G. Keating, H. P. Goodkin, A. J. Bastian, W. T. Thach. Throwing while looking through prisms. I. Focal olivocerebellar lesions impair adaptation. Brain, 119(1996a), 1183--1198. II. Specificity and storage of multiple gaze-throw calibrations. Brain, 119(1996b), 1199--1211.","paperID":"None"},{"content":"McIlroy, W. E., Maki, B. E. Preferred placement of the feet during quiet stance: Development of a standardized foot placement for balance testing. Clinical Biomechanics, 12(1997), 66--70.","paperID":"None"},{"content":"Morton, S. M., and Bastian, A. J., Prism adaptation during walking generalizes to reaching and requires the cerebellum. Journal of Neurophysiology, 92(2004), 2497--2509.","paperID":"None"},{"content":"Jannick P. Rolland , Henry Fuchs, Optical Versus Video See-Through Head-Mounted Displays in Medical Visualization, Presence: Teleoperators and Virtual Environments, v.9 n.3, p.287-309, June 2000","paperID":"1246886"},{"content":"Stanney, K. M., Kennedy, R. S., Drexler, J. M., Harm, D. L. Motion sickness and proprioceptive aftereffects following virtual environment exposure. Applied Ergonomics, 30(1999), 27--38.","paperID":"None"},{"content":"Taguchi, G. Introduction to quality engineering: Designing quality into products and processes. Asian Productivity Organization, Tokyo: The Organization, 1986.","paperID":"None"}],"citation":[{"content":"Sei-Young Kim , Joong Ho Lee , Ji Hyung Park, The effects of visual displacement on simulator sickness in video see-through head-mounted displays, Proceedings of the 2014 ACM International Symposium on Wearable Computers, September 13-17, 2014, Seattle, Washington","paperID":"2634339"}],"abstract":"A video see-through head mounted display (HMD) has a different viewing point than does the real eye, resulting in visual displacement (VD). VD deteriorates visuomotor performance due to sensory conflict. Previous work has investigated this deterioration and human adaptation by comparing fixed VD and real eye conditions. In this study we go a step further to investigate whether any differences in visuomotor and adaptation trends exist across 16 distinct VD conditions. The performance tasks studied were of two types: foot placement and finger touch. In contrast to our initial prediction, the results showed equal task performance levels and adaptation within about 5 minutes regardless of VD conditions. We found that human adaptation covered a variety of VDs --- up to 55 mm in the X, Y direction; up to 125mm in the Z direction; and up to 140mm of interocular distance (IOD). In addition, we found that partial adaptation gave participants the interesting experience of a sense of body structure distortion for a few minutes.","video":"http://www.youtube.com/embed/qw4vAIsf_GQ?rel=0","title":"A preliminary investigation of human adaptations for various virtual eyes in video see-through HMDS","filename":"CHI13/p309","authors":["Joong Ho Lee","Sei-young Kim","Hae Cheol Yoon","Bo Kyung Huh","Ji-Hyung Park"],"conference":"CHI '13"}