{"paperId":2470713,"citation":[{"content":"Salvatore Andolina , Daniel Lee , Steven Dow, Crowdboard: an augmented whiteboard to support large-scale co-design, Proceedings of the adjunct publication of the 26th annual ACM symposium on User interface software and technology, October 08-11, 2013, St. Andrews, Scotland, United Kingdom","paperID":"2514724"},{"content":"Kevin Marshall , Anja Thieme , Jayne Wallace , John Vines , Gavin Wood , Madeline Balaam, Making wellbeing: a process of user-centered design, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2600888"},{"content":"Peter Dalsgaard , Kim Halskov, Tangible 3D tabletops, interactions, v.21 n.5, September + October 2014","paperID":"2658859"},{"content":"Urban computing in the wild, International Journal of Human-Computer Studies, v.81 n.C, p.31-48, September 2015","paperID":"2798316"},{"content":"Yong Liu , Jorge Goncalves , Denzil Ferreira , Bei Xiao , Simo Hosio , Vassilis Kostakos, CHI 1994-2013: mapping two decades of intellectual progress through co-word analysis, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2556969"}],"reference":[{"content":"Alexander, C. The Nature of Order, Book three, A vision of the living world. California, USA. (2005).","paperID":"None"},{"content":"Buchhave B. Transformationer. Aarhus Kommunes Biblioteker, (2006).","paperID":"None"},{"content":"Casey, M. E. & Savastinuk, L. C. Service for the next generation library, Library Journal, 9(1). (2006).","paperID":"None"},{"content":"Andrew Clement , Peter Van den Besselaar, A retrospective look at PD projects, Communications of the ACM, v.36 n.6, p.29-37, June 1993","paperID":"163264"},{"content":"Peter Dalsgaard, Challenges of participation in large-scale public projects, Proceedings of the 11th Biennial Participatory Design Conference, November 29-December 03, 2010, Sydney, Australia","paperID":"1900445"},{"content":"Eva Eriksson, U.F.O.scope!: families playing together at the public library, Proceedings of the 8th ACM Conference on Designing Interactive Systems, August 16-20, 2010, Aarhus, Denmark","paperID":"1858233"},{"content":"Eva Eriksson , Andreas Lykke-Olesen, StorySurfer: a playful book browsing installation for children's libraries, Proceedings of the 6th international conference on Interaction design and children, June 06-08, 2007, Aalborg, Denmark","paperID":"1297289"},{"content":"Eriksson E., Krogh, P., Lykke-Olesen A. Inquiry into Libraries - A Design Approach to Children's Interactive Library. Proc. NORDES'07. (2007)","paperID":"None"},{"content":"Fierro, A. The Glass State, MIT Press (2003).","paperID":"None"},{"content":"Flyvbjerg, B. Five misunderstandings about case-study research. Qualitative Inquiry, 12(2), (2006) 219--245.","paperID":"None"},{"content":"Ole Sejer Iversen , Anne Marie Kanstrup , Marianne Graves Petersen, A visit to the 'new Utopia': revitalizing democracy, emancipation and quality in co-operative design, Proceedings of the third Nordic conference on Human-computer interaction, p.171-179, October 23-27, 2004, Tampere, Finland","paperID":"1028040"},{"content":"Kensing, F. The Trade Unions Influence on Technological Change, in U. Briefs et al. (Eds.): Systems Design For, With and By the Users. (1983).","paperID":"None"},{"content":"Krogh, P. G., Ludvigsen, M., Lykke-Olesen, A. Help Me Pull That Cursor. A Collaborative Interactive Floor Enhancing Community Interaction. In Australasian J. of Inf. Systems 11(2), (2004).","paperID":"None"},{"content":"Kuhn, T. S. The structure of scientific revolutions, University of Chicago Press, Chicago. (1962).","paperID":"None"},{"content":"Andreas Lykke-Olesen , Jesper Nielsen, bibPhone: adding sound to the children's library, Proceedings of the 6th international conference on Interaction design and children, June 06-08, 2007, Aalborg, Denmark","paperID":"1297307"},{"content":"McCrady, E. Bibliothèque Nationale: A Building Hostile to Preservation and Access. In Abbey Newsletter, 22(4), Abbey Publications (1998).","paperID":"None"},{"content":"Anne-Marie Oostveen , Peter van den Besselaar, From small scale to large scale user participation: a case study of participatory design in e-government systems, Proceedings of the eighth conference on Participatory design: Artful integration: interweaving media, materials and practices, July 27-31, 2004, Toronto, Ontario, Canada","paperID":"1011891"},{"content":"Rittel, H. W. J. & Webber, M. M. Dilemmas in a general theory of planning. Policy Sciences, 4(2). (1973).","paperID":"None"},{"content":"Sanders, L. Exploring co-creation on a large scale. In Designing for, with and from User Experience, StudioLab Press (2010).","paperID":"None"},{"content":"Jesper Simonsen , Morten Hertzum, Participative design and the challenges of large-scale systems: extending the iterative PD approach, Proceedings of the Tenth Anniversary Conference on Participatory Design 2008, October 01-04, 2008, Bloomington, Indiana","paperID":"1795236"},{"content":"Dan Shapiro, Participatory design: the will to succeed, Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility, August 20-24, 2005, Aarhus, Denmark","paperID":"1094567"},{"content":"The Aarhus public libraries. The library's voice - a guide to user driven innovation, Aarhus (2008).","paperID":"None"},{"content":"The Aarhus public libraries. Unleash the users - everyone is entitled to a cool library! Aarhus (2009).","paperID":"None"},{"content":"The Aarhus municipality. Web: http://www.urbanmediaspace.dk/en.","paperID":"None"},{"content":"The Aarhus public libraries. Transformation Lab - A Report on Forms of Dissemination in the Physical Space. Aarhus, Denmark. (2007).","paperID":"None"}],"abstract":"In this paper, we present a case study of a participatory project that focuses on interaction in large-scale design, namely, the development of the new Urban Mediaspace Aarhus. This project, which has been under way for ten years, embodies a series of issues that arise when participatory design approaches are applied to large-scale, IT-oriented projects. At the same time, it highlights the issues public knowledge institutions face, when interactive technologies challenge their fundamental roles and practices; by extension, this case offers examples of how these challenges may be explored and addressed through IT-based participatory initiatives. We present a range of such activities carried out during the past ten years, and present the main lessons from the project, based on interviews with three key stakeholders. These lessons focus on how to make participation work in practice, how to align different paradigms of inquiry and practice in a project of this scale, and how to capture and anchor the insights from participatory events to inform the ongoing design process.","video":"http://www.youtube.com/embed/wc6DSOVXUc8?rel=0","title":"Large-scale participation: a case study of a participatory approach to developing a new public library","filename":"CHI13/p399","authors":["Peter Dalsgaard","Eva Eriksson"],"conference":"CHI '13"}