{"paperId":2470701,"citation":[{"content":"Nancy J. Carter, Graphical Passwords for Older Computer Users, Adjunct Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2815593"},{"content":"Soumyadeb Chowdhury , Ron Poet , Lewis Mackenzie, Passhint: memorable and secure authentication, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557153"},{"content":"John Vines , Paul Dunphy , Andrew Monk, Pay or delay: the role of technology when managing a low income, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2556961"},{"content":"Mahdi Nasrullah Al-Ameen , Matthew Wright , Shannon Scielzo, Towards Making Random Passwords Memorable: Leveraging Users' Cognitive Ability Through Multiple Cues, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702241"}],"reference":[{"content":"Anne Adams , Martina Angela Sasse, Users are not the enemy, Communications of the ACM, v.42 n.12, p.40-46, Dec. 1999","paperID":"322806"},{"content":"Anastasi, J.S. and Rhodes, M.G. Evidence for an own-age bias in face recognition. North American Journal of Psychology 8, 2 (2006), 237--25","paperID":"None"},{"content":"Anastasi, J.S. and Rhodes, M.G. An own-age bias in face recognition for children and older adults. Psychonomic Bulletin & Review 12, 6 (2005), 1043--1047.","paperID":"None"},{"content":"Baddeley, A. and Scott, D. Short term forgetting in the absence of proactive interference. The Quarterly Journal of Experimental Psychology 23, 3 (1971), 275--283.","paperID":"None"},{"content":"Robert Biddle , Sonia Chiasson , P.C. Van Oorschot, Graphical passwords: Learning from the first twelve years, ACM Computing Surveys (CSUR), v.44 n.4, p.1-41, August 2012","paperID":"2333114"},{"content":"Brostoff, S. and Sasse, M. Are Passfaces more usable than passwords? A field trial investigation. In Proc. of HCI, (2000), 405--424.","paperID":"None"},{"content":"Bruce, V., Burton, M., and Dench, N. What's distinctive about a distinctive face? The Quarterly Journal of Experimental Psychology Section A 47, 1 (1994), 119--141.","paperID":"None"},{"content":"Sonia Chiasson , Alain Forget , Elizabeth Stobert , P. C. van Oorschot , Robert Biddle, Multiple password interference in text passwords and click-based graphical passwords, Proceedings of the 16th ACM conference on Computer and communications security, November 09-13, 2009, Chicago, Illinois, USA","paperID":"1653722"},{"content":"Clancy, S.M. and Hoyer, W.J. Age and skill in visual search. Developmental Psychology 30, 4 (1994), 545--552.","paperID":"None"},{"content":"Craik, F. and Jennings, J. Human Memory. In The Handbook of Aging and Cognition. 1992, 51--1","paperID":"None"},{"content":"Craik, F. and Bialystok, E. Cognition through the lifespan: mechanisms of change. Trends in Cognitive Sciences 10, 3 (2006), 131--138.","paperID":"None"},{"content":"Darren Davis , Fabian Monrose , Michael K. Reiter, On user choice in graphical password schemes, Proceedings of the 13th conference on USENIX Security Symposium, p.11-11, August 09-13, 2004, San Diego, CA","paperID":"1251386"},{"content":"Antonella De Angeli , Mike Coutts , Lynne Coventry , Graham I. Johnson , David Cameron , Martin H. Fischer, VIP: a visual approach to user authentication, Proceedings of the Working Conference on Advanced Visual Interfaces, May 22-24, 2002, Trento, Italy","paperID":"1556312"},{"content":"Derwinger, A., Stigsdotter Neely, A., MacDonald, S., and Bäckman, L. Forgetting numbers in old age: strategy and learning speed matter. Gerontology 51, 4 (2005), 277--84.","paperID":"None"},{"content":"Rachna Dhamija , Adrian Perrig, Déjà Vu: a user study using images for authentication, Proceedings of the 9th conference on USENIX Security Symposium, p.4-4, August 14-17, 2000, Denver, Colorado","paperID":"1251310"},{"content":"Ahmet Emir Dirik , Nasir Memon , Jean-Camille Birget, Modeling user choice in the PassPoints graphical password scheme, Proceedings of the 3rd symposium on Usable privacy and security, July 18-20, 2007, Pittsburgh, Pennsylvania","paperID":"1280684"},{"content":"Paul Dunphy , James Nicholson , Patrick Olivier, Securing passfaces for description, Proceedings of the 4th symposium on Usable privacy and security, July 23-25, 2008, Pittsburgh, Pennsylvania","paperID":"1408668"},{"content":"Ebner, N.C., Riediger, M., and Lindenberger, U. FACES--a database of facial expressions in young, middle-aged, and older women and men: development and validation. Behavior Research Methods 42, 1 (2010), 351--62.","paperID":"None"},{"content":"Katherine M. Everitt , Tanya Bragin , James Fogarty , Tadayoshi Kohno, A comprehensive study of frequency, interference, and training of multiple graphical passwords, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518837"},{"content":"David C. Feldmeier , Philip R. Karn, UNIX Password Security - Ten Years Later, Proceedings of the 9th Annual International Cryptology Conference on Advances in Cryptology, p.44-63, August 20-24, 1989","paperID":"704918"},{"content":"Ferris, S.H., Crook, T., Clark, E., McCarthy, M., and Rae, D. Facial recognition memory deficits in normal aging and senile dementia. Journal of Gerontology 35, 5 (1980), 707--14.","paperID":"None"},{"content":"T. A. Hart , B. S. Chaparro , C. G. Halcomb, Evaluating websites for older adults: adherence to 'senior-friendly' guidelines and end-user performance, Behaviour & Information Technology, v.27 n.3, p.191-199, May 2008","paperID":"1451131"},{"content":"Blake Ives , Kenneth R. Walsh , Helmut Schneider, The domino effect of password reuse, Communications of the ACM, v.47 n.4, p.75-78, April 2004","paperID":"975820"},{"content":"Kausler, D.H., Salthouse, T., and Saults, J.S. Temporal memory over the adult lifespan. The American Journal of Psychology 101, 2 (1988), 207--215.","paperID":"None"},{"content":"Lovén, J., Herlitz, A., and Rehnman, J. Women's own-gender bias in face recognition memory. Experimental Psychology 58, 4 (2011), 333--340.","paperID":"None"},{"content":"Meissner, C. a. and Brigham, J.C. Thirty years of investigating the own-race bias in memory for faces: A meta-analytic review. Psychology, Public Policy, and Law 7, 1 (2001), 3--35.","paperID":"None"},{"content":"Wendy Moncur , Grégory Leplâtre, Pictures at the ATM: exploring the usability of multiple graphical passwords, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240758"},{"content":"Naveh-Benjamin, M., Brav, T.K., and Levy, O. The associative memory deficit of older adults: the role of strategy utilization. Psychology and Aging 22, 1 (2007), 202--208.","paperID":"None"},{"content":"Naveh-Benjamin, M., Hussain, Z., Guez, J., and Bar-On, M. Adult age differences in episodic memory: further support for an associative-deficit hypothesis. Journal of Experimental Psychology: Learning, Memory, and Cognition 29, 5 (2003), 826--837.","paperID":"None"},{"content":"Nelson, D., Reed, V., and Walling, J. Pictorial superiority effect. Journal of Experimental Psychology: Human Learning and Memory 2, 5 (1976), 523--528.","paperID":"None"},{"content":"Paul C. Van Oorschot , Amirali Salehi-Abari , Julie Thorpe, Purely automated attacks on passpoints-style graphical passwords, IEEE Transactions on Information Forensics and Security, v.5 n.3, p.393-405, September 2010","paperID":"1861987"},{"content":"Park, D., Puglisi, J., and Smith, A. Memory for pictures: Does an age-related decline exist? Journal of Psychology and Aging 1, 1 (1986), 11--17.","paperID":"None"},{"content":"Park, D., Royal, D., Dudley, W., and Morrell, R. Forgetting of Pictures Over a Long Retention Interval. Psychology and Aging 3, 1 (1988), 94--95.","paperID":"None"},{"content":"Peach, S., Vorster, J., and Heerden, R. Van. Heuristic attacks against graphical password generators. 2010.","paperID":"None"},{"content":"Pike, G., Kemp, R., and Brace, N. The psychology of human face recognition. IEE Colloquium on Visual Biometrics, (2000), 11--17.","paperID":"None"},{"content":"Rasmussen, M. and Rudmin, F.W. The coming PIN code epidemic: A survey study of memory of numeric security codes. Electronic Journal of Applied Psychology 6, 2 (2010), 5--9v.","paperID":"None"},{"content":"Rhodes, M.G. and Anastasi, J.S. The own-age bias in face recognition: a meta-analytic and theoretical review. Psychological Bulletin 138, 1 (2012), 146--74.","paperID":"None"},{"content":"Julie Thorpe , P. C. van Oorschot, Human-seeded attacks and exploiting hot-spots in graphical passwords, Proceedings of 16th USENIX Security Symposium on USENIX Security Symposium, p.1-16, August 06-10, 2007, Boston, MA","paperID":"1362911"},{"content":"Valentine, T. An evaluation of the Passface personal authentication system. (Technical Report). London: Goldsmiths College University of London, (1998).","paperID":"None"},{"content":"Valentine, T. Memory for Passfaces after a long delay. (Technical Report). London: Goldsmiths College University of London, (1999).","paperID":"None"},{"content":"West, R.L., Crook, T.H., and Barron, K.L. Everyday memory performance across the life span: effects of age and noncognitive individual differences. Psychology and aging 7, 1 (1992), 72--82.","paperID":"None"},{"content":"Susan Wiedenbeck , Jim Waters , Jean-Camille Birget , Alex Brodskiy , Nasir Memon, PassPoints: design and longitudinal evaluation of a graphical password system, International Journal of Human-Computer Studies, v.63 n.1-2, p.102-127, July 2005","paperID":"1090418"}],"abstract":"Graphical authentication systems typically claim to be more usable than PIN or password-based systems, but these claims often follow limited, single-stage paradigm testing on a young, student population. We present a more demanding test paradigm in which multiple codes are learned and tested over a three-week period. We use this paradigm with two user populations, comparing the performance of younger and older adults. We first establish baseline performance in a study in which populations of younger and older adults learn PIN codes and we follow this with a second study in which younger and older adults use two face-based graphical authentication systems employing young faces vs. old faces as code components. As expected, older adults show relatively poor performance when compared to younger adults, irrespective of the authentication material, but this age-related deficit can be markedly reduced by the introduction of age-appropriate faces. We conclude firstly that this paradigm provides a good basis for the future evaluation of memory-based authentication systems and secondly that age-appropriate face-based authentication is viable in the security marketplace.","video":"http://www.youtube.com/embed/O4B9hdbZIkM?rel=0","title":"Age-related performance issues for PIN and face-based authentication systems","filename":"CHI13/p323","authors":["James Nicholson","Lynne Coventry","Pam Briggs"],"conference":"CHI '13"}