{"paperId":2470747,"citation":[{"content":"William Bares , Donald Schwartz, Film Ties: Crowd-sourced Teaching of Cinematography Using Intelligent Example Galleries, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2869088"},{"content":"Quentin Galvane , Rémi Ronfard , Christophe Lino , Marc Christie, Continuity editing for 3D animation, Proceedings of the Twenty-Ninth AAAI Conference on Artificial Intelligence, p.753-761, January 25-30, 2015, Austin, Texas","paperID":"2887112"},{"content":"Kristin Carlson , Thecla Schiphorst , Karen Cochrane , Jordon Phillips , Herbert H. Tsang , Tom Calvert, Moment by Moment: Creating Movement Sketches with Camera Stillframes, Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition, June 22-25, 2015, Glasgow, United Kingdom","paperID":"2757237"},{"content":"Joy Kim , Avi Bagla , Michael S. Bernstein, Designing Creativity Support Tools for Failure, Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition, June 22-25, 2015, Glasgow, United Kingdom","paperID":"2764542"}],"reference":[{"content":"Arijon, D. Grammar of the film language. Focal Press, Boston, 1976.","paperID":"None"},{"content":"Bardzell, J. Creativity in Amateur Multimedia: Popular Culture, Critical Theory, and HCI. Human Technology, 3, 1 (2007), 12--33.","paperID":"None"},{"content":"Beller, H. Handbuch der Filmmontage. Praxis und Prinzipien des Filmschnitts. Tr Verlagsunion, München, 1999.","paperID":"None"},{"content":"Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.","paperID":"None"},{"content":"Carroll, J. and Cameron, D. Machinima: Digital Performance and Emergent Authorship. In Proc. DiGRA 2005, (2005), 1--9.","paperID":"None"},{"content":"Csikszentmihalyi, M. (1999). Implications of a Systems Perspective for the Study of Creativity. In R. J. Sternberg (Ed.), Handbook of creativity (p. 313). Cambridge Univ Pr.","paperID":"None"},{"content":"Nicholas Davis , Boyang Li , Brian O'Neill , Mark Riedl , Michael Nitsche, Distributed creative cognition in digital filmmaking, Proceedings of the 8th ACM conference on Creativity and cognition, November 03-06, 2011, Atlanta, Georgia, USA","paperID":"2069654"},{"content":"Elson, D. K. and Riedl, M. O. A Lightweight Intelligent Virtual Cinematography System for Machinima Production. Proceedings of the 3rd Conference on Artificial Intelligence and Interactive Digital Entertainment.","paperID":"None"},{"content":"Fischer, G., Nakakoji, K., Ostwald, J., Stahl, G., and Sumner, T. Embedding critics in design environments. The Knowledge Engineering Review 8, 4 (2009), 285.","paperID":"None"},{"content":"Hayward, S. Cinema Studies: The Key Concepts. Routledge, London, 2000.","paperID":"None"},{"content":"Hugh Hancock , Johnnie Ingram, Machinima For Dummies: For Dummies Computer/Tech, For Dummies, 2007","paperID":"1543277"},{"content":"Ito, M. Machinima in a Fanvid Ecology. Journal of Visual Culture 10, 1 (2011), 51--54.","paperID":"None"},{"content":"Katz, S. D. Film Directing Cinematic Motion: A Workshop for Staging Scenes. Michael Wiese Productions, Studio City, 2004.","paperID":"None"},{"content":"Kindem, K. and Musburger, R. Introduction to Media Production: The Path to Digital Media Production. Focal Press, Burlington, 2009.","paperID":"None"},{"content":"Loiperdinger, M. Lumière's Arrival of the Train: Cinema's Founding Myth. The Moving Image, 4(1), 89--118.","paperID":"None"},{"content":"Henry Lowood , Michael Nitsche, The Machinima Reader, The MIT Press, 2011","paperID":"2000714"},{"content":"Todd Lubart, How can computers be partners in the creative process: classification and commentary on the special issue, International Journal of Human-Computer Studies, v.63 n.4-5, p.365-369, October 2005","paperID":"1140941"},{"content":"Marino, Paul. 3D Game-Based Filmmaking: The Art of Machinima. Scottsdale: ParaglyphAnderson, 2004.","paperID":"None"},{"content":"Nakakoji, K. Meanings of tools, support, and uses for creative design processes. In Proc. International Design Research Symposium (2006), 156--165.","paperID":"None"},{"content":"Oh, Y., Gross, M., and Do, E. Y.-L. Computer-Aided Critiquing Systems. In Proc. CAADRIA (Computer Aided Architectural Design Research in Asia), (2008), 161--167.","paperID":"None"},{"content":"Payne, M. T. Everything I Need to Know about Filmmaking I Learned from Playing Video Games: The Educational Promise of Machinima. In H. Lowood, M. Nitsche (Eds.) The Machinima Reader. The MIT Press, Cambridge, 2011, 241--256.","paperID":"None"},{"content":"Riedl, M. O. and O'Neill, B. Computer as audience: A strategy for artificial intelligence support of human creativity. In Proc. CHI Workshop of Computational Creativity Support, (2009).","paperID":"None"},{"content":"Salen, K. Arrested Development: Why Machinima Can't (or Shouldn't) Grow Up. The MIT Press, Cambridge, 2011.","paperID":"None"},{"content":"Ben Shneiderman, Creativity support tools: accelerating discovery and innovation, Communications of the ACM, v.50 n.12, p.20-32, December 2007","paperID":"1323689"}],"abstract":"Machinima is a new form of creative digital filmmaking that leverages the real time graphics rendering of computer game engines. Because of the low barrier to entry, machinima has become a popular creative medium for hobbyists and novices while still retaining borrowed conventions from professional filmmaking. Can novice machinima creators benefit from creativity support tools? A preliminary study shows novices generally have difficulty adhering to cinematographic conventions. We identify and document four cinematic conventions novices typically violate. We report on a Wizard-of-Oz study showing a rule-based intelligent system that can reduce the frequency of errors that novices make by providing information about rule violations without prescribing solutions. We discuss the role of error reduction in creativity support tools.","video":"http://www.youtube.com/embed/uxjNYOih7yM?rel=0","title":"Creativity support for novice digital filmmaking","filename":"CHI13/p651","authors":["Nicholas Davis","Alexander Zook","Brian O'Neill","Brandon Headrick","Mark Riedl","Ashton Grosz","Michael Nitsche"],"conference":"CHI '13"}