{"paperId":2470686,"reference":[{"content":"Patti Bao , Elizabeth Gerber , Darren Gergle , David Hoffman, Momentum: getting and staying on topic during a brainstorm, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753511"},{"content":"Michael S. Bernstein , Joel Brandt , Robert C. Miller , David R. Karger, Crowds in two seconds: enabling realtime crowd-powered interfaces, Proceedings of the 24th annual ACM symposium on User interface software and technology, October 16-19, 2011, Santa Barbara, California, USA","paperID":"2047201"},{"content":"Hugh Beyer, Contextual Design: Defining Customer-Centered Systems, Morgan Kaufmann Publishers Inc., San Francisco, CA, 1997","paperID":"523184"},{"content":"Blumenfeld, P., Soloway, E., Marx, R., Krajcik, J., Guzdial, M., and Palincsar, A. Motivating Project-Based Learning: Sustaining the Doing, Supporting the Learning. Educational Psychologist 26, 3 (1991), 369--398.","paperID":"None"},{"content":"Chandler, D. and Kapelner, A. Breaking monotony with meaning: Motivation in crowdsourcing markets. University of Chicago mimeo, (2010).","paperID":"None"},{"content":"Collins, A., Brown, J., & Holum, A. Cognitive Apprenticeship: Making Thinking Visible. American Educator, 6--46.","paperID":"None"},{"content":"Cynthia J. Atman, D. K. Characterizing design learning: A mixed-methods study of engineering designers' use of language. (2008).","paperID":"None"},{"content":"Scott Davidoff , Min Kyung Lee , Anind K. Dey , John Zimmerman, Rapidly exploring application design through speed dating, Proceedings of the 9th international conference on Ubiquitous computing, p.429-446, September 16-19, 2007, Innsbruck, Austria","paperID":"1771617"},{"content":"Steven Dow , Anand Kulkarni , Scott Klemmer , Björn Hartmann, Shepherding the crowd yields better work, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145355"},{"content":"Dym, C. L., Agogino, A. M., Frey, D. D., and Leifer, L. J. Engineering Design Thinking, Teaching, and Learning. Journal of Engineering Education 94, (2005), 103--120.","paperID":"None"},{"content":"Fixson, S. K. Teaching Innovation through Interdisciplinary Courses and Programmes in Product Design and Development: An Analysis at 16 US Schools. Creativity and Innovation Management 18, 3 (2009), 199--208.","paperID":"None"},{"content":"George, J. M. 9 Creativity in Organizations. The Academy of Management Annals 1, 1 (2007), 439--477.","paperID":"None"},{"content":"Gerber, E., Olson, J. M., and Komarek, R. Extracurricular Design-Based Learning. International Journal of Engineering Education 28, 2 (2012).","paperID":"None"},{"content":"Jeffrey Heer , Michael Bostock, Crowdsourcing graphical perception: using mechanical turk to assess visualization design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753357"},{"content":"Jeff Howe, Crowdsourcing: Why the Power of the Crowd Is Driving the Future of Business, Crown Publishing Group, New York, NY, 2008","paperID":"1481457"},{"content":"Panagiotis G. Ipeirotis, Analyzing the Amazon Mechanical Turk marketplace, XRDS: Crossroads, The ACM Magazine for Students, v.17 n.2, Winter 2010","paperID":"1869094"},{"content":"Aniket Kittur , Ed H. Chi , Bongwon Suh, Crowdsourcing user studies with Mechanical Turk, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357127"},{"content":"Ron Kohavi , Randal M. Henne , Dan Sommerfield, Practical guide to controlled experiments on the web: listen to your customers not to the hippo, Proceedings of the 13th ACM SIGKDD international conference on Knowledge discovery and data mining, August 12-15, 2007, San Jose, California, USA","paperID":"1281295"},{"content":"Kolko, J. Abductive Thinking and Sensemaking: The Drivers of Design Synthesis. Design Issues 26, 1 (2011), 15--28.","paperID":"None"},{"content":"Kolodner, J., Hmelo, C. E., and Narayanan, N. H. Learning by Design™ from Theory to Practice. In Proc of Intl Conference of the Learning Sciences, (1998), 16--22.","paperID":"None"},{"content":"Kuratko, D. F. The Emergence of Entrepreneurship Education: Development, Trends, and Challenges. Entrepreneurship Theory and Practice 29, 5 (2005), 577--598.","paperID":"None"},{"content":"Sheena Lewis , Mira Dontcheva , Elizabeth Gerber, Affective computational priming and creativity, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979048"},{"content":"Lewitt, T. Creativity Is Not Enough. Harvard Business Review, 2002.","paperID":"None"},{"content":"Mckenna, A. F., Colgate, J. E., Carr, S. H., and Olson, G. B. IDEA: Formalizing the Foundation for an Engineering Design Education. International Journal of Engineering Education 22, 3 (2006), 671--678.","paperID":"None"},{"content":"Miron, E., Erez, M., and Naveh, E. Do personal characteristics and cultural values that promote innovation, quality, and efficiency compete or complement each other? Journal of Organizational Behavior 25, 2 (2004), 175--199.","paperID":"None"},{"content":"Osborn, A. F. Applied Imagination: Principles and Procedures of Creative Problem Solving. Charles Scribner's Sons, 1963.","paperID":"None"},{"content":"Peterman, N. E. and Kennedy, J. Enterprise Education: Influencing Students' Perceptions of Entrepreneurship. Entrepreneurship Theory and Practice 28, 2 (2003), 129--144.","paperID":"None"},{"content":"Plaschka, G. and Welsch, H. Emerging Structures in Entrepreneurship Education: Curricular Designs and Strategies. SSRN eLibrary, (1990).","paperID":"None"},{"content":"Ross, J., Irani, L., Silberman, M. S., Zaldivar, A., and Tomlinson, B. Who are the crowdworkers? In extended abstracts on Human Factors in Computing Systems, (2010).","paperID":"None"},{"content":"David Williamson Shaffer , Mitchel Resnick, “Thick” authenticity: new media and authentic learning, Journal of Interactive Learning Research, v.10 n.2, p.195-215, Dec. 1999","paperID":"325387"},{"content":"Siroker, D. How Obama Raised $60 Million by Running a Simple Experiment. 2010. http://blog.optimizely.com/howobama-raised-60-million-by-running-an-exp.","paperID":"None"},{"content":"Sternberg, R. J. Handbook of Creativity. Cambridge University Press, 1998.","paperID":"None"},{"content":"Strauss, A. C. and Corbin, J. M. Grounded Theory in Practice. Sage Publications, Inc, 1997.","paperID":"None"},{"content":"Terwiesch, C. and Ulrich, K. Innovation Tournaments: Creating and Selecting Exceptional Opportunities. Harvard Business Press, 2009.","paperID":"None"},{"content":"Thomke, S. H. Experimentation Matters: Unlocking the Potential of New Technologies for Innovation. Harvard Business Press, 2003.","paperID":"None"},{"content":"Tidbell, B., Mulder, I., and Stappers, P. J. Online Design Contests: A Network of Inspiration for Designers. (2011).","paperID":"None"},{"content":"Hao-Chuan Wang , Dan Cosley , Susan R. Fussell, Idea expander: supporting group brainstorming with conversationally triggered visual thinking stimuli, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718938"},{"content":"Westerberg, C. and Wickersham, C. Internships Have Value, Whether or Not Students Are Paid. The Chronicle of Higher Education, 2011.","paperID":"None"},{"content":"Anbang Xu , Brian P. Bailey, A crowdsourcing model for receiving design critique, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979745"},{"content":"Lixiu Yu , Jeffrey V. Nickerson, Cooks or cobblers?: crowd creativity through combination, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979147"},{"content":"Innocentive. www.innocentive.com.","paperID":"None"},{"content":"oDesk. https://www.odesk.com.","paperID":"None"},{"content":"99designs: http://99designs.com/.","paperID":"None"},{"content":"Crowdspring. www.crowdspring.com.","paperID":"None"},{"content":"Optimizely. www.optimizely.com.","paperID":"None"},{"content":"Indiegogo. www.indiegogo.com.","paperID":"None"},{"content":"Facebook. www.facebook.com.","paperID":"None"},{"content":"Google Ad Words. https://adwords.google.com.","paperID":"None"},{"content":"Coffee Joulies on Kickstarter. http://www.kickstarter.com/projects/705847536/coffeejoulies-your-coffee-just-right.","paperID":"None"},{"content":"Open Innovation. www.openinnovation.net.","paperID":"None"},{"content":"Case Study. http://en.wikipedia.org/wiki/Case_study.","paperID":"None"},{"content":"Coursera. www.coursera.org.","paperID":"None"},{"content":"Stanford Technology Ventures. http://stvp.stanford.edu/.","paperID":"None"},{"content":"FIRST Robotics Competition. www.pittsburghfirst.org/.","paperID":"None"},{"content":"Solar Car Teams. http://en.wikipedia.org/wiki/List_of_solar_car_teams.","paperID":"None"},{"content":"Tartan Hacks. www.tartanhacks.com.","paperID":"None"},{"content":"Newgrounds. http://www.newgrounds.com/.","paperID":"None"},{"content":"MindSwarms. www.mindswarms.com.","paperID":"None"},{"content":"Qualtrics. www.qualtrics.com.","paperID":"None"},{"content":"IndieGoGo blog. http://www.indiegogo.com/blog/.","paperID":"None"}],"citation":[{"content":"Kurt Luther , Amy Pavel , Wei Wu , Jari-lee Tolentino , Maneesh Agrawala , Björn Hartmann , Steven P. Dow, CrowdCrit: crowdsourcing and aggregating visual design critique, Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2556788"},{"content":"Federico Domínguez , Katherine Chiluiza , Vanessa Echeverria , Xavier Ochoa, Multimodal Selfies: Designing a Multimodal Recording Device for Students in Traditional Classrooms, Proceedings of the 2015 ACM on International Conference on Multimodal Interaction, November 09-13, 2015, Seattle, Washington, USA","paperID":"2830606"},{"content":"David A. Robb , Stefano Padilla , Britta Kalkreuter , Mike J. Chantler, Moodsource: Enabling Perceptual and Emotional Feedback from Crowds, Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2702676"},{"content":"Anbang Xu , Shih-Wen Huang , Brian Bailey, Voyant: generating structured feedback on visual designs using a crowd of non-experts, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531604"},{"content":"Kurt Luther , Jari-Lee Tolentino , Wei Wu , Amy Pavel , Brian P. Bailey , Maneesh Agrawala , Björn Hartmann , Steven P. Dow, Structuring, Aggregating, and Evaluating Crowdsourced Design Critique, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675283"},{"content":"Alvin Yuan , Kurt Luther , Markus Krause , Sophie Isabel Vennix , Steven P Dow , Bjorn Hartmann, Almost an Expert: The Effects of Rubrics and Expertise on Perceived Value of Crowdsourced Design Critiques, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819953"},{"content":"Julie S. Hui , Elizabeth M. Gerber , Steven P. Dow, Crowd-based design activities: helping students connect with users online, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598538"},{"content":"Emily Harburg , Julie Hui , Michael Greenberg , Elizabeth M. Gerber, Understanding the Effects of Crowdfunding on Entrepreneurial Self-Efficacy, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675142"},{"content":"Anbang Xu , Huaming Rao , Steven P. Dow , Brian P. Bailey, A Classroom Study of Using Crowd Feedback in the Iterative Design Process, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675140"},{"content":"Xiaojuan Ma , Li Yu , Jodi L. Forlizzi , Steven P. Dow, Exiting the Design Studio: Leveraging Online Participants for Early-Stage Design Feedback, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675174"}],"abstract":"Industry relies on higher education to prepare students for careers in innovation. Fulfilling this obligation is especially difficult in classroom settings, which often lack authentic interaction with the outside world. Online crowdsourcing has the potential to change this. Our research explores if and how online crowds can support student learning in the classroom. We explore how scalable, diverse, immediate (and often ambiguous and conflicting) input from online crowds affects student learning and motivation for project-based innovation work. In a pilot study with three classrooms, we explore interactions with the crowd at four key stages of the innovation process: needfinding, ideating, testing, and pitching. Students reported that online crowds helped them quickly and inexpensively identify needs and uncover issues with early-stage prototypes, although they favored face-to-face interactions for more contextual feed-back. We share early evidence and discuss implications for creating a socio-technical infrastructure to more effectively use crowdsourcing in education.","video":"http://www.youtube.com/embed/ymAMF4WMVCU?rel=0","title":"A pilot study of using crowds in the classroom","filename":"CHI13/p227","authors":["Steven Dow","Elizabeth Gerber","Audris Wong"],"conference":"CHI '13"}