{"paperId":2470749,"citation":[{"content":"Larissa Pschetz , Koji Yatani , Darren Edge, TurningPoint: narrative-driven presentation planning, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557389"},{"content":"Ha Trinh , Lazlo Ring , Timothy Bickmore, DynamicDuo: Co-presenting with Virtual Agents, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702584"},{"content":"Bahador Saket , Sijie Yang , Hong Tan , Koji Yatani , Darren Edge, TalkZones: section-based time support for presentations, Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, September 23-26, 2014, Toronto, ON, Canada","paperID":"2628399"},{"content":"Pei-Yu Chi , Bongshin Lee , Steven M. Drucker, DemoWiz: re-performing software demonstrations for a live presentation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557254"},{"content":"Ha Trinh , Koji Yatani , Darren Edge, PitchPerfect: integrated rehearsal environment for structured presentation preparation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557286"},{"content":"Fabian Hemmert , Gesche Joost, On the Other Hand: Embodied Metaphors for Interactions with Mnemonic Objects in Live Presentations, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2839470"}],"reference":[{"content":"Apple Keynote. http://www.apple.com/iwork/keynote/","paperID":"None"},{"content":"Agile Manifesto. http://agilemanifesto.org/principles.html","paperID":"None"},{"content":"Aristotle (1954). Rhetoric. W. Rhys Roberts translation. http://rhetoric.eserver.org/aristotle/","paperID":"None"},{"content":"Beamer. http://en.wikibooks.org/wiki/LaTeX/Presentations","paperID":"None"},{"content":"Ben B. Bederson , Larry Stead , James D. Hollan, Pad++: advances in multiscale interfaces, Conference Companion on Human Factors in Computing Systems, p.315-316, April 24-28, 1994, Boston, Massachusetts, USA","paperID":"260379"},{"content":"Carnegie, D. (1962). The Quick and Easy Way to Effective Speaking: Modern Techniques for Dynamic Communication. Pocket Books.","paperID":"None"},{"content":"Carpenter, S. K., Pashler, H. & Vul, E. (2006). What types of learning are enhanced by a cued recall test? Psychonomic Bulletin & Review, 13(5), 826--830.","paperID":"None"},{"content":"Charmaz, K. (2006). Constructing Grounded Theory: A Practical Guide through Qualitative Analysis. Sage.","paperID":"None"},{"content":"Cicero (1888). De Inventione. C. D. Yonge translation. http://www.classicpersuasion.org/pw/cicero/dnvindex.htm","paperID":"None"},{"content":"Nancy Duarte, Slide: ology: the art and science of creating great presentations, O'Reilly & Associates, Inc., Sebastopol, CA, 2008","paperID":"1461418"},{"content":"Duarte, N. (2010). Resonate: Present Visual Stories that Transform Audiences. Wiley.","paperID":"None"},{"content":"Darren Edge , Elly Searle , Kevin Chiu , Jing Zhao , James A. Landay, MicroMandarin: mobile language learning in context, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979413"},{"content":"Adam Fourney , Michael Terry , Richard Mann, Gesturing in the wild: understanding the effects and implications of gesture-based interaction for dynamic presentations, Proceedings of the 24th BCS Interaction Specialist Group Conference, September 06-10, 2010, Dundee, United Kingdom","paperID":"2146338"},{"content":"Gallo, C. (2010). The Presentation Secrets of Steve Jobs: How to be Insanely Great in Front of Any Audience. McGraw Hill.","paperID":"None"},{"content":"Lance Good , Benjamin B. Bederson, Zoomable user interfaces as a medium for slide show presentations, Information Visualization, v.1 n.1, p.35-49, March 2002","paperID":"941236"},{"content":"Google Docs Presentations. http://www.google.com/google-d-s/presentations","paperID":"None"},{"content":"Haiku deck. http://www.haikudeck.com/","paperID":"None"},{"content":"Impress.js. http://bartaz.github.com/impress.js/","paperID":"None"},{"content":"Shamsi T. Iqbal , Jonathan Grudin , Eric Horvitz, Peripheral computing during presentations: perspectives on costs and preferences, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979073"},{"content":"Kazutaka Kurihara , Masataka Goto , Jun Ogata , Yosuke Matsusaka , Takeo Igarashi, Presentation sensei: a presentation training system using speech and image processing, Proceedings of the 9th international conference on Multimodal interfaces, November 12-15, 2007, Nagoya, Aichi, Japan","paperID":"1322256"},{"content":"Joel Lanir , Kellogg S. Booth , Leah Findlater, Observing presenters' use of visual aids to inform the design of classroom presentation software, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357165"},{"content":"Levasseur, D. G. & Sawyer, J. K. (2006). Pedagogy Meets PowerPoint: A Research Review of the Effects of Computer-Generated Slides in the Classroom. The Review of Communication, vol. 6(1), 101--123.","paperID":"None"},{"content":"Leonhard Lichtschlag , Thomas Hess , Thorsten Karrer , Jan Borchers, Fly: studying recall, macrostructure understanding, and user experience of canvas presentations, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208586"},{"content":"Leonhard Lichtschlag , Thomas Hess , Thorsten Karrer , Jan Borchers, Canvas presentations in the wild, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2212828"},{"content":"Leonhard Lichtschlag , Thorsten Karrer , Jan Borchers, Fly: a tool to author planar presentations, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518786"},{"content":"Mayer, R. E. (1997). Multimedia Learning: Are we asking the right questions? Educational Psychologist, 32(1), 1--19.","paperID":"None"},{"content":"Mayer, R. E. & Moreno, R. (2003). Nine Ways to Reduce Cognitive Load in Multimedia Learning. Educational Psychologist, 38(1), 43--52.","paperID":"None"},{"content":"Richard E. Mayer, Multimedia Learning, Cambridge University Press, New York, NY, 2001","paperID":"516736"},{"content":"Microsoft PowerPoint. http://office.microsoft.com/enus/powerpoint","paperID":"None"},{"content":"Moscovich, T., Scholz, K., Hughes, J. F. & Salesin, D. H. (2003). Customizable Presentations. ICMI'03.","paperID":"None"},{"content":"Les Nelson , Satoshi Ichimura , Elin Rønby Pedersen , Lia Adams, Palette: a paper interface for giving presentations, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.354-361, May 15-20, 1999, Pittsburgh, Pennsylvania, USA","paperID":"303109"},{"content":"Nelson, D. L., Reed, U. S., & Walling, J. R. (1976). Pictorial superiority effect. Journal of Experimental Psychology: Human Learning & Memory, 2, 523--528.","paperID":"None"},{"content":"Norman, D. In defense of PowerPoint. (2004). http://www.jnd.org/dn.mss/in_defense_of_p.html","paperID":"None"},{"content":"Open XML SDK 2.0 for Microsoft Office. http://msdn.microsoft.com/en-us/library/office/bb448854.aspx","paperID":"None"},{"content":"Paivio, A. (1990). Mental Representations: A Dual Coding Approach. Oxford University Press.","paperID":"None"},{"content":"Panjawi, S., Samdaria, N., Gupta, A., Cutrell, E. & Toyama, K. (2010). Collage: A Presentation Tool for School Teachers. ICTD'10.","paperID":"None"},{"content":"Parker, I. (2001). Absolute PowerPoint: Can a software package edit our thoughts? The New Yorker.","paperID":"None"},{"content":"Pecha Kucha 20 #215; 20 = 6:40. http://pecha-kucha.org/","paperID":"None"},{"content":"pptPlex PowerPoint add-in. http://www.microsoft.com/enus/download/details.aspx?id=28558","paperID":"None"},{"content":"Prezi. http://prezi.com/","paperID":"None"},{"content":"Reynolds, G. (2012). Presentation Zen: Simple Ideas on Presentation Design and Delivery. New Riders.","paperID":"None"},{"content":"Beat Signer , Moira C. Norrie, PaperPoint: a paper-based presentation and interactive paper prototyping tool, Proceedings of the 1st international conference on Tangible and embedded interaction, February 15-17, 2007, Baton Rouge, Louisiana","paperID":"1226981"},{"content":"SlideShare. http://www.slideshare.net","paperID":"None"},{"content":"Slidy. http://www.w3.org/Talks/Tools/Slidy2/","paperID":"None"},{"content":"Ryan Spicer , Yu-Ru Lin , Aisling Kelliher , Hari Sundaram, NextSlidePlease: Authoring and delivering agile multimedia presentations, ACM Transactions on Multimedia Computing, Communications, and Applications (TOMCCAP), v.8 n.4, p.1-20, November 2012","paperID":"2379795"},{"content":"Sweller, J. (1988). Cognitive load during problem solving: Effects on learning. Cognitive Science, 12(2), 257--285.","paperID":"None"},{"content":"Jaime Teevan , Daniel Liebling , Ann Paradiso , Carlos Garcia Jurado Suarez , Curtis von Veh , Darren Gehring, Displaying mobile feedback during a presentation, Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services, September 21-24, 2012, San Francisco, California, USA","paperID":"2371633"},{"content":"Edward R. Tufte, The Cognitive Style of PowerPoint: Pitching Out Corrupts Within, Second Edition, Graphis Pr, 2006","paperID":"1213581"},{"content":"Jerry Weissman, Presenting to Win: The Art of Telling Your Story, FT Press, 2003","paperID":"1238043"},{"content":"Weissman, J. (2009). The Power Presenter: Technique, Style, and Strategy from America's Top Speaking Coach. Wiley.","paperID":"None"},{"content":"Wozniak, P. A. & Gorzelanczyk, E. J. (1994). Optimization of repetition spacing in the practice of learning. Acta Neurobiologiae Experimentalis, 54.","paperID":"None"},{"content":"Douglas Earl Zongker , David H. Salesin, Creating animation for presentations, University of Washington, 2003","paperID":"959776"}],"abstract":"Presentations are a crucial form of modern communication, yet there is a dissonance between everyday practices with presentation tools and best practices from the presentation literature. We conducted a grounded theory study to gain a better understanding of the activity of presenting, discovering the potential for a more dynamic, automated, and story-centered approach to prototyping slide presentations that are themselves dynamic in their ability to help presenters rehearse and deliver their story. Our prototype tool for dynamic presentation prototyping, which we call HyperSlides, uses a simple markup language for the creation of hierarchically structured scenes, which are algorithmically transformed into hyperlinked slides of a consistent and minimalist style. Our evaluation suggests that HyperSlides helps idea organization, saves authoring time, creates aesthetic layouts, and supports more flexible rehearsal and delivery than linear slides, at the expense of reduced layout control and increased navigation demands.","video":"http://www.youtube.com/embed/nPjeU0wV698?rel=0","title":"HyperSlides: dynamic presentation prototyping","filename":"CHI13/p671","authors":["Darren Edge","Joan Savage","Koji Yatani"],"conference":"CHI '13"}