{"paperId":2470721,"reference":[{"content":"Asher, J. J. (1969). The Total Physical Response Approach to Second Language Learning. Modern Language Journal, 53(1).","paperID":"None"},{"content":"Cepeda, N. J., Pashler, H., Vul, E. & Wixted, J. T. (2006). Distributed Practice in Verbal Recall Tasks: A Review and Quantitative Synthesis. Psychological Bulletin, 132(5).","paperID":"None"},{"content":"Dourish, P. (2004). Where the Action Is: The Foundations of Embodied Interaction. Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Engelkamp, J. & Cohen, R. L. (1991). Current issues in memory of action events. Psych. Research, 53, 175--182.","paperID":"None"},{"content":"Frick-Horbury, D. (2002). The use of hand gestures as self-generated cues for recall of verbally associated targets. American Journal of Psychology, 115(1), 1--20.","paperID":"None"},{"content":"Gullberg, M. (2008). Gestures and Second Language Acquisition. In P. Robinson & N. C. Ellis (Eds.) Handbook of Cognitive Linguistics and Second Language Acquisition. New York: Routledge.","paperID":"None"},{"content":"Mark Howison , Dragan Trninic , Daniel Reinholz , Dor Abrahamson, The mathematical imagery trainer: from embodied interaction to conceptual learning, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979230"},{"content":"Kendon, A. (1972). Some relationships between body motion and speech. In A. W. Siegman & B. Pope (Eds.), Studies in dyadic communication, 177--210, New York: Permagon.","paperID":"None"},{"content":"Kita, S. (2000). How representational gestures help speaking. In D. McNeill (Ed.), Language and gesture, 162--185, Cambridge, UK: Cambridge University Press.","paperID":"None"},{"content":"Lakoff, G. (1987). Women, Fire, and Dangerous Things: What Categories Reveal about the Mind. Chicago: University of Chicago Press.","paperID":"None"},{"content":"Conor Linehan , Ben Kirman , Shaun Lawson , Gail Chan, Practical, appropriate, empirically-validated guidelines for designing educational games, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979229"},{"content":"McNeill, D. (2005). Gesture and Thought. Chicago: University of Chicago Press.","paperID":"None"},{"content":"Pashler, H., McDaniel, M., Rohrer, D. & Bjork, R. Learning Styles: Concepts and Evidence. Psychological Science in the Public Interest, December 2008, 9(3), 105--119.","paperID":"None"}],"citation":[{"content":"Laura Malinverni , Edith Ackermann , Narcis Pares, Experience as an Object to Think with: from Sensing-in-action to Making-Sense of action in Full-Body Interaction Learning Environments, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2839477"},{"content":"Felicia Clare Paul , Christabel Goh , Kelly Yap, Get Creative With Learning: Word Out! A Full Body Interactive Game, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2728657"},{"content":"Kelly Yap , Clement Zheng , Angela Tay , Ching-Chiuan Yen , Ellen Yi-Luen Do, Word out!: learning the alphabet through full body interactions, Proceedings of the 6th Augmented Human International Conference, p.101-108, March 09-11, 2015, Singapore, Singapore","paperID":"2735789"},{"content":"Marcus Carter , John Downs , Bjorn Nansen , Mitchell Harrop , Martin Gibbs, Paradigms of games research in HCI: a review of 10 years of research at CHI, Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play, October 19-21, 2014, Toronto, Ontario, Canada","paperID":"2658708"}],"abstract":"Games that engage both mind and body by targeting users' kinesthetic intelligence have the potential to transform the activity of learning across a wide variety of domains. To investigate this potential in the context of second language learning, we have developed SpatialEase: a Kinect game for the body-based learning of language that is grounded in space and motion. In this game, learners respond to audio commands in the second language by moving their bodies in space, while a game mechanic based on distributed cued-recall supports learning over time. Our comparison of SpatialEase with the popular Rosetta Stone software for learner of Mandarin Chinese showed similar learning gains over a single session and generated several key implications for the future design of mixed-modality learning systems.","video":"http://www.youtube.com/embed/2tzRAkGgOLQ?rel=0","title":"SpatialEase: learning language through body motion","filename":"CHI13/p469","authors":["Darren Edge","Kai-Yin Cheng","Michael Whitney"],"conference":"CHI '13"}