{"paperId":2470657,"citation":[{"content":"Erin Brady, Getting fast, free, and anonymous answers to questions asked by people with visual impairments, ACM SIGACCESS Accessibility and Computing","paperID":"2809918"},{"content":"Jeffrey M. Rzeszotarski , Emma S. Spiro , Jorge Nathan Matias , Andrés Monroy-Hernández , Meredith Ringel Morris, Is anyone out there?: unpacking Q&A hashtags on twitter, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557175"},{"content":"Meredith Ringel Morris , Kori Inkpen , Gina Venolia, Remote shopping advice: enhancing in-store shopping with social technologies, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531707"},{"content":"Jeffrey M. Rzeszotarski , Meredith Ringel Morris, Estimating the social costs of friendsourcing, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557181"},{"content":"Julie S. Hui , Elizabeth M. Gerber , Darren Gergle, Understanding and leveraging social networks for crowdfunding: opportunities and challenges, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598539"},{"content":"Julie S. Hui , Elizabeth M. Gerber , Steven P. Dow, Crowd-based design activities: helping students connect with users online, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598538"},{"content":"Jerzy Surma, Social exchange in online social networks. The reciprocity phenomenon on Facebook, Computer Communications, v.73 n.PB, p.342-346, January 2016","paperID":"2873103"},{"content":"Hyun Jung Oh , Robert LaRose, Impression management concerns and support-seeking behavior on social network sites, Computers in Human Behavior, v.57 n.C, p.38-47, April 2016","paperID":"2895001"}],"abstract":"Past research has demonstrated a link between perceptions of social capital and use of the popular social network site, Facebook. Williams' Internet Social Capital Scales, based on Putnam's formulation, tap into sub-dimensions of social capital that have not been broadly used yet may enlighten our understanding of the different ways in which connecting with others online can facilitate access to resources embedded within our social relationships. In this study, we segment Williams' Internet Social Capital Scales into various sub-dimensions using factor analysis and explicate the distinct facets of social capital through a lab experiment in which Facebook users (N=98) request a small favor from their Facebook network. We find that some sub-dimensions play a significant role in getting favors from Facebook friends while bonding and bridging social capital do not significantly predict responses to favor requests.","reference":[{"content":"Andrew Besmer , Heather Richter Lipford , Mohamed Shehab , Gorrell Cheek, Social applications: exploring a more secure framework, Proceedings of the 5th Symposium on Usable Privacy and Security, July 15-17, 2009, Mountain View, California","paperID":"1572535"},{"content":"Bosworth, A. News feed is a robot Facebook Blog, 2007.","paperID":"None"},{"content":"Bourdieu, P. The forms of capital. in Richardson, J. G. ed. Handbook of theory and research for the sociology of education Greenwood, New York, 1986, 241--258.","paperID":"None"},{"content":"Burke, M., Joyce, E., Kim, T., Anand, V. and Kraut, R. Introductions and requests: Rhetorical strategies that elicit response in online communities. Third International Conference on Communities and Technologies., 2007.","paperID":"None"},{"content":"Moira Burke , Robert Kraut , Cameron Marlow, Social capital on facebook: differentiating uses and users, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979023"},{"content":"Moira Burke , Cameron Marlow , Thomas Lento, Social network activity and social well-being, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753613"},{"content":"Burt, R. S. Neighbor networks: Competitive advantage local and personal. Oxford University Press, Oxford, 2009.","paperID":"None"},{"content":"Coleman, J. S. Social capital in the creation of human capital. The American Journal of Sociology, 94. 95--120.","paperID":"None"},{"content":"Donath, J. S. Signals in social supernets. Journal of Computer-Mediated Communication, 13. 231--251.","paperID":"None"},{"content":"Ellison, N., Steinfield, C. and Lampe, C. Connection Strategies: Social capital implications of Facebook-enabled communication practices. New Media & Society.","paperID":"None"},{"content":"Ellison, N., Vitak, J., Gray, R., Lampe, C. and Brooks, B. Cultivating Social Resources on Facebook: Signals of Relational Investment and their Role in Social Capital Processes iCS-OII 2011 \"A Decade in Internet Time\" Symposium. Oxford, UK, 2011.","paperID":"None"},{"content":"Ferlander, S. The importance of different forms of social capital for health. Acta Sociologica, 50 (2). 115--128.","paperID":"None"},{"content":"Kobayashi, T. Bridging social capital in online communities: Heterogeneity and social tolerance of online game players in Japan. Human Communication Research, 36 (4). 546--569.","paperID":"None"},{"content":"Cliff A.C. Lampe , Nicole Ellison , Charles Steinfield, A familiar face(book): profile elements as signals in an online social network, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240695"},{"content":"Cliff Lampe , Jessica Vitak , Rebecca Gray , Nicole Ellison, Perceptions of facebook's value as an information source, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208739"},{"content":"Lin, N., Cook, K. S. and Burt, R. S. Social capital : theory and research. Aldine de Gruyter, New York, 2001.","paperID":"None"},{"content":"Ling, K., Beenen, G., Ludford, P., Wang, X., Chang, K., Li, X., Cosley, D., Frankowski, D., Terveen, L., Rashid, A. M., Resnick, P. and Kraut, R. Using social psychology to motivate contributions to online communities. Journal of Computer-Mediated Communication, 10 (4).","paperID":"None"},{"content":"Meredith Ringel Morris , Jaime Teevan , Katrina Panovich, What do people ask their social networks, and why?: a survey study of status message q&a behavior, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753587"},{"content":"Katherine Panciera , Reid Priedhorsky , Thomas Erickson , Loren Terveen, Lurking? cyclopaths?: a quantitative lifecycle analysis of user behavior in a geowiki, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753615"},{"content":"Papacharissi, Z. and Mendelson, A. Toward a new(er) sociability: Uses, gratifications and social capital on Facebook. in Papathanassopoulos, S. ed. Media perspectives for the 21st century, Routledge, New Tork, 2011, 212--230.","paperID":"None"},{"content":"Portes, A. Social capital: Its origins and applications in modern sociology. Annual Review of Sociology, 22. 124.","paperID":"None"},{"content":"Putnam, R. Bowling alone: The collapse and revival of American community. Simon & Schuster, New York, 2000.","paperID":"None"},{"content":"Paul Resnick , Tora Bikson , Elizabeth Mynatt , Robert Puttnam , Lee Sproull , Barry Wellman, Beyond bowling together, Proceedings of the 2000 ACM conference on Computer supported cooperative work, p.363, December 2000, Philadelphia, Pennsylvania, USA","paperID":"362079"},{"content":"Andrew D. Smock , Nicole B. Ellison , Cliff Lampe , Donghee Yvette Wohn, Facebook as a toolkit: A uses and gratification approach to unbundling feature use, Computers in Human Behavior, v.27 n.6, p.2322-2329, November, 2011","paperID":"2030892"},{"content":"Michael A. Stefanone , Kyounghee Hazel Kwon , Derek Lackaff, Exploring the relationship between perceptions of social capital and enacted support online, Journal of Computer-Mediated Communication, v.17 n.4, p.451-466, July 2012","paperID":"2344826"},{"content":"Charles Steinfield , Joan M. DiMicco , Nicole B. Ellison , Cliff Lampe, Bowling online: social networking and social capital within the organization, Proceedings of the fourth international conference on Communities and technologies, June 25-27, 2009, University Park, PA, USA","paperID":"1556496"},{"content":"Steinfield, C., Ellison, N. B. and Lampe, C. Social capital, self-esteem, and use of online social network sites: A longitudinal analysis. Journal of Applied Developmental Psychology, 29. 434--445.","paperID":"None"},{"content":"Barbara G. Tabachnick , Linda S. Fidell, Using Multivariate Statistics (5th Edition), Allyn  & Bacon, Inc., Needham Heights, MA, 2006","paperID":"1213888"},{"content":"Teevan, J., Morris, M. R. and Panovich, K. Factors Affecting Response Quantity, Quality, and Speed for Questions asked via Social Network Status Messages. ICWSM, 2011.","paperID":"None"},{"content":"Trochim, W. The research methods knowledge base. Cornell University Press, New York, 2001.","paperID":"None"},{"content":"Valenzuela, S., Park, N. and Kee, K. Is there social capital in a social network site?: Facebook use and college students' life satisfaction, trust, and participation. Journal of Computer-Mediated Communication, 14. 875--901.","paperID":"None"},{"content":"Williams, D. The impact of time online: Social capital and cyberbalkanization. CyberPsychology & Behavior, 10 (3). 398--406.","paperID":"None"},{"content":"Williams, D. On and off the 'Net: Scales for social capital in an online era. Journal of Computer-Mediated Communication, 11. 593--628.","paperID":"None"},{"content":"Yang, Z. L., and Peterson, R. T. Customer Perceived Value, Satisfaction, and Loyalty: The Role of Switching Costs, Psychology and Marketing, 21(10). 799--822.","paperID":"None"}],"title":"Favors from facebook friends: unpacking dimensions of social capital","filename":"CHI13/p11","authors":["Yumi Jung","Rebecca Gray","Cliff Lampe","Nicole Ellison"],"conference":"CHI '13"}