{"paperId":2470720,"citation":[{"content":"Sean A. Munson , Karina Kervin , Lionel P. Robert, Jr., Monitoring email to indicate project team performance and mutual attraction, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531628"},{"content":"Adam Stankiewicz , Chinmay Kulkarni, $1 Conversational Turn Detector: Measuring How Video Conversations Affect Student Learning in Online Classes, Proceedings of the Third (2016) ACM Conference on Learning @ Scale, April 25-26, 2016, Edinburgh, Scotland, UK","paperID":"2876048"},{"content":"D. Coetzee , Seongtaek Lim , Armando Fox , Bjorn Hartmann , Marti A. Hearst, Structuring Interactions for Large-Scale Synchronous Peer Learning, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675251"}],"reference":[{"content":"Anderson, J. R., Corbette, A. T., Koedinger, K. R., and Pelletier, R. Cognitive Tutors: Lessons Learned. Journal of Learning Sciences 4 (1995), 167--207.","paperID":"None"},{"content":"Bales, R. F. Interaction Process Analysis: A method for the study of small groups. The University of Chicago Press, Chicago, 1950.","paperID":"None"},{"content":"Bales, R. F., and Strodtbeck, F. L. Phases in group problem-solving. The Journal of Abnormal and Social Psychology 46 (1951), 485--495.","paperID":"None"},{"content":"Diehl, M., and Stroebe, W. Productivity loss in brainstorming groups: Toward the solution of a riddle. Journal of Personality and Social Psychology 53 (1987), 497--509.","paperID":"None"},{"content":"Joan Morris DiMicco , Katherine J. Hollenbach , Anna Pandolfo , Walter Bender, The impact of increased awareness while face-to-face, Human-Computer Interaction, v.22 n.1, p.47-96, May 2007","paperID":"1466598"},{"content":"Fischer, U., McDonnell, L., and Orasanu, J. Linguistic correlates of team performance: Toward a tool for monitoring team functioning during space missions. Aviation Space and Environmental Medicine 78 (2007), 86--95.","paperID":"None"},{"content":"Gonzales, A. L., Hancock, J. T., and Pennebaker, J. W. Language style matching as a predictor of social dynamics in small groups. Communication Research 31 (2010), 3--19.","paperID":"None"},{"content":"Graesser, A. C., Conley, M. W., and Olney, A. Intelligent tutoring systems. In APA Handbook of Educational Psychology, S. Graham and K. Harris, Eds., vol. 2579. American Psychological Association, Washington, DC, 2012, 451--473.","paperID":"None"},{"content":"Hackman, J. R., and Kaplan, R. E. Interventions into group process: An approach to improving the effectiveness of groups. Decision Sciences 5 (1974), 459--480.","paperID":"None"},{"content":"Hare, A. P. Handbook of Small Group Research. Free Press, New York, 1962.","paperID":"None"},{"content":"Hinsz, V. B., Tindale, R. S., and Vollrath, D. A. The emerging conceptualization of groups as information processors. Psychological Bulletin 121 (1997), 43--64.","paperID":"None"},{"content":"Huffaker, D., Swaab, R., and Diermeier, D. The language of coalition formation in multiparty online negotiations. In In Proceedings of the International Communication Association Conference (Montreal, Canada, 2008), 22--26.","paperID":"None"},{"content":"Ireland, M. E., and Pennebaker, J. W. Language style matching in writing: Synchrony in essays, correspondence, and poetry. Journal of Personality and Social Psychology 99 (2010), 549--571.","paperID":"None"},{"content":"Jonassen, D. H., and Kwon, H. Communication patterns in computer mediated versus face-to-face group problem solving. Educational Technology Research and Development 49 (2001), 35--51.","paperID":"None"},{"content":"Aniket Kittur , Robert E. Kraut, Harnessing the wisdom of crowds in wikipedia: quality through coordination, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460572"},{"content":"Leavitt, H. J. Some effects of certain communication patterns on group performance. Journal of Abnormal Psychology 46 (1951), 38--50.","paperID":"None"},{"content":"Linda Lebie , Jonathan A. Rhoades , Joseph E. McGrath, Interaction process in computer-mediated and face-to-face groups, Computer Supported Cooperative Work, v.4 n.2-3, p.127-152, 1995/1996","paperID":"234544"},{"content":"Gilly Leshed , Jeffrey T. Hancock , Dan Cosley , Poppy L. McLeod , Geri Gay, Feedback for guiding reflection on teamwork practices, Proceedings of the 2007 international ACM conference on Supporting group work, November 04-07, 2007, Sanibel Island, Florida, USA","paperID":"1316655"},{"content":"Gilly Leshed , Diego Perez , Jeffrey T. Hancock , Dan Cosley , Jeremy Birnholtz , Soyoung Lee , Poppy L. McLeod , Geri Gay, Visualizing real-time language-based feedback on teamwork behavior in computer-mediated groups, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518784"},{"content":"Levine, J. M., and Moreland, R. L. Progress in small group research. Annual Review of Psychology 41 (1990), 585--634.","paperID":"None"},{"content":"McGrath, J. E. Small group research, that once and future field: An interpretation of the past with an eye to the future. Group Dynamics: Theory, Research, and Practice 1 (1997), 7--27.","paperID":"None"},{"content":"Nemeth, C. J., Personnaz, B., Personnaz, M., and Goncalo, J. a. The liberating role of conflict in group creativity: A study in two countries. European Journal of Social Psychology 34 (2004), 365--374.","paperID":"None"},{"content":"Niederhoffer, K. G., and Pennebaker, J. W. Linguistic style matching in social interaction. Journal of Language and Social Psychology 21 (2002), 337--360.","paperID":"None"},{"content":"Michael Nowak , Juho Kim , Nam Wook Kim , Clifford Nass, Social visualization and negotiation: effects of feedback configuration and status, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145365"},{"content":"Pennebaker, J. W., Gosling, S. D., and Ferrell, J. D. Digital in-class teaching using the TOWER system: A pilot project of two 500-student introductory psychology classes. Tech. rep., Technical Report, Dept. of Psychology, University of Texas at Austin, 2012.","paperID":"None"},{"content":"Sexton, J. B., and Helmreich, R. L. Analyzing cockpit communications: The links between language, performance, and workload. Human Performance in Extreme Environments 5 (2000), 63--68.","paperID":"None"},{"content":"Stasser, G., Taylor, L. A., and Hanna, C. Information sampling in structured and unstructured discussions of three- and six-person groups. Journal of Personality and Social Psychology 57 (1989), 67--78.","paperID":"None"},{"content":"Tausczik, Y. R., and Pennebaker, J. W. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of Language and Social Psychology 29 (2010), 24--54.","paperID":"None"},{"content":"Taylor, P. J., and Thomas, S. Linguistic style matching and negotiation outcome. Negotiation and Conflict Management Research 1 (2008), 263--281.","paperID":"None"}],"abstract":"We develop and evaluate a real-time language feedback system that monitors the communication patterns among students in a discussion group and provides real-time instructions to shape the way the group works together. As an initial step, we determine which group processes are related to better outcomes. We then experimentally test the efficacy of providing real-time instructions which target two of these group processes. The feedback system was successfully able to shape the way groups worked together. However, only appropriate feedback given to groups that were not working well together from the start was able to improve group performance.","video":"http://www.youtube.com/embed/GldDgjZv2Nw?rel=0","title":"Improving teamwork using real-time language feedback","filename":"CHI13/p459","authors":["Yla R. Tausczik","James W. Pennebaker"],"conference":"CHI '13"}