{"paperId":2481373,"citation":[{"content":"A. Sarikaya , D. Albers , J. Mitchell , M. Gleicher, Visualizing validation of protein surface classifiers, Proceedings of the 16th Eurographics Conference on Visualization, June 09-13, 2014, Swansea, Wales, United Kingdom","paperID":"2854235"},{"content":"Michael Correll , Eric Alexander , Danielle Albers , Alper Sarikaya , Michael Gleicher, Navigating reductionism and holism in evaluation, Proceedings of the Fifth Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization, November 10-10, 2014, Paris, France","paperID":"2669577"}],"reference":[{"content":"Allik, J., and Tuulmets, T. Occupancy model of perceived numerosity. Perception & Psychophysics 49, 4 (Apr. 1991), 303--14.","paperID":"None"},{"content":"Arditi, A., Knoblauch, K., and Grunwald, I. Reading with fixed and variable character pitch. JOSA A 7, 10 (1990), 2011--2015.","paperID":"None"},{"content":"Burr, D., and Ross, J. A visual sense of number. Current Biology: CB 18, 6 (Mar. 2008), 425--8.","paperID":"None"},{"content":"Chaparro, B., Baker, J., Shaikh, A., Hull, S., and Brady, L. Reading online text: A comparison of four whitespace layouts. Usability News 6, 2 (2004), 1--7.","paperID":"None"},{"content":"Clement, T., Plaisant, C., and Vuillemot, R. The Story of One: Humanity scholarship with visualization and text analysis. Relation 10, 1.43 (2009), 8485.","paperID":"None"},{"content":"Cleveland, W., and McGill, R. A color-caused optical illusion on a statistical graph. The American Statistician 37, 2 (1983), 101--105.","paperID":"None"},{"content":"Collins, C., Viegas, F., and Wattenberg, M. Parallel tag clouds to explore and analyze faceted text corpora. In Visual Analytics Science and Technology, 2009. VAST 2009. IEEE Symposium on, IEEE (2009), 91--98.","paperID":"None"},{"content":"Michael Correll , Danielle Albers , Steven Franconeri , Michael Gleicher, Comparing averages in time series data, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208556"},{"content":"Correll, M., and Gleicher, M. What shakespeare taught us about text visualization. In IEEE Visualization Workshop Proceedings, The 2nd Workshop on Interactive Visual Text Analytics: Task-Driven Analysis of Social Media Content (oct 2012).","paperID":"None"},{"content":"M. Correll , M. Witmore , M. Gleicher, Exploring collections of tagged text for literary scholarship, Proceedings of the 13th Eurographics / IEEE - VGTC conference on Visualization, June 01-03, 2011, Bergen, Norway","paperID":"2421968"},{"content":"Dakin, S. C., Tibber, M. S., Greenwood, J. A., Kingdom, F. A. A., and Morgan, M. J. A common visual metric for approximate number and density. Proceedings of the National Academy of Sciences 108, 49 (2011), 19552--19557.","paperID":"None"},{"content":"Anthony Don , Elena Zheleva , Machon Gregory , Sureyya Tarkan , Loretta Auvil , Tanya Clement , Ben Shneiderman , Catherine Plaisant, Discovering interesting usage patterns in text collections: integrating text mining with visualization, Proceedings of the sixteenth ACM conference on Conference on information and knowledge management, November 06-10, 2007, Lisbon, Portugal","paperID":"1321473"},{"content":"Franconeri, S. L., Bemis, D. K., and Alvarez, G. a. Number estimation relies on a set of segmented objects. Cognition 113, 1 (Oct. 2009), 1--13.","paperID":"None"},{"content":"Gebuis, T., and Reynvoet, B. Generating nonsymbolic number stimuli. Behavior research methods 43, 4 (Dec. 2011), 981--6.","paperID":"None"},{"content":"Gebuis, T., and Reynvoet, B. The role of visual information in numerosity estimation. PloS one 7, 5 (Jan. 2012), e37426.","paperID":"None"},{"content":"Greco, M., Stucchi, N., Zavagno, D., and Marino, B. On the portability of computer-generated presentations: The effect of text-background color combinations on text legibility. Human Factors: The Journal of the Human Factors and Ergonomics Society 50, 5 (2008), 821--833.","paperID":"None"},{"content":"Hao, M., Rohrdantz, C., Janetzko, H., Dayal, U., Keim, D., Haug, L., and Hsu, M. Visual sentiment analysis on twitter data streams. In Visual Analytics Science and Technology (VAST), 2011 IEEE Conference on, IEEE (2011), 277--278.","paperID":"None"},{"content":"Hardy, L., Rand, G., and Rittler, M. Tests for the detection and analysis of color-blindness. JOSA 35, 4 (1945), 268--271.","paperID":"None"},{"content":"Harrower, M., and Brewer, C. Colorbrewer.org: an online tool for selecting colour schemes for maps. Cartographic Journal, The 40, 1 (2003), 27--37.","paperID":"None"},{"content":"Hope, J., and Witmore, M. The hundredth psalm to the tune of \"green sleeves\": Digital approaches to the language of genre. Shakespeare Quarterly 61, 3 (2010), 357--390.","paperID":"None"},{"content":"Hurewitz, F., Gelman, R., and Schnitzer, B. Sometimes area counts more than number. Proceedings of the National Academy of Sciences of the USA of America 103, 51 (Dec. 2006), 19599--604.","paperID":"None"},{"content":"Kaufman, E. L., Lord, M. W., Reese, T. W., and Volkmann, J. The discrimination of visual number. The American Journal of Psychology 62, 4 (1949), pp. 498--525.","paperID":"None"},{"content":"Aniket Kittur , Ed H. Chi , Bongwon Suh, Crowdsourcing user studies with Mechanical Turk, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357127"},{"content":"Klein, G. S. Semantic power measured through the interference of words with color-naming. The American Journal of Psychology 77, 4 (1964), pp. 576--588.","paperID":"None"},{"content":"Lemer, C., Dehaene, S., Spelke, E., and Cohen, L. Approximate quantities and exact number words: dissociable systems. Neuropsychologia 41, 14 (2003), 1942--1958.","paperID":"None"},{"content":"Lyons, I. M., and Beilock, S. Symbolic Estrangement: Evidence against a strong association between number sense and numerical symbols. In Annual Meeting of the Cognitive Science Society (2011), 1515--1520.","paperID":"None"},{"content":"Mason, W., and Suri, S. Conducting behavioral research on amazons mechanical turk. Behavior research methods (2011), 1--23.","paperID":"None"},{"content":"Matell, M., and Jacoby, J. Is there an optimal number of alternatives for likert scale items? study i: Reliability and validity. Educational and Psychological Measurement (1971).","paperID":"None"},{"content":"Joel Ross , Lilly Irani , M. Six Silberman , Andrew Zaldivar , Bill Tomlinson, Who are the crowdworkers?: shifting demographics in mechanical turk, CHI '10 Extended Abstracts on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753873"},{"content":"Artur Šilić , Bojana Dalbelo Bašić, Visualization of text streams: a survey, Proceedings of the 14th international conference on Knowledge-based and intelligent information and engineering systems: Part II, September 08-10, 2010, Cardiff, UK","paperID":"1885380"},{"content":"Stroop, J. Studies of interference in serial verbal reactions. Journal of Experimental Psychology: General 121, 1 (1992), 15.","paperID":"None"},{"content":"Tedford, Jr, W., Bergquist, S., and Flynn, W. The size-color illusion. The Journal of General Psychology 97, 1 (1977), 145--149.","paperID":"None"},{"content":"van Oeffelen, M. P., and Vos, P. G. A probabilistic model for the discrimination of visual number. Perception & Psychophysics 32, 2 (Aug. 1982), 163--70.","paperID":"None"}],"abstract":"A valuable task in text visualization is to have viewers make judgments about text that has been annotated (either by hand or by some algorithm such as text clustering or entity extraction). In this work we look at the ability of viewers to make judgments about the relative quantities of tags in annotated text (specifically text tagged with one of a set of qualitatively distinct colors), and examine design choices that can improve performance at extracting statistical information from these texts. We find that viewers can efficiently and accurately estimate the proportions of tag levels over a range of situations; however accuracy can be improved through color choice and area adjustments.","video":"http://www.youtube.com/embed/6eaSlQ6IzoM?rel=0","title":"Quantity estimation in visualizations of tagged text","filename":"CHI13/p2697","authors":["Michael A. Correll","Eric C. Alexander","Michael Gleicher"],"conference":"CHI '13"}