{"paperId":2481315,"citation":[{"content":"Brendan Cassidy , Claire Louise Haywood , Gavin Sim, Investigating the extent to which children use mobile phone application stores, Proceedings of the 27th International BCS Human Computer Interaction Conference, September 09-13, 2013, London, UK","paperID":"2578079"},{"content":"Marcus Carter , John Downs , Bjorn Nansen , Mitchell Harrop , Martin Gibbs, Paradigms of games research in HCI: a review of 10 years of research at CHI, Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play, October 19-21, 2014, Toronto, Ontario, Canada","paperID":"2658708"}],"reference":[{"content":"Borgman, C. L., Chignell, M. H., & Valdez, F. (1989). Designing an information retrieval interface based on children's categorization of knowledge: A pilot study. In J. Katzer & G. B. Newby (Eds.), Proceedings of the 52nd ASIS Annual Meeting (pp. 81--95). Medford, NJ: Information Today, Inc.","paperID":"None"},{"content":"Linda Z. Cooper, Methodology for a project examining cognitive categories for library information in young children, Journal of the American Society for Information Science and Technology, v.53 n.14, p.1223-1231, December 2002","paperID":"638671"},{"content":"Denney, N. W. & Ziobrowski, M. 1972. Developmental Changes in Clustering Criteria. Journal of Experimental Child Psychology, 13.","paperID":"None"},{"content":"Allison Druin, Cooperative inquiry: developing new technologies for children with children, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.592-599, May 15-20, 1999, Pittsburgh, Pennsylvania, USA","paperID":"303166"},{"content":"Druin, A. 2002. The Role of Children in the Design of New Technology. Behaviour & Information Technology, 21, 1--25.","paperID":"None"},{"content":"Allison Druin , Gary Knell , Elliot Soloway , Daniel Russell , Elizabeth Mynatt , Yvonne Rogers, The future of child-computer interaction, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979495"},{"content":"Fincher, S. & Tesenberg, J. 2005. Making Sense of Card Sort Data. Expert Systems, 22, 89--93.","paperID":"None"},{"content":"Hilary Browne Hutchinson , Benjamin B. Bederson , Allison Druin, The evolution of the international children's digital library searching and browsing interface, Proceedings of the 2006 conference on Interaction design and children, June 07-09, 2006, Tampere, Finland","paperID":"1139101"},{"content":"Hilary Browne Hutchinson , Allison Druin , Benjamin B. Bederson, Supporting elementary-age children's searching and browsing: Design and evaluation using the international children's digital library, Journal of the American Society for Information Science and Technology, v.58 n.11, p.1618-1630, September 2007","paperID":"1285329"},{"content":"Ana Vitoria Joly , Lyn Pemberton , Richard Griffiths, Card sorting activities with preschool children, Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology, p.204-213, September 01-05, 2009, Cambridge, United Kingdom","paperID":"1671036"},{"content":"Aphra Kerr, The Business and Culture of Digital Games: Gamework and Gameplay, Sage Publications Ltd., 2006","paperID":"1202544"},{"content":"J. P. Lewis , Morgan McGuire , Pamela Fox, Mapping the mental space of game genres, Proceedings of the 2007 ACM SIGGRAPH symposium on Video games, August 04-05, 2007, San Diego, California","paperID":"1274962"},{"content":"McFarlane, A. & Kirriemuir, J. 2003. Literature review in games and learning: a report for NESTA Futurelab. NESTA Futurelab Report Series 8.","paperID":"None"},{"content":"Miller, R. 1973. The use of concrete and abstract concepts by children and adults. Cognition, 2, 49--58.","paperID":"None"},{"content":"Piaget, J. & Inhelder, B. 1973. Memory and Intelligence. London: Routledge and Keegan.","paperID":"None"},{"content":"Roberts, D. F. & Foehr, U. G. 2008, Trends in media use. Children and Electonic Media. 18, 1. p. 11--38.","paperID":"None"}],"abstract":"This paper presents a study aimed at better understanding how children categorize different games. The paper reports the results of an open card sort where participants were asked to categorize games from the Google Play Store (formerly the 'Android Marketplace'). The key contribution of the paper is that when compared with existing categories in the Google Play Store, children used categorization criteria much more aligned to the goals of the game rather than more abstract categories currently found in mobile phone application stores. The paper provides examples of existing categories that are not generally used by children and provides new examples of categorization criteria that are used by children to categorize existing games.","video":"http://www.youtube.com/embed/_XOiYpi26es?rel=0","title":"Using an open card sort with children to categorize games in a mobile phone application store","filename":"CHI13/p2287","authors":["Brendan Cassidy","Dipti Saurabh Antani","Janet C C. Read"],"conference":"CHI '13"}