{"paperId":2481396,"reference":[{"content":"Jean-François Blanchette, A material history of bits, Journal of the American Society for Information Science and Technology, v.62 n.6, p.1042-1057, June 2011","paperID":"1988591"},{"content":"Dourish, P. and Mazmanian. M. Media as Material: Information Representations as Material Foundations for Organizational Practice. Working Paper for the Third International Symposium on Process Organization Studies Corfu, Greece, June 2011.","paperID":"None"},{"content":"Burrell, J. 2013. The Materiality of Rumor. In Materiality and Organizing: Social Interaction in a Technological World, Eds. Paul Leonardi, Bonnie Nardi, and Jannis Kallinikos. Oxford University Press.","paperID":"None"},{"content":"Magaudda, P. 2011. When materiality 'bites back'. Digital music consumption practices in the age of dematerialization. Journal of Consumer Culture, 11(1).","paperID":"None"},{"content":"Petra Sundström , Alex Taylor , Katja Grufberg , Niklas Wirström , Jordi Solsona Belenguer , Marcus Lundén, Inspirational bits: towards a shared understanding of the digital material, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979170"},{"content":"Daniela K. Rosner, The material practices of collaboration, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145375"},{"content":"James Pierce , Eric Paulos, Materializing energy, Proceedings of the 8th ACM Conference on Designing Interactive Systems, August 16-20, 2010, Aarhus, Denmark","paperID":"1858193"},{"content":"William W. Gaver, Technology affordances, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.79-84, April 27-May 02, 1991, New Orleans, Louisiana, USA","paperID":"108856"},{"content":"Bull, M. 2000. Sounding Out the City: Personal Stereos and the Management of Everyday Life (Oxford: Berg).","paperID":"None"},{"content":"Bull, M. 2005. No Dead Air! The iPod and the Culture of Mobile Listening, Leisure Studies, 24:4.","paperID":"None"},{"content":"Anne Oeldorf-Hirsch , Jonathan Donner , Edward Cutrell, How bad is good enough?: exploring mobile video quality trade-offs for bandwidth-constrained consumers, Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, October 14-17, 2012, Copenhagen, Denmark","paperID":"2399025"},{"content":"Norman, D. A. (1990). The design of everyday things. New York: Doubleday.","paperID":"None"},{"content":"Rural India to Drive Mobile Phone Market Growth http://www.thehindu.com/business/Industry/article1118628.ece?homepage=true","paperID":"None"},{"content":"Thomas N. Smyth , Satish Kumar , Indrani Medhi , Kentaro Toyama, Where there's a will there's a way: mobile media sharing in urban india, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753436"},{"content":"Neha Kumar , Gopal Chouhan , Tapan Parikh, Folk music goes digital in India, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979151"},{"content":"Donner, J. Blurring livelihoods and lives: The social uses of mobile phones and socioeconomic development. (2009). Innovations: Technology, Governance, Globalization, vol. 4, no. 1, pp. 91--101, MIT Press.","paperID":"None"},{"content":"Rangaswamy, N. and Nair, S. The Mobile Phone Store Ecology in a Mumbai Slum Community: Hybrid Networks for Enterprise. In Proc. ITID 2010.","paperID":"None"},{"content":"Sey, A. 'We use it different, different': Making sense of trends in mobile phone use in Ghana. New Media & Society (2011).","paperID":"None"},{"content":"Glaser, B. and Strauss, A. 1967. The Discovery of Grounded Theory: Strategies for Qualitative Research.","paperID":"None"},{"content":"Sundaram, R. 2010. Pirate Modernity: Delhi's Media Urbanism. Routledge.","paperID":"None"},{"content":"Census of India 2001. http://www.censusindia.gov.in","paperID":"None"},{"content":"Manuel, P. 1993. Cassette Culture: Popular Music and Technology in North India. Oxford University Press.","paperID":"None"},{"content":"Benjamin, W. 1968. 'The Work of Art in the Age of Mechanical Reproduction', in Illuminations, ed. and tr. Hannah Arendt, Fontana, London.","paperID":"None"}],"citation":[{"content":"Gilbok Lee , Kyle Koh , Gyungbok Lee , Guntae Park, PhoneCog: a device authentication method on interactive tabletops using color sequence pattern recognition, Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces, October 06-09, 2013, St. Andrews, Scotland, United Kingdom","paperID":"2514590"},{"content":"Daniela Rosner, Book Review, Computer Supported Cooperative Work, v.24 n.5, p.509-513, October   2015","paperID":"2869952"},{"content":"Hendrik Knoche , Pr Sheshagiri Rao , HS Jamadagni , Jeffrey Huang, Actions and advice in coli: a mobile social network to support agricultural peer learning, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, August 24-27, 2015, Copenhagen, Denmark","paperID":"2801608"},{"content":"David Nemer , Shad Gross , Nic True, Materializing digital inequalities: the digital artifacts of the marginalized in Brazil, Proceedings of the Sixth International Conference on Information and Communications Technologies and Development: Notes, p.108-111, December 07-10, 2013, Cape Town, South Africa","paperID":"2517915"},{"content":"Neha Kumar , Richard J. Anderson, Mobile Phones for Maternal Health in Rural India, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702258"},{"content":"Syed Ishtiaque Ahmed , Maruf Hasan Zaber , Mehrab Bin Morshed , Md. Habibullah Bin Ismail , Dan Cosley , Steven J. Jackson, Suhrid: A Collaborative Mobile Phone Interface for Low Literate People, Proceedings of the 2015 Annual Symposium on Computing for Development, December 01-02, 2015, London, United Kingdom","paperID":"2830640"},{"content":"Aditya Vashistha , Edward Cutrell , William Thies, Increasing the Reach of Snowball Sampling: The Impact of Fixed versus Lottery Incentives, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675148"}],"abstract":"Building on recent HCI contributions that assert the materiality of digital information, we examine the material nature of digital media and information technology in the context of mobile music production, reproduction, and reception in rural and semi-urban India. We use ethnographic methods to study the recent adoption and use of mobile technology and discuss our findings in relation to the evolving materiality of music. We also investigate the sociotechnical configurations that emerge as a consequence of this materiality. Thus we contribute to HCI research by showing how the material representations of digital media affect the interactions of humans with technology.","video":"http://www.youtube.com/embed/G6vUw7ScdR8?rel=0","title":"Mobiles, music, and materiality","filename":"CHI13/p2863","authors":["Neha Kumar","Tapan S. Parikh"],"conference":"CHI '13"}