{"paperId":2481370,"citation":[{"content":"Makayla M. Lewis , Lizzie Coles-Kemp, Who says personas can't dance?: the use of comic strips to design information security personas, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2581323"},{"content":"Liang Gou , Michelle X. Zhou , Huahai Yang, KnowMe and ShareMe: understanding automatically discovered personality traits from social media and user sharing preferences, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557398"}],"reference":[{"content":"Åsa Blomquist , Mattias Arvola, Personas in action: ethnography in an interaction design team, Proceedings of the second Nordic conference on Human-computer interaction, October 19-23, 2002, Aarhus, Denmark","paperID":"572044"},{"content":"Burr, B. Social Constructionism. Routledge, London, 2003.","paperID":"None"},{"content":"Chapman, C. N. and Milham, R. P. The personas' new clothes: methodological and practical arguments against a popular method. In Proc. The Human Factors and Ergonomics Society Annual Meeting, SAGE Publications, (2006), 634--636.","paperID":"None"},{"content":"Alan Cooper, The Inmates Are Running the Asylum: Why High Tech Products Drive Us Crazy and How to Restore the Sanity (2nd Edition), Pearson Higher Education, 2004","paperID":"984201"},{"content":"Shamal Faily , Ivan Fléchais, The secret lives of assumptions: developing and refining assumption personas for secure system design, Proceedings of the Third international conference on Human-centred software engineering, October 14-15, 2010, Reykjavik, Iceland","paperID":"1939224"},{"content":"Floyd, I. R., Jones, M. C., and Twidale, M. B. Resolving incommensurable debates: a preliminary identification of persona kinds, attributes, and characteristics. Artifact, 2, 1 (2008), 12--26.","paperID":"None"},{"content":"Foucault, M. Technologies of the self: A seminar with Michel Foucault, in L. H. Matin, H. Gutman, and P. H. Hutton (Ed.) Tavistock: London. (1988).","paperID":"None"},{"content":"Erin Friess, Personas and decision making in the design process: an ethnographic case study, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208572"},{"content":"Gergen, K. J. An invitation to social construction. Sage Publications, London, 1999.","paperID":"None"},{"content":"Joan Greenbaum , Morten Kyng, Design at work: cooperative design of computer systems, L. Erlbaum Associates Inc., Hillsdale, NJ, 1992","paperID":"125470"},{"content":"Grudin, J. Why personas work: The psychological evidence, in J. Pruitt and A. T. (Ed.) The persona lifecycle: Keeping people in mind during product design Morgan Kaufman Publisher: San Francisco. (2006), 642--664.","paperID":"None"},{"content":"Grudin, J. and Pruitt, J. Personas, participatory design and product development: An infrastructure for engagement. In Proc. PDC'02, (2002), 144--161.","paperID":"None"},{"content":"Guðjónsdóttir, R. Personas and Scenarios in Use, Doctoral thesis, KTH, Sweden, 2010.","paperID":"None"},{"content":"Kujala, S. User involvement: a review of the benefits and challenges. Behaviour & Information Technology, 22, 1 (2003), 1--16.","paperID":"None"},{"content":"Erik Markensten , Henrik Artman, Procuring a usable system using unemployed personas, Proceedings of the third Nordic conference on Human-computer interaction, p.13-22, October 23-27, 2004, Tampere, Finland","paperID":"1028017"},{"content":"Tara Matthews , Tejinder Judge , Steve Whittaker, How do designers and user experience professionals actually perceive and use personas?, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208573"},{"content":"Tara Matthews , Steve Whittaker , Thomas Moran , Sandra Yuen, Collaboration personas: a new approach to designing workplace collaboration tools, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979272"},{"content":"Lene Nielsen, From user to character: an investigation into user-descriptions in scenarios, Proceedings of the 4th conference on Designing interactive systems: processes, practices, methods, and techniques, June 25-28, 2002, London, England","paperID":"778729"},{"content":"Steve Portigal, TRUE TALESPersona non grata, interactions, v.15 n.1, January + February 2008","paperID":"1330550"},{"content":"Potter, J. and Wetherell, M. Discourse and social psychology: Beyond attitudes and behaviour. Sage Publications, London, 1987.","paperID":"None"},{"content":"John Pruitt , Jonathan Grudin, Personas: practice and theory, Proceedings of the 2003 conference on Designing for user experiences, June 06-07, 2003, San Francisco, California","paperID":"997089"},{"content":"Quesenbery, W. Storytelling and narrative, in J. Pruitt and A. T. (Ed.) Persona Lifecycle: Keeping People in Mind Troughout Product Design. Morgan Kaufman Publishers: San Francisco. (2006), 520--554.","paperID":"None"},{"content":"Kari Rönkkö , Mats Hellman , Britta Kilander , Yvonne Dittrich, Personas is not applicable: local remedies interpreted in a wider context, Proceedings of the eighth conference on Participatory design: Artful integration: interweaving media, materials and practices, July 27-31, 2004, Toronto, Ontario, Canada","paperID":"1011884"},{"content":"Rashmi Sinha, Persona development for information-rich domains, CHI '03 Extended Abstracts on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"766017"},{"content":"Swartling, A. The Good Person in Information Systems Development: A Reflexive Investigation of HCI in the Acquisition Process, Doctoral thesis, KTH, Sweden, 2008.","paperID":"None"},{"content":"Muhammad Adnan Tariq , Joel Brynielsson , Henrik Artman, Framing the Attacker in Organized Cybercrime, Proceedings of the 2012 European Intelligence and Security Informatics Conference, p.30-37, August 22-24, 2012","paperID":"2372876"},{"content":"Turner, P. and Turner, S. Is stereotyping inevitable when designing with personas? Design Studies, 32, 1 (2011), 30--44.","paperID":"None"}],"abstract":"Some organizations fail to involve users in systems development due to a widespread organization, high workload or secrecy issues. A remedy against this situation could be the persona method in which users and main stakeholders as represented as fictitious characters. Personas help eliciting user needs and requirements, facilitate design choices and are an overall communication aid where users cannot be present. An important part of the persona method, as portrayed in literature, is the personal details that make the personas trustworthy and alive. In this paper we present two cases in which personas have been developed and used, but where the personal is scarce or even non-existent because of a dispersed organisation, the organisational culture and secrecy issues. The paper describes how the personas were developed, used and received and how the method was altered in order to work in these special circumstances.","video":"http://www.youtube.com/embed/PlSYhxyvhnE?rel=0","title":"The secret life of a persona: when the personal becomes private","filename":"CHI13/p2677","authors":["Elina Eriksson","Henrik Artman","Anna Swartling"],"conference":"CHI '13"}