{"paperId":2481314,"citation":[],"reference":[{"content":"David M. Blei , Andrew Y. Ng , Michael I. Jordan, Latent dirichlet allocation, The Journal of Machine Learning Research, 3, p.993-1022, 3/1/2003","paperID":"944937"},{"content":"Burke, M., Joyce, E., Kim, T., Anand, V., and Kraut, R. Introductions and requests: Rhetorical strategies that elicit response in online communities. Communities & Technologies (2007).","paperID":"None"},{"content":"Farnham, S. D., Lahav, M., Raskino, D., Cheng, L., Ickman, S., and Laird-McConnell, T. So.cl: An interest network for informal learning. In Proc. ICWSM 2012, AAAI Press (2012).","paperID":"None"},{"content":"Sanjay Kairam , Mike Brzozowski , David Huffaker , Ed Chi, Talking in circles: selective sharing in google+, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208552"},{"content":"Haewoon Kwak , Changhyun Lee , Hosung Park , Sue Moon, What is Twitter, a social network or a news media?, Proceedings of the 19th international conference on World wide web, April 26-30, 2010, Raleigh, North Carolina, USA","paperID":"1772751"},{"content":"Miller, C. C. Putting Twitter's world to use. The New York Times. April 13 (2009).","paperID":"None"},{"content":"Teevan, J., Morris, M. R., and Panovich, K. Factors affecting response quantity, quality, and speed for questions asked via social network status messages. In Proc. ICWSM 2011 (2011).","paperID":"None"},{"content":"Wasko, M. M. and Faraj, S. \"It is what one does\": why people participate and help others in electronic communities of practice. Journal of Strategic Information Systems 9, (2000), 155--173.","paperID":"None"}],"abstract":"The arrival of a new interest-sharing network, So.cl, provides for a new opportunity to explore human behavior as it relates to constructing public contributions and receiving community response. This study looks at archival data in order to better understand how types of shared content receive interaction from others. The results suggest that a So.cl user should include more photos and less links on their post to increase the quantity of likes and comments the community gives to the post, among other discoveries.","video":"http://www.youtube.com/embed/g2jNcRmmUiw?rel=0","title":"Factors impacting community response in an interest-sharing network","filename":"CHI13/p2283","authors":["Iris Howley","Todd Newman"],"conference":"CHI '13"}