{"paperId":2481371,"abstract":"Terms and conditions are central in acquiring user consent by service providers. Such documents are frequently highly complex and unreadable, placing doubts on the validity of so called 'informed consent'. While readability and web accessibility have been major themes for some time in HCI, the core principles have yet to be applied beyond webpage content and are absent from the underpinning terms and conditions. Our concern is that accessible web pages will encourage consent, masking the complexities of the terms of usage.Using the SMOG readability formula and UK Energy services as a case study, we observed that a series of supplier terms and conditions were far beyond what a functionally literate adult could be expected to understand. We also present a browser based plug-in which compares SMOG readability scores to popular books. The intention is to use this plug-in to assist in surfacing the hidden complexities underpinning online consent.","citation":[{"content":"Stuart Moran , Ewa Luger , Tom Rodden, An emerging tool kit for attaining informed consent in UbiComp, Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication, September 13-17, 2014, Seattle, Washington","paperID":"2641677"},{"content":"Stuart Moran , Ewa Luger , Tom Rodden, Literatin: beyond awareness of readability in terms and conditions, Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication, September 13-17, 2014, Seattle, Washington","paperID":"2641684"},{"content":"Casey Fiesler , Amy Bruckman, Copyright terms in online creative communities, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2581294"},{"content":"Ewa Luger , Marina Jirotka , Tom Rodden , Lilian Edwards, How do you solve a problem like consent?: the workshop, Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication, September 13-17, 2014, Seattle, Washington","paperID":"2641676"},{"content":"Shomir Wilson , Florian Schaub , Rohan Ramanath , Norman Sadeh , Fei Liu , Noah A. Smith , Frederick Liu, Crowdsourcing Annotations for Websites' Privacy Policies: Can It Really Work?, Proceedings of the 25th International Conference on World Wide Web, April 11-15, 2016, Montréal, Québec, Canada","paperID":"2883035"},{"content":"Ewa Luger , Tom Rodden, An informed view on consent for UbiComp, Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing, September 08-12, 2013, Zurich, Switzerland","paperID":"2493446"},{"content":"Casey Fiesler , Cliff Lampe , Amy S. Bruckman, Reality and Perception of Copyright Terms of Service for Online Content Creation, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819931"},{"content":"Alistair Morrison , Donald McMillan , Matthew Chalmers, Improving consent in large scale mobile HCI through personalised representations of data, Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational, p.471-480, October 26-30, 2014, Helsinki, Finland","paperID":"2639239"},{"content":"Michael James Heron , Pauline Belford, Power and perception in the scandal in academia, ACM SIGCAS Computers and Society, v.45 n.2, p.11-19, June 2015","paperID":"2809961"},{"content":"Steve Benford , Chris Greenhalgh , Bob Anderson , Rachel Jacobs , Mike Golembewski , Marina Jirotka , Bernd Carsten Stahl , Job Timmermans , Gabriella Giannachi , Matt Adams , Ju Row Farr , Nick Tandavanitj , Kirsty Jennings, The Ethical Implications of HCI's Turn to the Cultural, ACM Transactions on Computer-Human Interaction (TOCHI), v.22 n.5, p.1-37, August 2015","paperID":"2775107"}],"reference":[{"content":"Bailin, A., and Grafstein, A. The linguistic Assumptions Underlying Readability Formulae: A Critique. Language and Communication 21, 3 (2001), 285--301.","paperID":"None"},{"content":"Bakos, Y. Marotta-Wurgler, F. Trossen, D. R. Does Anyone Read the Fine Print? Testing a Law and Economics Approach to Standard Form Contracts, New York University Law and Economics Working Paper 195 (2009).","paperID":"None"},{"content":"Becta. Extending opportunity: final report of the minister's taskforce on home access to technology. Becta (2008).","paperID":"None"},{"content":"Bernstam, E. V., Shelton, D. M., Walji M., and Meric-Bernstam, F. Instruments to Assess the Quality of Health Information on the World Wide Web: What can our Patients Actually Use? Int. J. Med. Inf. 74, 1 (2005), 13--19.","paperID":"None"},{"content":"Breese, P., and Burman, W. Readability of Notice of Privacy Forms used by Major Health Care Institutions. JAMA, 293. 13 (2005), 1593--1592.","paperID":"None"},{"content":"Data Protection Commissioner. EU Directive 95/46/EC -The Data Protection Directive: Article 2 definitions http://www.dataprotection.ie/viewdoc.asp?DocID=92","paperID":"None"},{"content":"DIUS. World Class Skills: Implementing the Leitch Review of Skills in England. TSO, 2007.","paperID":"None"},{"content":"DuBay, W. H. The Principles of Readability. Costa Mesa, CA: Impact Information, 2004.","paperID":"None"},{"content":"Eysenbach, G., Powell, J., Kuss, O., Sa, E. Empirical Studies Assessing the Quality of Health Information for Consumers on the World Wide Web: A Systematic Review. JAMA, 287 (2002), 2691--2700.","paperID":"None"},{"content":"Flory, J., and Emanuel, E. Interventions to improve Research Participants' Understanding in Informed Consent for Research: A Systematic Review. JAMA, 292. 13 (2004), 1593--1601.","paperID":"None"},{"content":"Friedman, D. B., and Hoffman-Goetz, L. A Systematic Review of Readability and Comprehension Instruments Used for Print and Web-Based Cancer Information. Health Educ. Behav. 33, 3 (2006), 352--373.","paperID":"None"},{"content":"Harding, C., Romanou E., Williams, J., Peters M., Winkley, J., Burke, P., Hamer, J., Jeram, K., Nelson, N., Rainbow, B., Bond B., and Shay M. 2011 Skills for Life Survey: Headline findings, BIS Research Paper No. 57, Crown Copyright, 2011.","paperID":"None"},{"content":"Harrison, C. Readability in the Classroom. Cambridge University Press, 1980.","paperID":"None"},{"content":"Helsper, E. Digital Inclusion: An Analysis of Social Disadvantage and the Information Society: Executive Summary. CLG (2008).","paperID":"None"},{"content":"Hillman, R. A., On-Line Consumer Standard-Form Contracting Practices: A Survey and Discussion of Legal Implications, Cornell Law Faculty Publications, Paper 29 (2005).","paperID":"None"},{"content":"Horner, S. D., Surratt, D., and Juliusson, S. Improving readability of Patient Education materials. J Community Health Nurs. 17, 1 (2000), 15--23.","paperID":"None"},{"content":"Information Commissioner's Office. Privacy and Electronic Communications Regulations: Guidance on the rules on use of cookies and similar technologies. ICO (2012).","paperID":"None"},{"content":"Information Commissioners Office. Privacy Notices Code of Practice. ICO (2010).","paperID":"None"},{"content":"Carlos Jensen , Colin Potts, Privacy policies as decision-making tools: an evaluation of online privacy notices, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.471-478, April 24-29, 2004, Vienna, Austria","paperID":"985752"},{"content":"Kaul, I., Grunberg, I., Stern, M. A., Global Public Goods: International Cooperation for the 21st Century. Oxford University Press, 1999.","paperID":"None"},{"content":"Matthew Kay , Michael Terry, Textured agreements: re-envisioning electronic consent, Proceedings of the Sixth Symposium on Usable Privacy and Security, July 14-16, 2010, Redmond, Washington","paperID":"1837127"},{"content":"Manson, N & O'Neill, O. Rethinking Informed Consent in Bioethics. Cambridge University Press, 2007.","paperID":"None"},{"content":"McLaughlin, G. H. SMOG Grading; A New Readability Formula. Journal of Reading, 12. 8 (1969), 639--646.","paperID":"None"},{"content":"National Literacy Trust. How can I assess the readability of my document or write more clearly? http://www.literacytrust.org.uk/about/faqs/710_how_can_i_assess_the_readability_of_my_document_or_write_more_clearly","paperID":"None"},{"content":"NIACE. Readability: How to produce clear written materials for a range of readers, 2009.","paperID":"None"},{"content":"Ofgem Press Release. Ofgem Sets Out Road Map to Open up Electricity Market for Independent Suppliers (2012) http://www.ofgem.gov.uk/Media/PressRel/Documents1/liquidity%20feb%202012.pdf","paperID":"None"},{"content":"Ofgem. Industry Governance. http://www.ofgem.gov.uk/Licensing/Work/Pages/licence-conditions-consolidated.aspx","paperID":"None"},{"content":"O. O'Neill, Some limits of informed consent, J Med Ethics, 29 (2003), 4--7.","paperID":"None"},{"content":"Paasche-Orlow, M. K., Taylor, H. A., and Brancati, F. L. Readability standards for informed-consent forms as compared with actual readability. New England journal of medicine, 248, 8 (2003), 721--727.","paperID":"None"},{"content":"Parris, R., Online T&Cs longer than Shakespeare plays - who reads them? Which, (2012).","paperID":"None"},{"content":"Perlow, E. Accessibility: Global Gateway to Health Literacy. Health Promot Pract, 11 (2010), 123--131.","paperID":"None"},{"content":"Price, S., The Complete A-Z Media and Communication Handbook. Hodder & Stoughton, 1997.","paperID":"None"},{"content":"Skills funding Agency. Skills for Life. http://skillsfundingagency.bis.gov.uk/providers/programmes/skillsforlife/","paperID":"None"},{"content":"Thornhill, T. 'Google will know more about you than your partner': Uproar as search giant reveals privacy policy that will allow them to track you on all their products. Mail Online. (2012).","paperID":"None"},{"content":"UNESCO. EFA Global Monitoring Report; Education for all by 2015 - will we make it? Oxford University Press, (2007).","paperID":"None"},{"content":"Walsh, T., and Volsko, T. A., Readability Assessment of Internet-Based Consumer Health Information, Respiratory Care, 53. 10 (2008), 1310--1315.","paperID":"None"},{"content":"WC3 Web accessibility initiative. Web Content Accessibility Guidelines (WCAG) Overview. http://www.w3.org/WAI/intro/wcag.php","paperID":"None"}],"title":"Consent for all: revealing the hidden complexity of terms and conditions","filename":"CHI13/p2687","authors":["Ewa Luger","Stuart Moran","Tom Rodden"],"conference":"CHI '13"}