{"paperId":2481410,"citation":[{"content":"Nataliya Kosmyna , Franck Tarpin-Bernard , Bertrand Rivet, Conceptual Priming for In-game BCI Training, ACM Transactions on Computer-Human Interaction (TOCHI), v.22 n.5, p.1-25, October 2015","paperID":"2808228"}],"reference":[{"content":"Ashby, F. G., Valentin, V., and Turken, U. The effects of positive affect and arousal on working memory and executive attention. 2002, 245--282.","paperID":"None"},{"content":"Bechara, A. The role of emotion in decision-making: Evidence from neurological patients with orbitofrontal damage. Brain and Cognition 55, 1 (2004), 30--40.","paperID":"None"},{"content":"Bechara, A., Damasio, H., and Damasio, A. R. Emotion, decision making and the orbitofrontal cortex. Cerebral Cortex 10, 3 (2000), 295--307.","paperID":"None"},{"content":"Michael S. Bernstein , Greg Little , Robert C. Miller , Björn Hartmann , Mark S. Ackerman , David R. Karger , David Crowell , Katrina Panovich, Soylent: a word processor with a crowd inside, Proceedings of the 23nd annual ACM symposium on User interface software and technology, October 03-06, 2010, New York, New York, USA","paperID":"1866078"},{"content":"Bertin, J. Semiologie Graphique. Gauthier-Villars, 1967.","paperID":"None"},{"content":"Bohm, G., and Pfister, H.-R. Anticipated and experienced emotions in environmental risk perception. Judgement and Decision Making 3 (2008), 73--86.","paperID":"None"},{"content":"Chabris, C. F., and Kosslyn, S. M. How do the cerebral hemispheres contribute to encoding spatial relations? Current Directions in Psychological Science 7, 1 (1998), 8--14.","paperID":"None"},{"content":"Chen, C., and Czerwinski, M. Spatial ability and visual navigation: An empirical study. New Review of Hypermedia and Multimedia 3, 1 (1997), 67--89.","paperID":"None"},{"content":"Chong, S., and Treisman, A. Attentional spread in the statistical processing of visual displays. Attention, Perception, & Psychophysics 67, 1 (2005), 1--13.","paperID":"None"},{"content":"Cleveland, W. S., and McGill, R. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American Statistical Association 79, 387 (1984), 531--554.","paperID":"None"},{"content":"Cristina Conati , Heather Maclaren, Exploring the role of individual differences in information visualization, Proceedings of the working conference on Advanced visual interfaces, May 28-30, 2008, Napoli, Italy","paperID":"1385602"},{"content":"Damasio, A. Descartes Error. New York: Grosset/Putnam, 1994.","paperID":"None"},{"content":"Dou, W., Ziemkiewicz, C., Harrison, L., Jeong, D., Ryan, R., Ribarsky, W., Wang, X., and Chang, R. Comparing different levels of interaction constraints for deriving visual problem isomorphs. IEEE VAST (2010), 194--202.","paperID":"None"},{"content":"Elting, L., Martin, C., Cantor, S., and Rubenstein, E. Influence of data display formats on physician investigators' decisions to stop clinical trials: prospective trial with repeated measures. British Medical Journal 318, 7197 (1999), 1527--1531.","paperID":"None"},{"content":"Eriksen, C., and St. James, J. Visual attention within and around the field of focal attention: A zoom lens model. Attention, Perception, & Psychophysics 40, 4 (1986), 225--240.","paperID":"None"},{"content":"Eysenck, M., and Calvo, M. Anxiety and performance: The processing efficiency theory. Cognition & Emotion 6, 6 (1992), 409--434.","paperID":"None"},{"content":"Franconeri, S., Scimeca, J., Roth, J., Helseth, S., and Kahn, L. Flexible visual processing of spatial relationships. Cognition 122 (2012), 210--227.","paperID":"None"},{"content":"Fredrickson, B. What good are positive emotions? Review of General Psychology 2, 3 (1998), 300--319.","paperID":"None"},{"content":"Fredrickson, B., and Branigan, C. Positive emotions broaden the scope of attention and thought-action repertoires. Cognition and Emotion 19, 3 (2005), 313--332.","paperID":"None"},{"content":"Gasper, K., and Clore, G. Attending to the big picture: Mood and global versus local processing of visual information. Psychological Science 13, 1 (2002), 34--40.","paperID":"None"},{"content":"Goeritz, A. S. The induction of mood via the www. Motivation and Emotion 31, 1 (2007), 35--47.","paperID":"None"},{"content":"Green, T., and Fisher, B. Towards the personal equation of interaction: The impact of personality factors on visual analytics interface interaction. IEEE VAST (2010), 203--210.","paperID":"None"},{"content":"Harrison, L., Chang, R., and Lu, A. Exploring the impact of emotion on visual judgement. IEEE VAST (2012).","paperID":"None"},{"content":"Jeffrey Heer , Michael Bostock, Crowdsourcing graphical perception: using mechanical turk to assess visualization design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753357"},{"content":"Hermans, D., Houwer, J. D., and Eelen, P. A time course analysis of the affective priming effect. Cognition and Emotion 15, 2 (2001), 143--165.","paperID":"None"},{"content":"Hollands, J., and Spence, I. Judging proportion with graphs: The summation model. Applied Cognitive Psychology 12, 2 (1998), 173--190.","paperID":"None"},{"content":"Jessica Hullman , Eytan Adar , Priti Shah, Benefitting InfoVis with Visual Difficulties, IEEE Transactions on Visualization and Computer Graphics, v.17 n.12, p.2213-2222, December 2011","paperID":"2068622"},{"content":"Jessica Hullman , Eytan Adar , Priti Shah, The impact of social information on visual judgments, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979157"},{"content":"Isen, A. Positive affect facilitates creative problem solving. Journal of Personality and Social Psychology 52, 6 (1987), 1122--1131.","paperID":"None"},{"content":"Isen, A. The influence of positive affect on clinical problem solving. Medical Decision Making 11, 3 (1991), 221--227.","paperID":"None"},{"content":"Johnson-Laird, P., and Oatley, K. Cognitive and social construction in emotion. Handbook of Emotions, 2nd ed. (2000), 458.","paperID":"None"},{"content":"Klein, K., and Boals, A. Expressive writing can increase working memory capacity. Journal of Experimental Psychology 130, 3 (2001), 520--533.","paperID":"None"},{"content":"Lang, P., Bradley, M., and Cuthbert, B. International affective picture system: Affective ratings of pictures and instruction manual. NIMH Center for the Study of Emotion & Attention (2008).","paperID":"None"},{"content":"Larsen, R., and Fredrickson, B. Measurement issues in emotion research. 2003, 40--60.","paperID":"None"},{"content":"Sheena Lewis , Mira Dontcheva , Elizabeth Gerber, Affective computational priming and creativity, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979048"},{"content":"Ian J. Livingston , Lennart E. Nacke , Regan L. Mandryk, Influencing experience: the effects of reading game reviews on player experience, Proceedings of the 10th international conference on Entertainment Computing, October 05-08, 2011, Vancouver, Canada","paperID":"2176597"},{"content":"Loewenstein, G., and Lerner, J. S. The role of affect in decison making. Oxford University Press, 2003, 619--642.","paperID":"None"},{"content":"Jock Mackinlay , Pat Hanrahan , Chris Stolte, Show Me: Automatic Presentation for Visual Analysis, IEEE Transactions on Visualization and Computer Graphics, v.13 n.6, p.1137-1144, November 2007","paperID":"1313140"},{"content":"Mason, W., and Suri, S. Conducting behavioral research on amazons mechanical turk. Behavior Research Methods 44, 1 (2012), 1--23.","paperID":"None"},{"content":"Phelps, E., and Carrasco, M. Emotion facilitates perception and potentiates the perceptual benefits of attention. Psychological Science 17, 4 (2006), 292--299.","paperID":"None"},{"content":"Picard, R., and Daily, S. Evaluating affective interactions: Alternatives to asking what users feel. CHI Workshop on Evaluating Affective Interfaces: Innovative Approaches (2005).","paperID":"None"},{"content":"Picard, R., and Scheirer, J. The galvactivator: A glove that senses and communicates skin conductivity. ACM CHI (2001), 1538--1542.","paperID":"None"},{"content":"Pourtois, G., Thut, G., de Peralta, R. G., Michel, C., and Vuilleumier, P. Two electrophysiological stages of spatial orienting towards fearful faces: Early temporo-parietal activation preceding gain control in extrastriate visual cortex. Neuroimage 26, 1 (2005), 149--163.","paperID":"None"},{"content":"Rowe, G., Hirsh, J., and Anderson, A. Positive affect increases the breadth of attentional selection. Proceedings of the National Academy of Sciences (PNAS) 104, 1 (2007), 383--388.","paperID":"None"},{"content":"Shackman, A., Sarinopoulos, I., Maxwell, J., Pizzagalli, D., Lavric, A., and Davidson, R. Anxiety selectively disrupts visuospatial working memory. Emotion 6, 1 (2006), 40--61.","paperID":"None"},{"content":"Swinyard, W. The effects of mood, involvement, and quality of store experience on shopping intentions. Journal of Consumer Research (1993), 271--280.","paperID":"None"},{"content":"Thompson, E. R. Development and validation of an internationally reliable short-form of the positive and negative affect schedule (panas). Journal of Cross-Cultural Psychology 38, 2 (2007), 227--242.","paperID":"None"},{"content":"Verheyen, C., and Goeritz, A. Plain texts as an online mood-induction procedure. Social Psychology 40, 1 (2009), 6--15.","paperID":"None"},{"content":"Vogel, E., McCollough, A., and Machizawa, M. Neural measures reveal individual differences in controlling access to working memory. Nature 438, 7067 (2005), 500--503.","paperID":"None"},{"content":"Vuilleumier, P., and Driver, J. Modulation of visual processing by attention and emotion: Windows on causal interactions between human brain regions. Philosophical Transactions: Biological Sciences 362, 1481 (2007), 837--855.","paperID":"None"},{"content":"Vuilleumier, P., and Huang, Y.-M. Emotional attention: Uncovering the mechanisms of affective biases in perception. Current Directions in Psychological Science 18, 3 (2009), 148--152.","paperID":"None"},{"content":"Ziemkiewicz, C., Crouser, R. J., Su, S., Yauilla, A. R., Ribarsky, W., and Chang, R. How locus of control influences compatibility with visualization style. IEEE VAST (2011), 81--90.","paperID":"None"},{"content":"Caroline Ziemkiewicz , Robert Kosara, Preconceptions and individual differences in understanding visual metaphors, Proceedings of the 11th Eurographics / IEEE - VGTC conference on Visualization, June 10-12, 2009, Berlin, Germany","paperID":"2421931"}],"abstract":"Recent research suggests that individual personality differences can influence performance with visualizations. In addition to stable personality traits, research in psychology has found that temporary changes in affect (emotion) can also significantly impact performance during cognitive tasks. In this paper, we show that affective priming also influences user performance on visual judgment tasks through an experiment that combines affective priming with longstanding graphical perception experiments. Our results suggest that affective priming can influence accuracy in common graphical perception tasks. We discuss possible explanations for these findings, and describe how these findings can be applied to design visualizations that are less (or more) susceptible to error in common visualization contexts.","video":"http://www.youtube.com/embed/KtMPRvzLABs?rel=0","title":"Influencing visual judgment through affective priming","filename":"CHI13/p2949","authors":["Lane Harrison","Drew Skau","Steven Franconeri","Aidong Lu","Remco Chang"],"conference":"CHI '13"}