{"paperId":2481326,"reference":[{"content":"Albarracin, D., & Mitchell, A. L. The role of defensive confidence in preference for proattitudinal information: How believing that one is strong can sometimes be a defensive weakness. Personality and Social Psychology Bulletin 30 (2004), 1565--1584.","paperID":"None"},{"content":"Case, D. O., Andrews, J, Johnson, J, Allard, S. Avoiding versus Seeking: the Relationship of Information Seeking to Avoidance, Blunting, Coping, Dissonance, and Related Concepts. Journal of Medical Library Association 93, 3 (2005), 353--362.","paperID":"None"},{"content":"Cronbach, L. J., Coefficient Alpha and The Internal Structure of Tests. Psychometrika 16, 3 (1951), 297--334.","paperID":"None"},{"content":"Dutta-Bergman, M. J. Complementarity in Consumption of News Types Across Traditional and New Media. Journal of Broadcasting & Electronic Media 48, 1 (2010), 41--60.","paperID":"None"},{"content":"Siamak Faridani , Ephrat Bitton , Kimiko Ryokai , Ken Goldberg, Opinion space: a scalable tool for browsing online comments, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753502"},{"content":"Fischer, P., Kastenmuller, A., Greitemeyer, T., Fischer, J., Frey, D. Threat and Selective Exposure: The Moderating Role of Threat and Decision Context on Confirmatory Information Search After Decision. Journal of Experimental Psychology: General 140, 1 (2011). 51--62.","paperID":"None"},{"content":"Fischer, P., & Ai, A. International terrorism and mental health: Recent research and future directions. Journal of Interpersonal Violence 23(2008), 339--361.","paperID":"None"},{"content":"Frey, D. Recent Research on Selective Exposure to Information. Advances in Experimental Social Psychology 19(1986), 41--80.","paperID":"None"},{"content":"Garrett, R. K. \"Echo chambers online?: Politically motivated selective exposure among Internet news users,\" Journal of Computer Mediated Communication 14, 2(2009), 265--285.","paperID":"None"},{"content":"Garrett, R., Resnick, P. Resisting Political Fragmentation on the Internet. Daedalus 140, 4 (2011) 108--120.","paperID":"None"},{"content":"Hart, W., Albarracin, D., Eagly, A., Brechan, I., Lindberg, M., Feeling Validated Versus Being Correct: A Meta-Analysis of Selective Exposure to Information. Psychological Bulletin 135, 4 (2009), 555--588.","paperID":"None"},{"content":"Himmelfarb, S. The measurement of attitudes. In A. H. Eagly & S. Chaiken (Eds.), Psychology of Attitudes (1993), 23--88. Thomson/Wadsworth.","paperID":"None"},{"content":"Jiang, Y., Liao, Q., Cheng, Q., Berlin, R., Schatz, B. Designing and Evaluating a Clustering System for Organizing and Integrating Patient Drug Outcomes in Personal Health Messages. In Proc. AMIA 2012.","paperID":"None"},{"content":"Johnson, B. J. & Eagly, A. Effects of Involvement on Persuasion: A Meta-Analysis. Psychological Bulletin, 106, 2(1989), 290--314.","paperID":"None"},{"content":"Travis Kriplean , Jonathan Morgan , Deen Freelon , Alan Borning , Lance Bennett, Supporting reflective public thought with considerit, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145249"},{"content":"Jennifer Mankoff , Kateryna Kuksenok , Sara Kiesler , Jennifer A. Rode , Kelly Waldman, Competing online viewpoints and models of chronic illness, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979027"},{"content":"Sean A. Munson , Paul Resnick, Presenting diverse political opinions: how and how much, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753543"},{"content":"Oh, A., Lee, H., Kim, Y. User Evaluation of a System for Classifying and Displaying Political Viewpoints of Weblogs. In Proc. ICWSM 2009, 282--285.","paperID":"None"},{"content":"Eli Pariser, The Filter Bubble: What the Internet Is Hiding from You, Penguin Group , The, 2011","paperID":"2029079"},{"content":"Souneil Park , Seungwoo Kang , Sangyoung Chung , Junehwa Song, NewsCube: delivering multiple aspects of news to mitigate media bias, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518772"},{"content":"Petty, R. E., & Cacioppo, J. Communication and Persuasion: Central and Peripheral Routes to Attitude Change. New York: Springer-Verlag, 1986.","paperID":"None"},{"content":"Petty, R. E. & Cacioppo, J. Involvement and Persuasion: Tradition Versus Integration. Psychological Bulletin 107,3 (1990), 367--374.","paperID":"None"},{"content":"Cass R. Sunstein, Republic.com, Princeton University Press, Princeton, NJ, 2002","paperID":"515445"},{"content":"Valentino, N. A., Banks, A., Hutchings, V., Davis, A. Selective Exposure in the Internet Age: The Interaction between Anxiety and Information Utility. Political Psychology 30, 4 (2006) 591--613.","paperID":"None"},{"content":"Vydiswaran, V., Zhai, C., Roth, D., Pirolli, P. Unbiased Learning of Controversial Topics. In Proc. ASIST2012.","paperID":"None"},{"content":"Koji Yatani , Michael Novati , Andrew Trusty , Khai N. Truong, Review spotlight: a user interface for summarizing user-generated reviews using adjective-noun word pairs, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979167"}],"abstract":"We investigated participants' preferential selection of information and their attitude moderation in an online environment. Results showed that even when opposing views were presented side-to-side, people would still preferentially select information that reinforced their existing attitudes. Preferential selection of information was, however, influenced by both situational (e.g., perceived threat) and personal (e.g., topic involvement) factors. Specifically, perceived threat induced selective exposure to attitude consistent information for topics that participants had low involvement. Participants had a higher tendency to select peer user opinions in topics that they had low than high involvement, but only when there was no perception of threat. Overall, participants' attitudes were moderated after being exposed to diverse views, although high topic involvement led to higher resistance to such moderation. Perceived threat also weakened attitude moderation, especially for low involvement topics. Results have important implication to the potential effects of \"information bubble\" - selective exposure can be induced by situational and personal factors even when competing views are presented side-by-side.","citation":[{"content":"Eduardo Graells-Garrido , Mounia Lalmas , Daniele Quercia, People of opposing views can share common interests, Proceedings of the companion publication of the 23rd international conference on World wide web companion, April 07-11, 2014, Seoul, Korea","paperID":"2577368"},{"content":"Elad Yom-Tov , Susan Dumais , Qi Guo, Promoting Civil Discourse Through Search Engine Diversity, Social Science Computer Review, v.32 n.2, p.145-154, April     2014","paperID":"2608827"},{"content":"Q. Vera Liao , Wai-Tat Fu, Can you hear me now?: mitigating the echo chamber effect by source position indicators, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531711"},{"content":"Engin Bozdag , Jeroen Hoven, Breaking the filter bubble: democracy and design, Ethics and Information Technology, v.17 n.4, p.249-265, December  2015","paperID":"2887443"},{"content":"Elaheh Momeni , Claire Cardie , Nicholas Diakopoulos, A Survey on Assessment and Ranking Methodologies for User-Generated Content on the Web, ACM Computing Surveys (CSUR), v.48 n.3, p.1-49, February 2016","paperID":"2811282"},{"content":"Ryen W. White , Eric Horvitz, Belief Dynamics and Biases in Web Search, ACM Transactions on Information Systems (TOIS), v.33 n.4, p.1-46, May 2015","paperID":"2746229"}],"title":"Beyond the filter bubble: interactive effects of perceived threat and topic involvement on selective exposure to information","filename":"CHI13/p2359","authors":["Q. Vera Liao","Wai-Tat Fu"],"conference":"CHI '13"}