{"paperId":2481341,"reference":[{"content":"Ajzen, I. The theory of planned behavior. Organizational Behav. and Humn Decisn. Proc. 50, 2 (1991), 179--211.","paperID":"None"},{"content":"Entermt. Softw. Ass. Essential facts about the computer and video game industry. Entermt Softwa. Ass.1, (2012).","paperID":"None"},{"content":"Bandura, A. Self-efficacy: Toward a unifying theory of behavioral change. Psych. Rev. 84, 2 (1977), 191--215.","paperID":"None"},{"content":"Richard Bartle, Designing Virtual Worlds, New Riders Games, 2003","paperID":"1196681"},{"content":"Bartle, R. Heart, clubs, diamonds, spades: Players who suit MUDS. J. of MUD Research I, 1 (1996).","paperID":"None"},{"content":"Chris Bateman , Lennart E. Nacke, The neurobiology of play, Proceedings of the International Academic Conference on the Future of Game Design and Technology, May 06-07, 2010, Vancouver, British Columbia, Canada","paperID":"1920780"},{"content":"B. J. Fogg , Jonathan Grudin , Jakob Nielsen , Stuart Card, Persuasive Technology: Using Computers to Change What We Think and Do, Science & Technology Books, 2002","paperID":"640634"},{"content":"Bogost, I. Persuasive Games on Mobile Devices. Fogg, B. J.; Eckles, Dean. (ed). Mobile Persuasion, (2007).","paperID":"None"},{"content":"Chen, L. S. L. Subjective well-being: evidence from the different personality traits of online game teenager players. Cyber & beh. 11, 5 (2008), 579--81.","paperID":"None"},{"content":"Chin, W. W. The Partial Least Squares Approach to Structural Equation Modeling. Modern Methods for Business Research, 1998, 298--336.","paperID":"None"},{"content":"Chin, W. W. Frequently Asked Questions - Partial Least Squares & PLS-Graph. 2000. http://discnt.cba.uh.edu/chin/plsfaq.htm.","paperID":"None"},{"content":"Conner, M., and Norman, P. Predicting health behaviour: research and practice with social cognition models. 2005.","paperID":"None"},{"content":"Sunny Consolvo , David W. McDonald , James A. Landay, Theory-driven design strategies for technologies that support behavior change in everyday life, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518766"},{"content":"Daniels, A. C. Bringing Out the Best in People: How to Apply the Astonishing Power of Positive Reinforcement. America Media International, 2003.","paperID":"None"},{"content":"Deshpande et al. Factors influencing healthy eating habits among college students: an application of the health belief model. Health mkt qrt 26, 2 (2009), 145--64.","paperID":"None"},{"content":"Glanz, K. and Rimer, B. K. Theory at a glance: A guide for health promotion practice. Nat Inst. of Health (1995).","paperID":"None"},{"content":"Andrea Grimes , Vasudhara Kantroo , Rebecca E. Grinter, Let's play!: mobile health games for adults, Proceedings of the 12th ACM international conference on Ubiquitous computing, September 26-29, 2010, Copenhagen, Denmark","paperID":"1864370"},{"content":"Hair, J. F., Ringle, C. M., and Sarstedt, M. PLS-SEM: Indeed a Silver Bullet. J. of Marketing Theory and Practice 19, 2 (2011), 139--152.","paperID":"None"},{"content":"Henseler, J., Ringle, C. M., and Sinkovics, R. R. The use of partial least squares path modeling in international marketing. Adv. in Int. Markt 20, 20 (2009), 277--319.","paperID":"None"},{"content":"Perry R. Hinton, Spss Explained, Routledge, New York, NY, 2004","paperID":"983788"},{"content":"Hoffman, H. G., Patterson, D. R., Seibel, E., Soltani, M., Jewett-Leahy, L., and Sharar, S. R. Virtual reality pain control during burn wound debridement in the hydrotank. Clinical J. of pain 24, 4 (2008).","paperID":"None"},{"content":"Kato, P. M., Cole, S. W., Bradlyn, A. S., and Pollock, B. H. A video game improves behavioral outcomes in adolescents and young adults with cancer: a randomized trial. Pediatrics 122, 2 (2008), e305--17.","paperID":"None"},{"content":"Kato, P. M. Video games in health care: Closing the gap. Review of General Psychology 14, 2 (2010), 113--121.","paperID":"None"},{"content":"Rilla Khaled , Pippin Barr , James Noble , Ronald Fischer , Robert Biddle, Fine tuning the persuasion in persuasive games, Proceedings of the 2nd international conference on Persuasive technology, April 26-27, 2007, Palo Alto, CA, USA","paperID":"1780409"},{"content":"Rilla Khaled , Gordon Ingram, Tales from the front lines of a large-scale serious game project, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207688"},{"content":"Hadi Kharrazi , Anthony Faiola , Joseph Defazio, Healthcare Game Design: Behavioral Modeling of Serious Gaming Design for Children with Chronic Diseases, Proceedings of the 13th International Conference on Human-Computer Interaction. Part IV: Interacting in Various Application Domains, July 19-24, 2009, San Diego, CA","paperID":"1604322"},{"content":"Lennart E. Nacke , Chris Bateman , Regan L. Mandryk, BrainHex: preliminary results from a neurobiological gamer typology survey, Proceedings of the 10th international conference on Entertainment Computing, October 05-08, 2011, Vancouver, Canada","paperID":"2176623"},{"content":"Rita Orji , Regan L. Mandryk , Julita Vassileva, Towards a data-driven approach to intervention design: a predictive path model of healthy eating determinants, Proceedings of the 7th international conference on Persuasive Technology: design for health and safety, p.203-214, June 06-08, 2012, Linköping, Sweden","paperID":"2363250"},{"content":"Orji, R., Vassileva, J., and Mandryk, R. L. LunchTime: a slow-casual game for long-term dietary behavior change. Personal and Ubiquitous Computing, (2012).","paperID":"None"},{"content":"Peng, W. Design and evaluation of a computer game to promote a healthy diet for young adults. Health communication 24, 2 (2009), 115--27.","paperID":"None"},{"content":"Prochaska, J. O., DiClemente, C. C., and Norcross, J. C. In Search of How People Change Applications to Additive Behaviors. Amer psy. 47, 9 (1992), 1102 --1114.","paperID":"None"},{"content":"Ringle, C. M., Wende, S., and Becker, J. smartpls.de - next generation path modeling. Accessed August, 2012 http://www.smartpls.de/forum/contact.php.","paperID":"None"},{"content":"Rosenstock, I. M. Why people use health services. The Milbank Memorial Fund quart 44, 3 (1966), 94--127.","paperID":"None"},{"content":"Sapp, S. G. and Jensen, H. H. An Evaluation of the Health Belief Model for Predicting Perceived and Actual Dietary Quality1. Journal of Applied Social Psychology 28, 3 (1998), 235--248.","paperID":"None"},{"content":"Andrew J. Setterstrom , John M. Pearson , Hassan Aleassa, An Exploratory Examination of Antecedents to Software Piracy: A Cross-Cultural Comparison, Proceedings of the 2012 45th Hawaii International Conference on System Sciences, p.5083-5092, January 04-07, 2012","paperID":"2117342"},{"content":"Shegog, R. Application of behavioral theory in computer game design for health behavior change. Serious Game Design & Devlpt. Tech, (2010), 196--232.","paperID":"None"},{"content":"Sherman et al. Approach/Avoidance Motivation, Message Framing, and Health Behavior: Understanding the Congruency Effect. Motiv & emotion (2006), 165--169.","paperID":"None"},{"content":"Stokes, B. Videogames have changed: time to consider 'Serious Games'? The Developt Educ. J., (2005), 6--13.","paperID":"None"},{"content":"Debbe Thompson , Tom Baranowski , Richard Buday , Janice Baranowski , Victoria Thompson , Russell Jago , Melissa Juliano Griffith, Serious Video Games for Health: How Behavioral Science Guided the Development of a Serious Video Game, Simulation and Gaming, v.41 n.4, p.587-606, August    2010","paperID":"1838161"},{"content":"Wansink, B. Mindless Eating: Why We Eat More Than We Think. Bantam, 2006.","paperID":"None"},{"content":"Nick Yee , Nicolas Ducheneaut , Les Nelson, Online gaming motivations scale: development and validation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208681"},{"content":"Yee, N. Motivations for play in online games. Cyberpsychology & behavior: the impact of the Internet, multimedia and virtual reality on behavior and society 9, 6 (2006), 772--5.","paperID":"None"},{"content":"BrainHex. http://blog.brainhex.com/.","paperID":"None"},{"content":"SCVNGR's Secret Game Mechanics Playdeck - TechCrunch. techcrunch.com/2010/08/25/scvngr-gamemechanics","paperID":"None"},{"content":"GameMechanics - Gamification.org. http://gamification.org/wiki/Game_Mechanics.","paperID":"None"}],"citation":[{"content":"Michael Lankes , Wolfgang Hochleitner , Daniel Rammer , Marc Busch , Elke Mattheiss , Manfred Tscheligi, From Classes to Mechanics: Player Type Driven Persuasive Game Development, Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, October 05-07, 2015, London, United Kingdom","paperID":"2810316"},{"content":"Lindsay Reynolds , Victoria Schwanda Sosik , Dan Cosley, When Wii doesn't Fit: how non-beginners react to Wii Fit's gamification, Proceedings of the First International Conference on Gameful Design, Research, and Applications, p.111-114, October 02-04, 2013, Toronto, Ontario, Canada","paperID":"2583027"},{"content":"Elizabeth L. Murnane, Exploring a theory-guided path to the design of personal informatics and intervention technologies, Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers, September 07-11, 2015, Osaka, Japan","paperID":"2801646"},{"content":"Marc Busch , Elke Mattheiss , Rita Orji , Andrzej Marczewski , Wolfgang Hochleitner , Michael Lankes , Lennart E. Nacke , Manfred Tscheligi, Personalization in Serious and Persuasive Games and Gamified Interactions, Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, October 05-07, 2015, London, United Kingdom","paperID":"2810260"},{"content":"Andreas Komninos , Mark D. Dunlop , David Rowe , Allan Hewitt , Steven Coull, Using degraded music quality to encourage a health improving walking pace: BeatClearWalker, Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare, p.57-64, May 20-23, 2015, Istanbul, Turkey","paperID":"2826174"},{"content":"Christopher Helf , Patrick Zwickl , Helmut Hlavacs , Peter Reichl, mHealth Stakeholder Integration: A gamification-based Framework-approach towards behavioural change, Proceedings of the 13th International Conference on Advances in Mobile Computing and Multimedia, December 11-13, 2015, Brussels, Belgium","paperID":"2837153"},{"content":"Max V. Birk , Regan L. Mandryk , Matthew K. Miller , Kathrin M. Gerling, How Self-Esteem Shapes our Interactions with Play Technologies, Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, October 05-07, 2015, London, United Kingdom","paperID":"2793111"},{"content":"Kathrin Maria Gerling , Regan L. Mandryk , Max Valentin Birk , Matthew Miller , Rita Orji, The effects of embodied persuasive games on player attitudes toward people using wheelchairs, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2556962"},{"content":"Laura A. Whitlock , Anne Collins McLaughlin , William Leidheiser , Maribeth Gandy , Jason C. Allaire, Know before you go: feelings of flow for older players depends on game and player characteristics, Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play, October 19-21, 2014, Toronto, Ontario, Canada","paperID":"2658703"},{"content":"Sakib Jalil , Trina Myers , Ian Atkinson, A Meta-Synthesis of Behavioral Outcomes from Telemedicine Clinical Trials for Type 2 Diabetes and the Clinical User-Experience Evaluation (CUE), Journal of Medical Systems, v.39 n.3, p.1-21, March     2015","paperID":"2738230"},{"content":"Rob Comber , Jaz Hee-Jeong Choi , Jettie Hoonhout , Kenton O'hara, Editorial: Designing for human-food interaction: An introduction to the special issue on 'food and interaction design', International Journal of Human-Computer Studies, v.72 n.2, p.181-184, February, 2014","paperID":"2562876"},{"content":"Judith Masthoff , Julita Vassileva, Tutorial on Personalization for Behaviour Change, Proceedings of the 20th International Conference on Intelligent User Interfaces, March 29-April 01, 2015, Atlanta, Georgia, USA","paperID":"2716264"},{"content":"Rita Orji , Regan L. Mandryk, Developing culturally relevant design guidelines for encouraging healthy eating behavior, International Journal of Human-Computer Studies, v.72 n.2, p.207-223, February, 2014","paperID":"2562880"},{"content":"Rita Orji , Julita Vassileva , Regan L. Mandryk, Modeling the efficacy of persuasive strategies for different gamer types in serious games for health, User Modeling and User-Adapted Interaction, v.24 n.5, p.453-498, December  2014","paperID":"2684635"}],"abstract":"Persuasive games are an effective approach for motivating health behavior, and recent years have seen an increase in games designed for changing human behaviors or attitudes. However, these games are limited in two major ways: first, they are not based on theories of what motivates healthy behavior change. This makes it difficult to evaluate why a persuasive approach works. Second, most persuasive games treat players as a monolithic group. As an attempt to resolve these weaknesses, we conducted a large-scale survey of 642 gamers' eating habits and their associated determinants of healthy behavior to understand how health behavior relates to gamer type. We developed seven different models of healthy eating behavior for the gamer types identified by BrainHex. We then explored the differences between the models and created two approaches for effective persuasive game design based on our results. The first is a one-size-fits-all approach that will motivate the majority of the population, while not demotivating any players. The second is a personalized approach that will best motivate a particular type of gamer. Finally, to make our approaches actionable in persuasive game design, we map common game mechanics to the determinants of healthy behavior.","video":"http://www.youtube.com/embed/5hzFq695XzE?rel=0","title":"Tailoring persuasive health games to gamer type","filename":"CHI13/p2467","authors":["Rita Orji","Regan L. Mandryk","Julita Vassileva","Kathrin M. Gerling"],"conference":"CHI '13"}