{"paperId":2481285,"reference":[{"content":"Aronson, J. A pragmatic view of thematic analysis. The Qualitative Report, 2, 1 (1994), 1--3.","paperID":"None"},{"content":"Juha Arrasvuori , Hannu Korhonen , Kaisa Väänänen-Vainio-Mattila, Exploring playfulness in user experience of personal mobile products, Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction, November 22-26, 2010, Brisbane, Australia","paperID":"1952241"},{"content":"Javier A. Bargas-Avila , Kasper Hornbæk, Old wine in new bottles or novel challenges: a critical analysis of empirical studies of user experience, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979336"},{"content":"Hugh Beyer , Karen Holtzblatt, Contextual design, interactions, v.6 n.1, p.32-42, Jan./Feb. 1999","paperID":"291229"},{"content":"Buhrmester, M., Kwang, T. and Gosling, S. D. Amazon's Mechanical Turk A New Source of Inexpensive, Yet High-Quality, Data? Perspectives on Psychological Science, 6, 1 (2011), 3--5.","paperID":"None"},{"content":"Field, A. P. Discovering statistics using SPSS. SAGE publications Ltd, 2009.","paperID":"None"},{"content":"Habermas, T. and Berger, N. Retelling everyday emotional events: Condensation, distancing, and closure. Cognition and Emotion, 25, 2 (2011), 206--219.","paperID":"None"},{"content":"Marc Hassenzahl, The interplay of beauty, goodness, and usability in interactive products, Human-Computer Interaction, v.19 n.4, p.319-349, December 2004","paperID":"1466561"},{"content":"Marc Hassenzahl , Sarah Diefenbach , Anja Göritz, Needs, affect, and interactive products - Facets of user experience, Interacting with Computers, v.22 n.5, p.353-362, September, 2010","paperID":"1837814"},{"content":"Hassenzahl, M. and Monk, A. The inference of perceived usability from beauty. Human-Computer Interaction, 25, 3 (2010), 235--260.","paperID":"None"},{"content":"Hassenzahl, M. and Tractinsky, N. User experience - a research agenda. Behaviour & Information Technology, 25 2(2006), 91--99.","paperID":"None"},{"content":"Evangelos Karapanos , John Zimmerman , Jodi Forlizzi , Jean-Bernard Martens, User experience over time: an initial framework, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518814"},{"content":"Aniket Kittur , Ed H. Chi , Bongwon Suh, Crowdsourcing user studies with Mechanical Turk, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357127"},{"content":"Christopher Manning , Dan Klein, Optimization, maxent models, and conditional estimation without magic, Proceedings of the 2003 Conference of the North American Chapter of the Association for Computational Linguistics on Human Language Technology: Tutorials, p.8-8, May 27-June 01, 2003, Edmonton, Canada","paperID":"1075176"},{"content":"Hannu Korhonen , Juha Arrasvuori , Kaisa Väänänen-Vainio-Mattila, Let users tell the story: evaluating user experience with experience reports, CHI '10 Extended Abstracts on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1754101"},{"content":"Adam D. I. Kramer , Kerry Rodden, Word usage and posting behaviors: modeling blogs with unobtrusive data collection methods, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357230"},{"content":"Labov, W. The transformation of experience in narrative syntax. In, Language in the Inner City: Studies in the Black Venacular. University of Pennsylvania Press, Philadelphia, PA, 1972.","paperID":"None"},{"content":"Labov, W. and Waletzky, J. Narrative analysis: Oral versions of personal experience. In J. Helm (ed.), Essays on the Verbal and Visual Arts, 12--44. Seattle, 1967.","paperID":"None"},{"content":"John McCarthy , Peter Wright, Technology as Experience, The MIT Press, 2004","paperID":"1044942"},{"content":"Nigam, K., Lafferty, J. and McCallum, A. Using maximum entropy for text classification. In Proc. IJCAI 1999 (1999), 61--67.","paperID":"None"},{"content":"Thomas Olsson , Markus Salo, Narratives of satisfying and unsatisfying experiences of current mobile augmented reality applications, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208677"},{"content":"Bo Pang , Lillian Lee , Shivakumar Vaithyanathan, Thumbs up?: sentiment classification using machine learning techniques, Proceedings of the ACL-02 conference on Empirical methods in natural language processing, p.79-86, July 06, 2002","paperID":"1118704"},{"content":"Timo Partala , Aleksi Kallinen, Understanding the most satisfying and unsatisfying user experiences: Emotions, psychological needs, and context, Interacting with Computers, v.24 n.1, p.25-34, January, 2012","paperID":"2148387"},{"content":"Pennebaker, J. W., Chung, C. K., Ireland, M., Gonzales, A. and Booth, R. J. The development and psychometric properties of LIWC2007. www.liwc.net, 2007.","paperID":"None"},{"content":"Pennebaker, J. W., Francis, M. E. and Booth, R. J. Linguistic inquiry and word count: LIWC 2001. Erlbaum Publishers, Mahwah, NJ, 2001.","paperID":"None"},{"content":"Riessman, C. K. Narrative methods for the human sciences. SAGE, Los Angeles, 2008.","paperID":"None"},{"content":"Rime, B., Mesquita, B., Philippot, P. and Boca, S. Beyond the Emotional Event - 6 Studies on the Social Sharing of Emotion. Cognition Emotion, 5, 5-6 (1991), 435--465.","paperID":"None"},{"content":"Ryan, R. M. and Deci, E. L. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American Psychologist, 55, 1 (2000), 68--78.","paperID":"None"},{"content":"Scherer, K. R. Appraisal considered as a process of multilevel sequential checking. Appraisal processes in emotion: Theory, methods, research, 92(2001), 120.","paperID":"None"},{"content":"Lauren E. Scissors , Alastair J. Gill , Kathleen Geraghty , Darren Gergle, In CMC we trust: the role of similarity, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518783"},{"content":"Sheldon, K. M., Elliot, A. J., Kim, Y. and Kasser, T. What is satisfying about satisfying events? Testing 10 candidate psychological needs. Journal of Personality and Social Psychology, 80, 2 (2001), 325--339.","paperID":"None"},{"content":"Tausczik, Y. R. and Pennebaker, J. W. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of Language and Social Psychology, 29, 1 (2010), 24--54.","paperID":"None"},{"content":"Watson, D., Clark, L. A. and Tellegen, A. Development and validation of brief measures of positive and negative affect: The PANAS scales. Journal of Personality and Social Psychology, 54, 6 (1988), 1063--1070.","paperID":"None"}],"citation":[{"content":"Thomas Meneweger , Daniela Wurhofer , Marianna Obrist , Elke Beck , Manfred Tscheligi, Characteristics of narrative textual data linked to user experiences, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2581361"},{"content":"Sara Said Mosleh , Nele Schmidt , Tudor Teisanu , Andrés Lucero, EgoFlecto: stimulating being calm and in control through self-reflection in the context of driving, Proceedings of the 19th International Academic Mindtrek Conference, September 22-24, 2015, Tampere, Finland","paperID":"2818276"},{"content":"Livia J. Müller , Elisa D. Mekler , Klaus Opwis, Facets In HCI: Towards Understanding Eudaimonic UX -- Preliminary Findings, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2732836"},{"content":"Marianna Obrist , Alexandre N. Tuch , Kasper Hornbaek, Opportunities for odor: experiences with smell and implications for technology, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557008"},{"content":"Carine Lallemand , Vincent Koenig , Guillaume Gronier, How relevant is an expert evaluation of user experience based on a psychological needs-driven approach?, Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational, p.11-20, October 26-30, 2014, Helsinki, Finland","paperID":"2639214"},{"content":"Alexandre N. Tuch , Kasper Hornbæk, Does Herzberg's Notion of Hygienes and Motivators Apply to User Experience?, ACM Transactions on Computer-Human Interaction (TOCHI), v.22 n.4, p.1-24, July 2015","paperID":"2724710"},{"content":"Evangelos Karapanos , Pedro Teixeira , Ruben Gouveia, Need fulfillment and experiences on social media, Computers in Human Behavior, v.55 n.PB, p.888-897, February 2016","paperID":"2874143"},{"content":"Ebba Thora Hvannberg, Identifying and explicating knowledge on method transfer: a sectoral system of innovation approach, Universal Access in the Information Society, v.14 n.2, p.187-202, June      2015","paperID":"2783027"}],"abstract":"Recent research in user experience (UX) has studied narratives, users' account of their interaction with technology. It has emphasized specific constructs (e.g., affect, needs, hedonics) and their interrelation, but rarely analyzed the content of the narratives. We analyze the content and structure of 691 user-generated narratives on positive and negative experiences with technology. We use a multi-method approach consisting of manual (structural analysis of narratives) as well as of automated content analysis methods (psycholinguistic analysis and machine learning). These analyses show converging evidence that positive narratives predominantly concern social aspects such as family and friends. In addition, technology is positively experienced when it enables users to do things more efficiently or in a new way. In contrast, negative narratives often express anger and frustration due to technological failures. Our multi-method approach illustrates the potential of automated (as opposed to manual) content analysis methods for studying text-based experience reports.","video":"http://www.youtube.com/embed/EB9mJ_eomYA?rel=0","title":"Analyzing users' narratives to understand experience with interactive products","filename":"CHI13/p2079","authors":["Alexandre N. Tuch","Rune Trusell","Kasper Hornbæk"],"conference":"CHI '13"}