{"paperId":2481287,"citation":[{"content":"Jeff Sauro, SUPR-Q: a comprehensive measure of the quality of the website user experience, Journal of Usability Studies, v.10 n.2, p.68-86, February 2015","paperID":"2817317"},{"content":"Designing wearable vibrotactile notifications for information communication, International Journal of Human-Computer Studies, v.89 n.C, p.24-34, May 2016","paperID":"2905649"}],"reference":[{"content":"Bangor, A., Kortum, P.T., and Miller, J.T. An empirical evaluation of the System Usability Scale. International Journal of Human-Computer Interaction, 24 (2008), 574--594.","paperID":"None"},{"content":"Borsci, S., Federici, S., and Lauriola, M. On the dimensionality of the system usability scale: A test of alternative measurement models. Cognitive Processes, 10 (2009), 193--197.","paperID":"None"},{"content":"Brooke, J. SUS: A \"quick and dirty\" usability scale. In: Jordan, P., Thomas, B., Weerdmeester, B. (Eds.), Usability Evaluation in Industry. Taylor & Francis, London, UK, (1996) 189--194.","paperID":"None"},{"content":"Coovert, M.D., and McNelis, K. Determining the number of common factors in factor analysis: A review and program. Educational and Psychological Measurement, 48 (1988), 687--693.","paperID":"None"},{"content":"Fred D. Davis, Perceived usefulness, perceived ease of use, and user acceptance of information technology, MIS Quarterly, v.13 n.3, p.319-340, September 1989","paperID":"2017067"},{"content":"Kraig Finstad, The Usability Metric for User Experience, Interacting with Computers, v.22 n.5, p.323-327, September, 2010","paperID":"1837813"},{"content":"ISO 9241--11. Ergonomic Requirements for Office Work with Visual Display Terminals (VDTs). Part 11: Guidance on Usability, 1998.","paperID":"None"},{"content":"Lewis, J. R. Critical review of \"The Usability Metric for User Experience\". Interacting with Computers (In press).","paperID":"None"},{"content":"James R. Lewis , Jeff Sauro, The Factor Structure of the System Usability Scale, Proceedings of the 1st International Conference on Human Centered Design: Held as Part of HCI International 2009, July 19-24, 2009, San Diego, CA","paperID":"1601645"},{"content":"Pilotte, W.J., and Gable, R.K. The impact of positive and negative item stems on the validity of a computer anxiety scale. Educational and Psychological Measurement, 50 (1990), 603--610.","paperID":"None"},{"content":"Jeff Sauro , Joseph S. Dumas, Comparison of three one-question, post-task usability questionnaires, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518946"},{"content":"Jeff Sauro , James R. Lewis, Correlations among prototypical usability metrics: evidence for the construct of usability, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518947"},{"content":"Jeff Sauro , James R. Lewis, When designing usability questionnaires, does it hurt to be positive?, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979266"},{"content":"Jeff Sauro , James R. Lewis, Quantifying the User Experience: Practical Statistics for User Research, Morgan Kaufmann Publishers Inc., San Francisco, CA, 2012","paperID":"2222513"},{"content":"Schmitt N., and Stuits, D. Factors defined by negatively keyed items: The result of careless respondents? Applied Psychological Measurement, 9 (1985), 367--373.","paperID":"None"},{"content":"Stewart, T.J., and Frye, A.W. Investigating the use of negatively-phrased survey items in medical education settings: Common wisdom or common mistake? Academic Medicine, 79 (2004), S1-S3.","paperID":"None"}],"abstract":"In this paper we present the UMUX-LITE, a two-item questionnaire based on the Usability Metric for User Experience (UMUX) [6]. The UMUX-LITE items are This system's capabilities meet my requirements and This system is easy to use.\" Data from two independent surveys demonstrated adequate psychometric quality of the questionnaire. Estimates of reliability were .82 and .83 -- excellent for a two-item instrument. Concurrent validity was also high, with significant correlation with the SUS (.81, .81) and with likelihood-to-recommend (LTR) scores (.74, .73). The scores were sensitive to respondents' frequency-of-use. UMUX-LITE score means were slightly lower than those for the SUS, but easily adjusted using linear regression to match the SUS scores. Due to its parsimony (two items), reliability, validity, structural basis (usefulness and usability) and, after applying the corrective regression formula, its correspondence to SUS scores, the UMUX-LITE appears to be a promising alternative to the SUS when it is not desirable to use a 10-item instrument.","video":"http://www.youtube.com/embed/FmR6U0lLngw?rel=0","title":"UMUX-LITE: when there's no time for the SUS","filename":"CHI13/p2099","authors":["James R. Lewis","Brian S. Utesch","Deborah E. Maher"],"conference":"CHI '13"}