{"paperId":2481402,"citation":[],"reference":[{"content":"Young, K (2005) Direct from the source: the value of 'think-aloud' data in understanding learning Journal of Educational Enquiry, Vol. 6, No. 1, 19--33.","paperID":"None"},{"content":"Sara Price , Taciana Pontual Falcão, Designing for physical-digital correspondence in tangible learning environments, Proceedings of the 8th International Conference on Interaction Design and Children, June 03-05, 2009, Como, Italy","paperID":"1551826"},{"content":"Sara Price , Yvonne Rogers, Let's get physical: the learning benefits of interacting in digitally augmented physical spaces, Computers & Education, v.43 n.1-2, p.137-151, August 2004","paperID":"1006362"},{"content":"Jewitt, C. (2009) Analysis, London: Routledge.","paperID":"None"},{"content":"Druin, A. (2002). The Role of Children in the Design of Technology. Behaviour and Information Technology 22 (1): 1--25.","paperID":"None"},{"content":"Janet C. Read, Validating the Fun Toolkit: an instrument for measuring children’s opinions of technology, Cognition, Technology and Work, v.10 n.2, p.119-128, March 2008","paperID":"1356042"},{"content":"Kyronlampi-Kylmanen, T. & Maatta, K. (2011) Using children as research subjects: How to interview a child aged 5 to 7 years. Educational Research and Reviews Vol. 6 (1), pp. 87--93.","paperID":"None"},{"content":"Opdenakker, R. (2006) Advantages and Disadvantages of Four Interview Techniques in Qualitative Research. Qualitative Social Research, Vol. 7, 4, 11.","paperID":"None"},{"content":"Theobald, M. A. (2008) Methodological issues arising from videostimulated recall with young children. Australian Association for Research in Education, Brisbane.","paperID":"None"},{"content":"Pirie, S. (1996). Classroom video-recording: When, why and how does it offer a valuable data source for qualitative research? International Group for Psychology of Mathematics Education, Panama City, FL.","paperID":"None"},{"content":"Jennifer G. Sheridan , James Tompkin , Abel Maciel , George Roussos, DIY design process for interactive surfaces, Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology, p.485-493, September 01-05, 2009, Cambridge, United Kingdom","paperID":"1671074"},{"content":"Roth, W. (2009) Epistemic mediation: video data as filters for the objectification of teaching by teachers, in Goldman, Pea, Barron, & Derry (eds.) Video Research in the Learning Sciences, Routledge: New Jersey: 367--82.","paperID":"None"},{"content":"Paul Dourish, What we talk about when we talk about context, Personal and Ubiquitous Computing, v.8 n.1, p.19-30, February  2004","paperID":"2429669"}],"abstract":"The methods of data collection that we choose determine the kinds of data that we have access to, and thus shape analyses. In the context of novel interfaces where different modes, available through the environment and context, mediate the interaction, understanding methodological approaches is critical. This paper examines alternative methods of data collection for exploring student's embodied interaction with novel technology in a learning context. Specifically it analyses non-facilitated interaction in a tangible learning environment, in conjunction with three different post activity interview approaches: semi-structured interviews; semi-structured interview with video prompted recall; and interviews using the technology itself. Findings suggest that the different interview approaches change the nature of information elicited, and that non-facilitated interaction offers clearer insight into interpretation, both in terms of the meaning that emerges through, and is, therefore, embodied in the interaction, and in terms of representation, directly informing design.","video":"http://www.youtube.com/embed/AptUevhwyzA?rel=0","title":"Interview approaches to researching embodiment","filename":"CHI13/p2907","authors":["Sara Price","Carey Jewitt"],"conference":"CHI '13"}