{"paperId":2481354,"citation":[{"content":"Oliver S. Schneider , Ali Israr , Karon E. MacLean, Tactile Animation by Direct Manipulation of Grid Displays, Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2807470"}],"reference":[{"content":"Teemu Ahmaniemi , Juha Marila , Vuokko Lantz, Design of Dynamic Vibrotactile Textures, IEEE Transactions on Haptics, v.3 n.4, p.245-256, October 2010","paperID":"1920235"},{"content":"Bensmaia, S., Hollins, M., and Yau, J. Vibrotactile intensity and frequency information in the pacinian system: A psychophysical model. Perception & Psychophysics 67, 5 (2005), 828--841.","paperID":"None"},{"content":"Birnbaum, D. M., and Wanderley, M. M. A systematic approach to musical vibrotactile feedback. In Proc. ICMC, vol. 2 (2007), 397--404.","paperID":"None"},{"content":"Lorna M. Brown , Stephen A. Brewster , Helen C. Purchase, A First Investigation into the Effectiveness of Tactons, Proceedings of the First Joint Eurohaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, p.167-176, March 18-20, 2005","paperID":"1050033"},{"content":"Chafe, C. Tactile audio feedback. In Proc. ICMC (1993), 76--79.","paperID":"None"},{"content":"Angela Chang , Conor O'Sullivan, Audio-haptic feedback in mobile phones, CHI '05 Extended Abstracts on Human Factors in Computing Systems, April 02-07, 2005, Portland, OR, USA","paperID":"1056892"},{"content":"Dongju Chi , Donghyun Cho , Sungjin Oh , Kyunngkoo Jun , Yonghee You , Hwanmun Lee , Meeyoung Sung, Sound-Specific Vibration Interface using Digital Signal Processing, Proceedings of the 2008 International Conference on Computer Science and Software Engineering, p.114-117, December 12-14, 2008","paperID":"1469637"},{"content":"Gescheider, G. A. Psychophysics: The Fundamentals, 3rd ed. Lawrence Erlbaum, 1997.","paperID":"None"},{"content":"Glasberg, B. R., and Moore, B. C. J. A model of loudness applicable to time-varying sounds. Journal of Audio Engineering Society 50, 5 (2002), 331--342.","paperID":"None"},{"content":"Han, S., Song, M., and Kwahk, J. A systematic method for analyzing magnitude estimation data. International Journal of Industrial Ergonomics 23, 5-6 (1999), 513--524.","paperID":"None"},{"content":"Hollins, M., Faldowski, R., Rao, S., and Young, F. Perceptual dimensions of tactile surface texture: A multidimensional scaling analysis. Perception & Psychophysics 54, 6 (1993), 697--705.","paperID":"None"},{"content":"Hutchinson, W., and Knopoff, L. The acoustic component of western consonance. Journal of New Music Research 7, 1 (1978), 1--29.","paperID":"None"},{"content":"Inwook Hwang , Seungmoon Choi, Perceptual space and adjective rating of sinusoidal vibrations perceived via mobile device, Proceedings of the 2010 IEEE Haptics Symposium, p.1-8, March 25-26, 2010","paperID":"2192834"},{"content":"Kameoka, A., and Kuriyagawa, M. Consonance theory, part I: Consonance of dyads. The Journal of the Acoustical Society of America 45, 6 (1969), 1451--1459.","paperID":"None"},{"content":"Kameoka, A., and Kuriyagawa, M. Consonance theory, part II: Consonance of complex tones and its calculation method. The Journal of the Acoustical Society of America 45, 6 (1969), 1460--1469.","paperID":"None"},{"content":"Maria Karam , Frank A. Russo , Deborah I. Fels, Designing the Model Human Cochlea: An Ambient Crossmodal Audio-Tactile Display, IEEE Transactions on Haptics, v.2 n.3, p.160-169, July 2009","paperID":"1608739"},{"content":"Myongchan Kim , Sungkil Lee , Seungmoon Choi, Saliency-Driven tactile effect authoring for real-time visuotactile feedback, Proceedings of the 2012 international conference on Haptics: perception, devices, mobility, and communication, June 13-15, 2012, Tampere, Finland","paperID":"2345641"},{"content":"Kim, Y., Cha, J., Oakley, I., and Ryu, J. Exploring tactile movies: An initial tactile glove design and concept evaluation. IEEE MultiMedia 16, 3 (2009), 34--44.","paperID":"None"},{"content":"Klatzky, R. L., and Lederman, S. J. Tactile roughness perception with a rigid link interposed between skin and surface. Perception & Psychophysics 61, 4 (1999), 591--607.","paperID":"None"},{"content":"Konyo, M., Tadokoro, S., Yoshida, A., and Saiwaki, N. A tactile synthesis method using multiple frequency vibrations for representing virtual touch. In Proc. IROS (2005), 3965--3971.","paperID":"None"},{"content":"Kutner, M. H., Nachtsheim, C. J., Neter, J., and Li, W. Applied Linear Statistical Models, 5th ed. McGraw-Hill, 2005.","paperID":"None"},{"content":"Jaebong Lee , Jonghyun Ryu , Seungmoon Choi, Vibrotactile score: A score metaphor for designing vibrotactile patterns, Proceedings of the World Haptics 2009 - Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, p.302-307, March 18-20, 2009","paperID":"1550302"},{"content":"LG Electronics. Apparatus and method for generating vibration pattern. US Patent Application, No. 12/840,988, Jul. 21, 2010.","paperID":"None"},{"content":"Kevin A. Li , Timothy Y. Sohn , Steven Huang , William G. Griswold, Peopletones: a system for the detection and notification of buddy proximity on mobile phones, Proceedings of the 6th international conference on Mobile systems, applications, and services, June 17-20, 2008, Breckenridge, CO, USA","paperID":"1378619"},{"content":"Marshall, M. T., and Wanderley, M. M. Examining the effects of embedded vibrotactile feedback on the feel of a digital musical instrument. In Proc. NIME (2011), 399--404.","paperID":"None"},{"content":"Ryu, J., and Choi, S. posVibEditor: Graphical authoring tool of vibrotactile patterns. In Proc. HAVE, IEEE (2008), 120--125.","paperID":"None"},{"content":"Jonghyun Ryu, Psychophysical model for vibrotactile rendering in mobile devices, Presence: Teleoperators and Virtual Environments, v.19 n.4, p.364-387, August 2010","paperID":"1943107"},{"content":"Vassilakis, P. N. SRA: A web-based research tool for spectral and roughness analysis of sound signals. In Proc. SMC (2007), 319--325.","paperID":"None"},{"content":"Verrillo, R. T. Measurement of vibrotactile sensation magnitude. In Ratio Scaling of Psychological Magnitude: In Honor of the Memory of S. S. Stevens, S. J. Bolanowski and G. A. Gescheider, Eds. Lawrence Erlbaum Associates, Inc., 1991, 260--275.","paperID":"None"},{"content":"Hsin-Yun Yao , Danny Grant , Manuel Cruz, Perceived Vibration Strength in Mobile Devices: The Effect of Weight and Frequency, IEEE Transactions on Haptics, v.3 n.1, p.56-62, January 2010","paperID":"1804202"},{"content":"Yongjae Yoo , Inwook Hwang , Seungmoon Choi, Consonance perception of vibrotactile chords: a feasibility study, Proceedings of the 6th international conference on Haptic and audio interaction design, August 25-26, 2011, Kusatsu, Japan","paperID":"2033332"},{"content":"Zwicker, E., and Fastl, H. Psychoacoustics: Facts and models, 2nd ed. Springer-Verlag, 1999.","paperID":"None"}],"abstract":"In this paper, we propose a real-time perception-level audio-to-vibrotactile translation algorithm. Unlike previous signal-level conversion methods, our algorithm considers only perceptual characteristics, such as loudness and roughness, of audio and tactile stimuli. This perception-level approach allows for designing intuitive and explicit conversion models with clear understandings of their perceptual consequences. Our current implementation is tailored to accurate detection of special sound effects to provide well-synchronized audio-tactile feedback in immersive applications. We also assessed the performance of our translation algorithm in terms of the detection rate of special sound effects, computational performance, and user preference. All the experimental results supported that our algorithm works well as intended with better performance than the signal-level conversion methods, especially for games. Our algorithm can be easily realized in current products, including mobile devices, gaming devices, and 4D home theater systems, for richer user experience.","video":"http://www.youtube.com/embed/YrFXi3VToHQ?rel=0","title":"Real-time perception-level translation from audio signals to vibrotactile effects","filename":"CHI13/p2567","authors":["Jaebong Lee","Seungmoon Choi"],"conference":"CHI '13"}