{"paperId":2481397,"abstract":"HCI studies of computational change in the sciences have made important design and analytic contributions, to other fields of science and to HCI itself. But some of the longer-term effects and complexities of infrastructural change in the sciences aren't easily captured under short-term, design- or artifact-centered accounts. Drawing on extended ethnographic study of computational development in ecology, this paper explores the relationship between new computational infrastructure and the nature of ecology as a vocation: roughly, the deeply held sense of what it means to 'be' an ecologist, and to 'do' ecology. We analyze in particular the nature of the field and field work as a central site of ecological practice and identity; how new computational developments are remediating this crucial relation; and the emergent vocational values that new and more computationally-intensive forms of ecology may give rise to.","reference":[{"content":"Canfield, M. R. Field notes on science & nature. Harvard University Press, Cambridge, MA, 2011.","paperID":"None"},{"content":"Cummings, J. N. and Kiesler, S. Collaborative Research Across Disciplinary and Organizational Boundaries. Social Studies of Science 35, 5 (2005), 703--722.","paperID":"None"},{"content":"Cummings, J. N. and Kiesler, S. Coordination costs and project outcomes in multi-university collaborations. Research Policy 36, 10 (2007), 1620--1634.","paperID":"None"},{"content":"Dampier, W. A new voyage around the world. Printed for James Knapton, at the Crown in St. Paul's Churchyard, London, 1697.","paperID":"None"},{"content":"Tamara Denning , Alan Borning , Batya Friedman , Brian T. Gill , Tadayoshi Kohno , William H. Maisel, Patients, pacemakers, and implantable defibrillators: human values and security for wireless implantable medical devices, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753462"},{"content":"Duby, G. Rural economy and country life in the medieval West. University of South Carolina Press, Columbia, SC, 1968.","paperID":"None"},{"content":"Durkheim, É. The elementary forms of religious life. Free Press, New York, 1995.","paperID":"None"},{"content":"Forsythe, D. E. New Bottles, Old Wine: Hidden Cultural Assumptions in a Computerized Explanation System for Migraine Sufferers. Medical Anthropology Quarterly 10, 4 (1996), 551--574.","paperID":"None"},{"content":"Fry, J. Coordination and Control of Research Practice Across Scientific Fields: Implications for a Differentiated E-Science. In C. Hine, ed., New infrastructures for knowledge production: understanding E-science. Information Science Publishing, London, 2006, 167--188.","paperID":"None"},{"content":"Hey, A. J. G., Tansley, S., and Tolle, K. M. The fourth paradigm: data-intensive scientific discovery. Microsoft Research, Redmond, WA, 2009.","paperID":"None"},{"content":"Pamela J. Hinds , Sara Kiesler, Distributed Work, MIT Press, Cambridge, MA, 2002","paperID":"560765"},{"content":"Hine, C. Computerization Movements and Scientific Disciplines: The Reflexive Potential of New Technologies. In C. Hine, ed., New infrastructures for knowledge production: understanding E-science. Information Science Publishing, London, 2006, 26--47.","paperID":"None"},{"content":"Jackson, S. J., Edwards, P. N., Bowker, G. C., and Knobel, C. P. Understanding Infrastructure: History, Heuristics, and Cyberinfrastructure Policy. First Monday 12, 6 (2007).","paperID":"None"},{"content":"Steven J. Jackson , David Ribes , Ayse Buyuktur , Geoffrey C. Bowker, Collaborative rhythm: temporal dissonance and alignment in collaborative scientific work, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958861"},{"content":"Marina Jirotka , Rob Procter , Mark Hartswood , Roger Slack , Andrew Simpson , Catelijne Coopmans , Chris Hinds , Alex Voss, Collaboration and Trust in Healthcare Innovation: The eDiaMoND Case Study, Computer Supported Cooperative Work, v.14 n.4, p.369-398, August    2005","paperID":"1095339"},{"content":"Helena Karasti , Karen S. Baker , Florence Millerand, Infrastructure Time: Long-term Matters in Collaborative Development, Computer Supported Cooperative Work, v.19 n.3-4, p.377-415, August    2010","paperID":"1873068"},{"content":"Knorr-Cetina, K. Epistemic cultures: how the sciences make knowledge. Harvard University Press, Cambridge, MA, 1999.","paperID":"None"},{"content":"Kohler, R. E. Landscapes & labscapes: exploring the lab-field border in biology. University of Chicago Press, Chicago, 2002.","paperID":"None"},{"content":"Livingstone, D. N. Putting science in its place: geographies of scientific knowledge. University of Chicago Press, Chicago, 2003.","paperID":"None"},{"content":"Merton, R. K. Science and the Social Order. Philosophy of Science 5, 3 (1938), 321--337.","paperID":"None"},{"content":"Merton, R. K. Science and technology in a democratic order. Journal of legal and political sociology 1, (1942), 115--126.","paperID":"None"},{"content":"Millerand, F. and Bowker, G. C. Metadata Standards: Trajectories and Enactment in the Life of an Ontology. In M. Lampland and S. L. Star, eds., Standards and their stories: how quantifying, classifying, and formalizing practices shape everyday life. Cornell University Press, Ithaca, NY, 2009.","paperID":"None"},{"content":"National Science Foundation Cyberinfrastructure Council. Cyberinfrastructure Vision for 21st Century Discovery. 2007. http://www.nsf.gov/pubs/2007/nsf0728/nsf0728.pdf.","paperID":"None"},{"content":"Gary M. Olson , Judith S. Olson, Distance matters, Human-Computer Interaction, v.15 n.2, p.139-178, September 2000","paperID":"1463019"},{"content":"Ribes, D. and Finholt, T. The Long Now of Technology Infrastructure: Articulating Tensions in Development. Journal of the Association for Information Systems 10, 5 (2009).","paperID":"None"},{"content":"Shapin, S. The scientific life: a moral history of a late modern vocation. University of Chicago Press, Chicago, IL, 2008.","paperID":"None"},{"content":"Shapin, S. Never pure: historical studies of science as if it was produced by people with bodies, situated in time, space, culture, and society, and struggling for credibility and authority. Johns Hopkins University Press, Baltimore, MD, 2010.","paperID":"None"},{"content":"St. Augustine. The City of God. Modern Library, New York, 1950.","paperID":"None"},{"content":"Star, S. L. and Ruhleder, K. Steps Toward an Ecology of Infrastructure: Design and Access for Large Information Spaces. Information Systems Research 7, 1 (1996), 111--134.","paperID":"None"},{"content":"Weber, M. The vocation lectures: science as a vocation, politics as a vocation. Hackett Publishing Company, Indianapolis, IN, 2004.","paperID":"None"},{"content":"White, G. The natural history and antiquities of Selborne. T. Bensley, London, 1789.","paperID":"None"}],"citation":[{"content":"Steven J. Jackson , Syed Ishtiaque Ahmed , Md. Rashidujjaman Rifat, Learning, innovation, and sustainability among mobile phone repairers in Dhaka, Bangladesh, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598576"},{"content":"Amy Cheatle , Steven J. Jackson, Digital Entanglements: Craft, Computation and Collaboration in Fine Art Furniture Production, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675291"},{"content":"Steven J. Jackson , Sarah Barbrow, Standards and/as Innovation: Protocols, Creativity, and Interactive Systems Development in Ecology, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702564"},{"content":"David Ribes, The kernel of a research infrastructure, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531700"},{"content":"Barbara Grimpe , Mark Hartswood , Marina Jirotka, Towards a closer dialogue between policy and practice: responsible design in HCI, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557364"},{"content":"Stephanie B. Steinhardt , Steven J. Jackson, Anticipation Work: Cultivating Vision in Collective Practice, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675298"},{"content":"Steven J. Jackson , Tarleton Gillespie , Sandy Payette, The policy knot: re-integrating policy, practice and design in cscw studies of social computing, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531674"}],"title":"Infrastructure and vocation: field, calling and computation in ecology","filename":"CHI13/p2873","authors":["Steven J. Jackson","Sarah Barbrow"],"conference":"CHI '13"}