{"paperId":2481283,"citation":[{"content":"J. Eduardo Pérez , Xabier Valencia , Myriam Arrue , Julio Abascal, Elaborating a Web Interface Personalization Process, Proceedings of the XVI International Conference on Human Computer Interaction, September 07-09, 2015, Vilanova i la Geltrú, Spain","paperID":"2850403"},{"content":"S. Mittelstädt , A. Stoffel , D. A. Keim, Methods for compensating contrast effects in information visualization, Proceedings of the 16th Eurographics Conference on Visualization, June 09-13, 2014, Swansea, Wales, United Kingdom","paperID":"2854243"},{"content":"S. Mittelstädt , A. Stoffel , D. A. Keim, Methods for Compensating Contrast Effects in Information Visualization, Computer Graphics Forum, v.33 n.3, p.231-240, June 2014","paperID":"2771519"}],"reference":[{"content":"Birch, J. Diagnosis of Defective Colour Vision, 2 ed. Oxford University Press, 2001.","paperID":"None"},{"content":"Bonnardela, N., Piolata, A., and Bigot, L. L. The Impact of Colour on Website Appeal and Users' Cognitive Processes. Displays 32, 2 (2011), 69--80.","paperID":"None"},{"content":"Brettel, H., Viénot, F., and Mollon, J. D. Computerized Simulation of Color Appearance for Dichromats. JOSA A 14, 10 (1997), 2647--2655.","paperID":"None"},{"content":"Cole, B. L. The Handicap of Abnormal Colour Vision. Clinical and Experimental Optometry 87, 4-5 (2004), 258--275.","paperID":"None"},{"content":"Coursaris, C. K., Sweirenga, S. J., and Watrall, E. An Empirical Investigation of Color Temperature and Gender Effects on Web Aesthetics. Journal of Usability Studies 3, 3 (2008), 103--117.","paperID":"None"},{"content":"Dianne Cyr , Milena Head , Hector Larios, Colour appeal in website design within and across cultures: A multi-method evaluation, International Journal of Human-Computer Studies, v.68 n.1-2, p.1-21, January, 2010","paperID":"1660435"},{"content":"Eisemann, L. Pantone's Guide to Communicating with Color. Grafix Press, Ltd., 2000.","paperID":"None"},{"content":"David R. Flatla , Carl Gutwin, \"So that's what you see\": building understanding with personalized simulations of colour vision deficiency, Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility, October 22-24, 2012, Boulder, Colorado, USA","paperID":"2384946"},{"content":"Frey, B. J., and Dueck, D. Clustering by Passing Messages Between Data Points. Science 315, 5814 (2007), 972--976.","paperID":"None"},{"content":"Gorn, G. J., Chattopadhyay, A., Sengupta, J., and Tripathi, S. Waiting for the Web: How Screen Color Affects Time Perception. Journal of Marketing Research 41, 2 (2004), 215--225.","paperID":"None"},{"content":"Gerald J. Gorn , Amitava Chattopadhyay , Tracey Yi , Darren W. Dahl, Effects of color as an executional cue in advertising: they're in the shade, Management Science, v.43 n.10, p.1387-1400, Oct. 1997","paperID":"278407"},{"content":"Greenfield, G. R., and House, D. H. Image Recoloring Induced by Palette Color Associations. In Proc. WSCG (2003), 189--196.","paperID":"None"},{"content":"Hall, R., and Hanna, P. The Impact of Web Page Text-Background Colour Combinations on Readability, Retention, Aesthetics and Behavioural Intention. Behaviour & Information Technology 23, 3 (2004), 183--195.","paperID":"None"},{"content":"Hardy, L. H., Rand, G., and Rittler, M. C. HRR Polychromatic Plates. JOSA 44, 7 (1954), 509--521.","paperID":"None"},{"content":"Gennaro Iaccarino , Delfina Malandrino , Vittorio Scarano, Personalizable edge services for web accessibility, Proceedings of the 2006 international cross-disciplinary workshop on Web accessibility (W4A): Building the mobile web: rediscovering accessibility?, May 22-22, 2006, Edinburgh, UK","paperID":"1133224"},{"content":"Manabu Ichikawa , Kiyoshi Tanaka , Shoji Kondo , Koji Hiroshima , Kazuo Ichikawa , Shoko Tanabe , Kiichiro Fukami, Web-page color modification for barrier-free color vision with genetic algorithm, Proceedings of the 2003 international conference on Genetic and evolutionary computation: PartII, July 12-16, 2003, Chicago, IL, USA","paperID":"1756698"},{"content":"Jacobs, K. W., and Frank E. Hustmyer, J. Effects of Four Psychological Primary Colors on GSR, Heart Rate and Respiration Rate. Perceptual and Motor Skills 38, 3 (1974), 763--766.","paperID":"None"},{"content":"Giovane R. Kuhn , Manuel M. Oliveira , Leandro A.  F. Fernandes, An Efficient Naturalness-Preserving Image-Recoloring Method for Dichromats, IEEE Transactions on Visualization and Computer Graphics, v.14 n.6, p.1747-1754, November 2008","paperID":"1477391"},{"content":"Gary W. Meyer , Donald P. Greenberg, Color-Defective Vision and Computer Graphics Displays, IEEE Computer Graphics and Applications, v.8 n.5, p.28-40, September 1988","paperID":"617431"},{"content":"J. Nam , Yong Man Ro , Y. Huh , M. Kim, Visual content adaptation according to user perception characteristics, IEEE Transactions on Multimedia, v.7 n.3, p.435-445, June 2005","paperID":"2219438"},{"content":"Ou, L., Luo, M., Woodcock, A., and Wright, A. A Study of Colour Emotion and Colour Preference. Part I: Colour Emotions for Single Colors. Color Research & Application 29, 3 (2004), 232--240.","paperID":"None"},{"content":"Erik Reinhard , Michael Ashikhmin , Bruce Gooch , Peter Shirley, Color Transfer between Images, IEEE Computer Graphics and Applications, v.21 n.5, p.34-41, September 2001","paperID":"618848"},{"content":"Solli, M., and Lenz, R. Color Emotions for Image Classification and Retrieval. In Proc. CGIV (2008).","paperID":"None"},{"content":"Maureen Stone, Field Guide to Digital Color, A. K. Peters, Ltd., Natick, MA, 2002","paperID":"863149"},{"content":"Valdez, P., and Mehrabian, A. Effects of Color on Emotions. Journal of Experimental Psychology 123, 4 (1994), 394--409.","paperID":"None"},{"content":"Wandell, B. A. Foundations of Vision. Sinauer Associates, 1995.","paperID":"None"},{"content":"Baoyuan Wang , Yizhou Yu , Tien-Tsin Wong , Chun Chen , Ying-Qing Xu, Data-driven image color theme enhancement, ACM Transactions on Graphics (TOG), v.29 n.6, December 2010","paperID":"1866172"},{"content":"Chuan-Kai Yang , Li-Kai Peng, Automatic Mood-Transferring between Color Images, IEEE Computer Graphics and Applications, v.28 n.2, p.52-61, March 2008","paperID":"1399142"}],"abstract":"Colours are an important part of user experiences on the Web. Colour schemes influence the aesthetics, first impressions and long-term engagement with websites. However, five percent of people perceive a subset of all colours because they have colour vision deficiency (CVD), resulting in an unequal and less-rich user experience on the Web. Traditionally, people with CVD have been supported by recolouring tools that improve colour differentiability, but do not consider the subjective properties of colour schemes while recolouring. To address this, we developed SPRWeb, a tool that recolours websites to preserve subjective responses and improve colour differentiability - thus enabling users with CVD to have similar online experiences. To develop SPRWeb, we extended existing models of non-CVD subjective responses to CVD, then used this extended model to steer the recolouring process. In a lab study, we found that SPRWeb did significantly better than a standard recolouring tool at preserving the temperature and naturalness of websites, while achieving similar weight and differentiability preservation. We also found that recolouring did not preserve activity, and hypothesize that visual complexity influences activity more than colour. SPRWeb is the first tool to automatically preserve the subjective and perceptual properties of website colour schemes thereby equalizing the colour-based web experience for people with CVD.","video":"http://www.youtube.com/embed/GI14wP3CiAo?rel=0","title":"SPRWeb: preserving subjective responses to website colour schemes through automatic recolouring","filename":"CHI13/p2069","authors":["David R. Flatla","Katharina Reinecke","Carl Gutwin","Krzysztof Z. Gajos"],"conference":"CHI '13"}