{"paperId":2481415,"citation":[{"content":"Florian Güldenpfennig , Geraldine Fitzpatrick , Wolfgang Reitberger, Making Sense of Rich Data Collections on Mobile Devices, Proceedings of the 2014 European Conference on Cognitive Ergonomics, September 01-03, 2014, Vienna, Austria","paperID":"2637261"},{"content":"Austin Z. Henley , Scott D. Fleming, The patchworks code editor: toward faster navigation with less code arranging and fewer navigation mistakes, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557073"},{"content":"Aniket Kittur , Andrew M. Peters , Abdigani Diriye , Michael Bove, Standing on the schemas of giants: socially augmented information foraging, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531644"}],"reference":[{"content":"R. E. Anderson. (1992). Social impacts of computing: Codes of professional ethics. Social Science Computing Review 10, 2, 453--469.","paperID":"None"},{"content":"Michelle Q. Wang Baldonado , Terry Winograd, SenseMaker: an information-exploration interface supporting the contextual evolution of a user's interests, Proceedings of the ACM SIGCHI Conference on Human factors in computing systems, p.11-18, March 22-27, 1997, Atlanta, Georgia, USA","paperID":"258563"},{"content":"N. J. Belkin, R. Oddy and H. Brooks. (1982). ASK for information retrieval: Part 1. Journal of Documentation, 38(2), pp. 61--71.","paperID":"None"},{"content":"Philip Bell, Using argument representations to make thinking visible for individuals and groups, Proceedings of the 2nd international conference on Computer support for collaborative learning, p.10-19, December 10-14, 1997, Toronto, Ontario, Canada","paperID":"1599775"},{"content":"Krishna Bharat, SearchPad: explicit capture of search context to support Web search, Computer Networks: The International Journal of Computer and Telecommunications Networking, v.33 n.1-6, p.493-501, June 2000","paperID":"346339"},{"content":"Gee-Woo Bock , Robert W. Zmud , Young-Gul Kim , Jae-Nam Lee, Behavioral intention formation in knowledge sharing: examining the roles of extrinsic motivators, social-psychological factors, and organizational climate, MIS Quarterly, v.29 n.1, p.87-111, March 2005","paperID":"2017251"},{"content":"N. J. Cepeda, H. Pashler, E. Vul, J. T. Wixted, and D. Rohrer. (2006). Distributed practice in verbal recall tasks: A review and quantitative synthesis. Psychological bulletin 132, 3, 354.","paperID":"None"},{"content":"C. W. Choo, B. Detlor, and D. Turnbull. (2000). Information Seeking on the Web: An Integrated Model of Browsing and Searching. First Monday, 5(2):2000.","paperID":"None"},{"content":"Jeff Conklin , Michael L. Begeman, gIBIS: a hypertext tool for exploratory policy discussion, ACM Transactions on Information Systems (TOIS), v.6 n.4, p.303-331, Oct. 1988","paperID":"59297"},{"content":"F. I. M. Craik and R. S. Lockhart. (1972). Levels of processing: A framework for memory research. Journal of verbal learning and verbal behavior 11, 6, 671--684.","paperID":"None"},{"content":"Douglass R. Cutting , David R. Karger , Jan O. Pedersen , John W. Tukey, Scatter/Gather: a cluster-based approach to browsing large document collections, Proceedings of the 15th annual international ACM SIGIR conference on Research and development in information retrieval, p.318-329, June 21-24, 1992, Copenhagen, Denmark","paperID":"133214"},{"content":"B. Dervin. (1992). From the Mind's Eye of the User: the Sense-Making Qualitative-Quantitative Methodology. In Qualitative Research in Information Management, pp. 61--84.","paperID":"None"},{"content":"Mira Dontcheva , Steven M. Drucker , Geraldine Wade , David Salesin , Michael F. Cohen, Summarizing personal web browsing sessions, Proceedings of the 19th annual ACM symposium on User interface software and technology, October 15-18, 2006, Montreux, Switzerland","paperID":"1166273"},{"content":"Kristie Fisher , Scott Counts , Aniket Kittur, Distributed sensemaking: improving sensemaking by leveraging the efforts of previous users, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207711"},{"content":"P. Foltz T. and Landauer. (2007). Helping people find and learn from documents: Exploiting synergies between human and computer retrieval with SuperManual. In the Handbook of Latent Semantic Analysis, pp. 323--345.","paperID":"None"},{"content":"Jonathan Grudin, Why CSCW applications fail: problems in the design and evaluationof organizational interfaces, Proceedings of the 1988 ACM conference on Computer-supported cooperative work, p.85-93, September 26-28, 1988, Portland, Oregon, USA","paperID":"62273"},{"content":"Lichan Hong , Ed H. Chi , Raluca Budiu , Peter Pirolli , Les Nelson, SparTag.us: a low cost tagging system for foraging of web content, Proceedings of the working conference on Advanced visual interfaces, May 28-30, 2008, Napoli, Italy","paperID":"1385582"},{"content":"I. Hsieh-Yee. Effects of search experience and subject knowledge on the search tactics of novice and experienced searchers. JASIST, 44(3), 1993.","paperID":"None"},{"content":"http://www.pewinternet.org/Infographics/Generationaldifferences-in-online-activities.aspx"},{"content":"J. E. Hummel and K. J. Holyoak. (2003). A symbolic-connectionist theory of relational inference and generalization. Psychological Review, 110, 220--264.","paperID":"None"},{"content":"Yvonne Kammerer , Rowan Nairn , Peter Pirolli , Ed H. Chi, Signpost from the masses: learning effects in an exploratory social tag search browser, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518797"},{"content":"Atreyi Kankanhalli , Bernard Tan , Kwok-Kee Wei, Contributing knowledge to electronic knowledge repositories: an empirical investigation, MIS Quarterly, v.29 n.1, p.113-143, March 2005","paperID":"2017252"},{"content":"Paul A. Kirschner , Simon J. Buckingham Shum , Chad S. Carr, Visualizing argumentation: software tools for collaborative and educational sense-making, Springer-Verlag, London, UK, 2003","paperID":"779331"},{"content":"Gary Klein , Brian Moon , Robert R. Hoffman, Making Sense of Sensemaking 2: A Macrocognitive Model, IEEE Intelligent Systems, v.21 n.5, p.88-92, September 2006","paperID":"1176017"},{"content":"C. C. Kuhlthau. (2004). Seeking meaning: a process approach to library and information services. Inf. Res., vol. 9, no. 3.","paperID":"None"},{"content":"Kurt Luther , Scott Counts , Kristin B. Stecher , Aaron Hoff , Paul Johns, Pathfinder: an online collaboration environment for citizen scientists, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518741"},{"content":"Gary Marchionini, Information seeking in electronic environments, Cambridge University Press, New York, NY, 1995","paperID":"206740"},{"content":"David R. Millen , Jonathan Feinberg , Bernard Kerr, Dogear: Social bookmarking in the enterprise, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124792"},{"content":"Dan Morris , Meredith Ringel Morris , Gina Venolia, SearchBar: a search-centric web history for task resumption and information re-finding, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357242"},{"content":"Meredith Ringel Morris , Eric Horvitz, S3: storable, shareable search, Proceedings of the 11th IFIP TC 13 international conference on Human-computer interaction, September 01, 2007, Rio de Janeiro, Brazil","paperID":"1777011"},{"content":"NASA. (2003). NASA Task Load Index (TLX): Computerized Version (Version 2.0) {Computer Software}. Moffett Field, CA: NASA-Ames Research Center, Aerospace Human Factors Research Division","paperID":"None"},{"content":"G. Nenkov, M. Morrin, B. Schwartz, A. Ward, and J. A. Hulland. (2011). Short form of the Maximization Scale: Factor structure, reliability and validity studies. Judgment and Decision Making 3, 5 (2011), 371--388.","paperID":"None"},{"content":"P. Pirolli and S. K. Card. (2005). The sensemaking process and leverage points for analyst technology. In 2005 International Conference on Intelligence Analysis.","paperID":"None"},{"content":"P. Pirolli and S. K. Card. (1999). Information foraging. Psychological Review, 106, 643--675.","paperID":"None"},{"content":"M. C. schraefel , Yuxiang Zhu , David Modjeska , Daniel Wigdor , Shengdong Zhao, Hunter gatherer: interaction support for the creation and management of within-web-page collections, Proceedings of the 11th international conference on World Wide Web, May 07-11, 2002, Honolulu, Hawaii, USA","paperID":"511469"},{"content":"C. Shirky. (2009). Here comes everybody: The power of organizing without organizations. Penguin Group USA.","paperID":"None"},{"content":"Yan Qu, A sensemaking-supporting information gathering system, CHI '03 Extended Abstracts on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"766063"},{"content":"Yan Qu , George W. Furnas, Sources of structure in sensemaking, CHI '05 Extended Abstracts on Human Factors in Computing Systems, April 02-07, 2005, Portland, OR, USA","paperID":"1057074"},{"content":"Daniel M. Russell , Mark J. Stefik , Peter Pirolli , Stuart K. Card, The cost structure of sensemaking, Proceedings of the INTERCHI '93 conference on Human factors in computing systems, p.269-276, May 1993, Amsterdam, The Netherlands","paperID":"164922"},{"content":"P. Vakkari and N. Hakala. (2000). Changes in relevance criteria and problem stages in task performance. Journal of Documentation,56, 540--562.","paperID":"None"}],"abstract":"People spend an enormous amount of time searching for and saving information online. Existing tools capture only a small portion of the cognitive processing a user engages in while making sense of a new domain. In this paper we introduce a novel interface for capturing online information in a structured but lightweight way. We use this interface as a platform to experimentally characterize the costs and benefits of structuring information during the sensemaking process. Our results contribute empirical knowledge relevant to theories of information seeking and sensemaking, and practical implications for the development of tools to capture and share online information.","video":"http://www.youtube.com/embed/qNghWZISWz0?rel=0","title":"Costs and benefits of structured information foraging","filename":"CHI13/p2989","authors":["Aniket Kittur","Andrew M. Peters","Abdigani Diriye","Trupti Telang","Michael R. Bove"],"conference":"CHI '13"}