{"paperId":2481365,"citation":[{"content":"Petr Slovák , Greg Wadley , David Coyle , Anja Thieme , Naomi Yamashita , Reeva Lederman , Stefan schutt , Mia Doces, Developing Skills for Social and Emotional Wellbeing, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702654"},{"content":"Elizabeth Kaziunas , Ayse G. Buyuktur , Jasmine Jones , Sung W. Choi , David A. Hanauer , Mark S. Ackerman, Transition and Reflection in the Use of Health Information: The Case of Pediatric Bone Marrow Transplant Caregivers, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675276"},{"content":"Malte Paskuda , Myriam Lewkowicz, Anonymous Quorans are still Quorans, just anonymous, Proceedings of the 7th International Conference on Communities and Technologies, p.9-18, June 27-30, 2015, Limerick, Ireland","paperID":"2768551"},{"content":"Marén Schorch , Lin Wan , David William Randall , Volker Wulf, Designing for Those who are Overlooked: Insider Perspectives on Care Practices and Cooperative Work of Elderly Informal Caregivers, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819999"}],"reference":[{"content":"American Psychiatric Association, Diagnostic and Statistical Manual of Mental Disorders DSM-IV-TR Fourth Edition, 2000.","paperID":"None"},{"content":"Benazon, N. R., & Coyne, J. C. Living with a depressed spouse. Journal of Family Psychology, 14(1), (2000), 71--79.","paperID":"None"},{"content":"Timothy W. Bickmore , Suzanne E. Mitchell , Brian W. Jack , Michael K. Paasche-Orlow , Laura M. Pfeifer , Julie O'Donnell, Response to a relational agent by hospital patients with depressive symptoms, Interacting with Computers, v.22 n.4, p.289-298, July, 2010","paperID":"1808645"},{"content":"Margit Biemans , Betsy van Dijk , Pavan Dadlani , Aart van Halteren, Let's stay in touch: sharing photos for restoring social connectedness between rehabilitants, friends and family, Proceedings of the 11th international ACM SIGACCESS conference on Computers and accessibility, October 25-28, 2009, Pittsburgh, Pennsylvania, USA","paperID":"1639674"},{"content":"Eileen Brosnan , Carol Fitzpatrick , John Sharry , Richard Boyle, An evaluation of the integrated use of a multimedia storytelling system within a psychotherapy intervention for adolescents., CHI '06 Extended Abstracts on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1125576"},{"content":"Castelnuovo, G., Gaggioli, A., Mantovani, F., and Riva, G. New and old tools in psychotherapy: The use of technology for the integration of traditional clinical treatments. Psychotherapy: Theory, Research, Practice, Training 40 (1/2), (2003), 33--44.","paperID":"None"},{"content":"Connell, C., & Gibson, G. Racial ethnic and cultural differences in dementia caregiving: Review and analysis. The Gerontologist, 37(3), (1997), 355--364.","paperID":"None"},{"content":"S. Consolvo , P. Roessler , B. E. Shelton , A. LaMarca , B. Schilit , S. Bly, Technology for Care Networks of Elders, IEEE Pervasive Computing, v.3 n.2, p.22-29, April 2004","paperID":"998564"},{"content":"David Coyle , Gavin Doherty, Clinical evaluations and collaborative design: developing new technologies for mental healthcare interventions, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1519013"},{"content":"David Coyle , Gavin Doherty , Mark Matthews , John Sharry, Computers in talk-based mental health interventions, Interacting with Computers, v.19 n.4, p.545-562, July, 2007","paperID":"1275453"},{"content":"Shannon L. Currie , Patrick J. McGrath , Victor Day, Development and usability of an online CBT program for symptoms of moderate depression, anxiety, and stress in post-secondary students, Computers in Human Behavior, v.26 n.6, p.1419-1426, November, 2010","paperID":"1853488"},{"content":"Cutcliffe, John R., Jackson, Sue, Smith, Paul, and Stevenson, Chris A modified grounded theory study of how psychiatric nurses work with suicidal people. International Journal of Nursing Studies, 43 (7), (2006), 791--802.","paperID":"None"},{"content":"Czaja, S. J. and Rubert, M. P. Telecommunications technology as an aid to family caregivers of persons with dementia. Psychosomatic medicine 64, 3 (2002), 469--476.","paperID":"None"},{"content":"Doherty, G., Coyle, D., and Sharry J. \"Engagement with Online Clinical Study of a Treatment for Depression.\" Proceedings of CHI, (2012).","paperID":"None"},{"content":"Gavin Doherty , David Coyle , Mark Matthews, Design and evaluation guidelines for mental health technologies, Interacting with Computers, v.22 n.4, p.243-252, July, 2010","paperID":"1808641"},{"content":"John Duncan , L. Jean Camp , William R. Hazelwood, The portal monitor: a privacy-enhanced event-driven system for elder care, Proceedings of the 4th International Conference on Persuasive Technology, April 26-29, 2009, Claremont, California","paperID":"1541995"},{"content":"Glasr, B. G. and Strauss, A. L. The discovery of Grounded Theory: Strategies for Qualitative Research. New York: Aldine de Gruyter, 1967.","paperID":"None"},{"content":"Goss, S. and Anthony, K., Technology in Counseling and Psychotherapy; A Practitioner's Guide, Palgrave Macmillan, New York, USA, 2003.","paperID":"None"},{"content":"Gotlib, I. H. Interpersonal and cognitive aspects of depression. Current Directions in Psychological Science, 1, (1992), 149--154.","paperID":"None"},{"content":"Grunfeld, E., Coyle, D., Whelan, T., et al. Family Caregiver Burden: Results of a Longitudinal Study of Breast Cancer Patients and Their Principal Caregivers. Canadian Medical Association Journal 170, 12 (2004), 1795--1801.","paperID":"None"},{"content":"Hooley, J. M. Expressed emotion and depression: interactions between patients and high-versus lowexpresses-emotion spouses. Journal of Abnormal Psychology, 95, (1986), 237--246.","paperID":"None"},{"content":"Jacob, M., Frank, E., Kupfer, D. J., & Carpenter, L. L. Recurrent depression: An assessment of family burden and family attitudes. Journal of Clinical Psychiatry, 48, (1987), 395--400.","paperID":"None"},{"content":"Joiner, T. E. and Coyne, J. C. The interactional nature of depression. Washington, DC: American Psychology Association, 1999.","paperID":"None"},{"content":"Joiner, T. E. and Katz, J. Contagion of depressive symptoms and mood: Meta-analytic review and explanations from cognitive, behavioral, and interpersonal viewpoints. Clinical Psychology: Science and Practice, 6, (1999), 149--164.","paperID":"None"},{"content":"Kacewicz, E., Slatcher, R. B., and Pennebaker, J. W. \"Expressive Writing: An Alternative to Traditional Methods\" in Low-cost approaches to promote physical and mental health, 2007.","paperID":"None"},{"content":"Keitner, G., Ryan, C. E., Miller, I. W., and Kohn, R. Role of the family in recovery and major depression. The American Journal of Psychiatry, Vol. 152(7), (1995), 1002--1008.","paperID":"None"},{"content":"Keller M. B. The long-term treatment of depression. Journal of Clinical Psychiatry, (1999); 60, 41--48.","paperID":"None"},{"content":"Klein, D. F., Wender, P. H. Understanding depression: A complete guide to its diagnosis and treatment. Oxford University Press, 1994.","paperID":"None"},{"content":"Leslie S. Liu , Sen H. Hirano , Monica Tentori , Karen G. Cheng , Sheba George , Sun Young Park , Gillian R. Hayes, Improving communication and social support for caregivers of high-risk infants through mobile technologies, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958897"},{"content":"Montgomery, R. J. V. and Gonyea, J. G., Caregiving and the Experience of Subjective and Objective Burden. Family Relations 34, 1 (1985), 19--26.","paperID":"None"},{"content":"Elizabeth D. Mynatt , Jim Rowan , Sarah Craighill , Annie Jacobs, Digital family portraits: supporting peace of mind for extended family members, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.333-340, March 2001, Seattle, Washington, USA","paperID":"365126"},{"content":"National Institute of Mental Health, Depression, 2011.","paperID":"None"},{"content":"Mark W. Newman , Debra Lauterbach , Sean A. Munson , Paul Resnick , Margaret E. Morris, It's not that i don't have problems, i'm just not putting them on facebook: challenges and opportunities in using online social networks for health, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958876"},{"content":"Parasuraman, A., Zeithaml, V. A. and Berry, L. L. A Conceptual Model of Service Quality and Its Implications for Future Research, Journal of Marketing, (1985), 41--50.","paperID":"None"},{"content":"Percevic, R., Lambert, M. J., and Kordy, H.. Computer supported monitoring of patient treatment response. Journal of Clinical Psychology 60 (3), (2004), 285--299.","paperID":"None"},{"content":"Schulz, R. and Beach, S. R. Caregiving as a risk factor for mortality: the Caregiver Health Effects Study. JAMA: the journal of the American Medical Association 282, 23 (1999), 2215--2219.","paperID":"None"},{"content":"Schulz, R., O'Brien, A. T., Bookwala, J., and Fleissner, K. Psychiatric and physical morbidity effects of dementia caregiving: prevalence, correlates, and causes. The Gerontologist 35, 6 (1995), 771--791.","paperID":"None"},{"content":"Meredith M. Skeels , Kenton T. Unruh , Christopher Powell , Wanda Pratt, Catalyzing social support for breast cancer patients, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753353"},{"content":"Tang, K. P., Hirano, S., Cheng, K. G., & Hayes, G., Balancing caregiver and clinician needs in a mobile health informatics tool for preterm infants. Proceedings of Pervasive Computing Technologies for Healthcare. (2012), 1--8.","paperID":"None"},{"content":"World Health Organisation, The Global Burden of Disease: 2004 update. WHO Press: Geneva, Switzerland, 2008.","paperID":"None"}],"abstract":"Depression is one of the most common disabilities in developed countries. Despite its often devastating impact on families, scant research has focused on how to facilitate the well-being of family caregivers. The aim of this paper is to uncover the challenges faced by family caregivers and support their well-being with the use of technologies. To understand the emotional and social burden of caregivers and how they handle their stress, we conducted in-depth interviews with 15 individuals who have cared for a depressed family member. Our findings reveal the multifaceted dilemma of caring for a depressed family member as well as the various strategies engaged in by caregivers to improve their own situations. Based on our findings, we suggest design implications for healthcare technologies to improve the wellness of caregivers who are looking after depressed family members.","video":"http://www.youtube.com/embed/DMOVdBt9KQU?rel=0","title":"Understanding the conflicting demands of family caregivers caring for depressed family members","filename":"CHI13/p2637","authors":["Naomi Yamashita","Hideaki Kuzuoka","Keiji Hirata","Takashi Kudo"],"conference":"CHI '13"}