{"paperId":2481380,"citation":[{"content":"Stacey Kuznetsov , Scott E. Hudson , Eric Paulos, A low-tech sensing system for particulate pollution, Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction, February 16-19, 2014, Munich, Germany","paperID":"2540955"}],"reference":[{"content":"American Lung Association. http://www.cancer.org.","paperID":"None"},{"content":"Baek, S. O., Kim, Y. S., & Perry, R. (1997). Indoor air quality in homes, offices and restaurants in Korean urban areas--indoor/outdoor relationships. Atmospheric Environment, 31(4), 529--544.","paperID":"None"},{"content":"Stinne Aaløkke Ballegaard , Thomas Riisgaard Hansen , Morten Kyng, Healthcare in everyday life: designing healthcare services for daily life, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357336"},{"content":"Becker, E., Jahn, T., Stieß, I., & Wehling, P. (1997). Sustainability: A cross-disciplinary concept for social transformations. UNESCO.","paperID":"None"},{"content":"Brewer, G. D. (2005). Decision making for the environment: Social and behavioral science research priorities. National Academy Press.","paperID":"None"},{"content":"Butler, G., & Hope, T. (1995). Manage your mind: The mental fitness guide. Oxford: Oxford.","paperID":"None"},{"content":"Marshini Chetty , David Tran , Rebecca E. Grinter, Getting to green: understanding resource consumption in the home, Proceedings of the 10th international conference on Ubiquitous computing, September 21-24, 2008, Seoul, Korea","paperID":"1409668"},{"content":"Daisey, J. M., Angell, W. J., & Apte, M. G. (2003). Indoor air quality, ventilation and health symptoms in schools: an analysis of existing information. Indoor air, 13(1), 53--64.","paperID":"None"},{"content":"Daly, J, Kellehear, A, and Gliksman, M. The public health researcher: A methodological approach. (1997), Oxford University Press.","paperID":"None"},{"content":"Darby, S. (2010). Smart metering: what potential for householder engagement?. Building Research & Information, 38(5), 442--457.","paperID":"None"},{"content":"Carl DiSalvo , Illah Nourbakhsh , David Holstius , Ayça Akin , Marti Louw, The Neighborhood Networks project: a case study of critical engagement and creative expression through participatory design, Proceedings of the Tenth Anniversary Conference on Participatory Design 2008, October 01-04, 2008, Bloomington, Indiana","paperID":"1795241"},{"content":"B. J. Fogg, Persuasive technology: using computers to change what we think and do, Ubiquity, v.2002 n.December, p.2, December 1 - December 31, 2002","paperID":"763957"},{"content":"Folinsbee, L. J. (1993). Human health effects of air pollution. Environmental health perspectives, 100, 45.","paperID":"None"},{"content":"Jon Froehlich , Leah Findlater , James Landay, The design of eco-feedback technology, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753629"},{"content":"Luciano Gamberini , Anna Spagnolli , Nicola Corradi , Giulio Jacucci , Giovanni Tusa , Topi Mikkola , Luca Zamboni , Eve Hoggan, Tailoring feedback to users' actions in a persuasive game for household electricity conservation, Proceedings of the 7th international conference on Persuasive Technology: design for health and safety, p.100-111, June 06-08, 2012, Linköping, Sweden","paperID":"2363241"},{"content":"Gram-Hansse, K. (2009). Standby consumption in households analyzed with a practice theory approach. Journal of Industrial Ecology, 14(1), 150--165.","paperID":"None"},{"content":"Hargreaves, T., Nye, M., & Burgess, J. (2010). Making energy visible: A qualitative field study of how householders interact with feedback from smart energy monitors. Energy Policy, 38(10), 6111--6119.","paperID":"None"},{"content":"Harrison, P. T. C. (1997). Health impacts of indoor air pollution. Chemistry and Industry, (17), 677--81.","paperID":"None"},{"content":"Hoek, G., Kos, G., Harrison, R., de Hartog, J., Meliefste, K., ten Brink, H., ... & Hameri, K. (2008). Indoor--outdoor relationships of particle number and mass in four European cities. Atmospheric Environment, 42(1), 156--169.","paperID":"None"},{"content":"Hooker, B., Gaver, W. W., Steed, A., & Bowers, J. (2007). The pollution e-sign. In Workshop on Ubiquitous Sustainability. Ubicomp.","paperID":"None"},{"content":"Hussein, T., Glytsos, T., Ondráek, J., Dohányosová, P., }dímal, V., Hämeri, K., ... & Kulmala, M. (2006). Particle size characterization and emission rates during indoor activities in a house. Atmospheric Environment, 40(23), 4285--4307.","paperID":"None"},{"content":"Mark I. Hwang , Ron G. Thorn, The effect of user engagement on system success: a meta-analytical integration of research findings, Information and Management, v.35 n.4, p.229-336, April 5, 1999","paperID":"314789"},{"content":"Yifei Jiang , Kun Li , Lei Tian , Ricardo Piedrahita , Xiang Yun , Omkar Mansata , Qin Lv , Robert P. Dick , Michael Hannigan , Li Shang, MAQS: a mobile sensing system for indoor air quality, Proceedings of the 13th international conference on Ubiquitous computing, September 17-21, 2011, Beijing, China","paperID":"2030187"},{"content":"Jones, A. P. (1999). Indoor air quality and health. Atmospheric environment, 33(28), 4535--4564.","paperID":"None"},{"content":"Sunyoung Kim , Eric Paulos, InAir: sharing indoor air quality measurements and visualizations, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753605"},{"content":"Mølhave, L. (2004). Volatile organic compounds, indoor air quality and health. Indoor Air, 1(4), 357--376.","paperID":"None"},{"content":"Maroni, M., & Seifert, B. (1995). Indoor air quality: a comprehensive reference book (Vol. 3). Elsevier Science Limited.","paperID":"None"},{"content":"McCormack, M. C., Breysse, P. N., Matsui, E. C., Hansel, N. N., Williams, D. A., Curtin-Brosnan, J., ... & Diette, G. B. (2009). In-home particle concentrations and childhood asthma morbidity. Environmental Health Perspectives, 117(2), 294.","paperID":"None"},{"content":"Mitchell, C. S., Zhang, J. J., Sigsgaard, T., Jantunen, M., Lioy, P. J., Samson, R., & Karol, M. H. (2007). Current state of the science: health effects and indoor environmental quality. Environmental Health Perspectives, 115(6), 958.","paperID":"None"},{"content":"Greg Niemeyer , Antero Garcia , Reza Naima, Black cloud: patterns towards da future, Proceedings of the 17th ACM international conference on Multimedia, October 19-24, 2009, Beijing, China","paperID":"1631514"},{"content":"Paulos, E. (2009, October). Designing for doubt citizen science and the challenge of change. In in Engaging Data: First International Forum on the Application and Management of Personal Electronic Information. 2009: MIT.","paperID":"None"},{"content":"Paulos, E., Honicky, R. J., & Hooker, B. (2008). Citizen science: Enabling participatory urbanism. Handbook of Research on Urban Informatics, 414--436.","paperID":"None"},{"content":"James Pierce , Hronn Brynjarsdottir , Phoebe Sengers , Yolande Strengers, Everyday practice and sustainable HCI: understanding and learning from cultures of (un)sustainability, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979583"},{"content":"James Pierce , Diane J. Schiano , Eric Paulos, Home, habits, and energy: examining domestic interactions and energy consumption, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753627"},{"content":"Pope III, C. A., Ezzati, M., & Dockery, D. W. (2009). Fineparticulate air pollution and life expectancy in the USA. New England Journal of Medicine, 360(4), 376--386.","paperID":"None"},{"content":"Røpke, I. (2009). Theories of practice--New inspiration for ecological economic studies on consumption. Ecological Economics, 68(10), 2490--2497.","paperID":"None"},{"content":"Schripp, T., Wensing, M., Uhde, E., Salthammer, T., He, C., & Morawska, L. (2008). Evaluation of ultrafine particle emissions from laser printers using emission test chambers. Environmental science & technology, 42(12), 4338--4343.","paperID":"None"},{"content":"Seppänen, O. A., & Fisk, W. J. (2004). Summary of human responses to ventilation. Indoor Air, 14(s7), 102--118.","paperID":"None"},{"content":"Anna Spagnolli , Nicola Corradi , Luciano Gamberini , Eve Hoggan , Giulio Jacucci , Cecilia Katzeff , Loove Broms , Li Jonsson, Eco-Feedback on the Go: Motivating Energy Awareness, Computer, v.44 n.5, p.38-45, May 2011","paperID":"1990838"},{"content":"Strengers, Y. (2011). Negotiating everyday life: The role of energy and water consumption feedback. Journal of Consumer Culture, 319--338.","paperID":"None"},{"content":"Sundell, J. (2004). On the history of indoor air quality and health. Indoor air, 14(s7), 51--58.","paperID":"None"},{"content":"US EPA. Buildings and their Impact on the environment: A statistical summary, http://www.epa.gov/greenbuilding/pubs/ gbstats.pdf. (2009).","paperID":"None"},{"content":"Walsh, P. J., Dudney, C. S., & Copenhaver, E. D. (1983). Indoor air quality. CRC.","paperID":"None"},{"content":"Wilhite, H., & Ling, R. (1995). Measured energy savings from a more informative energy bill. Energy and buildings, 22(2), 145--155.","paperID":"None"},{"content":"Zock, J. P., Plana, E., Jarvis, D., Antó, J. M., Kromhout, H., Kennedy, S. M., ... & Kogevinas, M. (2007). The Use of Household Cleaning Sprays and Adult Asthma An International Longitudinal Study. AJRCC, 176(8), 735--741.","paperID":"None"}],"abstract":"Indoor air quality (IAQ) is important for health as people spend the majority of time indoors, and it is particularly interesting over outdoor air because it strongly ties to indoor activities. Some activities easily exacerbate IAQ, resulting in serious pollution. However, people may not notice such changes because many pollutants are colorless and odorless, while many activities are inconspicuous and routine. We implemented inAir, a system that measures and visualizes IAQ that households appropriate and integrate into everyday life. The research goals of this work include understanding the IAQ dynamics with respect to habitual behaviors and analyzing behavioral and quantitative changes towards improving IAQ by the use of inAir. From our longitudinal study for four months, we found that inAir successfully elicited the reflection upon, and the modification of habitual behaviors for healthy domestic environments, which resulted in the significant improvement of IAQ.","video":"http://www.youtube.com/embed/9NYsbuwrEIc?rel=0","title":"inAir: a longitudinal study of indoor air quality measurements and visualizations","filename":"CHI13/p2745","authors":["Sunyoung Kim","Eric Paulos","Jennifer Mankoff"],"conference":"CHI '13"}