{"paperId":2481353,"citation":[{"content":"Jochen Huber , Jun Rekimoto , Masahiko Inami , Roy Shilkrot , Pattie Maes , Wong Meng Ee , Graham Pullin , Suranga Chandima Nanayakkara, Workshop on assistive augmentation, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2560473"}],"reference":[{"content":"Durand R. Begault, 3-D sound for virtual reality and multimedia, Academic Press Professional, Inc., San Diego, CA, 1994","paperID":"184407"},{"content":"Botvinick, M., and Cohen, J. Rubber hands \"feel\" touch that eyes see. Nature 391(6669):756.","paperID":"None"},{"content":"Alan Chalmers , David Howard , Christopher Moir, Real virtuality: a step change from virtual reality, Proceedings of the 25th Spring Conference on Computer Graphics, April 23-25, 2009, Budmerice, Slovakia","paperID":"1980466"},{"content":"Colby, K. M., Hilf, F. D., Weber, S., and Kraemer, H. Turing-like Indistinguishability Tests for the Validation of a Computer Simulation of Paranoid Processes. Artificial Intelligence 3: 199--221.","paperID":"None"},{"content":"Csikszentmihalyi, M. Flow: the Psychology of Optimal Experience. Harper and Row, 1990.","paperID":"None"},{"content":"FMOD. http://www.fmod.org/","paperID":"None"},{"content":"Fuji Television, Time Trip View. http://blog.fujitv.co.jp/airmail/E20120627002.html","paperID":"None"},{"content":"Iwai, T. Another Time, Another Space. http://www.leonardo.info/gallery/gallery332/iwai.html","paperID":"None"},{"content":"Larsson, P., Västfjäll, D., and Kleiner, M. Perception of self-motion and presence in auditory virtual environments. In Proc. Seventh Annual International Workshop Presence (2004), 252--258.","paperID":"None"},{"content":"Law, A. W., Peck, B., Visell, Y., Kry, P., and Cooperstock, J. 2008. A multi-modal floor-space for experiencing material deformation underfoot in virtual reality. In Proc. IEEE HAVE'08, 126--131.","paperID":"None"},{"content":"MacDonald, J. A Conversation With My 12 Year Old Self. http://youtu.be/XFGAQrEUaeU","paperID":"None"},{"content":"Kouta Minamizawa , Yasuaki Kakehi , Masashi Nakatani , Soichiro Mihara , Susumu Tachi, TECHTILE toolkit: a prototyping tool for design and education of haptic media, Proceedings of the 2012 Virtual Reality International Conference, March 28-30, 2012, Laval, France","paperID":"2331745"},{"content":"MIRAGE: Performance Art with Substitutional Reality system. http://mirage.grinder-man.com/ (in Japanese)","paperID":"None"},{"content":"Martin Naef , Oliver Staadt , Markus Gross, Spatialized audio rendering for immersive virtual environments, Proceedings of the ACM symposium on Virtual reality software and technology, November 11-13, 2002, Hong Kong, China","paperID":"585752"},{"content":"Bernhard E. Riecke , Daniel Feuereissen , John J. Rieser, Auditory self-motion illusions (\"circular vection\") can be facilitated by vibrations and the potential for actual motion, Proceedings of the 5th symposium on Applied perception in graphics and visualization, August 09-10, 2008, Los Angeles, California","paperID":"1394309"},{"content":"Roediger, H. L., and McDermott, K. B. Creating False Memories: Remembering Words Not Presented in Lists. Journal of Experimental Psychology: Learning, Memory, and Cognition, Vol 21(4), 1995, 803--814.","paperID":"None"},{"content":"Suzuki, K., Wakisaka, S. and Fujii, N. Substitutional Reality System: A Novel Experimental Platform for Experiencing Alternative Reality. Sci. Rep. 2, 459.","paperID":"None"},{"content":"Susumu Tachi, Telexistence, World Scientific Publishing Co., Inc., River Edge, NJ, 2009","paperID":"1804529"},{"content":"Toshiki Takeuchi , Totaro Nakashima , Kunihiro Nishimura , Michitaka Hirose, PRIMA: parallel reality-based interactive motion area, ACM SIGGRAPH 2011 Posters, August 07-11, 2011, Vancouver, British Columbia, Canada","paperID":"2037805"},{"content":"Emi Tamaki , Takashi Miyaki , Jun Rekimoto, PossessedHand: a hand gesture manipulation system using electrical stimuli, Proceedings of the 1st Augmented Human International Conference, p.1-5, April 02-03, 2010, Megève, France","paperID":"1785457"},{"content":"Turing, A. M. Computing Machinery and Intelligence. Mind LIX (236): 433--460.","paperID":"None"},{"content":"Joseph Weizenbaum, ELIZA—a computer program for the study of natural language communication between man and machine, Communications of the ACM, v.9 n.1, p.36-45, Jan. 1966","paperID":"365168"}],"abstract":"We present Reality Jockey, a system that confuses the participant's perception of the reality by mixing in a recorded past-reality. The participant will be immersed in a spatialized 3D sound environment that is a mix of sounds from the reality and from the past. The sound environment from the past is augmented with haptic feedback in cross-modality. The haptic feedback is associated with certain sounds such as the vibration in the table when stuff is placed on the table to make the illusion of it happening in live. The seamless transition between live and past creates immersive experience of past events. The blending of live and past allows interactivity. To validate our system, we conducted user studies on 1) does blending live sensations improve such experiences, and 2) how beneficial is it to provide haptic feedbacks in recorded pasts. Potential applications are suggested to illustrate the significance of Reality Jockey.","video":"http://www.youtube.com/embed/0rU4Qadm7hc?rel=0","title":"Reality jockey: lifting the barrier between alternate realities through audio and haptic feedback","filename":"CHI13/p2557","authors":["Kevin Fan","Hideyuki Izumi","Yuta Sugiura","Kouta Minamizawa","Sohei Wakisaka","Masahiko Inami","Naotaka Fujii","Susumu Tachi"],"conference":"CHI '13"}