{"paperId":2556319,"abstract":"Finding balanced S-boxes with high nonlinearity and low transparency order is a difficult problem. The property of transparency order is important since it specifies the resilience of an S-box against differential power analysis. Better values for transparency order and hence improved side-channel security often imply less in terms of nonlinearity. Therefore, it is impossible to find an S-box with all optimal values. Currently, there are no algebraic procedures that can give the preferred and complete set of properties for an S-box. In this paper, we employ evolutionary algorithms to find S-boxes with desired cryptographic properties. Specifically, we conduct experiments for the 8×8 S-box case as used in the AES standard. The results of our experiments proved the feasibility of finding S-boxes with the desired properties in the case of AES. In addition, we show preliminary results of side-channel experiments on different versions of \"improved\" S-boxes.","citation":[{"content":"Stjepan Picek , Julian F. Miller , Domagoj Jakobovic , Lejla Batina, Cartesian Genetic Programming Approach for Generating Substitution Boxes of Different Sizes, Proceedings of the Companion Publication of the 2015 on Genetic and Evolutionary Computation Conference, July 11-15, 2015, Madrid, Spain","paperID":"2764698"}],"reference":[{"content":"Mitsuru Matsui , Atsuhiro Yamagishi, A new method for known plaintext attack of FEAL cipher, Proceedings of the 11th annual international conference on Theory and application of cryptographic techniques, May 24-28, 1992, Balatonfüred, Hungary","paperID":"1754958"},{"content":"Eli Biham , Adi Shamir, Differential Cryptanalysis of DES-like Cryptosystems, Proceedings of the 10th Annual International Cryptology Conference on Advances in Cryptology, p.2-21, August 11-15, 1990","paperID":"705229"},{"content":"Claude Carlet, On highly nonlinear s-boxes and their inability to thwart DPA attacks, Proceedings of the 6th international conference on Cryptology in India, December 10-12, 2005, Bangalore, India","paperID":"2113074"},{"content":"Stefan Mangard , Elisabeth Oswald , Thomas Popp, Power Analysis Attacks: Revealing the Secrets of Smart Cards (Advances in Information Security), Springer-Verlag New York, Inc., Secaucus, NJ, 2007","paperID":"1208234"},{"content":"Shannon, C.: Communication theory of secrecy systems. Bell System Technical Journal <b>28</b>(4) (1949) 656--715","paperID":"None"},{"content":"Emmanuel Prouff, DPA attacks and s-boxes, Proceedings of the 12th international conference on Fast Software Encryption, February 21-23, 2005, Paris, France","paperID":"2103299"},{"content":"Paul C. Kocher , Joshua Jaffe , Benjamin Jun, Differential Power Analysis, Proceedings of the 19th Annual International Cryptology Conference on Advances in Cryptology, p.388-397, August 15-19, 1999","paperID":"703989"},{"content":"Braeken, A.: Cryptographic Properties of Boolean Functions and S-Boxes. PhD thesis, Katholieke Universiteit Leuven (2006)","paperID":"None"},{"content":"Bernstein, D. J.: Cache-timing attacks on AES (2004)","paperID":"None"},{"content":"Millan, W., Clark, A., Dawson, E.: Heuristic Design of Cryptographically Strong Balanced Boolean Functions. In: Advances in Cryptology - EUROCRYPT '98. (1998) 489--499","paperID":"None"},{"content":"John A. Clark , Jeremy L. Jacob , Susan Stepney , Subhamoy Maitra , William Millan, Evolving Boolean Functions Satisfying Multiple Criteria, Proceedings of the Third International Conference on Cryptology: Progress in Cryptology, p.246-259, December 16-18, 2002","paperID":"716039"},{"content":"Mazumdar, B., Mukhopadhyay, D., Sengupta, I.: Design and implementation of rotation symmetric S-boxes with high nonlinearity and high DPA resilience. In: Hardware-Oriented Security and Trust (HOST), 2013 IEEE International Symposium on. (2013) 87--92","paperID":"None"},{"content":"Mazumdar, B., Mukhopadhay, D., Sengupta, I.: Constrained Search for a Class of Good Bijective S-Boxes with Improved DPA Resistivity. Information Forensics and Security, IEEE Transactions on <b>PP</b>(99) (2013) 1--1","paperID":"None"},{"content":"D. H. Wolpert , W. G. Macready, No free lunch theorems for optimization, IEEE Transactions on Evolutionary Computation, v.1 n.1, p.67-82, April 1997","paperID":"2221408"},{"content":"Paul C. Kocher, Timing Attacks on Implementations of Diffie-Hellman, RSA, DSS, and Other Systems, Proceedings of the 16th Annual International Cryptology Conference on Advances in Cryptology, p.104-113, August 18-22, 1996","paperID":"706156"},{"content":"Jean-Jacques Quisquater , David Samyde, ElectroMagnetic Analysis (EMA): Measures and Counter-Measures for Smart Cards, Proceedings of the International Conference on Research in Smart Cards: Smart Card Programming and Security, p.200-210, September 19-21, 2001","paperID":"705980"},{"content":"Yves Crama , Peter L. Hammer, Boolean Models and Methods in Mathematics, Computer Science, and Engineering, Cambridge University Press, New York, NY, 2010","paperID":"1855106"},{"content":"Guilley, S., Pacalet, R.: Differential Power Analysis Model and Some Results. In: In proceedings of CARDIS 2004, Kluwer Academic Publishers (2004) 127--142","paperID":"None"},{"content":"Weise, T. In: Global Optimization Algorithms Theory and Application. (2009)","paperID":"None"},{"content":"Agoston E. Eiben , J. E. Smith, Introduction to Evolutionary Computing, SpringerVerlag, 2003","paperID":"954563"},{"content":"Jakobovic, D., et al.: Evolutionary computation framework (January 2013)","paperID":"None"},{"content":"Boese, K. D.: Cost Versus Distance In the Traveling Salesman Problem. Technical report (1995)","paperID":"None"},{"content":"Darrell Whitley , Doug Hains , Adele Howe, Tunneling between optima: partition crossover for the traveling salesman problem, Proceedings of the 11th Annual conference on Genetic and evolutionary computation, July 08-12, 2009, Montreal, Québec, Canada","paperID":"1570026"},{"content":"Ryan, E., Azad, R., Ryan, C.: On the performance of genetic operators and the random key representation. In Keijzer, M., OâĂŹReilly, U. M., Lucas, S., Costa, E., Soule, T., eds.: Genetic Programming. Volume 3003 of Lecture Notes in Computer Science., Springer Berlin Heidelberg (2004) 162--173","paperID":"None"},{"content":"David E. Goldberg , Robert Lingle, Jr., AllelesLociand the Traveling Salesman Problem, Proceedings of the 1st International Conference on Genetic Algorithms, p.154-159, July 01, 1985","paperID":"657095"},{"content":"Syswerda, G.: Schedule optimization using genetic algorithms. In: Handbook of Genetic Algorithms. (1991) 332--349","paperID":"None"},{"content":"Lawrence Davis, Applying adaptive algorithms to epistatic domains, Proceedings of the 9th international joint conference on Artificial intelligence, p.162-164, August 18-23, 1985, Los Angeles, California","paperID":"1625164"},{"content":"Zhang, X., Zheng, Y.: GAC-the criterion of global avalanche characteristics of cryptographic functions. Journal of Universal Computer Science <b>1</b>(5) (1995) 316--333","paperID":"None"},{"content":"Burnett, L. D.: Heuristic Optimization of Boolean Functions and Substitution Boxes for Cryptography. PhD thesis, Queensland University of Technology (2005)","paperID":"None"},{"content":"Kaisa Nyberg, Perfect nonlinear S-boxes, Proceedings of the 10th annual international conference on Theory and application of cryptographic techniques, April 08-11, 1991, Brighton, UK","paperID":"1754910"},{"content":"François-Xavier Standaert , Tal G. Malkin , Moti Yung, A Unified Framework for the Analysis of Side-Channel Key Recovery Attacks, Proceedings of the 28th Annual International Conference on Advances in Cryptology: the Theory and Applications of Cryptographic Techniques, April 26-30, 2009, Cologne, Germany","paperID":"1533709"}],"title":"On using genetic algorithms for intrinsic side-channel resistance: the case of AES S-box","filename":"CS214/2556319","authors":["Stjepan Picek","Bariş Ege","Lejla Batina","Domagoj Jakobovic","Łukasz Chmielewski","Marin Golub"],"conference":"CS2 '14"}