{"paperId":2556322,"citation":[{"content":"Raphael Spreitzer , Beno®t Gérard, Towards More Practical Time-Driven Cache Attacks, Proceedings of the 8th IFIP WG 11.2 International Workshop on Information Security Theory and Practice. Securing the Internet of Things, July 02-02, 2014","paperID":"2732105"}],"abstract":"We present a cache-timing attack on the Advanced Encryption Standard (AES) [14] with the potential to be applied remotely and develop an evaluation framework for comparing the relative performance of the attacks under various simulated network conditions. We examine Bernstein's original AES cache-timing attack [3], and its variants [6, 12, 10]. We conduct an analysis of network noise and develop a hypothesis fishing concept in order to reduce the number of samples required to recover a key in our implementation of the attacks of [3]. Our rough estimate for the number of samples required is about 2 × 109 which is comparable to the estimate 4 × 109 of our month-long experiment using Bernstein's technique [3].","reference":[{"content":"O. Aciiçmez and Çetin. K. Koç. Trace-driven cache attacks on AES. IACR ePrint Archive, 2006:138, 2006.","paperID":"None"},{"content":"H. Aly and M. ElGayyar. Attacking aes using bernstein's attack on modern processors. In AFRICACRYPT, pages 127--139. 2013.","paperID":"None"},{"content":"D. J. Bernstein. Cache-timing attacks on AES. Technical report, http://cr.yp.to/antiforgery/cachetiming-20050414.pdf, 2005.","paperID":"None"},{"content":"Andrey Bogdanov , Thomas Eisenbarth , Christof Paar , Malte Wienecke, Differential cache-collision timing attacks on AES with applications to embedded CPUs, Proceedings of the 2010 international conference on Topics in Cryptology, March 01-05, 2010, San Francisco, CA","paperID":"2175128"},{"content":"J. Bonneau. Robust final-round cache-trace attacks against AES. IACR ePrint Archive, 2006:374, 2006.","paperID":"None"},{"content":"Joseph Bonneau , Ilya Mironov, Cache-collision timing attacks against AES, Proceedings of the 8th international conference on Cryptographic Hardware and Embedded Systems, October 10-13, 2006, Yokohama, Japan","paperID":"2105357"},{"content":"Scott A. Crosby , Dan S. Wallach , Rudolf H. Riedi, Opportunities and Limits of Remote Timing Attacks, ACM Transactions on Information and System Security (TISSEC), v.12 n.3, p.1-29, January 2009","paperID":"1455530"},{"content":"D. Feldman, D. F. Kune, and V. Saraswat. Feasibility of remote cache-timing attacks against AES. Technical report, University of Minnesota, 2006.","paperID":"None"},{"content":"D. Feldman, D. F. Kune, and V. Saraswat. Remote cache-timing attacks against AES. Technical report, University of Minnesota, 2007.","paperID":"None"},{"content":"C. Lauradoux. Collision attacks on processors with cache and countermeasures. WEWoRC, 5:76--85, 2005.","paperID":"None"},{"content":"M. Neve, J. Seifert, and Z. Wang. Cache time-behavior analysis on AES. Selected Area of Cryptology, 2006.","paperID":"None"},{"content":"Michael Neve , Jean-Pierre Seifert , Zhenghong Wang, A refined look at Bernstein's AES side-channel analysis, Proceedings of the 2006 ACM Symposium on Information, computer and communications security, March 21-24, 2006, Taipei, Taiwan","paperID":"1128887"},{"content":"M. Neve and K. Tiri. On the complexity of side-channel attacks on AES-256 --- methodology and quantitative results on cache attacks. IACR ePrint Archive, 2007:318, 2007.","paperID":"None"},{"content":"NIST. Advanced Encryption Standard (AES), 2001.","paperID":"None"},{"content":"D. A. Osvik, A. Shamir, and E. Tromer. Cache attacks and countermeasures: the case of AES. IACR ePrint Archive, 2005:271, 2005.","paperID":"None"},{"content":"C. Percival. Cache missing for fun and profit. In Proc. of BSDCan 2005, 2005.","paperID":"None"},{"content":"R. Spreitzer and T. Plos. On the applicability of time-driven cache attacks on mobile devices (extended version). IACR ePrint Archive, 2013:172, 2013.","paperID":"None"},{"content":"Eran Tromer , Dag Arne Osvik , Adi Shamir, Efficient Cache Attacks on AES, and Countermeasures, Journal of Cryptology, v.23 n.2, p.37-71, January 2010","paperID":"1713127"},{"content":"M. Weiß, B. Heinz, and F. Stumpf. A cache timing attack on AES in virtualization environments. In Financial Cryptography, pages 314--328, 2012.","paperID":"None"}],"title":"Remote cache-timing attacks against AES","filename":"CS214/2556322","authors":["Vishal Saraswat","Daniel Feldman","Denis Foo Kune","Satyajit Das"],"conference":"CS2 '14"}