{"paperId":2556320,"citation":[],"abstract":"This work investigates voltage attacks over the nominal voltage on CMOS digital circuits designed on advanced technology nodes. The behavior of both combinatorial and sequential logic is analyzed in presence of static and dynamic overvoltage attacks. It points out that only modifications of propagation delays occur in presence of such attacks. Timing detection circuits are then introduced to detect hold violations. These circuits offer good performance with low area overhead but their implementation require extra timing constraints on the design to protect. In addition, multiple power domain circuits must be considered to thwart overpowering attacks.","reference":[{"content":"K. Bae, S. Moon, D. Choi, Y. Choi, D.-s. Choi, and J. Ha. Differential fault analysis on AES by round reduction. In 2011 6th International Conference on Computer Sciences and Convergence Information Technology (ICCIT), pages 607--612, 2011.","paperID":"None"},{"content":"Shivam Bhasin , Nidhal Selmane , Sylvain Guilley , Jean-Luc Danger, Security evaluation of different AES implementations against practical setup time violation attacks in FPGAs, Proceedings of the 2009 IEEE International Workshop on Hardware-Oriented Security and Trust, p.15-21, July 27-27, 2009","paperID":"1634487"},{"content":"A. Djellid-Ouar, G. Cathebras, and F. Bancel. Supply voltage glitches effects on CMOS circuits. In International Conference on Design and Test of Integrated Systems in Nanoscale Technology DTIS, pages 257--261, Sept. 2006.","paperID":"None"},{"content":"D. Fujimoto, M. Nagata, T. Katashita, A. Sasaki, Y. Hori, and A. Satoh. A fast power current analysis methodology using capacitor charging model for side channel attack evaluation. In HOST, pages 87--92, 2011.","paperID":"None"},{"content":"K. Gomina, J.-B. Rigaud, P. Gendrier, P. Candelier, and A. Tria. Power analysis methodology for secure circuits. In 2013 IEEE 16th International Symposium on Design and Diagnostics of Electronic Circuits Systems (DDECS), pages 102--107, 2013.","paperID":"None"},{"content":"M. Hutter, J. Schmidt, and T. Plos. Contact-based fault injections and power analysis on RFID tags. In European Conference on Circuit Theory and Design, 2009. ECCTD 2009, pages 409--412, 2009.","paperID":"None"},{"content":"Chong Hee Kim, Improved Differential Fault Analysis on AES Key Schedule, IEEE Transactions on Information Forensics and Security, v.7 n.1, p.41-50, February 2012","paperID":"2335768"},{"content":"Nidhal Selmane , Sylvain Guilley , Jean-Luc Danger, Practical Setup Time Violation Attacks on AES, Proceedings of the 2008 Seventh European Dependable Computing Conference, p.91-96, May 07-09, 2008","paperID":"1441233"},{"content":"Keke Wu , Huiyun Li , Tingding Chen , Fengqi Yu, Electromagnetic Analysis on Elliptic Curve Cryptosystems: Measures and Counter-Measures for Smart Cards, Proceedings of the 2009 Third International Symposium on Intelligent Information Technology Application, p.40-43, November 21-22, 2009","paperID":"1680951"},{"content":"Asier Goikoetxea Yanci , Stephen Pickles , Tughrul Arslan, Characterization of a Voltage Glitch Attack Detector for Secure Devices, Proceedings of the 2009 Symposium on Bio-inspired Learning and Intelligent Systems for Security, p.91-96, August 20-21, 2009","paperID":"1724089"},{"content":"Z. Zhu, W. Liu, X. Li, L. Wu, and X. Zhang. Electromagnetic analysis and attacks system for cryptographic RFID. In 2012 IEEE 11th International Conference on Solid-State and Integrated Circuit Technology (ICSICT), pages 1--3, 2012.","paperID":"None"},{"content":"L. Zussa, J.-M. Dutertre, J. Clédière, B. Robisson, and A. Tria. Investigation of timing constraints violation as a fault injection means. In 27th Conference on Design of Circuits and Integrated Systems (DCIS), Avignon, France, 2012.","paperID":"None"}],"title":"Detecting positive voltage attacks on CMOS circuits","filename":"CS214/2556320","authors":["Kamil Gomina","Philippe Gendrier","Philippe Candelier","Jean-Baptiste Rigaud","Assia Tria"],"conference":"CS2 '14"}