{"paperId":2556350,"abstract":"This book is devoted to the Educational Data Mining arena. It highlights works that show relevant proposals, developments, and achievements that shape trends and inspire future research. After a rigorous revision process sixteen manuscripts were accepted and organized into four parts as follows: Profile: The first part embraces three chapters oriented to: 1) describe the nature of educational data mining (EDM); 2) describe how to pre-process raw data to facilitate data mining (DM); 3) explain how EDM supports government policies to enhance education. Student modeling: The second part contains five chapters concerned with: 4) explore the factors having an impact on the student's academic success; 5) detect student's personality and behaviors in an educational game; 6) predict students performance to adjust content and strategies; 7) identify students who will most benefit from tutor support; 8) hypothesize the student answer correctness based on eye metrics and mouse click. Assessment: The third part has four chapters related to: 9) analyze the coherence of student research proposals; 10) automatically generate tests based on competences; 11) recognize students activities and visualize these activities for being presented to teachers; 12) find the most dependent test items in students response data. Trends: The fourth part encompasses four chapters about how to: 13) mine text for assessing students productions and supporting teachers; 14) scan student comments by statistical and text mining techniques; 15) sketch a social network analysis (SNA) to discover student behavior profiles and depict models about their collaboration; 16) evaluate the structure of interactions between the students in social networks. This volume will be a source of interest to researchers, practitioners, professors, and postgraduate students aimed at updating their knowledge and find targets for future work in the field of educational data mining.","reference":[],"citation":[{"content":"Alejandro Peña-Ayala, Review: Educational data mining: A survey and a data mining-based analysis of recent works, Expert Systems with Applications: An International Journal, v.41 n.4, p.1432-1462, March, 2014","paperID":"2561383"}],"title":"Educational Data Mining: Applications and Trends","authors":""}