{"paperId":2556318,"abstract":"Multi-operating systems have been introduced to manage the manifold requirements of embedded systems. Especially in safety critical environments like the automotive domain the system's security must be guaranteed. Despite the state-of-the-art virtualization mechanisms, the idea of asymmetric-multi-processing can be used to split a system's hardware resources, which makes the virtualization of hardware obsolete. However, this special technique to implement a multi-operating system might add special demands to security objectives like isolation. In this paper an attack vector is shown, which utilizes a co-processor to break through the isolation of an operating system domain. Using a multi-operating system environment, we inject a malicious firmware into the co-processor in order to circumvent isolation mechanisms on behalf of an attacking operating system. Our attack vector demonstrates weaknesses in CPU centric isolation mechanisms, which will be further presented in the remainder of the document.","citation":[{"content":"Tobias Holstein , Joachim Wietzke, Contradiction of Separation through Virtualization and Inter Virtual Machine Communication in Automotive Scenarios, Proceedings of the 2015 European Conference on Software Architecture Workshops, September 07-11, 2015, Dubrovnik, Cavtat, Croatia","paperID":"2797437"}],"reference":[{"content":"I. AMD. O virtualization technology (iommu) specification. AMD Pub, (34434), 2007.","paperID":"None"},{"content":"ARM. AMBA protocol specifications. 2010.","paperID":"None"},{"content":"A. Boileau. Hit by a Bus:Physical Access Attacks with Firewire. pages 1--36, Oct. 2006.","paperID":"None"},{"content":"Joel Coburn , Srivaths Ravi , Anand Raghunathan , Srimat Chakradhar, SECA: security-enhanced communication architecture, Proceedings of the 2005 international conference on Compilers, architectures and synthesis for embedded systems, September 24-27, 2005, San Francisco, California, USA","paperID":"1086308"},{"content":"T. Committee. Tool Interface Standard (TIS) Executable and Linking Format (ELF) Specification. pages 1--37, 1995.","paperID":"None"},{"content":"DENX. Das U-Boot -- the Universal Boot Loader. Technical report, 2013.","paperID":"None"},{"content":"Leandro Fiorin , Gianluca Palermo , Slobodan Lukovic , Valerio Catalano , Cristina Silvano, Secure Memory Accesses on Networks-on-Chip, IEEE Transactions on Computers, v.57 n.9, p.1216-1229, September 2008","paperID":"1440449"},{"content":"R. Hiremane. Intel virtualization technology for directed i/o (intel vt-d). Technology@ Intel Magazine, 4(10), 2007.","paperID":"None"},{"content":"Hiroaki Inoue , Akihisa Ikeno , Masaki Kondo , Junji Sakai , Masato Edahiro, VIRTUS: a new processor virtualization architecture for security-oriented next-generation mobile terminals, Proceedings of the 43rd annual Design Automation Conference, July 24-28, 2006, San Francisco, CA, USA","paperID":"1147038"},{"content":"Wataru Kanda , Yu Murata , Tatsuo Nakajima, SIGMA System: A Multi-OS Environment for Embedded Systems, Journal of Signal Processing Systems, v.59 n.1, p.33-43, April     2010","paperID":"1743629"},{"content":"Kernel.org. Remote processor framework, 2013.","paperID":"None"},{"content":"Y. Kinebuchi, T. Morita, K. Makijima, M. Sugaya, and T. Nakajima. Constructing a multi-os platform with minimal engineering cost. pages 195--206, 2009.","paperID":"None"},{"content":"R. Mijat and A. Nightingale. Virtualization is Coming to a Platform Near You. Technical report, ARM Limited, Jan. 2011.","paperID":"None"},{"content":"J. Porquet, A. Greiner, and C. Schwarz. NoC-MPU: A secure architecture for flexible co-hosting on shared memory MPSoCs. In Design, Automation & Test in Europe Conference & Exhibition (DATE), 2011, pages 1--4. IEEE, 2011.","paperID":"None"},{"content":"Joël Porquet , Christian Schwarz , Alain Greiner, Multi-compartment: a new architecture for secure co-hosting on SoC, Proceedings of the 11th international conference on System-on-chip, p.124-127, October 05-07, 2009, Tampere, Finland","paperID":"1736555"},{"content":"F. L. Sang, E. Lacombe, V. Nicomette, and Y. Deswarte. Exploiting an I/OMMU vulnerability. pages 7--14, 2010.","paperID":"None"},{"content":"P. Schnarz and J. Wietzke. IT-securtiy properties for closed-coupled, asynchronous multi-operating systems in automotive environments. In W. A. Halang, editor, Funktionale Sicherheit, Informatik aktuell, pages 29--38. Springer Berlin Heidelberg, 2013.","paperID":"None"},{"content":"Texas Instruments, Incorporated. OMAP 5 Specifications. Technical report, 2013.","paperID":"None"},{"content":"Texas Instruments, Incorporated. Technical Reference Manual. pages 1--6107, Aug. 2013.","paperID":"None"},{"content":"Paul Willmann , Scott Rixner , Alan L. Cox, Protection strategies for direct access to virtualized I/O devices, USENIX 2008 Annual Technical Conference on Annual Technical Conference, p.15-28, June 22-27, 2008, Boston, Massachusetts","paperID":"1404016"}],"title":"Towards attacks on restricted memory areas through co-processors in embedded multi-OS environments via malicious firmware injection","filename":"CS214/2556318","authors":["Pierre Schnarz","Joachim Wietzke","Ingo Stengel"],"conference":"CS2 '14"}