{"paperId":2556974,"citation":[{"content":"Horia A. Maior , Matthew Pike , Sarah Sharples , Max L. Wilson, Examining the Reliability of Using fNIRS in Realistic HCI Settings for Spatial and Verbal Tasks, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702315"},{"content":"Jacek Gwizdka , Joemon Jose , Javed Mostafa , Max Wilson, NeuroIR 2015: Neuro-Physiological Methods in IR Research, Proceedings of the 38th International ACM SIGIR Conference on Research and Development in Information Retrieval, August 09-13, 2015, Santiago, Chile","paperID":"2767856"},{"content":"Koumei Fukahori , Daisuke Sakamoto , Takeo Igarashi, Exploring Subtle Foot Plantar-based Gestures with Sock-placed Pressure Sensors, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702308"},{"content":"Gabor Aranyi , Fred Charles , Marc Cavazza, Anger-based BCI Using fNIRS Neurofeedback, Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2807447"},{"content":"Daniel Afergan , Tomoki Shibata , Samuel W. Hincks , Evan M. Peck , Beste F. Yuksel , Remco Chang , Robert J.K. Jacob, Brain-based target expansion, Proceedings of the 27th annual ACM symposium on User interface software and technology, October 05-08, 2014, Honolulu, Hawaii, USA","paperID":"2647414"},{"content":"Nataliya Kosmyna , Franck Tarpin-Bernard , Bertrand Rivet, Adding Human Learning in Brain--Computer Interfaces (BCIs): Towards a Practical Control Modality, ACM Transactions on Computer-Human Interaction (TOCHI), v.22 n.3, p.1-37, June 2015","paperID":"2723162"}],"reference":[{"content":"Aron, A. R., Robbins, T. W., and Poldrack, R. A. Inhibition and the right inferior frontal cortex. Trends in cognitive sciences 8, 4 (2004), 170--177.","paperID":"None"},{"content":"Baddeley, A. Working memory. Science 255, 5044 (1992), 556--559.","paperID":"None"},{"content":"Baddeley, A. The episodic buffer: a new component of working memory' Trends in cognitive sciences 4, 11 (2000), 417--423.","paperID":"None"},{"content":"Baddeley, A. D. Is working memory still working' European psychologist 7, 2 (2002), 85--97.","paperID":"None"},{"content":"Baddeley, A. D., and Hitch, G. Working memory. The psychology of learning and motivation 8 (1974), 47''89.","paperID":"None"},{"content":"Braver, T. S., Cohen, J. D., Nystrom, L. E., Jonides, J., Smith, E. E., and Noll, D. C. A parametric study of prefrontal cortex involvement in human working memory. Neuroimage 5, 1 (1997), 49--62.","paperID":"None"},{"content":"Charters, E. The use of think-aloud methods in qualitative research an introduction to think-aloud methods. Brock Education (2013).","paperID":"None"},{"content":"D'Esposito, M., Detre, J. A., Alsop, D. C., Shin, R. K., Atlas, S., and Grossman, M. The neural basis of the central executive system of working memory. Nature 378, 6554 (1995), 279--281.","paperID":"None"},{"content":"Joseph S. Dumas , Janice C. Redish, A  Practical Guide to Usability Testing, Intellect Books, Exeter, UK, 1999","paperID":"600280"},{"content":"Duvinage, M., Castermans, T., Dutoit, T., Petieau, M., Hoellinger, T., Saedeleer, C., Seetharaman, K., and Cheron, G. A P300-based quantitative comparison between the Emotiv Epoc headset and a medical EEG device. In IASTED (2012).","paperID":"None"},{"content":"Ericsson, K. A., and Simon, H. A. Protocol analysis. MIT press, 1985.","paperID":"None"},{"content":"Fadiga, L., Craighero, L., and DAusilio, A. Broca's area in language, action, and music. Annals of the New York Academy of Sciences 1169, 1 (2009), 448--458.","paperID":"None"},{"content":"fNIR Devices LLC. fNIR Imager & COBI Studio Manual. Biopac, 2013.","paperID":"None"},{"content":"Gabrieli, J. D., Poldrack, R. A., and Desmond, J. E. The role of left prefrontal cortex in language and memory. Proceedings of the national Academy of Sciences 95, 3 (1998), 906--913.","paperID":"None"},{"content":"Hart, S. G., and Staveland, L. E. Development of nasa-tlx (task load index): Results of empirical and theoretical research. Human mental workload (1988).","paperID":"None"},{"content":"Morten Hertzum , Kristin D. Hansen , Hans H. K. Andersen, Scrutinising usability evaluation: does thinking aloud affect behaviour and mental workload?, Behaviour & Information Technology, v.28 n.2, p.165-181, March 2009","paperID":"1513828"},{"content":"Leanne M. Hirshfield , Erin Treacy Solovey , Audrey Girouard , James Kebinger , Robert J.K. Jacob , Angelo Sassaroli , Sergio Fantini, Brain measurement for usability testing and adaptive interfaces: an example of uncovering syntactic workload with functional near infrared spectroscopy, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1519035"},{"content":"Izzetoglu, M., Bunce, S. C., Izzetoglu, K., Onaral, B., and Pourrezaei, K. Functional brain imaging using near-infrared technology. IEEE Engineering in Medicine and Biology Magazine 26, 4 (2007), 38.","paperID":"None"},{"content":"Kane, M. J., and Engle, R. W. The role of prefrontal cortex in working-memory capacity, executive attention, and general 'uid intelligence: An individual-differences perspective. Psychonomic bulletin & review 9, 4 (2002), 637--671.","paperID":"None"},{"content":"Landis, J. R., and Koch, G. G. The measurement of observer agreement for categorical data. Biometrics (1977), 159--174.","paperID":"None"},{"content":"Leanne, M., and Robert, J. Using brain measurement to evaluate reality based interactions. Challenges in the Evaluation of Usability and User Experience in Reality Based Interaction 5 (2009), 19--20.","paperID":"None"},{"content":"Li, X., Xu, L., Yao, L., and Zhao, X. A novel HCI system based on real-time fmri using motor imagery interaction. In Foundations of Augmented Cognition. Springer, 2013, 703--708.","paperID":"None"},{"content":"McDonald, S., Edwards, H. M., and Zhao, T. Exploring think-alouds in usability testing: an international survey. Professional Communication, IEEE Transactions on 55, 1 (2012), 2--19.","paperID":"None"},{"content":"Sharon McDonald , Helen Petrie, The effect of global instructions on think-aloud testing, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2481407"},{"content":"Megaw, T. The de'nition and measurement of mental workload. Evaluation of human work, Eds. Esmond N. Corlett, and John R. Wilson (2005), 525--551.","paperID":"None"},{"content":"Miles, J., and Shevlin, M. Applying regression and correlation: A guide for students and researchers. Sage, 2001.","paperID":"None"},{"content":"Miller, E. K., and Cohen, J. D. An integrative theory of prefrontal cortex function. Annual review of neuroscience 24, 1 (2001), 167--202.","paperID":"None"},{"content":"Mueller, S. Pebl: The psychology experiment building language (version 0.10).{computer experiment programming language}. Retrieved Nov (2012).","paperID":"None"},{"content":"Erica L. Olmsted-Hawala , Elizabeth D. Murphy , Sam Hawala , Kathleen T. Ashenfelter, Think-aloud protocols: a comparison of three think-aloud protocols for use in testing data-dissemination web sites for usability, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753685"},{"content":"Evan M M. Peck , Beste F. Yuksel , Alvitta Ottley , Robert J.K. Jacob , Remco Chang, Using fNIRS brain sensing to evaluate information visualization interfaces, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470723"},{"content":"Pike, M., Wilson, M. L., Divoli, A., and Medelyan, A. CUES: Cognitive Usability Evaluation System. In EuroHCIR2012 (2012), 51--54.","paperID":"None"},{"content":"Rushworth, M. F., Nixon, P. D., Eacott, M. J., and Passingham, R. E. Ventral prefrontal cortex is not essential for working memory. The Journal of Neuroscience 17, 12 (1997), 4829--4838.","paperID":"None"},{"content":"Erin Treacy Solovey , Audrey Girouard , Krysta Chauncey , Leanne M. Hirshfield , Angelo Sassaroli , Feng Zheng , Sergio Fantini , Robert J.K. Jacob, Using fNIRS brain sensing in realistic HCI settings: experiments and guidelines, Proceedings of the 22nd annual ACM symposium on User interface software and technology, October 04-07, 2009, Victoria, BC, Canada","paperID":"1622207"},{"content":"Desney S. Tan , Anton Nijholt, Brain-Computer Interfaces: Applying our Minds to Human-Computer Interaction, Springer Publishing Company, Incorporated, 2010","paperID":"1855009"},{"content":"Toronov, V., Webb, A., Choi, J. H., Wolf, M., Michalos, A., Gratton, E., and Hueber, D. Investigation of human brain hemodynamics by simultaneous near-infrared spectroscopy and functional magnetic resonance imaging. Medical physics 28 (2001), 521.","paperID":"None"},{"content":"Villringer, A., and Chance, B. Non-invasive optical spectroscopy and imaging of human brain function. Trends in neurosciences 20, 10 (1997), 435--442.","paperID":"None"},{"content":"Villringer, A., Planck, J., Hock, C., Schleinkofer, L., and Dirnagl, U. Near infrared spectroscopy (NIRS): a new tool to study hemodynamic changes during activation of brain function in human adults. Neuroscience letters 154, 1 (1993), 101'104.","paperID":"None"},{"content":"Wickens, C. D. Multiple resources and mental workload. The Journal of the Human Factors and Ergonomics Society 50, 3 (2008), 449--455.","paperID":"None"},{"content":"Christopher D. Wickens , John Lee , Yili D. Liu , Sallie Gordon-Becker, Introduction to Human Factors Engineering (2nd Edition), Prentice-Hall, Inc., Upper Saddle River, NJ, 2003","paperID":"996300"},{"content":"Ye, J. C., Tak, S., Jang, K. E., Jung, J., and Jang, J. NIRS-SPM: statistical parametric mapping for near-infrared spectroscopy. Neuroimage 44, 2 (2009), 428--447.","paperID":"None"}],"abstract":"The Think Aloud Protocol (TAP) is a verbalisation technique widely employed in HCI user studies to give insight into user experience, yet little work has explored the impact that TAPs have on participants during user studies. This paper utilises a brain sensing technique, fNIRS, to observe the effect that TAPs have on participants. Functional Near-Infrared Spectroscopy (fNIRS) is a brain sensing technology that offers the potential to provide continuous, detailed insight into brain activity, enabling an objective view of cognitive processes during complex tasks. Participants were asked to perform a mathematical task under 4 conditions: nonsense verbalisations, passive concurrent think aloud protocol, invasive concurrent think aloud protocol, and a baseline of silence. Subjective ratings and performance measures were collected during the study. Our results provide a novel view into the effect that different forms of verbalisation have on workload during tasks. Further, the results provide a means for estimating the effect of spoken artefacts when measuring workload, which is another step towards our goal of proactively involving fNIRS analysis in ecologically valid user studies.","video":"http://www.youtube.com/embed/YNJlYvo1TGo?rel=0","title":"Measuring the effect of think aloud protocols on workload using fNIRS","filename":"CHI14/p3807","authors":["Matthew F. Pike","Horia A. Maior","Martin Porcheron","Sarah C. Sharples","Max L. Wilson"],"conference":"CHI '14"}