{"paperId":2556985,"citation":[],"reference":[{"content":"Arnold, N., and Ducate, L. Present and future promises of CALL: From theory and research to new directions in language teaching. Computer Assisted Language Instruction Consortium, 2011.","paperID":"None"},{"content":"Atkinson, R. C., and Raugh, M. R. An application of the mnemonic keyword method to the acquisition of a Russian vocabulary. Journal of Experimental Psychology: Human Learning and Memory 1, 2 (1975), 126.","paperID":"None"},{"content":"Baayen, R., Davidson, D., and Bates, D. Mixed-effects modeling with crossed random effects for subjects and items. Journal of Memory and Language (2008).","paperID":"None"},{"content":"Beaton, A., Gruneberg, M., and Ellis, N. Retention of foreign vocabulary learned using the keyword method: A ten-year follow-up. Second Language Research 11, 2 (1995), 112--120.","paperID":"None"},{"content":"Bird, H., Franklin, S., and Howard, D. Age of acquisition and imageability ratings for a large set of words, including verbs and function words. Behavior Research Methods, Instruments, & Computers 33, 1 (2001), 73--79.","paperID":"None"},{"content":"Chen, S. F. Conditional and joint models for grapheme-to-phoneme conversion. In INTERSPEECH (2003).","paperID":"None"},{"content":"Clark, J. M., and Paivio, A. Extensions of the Paivio, Yuille, and Madigan (1968) norms. Behavior Research Methods, Instruments, & Computers 36, 3 (2004), 371--383.","paperID":"None"},{"content":"Cortese, M. J., and Fugett, A. Imageability ratings for 3,000 monosyllabic words. Behavior Research Methods, Instruments, & Computers 36, 3 (2004), 384--387.","paperID":"None"},{"content":"de Groot, A. M., and Van Hell, J. G. The learning of foreign language vocabulary. Handbook of bilingualism (2005), 9.","paperID":"None"},{"content":"Gerard de Melo , Gerhard Weikum, Towards a universal wordnet by learning from combined evidence, Proceedings of the 18th ACM conference on Information and knowledge management, November 02-06, 2009, Hong Kong, China","paperID":"1646020"},{"content":"Ehsani, F., and Knodt, E. Speech technology in computer-aided language learning: Strengths and limitations of a new call paradigm. Language Learning & Technology 2, 1 (1998), 45--60.","paperID":"None"},{"content":"Ellis, M. French Slanguage. Gibbs Smith, 2012.","paperID":"None"},{"content":"Ellis, N. C., and Beaton, A. Psycholinguistic determinants of foreign language vocabulary learning. Language learning 43, 4 (1993), 559--617.","paperID":"None"},{"content":"Edward Fredkin, Trie memory, Communications of the ACM, v.3 n.9, p.490-499, September 1960","paperID":"367400"},{"content":"Fritz, C. O., Morris, P. E., Acton, M., Voelkel, A. R., and Etkind, R. Comparing and combining retrieval practice and the keyword mnemonic for foreign vocabulary learning. Applied Cognitive Psychology 21, 4 (2007), 499--526.","paperID":"None"},{"content":"Gilhooly, K. J., and Logie, R. H. Age-of-acquisition, imagery, concreteness, familiarity, and ambiguity measures for 1,944 words. Behavior Research Methods & Instrumentation 12, 4 (1980), 395--427.","paperID":"None"},{"content":"Spence Green , Jeffrey Heer , Christopher D. Manning, The efficacy of human post-editing for language translation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470718"},{"content":"Hauer, B., and Kondrak, G. Automatic generation of English respellings. In Proceedings of NAACL-HLT (2013), 634--643.","paperID":"None"},{"content":"International Phonetic Association. Handbook of the International Phonetic Association: A guide to the use of the International Phonetic Alphabet. Cambridge University Press, 1999.","paperID":"None"},{"content":"Johnson, W. L., Marsella, S., and Vilhjalmsson, H. The DARWARS tactical language training system. In Proceedings of I/ITSEC (2004).","paperID":"None"},{"content":"Sarvnaz Karimi , Falk Scholer , Andrew Turpin, Machine transliteration survey, ACM Computing Surveys (CSUR), v.43 n.3, p.1-46, April 2011","paperID":"1922654"},{"content":"Kern, R. Perspectives on technology in learning and teaching languages. TESOL Quarterly 40, 1 (2006), 183--210.","paperID":"None"},{"content":"Grzegorz Kondrak, A new algorithm for the alignment of phonetic sequences, Proceedings of the 1st North American chapter of the Association for Computational Linguistics conference, p.288-295, April 29-May 04, 2000, Seattle, Washington","paperID":"974343"},{"content":"Kondrak, G. Phonetic alignment and similarity. Computers and the Humanities 37, 3 (2003), 273--291.","paperID":"None"},{"content":"Kuperman, V., Stadthagen-Gonzalez, H., and Brysbaert, M. Age-of-acquisition ratings for 30,000 english words. Behavior Research Methods 44, 4 (2012), 978--990.","paperID":"None"},{"content":"Levenshtein, V. I. Binary codes capable of correcting deletions, insertions and reversals. In Soviet physics doklady, vol. 10 (1966), 707.","paperID":"None"},{"content":"Christopher D. Manning , Prabhakar Raghavan , Hinrich Schütze, Introduction to Information Retrieval, Cambridge University Press, New York, NY, 2008","paperID":"1394399"},{"content":"McDonough, C., Song, L., Hirsh-Pasek, K., Golinkoff, R. M., and Lannon, R. An image is worth a thousand words: Why nouns tend to dominate verbs in early word learning. Developmental science 14, 2 (2011), 181--189.","paperID":"None"},{"content":"George A. Miller, WordNet: a lexical database for English, Communications of the ACM, v.38 n.11, p.39-41, Nov. 1995","paperID":"219748"},{"content":"Paivio, A. Mental imagery in associative learning and memory. Psychological review 76, 3 (1969), 241.","paperID":"None"},{"content":"Paivio, A., Yuille, J. C., and Madigan, S. A. Concreteness, imagery, and meaningfulness values for 925 nouns. Journal of experimental psychology 76, 1p2 (1968), 1.","paperID":"None"},{"content":"Sagarra, N., and Alba, M. The key is in the keyword: L2 vocabulary learning methods with beginning learners of Spanish. The Modern Language Journal 90, 2 (2006), 228--243.","paperID":"None"},{"content":"Stadthagen-Gonzalez, H., and Davis, C. J. The Bristol norms for age of acquisition, imageability, and familiarity. Behavior Research Methods 38, 4 (2006), 598--605.","paperID":"None"},{"content":"Taka', V. P. Vocabulary learning strategies and foreign language acquisition, vol. 27. Multilingual matters, 2008.","paperID":"None"},{"content":"Kristina Toutanova , Dan Klein , Christopher D. Manning , Yoram Singer, Feature-rich part-of-speech tagging with a cyclic dependency network, Proceedings of the 2003 Conference of the North American Chapter of the Association for Computational Linguistics on Human Language Technology, p.173-180, May 27-June 01, 2003, Edmonton, Canada","paperID":"1073478"},{"content":"Peter D. Turney , Patrick Pantel, From frequency to meaning: vector space models of semantics, Journal of Artificial Intelligence Research, v.37 n.1, p.141-188, January 2010","paperID":"1861756"},{"content":"Wilson, M. MRC psycholinguistic database: Machine-usable dictionary, version 2.00. Behavior Research Methods, Instruments, & Computers 20, 1 (1988), 6--10.","paperID":"None"}],"abstract":"We present TransPhoner: a system that generates keywords for a variety of scenarios including vocabulary learning, phonetic transliteration, and creative word plays. We select effective keywords by considering phonetic, orthographic and semantic word similarity, and word concept imageability. We show that keywords provided by TransPhoner improve learner performance in an online vocabulary learning study, with the improvement being more pronounced for harder words. Participants rated TransPhoner keywords as more helpful than a random keyword baseline, and almost as helpful as manually selected keywords. Comments also indicated higher engagement in the learning task, and more desire to continue learning. We demonstrate additional applications to tasks such as pure phonetic transliteration, generation of mnemonics for complex vocabulary, and topic-based transformation of song lyrics.","video":"http://www.youtube.com/embed/9kgzd-eFyr8?rel=0","title":"TransPhoner: automated mnemonic keyword generation","filename":"CHI14/p3725","authors":["Manolis Savva","Angel X. Chang","Christopher D. Manning","Pat Hanrahan"],"conference":"CHI '14"}