{"paperId":2556317,"citation":[],"abstract":"Java enabled smart cards protect security-related code and data by a sandbox concept. Unfortunately, this sandbox can be bypassed by fault attacks. Therefore, there is a substantial need for transparent, effective, and low-overhead countermeasures. This work demonstrates a new countermeasure against type confusion and buffer overflow attacks. This new countermeasure is based on obfuscating the security critical calculation parts of a virtual machine by secret keys. This countermeasure was integrated into a Java Card virtual machine running on a smart card prototype. New hardware features were added to this prototype to accelerate the obfuscating operation. The execution time overhead of the new countermeasure is demonstrated by performing run-time measurements on the prototype.","reference":[{"content":"Guillaume Barbu , Guillaume Duc , Philippe Hoogvorst, Java card operand stack: fault attacks, combined attacks and countermeasures, Proceedings of the 10th IFIP WG 8.8/11.2 international conference on Smart Card Research and Advanced Applications, September 14-16, 2011, Leuven, Belgium","paperID":"2188535"},{"content":"Guillaume Barbu , Hugues Thiebeauld , Vincent Guerin, Attacks on java card 3.0 combining fault and logical attacks, Proceedings of the 9th IFIP WG 8.8/11.2 international conference on Smart Card Research and Advanced Application, April 14-16, 2010, Passau, Germany","paperID":"2175928"},{"content":"A. Barenghi, G. Bertoni, L. Breveglieri, M. Pellicioli, and G. Pelosi. Fault Attack on AES with Single-Bit Induced Faults. In Information Assurance and Security (IAS), 2010 Sixth International Conference on, pages 167--172, 2010.","paperID":"None"},{"content":"A. Barenghi, L. Breveglieri, I. Koren, and D. Naccache. Fault Injection Attacks on Cryptographic Devices: Theory, Practice, and Countermeasures. Proceedings of the IEEE, 100(11):3056--3076, 2012.","paperID":"None"},{"content":"Guillaume Bouffard , Julien Iguchi-Cartigny , Jean-Louis Lanet, Combined software and hardware attacks on the java card control flow, Proceedings of the 10th IFIP WG 8.8/11.2 international conference on Smart Card Research and Advanced Applications, September 14-16, 2011, Leuven, Belgium","paperID":"2188534"},{"content":"Guillaume Bouffard , Jean-Louis Lanet, The next smart card nightmare, Cryptography and Security: from theory to applications, Springer-Verlag, Berlin, Heidelberg, 2012","paperID":"2184113"},{"content":"J. Dubreuil, G. Bouffard, B. N. Thampi, and J.-L. Lanet. Mitigating Type Confusion on Java Card. International Journal of Secure Software Engineering (IJSSE), 4(2):19--39, 2013.","paperID":"None"},{"content":"S. Hamadouche, G. Bouffard, J.-L. Lanet, B. Dorsemaine, B. Nouhant, A. Magloire, and A. Reygnaud. Subverting Byte Code Linker service to characterize Java Card API. Proceedings of the 7th Conference on Network and Information Systems Security (SAR-SSI), pages 122--128. 2012.","paperID":"None"},{"content":"Julien Iguchi-Cartigny , Jean-Louis Lanet, Developing a Trojan applets in a smart card, Journal in Computer Virology, v.6 n.4, p.343-351, November  2010","paperID":"1873380"},{"content":"M. Lackner, R. Berlach, M. Hraschan, R. Weiss, and C. Steger. A Defensive Java Card Virtual Machine to Thwart Fault Attacks by Microarchitectural Support. In International Conference on Risks and Security of Internet and Systems (CRiSIS). in press, 2013.","paperID":"None"},{"content":"Michael Lackner , Reinhard Berlach , Johannes Loinig , Reinhold Weiss , Christian Steger, Towards the hardware accelerated defensive virtual machine: type and bound protection, Proceedings of the 11th international conference on Smart Card Research and Advanced Applications, November 28-30, 2012, Graz, Austria","paperID":"2456353"},{"content":"M. Lackner, R. Berlach, W. Raschke, R. Weiss, and C. Steger. A Defensive Virtual Machine Layer to Counteract Fault Attacks on Java Cards. In Information Security Theory and Practice. Security of Mobile and Cyber-Physical Systems, pages 82--97. Springer, 2013.","paperID":"None"},{"content":"Giovanni Morana , Emiliano Tramontana , Daniele Zito, Detecting Attacks on Java Cards by Fingerprinting Applets, Proceedings of the 2013 Workshops on Enabling Technologies: Infrastructure for Collaborative Enterprises, p.359-364, June 17-20, 2013","paperID":"2516381"},{"content":"Wojciech Mostowski , Erik Poll, Malicious Code on Java Card Smartcards: Attacks and Countermeasures, Proceedings of the 8th IFIP WG 8.8/11.2 international conference on Smart Card Research and Advanced Applications, p.1-16, September 08-11, 2008, London, UK","paperID":"1430797"},{"content":"Oracle. Runtime Environment Specification. Java Card Platform, Version 3.0.4, Classic Edition, 2011.","paperID":"None"},{"content":"Oracle. Virtual Machine Specification. Java Card Platform, Version 3.0.4, Classic Edition, 2011.","paperID":"None"},{"content":"T. Razafindralambo, G. Bouffard, B. Thampi, and J.-L. Lanet. A Dynamic Syntax Interpretation for Java Based Smart Card to Mitigate Logical Attacks. In Recent Trends in Computer Networks and Distributed Systems Security, volume 335 of Communications in Computer and Information Science, pages 185--194. Springer Berlin Heidelberg, 2012.","paperID":"None"},{"content":"A. Sere, J. Iguchi-Cartigny, and J.-L. Lanet. Checking the Paths to Identify Mutant Application on Embedded Systems. In T.-h. Kim, Y.-h. Lee, B.-H. Kang, and D. Slezak, editors, Future Generation Information Technology, volume 6485 of Lecture Notes in Computer Science, pages 459--468. Springer Berlin/Heidelberg, 2010.","paperID":"None"},{"content":"A. Sere, J. Iguchi-Cartigny, and J.-L. Lanet. Evaluation of Countermeasures Against Fault Attacks on Smart Cards. International Journal of Security and Its Applications, Vol.5 No.2, pages 49--61, April 2011.","paperID":"None"},{"content":"Sun Microsystems Inc. Java Card 2.2 Off-card Verifier. White Paper, June 2002.","paperID":"None"},{"content":"Olli Vertanen, Java type confusion and fault attacks, Proceedings of the Third international conference on Fault Diagnosis and Tolerance in Cryptography, October 10, 2006, Yokohama, Japan","paperID":"2126414"},{"content":"Eric Vetillard , Anthony Ferrari, Combined attacks and countermeasures, Proceedings of the 9th IFIP WG 8.8/11.2 international conference on Smart Card Research and Advanced Application, April 14-16, 2010, Passau, Germany","paperID":"2175927"}],"title":"Countering type confusion and buffer overflow attacks on Java smart cards by data type sensitive obfuscation","filename":"CS214/2556317","authors":["Michael Lackner","Reinhard Berlach","Reinhold Weiss","Christian Steger"],"conference":"CS2 '14"}