{"paperId":2556353,"citation":[{"content":"Andrew Stanton , Amanda Thart , Ashish Jain , Priyank Vyas , Arpan Chatterjee , Paulo Shakarian, Mining for Causal Relationships: A Data-Driven Study of the Islamic State, Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, August 10-13, 2015, Sydney, NSW, Australia","paperID":"2788591"},{"content":"Anshul Sawant , John P. Dickerson , Mohammad T. Hajiaghayi , V. S. Subrahmanian, Automated Generation of Counterterrorism Policies Using Multiexpert Input, ACM Transactions on Intelligent Systems and Technology (TIST), v.6 n.4, August 2015","paperID":"2716328"}],"reference":[],"abstract":"Advance Praise for Indian Mujahideen: Computational Analysis and Public Policy This book presents a highly innovative computational approach to analyzing the strategic behavior of terrorist groups and formulating counter-terrorism policies. It would be very useful for international security analysts and policymakers. Uzi Arad, National Security Advisor to the Prime Minister of Israel and Head, Israel National Security Council (2009-2011) An important book on a complex security problem. Issues have been analysed in depth based on quality research. Insightful and well-balanced in describing the way forward. Naresh Chandra, Indian Ambassador to the USA (1996-2001) and Cabinet Secretary (1990-1992). An objective and clinical account of the origins, aims, extra-territorial links and modus-operandi, of a growingly dangerous terrorist organization that challenges the federal, democratic, secular and pluralistic ethos of Indias polity. The authors have meticulously researched and analysed the multi-faceted challenges that the Indian Mujahideen poses and realistically dwelt on the ways in which these challenges could be faced and overcome. G. Parthasarathy, High Commissioner of India to Australia (1995-1998) and Pakistan (1998-2000). This book provides the first in-depth look at how advanced mathematics and modern computing technology can influence insights on analysis and policies directed at the Indian Mujahideen (IM) terrorist group. The book also summarizes how the IM group is committed to the destabilization of India by leveraging links with other terror groups such as Lashkar-e-Taiba, and through support from the Pakistani Government and Pakistans intelligence service. Foreword by The Hon. Louis J. Freeh.","title":"Indian Mujahideen: Computational Analysis and Public Policy","authors":""}