{"paperId":2556367,"citation":[],"reference":[],"abstract":" Oracle Exadata Survival Guide is a hands-on guide for busy Oracle database administrators who are migrating their skill sets to Oracle's Exadata database appliance. The book covers the concepts behind Exadata, and the available configurations for features such as smart scans, storage indexes, Smart Flash Cache, hybrid columnar compression, and more. You'll learn about performance metrics and execution plans, and how to optimize SQL running in Oracle's powerful, new environment. The authors also cover migration from other servers. Oracle Exadata is fast becoming the standard for large installations such as those running data warehouse, business intelligence, and large-scale OLTP systems. Exadata is like no other platform, and is new ground even for experienced Oracle database administrators. The Oracle Exadata Survival Guide helps you navigate the ins and outs of this new platform, de-mystifying this amazing appliance and its exceptional performance. The book takes a highly practical approach, not diving too deeply into the details, but giving you just the right depth of information to quickly transfer your skills to Oracle's important new platform. Helps transfer your skills to the platform of the future Covers the important ground without going too deep Takes a practical and hands-on approach to everyday tasks What you'll learn Learn the components and basic architecture of an Exadata machine Reduce data transfer overhead by processing queries in the storage layer Examine and take action on Exadata-specific performance metrics Deploy Hybrid Columnar Compression to reduce storage and I/O needs Create worry-free migrations from existing databases into Exadata Understand and address issues specific to ERP migrations Who this book is for Oracle Exadata Survival Guide is for the busy enterprise Oracle DBA who has suddenly been thrust into the Exadata arena. Readers should have a sound grasp of traditional Oracle database administration, and be prepared to learn new aspects that are specific to the Exadata appliance.","title":"Oracle Exadata Survival Guide","authors":""}