{"paperId":2556324,"abstract":"Recent work on wireless Implantable Medical Devices (IMDs) has revealed the need for secure communication in order to prevent data theft and implant abuse by malicious attackers. However, security should not be provided at the cost of patient safety and an IMD should, thus, remain accessible during an emergency regardless of device security. In this paper, we present a novel method of providing IMD emergency access, based on generating Entity Identifiers (EI) using the Inter-Pulse Intervals (IPIs) of heartbeats. We evaluate the current state-of-the-art in EI-generation in terms of security and accessibility for healthy subjects with a wide range of heart rates. Subsequently, we present an adaptive EI-generation algorithm which takes the heart rate into account, maintaining an acceptable emergency-mode activation time (between 5-55.4 s) while improving security by up to 3.4x for high heart rates. Finally, we show that activating emergency mode may consume as little as 0.24μJ from the IMD battery.","citation":[],"reference":[{"content":"F. Agrafioti, F. M. Bui, and D. Hatzinakos. Medical biometrics in mobile health monitoring. Security and Communication Networks, 4(5):525--539, 2011.","paperID":"None"},{"content":"I. Antelmi et al. Influence of age, gender, body mass index, and functional capacity on heart rate variability in a cohort of subjects without heart disease. AJC, 93(3):381--385, 2004.","paperID":"None"},{"content":"Shu-Di Bao , C. C.Y. Poon , Yuan-Ting Zhang , Lian-Feng Shen, Using the Timing Information of Heartbeats as an Entity Identifier to Secure Body Sensor Network, IEEE Transactions on Information Technology in Biomedicine, v.12 n.6, p.772-779, November 2008","paperID":"2223590"},{"content":"A. L. Goldberger et al. Physiobank, physiotoolkit, and physionet components of a new research resource for complex physiologic signals. Circulation, 101(23):e215--e220, 2000.","paperID":"None"},{"content":"Daniel Halperin , Thomas S. Heydt-Benjamin , Benjamin Ransford , Shane S. Clark , Benessa Defend , Will Morgan , Kevin Fu , Tadayoshi Kohno , William H. Maisel, Pacemakers and Implantable Cardiac Defibrillators: Software Radio Attacks and Zero-Power Defenses, Proceedings of the 2008 IEEE Symposium on Security and Privacy, p.129-142, May 18-21, 2008","paperID":"1398065"},{"content":"Daniel Halperin , Thomas S. Heydt-Benjamin , Kevin Fu , Tadayoshi Kohno , William H. Maisel, Security and Privacy for Implantable Medical Devices, IEEE Pervasive Computing, v.7 n.1, p.30-39, January 2008","paperID":"1340047"},{"content":"N. Iyengar et al. Age-related alterations in the fractal scaling of cardiac interbeat interval dynamics. AJP-Regu, 271(4):R1078--R1084, 1996.","paperID":"None"},{"content":"C.-K. Peng et al. Exaggerated heart rate oscillations during two meditation techniques. IJC, pages 101--107, 1999.","paperID":"None"},{"content":"C. C.Y. Poon , Yuan-Ting Zhang , Shu-Di Bao, A novel biometrics method to secure wireless body area sensor networks for telemedicine and m-health, IEEE Communications Magazine, v.44 n.4, p.73-81, September 2006","paperID":"2293054"},{"content":"Christos Strydis , Robert M. Seepers , Pedro Peris-Lopez , Dimitrios Siskos , Ioannis Sourdis, A system architecture, processor, and communication protocol for secure implants, ACM Transactions on Architecture and Code Optimization (TACO), v.10 n.4, p.1-23, December 2013","paperID":"2555313"},{"content":"M. P. Tulppo et al. Quantitative beat-to-beat analysis of heart rate dynamics during exercise. AJP Heart, 271(1):H244--H252, 1996.","paperID":"None"},{"content":"R.-F. Xue et al. Ultra-low-power wireless implantable blood flow sensing microsystem for vascular graft applications. In ISIC, pages 224--229. IEEE, 2011.","paperID":"None"},{"content":"Guang-He Zhang , Carmen C. Y. Poon , Yuan-Ting Zhang, Analysis of Using Interpulse Intervals to Generate 128-Bit Biometric Random Binary Sequences for Securing Wireless Body Sensor Networks, IEEE Transactions on Information Technology in Biomedicine, v.16 n.1, p.176-182, January 2012","paperID":"2334751"}],"title":"Adaptive entity-identifier generation for IMD emergency access","filename":"CS214/2556324","authors":["Robert M. Seepers","Christos Strydis","Ioannis Sourdis","Chris I. De Zeeuw"],"conference":"CS2 '14"}