{"paperId":2556983,"citation":[{"content":"Eric P.S. Baumer, Usees, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702147"},{"content":"A.K.M. Najmul Islam , Sameer Patil, Engagement and Well-being on Social Network Sites, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675299"},{"content":"Daniel A. Epstein , An Ping , James Fogarty , Sean A. Munson, A lived informatics model of personal informatics, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2804250"},{"content":"Yiran Wang , Melissa Niiya , Gloria Mark , Stephanie M. Reich , Mark Warschauer, Coming of Age (Digitally): An Ecological View of Social Media Use among College Students, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675271"},{"content":"Irina Shklovski , Louise Barkhuus , Nis Bornoe , Joseph 'Jofish' Kaye, Friendship Maintenance in the Digital Age: Applying a Relational Lens to Online Social Interaction, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675294"},{"content":"Siân E. Lindley, Making Time, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675157"}],"abstract":"Social media use is widespread, but many people worry about overuse. This paper explores how and why people take breaks from social media. Using a mixed methods approach, we pair data from users who tweeted about giving up Twitter for Lent with an interview study of social media users. We find that 64% of users who proclaim that they are giving up Twitter for Lent successfully do so. Among those who fail, 31% acknowledge their failure; the other 69% simply return. We observe hedging patterns (e.g. \"I thought about giving up Twitter for Lent but\"?) that surfaced uncertainty about social media behavior. Interview participants were concerned about the tradeoffs of spending time on social media versus doing other things and of spending time on social media rather than in \"real life.\" We discuss gaps in related theory that might help reduce users' anxieties and open design problems related to designing systems and services that can help users manage their own social media use.","video":"http://www.youtube.com/embed/b1Hq369syb8?rel=0","reference":[{"content":"Bandura, A. Social Cognitive Theory of Mass Communication. In J. Bryant and M.B. Oliver, eds., Media Effects: Advances in theory and research. Lawrence Erlbaum Associates, Mahwah, NJ, 2009.","paperID":"None"},{"content":"Baumeister, R.F., Bratslavsky, E., Muraven, M., and Tice, D.M. Ego depletion: is the active self a limited resource? J. of Personality and Soc. Pscyh. 74, 5 (1998), 1252--1265.","paperID":"None"},{"content":"Baumeister, R.F., Heatherton, T.F., and Tice, D.M. Losing control: How and why people fail at selfregulation. Academic Press, San Diego, CA, 1994.","paperID":"None"},{"content":"Eric P.S. Baumer , Phil Adams , Vera D. Khovanskaya , Tony C. Liao , Madeline E. Smith , Victoria Schwanda Sosik , Kaiton Williams, Limiting, leaving, and (re)lapsing: an exploration of facebook non-use practices and experiences, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466446"},{"content":"Jeremy Birnholtz, Adopt, adapt, abandon: Understanding why some young adults start, and then stop, using instant messaging, Computers in Human Behavior, v.26 n.6, p.1427-1433, November, 2010","paperID":"1853489"},{"content":"Moira Burke , Cameron Marlow , Thomas Lento, Social network activity and social well-being, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753613"},{"content":"Nicholas Carr, The Shallows: What the Internet Is Doing to Our Brains, W. W. Norton & Company, 2010","paperID":"1855023"},{"content":"Sunny Consolvo , David W. McDonald , James A. Landay, Theory-driven design strategies for technologies that support behavior change in everyday life, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518766"},{"content":"Elder, M. Giving up social media for Lent will cleanse your soul, Russians told. The Guardian. http://www.theguardian.com/world/2013/mar/15/social -media-lent-russia.","paperID":"None"},{"content":"Ellison, N.B., Steinfield, C., and Lampe, C. The Benefits of Facebook \"Friends:\" Social Capital and College Students' Use of Online Social Network Sites. JCMC 12, 4 (2007), 1143--1168.","paperID":"None"},{"content":"Jon Froehlich , Leah Findlater , James Landay, The design of eco-feedback technology, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753629"},{"content":"Goffman, E. Stigma: Notes on the Management of Spoiled Identity. Simon & Schuster, New York, 1963.","paperID":"None"},{"content":"Goode, E. and Ben-Yehuda, N. Moral Panics: Culture, Politics, and Social Construction. Annual Review of Sociology 20, 1 (1994), 149--171.","paperID":"None"},{"content":"Iyer, P. The Joy of Quiet. New York Times, 2011.","paperID":"None"},{"content":"Job, V., Dweck, C.S., and Walton, G.M. Ego Depletion--Is It All in Your Head? Implicit Theories About Willpower Affect Self-Regulation. Psychological Science 21, 11 (2010), 1686--1693.","paperID":"None"},{"content":"Jurgenson, N. The IRL Fetish. The New Inquiry, 2012. http://thenewinquiry.com/essays/the-irl-fetish/.","paperID":"None"},{"content":"Keyishian, A. No Matter What You're Giving Up for Lent, Here's How to Stick to Your Guns. mydaily.com/2011/03/18/giving-up-for-lent-chocolate/.","paperID":"None"},{"content":"Kross, E., Verduyn, P., Demiralp, E., et al. Facebook Use Predicts Declines in Subjective Well-Being in Young Adults. PLoS ONE 8, 8 (2013), e69841.","paperID":"None"},{"content":"Lakoff, G. Hedges: A Study in Meaning Criteria and the Logic of Fuzzy Concepts. In D. Hockney, W. Harper and B. Freed, eds., Contemporary Research in Philosophical Logic and Linguistic Semantics. Springer Netherlands, 1975, 221--271.","paperID":"None"},{"content":"Jaron Lanier, You Are Not a Gadget: A Manifesto, Knopf Publishing Group, 2010","paperID":"1824167"},{"content":"Gilly Leshed , Phoebe Sengers, \"I lie to myself that i have freedom in my own schedule\": productivity tools and experiences of busyness, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979077"},{"content":"Ian Li , Jodi Forlizzi , Anind Dey, Know thyself: monitoring and reflecting on facets of one's life, CHI '10 Extended Abstracts on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1754181"},{"content":"Liu, K. and Tree, J.E.F. Hedges enhance memory but inhibit retelling. Psychonomic Bulletin & Review 19, 5 (2012), 892--898.","paperID":"None"},{"content":"Markkanen, R. & Schröder, H., eds. Hedging and Discourse: Approaches to the Analysis of a Pragmatic Phenomenon in Academic Texts. Vol. 24. Walter de Gruyter, 1997.","paperID":"None"},{"content":"Marwick, A.E. and Boyd, D. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. NM&S 13, 1 (2010), 114--133.","paperID":"None"},{"content":"Miller, E.T. & Marlatt, G.A. (1998). How to Keep Up with Those New Year's Resolutions: Researchers Find Commitment Is the Secret of Success.","paperID":"None"},{"content":"Moraveji, N. Calming Technologies. In Proc. CHI, '11.","paperID":"None"},{"content":"Mukhopadhyay, A. and Johar, G.V. Where There Is a Will, Is There a Way? Effects of Lay Theories of SelfControl on Setting and Keeping Resolutions. Journal of Consumer Research 31, 4 (2005), 779--786.","paperID":"None"},{"content":"Orenstein, P. Stop Your Search Engines. The New York Times Magazine, Oct 23, 2009.","paperID":"None"},{"content":"Pearse, D. Facebook's \"dark side\": study finds link to socially aggressive narcissism. The Guardian. May 7, 2012.","paperID":"None"},{"content":"Portword-Stacer, L. Media refusal and conspicuous non-consumption: The performative and political dimensions of Facebook abstention. New Media & Society, (2012).","paperID":"None"},{"content":"Rainie, L., Smith, A., and Duggan, M. Coming and Going on Facebook. Pew Internet, 2013.","paperID":"None"},{"content":"Roiphe, K. Can We Really Unplug? Slate. http://www.slate.com/articles/life/roiphe/2012/01/why_ is_the_freedom_app_so_popular_.html.","paperID":"None"},{"content":"Rosenbaum, P. Observational Studies. SpringerVerlag, New York.","paperID":"None"},{"content":"Christine Satchell , Paul Dourish, Beyond the user: use and non-use in HCI, Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7, November 23-27, 2009, Melbourne, Australia","paperID":"1738829"},{"content":"Smith, S. What People Gave Up For Lent 2012 (According to Twitter). ChristianityToday. http://www.christianitytoday.com/","paperID":"None"},{"content":"Soojung-Kim Pang, A. The Distraction Addiction. Little, Brown and Company, 2013.","paperID":"None"},{"content":"Stieger, S., Burger, C., Bohn, M., and Voracek, M. Who Commits Virtual Identity Suicide? Differences in Privacy Concerns, Internet Addiction, and Personality Between Facebook Users and Quitters. Cyberpsychology, behavior & soc. networking, (2013).","paperID":"None"},{"content":"Thurston, B. #UNPLUG: Baratunde Thurston Left the Internet for 25 Days, and you Should, Too. Fast Company, 2013.","paperID":"None"},{"content":"Thurston, H. Lent. The Catholic Encyclopedia, 1910. http://www.newadvent.org/cathen/09152a.htm.","paperID":"None"},{"content":"Sherry Turkle, Alone Together: Why We Expect More from Technology and Less from Each Other, Basic Books, Inc., New York, NY, 2011","paperID":"1972496"},{"content":"Jessica Vitak , Cliff Lampe , Rebecca Gray , Nicole B. Ellison, \"Why won't you be my Facebook friend?\": strategies for managing context collapse in the workplace, Proceedings of the 2012 iConference, p.555-557, February 07-10, 2012, Toronto, Ontario, Canada","paperID":"2132286"},{"content":"Wellman, B. and Gulia, M. Virtual Communities are Communities: Web Surfers Don't Ride Alone. In M.A. Smith and P. Kollock, eds., Routledge, 1999, 167--194.","paperID":"None"},{"content":"Winston, K. After giving up religion, atheists try giving up something else for Lent. Religion News Service, 2013. http://www.religionnews.com/","paperID":"None"},{"content":"Wolcott, H.F. Transforming qualitative data: description, analysis, and interpretation. Sage Publications, Thousand Oaks, CA., 1994.","paperID":"None"},{"content":"Allison Woodruff , Sally Augustin , Brooke Foucault, Sabbath day home automation: \"it's like mixing technology and religion\", Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240710"},{"content":"Susan P. Wyche , Rebecca E. Griner, Extraordinary computing: religion as a lens for reconsidering the home, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518817"},{"content":"Sarita Yardi , Amy Bruckman, Social and technical challenges in parenting teens' social media use, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979422"},{"content":"Handbook of Stress, Coping, & Health. (2012). SAGE.","paperID":"None"},{"content":"China seeks to \"limit game hours\". BBC News. http://news.bbc.co.uk/2/hi/technology/6544759.stm.","paperID":"None"}],"title":"Giving up Twitter for Lent: how and why we take breaks from social media","filename":"CHI14/p773","authors":["Sarita Yardi Schoenebeck"],"conference":"CHI '14"}