{"paperId":2556967,"citation":[{"content":"Gang Wang , Tianyi Wang , Bolun Wang , Divya Sambasivan , Zengbin Zhang , Haitao Zheng , Ben Y. Zhao, Crowds on Wall Street: Extracting Value from Collaborative Investing Platforms, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675144"}],"reference":[{"content":"Brier, G. W., \"Verification of Forecasts Expressed in Terms of Probability,\" Monthly Weather Review, 78, 1950, pp. 1--3.","paperID":"None"},{"content":"Ed H. Chi, Information Seeking Can Be Social, Computer, v.42 n.3, p.42-46, March 2009","paperID":"1525674"},{"content":"Clemen, R. R., \"Combining Forecasts: A Review and Annotated Bibliography,\" International Journal of Forecasting, 5, 1989, pp. 559--583.","paperID":"None"},{"content":"Dawid, A., DeGroot, M., Mortera, J., Cooke, R., French, S., Genest, C., Schervish, M., Lindley, D., McConway, K., and Winkler, R., \"Coherent Combination of Experts' Opinions,\" TEST, Vol. 4, Issue 2, 1995, pp. 263--313.","paperID":"None"},{"content":"Du, J., \"Hybrid Ensemble Prediction System: a New Ensembling Approach,\" preprints, Symposium on the 50th Anniversary of Operational Numerical Weather Prediction, University of Maryland, College Park, Maryland, June 14-17, 2004 (5 pp.).","paperID":"None"},{"content":"Kate Ehrlich , N. Sadat Shami, Searching for expertise, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357224"},{"content":"Ertekin, S., Hirsh, H., and Rudin, C., \"Learning to Predict the Wisdom of Crowds,\" Presented at Collective Intelligence Conference (arXiv: 1204.3611), 2012.","paperID":"None"},{"content":"Galton, F., \"Vox Populi,\" Nature, Vol. 75, 1907, pp. 450--451.","paperID":"None"},{"content":"Genre, Kenny, Meyler, and Timmermann, \"Combining Expert Forecasts: Can Anything Beat the Simple Average?\" International Journal of Forecasting, Vol. 29, Issue 1, 2013, pp. 108--121.","paperID":"None"},{"content":"Graefe, A., Armstrong, J. S., Jones, R., and Cuzan, A., \"Combining Forecasts: An Application to Election Forecasts,\" APSA Annual Meeting, 2011.","paperID":"None"},{"content":"Rainer Hegselmann , Ulrich Krause, Opinion Dynamics Driven by Various Ways of Averaging, Computational Economics, v.25 n.4, p.381-405, June 2005","paperID":"1075378"},{"content":"IARPA Aggregative Contingent Estimation (ACE). http://www.iarpa.gov/Programs/ia/ACE/ace.html","paperID":"None"},{"content":"Jeong, J. W., Morris, M. R., Teevan, J., and Liebling, D., \"A Crowd-Powered Socially Embedded Search Engine,\" Proceedings of the Seventh International AAAI Conference on Weblogs and Social Media (ICWSM 2013), Boston, MA, July 2013.","paperID":"None"},{"content":"Edith Law , Luis von Ahn, Input-agreement: a new mechanism for collecting data using human computation games, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518881"},{"content":"Le, J., Edmonds, A., Hester, V., Biewald, L., \"Ensuring Quality in Crowd-Sourced Search Relevance Evaluation: The effects of Training Question Distribution,\" Proceedings of the SIGIR 2010 Workshop on Crowdsourcing for Search Evaluation (CSE 2010), 2010.","paperID":"None"},{"content":"Miller, S., Forlines, C., Regan, J., \"Exploring the Relationship Between Topic Area Knowledge and Forecasting Performance,\" Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 56, No. 1, 2012, pp. 318--322.","paperID":"None"},{"content":"Oleson, D., Sorokin, A., Laughlin, G., Hester, V., Le, J., Biewald, L., \"Programmatic Gold: Targeted and Scalable Quality Assurance in Crowd Sourcing,\" Proceedings of the ACM SIGKDD Workshop on Human Computation (HCOMP '11), ACM, New York, NY, USA, 2011.","paperID":"None"},{"content":"Panagiotis G. Ipeirotis , Foster Provost , Jing Wang, Quality management on Amazon Mechanical Turk, Proceedings of the ACM SIGKDD Workshop on Human Computation, July 25-25, 2010, Washington DC","paperID":"1837906"},{"content":"Prelec, D., \"A Bayesian Truth Serum for Subjective Data, Science, 306, 2004, pp. 462--466.","paperID":"None"},{"content":"Ranjan, R. and Gneiting, T., Combining Probability Forecasts,\" Journal of the Royal Statistical Society: Series B (Statistical Methodology), 72, pp. 71--91.","paperID":"None"},{"content":"Sun, Y. and Dance, C., \"When Majority Voting Fails: Comparing Quality Assurance Methods for Noisy Human Computation Environment,\" Presented at Collective Intelligence Conference, 2012.","paperID":"None"},{"content":"Sun, Y., Roy, S., Little, G., \"Beyond Independent Agreement: A Tournament Selection Approach for Quality Assurance of Human Computation Tasks,\" Proceeding of: Human Computation, Papers from the 2011 AAAI Workshop, San Francisco, California, USA, 2011.","paperID":"None"},{"content":"James Surowiecki, The Wisdom of Crowds, Anchor, 2005","paperID":"1095645"},{"content":"Tetlock, P., Expert Political Judgment, Princeton University Press, Princeton, NJ, 2006.","paperID":"None"},{"content":"Ungar, L., Mellers, B., Satopää, V., Tetlock, P., and Baron, J., \"The Good Judgment Project: A Large Scale Test of Different Methods of Combining Expert Predictions,\" AAAI Fall Symposium Series, 2012.","paperID":"None"},{"content":"Wolfers, J. and Zitzewitz, E., \"Prediction Markets, Journal of Economic Perspectives, American Economic Association, Vol. 18, No. 2, 2004, pp. 107--126.","paperID":"None"},{"content":"Yaniv, I., \"Weighting and Trimming: Heuristics for Aggregating Judgments under Uncertainty,\" Organizational Behavior and Human Decision Processes, 69, 1997, pp. 237--249.","paperID":"None"}],"abstract":"Researchers have long known that aggregate estimations built from the collected opinions of a large group of people often outperform the estimations of individual experts. This phenomenon is generally described as the \"Wisdom of Crowds\". This approach has shown promise with respect to the task of accurately forecasting future events. Previous research has demonstrated the value of utilizing meta-forecasts (forecasts about what others in the group will predict) when aggregating group predictions. In this paper, we describe an extension to meta-forecasting and demonstrate the value of modeling the familiarity among a population's members (its social network) and applying this model to forecast aggregation. A pair of studies demonstrates the value of taking this model into account, and the described technique produces aggregate forecasts for future events that are significantly better than the standard Wisdom of Crowds approach as well as previous meta-forecasting techniques.","video":"http://www.youtube.com/embed/fvvBUSBWT9w?rel=0","title":"Crowdsourcing the future: predictions made with a social network","filename":"CHI14/p3655","authors":["Clifton Forlines","Sarah Miller","Leslie Guelcher","Robert Bruzzi"],"conference":"CHI '14"}