{"paperId":2556957,"citation":[],"reference":[{"content":"Bradski, G. The OpenCV Library. Dr. Dobb's Journal of Software Tools (2000).","paperID":"None"},{"content":"Coco, M. I., and Keller, F. Scan patterns predict sentence production in the cross-modal processing of visual scenes. Cognitive Science (2012).","paperID":"None"},{"content":"G. Fanelli , J. Gall , L. Van Gool, Real time head pose estimation with random regression forests, Proceedings of the 2011 IEEE Conference on Computer Vision and Pattern Recognition, p.617-624, June 20-25, 2011","paperID":"2191890"},{"content":"Griffin, Z. M., and Bock, K. What the eyes say about speaking. Psychological science 11, 4 (2000), 274--279.","paperID":"None"},{"content":"Henderson, J. M. Human gaze control during real-world scene perception. Trends in cognitive sciences 7, 11 (2003), 498--504.","paperID":"None"},{"content":"Just, M. A., and Carpenter, P. A. Eye fixations and cognitive processes. Cognitive Psychology 8, 4 (1976), 441--480.","paperID":"None"},{"content":"Manpreet Kaur , Marilyn Tremaine , Ning Huang , Joseph Wilder , Zoran Gacovski , Frans Flippo , Chandra Sekhar Mantravadi, Where is \"it\"? Event Synchronization in Gaze-Speech Input Systems, Proceedings of the 5th international conference on Multimodal interfaces, November 05-07, 2003, Vancouver, British Columbia, Canada","paperID":"958463"},{"content":"Zahar Prasov , Joyce Y. Chai, What's in a gaze?: the role of eye-gaze in reference resolution in multimodal conversational interfaces, Proceedings of the 13th international conference on Intelligent user interfaces, January 13-16, 2008, Gran Canaria, Spain","paperID":"1378777"},{"content":"Zahar Prasov , Joyce Y. Chai, Fusing eye gaze with speech recognition hypotheses to resolve exophoric references in situated dialogue, Proceedings of the 2010 Conference on Empirical Methods in Natural Language Processing, p.471-481, October 09-11, 2010, Cambridge, Massachusetts","paperID":"1870704"},{"content":"Pernilla Qvarfordt , David Beymer , Shumin Zhai, RealTourist: a study of augmenting human-human and human-computer dialogue with eye-gaze overlay, Proceedings of the 2005 IFIP TC13 international conference on Human-Computer Interaction, September 12-16, 2005, Rome, Italy","paperID":"2106454"},{"content":"Pernilla Qvarfordt , Shumin Zhai, Conversing with the user based on eye-gaze patterns, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 02-07, 2005, Portland, Oregon, USA","paperID":"1055004"},{"content":"Roy, D., and Mukherjee, N. Visual context driven semantic priming of speech recognition and understanding. Computer Speech and Language (2003).","paperID":"None"},{"content":"Roy, D. K. Learning visually grounded words and syntax for a scene description task. Computer Speech & Language 16, 3 (2002), 353--385.","paperID":"None"},{"content":"Weide., H. The Carnegie Mellon University Pronunciation Dictionary, release 0.6. Carnegie Mellon University, 1998.","paperID":"None"},{"content":"Young, S. J., Evermann, G., Gales, M. J. F., Hain, T., Kershaw, D., Moore, G., Odell, J., Ollason, D., Povey, D., Valtchev, V., and Woodland, P. C. The HTK Book, version 3.4. Cambridge University Engineering Department, Cambridge, UK, 2006.","paperID":"None"}],"abstract":"In this paper, we present a multimodal speech recognition system for real world scene description tasks. Given a visual scene, the system dynamically biases its language model based on the content of the visual scene and visual attention of the speaker. Visual attention is used to focus on likely objects within the scene. Given a spoken description the system then uses the visually biased language model to process the speech. The system uses head pose as a proxy for the visual attention of the speaker. Readily available standard computer vision algorithms are used to recognize the objects in the scene and automatic real time head pose estimation is done using depth data captured via a Microsoft Kinect. The system was evaluated on multiple participants. Overall, incorporating visual information into the speech recognizer greatly improved speech recognition accuracy. The rapidly decreasing cost of 3D sensing technologies such as the Kinect allows systems with similar underlying principles to be used for many speech recognition tasks where there is visual information.","video":"http://www.youtube.com/embed/7QQijDpVBx8?rel=0","title":"Improving automatic speech recognition through head pose driven visual grounding","filename":"CHI14/p3235","authors":["Soroush Vosoughi"],"conference":"CHI '14"}