{"paperId":2556352,"reference":[],"abstract":"Nature-inspired algorithms such as cuckoo search and firefly algorithm have become popular and widely used in recent years in many applications. These algorithms are flexible, efficient and easy to implement. New progress has been made in the last few years, and it is timely to summarize the latest developments of cuckoo search and firefly algorithm and their diverse applications. This book will review both theoretical studies and applications with detailed algorithm analysis, implementation and case studies so that readers can benefit most from this book. Application topics are contributed by many leading experts in the field. Topics include cuckoo search, firefly algorithm, algorithm analysis, feature selection, image processing, travelling salesman problem, neural network, GPU optimization, scheduling, queuing, multi-objective manufacturing optimization, semantic web service, shape optimization, and others. This book can serve as an ideal reference for both graduates and researchers in computer science, evolutionary computing, machine learning, computational intelligence, and optimization, as well as engineers in business intelligence, knowledge management and information technology.","citation":[{"content":"Xin-She Yang, Diversity and Mechanisms in Swarm Intelligence, International Journal of Swarm Intelligence Research, v.5 n.2, p.1-12, April 2014","paperID":"2729704"},{"content":"Aziz Ouaarab , Belaïd Ahiod , Xin-She Yang, Random-key cuckoo search for the travelling salesman problem, Soft Computing - A Fusion of Foundations, Methodologies and Applications, v.19 n.4, p.1099-1106, April     2015","paperID":"2747565"},{"content":"Wei Fang , Jun Sun , Huanhuan Chen , Xiaojun Wu, A decentralized quantum-inspired particle swarm optimization algorithm with cellular structured population, Information Sciences: an International Journal, v.330 n.C, p.19-48, February 2016","paperID":"2870435"},{"content":"Xin-She Yang, Nature-Inspired Optimization Algorithms, Elsevier Science Publishers B. V., Amsterdam, The Netherlands, 2014","paperID":"2655295"}],"title":"Cuckoo Search and Firefly Algorithm: Theory and Applications","authors":""}