{"paperId":2556325,"reference":[],"abstract":"Welcome to the first annual meeting of the ACM Conference on Learning at Scale! This conference is intended to promote scientific exchange of interdisciplinary research at the intersection of the learning sciences and computer science. Inspired by the emergence of Massive Open Online Courses (MOOCs) and the accompanying huge shift in thinking about education, this conference was created by ACM as a new scholarly venue and focal point for the review and presentation of the highest quality research on how learning and teaching can change--and improve--when done at scale.When we were asked to organize this conference, we were faced with the challenge of making many decisions about what kind of conference this would be, starting with its name. We decided on \"Learning at Scale,\" which is intended to be broader than the term of the moment, MOOC, and to have a longer shelf life. We are pleased that the term has caught on, with a similarly-named journal special issue (ACM TOCHI) and workshop (ACM SIGCHI) already announced.What would the scope of L@S be and how would it be different from other learning technology conferences? We decided that a broad array of topics, from usability studies and systems building to data mining and theories of learning, would be in scope as long as the work focused on what changed when the approach involved engaging very large numbers of students, either face to face or remotely. While there was overall agreement within the Program Committee about this definition, in a few cases they struggled in to determine whether a given paper was in scope. We hope that in future years the meaning will become increasingly well-defined.Another top goal for this inaugural offering was quality. The entire program committee was dedicated to accepting only top-notch results for the full papers, and we hope you agree that the 14 full papers selected for presentation are of uniformly excellent quality and represent breadth and interdisciplinary collaboration among leading researchers in the various fields L@S brings together. (There were 38 full papers submitted, for an acceptance rate of 37%.) With very few exceptions, papers were reviewed by the PC members themselves.The extensive work-in-progress/poster abstracts and demonstrations give a hint of the exciting work still to come in this vigorous new area. These were reviewed more liberally, with an acceptance rate of 76%: 37 posters and 5 demos.The invited speakers and panels showcase the topical breadth of L@S: keynote speaker Prof. Chris Dede of Harvard on immersive, personal, ubiquitous learning; Dr. Ed Cutrell and Dr. Bill Thies of Microsoft Research India describing their experience with MOOCs in the developing world; Dr. Janet Kolodner of the National Science Foundation discussing the agency's programs relevant to research in learning at scale; and tutorials on learning through discussion (Carolyn Penstein Rosé, Carnegie Mellon University) and item response theory (Eliana Feasley, Jace Kohlmeier, and Jascha Sohl-Dickstein of Khan Academy).We see L@S as a challenge and an opportunity to start building a truly interdisciplinary community of practice between researchers and practitioners, computer scientists and learning scientists. We are proud of the caliber and diversity of the members of our stellar program committee, which contains a balance of learning scientists and computer scientists. That said, we hope that a longer submission timeline for next year's conference, combined with this year's success establishing L@S as the premier venue for this interdisciplinary research, will lead to more contributed papers from learning scientists.In particular, we see an opportunity in which MOOCs and other instruments of learning at scale become common artifacts around which learning scientists, computer scientists, educators, and instructors can collaborate. And because MOOCs rely on software-as-a-service for delivering materials, we can encapsulate research findings in the tools provided to thousands of instructors and millions of learners, increasing both the leverage of the research and the speed with which it can be put into practice. Our program includes a panel of experts who will discuss what software platforms for large online courses need from research, and vice versa.","citation":[],"title":"Proceedings of the first ACM conference on Learning @ scale conference","filename":"L@S 2014undefined/2556325","authors":["Mehran Sahami","Armando Fox","Marti A. Hearst","Michelene T.H. Chi"],"conference":"L@S 2014"}