{"paperId":2556971,"abstract":"In this paper, we describe results from fieldwork conducted at a social services site where the workers evaluate citizens' applications for food and medical assistance submitted via an e-government system. These results suggest value tensions that result - not from different stakeholders with different values - but from differences among how stakeholders enact the same shared value in practice. In the remainder of this paper, we unpack the distinct and conflicting interpretations or logics of three shared values - efficiency, access, and education. In particular, we analyze what happens when social services workers have ideas about what it means to expand access, increase efficiency, and educate the public that conflict with the logics embedded in the e-government system. By distinguishing between overarching values and specific logics, we provide an analytic framework for exploring value tensions as values are enacted in practice.","reference":[{"content":"Tamara Alsheikh , Jennifer A. Rode , Siân E. Lindley, (Whose) value-sensitive design: a study of long- distance relationships in an Arabic cultural context, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958836"},{"content":"Bélanger, F. & Carter, L. (2006). The effects of the digital divide on e-government: An empirical evaluation. In Proc. HICSS. Los Alamitos, CA: IEEE Computer Society, pp. 81--88.","paperID":"None"},{"content":"Alan Borning , Michael Muller, Next steps for value sensitive design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208560"},{"content":"Chadwick, A., & May, C. (2003). Interaction between states and citizens in the age of the internet: \"E-government\" in the USA, Britain and the European Union. Governance 16 (2), 271--300.","paperID":"None"},{"content":"Corbin, J. & Strauss, A. (2007). Basics of qualitative research: Techniques and procedures for developing grounded theory. Thousand Oaks, CA: Sage Publications.","paperID":"None"},{"content":"Cordella, A., & Bonina, C. (2012). A public value perspective for ICT enabled public sector reforms: A theoretical reflection. Government Information Quarterly 29 (4), 512--520.","paperID":"None"},{"content":"Lynn Dombrowski , Amy Voida , Gillian R. Hayes , Melissa Mazmanian, The labor practices of service mediation: a study of the work practices of food assistance outreach, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208342"},{"content":"Friedman, B., Kahn, P. H. & Borning, A. (2006). Value sensitive design and information systems. In P. Zhang & D. Galletta (Eds.), Human-computer interaction in management information systems: Foundations (pp. 348--372). Armonk, New York: M. E. Sharpe.","paperID":"None"},{"content":"Gadamer, H. G. (2005). Truth and method. (2nd ed.). (J. Weinsheimer & D. G. Marshall, Trans.). London, UK: Continuum Publishing Group.","paperID":"None"},{"content":"Hearing to review federal nutrition programs: Hearing before the Subcommittee on Department Operations, Oversight, Nutrition, and Forestry, of the Committee on Agriculture, 111th Cong., 41 (2010) (testimony of Nancy Swanson).","paperID":"None"},{"content":"Ellie Harmon , Melissa Mazmanian, Stories of the Smartphone in everyday discourse: conflict, tension & instability, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466134"},{"content":"Heeks, R. (2008). Benchmarking e-government: Improving the national and international measurement, evaluation and comparison of e-government. In Z. Irani & P. Love (Eds.), Evaluation of information systems (pp. 257--296). Burlington, MA: Butterworth-Heinemann.","paperID":"None"},{"content":"Hood, C. (1991). A public management for all seasons. Public Administration, 69 (1), 3--9.","paperID":"None"},{"content":"Jaeger, P. T. (2005). Deliberative democracy and the conceptual foundations of electronic government. Government Information Quarterly, 22 (4), 702--719.","paperID":"None"},{"content":"Alison Kidd, The marks are on the knowledge worker, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.186-191, April 24-28, 1994, Boston, Massachusetts, USA","paperID":"191740"},{"content":"Cory Knobel , Geoffrey C. Bowker, Values in design, Communications of the ACM, v.54 n.7, July 2011","paperID":"1965735"},{"content":"Christopher A. Le Dantec , Erika Shehan Poole , Susan P. Wyche, Values as lived experience: evolving value sensitive design in support of value discovery, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518875"},{"content":"Meynhardt, T. (2009). Public value inside: What is public value creation? International Journal of Public Administration 32 (3-4), 192--219.","paperID":"None"},{"content":"Jessica K. Miller , Batya Friedman , Gavin Jancke , Brian Gill, Value tensions in design: the value sensitive design, development, and appropriation of a corporation's groupware system, Proceedings of the 2007 international ACM conference on Supporting group work, November 04-07, 2007, Sanibel Island, Florida, USA","paperID":"1316668"},{"content":"Milne, G. R. & Culnan, M. J. (2004). Strategies for reducing online privacy risks: Why consumers read (or don't read) online privacy notices. Journal of Interactive Marketing 18 (3), 15--29.","paperID":"None"},{"content":"Mossenburg, K., Tolbert, C., & Stansbury, M. (2003). Virtual inequality: Beyond the digital divide. Washington, D. C: George Washington University Press.","paperID":"None"},{"content":"Norris, D. F. & Reddick, C. G. (2013). Local e-government in the USA: Transformation or incremental change Public Administration Review 73 (1), 165--175.","paperID":"None"},{"content":"Willem Pieterson , Jan van Dijk, Channel choice determinants; an exploration of the factors that determine the choice of a service channel in citizen initiated contacts, Proceedings of the 8th annual international conference on Digital government research: bridging disciplines & domains, May 20-23, 2007, Philadelphia, Pennsylvania","paperID":"1248488"},{"content":"Reddick, C. G. & Turner, M. (2012). Channel choice and public service delivery in Canada: Comparing e-government to traditional service delivery. Government Information Quarterly 29 (1) 1--11.","paperID":"None"},{"content":"Riggins, F. J. & Dewan, S. (2005). The digital divide: Current and future research directions. Journal of the Association for Information Systems 6 (12), 298--337.","paperID":"None"},{"content":"Sæbø, Ø., Rose, J., & Flak, S. (2008). The shape of e-participation: Characterizing an emerging research area. Government Information Quarterly 25 (3), 400--428.","paperID":"None"},{"content":"Phoebe Sengers , Kirsten Boehner , Shay David , Joseph 'Jofish' Kaye, Reflective design, Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility, August 20-24, 2005, Aarhus, Denmark","paperID":"1094569"},{"content":"Phoebe Sengers , Bill Gaver, Staying open to interpretation: engaging multiple meanings in design and evaluation, Proceedings of the 6th conference on Designing Interactive systems, June 26-28, 2006, University Park, PA, USA","paperID":"1142422"},{"content":"Amy Voida , Elizabeth D. Mynatt, Exploring a technological hermeneutic: understanding the interpretation of computer-mediated messaging systems, Georgia Institute of Technology, Atlanta, GA, 2008","paperID":"1559162"},{"content":"David Graham Wastell, Organizational Discourse as a Social Defense: Taming the Tiger of Electronic Government, Proceedings of the IFIP TC8/WG8.2 Working Conference on Global and Organizational Discourse about Information Technology, p.179-195, December 12-14, 2002","paperID":"722399"},{"content":"Darrell M. West, Digital Government: Technology and Public Sector Performance, Princeton University Press, Princeton, NJ, 2007","paperID":"1534688"},{"content":"Winner, L. (1980). Do artifacts have politics? Daedalus 109 (1), 121--136.","paperID":"None"},{"content":"Yildiz, M. & Saylam, A. (2013). E-government discourses: An inductive analysis. Government Information Quarterly 30 (2), 141--153.","paperID":"None"}],"citation":[{"content":"Youyang Hou, Understand the Design and Implementation of Civic Technologies in Public Organizations, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2874353"},{"content":"Christopher A. Le Dantec , Sarah Fox, Strangers at the Gate: Gaining Access, Building Rapport, and Co-Constructing Community-Based Research, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675147"},{"content":"Melissa Mazmanian , Ingrid Erickson , Ellie Harmon, Circumscribed Time and Porous Time: Logics as a Way of Studying Temporality, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675231"},{"content":"Matthias Korn , Amy Voida, Creating friction: infrastructuring civic engagement in everyday life, Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives, August 17-21, 2015, Aarhus, Denmark","paperID":"2882875"}],"title":"Shared values/conflicting logics: working around e-government systems","filename":"CHI14/p3583","authors":["Amy Voida","Lynn Dombrowski","Gillian R. Hayes","Melissa Mazmanian"],"conference":"CHI '14"}