{"paperId":2556977,"citation":[],"reference":[{"content":"Judd Antin, My kind of people?: perceptions about wikipedia contributors and their motivations, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979451"},{"content":"Judd Antin , Coye Cheshire, Readers are not free-riders: reading as a form of participation on wikipedia, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718942"},{"content":"Bandura, A. Social Foundations of Thought and Action: A Social Cognitive Theory. Prentice-Hall, Englewood Cliffs, NJ, USA, 1986.","paperID":"None"},{"content":"Barnatt, C. A Brief Guide to Cloud Computing. Robinson, London, 2010.","paperID":"None"},{"content":"Bereiter, C. Principled practical knowledge: Not a bridge but a ladder, to appear in Journal of the Learning Sciences, 2013.","paperID":"None"},{"content":"Bernecker, S. and Pritchard, D. Eds. Routledge Companion to Epistemology. Routledge, London, UK, 2010.","paperID":"None"},{"content":"Bransford, J.D., Brown, A.L. and Cocking, R.R. Eds. How People Learn: Brain, Mind, Experience, and School. National Academy Press, Washington DC, USA, 2000.","paperID":"None"},{"content":"Stuart K. Card , Allen Newell , Thomas P. Moran, The  Psychology of Human-Computer Interaction, L. Erlbaum Associates Inc., Hillsdale, NJ, 1983","paperID":"578027"},{"content":"Chinn, C. A., Buckland, L. A., and Samarapungavan, S. C. B. Integrating philosophy into learning sciences research on epistemic cognition. In Proceedings of the 9th International Conference of the Learning Sciences (ICLS 2010), 2, 2010, 37--44.","paperID":"None"},{"content":"Chinn, C., Buckland, L. and Samarapungavan, A. Expanding the dimensions of epistemic cognition: arguments from philosophy and psychology. Educational Psychologist, 46, 3 (2011), 141--167.","paperID":"None"},{"content":"Crandall, B., Klein, G. and Hoffman, R.R. Working Minds: A Practitioner's Guide to Cognitive Task Analysis. The MIT Press, Cambridge, MA, USA, 2006.","paperID":"None"},{"content":"Fiske, S.T. and Taylor, S.E. Social Cognition (2nd Ed.). McGraw-Hill, New York, NY, USA, 1991.","paperID":"None"},{"content":"Floridi, L. Information ethics: Its nature and scope. In Information Technology and Moral Philosophy, van den Hoven, J. and Weckert, J. Eds. Cambridge University Press Cambridge, NY, USA, 2008.","paperID":"None"},{"content":"Fuller, S. Social Epistemology. Indiana University Press, Bloomington, IN, USA, 2002.","paperID":"None"},{"content":"Hofer, B.K. Dimensionality and disciplinary differences in personal epistemology. Contemporary Educational Psychology, 25, 4(2000), 378--405.","paperID":"None"},{"content":"Hofer, B.K. and Pintrich, P.R. The development of epistemological theories: Beliefs about knowledge and knowing and their relation to learning. Review of Educational Research, 67, (1997), 88--140.","paperID":"None"},{"content":"Hofer, B.K. and Pintrich, P.R. Personal Epistemology: The Psychology of Beliefs about Knowledge and Knowing. Erlbaum, Mahwah, NJ, USA, 2002.","paperID":"None"},{"content":"Hoffman R. R. and Lintern, G. Eliciting and representing the knowledge of experts. In Cambridge Handbook of Expertise and Expert Performance, Ericsson, K. A. et al. Eds. Cambridge University Press, New York, NY, USA, 2006, 203--222.","paperID":"None"},{"content":"Hoffman R.R. and Militello L.G. Perspectives on Cognitive Task Analysis: Historical Origins and Modern Communities of Practice. Taylor & Francis Press, New York, NY, USA, 2009.","paperID":"None"},{"content":"Hu, L. and Bentler, P.M. Cutoff criteria for fit indexes in covariance structure analysis: Conventional criteria versus new alternatives. Structural Equation Modeling, 6, 1 (1999), 1--55.","paperID":"None"},{"content":"Goldman, A. I. Epistemology and Cognition. Harvard University Press, Cambridge, MA, USA, 1986.","paperID":"None"},{"content":"Goldman, A.I. Knowledge in a Social World. Oxford University Press, New York, NY, USA, 1999.","paperID":"None"},{"content":"Goldman, A.I. A guide to social epistemology. In Goldman, A.I. and Whitcomb, D. Eds. Social Epistemology: Essential Readings. New York, NY, USA, Oxford University Press, 2011.","paperID":"None"},{"content":"Kadushin, C. Understanding Online Social Networks: Theories, Concepts, and Findings. Oxford University Press, New York, NY, USA, 2012.","paperID":"None"},{"content":"Kitchener, K.S. Cognition, metacognition, and epistemic cognition. Human Development, 26, 4 (1983), 222--232.","paperID":"None"},{"content":"Gary Klein , Karol G. Ross , Brian M. Moon , Devorah E. Klein , Robert R. Hoffman , Erik Hollnagel, Macrocognition, IEEE Intelligent Systems, v.18 n.3, p.81-85, May 2003","paperID":"776689"},{"content":"Kline, P. The Handbook of Psychological Testing (2nd Ed.). Routledge, London, UK, 1999.","paperID":"None"},{"content":"Kuhn, T.S. The Structure of Scientific Revolutions. University of Chicago Press, Chicago, IL, USA, 1962.","paperID":"None"},{"content":"Kvanvig, J.L. The Value of Knowledge and the Pursuit of Understanding. Cambridge University Press,Cambridge, UK, 2003.","paperID":"None"},{"content":"Laudan, L. Science and values. University of California Press, Berkeley, CA, USA, 1984.","paperID":"None"},{"content":"Lave, J. and Wenger, E. Situated Learning: Legitimate Peripheral Participation. Cambridge University Press, Cambridge, UK, 1991.","paperID":"None"},{"content":"McDonald, R.P. and Ho, M.H.R. Principles and practice in reporting structural equation analyses, Psychological Methods, 7, 1 (2002), 64--82.","paperID":"None"},{"content":"Perry, W.G., Jr. Forms of Intellectual and Ethical Development in the College Years: A Scheme. San Francisco, CA, Jossey-Bass, 1968.","paperID":"None"},{"content":"Pritchard, D., Millar, A. and Haddock, A. The Nature and Value of Knowledge: Three Investigations, New York, NY, USA, Oxford University Press, 2010.","paperID":"None"},{"content":"Robert W. Proctor , Kim-Phuong L. Vu, Human information processing: an overview for human-computer interaction, The human-computer interaction handbook: fundamentals, evolving technologies and emerging applications, L. Erlbaum Associates Inc., Hillsdale, NJ, 2002","paperID":"772079"},{"content":"Proudfoot, M. and Lacey, A.R. The Routhedge Dictionary of Philosophy, 4th Ed. Routledge, New York, NY, USA, 2010.","paperID":"None"},{"content":"Salmon, W.C. Four Decades of Scientific Explanation. University of Minnesota Press, Minneapolis, MN, USA, 1989.","paperID":"None"},{"content":"Scardamalia, M. and Bereiter, C. Knowledge building: Theory, pedagogy, and technology. In Cambridge Handbook of the Learning Sciences, Sawyer, K. Ed. Cambridge University Press, New York, NT, USA, 2006, 97--118.","paperID":"None"},{"content":"Schommer, M. Effects of beliefs about the nature of knowledge on comprehension. Journal of Educational Psychology, 82, 3 (1990) 498--504.","paperID":"None"},{"content":"m. c. schraefel, Building Knowledge: What's beyond Keyword Search?, Computer, v.42 n.3, p.52-59, March 2009","paperID":"1525676"},{"content":"Abigail Sellen , Yvonne Rogers , Richard Harper , Tom Rodden, Reflecting human values in the digital age, Communications of the ACM, v.52 n.3, March 2009","paperID":"1467265"},{"content":"Yvonne Rogers , Helen Sharp , Jenny Preece, Interaction Design: Beyond Human - Computer Interaction, Wiley Publishing, 2011","paperID":"2031622"},{"content":"Sosa, E. Reliabilism and intellectual virtue. In Epistemology: Internalism and Externalism, Kornblith Ed. Blackwell, Malden, MA, USA, 2001, 147--162.","paperID":"None"},{"content":"Gerry Stahl, Contributions to a theoretical framework for CSCL, Proceedings of the Conference on Computer Support for Collaborative Learning: Foundations for a CSCL Community, January 07-11, 2002, Boulder, Colorado","paperID":"1658626"},{"content":"Stahl, G., Koschmann, T., and Suthers, D.D. Computer-supported collaborative learning. In Cambridge Handbook of the Learning Sciences, Sawyer, K. Ed. Cambridge University Press, New York, NT, USA, 2006, 409--425.","paperID":"None"},{"content":"Vygotsky, L. S. Mind in Society: The Development of Higher Psychological Processes. M. Cole, et al. Eds. Cambridge, MA, USA, Harvard University Press, 1978.","paperID":"None"},{"content":"Wertsch, J.V. Voices of the Mind: A Sociocultural Approach to Mediated Action. Cambridge, MA, USA, Harvard University Press, 1991.","paperID":"None"},{"content":"J. Christopher Westland, Lower bounds on sample size in structural equation modeling, Electronic Commerce Research and Applications, v.9 n.6, p.476-487, November, 2010","paperID":"1865099"},{"content":"Zagzebski, L. On Epistemology. Wadsworth, Cengage Learning, Belmont, CA, USA, 2009.","paperID":"None"}],"abstract":"Social media and online social networks dramatically change the way in which knowledge is acquired and disseminated. How do we re-understand about human knowledge and knowing? This work aims at extending the current understanding of human epistemic cognition in online social environments, where epistemic cognition refers to cognitions and cognitive processes related to epistemic matters such as knowledge and beliefs justification. We approach our inquiry with mixed methods: (1) quantitative study to test whether epistemic cognition might differ in individual and social contexts, and whether online interactions might mediate the later; and (2) social cognitive task analysis with interviews to manifest the intricate interplay of dynamics between social epistemic cognition and online interactions. We introduce the new construct of social epistemic cognition and contribute to the field of HCI with an evolved theory which states that epistemic cognition can be promoted in online social environments as mediated by online interactions.","video":"http://www.youtube.com/embed/cWHEscsbFYE?rel=0","title":"Social epistemic cognition in online interactions","filename":"CHI14/p3289","authors":["Rosanna Yuen-Yan Chan","Silu Li","Diane Hui"],"conference":"CHI '14"}