{"paperId":2556363,"citation":[],"reference":[],"abstract":"Expert JavaScript is your definitive guide to understanding how and why JavaScript behaves the way it does. Master the inner workings of JavaScript by learning in detail how modern applications are made. In covering lesser-understood aspects of this powerful language and truly understanding how it works, your JavaScript code and programming skills will improve. You will learn about core fundamentals of JavaScript, including deep dives into functions, scopes, closures, and practical object-oriented code. Mark Daggett explains clearly how closures, events, and asynchronous code really operate, as well as conventions and concepts to write JavaScript in a clear, pragmatic style. Many of the changes in ECMAScript6 and its implications are all explained. You'll be introduced to modern workflow tools to make application development faster, more enjoyable, and ostensibly more profitable. You'll understand how to measure code quality and write more testable JavaScript, and finally you'll learn about real-world applications of JavaScript, including JavaScript-powered robots. JavaScript is one of the most powerful languages on the web today, and it is only getting stronger. This book will take you through the process of planning, coding, testing, profiling and finally releasing your application, at expert level. With more frameworks and more improvements than ever, now is the time to become an expert at JavaScript. Make this journey - use Expert JavaScript today. What you'll learn What is really going on underneath functions, in arguments, types, coercion, and scope How closures, events, and asynchronous code work at a fundamental level How to understand advanced topics including promise objects, coroutines, and generators How to apply this newfound knowledge pragmatically to build the very best modern JavaScript applications Who this book is for This book is for the experienced JavaScript programmer who wants to understand the how and why of their code in order to become a better developer. This book is not intended to teach JavaScript at a syntactical level, but instead delve deep into the code - the philosophy, the reasoning and the detailed expert-level knowledge behind it. Thisnewfoundknowledge will enable the reader to build the very best modern JavaScript applications. It is for anyone who wants to become a better programmer by understanding at a very high level how the code works.","title":"Expert JavaScript","authors":""}