{"paperId":2556988,"reference":[{"content":"Ablaßmeier, M., Poitschke, T., Wallhoff, F., Bengler, K., and Rigoll, G. Eye gaze studies comparing head-up and head-down displays in vehicles. IEEE International Conference on Multimedia and Expo, IEEE (2007), 2250--2252.","paperID":"None"},{"content":"Baldwin, C.L., Eisert, J.L., and Garcia, A. Multimodal urgency coding: auditory, visual, and tactile parameters and their impact on perceived urgency. Work 41, (2012), 3586--3591.","paperID":"None"},{"content":"Baldwin, C.L. Verbal collision avoidance messages during simulated driving: perceived urgency, alerting effectiveness and annoyance. Ergonomics 54, 4 (2011), 328--337.","paperID":"None"},{"content":"Bliss, J.P. and Acton, S.A. Alarm mistrust in automobiles: how collision alarm reliability affects driving. Applied ergonomics 34, 6 (2003), 499--509.","paperID":"None"},{"content":"Stephen A. Brewster , Peter C. Wright , Alistair D. N. Edwards, An evaluation of earcons for use in auditory human-computer interfaces, Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems, p.222-227, April 24-29, 1993, Amsterdam, The Netherlands","paperID":"169179"},{"content":"Duncan P. Brumby , Samantha C.E. Davies , Christian P. Janssen , Justin J. Grace, Fast or safe?: how performance objectives determine modality output choices while interacting on the move, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979009"},{"content":"Yujia Cao , Frans van der Sluis , Mariët Theune , Rieks op den Akker , Anton Nijholt, Evaluating informative auditory and tactile cues for in-vehicle information systems, Proceedings of the 2nd International Conference on Automotive User Interfaces and Interactive Vehicular Applications, November 11-12, 2010, Pittsburgh, Pennsylvania","paperID":"1969791"},{"content":"Edworthy, J., Hellier, E., Walters, K., Weedon, B., and Adams, A. The Relationship between Task Performance, Reaction Time, and Perceived Urgency in Nonverbal Auditory Warnings. HFES Annual Meeting 44, 22 (2000), 674--677.","paperID":"None"},{"content":"Edworthy, J., Loxley, S., and Dennis, I. Improving auditory warning design: Relationship between warning sound parameters and perceived urgency. Human Factors 33, 2 (1991), 205--231.","paperID":"None"},{"content":"Gonzalez, C., Lewis, B.A., Roberts, D.M., Pratt, S.M., and Baldwin, C.L. Perceived Urgency and Annoyance of Auditory Alerts in a Driving Context. HFES Annual Meeting 56, 1 (2012), 1684--1687.","paperID":"None"},{"content":"Ho, C., Reed, N., and Spence, C. Multisensory In-Car Warning Signals for Collision Avoidance. Human Factors 49, 6 (2007), 1107--1114.","paperID":"None"},{"content":"Ho, C. and Spence, C. Assessing the effectiveness of various auditory cues in capturing a driver's visual attention. Journal of experimental psychology. Applied 11, 3 (2005), 157--74.","paperID":"None"},{"content":"Ho, C. and Spence, C. Multisensory Driver. Ashgate, 2008.","paperID":"None"},{"content":"Ho, C., Tan, H.Z., and Spence, C. Using spatial vibrotactile cues to direct visual attention in driving scenes. Traffic Psychology and Behaviour 8, 6 (2005), 397--412.","paperID":"None"},{"content":"Eve Hoggan , Roope Raisamo , Stephen A. Brewster, Mapping information to audio and tactile icons, Proceedings of the 2009 international conference on Multimodal interfaces, November 02-04, 2009, Cambridge, Massachusetts, USA","paperID":"1647382"},{"content":"Eve E. Hoggan , Stephen A. Brewster, Crossmodal icons for information display, CHI '06 Extended Abstracts on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1125619"},{"content":"Horrey, W.J. and Wickens, C.D. Driving and Side Task Performance: The Effects of Display Clutter, Separation, and Modality. Human Factors 46, 4 (2004), 611--624.","paperID":"None"},{"content":"Kaufmann, C., Ohg, F., Risser, R., Geven, A., and Sefelin, R. Effects of simultaneous multi-modal warnings and traffic information on driver behaviour. Human Centred Design for Intelligent Transport Systems, (2008), 33--42.","paperID":"None"},{"content":"Lewis, B.A. and Baldwin, C.L. Equating Perceived Urgency Across Auditory, Visual, and Tactile Signals. HFES Annual Meeting 56, 1 (2012), 1307--1311.","paperID":"None"},{"content":"Lewis, B.A., Penaranda, B.N., Roberts, D.M., and Baldwin, C.L. Effectiveness of Bimodal Versus Unimodal Alerts for Distracted Drivers. Human Factors in Driver Assessment, Training and Vehicle Design, (2013), 376--382.","paperID":"None"},{"content":"Lindgren, A., Angelelli, A., Mendoza, P.A., and Chen, F. Driver behaviour when using an integrated advisory warning display for advanced driver assistance systems. IET Intelligent Transport Systems 3, 4 (2009), 390--399.","paperID":"None"},{"content":"Liu, Y.-C. and Jhuang, J.-W. Effects of in-vehicle warning information displays with or without spatial compatibility on driving behaviors and response performance. Applied ergonomics 43, 4 (2012), 679--86.","paperID":"None"},{"content":"Liu, Y.C. Comparative study of the effects of auditory, visual and multimodality displays on drivers' performance in advanced traveller information systems. Ergonomics 44, 4 (2001), 425--42.","paperID":"None"},{"content":"Marshall, D.C., Lee, J.D., and Austria, P.A. Alerts for In-Vehicle Information Systems: Annoyance, Urgency, and Appropriateness. Human Factors 49, 1 (2007), 145--157.","paperID":"None"},{"content":"Murata, A., Kanbayashi, M., and Hayami, T. Effectiveness of automotive warning system presented with multiple sensory modalities. SICE Annual Conference, IEEE Comput. Soc (2012), 920--925.","paperID":"None"},{"content":"Oskarsson, P.A., Eriksson, L., and Carlander, O. Enhanced Perception and Performance by Multimodal Threat Cueing in Simulated Combat Vehicle. Human Factors 54, 1 (2011), 122--137.","paperID":"None"},{"content":"Ioannis Politis , Stephen Brewster , Frank Pollick, Evaluating multimodal driver displays of varying urgency, Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, October 28-30, 2013, Eindhoven, Netherlands","paperID":"2516543"},{"content":"Pratt, S.M., Lewis, B.A., Penaranda, B.N., Roberts, D.M., Gonzalez, C., and Baldwin, C.L. Perceived Urgency Scaling in Tactile Alerts. HFES Annual Meeting 56, 1 (2012), 1303--1306.","paperID":"None"},{"content":"Raab, D.H. Statistical Facilitation of Simple Reaction Times. Transactions of the New York Academy of Sciences 24, 5 Series II (1962), 574--590.","paperID":"None"},{"content":"Salvucci, D.D. Modeling driver behavior in a cognitive architecture. Human factors 48, 2 (2006), 362--380.","paperID":"None"},{"content":"Scott, J.J. and Gray, R. A Comparison of Tactile, Visual, and Auditory Warnings for Rear-End Collision Prevention in Simulated Driving. Human Factors 50, 2 (2008), 264--275.","paperID":"None"},{"content":"Serrano, J., Di Stasi, L.L., Megías, A., and Catena, A. Effect of directional speech warnings on road hazard detection. Traffic injury prevention 12, 6 (2011), 630-- 635.","paperID":"None"}],"citation":[{"content":"John G. Gaspar , Timothy L. Brown , Dawn C. Marshall, Examining the interaction between timing and modality in forward collision warnings, Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, September 01-03, 2015, Nottingham, United Kingdom","paperID":"2799287"},{"content":"Ioannis Politis, A beep, a flash, a rumble?: evaluating multimodal displays for drivers, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2559954"},{"content":"Marcel Walch , Kristin Lange , Martin Baumann , Michael Weber, Autonomous driving: investigating the feasibility of car-driver handover assistance, Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, September 01-03, 2015, Nottingham, United Kingdom","paperID":"2799268"},{"content":"Ioannis Politis , Stephen Brewster , Frank Pollick, Language-based multimodal displays for the handover of control in autonomous cars, Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, September 01-03, 2015, Nottingham, United Kingdom","paperID":"2799262"},{"content":"Andreas Löcken , Wilko Heuten , Susanne Boll, Supporting lane change decisions with ambient light, Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, September 01-03, 2015, Nottingham, United Kingdom","paperID":"2799259"},{"content":"Ioannis Politis , Stephen Brewster , Frank Pollick, Speech Tactons Improve Speech Warnings for Drivers, Proceedings of the 6th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, September 17-19, 2014, Seattle, WA, USA","paperID":"2667318"},{"content":"Leeseul Shim , Peipei Liu , Ioannis Politis , Paula Regener , Stephen Brewster , Frank Pollick, Evaluating multimodal driver displays of varying urgency for drivers on the autistic spectrum, Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, September 01-03, 2015, Nottingham, United Kingdom","paperID":"2799261"},{"content":"David Beattie , Lynne Baillie , Martin Halvey , Rod McCall, What's around the corner?: enhancing driver awareness in autonomous vehicles via in-vehicle spatial auditory displays, Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational, p.189-198, October 26-30, 2014, Helsinki, Finland","paperID":"2641206"},{"content":"David Beattie , Lynne Baillie , Martin Halvey, A comparison of artificial driving sounds for automated vehicles, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2807519"}],"abstract":"Previous studies have investigated audio, visual and tactile driver warnings, indicating the importance of communicating the appropriate level of urgency to the drivers. However, these modalities have never been combined exhaustively and tested under conditions of varying situational urgency to assess their effectiveness both in the presence and absence of critical driving events. This paper describes an experiment evaluating all multimodal combinations of such warnings under two contexts of situational urgency: a lead car braking and not braking. The results showed that participants responded quicker to more urgent warnings, especially in the presence of a car braking. They also responded faster to the multimodal as opposed to unimodal signals. Driving behaviour improved in the presence of the warnings and the absence of a car braking. These results highlight the influence of urgency and number of modalities in warning design and indicate the utility of non-visual warnings in driving.","video":"http://www.youtube.com/embed/9iN8-o4z8gY?rel=0","title":"Evaluating multimodal driver displays under varying situational urgency","filename":"CHI14/p4067","authors":["Ioannis Politis","Stephen A. Brewster","Frank Pollick"],"conference":"CHI '14"}