{"paperId":2556982,"reference":[{"content":"Dunne, K. J., Ed. Perspectives on Localization. John Benjamins Publishing Company, 2006.","paperID":"None"},{"content":"Keniston, K. Software localization: Notes on technology and culture. Working Paper #26, MIT press, 1997.","paperID":"None"},{"content":"Geza Kovacs, ScreenMatch: providing context to software translators by displaying screenshots, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2212458"},{"content":"Luis Leiva , Vicent Alabau, Monsieur, azonnal kövessen engem bitte!: an automatically generated interlanguage tailored to speakers of minority but culturally influenced languages, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207681"},{"content":"Muntes-Mulero, V., Adell, P. P., Espana-Bonet, C., and M'arquez, L. Context-aware machine translation for software localization. In Proc. EAMT (2012).","paperID":"None"},{"content":"Bonnie A. Nardi, Context and consciousness: activity theory and human-computer interaction, Massachusetts Institute of Technology, Cambridge, MA, 1995","paperID":"223826"},{"content":"Patricia Russo , Stephen Boor, How fluent is your interface?: designing for international users, Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems, p.342-347, April 24-29, 1993, Amsterdam, The Netherlands","paperID":"169274"},{"content":"Snover, M., Dorr, B., Schwartz, R., Micciulla, L., and Makhoul, J. A study of translation edit rate with targeted human annotation. In Proc. AMTA (2006).","paperID":"None"},{"content":"Huatong Sun, Building a culturally-competent corporate web site: an exploratory study of cultural markers in multilingual web design, Proceedings of the 19th annual international conference on Computer documentation, October 21-24, 2001, Sante Fe, New Mexico, USA","paperID":"501536"}],"citation":[{"content":"Measuring user rated language quality, International Journal of Human-Computer Studies, v.86 n.C, p.1-10, February 2016","paperID":"2870209"},{"content":"Luis A. Leiva , Vicent Alabau, Automatic Internationalization for Just In Time Localization of Web-Based User Interfaces, ACM Transactions on Computer-Human Interaction (TOCHI), v.22 n.3, p.1-32, June 2015","paperID":"2701422"}],"abstract":"Translating the text in an interface is a challenging task. Besides the jargon and technical terms, many of the strings are often very short, such as those shown in buttons and pull-down menus. Then, as a result of the lack of visual context in the traditional localization process, an important ambiguity problem arises. We study three approaches to solve this problem: using plain gettext (baseline condition), using gettext plus being able to operate the UI, and translating the UI in-place. We found that translators are substantially faster with plain gettext but commit a significantly higher number of errors in comparison to the other approaches. Unexpectedly, the mixed condition was slower and more error-prone than in-place translation. The latter was found to be comparable to plain gettext in terms of time, although some strings passed unnoticed as the UI was operated. Based on our results, we arrive at a set of recommendations to augment localization tools to improve translator's productivity.","video":"http://www.youtube.com/embed/3ymu32_o3HY?rel=0","title":"The impact of visual contextualization on UI localization","filename":"CHI14/p3739","authors":["Luis A. Leiva","Vicent Alabau"],"conference":"CHI '14"}