{"paperId":2556321,"abstract":"Group-signature schemes allow members within a predefined group to prove specific properties without revealing more information than necessary. Potential areas of application include electronic IDs (eIDs) and smartcards, i.e., resource-constrained environments. Though literature provides many theoretical proposals for group-signature schemes, practical evaluations regarding the applicability of such mechanisms in resource-constrained environments are missing. In this work, we investigate four different group-signature schemes in terms of mathematical operations, signature length, and the proposed revocation mechanisms. We also use the RELIC toolkit to implement the two most promising of the investigated group-signature schemes---one of which is going to be standardized in ISO/IEC 20008---for the AVR microcontroller. This allows us to give practical insights into the applicability of pairings on the AVR microcontroller in general and the applicability of group-signature schemes in particular on the very same. Contrary to the general recommendation of precomputing and storing pairing evaluations if possible, we observed that the evaluation of pairings might be faster than computations on cached pairings.","citation":[{"content":"Andreu Pere Isern-Deyà , Llorenç Huguet-Rotger , M. Magdalena Payeras-Capellà , Macià Mut-Puigserver, On the practicability of using group signatures on mobile devices: implementation and performance analysis on the android platform, International Journal of Information Security, v.14 n.4, p.335-345, August    2015","paperID":"2807787"}],"reference":[{"content":"Simulavr: an AVR simulator. http://savannah.nongnu.org/projects/simulavr.","paperID":"None"},{"content":"D. F. Aranha and C. P. L. Gouvêa. RELIC is an Efficient LIbrary for Cryptography. http://code.google.com/p/relic-toolkit/.","paperID":"None"},{"content":"D. Boneh and X. Boyen. Short Signatures Without Random Oracles. In EUROCRYPT 2004, volume 3027, pages 56--73. Springer Berlin Heidelberg, 2004.","paperID":"None"},{"content":"D. Boneh, X. Boyen, and H. Shacham. Short Group Signatures. In CRYPTO 2004, volume 3152 of LNCS, pages 41--55. Springer Berlin Heidelberg, 2004.","paperID":"None"},{"content":"Dan Boneh , Matthew K. Franklin, Identity-Based Encryption from the Weil Pairing, Proceedings of the 21st Annual International Cryptology Conference on Advances in Cryptology, p.213-229, August 19-23, 2001","paperID":"704155"},{"content":"Dan Boneh , Hovav Shacham, Group signatures with verifier-local revocation, Proceedings of the 11th ACM conference on Computer and communications security, October 25-29, 2004, Washington DC, USA","paperID":"1030106"},{"content":"Sébastien Canard , Iwen Coisel , Giacomo De Meulenaer , Olivier Pereira, Group signatures are suitable for constrained devices, Proceedings of the 13th international conference on Information security and cryptology, December 01-03, 2010, Seoul, Korea","paperID":"2041047"},{"content":"Sanjit Chatterjee , Darrel Hankerson , Alfred Menezes, On the efficiency and security of pairing-based protocols in the type 1 and type 4 settings, Proceedings of the Third international conference on Arithmetic of finite fields, June 27-30, 2010, Istanbul, Turkey","paperID":"1893746"},{"content":"David Chaum , Eugène Van Heyst, Group signatures, Proceedings of the 10th annual international conference on Theory and application of cryptographic techniques, April 08-11, 1991, Brighton, UK","paperID":"1754897"},{"content":"L. Chen and T. Pedersen. New group signature schemes. In EUROCRYPT '94, volume 950 of LNCS, pages 171--181. Springer Berlin Heidelberg, 1995.","paperID":"None"},{"content":"Cécile Delerablée , David Pointcheval, Dynamic fully anonymous short group signatures, Proceedings of the First international conference on Cryptology in Vietnam, September 25-28, 2006, Hanoi, Vietnam","paperID":"2081949"},{"content":"Steven D. Galbraith , Kenneth G. Paterson , Nigel P. Smart, Pairings for cryptographers, Discrete Applied Mathematics, v.156 n.16, p.3113-3121, September, 2008","paperID":"1450543"},{"content":"F. Göloğlu, R. Granger, G. McGuire, and J. Zumbrägel. On the Function Field Sieve and the Impact of Higher Splitting Probabilities: Application to Discrete Logarithms in F<sub>2<sup>1971</sup></sub> and F<sub>2<sup>3164</sup></sub>. Cryptology ePrint Archive, Report 2013/074, 2013. http://eprint.iacr.org/.","paperID":"None"},{"content":"C. Gouvêa, L. Oliveira, and J. López. Efficient Software Implementation of Public-Key Cryptography on Sensor Networks Using the MSP430X Microcontroller. Journal of Cryptographic Engineering, 2(1):19--29, 2012.","paperID":"None"},{"content":"Jung Yeon Hwang , Sokjoon Lee , Byung-Ho Chung , Hyun Sook Cho , DaeHun Nyang, Short Group Signatures with Controllable Linkability, Proceedings of the 2011 Workshop on Lightweight Security & Privacy: Devices, Protocols, and Applications, p.44-52, March 14-15, 2011","paperID":"1977818"},{"content":"Internationl Organization for Standardization (ISO). ISO/IEC 20008-2: Information technology - Security techniques - Anonymous digital signatures - Part 2: Mechanisms using a group public key, November 2012.","paperID":"None"},{"content":"A. Joux. A new index calculus algorithm with complexity L(1/4 + o(1)) in very small characteristic. Cryptology ePrint Archive, Report 2013/095, 2013. http://eprint.iacr.org/.","paperID":"None"},{"content":"S. Meiklejohn. An Exploration of Group and Ring Signatures. Available online at http://cseweb.ucsd.edu/~smeiklejohn/, February 2011.","paperID":"None"},{"content":"Leonardo B. Oliveira , Diego F. Aranha , Conrado P. L. Gouvêa , Michael Scott , Danilo F. Címara , Julio López , Ricardo Dahab, TinyPBC: Pairings for authenticated identity-based non-interactive key distribution in sensor networks, Computer Communications, v.34 n.3, p.485-493, March, 2011","paperID":"1931219"},{"content":"R. Sakai, K. Ohgishi, and M. Kasahara. Cryptosystems based on pairing. 2000.","paperID":"None"},{"content":"Michael Scott, On the efficient implementation of pairing-based protocols, Proceedings of the 13th IMA international conference on Cryptography and Coding, December 12-15, 2011, Oxford, UK","paperID":"2188729"},{"content":"N. Smart. Discrete Logarithms. http://bristolcrypto.blogspot.co.uk/2013/02/discrete-logarithms.html.","paperID":"None"},{"content":"Piotr Szczechowiak , Anton Kargl , Michael Scott , Martin Collier, On the application of pairing based cryptography to wireless sensor networks, Proceedings of the second ACM conference on Wireless network security, March 16-19, 2009, Zurich, Switzerland","paperID":"1514276"}],"title":"Group-signature schemes on constrained devices: the gap between theory and practice","filename":"CS214/2556321","authors":["Raphael Spreitzer","Jörn-Marc Schmidt"],"conference":"CS2 '14"}