{"paperId":2556355,"reference":[],"citation":[],"abstract":"This book provides an extensive review of three interrelated issues: land fragmentation, land consolidation, and land reallocation, and it presents in detail the theoretical background, design, development and application of a prototype integrated planning and decision support system for land consolidation. The system integrates geographic information systems (GIS) and artificial intelligence techniques including expert systems (ES) and genetic algorithms (GAs) with multi-criteria decision methods (MCDM), both multi-attribute (MADM) and multi-objective (MODM). The system is based on four modules for measuring land fragmentation; automatically generating alternative land redistribution plans; evaluating those plans; and automatically designing the land partitioning plan. The presented research provides a new scientific framework for land-consolidation planning both in terms of theory and practice, by presenting new findings and by developing better tools and methods embedded in an integrated GIS environment. It also makes a valuable contribution to the fields of GIS and spatial planning, as it provides new methods and ideas that could be applied to improve the former for the benefit of the latter in the context of planning support systems. From the 1960s, ambitious research activities set out to observe regarding IT-support of the complex and time consuming redistribution processes within land consolidation without any practically relevant results, until now. This scientific work is likely to close that gap. This distinguished publication is highly recommended to land consolidation planning experts, researchers and academics alike. Prof. Dr.-Ing. Joachim Thomas, Mnster/ Germany\"Planning support systems take new scientific tools based on GIS, optimisation and simulation and use these to inform the process of plan-making and policy. This book is one of the first to show how this can be consistently done and it is a triumph of demonstrating how such systems can be made operational. Essential reading for planners, analysts and GI scientists.\" Prof. Michael Batty, University College London","title":"The Development of an Integrated Planning and Decision Support System (IPDSS) for Land Consolidation","authors":""}