{"paperId":2557145,"reference":[{"content":"Abroms, L., Padmanabhan, N., Thaweethai, L., Phillips, T. iPhone Apps for Smoking Cessation: A Content Analysis. American Journal of Preventive Medicine (2011), 279--285.","paperID":"None"},{"content":"Alderman, M. Goals and goal setting. Motivation for achievement (1999), 88--111.","paperID":"None"},{"content":"American Cancer Society. Cancer Facts and Figures. (2012).","paperID":"None"},{"content":"Aveyard, P., Massey, L., Parsons, A., Manaseki, S., Griffin, C. The effect of Transtheoretical Model based interventions on smoking cessation. Social Science & Medicine 68, 3 (2009), 397--403.","paperID":"None"},{"content":"Bahr, D. B., Browning, R. C., Wyatt, H. R., & Hill, J. O. Exploiting social networks to mitigate the obesity epidemic. Obesity 17, 4 (2009), 723--728.","paperID":"None"},{"content":"Bandura, A. Self-efficacy: The exercise of control.(1997).","paperID":"None"},{"content":"Bandura, A. & Locke, E. A. Negative self-efficacy and goal effects revisited. Applied psychology 88, 1 (2003), 87.","paperID":"None"},{"content":"Borland, R., Partos, T., Yong, H., Cummings, K., Hyland, A. How much unsuccessful quitting activity is going on among adult smokers' Addiction 107 (2012), 673--682.","paperID":"None"},{"content":"Bradley, M. M. & Lang, P. J. Affective norms for English words (ANEW). Technical Report C-1 (1999).","paperID":"None"},{"content":"Campbell, R. S. & Pennebaker, J. W. The secret life of pronouns: flexibility in writing style and physical health. Psychological Science 14, 1 (2003), 60--65.","paperID":"None"},{"content":"Centers for Disease Control. Current Cigarette Smoking Among Adults - USA. (2011).","paperID":"None"},{"content":"Chase, C. Public Policy Statement on Nicotine Dependence and Tobacco. American Society of Addiction Medicine (2010).","paperID":"None"},{"content":"Munmun De Choudhury , Scott Counts , Eric Horvitz, Major life changes and behavioral markers in social media: case of childbirth, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441937"},{"content":"DiClemente, C. C., Fairhurst, S. K., & Piotrowski, N. A. Self-efficacy and addictive behaviors. (1995), 109--141.","paperID":"None"},{"content":"DiClemente, C. C., Prochaska, J. O., Fairhurst, S. K., Velicer, W. F., Velasquez, M., & Rossi, J. The process of smoking cessation: an analysis of precontemplation, contemplation, and preparation stages of change. Journal of consulting and clinical psychology 59,2 (1991), 295.","paperID":"None"},{"content":"Fiore, M. Treating tobacco use and dependence: Clinical practice guideline. (2008).","paperID":"None"},{"content":"Fowler, J. H. & Christakis, N. A. Dynamic spread of happiness in a large social network. BMJ: British medical journal 337 (2008).","paperID":"None"},{"content":"Gulliver, S. B., Hughes, J. R., Solomon, L. J., & Dey, A. N. An investigation of self-efficacy, partner support and daily stresses as predictors of relapse to smoking in self quitters. Addiction 90,6 (1995), 767--772.","paperID":"None"},{"content":"Heatherton, T., Kozlowski, L., Frecker, R., Fagerstrom, K. The Fagerstrom test for nicotine dependence. British journal of addiction 86,9 (1991), 1119--1127.","paperID":"None"},{"content":"Howard, K. I., Kopta, S. M., Krause, M. S., & Orlinsky, D. E. The dose-effect relationship in psychotherapy. American Psychologist 41, 2 (1986), 159.","paperID":"None"},{"content":"Hughes, J., Stead, L., Lancaster, T. Antidepressants for smoking cessation. Cochrane Database Syst Rev 1.1 (2007).","paperID":"None"},{"content":"Hunt, W. A. & Matarazzo, J. D. Habit mechanisms in smoking. Learning mechanisms in smoking (1970), 65--90.","paperID":"None"},{"content":"C.J. Hutto , Sarita Yardi , Eric Gilbert, A longitudinal study of follow predictors on twitter, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470771"},{"content":"Sue Jamison-Powell , Conor Linehan , Laura Daley , Andrew Garbett , Shaun Lawson, \"I can't get no sleep\": discussing #insomnia on twitter, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208612"},{"content":"Kouloumpis, E., Wilson, T., Moore, J. Twitter sentiment analysis:The Good the Bad and the OMG! In ICWSM (2011).","paperID":"None"},{"content":"Lemmens, V., Oenema, A., Knut, I. K., & Brug, J. Effectiveness of smoking cessation interventions among adults: a systematic review of reviews. EJCP (2008).","paperID":"None"},{"content":"Locke, E. A. & Latham, G. P. Building a practically useful theory of goal setting and task motivation: A 35-year odyssey. American psychologist 57, 9 (2002), 705.","paperID":"None"},{"content":"Locke, E. A., Shaw, K. N., Saari, L. M., & Latham, G. P. Goal setting and task performance: 1969--1980. Psychological bulletin 90, 1 (1981), 125.","paperID":"None"},{"content":"Manchón Walsh, P., Carrillo, P., Flores, G., Masuet, C., Morchon, S., Ramon, J. Effects of partner smoking status & gender on long term abstinence rates of patients receiving smoking cessation treatment. Addictive behaviors (2007).","paperID":"None"},{"content":"Oettingen, G., Pak, H., Schnetter, K. Self-regulation of goal-setting. Personality & social psych. 80, 5 (2001), 736.","paperID":"None"},{"content":"Pennebaker, J. W., Chung, C. K., Ireland, M., Gonzales, A., & Booth, R. J. The development and psychometric properties of LIWC2007. (2007).","paperID":"None"},{"content":"Pennebaker, J. W., Francis, M. E., & Booth, R. J. Linguistic inquiry and word count: LIWC 2001. (2001), 71.","paperID":"None"},{"content":"Prochaska, J. J., Pechmann, C., Kim, R., & Leonhardt, J. M. Twitter-quitter? An analysis of Twitter quit smoking social networks. Tobacco control 21,4 (2012), 447--449.","paperID":"None"},{"content":"Prochaska, J. O., DiClemente, C. C., & Norcross, J. C. In search of how people change: Applications to addictive behaviors. Journal of Addictions Nursing 5, 1 (1993), 2--16.","paperID":"None"},{"content":"Prochaska, J. O. & Velicer, W. F. The transtheoretical model of health behavior change. American journal of health promotion 12, 1 (1997), 38--48.","paperID":"None"},{"content":"Prochaska, J. O., Velicer, W. F., DiClemente, C. C., & Fava, J. Measuring processes of change: applications to the cessation of smoking. Journal of consulting and clinical psychology 56, 4 (1988), 520.","paperID":"None"},{"content":"Redding, C. A., Prochaska, J. O., Paiva, A., Rossi, J. S., Velicer, W., Blissmer, B. J., Greene, G. W., Robbins, M. L., & Sun, X. Baseline stage, severity, and effort effects differentiate stable smokers from maintainers and relapsers. Substance use & misuse 46, 13 (2011), 1664--1674.","paperID":"None"},{"content":"Robinson, L. M. & Vail, S. R. An Integrative Review of Adolescent Smoking Cessation Using the Transtheoretical Model of Change. Journal of Pediatric Health Care 26, 5 (2012), 336--345.","paperID":"None"},{"content":"Rude, S., Gortner, E.-M., & Pennebaker, J. Language use of depressed and depression-vulnerable college students. Cognition & Emotion 18, 8 (2004), 1121--1133.","paperID":"None"},{"content":"Teodoro, R. & Naaman, M. Fitter with Twitter: Understanding Personal Health and Fitness Activity in Social Media. In ICWSM (2013).","paperID":"None"},{"content":"Velicer, W. F., Redding, C. A., Sun, X., & Prochaska, J. O. Demographic variables, smoking variables, and outcome across five studies. Health Psychology 26, 3 (2007), 278.","paperID":"None"}],"citation":[{"content":"Greg Wadley , Wally Smith , Bernd Ploderer , Jon Pearce , Sarah Webber , Mark Whooley , Ron Borland, What people talk about when they talk about quitting, Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design, December 02-05, 2014, Sydney, New South Wales, Australia","paperID":"2686671"},{"content":"Elizabeth L. Murnane, Exploring a theory-guided path to the design of personal informatics and intervention technologies, Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers, September 07-11, 2015, Osaka, Japan","paperID":"2801646"},{"content":"Yeoreum Lee , Youn-kyung Lim, Understanding the Roles and Influences of Mediators from Multiple Social Channels for Health Behavior Change, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2685032"},{"content":"Virgile Landeiro Dos Reis , Aron Culotta, Using matched samples to estimate the effects of exercise on mental health from twitter, Proceedings of the Twenty-Ninth AAAI Conference on Artificial Intelligence, p.182-188, January 25-30, 2015, Austin, Texas","paperID":"2887033"},{"content":"Munmun De Choudhury, Anorexia on Tumblr: A Characterization Study, Proceedings of the 5th International Conference on Digital Health 2015, May 18-20, 2015, Florence, Italy","paperID":"2750515"},{"content":"Narendran Thangarajan , Nella Green , Amarnath Gupta , Susan Little , Nadir Weibel, Analyzing social media to characterize local HIV at-risk populations, Proceedings of the conference on Wireless Health, p.1-8, October 14-16, 2015, Bethesda, Maryland","paperID":"2811923"},{"content":"Javid Ebrahimi , NhatHai Phan , Dejing Dou , Brigitte Piniewski , David Kil, Characterizing Physical Activity in a Health Social Network, Proceedings of the 6th International Conference on Digital Health Conference, April 11-13, 2016, Montréal, Québec, Canada","paperID":"2896349"},{"content":"Jeni Paay , Jesper Kjeldskov , Mikael B. Skov , Lars Lichon , Stephan Rasmussen, Understanding Individual Differences for Tailored Smoking Cessation Apps, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702321"},{"content":"Munmun De Choudhury , Sanket Sharma , Emre Kiciman, Characterizing Dietary Choices, Nutrition, and Language in Food Deserts via Social Media, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819956"},{"content":"Acar Tamersoy , Munmun De Choudhury , Duen Horng Chau, Characterizing Smoking and Drinking Abstinence from Social Media, Proceedings of the 26th ACM Conference on Hypertext & Social Media, September 01-04, 2015, Guzelyurt, Northern Cyprus","paperID":"2791247"},{"content":"Mrinal Kumar , Mark Dredze , Glen Coppersmith , Munmun De Choudhury, Detecting Changes in Suicide Content Manifested in Social Media Following Celebrity Suicides, Proceedings of the 26th ACM Conference on Hypertext & Social Media, September 01-04, 2015, Guzelyurt, Northern Cyprus","paperID":"2791026"},{"content":"Elizabeth L. Murnane , Saeed Abdullah , Mark Matthews , Tanzeem Choudhury , Geri Gay, Social (media) jet lag: how usage of social technology can modulate and reflect circadian rhythms, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2807522"},{"content":"Diana MacLean , Sonal Gupta , Anna Lembke , Christopher Manning , Jeffrey Heer, Forum77: An Analysis of an Online Health Forum Dedicated to Addiction Recovery, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675146"},{"content":"Stevie Chancellor , Zhiyuan Lin , Erica L. Goodman , Stephanie Zerwas , Munmun De Choudhury, Quantifying and Predicting Mental Illness Severity in Online Pro-Eating Disorder Communities, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819973"},{"content":"Bernd Ploderer , Wolfgang Reitberger , Harri Oinas-Kukkonen , Julia Gemert-Pijnen, Social interaction and reflection for behaviour change, Personal and Ubiquitous Computing, v.18 n.7, p.1667-1676, October   2014","paperID":"2674122"}],"abstract":"Analysis of smokers' posts and behaviors on Twitter reveals factors impacting abstinence and relapse during cessation attempts. Combining automatic and crowdsourced techniques, we detect users trying to quit smoking and analyze tweet and network data from a sample of 653 individuals over a two-year window of quitting. Guided by theory and practice, we derive behavioral, social, and emotional measures to compare users who abstain and relapse. We also examine the cessation process, demonstrating that Twitter can help chronicle how some people go about quitting. Among other results, we show that those who fail in their smoking cessation are far heavier posters and use relatively less positive language, while those who succeed are more social in both network ties and in directed communication. We conclude with insights on how intelligent intervention systems can harness these signals to provide tailored behavior change support.","video":"http://www.youtube.com/embed/SRmObsTIq4Q?rel=0","title":"Unraveling abstinence and relapse: smoking cessation reflected in social media","filename":"CHI14/p1345","authors":["Elizabeth L. Murnane","Scott Counts"],"conference":"CHI '14"}