{"paperId":2557386,"citation":[{"content":"Andrew D. Miller , Sonali R. Mishra , Logan Kendall , Shefali Haldar , Ari H. Pollack , Wanda Pratt, Partners in Care: Design Considerations for Caregivers and Patients During a Hospital Stay, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819983"}],"reference":[{"content":"Barak, A., Hen, L., Boniel-Nissim, M., & Shapira, N. A. (2008). A comprehensive review and a meta-analysis of the effectiveness of internet-based psychotherapeutic interventions. JTHS, 26(2-4), 109--160.","paperID":"None"},{"content":"D'Alessandro, D. M., & Dosa, N. P. (2001). Empowering children and families with information technology. JAMA Pediatrics, 155(10), 1131.","paperID":"None"},{"content":"Munmun De Choudhury , Scott Counts , Eric Horvitz, Predicting postpartum changes in emotion and behavior via social media, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466447"},{"content":"Duby, J. C., et al. (2006). Identifying infants and young children with developmental disorders in the medical home: An algorithm for developmental surveillance and screening. Pediatrics, 118(1), 405--420.","paperID":"None"},{"content":"Harriet Fell , Cynthia Cress , Joel MacAuslan , Linda Ferrier, visiBabble for reinforcement of early vocalization, Proceedings of the 6th international ACM SIGACCESS conference on Computers and accessibility, October 18-20, 2004, Atlanta, GA, USA","paperID":"1028659"},{"content":"Foucault, B. E. Designing Technology for Growing Families. Technology@Intel Magazine. 2005.","paperID":"None"},{"content":"Guralnick, M. J., & Bricker, D. (1987). The effectiveness of early intervention for children with cognitive and general developmental delays. Academic Press.","paperID":"None"},{"content":"Hoefman, B., & Apunyu, B. (2010). Using SMS for HIV/AIDS education and to expand the use of HIV testing and counseling services at the AIDS Information Centre (AIC) Uganda. M4D 2010.","paperID":"None"},{"content":"Hee Young Jeong , Sun Young Park , John Zimmerman, Opportunities to support parents in managing their children's health, CHI '08 Extended Abstracts on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1358835"},{"content":"Jordan, E. T., et al. (2011). Text4Baby. Nursing for Women's Health, 15(3), 206--212.","paperID":"None"},{"content":"Julie A. Kientz , Rosa I. Arriaga , Gregory D. Abowd, Baby steps: evaluation of a system to support record-keeping for parents of young children, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518965"},{"content":"Julie A. Kientz , Rosa I. Arriaga , Marshini Chetty , Gillian R. Hayes , Jahmeilah Richardson , Shwetak N. Patel , Gregory D. Abowd, Grow and know: understanding record-keeping needs for tracking the development of young children, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240830"},{"content":"Predrag Klasnja , Sunny Consolvo , Wanda Pratt, How to evaluate technologies for health behavior change in HCI research, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979396"},{"content":"Haewoon Kwak , Hyunwoo Chun , Sue Moon, Fragile online relationship: a first look at unfollow dynamics in twitter, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979104"},{"content":"LENA. Retrieved Sept. 18, 2013 from http://www.lenababy.com","paperID":"None"},{"content":"Meredith Ringel Morris, Social networking site use by mothers of young children, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531603"},{"content":"Sean A. Munson , Debra Lauterbach , Mark W. Newman , Paul Resnick, Happier together: integrating a wellness application into a social network site, Proceedings of the 5th international conference on Persuasive Technology, p.27-39, June 07-10, 2010, Copenhagen, Denmark","paperID":"2164022"},{"content":"Park, S., Jeong, H., & Zimmerman, J. (2008). ENSURE: Support for Parents in Managing their Children's Health. Design and Emotion.","paperID":"None"},{"content":"Squires, J., & Bricker, D. (2009). Ages & Stages Questionnaires®. Baltimore, Maryland, 257--182.","paperID":"None"},{"content":"Kate Starbird , Leysia Palen, \"Voluntweeters\": self-organizing by digital volunteers in times of crisis, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979102"},{"content":"Tang, K. P., et al. (2012). Designing a mobile health tool for preterm infant wellness. Pervasive Health 2012, pp. 232--235.","paperID":"None"},{"content":"Trixie Tracker Software. Retrieved Sept. 18, 2013 from http://www.trixietracker.com","paperID":"None"},{"content":"Victoria Udoh. Nigeria: MTN to Broadcast Anti-Aids Messages. (September 2003). Retrieved Sept. 18, 2013 from http://allafrica.com/stories/200309260162.html","paperID":"None"},{"content":"Tracy L. Westeyn , Gregory D. Abowd , Thad E. Starner , Jeremy M. Johnson , Peter W. Presti , Kimberly A. Weaver, Monitoring children's developmental progress using augmented toys and activity recognition, Personal and Ubiquitous Computing, v.16 n.2, p.169-191, February  2012","paperID":"2125155"},{"content":"Woolford, S. J., et al. (2010). Tailored mobile phone text messages as an adjunct to obesity treatment for adolescents. JTT, 16(8), 458--461.","paperID":"None"}],"abstract":"The tracking of developmental milestones in young children is an important public health goal for ensuring early detection and treatment for developmental delay. While numerous paper-based and web-based solutions are available for tracking milestones, many busy parents often forget to enter information on a regular basis. To help address this need, we have developed an interactive system called @BabySteps for allowing parents who use Twitter to track and respond to tweets about developmental milestones using a special hashtag syntax. Parent responses are parsed automatically and written into a central database that can be accessed via the web. We deployed @BabySteps with 14 parents over a 3-week period and found that parents were able to learn how to use the system to track their children's progress, with some using it to communicate with other parents. The study helped to identify a number of ways to improve the approach, including simplifying the hashtag syntax, allowing for private responses via direct messaging, and improving the social component. We provide a discussion of lessons learned and suggestions for the design of interactive public health systems.","video":"http://www.youtube.com/embed/2XUoqqVrXz8?rel=0","title":"@BabySteps: design and evaluation of a system for using twitter for tracking children's developmental milestones","filename":"CHI14/p2279","authors":["Hyewon Suh","John R. Porter","Alexis Hiniker","Julie A. Kientz"],"conference":"CHI '14"}