{"paperId":2557192,"citation":[{"content":"Yitong Huang , Anya Skatova , Benjamin Bedwell , Tom Rodden , Victoria Shipp , Emma Bertenshaw, Designing for Human Sustainability: The Role of Self-Reflection, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, August 24-27, 2015, Copenhagen, Denmark","paperID":"2794323"},{"content":"Kathy Baxter , Catherine Courage , Kelly Caine, Understanding Your Users: A Practical Guide to User Research Methods, Morgan Kaufmann Publishers Inc., San Francisco, CA, 2015","paperID":"2843504"}],"reference":[{"content":"Joshua E. Blumenstock, Size matters: word count as a measure of quality on wikipedia, Proceedings of the 17th international conference on World Wide Web, April 21-25, 2008, Beijing, China","paperID":"1367673"},{"content":"Scott Carter , Jennifer Mankoff, When participants do the capturing: the role of media in diary studies, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 02-07, 2005, Portland, Oregon, USA","paperID":"1055098"},{"content":"Collier, J. Photography in anthropology: a report on two experiments. American Anthropologist 59, 5 (1957), 843--859.","paperID":"None"},{"content":"Sunny Consolvo , Miriam Walker, Using the Experience Sampling Method to Evaluate Ubicomp Applications, IEEE Pervasive Computing, v.2 n.2, p.24-31, April 2003","paperID":"858836"},{"content":"Csikszentmihalyi, M., Larson, R., and Prescott, S. The ecology of adolescent activity and experience. Journal of Youth and Adolescence 6, 3 (1977), 281--294.","paperID":"None"},{"content":"Fanning, S. Visual Methodologies: PhotoElicitation in the University Classroom. The Proceedings of the 10th European Conference on Research Methodology for Business and Management Studies, (2011).","paperID":"None"},{"content":"Joel E. Fischer , Steve Benford, Inferring player engagement in a pervasive experience, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518993"},{"content":"Gabridge, T., Gaskell, M., and Stout, A. Information seeking through students' eyes : The MIT photo diary study. College & Research Libraries 69, 6 (2006), 510--523.","paperID":"None"},{"content":"Grady, J. Working with visual evidence: an invitation and some practical advice. In Picturing the social landscape: visual methods and the sociological imagination. Routledge, London, 2004, 18--32.","paperID":"None"},{"content":"Hargittai, E. and Walejko, G. The Participation Divide: Content creation and sharing in the digital age. Information, Communication & Society 11, 2 (2008), 239--256.","paperID":"None"},{"content":"Eszter Hargittai, Beyond logs and surveys: in-depth measures of people's web use skills, Journal of the American Society for Information Science and Technology, v.53 n.14, p.1239-1244, December 2002","paperID":"638673"},{"content":"Harper, D. Meaning and work: A study in photo elicitation. Current Sociology 34, 3 (1986), 24--46.","paperID":"None"},{"content":"Husserl, E. Logical Investigations, volume 1. Routledge, New York, 2001.","paperID":"None"},{"content":"Stephen Intille , Charles Kukla , Xiaoyi Ma, Eliciting user preferences using image-based experience sampling and reflection, CHI '02 Extended Abstracts on Human Factors in Computing Systems, April 20-25, 2002, Minneapolis, Minnesota, USA","paperID":"506573"},{"content":"Mikkel Rønne Jakobsen , Kasper Hornbæk, Fisheyes in the field: using method triangulation to study the adoption and use of a source code visualization, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518943"},{"content":"James, W. The Principles of Psychology, 2 vols. Henry, New York, 1890.","paperID":"None"},{"content":"Bernard J. Jansen , Amanda Spink, How are we searching the World Wide Web? A comparison of nine search engine transaction logs, Information Processing and Management: an International Journal, v.42 n.1, p.248-263, January 2006","paperID":"1710819"},{"content":"Landis, J.R. and Koch, G.G. The measurement of observer agreement for categorical data. biometrics, (1977), 159--174.","paperID":"None"},{"content":"Matthew L. Lee , Anind K. Dey, Using lifelogging to support recollection for people with episodic memory impairment and their caregivers, Proceedings of the 2nd International Workshop on Systems and Networking Support for Health Care and Assisted Living Environments, June 17-17, 2008, Breckenridge, Colorado","paperID":"1515765"},{"content":"Litt, E. Measuring users' internet skills: A review of past assessments and a look toward the future. New Media & Society 15, 4 (2013), 612--630.","paperID":"None"},{"content":"Madden, M. Online photo services. 2005. http://www.pewinternet.org/Commentary/2005/Dec ember/Online-Photo-Services.aspx.","paperID":"None"},{"content":"Alexander Meschtscherjakov , Wolfgang Reitberger , Manfred Tscheligi, MAESTRO: orchestrating user behavior driven and context triggered experience sampling, Proceedings of the 7th International Conference on Methods and Techniques in Behavioral Research, p.1-4, August 24-27, 2010, Eindhoven, The Netherlands","paperID":"1931373"},{"content":"Andrew D. Miller , W. Keith Edwards, Give and take: a study of consumer photo-sharing culture and practice, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240682"},{"content":"Noland, C.M. Auto-Photography as Research Practice : Identity and Self-Esteem Research. Jounal of Research Practice 2, 1 (2006), 1--19.","paperID":"None"},{"content":"Pew Research Center's Internet & American Life Project. SNS and Facebook survey 2010. Washington D.C., 2010.","paperID":"None"},{"content":"Rainie, L., Brenner, J., and Purcell, K. Photos and videos as social currency online. 2013.","paperID":"None"},{"content":"Retrospective Cued Recall: A Method for Accurately Recalling Previous User Behaviors, Proceedings of the 42nd Hawaii International Conference on System Sciences, p.1-9, January 05-08, 2009","paperID":"1489802"},{"content":"Scollon, C.N. and Kim-Prieto, C. Experience Sampling: Promises and Pitfalls, Strengths and Weaknesses. Journal of Happiness Studies 4, 1 (2003), 5--34.","paperID":"None"},{"content":"Shiffman, S., Stone, A.A., and Hufford, M.R. Ecological Momentary Assessment. Annual Review of Clinical Psychology 4, 1 (2008), 1--32.","paperID":"None"},{"content":"Timothy Sohn , Kevin A. Li , William G. Griswold , James D. Hollan, A diary study of mobile information needs, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357125"},{"content":"Stawarczyk, D., Majerus, S., Michalina Maj, M.V. der L., and D'Argembeau, A. Mind-wandering: phenomenology and function as assessed with a novel experience sampling method. Acta Psychologica, (2011), 370--381.","paperID":"None"},{"content":"Stefanone, M.A. and Lackaff, D. Reality television as a model for online behavior: Blogging, photo, and video sharing. Journal of Computer-Mediated Communication 14, 4 (2009), 964--987.","paperID":"None"},{"content":"Tagg, J. The Burden of Representation: Essays on Photographies and Histories. The University of Massachusetts Press, Boston, MA, 1988.","paperID":"None"},{"content":"Thelwall, M. Privacy and gender in the social web. In S. Trepte and L. Reinecke, eds., Privacy Online. Springer, Berlin, Heidelberg, 2011, 251--265.","paperID":"None"}],"abstract":"The Experience Sampling Method (ESM) enables researchers to capture information about participants' experiences in the moment. Adding an end-of-day retrospective survey also allows participants to elaborate on those experiences. Although the use of photos in retrospective interviews and surveys for memory elicitation is well known, little research has investigated the use of photos in ESM studies. As smartphone adoption increases facilitating ESM studies and making photo sharing easier, researchers need to continuously evaluate the method and investigate the role of photos in such studies. We conducted a large-scale ESM and retrospective survey study via Android smartphones with more than 1,000 US participants, and analyzed participants' photo submissions, including how photo use correlated with participants' data quality and what, if any, value photos added for researchers. Our study sheds light on the role of photos in ESM and retrospective studies that researchers can reference when constructing future study designs.","video":"http://www.youtube.com/embed/fAjpEHOzqPI?rel=0","title":"Photographing information needs: the role of photos in experience sampling method-style research","filename":"CHI14/p1545","authors":["Zhen Yue","Eden Litt","Carrie J. Cai","Jeff Stern","Kathy K. Baxter","Zhiwei Guan","Nikhil Sharma","Guangqiang (George) Zhang"],"conference":"CHI '14"}