{"paperId":2557381,"abstract":"Constant connectivity and total availability to clients is the rule rather than the exception in many contemporary workplaces. Enabled by developments in information and communication technologies (ICTs), total availability of employees is possible and presumed. Scholars have explored how new technological affordances, cultural shifts, individual personality traits, and/or the development of social expectations that reinforce norms of constant connectivity have led to this state of affairs. We argue that a key factor has been overlooked in current scholarship about stress, intensive work, and constant connectivity. That is, current economic conditions are creating a marketplace in which firms increasing sell the availability of their employees as part of the services offered by the firm. In this paper we use qualitative data to illustrate how total availability is an integral aspect of the 'product' offered by professional service firms and is becoming increasingly prevalent in other service industries. We conclude with a discussion of how the HCI community might address this situation as a design challenge. Drawing on the work of Goffman and Perlow, we suggest that designers attend to the ways in which organizations might maintain front stage impressions of total availability while collectively managing individual time to restrict total availability behind the scenes.","citation":[{"content":"Marta E. Cecchinato , Anna L. Cox , Jon Bird, Working 9-5?: Professional Differences in Email and Boundary Management Practices, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702537"},{"content":"Tawfiq Ammari , Priya Kumar , Cliff Lampe , Sarita Schoenebeck, Managing Children's Online Identities: How Parents Decide what to Disclose about their Children Online, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702325"},{"content":"Siân E. Lindley, Making Time, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675157"},{"content":"Nan-Chen Chen , Sarah Poon , Lavanya Ramakrishnan , Cecilia R. Aragon, Considering Time in Designing Large-Scale Systems for Scientific Computing, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819988"},{"content":"Lindsay Blackwell , Emma Gardiner , Sarita Schoenebeck, Managing Expectations: Technology Tensions among Parents and Teens, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819928"},{"content":"Melissa Mazmanian , Ingrid Erickson , Ellie Harmon, Circumscribed Time and Porous Time: Logics as a Way of Studying Temporality, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675231"},{"content":"Ingrid Erickson , Mohammad Hossein Jarrahi, Infrastructuring and the Challenge of Dynamic Seams in Mobile Knowledge Work, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820015"}],"reference":[{"content":"Agger, B. iTime: Labor and life in a smartphone era. Time and Society, 20 (1). 119--136.","paperID":"None"},{"content":"Morgan G. Ames, Managing mobile multitasking: the culture of iPhones on stanford campus, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441945"},{"content":"Barker, J. R. Tightening the Iron Cage: Concertive Control in Self-Managing Teams. Administrative Science Quarterly, 38. 408--437.","paperID":"None"},{"content":"Barley, S. R. and Kunda, G. Gurus, Hired Guns, and Warm Bodies: Itinerant experts in a knowledge economy. Princeton University Press, Princeton, NJ, 2004.","paperID":"None"},{"content":"Stephen R. Barley , Debra E. Meyerson , Stine Grodal, E-mail as a Source and Symbol of Stress, Organization Science, v.22 n.4, p.887-906, July 2011","paperID":"2019295"},{"content":"Bass, B. L., Butler, A. B., Grzywacz, J. G. and Linney, K. D. Do Job Demands Undermine Parenting? A Daily Analysis of Spillover and Crossover Effects. Family Relations, 58. 201--215.","paperID":"None"},{"content":"Manuel Castells, Rise of the Network Society, Blackwell Publishers, Inc., Cambridge, MA, 1996","paperID":"524435"},{"content":"Charmaz, K. Constructing Grounded Theory: A Practical Guide Through Qualitative Analysis. Sage, London, 2006.","paperID":"None"},{"content":"Chesley, N. Blurring Boundaries' Linking Technology Use, Spillover, Individual Distress, and Family Satisfaction. Journal of Marriage and Family, 67. 1237--1248.","paperID":"None"},{"content":"Ciulla, J. B. The Working Life: The promise and betrayal of modern work. Three Rivers Press, Random House, NY, NY, 2000.","paperID":"None"},{"content":"Coser, L. A. Greedy institutions; patterns of undivided commitment. Free Press, 1974.","paperID":"None"},{"content":"Cotte, J. and Ratneshwar, S. Juggling and hopping: what does it mean to work polychronically? Journal of Managerial Psychology, 14 (3/4). 184--205.","paperID":"None"},{"content":"Dembe, A. E. Ethical Issues Relating to the Health Effects of Long Working Hours. Journal of Business Ethics, 84 (2). 195--208.","paperID":"None"},{"content":"Paul Dourish , Ken Anderson , Dawn Nafus, Cultural mobilities: diversity and agency in urban computing, Proceedings of the 11th IFIP TC 13 international conference on Human-computer interaction, September 10-14, 2007, Rio de Janeiro, Brazil","paperID":"1778342"},{"content":"Paul Dourish , Genevieve Bell, Divining a Digital Future: Mess and Mythology in Ubiquitous Computing, The MIT Press, 2011","paperID":"2018772"},{"content":"Edwards, P. N. and Wajcman, J. The politics of working life, Oxford, 2005.","paperID":"None"},{"content":"Elsbach, K. D., Cable, D. M. and Sherman, J. W. How passive 'face time' affects perceptions of employees: Evidence of spontaneous trait inference. Human Relations, 63 (6). 735--760.","paperID":"None"},{"content":"Evans, J. A., Kunda, G. and Barley, S. R. Beach Time, Bridge Time, and Billable Hours: The Temporal Structure of Technical Contracting. Administrative Science Quarterly, 49. 1--38.","paperID":"None"},{"content":"Fassel, D. Working Ourselves to Death: The high cost of workaholicism and the rewards of recovery. Harper Collins, New York, NY, 1990.","paperID":"None"},{"content":"Fraser, J. A. White Collar Sweat-Shop: The Deterioration of Work and its Rewards in Corporate America. W. W. Norton & Co, NY, New York, 2001.","paperID":"None"},{"content":"Fuller, J. A., Stanton, J. M., Fisher, G. G., Spitzmüller, C., Russell, S. S. and Smith, P. C. A Lengthy Look at the Daily Grind: Time Series Analysis of Events, Mood, Stress and Satisfaction. Journal of Applied Psychology, 88 (6). 1019--1033.","paperID":"None"},{"content":"Goffman, E. The Presentation of Self in Everyday Life. Anchor Books, Doubleday, New York, NY, 1959.","paperID":"None"},{"content":"Golden, L. A Brief History of Long Work Time and the Contemporary Sources of Overwork. Journal of Business Ethics, 84 (2). 217--227.","paperID":"None"},{"content":"Golden, L. and Altman, M. Why do people overwork? Oversupply of Hours and Labor, Labor Market Forces and Adaptive Preferences. in Burke, R. J. and Cooper, C. L. eds. The Long Work Hours Culture: Causes, Consequences and Choices, Emerald Group Publishing Ltd., Bingley, UK, 2008, 61--84.","paperID":"None"},{"content":"Victor M. González , Gloria Mark, \"Constant, constant, multi-tasking craziness\": managing multiple working spheres, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.113-120, April 24-29, 2004, Vienna, Austria","paperID":"985707"},{"content":"Greenhaus, J. H., Allen, T. D. and Spector, P. E. Health Consequences of Work-Family Conflict: The Dark Side of the Work - Family Interface. in Perrewé, P. and Ganster, D. eds. Research in Occupational Stress and Well-being, Emerald Group Publishing Limited, 2006.","paperID":"None"},{"content":"Rikard Harr , Victor Kaptelinin, Unpacking the social dimension of external interruptions, Proceedings of the 2007 international ACM conference on Supporting group work, November 04-07, 2007, Sanibel Island, Florida, USA","paperID":"1316686"},{"content":"Hassan, R. Network Time and the New Knowledge Epoch. Time & Society, 12. 225--241.","paperID":"None"},{"content":"Juan David Hincapié-Ramos , Stephen Voida , Gloria Mark, A design space analysis of availability-sharing systems, Proceedings of the 24th annual ACM symposium on User interface software and technology, October 16-19, 2011, Santa Barbara, California, USA","paperID":"2047207"},{"content":"Juan David Hincapié-Ramos , Stephen Voida , Gloria Mark, Sharing availability information with InterruptMe, Proceedings of the 13th international conference on Ubiquitous computing, September 17-21, 2011, Beijing, China","paperID":"2030179"},{"content":"Hörning, K. H., Ahrens, D. and Gerhard, A. Do Technologies Have Time? New practices of time and the transformation of communication technologies. Time & Society, 8 (2). 293--308.","paperID":"None"},{"content":"Kanai, A. \"Karoshi (Work to Death)\" in Japan. Journal of Business Ethics, 84 (2). 209--216.","paperID":"None"},{"content":"Kaufman, C. F., Lane, P. M. and Lindquist, J. D. Exploring More than 24 Hours a Day: A Preliminary Investigation of Polychronic Time Use. The Journal of Consumer Research, 18 (3). 392--401.","paperID":"None"},{"content":"Kraft, J. C. Students at Stanford Work on Apps that Alleviate Stress The New York Times, 2012.","paperID":"None"},{"content":"Kunda, G. Engineering Culture: Control and Commitment in a High-Tech Corporation. Temple University Press, Philadelphia, PA, (1992) 2006.","paperID":"None"},{"content":"Lee, H. and Whitley, E. A. Time and Information Technology: Temporal Impacts on Individuals, Organizations, and Society. The Information Society, 18. 235--240.","paperID":"None"},{"content":"Fredrik Ljungberg, Exploring CSCW mechanisms to realize constant accessibility without inappropriate interaction, Scandinavian Journal of Information Systems, v.11 n.2, p.115-135, July 1999","paperID":"350746"},{"content":"Gloria Mark , Victor M. Gonzalez , Justin Harris, No task left behind?: examining the nature of fragmented work, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 02-07, 2005, Portland, Oregon, USA","paperID":"1055017"},{"content":"Gloria Mark , Daniela Gudith , Ulrich Klocke, The cost of interrupted work: more speed and stress, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357072"},{"content":"Gloria Mark , Stephen Voida , Armand Cardello, \"A pace not dictated by electrons\": an empirical study of work without email, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207754"},{"content":"Mazmanian, M. Avoiding the trap of constant connectivity: When congruent frames allow for heterogeneous practices. Academy of Management Journal, 56 (5). 1225--1250.","paperID":"None"},{"content":"Mazmanian, M. Predictable Time off? Leveraging personal needs to change the micro dynamics of teamwork U.C. Davis Qualitative Research Conference, Best Paper, Davis, CA, 2012.","paperID":"None"},{"content":"Mazmanian, M., Orlikowski, W. J. and Yates, J. The Autonomy Paradox: The Implications of Mobile Email Devices for Knowledge Professionals. Organization Science, 24 (5). 1337--1357.","paperID":"None"},{"content":"McMillan, L., H. W. and O'Driscoll, M. P. The Wellsprings of Workaholism: A Comparative Analysis of the Explanatory Theories. in Burke, R. J. and Cooper, C. L. eds. The Long Work Hours Culture: Causes, Consequences and Choices, Emerald Group Publishing Ltd., Bingley, UK, 2008, 85--114.","paperID":"None"},{"content":"Michel, A. Transcending Socialization: A Nine-Year Ethnography of the Body's Role in Organizational Control and Knowledge Workers' Transformation. Administrative Science Quarterly, 56 (3). 325--368.","paperID":"None"},{"content":"Murray, W. C. and Rostis, A. \"Who's Running the Machine?\" A theoretical exploration of work stress and burnout of technologically tethered workers. Journal of Employment Rights, 12 (3). 249--263.","paperID":"None"},{"content":"Bonnie A. Nardi , Steve Whittaker , Erin Bradner, Interaction and outeraction: instant messaging in action, Proceedings of the 2000 ACM conference on Computer supported cooperative work, p.79-88, December 2000, Philadelphia, Pennsylvania, USA","paperID":"358975"},{"content":"Nelsen, B. J. and Barley, S. R. For Love or Money? Commodification and the Construction of an Occupational Mandate. Administrative Science Quarterly, 42 (4). 619--653.","paperID":"None"},{"content":"Wanda J. Orlikowski , JoAnne Yates, It's About Time: Temporal Structuring in Organizations, Organization Science, v.13 n.6, p.684-700, November 2002","paperID":"769338"},{"content":"Palmer, D. K. and Schoorman, F. D. Unpackaging the multiple aspects of time in polychronicity. Journal of Managerial Psychology, 14 (3/4). 323--345.","paperID":"None"},{"content":"Viktoria Pammer , Stefan Edler , Hermann Stern, Visualising the fragmentation of knowledge work, Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, October 14-17, 2012, Copenhagen, Denmark","paperID":"2399143"},{"content":"Perlow, L. A. Sleeping with Your Smartphone: How to Break the 24/7 Habit and Change the Way You Work. Harvard Business School Publishing, Boston, Massachussetts, 2012.","paperID":"None"},{"content":"Perlow, L. A. and Porter, J. L. Making Time Off Predictable - and Required. Harvard Business Review, 84 (10).","paperID":"None"},{"content":"Porter, G. and Kakabadse, N. K. HRM Perspectives on addiction to technology and work. Journal of Management Development, 25 (6). 535--560.","paperID":"None"},{"content":"Prasopoulou, E., Pouloud, A. and Panteli, N. Enacting new temporal boundaries: the role of mobile phones European Journal of Information Systems 15. 277--284.","paperID":"None"},{"content":"Schaufeli, W. B., Taris, T. W. and Bakker, A. B. It Takes Two to Tango: Workaholism is Working Excessively and Working Compulsively. in Burke, R. J. and Cooper, C. L. eds. The Long Work Hours Culture: Causes, Consequences and Choices, Emerald Group Publishing Ltd., Bingley, UK, 2008, 203--226.","paperID":"None"},{"content":"Schor, J. The Overworked American: The unexpected decline of leisure, 1992.","paperID":"None"},{"content":"Bryan Semaan , Gloria Mark, Technology-mediated social arrangements to resolve breakdowns in infrastructure during ongoing disruption, ACM Transactions on Computer-Human Interaction (TOCHI), v.18 n.4, p.1-21, December 2011","paperID":"2063235"},{"content":"Phoebe Sengers, What I learned on Change Islands: reflections on IT and pace of life, interactions, v.18 n.2, March + April 2011","paperID":"1925830"},{"content":"Phoebe Sengers , Kirsten Boehner , Shay David , Joseph 'Jofish' Kaye, Reflective design, Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility, August 20-24, 2005, Aarhus, Denmark","paperID":"1094569"},{"content":"Sennett, R. The Corrosion of Character: The Personal Consequences of Work in the New Capitalism. W. W. Norton & Co., New York, NY, 1998.","paperID":"None"},{"content":"Smith, M. R. and Marx, L. (eds.). Does technology drive history? The dilemma of technological determinism. MIT Press, Cambridge, MA, 1994.","paperID":"None"},{"content":"Katarzyna Stawarz , Anna L. Cox , Jon Bird , Rachel Benedyk, \"I'd sit at home and do work emails\": how tablets affect the work-life balance of office workers, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468603"},{"content":"Strauss, A. and Corbin, J. M. Basics of Qualitative Reserach: Techniques and Procedures for Developing Grounded Theory. Sage Publications Inc., 1998.","paperID":"None"},{"content":"Monideepa Tarafdar , Qiang Tu , T. S. Ragu-Nathan , Bhanu S. Ragu-Nathan, Crossing to the dark side: examining creators, outcomes, and inhibitors of technostress, Communications of the ACM, v.54 n.9, September 2011","paperID":"1995403"},{"content":"Thompson, J. B. The Media and Modernity: A social theory of the media. The Stanford University Press, Stanford, California, 1995.","paperID":"None"},{"content":"Tomlinson, J. The Culture of Speed: The Coming of Immediacy. Sage, London, 2007.","paperID":"None"},{"content":"Towers, I., Duxbury, L., Higgins, C. and Thomas, J. Time thieves and space invaders: technology, work and the organization. Journal of Organizational Change Management, 19 (5). 593--618.","paperID":"None"},{"content":"Turel, O., Serenko, A. and Bontis, N., Blackberry Addiction: Symptoms and Outcomes in Proceedings of the Fourteenth Americas Conference on Information Systems, (Toronto, ON, Canada, 2008).","paperID":"None"},{"content":"Wajcman, J. Life in the fast lane? Towards a sociology of technology and time The British Journal of Sociology, 59 (1). 59--77.","paperID":"None"},{"content":"Wajcman, J. and Rose, E. Constant Connectivity: Rethinking Interruptions at Work. Organization Studies, 32 (7). 941--961.","paperID":"None"},{"content":"Mikael Wiberg , Steve Whittaker, Managing availability: Supporting lightweight negotiations to handle interruptions, ACM Transactions on Computer-Human Interaction (TOCHI), v.12 n.4, p.356-387, December 2005","paperID":"1121114"},{"content":"Wright, T. A., Cropanzano, R., Bonett, D. G. and Diamond, W. J. The role of employee psychological wellbeing in cardiovascular health: when the twain shall meet. Journal of Organizational Behavior, 30. 193--208.","paperID":"None"},{"content":"Zerubavel, E. The Standardization of Time: A Sociohistorical Perspective. The American Journal of Sociology, 88 (1). 1--23.","paperID":"None"}],"title":"The product of availability: understanding the economic underpinnings of constant connectivity","filename":"CHI14/p763","authors":["Melissa Mazmanian","Ingrid Erickson"],"conference":"CHI '14"}