{"paperId":2557286,"citation":[{"content":"Ha Trinh , Lazlo Ring , Timothy Bickmore, DynamicDuo: Co-presenting with Virtual Agents, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702584"},{"content":"Bahador Saket , Sijie Yang , Hong Tan , Koji Yatani , Darren Edge, TalkZones: section-based time support for presentations, Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, September 23-26, 2014, Toronto, ON, Canada","paperID":"2628399"}],"reference":[{"content":"Apple Keynote. http://www.apple.com/iwork/keynote.","paperID":"None"},{"content":"Cliff Atkinson, Beyond Bullet Points: Using Microsoft  PowerPoint  to Create Presentations That Inform, Motivate, and Inspire (Bpg-Other), Microsoft Press, Redmond, WA, 2005","paperID":"1204372"},{"content":"Ayres, J. (1996). Speech preparation processes and speech apprehension. Communication Education, 45, 228--235.","paperID":"None"},{"content":"Behnke, R. R., Sawyer, C. R. (1999). Public speaking procrastination as a correlate of public speaking communication apprehension and self-perceived public speaking competency. Communication Research Reports, 16(1), 40--47.","paperID":"None"},{"content":"Braun, V., Clarke, V. (2006). Using thematic analysis in psychology. Qualitative Research in Psychology, 3(2), 77--101.","paperID":"None"},{"content":"Carpenter, S. K., Pashler, H., Wixted, J. T., Vul. E. (1998). The effect of tests on learning and forgetting. Memory & Cognition, 36(2), 438--448.","paperID":"None"},{"content":"James Clarke , Mirella Lapata, Models for sentence compression: a comparison across domains, training requirements and evaluation measures, Proceedings of the 21st International Conference on Computational Linguistics and the 44th annual meeting of the Association for Computational Linguistics, p.377-384, July 17-18, 2006, Sydney, Australia","paperID":"1220223"},{"content":"Marie-Catherine de Marneffe , Christopher D. Manning, The Stanford typed dependencies representation, Coling 2008: Proceedings of the workshop on Cross-Framework and Cross-Domain Parser Evaluation, p.1-8, August 23-23, 2008, Manchester, United Kingdom","paperID":"1608859"},{"content":"Distinction Communication, Inc. (2009). Executive survey. http://www.distinction-services.com.","paperID":"None"},{"content":"Nancy Duarte, Slide: ology: the art and science of creating great presentations, O'Reilly & Associates, Inc., Sebastopol, CA, 2008","paperID":"1461418"},{"content":"Duarte, N. (2012). HBR guides to persuasive presentation. HBR Press.","paperID":"None"},{"content":"Darren Edge , Stephen Fitchett , Michael Whitney , James Landay, MemReflex: adaptive flashcards for mobile microlearning, Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services, September 21-24, 2012, San Francisco, California, USA","paperID":"2371641"},{"content":"Darren Edge , Joan Savage , Koji Yatani, HyperSlides: dynamic presentation prototyping, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470749"},{"content":"Katja Filippova , Michael Strube, Dependency tree based sentence compression, Proceedings of the Fifth International Natural Language Generation Conference, June 12-14, 2008, Salt Fork, Ohio","paperID":"1708329"},{"content":"Goodman, A. (2006). Why bad presentations happen to good causes. Andy Goodman & Cause Communication.","paperID":"None"},{"content":"Grefenstette, G. (1998). Producing intelligent telegraphic text reduction to provide an audio scanning service for the blind. AAAI'98, 111--118.","paperID":"None"},{"content":"Jing, Y., Croft, B. (1994). An association thesaurus for information retrieval. RIAO'94.","paperID":"None"},{"content":"Kazutaka Kurihara , Masataka Goto , Jun Ogata , Yosuke Matsusaka , Takeo Igarashi, Presentation sensei: a presentation training system using speech and image processing, Proceedings of the 9th international conference on Multimodal interfaces, November 12-15, 2007, Nagoya, Aichi, Japan","paperID":"1322256"},{"content":"Richard E. Mayer, Multimedia Learning, Cambridge University Press, New York, NY, 2001","paperID":"516736"},{"content":"McCroskey, J. C. (1978). Validity of the PCRA as an index of oral communication apprehension. Communication Monographs, 45, 192--203.","paperID":"None"},{"content":"Menzel, K. E., Correll, L. J. (1994). The relationship between preparation and performance in public speaking. Communication Education, 43, 17--26.","paperID":"None"},{"content":"Microsoft PowerPoint. http://office.microsoft.com/enus/powerpoint.","paperID":"None"},{"content":"Microsoft Speech Platform SDK. http://msdn.microsoft.com/enus/library/hh361572(v=office.14).aspx.","paperID":"None"},{"content":"Nelson, D. L., Reed, U. S., Walling, J. R. (1976). Pictorial superiority effect. Journal of Experimental Psychology: Human Learning & Memory, 2, 523--528.","paperID":"None"},{"content":"Ryo Okamoto , Akihiro Kashihara, Back-review support method for presentation rehearsal support system, Proceedings of the 15th international conference on Knowledge-based and intelligent information and engineering systems, September 12-14, 2011, Kaiserslautern, Germany","paperID":"2041360"},{"content":"Paivio, A. (1990). Mental representation: A dual coding approach. Oxford University Press.","paperID":"None"},{"content":"Pearson, J. C., Child, J. T., Kahl, D. H. (2006). Preparation meeting opportunity: How do college students prepare for public speeches' Communication Quarterly, 54(3), 351--366.","paperID":"None"},{"content":"Reynolds, G. (2012). Presentation Zen: Simple ideas on presentation design and delivery. New Riders.","paperID":"None"},{"content":"Rohrer, D., Taylor, K., Pashler, H., Wixted, J. T., Cepeda, N. J. (2005). The effect of overlearning on long-term retention. Applied Cognitive Psychology, 19, 361--374.","paperID":"None"},{"content":"Ryan Spicer , Yu-Ru Lin , Aisling Kelliher , Hari Sundaram, NextSlidePlease: Authoring and delivering agile multimedia presentations, ACM Transactions on Multimedia Computing, Communications, and Applications (TOMCCAP), v.8 n.4, p.1-20, November 2012","paperID":"2379795"},{"content":"Thios, S. J. (1975). Memory for general and specific sentences. Memory & Cognition, 3(1), 175--177.","paperID":"None"},{"content":"Kristina Toutanova , Dan Klein , Christopher D. Manning , Yoram Singer, Feature-rich part-of-speech tagging with a cyclic dependency network, Proceedings of the 2003 Conference of the North American Chapter of the Association for Computational Linguistics on Human Language Technology, p.173-180, May 27-June 01, 2003, Edmonton, Canada","paperID":"1073478"},{"content":"Weissman, J. (2009). Presenting to win: the art of telling your story. FT Press.","paperID":"None"},{"content":"Weissman, J. (2009). The power presenter: techniques, styles, and strategies from America's top speaking coach. Wiley.","paperID":"None"}],"abstract":"Rehearsal is a critical component of preparing to give an oral presentation, yet it is frequently abbreviated, performed in ways that are inefficient or ineffective, or simply omitted. We conducted an exploratory study to understand the relationship between the theory and practice of presentation rehearsal, classifying our qualitative results into five themes to motivate more structured rehearsal support deeply integrated in slide presentation software. In a within-subject study (N=12) comparing against participants' existing rehearsal practices, we found that our resulting PitchPerfect system significantly improved overall presentation quality and content coverage as well as provided greater support for content mastery, time management, and confidence building.","video":"http://www.youtube.com/embed/gBysX3PP4pM?rel=0","title":"PitchPerfect: integrated rehearsal environment for structured presentation preparation","filename":"CHI14/p1571","authors":["Ha Trinh","Koji Yatani","Darren Edge"],"conference":"CHI '14"}