{"paperId":2557341,"citation":[{"content":"Britton Horn , Christopher Clark , Oskar Strom , Hilery Chao , Amy J. Stahl , Casper Harteveld , Gillian Smith, Design Insights into the Creation and Evaluation of a Computer Science Educational Game, Proceedings of the 47th ACM Technical Symposium on Computing Science Education, March 02-05, 2016, Memphis, Tennessee, USA","paperID":"2844656"}],"abstract":"Games that use procedural content generation (PCG) do so in a wide variety of ways and for different reasons. One of the most common reasons cited by PCG system creators and game designers is improving replayability by providing a means for automatically creating near-infinite amounts of content, the player can come back and replay the game and refine her strategies over a long period. However, this notion of replayability is both overly broad and incomplete as a motivation. This paper contributes an analytical framework and associated common vocabulary for understanding the role of PCG in games from a design standpoint, with an aim of unpacking some of the broad justifications for PCG use in games, and bringing together technical concerns in designing PCG systems with design concerns related to creating engaging playable experiences.","video":"http://www.youtube.com/embed/fcEp5JKZxS0?rel=0","reference":[{"content":"{adult swim games}. Robot Unicorn Attack (PC Game). 2010.","paperID":"None"},{"content":"Staffan Bjork , Jussi Holopainen, Patterns in Game Design (Game Development Series), Charles River Media, Inc., Rockland, MA, 2004","paperID":"1044921"},{"content":"Bjork, S. Procedurally Generated Game Worlds. Game Design Patterns 2.0. http://gdp2.tii.se/index.php/Procedurally_Generated_G ame_Worlds.","paperID":"None"},{"content":"Butler, E., Smith, A.M., Liu, Y.-E., and Popovic, Z. A Mixed-Initiative Tool for Designing Level Progressions in Games.","paperID":"None"},{"content":"Church, D. Formal Abstract Design Tools. Gamasutra {Online}, 1999. http://www.gamasutra.com/view/feature/3357/formal_ abstract_design_tools.php.","paperID":"None"},{"content":"Cook, D. The Chemistry Of Game Design. Gamasutra, 2007. http://www.gamasutra.com/view/feature/129948/the_c hemistry_of_game_design.php.","paperID":"None"},{"content":"Maria Cutumisu , Curtis Onuczko , Matthew McNaughton , Thomas Roy , Jonathan Schaeffer , Allan Schumacher , Jeff Siegel , Duane Szafron , Kevin Waugh , Mike Carbonaro , Harvey Duff , Stephanie Gillis, ScriptEase: A generative/adaptive programming paradigm for game scripting, Science of Computer Programming, v.67 n.1, p.32-58, June, 2007","paperID":"1265866"},{"content":"Joris Dormans, Adventures in level design: generating missions and spaces for action adventure games, Proceedings of the 2010 Workshop on Procedural Content Generation in Games, p.1-8, June 18-18, 2010, Monterey, California","paperID":"1814257"},{"content":"Dormans, J. Engineering Emergence: Applied Theory for Game Design. 2012.","paperID":"None"},{"content":"Doull, A. The Death of the Level Designer: Procedural Content Generation in Games. ASCII Dreams: A Roguelike Developer's Diary, 2008. http://roguelikedeveloper.blogspot.com/2008/01/deathof-level-designer-procedural.html.","paperID":"None"},{"content":"David S. Ebert , F. Kenton Musgrave , Darwyn Peachey , Ken Perlin , Steven Worley, Texturing and Modeling: A Procedural Approach, Morgan Kaufmann Publishers Inc., San Francisco, CA, 2002","paperID":"572337"},{"content":"Fernández-Vara, C. Personal communication, creator of Symon game. (2012).","paperID":"None"},{"content":"Firaxis Games. Civilization IV (PC Game). 2K Games, 2005.","paperID":"None"},{"content":"Gearbox Software and Feral Interactive. Borderlands (XBox 360). 2K Games, 2009.","paperID":"None"},{"content":"James Paul Gee, What Video Games Have to Teach Us About Learning and Literacy, Palgrave Macmillan, 2004","paperID":"983348"},{"content":"Hastings, E.J., Guha, R.K., and Stanley, K.O. Automatic Content Generation in the Galactic Arms Race Video Game. IEEE Transactions on Computational Intelligence and AI in Games 1, 4 (2009), 245--263.","paperID":"None"},{"content":"Mark Hendrikx , Sebastiaan Meijer , Joeri Van Der Velden , Alexandru Iosup, Procedural content generation for games: A survey, ACM Transactions on Multimedia Computing, Communications, and Applications (TOMCCAP), v.9 n.1, p.1-22, February 2013","paperID":"2422957"},{"content":"Kenneth Hullett , Jim Whitehead, Design patterns in FPS levels, Proceedings of the Fifth International Conference on the Foundations of Digital Games, p.78-85, June 19-21, 2010, Monterey, California","paperID":"1822359"},{"content":"Hunicke, R., LeBlanc, M., and Zubek, R. MDA: A Formal Approach to Game Design and Game Research. Proceedings of the 2004 AAAI Workshop on Challenges in Game Artificial Intelligence, AAAI Press (2004).","paperID":"None"},{"content":"Interactive Data Visualization Inc. SpeedTree (PC Software). Lexington, SC, 2010.","paperID":"None"},{"content":"Jennings-Teats, M., Smith, G., and Wardrip-Fruin, N. Polymorph: A Model for Dynamic Level Generation. (2010).","paperID":"None"},{"content":"Jupiter. Picross DS (Nintendo DS). Nintendo, 2007.","paperID":"None"},{"content":"Rilla Khaled , Mark J. Nelson , Pippin Barr, Design metaphors for procedural content generation in games, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466201"},{"content":"Level-5. Professor Layton and the Curious Village (Nintendo DS). Nintendo, 2008.","paperID":"None"},{"content":"Liapis, A., Yannakakis, G.N., and Togelius, J. Sentient sketchbook: Computer-aided game level authoring. Proceedings of ACM Conference on Foundations of Digital Games, (2013).","paperID":"None"},{"content":"Maxis. Spore Creature Creator (PC Game). Electronic Arts, 2008.","paperID":"None"},{"content":"Maxis. Spore (PC Game). Electronic Arts, 2008.","paperID":"None"},{"content":"M. McNaughton , M. Cutumisu , D. Szafron , J. Schaeffer , J. Redford , D. Parker, ScriptEase: Generative Design Patterns for Computer Role-Playing Games, Proceedings of the 19th IEEE international conference on Automated software engineering, p.88-99, September 20-24, 2004","paperID":"1025210"},{"content":"Mortac. The Complete Guide to Map Generation. Civ Fanatics Forums, 2007. http://forums.civfanatics.com/showthread.php?t=24678 8&s=b667c50191bb40c93402f38a7560b7ac.","paperID":"None"},{"content":"Pascal Müller , Peter Wonka , Simon Haegler , Andreas Ulmer , Luc Van Gool, Procedural modeling of buildings, ACM Transactions on Graphics (TOG), v.25 n.3, July 2006","paperID":"1141931"},{"content":"Nintendo EAD. Animal Crossing: New Leaf (Nintendo 3DS). Nintendo, 2013.","paperID":"None"},{"content":"Nitsche, M., Ashmore, C., Hankinson, W., Fitzpatrick, R., Kelly, J., and Margenau, K. Designing Procedural Game Spaces: A Case Study. Proceedings of FuturePlay 2006, (2006).","paperID":"None"},{"content":"Ohkubo, H. Warning Forever (PC Game). Hikware, 2003.","paperID":"None"},{"content":"Persson, M. Infinite Mario Bros! (PC Game). http://www.mojang.com/notch/mario/, 2008.","paperID":"None"},{"content":"Persson, M. Minecraft (PC Game). 2011.","paperID":"None"},{"content":"Rareware. Donkey Kong Country 2: Diddy's Kong Quest (Nintendo DS). Nintendo, 1995.","paperID":"None"},{"content":"Regier, J. and Gresko, R. Random Asset Generation in Diablo 3. Invited Talk, UC Santa Cruz, (2009).","paperID":"None"},{"content":"Risi, S., Lehman, J., D'Ambrosio, D.B., Hall, R., and Stanley, K.O. Combining Search-Based Procedural Content Generation and Social Gaming in the Petalz Video Game. Proceedings of the 2012 Conference on Artificial Intelligence and Interactive Digital Entertainment, (2012).","paperID":"None"},{"content":"Rogue Basin. Articles on Implementation Techniques. http://roguebasin.roguelikedevelopment.org/index.php?title=Articles#Implementation.","paperID":"None"},{"content":"Rohrer, J. Inside a Star-Filled Sky (PC Game). 2011.","paperID":"None"},{"content":"Saltsman, A. Canabalt (PC Game). Adam Atomic, 2009.","paperID":"None"},{"content":"Jesse Schell, The art of game design: a book of lenses, Morgan Kaufmann Publishers Inc., San Francisco, CA, 2008","paperID":"2167319"},{"content":"Jimmy Secretan , Nicholas Beato , David B. D'Ambrosio , Adelein Rodriguez , Adam Campbell , Jeremiah T. Folsom-Kovarik , Kenneth O. Stanley, Picbreeder: A case study in collaborative evolutionary exploration of design space, Evolutionary Computation, v.19 n.3, p.373-403, Fall 2011","paperID":"2078016"},{"content":"Shaker, N., Nicolau, M., Yannakakis, G., Togelius, J., and O'Neill, M. Evolving Levels for Super Mario Bros Using Grammatical Evolution. IEEE Transactions on Computational Intelligence and Games (CIG), (2012).","paperID":"None"},{"content":"Shaker, N., Yannakakis, G.N., and Togelius, J. Towards Automatic Personalized Content Generation for Platform Games. Proceedings of the Sixth Artificial Intelligence in Interactive Digital Entertainment Conference (AIIDE10), (2010).","paperID":"None"},{"content":"Ruben Smelik , Krzysztof Galka , Klaas Jan de Kraker , Frido Kuijper , Rafael Bidarra, Semantic constraints for procedural generation of virtual worlds, Proceedings of the 2nd International Workshop on Procedural Content Generation in Games, p.1-4, June 28-28, 2011, Bordeaux, France","paperID":"2000928"},{"content":"Ruben Smelik , Tim Tutenel , Klaas Jan de Kraker , Rafael Bidarra, Integrating procedural generation and manual editing of virtual worlds, Proceedings of the 2010 Workshop on Procedural Content Generation in Games, p.1-8, June 18-18, 2010, Monterey, California","paperID":"1814258"},{"content":"Adam M. Smith , Erik Andersen , Michael Mateas , Zoran Popović, A case study of expressively constrainable level design automation tools for a puzzle game, Proceedings of the International Conference on the Foundations of Digital Games, May 29-June 01, 2012, Raleigh, North Carolina","paperID":"2282370"},{"content":"Smith, G. and Harteveld, C. Procedural Content Generation as an Opportunity to Foster Collaborative Mindful Learning. Workshop on Games and Learning, co-located with Foundations of Digital Games 2013, (2013).","paperID":"None"},{"content":"Gillian Smith , Alexei Othenin-Girard , Jim Whitehead , Noah Wardrip-Fruin, PCG-based game design: creating Endless Web, Proceedings of the International Conference on the Foundations of Digital Games, May 29-June 01, 2012, Raleigh, North Carolina","paperID":"2282375"},{"content":"Smith, G., Whitehead, J., Mateas, M., Treanor, M., March, J., and Cha, M. Launchpad: A Rhythm-Based Level Generator for 2D Platformers. IEEE Transactions on Computational Intelligence and AI in Games (TCIAIG) 3, 1 (2011).","paperID":"None"},{"content":"Smith, G., Whitehead, J., and Mateas, M. Tanagra: Reactive Planning and Constraint Solving for MixedInitiative Level Design. IEEE Transactions on Computational Intelligence and AI in Games (TCIAIG), Special Issue on Procedural Content Generation 3, 3 (2011).","paperID":"None"},{"content":"Sonic Team. Sonic the Hedgehog (Genesis). SEGA, 1991.","paperID":"None"},{"content":"Sullivan, A. Content Selection vs. Content Generation. Expressive Intelligence Studio, 2010. http://eisblog.ucsc.edu/2010/06/content-selection-vs-contentgeneration/.","paperID":"None"},{"content":"Julian Togelius , Emil Kastbjerg , David Schedl , Georgios N. Yannakakis, What is procedural content generation?: Mario on the borderline, Proceedings of the 2nd International Workshop on Procedural Content Generation in Games, p.1-6, June 28-28, 2011, Bordeaux, France","paperID":"2000922"},{"content":"Togelius, J., Yannakakis, G.N., Stanley, K.O., and Browne, C. Search-Based Procedural Content Generation: A Taxonomy and Survey. Computational Intelligence and AI in Games, IEEE Transactions on 3, 3 (2011), 172--186.","paperID":"None"},{"content":"Toy, M., Wichman, G., Arnold, K., and Lane, J. Rogue (PC Game). 1980.","paperID":"None"},{"content":"Georgios N. Yannakakis , Julian Togelius, Experience-Driven Procedural Content Generation, IEEE Transactions on Affective Computing, v.2 n.3, p.147-161, July 2011","paperID":"2052020"},{"content":"Yu, D. Spelunky (PC Game). 2009.","paperID":"None"}],"title":"Understanding procedural content generation: a design-centric analysis of the role of PCG in games","filename":"CHI14/p917","authors":["Gillian Smith"],"conference":"CHI '14"}