{"paperId":2557296,"citation":[{"content":"Eleonora Mencarini , Gianluca Schiavo , Alessandro Cappelletti , Oliviero Stock , Massimo Zancanaro, Formative evaluation of a constrained composition approach for storytelling, Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational, October 26-30, 2014, Helsinki, Finland","paperID":"2670257"}],"reference":[{"content":"James Abello , Peter Broadwell , Timothy R. Tangherlini, Computational folkloristics, Communications of the ACM, v.55 n.7, July 2012","paperID":"2209267"},{"content":"Adams, E. and Rollings, A. Fundamentals of Game Design. Pearson Prentice Hall, 2007.","paperID":"None"},{"content":"Daniel Andrews , Chris Baber , Sergey Efremov , Mikhail Komarov, Creating and using interactive narratives: reading and writing branching comics, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208298"},{"content":"Ruth Aylett , Sandy Louchart , Anders Tychsen , Michael Hitchens , Rui Figueiredo , Carlos Delgado Mata, Managing emergent character-based narrative, Proceedings of the 2nd international conference on INtelligent TEchnologies for interactive enterTAINment, January 08-10, 2008, Cancun, Mexico","paperID":"1363207"},{"content":"Ruth Aylett , Sandy Louchart , Allan Weallans, Research in interactive drama environments, role-play and story-telling, Proceedings of the 4th international conference on Interactive Digital Storytelling, November 28-December 01, 2011, Vancouver, Canada","paperID":"2183475"},{"content":"Barthes, R. and Duisit, L. An Introduction to the Structural Analysis of Narrative. New Literary History 6, 2 (1975), 237--272.","paperID":"None"},{"content":"Black, J. B. and Wilensky, R. An Evaluation of Story Grammars*. Cognitive Science 3, 3 (1979), 213--229.","paperID":"None"},{"content":"Cohn, N., Paczynski, M., Jackendoff, R., Holcomb, P. J., and Kuperberg, G. R. (Pea)nuts and bolts of visual narrative: Structure and meaning in sequential image comprehension. Cognitive Psychology 65, 1 (2012), 1--38.","paperID":"None"},{"content":"Cohn, N. Visual Narrative Structure. Cognitive Science 37, 3 (2013), 413--452.","paperID":"None"},{"content":"Nicholas Diakopoulos , Funda Kivran-Swaine , Mor Naaman, Playable data: characterizing the design space of game-y infographics, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979193"},{"content":"Dundes, A. Binary Opposition in Myth: The Propp/Lévi-Strauss Debate in Retrospect. Western Folklore 56, 1 (1997), 39--50.","paperID":"None"},{"content":"Finlayson, M. A. Deriving Narrative Morphologies via Analogical Story Merging. Proc. Analogy 09, New Bulgarian University Press (2009), 127--136.","paperID":"None"},{"content":"Garnham, A. What's wrong with story grammars. Cognition 15, 1-3 (1983), 145--154.","paperID":"None"},{"content":"Hudson, L. DC Releases a Choose Your Own Adventure-Style Digital Comic About Batman. Wired, (2013). http://www.wired.com/underwire/2013/12/chooseyour-adventure-comic/.","paperID":"None"},{"content":"Rachel Lee Knickmeyer , Michael Mateas, Preliminary evaluation of the interactive drama facade, CHI '05 Extended Abstracts on Human Factors in Computing Systems, April 02-07, 2005, Portland, OR, USA","paperID":"1056963"},{"content":"Mandler, J. M. and Johnson, N. S. Remembrance of things parsed: Story structure and recall. Cognitive Psychology 9, 1 (1977), 111--151.","paperID":"None"},{"content":"Mangen, A. Hypertext fiction reading: haptics and immersion. Journal of Research in Reading 31, 4 (2008), 404--419.","paperID":"None"},{"content":"McCloud, S. Understanding Comics: The Invisible Art. HarperCollins, 1994.","paperID":"None"},{"content":"Ben Medler , Michael John , Jeff Lane, Data cracker: developing a visual game analytic tool for analyzing online gameplay, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979288"},{"content":"Alex Mitchell , Kevin McGee, Limits of rereadability in procedural interactive stories, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979223"},{"content":"Moissinac, L. Review of Psychonarratology: Foundations for the empirical study of literary response. Narrative Inquiry 14, 1 (2004), 231--234.","paperID":"None"},{"content":"Dinara Moura , Magy Seif el-Nasr , Christopher D. Shaw, Visualizing and understanding players' behavior in video games: discovering patterns and supporting aggregation and comparison, ACM SIGGRAPH 2011 Game Papers, August 07-11, 2011, Vancouver, British Columbia, Canada","paperID":"2037695"},{"content":"Pearman, C. J. Independent Reading of CD-ROM Storybooks: Measuring Comprehension with Oral Retellings. The Reading Teacher 61, 8 (2008), 594--602.","paperID":"None"},{"content":"Karolien Poels , Yvonne de Kort , Wijnand Ijsselsteijn, \"It is always a lot of fun!\": exploring dimensions of digital game experience using focus group methodology, Proceedings of the 2007 conference on Future Play, November 14-17, 2007, Toronto, Canada","paperID":"1328218"},{"content":"Pope, J. Where Do We Go From Here? Readers' Responses to Interactive Fiction: Narrative Structures, Reading Pleasure and the Impact of Interface Design. Convergence: The International Journal of Research into New Media Technologies 16, 1 (2010), 75--94.","paperID":"None"},{"content":"Propp, V. and Wagner, L. A. Morphology of the Folk Tale. University of Texas Press, 2010.","paperID":"None"},{"content":"Rumelhart, D. E. Notes on a schema for stories. In Representation and understanding: Studies in cognitive science. Academic Press, New York, 1975, 211--236.","paperID":"None"},{"content":"Serdar Sali , Michael Mateas, Using information visualization to understand interactive narrative: a case study on fa$#231;ade, Proceedings of the 4th international conference on Interactive Digital Storytelling, November 28-December 01, 2011, Vancouver, Canada","paperID":"2183511"},{"content":"Edward Segel , Jeffrey Heer, Narrative Visualization: Telling Stories with Data, IEEE Transactions on Visualization and Computer Graphics, v.16 n.6, p.1139-1148, November 2010","paperID":"1908000"},{"content":"Seif El-Nasr, M., Milam, D., and Maygoli, T. Experiencing interactive narrative: A qualitative analysis of Façade. Entertainment Computing 4, 1 (2013), 39--52.","paperID":"None"},{"content":"Thorndyke, P. W. Cognitive structures in comprehension and memory of narrative discourse. Cognitive Psychology 9, 1 (1977), 77--110.","paperID":"None"},{"content":"Urakami, J. and Krems, J. F. How hypertext reading sequences affect understanding of causal and temporal relations in story comprehension. Instructional Science 40, 2 (2012), 277--295.","paperID":"None"}],"abstract":"This paper describes the design and evaluation of a branching comic to compare how readers recall a visual narrative when presented as an interactive, digital program, or as a linear sequence on paper. The layout of the comic is used to visualize this data as heat maps and explore patterns of users' recollections. We describe the theoretical justification for this based upon previous work in narrative visualizations, interactive stories and comics. Having tested the comic with school boys aged 11-12; we saw patterns in the data that complement other research in both interactive stories and visualizations. We argue that the heat maps helped identify these patterns, which have implications for future designs and analyses of interactive visual and/or narrative media.","video":"http://www.youtube.com/embed/0n_jn5QEItY?rel=0","title":"Visualizing interactive narratives: employing a branching comic to tell a story and show its readings","filename":"CHI14/p1895","authors":["Daniel Andrews","Chris Baber"],"conference":"CHI '14"}