{"paperId":2557139,"citation":[{"content":"Yelena Mejova , Hamed Haddadi , Anastasios Noulas , Ingmar Weber, #FoodPorn: Obesity Patterns in Culinary Interactions, Proceedings of the 5th International Conference on Digital Health 2015, May 18-20, 2015, Florence, Italy","paperID":"2750524"},{"content":"João Loff , Manuel Reis , Bruno Martins, Predicting well-being with geo-referenced data collected from social media platforms, Proceedings of the 30th Annual ACM Symposium on Applied Computing, April 13-17, 2015, Salamanca, Spain","paperID":"2695939"},{"content":"Yafei Wang , Ingmar Weber , Prasenjit Mitra, Quantified Self Meets Social Media: Sharing of Weight Updates on Twitter, Proceedings of the 6th International Conference on Digital Health Conference, April 11-13, 2016, Montréal, Québec, Canada","paperID":"2896363"},{"content":"Ingmar Weber , Yelena Mejova, Crowdsourcing Health Labels: Inferring Body Weight from Profile Pictures, Proceedings of the 6th International Conference on Digital Health Conference, April 11-13, 2016, Montréal, Québec, Canada","paperID":"2897727"},{"content":"Munmun De Choudhury , Sanket Sharma , Emre Kiciman, Characterizing Dietary Choices, Nutrition, and Language in Food Deserts via Social Media, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819956"},{"content":"Sho Tsugawa , Yusuke Kikuchi , Fumio Kishino , Kosuke Nakajima , Yuichi Itoh , Hiroyuki Ohsaki, Recognizing Depression from Twitter Activity, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702280"},{"content":"Sofiane Abbar , Yelena Mejova , Ingmar Weber, You Tweet What You Eat: Studying Food Consumption Through Twitter, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702153"}],"abstract":"Understanding the relationships among environment, behavior, and health is a core concern of public health researchers. While a number of recent studies have investigated the use of social media to track infectious diseases such as influenza, little work has been done to determine if other health concerns can be inferred. In this paper, we present a large-scale study of 27 health-related statistics, including obesity, health insurance coverage, access to healthy foods, and teen birth rates. We perform a linguistic analysis of the Twitter activity in the top 100 most populous counties in the U.S., and find a significant correlation with 6 of the 27 health statistics. When compared to traditional models based on demographic variables alone, we find that augmenting models with Twitter-derived information improves predictive accuracy for 20 of 27 statistics, suggesting that this new methodology can complement existing approaches.","video":"http://www.youtube.com/embed/kD6IMqUsXIE?rel=0","reference":[{"content":"Anselin, L. Spatial econometrics: methods and models. Kluwer Academic Publishers, Dordrecht; Boston, 1988.","paperID":"None"},{"content":"Chen, M. K. The effect of language on economic behavior: Evidence from savings rates, health behaviors, and retirement assets. American Economic Review 103, 2 (Apr. 2013), 690--731.","paperID":"None"},{"content":"Chiswick, B. R., and Miller, P. W. The economics of language international analyses. Routledge, London; New York, 2007.","paperID":"None"},{"content":"Clifford, P., Richardson, S., and Hmon, D. Assessing the significance of the correlation between two spatial processes. Biometrics 45, 1 (Mar. 1989), 123--134. PMID: 2720048.","paperID":"None"},{"content":"Aron Culotta, Towards detecting influenza epidemics by analyzing Twitter messages, Proceedings of the First Workshop on Social Media Analytics, p.115-122, July 25-28, 2010, Washington D.C., District of Columbia","paperID":"1964874"},{"content":"Aron Culotta, Lightweight methods to estimate influenza rates and alcohol sales volume from Twitter messages, Language Resources and Evaluation, v.47 n.1, p.217-238, March     2013","paperID":"2447292"},{"content":"Danner, D. D., Snowdon, D. A., and Friesen, W. V. Positive emotions in early life and longevity: findings from the nun study. Journal of personality and social psychology 80, 5 (May 2001), 804--813. PMID: 11374751.","paperID":"None"},{"content":"De Choudhury, M., Gamon, M., Counts, S., and Horvitz, E. Predicting depression via social media. In ICWSM (2013).","paperID":"None"},{"content":"Mark Dredze, How Social Media Will Change Public Health, IEEE Intelligent Systems, v.27 n.4, p.81-84, July 2012","paperID":"2377400"},{"content":"Duggan, M., and Brenner, J. The demographics of social media users - 2012. Pew Internet & American Life Project, Feb 2013.","paperID":"None"},{"content":"Flores, B. E. A pragmatic view of accuracy measurement in forecasting. Omega 14, 2 (1986), 93--98.","paperID":"None"},{"content":"Ghosh, D. D., and Guha, R. What are we tweeting about obesity? Mapping tweets with topic modeling and geographic information system. Cartography and Geographic Information Science 40, 2 (2013), 90--102.","paperID":"None"},{"content":"Gottschalk, L. A., and Gleser, G. C. The Measurement of Psychological States Through the Content Analysis of Verbal Behavior. University of California Press, Jan. 1979.","paperID":"None"},{"content":"Graham, L E, n., Scherwitz, L., and Brand, R. Self-reference and coronary heart disease incidence in the western collaborative group study. Psychosomatic medicine 51, 2 (Apr. 1989), 137--144. PMID: 2710908.","paperID":"None"},{"content":"Hanson, C. L., Burton, S. H., Giraud-Carrier, C., West, J. H., Barnes, M. D., and Hansen, B. Tweaking and tweeting: Exploring twitter for nonmedical use of a psychostimulant drug (adderall) among college students. Journal of Medical Internet Research 15, 4 (Apr. 2013), e62.","paperID":"None"},{"content":"Brent Hecht , Lichan Hong , Bongwon Suh , Ed H. Chi, Tweets from Justin Bieber's heart: the dynamics of the location field in user profiles, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1978976"},{"content":"Howell, R. T., Kern, M. L., and Lyubomirsky, S. Health benefits: Meta-analytically determining the impact of well-being on objective health outcomes. Health Psychology Review 1, 1 (2007), 83--136.","paperID":"None"},{"content":"James W Pennebaker, M. R. M. Psychological aspects of natural language. use: our words, our selves. Annual review of psychology 54 (2003), 547--77.","paperID":"None"},{"content":"Sue Jamison-Powell , Conor Linehan , Laura Daley , Andrew Garbett , Shaun Lawson, \"I can't get no sleep\": discussing #insomnia on twitter, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208612"},{"content":"Vasileios Lampos , Tijl De Bie , Nello Cristianini, Flu detector: tracking epidemics on twitter, Proceedings of the 2010 European conference on Machine learning and knowledge discovery in databases: Part III, September 20-24, 2010, Barcelona, Spain","paperID":"1889832"},{"content":"Messer, L. C. Neighborhood-level characteristics as predictors of preterm birth: Examples from wake county, north carolina. Tech. rep., North Carolina Dept. of Health and Human Services, 2005.","paperID":"None"},{"content":"Paul, M. J., and Dredze, M. You are what you tweet: Analyzing Twitter for public health. In ICWSM (2011).","paperID":"None"},{"content":"Fabian Pedregosa , Gaël Varoquaux , Alexandre Gramfort , Vincent Michel , Bertrand Thirion , Olivier Grisel , Mathieu Blondel , Peter Prettenhofer , Ron Weiss , Vincent Dubourg , Jake Vanderplas , Alexandre Passos , David Cournapeau , Matthieu Brucher , Matthieu Perrot , Édouard Duchesnay, Scikit-learn: Machine Learning in Python, The Journal of Machine Learning Research, 12, p.2825-2830, 2/1/2011","paperID":"2078195"},{"content":"Pennebaker, J., Francis, J., and Booth, R. Linguistic inquiry and word count: LIWC 2001. World Journal of the International Linguistic Association (2001).","paperID":"None"},{"content":"Qiu, L., Lin, H., Ramsay, J., and Yang, F. You are what you tweet: Personality expression and perception on twitter. Journal of Research in Personality 46, 6 (Dec. 2012), 710--718.","paperID":"None"},{"content":"Rabi, D. M., et al. Association of socio-economic status with diabetes prevalence and utilization of diabetes care services. BMC Health Services Research 6, 1 (Oct. 2006), 124. PMID: 17018153.","paperID":"None"},{"content":"Sadilek, A., Kautz, H., and Silenzio, V. Predicting disease transmission from geo-tagged micro-blog data. In AAAI (Dec. 2012).","paperID":"None"},{"content":"Schwartz, H. A., et al. Characterizing geographic variation in well-being using tweets. In Seventh International AAAI Conference on Weblogs and Social Media (ICWSM) (2013).","paperID":"None"},{"content":"Seligman, M. E. P. Flourish: a visionary new understanding of happiness and well-being. Free Press, New York, 2011.","paperID":"None"},{"content":"Signorini, A., Segre, A. M., and Polgreen, P. M. The use of Twitter to track levels of disease activity and public concern in the U.S. during the influenza a H1N1 pandemic. PLoS ONE 6, 5 (May 2011), e19467.","paperID":"None"},{"content":"Sobal, J., and Stunkard, A. J. Socioeconomic status and obesity: A review of the literature. Psychological Bulletin 105, 2 (1989), 260--275.","paperID":"None"},{"content":"Avaré Stewart , Ernesto Diaz, Epidemic intelligence: for the crowd, by the crowd, Proceedings of the 12th international conference on Web Engineering, July 23-27, 2012, Berlin, Germany","paperID":"2364187"}],"title":"Estimating county health statistics with twitter","filename":"CHI14/p1335","authors":["Aron Culotta"],"conference":"CHI '14"}