{"paperId":2557244,"citation":[{"content":"Christopher Frauenberger, Disability and Technology: A Critical Realist Perspective, Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, October 26-28, 2015, Lisbon, Portugal","paperID":"2809851"},{"content":"Kiley Sobel , Katie O'Leary , Julie A. Kientz, Maximizing children's opportunities with inclusive play: considerations for interactive technology design, Proceedings of the 14th International Conference on Interaction Design and Children, p.39-48, June 21-24, 2015, Boston, Massachusetts","paperID":"2771844"}],"reference":[{"content":"Areej Al-Wabil , Eman Meldah , Amal Al-Suwaidan , Aljohara AlZahrani, Designing Educational Games for Children with Specific Learning Difficulties: Insights from Involving Children and Practitioners, Proceedings of the 2010 Fifth International Multi-conference on Computing in the Global Information Technology, p.195-198, September 20-25, 2010","paperID":"1909929"},{"content":"Meryl Alper , Juan Pablo Hourcade , Shuli Gilutz, Adding reinforced corners: designing interactive technologies for children with disabilities, interactions, v.19 n.6, November + December 2012","paperID":"2377798"},{"content":"Armagno, G. The Role of HCI in the Construction of Disability. Proc. of HCI Ethics '12, BIS Ltd. (2012).","paperID":"None"},{"content":"Armstrong, T. Neurodiversity. Da Capo, 2010.","paperID":"None"},{"content":"Baron-Cohen, S. Autism: The Empathizing-Systemizing (E-S) Theory. Ann NY Acad Sci 1156, 1 (2009), 68--80.","paperID":"None"},{"content":"Laura Benton , Hilary Johnson , Mark Brosnan , Emma Ashwin , Beate Grawemeyer, IDEAS: an interface design experience for the autistic spectrum, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979841"},{"content":"Laura Benton , Hilary Johnson , Emma Ashwin , Mark Brosnan , Beate Grawemeyer, Developing IDEAS: supporting children with autism within a participatory design team, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208650"},{"content":"Nicholas Sheep Dalton, Neurodiversity & HCI, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468752"},{"content":"Nick S. Dalton, Neurodiversity HCI, interactions, v.20 n.2, March + April 2013","paperID":"2427091"},{"content":"Fohlin, R. Designing for Special Education Schools Involving Children with Intellectual Disabilities in the Design Process. SIDeR '13, (2013).","paperID":"None"},{"content":"Foss, E., Guha, M. L., Papadatos, P., Clegg, T., Yip, J., and Walsh, G. Cooperative Inquiry Extended: Creating Technology with Middle School Students with Learning Differences. Journal of Special Education Technology 28, 3 (2013), 33--46.","paperID":"None"},{"content":"Frauenberger, C., Good, J., and Keay-Bright, W. Designing technology for children with special needs: bridging perspectives through participatory design. CoDesign 7, 1 (2011), 1--28.","paperID":"None"},{"content":"Gibson, L., Gregor, P., and Milne, S. Case study: Designing with difficult children. Proc. IDC '02, (2002), 42--52.","paperID":"None"},{"content":"Mona Leigh Guha , Allison Druin , Jerry Alan Fails, Designing with and for children with special needs: an inclusionary model, Proceedings of the 7th international conference on Interaction design and children, June 11-13, 2008, Chicago, Illinois","paperID":"1463719"},{"content":"Guha, M. L., Druin, A., and Fails, J. A. Cooperative Inquiry revisited: Reflections of the past and guidelines for the future of intergenerational co-design. Journal of Child-Computer Interaction 1, 1 (2013), 14--23.","paperID":"None"},{"content":"Happe, F. and Vital, P. What aspects of autism predispose to talent' Phil Trans R Soc B: Biological Sciences 364, 1522 (2009), 1369--1375.","paperID":"None"},{"content":"Harder, M. K., Burford, G., and Hoover, E. What is Participation' Design Leads the Way to a CrossDisciplinary Framework. Design Issues 29, 4 (2013), 41--57.","paperID":"None"},{"content":"Kapp, S. K., Gillespie-Lynch, K., Sherman, L. E., and Hutman, T. Deficit, Difference, or Both' Autism and neurodiversity 49, 1 (2013), 59--71.","paperID":"None"},{"content":"Eija Kärnä , Jussi Nuutinen , Kaisa Pihlainen-Bednarik , Virpi Vellonen, Designing technologies with children with special needs: Children in the Centre (CiC) framework, Proceedings of the 9th International Conference on Interaction Design and Children, June 09-12, 2010, Barcelona, Spain","paperID":"1810575"},{"content":"Large, A., Nesset, V., Beheshti, J., and Bowler, L. 'Bonded design': A novel approach to intergenerational information technology design. Library & Information Science Research 28, 1 (2006), 64--82.","paperID":"None"},{"content":"Mazurek, M. O., Shattuck, P. T., Wagner, M., and Cooper, B. P. Prevalence and Correlates of Screen-Based Media Use Among Youths with Autism Spectrum Disorders. J Autism Dev Dis 42, 8 (2011), 1757--1767.","paperID":"None"},{"content":"Mesibov, G. B., Shea, V., and Schopler, E. The TEACCH approach to autism spectrum disorders. Springer, New York, 2007.","paperID":"None"},{"content":"Laura Millen , Sue Cobb , Harshada Patel, A method for involving children with autism in design, Proceedings of the 10th International Conference on Interaction Design and Children, p.185-188, June 20-23, 2011, Ann Arbor, Michigan","paperID":"1999057"},{"content":"Montgomery, D. Gifted and Talented Children with Special Educational Needs: Double Exceptionality. Routledge, 2013.","paperID":"None"},{"content":"Van Rijn, H. Meaningful encounters: Explorative studies about designers learning from children with autism. Dcotoral Thesis (2012).","paperID":"None"},{"content":"Rose, J. Identifying and Teaching Children and Young People with Dyslexia and Literacy Difficulties. 2009.","paperID":"None"},{"content":"Sanders, E. B.-N. and Stappers, P. J. Co-creation and the new landscapes of design. CoDesign 4, 1 (2008), 5--18.","paperID":"None"},{"content":"TEACCH. TEACCH Approach. 2013. http://teacch.com/about-us/what-is-teacch.","paperID":"None"},{"content":"Andy Warr , Eamonn O'Neill, Understanding design as a social creative process, Proceedings of the 5th conference on Creativity & cognition, April 12-15, 2005, London, United Kingdom","paperID":"1056242"}],"abstract":"The neurodiversity movement seeks to positively reframe certain neurological conditions, such as autism spectrum disorders (ASD) and dyslexia, by concentrating on their strengths. In recent years, neurodiverse children have increasingly been involved in the technology design process, but the design approaches adopted have focused mostly on overcoming difficulties of working with these children, leaving their strengths untapped. We present a new participatory design (PD) framework, Diversity for Design (D4D), which provides guidance for technology designers working with neurodiverse children in establishing PD methods that capitalize on children's strengths and also support potential difficulties. We present two case studies of use of the D4D framework, involving children with ASD and dyslexia, showing how it informed the development and refinement of PD methods tailored to these populations. In addition, we show how to apply the D4D framework to other neurodiverse populations.","video":"http://www.youtube.com/embed/1X3KlNX_b0A?rel=0","title":"Diversity for design: a framework for involving neurodiverse children in the technology design process","filename":"CHI14/p3747","authors":["Laura Benton","Asimina Vasalou","Rilla Khaled","Hilary Johnson","Daniel Gooch"],"conference":"CHI '14"}