{"paperId":2557228,"citation":[],"reference":[{"content":"ArcGIS Resource Center. Map the Data. ArcGIS Re-source Center, 2013. http://bit.ly/18bKiEw","paperID":"None"},{"content":"Bouma, Gerlof. Normalized (Pointwise) Mutual Infor-mation in Collocation Extraction. Proc. of the Biennial GSCL Conference, (2009), 31--40.","paperID":"None"},{"content":"Brewer, C. Guidelines for Use of the Perceptual Dimen-sions of Color for Mapping and Visualization, Proc. SPIE '94 vol. 2171 (1994), 54--6","paperID":"None"},{"content":"Michael J. Cafarella , Alon Halevy , Daisy Zhe Wang , Eugene Wu , Yang Zhang, WebTables: exploring the power of tables on the web, Proceedings of the VLDB Endowment, v.1 n.1, August 2008","paperID":"1453916"},{"content":"Alberto Cairo, The Functional Art: An introduction to information graphics and visualization, New Riders Publishing, Thousand Oaks, CA, 2012","paperID":"2432449"},{"content":"Chang, K. Introduction to Geographic Information Sys-tems. McGraw-Hill, New York, NY, 2012.","paperID":"None"},{"content":"Franklin, B. Key Concepts in Journalism Studies. SAGE Publications, London; Thousand Oaks, 2005.","paperID":"None"},{"content":"Evgeniy Gabrilovich , Susan Dumais , Eric Horvitz, Newsjunkie: providing personalized newsfeeds via analysis of information novelty, Proceedings of the 13th international conference on World Wide Web, May 17-20, 2004, New York, NY, USA","paperID":"988738"},{"content":"Griffin, J. and Stevenson, R. The Effectiveness of Loca-tor Maps in Increasing Reader Understanding of the Geography of Foreign News. Journalism & Mass Com-mun. Quarterly 71 (4) (1994), 937--946.","paperID":"None"},{"content":"Brent Hecht , Samuel H. Carton , Mahmood Quaderi , Johannes Schöning , Martin Raubal , Darren Gergle , Doug Downey, Explanatory semantic relatedness and explicit spatialization for exploratory search, Proceedings of the 35th international ACM SIGIR conference on Research and development in information retrieval, August 12-16, 2012, Portland, Oregon, USA","paperID":"2348341"},{"content":"Jeffrey Heer , Fernanda B. Viégas , Martin Wattenberg, Voyagers and voyeurs: Supporting asynchronous collaborative visualization, Communications of the ACM, v.52 n.1, January 2009","paperID":"1435439"},{"content":"Jessica Hullman , Nicholas Diakopoulos , Eytan Adar, Contextifier: automatic generation of annotated stock visualizations, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2481374"},{"content":"Jessica Hullman , Nick Diakopoulos, Visualization Rhetoric: Framing Effects in Narrative Visualization, IEEE Transactions on Visualization and Computer Graphics, v.17 n.12, p.2231-2240, December 2011","paperID":"2068623"},{"content":"Jenks, G. and Caspall, F.C. Error on Choroplethic Maps: Definition, Measurement, Reduction. Annals of the Assoc. of Amer. Geographers 61, 2 (1971), 217--244","paperID":"None"},{"content":"Eser Kandogan, Just-in-time annotation of clusters, outliers, and trends in point-based data visualizations, Proceedings of the 2012 IEEE Conference on Visual Analytics Science and Technology (VAST), p.73-82, October 14-19, 2012","paperID":"2478282"},{"content":"Nicholas Kong , Maneesh Agrawala, Perceptual interpretation of ink annotations on line charts, Proceedings of the 22nd annual ACM symposium on User interface software and technology, October 04-07, 2009, Victoria, BC, Canada","paperID":"1622219"},{"content":"Kong, N. and Agrawala, M. Graphical Overlays: Using Layered Elements to Aid Chart Reading. IEEE TVCG 18, 12 (2012), 2631--2638.","paperID":"None"},{"content":"Lev Ratinov , Dan Roth , Doug Downey , Mike Anderson, Local and global algorithms for disambiguation to Wikipedia, Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies, June 19-24, 2011, Portland, Oregon","paperID":"2002642"},{"content":"Leonhardt, D., Bostock, M., Carter, S., et al. In Climb-ing Income Ladder, Location Matters - NYTimes.com. The New York Times, 2013. http://nyti.ms/1dPGWbN.","paperID":"None"},{"content":"Lin, S., Fortuna, J., Kulkarni, C., Stone, M., and Heer, J. Selecting Semantically-Resonant Colors for Data Visu-alization.","paperID":"None"},{"content":"2Marcus, A., Wu, E., and Madden, S. Data In Context: Aiding News Consumers while Taming Dataspaces. DBCrowd 2013, (2013), 47.","paperID":"None"},{"content":"2Narrative Science. http://narrativescience.com/.","paperID":"None"},{"content":"OpenCalais, http://www.opencalais.com/","paperID":"None"},{"content":"Sandhaus, E. The New York Times Annotated Corpus. LDC, 2008. http://bit.ly/1a4ObME.","paperID":"None"},{"content":"Edward Segel , Jeffrey Heer, Narrative Visualization: Telling Stories with Data, IEEE Transactions on Visualization and Computer Graphics, v.16 n.6, p.1139-1148, November 2010","paperID":"1908000"},{"content":"Shahaf, D., Guestrin, C., and Horvitz, E. Metro maps of information. SIGWEB Newsl., 4, (2013), 1--4.","paperID":"None"},{"content":"Dafna Shahaf , Carlos Guestrin, Connecting Two (or Less) Dots: Discovering Structure in News Articles, ACM Transactions on Knowledge Discovery from Data (TKDD), v.5 n.4, p.1-31, February 2012","paperID":"2086744"},{"content":"Ben Shneiderman, The Eyes Have It: A Task by Data Type Taxonomy for Information Visualizations, Proceedings of the 1996 IEEE Symposium on Visual Languages, p.336, September 03-06, 1996","paperID":"834354"},{"content":"Slocum, T.A. and Slocum, T.A. Thematic Cartography and Geovisualization. Pearson Prentice Hall, Upper Saddle River, NJ, 2009.","paperID":"None"},{"content":"Jannik Strötgen , Michael Gertz, HeidelTime: High quality rule-based extraction and normalization of temporal expressions, Proceedings of the 5th International Workshop on Semantic Evaluation, p.321-324, July 15-16, 2010, Los Angeles, California","paperID":"1859735"},{"content":"3Tenore, M.J. Explainer Maps Locate, Contextualize and Localize News from Libya, Japan. Poynter, 2011. http://www.poynter.org/how-tos/newsgathering-storytelling/125206/explainer-maps-locate-contextualize-and-localize-news-from-libya-japan/.","paperID":"None"},{"content":"3U.S. Census Bureau. Statistical Abstract of the USA: 2012 (131st ed.) Washington, DC, 2011; http://www.census.gov/compendia/statab/.","paperID":"None"}],"abstract":"Interactive visualizations add rich, data-based context to online news articles. Geographic maps are currently the most prevalent form of these visualizations. Unfortunately, designers capable of producing high-quality, customized geovisualizations are scarce. We present NewsViews, a novel automated news visualization system that generates interactive, annotated maps without requiring professional designers. NewsViews' maps support trend identification and data comparisons relevant to a given news article. The NewsViews system leverages text mining to identify key concepts and locations discussed in articles (as well as potential annotations), an extensive repository of 'found' databases, and techniques adapted from cartography to identify and create visually 'interesting' thematic maps. In this work, we develop and evaluate key criteria in automatic, annotated, map generation and experimentally validate the key features for successful representations (e.g., relevance to context, variable selection, 'interestingness' of representation and annotation quality).","video":"http://www.youtube.com/embed/Qm43QV5CVmk?rel=0","title":"NewsViews: an automated pipeline for creating custom geovisualizations for news","filename":"CHI14/p3005","authors":["Tong Gao","Jessica R. Hullman","Eytan Adar","Brent Hecht","Nicholas Diakopoulos"],"conference":"CHI '14"}