{"paperId":2557353,"citation":[{"content":"Juan Haladjian , Zardosht Hodaie , Han Xu , Mertcan Yigin , Bernd Bruegge , Markus Fink , Juergen Hoeher, KneeHapp: a bandage for rehabilitation of knee injuries, Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers, September 07-11, 2015, Osaka, Japan","paperID":"2800909"},{"content":"Richard Tang , Xing-Dong Yang , Scott Bateman , Joaquim Jorge , Anthony Tang, Physio@Home: Exploring Visual Guidance and Feedback Techniques for Physiotherapy Exercises, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702401"},{"content":"Marilyn Lennon , Lynne Baillie , Jettie Hoonhout , Judy Robertson , Geraldine Fitzpatrick, Crossing HCI and Health: Advancing Health and Wellness Technology Research in Home and Community Settings, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702652"},{"content":"Oonagh M. Giggins , Brian Caulfield, Proposed Design Approach for an Interactive Feedback Technology Support in Rehabilitation, Proceedings of the 3rd 2015 Workshop on ICTs for improving Patients Rehabilitation Research Techniques, p.34-37, October 01-02, 2015, Lisbon, Portugal","paperID":"2838953"}],"reference":[{"content":"9th Annual Report 2012, National Joint Registry. http://www.njrcentre.org.uk/.","paperID":"None"},{"content":"Swamy Ananthanarayan , Miranda Sheh , Alice Chien , Halley Profita , Katie Siek, Pt Viz: towards a wearable device for visualizing knee rehabilitation exercises, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466161"},{"content":"Ayoade, M., Uzor, S., and Baillie, L. The Development and Evaluation of an Interactive System for Age Related Musculoskeletal Rehabilitation in the Home. Proc. INTERACT 2013, 8120 (2013), 1--18.","paperID":"None"},{"content":"Madeline Balaam , Stefan Rennick Egglestone , Geraldine Fitzpatrick , Tom Rodden , Ann-Marie Hughes , Anna Wilkinson , Thomas Nind , Lesley Axelrod , Eric Harris , Ian Ricketts , Susan Mawson , Jane Burridge, Motivating mobility: designing for lived motivation in stroke rehabilitation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979397"},{"content":"Bohannon, R. W. Reference values for the timed up and go test: a descriptive meta-analysis. Journal of Geriatric Physical Therapy 29, 2 (2006), 64--68.","paperID":"None"},{"content":"Borghese, N. A., Pirovano, M., Mainetti, R. and Lanzi, P. L. An integrated low-cost system for at-home rehabilitation. In Proc. VSMM 2012, (2012), 553--556.","paperID":"None"},{"content":"Celinder, D. and Peoples, H. Stroke patients' experiences with Wii Sports® during inpatient rehabilitation. Scandinavian Journal of Occupational Therapy 19, 5 (2012), 457--463.","paperID":"None"},{"content":"Doyle, J., Bailey, C., Dromey, B. and Scanaill, C. N. BASE - An interactive technology solution to deliver balance and strength exercises to older adults. In Proc. PervasiveHealth 2010, (2010), 1--5.","paperID":"None"},{"content":"Froimson, M. I. In-home care following total knee replacement. Cleveland Clinic Journal of Medicine 80, e-Suppl_1 (2013), 15--18.","paperID":"None"},{"content":"Fung, V., Ho, A., Shaffer, J., Chung, E. and Gomez, M. Use of Nintendo Wii FitTM in the rehabilitation of outpatients following total knee replacement: a preliminary randomised controlled trial. WCPT 98, 3 (2012), 183--188.","paperID":"None"},{"content":"Kathrin Gerling , Ian Livingston , Lennart Nacke , Regan Mandryk, Full-body motion-based game interaction for older adults, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208324"},{"content":"Harms, M. Advancing technology in rehabilitation. WCPT 98, 3 (2012), 181--182.","paperID":"None"},{"content":"Jun-Da Huang, Kinerehab: a kinect-based system for physical rehabilitation: a pilot study for young adults with motor disabilities, The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility, October 24-26, 2011, Dundee, Scotland, UK","paperID":"2049627"},{"content":"Evangelos Karapanos , John Zimmerman , Jodi Forlizzi , Jean-Bernard Martens, User experience over time: an initial framework, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518814"},{"content":"Kujala, S. User involvement: A review of the benefits and challenges. Behaviour & Information Technology 22, 1 (2003), 1--16.","paperID":"None"},{"content":"Lavernia, C. J., D'Apuzzo, M., Rossi, M. D., Lee, D. Accuracy of knee range of motion assessment after total knee arthroplasty. The Journal of Arthroplasty 23, 6 (2008), 85--91.","paperID":"None"},{"content":"Maclean, C., Deakin, A. H. and Picard, F. Is patient self-assessment of flexion after TKR able to identify risk of manipulation under anaesthesia Orthopaedics & Traumatology: Surgery & Research 98, 6 (2012), 672.","paperID":"None"},{"content":"Mizner R. L., Petterson S. C., Clements K. E., Zeni J. A., Irrgang J. J. and Snyder-Mackler L. Measuring functional improvement after total knee arthroplasty requires both performance-based and patient-report assessments. The Journal of Arthroplasty 26, 5 (2011),728--737.","paperID":"None"},{"content":"Morton, L., Baillie, L., and Ramirez-Iniguez, R. (2013, October). Pose calibrations for inertial sensors in rehabilitation applications. Proc. WiMob, (2013), 204.","paperID":"None"},{"content":"Murray, D. W., Fitzpatrick, R., Rogers, K., Pandit, H., Beard, D. J., Carr, A. J. and Dawson, J. The use of the Oxford hip and knee scores. Journal of Bone & Joint Surgery, British Volume 89-B, 8 (2007), 1010--1014.","paperID":"None"},{"content":"Noble, P. C., Gordon, M. J., Weiss, J. M., Reddix, R. N., Conditt, M. A., Mathis, K. B. Does total knee replacement restore normal knee function Clinical Orthopaedics and Related Research 431, (2005), 157--165.","paperID":"None"},{"content":"Piqueras, M., Marco, E., Coll, M., Escalada, F., Ballester, A., Cinca, C., Belmonte, R. and Muniesa, J. Effectiveness of an interactive virtual telerehabilitation system in patients after total knee arthoplasty: A randomized controlled trial. Journal of Rehabilitation Medicine 45, 4 (2013), 392--396.","paperID":"None"},{"content":"Pisters, M. F., Veenhof, C., Schellevis, F. G., Twisk, J. W. R., Dekker, J. and De Bakker, D. H. Exercise adherence improving long-term patient outcome in patients with osteoarthritis of the hip and/or knee. Arthritis Care & Research 62, 8 (2010), 1087--1094.","paperID":"None"},{"content":"Rademaker, A., Linden, S. V. der and Wiersinga, J. 2009. SilverFit, a virtual rehabilitation system. Gerontechnology 8, 2 (2009), 119.","paperID":"None"},{"content":"Russell T. G., Buttrum P., Wootton R., Jull G. A. Internet-based outpatient telerehabilitation for patients following total knee arthroplasty: a randomized controlled trial. J Bone Joint Surg 93, 2 (2011),113--120.","paperID":"None"},{"content":"Saposnik, G., Teasell, R., Mamdani, M., Hall, J., McIlroy, W., Cheung, D., Thorpe, K. E., Cohen, L. G., Bayley, M. Effectiveness of Virtual Reality Using Wii Gaming Technology in Stroke Rehabilitation: A Pilot Randomized Clinical Trial and Proof of Principle. Stroke 41, 7 (2010), 1477--1484.","paperID":"None"},{"content":"Sauro, Jeff. Measuring Usability with the System Usability Scale (SUS). http://www.measuringusability.com/sus.php.","paperID":"None"},{"content":"Scottish Arthroplasty Project Biennial Report 2012. www.arthro.scot.nhs.uk/Reports/sap_national_report_2012.pdf","paperID":"None"},{"content":"SF Health Surveys, http://www.qualitymetric.com/WhatWeDo/SFHealthSurveys/tabid/184/Default.aspx","paperID":"None"},{"content":"Silva, M., Shepherd, E. F., Jackson, W. O., Pratt, J. A., McClung, C. D., Schmalzried, T. P. Knee strength after total knee arthroplasty. J Arthroplasty 18, 5 (2003), 605--611.","paperID":"None"},{"content":"Stevens-Lapsley, J. E., Schenkman, M. L. and Dayton, M. R. Comparison of Self-Reported Knee Injury and Osteoarthritis Outcome Score to Performance Measures in Patients After Total Knee Arthroplasty. Physical Medicine and Rehabilitation 3, 6 (2011), 541--549.","paperID":"None"},{"content":"Tanaka, K., Parker, J., Baradoy, G., Sheehan, D., Holash, J. R. and Katz, L. A Comparison of Exergaming Interfaces for Use in Rehabilitation Programs and Research. Loading 6, 9 (2012), 69--81.","paperID":"None"},{"content":"Tousignant, M., Moffet, H., Boissy, P., Corriveau, H., Cabana, F. and Marquis, F. A randomized controlled trial of home telerehabilitation for post-knee arthroplasty. J. of Telemedicine and Telecare, 4 (2011).","paperID":"None"},{"content":"Stephen Uzor , Lynne Baillie , Dawn Skelton, Senior designers: empowering seniors to design enjoyable falls rehabilitation tools, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208568"},{"content":"Stephen Uzor , Lynne Baillie, Exploring & designing tools to enhance falls rehabilitation in the home, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466159"},{"content":"Yeh, S.-C., Chang, S.-M., Chen, S.-Y., Hwang, W.-Y., Huang, T.-C. and Tsai, T.-L. A lower limb fracture postoperative-guided interactive rehabilitation training system and its effectiveness analysis. Proc. Healthcom 2012, (2012), 149--154.","paperID":"None"},{"content":"Zhou and Hu, H. Human motion tracking for rehabilitation - A survey. Biomedical Signal Processing And Control 3, 1 (2008), 1--18.","paperID":"None"},{"content":"Carr, A. Barriers to the effectiveness of any intervention in OA. Best Practices and Research in Clinical Rheumatology, 15 (2001), 645--656.","paperID":"None"}],"abstract":"In this paper, we describe the design and evaluation of an interactive home-based rehabilitation visualisation system used by a wide variety of ages (users in our studies were aged from 47-89) to undertake rehabilitation in the home following knee replacement surgery. We present the rehabilitation visualization system and the results of a randomized controlled study in which we investigated the usability and feasibility of the system in the home. We found that our users were able to use the system successfully for their rehabilitation with improved rehabilitation outcomes after 6 weeks when compared to the current rehabilitation care. Finally we highlight the lessons learned which will benefit prospective designers of home rehabilitation technology in ensuring successful home evaluations in clinical rehabilitation.","video":"http://www.youtube.com/embed/R9WZyoqqEVA?rel=0","title":"A novel knee rehabilitation system for the home","filename":"CHI14/p2521","authors":["Mobolaji Ayoade","Lynne Baillie"],"conference":"CHI '14"}