{"paperId":2557174,"citation":[],"reference":[{"content":"Imaida, Takashi, et al. \"Ground-space bilateral teleoperation of ETS-VII robot arm by direct bilateral coupling under 7-s time delay condition.\" Robotics and Automation, IEEE Transactions on 20.3 (2004)","paperID":"None"},{"content":"Wilcox, Brian H. \"Robotic vehicles for planetary exploration.\" Applied Intelligence 2.2 (1992): 181--193.","paperID":"None"},{"content":"Donald A. Norman, Design rules based on analyses of human error, Communications of the ACM, v.26 n.4, p.254-258, April 1983","paperID":"358092"},{"content":"Sorensen, Khalid L., Joshua B. Spiers, and William E. Singhose. \"Operational effects of crane interface devices.\" Industrial Electronics and Applications, 2007. ICIEA 2007. 2nd IEEE Conference on. IEEE, 2007.","paperID":"None"},{"content":"International Organization for Standardization, 2011, ISO 7752/2--2011/Addendum 1 Lifting Appliances, Controls, Layout and Characteristics. Part 2: Basic Arrangement and Requirements for Mobile Cranes.","paperID":"None"},{"content":"Sheridan, Thomas B. \"Space teleoperation through time delay: review and prognosis.\" Robotics and Automation, IEEE Transactions on 9.5 (1993): 592--606.","paperID":"None"},{"content":"Bejczy, Antal K., et al. \"Role of computer graphics in space telerobotics: Preview and predictive displays.\" Fibers' 91, Boston, MA. SPIE, 1991.","paperID":"None"},{"content":"Veltman, Hans, and Arjen Oving. Augmenting camera images for operators of unmanned aerial vehicles. No. RTO-MP-088. HUMAN FACTORS RESEARCH INST TNO SOESTERBERG (NETHERLANDS), 2003.","paperID":"None"},{"content":"Thurling, Andrew J. Improving UAV handling qualities using time delay compensation. No. AFIT/GAB/ENY/00M-01. AIR FORCE INST OF TECH WRIGHT-PATTERSONAFB OH, 2000.","paperID":"None"},{"content":"de Vries, S. C. UAVs and control delays. No. TNODV3--2005-A054. TNO DEFENCE SECURITY AND SAFETY SOESTERBERG (NETHERLANDS), 2005.","paperID":"None"},{"content":"Kenton P. O'Hara , Stephen J. Payne, Planning and the user interface: the effects of lockout time and error recovery cost, International Journal of Human-Computer Studies, v.50 n.1, p.41-59, Jan. 1999","paperID":"308321"},{"content":"J. Corde Lane , Craig R. Carignan , David L. Akin, Advanced Operator Interface Design for Complex Space Telerobots, Autonomous Robots, v.11 n.1, p.49-58, July 2001","paperID":"591868"},{"content":"Alan J. Dix, The myth of the infinitely fast machine, Proceedings of Third Conference of the British Computer Society Human-Interactio on People and computers III, p.215-228, February 1988, Univ. of Exeter, Exeter, United Kingdom","paperID":"43173"},{"content":"Aaron Steinfeld , Terrence Fong , David Kaber , Michael Lewis , Jean Scholtz , Alan Schultz , Michael Goodrich, Common metrics for human-robot interaction, Proceedings of the 1st ACM SIGCHI/SIGART conference on Human-robot interaction, March 02-03, 2006, Salt Lake City, Utah, USA","paperID":"1121249"},{"content":"Steinfeld, Aaron. \"Interface lessons for fully and semiautonomous mobile robots.\" Robotics and Automation, 2004. Proceedings. ICRA'04. 2004 IEEE International Conference on. Vol. 3. IEEE, 2004.","paperID":"None"},{"content":"Niemeyer, Günter, and Jean-Jacques E. Slotine. \"Telemanipulation with time delays.\" The International Journal of Robotics Research 23.9 (2004): 873--890.","paperID":"None"},{"content":"Richard Held , Nathaniel Durlach, Telepresence, time delay and adaptation, Pictorial communication in virtual and real environments, Taylor & Francis, Inc., Bristol, PA, 1991","paperID":"109375"},{"content":"J. Y.C. Chen , E. C. Haas , M. J. Barnes, Human Performance Issues and User Interface Design for Teleoperated Robots, IEEE Transactions on Systems, Man, and Cybernetics, Part C: Applications and Reviews, v.37 n.6, p.1231-1245, November 2007","paperID":"2221066"},{"content":"Kaber, David B., et al. \"Effects of visual interface design, and control mode and latency on performance, telepresence and workload in a teleoperation task.\" Proceedings of the Human Factors and Ergonomics Society Annual Meeting. Vol. 44. No. 5. SAGE Publications, 2000","paperID":"None"}],"abstract":"Many tasks call for efficient user interaction under time delay-controlling space instruments, piloting remote aircraft and operating search and rescue robots. In this paper we identify an underexplored design opportunity for building robotic teleoperation user interfaces following an evaluation of operator performance during a time-delayed robotic arm block-stacking task in twenty-two participants. More delay resulted in greater operator hesitation and a decreased ratio of active to inactive input. This ratio can serve as a useful proxy for measuring an operator's ability to anticipate the outcome of their control inputs before receiving delayed visual feedback. High anticipatory input ratio (AIR) scores indicate times when robot operators enter commands before waiting for visual feedback. Low AIR scores highlight when operators must wait for visual feedback before continuing. We used this measurement to help us identify particular sub-tasks where operators would likely benefit from additional support.","video":"http://www.youtube.com/embed/Ewcm0bxeGw8?rel=0","title":"Measuring operator anticipatory inputs in response to time-delay for teleoperated human-robot interfaces","filename":"CHI14/p1467","authors":["Jonathan Bidwell","Alexandra Holloway","Scott Davidoff"],"conference":"CHI '14"}