{"paperId":2557216,"reference":[{"content":"Ahn, W. and Kalish, C.W. The role of mechanism beliefs in causal reasoning. Explanation and cognition, (2000), 199--225.","paperID":"None"},{"content":"Apple Computer, Inc., Macintosh human interface guidelines, Addison-Wesley Publishing Company, 1992","paperID":"573097"},{"content":"Michel Beaudouin-Lafon , Wendy E. Mackay, Reification, polymorphism and reuse: three principles for designing visual interfaces, Proceedings of the working conference on Advanced visual interfaces, p.102-109, May 2000, Palermo, Italy","paperID":"345267"},{"content":"Michel Beaudouin-Lafon, Designing interaction, not interfaces, Proceedings of the working conference on Advanced visual interfaces, May 25-28, 2004, Gallipoli, Italy","paperID":"989865"},{"content":"Alan F. Blackwell, The reification of metaphor as a design tool, ACM Transactions on Computer-Human Interaction (TOCHI), v.13 n.4, p.490-530, December 2006","paperID":"1188820"},{"content":"Choi, H. and Scholl, B.J. Effects of grouping and attention on the perception of causality. Perception & psychophysics 66, 6 (2004), 926--42.","paperID":"None"},{"content":"Fernbach, P.M. and Darlow, A. Causal Conditional Reasoning and Conditional Likelihood. Proceedings of the 32nd annual meeting of the Cognitive Science Society, (2009), 1088--1093.","paperID":"None"},{"content":"Goldin, G. and Darlow, A. TurkGate. {Software}, 2013. http://gideongoldin.github.com/TurkGate/.","paperID":"None"},{"content":"Harré, R. and Madden, E.H. Causal powers: A theory of natural necessity. Rowman and Littlefield, 1975.","paperID":"None"},{"content":"Heathcote, A., Brown, S., and Mewhort, D.J.K. The power law repealed: The case for an exponential law of practice. Psychonomic Bulletin & Review 7, 2 (2000), 185--207.","paperID":"None"},{"content":"Edwin L. Hutchins , James D. Hollan , Donald A. Norman, Direct manipulation interfaces, Human-Computer Interaction, v.1 n.4, p.311-338, December 1985","paperID":"1453235"},{"content":"Hiroshi Ishii, Tangible bits: beyond pixels, Proceedings of the 2nd international conference on Tangible and embedded interaction, February 18-20, 2008, Bonn, Germany","paperID":"1347392"},{"content":"Robert J.K. Jacob , Audrey Girouard , Leanne M. Hirshfield , Michael S. Horn , Orit Shaer , Erin Treacy Solovey , Jamie Zigelbaum, Reality-based interaction: a framework for post-WIMP interfaces, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357089"},{"content":"Lagnado, D.A. and Sloman, S.A. Time as a guide to cause. Journal of Experimental Psychology: 32, 3 (2006), 451.","paperID":"None"},{"content":"Michotte, A. and Miles, T.R. The perception of causality. Methuen London, Oxford, England, 1963.","paperID":"None"},{"content":"MOCHON, D. and SLOMAN, S.A. Causal models frame interpretation of mathematical equations. Psychon Bull Rev 11, 6 (2004), 1099--1104.","paperID":"None"},{"content":"Shneiderman, B. Direct manipulation: a step beyond programming languages. Sparks of Innovation in Human-Computer Interaction 08, (1993), 57.","paperID":"None"},{"content":"Tversky, A. and Kahneman, D. Judgment under uncertainty: Heuristics and biases. Science 185, 4157 (1974), 1124.","paperID":"None"},{"content":"White, P.A. A theory of casual processing. British Journal of Psychology, 4 (1989), 431.","paperID":"None"}],"citation":[],"abstract":"In this paper we present two design guidelines, causal order and continuity, to be used as rules of thumb for designing intuitive interactions based on principles of causal reasoning. We propose that designing interactions to behave like real-world systems of cause and effect makes them more intuitive. Using these basic principles avoids the limitations inherent to specific metaphors. In three experiments, participants solved puzzles using variations of a novel graphical interface. Participants using interfaces that were consistent with the causal guidelines consistently solved the puzzle faster than participants using inconsistent interfaces. We also discuss common interactions already consistent with the causal guidelines as well as areas where the guidelines are likely to apply successfully. The causal order guidelines provide specific utility while also demonstrating how principles of causal psychology can be applied to help interface designers better convey the functionality of their interfaces.","video":"http://www.youtube.com/embed/ChCWNjlyowc?rel=0","title":"Causal interactions","filename":"CHI14/p1655","authors":["Adam Darlow","Gideon Goldin","Steven Sloman"],"conference":"CHI '14"}