{"paperId":2557317,"citation":[{"content":"Günter Wallner , Simone Kriglstein, An introduction to gameplay data visualization, Game Research Methods, ETC Press, Pittsburgh, PA, 2015","paperID":"2812792"}],"reference":[{"content":"Martin Ashton , Clark Verbrugge, Measuring cooperative gameplay pacing in World of Warcraft, Proceedings of the 6th International Conference on Foundations of Digital Games, p.77-83, June 29-July 01, 2011, Bordeaux, France","paperID":"2159376"},{"content":"Jonathan Bell , Swapneel Sheth , Gail Kaiser, A large-scale, longitudinal study of user profiles in world of warcraft, Proceedings of the 22nd international conference on World Wide Web companion, May 13-17, 2013, Rio de Janeiro, Brazil","paperID":"2488146"},{"content":"Brian Bowman , Niklas Elmqvist , T. J. Jankun-Kelly, Toward Visualization for Games: Theory, Design Space, and Patterns, IEEE Transactions on Visualization and Computer Graphics, v.18 n.11, p.1956-1968, November 2012","paperID":"2377450"},{"content":"Cleveland, W. S., and McGill, R. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American Statistical Association 79, 387 (1984), 531--554.","paperID":"None"},{"content":"Anders Drachen , Alessandro Canossa, Analyzing spatial user behavior in computer games using geographic information systems, Proceedings of the 13th International MindTrek Conference: Everyday Life in the Ubiquitous Era, September 30-October 02, 2009, Tampere, Finland","paperID":"1621875"},{"content":"Gove, R., Gramsky, N., Kirby, R., Sefer, E., Sopan, A., Dunne, C., Shneiderman, B., and Taieb-Maimon, M. Netvisia: Heat map & matrix visualization of dynamic social network statistics & content. In Prof. of SocialCom/PASSAT'11, IEEE Press (2011), 19--26.","paperID":"None"},{"content":"Scott Grant , Buddy Betts, Encouraging user behaviour with achievements: an empirical study, Proceedings of the 10th Working Conference on Mining Software Repositories, May 18-19, 2013, San Francisco, CA, USA","paperID":"2487101"},{"content":"Heyer, L. J., Kruglyak, S., and Yooseph, S. Exploring expression data: Identification and analysis of coexpressed genes. Genome Research 9, 11 (1999), 1106--1115.","paperID":"None"},{"content":"Jakobsson, M. The achievement machine: understanding Xbox 360 achievements in gaming practices. Game Studies 11, 1 (2011), 1--22.","paperID":"None"},{"content":"Kosslyn, S. M. Graph Design for the Eye and Mind. Oxford University Press, 2006.","paperID":"None"},{"content":"Medler, B. Play with data - an exploration of play analytics and its effect on player experiences. PhD thesis, Georgia Tech, 2012.","paperID":"None"},{"content":"Medler, B., and Magerko, B. Analytics of play: Using information visualization and gameplay practices for visualizing video game data. Parsons Journal for Information Mapping 3, 1 (2011), 1--12.","paperID":"None"},{"content":"Jakob Nielsen , Kara Pernice, Eyetracking Web Usability, New Riders Publishing, Thousand Oaks, CA, 2009","paperID":"1823564"},{"content":"Pileggi, H., Stolper, C. D., Boyle, J. M., and Stasko, J. T. Snapshot: Visualization to propel ice hockey analytics. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2819--2828.","paperID":"None"},{"content":"Rasmussen, J. Skills, rules, and knowledge; signals, signs, and symbols, and other distinctions in human performance models. IEEE Transactions on Systems, Man and Cybernetics SMC-13, 3 (1983), 257--266.","paperID":"None"},{"content":"Purvi Saraiya , Chris North , Karen Duca, An Evaluation of Microarray Visualization Tools for Biological Insight, Proceedings of the IEEE Symposium on Information Visualization, p.1-8, October 10-12, 2004","paperID":"1038775"},{"content":"Magy Seif El-Nasr , Anders Drachen , Alessandro Canossa, Game Analytics: Maximizing the Value of Player Data, Springer Publishing Company, Incorporated, 2013","paperID":"2484637"},{"content":"Shamoon, E. How Call of Duty Elite evolved. http://www.polygon.com/2012/11/27/3682896/how-call-of-duty-elite-evolved, Accessed: September, 2013.","paperID":"None"},{"content":"Spence, I. No humble pie: The origins and usage of a statistical chart. Journal of Educational and Behavioral Statistics 30, 4 (2005), 353--368.","paperID":"None"},{"content":"Spence, I., and Lewandowsky, S. Displaying proportions and percentages. Applied Cognitive Psychology 5, 1 (1991), 61--77.","paperID":"None"},{"content":"Thompson, C. Halo 3: How Microsoft Labs invented a new science of play. http://www.wired.com/gaming/virtualworlds/magazine/15-09/ff_halo, Accessed: September, 2013.","paperID":"None"},{"content":"Valve Corporation. Half-life 2: Episode two stats. http://www.steampowered.com/status/ep2/ep2_stats.php, Accessed: September, 2013.","paperID":"None"},{"content":"Peter Vorderer , Tilo Hartmann , Christoph Klimmt, Explaining the enjoyment of playing video games: the role of competition, Proceedings of the second international conference on Entertainment computing, p.1-9, May 08-10, 2003, Pittsburgh, Pennsylvania","paperID":"958735"},{"content":"Wallner, G. Play-graph: A methodology and visualization approach for the analysis of gameplay data. In Proc. of FDG'13 (2013).","paperID":"None"},{"content":"Wallner, G., and Kriglstein, S. Visualization-based analysis of gameplay data - a review of literature. Entertainment Computing 4, 3 (2013), 143--155.","paperID":"None"},{"content":"Zoeller, G. Development telemetry in video games projects. In Game Developer Conference (2010).","paperID":"None"}],"abstract":"With the rising interest in multiplayer gaming, gameplay statistics have become an increasingly important aspect of the overall game experience for many players. As a part of this trend, visualizations have gained great popularity among players, in particular heatmaps since they allow them to reenact the course of a game and to develop new strategies. In this paper we report results of a user study conducted with 29 players (i) to investigate how players use heatmaps and two further graphical representations that use clustering algorithms to interpret gameplay and (ii) to assess the three representations in regard to time efficiency, correctness, suitability, and player preference. Our results show that heatmaps were mainly used to detect hot spots while the cluster representations proved useful to compare variables, allowing the players to uncover relationships between them and in turn allowing a deeper insight into the gameplay data.","video":"http://www.youtube.com/embed/3xdR7tmwQNI?rel=0","title":"A user study of different gameplay visualizations","filename":"CHI14/p361","authors":["Simone Kriglstein","Günter Wallner","Margit Pohl"],"conference":"CHI '14"}