{"paperId":2557140,"reference":[{"content":"Adam Acar , Yuya Muraki, Twitter for crisis communication: lessons learned from Japan's tsunami disaster, International Journal of Web Based Communities, v.7 n.3, p.392-402, July 2011","paperID":"2007298"},{"content":"Karine Barzilai-Nahon, Toward a theory of network gatekeeping: A framework for exploring information control, Journal of the American Society for Information Science and Technology, v.59 n.9, p.1493-1512, July 2008","paperID":"1388329"},{"content":"Bergstrom, Kelly. 2011. \"Don't Feed the Troll\": Shutting down Debate About Community Expectations on reddit.com.\" First Monday; 8(1).","paperID":"None"},{"content":"Bruns, Axel, Jean E. Burgess, Kate Crawford, and Frances Shaw. 2012. \"#qldfloods and @QPSMedia: Crisis Communication on Twitter in the 2011 South East Queensland Floods.\" In Brisbane QLD Australia: ARC Centre of Excellence for Creative Industries and Innovation, Queensland University of Technology.","paperID":"None"},{"content":"Moira Burke , Cameron Marlow , Thomas Lento, Feed me: motivating newcomer contribution in social network sites, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518847"},{"content":"Chen, Brian. 2012. \"How Reddit Scooped the Press on the Aurora Shootings.\" The New York Times. Retrieved from http://bits.blogs.nytimes.com/2012/07/23/redditaurora-shooter-aff/","paperID":"None"},{"content":"Chew, Cynthia, and Gunther Eysenbach. 2010. \"Pandemics in the Age of Twitter: Content Analysis of Tweets During the 2009 H1N1 Outbreak.\" PLoS ONE 5 (11).","paperID":"None"},{"content":"Eric Gilbert, Widespread underprovision on Reddit, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441866"},{"content":"Goode, Luke. 2009. \"Social News, Citizen Journalism and Democracy.\" New Media & Society 11 (8) (December 1): 1287--1305.","paperID":"None"},{"content":"Hughes, Amanda Lee, and Leysia Palen. 2009. \"Twitter Adoption and Use in Mass Convergence and Emergency Events.\" International Journal of Emergency Management 6 (3): 248--260.","paperID":"None"},{"content":"Iyengar, Shanto. 1994. Is Anyone Responsible?: How Television Frames Political Issues. Reprint. University Of Chicago Press.","paperID":"None"},{"content":"Brian Keegan , Darren Gergle, Egalitarians at the gate: one-sided gatekeeping practices in social media, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718943"},{"content":"Keegan, Brian, Darren Gergle, and Noshir Contractor. 2013. \"Hot Off the Wiki: Structures and Dynamics of Wikipedia's Coverage of Breaking News Events.\" American Behavioral Scientist Forthcoming.","paperID":"None"},{"content":"Cliff Lampe , Nicole B. Ellison , Charles Steinfield, Changes in use and perception of facebook, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460675"},{"content":"Cliff Lampe , Erik Johnston, Follow the (slash) dot: effects of feedback on new members in an online community, Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work, November 06-09, 2005, Sanibel Island, Florida, USA","paperID":"1099206"},{"content":"Cliff Lampe , Paul Resnick, Slash(dot) and burn: distributed moderation in a large online conversation space, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.543-550, April 24-29, 2004, Vienna, Austria","paperID":"985761"},{"content":"Lerman, Kristina, and Rumi Ghosh. 2010. \"Information Contagion: An Empirical Study of the Spread of News on Digg and Twitter Social Networks.\" Proceedings of 4th International Conference on Weblogs and Social Media (March 12).","paperID":"None"},{"content":"Lewin, Kurt. 1943. \"The Forces Behind Food Habits and Methods of Change.\" In The Problem of Changing Food Habits Report of the Committee on Food Habits 1941--1943. The National Academies Press.","paperID":"None"},{"content":"Long, J. Scott, and Jeremy Freese. 2005. Regression Models for Categorical Dependent Variables Using Stata, Second Edition. 2nd ed. Stata Press.","paperID":"None"},{"content":"Lotan, Gilad, Erhardt Graeff, Mike Ananny, Devin Gaffney, Ian Pearce, and danah boyd. 2011. \"The Revolutions Were Tweeted: Information Flows During the 2011 Tunisian and Egyptian Revolutions.\" International Journal of Communication 5.","paperID":"None"},{"content":"Martin, Erik. 2012. \"2 Billion & Beyond.\" Blog.reddit. http://blog.reddit.com/2012/01/2-billion-beyond.html.","paperID":"None"},{"content":"Marwick, Alice E., and danah boyd. 2011. \"I Tweet Honestly, I Tweet Passionately: Twitter Users, Context Collapse, and the Imagined Audience.\" New Media & Society 13 (1): 114--133.","paperID":"None"},{"content":"Muchnik, Lev, Sinan Aral, and Sean J. Taylor. 2013. \"Social Influence Bias: A Randomized Experiment.\" Science 341 (6146): 647--651.","paperID":"None"},{"content":"Leysia Palen , Sarah Vieweg , Sophia B. Liu , Amanda Lee Hughes, Crisis in a Networked World, Social Science Computer Review, v.27 n.4, p.467-480, November  2009","paperID":"1640514"},{"content":"Poor, Nathaniel. 2005. \"Mechanisms of an Online Public Sphere: The Website Slashdot.\" Journal of Computer-Mediated Communication 10 (2).","paperID":"None"},{"content":"Roberts, Chris. 2005. \"Gatekeeping Theory: An Evolution.\" Paper presented at the Annual Meeting of the Association for Education in Journalism and Mass Communication, San Antonio, TX.","paperID":"None"},{"content":"Scellato, Salvatore, and Cecilia Mascolo. 2011. \"Measuring User Activity on an Online Location-based Social Network.\" In 2011 IEEE Conference on Computer Communications Workshops (INFOCOM WKSHPS), 918--923.","paperID":"None"},{"content":"Scheufele, Dietram A. 1999. \"Framing as a Theory of Media Effects.\" Journal of Communication 49 (1): 103--122.","paperID":"None"},{"content":"Schultz, Friederike, Sonja Utz, and Anja Göritz. 2011. \"Is the Medium the Message' Perceptions of and Reactions to Crisis Communication via Twitter, Blogs and Traditional Media.\" Public Relations Review 37 (1): 20--27.","paperID":"None"},{"content":"Shaw, Aaron. 2012. \"Centralized and Decentralized Gatekeeping in an Open Online Collective.\" Politics & Society 40 (3): 349--388.","paperID":"None"},{"content":"Irina Shklovski , Leysia Palen , Jeannette Sutton, Finding community through information and communication technology in disaster response, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460584"},{"content":"Bongwon Suh , Lichan Hong , Peter Pirolli , Ed H. Chi, Want to be Retweeted? Large Scale Analytics on Factors Impacting Retweet in Twitter Network, Proceedings of the 2010 IEEE Second International Conference on Social Computing, p.177-184, August 20-22, 2010","paperID":"1907388"}],"citation":[{"content":"Alex Leavitt, Doctoral Colloquium -- Open-Source Culture: The Production & Politics of Distributed Creative Peer Production, Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2699325"},{"content":"Georgios Rizos , Symeon Papadopoulos , Yiannis Kompatsiaris, Predicting News Popularity by Mining Online Discussions, Proceedings of the 25th International Conference Companion on World Wide Web, April 11-15, 2016, Montréal, Québec, Canada","paperID":"2890096"},{"content":"Daejin Choi , Jinyoung Han , Taejoong Chung , Yong-Yeol Ahn , Byung-Gon Chun , Ted Taekyoung Kwon, Characterizing Conversation Patterns in Reddit: From the Perspectives of Content Properties and User Participation Behaviors, Proceedings of the 2015 ACM on Conference on Online Social Networks, November 02-03, 2015, Palo Alto, California, USA","paperID":"2817959"},{"content":"Alexandra Olteanu , Sarah Vieweg , Carlos Castillo, What to Expect When the Unexpected Happens: Social Media Communications Across Crises, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675242"},{"content":"Alex Leavitt, \"This is a Throwaway Account\": Temporary Technical Identities and Perceptions of Anonymity in a Massive Online Community, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675175"},{"content":"Muhammad Imran , Carlos Castillo , Fernando Diaz , Sarah Vieweg, Processing Social Media Messages in Mass Emergency: A Survey, ACM Computing Surveys (CSUR), v.47 n.4, p.1-38, July 2015","paperID":"2771588"}],"abstract":"This paper uses the case of Hurricane Sandy and reddit's topical community (subreddit) /r/sandy to examine the production and curation of news content around events on a social news site. Through qualitative analysis, we provide a coded topology of produced content and describe how types of networked gatekeeping impact the framing of a crisis situation. This study also examines, through quantitative modeling, what kind of information becomes negotiated and voted as relevant. We suggest that highly scored content shared in a social news setting focused more on human-interest media and perspective-based citizen journalism than professional news reports. We conclude by discussing how the mechanisms of social news sites conflict with the social norms and culture of reddit to produce differing expectations around news.","video":"http://www.youtube.com/embed/3PNCIypJf2g?rel=0","title":"Upvoting hurricane Sandy: event-based news production processes on a social news site","filename":"CHI14/p1495","authors":["Alex Leavitt","Joshua A. Clark"],"conference":"CHI '14"}