{"paperId":2557205,"citation":[],"abstract":"Early literacy is critical to child development, and determines a child's later educational and life opportunities. Moreover, preschool children are incessantly inquisitive, and will readily engage in question answering and asking activities if given the opportunity. We argue here that question asking/answering technologies can play a major role in early literacy. We describe the design and evaluation of a conversational agent called Spot, with the goal of engaging children in a 20-questions game. Towards this goal, we conducted a feasibility study to determine if children's questions are \"on-topic\" and suitable for ASR/dialogue systems. We evaluated Spot's performance at conducting a game of 20-questions against that of a human partner.","reference":[{"content":"Abu Shawar, B. and E. Atwell, Fostering language learner autonomy via adaptive conversation tutors, in Corpus Linguistics. 2007: Birmingham, UK.","paperID":"None"},{"content":"Aleven, V., K. Koedinger, and K. Cross, Tutoring Answer Explanation Fosters Learning with Understanding, in Artificial Intelligence in Education. 1999, IOS Press: Amsterdam. p. 199--206.","paperID":"None"},{"content":"Apple Siri: http://www.apple.com/ios/siri/. (Last accessed: Sept 19, 2012)","paperID":"None"},{"content":"Amy L. Baylor , Yanghee Kim, Simulating Instructional Roles through Pedagogical Agents, International Journal of Artificial Intelligence in Education, v.15 n.2, p.95-115, April 2005","paperID":"1434927"},{"content":"Boyarskaya, E., Hecht, H., \"The Mona Lisa effect: Is it confined to the horizontal plane?\" Perception 38 ECVP, 2009.","paperID":"None"},{"content":"Byrd, D., van der Veen, T., McNamara, J. & Berg, W. Preschoolers Don't Practice What They Preach: Preschoolers' Planning Performances With Manual and Spoken Response Requirements, Journal of Cognition and Development, 5:4, 427--449, 2004.","paperID":"None"},{"content":"Callanan, M. and Oakes, L. Preschoolers' questions and parents' explanations: Causal thinking in everyday activity. Cognitive Development, 7:213--233, 1992.","paperID":"None"},{"content":"Chouinard, M. M. Childrens questions: A mechanism for cognitive development. Monographs of the Society for Research in Child Development, 72 (1, Serial No. 286), 2007.","paperID":"None"},{"content":"Clarebout, G., Elen, J., Johnson, W. L., and Shaw, E. Animated pedagogical agents. An opportunity to be grasped' Journal of Educational Multimedia and Hypermedia, 11, 267--286, 2002.","paperID":"None"},{"content":"De Pietro, O. and G. Frontera, TutorBot: an application AIML based for Web-Learning. Advanced Technology for Learning, 2005. 2(1): p. 29--34.","paperID":"None"},{"content":"Pierre Dillenbourg , John A. Self, People Power: A Human-Computer Collaborative Learning System, Proceedings of the Second International Conference on Intelligent Tutoring Systems, p.651-660, June 10-12, 1992","paperID":"744827"},{"content":"Donghui Feng , Erin Shaw , Jihie Kim , Eduard Hovy, An intelligent discussion-bot for answering student queries in threaded discussions, Proceedings of the 11th international conference on Intelligent user interfaces, January 29-February 01, 2006, Sydney, Australia","paperID":"1111488"},{"content":"Frazier, B., Gelman, S., and Wellman, H.. Preschoolers' search for explanatory information within adult-child conversation. Child Development, 80:1592--1611, 2009.","paperID":"None"},{"content":"Fryer, L. and Carpenter, R., Bots as Language Learning Tools. Language Learning and Technology, 2006. 10(3): p. 8--14.","paperID":"None"},{"content":"Goffin, V., Allauzen, C., Bocchieri, E., Hakkani-Tr, D., Ljolje, A., Parthasarathy, S., Rahim, M., Riccardi, G., and Saraclar, M., \"The AT&T WATSON speech recognizer,\" in Proceedings of IEEE ICASSP-2005, Philadelphia, PA, USA, 2005.","paperID":"None"},{"content":"Graesser, A. C., N. K. Person, and D. Harter, Teaching Tactics and Dialog in AutoTutor. International Journal of Artificial Intelligence in Education, 2001. 12: p. 23--39.","paperID":"None"},{"content":"Grigoriadou, M., Tsaganou, G., and Cavoura, T., Dialogue-Based Reflective System for Historical Text Comprehension, in Workshop on Learner Modelling for Reflection at Artificial Intelligence in Education. 2003.","paperID":"None"},{"content":"Hart, B. and Risley, T. Meaningful Differences in the Everyday Experience of Young American Children, Paul H. Brookes, 1995.","paperID":"None"},{"content":"Heffernan, N. T., Web-Based Evaluations Showing both Cognitive and Motivational Benefits of the Ms. Lindquist Tutor, in Artificial Intelligence in Education. 2003, IOS Press: Amsterdam. p. 115--122.","paperID":"None"},{"content":"Alice Kerly , Richard Ellis , Susan Bull, CALMsystem: A Conversational Agent for Learner Modelling, Knowledge-Based Systems, v.21 n.3, p.238-246, April, 2008","paperID":"1349944"},{"content":"Koda, T. and Maes, P. Agents with faces: The effect of personification. In the 5th IEEE international workshop on Robot and Human Communication, 1996, pp. 189--194.","paperID":"None"},{"content":"Kramer, N. C.: Psychological Research on Embodied Conversational Agents: The Case of Pedagogical Agents. Journal of Media Psychology 2010. Vol 22(2): p. 47--51.","paperID":"None"},{"content":"James C. Lester , Brian A. Stone , Gary D. Stelling, Lifelike Pedagogical Agents for Mixed-initiative Problem Solving in Constructivist Learning Environments, User Modeling and User-Adapted Interaction, v.9 n.1-2, p.1-44, April 1999","paperID":"598325"},{"content":"Lowood, H. High-performance play: The making of machinima. In A. Clarke & G. Mitchell (Eds.), Videogames and art: Intersections and interactions. London: Intellect.","paperID":"None"},{"content":"Luckin, R., Connolly, D., Plowman, L., and Airey, S. With a little help from my friends: children's interactions with interactive toy technology. Journal of Computer Assisted Learning, Special issue on Children and Technology: 165--176, 2003.","paperID":"None"},{"content":"Makela, K., Salonen, E. and Raisamo, R. Conducting a wizard of oz experiment on a ubiquitous computing system doorman. In Proceedings of the International Workshop on Information Presentation and Natural Multimodal Dialogue, pages 115--119, 2001.","paperID":"None"},{"content":"McNeil, D. l., Hand and Mind: The University of Chicago Press, Chicago IL, 1992.","paperID":"None"},{"content":"NELP: National Early Literacy Panel (2008) Developing Early Literacy, National Institute for Literacy (NIFL), available from site www.nifl.gov","paperID":"None"},{"content":"NFCL: National Family Literacy Organization, main site www.famlit.org","paperID":"None"},{"content":"NIH: Clear Communication: An NIH Health Literacy Initiative http://www.nih.gov/clearcommunication/healthliteracy.htm","paperID":"None"},{"content":"Diana Perez-Marin , Ismael Pascual-Nieto, Conversational Agents and Natural Language Interaction: Techniques and Effective Practices, Information Science Reference - Imprint of: IGI Publishing, Hershey, PA, 2011","paperID":"2031487"},{"content":"S-voice: http://www.samsung.com/global/galaxys3/ (Last accessed: Sept 19, 2012).","paperID":"None"},{"content":"Erin Shaw , W. Lewis Johnson , Rajaram Ganeshan, Pedagogical agents on the Web, Proceedings of the third annual conference on Autonomous Agents, p.283-290, April 1999, Seattle, Washington, USA","paperID":"301210"},{"content":"Taylor, K. and Moore, S., Adding Question Answering to an E-Tutor for Programming Languages, in AI-2006, 26th SGAI International Conference on Innovative Techniques and Applications of Artificial Intelligence. 2006, Springer: Cambridge, UK. p. 193--206.","paperID":"None"},{"content":"Tewari, A., Brown, T., & Canny, J. (2013, January). A Question-answering Agent Using Speech Driven Non-linear Machinima. In Intelligent Virtual Agents (pp. 129--138). Springer Berlin Heidelberg.","paperID":"None"},{"content":"Watson, AT&T: http://www.research.att.com/projects/WATSON. (Last accessed: Sept 19, 2012).","paperID":"None"},{"content":"Wood, D. Scaffolding, contingent tutoring and computer-supported learning. International Journal of Artificial Intelligence in Education, 12:280--292, 2001.","paperID":"None"},{"content":"Svetlana Yarosh , Stephen Cuzzort , Hendrik Müller , Gregory D. Abowd, Developing a media space for remote synchronous parent-child interaction, Proceedings of the 8th International Conference on Interaction Design and Children, June 03-05, 2009, Como, Italy","paperID":"1551806"},{"content":"Svetlana Yarosh , Kori M. Inkpen , A.J. Bernheim Brush, Video playdate: toward free play across distance, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753514"}],"title":"What did spot hide?: a question-answering game for preschool children","filename":"CHI14/p1807","authors":["Anuj Tewari","John Canny"],"conference":"CHI '14"}