{"paperId":2557268,"citation":[{"content":"Temitayo A. Olugbade , M.S. Hane Aung , Nadia Bianchi-Berthouze , Nicolai Marquardt , Amanda C. Williams, Bi-Modal Detection of Painful Reaching for Chronic Pain Rehabilitation Systems, Proceedings of the 16th International Conference on Multimodal Interaction, November 12-16, 2014, Istanbul, Turkey","paperID":"2663261"},{"content":"Sergio Felipe , Aneesha Singh , Caroline Bradley , Amanda CdeC Williams , Nadia Bianchi-Berthouze, Roles for personal informatics in chronic pain, Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare, p.161-168, May 20-23, 2015, Istanbul, Turkey","paperID":"2826189"},{"content":"M. S. H. Aung , N. Bianchi-Berthouze , P. Watson , A. C. de C. Williams, Automatic recognition of fear-avoidance behavior in chronic pain physical rehabilitation, Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare, May 20-23, 2014, Oldenburg, Germany","paperID":"2686916"},{"content":"Daniel Harrison , Paul Marshall , Nadia Bianchi-Berthouze , Jon Bird, Activity tracking: barriers, workarounds and customisation, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2805832"},{"content":"Olivier A. Blanson Henkemans , Pepijn van Empelen , Geerte L. Paradies , Rosemarijn Looije , Mark A. Neerincx, Lost in persuasion: a multidisciplinary approach for developing usable, effective, and reproducible persuasive technology for health promotion, Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare, p.49-56, May 20-23, 2015, Istanbul, Turkey","paperID":"2826173"},{"content":"Ana Tajadura-Jiménez , Maria Basia , Ophelia Deroy , Merle Fairhurst , Nicolai Marquardt , Nadia Bianchi-Berthouze, As Light as your Footsteps: Altering Walking Sounds to Change Perceived Body Weight, Emotional State and Gait, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702374"}],"reference":[{"content":"Aung, M. S. H., Romera-Paredes, B., Singh, A., Lim, S., Kanakam, N., CdeC Williams, A., Bianchi-Berthouze, N. Getting rid of pain-related behaviour to improve social and self perception: a technology-based perspective. Proc. WIAMIS'13, IEEE Press (2013).","paperID":"None"},{"content":"Cepeda, M., Carr, D., Lau, J. Music for pain relief. Database Syst Rev, (2006).","paperID":"None"},{"content":"Sunny Consolvo , James A. Landay , David W. McDonald, Designing for Behavior Change in Everyday Life, Computer, v.42 n.6, p.86-89, June 2009","paperID":"1591988"},{"content":"Crombez, G., Eccleston, C., Van Damme, S., Vlaeyen, J. W. S., and Karoly, P. Fear-avoidance model of chronic pain: the next generation. The Clinical journal of pain 28, 6 (2012), 475--483.","paperID":"None"},{"content":"Gatchel, R. J., Peng, Y. B., Peters, M. L., Fuchs, P. N., and Turk, D. C. The biopsychosocial approach to chronic pain: scientific advances and future directions. Psychological bulletin 133, 4 (2007), 581--624.","paperID":"None"},{"content":"Gerling, K., Livingston, I., Nacke, L., and Mandryk, R. Proc. CHI '12. ACM Press (2012), 1873.","paperID":"None"},{"content":"Luc Geurts , Vero Vanden Abeele , Jelle Husson , Frederik Windey , Maarten Van Overveldt , Jan-Henk Annema , Stef Desmet, Digital games for physical therapy: fulfilling the need for calibration and adaptation, Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction, January 22-26, 2011, Funchal, Portugal","paperID":"1935725"},{"content":"Diane Gromala , Meehae Song , Ji-Dong Yim , Tyler Fox , Steven J. Barnes , Mark Nazemi , Chris Shaw , Pam Squire, Immersive VR: a non-pharmacological analgesic for chronic pain?, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979704"},{"content":"Harding, V. and Williams, A. Extending physiotherapy skills using a psychological approach: cognitive-behavioural management of chronic pain. Physiotherapy, (1995), 681--688","paperID":"None"},{"content":"Ickes, W. Measuring empathic accuracy. Lawrence Erlbaum Associates Publishers, 2001.","paperID":"None"},{"content":"Rose Johnson , Nadia Bianchi-Berthouze , Yvonne Rogers , Janet van der Linden, Embracing calibration in body sensing: using self-tweaking to enhance ownership and performance, Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing, September 08-12, 2013, Zurich, Switzerland","paperID":"2493457"},{"content":"Kaltwang, S., Rudovic, O., and Pantic, M. Continuous Pain Intensity Estimation from Facial Expressions. In Advances in Visual Computing, (2012), 368--377.","paperID":"None"},{"content":"Andrea Kleinsmith , Nadia Bianchi-Berthouze, Form as a cue in the automatic recognition of non-acted affective body expressions, Proceedings of the 4th international conference on Affective computing and intelligent interaction, October 09-12, 2011, Memphis, TN","paperID":"2062801"},{"content":"Lee, A. S., Cholewicki, J., Reeves, N. P., and Zazulak, B. T. Comparison of Trunk Proprioception Between Patients With Low Back Pain and Healthy Controls. APMR 91, 9, (2010), 1327--1331.","paperID":"None"},{"content":"Legrain, V., Damme, S. V., Eccleston, C., Davis, K. D., Seminowicz, D. A., and Crombez, G. A neurocognitive model of attention to pain: behavioral and neuroimaging evidence. Pain 144, 3 (2009), 230--232.","paperID":"None"},{"content":"James J. Lin , Lena Mamykina , Silvia Lindtner , Gregory Delajoux , Henry B. Strub, Fish'n'Steps: encouraging physical activity with an interactive computer game, Proceedings of the 8th international conference on Ubiquitous Computing, p.261-278, September 17-21, 2006, Orange County, CA","paperID":"2166299"},{"content":"Mancini, M., Camurri, A., and Volpe, G. A system for mobile music authoring and active listening. Proc. Entertainment Computing, (2013), 205--212.","paperID":"None"},{"content":"Markus, L. A., Willems, K. E., Maruna, C. C., et al. Virtual reality: feasibility of implementation in a regional burn center. Burns 35, 7 (2009), 967--969.","paperID":"None"},{"content":"Martel, M. O., Thibault, P., and Sullivan, M. J. L. The persistence of pain behaviors in patients with chronic back pain is independent of pain and psychological factors. Pain 151, 2 (2010), 330--336.","paperID":"None"},{"content":"Meng, H. and Bianchi-Berthouze. Affective statelevel recognition in naturalistic facial and vocal expressions. IEEE Trans. Systems, Man and Cybernetics B, (2013).","paperID":"None"},{"content":"Mynatt, E. D., Abowd, G. D., Mamykina, L., and Kientz, J. A. Understanding the Potential of Ubiquitous Computing for Chronic Disease Management. Health Informatics: A Patient-Centered Approach to Diabetes. Health Informatics, (2010), 85--106.","paperID":"None"},{"content":"Pain, I. A. F. T. S. O. Unrelieved pain is a major global healthcare problem. iasp-pain.org. http://www.iasppain.org/AM/Template.cfm?Section=Home&Template=/CM/ContentDisplay.cfm&ContentID=2908.","paperID":"None"},{"content":"Giulio Rosati , Antonio Rodà , Federico Avanzini , Stefano Masiero, On the role of auditory feedback in robot-assisted movement training after stroke: review of the literature, Computational Intelligence and Neuroscience, 2013, p.11-11, January 2013","paperID":"2610925"},{"content":"Rosser, B. A. and Eccleston, C. Smartphone applications for pain management. Journal of telemedicine and telecare 17, 6 (2011), 308--312.","paperID":"None"},{"content":"Rosser, B. A., McCullagh, P., Davies, R., Mountain, G. A., McCracken, L., and Eccleston, C. Technology-mediated therapy for chronic pain management: the challenges of adapting behavior change interventions for delivery with pervasive communication technology. Telemedicine J. and e-health 17, 3, (2011), 211--216.","paperID":"None"},{"content":"Rosser, B. A., Vowles, K. E., Keogh, E., Eccleston, C., and Mountain, G. A. Technologically-assisted behaviour change: a systematic review of studies of novel technologies for the management of chronic illness. J. of telemedicine and telecare 15, 7, (2009), 327--338.","paperID":"None"},{"content":"Savva, N., Scarinzi, A., and Bianchi-Berthouze, N. Continuous Recognition of Player's Affective Body Expression as Dynamic Quality of Aesthetic Experience. IEEE Tran on CIAIG, 3 (2012), 199--212.","paperID":"None"},{"content":"Schönauer, C., Pintaric, T., Kaufmann, H., Jansen Kosterink, S., and Vollenbroek-Hutten, M. Chronic Pain Rehabilitation with a Serious Game using Multimodal Input. Proc. ICVR, IEEE Press (2011) 1--8 (2011), 1--8.","paperID":"None"},{"content":"Strauss, A. L. and Corbin, J. M. Basics of qualitative research. Sage Publications, Inc, 1998.","paperID":"None"},{"content":"Tracey, I. and Bushnell, M. C. How neuroimaging studies have challenged us to rethink: is chronic pain a disease? The journal of pain 10, 11 (2009), 1113--1120.","paperID":"None"},{"content":"Tracey, I. and Mantyh, P. W. The cerebral signature for pain perception and its modulation. Neuron 55, 3 (2007), 377--391.","paperID":"None"},{"content":"Turk, D. C. and Okifuji, A. Psychological factors in chronic pain: evolution and revolution. J. of consulting and clinical psychology 70, 3 (2002), 678--690.","paperID":"None"},{"content":"Turk, D. C. and Rudy, T. E. IASP taxonomy of chronic pain syndromes: preliminary assessment of reliability. Pain 30, 2 (1987), 177--189.","paperID":"None"},{"content":"Jay Vidyarthi , Bernhard E. Riecke , Diane Gromala, Sonic Cradle: designing for an immersive experience of meditation by connecting respiration to music, Proceedings of the Designing Interactive Systems Conference, June 11-15, 2012, Newcastle Upon Tyne, United Kingdom","paperID":"2318017"},{"content":"Vlaeyen, J. W. and Linton, S. J. Fear-avoidance and its consequences in chronic musculoskeletal pain: a state of the art. Pain 85, 3 (2000), 317--332.","paperID":"None"},{"content":"Katharina Vogt , David Pirrò , Ingo Kobenz , Robert Höldrich , Gerhard Eckel, PhysioSonic - evaluated movement sonification as auditory feedback in physiotherapy, Proceedings of the 6th international conference on Auditory Display, May 18-22, 2009, Copenhagen, Denmark","paperID":"2174866"},{"content":"Volpe, della, R., Popa, T., Ginanneschi, F., Spidalieri, R., Mazzocchio, R., and Rossi, A. Changes in coordination of postural control during dynamic stance in chronic low back pain patients. Gait & Posture 24, 3 (2006), 349--355.","paperID":"None"},{"content":"Williams, A., Eccleston, C., and Morley, S. Psychological therapies for the management of chronic pain (excluding headache) in adults. Cochrane Database of Systematic Reviews 11 (2012), CD070407.","paperID":"None"},{"content":"Zeidan, F., Grant, J. A., Brown, C. A., McHaffie, J. G., and Coghill, R. C. Mindfulness meditation-related pain relief: evidence for unique brain mechanisms in the regulation of pain. Neuroscience letters 520, 2 (2012), 165--173.","paperID":"None"}],"abstract":"Physical activity is important for improving quality of life in people with chronic pain. However, actual or anticipated pain exacerbation, and lack of confidence when doing physical activity, make it difficult to maintain and build towards long-term activity goals. Research guiding the design of interactive technology to motivate and support physical activity in people with chronic pain is lacking. We conducted studies with: (1) people with chronic pain, to understand how they maintained and increased physical activity in daily life and what factors deterred them; and (2) pain-specialist physiotherapists, to understand how they supported people with chronic pain. Building on this understanding, we investigated the use of auditory feedback to address some of the psychological barriers and needs identified and to increase self-efficacy, motivation and confidence in physical activity. We conclude by discussing further design opportunities based on the overall findings.","video":"http://www.youtube.com/embed/gNmVlW9gcFY?rel=0","title":"Motivating people with chronic pain to do physical activity: opportunities for technology design","filename":"CHI14/p2803","authors":["Aneesha Singh","Annina Klapper","Jinni Jia","Antonio Fidalgo","Ana Tajadura-Jiménez","Natalie Kanakam","Nadia Bianchi-Berthouze","Amanda Williams"],"conference":"CHI '14"}