{"paperId":2557123,"citation":[{"content":"Dhaval Vyas , Stephen Snow , Margot Brereton , Uwe Dulleck , Xavier Boyen, Being Thrifty on a $100K Wage: Austerity in Family Finances, Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2698998"},{"content":"Chris Freeland , Kodjo Atiso, Determining users' motivations to participate in online community archives: a preliminary study of documenting ferguson, Proceedings of the 78th ASIS&T Annual Meeting: Information Science with Impact: Research in and for the Community, p.1-4, November 06-10, 2015, St. Louis, Missouri","paperID":"2857176"},{"content":"Dhaval Vyas , Stephen Snow , Miranda Mallett, More than just Food: Field Visits to an Emergency Relief Centre, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838787"},{"content":"Benjamin Jen , Jashanjit Kaur , Jonathan De Heus , Tawanna R. Dillahunt, Analyzing employment technologies for economically distressed individuals, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2581290"},{"content":"Tawanna R. Dillahunt , Amelia R. Malone, The Promise of the Sharing Economy among Disadvantaged Communities, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702189"},{"content":"Tawanna R. Dillahunt , Sandy Ng , Michelle Fiesta , Zengguang Wang, Do Massive Open Online Course Platforms Support Employability?, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819924"},{"content":"Parisa Khanipour Roshan , Maia Jacobs , Michaelanne Dye , Betsy DiSalvo, Exploring How Parents in Economically Depressed Communities Access Learning Resources, Proceedings of the 18th International Conference on Supporting Group Work, November 09-12, 2014, Sanibel Island, Florida, USA","paperID":"2660415"},{"content":"Sheena L. Erete, Engaging Around Neighborhood Issues: How Online Communication Affects Offline Behavior, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675182"}],"reference":[{"content":"Alkalimat, A. and Williams, K. 200 \"Social capital and cyberpower in the African American community: a case study of a community technology center in the Dual City.\" In Community Informatics: Community Development through the Use of Information and Communication Technologies, L. Keeble and B. Loader (editors). London: Routledge.","paperID":"None"},{"content":"Bødker, S. (2000). Scenarios in user-centred design - setting the stage for reflection and action. HICSS 32.","paperID":"None"},{"content":"Bourdieu, P. 1986. \"The forms of capital.\" pp. 280--291 in Readings in economic sociology.","paperID":"None"},{"content":"Moira Burke , Robert Kraut, Using facebook after losing a job: differential benefits of strong and weak ties, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441936"},{"content":"Calabrese, A. & Borchert, M. (1996). Prospects for electronic democracy in the USA: rethinking communication and social policy. Media, Culture & Society, vol. 18, no. 2, pp. 249--268.","paperID":"None"},{"content":"Chetty, R., Hendren, N., Kline, P., Saez, E. (2013). The EOP, Summary of Project Findings. As of 1/7/14, http://www.equality-of-opportunity.org/.","paperID":"None"},{"content":"City of Minneapolis Community Technology Survey. Overcoming the Digital Divide. March 2012.","paperID":"None"},{"content":"Dillahunt, T. (2013). Creating resilient communities for post-sustainable times. CHI 2013 Post-sustainability workshop.","paperID":"None"},{"content":"Tawanna R. Dillahunt , Jennifer Mankoff, Understanding factors of successful engagement around energy consumption between and among households, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531626"},{"content":"Tawanna Dillahunt , Jennifer Mankoff, In the dark, out in the cold, XRDS: Crossroads, The ACM Magazine for Students, v.17 n.4, Summer 2011","paperID":"1961685"},{"content":"Tawanna Dillahunt , Jennifer Mankoff , Eric Paulos, Understanding conflict between landlords and tenants: implications for energy sensing and feedback, Proceedings of the 12th ACM international conference on Ubiquitous computing, September 26-29, 2010, Copenhagen, Denmark","paperID":"1864376"},{"content":"Domínguez, S. (2011). Getting ahead: Social mobility, public housing, and immigrant networks. New York, NY: NYU Press, 2011.","paperID":"None"},{"content":"Domínguez, S. and Watkins, C. 2003. \"Creating networks for survival and mobility: Social capital among African-American and Latin-American low-income mothers.\" Social Problems 50(1): 111--135.","paperID":"None"},{"content":"Ellison, N., Vitak, J., Gray, R., Lampe, C. (In press). \"Cultivating social resources on Facebook: Signals of relational investment and their role in social capital processes.\" J Comput-Mediat Comm.","paperID":"None"},{"content":"Sheena Lewis Erete, Empowerment through community crime-prevention technologies, interactions, v.20 n.6, November + December 2013","paperID":"2517444"},{"content":"Ericksen, E. and Yancey, W. (1980). \"Class, Sector and Income Determination.\" Unpublished manuscript, Temple University.","paperID":"None"},{"content":"Foroohar, R. (2011, November 14). What ever happened to upward mobility? Time.","paperID":"None"},{"content":"Frey, W. H. Brookings Institution and UM Social Science Data Analysis Network's analysis of 1990, 2000, and 2010 Census Decennial Census tract data.","paperID":"None"},{"content":"Fukuyama, F. (1995). Trust: The social virtues and the creation of prosperity, Free Press.","paperID":"None"},{"content":"Gaved, M. & Anderson, B. 2006. The impact of local ICT initiatives on social capital and quality of life. Chimera Working Paper Number: 2006-06.","paperID":"None"},{"content":"Granovetter, M. S. 1973. \"The strength of weak ties.\" American Journal of Sociology. 78(6):1360.","paperID":"None"},{"content":"Rebecca Gray , Nicole B. Ellison , Jessica Vitak , Cliff Lampe, Who wants to know?: question-asking and answering practices among facebook users, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441913"},{"content":"Guiso, L., Sapienza, P., Zingales, L. (2004). The role of social capital in financial development. American Economic Review, 94, pp. 526--556.","paperID":"None"},{"content":"Hartford, T. (July 21, 2010). The economics of trust. Forbes.","paperID":"None"},{"content":"Karlan, D., M. Mobius, T. Rosenblat, and A. Szeidl, Trust and social collateral. The Quarterly Journal of Economics, 2009. 124(3): p. 1307--1361.","paperID":"None"},{"content":"Kavanaugh, A. and Patterson, S. J. (2002). The impact of community computer networks on social capital and community involvement in Blacksburg. The internet in everyday life. Wellman, B. and Haythornthwaite, C. Malden, MA, Blackwell Publishers: 325--344.","paperID":"None"},{"content":"Knack, S. and Keefer, P. (1996). \"Does social capital have an economic payoff?\" a cross-country investigation, The Quarterly J. of Econ., 112(4): 1251.","paperID":"None"},{"content":"Kraut, R., Kiesler, S., Boneva, B., Cummings, J. N., Helgeson, V. and Crawford, A. M. (2002). \"Internet paradox revisited.\" J. Soc. Issues 58(1): 49--74.","paperID":"None"},{"content":"Lopez, M., Gonzalez-Barrera, A., Patten, E. Closing the digital divide: Latinos and technology adoption (2013). From the People & the Press June 2012 Biennial Media Consumption Survey. http://tinyurl.com/bpsqtyf.","paperID":"None"},{"content":"Mathews, R. (2013, July 18). Detroit bankrupt: To see Detroit's decline, look at 40 years of federal policy.","paperID":"None"},{"content":"O'Neil, D. 2002. \"Assessing community informatics: a review of methodological approaches for evaluating community networks and community technology centres.\" Internet Research: Electronic Applications and Policy. 12(1): 76--102.","paperID":"None"},{"content":"Putnam, R. 2000. Bowling alone: The collapse and revival of American community. Simon & Schuster: New York.","paperID":"None"},{"content":"Resnick, P. Beyond bowling together: SocioTechnical capital. Chapter 29 in \"HCI in the new millennium,\" ed. by John M. Carroll. Addison-Wesley. 2002. 247--272.","paperID":"None"},{"content":"Jahmeilah Roberson , Bonnie Nardi, Survival needs and social inclusion: technology use among the homeless, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718993"},{"content":"Smith, S. 2007. Lone pursuit: Distrust and defensive individualism among the Black Poor. New York: Russell Sage Foundation.","paperID":"None"},{"content":"Social capital community benchmark survey, 2000. Roper Center, Public Opinion Archives.","paperID":"None"},{"content":"Sum, A. and Khatiwada, I. (2010). \"The nation's underemployed in the \"Great Recession of 2007-09.\" Monthly Labor Review 133(11): 3--15.","paperID":"None"},{"content":"The rise of the sharing economy. (2013, March 9). The Economist.","paperID":"None"},{"content":"Woolcock, M. 1998. \"Social capital and economic development: Toward a theoretical synthesis and policy framework.\" Theory and Society. 27:51--208.","paperID":"None"},{"content":"Susan P. Wyche , Andrea Forte , Sarita Yardi Schoenebeck, Hustling online: understanding consolidated facebook use in an informal settlement in Nairobi, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2481391"}],"abstract":"Past Information and Communication Technology (ICT) literature suggests that engaging in meaningful activities with ICTs may be related to socio-economic security, social inclusion, empowerment, and increased social capital. However, we identify a pervasive lack of understanding in existing literature, which raises an important research question: how can we build social capital where little social capital exists? We conducted a preliminary study to explore whether and if so, how, individuals in an economically distressed population with limited social capital use technologies to increase social capital and achieve socio-economic security. We contribute details about barriers affecting social capital (e.g., difficulties finding and making the right connections and an overall lack of trust within communities). We also suggest ways in which ICTs can assist populations that could benefit most from increased social capital and economic security.","video":"http://www.youtube.com/embed/Sul8liZtBqc?rel=0","title":"Fostering social capital in economically distressed communities","filename":"CHI14/p531","authors":["Tawanna R. Dillahunt"],"conference":"CHI '14"}