{"paperId":2557124,"citation":[],"reference":[{"content":"Barber, W., & Badre, A. (1998). Culturability: The merging of culture and usability. Proc. of the 4th Conference on Human Factors and the Web, 1--14.","paperID":"None"},{"content":"Brehmer, M. M. (2011). Usability and the effects of interruption in C-TOC: Self-Administered Cognitive Testing on a Computer. M. Sc thesis. University of British Columbia.","paperID":"None"},{"content":"Carver, C. S., & White, T. L. (1994). Behavioral inhibition, behavioral activation, and affective responses to impending reward and punishment: The BIS/BAS Scales. Journal of Personality and Social Psychology, 67 (2), 319--333.","paperID":"None"},{"content":"Cheung, B. Y., Chudek, M., & Heine, S. J. (2011). Evidence for a sensitive period for acculturation: Younger immigrants report acculturating at a faster rate. Psychological Science, 22 (2), 147--152.","paperID":"None"},{"content":"Boreum Choi , Inseong Lee , Jinwoo Kim , Yunsuk Jeon, A qualitative cross-national study of cultural influences on mobile data service design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 02-07, 2005, Portland, Oregon, USA","paperID":"1055064"},{"content":"Torkil Clemmensen , Morten Hertzum , Kasper Hornbæk , Qingxin Shi , Pradeep Yammiyavar, Cultural cognition in usability evaluation, Interacting with Computers, v.21 n.3, p.212-220, July, 2009","paperID":"1558407"},{"content":"Cohen, J. (1973). Eta-squared and partial eta-squared in communication science. Human Communication Research, 28, 473--490.","paperID":"None"},{"content":"Dianne Cyr , Carole Bonanni , Joe ilsever, Design and e-loyalty across cultures in electronic commerce, Proceedings of the 6th international conference on Electronic commerce, October 25-27, 2004, Delft, The Netherlands","paperID":"1052265"},{"content":"Darke, S. (1988). Anxiety and working memory capacity. Cognition & Emotion, 2(2), 145--154.","paperID":"None"},{"content":"Antonella De Angeli , Leantros Kyriakoullis, Globalisation vs. localisation in e-commerce: cultural-aware interaction design, Proceedings of the working conference on Advanced visual interfaces, May 23-26, 2006, Venezia, Italy","paperID":"1133314"},{"content":"Olaf Frandsen-Thorlacius , Kasper Hornbæk , Morten Hertzum , Torkil Clemmensen, Non-universal usability?: a survey of how usability is understood by Chinese and Danish users, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518708"},{"content":"Heine, S. J. (2007). Cultural Psychology (1sted.). W. W. Norton & Company.","paperID":"None"},{"content":"Hofstede, G. (1980). Cultures Consequences: International Differences in Work-Related Values (Abridged). SAGE Publications, Inc.","paperID":"None"},{"content":"Ira Jhangiani , Tonya Smith-Jackson, Comparison of mobile phone user interface design preferences: perspectives from nationality and disability culture, Proceedings of the 4th international conference on mobile technology, applications, and systems and the 1st international symposium on Computer human interaction in mobile technology, September 10-12, 2007, Singapore","paperID":"1378146"},{"content":"Kitayama, S., Duffy, S., Kawamura, T., & Larsen, J. T. (2003). Perceiving an object and its context in different cultures: A cultural look at new look. Psychological Science, 14(3), 201--206.","paperID":"None"},{"content":"Inseong Lee , Gi Woong Choi , Jinwoo Kim , Solyung Kim , Kiho Lee , Daniel Kim , Myunghee Han , Seung Yong Park , Yongil An, Cultural dimensions for user experience: cross-country and cross-product analysis of users' cultural characteristics, Proceedings of the 22nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction, September 01-05, 2008, Liverpool, United Kingdom","paperID":"1531516"},{"content":"Aaron Marcus, Cross-cultural user-interface design for work, home, play, and on the way, ACM SIGGRAPH ASIA 2010 Courses, p.1-160, December 15-18, 2010, Seoul, Republic of Korea","paperID":"1900525"},{"content":"Samantha Merritt , Shaowen Bardzell, Postcolonial language and culture theory for HCI4D, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979827"},{"content":"Miyamoto, Y., Nisbett, R. E., & Masuda, T. (2006). Culture and the physical environment. Psychological Science, 17(2), 113--119.","paperID":"None"},{"content":"Dmitry Nekrasovski , Adam Bodnar , Joanna McGrenere , François Guimbretière , Tamara Munzner, An evaluation of pan & zoom and rubber sheet navigation with and without an overview, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124775"},{"content":"Owen, A. M., McMillan, K. M., Laird, A. R., & Bullmore, E. (2005). N-back working memory paradigm: A meta-analysis of normative functional neuroimaging studies. Human Brain Mapping, 25(1), 46--59.","paperID":"None"},{"content":"Katharina Reinecke , Abraham Bernstein, Improving performance, perceived usability, and aesthetics with culturally adaptive user interfaces, ACM Transactions on Computer-Human Interaction (TOCHI), v.18 n.2, p.1-29, June 2011","paperID":"1970382"},{"content":"Shuper, P. A., Sorrentino, R. M., Otsubo, Y., Hodson, G., & Walker, A. M. (2004). A theory of uncertainty orientation. Journal of Cross-Cultural Psychology, 35(4), 460--480.","paperID":"None"},{"content":"Spielberger, C. D., Gorsuch, R. L., & Lushene, R. E. (1970). Manual for the state-trait anxiety inventory. Retrieved from http://ubir.buffalo.edu/xmlui/handle/10477/2895","paperID":"None"},{"content":"Tanaka, A., & Yamauchi, H. (2004). Cultural self-construal and achievement goal. Hellenic Journal of Psychology, 1, 221--237.","paperID":"None"},{"content":"Viswanath Venkatesh , Michael G. Morris , Gordon B. Davis , Fred D. Davis, User acceptance of information technology: toward a unified view, MIS Quarterly, v.27 n.3, p.425-478, September 2003","paperID":"2017202"},{"content":"Tanja Walsh , Piia Nurkka , Rod Walsh, Cultural differences in smartphone user experience evaluation, Proceedings of the 9th International Conference on Mobile and Ubiquitous Multimedia, p.1-9, December 01-03, 2010, Limassol, Cyprus","paperID":"1899499"},{"content":"Jacob O. Wobbrock , Leah Findlater , Darren Gergle , James J. Higgins, The aligned rank transform for nonparametric factorial analyses using only anova procedures, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1978963"}],"abstract":"This work reports on the design and evaluation of culturally appropriate technology for older adults. Our design context was Cognitive Testing on a Computer (C-TOC): a self-administered computerized test under development, intended to screen older adults for cognitive impairments. Using theory triangulation of cultural attitudes toward uncertainty, we designed two interfaces (one minimal and one rich) for one C-TOC subtest and hypothesized they would be culturally appropriate for older adult Caucasians and East Asians respectively. We ran an experiment with 36 participants to investigate cultural differences in performance, preference and anxiety. We found that Caucasians preferred the interface with minimal elements (i.e. those essential for the primary task) or had no preference. By contrast, East Asians preferred the rich interface augmented with security and learning support and felt less anxious with it than the minimal.","video":"http://www.youtube.com/embed/PFvWp_YBUJ4?rel=0","title":"Interface design for older adults with varying cultural attitudes toward uncertainty","filename":"CHI14/p1913","authors":["Shathel Haddad","Joanna McGrenere","Claudia Jacova"],"conference":"CHI '14"}