{"paperId":2557193,"reference":[{"content":"Bergstrom, K. 'Don't feed the troll': Shutting down debate about community expectations on Reddit.com. First Monday, 16, 1, (2011).","paperID":"None"},{"content":"Amy Bruckman , Catalina Danis , Cliff Lampe , Janet Sternberg , Chris Waldron, Managing deviant behavior in online communities, CHI '06 Extended Abstracts on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1125458"},{"content":"Susan L. Bryant , Andrea Forte , Amy Bruckman, Becoming Wikipedian: transformation of participation in a collaborative online encyclopedia, Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work, November 06-09, 2005, Sanibel Island, Florida, USA","paperID":"1099205"},{"content":"Ellison, B & boyd, d. Sociality Through Social Network Sites. In The Oxford Handbook of Internet Studies, Dutton, w., Ed. Oxford University Press, Oxford, (2013), 151--172.","paperID":"None"},{"content":"Eric Gilbert , Karrie Karahalios, Predicting tie strength with social media, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518736"},{"content":"David Gurzick , Wayne G. Lutters, Towards a design theory for online communities, Proceedings of the 4th International Conference on Design Science Research in Information Systems and Technology, May 07-08, 2009, Philadelphia, Pennsylvania","paperID":"1555634"},{"content":"Kiesler, S., Kraut, R., Resnick, P. & Kittur, A. Regulating Behavior in Online Communities. In Building Successful Online Communities. Kraut, R. Resnick, P. Eds. MIT Press (2012), 125--278.","paperID":"None"},{"content":"Amy Jo Kim, Community Building on the Web: Secret Strategies for Successful Online Communities, Addison-Wesley Longman Publishing Co., Inc., Boston, MA, 2000","paperID":"518514"},{"content":"Kollock, P., Design Principles for Online Communities. PC Update, 15, 5, (1998), 58--60.","paperID":"None"},{"content":"Cliff Lampe , Erik Johnston, Follow the (slash) dot: effects of feedback on new members in an online community, Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work, November 06-09, 2005, Sanibel Island, Florida, USA","paperID":"1099206"},{"content":"Lave, J. and Wenger, E. Situated Learning: Legitimate Peripheral Participation. Cambridge University Press: Cambridge, UK, (1991).","paperID":"None"},{"content":"Lazar, J., and J. Preece. Social Considerations in Online Communities: Usability, Sociability, and Success Factors. In Cognition in the Digital World, Oostendorp, H., Ed. Lawrence Erlbaum Associates, New Jersey, (2003).","paperID":"None"},{"content":"Ling et. al., Using Social Psychology to Motivate Contributions to Online Communities. Journal of Computer-Mediated Communication, 10, 4, (2005).","paperID":"None"},{"content":"Blair Nonnecke , Jenny Preece, Lurker demographics: counting the silent, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.73-80, April 01-06, 2000, The Hague, The Netherlands","paperID":"332409"},{"content":"Oldenberg, R. The Great Good Place. Marlowe & Company: New York, (1999)","paperID":"None"},{"content":"Ren, Y, Kruat, R.E. & Kiesler, S. Encouraging commitment in online communities. In Building Successful Online Communities. Kraut, R. Resnick, P. Eds. MIT Press (2012), 77--124.","paperID":"None"}],"citation":[],"abstract":"The Something Awful Forums (SAF) is an online community comprised of a loosely connected federation of forums, united in a distinctive brand of humor with a focus on the quality of member contributions. In this case study we find that the site has sustained success while deviating from common conventions and norms of online communities. Humor and the quality of content contributed by SAF members foster practices that seem counterintuitive to the development of a stable and thriving community. In this case study we show how design decisions are contextual and inter-dependent and together these heuristics create a different kind of online third place that challenges common practices.","video":"http://www.youtube.com/embed/faxTv5V1fo0?rel=0","title":"Just awful enough: the functional dysfunction of the something awful forums","filename":"CHI14/p2407","authors":["Jessica Annette Pater","Yacin Nadji","Elizabeth D. Mynatt","Amy S. Bruckman"],"conference":"CHI '14"}