{"paperId":2557077,"reference":[{"content":"Johanna Brewer , Joseph 'Jofish' Kaye , Amanda Williams , Susan Wyche, Sexual interactions: why we should talk about sex in HCI, CHI '06 Extended Abstracts on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1125765"},{"content":"Brown, T. Behavioral surveillance: Current perspectives, and its role in catalyzing action. J. of Acquired Immune Deficiency Syndromes International Perspectives on HIV 32, (2003), S12--S17.","paperID":"None"},{"content":"Bull, S. S., McFarlane, M., Lloyd, L., and Rietmeijer, C. The process of seeking sex partners online and implications for STD/HIV prevention. AIDS Care 16, 8 (2004), 1012--1020.","paperID":"None"},{"content":"Cassels, S., Menza, T. W., Goodreau, S. M., and Golden, M. R. HIV serosorting as a harm reduction strategy: Evidence from Seattle, Washington. AIDS 23, 18 (2009), 2497--2506.","paperID":"None"},{"content":"Centers for Disease Control and Prevention. HIV in the USA: At A Glance. 2013.","paperID":"None"},{"content":"Centers for Disease Control and Prevention. HIV Surveillance Report, 2011. 2013.","paperID":"None"},{"content":"Chan, J. and Ghose, A. Internet's dirty secret: Assessing the impact of online intermediaries on HIV transmission. Soc. Sci. Research Network, 2013.","paperID":"None"},{"content":"Cheeseman, K., Goodlin-Fahncke, W., and Tewksbury, R. \"Looking for a married hookup\": An examination of personal ads posted by men seeking sex with married men. J. of Men's Studies 20, 2 (2012), 144--157.","paperID":"None"},{"content":"Chiasson, M. A., Parsons, J. T., Tesoriero, J. M., et al. HIV behavioral research online. Journal of Urban Health 83, 1 (2006), 73--85.","paperID":"None"},{"content":"Cocks, H. G. Classified: The Secret History of the Personal Column. Random House, 2009.","paperID":"None"},{"content":"Cooper, A. Sexuality and the Internet: Surfing into the new millennium. CyberPsy&Beh 1, 2 (1998), 187--193.","paperID":"None"},{"content":"Craigslist Terms of Use. Craigslist.org, 2012.","paperID":"None"},{"content":"Crepaz, N., Hart, T. A., and Marks, G. Highly active antiretroviral therapy and sexual risk behavior: A meta-analytic review. JAMA 292, 2 (2004), 224--236.","paperID":"None"},{"content":"Davidson, A. G. Looking for love in the age of AIDS: The language of gay personals, 1978-1988. The Journal of Sex Research 28, 1 (1991), 125--137.","paperID":"None"},{"content":"Davis, J. Evolution of an Epidemic: 25 Years of HIV/AIDS Media Campaigns in the U.S. Henry J. Kaiser Family Foundation, 2006.","paperID":"None"},{"content":"Fries, J. A., Ho, T. Y., Polgreen, P. M., and Segre, A. M. Using Craigslist messages for syphilis surveillance. Int. Meeting on Emerg. Diseases and Surveil. (2011).","paperID":"None"},{"content":"Fries, J. A., Segre, A., Polgreen, L., and Polgreen, P. The use of Craigslist posts for risk behavior and STI surveillance. Int. Society for Disease Surv. (2011), 13.","paperID":"None"},{"content":"Grov, C. Risky sex- and drug-seeking in a probability sample of men-for-men online bulletin board Postings. AIDS and Behavior 14, 6 (2010), 1387--1392.","paperID":"None"},{"content":"Gudelunas, D. Online personal ads. Journal of Homosexuality, 49, 1 (2005), 1--33.","paperID":"None"},{"content":"Gudelunas, D. There's an app for that: The uses and gratifications of online social networks for gay men. Sexuality & Culture, 16, 4 (2012), 347--365.","paperID":"None"},{"content":"Mark J. Handel , Irina Shklovski, Disclosure, ambiguity and risk reduction in real-time dating sites, Proceedings of the 17th ACM international conference on Supporting group work, October 27-31, 2012, Sanibel Island, Florida, USA","paperID":"2389203"},{"content":"Hatala, M. N., Baack, D. W., and Parmenter, R. Dating with HIV: A content analysis of gay male HIV-positive and HIV-negative personal advertisements. J. of Social and Personal Relationships 15, 2 (1998), 268--276.","paperID":"None"},{"content":"Hoff, C. C. and Beougher, S. C. Sexual agreements among gay male couples. Archives of Sexual Behavior 39, 3 (2010), 774--787.","paperID":"None"},{"content":"Gopinaath Kannabiran , Jeffrey Bardzell , Shaowen Bardzell, How HCI talks about sexuality: discursive strategies, blind spots, and opportunities for future research, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979043"},{"content":"Mansergh, G. and Marks, G. Age and risk of HIV infection in men who have sex with men. AIDS 12, 10 (1998), 1119--1128.","paperID":"None"},{"content":"Martin, J. L. The impact of AIDS on gay male sexual behavior patterns in New York City. American Journal of Public Health 77, 5 (1987), 578--581.","paperID":"None"},{"content":"McFarlane, M., Bull, S. S., and Rietmeijer, C. A. The Internet as a newly emerging risk environment for sexually transmitted diseases. Journal of the American Medical Association 284, 4 (2000), 443--446.","paperID":"None"},{"content":"Mocroft, A., Brettle, R., Kirk, O., et al. Changes in the cause of death among HIV positive subjects across Europe: results from the EuroSIDA study. AIDS 16, 12 (2002), 1663--1671.","paperID":"None"},{"content":"Moskowitz, D. A. and Seal, D. W. \"GWM looking for sex - SERIOUS ONLY\": The interplay of sexual ad placement frequency and success on the sexual health of \"men seeking men\" on Craigslist. Journal of Gay & Lesbian Social Services 22, 4 (2010), 399--412.","paperID":"None"},{"content":"Mowlabocus, S. Gaydar Culture: Gay Men, Technology and Embodiment in the Digital Age. Ashgate Publishing, 2010.","paperID":"None"},{"content":"Mustanski, B., Lyons, T., and Garcia, S. C. Internet use and sexual health of young men who have sex with men: A mixed-methods study. Archives of Sexual Behavior, 40, 2 (2011), 289--300.","paperID":"None"},{"content":"Rosenbaum, M. S., Daunt, K. L., and Jiang, A. Craigslist exposed: The Internet-mediated hookup. J of Homosexuality 60, 4 (2013), 505--531.","paperID":"None"},{"content":"U. S. Census Bureau. Population, housing units, area, and density: 2010 - USA - metropolitan and micropolitan statistical areas. 2010. http://factfinder2.census.gov/faces/tableservices/jsf/pages/productview.xhtml.","paperID":"None"},{"content":"U. S. Census Bureau. Annual estimates of the population: April 1, 2010 to July 1, 2012. 2012. http://www.census.gov/popest/data/metro/totals/2012/.","paperID":"None"},{"content":"Village Voice. Classifieds. Village Voice, 1978--1988.","paperID":"None"},{"content":"Wickman, M. E., Anderson, N. L. R., and Smith Greenberg, C. The adolescent perception of invincibility and its influence on teen acceptance of health promotion strategies. J of Pediatric Nursing 23, 6 (2008), 460--468.","paperID":"None"},{"content":"Winchester III, W. W., Abel, T. D., and Bauermeister, J. The use of partner-seeking computer-mediated communication applications by young men that have sex with men (YMSM): Uncovering human-computer interaction (HCI) design opportunities in HIV prevention. Health Systems 1, 1 (2012), 26--35.","paperID":"None"},{"content":"Wohlfeiler, D., Hecht, J., Volk, J., et al. How can we improve online HIV and STD prevention for men who have sex with men? Perspectives of hook-up website owners, website users, and HIV/STD directors. AIDS and Behavior, 17, 9 (2013), 3024--3033.","paperID":"None"},{"content":"Wolitski, R. J., Valdiserri, R. O., Denning, P. H., and Levine, W. C. Are we headed for a resurgence of the HIV epidemic among men who have sex with men? Amer. J. of Public Health 91, 6 (2001), 883--888.","paperID":"None"},{"content":"World Health Organization. WHO | Public health surveillance. World Health Organization, 2013. http://www.who.int/topics/public_health_surveillance/.","paperID":"None"}],"citation":[{"content":"Jeremy Birnholtz , Irina Shklovski , Mark Handel , Eran Toch, Let's Talk About Sex (Apps), CSCW, Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2685557"},{"content":"Sofiane Abbar , Yelena Mejova , Ingmar Weber, You Tweet What You Eat: Studying Food Consumption Through Twitter, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702153"},{"content":"Jennifer L. Bevan , Jimena Galvan , Justin Villasenor , Joanna Henkin, \"You've been on my mind ever since\", Computers in Human Behavior, v.54 n.C, p.18-24, January 2016","paperID":"2840605"}],"abstract":"The HIV/AIDS crisis of the 1980s fundamentally changed sexual practices of men who have sex with men (MSM) in the U.S., including increased usage of sexual health-related (SHR) language in personal advertisements. Analyzing online personal ads from Craigslist, we found a substantial increase in SHR language, from ~23% in 1988 to over 53% today, echoing continuing concern about rising HIV rates. We argue that SHR language in Craigslist ads can be used as a sensor to provide insight into HIV epidemiology as well as discourse among particular communities. We show a positive significant relationship between prevalence rate of HIV in an ad's location and use of SHR language in that location. Analysis highlights the opportunity for SHR information found in Craigslist personal ads to serve as a data source for HIV prevention research. More broadly, we argue for mining large-scale user-generated content to inform HCI design of health and other systems, and explore use of such data to examine temporal changes in language to facilitate improved user-interface design.","video":"http://www.youtube.com/embed/kbgJ_ftkVYg?rel=0","title":"DDFSeeks same: sexual health-related language in online personal ads for men who have sex with men","filename":"CHI14/p1615","authors":["Oliver L. Haimson","Jed R. Brubaker","Gillian R. Hayes"],"conference":"CHI '14"}