{"paperId":2557355,"citation":[{"content":"Per Ola Kristensson , Xiaojun Bi , Andrew Howes , Antti Oulasvirta , Roderick Murray-Smith , Harold Thimbleby , John Williamson , Shumin Zhai, Principles, Techniques and Perspectives on Optimization and HCI, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702662"}],"reference":[{"content":"Johnny Accot , Shumin Zhai, Beyond Fitts' law: models for trajectory-based HCI tasks, Proceedings of the ACM SIGCHI Conference on Human factors in computing systems, p.295-302, March 22-27, 1997, Atlanta, Georgia, USA","paperID":"258760"},{"content":"Biggs, S. J., and Srinivasan, M. A. Haptic interfaces. In Handbook of Virtual Environments, K. M. Stanney, Ed. Lawrence Earlbaum, 2002, 93--116.","paperID":"None"},{"content":"Florian Block , Hans Gellersen, The impact of cognitive load on the perception of time, Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, October 16-20, 2010, Reykjavik, Iceland","paperID":"1868985"},{"content":"Brewer, B. R., Fagan, M., Klatzky, R. L., and Matsuoka, Y. Perceptual limits for a robotic rehabilitation environment using visual feedback distortion. IEEE Transactions on Neural Systems and Rehabilitation Engineering 13, 1 (2005), 1--11.","paperID":"None"},{"content":"Douglas Cunningham , Christian Wallraven, Experimental Design: From User Studies to Psychophysics, A. K. Peters, Ltd., Natick, MA, 2011","paperID":"2161896"},{"content":"Ganel, T., Chajut, E., and Algom, D. Visual coding for action violates fundamental psychophysical principles. Current Biology 18, 14 (2008), R599--R601.","paperID":"None"},{"content":"Gephstein, S., and Banks, M. S. Viewing geometry determines how vision and haptics combine in size perception. Current Biology 13, 6 (2003), 483--488.","paperID":"None"},{"content":"Grondin, S. Timing and time perception: a review of recent behavioral and neuroscience findings and theoretical directions. Attention, Perception, & Psychophysics 72, 3 (2010), 561--582.","paperID":"None"},{"content":"Guiard, Y., and Olafsdottir, H. B. On the measurement of movement difficulty in the standard approach to Fitts' law. PloS ONE 6, 10 (2011), e24389.","paperID":"None"},{"content":"Kentaro Hamada , Kaori Yoshida , Kei Ohnishi , Mario Koppen, Color Effect on Subjective Perception of Progress Bar Speed, Proceedings of the 2011 Third International Conference on Intelligent Networking and Collaborative Systems, p.863-866, November 30-December 02, 2011","paperID":"2120795"},{"content":"Marc Hassenzahl, The thing and I: understanding the relationship between user and product, Funology: from usability to enjoyment, Kluwer Academic Publishers, Norwell, MA, 2005","paperID":"1139015"},{"content":"Effie Lai-Chong Law , Virpi Roto , Marc Hassenzahl , Arnold P.O.S. Vermeeren , Joke Kort, Understanding, scoping and defining user experience: a survey approach, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518813"},{"content":"Didier Le Gall, MPEG: a video compression standard for multimedia applications, Communications of the ACM, v.34 n.4, p.46-58, April 1991","paperID":"103090"},{"content":"Lidwell, W., Holden, K., and Butler, J. Universal Principles of Design. Rockport Publishers, 2010.","paperID":"None"},{"content":"I. Scott MacKenzie, Fitts' law as a research and design tool in human-computer interaction, Human-Computer Interaction, v.7 n.1, p.91-139, March 1992","paperID":"1461857"},{"content":"Sébastien Maury , Sylvie Athénes , Stéphane Chatty, Rhythmic menus: toward interaction based on rhythm, CHI '99 Extended Abstracts on Human Factors in Computing Systems, May 15-20, 1999, Pittsburgh, Pennsylvania","paperID":"632873"},{"content":"Nadenau, M. J., Winkler, S., Alleysson, D., and Kunt, M. Human vision models for perceptually optimized image processing - a review, 2000. Unpublished manuscript.","paperID":"None"},{"content":"Markus Rank , Zhuanghua Shi , Sandra Hirche, Perception of delay in haptic telepresence systems, Presence: Teleoperators and Virtual Environments, v.19 n.5, p.389-399, October 2010","paperID":"1943109"},{"content":"Martin Reddy, Perceptually Optimized 3D Graphics, IEEE Computer Graphics and Applications, v.21 n.5, p.68-75, September 2001","paperID":"618852"},{"content":"Sanders, A. F. Elements of Human Performance: Reaction Processes and Attention in Human Skill. Lawrence Erlbaum, 1998.","paperID":"None"},{"content":"Steven C. Seow, Designing and Engineering Time: The Psychology of Time Perception in Software, Addison-Wesley Professional, 2008","paperID":"1377538"},{"content":"Zhuanghua Shi , S. Hirche , W. X. Schneider , H. Muller, Influence of visuomotor action on visual-haptic simultaneous perception: A psychophysical study, Proceedings of the 2008 Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, p.65-70, March 13-14, 2008","paperID":"1546727"},{"content":"R. William Soukoreff , I. Scott MacKenzie, Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI, International Journal of Human-Computer Studies, v.61 n.6, p.751-789, December 2004","paperID":"1056155"},{"content":"Stevens, S. S. On the psychophysical law. Psychological Review 64, 3 (1957), 153--181.","paperID":"None"},{"content":"Yang, X. D., Bischof, W. F., and Boulanger, P. Perception of haptic force magnitude during hand movements. In Proc. ICRA 2008, IEEE Press (2008), 2061--2066.","paperID":"None"},{"content":"Zanker, J. M. Does motion perception follow Weber's law? Perception 24 (1995), 363--372.","paperID":"None"},{"content":"Zwicker, E., and Zwicker, U. T. Audio engineering and psychoacoustics: Matching signals to the final receiver, the human auditory system. Journal of the Audio Engineering Society 39, 3 (1991), 115--126.","paperID":"None"}],"abstract":"This paper studies how users perceive their own performance in two alternative user interfaces. We extend methodology from psychophysics to the study of interactive performance and conduct two experiments in order to create a model of users' perception of their own performance. In our studies, two interfaces are sequentially used in a pointing task, and users are asked to rate in which interface their performance was higher. We first differentiate the effects of objective performance (speed and accuracy) versus interface qualities (distance between elements and width of elements) on perceived performance. We then derive a model that predicts the amount of change required in an interface for users to reliably detect a difference. The model is useful as a heuristic for predicting if a new interface design is better enough for users to reliably appreciate the obtained gain in user performance. We validate the model via a separate user study, and conclude by discussing how to apply our findings to design problems.","video":"http://www.youtube.com/embed/EXFhFhB-cf0?rel=0","title":"Modeling the perception of user performance","filename":"CHI14/p1747","authors":["Max Nicosia","Antti Oulasvirta","Per Ola Kristensson"],"conference":"CHI '14"}