{"paperId":2557207,"citation":[{"content":"Frans Van der Sluis , Jasper Ginn , Tim Van der Zee, Explaining Student Behavior at Scale: The Influence of Video Complexity on Student Dwelling Time, Proceedings of the Third (2016) ACM Conference on Learning @ Scale, April 25-26, 2016, Edinburgh, Scotland, UK","paperID":"2876051"},{"content":"Minjung Kim , Jaeyoung Yun, Interaction-Enhancing Strategies for Educational Video, Proceedings of HCI Korea, p.356-363, January 27-29, 2016, Jeongseon, Republic of Korea","paperID":"2903681"},{"content":"Jamy Li , René Kizilcec , Jeremy Bailenson , Wendy Ju, Social robots and virtual agents as lecturers for video instruction, Computers in Human Behavior, v.55 n.PB, p.1222-1230, February 2016","paperID":"2874118"}],"reference":[{"content":"Allen, I. E., and Seaman, J. Changing Course: Ten Years of Tracking Online Education in the USA. ERIC, 2013.","paperID":"None"},{"content":"Baddeley, A. Working memory. Science 255, 5044 (1992), 556--559.","paperID":"None"},{"content":"Bixhorn, A. How moocs are evolving with video technology. eCampus News (September 2013).","paperID":"None"},{"content":"Borup, J., West, R. E., and Graham, C. R. Improving online social presence through asynchronous video. The Internet and Higher Education 15, 3 (2012), 195--203.","paperID":"None"},{"content":"Bransford, J. D., Brown, A. L., Cocking, R. R., et al. How people learn. National Academy Press Washington, DC, 2000.","paperID":"None"},{"content":"Ruth Colvin Clark , Richard E. Mayer, e-Learning and the Science of Instruction: Proven Guidelines for Consumers and Designers of Multimedia Learning, Pfeiffer & Company, 2007","paperID":"1543678"},{"content":"Clark, R. E. Reconsidering research on learning from media. Review of educational research 53, 4 (1983), 445--459.","paperID":"None"},{"content":"Clark, R. E. Media will never influence learning. Educational technology research and development 42, 2 (1994), 21--29.","paperID":"None"},{"content":"Guoqiang Cui , Barbara Lockee , Cuiqing Meng, Building modern online social presence: A review of social presence theory and its instructional design implications for future trends, Education and Information Technologies, v.18 n.4, p.661-685, December  2013","paperID":"2558262"},{"content":"Dunn, R. S., and Dunn, K. J. Teaching secondary students through their individual learning styles: Practical approaches for grades 7--12. Allyn & Bacon, 1993.","paperID":"None"},{"content":"Farroni, T., Johnson, M. H., Menon, E., Zulian, L., Faraguna, D., and Csibra, G. Newborns' preference for face-relevant stimuli: Effects of contrast polarity. Proceedings of the National Academy of Sciences of the USA of America 102, 47 (2005), 17245--17250.","paperID":"None"},{"content":"Goren, C. C., Sarty, M., and Wu, P. Y. Visual following and pattern discrimination of face-like stimuli by newborn infants. Pediatrics 56, 4 (1975), 544--549.","paperID":"None"},{"content":"Hartman, F. R. Single and multiple channel communication: A review of research and a proposed model. Audiovisual communication review 9, 6 (1961), 235--262.","paperID":"None"},{"content":"Holsanova, J., Holmberg, N., and Holmqvist, K. Reading information graphics: The role of spatial contiguity and dual attentional guidance. Applied Cognitive Psychology 23, 9 (2009), 1215--1226.","paperID":"None"},{"content":"Bruce D. Homer , Jan L. Plass , Linda Blake, The effects of video on cognitive load and social presence in multimedia-learning, Computers in Human Behavior, v.24 n.3, p.786-797, May, 2008","paperID":"1347590"},{"content":"Johnson, C. I., and Mayer, R. E. An eye movement analysis of the spatial contiguity effect in multimedia learning. Journal of Experimental Psychology: Applied 18, 2 (2012), 178.","paperID":"None"},{"content":"Johnson, M. H., Dziurawiec, S., Ellis, H., and Morton, J. Newborns' preferential tracking of face-like stimuli and its subsequent decline. Cognition 40, 1 (1991), 1--19.","paperID":"None"},{"content":"Just, M. A., and Carpenter, P. A. A theory of reading: From eye fixations to comprehension. Psychological review 87 (1980), 329--354.","paperID":"None"},{"content":"René F. Kizilcec , Chris Piech , Emily Schneider, Deconstructing disengagement: analyzing learner subpopulations in massive open online courses, Proceedings of the Third International Conference on Learning Analytics and Knowledge, April 08-13, 2013, Leuven, Belgium","paperID":"2460330"},{"content":"Kolowich, S. The professors who make the moocs. Chronicle of Higher Education 59, 28 (2013), A20--A23.","paperID":"None"},{"content":"Kozma, R. B. Learning with media. Review of educational research 61, 2 (1991), 179--211.","paperID":"None"},{"content":"Kozma, R. B. Will media influence learning reframing the debate. Educational technology research and development 42, 2 (1994), 7--19.","paperID":"None"},{"content":"Lewin, T. Students rush to web classes, but profits may be much later. The New York Times 6 (January 2013).","paperID":"None"},{"content":"Alendra Lyons , Stephen Reysen , Lindsey Pierce, Video lecture format, student technological efficacy, and social presence in online courses, Computers in Human Behavior, v.28 n.1, p.181-186, January, 2012","paperID":"2064415"},{"content":"Mayer, R. E. Principles of multimedia learning based on social cues: Personalization, voice, and image principles. In The Cambridge handbook of multimedia learning, R. E. Mayer, Ed. Cambridge University Press, New York, NY, 2005, 201--212.","paperID":"None"},{"content":"Mayer, R. E., and DaPra, C. S. An embodiment effect in computer-based learning with animated pedagogical agents. Journal of Experimental Psychology: Applied 18, 3 (2012), 239.","paperID":"None"},{"content":"Mayer, R. E., and Moreno, R. A split-attention effect in multimedia learning: Evidence for dual processing systems in working memory. Journal of educational psychology 90, 2 (1998), 312.","paperID":"None"},{"content":"Mayer, R. E., and Moreno, R. Nine ways to reduce cognitive load in multimedia learning. Educational psychologist 38, 1 (2003), 43--52.","paperID":"None"},{"content":"Moore, M. G. Independent study. Redefining the discipline of adult education 5 (1980), 16--31.","paperID":"None"},{"content":"Moreno, R., Mayer, R. E., Spires, H. A., and Lester, J. C. The case for social agency in computer-based teaching: Do students learn more deeply when they interact with animated pedagogical agents? Cognition and Instruction 19, 2 (2001), 177--213.","paperID":"None"},{"content":"Plass, J. L., Chun, D. M., Mayer, R. E., and Leutner, D. Supporting visual and verbal learning preferences in a second-language multimedia learning environment. Journal of educational psychology 90, 1 (1998), 25.","paperID":"None"},{"content":"Byron Reeves , Clifford Nass, The media equation: how people treat computers, television, and new media like real people and places, Cambridge University Press, New York, NY, 1996","paperID":"236605"},{"content":"Rosengrant, D., Hearrington, D., Alvarado, K., and Keeble, D. Following student gaze patterns in physical science lectures. In AIP Conference Proceedings, vol. 1413 (2012), 323.","paperID":"None"},{"content":"Schmidt-Weigand, F., Kohnert, A., and Glowalla, U. A closer look at split visual attention in system-and self-paced instruction in multimedia learning. Learning and Instruction 20, 2 (2010), 100--110.","paperID":"None"},{"content":"Soloman, B. A., and Felder, R. M. Index of learning styles. http://www2.ncsu.edu/unity/lockers/users/f/felder/public/ILSdir/ILS-a.htm (2004).","paperID":"None"},{"content":"Sweller, J. Cognitive load theory, learning difficulty, and instructional design. Learning and instruction 4, 4 (1994), 295--312.","paperID":"None"},{"content":"van Gog, T., and Scheiter, K. Eye tracking as a tool to study and enhance multimedia learning. Learning and Instruction 20, 2 (2010), 95--99.","paperID":"None"},{"content":"Waldrop, M. M., and magazine, N. Massive Open Online Courses, aka MOOCs, Transform Higher Education and Science, March 2013.","paperID":"None"},{"content":"Ning Wang , W. Lewis Johnson , Richard E. Mayer , Paola Rizzo , Erin Shaw , Heather Collins, The politeness effect: Pedagogical agents and learning outcomes, International Journal of Human-Computer Studies, v.66 n.2, p.98-112, February, 2008","paperID":"1322755"}],"abstract":"The amount of online educational content is rapidly increasing, particularly in the form of video lectures. The goal is to design video instruction to facilitate an experience that maximizes learning and satisfaction. A widely used but understudied design element in video instruction is the overlay of a small video of the instructor over lecture slides. We conducted an experiment with eye-tracking and recall tests to investigate how adding the instructor's face to video instruction affects information retention, visual attention, and affect. Participants strongly preferred instruction with the face and perceived it as more educational. They spent about 41% of time looking at the face and switched between the face and slide every 3.7 seconds. Consistent with prior work, no significant difference in short- and medium-term recall ability was found. Including the face in video instruction is encouraged based on learners' positive affective response. More fine-grained analytics combining eye-tracking with detailed learning assessment could shed light on the mechanisms by which the face aids or hinders learning.","video":"http://www.youtube.com/embed/luXSyhrN2Js?rel=0","title":"Showing face in video instruction: effects on information retention, visual attention, and affect","filename":"CHI14/p2095","authors":["René F. Kizilcec","Kathryn Papadopoulos","Lalida Sritanyaratana"],"conference":"CHI '14"}