{"paperId":2557348,"citation":[{"content":"Chenhao Tan , Lillian Lee, All Who Wander: On the Prevalence and Characteristics of Multi-community Engagement, Proceedings of the 24th International Conference on World Wide Web, May 18-22, 2015, Florence, Italy","paperID":"2741661"}],"reference":[{"content":"Baum, J. A., & Shipilov, A. V. (2006). 1.2 Ecological Approaches to Organizations. The SAGE Handbook of Organization Studies, 55.","paperID":"None"},{"content":"Yochai Benkler, The Wealth of Networks: How Social Production Transforms Markets and Freedom, Yale University Press, New Haven, CT, 2006","paperID":"1214507"},{"content":"Brian S. Butler, Membership Size, Communication Activity, and Sustainability: A Resource-Based Model of Online Social Structures, Information Systems Research, v.12 n.4, p.346-362, December 2001","paperID":"769273"},{"content":"Jilin Chen , Yuqing Ren , John Riedl, The effects of diversity on group productivity and member withdrawal in online volunteer groups, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753447"},{"content":"Cothrel, J. P. Measuring the success of an online community. Strategy & Leadership 28, 2 (2000), 17--21.","paperID":"None"},{"content":"Granovetter, M. S. (1973). The strength of weak ties. American journal of sociology, 78(6), 1360.","paperID":"None"},{"content":"Hannan, M. T., & Freeman, J. (1977). The population ecology of organizations. American journal of sociology, 929--964.","paperID":"None"},{"content":"Ingram, P. and Baum, J. A. C. (1997) 'Opportunity and constraint: Organizations' learning from the operating and competitive experience of industries', Strategic Management Journal, 18: 75--98.","paperID":"None"},{"content":"Alicia Iriberri , Gondy Leroy, A life-cycle perspective on online community success, ACM Computing Surveys (CSUR), v.41 n.2, p.1-29, February 2009","paperID":"1459356"},{"content":"Sanjay Ram Kairam , Dan J. Wang , Jure Leskovec, The life and death of online groups: predicting group growth and longevity, Proceedings of the fifth ACM international conference on Web search and data mining, February 08-12, 2012, Seattle, Washington, USA","paperID":"2124374"},{"content":"Amy Jo Kim, Community Building on the Web: Secret Strategies for Successful Online Communities, Addison-Wesley Longman Publishing Co., Inc., Boston, MA, 2000","paperID":"518514"},{"content":"Robert E. Kraut , Paul Resnick , Sara Kiesler , Yuqing Ren , Yan Chen , Moira Burke , Niki Kittur , John Riedl , Joseph Konstan, Building Successful Online Communities: Evidence-Based Social Design, The MIT Press, 2012","paperID":"2207798"},{"content":"Robert E. Kraut , Andrew T. Fiore, The role of founders in building online groups, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531648"},{"content":"Lazar, J. and Preece, J. (1998) Classification schema for online communities. Proc. of AISAC, 84--86.","paperID":"None"},{"content":"Michael Muller , Kate Ehrlich , Tara Matthews , Adam Perer , Inbal Ronen , Ido Guy, Diversity among enterprise online communities: collaborating, teaming, and innovating through social media, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208685"},{"content":"O'Mahony, & Ferraro, F. (2007). The Emergence of Governance in an Open Source Community. Academy of Management Journal, 50(5), 1079--1106.","paperID":"None"},{"content":"Preece, J., & Maloney-Krichmar, D. (2003). Online communities. In J. Jacko & A. A. Sears (Eds.), Handbook of human-computer interaction (596--620).","paperID":"None"},{"content":"Resnick, P., Konstan, J., Chen, Y., & Kraut, R. E. (2012). 6 Starting New Online Communities. Building successful online communities: Evidence-based social design. Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Gerard Salton , Christopher Buckley, Term-weighting approaches in automatic text retrieval, Information Processing and Management: an International Journal, v.24 n.5, p.513-523, 1988","paperID":"54260"},{"content":"Seidman, I. (1998) Interviewing as Qualitative Research: A Guide for Researchers in Education And the Social Sciences. Teachers College Press, New York.","paperID":"None"},{"content":"Xiaoqing Wang , Brian S. Butler , Yuqing Ren, The Impact of Membership Overlap on Growth: An Ecological Competition View of Online Groups, Organization Science, v.24 n.2, p.414-431, March-April 2013","paperID":"2465181"},{"content":"Yelle, L. E. (1979). The learning curve: Historical review and comprehensive survey. Dec. Sci., 10(2), 302.","paperID":"None"},{"content":"Haiyi Zhu , Robert Kraut , Aniket Kittur, Effectiveness of shared leadership in online communities, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145269"},{"content":"Haiyi Zhu , Robert E. Kraut , Aniket Kittur, The impact of membership overlap on the survival of online communities, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557213"}],"abstract":"Online communities serve various important functions, but many fail to thrive. Research on community success has traditionally focused on internal factors. In contrast, we take an ecological view to understand how the success of a community is influenced by other communities. We measured a community's relationship with other communities - its \"niche\" - through four dimensions: topic overlap, shared members, content linking, and shared offline organizational affiliation. We used a mixed-method approach, combining the quantitative analysis of 9495 online enterprise communities and interviews with community members. Our results show that too little or too much overlap in topic with other communities causes a community's activity to suffer. We also show that this main result is moderated in predictable ways by whether the community shares members with, links to content in, or shares an organizational affiliation with other communities. These findings provide new insight on community success, guiding online community designers on how to effectively position their community in relation to others.","video":"http://www.youtube.com/embed/lnG95PwK-HA?rel=0","title":"Selecting an effective niche: an ecological view of the success of online communities","filename":"CHI14/p301","authors":["Haiyi Zhu","Jilin Chen","Tara Matthews","Aditya Pal","Hernan Badenes","Robert E. Kraut"],"conference":"CHI '14"}