{"paperId":2557245,"citation":[],"reference":[{"content":"Aarseth, E. J. Cybertext. Balto., MD: JHU Press, 1997.","paperID":"None"},{"content":"Barthes, R., & Duisit, L. An Introduction to the Structural Analysis of Narrative. New Literary History, 6(2), (1975), 237--272.","paperID":"None"},{"content":"Steve Benford , Gabriella Giannachi , Boriana Koleva , Tom Rodden, From interaction to trajectories: designing coherent journeys through user experiences, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518812"},{"content":"Bizzocchi, J., Lin, M. A. B., & Tanenbaum, J. Games, narrative and the design of interface. Int'l Journal of Arts and Technology, 4(4), (2011), 460--479.","paperID":"None"},{"content":"Elizabeth Bonsignore , Kari Kraus , Amanda Visconti , Derek Hansen , Ann Fraistat , Allison Druin, Game design for promoting counterfactual thinking, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208357"},{"content":"Bonsignore, E., Hansen, D., Kraus, K., & Ruppel, M. ARGs as Platforms for Practicing 21st-Century Literacies. IJLM, 4(1), (2012), 25--54.","paperID":"None"},{"content":"Charmaz, K. (2006). Constructing grounded theory. Thousand Oaks, CA: Sage Publications.","paperID":"None"},{"content":"Dena, C. Emerging Participatory Culture Practices: Player-Created Tiers in Alternate Reality Games. Convergence, 14(1), (2008), 41--57.","paperID":"None"},{"content":"William W. Gaver , Jacob Beaver , Steve Benford, Ambiguity as a resource for design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642653"},{"content":"Elizabeth Goodman , Erik Stolterman , Ron Wakkary, Understanding interaction design practices, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979100"},{"content":"Derek Hansen , Elizabeth Bonsignore , Marc Ruppel , Amanda Visconti , Kari Kraus, Designing reusable alternate reality games, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466203"},{"content":"Katherine Isbister , Mary Flanagan , Chelsea Hash, Designing games for learning: insights from conversations with designers, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753637"},{"content":"Jenkins, H. Convergence culture: where old and new media collide. NY: New York Univ. Press, 2006.","paperID":"None"},{"content":"Jeffrey Y. Kim , Jonathan P. Allen , Elan Lee, Alternate reality gaming, Communications of the ACM, v.51 n.2, p.36-42, February 2008","paperID":"1314222"},{"content":"Lazar, J., Feng, J. H., & Hochheiser, H. Research methods in HCI. West Sussex, UK: Wiley, 2010.","paperID":"None"},{"content":"Martin, A., Thompson, B., & Chatfield, T. ARG White Paper: IGDA ARG SIG. 2006. http://bit.ly/18rxSWX.","paperID":"None"},{"content":"McGonigal, J. Why I Love Bees: A Case Study in Collective Intelligence Gaming. In K. Salen (Ed.), The Ecology of Games. Cambridge, MA: MIT Press, 2008.","paperID":"None"},{"content":"Ruppel, M. Narrative Convergence, Cross-Sited Productions and the Archival Dilemma. Convergence, 15(3), (2009), 281--298.","paperID":"None"},{"content":"Katie Salen , Eric Zimmerman, Rules of Play: Game Design Fundamentals, The MIT Press, 2003","paperID":"1215723"},{"content":"Schön, D. The Reflective Practitioner. New York, NY: Basic Books, 1984.","paperID":"None"},{"content":"Seely-Brown, J., Denning, S., Prusak, L., & Groh, K. Storytelling in organizations. Boston: Elsevier, 2004.","paperID":"None"},{"content":"Van Dam, A., Balsamo, A., Brinkman, D., & Watrall, E. Big Heritage, Big Quilts & Big Canvases. SXSW Interactive Panel, 2013. http://bit.ly/16aBpIj","paperID":"None"},{"content":"Wardrip-Fruin, N., & Harrigan, P. (Eds.). First person: new media as story, performance, and game. Cambridge, MA: MIT Press.","paperID":"None"}],"abstract":"This paper presents insights from designers of Alternate Reality Games (ARGs) regarding the design tactics they employ to integrate participatory storytelling and \"authentic fiction\" into the transmedia experiences they create. Our approach was motivated by recent efforts in HCI to more closely align the development of interaction design theory to the craft knowledge and experiences of designers themselves. The resulting insights enhance our understanding of design approaches that a diverse group of ARG producers follow to create interactive, participatory narratives. We outline narrative-specific themes to support designers who craft similar interactive experiences.","video":"http://www.youtube.com/embed/GRtembxx_GI?rel=0","title":"Design tactics for authentic interactive fiction: insights from alternate reality game designers","filename":"CHI14/p947","authors":["Elizabeth Bonsignore","Vicki Moulder","Carman Neustaedter","Derek Hansen","Kari Kraus","Allison Druin"],"conference":"CHI '14"}