{"paperId":2557115,"citation":[{"content":"Kamila R. H. Rodrigues , Lucas F. Bocanegra , Vinícius P. Gonçalves , Vinícius G. Carvalho , Vânia P. A. Neris, Enriquecimento de personas para apoio ao design de aplicações terapêuticas para a saúde mental, Proceedings of the 13th Brazilian Symposium on Human Factors in Computing Systems, October 27-31, 2014, Foz do Iguaçu, Brazil","paperID":"2738066"},{"content":"Susanne Lindberg , Pontus Wärnestål , Jens Nygren , Petra Svedberg, Designing digital peer support for children: design patterns for social interaction, Proceedings of the 2014 conference on Interaction design and children, June 17-20, 2014, Aarhus, Denmark","paperID":"2593972"},{"content":"Irith Williams , Margot Brereton , Jared Donovan , Karalyn McDonald , Tanya Millard , Alex Tam , Julian H. Elliott, A Collaborative Rapid Persona-Building Workshop: Creating Design Personas with Health Researchers, International Journal of Sociotechnology and Knowledge Development, v.6 n.2, p.17-35, April 2014","paperID":"2670936"},{"content":"Susanne Lindberg , Michel Thomsen , Maria Åkesson, Ethics in health promoting PD: designing digital peer support with children cured from cancer, Proceedings of the 13th Participatory Design Conference: Research Papers, October 06-10, 2014, Windhoek, Namibia","paperID":"2661449"}],"reference":[{"content":"Alissa N. Antle, Child-based personas: need, ability and experience, Cognition, Technology and Work, v.10 n.2, p.155-166, March 2008","paperID":"1356044"},{"content":"Antonovsky, A. 1979. Health, Stress and Coping. San Francisco: Jossey-Bass.","paperID":"None"},{"content":"Hugh Beyer, Contextual Design: Defining Customer-Centered Systems, Morgan Kaufmann Publishers Inc., San Francisco, CA, 1997","paperID":"523184"},{"content":"Susanne Bødker, Creating conditions for participation: conflicts and resources in systems development, Human-Computer Interaction, v.11 n.3, p.215-236, September 1996","paperID":"1462961"},{"content":"Coyne, I. 2010. Accessing children as research participants: examining the role of gatekeepers. Child: care, health and development, 36(4), 452--454.","paperID":"None"},{"content":"Coyne, I., Hayes, E., Gallagher, P. 2009. Research with hospitalized children. Ethical, methodological and organizational challenges. Childhood, 16(3), 413--429.","paperID":"None"},{"content":"Alan Cooper , Paul Saffo, The  Inmates Are Running the Asylum, Macmillan Publishing Co., Inc., Indianapolis, IN, 1999","paperID":"553473"},{"content":"Alan Cooper , Robert Reimann , Dave Cronin, About face 3: the essentials of interaction design, John Wiley & Sons, Inc., New York, NY, 2007","paperID":"1406522"},{"content":"Druin A. 2002. The role of children in the design of new technology. Journal of Behavior and Information Technology, 21(1), 1--25.","paperID":"None"},{"content":"Allison Druin, Cooperative inquiry: developing new technologies for children with children, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.592-599, May 15-20, 1999, Pittsburgh, Pennsylvania, USA","paperID":"303166"},{"content":"Einberg, E., Svedberg, P., Enskär, K., CHIPS study group, Nygren, J. M. 2013. Friendship relations from the perspective of children with experience of cancer treatment. Manuscript in preparation.","paperID":"None"},{"content":"Eiser, C. 2007. Beyond survival: quality of life and follow-up after childhood cancer. Journal of Pediatric Psychology 32(9), 1140'1150.","paperID":"None"},{"content":"Elo, S, Kyngäs, H. 2008. The qualitative content analysis process. Journal of Advanced Nursing, 62(1), 107'115,","paperID":"None"},{"content":"Fargas-Malet, M., McSherry D., Larkin, E. & Robinson, C. 2010. Research with children: methodological issues and innovative techniques. Journal of Early Childhood Research, 8(2), 175'192.","paperID":"None"},{"content":"Franca Garzotto, Broadening children's involvement as design partners: from technology to, Proceedings of the 7th international conference on Interaction design and children, June 11-13, 2008, Chicago, Illinois","paperID":"1463755"},{"content":"Kim Goodwin, Designing for the Digital Age: How to Create Human-Centered Products and Services, Wiley Publishing, 2009","paperID":"1550878"},{"content":"Guba, E.G., Lincoln, Y.S. 1989. Fourth Generation Evaluation. California: Sage Publications.","paperID":"None"},{"content":"Guha, M. L., Druin, A., Fails, J. A. 2013. Cooperative Inquiry revisited: Reflections of the past and guidelines for the future of intergenreational co-design. International Journal of Child-Computer Interaction, 2013, 1(1), 14--23.","paperID":"None"},{"content":"Libby Hanna , Kirsten Risden , Mary Czerwinski , Kristin J. Alexander, The role of usability research in designing children's computer products, The design of children's technology, Morgan Kaufmann Publishers Inc., San Francisco, CA, 1998","paperID":"303433"},{"content":"Heary, C. M., Hennessy, E. 2002. The use of focus group interviews in pediatric health care research. Journal of Pediatric Psychology, 27(1), 47--57.","paperID":"None"},{"content":"Alan R. Hevner , Salvatore T. March , Jinsoo Park , Sudha Ram, Design science in information systems research, MIS Quarterly, v.28 n.1, p.75-105, March 2004","paperID":"2017217"},{"content":"Iversen, O. S., Dindler, C. 2013. A Utopian Agenda in Child-Computer Interaction. International Journal of Child-Computer Interaction, 1(1), 14--23.","paperID":"None"},{"content":"Kolko, J. 2011. Exposing the Magic of Design. Oxford University Press.","paperID":"None"},{"content":"Krippendorf, K. 2004. Content Analysis: An Introduction to Its Methodology. 2nd ed. Sage publication Inc.","paperID":"None"},{"content":"Susanne Lindberg, Participatory design workshops with children with cancer: lessons learned, Proceedings of the 12th International Conference on Interaction Design and Children, p.332-335, June 24-27, 2013, New York, New York","paperID":"2485840"},{"content":"Neema Moraveji , Jason Li , Jiarong Ding , Patrick O'Kelley , Suze Woolf, Comicboarding: using comics as proxies for participatory design with children, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240832"},{"content":"Christiane Moser , Verena Fuchsberger , Manfred Tscheligi, Using probes to create child personas for games, Proceedings of the 8th International Conference on Advances in Computer Entertainment Technology, November 08-11, 2011, Lisbon, Portugal","paperID":"2071472"},{"content":"Mullaney, T., Pettersson, H., Nyholm, T., Stolterman, E. 2012. Thinking Beyond the Cure: A Case for HumanCentered Design in Cancer Care. International Journal of Design, 6(3), 27--39.","paperID":"None"},{"content":"Pruitt, J., Adlin, T. 2006. The Persona Lifecycle. San Francisco: Morgan Kaufmann.","paperID":"None"},{"content":"John Pruitt , Jonathan Grudin, Personas: practice and theory, Proceedings of the 2003 conference on Designing for user experiences, June 06-07, 2003, San Francisco, California","paperID":"997089"},{"content":"Robert, G. 2007. Bringing User Experience to Healthcare Improvement: The Concepts, Methods and Practices of Experience-based Design. Radcliffe.","paperID":"None"},{"content":"Cornelia M. Ruland , Justin Starren , Torun M. Vatne, Participatory design with children in the development of a support system for patient-centered care in pediatric oncology, Journal of Biomedical Informatics, v.41 n.4, p.624-635, August, 2008","paperID":"1389757"},{"content":"Douglas Schuler , Aki Namioka, Participatory Design: Principles and Practices, L. Erlbaum Associates Inc., Hillsdale, NJ, 1993","paperID":"563076"},{"content":"Sprangers MA, Schwartz CE. 1999. Integrating response shift into health-related quality of life research: a theoretical model. Soc Sci Med. 48(11), 1507--1515.","paperID":"None"},{"content":"Solomon P. 2004. Peer support/peer provided services underlying processes, benefits, and critical ingredients. Psychiatric Rehabilitation Journal 27(4), 392--401.","paperID":"None"},{"content":"Stinson, J. N., White, M., Breakey, V., Chong, A.L, Mak, I, Low, K.K., Low, A.K. 2011. Perspectives on quality and content of information on the internet for adolescents with cancer. Pediatric Blood and Cancer. 15, 57(1):97--104","paperID":"None"},{"content":"Söderbäck, M., Coyne, I., Harder, M. 2011. The importance of including both a child perspective and the child's perspective within health care settings to provide truly child-centred care. Journal of Child Health Care. 15(2):99--106.","paperID":"None"},{"content":"Peter Wright , John McCarthy, Empathy and experience in HCI, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357156"},{"content":"Pontus Wärnestål , Jens Nygren, Building an experience framework for a digital peer support service for children surviving from cancer, Proceedings of the 12th International Conference on Interaction Design and Children, p.269-272, June 24-27, 2013, New York, New York","paperID":"2485794"},{"content":"John Zimmerman , Jodi Forlizzi , Shelley Evenson, Research through design as a method for interaction design research in HCI, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240704"}],"abstract":"The availability of health-promoting resources for young children diagnosed with cancer who are transitioning from intensive care to everyday life is limited. In the context of designing digital peer support services for children who are considered vulnerable due to clinical and age-related aspects, there are several challenges that put critical requirements on a user-centered design process. This paper reports on a new method for co-constructing child-personas that are tailored for developing health-promoting services where empirical data is restricted due to practical and ethical reasons. In particular, we are proposing to focus children design workshop sessions on salutogenesis, and complement this with a pathogenic perspective by interviewing healthcare professionals and parents. We also introduce the use of proxy personas, and redemption scenarios in the form of comicboards, both collaboratively constructed by children and designers through storytelling. By applying four progressive steps of data collection and analysis we arrive at authentic child-personas that can be used to design and develop health-promoting services for children in vulnerable life stages.","video":"http://www.youtube.com/embed/PdJcM6uyROY?rel=0","title":"Co-constructing child personas for health-promoting services with vulnerable children","filename":"CHI14/p3767","authors":["Pontus Wärnestål","Petra Svedberg","Jens Nygren"],"conference":"CHI '14"}