{"paperId":2557406,"reference":[{"content":"Takeshi Asano , Ehud Sharlin , Yoshifumi Kitamura , Kazuki Takashima , Fumio Kishino, Predictive interaction using the delphian desktop, Proceedings of the 18th annual ACM symposium on User interface software and technology, October 23-26, 2005, Seattle, WA, USA","paperID":"1095058"},{"content":"Gökçen Aslan Aydemir , Patrick M. Langdon , Simon Godsill, User target intention recognition from cursor position using kalman filter, Proceedings of the 7th international conference on Universal Access in Human-Computer Interaction: design methods, tools, and interaction techniques for eInclusion, July 21-26, 2013, Las Vegas, NV","paperID":"2526351"},{"content":"Baudisch, P., Cutrell, E., Robbins, D., Czerwinski, M., Tandler, P., Bederson, B. and Zierlinger, A. (2003). Drag-and-Pop and Drag-and-Pick: Techniques for accessing remote screen content on touch- and pen-operated systems. Proceedings of the 9th IFIP TC13 Int'l Conference on Human-Computer Interaction (INTERACT '03). Zurich, Switzerland (September 1--5, 2003). Amsterdam, The Netherlands: IOS Press, pp. 57--64.","paperID":"None"},{"content":"Biswas, P., Aydemir, G.A., Langdon, P. and Godsill, S. (2013). Intent recognition using neural networks and Kalman filters. Proceedings of Human-Computer Interaction and Knowledge Discovery (HCI-KDD '13). Maribor, Slovenia (July 1--3, 2013). Lecture Notes in Computer Science 794 Berlin, Germany: SpringerVerlag, 112--123.","paperID":"None"},{"content":"Casiez, G., Vogel, D., Balakrishnan, R. and Cockburn, A. (2008). The impact of control-display gain on user performance in pointing tasks. Human-Computer Interaction 23 (3), 215--250.","paperID":"None"},{"content":"Chang, C.-h.J., Amick, B.C., Menendez, C.C., Katz, J.N., Johnson, P.W., Robertson, M. and Dennerlein, J.T. (2007). Daily computer usage correlated with undergraduate students' musculoskeletal symptoms. American Journal of Industrial Medicine 50 (6), 481--488.","paperID":"None"},{"content":"Morgan Dixon , James Fogarty , Jacob Wobbrock, A general-purpose target-aware pointing enhancement using pixel-level analysis of graphical interfaces, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208734"},{"content":"Abigail Evans , Jacob Wobbrock, Taming wild behavior: the input observer for obtaining text entry and mouse pointing measures from everyday computer use, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208338"},{"content":"Fisher, R., Perkins, S., Walker, A. and Wolfart, E. (2003). Gaussian smoothing. Hypermedia Image Processing Reference. Edinburgh, Scotland: University of Edinburgh.","paperID":"None"},{"content":"Flash, T. and Hogan, N. (1985). The coordination of arm movements: An experimentally confirmed mathematical model. The Journal of Neuroscience 5 (7), 1688--1703.","paperID":"None"},{"content":"Faustina Hwang , Simeon Keates , Patrick Langdon , P. John Clarkson, Multiple haptic targets for motion-impaired computer users, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642620"},{"content":"Johnson, P.W., Dropkin, J., Hewes, J. and Rempel, D.M. (1993). Office ergonomics: Motion analysis of computer mouse usage. Proceedings of the American Industrial Hygiene Conference and Exposition (AIHCE '93). New Orleans, Louisiana (May 15--21, 1993). Falls Church, Virginia: American Industrial Hygiene Association, 12--13.","paperID":"None"},{"content":"Keuning-Van Oirschot, H. and Houtsma, A.J.M. (2001). Cursor displacement and velocity profiles for targets in various locations. Proceedings of EuroHaptics 2001. Birmingham, United Kingdom (July 1--4, 2001). Paris, France: EuroHaptics Society, 108--112.","paperID":"None"},{"content":"Lane, D.M., Peres, S.C., Sandor, A. and Napier, H.A. (2005). A process for anticipating and executing icon selection in graphical user interfaces. International Journal of Human-Computer Interaction 19 (2), 241252.","paperID":"None"},{"content":"Edward Lank , Yi-Chun Nikko Cheng , Jaime Ruiz, Endpoint prediction using motion kinematics, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240724"},{"content":"Michael McGuffin , Ravin Balakrishnan, Acquisition of expanding targets, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 20-25, 2002, Minneapolis, Minnesota, USA","paperID":"503388"},{"content":"Mikkelsen, S., Vilstrup, I., Lassen, C.F., Kryger, A.I., Thomsen, J.F. and Andersen, J.H. (2007). Validity of questionnaire self-reports on computer, mouse and keyboard usage during a four-week period. Occupational and Environmental Medicine 64 (8), 541--547.","paperID":"None"},{"content":"Murata, A. (1998). Improvement of pointing time by predicting targets in pointing with a PC mouse. International Journal of Human-Computer Interaction 10 (1), 23--32.","paperID":"None"},{"content":"Ruiz, J. and Lank, E. (2009). Effects of target size and distance on kinematic endpoint prediction. Technical Report CS-2009--25. Cheriton School of Computer Science. Waterloo, Ontario: University of Waterloo.","paperID":"None"},{"content":"Jaime Ruiz , Edward Lank, Speeding pointing in tiled widgets: understanding the effects of target expansion and misprediction, Proceedings of the 15th international conference on Intelligent user interfaces, February 07-10, 2010, Hong Kong, China","paperID":"1720002"},{"content":"Takagi, R., Kitamura, Y., Naito, S. and Kishino, F. (2002). A fundamental study on error-corrective feedback movement in a positioning task Proceedings of the 5th Asia-Pacific Conference on Computer-Human Interaction (APCHI '02). Beijing, China (November 1--4, 2002). Beijing, China: Science Press, 160--172.","paperID":"None"},{"content":"Jacob O. Wobbrock , James Fogarty , Shih-Yen (Sean) Liu , Shunichi Kimuro , Susumu Harada, The angle mouse: target-agnostic dynamic gain adjustment based on angular deviation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518912"},{"content":"Brian Ziebart , Anind Dey , J. Andrew Bagnell, Probabilistic pointing target prediction via inverse optimal control, Proceedings of the 2012 ACM international conference on Intelligent User Interfaces, February 14-17, 2012, Lisbon, Portugal","paperID":"2166968"}],"citation":[{"content":"Elie Cattan , Amélie Rochet-Capellan , Pascal Perrier , François Bérard, Reducing Latency with a Continuous Prediction: Effects on Users' Performance in Direct-Touch Target Acquisitions, Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces, November 15-18, 2015, Madeira, Portugal","paperID":"2817736"},{"content":"Hugo Nicolau , Kyle Montague , Tiago Guerreiro , André Rodrigues , Vicki L. Hanson, Typing Performance of Blind Users: An Analysis of Touch Behaviors, Learning Effect, and In-Situ Usage, Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, October 26-28, 2015, Lisbon, Portugal","paperID":"2809861"},{"content":"Martez E. Mott , Jacob O. Wobbrock, Beating the bubble: using kinematic triggering in the bubble lens for acquiring small, dense targets, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557410"}],"abstract":"We present a new method of predicting the endpoints of mouse movements. While prior approaches to endpoint prediction have relied upon normative kinematic laws, regression, or control theory, our approach is straightforward but kinematically rich. Our key insight is to regard the unfolding velocity profile of a pointing movement as a 2-D stroke gesture and to use template matching to predict the endpoint based on prior observed movements. We call our technique kinematic template matching (KTM), which is simple to implement, user-adaptable, and kinematically expressive. In a study of 17 able-bodied participants evaluated over movement amplitudes ranging from 100-800 pixels, we found KTM to predict endpoints that were within 83 pixels of the true endpoint at 50% of the way through the movement, within 48 pixels at 75%, and within 39 pixels at 90%, using 1000 templates per participant. These accuracies make KTM as successful an approach to endpoint prediction as any prior technique, while being easier to implement and understand than most.","video":"http://www.youtube.com/embed/gUO6nR7U964?rel=0","title":"Mouse pointing endpoint prediction using kinematic template matching","filename":"CHI14/p743","authors":["Phillip T. Pasqual","Jacob O. Wobbrock"],"conference":"CHI '14"}