{"paperId":2557264,"citation":[{"content":"Luciana A. M. Zaina , Alexandre Alvaro , Paulo Melo, Presente e futuro da formação em IHC: ações da academia e do mercado de software, Proceedings of the 13th Brazilian Symposium on Human Factors in Computing Systems, October 27-31, 2014, Foz do Iguaçu, Brazil","paperID":"2738155"},{"content":"Colin M. Gray , Austin L. Toombs , Shad Gross, Flow of Competence in UX Design Practice, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702579"}],"reference":[{"content":"Arvola, M. and Artman, H. Studio life: The construction of digital design competence. Digital Kompetanse 3, 2 (2008), 78--96.","paperID":"None"},{"content":"Klaus B. Bærentsen , Henning Slavensky, A contribution to the design process, Communications of the ACM, v.42 n.5, p.72-77, May 1999","paperID":"301422"},{"content":"Blokhuis, F.T.L. Evidence-based design of workplace learning. University of Twente, 2006.","paperID":"None"},{"content":"Bødker, S., Ehn, P., Sjögren, D. and Sundblad, Y. Cooperative design perspectives on 20 years with the Scandinavian IT Design Model?. Proc. NordiCHI, (2000), 22--24.","paperID":"None"},{"content":"Brandt, C.B., Cennamo, K., Douglas, S., Vernon, M., McGrath, M. and Reimer, Y. A theoretical framework for the studio as a learning environment. International Journal of Technology and Design Education, (2011).","paperID":"None"},{"content":"Jacob Buur , Susanne Bødker, From usability lab to “design collaboratorium”: reframing usability practice, Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques, p.297-307, August 17-19, 2000, New York City, New York, USA","paperID":"347768"},{"content":"Cross, N. Expertise in design: an overview. Design Studies 25, 5 (2004), 427--441.","paperID":"None"},{"content":"Dorst, K. Design research: a revolution-waiting-tohappen. Design Studies 29, 1 (2008), 4--11.","paperID":"None"},{"content":"Dreyfus, S.E. Formal models vs. human situational understanding: Inherent limitations on the modeling of business expertise (ORC 81--3). Berkeley: Operations Research Center, University of California, (1981).","paperID":"None"},{"content":"Liam Friedland , Jon Innes , Roman Longoria , Wayne Hom , Pradeep Henry , Richard Anderson, Outsourcing & offshoring: impact on the user experience, CHI '05 Extended Abstracts on Human Factors in Computing Systems, April 02-07, 2005, Portland, OR, USA","paperID":"1056866"},{"content":"Danielle Gobert , Virginia Howlett , Carolyn Snyder , Howard Tamler , Thomas S. Tullis , Chauncey Wilson, What the best usability specialists are made of, CHI '02 Extended Abstracts on Human Factors in Computing Systems, April 20-25, 2002, Minneapolis, Minnesota, USA","paperID":"506556"},{"content":"Gray, C.M. Informal peer critique and the negotiation of habitus in a design studio. DRS // CUMULUS, (2013), 702--714.","paperID":"None"},{"content":"Holmlid, S. and Arvola, M. 2007. Developing a thematic design curriculum as a Bologna master. International Conference on Engineering and Product Design Education (2007), 13--14.","paperID":"None"},{"content":"Horváth, I. Design competence development in an academic virtual enterprise. Proc. IDETC/CIE, (2006), 1013.","paperID":"None"},{"content":"Christopher D. Hundhausen , N Hari Narayanan , Martha E. Crosby, Exploring studio-based instructional models for computing education, Proceedings of the 39th SIGCSE technical symposium on Computer science education, March 12-15, 2008, Portland, OR, USA","paperID":"1352271"},{"content":"Knight, P. and Page, A. The assessment of wicked competences: Report to the Practice-based Professional Learning Centre. 2007.","paperID":"None"},{"content":"Koutsabasis, P. and Vosinakis, S. Rethinking HCI Education for Design: Problem-Based Learning and Virtual Worlds at an HCI Design Studio. International Journal of Human-Computer Interaction 28, 8 (2012), 485--499.","paperID":"None"},{"content":"Lawson, B. Schemata, gambits and precedent: some factors in design expertise. Design Studies 25, 5 (2004), 443--457.","paperID":"None"},{"content":"Morelli, N. Globalised Markets and Localised Needs. Educating Designers for a Global Context, (2006).","paperID":"None"},{"content":"Harold G. Nelson , Erik Stolterman, The Design Way: Intentional Change in an Unpredictable World, The MIT Press, 2012","paperID":"2380996"},{"content":"Mika P. Nieminen , Mikael Runonen , Marko Nieminen , Mari Tyllinen, Designer experience: exploring ways to design in experience, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979581"},{"content":"Olsson, E. What active users and designers contribute in the design process. Interacting with computers 16, 2 (2004), 377--401.","paperID":"None"},{"content":"Polanyi, M. The tacit dimension. Anchor Books, Garden City, New York, 1966.","paperID":"None"},{"content":"Reimer, Y.J. and Douglas, S.A. Teaching HCI design with the studio approach. Computer Science Education 13, 3 (2003), 191--205.","paperID":"None"},{"content":"Rychen, D.S. and Salganik, L.H. A holistic model of competence. In Key competencies for a successful life and a well-functioning society. Hogrefe & Huber, Göttingen, Germany, 2003, 41--62.","paperID":"None"},{"content":"Schön, D.A. The reflective practitioner: How professionals think in action. Basic Books, New York, 1983.","paperID":"None"},{"content":"Siegel, M.A. and Stolterman, E. Metamorphosis: Transforming Non-designers into Designers. In Proc. DRS. Sheffield, UK, 2008, 378:1--13.","paperID":"None"},{"content":"Erik Stolterman , James Pierce, Design tools in practice: studying the designer-tool relationship in interaction design, Proceedings of the Designing Interactive Systems Conference, June 11-15, 2012, Newcastle Upon Tyne, United Kingdom","paperID":"2317961"},{"content":"Agnieszka (Aga) Szóstek, A look into some practices behind microsoft UX management, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2212833"},{"content":"Carola Fellenz Thompson , Richard I. Anderson , Irene Au , Cordell Ratzlaff , Nida Zada, Managing user experience: managing change, CHI '10 Extended Abstracts on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753938"},{"content":"Trier, U.P. Defining educational goals: A window to the future. In D.S. Rychen and L.H. Salganik, editor., Defining and selecting key competencies. Hogrefe & Huber, Seattle, WA, 2001, 241--246.","paperID":"None"},{"content":"Vickers, S.G. Judgment. In The Vickers Papers. Harper & Row, London, 1984, 230--245.","paperID":"None"},{"content":"Weinert, F.E. Concept of competence: A conceptual clarification. In D.S. Rychen and L.A. Salganik, editor, Defining and selecting key competencies. Hogrefe & Huber, Seattle, WA, 2001, 45--66","paperID":"None"}],"abstract":"There has been increasing interest in the adoption of UX within corporate environments, and what competencies translate into effective UX design. This paper addresses the space between pedagogy and UX practice through the lens of competence, with the goal of understanding how students are initiated into the practice community, how their perception of competence shifts over time, and what factors influence this shift. A 12-week longitudinal data collection, including surveys and interviews, documents this shift, with participants beginning internships and full-time positions in UX. Students and early professionals were asked to assess their level of competence and factors that influenced competence. A co-construction of identity between the designer and their environment is proposed, with a variety of factors relating to tool and representational knowledge, complexity, and corporate culture influencing perceptions of competence in UX over time. Opportunities for future research, particularly in building an understanding of competency in UX based on this preliminary framing of early UX practice are addressed.","video":"http://www.youtube.com/embed/K3gkgj6KzLc?rel=0","title":"Evolution of design competence in UX practice","filename":"CHI14/p1645","authors":["Colin M. Gray"],"conference":"CHI '14"}