{"paperId":2557086,"citation":[{"content":"Pupil responses to continuous aiming movements, International Journal of Human-Computer Studies, v.83 n.C, p.1-11, November 2015","paperID":"2827178"}],"reference":[{"content":"Abrams, R. A., Meyer, D. E., and Kornblum, S. Eyehand coordination: oculomotor control in rapid aimed limb movements. Journal of Experimental Psychology: Human Perception and Performance 16, 2 (1990), 248--267.","paperID":"None"},{"content":"Beatty, J. Task-evoked pupillary responses, processing load, and the structure of processing resources. Psychological Bulletin 91, 2 (1982), 276--292.","paperID":"None"},{"content":"Berguer, R., Smith, W. D., and Chung, Y. H. Performing laparoscopic surgery is significantly more stressful for the surgeon than open surgery. Surgical Endoscopy 15, 10 (2001), 1204--1207.","paperID":"None"},{"content":"Bradshaw, J. Pupil size as a measure of arousal during information processing. Nature 216, 5114 (1967), 515--516.","paperID":"None"},{"content":"Cassenti, D. N. and Kelley, T. D. Towards the shape of mental workload. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 11 (2006), 1147--1151.","paperID":"None"},{"content":"Chen, H.-J. and Lin, C. J. The investigation of laparoscopic instrument movement control. Lecture Notes in Engineering and Computer Science 2198, 1 (2011), 1309--1313.","paperID":"None"},{"content":"Elliott, D., Helsen, W. F., and Chua, R. A Century Later: Woodworth's (1899) Two-component Model of Goal-directed Aiming. Psychological Bulletin 127, 3 (2001), 342--357.","paperID":"None"},{"content":"Fitts, P. M. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology 47, 6 (1954), 381--391.","paperID":"None"},{"content":"Fitts, P. M. and Peterson, J. R. Information capacity of discrete motor responses. Journal of Experimental Psychology 67, (1964), 103--112.","paperID":"None"},{"content":"Gawron, V. J., Human Workload, in Human Performance, Workload, and Situational Awareness Measures Handbook, Second Edition. 2008, CRC Press. 87--230.","paperID":"None"},{"content":"Goldinger, S. D. and Papesh, M. H. Pupil dilation reflects the creation and retrieval of memories. Current Directions in Psychological Science 21, 2 (2012), 90--95.","paperID":"None"},{"content":"Guthrie, D. and Buchwald, J. S. Significance testing of difference potentials. Psychophysiology 28, 2 (1991), 240--244.","paperID":"None"},{"content":"Hess, E. H. and Polt, J. M. Pupil size in relation to mental activity during simple problem-solving. Science 143, 3611 (1964), 1190--1192.","paperID":"None"},{"content":"Hoeks, B. and Levelt, W. Pupillary dilation as a measure of attention: a quantitative system analysis. Behavior Research Methods 25, 1 (1993), 16--26.","paperID":"None"},{"content":"Shamsi T. Iqbal , Piotr D. Adamczyk , Xianjun Sam Zheng , Brian P. Bailey, Towards an index of opportunity: understanding changes in mental workload during task execution, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 02-07, 2005, Portland, Oregon, USA","paperID":"1055016"},{"content":"Shamsi T. Iqbal , Xianjun Sam Zheng , Brian P. Bailey, Task-evoked pupillary response to mental workload in human-computer interaction, CHI '04 Extended Abstracts on Human Factors in Computing Systems, April 24-29, 2004, Vienna, Austria","paperID":"986094"},{"content":"Jiang, X., Zheng, B., Tien, G., and Atkins, M. S. Pupil response to precision in surgical task execution. Studies in Health Technology and Informatics 184, (2013), 210--214.","paperID":"None"},{"content":"Xianta Jiang , M. Stella Atkins , Geoffrey Tien , Bin Zheng , Roman Bednarik, Pupil dilations during target-pointing respect Fitts' law, Proceedings of the Symposium on Eye Tracking Research and Applications, March 26-28, 2014, Safety Harbor, Florida","paperID":"None"},{"content":"Jeff Klingner , Rakshit Kumar , Pat Hanrahan, Measuring the task-evoked pupillary response with a remote eye tracker, Proceedings of the 2008 symposium on Eye tracking research & applications, March 26-28, 2008, Savannah, Georgia","paperID":"1344489"},{"content":"Marshall, S. P., Method and Apparatus for Eye Tracking and Monitoring Pupil Dilation to Evaluate Cognitive Activity. 2000: USA.","paperID":"None"},{"content":"Moresi, S., et al. Response preparation with adjacent versus overlapped hands: A pupillometric study. International Journal of Psychophysiology 79, 2 (2011), 280--286.","paperID":"None"},{"content":"Otero, S. C., Weekes, B. S., and Hutton, S. B. Pupil size changes during recognition memory. Psychophysiology 48, 10 (2011), 1346--1353.","paperID":"None"},{"content":"Privitera, C. M., Renninger, L. W., Carney, T., Klein, S., and Aguilar, M. Pupil dilation during visual target detection. Journal of Vision 10, 10 (2010), 1--14.","paperID":"None"},{"content":"Richer, F. and Beatty, J. Pupillary dilations in movement preparation and execution. Psychophysiology 22, 2 (1985), 204--207.","paperID":"None"},{"content":"Richstone, L., et al. Eye metrics as an objective assessment of surgical skill. Annals Surgery 252, 1 (2010), 177--182.","paperID":"None"},{"content":"Zheng, B., Cassera, M. A., Martinec, D. V., Spaun, G. O., and Swanstrom, L. L. Measuring mental workload during the performance of advanced laparoscopic tasks. Surgical Endoscopy 24, 1 (2010), 45--50.","paperID":"None"}],"abstract":"Pupil size is known to correlate with the changes of cognitive task workloads, but how the pupil responds to requirements of basic goal-directed motor tasks involved in human-machine interactions is not yet clear. This work conducted a user study to investigate the pupil dilations during aiming in a tele-operation setting, with the purpose of better understanding how the changes in task requirements are reflected by the changes of pupil size. The task requirements, managed by Fitts' index of difficulty (ID), i.e. the size and distance apart of the targets, were varied between tasks, and pupil responses to different task IDs were recorded. The results showed that pupil diameter can be employed as an indicator of task requirements in goal-directed movements-higher task difficulty evoked higher valley to peak pupil dilation, and the peak pupil dilation occurred after a longer delay. These findings contribute to the foundation for developing methods to objectively evaluate interactive task requirements using pupil parameters during goal-directed movements in HCI.","video":"http://www.youtube.com/embed/BsOA6XIzmIk?rel=0","title":"Pupil responses during discrete goal-directed movements","filename":"CHI14/p2075","authors":["Xianta Jiang","M. Stella Atkins","Geoffrey Tien","Roman Bednarik","Bin Zheng"],"conference":"CHI '14"}