{"paperId":2557021,"citation":[{"content":"Florian Heller , Jan Borchers, AudioTorch: using a smartphone as directional microphone in virtual audio spaces, Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, September 23-26, 2014, Toronto, ON, Canada","paperID":"2634220"},{"content":"Yeseul Park , Kyle Koh , Heonjin Park , Jinwook Seo, An Experiment on the Feasibility of Spatial Acquisition using a Moving Auditory Cue for Pedestrian Navigation, Proceedings of the 2015 ACM on International Conference on Multimodal Interaction, November 09-13, 2015, Seattle, Washington, USA","paperID":"2820779"},{"content":"Florian Heller , Jan Borchers, AudioScope: Smartphones as Directional Microphones in Mobile Audio Augmented Reality Systems, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702159"},{"content":"Daniela De Angeli , Eamonn J. O'Neill, Development of an Inexpensive Augmented Reality (AR) Headset, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2732784"}],"reference":[{"content":"Alais, D., and Burr, D. The ventriloquist effect results from near-optimal bimodal integration. Current biology 14, 3 (2004), 257--262.","paperID":"None"},{"content":"Anupriya Ankolekar , Thomas Sandholm , Louis Yu, Play it by ear: a case for serendipitous discovery of places with musicons, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2481411"},{"content":"Blauert, J. Spatial Hearing: Psychophysics of Human Sound Localization, 2nd ed. MIT Press, 1996.","paperID":"None"},{"content":"Brungart, D. S., Simpson, B. D., and Kordik, A. J. The detectability of headtracker latency in virtual audio displays. In Proc. ICAD '05 (2005), 37--42.","paperID":"None"},{"content":"Simon Holland , David R. Morse , Henrik Gedenryd, AudioGPS: Spatial Audio Navigation with a Minimal Attention Interface, Personal and Ubiquitous Computing, v.6 n.4, p.253-259, September 2002","paperID":"591430"},{"content":"Kajastila, R., and Lokki, T. Eyes-free methods for accessing large auditory menus. In Proc. ICAD '10 (2010), 223--230.","paperID":"None"},{"content":"Loomis, J. M., Hebert, C., and Cicinelli, J. G. Active localization of virtual sounds. The Journal of the Acoustical Society of America 88 (1990), 1757.","paperID":"None"},{"content":"Lyons, K., Gandy, M., and Starner, T. Guided by voices: An audio augmented reality system. In Proc. ICAD '00 (2000).","paperID":"None"},{"content":"Wendy E. Mackay, Augmented reality: linking real and virtual worlds: a new paradigm for interacting with computers, Proceedings of the working conference on Advanced visual interfaces, May 24-27, 1998, L'Aquila, Italy","paperID":"948498"},{"content":"Georgios N. Marentakis , Stephen A. Brewster, Effects of feedback, mobility and index of difficulty on deictic spatial audio target acquisition in the horizontal plane, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124826"},{"content":"Nicholas Mariette, Navigation performance effects of render method and head-turn latency in mobile audio augmented reality, Proceedings of the 6th international conference on Auditory Display, May 18-22, 2009, Copenhagen, Denmark","paperID":"2174874"},{"content":"David Mcgookin , Stephen Brewster , Pablo Priego, Audio Bubbles: Employing Non-speech Audio to Support Tourist Wayfinding, Proceedings of the 4th International Conference on Haptic and Audio Interaction Design, September 10-11, 2009, Dresden, Germany","paperID":"1612272"},{"content":"Middlebrooks, J. C., and Green, D. M. Sound localization by human listeners. Annual review of psychology 42, 1 (1991), 135--159.","paperID":"None"},{"content":"Josephine Reid , Richard Hull , Kirsten Cater , Constance Fleuriot, Magic moments in situated mediascapes, Proceedings of the 2005 ACM SIGCHI International Conference on Advances in computer entertainment technology, p.290-293, June 15-17, 2005, Valencia, Spain","paperID":"1178529"},{"content":"Sander, C., Wefers, F., and Leckschat, D. Scalable Binaural Synthesis on Mobile Devices. In AES Convention 133 (Oct. 2012).","paperID":"None"},{"content":"Christoph Stahl, The roaring navigator: a group guide for the zoo with shared auditory landmark display, Proceedings of the 9th international conference on Human computer interaction with mobile devices and services, p.383-386, September 09-12, 2007, Singapore","paperID":"1378042"},{"content":"Lucia Terrenghi , Andreas Zimmermann, Tailored audio augmented environments for museums, Proceedings of the 9th international conference on Intelligent user interfaces, January 13-16, 2004, Funchal, Madeira, Portugal","paperID":"964523"},{"content":"Tran, T. V., Letowski, T., and Abouchacra, K. S. Evaluation of acoustic beacon characteristics for navigation tasks. Ergonomics 43, 6 (2000), 807--827.","paperID":"None"},{"content":"Yolanda Vazquez-Alvarez , Ian Oakley , Stephen A. Brewster, Auditory display design for exploration in mobile audio-augmented reality, Personal and Ubiquitous Computing, v.16 n.8, p.987-999, December  2012","paperID":"2423805"},{"content":"Michael Vorlnder, Auralization: Fundamentals of Acoustics, Modelling, Simulation, Algorithms and Acoustic Virtual Reality, Springer Publishing Company, Incorporated, 2007","paperID":"1564843"},{"content":"Ron Wakkary , Marek Hatala, ec(h)o: situated play in a tangible and audio museum guide, Proceedings of the 6th conference on Designing Interactive systems, June 26-28, 2006, University Park, PA, USA","paperID":"1142448"},{"content":"Walker, B. N., and Lindsay, J. Navigation Performance With a Virtual Auditory Display: Effects of Beacon Sound, Capture Radius, and Practice. Human Factors 48, 2 (2006), 265--278.","paperID":"None"},{"content":"Bob G. Witmer , Michael J. Singer, Measuring Presence in Virtual Environments: A Presence Questionnaire, Presence: Teleoperators and Virtual Environments, v.7 n.3, p.225-240, June 1998","paperID":"1246762"},{"content":"D. N. Zotkin , R. Duraiswami , L. S. Davis, Rendering localized spatial audio in a virtual auditory space, IEEE Transactions on Multimedia, v.6 n.4, p.553-564, August 2004","paperID":"2219363"}],"abstract":"Audio augmented reality systems overlay the physical world with a virtual audio space. Today's smartphones provide enough processing power to create the impression of virtual sound sources being located in the real world. To achieve this, information about the user's location and orientation is necessary which requires additional hardware. In a real-world installation, however, we observed that instead of turning their head to localize sounds, users tend to turn their entire body. Therefore, we suggest to simply measure orientation of the user's body - or even just the mobile device she is holding - to generate the spatial audio.To verify this approach, we present two studies: Our first study in examines the user's head, body, and mobile device orientation when moving through an audio augmented reality system in a lab setting. Our second study analyzes the user experience in a real-world installation when using head, body, or device orientation to control the audio spatialization. We found that when navigating close to sound sources head tracking is necessary, but that it can potentially be replaced by device tracking in larger or more explorative usage scenarios. These findings help reduce the technical complexity of mobile audio augmented reality systems (MAARS), and enable their wider dissemination as mobile software-only apps.","video":"http://www.youtube.com/embed/UvthZR7EfRo?rel=0","title":"Simplifying orientation measurement for mobile audio augmented reality applications","filename":"CHI14/p615","authors":["Florian Heller","Aaron Krämer","Jan Borchers"],"conference":"CHI '14"}