{"paperId":2557265,"citation":[],"reference":[{"content":"Aeberhard, A. (2011). FUS - Form Usability Scale. Development of a Usability Measuring Tool for Online Forms. Unpublished master's thesis. University of Basel, Switzerland.","paperID":"None"},{"content":"Al-Saleh, M., Al-Wabil, A., Al-Attas, E., AlAbdulkarim, A., Chaurasia, M., Alfaifi, R. (2012). Inline immediate feedback in arabic web forms: An eye tracking study of transactional tasks. In Proc. IIT 2012, 333--338.","paperID":"None"},{"content":"Javier A. Bargas-Avila , Olivia Brenzikofer , Alexandre N. Tuch , Sandra P. Roth , Klaus Opwis, Working towards usable forms on the world wide web: optimizing date entry input fields, Advances in Human-Computer Interaction, 2011, p.1-8, January 2011","paperID":"2064922"},{"content":"Javier A. Bargas-Avila , Olivia Brenzikofer , Alexandre N. Tuch , Sandra P. Roth , Klaus Opwis, Working towards usable forms on the worldwide web: optimizing multiple selection interface elements, Advances in Human-Computer Interaction, 2011, p.1-6, January 2011","paperID":"2043285"},{"content":"Javier A. Bargas-Avila , Glenn Oberholzer , Peter Schmutz , Marco de Vito , Klaus Opwis, Usable error message presentation in the World Wide Web: Do not show errors right away, Interacting with Computers, v.19 n.3, p.330-341, May, 2007","paperID":"1235978"},{"content":"Javier A. Bargas-Avila , Sébastien Orsini , Hannah Piosczyk , Dominic Urwyler , Klaus Opwis, Enhancing online forms: Use format specifications for fields with format restrictions to help respondents, Interacting with Computers, v.23 n.1, p.33-39, January, 2011","paperID":"1920712"},{"content":"Bargas-Avila, J. A, Brenzikofer, O., Roth, S., Tuch, A. N., Orsini, S., & Opwis, K. (2010b). Simple but Crucial User Interfaces in the World Wide Web: Introducing 20 Guidelines for Usable Web Form Design. In: R. Matrai (Ed.), User Interfaces, 1--10. InTech.","paperID":"None"},{"content":"Brooke, J. (1996). SUS: A Quick and Dirty Usability Scale. In: P. W. Jordan, B. Thomas, B. A. Weerdmeester & I. L. McClelland (Eds.), Usability Evaluation in Industry (pp. 189--194). London: Taylor & Francis.","paperID":"None"},{"content":"Stuart K. Card , Allen Newell , Thomas P. Moran, The  Psychology of Human-Computer Interaction, L. Erlbaum Associates Inc., Hillsdale, NJ, 1983","paperID":"578027"},{"content":"Christian, L., Dillman, D., & Smyth, J. (2007). Helping respondents get it right the first time: the influence of words, symbols, and graphics in web surveys. Public Opinion Quarterly, 71(1), 113 - 125.","paperID":"None"},{"content":"Mick P. Couper , Roger Tourangeau , Frederick G. Conrad , Scott D. Crawford, What they see is what we get: response options for web surveys, Social Science Computer Review, v.22 n.1, p.111-127, Spring 2004","paperID":"976032"},{"content":"Field, A. (2009). Non-parametric tests. In Discovering statistics using SPSS (third edition., pp. 539--583). London: SAGE.","paperID":"None"},{"content":"Andrew T. Duchowski, Eye Tracking Methodology: Theory and Practice, Springer-Verlag New York, Inc., Secaucus, NJ, 2007","paperID":"1215838"},{"content":"Harms, J. (2013). Research Goals for Evolving the \"Form\" User Interface Metaphor towards more Interactivity. Lecture Notes in Computer Science, 7946, 819--822.","paperID":"None"},{"content":"Hart, S., & Staveland, L. (1988). Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. P. A. Hancock & N. Meshkati (Eds.). Human mental workload (pp. 139--183). Amsterdam: Elsevier Science.","paperID":"None"},{"content":"Holmqvist, K., Nyström, M., Andersson, R., Dewhurst, R., Jarodzka, H., & Van de Weijer, J. (2011). Eye tracking: A comprehensive guide to methods and measures. Oxford University Press.","paperID":"None"},{"content":"Zanariah Idrus , Nor Hafizah Abdul Razak , Noor Hasnita Abdul Talib , Taniza Tajuddin, Using Three Layer Model (TLM) in Web Form Design: WeFDeC Checklist Development, Proceedings of the 2010 Second International Conference on Computer Engineering and Applications, p.385-389, March 19-21, 2010","paperID":"1798142"},{"content":"James, J., Beaumont, A., Stephens, J., Ullman, C. (2002). Usable Forms for the Web. Glasshaus, Krefeld.","paperID":"None"},{"content":"Caroline Jarrett , Gerry Gaffney, Forms that Work: Designing Web Forms for Usability, Morgan Kaufmann Publishers Inc., San Francisco, CA, 2008","paperID":"1522332"},{"content":"Nikolaos Karousos , Christos Katsanos , Nikolaos Tselios , Michalis Xenos, Effortless tool-based evaluation of web form filling tasks using keystroke level model and fitts law, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468688"},{"content":"Research-Based Web Design & Usability Guidelines, U.S. Dept. of Health and Human Services, 2006","paperID":"1199496"},{"content":"James R. Lewis, Psychometric evaluation of an after-scenario questionnaire for computer usability studies: the ASQ, ACM SIGCHI Bulletin, v.23 n.1, p.78-81, Jan. 1991","paperID":"122692"},{"content":"Money, A. G., Fernando, S., Elliman, T., & Lines, L. (2010). A trial protocol for evaluating assistive online forms for older adults. Proc. ECIS, Paper 90.","paperID":"None"},{"content":"Nielsen, J. (2005). Sixty Guidelines From 1986 Revisited. http://www.nngroup.com/articles/ sixty-guidelines-from-1986-revisited/","paperID":"None"},{"content":"Jakob Nielsen , Kara Pernice, Eyetracking Web Usability, New Riders Publishing, Thousand Oaks, CA, 2009","paperID":"1823564"},{"content":"Stefan L. Pauwels , Christian Hübscher , Stefan Leuthold , Javier A. Bargas-Avila , Klaus Opwis, Error prevention in online forms: Use color instead of asterisks to mark required-fields, Interacting with Computers, v.21 n.4, p.257-262, August, 2009","paperID":"1619082"},{"content":"Enrico Rukzio , John Hamard , Chie Noda , Alexander De Luca, Visualization of uncertainty in context aware mobile applications, Proceedings of the 8th conference on Human-computer interaction with mobile devices and services, September 12-15, 2006, Helsinki, Finland","paperID":"1152267"},{"content":"Mirjam Seckler , Silvia Heinz , Javier A. Bargas-Avila , Klaus Opwis , Alexandre N. Tuch, Empirical evaluation of 20 web form optimization guidelines, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468695"},{"content":"Mirjam Seckler , Alexandre N. Tuch , Klaus Opwis , Javier A. Bargas-Avila, User-friendly locations of error messages in web forms: Put them on the right side of the erroneous input field, Interacting with Computers, v.24 n.3, p.107-118, May, 2012","paperID":"2318420"},{"content":"Thomas S. Tullis , Ana Pons, Designating required vs. optional input fields, CHI '97 Extended Abstracts on Human Factors in Computing Systems, March 22-27, 1997, Atlanta, Georgia","paperID":"1120381"},{"content":"Luke Wroblewski, Web Form Design: Filling in the Blanks, Rosenfeld Media, Brooklyn, New York, 2008","paperID":"1386682"}],"abstract":"This study reports a controlled eye tracking experiment (N = 65) that shows the combined effectiveness of 20 guidelines to improve interactive online forms when applied to forms found on real company websites. Results indicate that improved web forms lead to faster completion times, fewer form submission trials, and fewer eye movements. Data from subjective questionnaires and interviews further show increased user satisfaction. Overall, our findings highlight the importance for web designers to improve their web forms using UX guidelines.","video":"http://www.youtube.com/embed/8v4-gqIbK6Y?rel=0","title":"Designing usable web forms: empirical evaluation of web form improvement guidelines","filename":"CHI14/p1275","authors":["Mirjam Seckler","Silvia Heinz","Javier A. Bargas-Avila","Klaus Opwis","Alexandre N. Tuch"],"conference":"CHI '14"}