{"paperId":2557158,"reference":[{"content":"Amabile, T. M. (1982). Social psychology of creativity: A consensual assessment technique. J Pers Soc Psychol, 43, 997--1013.","paperID":"None"},{"content":"Baron, R. M. & Kenny, D. A. (1986). The moderator-mediator variable distinction in social psychological research: Conceptual, strategic, and statistical considerations. J Pers Soc Psychol, 51 (6), 1173.","paperID":"None"},{"content":"Michael S. Bernstein , Joel Brandt , Robert C. Miller , David R. Karger, Crowds in two seconds: enabling realtime crowd-powered interfaces, Proceedings of the 24th annual ACM symposium on User interface software and technology, October 16-19, 2011, Santa Barbara, California, USA","paperID":"2047201"},{"content":"Michael S. Bernstein , Greg Little , Robert C. Miller , Björn Hartmann , Mark S. Ackerman , David R. Karger , David Crowell , Katrina Panovich, Soylent: a word processor with a crowd inside, Proceedings of the 23nd annual ACM symposium on User interface software and technology, October 03-06, 2010, New York, New York, USA","paperID":"1866078"},{"content":"Frederick P. Brooks, Jr., The  Mythical Man-Month: Essays on Softw, Addison-Wesley Longman Publishing Co., Inc., Boston, MA, 1978","paperID":"540031"},{"content":"Bill Buxton, Sketching User Experiences: Getting the Design Right and the Right Design, Morgan Kaufmann Publishers Inc., San Francisco, CA, 2007","paperID":"1526229"},{"content":"Justin Cheng , Laewoo Kang , Dan Cosley, Storeys: designing collaborative storytelling interfaces, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2479603"},{"content":"Lydia B. Chilton , John J. Horton , Robert C. Miller , Shiri Azenkot, Task search in a human computation market, Proceedings of the ACM SIGKDD Workshop on Human Computation, July 25-25, 2010, Washington DC","paperID":"1837889"},{"content":"Cohen, E. G. (1994). Designing groupwork: Strategies for the heterogeneous classroom (2nd ed.). New York: Teachers College Press.","paperID":"None"},{"content":"Cross, N. 2004. Expertise in design: An overview. Design Studies, 25, 427--441.","paperID":"None"},{"content":"Dennis, A. R. & Valacich, J. S. (1993). Computer brainstorms: More heads are better than one. J Appl Psychol, 78 (4), 531.","paperID":"None"},{"content":"Diehl, M., & Stroebe, W. (1987). Productivity loss in brainstorming groups: Toward the solution of a riddle. Journal of Personality and Social Psychology, 53(3), 497--509.","paperID":"None"},{"content":"Donaldson, L. (1999) The normal science of structural contingency theory. Studying organizations: theory and method. Sage, pp. 51--70.","paperID":"None"},{"content":"Gladstein, D. L. (1984). Groups in context: A model of task group effectiveness. Admin Sci Quart, 499--517.","paperID":"None"},{"content":"Hackman, J. R. (2012). From causes to conditions in group research. J Organ Behav, 33 (3), 428--444.","paperID":"None"},{"content":"Hackman, J. R., Brousseau, K. R., & Weiss, J. A. (1976). The interaction of task design and group performance strategies in determining group effectiveness. Organizational Behavior and Human Performance, 16(2), 350--365.","paperID":"None"},{"content":"Hak, T. & Bernts, T. (1996). Coder training: Theoretical training or practical socialization? Qual. Sociology, 19(2).","paperID":"None"},{"content":"Hennessey, B. A., & Amabile, T. T. (1999). Consensual assessment. Encyclopedia of Creativity, 1.","paperID":"None"},{"content":"Hertwig, R. (2012). Tapping into the Wisdom of the Crowd - with Confidence. Science, 336 (6079), 303--304.","paperID":"None"},{"content":"Hill, G. W. (1982). Group versus individual performance: Are N1 heads better than one? Psychological Bulletin, 91(3), 517.","paperID":"None"},{"content":"Panagiotis G. Ipeirotis, Analyzing the Amazon Mechanical Turk marketplace, XRDS: Crossroads, The ACM Magazine for Students, v.17 n.2, Winter 2010","paperID":"1869094"},{"content":"Kerr, N. L. & Bruun, S. E. (1983). Dispensability of member effort and group motivation losses: Free-rider effects. J Pers Soc Psychol, 44(1), 78.","paperID":"None"},{"content":"Kerr, N. L. & Tindale, R. S. (2004). Group performance and decision making. Annu Rev Psychol, 55, 623--655.","paperID":"None"},{"content":"Joy Kim , Justin Cheng , Michael S. Bernstein, Ensemble: exploring complementary strengths of leaders and crowds in creative collaboration, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531638"},{"content":"Aniket Kittur, Crowdsourcing, collaboration and creativity, XRDS: Crossroads, The ACM Magazine for Students, v.17 n.2, Winter 2010","paperID":"1869096"},{"content":"Aniket Kittur , Robert E. Kraut, Harnessing the wisdom of crowds in wikipedia: quality through coordination, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460572"},{"content":"Aniket Kittur , Boris Smus , Susheel Khamkar , Robert E. Kraut, CrowdForge: crowdsourcing complex work, Proceedings of the 24th annual ACM symposium on User interface software and technology, October 16-19, 2011, Santa Barbara, California, USA","paperID":"2047202"},{"content":"Laughlin, P. R., Hatch, E. C., Silver, J. S., & Boh, L. (2006). Groups perform better than the best individuals on letters-to-numbers problems: Effects of group size. J Pers Soc Psychol, 90 (4), 644.","paperID":"None"},{"content":"Levine, J. M. & Moreland, R. L. (1990). Progress in small group research. Annu Rev Psychol, 41 (1), 585--634.","paperID":"None"},{"content":"Greg Little , Lydia B. Chilton , Max Goldman , Robert C. Miller, TurKit: human computation algorithms on mechanical turk, Proceedings of the 23nd annual ACM symposium on User interface software and technology, October 03-06, 2010, New York, New York, USA","paperID":"1866040"},{"content":"Martins, L. L., Gilson, L. L., & Maynard, M. T. (2004). Virtual teams: What do we know and where do we go from here? J Manage, 30 (6), 805--835.","paperID":"None"},{"content":"Posner, I. R. & Baecker, R. M (1993). How People Write Together. In R. M. Baecker (ed.): Readings in Groupware and Computer-Supported Cooperative Work: Assisting Human-Human Collaboration. San Mateo, CA: Morgan Kaufmann, pp. 239--250.","paperID":"None"},{"content":"Rogstadius, J., Kostakos, V., Kittur, A., Smus, B., Laredo, J., & Vukovic, M. (2011). An Assessment of Intrinsic and Extrinsic Motivation on Task Performance in Crowdsourcing Markets. Proc. ICWSM 2010.","paperID":"None"},{"content":"Shepperd, J. A. (1993). Productivity loss in performance groups: A motivation analysis. Psychol Bull, 113(1), 67.","paperID":"None"},{"content":"Steiner, I. D. (1972). Group process and productivity. Academic Press.","paperID":"None"},{"content":"Straus, S. G. & McGrath, J. E. (1994). Does the medium matter? The interaction of task type and technology on group performance and member reactions. J Appl Psychol, 79 (1), 87.","paperID":"None"},{"content":"Straus, S. G., Parker, A. M., Bruce, J. B., & Dembosky, J. W. (2009). The Group Matters: A Review of the Effects of Group Interaction on Processes and Outcomes in Analytic Teams. RAND Corporation Working Paper.","paperID":"None"},{"content":"Jennifer Thom-Santelli , Dan R. Cosley , Geri Gay, What's mine is mine: territoriality in collaborative authoring, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518925"},{"content":"Thompson, J. D. (2003). Organizations in action: Social science bases of administrative theory. Transaction Pub.","paperID":"None"},{"content":"Van de Ven, A. H., Delbecq, A. L., & Koenig Jr, R. (1976). Determinants of coordination modes within organizations. American Sociological Review, 322--338.","paperID":"None"},{"content":"Vul, E. & Pashler, H. (2008). Measuring the Crowd Within Probabilistic Representations Within Individuals. Psychological Science, 19 (7), 645--647.","paperID":"None"},{"content":"Wageman, R. (1995). Interdependence and group effectiveness. Admin Sci Quart, 145--180.","paperID":"None"},{"content":"Williams, K., Harkins, S. G., & Latané, B. (1981). Identifiability as a deterrant to social loafing: Two cheering experiments. J Pers Soc Psychol, 40 (2), 303.","paperID":"None"},{"content":"Lixiu Yu , Jeffrey V. Nickerson, Cooks or cobblers?: crowd creativity through combination, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979147"},{"content":"Haoqi Zhang , Edith Law , Rob Miller , Krzysztof Gajos , David Parkes , Eric Horvitz, Human computation tasks with global constraints, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207708"}],"citation":[{"content":"Jodi Schneider , Bluma S. Gelley , Aaron Halfaker, Accept, decline, postpone: How newcomer productivity is reduced in English Wikipedia by pre-publication review, Proceedings of The International Symposium on Open Collaboration, August 27-29, 2014, Berlin, Germany","paperID":"2641614"},{"content":"Ioanna Lykourentzou , Angeliki Antoniou , Yannick Naudet , Steven P. Dow, Personality Matters: Balancing for Personality Types Leads to Better Outcomes for Crowd Teams, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819979"},{"content":"Alex Embiricos , Negar Rahmati , Nicole Zhu , Michael S. Bernstein, Structured handoffs in expert crowdsourcing improve communication and work output, Proceedings of the adjunct publication of the 27th annual ACM symposium on User interface software and technology, October 05-08, 2014, Honolulu, Hawaii, USA","paperID":"2658795"},{"content":"Morten Warncke-Wang , Vladislav R. Ayukaev , Brent Hecht , Loren G. Terveen, The Success and Failure of Quality Improvement Projects in Peer Production Communities, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675241"}],"abstract":"Distributed online groups have great potential for generating interdependent and complex products like encyclopedia articles or product design. However, coordinating multiple group members to work together effectively while minimizing process losses remains an open challenge. We conducted an experiment comparing the effectiveness of two coordination strategies (simultaneous vs. sequential work) on a complex creative task as the number of group members increased. Our results indicate that, contrary to prior work, a sequential work structure was more effective than a simultaneous work structure as the size of the group increased. A mediation analysis suggests that social processes such as territoriality partially accounts for these results. A follow up experiment giving workers specific roles mitigated the detrimental effects of the simultaneous work structure. These results have implications for small group theory and crowdsourcing research.","title":"Effects of simultaneous and sequential work structures on distributed collaborative interdependent tasks","filename":"CHI14/p139","authors":["Paul André","Robert E. Kraut","Aniket Kittur"],"conference":"CHI '14"}