{"paperId":2557027,"citation":[{"content":"Myroslav Bachynskyi , Gregorio Palmas , Antti Oulasvirta , Jürgen Steimle , Tino Weinkauf, Performance and Ergonomics of Touch Surfaces: A Comparative Study using Biomechanical Simulation, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702607"},{"content":"Myroslav Bachynskyi , Gregorio Palmas , Antti Oulasvirta , Tino Weinkauf, Informing the Design of Novel Input Methods with Muscle Coactivation Clustering, ACM Transactions on Computer-Human Interaction (TOCHI), v.21 n.6, January 2015","paperID":"2687921"}],"reference":[{"content":"Ahsberg, E., Garnberale, F., and Kjellberg, A. Perceived quality of fatigue during different occupational tasks development of a questionnaire. Industrial Ergonomics 20, 2 (1997), 121--135.","paperID":"None"},{"content":"Bureau of Labor Statistics. Workplace injury and illness summary -- 2012. Washington, DC: USA Dept. of Labor, 2013.","paperID":"None"},{"content":"Cooper, A., and Straker, L. Mouse versus keyboard use: A comparison of shoulder muscle load. Industrial Ergonomics 22, 45 (1998), 351--357.","paperID":"None"},{"content":"Daly, M. Adaptations following upper extremity resistance training in older adults. PhD thesis, Wake Forest University, 2011.","paperID":"None"},{"content":"De Luca, C. J. The use of surface electromyography in biomechanics. Applied Biomechanics 13 (1997), 135--163.","paperID":"None"},{"content":"Delp, S. L., Anderson, F. C., Arnold, A. S., Loan, P., Habib, A., et al. Opensim: Open-source software to create and analyze dynamic simulations of movement. IEEE Trans. Biomedical Engineering 54, 11 (2007), 1940--1950.","paperID":"None"},{"content":"Du, J., and Duffy, V. G. A methodology for assessing industrial workstations using optical motion capture integrated with digital human models. Occupational Ergonomics 7, 1 (2007), 11--25.","paperID":"None"},{"content":"Hamner, S. R., Seth, A., and Delp, S. L. Muscle contributions to propulsion and support during running. Journal of biomechanics 43, 14 (2010), 2709--2716.","paperID":"None"},{"content":"Hermens, H. J., Freriks, B., Merletti, R., Stegeman, D., Blok, J., Rau, G., Disselhorst-Klug, C., and Hägg, G. European recommendations for surface electromyography. Roessingh Research and Development The Netherlands, 1999.","paperID":"None"},{"content":"Holzbaur, K. R. S., Murray, W. M., and Delp, S. L. A model of the upper extremity for simulating musculoskeletal surgery and analyzing neuromuscular control. Ann. of Biomed. Eng. 33 (2005), 829--840.","paperID":"None"},{"content":"Honglun, H., Shouqian, S., and Yunhe, P. Research on virtual human in ergonomic simulation. Computers & Industrial Engineering 53, 2 (2007), 350--356.","paperID":"None"},{"content":"Kasper Hornbæk , Effie Lai-Chong Law, Meta-analysis of correlations among usability measures, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240722"},{"content":"Kontaxis, A., Cutti, A., Johnson, G., and Veeger, H. A framework for the definition of standardized protocols for measuring upper-extremity kinematics. Clinical Biomechanics 24 (2009), 246--253.","paperID":"None"},{"content":"Lloyd, D. G., Besier, T. F., et al. An emg-driven musculoskeletal model to estimate muscle forces and knee joint moments in vivo. J. Biomech. 36 (2003), 765--776.","paperID":"None"},{"content":"Lu, T.-W., and O'connor, J. Bone position estimation from skin marker co-ordinates using global optimisation with joint constraints. J. Biomech. 32, 2 (1999), 129--134.","paperID":"None"},{"content":"Lund, M. E., de Zee, M., Andersen, M. S., and Rasmussen, J. On validation of multibody musculoskeletal models. Proceedings of the Institution of Mechanical Engineers, Part H: Journal of Engineering in Medicine 226 (2012), 82--94.","paperID":"None"},{"content":"Machado, M. F., Flores, P., Walter, J., and Fregly, B. Challenges in using opensim as a multibody design tool to model, simulate, and analyze prosthetic devices: a knee joint case-study. http://hdl.handle.net/1822/19411, 2012.","paperID":"None"},{"content":"D. Mavrikios , V. Karabatsou , M. Pappas , G. Chryssolouris, An efficient approach to human motion modeling for the verification of human-centric product design and manufacturing in virtual environments, Robotics and Computer-Integrated Manufacturing, v.23 n.5, p.533-543, October, 2007","paperID":"1243245"},{"content":"Miehling, J., Krüger, D., and Wartzack, S. Simulation in human-centered design-past, present and tomorrow. In Smart Product Engineering. Springer, 2013, 643--652.","paperID":"None"},{"content":"Murai, A., Kurosaki, K., Yamane, K., and Nakamura, Y. Musculoskeletal-see-through mirror: Computational modeling and algorithm for whole-body muscle activity visualization in real time. Prog. Biophys. Mol. Biol. 103, 2 (2010), 310--317.","paperID":"None"},{"content":"Musial, J., Verstraete, M., and Gobron, N. Comparing the effectiveness of recent algorithms to 'll and smooth incomplete and noisy time series. Atmos. Chem. Phys. Discuss 11 (2011), 14259--14308.","paperID":"None"},{"content":"Myon Prophysics, http://www.myonprophysics.ch/products/hardware/myon-320/.","paperID":"None"},{"content":"Neumann, D. A., and Rowan, E. E. Kinesiology of the musculoskeletal system: foundations for physical rehabilitation. Mosby St. Louis, MO, 2002.","paperID":"None"},{"content":"Opensim documentation. http://simtkcon?uence.stanford.edu:8080/display/OpenSim.","paperID":"None"},{"content":"Nicolas Pronost , Anders Sandholm , Daniel Thalmann, A visualization framework for the analysis of neuromuscular simulations, The Visual Computer: International Journal of Computer Graphics, v.27 n.2, p.109-119, February 2011","paperID":"1966770"},{"content":"Reinbolt, J. A., Seth, A., and Delp, S. L. Simulation of human movement: applications using opensim. Procedia IUTAM 2, 0 (2011), 186--198.","paperID":"None"},{"content":"Carsten Stoll , Nils Hasler , Juergen Gall , Hans-Peter Seidel , Christian Theobalt, Fast articulated motion tracking using a sums of Gaussians body model, Proceedings of the 2011 International Conference on Computer Vision, p.951-958, November 06-13, 2011","paperID":"2356374"},{"content":"van den Bogert, A. J., Geijtenbeek, T., Even-Zohar, O., Steenbrink, F., and Hardin, E. C. A real-time system for biomechanical analysis of human movement and muscle function. Medical & biological engineering & computing (2013), 1--9.","paperID":"None"},{"content":"Vignais, N., Cocchiarella, D., Kociolek, A., and Keir, P. Dynamic assessment of finger joint loads using kinetic and kinematic measurements. Digital Human Modeling Symposium (2013).","paperID":"None"},{"content":"Winter, D. A. Biomechanics and motor control of human movement. Wiley, 2009.","paperID":"None"},{"content":"Jacob O. Wobbrock , Meredith Ringel Morris , Andrew D. Wilson, User-defined gestures for surface computing, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518866"}],"abstract":"Motion-capture-based biomechanical simulation is a non-invasive analysis method that yields a rich description of posture, joint, and muscle activity in human movement. The method is presently gaining ground in sports, medicine, and industrial ergonomics, but it also bears great potential for studies in HCI where the physical ergonomics of a design is important. To make the method more broadly accessible, we study its predictive validity for movements and users typical to studies in HCI. We discuss the sources of error in biomechanical simulation and present results from two validation studies conducted with a state-of-the-art system. Study I tested aimed movements ranging from multitouch gestures to dancing, finding out that the critical limiting factor is the size of movement. Study II compared muscle activation predictions to surface-EMG recordings in a 3D pointing task. The data shows medium-to-high validity that is, however, constrained by some characteristics of the movement and the user. We draw concrete recommendations to practitioners and discuss challenges to developing the method further.","video":"http://www.youtube.com/embed/qVUgbroQwtM?rel=0","title":"Is motion capture-based biomechanical simulation valid for HCI studies?: study and implications","filename":"CHI14/p3215","authors":["Myroslav Bachynskyi","Antti Oulasvirta","Gregorio Palmas","Tino Weinkauf"],"conference":"CHI '14"}