{"paperId":2557250,"citation":[{"content":"John Shearer , Sue Swinburne , Patrick Dickinson, Droplets: geo-located audio as a social media platform, Proceedings of the 2015 British HCI Conference, July 13-17, 2015, Lincoln, Lincolnshire, United Kingdom","paperID":"2783617"},{"content":"Ioannis Giannopoulos , Peter Kiefer , Martin Raubal, GazeNav: Gaze-Based Pedestrian Navigation, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, August 24-27, 2015, Copenhagen, Denmark","paperID":"2785873"},{"content":"Adrian Hazzard , Steve Benford , Gary Burnett, Sculpting a Mobile Musical Soundtrack, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702236"}],"reference":[{"content":"BlueBrain, http://bluebrainmusic.blogspot.co.uk/search?updated-max=2012-01-02T09:27:00-08:00&max-results=7","paperID":"None"},{"content":"Bull, M., Personal stereos and the aural reconfiguration of representational space, in Sally Munt (ed.) TechnoSpaces: inside the new media, London: Continuum, 2001.","paperID":"None"},{"content":"Brower, C. A., Cognitive Theory of Musical Meaning. Journal of Music Theory, 44 (2) (2000), 323--379.","paperID":"None"},{"content":"Eitan, Z. and Granot R. Y., How Music Moves: Musical Parameters and Listeners' Images of Motion. Music Perception, 23 (3) (2006), 221--247.","paperID":"None"},{"content":"Greg T. Elliott , Bill Tomlinson, PersonalSoundtrack: context-aware playlists that adapt to user pace, CHI '06 Extended Abstracts on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1125599"},{"content":"Etter, R., & Specht, M., Melodious walkabout-implicit navigation with contextualized personal audio contents. In Adjunct proc. of the third international conference on pervasive computing, 191 (204) (2005).","paperID":"None"},{"content":"Fencott, R., and Byran-Kinns, N., Sensory Threads: Sonifying imperceptible phenomena in the wild. In Proc. of the 6th Sound and Music Computing Conference, 2009.","paperID":"None"},{"content":"Martin Flintham, Painting the town red: configuring location-based games by colouring maps, Proceedings of the 2005 ACM SIGCHI International Conference on Advances in computer entertainment technology, p.9-18, June 15-17, 2005, Valencia, Spain","paperID":"1178479"},{"content":"Harris, Y., Taking Soundings - Investigating Coastal Navigations and Orientations in Sound. In Proc. of the 4th Mobile Music Workshop, 2007.","paperID":"None"},{"content":"Wilko Heuten , Daniel Wichmann , Susanne Boll, Interactive 3D sonification for the exploration of city maps, Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles, p.155-164, October 14-18, 2006, Oslo, Norway","paperID":"1182492"},{"content":"Huerta, R., A thousand and one ways of listening to music on your 'smartphone'. http://cultura.elpais.com/cultura/2012/12/03/actualidad/1354529812_286215.html","paperID":"None"},{"content":"Hull, R., Clayton, C., Melamed, T., Rapid authoring of mediascapes. Proceedings of Ubicomp, 2004. Springer, 125--142.","paperID":"None"},{"content":"Karageorghis, C. I. & Terry, P. C., The psychological, psychophysical, and ergogenic effects of music in sport: A review and synthesis. In Bateman, A., Bale, J., (Ed(s)), Sporting sounds: Relationships Between Sport and Music, 1 (2008), 13--36.","paperID":"None"},{"content":"Kohn, D. & Eitan, Z., Musical Parameters and Children's Movement Responses. In Proc. of the 7th Triennial Conference of European Society for the Cognitive Sciences of Music (ESCOM), 2009.","paperID":"None"},{"content":"Meyer, L. B., Emotion and Meaning in Music. University of Chicago Press, 1956.","paperID":"None"},{"content":"Nemirovsky, P. Aesthetic forms of expression as information delivery units. Available from: http://www.web.media.mit.edu/~pauln/research/guideshoes/thesis/Thesis.pdf","paperID":"None"},{"content":"Ratner, G., The Musical Experience: Sound, Movement, and Arrival. W. H. Freeman, 1983.","paperID":"None"},{"content":"Reality Jockey Ltd. The Sonic Experiences of the 21st Century. http://rjdj.me","paperID":"None"},{"content":"Spotisquare, http://www.spotisquare.com","paperID":"None"},{"content":"Styns, F., Van Noorden, L., Moelants, D. and Leman, M., Walking on music. Human Movement Science, 26 (2007), 769--785.","paperID":"None"},{"content":"Tanaka, A., Visceral Mobile Music Systems. In: Adams, R., Gibson, S. and Arisona, S. M. (Eds.), DAW/IF 2006/2007, CCIS 7, pp. 155--170, 2008.","paperID":"None"},{"content":"Katie Wilkie , Simon Holland , Paul Mulholland, What can the language of musicians tell us about music interaction design?, Computer Music Journal, v.34 n.4, p.34-48, Winter 2010","paperID":"1943122"}],"abstract":"Musical soundtracks will be important features of future locative experiences from tours to games. We present a study designed to uncover potential relationships between higher-level musical structures such as harmony, melody, timbre, dynamic intensity and punctuation and users' spatial experiences. We observed twenty-two participants exploring an open field while listening to four contrasting musical compositions, and then interviewed them afterwards. We report their different approaches to interpreting the music, strategies for mapping zones, choice of stopping destinations, and their awareness and appreciation of the music. Our discussion of these findings in relation to the literature leads us to propose six initial principles to guide the composition of mobile and locative soundtracks, and also to articulate a three-layer framework of global, regional and local attachment to help guide the attachment of musical features to different regions within a locative experience.","video":"http://www.youtube.com/embed/bChY6aCrrYw?rel=0","title":"Walk this way: musically guided walking experiences","filename":"CHI14/p605","authors":["Adrian Hazzard","Steve Benford","Gary Burnett"],"conference":"CHI '14"}