{"paperId":2557068,"citation":[{"content":"Mishel Johns , Srinath Sibi , Wendy Ju, Effect of cognitive load in autonomous vehicles on driver performance during transfer of control, Adjunct Proceedings of the 6th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, September 17-19, 2014, Seattle, WA, USA","paperID":"2667296"},{"content":"Bryan Reimer , Chuck Gulash , Bruce Mehler , James P. Foley , Stephen Arredondo , Alexander Waldmann, The MIT AgeLab n-back: a multi-modal android application implementation, Adjunct Proceedings of the 6th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, September 17-19, 2014, Seattle, WA, USA","paperID":"2667293"},{"content":"Sudip Vhaduri , Amin Ali , Moushumi Sharmin , Karen Hovsepian , Santosh Kumar, Estimating Drivers' Stress from GPS Traces, Proceedings of the 6th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, September 17-19, 2014, Seattle, WA, USA","paperID":"2667335"},{"content":"Ilkka Kosunen , Mikko Salminen , Simo Järvelä , Antti Ruonala , Niklas Ravaja , Giulio Jacucci, RelaWorld: Neuroadaptive and Immersive Virtual Reality Meditation System, Proceedings of the 21st International Conference on Intelligent User Interfaces, March 07-10, 2016, Sonoma, California, USA","paperID":"2856796"}],"reference":[{"content":"Daniel Afergan , Evan M. Peck , Erin T. Solovey , Andrew Jenkins , Samuel W. Hincks , Eli T. Brown , Remco Chang , Robert J.K. Jacob, Dynamic difficulty using brain metrics of workload, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557230"},{"content":"Afonso, V.X., Tompkins, W.J., Nguyen, T.Q., and Luo, S. Multirate processing of the ECG using filter banks. Computers in Cardiology, (1996), 245'248.","paperID":"None"},{"content":"Backs, R.W.et al. Cardiac measures of driver workload during simulated driving with and without visual occlusion. Human Factors 45, 4, (2003), 525--38.","paperID":"None"},{"content":"Christie, M.J. Electrodermal activity in the 1980s: a review. J Royal Soc of Medicine 74, 8 (1981), 616--22.","paperID":"None"},{"content":"Collet, C., et al. Physiological and behavioural changes associated to the management of secondary tasks while driving. Applied Ergonomics 40, 6 (2009), 1041'6.","paperID":"None"},{"content":"Joseph F. Coughlin , Bryan Reimer , Bruce Mehler, Monitoring, Managing, and Motivating Driver Safety and Well-Being, IEEE Pervasive Computing, v.10 n.3, p.14-21, July 2011","paperID":"2006860"},{"content":"Y. C. Eldar , A. V. Oppenheim, Filter bank interpolation and reconstruction from generalized and recurrent nonuniform samples, Proceedings of the Acoustics, Speech, and Signal Processing, 2000. on IEEE International Conference, p.324-327, June 05-09, 2000","paperID":"1258262"},{"content":"Engström, J., Johansson, E., Östlund, J. Effects of visual and cognitive load in real and simulated motorway driving. Transportation Research F, 2 (2005), 97--120.","paperID":"None"},{"content":"Audrey Girouard , Erin Treacy Solovey , Robert J. K. Jacob, Designing a passive brain computer interface using real time classification of functional near-infrared spectroscopy, International Journal of Autonomous and Adaptive Communications Systems, v.6 n.1, p.26-44, December 2013","paperID":"2407438"},{"content":"Gopher, D. and Donchin, E. Workload: An examination of the concept. In K.R. Boof, L. Kaufman and J.P. Thomas, eds., Handbook of Perception and Human Performance. (1986), 41'1'41'49.","paperID":"None"},{"content":"David Grimes , Desney S. Tan , Scott E. Hudson , Pradeep Shenoy , Rajesh P.N. Rao, Feasibility and pragmatics of classifying working memory load with an electroencephalograph, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357187"},{"content":"Haigney, D., Taylor, R., Westerman, S. Concurrent mobile (cellular) phone use and driving performance: task demand characteristics and compensatory processes. Transportation Research F 3, 3 (2000), 113--121.","paperID":"None"},{"content":"Hajek, W., et al. Workload-adaptive cruise control ' A new generation of advanced driver assistance systems. Transportation Research Part F 20, 0 (2013), 108--120.","paperID":"None"},{"content":"J. A. Healey , R. W. Picard, Detecting stress during real-world driving tasks using physiological sensors, IEEE Transactions on Intelligent Transportation Systems, v.6 n.2, p.156-166, June 2005","paperID":"2218750"},{"content":"Jahn, G., et al. Peripheral detection as a workload measure in driving: Effects of traffic complexity and route guidance system use in a driving study. Transportation Research Part F 8, 3 (2005), 255--275.","paperID":"None"},{"content":"Just, M.A., Keller, T.A., and Cynkar, J. A decrease in brain activation associated with driving when listening to someone speak. Brain research 1205, (2008), 70--80.","paperID":"None"},{"content":"Kohlmorgen, Jens, et al. Improving human performance in a real operating environment through real-time mental workload detection. Toward Brain-Computer Interfacing (2007), 409--422.","paperID":"None"},{"content":"Yulan Liang , M. L. Reyes , J. D. Lee, Real-Time Detection of Driver Cognitive Distraction Using Support Vector Machines, IEEE Transactions on Intelligent Transportation Systems, v.8 n.2, p.340-350, June 2007","paperID":"2218854"},{"content":"Mehler, B., et al. Impact of Incremental Increases in Cognitive Workload on Physiological Arousal and Performance in Young Adult Drivers. Transportation Research 2138, 12 (2009), 6--12.","paperID":"None"},{"content":"Mehler, B., Reimer, B., and Coughlin, J.F. Sensitivity of Physiological Measures for Detecting Systematic Variations in Cognitive Demand From a Working Memory Task: An On-Road Study Across Three Age Groups. Human Factors 54, 3 (2012), 396--412.","paperID":"None"},{"content":"Mehler, B., Reimer, B., Dusek, J. MIT AgeLab Delayed Digit Recall Task (n-back). (2011) http://agelab.mit. edu/mit-agelab-delayed-digit-recall-task-white-paper.","paperID":"None"},{"content":"Mehler, B., Reimer, B., Wang, Y. A comparison of heart rate and heart rate variability indices in distinguishing single task driving and driving under secondary cognitive workload. Proc Driving Symposium on Human Factors in Driver Assessment, Training & Vehicle Design, (2011), 590--597.","paperID":"None"},{"content":"Michon, J.A. A Critical View of Driver Behavior Models: What Do We Know, What Should We Do' Human behavior and traffic safety, (1985), 485--520.","paperID":"None"},{"content":"Miyaji, M., Danno, M., Kawanaka, H., and Oguri, K. Driver's cognitive distraction detection using AdaBoost on pattern recognition basis. ICVES, (2008), 51--56.","paperID":"None"},{"content":"Mulder, L.J.M. Measurement and analysis methods of heart rate and respiration for use in applied environments. Biological Psychology 34, 2--3 (1992), 205'236.","paperID":"None"},{"content":"National Highway Traffic Safety Admin. Traffic Safety Facts: Distracted Driving. Washington, DC, (2011).","paperID":"None"},{"content":"Östlund, J., et al. Adaptive Integrated Driver-Vehicle Interface (AIDE): Driving performance assessment methods and metrics. Gothenburg, Sweden, (2005).","paperID":"None"},{"content":"Peterson, F., Jung, C.G. Psycho-Physical Investigations with the Galvanometer and Pneumograph in Normal and Insane Individuals. Brain 30, 2 (1907), 153--218.","paperID":"None"},{"content":"Reimer, B., Mehler, B., Wang, Y., and Coughlin, J.F. A Field Study on the Impact of Variations in Short-Term Memory Demands on Drivers' Visual Attention and Driving Performance Across Three Age Groups. Human Factors 54, 3 (2012), 454--468.","paperID":"None"},{"content":"Reimer, B. and Mehler, B. The impact of cognitive workload on physiological arousal in young adult drivers: a field study and simulation validation. Ergonomics 54, (2011), 932--42.","paperID":"None"},{"content":"Saga, K. Histochemical and immunohistochemical markers for human eccrine and apocrine sweat glands: an aid for histopathologic differentiation of sweat gland tumors. J of Investigative Dermatology 6, 1 (2001).","paperID":"None"},{"content":"Dario D. Salvucci , Mark Zuber , Ekaterina Beregovaia , Daniel Markley, Distract-R: rapid prototyping and evaluation of in-vehicle interfaces, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 02-07, 2005, Portland, Oregon, USA","paperID":"1055052"},{"content":"Stefan Schneegass , Bastian Pfleging , Nora Broy , Frederik Heinrich , Albrecht Schmidt, A data set of real world driving to assess driver workload, Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, October 28-30, 2013, Eindhoven, Netherlands","paperID":"2516561"},{"content":"Singleton, W.T. The Mind at Work. Cambridge University Press, (1989).","paperID":"None"},{"content":"Erin Solovey , Paul Schermerhorn , Matthias Scheutz , Angelo Sassaroli , Sergio Fantini , Robert Jacob, Brainput: enhancing interactive systems with streaming fnirs brain input, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208372"},{"content":"Son, J., Reimer, B., Mehler, B., et al. Age and crosscultural comparison of drivers' cognitive workload and performance in simulated urban driving. Internl J of Automotive Technology 11, 4 (2010), 533--539.","paperID":"None"},{"content":"Stanton, N., & Young, M. Vehicle automation and driving performance. Ergonomics, 41(7) (1998)10141028.","paperID":"None"},{"content":"Szabo, A., et al. Mental challenge elicits \"additional\" increases in heart rate during low and moderate intensity cycling. Intl J Psychophysiology 17, 3 (1994), 197--204.","paperID":"None"},{"content":"Veltman, J.A. and Gaillard, A.W. Physiological workload reactions to increasing levels of task difficulty. Ergonomics 41, 5 (1998), 656--69.","paperID":"None"},{"content":"de Waard, et al. Effect of road layout and road environment on driving performance, drivers' physiology and road appreciation. Ergonomics 38, 7 (1995), 1395--407.","paperID":"None"},{"content":"Yerkes, R. M., Dodson, J.D. \"The relation of strength of stimulus to rapidity of habit-formation,\" J of Comparative Neurology and Psychology 18, (1908).","paperID":"None"},{"content":"Young, M.S. Stanton, N.A. Malleable attentional resources theory: a new explanation for the effects of mental underload on performance. Human Factors 44, (2002), 365--375.","paperID":"None"},{"content":"Young, M.S. and Stanton, N.A. Mental Workload. In N.A. Stanton, A. Hedge, K. Brookhuis, E. Salas and H. Hendrick, eds., Handbook of Human Factors and Ergonomics Methods. CNC Press, (2004), 1--9.","paperID":"None"},{"content":"Zander T. O., Kothe C. Towards passive brain'computer interfaces: applying brain-computer interface technology to human'machine systems in general. J. Neural Eng. 8, (2011).","paperID":"None"}],"abstract":"Understanding the driver's cognitive load is important for evaluating in-vehicle user interfaces. This paper describes experiments to assess machine learning classification algorithms on their ability to automatically identify elevated cognitive workload levels in drivers, leading towards the development of robust tools for automobile user interface evaluation. We look at using both driver performance as well as physiological data. These measures can be collected in real-time and do not interfere with the primary task of driving the vehicle. We report classification accuracies of up to 90% for detecting elevated levels of cognitive load, and show that the inclusion of physiological data leads to higher classification accuracy than vehicle sensor data evaluated alone. Finally, we show results suggesting that models can be built to classify cognitive load across individuals, instead of building individual models for each per-son. By collecting data from drivers in two large field studies on the highway (20 drivers and 99 drivers), this work extends prior work and demonstrates feasibility and potential of such measures for HCI research in vehicles.","video":"http://www.youtube.com/embed/NUa-uay0BHs?rel=0","title":"Classifying driver workload using physiological and driving performance data: two field studies","filename":"CHI14/p4057","authors":["Erin T. Solovey","Marin Zec","Enrique Abdon Garcia Perez","Bryan Reimer","Bruce Mehler"],"conference":"CHI '14"}