{"paperId":2557300,"title":"","authors":"","abstract":"\n    ... but the URL you have requested has resulted in a Server Error.\n    It is possible that this was a temporary problem and is already corrected so please try to refresh this page.\n    \n    We apologize for this inconvenience.  \n    \n        \n    If the problem persists please contact us: \n    portal-feedback@hq.acm.org\n  \t\n    ","citation":[{"content":"Marianne Dee , Vicki L. Hanson, A large user pool for accessibility research with representative users, Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility, October 20-22, 2014, Rochester, New York, USA","paperID":"2661361"},{"content":"Claudia Müller , Dominik Hornung , Theodor Hamm , Volker Wulf, Practice-based Design of a Neighborhood Portal: Focusing on Elderly Tenants in a City Quarter Living Lab, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702449"},{"content":"Marianne Dee , Vicki L. Hanson, A Pool of Representative Users for Accessibility Research: Seeing through the Eyes of the Users, ACM Transactions on Accessible Computing (TACCESS), v.8 n.1, January 2016","paperID":"2845088"},{"content":"Marén Schorch , Lin Wan , David William Randall , Volker Wulf, Designing for Those who are Overlooked: Insider Perspectives on Care Practices and Cooperative Work of Elderly Informal Caregivers, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819999"}],"reference":[{"content":"Adler, G. and Rottunda, S. Older adults' perspectives on driving cessation. Journal of Aging studies 20, 3 (2006), 227--235.","paperID":"None"},{"content":"Allen, J. L. human-center ridesharing - A sustainable solution. CHI, ACM, (2009).","paperID":"None"},{"content":"Beswick, A. D., Rees, K., Dieppe, P., et al. Complex interventions to improve physical function and maintain independent living in elderly peoples. The Lancet 371, 9614 (2008), 725--735.","paperID":"None"},{"content":"Margot Brereton , Paul Roe , Marcus Foth , Jonathan M. Bunker , Laurie Buys, Designing participation in agile ridesharing with mobile social software, Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7, November 23-27, 2009, Melbourne, Australia","paperID":"1738868"},{"content":"Coughlin, J. F. Technology and the Future of Aging. Journal of Rehabilitation Research and Development 38, 1 (2001).","paperID":"None"},{"content":"Dumbaugh, E. Designing Communities to Enhance the Safety and Mobility of Older Adults. Journal of Planning Literature 23, 1 (2008), 17--36.","paperID":"None"},{"content":"Fobker, S. and Grotz, R. Everyday mobility of elderly people in different urban settings. Urban Studies 43, 1 (2006), 99--118.","paperID":"None"},{"content":"Sunil Ghelawat , Kenneth Radke , Margot Brereton, Interaction, privacy and profiling considerations in local mobile social software: a prototype agile ride share system, Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction, November 22-26, 2010, Brisbane, Australia","paperID":"1952307"},{"content":"Handke, V. and Jonuschat, H. Flexible Ridesharing: New Opportunities and Service Concepts for Sustainable Mobility. Springer, 2012.","paperID":"None"},{"content":"Hansen, E. G., Gomm, M. L., Bullinger, A. C., and Moslein, K. M. A community-based toolkit for designing ride-sharing services. International Journal of Innovation and Sustainable Development 5, 1 (2010), 80--99.","paperID":"None"},{"content":"Kaiser, H. J. Mobility in Old Age Beyond the Transportation Perspective. Journal of Applied Gerontology 28, 4 (2009), 411--418.","paperID":"None"},{"content":"Laurier, E., Lorimer, H., Brown, B., et al. Driving and \"Passengering\": Notes on the Ordinary Organization of Car Travel. Mobilities 3, 1 (2008), 1--23.","paperID":"None"},{"content":"Lord, S., Després, C., and Ramadier, T. When mobility makes sense: A qualitative and longitudinal study of the daily mobility of the elderly. Journal of Environmental psychology 31, 1 (2011), 52--61.","paperID":"None"},{"content":"Mauss, M. The Gift: The Form and Reason for Exchange in Archaic Societies, trans. WD Halls. New York and London: WW Norton, (1990).","paperID":"None"},{"content":"Seyed Hadi Mirisaee , Margot Brereton , Paul Roe, Bridging the representation and interaction challenges of mobile context-aware computing: designing agile ridesharing, Proceedings of the 23rd Australian Computer-Human Interaction Conference, p.221-224, November 28-December 02, 2011, Canberra, Australia","paperID":"2071571"},{"content":"Seyed Hadi Mirisaee, A human-centred context-aware approach to develop open-standard agile ridesharing using mobile social networks, Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction, November 22-26, 2010, Brisbane, Australia","paperID":"1952332"},{"content":"Mollenkopf, H., Marcellini, F., Ruoppila, I., Széman, Z., and Tacken, M. Enhancing mobility in later life. Ios Press, Amsterdam, 2005.","paperID":"None"},{"content":"Nicolini, D. Practice Theory, Work, and Organization: An Introduction. Oxford University Press, 2013.","paperID":"None"},{"content":"Fatih Kursat Ozenc , Lorrie F. Cranor , James H. Morris, Adapt-a-ride: understanding the dynamics of commuting preferences through an experience design framework, Proceedings of the 2011 Conference on Designing Pleasurable Products and Interfaces, June 22-25, 2011, Milano, Italy","paperID":"2347571"},{"content":"Plath, D. Independence in Old Age: The Route to Social Exclusion British Journal of Social Work 38, 7 (2008), 1353--1369.","paperID":"None"},{"content":"Kenneth Radke , Margot Brereton , Seyed Mirisaee , Sunil Ghelawat , Colin Boyd , Juan Gonzalez Nieto, Tensions in developing a secure collective information practice - the case of agile ridesharing, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042168"},{"content":"Rosenbloom, S. The Mobility Needs of Older Americans. Taking the High Road, TRB, (2004), 227--54.","paperID":"None"},{"content":"Scheiner, J. Does the car make elderly people happy and mobile? European Journal of Transport and Infrastructure Research 6, 2 (2006), 151--172.","paperID":"None"},{"content":"Schwanen, T., Banister, D., and Bowling, A. Independence and mobility in later life. Geoforum 43, 6 (2012), 1313--1322.","paperID":"None"},{"content":"Sheller, M. and Urry, J. Mobile Transformations of \"Public\" and \"Private\" Life. Theory, Culture & Society 20, 3 (2003), 107--125.","paperID":"None"},{"content":"Sherlock, K. Revisiting the concept of hosts and guests. Tourist Studies 1, 3 (2001), 271--295.","paperID":"None"},{"content":"Silvis, J. B. Connecting Social Networks, Ridesharing, and Mobility: A Spectrum of Seniors' Behavior. ProQuest, 2008.","paperID":"None"},{"content":"Steg, L. Car use: lust and must. Instrumental, symbolic and affective motives for car use. Transportation Research Part A: Policy and Practice 39, 2 (2005), 147--162.","paperID":"None"},{"content":"Steger-Vonmetz, D. C. Improving modal choice and transport efficiency with the virtual ridesharing agency. 2005. Proc. of IEEE, IEEE (2005), 994--999.","paperID":"None"},{"content":"Teodorović, D. and Dell'Orco, M. Mitigating traffic congestion: solving the ride-matching problem by bee colony optimization. Transportation Planning and Technology 31, 2 (2008), 135--152.","paperID":"None"},{"content":"Urry, J. Mobilities. Polity, Cambridge, UK; Malden, MA, 2007.","paperID":"None"},{"content":"Rick Wash , Libby Hemphill , Paul Resnick, Design decisions in the RideNow project, Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work, November 06-09, 2005, Sanibel Island, Florida, USA","paperID":"1099228"},{"content":"Wessels, R., Pueboobpaphan, R., Bie, J., and van Arem, B. Integrating online social networks with ridesharing systems. (2010) www.pooll.nl/wpcontent/uploads/2010/02/Paperv5.pdf. Online {Last accessed on 1/01/14}.","paperID":"None"},{"content":"Witzel, A., and H. Reiter: The Problem-centred Interview. Qualitative Social Research. Vol. 1. No. 1. 2000.","paperID":"None"},{"content":"Volker Wulf , Markus Rohde , Volkmar Pipek , Gunnar Stevens, Engaging with practices: design case studies as a research framework in CSCW, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958902"},{"content":"Xin Xing , Tobias Warden , Tom Nicolai , Otthein Herzog, SMIZE: a spontaneous ride-sharing system for individual urban transit, Proceedings of the 7th German conference on Multiagent system technologies, September 09-11, 2009, Hamburg, Germany","paperID":"1792011"},{"content":"Ziegler, F. and Schwanen, T. I like to go out to be energised by different people. Ageing and Society 31, 5 (2011), 758.","paperID":"None"}]}