{"paperId":2557243,"reference":[{"content":"Johnny Accot , Shumin Zhai, Beyond Fitts' law: models for trajectory-based HCI tasks, Proceedings of the ACM SIGCHI Conference on Human factors in computing systems, p.295-302, March 22-27, 1997, Atlanta, Georgia, USA","paperID":"258760"},{"content":"Bernardi, L., Wdowczyk-Szulc, J., Valenti, C., Castoldi, S., Passino, C., Spadacini, G., and Sleight, P. Effects of controlled breathing, mental activity and mental stress with or without verbalization on heart rate variability. Journal of the American College of Cardiology 35, 6 (2000), 1462--1469.","paperID":"None"},{"content":"Berntson, G. G. Heart rate variability: Origins, methods and interpretive caveats. Psychophysiology 34 (1997), 623--648.","paperID":"None"},{"content":"Brindley, D., Rolland, Y., et al. Possible connections between stress, diabetes, obesity, hypertension and altered lipoprotein metabolism that may result in atherosclerosis. Clinical science (London, England: 1979) 77, 5 (1989), 453.","paperID":"None"},{"content":"Bryant, R., Moulds, M., and Guthrie, R. Acute stress disorder scale: a self-report measure of acute stress disorder. Psychological Assessment; Psychological Assessment 12, 1 (2000), 61.","paperID":"None"},{"content":"Davis, M., Eshelman, E., and McKay, M. The relaxation and stress reduction workbook. New Harbinger Publications, 2008.","paperID":"None"},{"content":"Dickerson, S., and Kemeny, M. Acute stressors and cortisol responses: a theoretical integration and synthesis of laboratory research. Psychological bulletin 130, 3 (2004), 355.","paperID":"None"},{"content":"Fitts, P. The information capacity of the human motor system in controlling the amplitude of movement. Journal of experimental psychology 47, 6 (1954), 381.","paperID":"None"},{"content":"Garde, A., Laursen, B., Jørgensen, A., and Jensen, B. Effects of mental and physical demands on heart rate variability during computer work. European journal of applied physiology 87, 4 (2002), 456--461.","paperID":"None"},{"content":"Hill, A. The heat of shortening and the dynamic constants of muscle. Proceedings of the Royal Society of London. Series B, Biological Sciences 126, 843 (1938), 136--195.","paperID":"None"},{"content":"Hoehn-Saric, R., and McLeod, D. Somatic manifestations of normal and pathological anxiety. Biology of anxiety disorders. Progress in Psychiatry 39, 36 (1993), 177--222.","paperID":"None"},{"content":"Hollerbach, J. An oscillation theory of handwriting. Biological Cybernetics 39, 2 (1981), 139--156.","paperID":"None"},{"content":"Hoshikawa, Y., and Yamamoto, Y. Effects of stroop color-word conflict test on the autonomic nervous system responses. American Journal of Physiology-Heart and Circulatory Physiology 272, 3 (1997), H1113--H1121.","paperID":"None"},{"content":"Kirsch, D. The sentic mouse: A tool for measuring emotional valence. retrieved Oct 2 (1998), 1--2.","paperID":"None"},{"content":"Lundberg, U., Kadefors, R., Melin, B., Palmerud, G., Hassmén, P., Engström, M., and Elfsberg Dohns, I. Psychophysiological stress and emg activity of the trapezius muscle. International Journal of behavioral medicine 1, 4 (1994), 354--370.","paperID":"None"},{"content":"Wolfgang Maehr, eMotion: Estimation of User's Emotional State by Mouse Motions, VDM Verlag, Saarbrücken, Germany, 2008","paperID":"1522361"},{"content":"Massie, T. H., and Salisbury, J. K. The phantom haptic interface: A device for probing virtual objects. In Proceedings of the ASME winter annual meeting, symposium on haptic interfaces for virtual environment and teleoperator systems, vol. 55, IOS Press (1994), 295--300.","paperID":"None"},{"content":"McNames, J., and Aboy, M. Reliability and accuracy of heart rate variability metrics versus ecg segment duration. Medical and Biological Engineering and Computing 44, 9 (2006), 747--756.","paperID":"None"},{"content":"Murray, C., Lopez, A., et al. The global burden of disease. Geneva: WHO 270 (1996).","paperID":"None"},{"content":"O'Shaughnessy, D. Linear predictive coding. Potentials, IEEE 7, 1 (1988), 29--32.","paperID":"None"},{"content":"Pagani, M., Mazzuero, G., Ferrari, A., Liberati, D., Cerutti, S., Vaitl, D., Tavazzi, L., and Malliani, A. Sympathovagal interaction during mental stress. a study using spectral analysis of heart rate variability in healthy control subjects and patients with a prior myocardial infarction. Circulation 83, 4 Suppl (1991), II43.","paperID":"None"},{"content":"Pickering, T. Mental stress as a causal factor in the development of hypertension and cardiovascular disease. Current Hypertension Reports 3, 3 (2001), 249--254.","paperID":"None"},{"content":"Rajendra Acharya, U., Paul Joseph, K., Kannathal, N., Lim, C. M., and Suri, J. S. Heart rate variability: a review. Medical and Biological Engineering and Computing 44, 12 (2006), 1031--1051.","paperID":"None"},{"content":"Rawenwaaij-Arts, C., Kallee, L., Hopman, J., et al. Task force of the european society of cardiology and the north american society of pacing and electrophysiology. heart rate variability. standards of measurement, physiologic interpretation, and clinical use. circulation 1996; 93: 1043--1065. Intern. Med 118 (1993), 436--447.","paperID":"None"},{"content":"Schnall, P., Landsbergis, P., and Baker, D. Job strain and cardiovascular disease. Annual review of public health 15, 1 (1994), 381--411.","paperID":"None"},{"content":"Tarvainen, M. P., Niskanen, J.-P., Lipponen, J., Ranta-Aho, P., and Karjalainen, P. Kubios hrva software for advanced heart rate variability analysis. In 4th European Conference of the International Federation for Medical and Biological Engineering, Springer (2009), 1022--1025.","paperID":"None"},{"content":"Visser, B., De Looze, M. P., De Graaff, M. P., and Van Dieën, J. H. Effects of precision demands and mental pressure on muscle activation and hand forces in computer mouse tasks. Ergonomics 47, 2 (2004), 202--217.","paperID":"None"},{"content":"Wahlström, J. Ergonomics, musculoskeletal disorders and computer work. Occupational Medicine 55, 3 (2005), 168--176.","paperID":"None"},{"content":"Wahlström, J., Hagberg, M., Johnson, P., Svensson, J., and Rempel, D. Influence of time pressure and verbal provocation on physiological and psychological reactions during work with a computer mouse. European journal of applied physiology 87, 3 (2002), 257--263.","paperID":"None"}],"citation":[{"content":"Matteo Ciman , Katarzyna Wac , Ombretta Gaggi, iSenseStress: assessing stress through human-smartphone interaction analysis, Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare, p.84-91, May 20-23, 2015, Istanbul, Turkey","paperID":"2826178"},{"content":"Yongqiang Lyu , Xiaomin Luo , Jun Zhou , Chun Yu , Congcong Miao , Tong Wang , Yuanchun Shi , Ken-ichi Kameyama, Measuring Photoplethysmogram-Based Stress-Induced Vascular Response Index to Assess Cognitive Load and Stress, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702399"},{"content":"Surjya Ghosh , Vatsalya Chauhan , Niloy Ganguly , Bivas Mitra , Pradipta De, Impact of experience sampling methods on tap pattern based emotion recognition, Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers, September 07-11, 2015, Osaka, Japan","paperID":"2804396"},{"content":"Mridula Singh , Abhishek Kumar , Kuldeep Yadav , Himanshu Madhu , Tridib Mukherjee, Mauka-mauka: measuring and predicting opportunities for webcam-based heart rate sensing in workplace environment, Proceedings of the 10th EAI International Conference on Body Area Networks, September 28-30, 2015, Sydney, New South Wales, Australia","paperID":"2856249"},{"content":"Michele A. Williams , Asta Roseway , Chris O'Dowd , Mary Czerwinski , Meredith Ringel Morris, SWARM: An Actuated Wearable for Mediating Affect, Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, January 15-19, 2015, Stanford, California, USA","paperID":"2680565"},{"content":"Teng Han , Xiang Xiao , Lanfei Shi , John Canny , Jingtao Wang, Balancing Accuracy and Fun: Designing Camera Based Mobile Games for Implicit Heart Rate Monitoring, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702502"},{"content":"Xiangmin Fan , Jingtao Wang, BayesHeart: A Probabilistic Approach for Robust, Low-Latency Heart Rate Monitoring on Camera Phones, Proceedings of the 20th International Conference on Intelligent User Interfaces, March 29-April 01, 2015, Atlanta, Georgia, USA","paperID":"2701364"}],"abstract":"Stress causes and exacerbates many physiological and mental health problems. Routine and unobtrusive monitoring of stress would enable a variety of treatments, from break-taking to calming exercises. It may also be a valuable tool for assessing effects (frustration, difficulty) of using interfaces or applications. Custom sensing hardware is a poor option, because of the need to buy/wear/use it continuously, even before stress-related problems are evident. Here we explore stress measurement from common computer mouse operations. We use a simple model of arm-hand dynamics that captures muscle stiffness during mouse movement. We show that the within-subject mouse-derived stress measure is quite strong, even compared to concurrent physiological sensor measurements. While our study used fixed mouse tasks, the stress signal was still strong even when averaged across widely varying task geometries. We argue that mouse sensing \"in the wild\" may be feasible, by analyzing frequently-performed operations of particular geometries.","video":"http://www.youtube.com/embed/O0L89Eeb-90?rel=0","title":"MouStress: detecting stress from mouse motion","filename":"CHI14/p61","authors":["David Sun","Pablo Paredes","John Canny"],"conference":"CHI '14"}