{"paperId":2557196,"citation":[{"content":"Wendy Moncur , David Kirk, An emergent framework for digital memorials, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598516"}],"abstract":"Cultural institutions, such as museums, often curate politically and ethically sensitive materials. Increasingly, Internet-enabled, digital technology intersects with these curatorial practices offering new opportunities for public and scholarly engagement. We report on a case study of human rights media archiving at a genocide memorial centre in Rwanda, motivated by our interests in ICT support to memorialisation practices. Through an analysis of our discussions with staff about their work, we report on how accounts of the Rwandan Genocide are being captured and curated to support the centre's humanitarian agenda and associated values. We identify transferable curatorial concerns for human rights media communication amongst scholarly networks and public audiences worldwide, elucidating interaction design challenges for supportive ICT and contributing to HCI discourses on Value Sensitive Design and cultural engagement with sensitive materials.","video":"http://www.youtube.com/embed/8ZN2rDr3szQ?rel=0","title":"Human values in curating a human rights media archive","filename":"CHI14/p2685","authors":["Abigail C. Durrant","David S. Kirk","Stuart Reeves"],"conference":"CHI '14","reference":[{"content":"Aegis Students. http://www.aegisstudents.org","paperID":"None"},{"content":"Aegis Trust. http://www.aegistrust.org","paperID":"None"},{"content":"Appadurai, A. Globalisation and the research imagination. Oxford: Blackwell, 1999.","paperID":"None"},{"content":"Bell, G. Making sense of museums: the museum as a cultural ecology. Intel Corp. Technical Report, 2002.","paperID":"None"},{"content":"Alan Borning , Michael Muller, Next steps for value sensitive design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208560"},{"content":"Burrell, J. and Anderson, K. I have great desires to look beyond my world: trajectories of information and communication technology use among Ghanians living abroad. New Media Society (2008), 10:203.","paperID":"None"},{"content":"Rachel Clarke , Peter Wright , Madeline Balaam , John McCarthy, Digital portraits: photo-sharing after domestic violence, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2481348"},{"content":"Countries by GDP per capita http://bit.ly/193E8H","paperID":"None"},{"content":"Fetsherein, M. Present State and Emerging Scenarios of Digital Rights Management Systems. The Int. Journal on Media Management. 4, 3 (2002), 164--171.","paperID":"None"},{"content":"Friedman, B., Kahn, P. H., Borning, A. Value Sensitive Design and Information Systems. In Zhang, P. and Galletta, D. (Eds) Human-Computer Interaction in Management Information Systems: Foundations. M.E. Sharpe, Inc: NY (2006) 348'372.","paperID":"None"},{"content":"Genocide Archive Rwanda. http://www.genocidearchiverwanda.org.rw","paperID":"None"},{"content":"Global Development Horizons 2011: Multi-polarity ' The New Global Economy. World Bank Publications. http://econ.worldbank.org","paperID":"None"},{"content":"Hoskins A. Signs of the Holocaust: exhibiting memory in a mediated age. Media, Culture and Society, (2003) 25: 7'22","paperID":"None"},{"content":"Human Rights Watch. Law and Reality: Progress in Judicial Reform in Rwanda. Human Rights Watch Reports. (2008) http://bit.ly/16eD2os","paperID":"None"},{"content":"Lilly Irani , Janet Vertesi , Paul Dourish , Kavita Philip , Rebecca E. Grinter, Postcolonial computing: a lens on design and development, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753522"},{"content":"Keene, S. Digital collections: museums and the information age. Oxford: Routledge, 1998.","paperID":"None"},{"content":"Christian Kelleher , T-Kay Sangwand , Kevin Wood , Yves Kamuronsi, The Human Rights Documentation Initiative at the University of Texas Libraries, The New Review of Information Networking, v.15 n.2, p.94-109, November 2010","paperID":"1891872"},{"content":"Kigali Genocide Memorial. http://www.kigalimemorialcentre.org","paperID":"None"},{"content":"Krakover, S. The Holocaust Remembrance Site of Yad Vashem Welcomes Visitors. Int. Research in Geographical and Environmental Education. 11:4 (2002), 359--362.","paperID":"None"},{"content":"Langdridge, R. Phenomenological Psychology: Theory, Research and Method. London: Pearson, 2007.","paperID":"None"},{"content":"Silvia Lindtner , Ken Anderson , Paul Dourish, Cultural appropriation: information technologies as sites of transnational imagination, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145220"},{"content":"McLagan, M. Principles, Publicity, and Politics: Notes on Human Rights Media. American Anthropologist 105(3): (2003), 605--612.","paperID":"None"},{"content":"Michael Massimi , William Odom , Richard Banks , David Kirk, Matters of life and death: locating the end of life in lifespan-oriented hci research, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979090"},{"content":"Lisa P. Nathan , Batya Friedman, Interacting with policy in a political world: reflections from the voices from the Rwanda Tribunal project, interactions, v.17 n.5, September + October 2010","paperID":"1836231"},{"content":"Lisa P. Nathan , Milli Lake , Nell Carden Grey , Trond Nilsen , Robert F. Utter , Elizabeth J. Utter , Mark Ring , Zoe Kahn , Batya Friedman, Multi-lifespan information system design: investigating a new design approach in Rwanda, Proceedings of the 2011 iConference, p.591-597, February 08-11, 2011, Seattle, Washington","paperID":"1940841"},{"content":"Prunier, G. The Rwanda Crisis: History of a Genocide. New York: Columbia University Press, 1995.","paperID":"None"},{"content":"Rwanda Vision 2020. http://bit.ly/niwUQW","paperID":"None"},{"content":"Sriram, C. L., King, J.C., Mertus, J.A., et al. (Eds.) Surviving Field Research: working in violent and difficult situations. New York: Routledge, 2000.","paperID":"None"},{"content":"Solanilla, L. The Internet as a Tool for Communicating Life Stories: a New Challenge for 'Memory Institutions'. Int. Journal of Intangible Heritage. 3 (2008) 103--116.","paperID":"None"},{"content":"Alex S. Taylor, Out there, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979042"},{"content":"The Holocaust Centre. http://holocaustcentre.net","paperID":"None"},{"content":"Thorin, S. Global Changes in Scholarly Communication. In H. S. Ching, P. W. T. Poon and C. McNaught (Eds.), eLearning and Digital Publishing, (2006) 221'240.","paperID":"None"},{"content":"Peter Wright , John McCarthy, Experience-Centered Design: Designers, Users, and Communities in Dialogue, Morgan and Claypool Publishers, 2010","paperID":"1855065"},{"content":"Daisy Yoo , Milli Lake , Trond Nilsen , Molly E. Utter , Robert Alsdorf , Theoneste Bizimana , Lisa P. Nathan , Mark Ring , Elizabeth J. Utter , Robert F. Utter , Batya Friedman, Envisioning across generations: a multi-lifespan information system for international justice in rwanda, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2481349"}]}