{"paperId":2557236,"citation":[{"content":"Pankaj Doke , Anirudha Joshi, Mobile Phone Usage by Low Literate Users, Proceedings of the 7th International Conference on HCI, IndiaHCI 2015, p.10-18, December 17-19, 2015, Guwahati, India","paperID":"2835968"},{"content":"Maletsabisa Molapo , Melissa Densmore, How to choose a mobile phone for an ICT4D project, Proceedings of the Seventh International Conference on Information and Communication Technologies and Development, May 15-18, 2015, Singapore, Singapore","paperID":"2737897"},{"content":"Abhishek Shrivastava , Anirudha Joshi, Effects of visuals, menu depths, and menu positions on IVR usage by non-tech savvy users, Proceedings of the India HCI 2014 Conference on Human Computer Interaction, December 07-09, 2014, New Delhi, India","paperID":"2676707"},{"content":"Trevor Perrier , Brian DeRenzi , Richard Anderson, USSD: The Third Universal App, Proceedings of the 2015 Annual Symposium on Computing for Development, December 01-02, 2015, London, United Kingdom","paperID":"2830645"}],"reference":[{"content":"Sheetal K. Agarwal , Anupam Jain , Arun Kumar , Amit A. Nanavati , Nitendra Rajput, The spoken web: a web for the underprivileged, ACM SIGWEB Newsletter","paperID":"1796391"},{"content":"Brooke, J. SUS: A \"Quick and Dirty\" Usability Scale. In Jordan, P. et al. Usability Evaluation in Industry. Taylor and Francis (1996).","paperID":"None"},{"content":"Cauldbeck, M., O'Connor, C., O'Connor, M., Saunders, J., Rao, B., Mallesh, V., Laing, R., Satish, K. Adherence to anti-retroviral therapy among HIV patients in Bangalore, India. AIDS Research and Therapy (2009).","paperID":"None"},{"content":"Chang, L., Kagaayi, J., Nakigozi, G., Packer, A., Serwadda, D., Quinn, T., Gray, R., Bollinger, R., Reynolds, S. Responding to the Human Resource Crisis: Peer Health Workers, Mobile Phones, and HIV Care in Rakai, Uganda. AIDS patient care and STDs (2008).","paperID":"None"},{"content":"Duraisamy, P., Ganesh, A., Homan, R., Kumarasamy, N., Castle, C., Sripriya, P., Mahendra,V., Solomon, S. Costs and financial burden of care and support services to PLHA and households in South India. AIDS care (2006).","paperID":"None"},{"content":"Fabricant, R. Project Masiluleke. Interactions (2009).","paperID":"None"},{"content":"Haberer J., Kiwanuka J., Nansera D., Wilson I., Bangsberg D. Challenges in using mobile phones for collection of antiretroviral therapy adherence data in a resource-limited setting. AIDS and behavior (2010).","paperID":"None"},{"content":"Aishwarya M. Iyengar , Anirudha Joshi, Evaluating anonymous social networking for PLHA with social prototypes, Proceedings of the 3rd ACM Symposium on Computing for Development, January 11-12, 2013, Bangalore, India","paperID":"2442923"},{"content":"Anirudha Joshi , Mandar Rane , Debjani Roy , Shweta Sali , Neha Bharshankar , N. Kumarasamy , Sanjay Pujari , Davidson Solomon , H. Diamond Sharma , D. G. Saple , Romain Rutten , Aakash Ganju , Joris Van Dam, Design opportunities for supporting treatment of people living with HIV / AIDS in India, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042149"},{"content":"Klein, D., Wustrack, G., Schwartz, A. Medication adherence: Many conditions, a common problem. HFES Annual Meeting, SAGE (2006).","paperID":"None"},{"content":"Kumarasamy, N., Solomon, S., Chaguturu, S., Cecelia, A., Vallabhaneni, S., Flanigan, T. The changing natural history of HIV disease: Before and after the introduction of generic antiretroviral therapy in southern India. CID (2005).","paperID":"None"},{"content":"Lester, R., Karanja, S. Mobile phones: exceptional tools for HIV / AIDS, health, and crisis management. Lancet Infectious Diseases (2008).","paperID":"None"},{"content":"Mannheimer, S., Morse, E., Matts, J., Andrews, L., Child, C., Schmetter, B., Friedland, G. Sustained benefit from a long-term antiretroviral adherence intervention. JAIDS (2006).","paperID":"None"},{"content":"Medhi, I., Toyama, K., Joshi, A., Athavankar, U., Cutrell, E. Acomparison of list vs. hierarchical UIs on mobile phones for non-literate users. INTERACT (2013).","paperID":"None"},{"content":"Preeti Mudliar , Jonathan Donner , William Thies, Emergent practices around CGNet Swara, voice forum for citizen journalism in rural India, Proceedings of the Fifth International Conference on Information and Communication Technologies and Development, March 12-15, 2012, Atlanta, Georgia","paperID":"2160695"},{"content":"National AIDS Control Organisation Facts and Figures. http://www.naco.gov.in/NACO/Quick_Links/Publication/State_Fact_Sheets/Fact_Sheets/ (2012).","paperID":"None"},{"content":"Noar, S., Black, H., Pierce, L. Efficacy of computer technology-based HIV prevention interventions: a metaanalysis. Aids 23.1 (2009).","paperID":"None"},{"content":"Niranjan Pai , Pradnya Supe , Shailesh Kore , Y. S. Nandanwar , Aparna Hegde , Edward Cutrell , William Thies, Using automated voice calls to improve adherence to iron supplements during pregnancy: a pilot study, Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers, December 07-10, 2013, Cape Town, South Africa","paperID":"2516608"},{"content":"Neil Patel , Kapil Shah , Krishna Savani , Scott R. Klemmer , Paresh Dave , Tapan S. Parikh, Power to the peers: authority of source effects for a voice-based agricultural information service in rural India, Proceedings of the Fifth International Conference on Information and Communication Technologies and Development, March 12-15, 2012, Atlanta, Georgia","paperID":"2160696"},{"content":"Patrick, K., Griswold, W., Raab, F., Intille, S. Health and the mobile phone. AJPM (2008).","paperID":"None"},{"content":"Peter L. T. Pirolli, Information Foraging Theory: Adaptive Interaction with Information, Oxford University Press, Inc., New York, NY, 2007","paperID":"1450927"},{"content":"Pop-Eleches, C. Thirumurthy, H., Habyarimana, J., Zivin, J., Goldstein, M., Walque, D., MacKeen, L., Haberer, J., Kimaiyo, S., Sidle, J., Ngare, D., Bangsberg, D. Mobile phone technologies improve adherence to antiretroviral treatment in a resource-limited setting: a randomized controlled trial of text message reminders. Aids 25 (2011).","paperID":"None"},{"content":"Pranav Ramkrishnan , Aditya Vashistha , Edward Cutrell , William Thies, DocTalk: extending doctors' visits with personalized voice messages, Proceedings of the 3rd ACM Symposium on Computing for Development, January 11-12, 2013, Bangalore, India","paperID":"2442928"},{"content":"Prasad Girish Rashinkar , Anirudha Joshi , Mandar Rane , Shweta Sali , Salil Badodekar , Nagraj Emmadi , Debjani Roy , Riyaj Sheikh , Abhishek Shrivastava, Healthcare IVRS for non-tech-savvy users, Proceedings of the 7th conference on Workgroup Human-Computer Interaction and Usability Engineering of the Austrian Computer Society: information Quality in e-Health, November 25-26, 2011, Graz, Austria","paperID":"2177772"},{"content":"Rivett, U., Tapson, J. The Cell-Life project: converging technologies in the context of HIV/AIDS. IJCRE (2009).","paperID":"None"},{"content":"Rodrigues, R., Shet, A., Antony, J., Sidney, K., Arumugam, K., Krishnamurthy, S., D'Souza, G., DeCosta, A. Supporting adherence to antiretroviral therapy with mobile phone reminders: results from a cohort in South India. PloS one (2012).","paperID":"None"},{"content":"Nithya Sambasivan , Julie Weber , Edward Cutrell, Designing a phone broadcasting system for urban sex workers in India, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1978980"},{"content":"Sarna, A., Pujari, S., Sengar, A., Garg, R., Gupta, I., Dam, J. Adherence to Antiretroviral Therapy & its Determinants Amongst HIV Patients in India. IJMR (2008).","paperID":"None"},{"content":"Sauro, J. Measuring Usability With the System Usability Scale. http://www.measuringusability.com/sus.php.","paperID":"None"},{"content":"Supporting Treatment of People Living with HIV / AIDS in Resource Limited Settings with IVRs, Appendix (Quantitative Data) http://www.idc.iitb.ac.in/~anirudha/TAMApilotsAppendix.html (2014).","paperID":"None"},{"content":"Tucker J., Simpson, C., Huang, J., Roth, D., Stewart, K. Utility of an interactive voice response system to assess antiretroviral pharmacotherapy adherence among substance users living with HIV/AIDS in the rural South. AIDS Patient Care STDS (2013).","paperID":"None"},{"content":"Tulis, T. and Albert, B. Measuring User Experience, Morgan Kaufmann (2008).","paperID":"None"},{"content":"Vidrine, D., Arduino, R., Lazev, A., Gritz, E. A randomized trial of a proactive cellular telephone intervention for smokers living with HIV/AIDS. Aids (2006).","paperID":"None"},{"content":"WHO: Consolidated guidelines on the use of antiretroviral drugs for treating and preventing HIV infection. http://www.who.int/hiv/pub/guidelines/arv2013/ (2013).","paperID":"None"},{"content":"Wikipedia, List of countries by HIV/AIDS adult prevalence rate. http://en.wikipedia.org/wiki/List_of_countries_by_HIV/AIDS_adult_prevalence_rate.","paperID":"None"},{"content":"Woodrow W. Winchester, III, COVER STORYCatalyzing a perfect storm: mobile phone-based HIV-prevention behavioral interventions, interactions, v.16 n.6, November + December 2009","paperID":"1620696"},{"content":"Wu, X. Factors associated with adherence to antiretroviral therapy among HIV/AIDS patients in rural China. Aids (2007).","paperID":"None"}],"abstract":"We developed an interactive voice response (IVR) system called TAMA (Treatment Advice by Mobile Alerts) that provides treatment support to people living with HIV / AIDS (PLHA) in developing countries, who are on antiret-roviral therapy (ART). We deployed TAMA with 54 PLHA in 5 HIV clinics in India for a period of 12 weeks. During the study, we gathered feedback about TAMA's design and usage. Additionally, we conducted detailed qualitative interviews and analysed usage logs. We found that TAMA was usable and viable in the real life settings of PLHA and it had many desirable effects on their treatment adherence. We developed insights that inform the design of TAMA and some of these can be generalised to design of other long-term, frequent-use IVR applications for users in developing countries in the healthcare domain and beyond.","video":"http://www.youtube.com/embed/r6KQdpUw9zI?rel=0","title":"Supporting treatment of people living with HIV / AIDS in resource limited settings with IVRs","filename":"CHI14/p1595","authors":["Anirudha Joshi","Mandar Rane","Debjani Roy","Nagraj Emmadi","Padma Srinivasan","N. Kumarasamy","Sanjay Pujari","Davidson Solomon","Rashmi Rodrigues","D.G. Saple","Kamalika Sen","Els Veldeman","Romain Rutten"],"conference":"CHI '14"}