{"paperId":2557007,"citation":[{"content":"Assunta Matassa , Leonardo Angelini , Maurizio Caon , Marianna Obrist , Elena Mugellini, Second Workshop on Full-Body and Multisensory Experience, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2854116"},{"content":"Assunta Matassa , Luca Console , Leonardo Angelini , Maurizio Caon , Omar Abou Khaled, Workshop on full-body and multisensory experience in ubiquitous interaction, Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers, September 07-11, 2015, Osaka, Japan","paperID":"2806201"}],"reference":[{"content":"Bartoshuk, L.M., Duffy, V.B., Fast, K., Green, B.G, Prutkin, J., Snyder, D.J. Labeled scales (e.g., category, Likert, VAS) and invalid across-group comparisons: What we have learned from genetic variation in taste, Food Qual Pref, 14(2), (2003), 125--138.","paperID":"None"},{"content":"Bartoshuk, L.M. Comparing sensory experiences across individuals: Recent psychophysical advances illuminate genetic variation in taste perception. Chem. Senses, 25(4), (2000) 447--460.","paperID":"None"},{"content":"Chen, J., Engelen, L. (Eds.). Food oral processing: Fundamentals of eating and sensory perception. Wiley-Blackwell: Oxford, UK (2012).","paperID":"None"},{"content":"Rob Comber , Eva Ganglbauer , Jaz Hee-jeong Choi , Jettie Hoonhout , Yvonne Rogers , Kenton O'Hara , Julie Maitland, Food and interaction design: designing for food in everyday life, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2212716"},{"content":"Desmet, P.M.A., Schifferstein, H.N.J. Sources of positive and negative emotions in food experience. Appetite, 50(2--3), (2008), 290--301.","paperID":"None"},{"content":"Drewnowski, A., Kristal, A., Cohen, J. Genetic taste responses to 6-n-propylthiouracil among adults: A screening tool for epidemiological studies. Chem. Senses 26(5), (2001), 483--489.","paperID":"None"},{"content":"Glendinning J. Is the bitter rejection response always adaptive? Physiol. Beh., 56, (1994), 1217--122","paperID":"None"},{"content":"Green, B.G., et al. Evaluating the \"Labeled Magnitude Scale\" for measuring sensations of taste and smell. Chem. Senses, 21(3), (1996), 323--334.","paperID":"None"},{"content":"Andrea Grimes , Richard Harper, Celebratory technology: new directions for food research in HCI, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357130"},{"content":"Hoehl, K., Schoenberger, G.U., Busch-Stockfisch, M. Water quality and taste sensitivity for basic tastes and metallic sensation. Food Qual Pref 21(2), (2010), 243--249.","paperID":"None"},{"content":"Annika Hupfeld , Tom Rodden, Laying the table for HCI: uncovering ecologies of domestic food consumption, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207694"},{"content":"Humphries, C. Delicious science. Chefs are teaming up with researchers to create avantgarde dishes. Is \"molecular gastronomy\" more than a fad Nature, 486 (2012), 10--11.","paperID":"None"},{"content":"Katherine Isbister , Kristina Höök , Michael Sharp , Jarmo Laaksolahti, The sensual evaluation instrument: developing an affective evaluation tool, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124946"},{"content":"Kahneman, D. A perspective on judgement and choice. American Psychologist, 58(9), (2003), 697--720.","paperID":"None"},{"content":"Light, A. Adding method to meaning: A Technique for exploring peoples' experiences with technology. Beh. and Information Technology, 25(6) (2006), 175--187.","paperID":"None"},{"content":"Martin Murer , Ilhan Aslan , Manfred Tscheligi, LOLLio: exploring taste as playful modality, Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction, February 10-13, 2013, Barcelona, Spain","paperID":"2460675"},{"content":"Christiane Moser , Manfred Tscheligi, Playful taste interaction, Proceedings of the 12th International Conference on Interaction Design and Children, p.340-343, June 24-27, 2013, New York, New York","paperID":"2485828"},{"content":"Takuji Narumi , Shinya Nishizaka , Takashi Kajinami , Tomohiro Tanikawa , Michitaka Hirose, Augmented reality flavors: gustatory display based on edible marker and cross-modal interaction, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1978957"},{"content":"Nakamura, Y., Goto, T.K., Tokumori, K., et al. The temporal change in the cortical activations due to salty and sweet tastes in humans: fMRI and time-intensity sensory evaluation. Neurorep, 23(6), (2012), 400--404.","paperID":"None"},{"content":"Ngo, M.K., Velasco, C., Salgado, A., et al. Assessing crossmodal corresponddences in exotic fruit juices: The case of shape and sound symbolism. Food Qual Pref 28, (2013), 361--369.","paperID":"None"},{"content":"2Núnez-Jaramillo, L., Ramirez-Lugo, L., Herrera-Morales, W., Miranda, M.I. Taste memory formation: Latest advances and challenges. Behav Brain Res, 207(2), (2010), 232--248.","paperID":"None"},{"content":"2Maynes-Aminzade, D. Edible bits: Seamless interfaces between people, data and food. CHI EA (2005), 2207--2210.","paperID":"None"},{"content":"Marianna Obrist , Sue Ann Seah , Sriram Subramanian, Talking about tactile experiences, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466220"},{"content":"Palmer, S. E., Schloss, K. B. An ecological valence theory of human color preference. Proc. of the National Academy of Sciences, 107(19) (2010), 8877--8882.","paperID":"None"},{"content":"Petitmengin, C. Describing one's subjective experience in the second person. An interview method for the science of consciousness. Phen. Cog. Sci., 5(3--4), (2006), 229--269.","paperID":"None"},{"content":"Pineau, N., Schlich, P., Cordelle, S., et al. Temporal dominance of sensations: Construction of the TDS curves and comparison with time-intensity. Food Qual Pref, 20(6), (2009), 450--455.","paperID":"None"},{"content":"Nimesha Ranasinghe , Adrian David Cheok , Ryohei Nakatsu, Taste/IP: the sensation of taste for digital communication, Proceedings of the 14th ACM international conference on Multimodal interaction, October 22-26, 2012, Santa Monica, California, USA","paperID":"2388768"},{"content":"Nimesha Ranasinghe , Kasun Karunanayaka , Adrian David Cheok , Owen Noel Newton Fernando , Hideaki Nii , Ponnampalam Gopalakrishnakone, Digital taste and smell communication, Proceedings of the 6th International Conference on Body Area Networks, November 07-08, 2011, Beijing, China","paperID":"2318795"},{"content":"Anne Roudaut , Abhijit Karnik , Markus Löchtefeld , Sriram Subramanian, Morphees: toward high \"shape resolution\" in self-actuated flexible mobile devices, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470738"},{"content":"Savage, N. Technology: The taste of things to come. Nature 486(21), (2012), 18--19.","paperID":"None"},{"content":"Schifferstein, H.N.J., Fenko, A., Desmet, et al. Influence of package design on the dynamics of multisensory and emotional food exp. Food Qual Pref, 27 (2013), 18--25.","paperID":"None"},{"content":"Schifferstein, H.N.J. Hekkert, P. Product experience. USA: Elsevier (2007).","paperID":"None"},{"content":"Smets, G.J.F., Overbeeke, C.J. Expressing tastes in packages. Design Studies, 16(3), (1995), 349--365.","paperID":"None"},{"content":"Spence, C. Crossmodal correspondences: A tutorial review. Atten Percept Psychophys 73, (2011), 971--995.","paperID":"None"},{"content":"Spence, C., Piqueras-Fiszman, B. Technology at the dining table. Flavour, (2013), 2--16.","paperID":"None"},{"content":"Spence, C., Smith, B., Auvray, M. Confusing tastes and flavours. In M. Matthen and D. Stokes (Eds.). The senses. Oxford: University Press. (in press, 2014).","paperID":"None"},{"content":"Stanovich, K.E., West, R.F. Individual difference in reasoning: implications for the rationality debate?. Behav. Brain Sciences 23(5), (2000), 645--665.","paperID":"None"},{"content":"Strack, F., Mussweiler, T. Explaining the enigmatic anchoring effect: Mechanisms of selective accessibility. Pers. and Social Psy. 73(3), (1997), 437--446.","paperID":"None"},{"content":"Tosey, P., Mathison, J. Exploring inner landscapes through psychophenomenology. Qual. Research in Organiz. And Management: Inter. J., 5(1) (2010), 63--82.","paperID":"None"},{"content":"Trivedi, B.P. Hardwired for taste. Research into human taste receptors extends beyond the tongue to some unexpected places. Nature, 486, (2012), 7--9.","paperID":"None"},{"content":"Vermersch P. L'entretien d'explicitation {translated as Explicitation interview}, ESF (1994).","paperID":"None"},{"content":"Wakeling, I.N., MacFie, H.J. Designing consumer trials balanced for first and higher orders of carry-over effect when only a subset of k samples from t may be tested. Food Qual Pref, 6(4), (1995), 299--308.","paperID":"None"}],"abstract":"We present rich descriptions of taste experience through an analysis of the diachronic and synchronic experiences of each of the five basic taste qualities: sweet, sour, salt, bitter, and umami. Our findings, based on a combination of user experience evaluation techniques highlight three main themes: temporality, affective reactions, and embodiment. We present the taste characteristics as a framework for design and discuss each taste in order to elucidate the design qualities of individual taste experiences. These findings add a semantic understanding of taste experiences, their temporality enhanced through descriptions of the affective reactions and embodiment that the five basic tastes elicit. These findings are discussed on the basis of established psychological and behavioral phenomena, highlighting the potential for taste-enhanced design.","video":"http://www.youtube.com/embed/wW01V1TBo7w?rel=0","title":"Temporal, affective, and embodied characteristics of taste experiences: a framework for design","filename":"CHI14/p2853","authors":["Marianna Obrist","Rob Comber","Sriram Subramanian","Betina Piqueras-Fiszman","Carlos Velasco","Charles Spence"],"conference":"CHI '14"}