{"paperId":2557131,"citation":[],"reference":[{"content":"Robert Amar , John Stasko, BEST PAPER: A Knowledge Task-Based Framework for Design and Evaluation of Information Visualizations, Proceedings of the IEEE Symposium on Information Visualization, p.143-150, October 10-12, 2004","paperID":"1038793"},{"content":"Robert Amar , James Eagan , John Stasko, Low-Level Components of Analytic Activity in Information Visualization, Proceedings of the Proceedings of the 2005 IEEE Symposium on Information Visualization, p.15, October 23-25, 2005","paperID":"1106582"},{"content":"S. Belia, F. Fidler, J. Williams, G. Cumming. Researchers misunderstand confidence intervals and standard error bars. Psychological methods, 10(4), 389--396, 2005.","paperID":"None"},{"content":"C. Bewer, G. W. Hatchard and Mark A. Harrower, 2003, ColorBrewer in Print: A Catalog of Color Schemes for Maps, Cartography and Geographic Information Science 30(1): 5--32.","paperID":"None"},{"content":"N. Boukhelifa, A. Bezerianos, T. Isenberg, J. D. Fekete. Evaluating Sketchiness as a Visual Variable for the Depiction of Qualitative Uncertainty. IEEE Trans. on Vis. and Comp. Graphics, 18(12), 2769--2778, 2012.","paperID":"None"},{"content":"G. Cumming. Understanding the new statistics: Effect sizes, confidence intervals, and meta-analysis. New York, Routledge, 2012.","paperID":"None"},{"content":"G. Cumming, S. Finch. Inference by eye: Confidence intervals and how to read pictures of data. American Psychologist, 60(2), 170--18, 2005.","paperID":"None"},{"content":"Danyel Fisher , Igor Popov , Steven Drucker , m.c. schraefel, Trust me, i'm partially right: incremental visualization lets analysts explore large datasets faster, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208294"},{"content":"David Goldsman , Barry L. Nelson , Bruce Schmeiser, Methods for selecting the best system, Proceedings of the 23rd conference on Winter simulation, p.177-186, December 08-11, 1991, Phoenix, Arizona, USA","paperID":"304277"},{"content":"Samuel Gratzl , Alexander Lex , Nils Gehlenborg , Hanspeter Pfister , Marc Streit, LineUp: Visual Analysis of Multi-Attribute Rankings, IEEE Transactions on Visualization and Computer Graphics, v.19 n.12, p.2277-2286, December 2013","paperID":"2553739"},{"content":"Joseph M. Hellerstein , Ron Avnur , Andy Chou , Christian Hidber , Chris Olston , Vijayshankar Raman , Tali Roth , Peter J. Haas, Interactive Data Analysis: The Control Project, Computer, v.32 n.8, p.51-59, August 1999","paperID":"621301"},{"content":"S. Kandel, A. Paepcke, J. M. Hellerstein, J. Heer. Enterprise data analysis and visualization: An interview study. IEEE Trans. on Vis. and Comp. Graphics, 18(12), 2917--2926.","paperID":"None"},{"content":"N. Kong, M. Agrawala. Graphical Overlays: Using Layered Elements to Aid Chart Reading. IEEE Trans. on Vis. and Comp. Graphics, 18(12), 2631--2638.","paperID":"None"},{"content":"A. M. MacEachren, A. Robinson, S. Hopper, S. Gardner, R. Murray, M. Gahegan, E. Hetzler. Visualizing geospatial information uncertainty: What we know and what we need to know. Cartography and Geographic Information Science, 32(3), 139--160.","paperID":"None"},{"content":"L. Micallef, P. Dragicevic, J. D. Fekete. Assessing the Effect of Visualizations on Bayesian Reasoning through Crowdsourcing. IEEE Trans. on Vis. and Comp. Graphics, 18.12 (2012): 2536--2545.","paperID":"None"},{"content":"Meredith Skeels , Bongshin Lee , Greg Smith , George Robertson, Revealing uncertainty for information visualization, Proceedings of the working conference on Advanced visual interfaces, May 28-30, 2008, Napoli, Italy","paperID":"1385637"},{"content":"Frank Olken , Doron Rotem, Random sampling from database files: a survey, Proceedings of the 5th international conference on Statistical and Scientific Database Management, p.92-111, April 03-05, 1990, Charlotte, NC","paperID":"1127118"},{"content":"Chris Olston , Jock D. Mackinlay, Visualizing Data with Bounded Uncertainty, Proceedings of the IEEE Symposium on Information Visualization (InfoVis'02), p.37, October 28-29, 2002","paperID":"857754"},{"content":"Jibonananda Sanyal , Song Zhang , Gargi Bhattacharya , Phil Amburn , Robert Moorhead, A User Study to Compare Four Uncertainty Visualization Methods for 1D and 2D Datasets, IEEE Transactions on Visualization and Computer Graphics, v.15 n.6, p.1209-1218, November 2009","paperID":"1639227"},{"content":"Mohamed A. Soliman , Ihab F. Ilyas, Ranking with Uncertain Scores, Proceedings of the 2009 IEEE International Conference on Data Engineering, p.317-328, March 29-April 02, 2009","paperID":"1547411"},{"content":"A. Tversky, D. Kahneman. Judgment under Uncertainty: Heuristics and Biases. Science, 185 (1974). 1124--1131.","paperID":"None"},{"content":"H. Wickham, L. Stryjewski. 40 Years of Boxplots. Technical Report from http://vita.had.co.nz/. 2012.","paperID":"None"},{"content":"Torre Zuk , Sheelagh Carpendale, Visualization of Uncertainty and Reasoning, Proceedings of the 8th international symposium on Smart Graphics, June 25-27, 2007, Kyoto, Japan","paperID":"1420311"}],"abstract":"We often use datasets that reflect samples, but many visualization tools treat data as full populations. Uncertain visualizations are good at representing data distributions emerging from samples, but are more limited in allowing users to carry out decision tasks. This is because tasks that are simple on a traditional chart (e.g. \"compare two bars\") become a complex probabilistic task on a chart with uncertainty. We present guidelines for creating visual annotations for solving tasks with uncertainty, and an implementation that addresses five core tasks on a bar chart. A preliminary user study shows promising results: that users have a justified confidence in their answers with our system.","video":"http://www.youtube.com/embed/BI7GAs-va-Q?rel=0","title":"Sample-oriented task-driven visualizations: allowing users to make better, more confident decisions","filename":"CHI14/p571","authors":["Nivan Ferreira","Danyel Fisher","Arnd Christian Konig"],"conference":"CHI '14"}