{"paperId":2557274,"citation":[{"content":"Yuhao Wu , Jia Jia , WaiKim Leung , Yejun Liu , Lianhong Cai, MPHA: A Personal Hearing Doctor Based on Mobile Devices, Proceedings of the 2015 ACM on International Conference on Multimodal Interaction, November 09-13, 2015, Seattle, Washington, USA","paperID":"2820753"}],"reference":[{"content":"Kirsten Bergmann , Friederike Eyssel , Stefan Kopp, A second chance to make a first impression? how appearance and nonverbal behavior affect perceived warmth and competence of virtual agents over time, Proceedings of the 12th international conference on Intelligent Virtual Agents, September 12-14, 2012, Santa Cruz, CA","paperID":"2402783"},{"content":"Bergmann, K., Kahl, S., and Kopp, S. Modeling the semantic coordination of speech and gesture under cognitive and linguistic constraints. In Intelligent Virtual Agents, R. Aylett, B. Krenn, C. Pelachaud, and H. Shimodaira, Eds., vol. 8108 of Lecture Notes in Computer Science. Springer Berlin Heidelberg, 2013, 203--216.","paperID":"None"},{"content":"Breazeal, C., Kidd, C., Thomaz, A., Hoffman, G., and Berlin, M. Effects of nonverbal communication on efficiency and robustness in human-robot teamwork. In Intelligent Robots and Systems, 2005. (IROS 2005). 2005 IEEE/RSJ International Conference on (2005), 708--713.","paperID":"None"},{"content":"Stéphanie Buisine , Sarkis Abrilian , Jean-Claude Martin, Evaluation of multimodal behaviour of embodied agents, From brows to trust: evaluating embodied conversational agents, Kluwer Academic Publishers, Norwell, MA, 2004","paperID":"1138326"},{"content":"Justine Cassell, Nudge nudge wink wink: elements of face-to-face conversation for embodied conversational agents, Embodied conversational agents, MIT Press, Cambridge, MA, 2001","paperID":"371554"},{"content":"Vijay Chidambaram , Yueh-Hsuan Chiang , Bilge Mutlu, Designing persuasive robots: how robots might persuade people using vocal and nonverbal cues, Proceedings of the seventh annual ACM/IEEE international conference on Human-Robot Interaction, March 05-08, 2012, Boston, Massachusetts, USA","paperID":"2157798"},{"content":"Field, A. Discovering statistics using SPSS. Sage publications, 2009.","paperID":"None"},{"content":"Fox, M. L., Dwyer, D. J., and Ganster, D. C. Effects of stressful job demands and control on physiological and attitudinal outcomes in a hospital setting. Academy of Management Journal 36, 2 (1993), 289--318.","paperID":"None"},{"content":"Goldin-Meadow, S. Hearing Gesture: How Our Hands Help Us Think. Belknap Press of Harvard University Press, 2005.","paperID":"None"},{"content":"Erdan Gu , Norman I. Badler, Visual attention and eye gaze during multiparty conversations with distractions, Proceedings of the 6th international conference on Intelligent Virtual Agents, August 21-23, 2006, Marina Del Rey, CA","paperID":"2090651"},{"content":"Markus Häring , Jessica Eichberg , Elisabeth André, Studies on grounding with gaze and pointing gestures in human-robot-interaction, Proceedings of the 4th international conference on Social Robotics, October 29-31, 2012, Chengdu, China","paperID":"2427803"},{"content":"Hart, S., and Staveland, L. Development of nasa-tlx (task load index): Results of empirical and theoretical research. In Human mental workload, P. A. Hancock and N. Meshkati (Eds.), Amsterdam: Elsevier (1988), 139--183.","paperID":"None"},{"content":"Hart, S. G. Nasa-task load index (nasa-tlx); 20 years later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9 (2006), 904--908.","paperID":"None"},{"content":"Yasuhiko Hato , Satoru Satake , Takayuki Kanda , Michita Imai , Norihiro Hagita, Pointing to space: modeling of deictic interaction referring to regions, Proceedings of the 5th ACM/IEEE international conference on Human-robot interaction, March 02-05, 2010, Osaka, Japan","paperID":"1734559"},{"content":"Ilies, R., Dimotakis, N., and De Pater, I. E. Psychological and physiological reactions to high workloads: Implications for well-being. Personnel Psychology 63, 2 (2010), 407--436.","paperID":"None"},{"content":"Iverson, J. M., Capirci, P., Longobardi, E., and Caselli, M. C. Gesturing in mother-child interaction. Cognitive Development 14 (1999), 57--75.","paperID":"None"},{"content":"Takayuki Kanda , Masahiro Shiomi , Zenta Miyashita , Hiroshi Ishiguro , Norihiro Hagita, A communication robot in a shopping mall, IEEE Transactions on Robotics, v.26 n.5, p.897-913, October 2010","paperID":"1922222"},{"content":"Kendon, A. Gesture and speech: How they interact. In Nonverbal Interaction (Sage Annual Reviews of Communication, Volume 11) J. Wiemann and R. Harrison, Eds. Sage Publications, Beverly Hills, California, 1983, 13--46.","paperID":"None"},{"content":"Kendon, A. Gesture - Visible Action as Utterance. Cambridge University Press, Cambridge, 2004.","paperID":"None"},{"content":"Michael Kipp , Michael Neff , Kerstin H. Kipp , Irene Albrecht, Towards Natural Gesture Synthesis: Evaluating Gesture Units in a Data-Driven Approach to Gesture Synthesis, Proceedings of the 7th international conference on Intelligent Virtual Agents, September 17-19, 2007, Paris, France","paperID":"1421882"},{"content":"Kita, S. Pointing: Where Language, Culture, and Cognition Meet. PSYCHOLOGY Press, 2003.","paperID":"None"},{"content":"McNeil, N., Alibali, M., and Evans, J. The role of gesture in children's comprehension of spoken language: now they need it, now they don't. Journal of Nonverbal Behavior 24, 2 (2000), 131--150.","paperID":"None"},{"content":"McNeill, D. Hand and Mind: What Gestures Reveal about Thought. University of Chicago Press, Chicago, 1992.","paperID":"None"},{"content":"Miller, G. A. The magical number seven, plus or minus two: Some limits on our capacity for processing information. The Psychological Review 63, 2 (March 1956), 81--97.","paperID":"None"},{"content":"Ng-Thow-Hing, V., Luo, P., and Okita, S. Y. Synchronized gesture and speech production for humanoid robots. In IROS, IEEE (2010), 4617--4624.","paperID":"None"},{"content":"Yusuke Okuno , Takayuki Kanda , Michita Imai , Hiroshi Ishiguro , Norihiro Hagita, Providing route directions: design of robot's utterance, gesture, and timing, Proceedings of the 4th ACM/IEEE international conference on Human robot interaction, March 09-13, 2009, La Jolla, California, USA","paperID":"1514108"},{"content":"Catherine Pelachaud, Studies on gesture expressivity for a virtual agent, Speech Communication, v.51 n.7, p.630-639, July, 2009","paperID":"1551018"},{"content":"Salem, M., Eyssel, F., Rohlfing, K., Kopp, S., and Joublin, F. To err is human(-like): Effects of robot gesture on perceived anthropomorphism and likability. International Journal of Social Robotics 5, 3 (2013), 313--323.","paperID":"None"},{"content":"Aaron Steinfeld , Terrence Fong , David Kaber , Michael Lewis , Jean Scholtz , Alan Schultz , Michael Goodrich, Common metrics for human-robot interaction, Proceedings of the 1st ACM SIGCHI/SIGART conference on Human-robot interaction, March 02-03, 2006, Salt Lake City, Utah, USA","paperID":"1121249"},{"content":"Vitense, H. S., Jacko, J. A., and Emery, V. K. Multimodal feedback: an assessment of performance and mental workload. Ergonomics 46, 1--3 (2003), 68--87. PMID: 12554399.","paperID":"None"},{"content":"Yuta Yoshiike , P. Ravindra S. De Silva , Michio Okada, MAWARI: a social interface to reduce the workload of the conversation, Proceedings of the Third international conference on Social Robotics, November 24-25, 2011, Amsterdam, The Netherlands","paperID":"2177871"}],"abstract":"Gestures are important non-verbal signals in human communication. Research with virtual agents and robots has started to add to the scientific knowledge about gestures but many questions with respect to the use of gestures in human-computer interaction are still open. This paper investigates the influence of robot gestures on the users' perceived workload and task performance (i.e. information recall) in a direction-giving task. We conducted a 2 x 2 (robot gestures vs. no robot gestures x easy vs. difficult task) experiment. The results indicate that robot gestures increased user performance and decreased perceived workload in the difficult task but not in the easy task. Thus, robot gestures are a promising means to improve human-robot interaction particularly in challenging tasks.","video":"http://www.youtube.com/embed/Zzp1AoF7UPE?rel=0","title":"Robot gestures make difficult tasks easier: the impact of gestures on perceived workload and task performance","filename":"CHI14/p1459","authors":["Manja Lohse","Reinier Rothuis","Jorge Gallego-Pérez","Daphne E. Karreman","Vanessa Evers"],"conference":"CHI '14"}