{"paperId":2557356,"citation":[{"content":"Catherine C. Marshall , Frank M. Shipman, An argument for archiving Facebook as a heterogeneous personal store, Proceedings of the 14th ACM/IEEE-CS Joint Conference on Digital Libraries, September 08-12, 2014, London, United Kingdom","paperID":"2740772"},{"content":"Catherine C. Marshall , Frank M. Shipman, Exploring the Ownership and Persistent Value of Facebook Content, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675203"}],"reference":[{"content":"Andy Beal , Judy Strauss, Radically Transparent: Monitoring and Managing Reputations Online, SYBEX Inc., Alameda, CA, 2008","paperID":"1796155"},{"content":"Bich, V., Gerasoulis, A. and Glover, E. Systems and methods for predicting if a query is a name. US Patent, 11 October 2007. http://www.google.com/patents/ US20070239735. Accessed 7 January 2014.","paperID":"None"},{"content":"boyd, d. and Crawford, K. Six provocations for big data. Oxford Internet Institute, 21 September, 2011.","paperID":"None"},{"content":"Claypoole, T. and Payton, T. Protecting Your Internet Identity. Rowman & Littlefield, Lanham, 2012.","paperID":"None"},{"content":"Marian Dörk , Sheelagh Carpendale , Carey Williamson, The information flaneur: a fresh look at information seeking, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979124"},{"content":"Susan Dumais , Edward Cutrell , JJ Cadiz , Gavin Jancke , Raman Sarin , Daniel C. Robbins, Stuff I've seen: a system for personal information retrieval and re-use, Proceedings of the 26th annual international ACM SIGIR conference on Research and development in informaion retrieval, July 28-August 01, 2003, Toronto, Canada","paperID":"860451"},{"content":"Gehl, R. Ladders, samurai, and blue collars: Personal branding in Web 2.0. First Monday 16, 9 (2011).","paperID":"None"},{"content":"Google Profiles. http://www.google.com/+/learnmore/profile. Accessed 7 January 2014.","paperID":"None"},{"content":"Benjamin M. Gross, Names of Our Lives, Proceedings of the 2009 International Conference on Computational Science and Engineering, p.747-752, August 29-31, 2009","paperID":"1633762"},{"content":"Henry, A. How to clean up your online presence and make a great first impression. Lifehacker, 28 November 2012. http://lifehacker.com/5963864. Accessed 7 January 2014.","paperID":"None"},{"content":"Herzog, W. and Stutzman, F. The case for online obscurity, California Law Review 101, (2013), 1--35.","paperID":"None"},{"content":"Bernard J. Jansen , Amanda Spink , Tefko Saracevic, Real life, real users, and real needs: a study and analysis of user queries on the web, Information Processing and Management: an International Journal, v.36 n.2, p.207-227, Jan.1.2000","paperID":"342498"},{"content":"Rosie Jones , Ravi Kumar , Bo Pang , Andrew Tomkins, Vanity fair: privacy in querylog bundles, Proceedings of the 17th ACM conference on Information and knowledge management, October 26-30, 2008, Napa Valley, California, USA","paperID":"1458195"},{"content":"Jones, W. and Teevan, J., eds. Personal Information Management. UW Press, Washington, 2007.","paperID":"None"},{"content":"Siân E. Lindley , Catherine C. Marshall , Richard Banks , Abigail Sellen , Tim Regan, Rethinking the web as a personal archive, Proceedings of the 22nd international conference on World Wide Web, May 13-17, 2013, Rio de Janeiro, Brazil","paperID":"2488454"},{"content":"Madden, M. and Smith, A. Reputation Management and Social Media. Pew Internet & American Life Project, 26 May 2010.","paperID":"None"},{"content":"Gary Marchionini, Information Concepts: From Books to Cyberspace Identities, Morgan and Claypool Publishers, 2010","paperID":"1951661"},{"content":"Catherine C. Marshall , Frank M. Shipman, The ownership and reuse of visual media, Proceedings of the 11th annual international ACM/IEEE joint conference on Digital libraries, June 13-17, 2011, Ottawa, Ontario, Canada","paperID":"1998108"},{"content":"Antony Mayfield, Me and My Web Shadow: How to Manage Your Reputation Online, A & C Black Publishers, London, UK, 2010","paperID":"1859399"},{"content":"Nicolai, T., Kirchhoff, L., Bruns, A., Wilson, J. and Saunders, B. The self-Googling phenomenon: Investigating the performance of personalized information resources. First Monday 14, 12 (2009).","paperID":"None"},{"content":"William Odom , John Zimmerman , Jodi Forlizzi, Teenagers and their virtual possessions: design opportunities and issues, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979161"},{"content":"Pash, A. Order free Google business cards for a limited time. Lifehacker. 1 May 2009. http://lifehacker.com/ 5236055/order-free-google-profile-business-cards-for-alimited-time. Accessed 7 January 2014.","paperID":"None"},{"content":"Soghoian, C. The problem of anonymous vanity searches. ISJLP 3, 2 (2007), 297--316.","paperID":"None"},{"content":"Fred Stutzman , Jacob Kramer-Duffield, Friends only: examining a privacy-enhancing behavior in facebook, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753559"},{"content":"Trapani, G. Forget the business card. Just Google me. HBR Blog Network, 10 August 2009. http://blogs.hbr.org/trapani/2009/08/forget-the-businesscardjust-g.html. Accessed 7 January 2014.","paperID":"None"},{"content":"Ting Yao , Min Zhang , Yiqun Liu , Shaoping Ma , Liyun Ru, Empirical Study on Rare Query Characteristics, Proceedings of the 2011 IEEE/WIC/ACM International Conferences on Web Intelligence and Intelligent Agent Technology, p.7-14, August 22-27, 2011","paperID":"2052417"},{"content":"Zimmer, M. Privacy on planet Google: Using the theory of contextual integrity to clarify the privacy threats of Google's quest for the perfect search engine. J. Bus. & Tech. Law 109, 3 (2008), 109.","paperID":"None"}],"abstract":"We present findings from a qualitative study of self-search, also known as ego or vanity search. In the context of a broader study about personal online content, participants were asked to search for themselves using their own computers and the browsers and queries they would normally adopt. Our analysis highlights five motivations for self-search: as a form of identity management; to discover reactions to and reuse of user-generated media; to re-find personal content; as a form of entertainment; and to reveal lost or forgotten content. Strategies vary according to motivation, and may differ markedly from typical information-seeking, with users looking deep into the results and using image search to identify content about themselves. We argue that two dimensions underpin ways of improving self-search: controllability and expectedness, and discuss what these dimensions imply for design.","video":"http://www.youtube.com/embed/eepXNVD4u9c?rel=0","title":"Searching for myself: motivations and strategies for self-search","filename":"CHI14/p3675","authors":["Catherine C. Marshall","Siân E. Lindley"],"conference":"CHI '14"}