{"paperId":2557108,"reference":[{"content":"Anderson, C. M., Martin, M. M., and Riddle, B. L. Small group relational satisfaction scale: development, reliability and validity. Communication Studies 52, 3 (2001), 220--233.","paperID":"None"},{"content":"Antonina D. Bambina, Online Social Support: The Interplay of Social Networks and Computer-Mediated Communication, Cambria Press, 2007","paperID":"1534606"},{"content":"Barak, A., and Gluck-Ofri, O. Degree and Reciprocity of Self-Disclosure in Online Forums. CyberPsychology & Behavior 10, 3 (2007), 407--417.","paperID":"None"},{"content":"Buhrmester, M., Kwang, T., and Gosling, S. D. Amazon's Mechanical Turk: A New Source of Inexpensive, Yet High-Quality, Data Perspectives on Psychological Science 6, 1 (2011), 3--5.","paperID":"None"},{"content":"Chou, W. S., Liu, B., Post, S. and Hesse, B. Health-related Internet use among cancer survivors: data from the Health Information National Trends Survey, 2003 - 2008. Journal of Cancer Survivorship, (2011), 1--8.","paperID":"None"},{"content":"Cohen, S., and Wills, T.A. Stress, social support, and the buffering hypothesis. Psychological Bulletin 98, 2 (1985), 310--357.","paperID":"None"},{"content":"Cutrona, C. E. Stress and social support - in search of optimal matching. Journal of Social and Clinical Psychology 9, (1990), 3--14.","paperID":"None"},{"content":"Cutrona, C. E., Shaffer, P. A., Wesner, K. A., and Gardner, K. A. Optimally Matching Support and Perceived Spousal Sensitivity. Journal of Family Psychology 21, (2007), 754--758.","paperID":"None"},{"content":"Cutrona, C. E., and Suhr, J. A. Controllability of Stressful Events and Satisfaction With Spouse Support Behaviors. Communication Research 19, (1992), 154--174.","paperID":"None"},{"content":"Hecht, M. L. Measures of communication satisfaction. Human Communication Research 4, 4 (1978), 350--368.","paperID":"None"},{"content":"Heckman, J. Sample selection bias as a specification error. Econometirica 47, 1 (1979), 153--162.","paperID":"None"},{"content":"Helgeson, V. S., and Cohen, S. Long-term effects of educational and peer discussion group interventions on adjustment to breast cancer. Health Psychology 20, 5 (2001), 387--392.","paperID":"None"},{"content":"Helgeson, V. S., Cohen, S., Schultz, R., and Yasko, J. Group support interventions for women with breast cancer: Who benefits from what? Health Psychology 19, 2 (2000), 107--114.","paperID":"None"},{"content":"Holt-Lunstad, J., Smith, T. B., and Layton, J. B. Social relationships and mortality risk: a meta-analytic review. PLoS Medicine 7, 7 (2010), e1000316.","paperID":"None"},{"content":"Rains, S. A., and Young, V. A. Meta-Analysis of Research on Formal Computer-Mediated Support Groups: Examining Group Characteristics and Health Outcomes. Human Communication Research 35, 3 (2009), 309--336.","paperID":"None"},{"content":"Reynolds, J. S., and Perrin, N. A. Mismatches in Social Support and Psychosocial Adjustment to Breast Cancer. Health Psychology 23, (2004), 425--430.","paperID":"None"},{"content":"Ridings, C. M., and Gefen, D. Virtual Community Attraction: Why People Hang Out Online. Journal of Computer-Mediated Communication 10, 1 (2004).","paperID":"None"},{"content":"Rimer, B. K., Lyons, E. J., Ribisl, K. M., Bowling, J. M., Golin, C. E., Forlenza, M. J., and Meier, A. How new subscribers use cancer-related online mailing lists. J Med Internet Res 7, 3 (2005), e32.","paperID":"None"},{"content":"Rodgers, S., and Chen, Q. Internet Community Group Participation: Psychosocial Benefits for Women with Breast Cancer. Journal of Computer-Mediated Communication 10, 4 (2005).","paperID":"None"},{"content":"Ruggiero, T. E. Uses and Gratifications Theory in the 21st Century. Mass Communication & Society 3, 1 (2000), 3--37.","paperID":"None"},{"content":"Shrout, P. E., Bolger, N., Iida, M., Burke, C., Gleason, M. E. J., and Lane, S. P. The Effects of Daily Support Transactions During Acute Stress: Results from a Diary Study of Bar Exam Preparation. In K. Sullivan and J. Davila (Eds.), Support Processes in Intimate Relationships (175--199). Oxford University Press, New York, NY, 2010.","paperID":"None"},{"content":"Smithson, J., Sharkey, S., Hewis, E., Jones, R., Emmens, T., Ford, T., and Owens, C. Problem presentation and responses on an online forum for young people who self-harm. Discourse Studies 13, 4 (2011), 487--501.","paperID":"None"},{"content":"Rion Snow , Brendan O'Connor , Daniel Jurafsky , Andrew Y. Ng, Cheap and fast---but is it good?: evaluating non-expert annotations for natural language tasks, Proceedings of the Conference on Empirical Methods in Natural Language Processing, October 25-27, 2008, Honolulu, Hawaii","paperID":"1613751"},{"content":"Taylor, S. E. Social Support: A Review. In H. S. Friedman (Ed.), The Oxford Handbook of Health Psychology (189--214). Oxford University Press, New York, NY, 2011.","paperID":"None"},{"content":"Uchino, B. Understanding the links between social support and physical health: A life-span perspective with emphasis on the separability of perceived and received support. Perspectives on Psychological Science 4, 3 (2009), 236--255.","paperID":"None"},{"content":"Yi-Chia Wang , Robert Kraut , John M. Levine, To stay or leave?: the relationship of emotional and informational support to commitment in online health support groups, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145329"},{"content":"Wang, Y.-C., Kraut, R., and Levine, J. M. How to Get Support? A Computer-Aided Content Analysis Approach to Examine Online Social Support Dynamics. (in preparation).","paperID":"None"},{"content":"Wolff, J. K., Schmiedek, F., Brose, A., and Lindenberger, U. Physical and emotional well-being and the balance of needed and received emotional support: Age differences in a daily diary study. Social Science & Medicine 91, (2013), 67--75.","paperID":"None"}],"citation":[{"content":"Diyi Yang , Miaomiao Wen , Iris Howley , Robert Kraut , Carolyn Rose, Exploring the Effect of Confusion in Discussion Forums of Massive Open Online Courses, Proceedings of the Second (2015) ACM Conference on Learning @ Scale, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2724677"},{"content":"Jina Huh, Clinical Questions in Online Health Communities: The Case of \"See your doctor\" Threads, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675259"}],"abstract":"Research suggests that online health support benefits chronically ill users. Their satisfaction might be an indicator that they perceive group interactions as beneficial and a precursor to group commitment. We examined whether receiving emotional and informational support is satisfying in its own right, or whether satisfaction depends on matches between what users sought and what they received. Two studies collected judgments in a breast cancer support community of support users sought, support they received, and their expressed satisfaction. While receiving emotional or informational support in general positively predicted satisfaction, users expressed less satisfaction when they sought informational support but received emotional support. There was also a tendency for users to express more satisfaction when they sought and received informational support. On the other hand, users were equally satisfied with emotional and informational support after seeking emotional support. Implications for membership commitment and interventions in online support groups are discussed.","video":"http://www.youtube.com/embed/xTAhQBFe17s?rel=0","title":"Support matching and satisfaction in an online breast cancer support community","filename":"CHI14/p1625","authors":["Tatiana A. Vlahovic","Yi-Chia Wang","Robert E. Kraut","John M. Levine"],"conference":"CHI '14"}