{"paperId":2557026,"citation":[{"content":"Janet C. Read , Gavin Sim, Taking the Biscuit: Playful Interaction, Proceedings of the 28th International BCS Human Computer Interaction Conference on HCI 2014 - Sand, Sea and Sky - Holiday HCI, September 09-12, 2014, Southport, UK","paperID":"2742997"},{"content":"Rohit Ashok Khot , Ryan Pennings , Florian 'Floyd' Mueller, EdiPulse: Turning Physical Activity Into Chocolates, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2725436"},{"content":"Niels Henze , Thomas Olsson , Stefan Schneegass , Alireza Sahami Shirazi , Kaisa Väänänen-Vainio-Mattila, Augmenting food with information, Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia, November 30-December 02, 2015, Linz, Austria","paperID":"2836068"},{"content":"Rohit Ashok Khot , Jeewon Lee , Deepti Aggarwal , Larissa Hjorth , Florian 'Floyd' Mueller, TastyBeats: Designing Palatable Representations of Physical Activity, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702197"}],"reference":[{"content":"http://www.evilmadscientist.com/2007/finally-cnc-toast/"},{"content":"Acar, A. and Kimura, N. Twitter as a Tool for Language Learning: The Case of Japanese Learners of English. In Special Issue of International Journal of the Computer, the Internet and Management, vol. 19, no. SP2, pp. 1--14, 2012.","paperID":"None"},{"content":"Anne Archambault , Jonathan Grudin, A longitudinal study of facebook, linkedin, & twitter use, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208671"},{"content":"Pollie Barden , Rob Comber , David Green , Daniel Jackson , Cassim Ladha , Tom Bartindale , Nick Bryan-Kinns , Tony Stockman , Patrick Olivier, Telematic dinner party: designing for togetherness through play and performance, Proceedings of the Designing Interactive Systems Conference, June 11-15, 2012, Newcastle Upon Tyne, United Kingdom","paperID":"2317964"},{"content":"Barthes, R. Psycho sociology of Contemporary Food Consumption. From Food and Culture: A Reader. New York: Routledge, pp. 20--27, 1997.","paperID":"None"},{"content":"Katja Battarbee, Defining co-experience, Proceedings of the 2003 international conference on Designing pleasurable products and interfaces, June 23-26, 2003, Pittsburgh, PA, USA","paperID":"782923"},{"content":"Agathe Battestini , Vidya Setlur , Timothy Sohn, A large scale study of text-messaging use, Proceedings of the 12th international conference on Human computer interaction with mobile devices and services, September 07-10, 2010, Lisbon, Portugal","paperID":"1851638"},{"content":"Bell, G. and Kaye, J. Designing technology for domestic spaces: A kitchen manifesto. Gastronomica: The Journal of Food and Culture, 2(2): pp. 46--62, 2002.","paperID":"None"},{"content":"Scott Brave , Hiroshi Ishii , Andrew Dahley, Tangible interfaces for remote collaboration and communication, Proceedings of the 1998 ACM conference on Computer supported cooperative work, p.169-178, November 14-18, 1998, Seattle, Washington, USA","paperID":"289491"},{"content":"Corr, R. Reciprocity, Communion, and Sacrifice: Food in Andean Ritual and Social Life. Food and Foodways, vol. 10, no. 1--2, pp. 1--25, Jan. 2002.","paperID":"None"},{"content":"Cramer, J. M., Walters, L. M., and Greene, C. P. Food as communication/Communication as food. Peter Lang Publishing, p. 465, 2011.","paperID":"None"},{"content":"Farb, P.and Armelagos, G. Consuming passions: The anthropology of eating. Boston: Houghton Mifflin, 1980.","paperID":"None"},{"content":"Fukuda, S., Ed. Emotional Engineering: Service Development, 1 ed. Springer, 2010.","paperID":"None"},{"content":"Andrea Grimes , Richard Harper, Celebratory technology: new directions for food research in HCI, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357130"},{"content":"Rebecca Grinter , Margery Eldridge, Wan2tlk?: everyday text messaging, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642688"},{"content":"Richard Harper, Texture: Human Expression in the Age of Communications Overload, The MIT Press, 2010","paperID":"1941863"},{"content":"Harper, R. and Hodges, S. Beyond talk, beyond sound: Emotional expression and the future of mobile connectivity. In Mobile Communication in Everyday Life: An Ethnographic View, Frank & Timme, 2006.","paperID":"None"},{"content":"Irwin, M. Caramel-Pumping 3D Fabricator Has Couple on a Sugar High. Wired Magazine. July 24, 2007.","paperID":"None"},{"content":"Kring, A. M. and Gordon, A. H. Sex differences in emotion: Expression, experience, and physiology. Journal of Personality and Social Psychology, vol. 74 (3), pp. 686703, March 1998.","paperID":"None"},{"content":"Jonathan Lazar , Jinjuan Heidi Feng , Harry Hochheiser, Research Methods in Human-Computer Interaction, Wiley Publishing, 2010","paperID":"1841406"},{"content":"Locher, J. L., Yoels, W. C., Maurer, D., and Ells, J. van. Comfort Foods: An Exploratory Journey into the Social and Emotional Significance of Food. Food and Foodways, vol. 13, no. 4, pp. 273--297, Oct. 2005.","paperID":"None"},{"content":"Lupton, D. Theoretical Perspectives on Food and Eating. In Food, the Body and the Self, pp. 6--37. SAGE Pub, 1998.","paperID":"None"},{"content":"Dafei Ma , Fumiko Ichikawa , Ying Liu , Li Jiang, Use of Chinese short messages, Proceedings of the 2007 conference on Human interface: Part II, July 22-27, 2007, Beijing, China","paperID":"1766658"},{"content":"Malone, E. and Lipson, H. Fab@Home: The Personal Desktop Fabricator Kit. Rapid Prototyping Journal, pp. 245--255, 2007.","paperID":"None"},{"content":"McLuhan, M. Understanding Media The extensions of man. Routledge & Kegan Paul.1964.","paperID":"None"},{"content":"Bonnie A. Nardi , Steve Whittaker , Erin Bradner, Interaction and outeraction: instant messaging in action, Proceedings of the 2000 ACM conference on Computer supported cooperative work, p.79-88, December 2000, Philadelphia, Pennsylvania, USA","paperID":"358975"},{"content":"Mamoun Nawahdah , Tomoo Inoue, Virtually dining together in time-shifted environment: KIZUNA design, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441863"},{"content":"Periard, D., Schaal, N., Schaal, M., Malone, E., and Lipson, H. Printing Food. In Proc. of SSF '07, pp.564--574, 2007.","paperID":"None"},{"content":"Mark Perry , Dorothy Rachovides, Entertaining Situated Messaging at Home, Computer Supported Cooperative Work, v.16 n.1-2, p.99-128, April     2007","paperID":"1265270"},{"content":"Oleksiy Pikalo, Latte art machine, ACM SIGGRAPH 2008 new tech demos, p.1-1, August 11-15, 2008, Los Angeles, California","paperID":"1401637"},{"content":"Pietro Polotti , Stefano Delle Monache , Stefano Papetti , Davide Rocchesso, Gamelunch: forging a dining experience through sound, CHI '08 Extended Abstracts on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1358670"},{"content":"Wolfinbarger, M. F. and Gilly, M. C. The Relationship of Gender to Gift-Giving Attitudes. Gender and Consumer Behavor, vol. 1, pp. 223--233, 1991.","paperID":"None"},{"content":"Zoran, A and Coelho, M. Cornucopia: The Concept of Digital Gastronomy. Leonardo, vol. 44, no. 5, pp. 425--431, Oct. 2011.","paperID":"None"}],"abstract":"Food is more than just a means of survival; it is also a form of communication. In this paper, we investigate the potential of food as a social message carrier (a.k.a., food messaging). To investigate how people accept, use, and perceive food messaging, we conducted exploratory interviews, a field study, and follow-up interviews over four weeks in a large information technology (IT) company. We collected 904 messages sent by 343 users. Our results suggest strong acceptance of food messaging as an alternative message channel. Further analysis implies that food messaging embodies characteristics of both text messaging and gifting. It is preferred in close relationships for its evocation of positive emotions. As the first field study on edible social messaging, our empirical findings provide valuable insights into the uniqueness of food as a message carrier and its capabilities to promote greater social bonding.","video":"http://www.youtube.com/embed/2aqfFgoFPjQ?rel=0","title":"Food messaging: using edible medium for social messaging","filename":"CHI14/p2873","authors":["Jun Wei","Xiaojuan Ma","Shengdong Zhao"],"conference":"CHI '14"}