{"paperId":2557000,"reference":[{"content":"Berkhout, A. A holographic approach to acoustic control. Journal of the Audio Engineering Society 36, 12 (1988), 977--995.","paperID":"None"},{"content":"Blauert, J. Spatial Hearing: The Psychophysics of Human Sound Localization, revised ed. MIT Press, 1996.","paperID":"None"},{"content":"Stephen Brewster , Joanna Lumsden , Marek Bell , Malcolm Hall , Stuart Tasker, Multimodal 'eyes-free' interaction techniques for wearable devices, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642694"},{"content":"Brungart, D. S., and Rabinowitz, W. M. Auditory localization of nearby sources. Head-related transfer functions. Journal of the Acoustical Socienty of America 106, 3 (1999), 1465--1479.","paperID":"None"},{"content":"Daniel, J. Spatial sound encoding including near field effect: Introducing distance coding filters and a viable, new Ambisonic format. In 23rd International Conference of the Audio Engineering Society (2003).","paperID":"None"},{"content":"de Vries, D. Wave Field Synthesis. AES Monograph. Audio Engineering Society, 2009.","paperID":"None"},{"content":"Fohl, W., and Nogalski, M. A gesture control interface for a Wave Field Synthesis system. In International Conference on New Interfaces for Musical Expression (2013).","paperID":"None"},{"content":"Geier, M., and Spors, S. Spatial audio reproduction with the SoundScape Renderer. In 27th Tonmeistertagung - VDT International Convention (2012).","paperID":"None"},{"content":"Edwin L. Hutchins , James D. Hollan , Donald A. Norman, Direct manipulation interfaces, Human-Computer Interaction, v.1 n.4, p.311-338, December 1985","paperID":"1453235"},{"content":"Hiroshi Ishii , Ali Mazalek , Jay Lee, Bottles as a minimal interface to access digital information, CHI '01 Extended Abstracts on Human Factors in Computing Systems, March 31-April 05, 2001, Seattle, Washington","paperID":"634180"},{"content":"Hiroshi Ishii , Brygg Ullmer, Tangible bits: towards seamless interfaces between people, bits and atoms, Proceedings of the ACM SIGCHI Conference on Human factors in computing systems, p.234-241, March 22-27, 1997, Atlanta, Georgia, USA","paperID":"258715"},{"content":"Jackson, C. V. Visual factors in auditory localization. Quarterly Journal of Experimental Psychology 5, 2 (1953), 52--65.","paperID":"None"},{"content":"Leslie, G., Zamborlin, B., Jodlowski, P., and Schnell, N. Grainstick: A collaborative, interactive sound installation. In International Computer Music Conference (2010).","paperID":"None"},{"content":"Frank Melchior , Tobias Laubach , Diemer de Vries, Authoring and User Interaction for the Production of Wave Field Synthesis Content in an Augmented Reality System, Proceedings of the 4th IEEE/ACM International Symposium on Mixed and Augmented Reality, p.48-51, October 05-08, 2005","paperID":"1105183"},{"content":"Melchior, F., Sladeczek, C., de Vries, D., and Fröhlich, B. User-dependent optimization of Wave Field Synthesis reproduction for directive sound fields. In 124th Convention of the Audio Engineering Society (2008).","paperID":"None"},{"content":"Elizabeth D. Mynatt , Maribeth Back , Roy Want , Michael Baer , Jason B. Ellis, Designing audio aura, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.566-573, April 18-23, 1998, Los Angeles, California, USA","paperID":"274720"},{"content":"Pick, H. L., Warren, D. H., and Hay, J. C. Sensory conflict in judgments of spatial direction. Perception & Psychophysics 6, 4 (1969), 203--205.","paperID":"None"},{"content":"Shneiderman, B. The future of interactive systems and the emergence of direct manipulation. Behaviour & Information Technology 1, 3 (1982), 237--256.","paperID":"None"},{"content":"Spors, S. Extension of an analytic secondary source selection criterion for Wave Field Synthesis. In 123rd Convention of the Audio Engineering Society (2007).","paperID":"None"},{"content":"Spors, S., Wierstorf, H., Raake, A., Melchior, F., Frank, M., and Zotter, F. Spatial sound with loudspeakers and its perception: A review of the current state. IEEE Proceedings 101, 9 (2013), 1920--1938.","paperID":"None"},{"content":"Jan P. Springer , Christoph Sladeczek , Martin Scheffler , Jan Hochstrate , Frank Melchior , Bernd Frohlich, Combining Wave Field Synthesis and Multi-Viewer Stereo Displays, Proceedings of the IEEE conference on Virtual Reality, p.237-240, March 25-29, 2006","paperID":"1130440"},{"content":"Völk, F., Mühlbauer, U., and Fastl, H. Minimum audible distance (MAD) by the example of Wave Field Synthesis. In German Annual Conference on Acoustics (DAGA) (2012).","paperID":"None"},{"content":"Wierstorf, H., Raake, A., Geier, M., and Spors, S. Perception of focused sources in Wave Field Synthesis. Journal of the Audio Engineering Society 61, 1/2 (2013), 5--16.","paperID":"None"},{"content":"Yost, W. A., Dye, R. H., and Sheft, S. A simulated cocktail party with up to three sound sources. Perception & Psychophysics 58 (1996), 1026--1036.","paperID":"None"},{"content":"Zotter, F., and Spors, S. Is sound field control determined at all frequencies? How is it related to numerical acoustics? In 52nd Conference of the Audio Engineering Society (2013).","paperID":"None"}],"citation":[{"content":"Steven Gelineck , Dan Overholt, Haptic and Visual feedback in 3D Audio Mixing Interfaces, Proceedings of the Audio Mostly 2015 on Interaction With Sound, p.1-6, October 07-09, 2015, Thessaloniki, Greece","paperID":"2814918"},{"content":"Mark McGill , John Williamson , Stephen A. Brewster, It Takes Two (To Co-View): Collaborative Multi-View TV, Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video, June 03-05, 2015, Brussels, Belgium","paperID":"2745199"},{"content":"Vanessa Vuibert , Wolfgang Stuerzlinger , Jeremy R. Cooperstock, Evaluation of Docking Task Performance Using Mid-air Interaction Techniques, Proceedings of the 3rd ACM Symposium on Spatial User Interaction, August 08-09, 2015, Los Angeles, California, USA","paperID":"2788950"},{"content":"Christina Dicke , Jörg Müller, Evaluating Mid-air List Interaction for Spatial Audio Interfaces, Proceedings of the 3rd ACM Symposium on Spatial User Interaction, August 08-09, 2015, Los Angeles, California, USA","paperID":"2788945"},{"content":"Francesco Grani , Dan Overholt , Cumhur Erkut , Steven Gelineck , Georgios Triantafyllidis , Rolf Nordahl , Stefania Serafin, Spatial Sound and Multimodal Interaction in Immersive Environments, Proceedings of the Audio Mostly 2015 on Interaction With Sound, p.1-5, October 07-09, 2015, Thessaloniki, Greece","paperID":"2814919"}],"abstract":"In this paper we present a system that allows to \"touch\", grab and manipulate sounds in mid-air. Further, arbitrary objects can seem to emit sound. We use spatial sound reproduction for sound rendering and computer vision for tracking. Using our approach, sounds can be heard from anywhere in the room and always appear to originate from the same (possibly moving) position, regardless of the listener's position. We demonstrate that direct \"touch\" interaction with sound is an interesting alternative to indirect interaction mediated through controllers or visual interfaces. We show that sound localization is surprisingly accurate (11.5 cm), even in the presence of distractors. We propose to leverage the ventriloquist effect to further increase localization accuracy. Finally, we demonstrate how affordances of real objects can create synergies of auditory and visual feedback. As an application of the system, we built a spatial music mixing room.","video":"http://www.youtube.com/embed/AIZwMX6-xdQ?rel=0","title":"The boomRoom: mid-air direct interaction with virtual sound sources","filename":"CHI14/p247","authors":["Jörg Müller","Matthias Geier","Christina Dicke","Sascha Spors"],"conference":"CHI '14"}