{"paperId":2557329,"citation":[],"reference":[{"content":"Anderson, F., Annett, M., and Bischof, W.F. Lean on Wii: Physical Rehabilitation With Virtual Reality Wii Peripherals. Studies in health technology and informatics 154, (2010), 229--34.","paperID":"None"},{"content":"J. W. Burke , M. D. J. McNeill , D. K. Charles , P. J. Morrow , J. H. Crosbie , S. M. McDonough, Optimising engagement for stroke rehabilitation using serious games, The Visual Computer: International Journal of Computer Graphics, v.25 n.12, p.1085-1099, October 2009","paperID":"1667556"},{"content":"Crook, P., Rose, M., Salmon, P., Stott, R., Peters, S., and Stanley, I. Adherence to Group Exercise: Physiotherapist-led Experimental Programmes. Physiotherapy 84, 8 (1998), 366--372.","paperID":"None"},{"content":"Dishman, R.K. and Ickes, W. Self-motivation and Adherence to Therapeutic Exercise. Journal of behavioral medicine 4, 4 (1981), 421--38.","paperID":"None"},{"content":"Eletha Flores , Gabriel Tobon , Ettore Cavallaro , Francesca I. Cavallaro , Joel C. Perry , Thierry Keller, Improving patient motivation in game development for motor deficit rehabilitation, Proceedings of the 2008 International Conference on Advances in Computer Entertainment Technology, December 03-05, 2008, Yokohama, Japan","paperID":"1501839"},{"content":"Johnston, H. and Whitehead, A. Pose Presentation for a Dance-Based Massively Multiplayer Online Exergame. Entertainment Computing 2, 2 (2011), 89--96.","paperID":"None"},{"content":"Kashif Kifayat , Paul Fergus , Simon Cooper , Madjid Merabti, Body Area Networks for Movement Analysis in Physiotherapy Treatments, Proceedings of the 2010 IEEE 24th International Conference on Advanced Information Networking and Applications Workshops, p.866-872, April 20-23, 2010","paperID":"1829715"},{"content":"Lange, B., Flynn, S., and Rizzo, A. Initial Usability Assessment of Off-the-Shelf Video Game Consoles for Clinical Game-Based Motor Rehabilitation. Physical Therapy Reviews 14, 5 (2009), 355--363.","paperID":"None"},{"content":"Soh Masuko , Junichi Hoshino, A fitness game reflecting heart rate, Proceedings of the 2006 ACM SIGCHI international conference on Advances in computer entertainment technology, June 14-16, 2006, Hollywood, California","paperID":"1178886"},{"content":"Mitchell, R. Kinesthetic Visual Matching and the Self Concept as Explanations of Mirror Self Recognition. Journal for the theory of social behaviour 27, 1 (1997), 17--39.","paperID":"None"},{"content":"Negrete, M.A., Matamoros, M., Olveres, J., et al. Nintendo Wii Remote and Nunchuck as a Wireless Data Subsystem for Digital Acquisition of Analog Physiologic Data Relevant to Motor Rehabilitation After Stroke. 2009 Pan American Health Care Exchanges, (2009), 130--131.","paperID":"None"},{"content":"David Pinelle , Nelson Wong , Tadeusz Stach, Heuristic evaluation for games: usability principles for video game design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357282"},{"content":"Skelly, a. H., Marshall, J.R., Haughey, B.P., Davis, P.J., and Dunford, R.G. Self-Efficacy and Confidence in Outcomes as Determinants of SelfCare Practices in Inner-City, African-American Women with Non-Insulin-Dependent Diabetes. The Diabetes Educator 21, 1 (1995), 38--46.","paperID":"None"},{"content":"Sluijs, E.M., Kok, G.J., and Zee, J. Van Der. Correlates of Exercise Compliance in Physical Therapy. Physical Therapy 73, 11 (1993), 771--782.","paperID":"None"},{"content":"Penelope Sweetser , Peta Wyeth, GameFlow: a model for evaluating player enjoyment in games, Computers in Entertainment (CIE), v.3 n.3, July 2005","paperID":"1077253"},{"content":"Taylor, M.J.D., McCormick, D., Shawis, T., Impson, R., and Griffin, M. Activity-promoting Gaming Systems in Exercise and Rehabilitation. The Journal of Rehabilitation Research and Development 48, 10 (2011), 1171.","paperID":"None"},{"content":"Yong Joo, L., Soon Yin, T., Xu, D., et al. A Feasibility Study Using Interactive Commercial Off-the-Shelf Computer Gaming in Upper Limb Rehabilitation in Patients After Stroke. Journal of rehabilitation medicine 42, 5 (2010), 437--41.","paperID":"None"}],"abstract":"Interactive gaming has demonstrated promise as a low-cost, at-home training and fitness instruction alternative. Gaming systems offer convenience and the ability to provide enhanced reporting and progress data if body measurement information is collected effectively. However, commercially available systems today are designed primarily for entertainment and as a result, the quality of instruction delivery and level of involvement may not meet the needs of a user performing a disciplined activity.This paper will look at adapting for occlusion and lack of visibility; learning and orientation; and providing feedback in an effort to determine if there is an ideal visual demonstration delivery that maximizes pose understanding and user self-efficacy, determine whether supplementary modalities are important for instruction, and determine if there is an ideal feedback delivery that promotes pose comprehension, confidence and motivation. This information can provide a guideline for designing clear and supportive, interactive training systems that can engage users, prevent injury and help maintain fitness.","video":"http://www.youtube.com/embed/LwmdgUzp5T8?rel=0","title":"Establishing design guidelines in interactive exercise gaming: preliminary data from two posing studies","filename":"CHI14/p1875","authors":["Monica Zaczynski","Anthony D. Whitehead"],"conference":"CHI '14"}