{"paperId":2557214,"citation":[{"content":"Dongho Choi , Ziad Matni , Chirag Shah, Switching sources: a study of people's exploratory search behavior on social media and the web, Proceedings of the 78th ASIS&T Annual Meeting: Information Science with Impact: Research in and for the Community, p.1-10, November 06-10, 2015, St. Louis, Missouri","paperID":"2857115"},{"content":"Max L. Wilson , Susan Ali , Michel F. Valstar, Finding information about mental health in microblogging platforms: a case study of depression, Proceedings of the 5th Information Interaction in Context Symposium, August 26-30, 2014, Regensburg, Germany","paperID":"2637006"},{"content":"Elena Agapie , Lucas Colusso , Sean A. Munson , Gary Hsieh, PlanSourcing: Generating Behavior Change Plans with Friends and Crowds, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819943"},{"content":"Mrinal Kumar , Mark Dredze , Glen Coppersmith , Munmun De Choudhury, Detecting Changes in Suicide Content Manifested in Social Media Following Celebrity Suicides, Proceedings of the 26th ACM Conference on Hypertext & Social Media, September 01-04, 2015, Guzelyurt, Northern Cyprus","paperID":"2791026"},{"content":"Ryen W. White , Sheng Wang , Apurv Pant , Rave Harpaz , Pushpraj Shukla , Walter Sun , William DuMouchel , Eric Horvitz, Early identification of adverse drug reactions from search log data, Journal of Biomedical Informatics, v.59 n.C, p.42-48, February 2016","paperID":"2903077"},{"content":"Hanan M. Asghar, Measuring Information Seeking through Facebook, Computers in Human Behavior, v.52 n.C, p.259-270, November 2015","paperID":"2822653"}],"reference":[{"content":"Ayers, S.L. and Kronenfeld, J.J. (2007). Chronic illness and health-seeking information on the Internet. Health, 11(3): 327--347.","paperID":"None"},{"content":"Doug Beeferman , Adam Berger, Agglomerative clustering of a search engine query log, Proceedings of the sixth ACM SIGKDD international conference on Knowledge discovery and data mining, p.407-416, August 20-23, 2000, Boston, Massachusetts, USA","paperID":"347176"},{"content":"Berger, M., Wagner, T. and Baker, L. (2005). Internet use and stigmatized illness. Soc. Sci. Med., 61(8).","paperID":"None"},{"content":"Marc-Allen Cartright , Ryen W. White , Eric Horvitz, Intentions and attention in exploratory health search, Proceedings of the 34th international ACM SIGIR conference on Research and development in Information Retrieval, July 24-28, 2011, Beijing, China","paperID":"2009929"},{"content":"Corrigan, P. (2004). How stigma interferes with mental health care. American Psychologist, 59(7): 614.","paperID":"None"},{"content":"Crocker, J. and Major, B. (1989). Social stigma and self-esteem: The self-protective properties of stigma. Psy-chological Review, 96(4): 608--630.","paperID":"None"},{"content":"Munmun De Choudhury , Scott Counts , Eric Horvitz, Predicting postpartum changes in emotion and behavior via social media, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466447"},{"content":"Eysenbach, G. and Köhler, C. (2002). How do consumers search for and appraise health information on the world wide web? BMJ, 324(7337): 573.","paperID":"None"},{"content":"Eysenbach, G., Powell, J., Englesakis, M. et al. (2004). Health related virtual communities and electronic sup-port groups: systematic review of the effects of online peer to peer interactions. BMJ, 328(7449): 1166.","paperID":"None"},{"content":"Fox, S. (2013). Health. Pew Internet. 2013-01.","paperID":"None"},{"content":"1Fox, S. and Jones, S. (2009). The social life of health information. Pew Internet. 2009--12.","paperID":"None"},{"content":"Greene, J.A., Choudhry, N.K., Kilabuk, E. and Shrank, W.H. (2011). Online social networking by patients with diabetes: a qualitative evaluation of communication with Facebook. J. Gen. Int. Med.: 26(3): 287--292.","paperID":"None"},{"content":"Andrea Grimes , Brian M. Landry , Rebecca E. Grinter, Characteristics of shared health reflections in a local community, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718992"},{"content":"Hartzler, A., Skeels, M.M., Mukai, M., Powell, C., Klasn-ja, P. and Pratt, W. (2011). Sharing is caring, but not er-ror free: transparency of granular controls for sharing personal health information in social networks. Proc. AMIA, 559.","paperID":"None"},{"content":"Hawn, C. (2009). Take two aspirin and tweet me in the morning: how Twitter, Facebook, and other social me-dia are reshaping health care. Health Affairs, 28(2).","paperID":"None"},{"content":"Jeong, J-W., Morris, M.R., Teevan, J. and Liebling, D. (2013). A crowd-powered socially embedded search en-gine. Proc. ICWSM, in press.","paperID":"None"},{"content":"Grace J. Johnson , Paul J. Ambrose, Neo-tribes: the power and potential of online communities in health care, Communications of the ACM, v.49 n.1, p.107-113, January 2006","paperID":"1107463"},{"content":"Carolyn Lauckner , Gary Hsieh, The presentation of health-related search results and its impact on negative emotional outcomes, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470702"},{"content":"Leslie S. Liu , Jina Huh , Tina Neogi , Kori Inkpen , Wanda Pratt, Health vlogger-viewer interaction in chronic illness management, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470663"},{"content":"Major, B. and O'Brien, L.T. (2005). The social psychol-ogy of stigma. Ann. Rev. Psychol., 56: 393--421.","paperID":"None"},{"content":"Meredith Ringel Morris , Jaime Teevan , Katrina Panovich, What do people ask their social networks, and why?: a survey study of status message q&a behavior, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753587"},{"content":"Meredith Ringel Morris , Dan Morris, Understanding the potential for collaborative search technologies in clinical settings, Proceedings of the 3rd international workshop on Collaborative information retrieval, October 28-28, 2011, Glasgow, Scotland, UK","paperID":"2064079"},{"content":"Mark W. Newman , Debra Lauterbach , Sean A. Munson , Paul Resnick , Margaret E. Morris, It's not that i don't have problems, i'm just not putting them on facebook: challenges and opportunities in using online social networks for health, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958876"},{"content":"Oh, H.J., Lauckner, C., Boehmer, J., Fewins-Bliss, R. and Li, K. (2013). Facebooking for health: an examination into the solicitation and effects of health-related social support on social networking sites. Comp. in Human Be-havior, 29(5): 2072--2080.","paperID":"None"},{"content":"Paul, M. and Dredze, M. (2011). You are what you tweet: analyzing Twitter for public health. Proc. ICWSM, 265--272.","paperID":"None"},{"content":"Paul, S.A., Hong, L. and Chi, E.H. (2011). Is Twitter a good place for asking questions? A characterization study. Proc. ICWSM.","paperID":"None"},{"content":"Pew Internet Project, Feb 2012. Online Activities: http://www.pewinternet.org/Static-Pages/Trend-Data-(Adults)/Online-Activities-Daily.aspx","paperID":"None"},{"content":"Pew Internet Project, Aug 2013. Social networking site and Twitter use: http://pewinternet.org/Reports/2013/social-networking-sites/Findings/Twitter.aspx","paperID":"None"},{"content":"Rice, R.E. (2006). Influences, usage, and outcomes of Internet health information searching: multivariate re-sults from the Pew surveys. Int. J Med. Inf., 75(1).","paperID":"None"},{"content":"Rodgers, S. and Chen, Q. (2005). Internet community group participation: Psychosocial benefits for women with breast cancer. J. Comp.-Med. Comm., 10(4).","paperID":"None"},{"content":"3Sillence, E., Briggs, P., Harris, P.R. and Fishwick, L. (2007). How do patients evaluate and make use of online health information? Soc. Sci. Med., 64(9): 1853--1862.","paperID":"None"},{"content":"Meredith M. Skeels , Kenton T. Unruh , Christopher Powell , Wanda Pratt, Catalyzing social support for breast cancer patients, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753353"},{"content":"Ryen W. White , Eric Horvitz, Cyberchondria: Studies of the escalation of medical concerns in Web search, ACM Transactions on Information Systems (TOIS), v.27 n.4, p.1-37, November 2009","paperID":"1629101"},{"content":"Wicks, P., Massagli, M., Frost, J., Brownstein, C., Okun, S., Vaughan, T., Bradley, R. and Heywood, J. (2010). Sharing health data for better outcomes on Pa-tientsLikeMe. J. Med. Int. Res., 12(2).","paperID":"None"},{"content":"Alyson L. Young , Anabel Quan-Haase, Information revelation and internet privacy concerns on social network sites: a case study of facebook, Proceedings of the fourth international conference on Communities and technologies, June 25-27, 2009, University Park, PA, USA","paperID":"1556499"}],"abstract":"Search engines and social media are two of the most com-monly used online services; in this paper, we examine how users appropriate these platforms for online health activi-ties via both large-scale log analysis and a survey of 210 people. While users often turn to search engines to learn about serious or highly stigmatic conditions, a surprising amount of sensitive health information is also sought and shared via social media, in our case the public social plat-form Twitter. We contrast what health content people seek via search engines vs. share on social media, as well as why they choose a particular platform for online health activi-ties. We reflect on the implications of our results for design-ing search engines, social media, and social search tools that better support people's health information seeking and sharing needs.","video":"http://www.youtube.com/embed/xhEjf_Y98S8?rel=0","title":"Seeking and sharing health information online: comparing search engines and social media","filename":"CHI14/p1365","authors":["Munmun De Choudhury","Meredith Ringel Morris","Ryen W. White"],"conference":"CHI '14"}