{"paperId":2557378,"citation":[{"content":"Lixiu Yu , Aniket Kittur , Robert E. Kraut, Encouraging “Outside- the- box” Thinking in Crowd Innovation Through Identifying Domains of Expertise, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820025"},{"content":"Lixiu Yu , Robert E. Kraut , Aniket Kittur, Distributed Analogical Idea Generation with Multiple Constraints, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2835201"},{"content":"Lixiu Yu , Aniket Kittur , Robert E. Kraut, Distributed analogical idea generation: inventing with crowds, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557371"},{"content":"Pao Siangliulue , Kenneth C. Arnold , Krzysztof Z. Gajos , Steven P. Dow, Toward Collaborative Ideation at Scale: Leveraging Ideas from Others to Generate More Creative and Diverse Ideas, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675239"},{"content":"Pao Siangliulue , Kenneth C. Arnold , Krzysztof Z. Gajos , Steven P. Dow, Toward Collaborative Ideation at Scale: Leveraging Ideas from Others to Generate More Creative and Diverse Ideas, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675239"}],"reference":[{"content":"Luis von Ahn , Laura Dabbish, Labeling images with a computer game, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.319-326, April 24-29, 2004, Vienna, Austria","paperID":"985733"},{"content":"Baron, R.M. and Kenny, D.A. The moderators' mediator variable distinction in social psychological research: Conceptual, strategic, and statistical considerations. Journal of personality and social psychology 51, 6 (1986), 1173.","paperID":"None"},{"content":"Danushka T. Bollegala , Yutaka Matsuo , Mitsuru Ishizuka, Measuring the similarity between implicit semantic relations from the web, Proceedings of the 18th international conference on World wide web, April 20-24, 2009, Madrid, Spain","paperID":"1526797"},{"content":"Chi, M.T., Feltovich, P.J., and Glaser, R. Categorization and representation of physics problems by experts and novices. Cognitive science 5, 2 (1981), 121--152.","paperID":"None"},{"content":"Lydia B. Chilton , Greg Little , Darren Edge , Daniel S. Weld , James A. Landay, Cascade: crowdsourcing taxonomy creation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466265"},{"content":"Clement, C.A. Effect of structural embedding on analogical transfer: Manifest versus latent analogs. The American journal of psychology, (1994), 1--38.","paperID":"None"},{"content":"Clement, C.A., Mawby, R., and Giles, D.E. The effects of manifest relational similarity on analog retrieval. Journal of Memory and Language 33, 3 (1994), 396--420.","paperID":"None"},{"content":"Dahl, D.W. and Moreau, P. The influence and value of analogical thinking during new product ideation. Journal of Marketing Research, (2002), 47--60.","paperID":"None"},{"content":"Finke, R.A., Ward, T.B., and Smith, S.M. Creative cognition: Theory, research, and applications. MIT press Cambridge, MA, 1992.","paperID":"None"},{"content":"Fisher, R., Statistical methods for research workers. Oliver and Boyd, 1954.","paperID":"None"},{"content":"Fu, K., Chan, J., Cagan, J., Kotovsky, K., Schunn, C., and Wood, K. The Meaning of \"Near\" and \"Far\": The Impact of Structuring Design Databases and the Effect of Distance of Analogy on Design Output. Journal of Mechanical Design 135, (2013), 021007.","paperID":"None"},{"content":"Galton, F. The geometric mean, in vital and social statistics. In Proc RSL 29, (1879), 365--367.","paperID":"None"},{"content":"Gentner, D. Structure-mapping: A theoretical framework for analogy. Cognitive Science 7, (1983), 155--170.","paperID":"None"},{"content":"Gentner, D., S. Brem, R. Ferguson, P. Wolff, A. B. Markaman, K. and Forbus. Analogy and creativity in the works of Johannes Kepler. T. N. Ward, S. M. Smith, J. Vaid, eds. Creative Thought. Amer. Psych. Association, Washington, DC, (1997). 403--460.","paperID":"None"},{"content":"Gentner, D. and Landers, R. Analogical reminding: A good match is hard to find. Proceedings of the international conference on systems, man and cybernetics, (1985), 607--613.","paperID":"None"},{"content":"Gentner, D., Rattermann, M.J., and Forbus, K.D. The roles of similarity in transfer: Separating retrievability from inferential soundness. Cognitive psychology 25, 4 (1993), 524--575.","paperID":"None"},{"content":"Gick, M.L. and Holyoak, K.J. Analogical problem solving. Cognitive psychology 12, 3 (1980), 306--355.","paperID":"None"},{"content":"Gick, M.L. and Holyoak, K.J. Schema induction and analogical transfer. Cognitive psychology 15, (1983), 1--38.","paperID":"None"},{"content":"Halford, G. S., Baker, R., McCredden, J. E and Bain, J. D. How many variables can humans process' Psychological Science 16(1), 2005, 70--76.","paperID":"None"},{"content":"Hirtz, J., Stone, R.B., McAdams, D.A., Szykman, S., and Wood, K.L. A functional basis for engineering design: reconciling and evolving previous efforts. Research in engineering Design 13, 2 (2002), 65--82.","paperID":"None"},{"content":"Holyoak, K.J. and Koh, K. Surface and structural similarity in analogical transfer. Memory & Cognition 15, 4 (1987), 332--340.","paperID":"None"},{"content":"Keith J. Holyoak , Paul Thagard, Mental leaps: analogy in creative thought, MIT Press, Cambridge, MA, 1995","paperID":"200757"},{"content":"Hummel, J.E. and Holyoak, K.J. Distributed representations of structure: A theory of analogical access and mapping. Psychological Review 104, 3 (1997), 427.","paperID":"None"},{"content":"Keane, M. On retrieving analogues when solving problems. The Quarterly Journal of Experimental Psychology 39(1), 1987, 29--41.","paperID":"None"},{"content":"Aniket Kittur , Ed H. Chi , Bongwon Suh, Crowdsourcing user studies with Mechanical Turk, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357127"},{"content":"Ranjitha Kumar , Arvind Satyanarayan , Cesar Torres , Maxine Lim , Salman Ahmad , Scott R. Klemmer , Jerry O. Talton, Webzeitgeist: design mining the web, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466420"},{"content":"Lakhani, K.R. and Panetta, J.A. The principles of distributed innovation. Innovations 2, 3 (2007), 97--112.","paperID":"None"},{"content":"Linsey, J., Laux, J., Clauss, E., Wood, K.L., and Markman, A. Increasing innovation: A trilogy of experiments towards a design-by-analogy method. Proceedings of the ASME 2007 International Design Engineering Technical Conferences & Computers and Information in Engineering Conference, (2007).","paperID":"None"},{"content":"Linsey, J., Wood, K.L., and Markman, A.B. Increasing innovation: presentation and evaluation of the wordtree design-by-analogy method. Proceedings of the ASME IDETC Design Theory and Methodology Conference, (2008).","paperID":"None"},{"content":"Ekaterina Shutova, Models of metaphor in NLP, Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics, p.688-697, July 11-16, 2010, Uppsala, Sweden","paperID":"1858752"},{"content":"Sternberg, R.J. Handbook of creativity. Cambridge University Press, 1998.","paperID":"None"},{"content":"Paul Thagard , Keith J. Holyoak , Greg Nelson , David Gochfeld, Analog retrieval by constraint satisfaction, Artificial Intelligence, v.46 n.3, p.259-310, Dec. 1990","paperID":"101967"},{"content":"The New York Times, http://www.nytimes.com/2013/11/14/health/new-toolto-ease-difficult-births-a-plastic bag.html","paperID":"None"},{"content":"Peter D. Turney, Similarity of Semantic Relations, Computational Linguistics, v.32 n.3, p.379-416, September 2006","paperID":"1174523"},{"content":"Lixiu Yu , Aniket Kittur , Robert E. Kraut, Distributed analogical idea generation: inventing with crowds, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557371"},{"content":"Lixiu Yu , Jeffrey V. Nickerson, Cooks or cobblers?: crowd creativity through combination, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979147"}],"abstract":"Seeking solutions from one domain to solve problems in another is an effective process of innovation. This process of analogy searching is difficult for both humans and machines. In this paper, we present a novel approach for re-presenting a problem in terms of its abstract structure, and then allowing people to use this structural representation to find analogies. We propose a crowdsourcing process that helps people navigate a large dataset to find analogies. Through two experiments, we show the benefits of using abstract structural representations to search for ideas that are analogous to a source problem, and that these analogies result in better solutions than alternative approaches. This work provides a useful method for finding analogies, and can streamline innovation for both novices and professional designers.","video":"http://www.youtube.com/embed/ldu7_IoRaJ0?rel=0","title":"Searching for analogical ideas with crowds","filename":"CHI14/p1225","authors":["Lixiu Yu","Aniket Kittur","Robert E. Kraut"],"conference":"CHI '14"}