{"paperId":2557057,"citation":[{"content":"Yuhao Wu , Jia Jia , WaiKim Leung , Yejun Liu , Lianhong Cai, MPHA: A Personal Hearing Doctor Based on Mobile Devices, Proceedings of the 2015 ACM on International Conference on Multimodal Interaction, November 09-13, 2015, Seattle, Washington, USA","paperID":"2820753"}],"reference":[{"content":"Andrist, S., Mutlu, B., and Gleicher, M. Conversational gaze aversion for virtual agents. In Proc. IVA (2013), 249--262.","paperID":"None"},{"content":"Bangor, A., Kortum, P. T., and Miller, J. T. An empirical evaluation of the system usability scale. Intl. Journal of Human-Computer Interaction 24, 6 (2008), 574--594.","paperID":"None"},{"content":"Berelson, B. Content analysis in communication research.","paperID":"None"},{"content":"Brandstätter, V., Lengfelder, A., and Gollwitzer, P. Implementation intentions and efficient action initiation. Journal of personality and social psychology 81, 5 (2001), 946--960.","paperID":"None"},{"content":"Clark, H. Using language. Cambridge U, 1996.","paperID":"None"},{"content":"Clark, H. H. Arenas of language use. U Chicago, 1992.","paperID":"None"},{"content":"Datta, C., Jayawardena, C., Kuo, I. H., and MacDonald, B. A. Robostudio: A visual programming environment for rapid authoring and customization of complex services on a personal service robot. In Proc. IROS (2012), 2352--2357.","paperID":"None"},{"content":"Fong, T., Thorpe, C., and Baur, C. Collaboration, dialogue, human-robot interaction. 255--266.","paperID":"None"},{"content":"Susan R. Fussell , Sara Kiesler , Leslie D. Setlock , Victoria Yew, How people anthropomorphize robots, Proceedings of the 3rd ACM/IEEE international conference on Human robot interaction, March 12-15, 2008, Amsterdam, The Netherlands","paperID":"1349842"},{"content":"Glas, D. F., Satake, S., Kanda, T., and Hagita, N. An interaction design framework for social robots. In Proc. RSS (2012).","paperID":"None"},{"content":"Goffman, E. The interaction order. American Sociological Review 48, 1 (1983), 1--17.","paperID":"None"},{"content":"Hsiao, K.-Y., Mavridis, N., and Roy, D. Coupling perception and simulation: steps towards conversational robotics. In Proc. IROS (2003), 928--933.","paperID":"None"},{"content":"Chien-Ming Huang , Bilge Mutlu, Robot behavior toolkit: generating effective social behaviors for robots, Proceedings of the seventh annual ACM/IEEE international conference on Human-Robot Interaction, March 05-08, 2012, Boston, Massachusetts, USA","paperID":"2157694"},{"content":"Curtis M. Humphrey , Christopher Henk , George Sewell , Brian W. Williams , Julie A. Adams, Assessing the scalability of a multiple robot interface, Proceedings of the ACM/IEEE international conference on Human-robot interaction, March 10-12, 2007, Arlington, Virginia, USA","paperID":"1228749"},{"content":"Peter H. Kahn , Nathan G. Freier , Takayuki Kanda , Hiroshi Ishiguro , Jolina H. Ruckert , Rachel L. Severson , Shaun K. Kane, Design patterns for sociality in human-robot interaction, Proceedings of the 3rd ACM/IEEE international conference on Human robot interaction, March 12-15, 2008, Amsterdam, The Netherlands","paperID":"1349836"},{"content":"Tijn Kooijmans , Takayuki Kanda , Christoph Bartneck , Hiroshi Ishiguro , Norihiro Hagita, Interaction debugging: an integral approach to analyze human-robot interaction, Proceedings of the 1st ACM SIGCHI/SIGART conference on Human-robot interaction, March 02-03, 2006, Salt Lake City, Utah, USA","paperID":"1121254"},{"content":"Langellier, K. M. Personal narratives: Perspectives on theory and research. Text and Performance Quarterly 9, 4 (1989), 243--276.","paperID":"None"},{"content":"Lohse, M., Siepmann, F., and Wachsmuth, S. A modeling framework for user-driven iterative design of autonomous systems. International Journal of Social Robotics (2013), 1--19.","paperID":"None"},{"content":"Matarazzo, J., and Wiens, A. Interview: Research on Its Anatomy and Structure. Aldine De Gruyter, 2007.","paperID":"None"},{"content":"Mutlu, B., Forlizzi, J., and Hodgins, J. A storytelling robot: Modeling and evaluation of human-like gaze behavior. In Proc. HUMANOIDS (2006), 518--523.","paperID":"None"},{"content":"O'Leary, M. J., and Gallois, C. The last ten turns: Behavior and sequencing in friends' and strangers' conversational findings. Journal of Nonverbal Behavior 9 (1985), 8--27.","paperID":"None"},{"content":"Peltason, J., and Wrede, B. Modeling human-robot interaction based on generic interaction patterns. AAAI Symposium on Dialog with Robots (2010).","paperID":"None"},{"content":"Ken Perlin, Improving noise, ACM Transactions on Graphics (TOG), v.21 n.3, July 2002","paperID":"566636"},{"content":"Quigley, M., Conley, K., Gerkey, B., Faust, J., Foote, T., Leibs, J., Wheeler, R., and Ng, A. Ros: an open-source robot operating system. In ICRA Workshop on Open Source Software (2009).","paperID":"None"},{"content":"Sacks, H., Schegloff, E. A., and Jefferson, G. A simplest systematics for the organization of turn-taking for conversation. Language 50, 4 (1974), 696--735.","paperID":"None"},{"content":"Schegloff, E. The first five seconds: The order of conversational opening. PhD thesis, University of California, 1967.","paperID":"None"},{"content":"Schegloff, E. A. Sequencing in conversational openings. American Anthropologist 70, 6 (1968), 1075--1095.","paperID":"None"},{"content":"Skehan, P. A framework for the implementation of task-based instruction. Applied Linguistics 17, 1 (1996), 38--62.","paperID":"None"},{"content":"Tannen, D. Talking voices: Repetition, dialogue, and imagery in conversational discourse, vol. 6. Cambridge U, 1989.","paperID":"None"}],"abstract":"Robotic products are envisioned to offer rich interactions in a range of environments. While their specific roles will vary across applications, these products will draw on fundamental building blocks of interaction, such as greeting people, narrating information, providing instructions, and asking and answering questions. In this paper, we explore how such building blocks might serve as interaction design patterns that enable design exploration and prototyping for human-robot interaction. To construct a pattern library, we observed human interactions across different scenarios and identified seven patterns, such as question-answer pairs. We then designed and implemented Interaction Blocks, a visual authoring environment that enabled prototyping of robot interactions using these patterns. Design sessions with designers and developers demonstrated the promise of using a pattern language for designing robot interactions, confirmed the usability of our authoring environment, and provided insights into future research on tools for human-robot interaction design.","video":"http://www.youtube.com/embed/qjw2bCQD6kI?rel=0","title":"Design patterns for exploring and prototyping human-robot interactions","filename":"CHI14/p1439","authors":["Allison Sauppé","Bilge Mutlu"],"conference":"CHI '14"}