{"paperId":2557050,"citation":[{"content":"Jinyi Wang , Mudassar Ahmad Mughal , Oskar Juhlin, Experiencing Liveness of a Cherished Place in the Home, Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video, June 03-05, 2015, Brussels, Belgium","paperID":"2745198"}],"reference":[{"content":"Bonardi, A. and Rousseaux, F. Composing an Interactive Virtual Opera: The Virtualis Project. Leonardo 35, 3 (2002), 315--318.","paperID":"None"},{"content":"Celletti, R. and Fuller, F. A history of bel canto. Clarendon press, 1991.","paperID":"None"},{"content":"Diday, P. and Pétrequin, D. J. P. É. Mémoire sur une nouvelle espèce de voix chantée. Félix Malteste et Cie, 1840.","paperID":"None"},{"content":"Eimert, H. and Humpert, H. U. Das Lexikon der elektronischen Musik. G. Bosse, 1977.","paperID":"None"},{"content":"Elblaus, L., Hansen, K. F., and Unander-Scharin, C. Exploring the Design Space: Prototyping \"The Throat v3\" for The Elephant Man Opera (2011). Proceedings of the Sound and Music Computing Conference, Padova University Press (2011), 141--147.","paperID":"None"},{"content":"Elblaus, L., Hansen, K.F., and Unander-Scharin, C. Artistically directed prototyping in development and in practice. Journal of New Music Research 41, 4 (2012), 377--387.","paperID":"None"},{"content":"Ylva Fernaeus , Petra Sundström, The material move how materials matter in interaction design research, Proceedings of the Designing Interactive Systems Conference, June 11-15, 2012, Newcastle Upon Tyne, United Kingdom","paperID":"2318029"},{"content":"Frayling, C. Research in art and design. Royal College of Art London, 1993.","paperID":"None"},{"content":"Lars Hallnäs , Johan Redström, Slow Technology – Designing for Reflection, Personal and Ubiquitous Computing, v.5 n.3, p.201-212, August 2001","paperID":"593604"},{"content":"Kristina Höök , Jonas Löwgren, Strong concepts: Intermediate-level knowledge in interaction design research, ACM Transactions on Computer-Human Interaction (TOCHI), v.19 n.3, p.1-18, October 2012","paperID":"2362371"},{"content":"Jessop, E., Torpey, P.A., and Bloomberg, B. Music and Technology in Death and the Powers. New Interfaces for Musical Expression, (2011), 349--354.","paperID":"None"},{"content":"Kloiber, R., Konold, W., and Maschka, R. Handbuch der Oper. Deutscher Taschenbuch Verlag, 2002.","paperID":"None"},{"content":"Krefeld, V. and Waisvisz, M. The hand in the web: An interview with Michel Waisvisz. Computer music journal 14, 2 (1990), 28--33.","paperID":"None"},{"content":"Littlejohn, D. The ultimate art: essays around and about opera. Univ of California Press, 1992.","paperID":"None"},{"content":"John McCarthy , Peter Wright, Technology as Experience, The MIT Press, 2004","paperID":"1044942"},{"content":"McGinnis, P.Y. The Opera Singer's Career Guide: Understanding the European Fach System. Scarecrow Press, 2010.","paperID":"None"},{"content":"Norman, S. J., Waisvisz, M., and Joel, R. Touchstone. Catalogue to the first STEIM Touch-Exhibition (1998).","paperID":"None"},{"content":"Paradiso, J. A. The brain opera technology: New instruments and gestural sensors for musical interaction and performance. Journal of New Music Research 28, 2 (1999), 130--149.","paperID":"None"},{"content":"Park, Y., Heo, H., and Lee, K. VOICON: An Interactive Gestural Microphone For Vocal Performance, Proceedings of the 2012 Conference on New Interfaces for Musical Expression, Univ. of Michigan (2012)","paperID":"None"},{"content":"Ramstrum, M. and Lemouton, S. Realtime Performance Strategies for the Electronic Opera K... Proceedings of the... International Computer Music Conference, International Computer Music Association (2003), 139.","paperID":"None"},{"content":"Redström, J. Designing everyday computational things. rapport nr.: Gothenburg studies in Informatics, 20 (2001).","paperID":"None"},{"content":"Rosselli, J. Singers of Italian opera: the history of a profession. Cambridge University Press, 1995.","paperID":"None"},{"content":"Sadie, S. E. The new Grove dictionary of music and musicians. Macmillan, London, 1980.","paperID":"None"},{"content":"Sandgren, M. Becoming and being an opera singer: Health, personality and skills. Stockholm Univ. 2005.","paperID":"None"},{"content":"Schaeffer, P. Traité des objets musicaux: essai interdisciplines. Éditions du seuil, 1977.","paperID":"None"},{"content":"Schön, D. A. Designing as reflective conversation with the materials of a design situation. Knowledge-Based Systems 5, 1 (1992), 3--14.","paperID":"None"},{"content":"Sengers, P. Autobiographical design. CHI 2006 Workshop on Theory and Method for Experience-Centred Design, (2006).","paperID":"None"},{"content":"Stark, J. Bel canto: a history of vocal pedagogy. University of Toronto Press, 2003.","paperID":"None"},{"content":"Tanaka, A. Musical Performance Practice on Sensor-based Instruments. Trends in Gestural Control of Music, Ircam - Centre Pompidou (2000), 389--405.","paperID":"None"},{"content":"Taylor, R., Schofield, G., Shearer, J., Boulanger, P., Wallace, J., and Olivier, P. humanaquarium. Proceedings of the 2010 Conference on New Interfaces for Musical Expression, Sydney, Australia, (2010), 440--443.","paperID":"None"},{"content":"Carl Unander-Scharin , Kristina Höök , Ludvig Elblaus, The throat III: disforming operatic voices through a novel interactive instrument, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2479596"},{"content":"Unander-Scharin, C. & Å. Sensory Digital Intonation. Carpa 3, vol 43, Artistic Research in action. (2013).","paperID":"None"},{"content":"Unander-Scharin, Å. Three Interactive Scenes of The Crystal Cabinet. Brunel Univ, London, 2011.","paperID":"None"},{"content":"Waisvisz, M. The hands. Proceedings International Computer Music Conference, 313--318.","paperID":"None"},{"content":"Waisvisz, M. Crackle history. STEIM. Retrieved November 21, (2004)","paperID":"None"},{"content":"Westerlund, B. Design Space Exploration: cooperative creation of proposals for desired interactions with future artefacts. KTH, Stockholm, 2009.","paperID":"None"},{"content":"Mikael Wiberg , Hiroshi Ishii , Paul Dourish , Daniela Rosner , Anna Vallgårda , Petra Sundström , Tobie Kerridge , Mark Rolston, \"Material interactions\": from atoms & bits to entangled practices, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2212408"},{"content":"John Zimmerman , Erik Stolterman , Jodi Forlizzi, An analysis and critique of Research through Design: towards a formalization of a research approach, Proceedings of the 8th ACM Conference on Designing Interactive Systems, August 16-20, 2010, Aarhus, Denmark","paperID":"1858228"}],"abstract":"With The Vocal Chorder, a large interactive instrument to create accompaniment, opera singers can get more power over the performance. The device allows performers to interactively accompany themselves through pushing, leaning on and bending steel wires. The design was guided by the unique needs of the solo-singer, explored through autobiographical design and material explorations, some on stage, and later tested by other singers. We discuss how designing for opera and for the stage requires extraordinary durability and how opera performances can change with a bodily-oriented instrument such as The Vocal Chorder. Through a designerly exploration, we arrived at a device that offered (1) a tool for singers to take control over the rhythmical pace and overall artistic and aesthetic outcome of their performances, (2) an enriched sense of embodiment between their voice and the overall performance; and (3) a means to empower opera singers on stage.","video":"http://www.youtube.com/embed/m_nqtfqz9bg?rel=0","title":"The vocal chorder: empowering opera singers with a large interactive instrument","filename":"CHI14/p1001","authors":["Carl Unander-Scharin","Åsa Unander-Scharin","Kristina Höök"],"conference":"CHI '14"}