{"paperId":2557324,"citation":[{"content":"Xiuli Chen , Gilles Bailly , Duncan P. Brumby , Antti Oulasvirta , Andrew Howes, The Emergence of Interactive Behavior: A Model of Rational Menu Search, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702483"},{"content":"Yuan-Chi Tseng , Andrew Howes, The adaptation of visual search to utility, ecology and design, International Journal of Human-Computer Studies, v.80 n.C, p.45-55, August 2015","paperID":"2777910"}],"reference":[{"content":"Anstis, S. M. (1974). A chart demonstrating variations in acuity with retinal position. Vision Research, 14(7), 589--592.","paperID":"None"},{"content":"Rachel Bellamy , Bonnie John , Sandra Kogan, Deploying CogTool: integrating quantitative usability assessment into real-world software development, Proceedings of the 33rd International Conference on Software Engineering, May 21-28, 2011, Waikiki, Honolulu, HI, USA","paperID":"1985890"},{"content":"Maria Callander , Lorna Zorman, Usability on patrol, CHI '07 Extended Abstracts on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, CA, USA","paperID":"1240888"},{"content":"Stuart K. Card , Allen Newell , Thomas P. Moran, The  Psychology of Human-Computer Interaction, L. Erlbaum Associates Inc., Hillsdale, NJ, 1983","paperID":"578027"},{"content":"Cockburn, A., & Gutwin, C. (2009). A predictive model of human performance with scrolling and hierarchical lists. Human-Computer Interaction, 24(3), 273--314.","paperID":"None"},{"content":"Findlay, J. M., & Gilchrist, I. D. (2003). Active Vision: The Psychology of Looking and Seeing. Oxford University Press.","paperID":"None"},{"content":"Michael D. Fleetwood , Michael D. Byrne, Modeling the visual search of displays: a revised ACT-R model of icon search based on eye-tracking data, Human-Computer Interaction, v.21 n.2, p.153-197, May 2006","paperID":"1466586"},{"content":"Gordon, J., & Abramov, I. (1977). Color vision in the peripheral retina. II. Hue and saturation. J. Opt. Soc. Am., 67(2), 202--207.","paperID":"None"},{"content":"Tim Halverson , AnthonyJ. Hornof, A Computational Model of “Active Vision” for Visual Search in Human–Computer Interaction, Human-Computer Interaction, v.26 n.4, p.285-314, October-December","paperID":"2499326"},{"content":"Henderson, J. M., & Castelhano, M. S. (2005). Eye movements and visual memory for scenes. In G. Underwood (Ed.), Cognitive Processes in Eye Guidance. (pp. 213--35). Oxford University Press.","paperID":"None"},{"content":"Anthony J. Hornof , David E. Kieras, Cognitive modeling reveals menu search in both random and systematic, Proceedings of the ACM SIGCHI Conference on Human factors in computing systems, p.107-114, March 22-27, 1997, Atlanta, Georgia, USA","paperID":"258621"},{"content":"Bonnie John , Sonal Starr , Brian Utesch, Experiences with collaborative, distributed predictive human performance modeling, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2212821"},{"content":"Bonnie E. John , David E. Kieras, Using GOMS for user interface design and evaluation: which technique?, ACM Transactions on Computer-Human Interaction (TOCHI), v.3 n.4, p.287-319, Dec. 1996","paperID":"236050"},{"content":"Bonnie E. John , Konstantine Prevas , Dario D. Salvucci , Ken Koedinger, Predictive human performance modeling made easy, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.455-462, April 24-29, 2004, Vienna, Austria","paperID":"985750"},{"content":"Kieras, D. (2009). The persistent visual store as the locus of 'xation memory in visual search tasks. In R. Cooper & D. Peebles (Eds.), Proceedings of the Ninth International Conference on Cognitive Modeling, UK.","paperID":"None"},{"content":"Kieras, D. (2010). Modeling visual search of displays of many objects: The role of differential acuity and 'xation memory. In D. D. Salvucci & G. Gunzelmann (Eds.) Proceedings of the 10th International Conference on Cognitive Modeling, August 6--8, 2010, Philadelphia.","paperID":"None"},{"content":"Kieras, D. E. (2007). Model-based evaluation. In J. A. Jacko & A. Sears (Eds.), The Human-Computer Interaction Handbook (2nd ed.). (pp. 1191--208). Mahwah, NJ: Lawrence Erlbaum Associates.","paperID":"None"},{"content":"Kieras, D. E., & Marshall, S. P. (2006). Visual availability and 'xation memory in modeling visual search using the EPIC architecture. In Proceedings of the Annual Meeting of the Cognitive Science Society, 423--428.","paperID":"None"},{"content":"Kieras, D. E. (2004). The EPIC Architecture: Principles of Operation. Retrieved from http:// www.eecs.umich.edu/~kieras/docs/EPIC/ EPICPrinOp.pdf","paperID":"None"},{"content":"David E. Kieras , David E. Meyer, An overview of the EPIC architecture for cognition and performance with application to human-computer interaction, Human-Computer Interaction, v.12 n.4, p.391-438, December 1997","paperID":"1462983"},{"content":"David E. Kieras , Scott D. Wood , Kasem Abotel , Anthony Hornof, GLEAN: a computer-based tool for rapid GOMS model usability evaluation of user interface designs, Proceedings of the 8th annual ACM symposium on User interface and software technology, p.91-100, November 15-17, 1995, Pittsburgh, Pennsylvania, USA","paperID":"215700"},{"content":"Maeda, J. (2013, June 12). The future of design is more than making Apple iOS 'at. Wired Magazine. Retrieved from http://www.wired.com/opinion/2013/06/thefuture-of-design-is-more-than-making-apple-ios--at/","paperID":"None"},{"content":"Osga, G., Van Orden K., Campbell, N., Kellmeyer, D., and Lulue D. (2002). Design and Evaluation of War'ghter Task Support Methods in a Multi-Modal Watchstation. Space & Naval Warfare Center, San Diego, Technical Report 1874.","paperID":"None"},{"content":"Peterson, M. S., Kramer, A. F., Wang, R. F., Irwin, D. E., & McCarley, J. S. (2001). Visual search has memory. Psychological Science, 12(4), 287--292.","paperID":"None"},{"content":"Dario D. Salvucci , Mark Zuber , Ekaterina Beregovaia , Daniel Markley, Distract-R: rapid prototyping and evaluation of in-vehicle interfaces, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 02-07, 2005, Portland, Oregon, USA","paperID":"1055052"},{"content":"Sanders, M. S., & McCormick, E. J. (1987). Human Factors in Engineering and Design (6th ed.). New York, New York: McGraw-Hill.","paperID":"None"},{"content":"Leong-Hwee Teo , Bonnie John , Marilyn Blackmon, CogTool-Explorer: a model of goal-directed user exploration that considers information layout, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208414"},{"content":"Alonso H. Vera , Bonnie E. John , Roger Remington , Michael Matessa , Michael A. Freed, Automating human-performance modeling at the millisecond level, Human-Computer Interaction, v.20 n.3, p.225-265, September 2005","paperID":"1466579"},{"content":"Williams, L. G. (1966). A Study Of Visual Search Using Eye Movement Recordings. Technical Report, Honeywell Inc., St. Paul Minnesota, Feb. 28, 1966. NTIS AD0629624.","paperID":"None"},{"content":"Williams, L. G. (1967). The effects of target Specification on objects 'xated during visual search. Acta Psychologica, 27, 355--360.","paperID":"None"}],"abstract":"Being able to predict the performance of interface designs using models of human cognition and performance is a long-standing goal of HCI research. This paper presents recent advances in cognitive modeling which permit increasingly realistic and accurate predictions for visual human-computer interaction tasks such as icon search by incorporating an \"active vision\" approach which emphasizes eye movements to visual features based on the availability of features in relationship to the point of gaze. A high fidelity model of a classic visual search task demonstrates the value of incorporating visual acuity functions into models of visual performance. The features captured by the high-fidelity model are then used to formulate a model simple enough for practical use, which is then implemented in an easy-to-use GLEAN modeling tool. Easy-to-use predictive models for complex visual search are thus feasible and should be further developed.","video":"http://www.youtube.com/embed/WgV3YDbfbV8?rel=0","title":"Towards accurate and practical predictive models of active-vision-based visual search","filename":"CHI14/p3875","authors":["David E. Kieras","Anthony J. Hornof"],"conference":"CHI '14"}