{"paperId":2557076,"citation":[],"reference":[{"content":"Barrass, S., and Frauenberger, C. A communal map of design in auditory display. In Proc. ICAD (2009).","paperID":"None"},{"content":"Meera M. Blattner , Denise A. Sumikawa , Robert M. Greenberg, Earcons and icons: their structure and common design principles, Human-Computer Interaction, v.4 n.1, p.11-44, March 1989","paperID":"1455736"},{"content":"Stephen Brewster, Nonspeech auditory output, The human-computer interaction handbook: fundamentals, evolving technologies and emerging applications, L. Erlbaum Associates Inc., Hillsdale, NJ, 2002","paperID":"772089"},{"content":"David Warnock , Marilyn McGee-Lennon , Stephen Brewster, The role of modality in notification performance, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042173"},{"content":"Edworthy, J. Does sound help us to work better with machines' A commentary on rauterberg's paper 'about the importance of auditory alarms during the operation of a plant simulator. Interacting With Computers 10 (1998), 401'409.","paperID":"None"},{"content":"Escera, C., Alho, K., Schröger, E., and Winkler, I. Involuntary attention and distractibility as evaluated with event-related brain potentials. Audiology and Neurotology 5 (2000), 151'166.","paperID":"None"},{"content":"Ewing, K., and Fairclough, S. The impact of working memory load on psychophysiological measures of mental effort and motivational disposition. Human Factors: A system view of human, technology and organisation (2010), 1'11.","paperID":"None"},{"content":"Fagerlönn, J., and Liljedahl, M. Awesome sound design tool: a web based utility that invites end users into the audio design process. In Proc. ICAD (2009).","paperID":"None"},{"content":"Gottselig, J. M., Brandeis, D., Hofer-Tinguely, G., Borbély, A. A., and Achermann, P. Human central auditory plasticity associated with tone sequence learning. Learning & Memory 11, 2 (2004), 162'171.","paperID":"None"},{"content":"Goydke, K. N., Altenmüller, E., Möller, J., and Münte, T. F. Changes in emotional tone and instrumental timbre are re'ected by the mismatch negativity. Cognitive Brain Research 21, 3 (2004), 351'359.","paperID":"None"},{"content":"Graham, R. Use of auditory icons as emergency warnings: evaluation within a vehicle collision avoidance application. Ergonomics 42, 9 (1999), 1233'1248.","paperID":"None"},{"content":"David Grimes , Desney S. Tan , Scott E. Hudson , Pradeep Shenoy , Rajesh P.N. Rao, Feasibility and pragmatics of classifying working memory load with an electroencephalograph, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357187"},{"content":"Helander, M. G., Landauer, T. K., and Prabhu, P. V. Auditory interfaces: Handbook of human computer interface. Elsevier Science (1997).","paperID":"None"},{"content":"Hollands, J. G., and Wickens, C. D. Engineering psychology and human performance. Prentice Hall New Jersey, 1999.","paperID":"None"},{"content":"Kirmse, U., Jacobsen, T., and Schröger, E. Familiarity affects environmental sound processing outside the focus of attention: An event-related potential study. Clinical neurophysiology 120 (2009), 887'896.","paperID":"None"},{"content":"Kujala, T., Tervaniemi, M., and Schröger, E. The mismatch negativity in cognitive and clinical neuroscience: Theoretical and methodological considerations. Biological Psychology 4 (2007), 1'19.","paperID":"None"},{"content":"Lemmens, P. M. C., Bussemakers, M. P., and Haan, A. D. Effects of auditory icons and earcons on visual categorization: the bigger picture. In Proc. ICAD (2001), 117'125.","paperID":"None"},{"content":"Iain McGregor , Pontus Larsson , Phil Turner, Evaluating a vehicle auditory display: comparing a designer's expectations with listeners' experiences, Proceedings of the 29th Annual European Conference on Cognitive Ergonomics, August 24-26, 2011, Rostock, Germany","paperID":"2074731"},{"content":"Mehta, R., Zhu, R. J., and Cheema, A. Is noise always bad' Exploring the effects of ambient noise on creative cognition. JCR 39, 4 (2012), 784'799.","paperID":"None"},{"content":"Naatanen, R., Paavilainen, P., Rinne, T., and Alho, K. The mismatch negativity (MMN) in basic research of central auditory processing: A review. Clinical Neurophysiology 118, 12 (2007), 2544 ' 2590.","paperID":"None"},{"content":"Nicole, W., Andreas, W., Stefan, B., and Erich, S. The development of involuntary and voluntary attention from childhood to adulthood: A combined behavioral and event-related potential study. Clinical Neurophysiology 117 (2006), 2191'2203.","paperID":"None"},{"content":"Novitski, N., Tervaniemi, M., Huotilainen, M., and Naatanen, R. Frequency discrimination at different frequency levels as indexed by electrophysiological and behavioral measures. Cognitive Brain Research 20, 1 (2004), 26'36.","paperID":"None"},{"content":"Pakarinen, S., Takegata, R., Rinne, T., Huotilainen, M., and Näätänen, R. Measurement of extensive auditory discrimination pro'les using the mismatch negativity (MMN) of the auditory event-related potential (ERP). Clinical Neurophysiology 118 (2007), 177'185.","paperID":"None"},{"content":"Evan M M. Peck , Beste F. Yuksel , Alvitta Ottley , Robert J.K. Jacob , Remco Chang, Using fNIRS brain sensing to evaluate information visualization interfaces, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470723"},{"content":"Polich, J. Updating P300: an integrative theory of P3a and P3b. Clinical neurophysiology 118, 10 (2007), 2128'2148.","paperID":"None"},{"content":"Rafa, A., and Catherine, G. Usability of non-speech sounds in user interfaces. In Proc. ICAD (2008).","paperID":"None"},{"content":"Satu, P., Minna, H., and Risto, N. The mismatch negativity (MMN) with no standard stimulus. Clinical Neurophysiology 121 (2010), 1043'1050.","paperID":"None"},{"content":"Erin Solovey , Paul Schermerhorn , Matthias Scheutz , Angelo Sassaroli , Sergio Fantini , Robert Jacob, Brainput: enhancing interactive systems with streaming fnirs brain input, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208372"},{"content":"Stavros Garzonis , Simon Jones , Tim Jay , Eamonn O'Neill, Auditory icon and earcon mobile service notifications: intuitiveness, learnability, memorability and preference, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518932"},{"content":"Sussman, E., Winkler, I., and Schroger, E. Top-down control over involuntary attention switching in the auditory modality. Psychonomic Bulletin and Review 10, 3 (2003), 630'637.","paperID":"None"},{"content":"Chi Vi , Sriram Subramanian, Detecting error-related negativity for interaction design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207744"},{"content":"Winkler, I., Teder, Salejarvi, W., Horväth, J., Naatanen, R., and Sussman, E. Human auditory cortex tracks task-irrelevant sound sources. Neuroreport 14, 16 (2003), 2053'2056.","paperID":"None"},{"content":"Zander, T. O., and Kothe, C. Towards passive brain'computer interfaces: applying brain'computer interface technology to human-machine systems in general. J. Neural Eng. 8, 2 (2011), 025005.","paperID":"None"}],"abstract":"Audio notifications are an important means of prompting users of electronic products. Although useful in most environments, audio notifications are ineffective in certain situations, especially against particular auditory backgrounds or when the user is distracted. Several studies have used behavioral performance to evaluate audio notifications, but these studies failed to achieve consistent results due to factors including user subjectivity and environmental differences; thus, a new method and more objective indicators are necessary. In this study, we propose an approach based on electroencephalography (EEG) to evaluate audio notifications by measuring users' auditory perceptual responses (mismatch negativity) and attention shifting (P3a). We demonstrate our approach by applying it to the usability testing of audio notifications in realistic scenarios, such as users performing a major task amid ambient noises. Our results open a new perspective for evaluating the design of the audio notifications.","video":"http://www.youtube.com/embed/XkH5CWVpvws?rel=0","title":"An EEG-based approach for evaluating audio notifications under ambient sounds","filename":"CHI14/p3817","authors":["Yi-Chieh Lee","Wen-Chieh Lin","Jung-Tai King","Li-Wei Ko","Yu-Ting Huang","Fu-Yin Cherng"],"conference":"CHI '14"}