{"paperId":2557149,"citation":[],"reference":[{"content":"Arunachalam, B., Henneberry, S. R., Lusk, J. L., & Norwood, F. B. An empirical investigation into the excessive-choice effect. American journal of agricultural economics, 91 (2009), 810--825.","paperID":"None"},{"content":"Bernard, M., Baker, R., & Fernandez, M. Paging vs. scrolling: Looking for the best way to present search results. Usability News, 4 (2002).","paperID":"None"},{"content":"Capra, R. HCI browser: A tool for studying web search behavior. Proceedings of the American Society for Information Science and Technology, 47 (2001), 1--2.","paperID":"None"},{"content":"Fasolo, B., McClelland, G. H., & Todd, P. M. Escaping the tyranny of choice: When fewer attributes make choice easier. Marketing Theory, 7 (2007), 13--26.","paperID":"None"},{"content":"Haynes, G. A. Testing the boundaries of the choice overload phenomenon: The effect of number of options and time pressure on decision difficulty and satisfaction. Psychology & Marketing, 26 (2009), 204--212.","paperID":"None"},{"content":"Mu-hsuan Huang , Hui-yu Wang, The influence of document presentation order and number of documents judged on users' judgments of relevance, Journal of the American Society for Information Science and Technology, v.55 n.11, p.970-979, September 2004","paperID":"1044411"},{"content":"Iyengar, S. S., & Lepper, M. R. When choice is demotivating: Can one desire too much of a good thing? Journal of personality and social psychology, 79 (2000), 995--1006.","paperID":"None"},{"content":"Iyengar, S. S., Wells, R. E., & Schwartz, B. Doing Better but Feeling Worse Looking for the \"Best\" Job Undermines Satisfaction. Psychological Science, 17 (2006), 143--150.","paperID":"None"},{"content":"Loewenstein, G. Is more choice always better? Social Security Brief, 7 (1999), 1--8.","paperID":"None"},{"content":"Lori Lorigo , Maya Haridasan , Hrönn Brynjarsdóttir , Ling Xia , Thorsten Joachims , Geri Gay , Laura Granka , Fabio Pellacini , Bing Pan, Eye tracking and online search: Lessons learned and challenges ahead, Journal of the American Society for Information Science and Technology, v.59 n.7, p.1041-1052, May 2008","paperID":"1364849"},{"content":"Oppewal, H., & Koelemeijer, K. More choice is better: Effects of assortment size and composition on assortment evaluation. International Journal of Research in Marketing, 22 (2005), 45--60.","paperID":"None"},{"content":"Antti Oulasvirta , Janne P. Hukkinen , Barry Schwartz, When more is less: the paradox of choice in search engine use, Proceedings of the 32nd international ACM SIGIR conference on Research and development in information retrieval, July 19-23, 2009, Boston, MA, USA","paperID":"1572030"},{"content":"Pan, B., Hembrooke, H., Joachims, T., Lorigo, L., Gay, G., & Granka, L. In Google we trust: Users' decisions on rank, position, and relevance. Journal of Computer-Mediated Communication, 12 (2007), 801--823.","paperID":"None"},{"content":"Purgalis, Parker, L. M., & Johnson, R. E. Does order of presentation affect users' judgment of documents' Journal of the American Society for Information Science, 41 (1990), 493--494.","paperID":"None"},{"content":"Scheibehenne, B., Greifeneder, R., & Todd, P. M. What moderates the too-much-choice effect? Psychology & Marketing, 26 (2009), 229--253.","paperID":"None"},{"content":"Scheibehenne, B., Greifeneder, R., & Todd, P. M. Can There Ever Be Too Many Options? A Meta-Analytic Review of Choice Overload. Journal of Consumer Research, 37 (2010), 409--425.","paperID":"None"},{"content":"Schwartz, B. The paradox of choice: Why less is more. New York: Ecco (2004).","paperID":"None"}],"abstract":"Search engines typically return so many results that choosing from the list might be predicted to suffer from the effects of \"choice overload\". Preliminary work has reported just such an effect [12]. In this paper a series of three experiments was conducted to investigate the choice overload effect in search engine use. Participants were given search tasks and presented with either six or twenty-four returns to choose from. The results revealed that the choice behaviour was strongly influenced by the ranking of returns, and that choice satisfaction was affected by the number of options and the decision time. The main results, from the third experiment, showed that large sets of options yielded a positive effect on participants' satisfaction when they made a decision without time limit. When time was more strongly constrained, choices from small sets led to relatively higher satisfaction. Our studies show how user satisfaction with found information can be affected by processing strategies that are influenced by search engine design features.","video":"http://www.youtube.com/embed/0yNkAu8EbZs?rel=0","title":"Choice overload in search engine use?","filename":"CHI14/p1285","authors":["Pawitra Chiravirakul","Stephen J. Payne"],"conference":"CHI '14"}