{"paperId":2557418,"citation":[],"reference":[{"content":"Andrews, D., Nonnecke, B., and Preece, J. (2003). Electronic Survey Methodology: A Case Study in Reaching Hard-to-Involve Internet Users. International Journal of Human-Computer Interaction 16 (2), pp. 185--210.","paperID":"None"},{"content":"Jeremy P. Birnholtz , Daniel B. Horn , Thomas A. Finholt , Sung Joo Bae, The effects of cash, electronic, and paper gift certificates as respondent incentives for a web-based survey of technologically sophisticated respondents, Social Science Computer Review, v.22 n.3, p.355-362, Fall 2004","paperID":"1039709"},{"content":"Bosnjak, M., and Tuten, T. L. (2001). Classifying Response Behaviors in Web-based Surveys. Journal of Computer-Mediated Communication 6 (3).","paperID":"None"},{"content":"Michael Bosnjak , Tracy L. Tuten, Prepaid and promised incentives in web surveys: an experiment, Social Science Computer Review, v.21 n.2, p.208-217, June 2003","paperID":"782726"},{"content":"Bilsky, W., and Schwartz, S. H. (1994). Values and personality. European Journal of Psychology 8, pp. 163--181.","paperID":"None"},{"content":"Camemer, C. F., and Hogarth, R. M. (1999). The Effects of Financial Incentives in Experiments: A Review and Capital-Labor-Production Framework. Journal of Risk and Uncertainty 19 (1-3), pp. 7--42.","paperID":"None"},{"content":"Cheshire, C. (2007). Selective Incentives and Generalized Information Exchange. Social Psychology Quarterly 70 (1), pp. 82--100.","paperID":"None"},{"content":"Cheshire, C., and Antin, J. (2008). The Social Psychological Effects of Feedback on the Production of Internet Information Pools. Journal of ComputerMediated Communication 13 (3).","paperID":"None"},{"content":"Church, A. H. (1993). Estimating the effect of incentives on mail survey response rates: A meta-analysis. Public Opinion Quarterly 57 (1), pp. 62--79.","paperID":"None"},{"content":"Cobanoglu, C., and Cobanoglu, N. (2003). The effect of incentives in Web surveys: Application and ethical considerations. International Journal of Market Research 45 (4), pp. 475--488.","paperID":"None"},{"content":"Deci, E. L. (1971). Effects of Externally Mediated Rewards on Intrinsic Motivation. Journal of Personality and Social Psychology 18, pp. 105--115.","paperID":"None"},{"content":"Don A. Dillman , Jolene D. Smyth , Leah Melani Christian, Internet, Mail, and Mixed-Mode Surveys: The Tailored Design Method, Wiley Publishing, 2008","paperID":"1502013"},{"content":"Evans, J. R., Mathur, A. (2005). The value of online surveys. Internet Research 15 (2), pp. 195--219.","paperID":"None"},{"content":"Weimiao Fan , Zheng Yan, Factors affecting response rates of the web survey: A systematic review, Computers in Human Behavior, v.26 n.2, p.132-139, March, 2010","paperID":"1668137"},{"content":"Frey, B. S., and Jegen, R. (2001). Motivation Crowding Theory: A Survey of Empirical Evidence. Journal of Economic Surveys 15 (5), pp. 589--611.","paperID":"None"},{"content":"Frick, A., Bächtiger, M.-T., and Reips, U.-D. (2001). Financial incentives, personal information and drop-out in online studies. In U.-D. Reips & M. Bächtiger (Eds.), Dimensions of Internet Science, pp. 209--219. Lengerich: Pabst.","paperID":"None"},{"content":"Gneezy, Uri, and Rustichini, A. (2000). Pay Enough or Don't Pay At All. Quarterly Journal of Economics 115 (3), pp. 791--810.","paperID":"None"},{"content":"Göritz, A. S. (2006). Incentives in Web Studies: Methodological Issues and a Review. International Journal of Internet Science 1 (1), pp. 58--70.","paperID":"None"},{"content":"Groves, R. M., Singer, E., and Corning, A. (2000). Leverage-Saliency Theory of Survey Participation: Description and an Illustration. Public Opinion Quarterly 64 (3), pp. 299--308.","paperID":"None"},{"content":"Heerwegh, D. (2006). An investigation of the effect of lotteries on Web survey response rates. Field Methods 18 (2), pp. 205--220.","paperID":"None"},{"content":"Holm, S. (1979). A simple sequentially rejective multiple test procedure. Scandinavian Journal of Statistics 6 (2), pp. 65--70.","paperID":"None"},{"content":"Khadjesari, Z., Murray, E., Kalaitzaki, E., White, I. R., McCambridge, J., Thompson, S. G., Wallace, P., Godfrey, C. (2011). Impact and Costs of Incentives to Reduce Attrition in Online Trials: Two Randomized Controlled Trials. Journal of Medical Internet Research 13 (1), article e26.","paperID":"None"},{"content":"Jonathan Lazar , Jinjuan Heidi Feng , Harry Hochheiser, Research Methods in Human-Computer Interaction, Wiley Publishing, 2010","paperID":"1841406"},{"content":"Lepper, M. R., and Greene, D. (1978). The Hidden Costs of Reward: New Perspectives on the Psychology of Human Motivation. Hillsdale, NY: Erlsbaum Publishers.","paperID":"None"},{"content":"Ling, K., Beenen, G., Wang, X., Chang, K., Frankowski, D., Resnick, P., and Kraut, R. E. (2005). Using social psychology to motivate contributions to online communities. Journal of Computer Mediated Communication 10.","paperID":"None"},{"content":"James G. March, The  Pursuit of Organizational Intelligence: Decisions and Learning in Organizations, Blackwell Publishers, Inc., Cambridge, MA, 1999","paperID":"520754"},{"content":"McCrae, R. R., and Costa Jr., P. T. (1987). Validation of the five-factor model of personality across instruments and observers. Journal of Personality and Social Psychology 52 (1), pp. 81--90.","paperID":"None"},{"content":"Messer, B. L., and Dillman, D. A. (2011). Surveying the general public over the Internet using address-based sampling and mail contact procedures. Public Opinion Quarterly 75 (3), pp. 429--457.","paperID":"None"},{"content":"Millar, M. M., and Dillman, D. A. (2011). Improving response to web and mixed-mode surveys. Public Opinion Quarterly 75 (2), pp. 249--269.","paperID":"None"},{"content":"Margit Osterloh , Bruno S. Frey, Motivation, Knowledge Transfer, and Organizational Forms, Organization Science, v.11 n.5, p.538-550, September 2000","paperID":"768943"},{"content":"Porter, S. R. (2004). Raising Response Rates: What Works? New Directions for Institutional Research 121, pp. 5--21.","paperID":"None"},{"content":"Daphne Ruth Raban, Self-presentation and the value of information in Q&A websites, Journal of the American Society for Information Science and Technology, v.60 n.12, p.2465-2473, December 2009","paperID":"1673001"},{"content":"Tourangeau, R. (2004). Survey Research and Societal Change. Annual Review of Psychology 55, pp. 775--801.","paperID":"None"},{"content":"Tuten, T. L., Bosnjak, M., Bandilla, W. (1999). Banner-advertised Web surveys. Marketing Research 11 (4), pp. 16--21.","paperID":"None"},{"content":"Tracy L. Tuten , Mirta Galesic , Michael Bosnjak, Effects of immediate versus delayed notification of prize draw results on response behavior in web surveys: an experiment, Social Science Computer Review, v.22 n.3, p.377-384, Fall 2004","paperID":"1039712"},{"content":"Wright, K. B. (2005). Researching Internet-based populations: Advantages and disadvantages of online survey research, online questionnaire authoring software packages, and web survey services. Journal of Computer-Mediated Communication 10 (3).","paperID":"None"},{"content":"Yamagishi, T., and Cook, K. S. (1993). Generalized Exchange and Social Dilemmas. Social Psychology Quarterly 56 (4), pp. 235--248.","paperID":"None"}],"abstract":"The recruitment of participants for online survey research presents many challenges. In this work, we present four experiments examining how two different kinds of \"surprise\" financial incentives affect the rate of participation in a longitudinal study when participants are initially solicited with either an appeal to intrinsic motivation to participate in research or one that also offers extrinsic financial incentives. We find that unexpected financial incentives (\"existence surprises\") presented to people who click a recruitment advertisement focused on intrinsic incentives lead to a lower recruitment rate than do the same incentives offered to those who clicked an advertisement that led them to expect it. However, when potential participants expect a financial incentive, surprising them with a higher amount (\"amount surprises\") yields a higher recruitment rate. We interpret these results in the context of crowding theory. Neither type of surprise affected ongoing participation, measured as the number of questions and questionnaires completed over the course of the study.","video":"http://www.youtube.com/embed/ZJva-szO8QM?rel=0","title":"Incentives to participate in online research: an experimental examination of \"surprise\" incentives","filename":"CHI14/p3433","authors":["Andrew T. Fiore","Coye Cheshire","Lindsay Shaw Taylor","G.A. Mendelsohn"],"conference":"CHI '14"}