{"paperId":2557210,"citation":[{"content":"Matthew L. Lee, Did I take my meds today?, XRDS: Crossroads, The ACM Magazine for Students, v.21 n.2, Winter 2014","paperID":"2676574"},{"content":"Charles Consel , Lucile Dupuy , Hélène Sauzéon, A Unifying Notification System To Scale Up Assistive Services, Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, October 26-28, 2015, Lisbon, Portugal","paperID":"2809855"},{"content":"Minsam Ko , Seungwoo Choi , Subin Yang , Joonwon Lee , Uichin Lee, FamiLync: facilitating participatory parental mediation of adolescents' smartphone use, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2804283"},{"content":"Andrea Barbarin , Tiffany C. Veinot , Predrag Klasnja, Taking our Time: Chronic Illness and Time-Based Objects in Families, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675200"},{"content":"Sander Hermsen , Jeana Frost , Reint Jan Renes , Peter Kerkhof, Using feedback through digital technology to disrupt and change habitual behavior, Computers in Human Behavior, v.57 n.C, p.61-74, April 2016","paperID":"2895015"}],"reference":[{"content":"Bandura, A. Self-efficacy: toward a unifying theory of behavioral change. Psychological review 84, 2 (1977), 191.","paperID":"None"},{"content":"Bandura, A. Social cognitive theory of self-regulation. Organizational behavior and human decision processes 50, 2 (1991), 248--287.","paperID":"None"},{"content":"Brus, H., Van de Laar, M., Taal, E., Rasker, J., and Wiegman, O. Determinants of compliance with medication in patients with rheumatoid arthritis. Patient Education and Counseling 36, 1 (1999), 57--64.","paperID":"None"},{"content":"Sunny Consolvo , Predrag Klasnja , David W. McDonald , Daniel Avrahami , Jon Froehlich , Louis LeGrand , Ryan Libby , Keith Mosher , James A. Landay, Flowers or a robot army?: encouraging awareness & activity with personal, mobile displays, Proceedings of the 10th international conference on Ubiquitous computing, September 21-24, 2008, Seoul, Korea","paperID":"1409644"},{"content":"Sunny Consolvo , David W. McDonald , James A. Landay, Theory-driven design strategies for technologies that support behavior change in everyday life, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518766"},{"content":"Elliott, R. A. Problems with medication use in the elderly: an Australian perspective. Journal of Pharmacy Practice and Research 36, 1 (2006), 58.","paperID":"None"},{"content":"Thomas Erickson , Mark Podlaseck , Sambit Sahu , Jing D. Dai , Tian Chao , Milind Naphade, The dubuque water portal: evaluation of the uptake, use and impact of residential water consumption feedback, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207772"},{"content":"Fishkin, K. P., Wang, M., and Borriello, G. A ubiquitous system for medication monitoring. In Proc. Pervasive 2004.","paperID":"None"},{"content":"Friedman, R. H., et al. A Telecommunications System for Monitoring and Counseling Patients With Hypertension. Am J Hypertension 9, 4 (1996), 285--292.","paperID":"None"},{"content":"Gadkari, A. S. and McHorney, C. A. Unintentional non-adherence to chronic prescription medications. BMC Health Services Research 12, 1 (2012), 98.","paperID":"None"},{"content":"Hayes, T. L., Cobbinah, K., Dishongh, T., et al. A study of medication-taking and unobtrusive, intelligent reminding. Telemedicine and e-Health 15, 8 (2009), 770--776.","paperID":"None"},{"content":"Haynes, R. B., Ackloo, E., Sahota, N., McDonald, H. P., & Yao, X. Interventions for enhancing medication adherence. Cochrane database syst Rev, 2, 2 (2008), 11.","paperID":"None"},{"content":"Kripalani, S. Interventions to Enhance Medication Adherence in Chronic Medical Conditions. Archives of Internal Medicine 167, 6 (2007), 540.","paperID":"None"},{"content":"Matthew L. Lee , Anind K. Dey, Reflecting on pills and phone use: supporting awareness of functional abilities for older adults, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979247"},{"content":"Ian Li, Personal informatics & context: Using context to reveal factors that affect behavior, Journal of Ambient Intelligence and Smart Environments, v.4 n.1, p.71-72, January 2012","paperID":"2350700"},{"content":"Locke, E. A. and Latham, G. P. A theory of goal setting & task performance. Prentice-Hall, Inc, 1990.","paperID":"None"},{"content":"Lundell, J. et al., Continuous activity monitoring and intelligent contextual prompting to improve medication adherence. In Proc. EMBS, IEEE (2007), pp. 6286--6289.","paperID":"None"},{"content":"Maes, S. and Karoly, P. Self-Regulation Assessment and Intervention in Physical Health and Illness: A Review. Applied Psychology 54, 2 (2005), 267--299.","paperID":"None"},{"content":"McDonnell, P. J. and Jacobs, M. R. Hospital admissions resulting from preventable adverse drug reactions. The Annals of pharmacotherapy 36, 9 (2002), 1331--1336.","paperID":"None"},{"content":"Marilyn Rose McGee-Lennon , Maria Klara Wolters , Stephen Brewster, User-centred multimodal reminders for assistive living, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979248"},{"content":"Morris, S. B. Estimating effect sizes from pretest-posttest-control group designs. Organizational Research Methods, 11, 2, (2008), 364--386.","paperID":"None"},{"content":"Nelson, R. O. and Hayes, S. C. Theoretical Explanations for Reactivity in Self-Monitoring. Behavior Modification 5, 1 (1981), 3--14.","paperID":"None"},{"content":"Rodrigo de Oliveira , Mauro Cherubini , Nuria Oliver, MoviPill: improving medication compliance for elders using a mobile persuasive social game, Proceedings of the 12th ACM international conference on Ubiquitous computing, September 26-29, 2010, Copenhagen, Denmark","paperID":"1864371"},{"content":"Risser, J., Jacobson, T. A., and Kripalani, S. Development and psychometric evaluation of the Self-efficacy for Appropriate Medication Use Scale (SEAMS) in low-literacy patients with chronic disease. Journal of nursing measurement 15, 3 (2007), 203--219.","paperID":"None"},{"content":"Yvonne Rogers , William R. Hazlewood , Paul Marshall , Nick Dalton , Susanna Hertrich, Ambient influence: can twinkly lights lure and abstract representations trigger behavioral change?, Proceedings of the 12th ACM international conference on Ubiquitous computing, September 26-29, 2010, Copenhagen, Denmark","paperID":"1864372"},{"content":"Williams, G., Rodin, G., Ryan, R., Grolnick, W. and Deci, E. Autonomous regulation and long-term medication adherence in adult outpatients. Health Psychology, 17, 3 (1998), 269.","paperID":"None"},{"content":"Zhu, L. L., Zhou, Q., Yan, X. F., Zeng, S. Optimal time to take once-daily oral medications in clinical practice. International Journal of Clinical Practice, 62 (2008), 1560.","paperID":"None"},{"content":"http://www.vitality.net/glowcaps.html."},{"content":"http://proteusdigitalhealth.com/."}],"abstract":"Medication taking is a self-regulatory process that requires individuals to self-monitor their medication taking behaviors, but this can be difficult because medication taking is such a mundane, unremarkable behavior. Ubiquitous sensing systems have the potential to sense everyday behaviors and provide the objective feedback necessary for self-regulation of medication taking. We describe an unobtrusive sensing system consisting of a sensor-augmented pillbox and an ambient display that provides near real-time visual feedback about how well medications are being taken. In contrast to other systems that focus on reminding before medication taking, our approach uses feedback after medication taking to allow the individual to develop their own routines through self-regulation. We evaluated this system in the homes of older adults in a 10-month deployment. Feedback helped improve the consistency of medication-taking behaviors as well as increased ratings of self-efficacy. However, the improved performance did not persist after the feedback display was removed, because individuals had integrated the feedback display into their routines to support their self-awareness, identify mistakes, guide the timing of medication taking, and provide a sense of security that they are taking their medications well. Finally, we reflect on design considerations for feedback systems to support the process of self-regulation of everyday behaviors.","video":"http://www.youtube.com/embed/R0Pc8QmhwdY?rel=0","title":"Real-time feedback for improving medication taking","filename":"CHI14/p2259","authors":["Matthew L. Lee","Anind K. Dey"],"conference":"CHI '14"}