{"paperId":2557297,"reference":[{"content":"Barnes, M., and Duck, S. Everyday communicative contexts for social support. In Communication of social support: messages, interactions, relationships and community, . I. G. S. B. Burleson, T. Albrecht, Ed., Sage (Thousand Oaks, CA, 1994).","paperID":"None"},{"content":"Eric P.S. Baumer , Sherri Jean Katz , Jill E. Freeman , Phil Adams , Amy L. Gonzales , John Pollak , Daniela Retelny , Jeff Niederdeppe , Christine M. Olson , Geri K. Gay, Prescriptive persuasion and open-ended social awareness: expanding the design space of mobile health, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145279"},{"content":"Bender, J. L., Jimenez-Marroquin, M.-C., and Jadad, A. R. Seeking support on facebook: a content analysis of breast cancer groups. JIMR 13, 1 (2011).","paperID":"None"},{"content":"Braithwaite, D. O., Waldron, V. R., and Finn, J. Communication of social support in computer-mediated groups for people with disabilities. Health Comm. 11, 2 (Jan. 1999), 123--51.","paperID":"None"},{"content":"Brandon Brown , Marshini Chetty , Andrea Grimes , Ellie Harmon, Reflecting on health: a system for students to monitor diet and exercise, CHI '06 Extended Abstracts on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1125794"},{"content":"Cohen, S., Underwood, L., and Gottlieb, B. Social support measurement and intervention: A guide for health and social scientists. Oxford University Press, New York, NY, 2000.","paperID":"None"},{"content":"Sunny Consolvo , Katherine Everitt , Ian Smith , James A. Landay, Design requirements for technologies that encourage physical activity, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124840"},{"content":"Sunny Consolvo , David W. McDonald , Tammy Toscos , Mike Y. Chen , Jon Froehlich , Beverly Harrison , Predrag Klasnja , Anthony LaMarca , Louis LeGrand , Ryan Libby , Ian Smith , James A. Landay, Activity sensing in the wild: a field trial of ubifit garden, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357335"},{"content":"Coulson, N. Social support in cyberspace: A content analysis of communication within a Huntington's disease online support group. Patient Education & Counseling 68, 2 (2007), 173--178.","paperID":"None"},{"content":"Constantinos K. Coursaris , Ming Liu, An analysis of social support exchanges in online HIV/AIDS self-help groups, Computers in Human Behavior, v.25 n.4, p.911-918, July, 2009","paperID":"1551429"},{"content":"Cutrona, C. E., and Suhr, J. A. Controllability of stressful events and satisfaction with spouse support behaviors. Comm. Research 19, 2 (1992), 154--174.","paperID":"None"},{"content":"Dehle, C., Larsen, D., and Landers, J. E. Social Support in Marriage. American J of Family Therapy 29, 4 (Oct. 2001), 307--324.","paperID":"None"},{"content":"Dickerson, S. Women's use of the Internet: what nurses need to know. J of Obstetric, Gynecologic, & Neonatal Nursing 35, 1 (2006), 151--156.","paperID":"None"},{"content":"Downer, S., and Meara, J. SMS text messaging improves outpatient attendance. Australian Health Review 30, 3 (2006), 389--396.","paperID":"None"},{"content":"Evans, M., Donelle, L., and Hume-Loveland, L. Social support and online postpartum depression discussion groups: A content analysis. Patient Education and Counseling 87, 3 (2011), 405--410.","paperID":"None"},{"content":"Fjeldsoe, B. Behavior change interventions delivered by mobile telephone short-message service. American J of Preventative Medicine 36, 2 (2009), 165--173.","paperID":"None"},{"content":"Fry, J., and Neff, R. Periodic prompts and reminders in health promotion and health behavior interventions: systematic review. JIMR 11, 2 (Jan. 2009), e16.","paperID":"None"},{"content":"Griffiths, F., and Lindenmeyer, A. Why are health care interventions delivered over the internet? A systematic review of the published literature. JIMR 8, 2 (2006), e10.","paperID":"None"},{"content":"Andrea Grimes , Martin Bednar , Jay David Bolter , Rebecca E. Grinter, EatWell: sharing nutrition-related memories in a low-income community, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460579"},{"content":"Han, J. Y., Kim, J.-H., Yoon, H. J., Shim, M., McTavish, F. M., and Gustafson, D. H. Social and psychological determinants of levels of engagement with an online breast cancer support group: Posters, lurkers, and nonusers. Health Comm. 17, 3 (2012), 356--371.","paperID":"None"},{"content":"Hartzler, A., and Pratt, W. Managing the personal side of health: how patient expertise differs from the expertise of clinicians. JIMR 13, 3 (2011).","paperID":"None"},{"content":"Hembrooke, H., and Gay, G. The laptop and the lecture: The effects of multitasking in learning environments. J of Computing in Higher Ed. 15, 1 (2003), 46--54.","paperID":"None"},{"content":"S. S. Intille, A new research challenge: persuasive technology to motivate healthy aging, IEEE Transactions on Information Technology in Biomedicine, v.8 n.3, p.235-237, September 2004","paperID":"2223253"},{"content":"Akshay Java , Xiaodan Song , Tim Finin , Belle Tseng, Why we twitter: understanding microblogging usage and communities, Proceedings of the 9th WebKDD and 1st SNA-KDD 2007 workshop on Web mining and social network analysis, p.56-65, August 12-12, 2007, San Jose, California","paperID":"1348556"},{"content":"Joinson, A. Selfdisclosure in computermediated communication: The role of selfawareness and visual anonymity. J of Social Psych 31, 2 (2001), 177--192.","paperID":"None"},{"content":"Letourneau, N., and Stewart, M. Impact of online support for youth with asthma and allergies: Pilot study. J of Pediatric Nursing 27, 1 (2012), 65--73.","paperID":"None"},{"content":"Lewis, M., Uhrig, J., Bann, C., and Harris, J. Tailored Text Messaging Intervention for HIV Adherence: A Proof-of-Concept Study. Health Psychology 31 (2012).","paperID":"None"},{"content":"Lim, M., and Hocking, J. SMS STI: a review of the uses of mobile phone text messaging in sexual health. Intl J of STD & AIDS 19, 5 (2008), 287--290.","paperID":"None"},{"content":"Loader, B. D., Muncer, S., Burrows, R., Pleace, N., and Nettleton, S. Medicine on the line? Computer-mediated social support and advice for people with diabetes. Intl J of Social Welfare, 11 (2002), 5365.","paperID":"None"},{"content":"Julie Maitland , Matthew Chalmers, Designing for peer involvement in weight management, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1978988"},{"content":"Marwick, A., and boyd, d. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1 (2011), 114--133.","paperID":"None"},{"content":"McLean, N., Griffin, S., Toney, K., and Hardeman, W. Family involvement in weight control, weight maintenance and weight-loss interventions: a systematic review of randomised trials. Intl J of Obesity 27 (2003), 987--1005.","paperID":"None"},{"content":"Micco, N., Gold, B., and Buzzell, P. Minimal in-person support as an adjunct to internet obesity treatment. Annals of Behavioral Medicine 33, 1 (2007), 49--56.","paperID":"None"},{"content":"Mickelson, K. Seeking social support: Parents in electronic support groups. In Culture of the Internet, S. Kiesler, Ed., Erlbaum (Mahwah, NJ, 1997), 157--178.","paperID":"None"},{"content":"Moskowitz, D., and Young, S. Ecological momentary assessment: what it is and why it is a method of the future in clinical psychopharmacology. J of Psychiatry and Neuroscience 31, 1 (2006), 13--20.","paperID":"None"},{"content":"Mor Naaman , Jeffrey Boase , Chih-Hui Lai, Is it really about me?: message content in social awareness streams, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718953"},{"content":"Bonnie A. Nardi , Steve Whittaker , Erin Bradner, Interaction and outeraction: instant messaging in action, Proceedings of the 2000 ACM conference on Computer supported cooperative work, p.79-88, December 2000, Philadelphia, Pennsylvania, USA","paperID":"358975"},{"content":"Mark W. Newman , Debra Lauterbach , Sean A. Munson , Paul Resnick , Margaret E. Morris, It's not that i don't have problems, i'm just not putting them on facebook: challenges and opportunities in using online social networks for health, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958876"},{"content":"John P. Pollak , Phil Adams , Geri Gay, PAM: a photographic affect meter for frequent, in situ measurement of affect, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979047"},{"content":"Preece, J., Nonnecke, B., and Andrews, D. The top five reasons for lurking: improving community experiences for everyone. Computers in Human Behavior 20, 2 (Mar. 2004), 201--223.","paperID":"None"},{"content":"Stephen Purpura , Victoria Schwanda , Kaiton Williams , William Stubler , Phoebe Sengers, Fit4life: the design of a persuasive technology promoting healthy behavior and ideal weight, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979003"},{"content":"Ridings, C., Gefen, D., and Arinze, B. Psychological Barriers: Lurker and Poster Motivation and Behavior in Online Communities. Comm. Assoc. Info Systems (2006), 329--354.","paperID":"None"},{"content":"Sapp, A., and TrenthamDietz, A. Social networks and quality of life among female longterm colorectal cancer survivors. Cancer 98, 8 (2003), 1749--1758.","paperID":"None"},{"content":"Smith, A., and Brenner, J. Twitter Use 2012, 2012.","paperID":"None"},{"content":"Spiegel, D., Butler, L., and GieseDavis, J. Effects of supportiveexpressive group therapy on survival of patients with metastatic breast cancer. Cancer 110, 5 (2007), 1130--1138.","paperID":"None"},{"content":"Stone, A., and Shiffman, S. Capturing momentary, self-report data: a proposal for reporting guidelines. Annals of Behavioral Medicine 24, 3 (2002), 236--243.","paperID":"None"},{"content":"Taylor, S., Welch, W., Kim, H., and Sherman, D. Cultural differences in the impact of social support on psychological and biological response. Psychological Science, 18 (2007), 831--838.","paperID":"None"},{"content":"Toscos, T., Faber, A., Connelly, K., and Upoma, A. Encouraging physical activity in teens Can technology help reduce barriers to physical activity in adolescent girls? Pervasive Computing Tech for Healthcare (2008).","paperID":"None"},{"content":"Turner-McGrievy, G., and Tate, D. Weight loss social support in 140 characters or less: use of an online social network in a remotely delivered weight loss intervention. Translational Behavioral Medicine (2013).","paperID":"None"},{"content":"Walther, J., and Boyd, S. Attraction to computer-mediated social support. In Communication technology and society: Audience adoption and uses, C. Lin and D. Atkin, Eds., Hampton Press (Creskill, NJ, 2002).","paperID":"None"},{"content":"Winzelberg, A. The analysis of an electronic support group for individuals with eating disorders. Computers in Human Behavior, 13 (1997), 393--407.","paperID":"None"}],"citation":[{"content":"Mary Webster , Emma Foster , Rob Comber , Simon Bowen , Tim Cheetham , Madeline Balaam, Understanding the lived experience of adolescents with type 1 diabetes: opportunities for design, Proceedings of the 14th International Conference on Interaction Design and Children, p.140-149, June 21-24, 2015, Boston, Massachusetts","paperID":"2771854"},{"content":"Yeoreum Lee , Youn-kyung Lim, Understanding the Roles and Influences of Mediators from Multiple Social Channels for Health Behavior Change, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2685032"}],"abstract":"Social support plays an important role in health systems. While significant work has explored the role of social support in CMC environments, less analysis has considered social support in mobile health systems. This paper describes socially supportive messages in VERA, a mobile application for sharing health decisions and behaviors. The short and bursty interactions in social awareness streams [36] afford a particular style of social support, for which we offer the label staccato social support. Results indicate that, in comparison to previous work, staccato social support is characterized by a greater prevalence of esteem support, which builds respect and confidence. We further note the presence of 'following up', a positive behavior that contributes to supportive interactions, likely via social pressure and accountability [7,38]. These findings suggest design recommendations to developers of mobile social support systems and contribute to understanding technologically mediated social support for health.","video":"http://www.youtube.com/embed/tCBUqHfmAuQ?rel=0","title":"Staccato social support in mobile health applications","filename":"CHI14/p653","authors":["Phil Adams","Eric PS Baumer","Geri Gay"],"conference":"CHI '14"}