{"paperId":2557358,"citation":[{"content":"Chris Smith-Clarke , Licia Capra, Beyond the Baseline: Establishing the Value in Mobile Phone Based Poverty Estimates, Proceedings of the 25th International Conference on World Wide Web, April 11-15, 2016, Montréal, Québec, Canada","paperID":"2883076"},{"content":"Andrey Bogomolov , Bruno Lepri , Jacopo Staiano , Nuria Oliver , Fabio Pianesi , Alex Pentland, Once Upon a Crime: Towards Crime Prediction from Demographics and Mobile Data, Proceedings of the 16th International Conference on Multimodal Interaction, November 12-16, 2014, Istanbul, Turkey","paperID":"2663254"},{"content":"Marco De Nadai , Jacopo Staiano , Roberto Larcher , Nicu Sebe , Daniele Quercia , Bruno Lepri, The Death and Life of Great Italian Cities: A Mobile Phone Data Perspective, Proceedings of the 25th International Conference on World Wide Web, April 11-15, 2016, Montréal, Québec, Canada","paperID":"2883084"}],"reference":[{"content":"Aker, J. C., and Mbiti, I. M. Mobile Phones and Economic Development in Africa. Journal of Economic Perspectives 24, 3 (2010), 207--232.","paperID":"None"},{"content":"Balcan, D., Colizza, V., Gonçalves, B., Hu, H., Ramasco, J. J., and Vespignani, A. Multiscale mobility networks and the spatial spreading of infectious diseases. Proceedings of the National Academy of Sciences of the USA of America 106, 51 (Dec. 2009), 21484--9.","paperID":"None"},{"content":"Barrat, A., BarthŘlemy, M., Pastor-Satorras, R., and Vespignani, A. The architecture of complex weighted networks. Proceedings of the National Academy of Sciences of the USA of America 101, 11 (Mar. 2004), 3747--52.","paperID":"None"},{"content":"Blondel, V. D., Esch, M., Chan, C., Clerot, F., Deville, P., Huens, E., Morlot, F., Smoreda, Z., and Ziemlicki, C. Data for Development: the D4D Challenge on Mobile Phone Data. 10.","paperID":"None"},{"content":"Joshua Blumenstock , Nathan Eagle, Mobile divides: gender, socioeconomic status, and mobile phone use in Rwanda, Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development, p.1-10, December 13-16, 2010, London, United Kingdom","paperID":"2369225"},{"content":"Moira Burke , Cameron Marlow , Thomas Lento, Social network activity and social well-being, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753613"},{"content":"Doll, C. H., Muller, J.-P., and Elvidge, C. D. Night-time imagery as a tool for global mapping of socioeconomic parameters and greenhouse gas emissions. AMBIO: a Journal of the Human Environment 29, 3 (2000), 157--162.","paperID":"None"},{"content":"Eagle, N., Macy, M., and Claxton, R. Network diversity and economic development. Science (New York, N.Y.) 328, 5981 (May 2010), 1029--31.","paperID":"None"},{"content":"Ebener, S., Murray, C., Tandon, A., and Elvidge, C. C. From wealth to health: modelling the distribution of income per capita at the sub-national level using night-time light imagery. International Journal of Health Geographics 4, 1 (2005), 5.","paperID":"None"},{"content":"Elvidge, C. D., Baugh, K. E., Kihn, E. A., Kroehl, H. W., and Davis, E. R. Mapping city lights with nighttime data from the dmsp operational linescan system. Photogrammetric Engineering and Remote Sensing 63, 6 (1997), 727--734.","paperID":"None"},{"content":"Frias-martinez, V., Soto, V., Virseda, J., and Frias-martinez, E. Computing Cost-Effective Census Maps From Cell Phone Traces. In Pervasive Urban Applications (PURBA) (Newcastle, 2012).","paperID":"None"},{"content":"Vanessa Frias-Martinez , Jesus Virseda, On the relationship between socio-economic factors and cell phone usage, Proceedings of the Fifth International Conference on Information and Communication Technologies and Development, March 12-15, 2012, Atlanta, Georgia","paperID":"2160684"},{"content":"Frias-Martinez, V., Virseda-Jerez, J., and Frias-Martinez, E. On the relation between socio-economic status and physical mobility. Information Technology for Development 18, 2 (Apr. 2012), 91--106.","paperID":"None"},{"content":"Gutierrez, T., Krings, G., and Blondel, V. D. Indicators of wealth, economic diversity and segregation in cøte divoire using mobile phone datasets. In Netmob 2013 Book of Abstracts (2013).","paperID":"None"},{"content":"International Monetary Fund. Côte divoire: Poverty reduction strategy paper. Tech. rep., 2009.","paperID":"None"},{"content":"Jung, W., and Wang, F. Gravity model in the Korean highway. Europhysics Letters 81 (2008).","paperID":"None"},{"content":"Kaluza, P., Kölzsch, A., Gastner, M. T., and Blasius, B. The complex network of global cargo ship movements. Journal of the Royal Society, Interface / the Royal Society 7, 48 (July 2010), 1093--103.","paperID":"None"},{"content":"Adam D.I. Kramer, An unobtrusive behavioral model of \"gross national happiness\", Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753369"},{"content":"Krings, G., Calabrese, F., Ratti, C., and Blondel, V. D. Urban gravity: a model for inter-city telecommunication flows. Journal of Statistical Mechanics: Theory and Experiment 2009, 07 (May 2009), L07003.","paperID":"None"},{"content":"Masucci, A. P., Serras, J., Johansson, A., and Batty, M. Gravity vs radiation model: on the importance of scale and heterogeneity in commuting flows.","paperID":"None"},{"content":"Noor, A. M., Alegana, V. a., Gething, P. W., Tatem, A. J., and Snow, R. W. Using remotely sensed night-time light as a proxy for poverty in Africa. Population health metrics 6 (Jan. 2008), 5.","paperID":"None"},{"content":"Abhinav Parate , Gerome Miklau, A framework for safely publishing communication traces, Proceedings of the 18th ACM conference on Information and knowledge management, November 02-06, 2009, Hong Kong, China","paperID":"1646147"},{"content":"Daniele Quercia , Jonathan Ellis , Licia Capra , Jon Crowcroft, Tracking \"gross community happiness\" from tweets, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145347"},{"content":"Quercia, D., Seaghdha, D. O., and Crowcroft, J. Talk of the City: Our Tweets, Our Community Happiness. In Proc. of AAAI ICWSM (2012).","paperID":"None"},{"content":"Sachs, J. D., and Warner, A. M. Source of Slow Growth in African Economies. Journal of African Economics 6, 3 (1997), 335--376.","paperID":"None"},{"content":"Simini, F., González, M. C., Maritan, A., and Barabási, A.-L. A universal model for mobility and migration patterns. Nature 484, 7392 (Apr. 2012), 96--100.","paperID":"None"},{"content":"Chris Smith , Daniele Quercia , Licia Capra, Finger on the pulse: identifying deprivation using transit flow analysis, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441852"},{"content":"Víctor Soto , Enrique Frías-Martínez, Automated land use identification using cell-phone records, Proceedings of the 3rd ACM international workshop on MobiArch, June 28-28, 2011, Bethesda, Maryland, USA","paperID":"2000179"},{"content":"Victor Soto , Vanessa Frias-Martinez , Jesus Virseda , Enrique Frias-Martinez, Prediction of socioeconomic levels using cell phone records, Proceedings of the 19th international conference on User modeling, adaption, and personalization, July 11-15, 2011, Girona, Spain","paperID":"2021893"},{"content":"Sutton, P., Roberts, D., Elvidge, C., and Baugh, K. Census from heaven: an estimate of the global human population using night-time satellite imagery. International Journal of Remote Sensing 22, 16 (2001), 3061--3076.","paperID":"None"},{"content":"Viboud, C., Bjørnstad, O. N., Smith, D. L., Simonsen, L., Miller, M. A., and Grenfell, B. T. Synchrony, waves, and spatial hierarchies in the spread of influenza. Science (New York, N.Y.) 312, 5772 (Apr. 2006), 447--51.","paperID":"None"},{"content":"Yan, X.-y., Zhao, C., Fan, Y., Di, Z., and Wang, W.-x. Universal Predictability of Mobility Patterns in Cities. 1--19.","paperID":"None"},{"content":"Zipf, G. The P 1 P 2/D hypothesis: On the intercity movement of persons. American Sociological Review 11, 6 (1946), 677--686.","paperID":"None"}],"abstract":"Governments and other organisations often rely on data collected by household surveys and censuses to identify areas in most need of regeneration and development projects. However, due to the high cost associated with the data collection process, many developing countries conduct such surveys very infrequently and include only a rather small sample of the population, thus failing to accurately capture the current socio-economic status of the country's population. In this paper, we address this problem by means of a methodology that relies on an alternative source of data from which to derive up to date poverty indicators, at a very fine level of spatio-temporal granularity. Taking two developing countries as examples, we show how to analyse the aggregated call detail records of mobile phone subscribers and extract features that are strongly correlated with poverty indexes currently derived from census data.","video":"http://www.youtube.com/embed/uDkCXSfTLAU?rel=0","title":"Poverty on the cheap: estimating poverty maps using aggregated mobile communication networks","filename":"CHI14/p511","authors":["Christopher Smith-Clarke","Afra Mashhadi","Licia Capra"],"conference":"CHI '14"}