{"paperId":2557379,"citation":[],"reference":[{"content":"Amar, R., Eagan, J., and Stasko, J. Low-level components of analytic activity in information visualization. TVCG (2005), 15.","paperID":"None"},{"content":"Anderson, J. R. Learning and memory, vol. 86. John Wiley New York, 2000.","paperID":"None"},{"content":"Natalia Andrienko , Gennady Andrienko, Exploratory Analysis of Spatial and Temporal Data: A Systematic Approach, Springer-Verlag New York, Inc., Secaucus, NJ, 2005","paperID":"1121625"},{"content":"Benjamin B. Bederson, Interfaces for staying in the flow, Ubiquity, v.2004 n.September, p.1-1","paperID":"1074069"},{"content":"Michael Bostock , Vadim Ogievetsky , Jeffrey Heer, D3 Data-Driven Documents, IEEE Transactions on Visualization and Computer Graphics, v.17 n.12, p.2301-2309, December 2011","paperID":"2068631"},{"content":"Consultancy, S. R. Academic ranking of world universities 2013. Shanghai: Center for World Class Universities and Institute of Higher Education of Shanghai Jiao Tong University 66 (2013), 2013--06.","paperID":"None"},{"content":"Elmqvist, N., Dragicevic, P., and Daniel Fekete, J. Rolling the dice: Multidimensional visual exploration using scatterplot matrix navigation visualization. TVCG (2008).","paperID":"None"},{"content":"Niklas Elmqvist , Nathalie Henry , Yann Riche , Jean-Daniel Fekete, Melange: space folding for multi-focus interaction, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357263"},{"content":"Samuel Gratzl , Alexander Lex , Nils Gehlenborg , Hanspeter Pfister , Marc Streit, LineUp: Visual Analysis of Multi-Attribute Rankings, IEEE Transactions on Visualization and Computer Graphics, v.19 n.12, p.2277-2286, December 2013","paperID":"2553739"},{"content":"Jeffrey Heer , George Robertson, Animated Transitions in Statistical Data Graphics, IEEE Transactions on Visualization and Computer Graphics, v.13 n.6, p.1240-1247, November 2007","paperID":"1313153"},{"content":"Donald L. Kreher , Douglas R. Stinson, Combinatorial algorithms: generation, enumeration, and search, ACM SIGACT News, v.30 n.1, p.33-35, March 1999","paperID":"309744"},{"content":"Sharon Lin , Julie Fortuna , Chinmay Kulkarni , Maureen Stone , Jeffrey Heer, Selecting semantically-resonant colors for data visualization, Proceedings of the 15th Eurographics Conference on Visualization, June 17-21, 2013, Leipzig, Germany","paperID":"2600590"},{"content":"Playfair, W. Playfair's commercial and political atlas and statistical breviary. Cambridge University Press, 2005.","paperID":"None"},{"content":"Alexander J. Quinn , Benjamin B. Bederson, Human computation: a survey and taxonomy of a growing field, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979148"},{"content":"Ramana Rao , Stuart K. Card, The table lens: merging graphical and symbolic representations in an interactive focus + context visualization for tabular information, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.318-322, April 24-28, 1994, Boston, Massachusetts, USA","paperID":"191776"},{"content":"Jinwook Seo , Ben Shneiderman, A rank-by-feature framework for interactive exploration of multidimensional data, Information Visualization, v.4 n.2, p.96-113, July 2005","paperID":"1103524"},{"content":"Shi, C., Cui, W., Liu, S., Xu, P., Chen, W., and Qu, H. Rankexplorer: Visualization of ranking changes in large time series data. TVCG 18, 12 (2012), 2669--2678.","paperID":"None"},{"content":"Shneiderman, B. 1.1 direct manipulation: a step beyond programming languages. Sparks of Innovation in Human-Computer Interaction (1993), 17.","paperID":"None"},{"content":"Ben Shneiderman, Dynamic Queries for Visual Information Seeking, IEEE Software, v.11 n.6, p.70-77, November 1994","paperID":"625405"},{"content":"Sopan, A., Freire, M., Plaisant, C., Golbeck, J., and Shneiderman, B. Distribution column overviews in tabular visualizations. Tech. rep., HCIL, 2010.","paperID":"None"},{"content":"Tufte, E. R., and Graves-Morris, P. The visual display of quantitative information, vol. 2. Graphics press Cheshire, CT, 1983.","paperID":"None"},{"content":"Victor, B. Tangle: a javascript library for reactive documents, 2013. http://worrydream.com/Tangle/.","paperID":"None"},{"content":"Wikipedia. Pivot table, 2013. http://en.wikipedia.org/wiki/Pivot_table.","paperID":"None"}],"abstract":"This article introduces A Table!, an enhanced soccer ranking table providing temporal navigation by combining two novel interaction techniques. Ranking tables order soccer teams represented as rows, according to values of columns containing attributes e.g., accumulated points, or number of scored goals. Because they represent a snapshot of a championship at a time t, tables are regularly updated with new results. Such updates usually change the rows order, which makes the tracking of a specified team over time difficult. We observed that the tables available on the web do not support tracking such changes very well, are generally hard to read, and lack interactions. This contrasts with the extensive use of comments on temporal trends found in soccer analysts articles. To better support such analyzes, the two interactive techniques presented allow exploration of time, and are designed to preserve users' flow: DRAG-CELL is based on direct manipulation of values to browse ranks; VIZ-RANK uses a transient line chart of team ranks to visually explore a championship. An on-line evaluation with 143 participants shows that each technique efficiently supports a set of important temporal tasks not supported by current ranking tables. This paves the way for introducing efficient advanced visual exploration techniques to millions of soccer enthusiasts who use tables everyday.","video":"http://www.youtube.com/embed/1n8zSVizhnU?rel=0","title":"A table!: improving temporal navigation in soccer ranking tables","filename":"CHI14/p887","authors":["Charles Perin","Romain Vuillemot","Jean-Daniel Fekete"],"conference":"CHI '14"}