{"paperId":2557370,"citation":[{"content":"Alexander Meschtscherjakov , Rabindra Ratan , Manfred Tscheligi , Roderick McCall , Dalila Szostak , Ioannis Politis , Sven Krome, 2nd Workshop on User Experience of Autonomous Driving, Adjunct Proceedings of the 6th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, September 17-19, 2014, Seattle, WA, USA","paperID":"2667425"},{"content":"Alexander Meschtscherjakov , Manfred Tscheligi , Dalila Szostak , Rabindra Ratan , Roderick McCall , Ioannis Politis , Sven Krome, Experiencing Autonomous Vehicles: Crossing the Boundaries between a Drive and a Ride, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702661"}],"reference":[{"content":"Brookhuis, K. A., van Driel, C. J., Hof, T., van Arem, B., & Hoedemaeker, M. Driving with a congestion assistant: mental workload and acceptance. Applied Ergonomics, 40,6 (2009), 1019--1025.","paperID":"None"},{"content":"Cottrell, N.D., and Barton, B.K. The role of automation in reducing stress and negative affect while driving. Theoretical Issues in Ergonomics Science 14, 1 (2013), 53--68.","paperID":"None"},{"content":"Graham, R., & Carter, C. Comparison of speech input and manual control of in-car devices while on the move. Personal Technologies, 4, 2--3 (2000), 155--164.","paperID":"None"},{"content":"Endsley, M. Toward a theory of situation awareness in dynamic systems. Human Factors, 37, 1 (1995), 32--64.","paperID":"None"},{"content":"Jensen, R. S. The boundaries of aviation psychology, human factors, aeronautical decision making, situation awareness, and crew resource management. The International Journal of Aviation Psychology, 7, 4 (1997), 259--267.","paperID":"None"},{"content":"Parasuraman, R. Designing automation for human use: Empirical studies and quantitative models. Ergonomics, 43, 7(2000). 931--951.","paperID":"None"},{"content":"Albrecht Schmidt , Anind K. Dey , Andrew L. Kun , Wolfgang Spiessl, Automotive user interfaces: human computer interaction in the car, CHI '10 Extended Abstracts on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753949"},{"content":"Sklar, A.E., and Sarter, N.B. Good vibrations: Tactile feedback in support of attention allocation and humanautomation coordination in event-driven domains. Human Factors: The Journal of the Human Factors and Ergonomics Society, 41, 4 (1999), 543--552.","paperID":"None"},{"content":"Stanton, N.A., and Marsden, P. From fly-by-wire to drive-by-wire: Safety implications of automation in vehicles. Safety Science, 24, 1 (1996), 35--49.","paperID":"None"},{"content":"Stanton, N. A., Young, M. S., Walker, G. H., Turner, H., and Randle, S. Automating the driver's control tasks. International Journal of Cognitive Ergonomics, 5, 3 (2001), 221--236.","paperID":"None"},{"content":"Wickens, C.D. Engineering Psychology and Human Performance. Columbus, OH: Merrill, 1992.","paperID":"None"},{"content":"Young, M.S., and Stanton, N.A. What's skill got to do with it? : Vehicle automation and driver mental workload. Ergonomics, 50, 8 (2007), 1324--1339.","paperID":"None"}],"abstract":"The current study (N = 49) took a user-centered approach to explore how level of automation (pedal automated, wheel automated or fully automated driving) and the interface modality (switching automation on or off via touch or voice control) in automated vehicles influence drivers' perceived experience and performance. The results found that full or wheel automation in vehicles was perceived significantly more intelligent than pedal automation. Furthermore, drivers in the pedal automation condition reported greater nervousness when using the touch interface than the voice interface. This tendency was not found among drivers in the full and wheel automation conditions. Drivers who used the voice interface to control automated driving had fewer driving mistakes than those who operated the touch interface. Our findings have important psychological and practical implications for designing a user interface for automated vehicles.","video":"http://www.youtube.com/embed/As0VKI6kq9U?rel=0","title":"Partially intelligent automobiles and driving experience at the moment of system transition","filename":"CHI14/p3631","authors":["Key Jung Lee","Yeon Kyoung Joo","Clifford Nass"],"conference":"CHI '14"}