{"paperId":2557283,"citation":[{"content":"Vanessa Vuibert , Wolfgang Stuerzlinger , Jeremy R. Cooperstock, Evaluation of Docking Task Performance Using Mid-air Interaction Techniques, Proceedings of the 3rd ACM Symposium on Spatial User Interaction, August 08-09, 2015, Los Angeles, California, USA","paperID":"2788950"}],"reference":[{"content":"Banks, M. S., Read, J. C. A., Allison, R. S., and Watt, S. J. Stereoscopy and the Human Visual System. SMPTE Motion Imaging Journal 121, 4 (June 2012), 24--43.","paperID":"None"},{"content":"Brockmyer, J. H., Fox, C. M., Curtiss, K. A., McBroom, E., Burkhart, K. M., and Pidruzny, J. N. The development of the game engagement questionnaire: A measure of engagement in video game-playing. Journal of Experimental Social Psychology 45, 4 (2009), 624--634.","paperID":"None"},{"content":"Brooke, J. SUS: A quick and dirty usability scale. In Usability evaluation in industry, P. W. Jordan, B. Weerdmeester, A. Thomas, and I. L. Mclelland, Eds. Taylor and Francis, London, 1996.","paperID":"None"},{"content":"Emmerich, K. Helping Friends or Fighting Foes The Influence of Collaboration and Competition on Player Experience in Digital Games. Master's thesis, University of Duisburg-Essen, 2012.","paperID":"None"},{"content":"Howarth, P. Potential hazards of viewing 3-D stereoscopic television, cinema and computer games: a review. Ophthalmic & physiological optics: the journal of the British College of Ophthalmic Opticians (Optometrists) 31, 2 (Mar. 2011), 111--22.","paperID":"None"},{"content":"Kennedy, R., Lane, N., and Berbaum, K. Simulator Sickness Questionnaire: An enhanced method for quantifying simulator sickness. The International Journal of Aviation Psychology 3, 3 (1993), 203--220.","paperID":"None"},{"content":"Arun Kulshreshth , Jonas Schild , Joseph J. LaViola, Jr., Evaluating user performance in 3D stereo and motion enabled video games, Proceedings of the International Conference on the Foundations of Digital Games, May 29-June 01, 2012, Raleigh, North Carolina","paperID":"2282350"},{"content":"Joseph J. LaViola, Jr. , Tad Litwiller, Evaluating the benefits of 3d stereo in modern video games, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979286"},{"content":"Noel Mahoney , Andreas Oikonomou , David Wilson, Stereoscopic 3D in video games: A review of current design practices and challenges, Proceedings of the 2011 16th International Conference on Computer Games, p.148-155, July 27-30, 2011","paperID":"2192230"},{"content":"Nacke, L., Schild, J., and Niesenhaus, J. Gameplay experience testing with playability and usability surveys: An experimental pilot study. In Playability and Player Experience: Proceedings of the Fun and Games 2010 Workshop, K. Calvi, L.; Gualeni, S.; Nuijten, K.; Nacke, L.; Poels, Ed., Breda: NHTV Expertise Series (2010), 31--45.","paperID":"None"},{"content":"Nacke, L. E. Affective Ludology: Scientific Measurement of User Experience in Interactive Entertainment. PhD thesis, Blekinge Institute of Technology, 2009.","paperID":"None"},{"content":"Rajae-Joordens, R. J. Measuring experiences in gaming and tv applications. In Probing Experience, J. Westerink, M. Ouwerkerk, T. Overbeek, W. Pasveer, and B. Ruyter, Eds., vol. 8 of Philips Research. Springer Netherlands, 2008, 77--90.","paperID":"None"},{"content":"Rivett, J., and Holliman, N. S. Stereoscopic game design and evaluation. In IS&T/SPIE Electronic Imaging, N. S. Holliman and G. E. Favalora, Eds. (Mar. 2013), 864813--864813-13.","paperID":"None"},{"content":"Jeff Sauro , James R. Lewis, Quantifying the User Experience: Practical Statistics for User Research, Morgan Kaufmann Publishers Inc., San Francisco, CA, 2012","paperID":"2222513"},{"content":"Jonas Schild , Liane Bölicke , Joseph J. LaViola Jr. , Maic Masuch, Creating and analyzing stereoscopic 3D graphical user interfaces in digital games, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470678"},{"content":"Jonas Schild , Joseph LaViola , Maic Masuch, Understanding user experience in stereoscopic 3D games, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207690"},{"content":"Jonas Schild , Maic Masuch, Fundamentals of stereoscopic 3d game design, Proceedings of the 10th international conference on Entertainment Computing, October 05-08, 2011, Vancouver, Canada","paperID":"2176605"},{"content":"Schild, J., Seele, S., and Masuch, M. YouDash3D: Exploring Stereoscopic 3D Gaming for 3D Movie Theaters. In Proceedings of SPIE Vol. 8288: Stereoscopic displays and applications XXIII (2012), SPIE (2012).","paperID":"None"},{"content":"Shibata, T., Kim, J., Hoffman, D. M., and Banks, M. S. The zone of comfort: Predicting visual discomfort with stereo displays. Journal of vision 11, 8 (Jan. 2011), 1--29.","paperID":"None"},{"content":"Takatalo, J., Kawai, T., Kaistinen, J., Nyman, G., and Häkkinen, J. User Experience in 3D Stereoscopic Games. Media Psychology 14, 4 (Nov. 2011), 387--414.","paperID":"None"},{"content":"Vorderer, P., Wirth, W., Gouveia, F. R., Biocca, F., Saari, T., Jäncke, F., Böcking, S., Schramm, H., Gysbers, A., Hartmann, T., Klimmt, C., Laarni, J., Ravaja, N., Sacau, A., Baumgartner, T., and Jäncke, P. MEC spatial presence questionnaire (MEC-SPQ). Report to the European Community, Project Presence: MEC (IST-2001-37661) (2004).","paperID":"None"},{"content":"Colin Ware , Peter Mitchell, Reevaluating stereo and motion cues for visualizing graphs in three dimensions, Proceedings of the 2nd symposium on Applied perception in graphics and visualization, August 26-28, 2005, A Coroña, Spain","paperID":"1080411"},{"content":"Zerebecki, C., Stanfield, B., Hogue, A., Kapralos, B., and Collins, K. S3D depth-axis interaction for video games: performance and engagement. In IS&T/SPIE Electronic Imaging, N. S. Holliman and G. E. Favalora, Eds. (Mar. 2013), 86481B--86481B-8.","paperID":"None"}],"abstract":"We explore the potential of stereoscopic 3D (S3D) vision in offering distinct gameplay using an S3D-specific game called Deepress3D. Our game utilizes established S3D design principles for optimizing GUI design, visual comfort and game mechanics which rely on depth perception in time-pressured spatial conflicts. The game collects detailed S3D player metrics and allows players to choose between different, evenly matched strategies. We conducted a between subjects study comparing S3D and monoscopic versions of Deepress3D that examined player behavior and performance and measured user-reported data on presence, simulator sickness, and game experience. Confirming previous results, stereo users reported higher spatial presence. More importantly, for the first time, our game metrics indicate that S3D vision can measurably change player behavior depending on actual game content and level design, without necessarily affecting performance or emotional experience. These findings indicate the potential for optimizing applications for stereo users distinguishing them as a distinct group in HCI research.","video":"http://www.youtube.com/embed/T2xAhFRMeAo?rel=0","title":"Altering gameplay behavior using stereoscopic 3D vision-based video game design","filename":"CHI14/p207","authors":["Jonas Schild","Joseph J. LaViola, Jr.","Maic Masuch"],"conference":"CHI '14"}