{"paperId":2557328,"citation":[{"content":"Kibum Kim , Xiangshi Ren , Seungmoon Choi , Hong Z. Tan, Assisting people with visual impairments in aiming at a target on a large wall-mounted display, International Journal of Human-Computer Studies, v.86 n.C, p.109-120, February 2016","paperID":"2870210"}],"reference":[{"content":"KNFB reading technology. http://www.knfbreader.com.","paperID":"None"},{"content":"Sight On Call. Blindsight, Inc. http://blindsight.com/ sight-on-call-tm.","paperID":"None"},{"content":"Text Detective. http://blindsight.com/textdetective.","paperID":"None"},{"content":"Homayoun Bagherinia , Roberto Manduchi, Robust real-time detection of multi-color markers on a cell phone, Journal of Real-Time Image Processing, v.8 n.2, p.207-223, June      2013","paperID":"2501973"},{"content":"J. Bigham, et al. Vizwiz::LocateIt -- Enabling blind people to locate objects in their environment. In Proc. CVAVI'10.","paperID":"None"},{"content":"Jeffrey P. Bigham , Chandrika Jayant , Hanjie Ji , Greg Little , Andrew Miller , Robert C. Miller , Robin Miller , Aubrey Tatarowicz , Brandyn White , Samual White , Tom Yeh, VizWiz: nearly real-time answers to visual questions, Proceedings of the 23nd annual ACM symposium on User interface software and technology, October 03-06, 2010, New York, New York, USA","paperID":"1866080"},{"content":"J. Coughlan and R. Manduchi. Functional assessment of a camera phone-based wayfinding system operated by blind and visually impaired users. International Journal on Artificial Intelligence Tools 18.03 (2009): 379--397.","paperID":"None"},{"content":"W. Crandall and J. Marston. Development, evaluation, and lessons learned: A case study of Talking Signs remote infrared audible signage. In R. Manduchi and S. Kurniawan, editors, Assistive Technology for Blindness and Low Vision. CRC Press, 2013.","paperID":"None"},{"content":"R. Golledge, J. Marston, J. Loomis, and R. Klatzky. Stated preferences for components of a personal guidance system for nonvisual navigation. Journal of Visual Impairment and Blindness, pages 135--47, 1998.","paperID":"None"},{"content":"Chandrika Jayant , Hanjie Ji , Samuel White , Jeffrey P. Bigham, Supporting blind photography, The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility, October 24-26, 2011, Dundee, Scotland, UK","paperID":"2049573"},{"content":"A. Kutiyanawala, V. Kulyukin, and J. Nicholson. Teleassistance in accessible shopping for the blind. In Proc. ICOMP'11, 2011.","paperID":"None"},{"content":"Charlotte Magnusson , Kirsten Rassmus-Gröhn , Delphine Szymczak, The influence of angle size in navigation applications using pointing gestures, Proceedings of the 5th international conference on Haptic and audio interaction design, September 16-17, 2010, Copenhagen, Denmark","paperID":"1887999"},{"content":"Roberto Manduchi, Mobile vision as assistive technology for the blind: an experimental study, Proceedings of the 13th international conference on Computers Helping People with Special Needs, July 11-13, 2012, Linz, Austria","paperID":"2363959"},{"content":"R. Manduchi and S. Kurniawan, eds. Assistive technology for blindness and low vision. CRC Press, 2013.","paperID":"None"},{"content":"James R. Marston , Jack M. Loomis , Roberta L. Klatzky , Reginald G. Golledge , Ethan L. Smith, Evaluation of spatial displays for navigation without sight, ACM Transactions on Applied Perception (TAP), v.3 n.2, p.110-124, April 06","paperID":"1141900"},{"content":"K. O. McGraw, S. P., Wong. Forming inferences about some intraclass correlation coefficients. Psychological Methods, Vol. 1, No. 1, pp. 30--46, 1996","paperID":"None"},{"content":"Ender Tekin , James M. Coughlan, A mobile phone application enabling visually impaired users to find and read product barcodes, Proceedings of the 12th international conference on Computers helping people with special needs, July 14-16, 2010, Vienna, Austria","paperID":"1880800"},{"content":"Marynel Vázquez , Aaron Steinfeld, Helping visually impaired users properly aim a camera, Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility, October 22-24, 2012, Boulder, Colorado, USA","paperID":"2384934"}],"abstract":"Smartphone apps can use object recognition software to provide information to blind or low vision users about objects in the visual environment. A crucial challenge for these users is aiming the camera properly to take a well-framed picture of the desired target object. We investigate the effects of two fundamental constraints of object recognition -- frame rate and camera field of view -- on a blind person's ability to use an object recognition smartphone app. The app was used by 18 blind participants to find visual targets beyond arm's reach and approach them to within 30 cm. While we expected that a faster frame rate or wider camera field of view should always improve search performance, our experimental results show that in many cases increasing the field of view does not help, and may even hurt, performance. These results have important implications for the design of object recognition systems for blind users.","video":"http://www.youtube.com/embed/iZHXs9P44zM?rel=0","title":"The last meter: blind visual guidance to a target","filename":"CHI14/p3113","authors":["Roberto Manduchi","James M. Coughlan"],"conference":"CHI '14"}