{"paperId":2557390,"citation":[],"reference":[{"content":"Abt, C. (1970). Serious Games. New York: The Viking Press.","paperID":"None"},{"content":"Alkan, S., & Cagiltay, K. (2007). Studying computer game learning experience through eye tracking. British Journal of Educational Technology, 38(3), 538--542.","paperID":"None"},{"content":"Amory, A. (2006). Game object model version II: a theoretical framework for educational game development. Educational Technology Research and Development, 54, 1--27.","paperID":"None"},{"content":"Barab, S., Sadler, T., Heiselt, C., Hickey, D., & Zuiker, S. (2007). Relating narrative, inquiry, and inscriptions: Supporting consequential play. Journal of Science Education & Technology, 16(1), 59--82.","paperID":"None"},{"content":"Barker, J., Brinkman, L., & Deardorff, M. (1995). Computer intervention for adolescent children of divorce. Journal of Divorce & Remarriage, 23(3), 197--213.","paperID":"None"},{"content":"Bartholomew, L.K., Gold, R.S., Parcel, G.S., Czyzewski, D.I., Sockrider, M.M., Fernandez, M. et al. (2000). Watch, discover, think, and act: Evaluation of computerassisted instruction to improve asthma self-management in inner-city children. Patient Education and Counseling, 39(2--3), 269--280.","paperID":"None"},{"content":"Ian Bogost, Persuasive Games: The Expressive Power of Videogames, The MIT Press, 2007","paperID":"1214315"},{"content":"Bryk, A.S., & Raudenbush, S.W. (1992). Hierarchical Linear Models in Social and Behavioral Research: Applications and Data Analysis Methods (First Edition). Newbury Park, CA: Sage Publications.","paperID":"None"},{"content":"Cahill, J.M. (1994). Health works: Interactive AIDS education videogames. Computers in Human Services, 11(1), 159--176.","paperID":"None"},{"content":"Campbell, D. T., Stanley, J. C., & Gage, N. L. (1963). Experimental and quasi-experimental designs for research. Boston: Houghton Mifflin.","paperID":"None"},{"content":"Clarren, R. (2006). Virtually dead in Iraq. Salon, September 16, 2006. Retrieved October 12, 2011 from www.salon.com/ent/feature/2006/09/16/americasarmy/","paperID":"None"},{"content":"Cooper, L. (1932). The Rhetoric of Aristotle. EnglewoodCliffs, NJ: Prentice-Hall.","paperID":"None"},{"content":"Csikszentmihalyi, M. (1990). Flow:The psychology of optimal experience. New York: Harper & Row.","paperID":"None"},{"content":"Michael A. Evans, Procedural Ethos: Confirming the Persuasive in Serious Games, International Journal of Gaming and Computer-Mediated Simulations, v.3 n.4, p.70-80, October 2011","paperID":"2439395"},{"content":"Frasca, G. (2001). Videogames of the Oppressed: Videogames as a means for critical thinking and debate. Georgia Institute of Technology, Atlanta, GA.","paperID":"None"},{"content":"44.Foster, A. N., & Mishra, P. (2009). Games, claims, genres & learning. In R. E. Ferdig (Ed.), Handbook of Research on Effective Electronic Gaming in Education: Information Science Reference.","paperID":"None"},{"content":"Gee, J.P. (2007). Good video games + good learning: Collected essays on video games, learning and literacy. New York: Peter Lang","paperID":"None"},{"content":"Goldsworthy, R.C., Barab, S.A., & Goldsworthy, E.L. (2000). The STAR project: Enhancing adolescents' social understanding through video- based, multimedia scenarios. Journal of Special Education Technology,15(2), 13--26.","paperID":"None"},{"content":"Huizinga, J. (1955). Nature and significance of paly as a cultural phenomenon. In K. Salen, & E. Zimmerman (Eds), The game design reader: A rules of play anthology (p. 96--120). Cambridge: MIT Press","paperID":"None"},{"content":"Johnson, B., & Christensen, L. B. (2012). Educational research: Quantitative, qualitative, and mixed approaches. Thousand Oaks, Calif: SAGE Publications.","paperID":"None"},{"content":"Megumi Kashibuchi , Akira Sakamoto, The educational effectiveness of a simulation/game in sex education, Simulation and Gaming, v.32 n.3, p.331-343, September 2001","paperID":"507767"},{"content":"Kearney, P. & McCrosky, J. (1980). Relationships among teacher communication style, trait and state communication apprehension, and teacher effectiveness. In D. Nimmo (Ed.), Communication Yearbook 4 (pp.533--551). New Brunswick, NJ: Transaction Books.","paperID":"None"},{"content":"Khaled, R. (2007). Culturally-Relevant Persuasive Technology. Victoria University of Wellington, Wellington, NZ.","paperID":"None"},{"content":"Lavender, T. (2011) \"Video Games as Change Agents -The Case of Homeless: It's No Game,\" The McMaster Journal of Communication: Vol. 7: Iss. 1, Article 2.","paperID":"None"},{"content":"Lenhart, A., Kahne, J., Middaugh, E., Macgill, A. R., Evans, C., & Vitak, J. (2008). Teens, video games, and civics. Pew Internet & American Life Project, September, 16.","paperID":"None"},{"content":"Lepore, J. (2007). The Meaning of Life. New Yorker, 83(13), 38--43","paperID":"None"},{"content":"Lieberman, D. A. (2001). Management of chronic pediatric diseases with interactive health games: Theory and research findings. The Journal of Ambulatory Care Management, 24(1), 26--38.","paperID":"None"},{"content":"McCrosky, J. (1992). An introduction to communication in the classroom. Edina, MN: Burgess International Group, Inc.","paperID":"None"},{"content":"Mishra, P., & Foster, A. (2007). The claims of games: A comprehensive review and directions for future research. In C. Crawford, D. A. Willis, R. Carlsen, I. Gibson, K. McFerrin, J. Price & R. Weber (Eds.), SITE'18 (Vol. 2007, pp. 2227--2232). Association for the Advancement of Computing in Education (AACE).","paperID":"None"},{"content":"Janet Horowitz Murray, Hamlet on the Holodeck: The Future of Narrative in Cyberspace, The Free Press, New York, NY, 1997","paperID":"572887"},{"content":"National Law Center on Homelessness and Poverty, 'Annual Report', Washington D.C., March 5, 2011","paperID":"None"},{"content":"Ochalla, B. (2007). Who Says Video Games Have to be Fun? The Rise of Serious Games. Retrieved November 3, 2011 from www.gamasutra.com/view/feature/","paperID":"None"},{"content":"O'Keefe, D. J. (2002). Persuasion: Theory and Research. Thousand Oaks, California: Sage Publications, Inc.","paperID":"None"},{"content":"Okolo, C.M., & Others, A. (1990). Learning disabled students' acquisition of keyboarding skills and continuing motivation under drill-and-practice and game conditions. Learning Disabilities Research, 5(2), 100--109.","paperID":"None"},{"content":"Okolo, C.M. (1992). The effect of computer-assisted instruction format and initial attitude on the arithmetic facts proficiency and continuing motivation of students with learning disabilities. Exceptionality: A Research Journal, 3(4), 195--211.","paperID":"None"},{"content":"Padgett, L.S., Strickland, D., & Coles, C.D. (2006).Case study: Using a virtual reality computer game to teach fire safety skills to children diagnosed with fetal alcohol syndrome. Journal of Pediatric Psychology,31(1), 65--70.","paperID":"None"},{"content":"Paperny, D.M., & Starn, J.R. (1989). Adolescent pregnancy prevention by health education computer games: Computer-assisted instruction of knowledge and attitudes. Pediatrics, 83(5), 742.","paperID":"None"},{"content":"Plax, T., Kearney, P., McCrosky, J., & Richmond, V. (1986). Power in the classroom: VI. Verbal control strategies, nonverbal immediacy and affective learning. Communication Education, 35, 43--55.","paperID":"None"},{"content":"Clark N. Quinn , Marcia L. Conner, Engaging Learning: Designing e-Learning Simulation Games (Pfeiffer Essential Resources for Training and HR Professionals (Hardcover)), Pfeiffer & Company, 2005","paperID":"1196951"},{"content":"Dana Ruggiero, Persuasive Games as Social Action Agents: Challenges and Implications in Learning and Society, International Journal of Gaming and Computer-Mediated Simulations, v.5 n.4, p.75-85, October 2013","paperID":"2603974"},{"content":"Scott, M. & Wheeless, L. (1975). Communication apprehension, student attitudes, and levels of satisfaction. Western Journal of Speech Communication, 41. 188--198.","paperID":"None"},{"content":"Thomas, R., & Cahill, J. (1997). Using an interactive computer game to increase skill and self-efficacy regarding safer gender. Health Education & Behavior,24(1), 71--86.","paperID":"None"},{"content":"Tiwari, N., \"Cow slaughtering with Ronald McDonald\", July 5, 2006, Retrieved from CNET News on February5, 2012.","paperID":"None"},{"content":"Tuzun, H. (2007). Blending video games with learning: Issues and challenges with classroom implementations in the Turkish context. British Journal of Educational Technology, 38(3), 465--477.","paperID":"None"},{"content":"Van Eck, R. (2006). The effect of contextual pedagogical advisement and competition on middle- school students' attitude toward mathematics and mathematics instruction using a computer-based simulation game. Journal of Computers in Mathematics & Science Teaching, 25(2), 165--195.","paperID":"None"},{"content":"Yee, N. & Bailenson, J. N. (2006). Walk A Mile in Digital Shoes: The Impact of Embodied Perspective- Taking on The Reduction of Negative Stereotyping in Immersive Virtual Environments. PRESENCE 2006.","paperID":"None"}],"abstract":"To investigate whether a persuasive game may serve as a way to increase affective learning about homelessness, this study examined the effects of procedural rhetoric and ethos in a video game designed to put the player in the shoes of an almost-homeless person. Data were collected from 5139 students across four states. Examination revealed that playing the game or doing the reading significantly increased the affective learning score after treatment with the game group scoring 1.57 points higher and the reading group scoring .66 points higher out of a score of 6. Findings indicate that students who played Spent sustained significantly higher scores after three weeks. Overall, findings suggest that when students play a video game that is designed using persuasive mechanics an affective change can be measured empirically.","video":"http://www.youtube.com/embed/5cDwiv7Zdjs?rel=0","title":"Spent: changing students' affective learning toward homelessness through persuasive video game play","filename":"CHI14/p3423","authors":["Dana N. Ruggiero"],"conference":"CHI '14"}