{"paperId":2557278,"citation":[{"content":"Sinziana Mazilu , Gerhard Tröster, Wearable technologies: One step closer to gait rehabilitation in Parkinson's patients, XRDS: Crossroads, The ACM Magazine for Students, v.21 n.2, Winter 2014","paperID":"2676578"},{"content":"Paul Worgan , Lindsay Clare , Plamen Proynov , Bernard H. Stark , David Coyle, Inductive power transfer for on-body sensors: defining a design space for safe, wirelessly powered on-body health sensors, Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare, p.177-184, May 20-23, 2015, Istanbul, Turkey","paperID":"2826191"},{"content":"Roisin McNaney , Madeline Balaam , Amey Holden , Guy Schofield , Daniel Jackson , Mary Webster , Brook Galna , Gillian Barry , Lynn Rochester , Patrick Olivier, Designing for and with People with Parkinson's: A Focus on Exergaming, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702310"},{"content":"Sinziana Mazilu , Ulf Blanke , Moran Dorfman , Eran Gazit , Anat Mirelman , Jeffrey M. Hausdorff , Gerhard Tröster, A Wearable Assistant for Gait Training for Parkinson’s Disease with Freezing of Gait in Out-of-the-Lab Environments, ACM Transactions on Interactive Intelligent Systems (TiiS), v.5 n.1, p.1-31, March 2015","paperID":"2701431"},{"content":"Franz Gravenhorst , Amir Muaremi , Jakob Bardram , Agnes Grünerbl , Oscar Mayora , Gabriel Wurzer , Mads Frost , Venet Osmani , Bert Arnrich , Paul Lukowicz , Gerhard Tröster, Mobile phones as medical devices in mental disorder treatment: an overview, Personal and Ubiquitous Computing, v.19 n.2, p.335-353, February  2015","paperID":"2727086"}],"reference":[{"content":"Gazihan Alankus , Amanda Lazar , Matt May , Caitlin Kelleher, Towards customizable games for stroke rehabilitation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753649"},{"content":"Hande Alemdar , Cem Ersoy, Wireless sensor networks for healthcare: A survey, Computer Networks: The International Journal of Computer and Telecommunications Networking, v.54 n.15, p.2688-2710, October, 2010","paperID":"1862549"},{"content":"N. Allen, C. Canning, C. Sherrington, et al. The effects of an exercise program on fall risk factors in people with pd: a randomized controlled trial. Mov Disord, 25:1217'1225, 2010.","paperID":"None"},{"content":"Marc Bächlin , Meir Plotnik , Daniel Roggen , Inbal Maidan , Jeffrey M. Hausdorff , Nir Giladi , Gerhard Tröster, Wearable assistant for Parkinson's disease patients with the freezing of gait symptom, IEEE Transactions on Information Technology in Biomedicine, v.14 n.2, p.436-446, March 2010","paperID":"1892512"},{"content":"J. Bergmann and A. McGregor. Body-worn sensor design: What do patients and clinicians want' Annals of Biomed Eng, 39:2299'2312, 2011.","paperID":"None"},{"content":"B. R. Bloem, J. M. Hausdorff, J. Visser, and N. Giladi. Falls and freezing of gait in Parkinson's disease: A review of two interconnected, episodic phenomena. Mov. Disord., 19:871'884, 2004.","paperID":"None"},{"content":"Susanne Bødker , Jacob Buur, The design collaboratorium: a place for usability design, ACM Transactions on Computer-Human Interaction (TOCHI), v.9 n.2, p.152-169, June 2002","paperID":"513670"},{"content":"L. Demers, R. Weiss-Lambrou, and B. Ska. Development of the Quebec User Evaluation of satisfaction with Assistive Technology (QUEST). Assist Technol, 8:3'13, 1996.","paperID":"None"},{"content":"S. Donovan, C. Lim, N. Diaz, et al. Laserlight cues for gait freezing in Parkinson's disease: an open-label study. Parkinsonism Relat Disord, 17:240'245, 2011.","paperID":"None"},{"content":"A. Espay, Y. Baram, A. Dwivedi, et al. At-home training with closed-loop augmented-reality cueing device for improving gait in patients with Parkinson disease. J Rehabil Res Dev, 47:573'581, 2010.","paperID":"None"},{"content":"R. Fensli and E. Boisen. Human factors affecting the patients acceptance of wireless biomedical sensors. In Biomed Eng Syst and Tech, pages 402'412. 2009.","paperID":"None"},{"content":"G. Frazzitta, G. Bertotti, D. Uccellini, and R. Maestri. Parkinson's disease rehabilitation: a pilot study with 1 year follow up. Mov Disord, 25:1762'1763, 2010.","paperID":"None"},{"content":"M. Hely, W. Reid, M. Adena, et al. The Sydney multicenter study of Parkinson's disease: the inevitability of dementia at 20 years. Mov Disord, 23, 2008.","paperID":"None"},{"content":"F. Horak and M. Mancini. Objective biomarkers of balance and gait for parkinson's disease using body-worn sensors. Mov Disord., 28:1544'51, 2013.","paperID":"None"},{"content":"E. Jovanov, E. Wang, L. Verhagen, M. Fredrickson, and R. Fratangelo. deFOG: A real time system for detection and unfreezing of gait of Parkinson's patients. In Proc IEEE Eng Med Biol Soc, pages 5151'4, 2009.","paperID":"None"},{"content":"Predrag Klasnja , Sunny Consolvo , Wanda Pratt, How to evaluate technologies for health behavior change in HCI research, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979396"},{"content":"A. Schwirtz, The Comfort Assessment of Wearable Computers, Proceedings of the 6th IEEE International Symposium on Wearable Computers, p.65, October 07-10, 2002","paperID":"881090"},{"content":"B. Lange, S. Flynn, R. Proffitt, et al. Development of an interactive game-based rehabilitation tool for dynamic balance training. Topics Stroke Rehab, 17:345'52, 2010.","paperID":"None"},{"content":"Sinziana Mazilu , Ulf Blanke , Daniel Roggen , Gerhard Tröster , Eran Gazit , Jeffrey M. Hausdorff, Engineers meet clinicians: augmenting Parkinson's disease patients to gather information for gait rehabilitation, Proceedings of the 4th Augmented Human International Conference, p.124-127, March 07-08, 2013, Stuttgart, Germany","paperID":"2459257"},{"content":"S. Mazilu, M. Hardegger, Z. Zhu, et al. Online Detection of Freezing of Gait with Smartphones and Machine Learning Techniques. In Proc PervasiveHealth, pages 123'30, 2012.","paperID":"None"},{"content":"Aleksandar Milenković , Chris Otto , Emil Jovanov, Wireless sensor networks for personal health monitoring: Issues and an implementation, Computer Communications, v.29 n.13-14, p.2521-2533, August, 2006","paperID":"1646733"},{"content":"O. Moore, C. Peretz, and N. Giladi. Freezing of gait affects quality of life of peoples with Parkinson's disease beyond its relationships with mobility and gait. Mov Disord, 22:2192'2195, 2007.","paperID":"None"},{"content":"S. Moore, H. MacDougall, and W. Ondo. Ambulatory monitoring of freezing of gait in Parkinson's disease. J Neurosci Methods, 167:340'348, 2008.","paperID":"None"},{"content":"W. Muangpaisan, A. Mathews, H. Hori, and D. Seidel. A systematic review of the worldwide prevalence and incidence of parkinson's disease. J Med Assoc Thai, 94:749'755, 2011.","paperID":"None"},{"content":"A. Nieuwboer. Cueing for Freezing of Gait in patients with Parkinson's disease: A rehabilitation perspective. Mov Disord, 23:475'81, 2008.","paperID":"None"},{"content":"J. Nutt, B. Bloem, N. Giladi, et al. Freezing of gait: moving forward on a mysterious clinical phenomenon. Lancet Neurol, 10:734'744, 2011.","paperID":"None"},{"content":"Alexandros Pantelopoulos , Nikolaos G. Bourbakis, A survey on wearable sensor-based systems for health monitoring and prognosis, IEEE Transactions on Systems, Man, and Cybernetics, Part C: Applications and Reviews, v.40 n.1, p.1-12, January 2010","paperID":"1821264"},{"content":"S. Patel, H. Park, P. Bonato, et al. A review of wearable sensors and systems with application in rehabilitation. NeuroEng and Rehab, 9:21, 2012.","paperID":"None"},{"content":"C. Ramaker, J. Marinus, A. Stiggelbout, and B. Van Hilten. Systematic evaluation of rating scales for impairment and disability in Parkinson's disease. Mov Dis, 17, 2002.","paperID":"None"},{"content":"T. C. Rubinstein, N. Giladi, and J. M. Hausdorff. The power of cueing to circumvent dopamine deficits: A review of physical therapy treatment of gait disturbances in Parkinson's disease. Mov Disord, 17:1148'60, 2002.","paperID":"None"},{"content":"J. Schaafsma, Y. Balash, T. Gurevich, et al. Characterization of freezing of gait subtypes and the response of each to levodopa in Parkinson's disease. Eur J Neurol, 10:391'8, 2003.","paperID":"None"},{"content":"Douglas Schuler , Aki Namioka, Participatory Design: Principles and Practices, L. Erlbaum Associates Inc., Hillsdale, NJ, 1993","paperID":"563076"},{"content":"A. Sponselee, B. Schouten, D. Bouwhuis, and C. Willems. Smart home technology for the elderly: Perceptions of multidisciplinary stakeholders. In Constructing Amb. Intel., pages 314'326. 2008.","paperID":"None"},{"content":"M. Suteerawattananon, G. Morris, B. Etnyre, et al. Effects of visual and auditory cues on gait in individuals with Parkinson's disease. J Neurol Sci, 19:63'9, 2004.","paperID":"None"},{"content":"C. Tomlinson, S. Patel, C. Meek, et al. Physiotherapy versus placebo or no intervention in Parkinson's disease. Cochrane Database of Systematic Reviews, 8, 2012.","paperID":"None"},{"content":"Evanthia E. Tripoliti , Alexandros T. Tzallas , Markos G. Tsipouras , George Rigas , Panagiota Bougia , Michael Leontiou , Spiros Konitsiotis , Maria Chondrogiorgi , Sofia Tsouli , Dimitrios I. Fotiadis, Automatic detection of freezing of gait events in patients with Parkinson's disease, Computer Methods and Programs in Biomedicine, v.110 n.1, p.12-26, April, 2013","paperID":"2452179"},{"content":"Stephen Uzor , Lynne Baillie, Exploring & designing tools to enhance falls rehabilitation in the home, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466159"},{"content":"C.-C. Yang and Y.-L. Hsu. A review of accelerometry-based wearable motion detectors for physical activity monitoring. Sensors, 10:7772'88, 2010.","paperID":"None"},{"content":"K. Ziegler, F. Schroeteler, A. Ceballos-Baumann, and U. Fietzek. A new rating instrument to assess festination and freezing gait in parkinsonian patients. Mov Disord, 25:1012'18, 2010.","paperID":"None"}],"abstract":"Patients with Parkinson's disease often experience freezing of gait, which bears a high risk of falling, a prevalent cause for morbidity and mortality. In this work we present GaitAssist, a wearable system for freezing of gait support in daily life. The system provides real-time auditory cueing after the onset of freezing episodes. Furthermore, GaitAssist implements training exercises to learn how to handle freezing situations. GaitAssist is the result of a design process where we considered the input of engineers, clinicians and 18 Parkinson's disease patients, in order to find an optimal trade-off between system wearability and performance. We tested the final system in a user study with 5 additional patients. They reported a reduction in the freezing of gait duration as a result of the auditory stimulation provided, and that they feel the system enhanced their confidence during walking.","video":"http://www.youtube.com/embed/f8GGTwUycYI?rel=0","title":"GaitAssist: a daily-life support and training system for parkinson's disease patients with freezing of gait","filename":"CHI14/p2531","authors":["Sinziana Mazilu","Ulf Blanke","Michael Hardegger","Gerhard Tröster","Eran Gazit","Jeffrey M. Hausdorff"],"conference":"CHI '14"}