{"paperId":2557024,"reference":[{"content":"Coleman, M., and Liau, T. L. A computer readability formula designed for machine scoring. Journal of Applied Psychology 60, 1 (1975).","paperID":"None"},{"content":"Cristian Danescu-Niculescu-Mizil , Justin Cheng , Jon Kleinberg , Lillian Lee, You had me at hello: how phrasing affects memorability, Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics: Long Papers, July 08-14, 2012, Jeju Island, Korea","paperID":"2390647"},{"content":"Dmitriy Genzel , Eugene Charniak, Entropy rate constancy in text, Proceedings of the 40th Annual Meeting on Association for Computational Linguistics, July 07-12, 2002, Philadelphia, Pennsylvania","paperID":"1073117"},{"content":"Just, M. A., and Carpenter, P. A. A theory of reading: From eye fixations to comprehension. Psychological Review 87, 1 (1980).","paperID":"None"},{"content":"Keller, F. The entropy rate principle as a predictor of processing effort: An evaluation against eye-tracking data. In Proc. EMNLP (2004).","paperID":"None"},{"content":"Per Ola Kristensson , Keith Vertanen, Performance comparisons of phrase sets and presentation styles for text entry evaluations, Proceedings of the 2012 ACM international conference on Intelligent User Interfaces, February 14-17, 2012, Lisbon, Portugal","paperID":"2166972"},{"content":"MacKenzie, I. S., and Soukoreff, R. W. Text entry for mobile computing: Models and methods, theory and practice. Human-Computer Interaction 17, 2 (2002).","paperID":"None"},{"content":"I. Scott MacKenzie , R. William Soukoreff, Phrase sets for evaluating text entry techniques, CHI '03 Extended Abstracts on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"765971"},{"content":"Nelder, J. A., and Weddrburn, R. W. M. Generalized linear models. J. R. Statist. Soc. 135, 3 (1972).","paperID":"None"},{"content":"Tim Paek , Bo-June (Paul) Hsu, Sampling representative phrase sets for text entry experiments: a procedure and public resource, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979304"},{"content":"Schwarz, G. E. Estimating the dimension of a model. Annals of Statistics 6, 2 (1978).","paperID":"None"},{"content":"Senter, R. J., and Smith, E. A. Automated readability index. Tech. Rep. AMRL-TR-6620, Wright-Patterson Air Force Base, 1967.","paperID":"None"},{"content":"Keith Vertanen , Per Ola Kristensson, A versatile dataset for text entry evaluations based on genuine mobile emails, Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services, August 30-September 02, 2011, Stockholm, Sweden","paperID":"2037418"}],"citation":[{"content":"Germán Sanchis-Trilles , Luis A. Leiva, A systematic comparison of 3 phrase sampling methods for text entry experiments in 10 languages, Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, September 23-26, 2014, Toronto, ON, Canada","paperID":"2634229"},{"content":"Anirudha Joshi , Girish Dalvi , Manjiri Joshi, Corpus of Marathi Word Frequencies from Touch-Screen Devices Using Swarachakra Android Keyboard, Proceedings of the India HCI 2014 Conference on Human Computer Interaction, December 07-09, 2014, New Delhi, India","paperID":"2676705"},{"content":"Luis A. Leiva , Alireza Sahami , Alejandro Catala , Niels Henze , Albrecht Schmidt, Text Entry on Tiny QWERTY Soft Keyboards, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702388"}],"abstract":"In text entry experiments, memorability is a desired property of the phrases used as stimuli. Unfortunately, to date there is no automated method to achieve this effect. As a result, researchers have to use either manually curated English-only phrase sets or sampling procedures that do not guarantee phrases being memorable. In response to this need, we present a novel sampling method based on two core ideas: a multiple regression model over language-independent features, and the statistical analysis of the corpus from which phrases will be drawn. Our results show that researchers can finally use a method to successfully curate their own stimuli targeting potentially any language or domain. The source code as well as our phrase sets are publicly available.","video":"http://www.youtube.com/embed/ov3CFiN_5XI?rel=0","title":"Representatively memorable: sampling the right phrase set to get the text entry experiment right","filename":"CHI14/p1709","authors":["Luis A. Leiva","Germán Sanchis-Trilles"],"conference":"CHI '14"}