{"paperId":2557185,"citation":[{"content":"Amon Rapp , Federica Cena, Affordances for self-tracking wearable devices, Proceedings of the 2015 ACM International Symposium on Wearable Computers, September 07-11, 2015, Osaka, Japan","paperID":"2802090"},{"content":"Daniela Rosner, Book Review, Computer Supported Cooperative Work, v.24 n.5, p.509-513, October   2015","paperID":"2869952"},{"content":"Huatong Sun, Sina Weibo of China: From a Copycat to a Local Uptake of a Global Technology Assemblage, International Journal of Sociotechnology and Knowledge Development, v.5 n.4, p.27-37, October 2013","paperID":"2612254"},{"content":"Brian J. McNely , Nathaniel A. Rivers, All of the Things: Engaging Complex Assemblages in Communication Design, Proceedings of the 32nd ACM International Conference on The Design of Communication CD-ROM, September 27-28, 2014, Colorado Springs, CO, USA","paperID":"2666222"}],"reference":[{"content":"Albrechtsen, H., Andersen, H. H. K., Bødker, S., & Pejtersen, A. M. (2001). Affordances in Activity Theory and Cognitive Systems Engineering: Riso National Laboratory, Roskilde.","paperID":"None"},{"content":"Bakhtin, M., M. (1981). The Dialogic Imagination Four Essays. Austin: University of Texas Press.","paperID":"None"},{"content":"Baym, N. (2010). Personal connections in the digital age. UK, Polity.","paperID":"None"},{"content":"Klaus B. Bærentsen , Johan Trettvik, An activity theory approach to affordance, Proceedings of the second Nordic conference on Human-computer interaction, October 19-23, 2002, Aarhus, Denmark","paperID":"572028"},{"content":"Jeffrey Bardzell , Shaowen Bardzell, What is \"critical\" about critical design?, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466451"},{"content":"Shaowen Bardzell, Feminist HCI: taking stock and outlining an agenda for design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753521"},{"content":"Shaowen Bardzell , Jeffrey Bardzell, Towards a feminist HCI methodology: social science, feminism, and HCI, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979041"},{"content":"Shaowen Bardzell , Jeffrey Bardzell , Jodi Forlizzi , John Zimmerman , John Antanitis, Critical design and critical theory: the challenge of designing for provocation, Proceedings of the Designing Interactive Systems Conference, June 11-15, 2012, Newcastle Upon Tyne, United Kingdom","paperID":"2318001"},{"content":"Bloomfield, B, Latham, Y, & Vurdubakis, (2010). Bodies, Technologies and Action Possibilities: When is an Affordance? Sociology 44(3). 415--433.","paperID":"None"},{"content":"Susanne Bødker, When second wave HCI meets third wave challenges, Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles, p.1-8, October 14-18, 2006, Oslo, Norway","paperID":"1182476"},{"content":"Alan Borning , Michael Muller, Next steps for value sensitive design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208560"},{"content":"Parmit Chilana , Christina Holsberry , Flavio Oliveira , Andrew Ko, Designing for a billion users: a case study of facebook, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2212819"},{"content":"Christen, K. (2012). Does Information Really Want to be Free? Indigenous Knowledge Systems and the Question of Openness. International Journal of Communication, 6, 2870--2893.","paperID":"None"},{"content":"Choudry, A., Majavu, M., & Wood, L. (May 2013). Struggles, strategies and analysis of anticolonial and postcolonial social movements. Interface, 5(1),1--10.","paperID":"None"},{"content":"Cosenza, V. (December 2013). World map of social networks. http://vincos.it/world-map-of-social-networks/","paperID":"None"},{"content":"DeSanctis, G., and Poole, M. S. (1994). \"Capturing the Complexityin Advanced Technology Use: Adaptive Structuration Theory,\" Organization Science (5:2), pp. 121--147.","paperID":"None"},{"content":"Dourish, P. (2001). Where the action is. Cambridge, MA: MIT Press.","paperID":"None"},{"content":"eMarketer. (August 3, 2012). US to Top Japan as World's Biggest Mobile Ad Market. http://www.emarketer.com/newsroom/index.php/topjapan-worlds-biggest-mobile-ad-market/","paperID":"None"},{"content":"Faraj, S. & Azad, B. The materiality of technology: An affordance perspective. In Leonardi, P., Nardi, B. & Kallinikos, J. (eds), Materiality and Organizing: Social Interaction in a Technological World (pp, 237--258). New York: Oxford University Press.","paperID":"None"},{"content":"Batya Friedman, Human values and the design of computer technology, Center for the Study of Language and Information, Stanford, CA, 1997","paperID":"278213"},{"content":"Batya Friedman , Lisa P. Nathan, Multi-lifespan information system design: a research initiative for the hci community, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753665"},{"content":"Fuchs, C. (2012). The political economy of privacy on Facebook. Television & New Media 13 (2): 139--159.","paperID":"None"},{"content":"Gibson, J. J. (1979). The Ecological Approach to Visual Perception. Boston: Houghton Mifflin.","paperID":"None"},{"content":"Giddens, A. (1984). The Constitution of Society. Berkeley, CA: University of California Press.","paperID":"None"},{"content":"Graves, L. (2007). The affordances of blogging: A case study in culture and technological effects. Journal of Communication Inquiry 31, 4, 331--346.","paperID":"None"},{"content":"Harrison, S. Tatar, D. and Sengers, P. (2007). The three paradigms of HCI. Ext. Abstracts CHI 2007, ACM.","paperID":"None"},{"content":"Ho, M., Smyth, T., Kam, M., & Dearden, A. (2009). Human-computer interaction for development: The past, present, and future, Information Technologies & International Development, 5(4), URL: http://itidjournal.org/itid/article/view/420/188.","paperID":"None"},{"content":"Hutchby, I. (2001a). \"Technologies, Texts and Affordances,\" Sociology (35:2), pp. 441--456.","paperID":"None"},{"content":"Hutchby, I. (2001b). Conversation and technology: From the telephone to the Internet. Cambridge, UK: Polity Press.","paperID":"None"},{"content":"Heekyoung Jung , Erik Stolterman, Digital form and materiality: propositions for a new approach to interaction design research, Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, October 14-17, 2012, Copenhagen, Denmark","paperID":"2399115"},{"content":"Lilly C. Irani , Paul Dourish, Postcolonial interculturality, Proceedings of the 2009 international workshop on Intercultural collaboration, February 20-21, 2009, Palo Alto, California, USA","paperID":"1499268"},{"content":"Lilly Irani , Janet Vertesi , Paul Dourish , Kavita Philip , Rebecca E. Grinter, Postcolonial computing: a lens on design and development, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753522"},{"content":"Victor Kaptelinin , Bonnie Nardi, Affordances in HCI: toward a mediated action perspective, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208541"},{"content":"Leonardi, P. M. (2010). Digital materiality? How artifacts without matter, matter. First Monday, 15(6). Retrieved from http://firstmonday.org","paperID":"None"},{"content":"Paul M. Leonardi, When flexible routines meet flexible technologies: affordance, constraint, and the imbrication of human and material agencies, MIS Quarterly, v.35 n.1, p.147-168, March 2011","paperID":"2017492"},{"content":"Paul M. Leonardi , Bonnie A. Nardi , Jannis Kallinikos, Materiality and Organizing: Social Interaction in a Technological World, Oxford University Press, Inc., New York, NY, 2013","paperID":"2502638"},{"content":"Lewis, S. (2012). The tension between professional control and open participation. Information, Communication & Society; 15(6) 836--866.","paperID":"None"},{"content":"Markus, ML, & Silver, MS. (2008). A Foundation for the Study of IT Effects: A New Look at DeSanctis and Poole's Concepts of Structural Features and Spirit. Journal of the Association for Information Systems, 9(10/11), 609--632.","paperID":"None"},{"content":"Samantha Merritt , Erik Stolterman, Cultural hybridity in participatory design, Proceedings of the 12th Participatory Design Conference: Exploratory Papers, Workshop Descriptions, Industry Cases, August 12-16, 2012, Roskilde, Denmark","paperID":"2348168"},{"content":"Miller, C. R. (1984). Genre as Social Action. Quarterly Journal of Speech, 70(2), 151--167.","paperID":"None"},{"content":"Lisa P. Nathan , Batya Friedman, Interacting with policy in a political world: reflections from the voices from the Rwanda Tribunal project, interactions, v.17 n.5, September + October 2010","paperID":"1836231"},{"content":"Neff, G., Jordan, T., & McVeigh-Schultz, J. (2012). Affordances, Technical Agency, and the Politics of Technologies of Cultural Production. Journal of Broadcasting & Electronic Media 56(2), pp. 299--313,","paperID":"None"},{"content":"Nissenbaum, H. (2005). Values in Technical Design. In Encyclopedia of Science, Technology and Ethics. New York: Macmillan.","paperID":"None"},{"content":"Norman, D. A. (1988). The Design of Everyday Things. New York: Basic Books.","paperID":"None"},{"content":"Orlikowski, W. J. (1992). The Duality of Technology: Rethinking the Concept of Technology in Organizations. Organization Science, 3(3), 398--427.","paperID":"None"},{"content":"Akiko Orita , Hisakazu Hada, Is that really you?: an approach to assure identity without revealing real-name online, Proceedings of the 5th ACM workshop on Digital identity management, November 13-13, 2009, Chicago, Illinois, USA","paperID":"1655034"},{"content":"Philip, K., Irani, L., Dourish, P. (2012). Postcolonial Computing: A Tactical Survey. Science, Technology, & Human Values, 7(3), 3--29.","paperID":"None"},{"content":"Rau, P., Plocher, T., & Choong, Y. (2012). Crosscultural design for IT products and services. Boca Raton, FL: CRC Press.","paperID":"None"},{"content":"Erica Robles , Mikael Wiberg, Texturing the \"material turn\" in interaction design, Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction, January 24-27, 2010, Cambridge, Massachusetts, USA","paperID":"1709911"},{"content":"Selfe, C. L., & Richard J. Selfe, J. (1994). The Politics of the Interface: Power and Its Exercise in Electronic Contact Zones. College Composition and Communication, 45(4), 480--504.","paperID":"None"},{"content":"Slack, J. D., & Wise, J. M. (2005). Culture + Technology: A primer. New York: Peter Lang.","paperID":"None"},{"content":"Spinuzzi, C. (2003). Tracing Genres through Organizations: A Sociocultural Approach to Information Design. Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Sun, H. (2004). Expanding the scope of localization: A cultural usability perspective on mobile text messaging use in American and Chinese contexts. Doctoral dissertation, Rensselaer Polytechnic Institute, Troy, NY. http://www.localisation.ie/resources/Awards/Theses/sun _diss.pdf.","paperID":"None"},{"content":"Sun, H. (2006). The triumph of users: Achieving cultural usability goals with user localization. Technical Communication Quarterly, 15(4), 457--481.","paperID":"None"},{"content":"Huatong Sun, Designing for a Dialogic View of Interpretation in Cross-Cultural IT Design, Proceedings of the 3rd International Conference on Internationalization, Design and Global Development: Held as Part of HCI International 2009, July 19-24, 2009, San Diego, CA","paperID":"1610939"},{"content":"Sun, H. (2012). Cross-cultural technology design: Creating culture-sensitive technology for local users. New York: Oxford UP.","paperID":"None"},{"content":"Kentaro Toyama, Human–Computer Interaction and Global Development, Foundations and Trends in Human-Computer Interaction, v.4 n.1, p.1-79, January 2010","paperID":"1923906"},{"content":"Torres, I. (June 6, 2013). Japanese netizens seen moving away from Facebook. Available at http://japandailypress.com/japanese-netizens-seenmoving-away-from-facebook-0630137/","paperID":"None"},{"content":"Treem, J.W. & Leonardi, P.M. (2012). Social Media Use in Organizations: Exploring the Affordances of Visibility, Editability, Persistence, and Association. Communication Yearbook, 36, 143--189.","paperID":"None"},{"content":"van Dijck, J. (2013). 'You have one identity': performing the self on Facebook and LinkedIn. Media, culture, & society, 35(2), 199--215.","paperID":"None"},{"content":"Dhaval Vyas , Cristina M. Chisalita , Gerrit C. van der Veer, Affordance in interaction, Proceedings of the 13th Eurpoean conference on Cognitive ergonomics: trust and control in complex socio-technical systems, September 20-22, 2006, Zurich, Switzerland","paperID":"1274907"},{"content":"Mikael Wiberg , Hiroshi Ishii , Paul Dourish , Anna Vallgårda , Tobie Kerridge , Petra Sundström , Daniela Rosner , Mark Rolston, Materiality matters---experience materials, interactions, v.20 n.2, March + April 2013","paperID":"2427087"},{"content":"Wellman, B., Hasse, A., Boase, J., Chen, W., Hampton, K., Diaz, I., & Miyata, K. (2003). The Social Affordances of the Internet for Networked Individualism. Journal of Computer-Mediated Communication, 8, 3, 0-0.","paperID":"None"},{"content":"Winner, L. (1980). Do Artifacts Have Politics? Daedalus, 109(1), 121--136.","paperID":"None"}],"abstract":"As Norman's vision of affordances developed twenty-six years ago is unable to address complex challenges faced by today's designers, we outline a view of affordances as discursive relations in HCI design. This argument is framed in the discussion of a larger trend of work beyond the HCI field, the scholarship on relational affordances from the fields of communication and organization studies. Through comparison and interrogation, we maintain a relational approach of affordances that bind the material and the discursive will help us to address design issues such as discursive power, cultural values, performed identities, mediated agency, and articulated voices in this increasingly globalized world and design culturally sensitive technology for transformation and emancipation. With a few cases, this paper deciphers the hidden power relationship of interaction design and suggests ways of we should design for social affordances.","video":"http://www.youtube.com/embed/O_W9Yz7oxPY?rel=0","title":"Binding the material and the discursive with a relational approach of affordances","filename":"CHI14/p3533","authors":["Huatong Sun","William F. Hart-Davidson"],"conference":"CHI '14"}