{"paperId":2557303,"citation":[{"content":"Ari Hautasaari , Naomi Yamashita, Catching up in audio conferences: highlighting keywords in ASR transcripts for non-native speakers, Proceedings of the 5th ACM international conference on Collaboration across boundaries: culture, distance & technology, August 20-22, 2014, Kyoto, Japan","paperID":"2634064"},{"content":"Andy Echenique , Naomi Yamashita , Hideaki Kuzuoka , Ari Hautasaari, Effects of video and text support on grounding in multilingual multiparty audio conferencing, Proceedings of the 5th ACM international conference on Collaboration across boundaries: culture, distance & technology, August 20-22, 2014, Kyoto, Japan","paperID":"2631497"},{"content":"Ari Hautasaari , Naomi Yamashita, Do automated transcripts help non-native speakers catch up on missed conversation in audio conferences?, Proceedings of the 5th ACM international conference on Collaboration across boundaries: culture, distance & technology, August 20-22, 2014, Kyoto, Japan","paperID":"2631495"},{"content":"Ge Gao , Bin Xu , David C. Hau , Zheng Yao , Dan Cosley , Susan R. Fussell, Two is Better Than One: Improving Multilingual Collaboration by Giving Two Machine Translation Outputs, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675197"},{"content":"Ge Gao , Naomi Yamashita , Ari M.J. Hautasaari , Susan R. Fussell, Improving Multilingual Collaboration by Displaying How Non-native Speakers Use Automated Transcripts and Bilingual Dictionaries, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702498"}],"reference":[{"content":"M. Benzeghiba , R. De Mori , O. Deroo , Stephane Dupont , T. Erbes , D. Jouvet , L. Fissore , P. Laface , A. Mertins , C. Ris , R. Rose , V. Tyagi , C. Wellekens, Automatic speech recognition and speech variability: A review, Speech Communication, v.49 n.10-11, p.763-786, October, 2007","paperID":"1285128"},{"content":"Bradlow, A. R., & Bent, T. (2002). The clear speech effect for non-native listeners. The Journal of the Acoustical Society of America, 112, 272--284.","paperID":"None"},{"content":"Bradlow, A. R., & Bent, T. (2008). Perceptual adaptation to non-native speech. Cognition, 106(2), 707--729.","paperID":"None"},{"content":"Clark, H. H. & Brennan, S. E. (1991). Grounding in communication. In L. B. Resnick, R. M. Levine, & S. D. Teasley (Eds.). Perspectives on socially shared cognition (pp. 127--149). Washington, DC: APA.","paperID":"None"},{"content":"Crookes, G., Rulon, K. A., & Enright, D. S. (1988). Topic and feedback in native-speaker and non-native-speaker conversation. TESOL Quarterly, 22(4), 675--681.","paperID":"None"},{"content":"Desanctis, G., & Monge, P. (1998). Communication processes for virtual organizations. Journal of Computer-Mediated Communication, 3(4), 1--16.","paperID":"None"},{"content":"Dunkel, P. (1991). Listening in the native and second/foreign language: Toward an integration of research and practice. Tesol Quarterly, 25(3), 431--457.","paperID":"None"},{"content":"Dragon Natually Speaking (DNS): Dragon Solutions Field Report. Full text accessible at: http://www.nuance.com/naturallyspeaking/pdf/wp_DNS_Field_Reporting.pdf.","paperID":"None"},{"content":"Feely, A.-J., & Harzing, A. W. K. (2003). Language management in multinational companies. Cross-Cultural Management: An Int'l Journal, 10, 37--52.","paperID":"None"},{"content":"Hart, S. G. & Staveland, L. E. (1988). Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In P. A. Hancock and N. Meshkati (Eds.) Human Mental Workload. Amsterdam: North Holland Press.","paperID":"None"},{"content":"Krause, J. C., & Braida, L. D. (1995). The effects of speaking rate on the intelligibility of speech for various speaking modes. The Journal of the Acoustical Society of America, 98, 2982.","paperID":"None"},{"content":"Kurhila, S. (2001). Correction in talk between native and non-native speaker. Journal of Pragmatics, 33(7), 1083--1110.","paperID":"None"},{"content":"Na Li , Mary Beth Rosson, At a different tempo: what goes wrong in online cross-cultural group chat?, Proceedings of the 17th ACM international conference on Supporting group work, October 27-31, 2012, Sanibel Island, Florida, USA","paperID":"2389200"},{"content":"Na Li , Mary Beth Rosson, Instant annotation: early design experiences in supporting cross-cultural group chat, Proceedings of the 30th ACM international conference on Design of communication, October 03-05, 2012, Seattle, Washington, USA","paperID":"2379088"},{"content":"Maria Luisa Garcia Lecumberri , Martin Cooke , Anne Cutler, Non-native speech perception in adverse conditions: A review, Speech Communication, v.52 n.11-12, p.864-886, November, 2010","paperID":"1890293"},{"content":"Nabelek, A. K., Donahue, A. M. (1984). Perception of consonants in reverberation by native and non-native listeners. Journal of Acoustical Society of America, 75, 1984, 632--634.","paperID":"None"},{"content":"One Thousand Most Frequent Words by British National Corpus. Full list accessible at: http://simple.wiktionary.org/wiki/Wiktionary:Most_frequent_1000_words_in_English.","paperID":"None"},{"content":"Yingxin Pan , Danning Jiang , Michael Picheny , Yong Qin, Effects of real-time transcription on non-native speaker's comprehension in computer-mediated communications, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1519061"},{"content":"Yingxin Pan , Danning Jiang , Lin Yao , Michael Picheny , Yong Qin, Effects of automated transcription quality on non-native speakers' comprehension in real-time computer-mediated communication, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753584"},{"content":"Picheny, M. A., Durlach, N. I., & Braida, L. D. (1989), Speaking clearly for the hard of hearing III: An attempt to determine the contribution of speaking rate to difference in intelligibility between clear and conversational speech. Journal of Speech and Hearing Research, 32, 600--603.","paperID":"None"},{"content":"Rubin, J. (1994). A review of second language listening comprehension research. The Modern Language Journal, 78(2), 199--221.","paperID":"None"},{"content":"Pnina Shachaf, Cultural diversity and information and communication technology impacts on global virtual teams: An exploratory study, Information and Management, v.45 n.2, p.131-142, March, 2008","paperID":"1349958"},{"content":"Nobuhiro Shimogori , Tomoo Ikeda , Sougo Tsuboi, Automatically generated captions: will they help non-native speakers communicate in english?, Proceedings of the 3rd international conference on Intercultural collaboration, August 19-20, 2010, Copenhagen, Denmark","paperID":"1841865"},{"content":"Takano, Y. & Noda, A. (1995). Interlanguage dissimilarity enhances the decline of thinking ability during foreign language processing. Lang. Learn., 45, 657--681.","paperID":"None"},{"content":"Dirk Van Compernolle, Recognizing speech of goats, wolves, sheep and...non-natives, Speech Communication, v.35 n.1-2, p.71-79, August 2001","paperID":"567563"},{"content":"Vigil, N., & Oller, J. (1976). Rule fossilization: A tentative model. Language Learning, 26, 281--295.","paperID":"None"},{"content":"Naomi Yamashita , Andy Echenique , Toru Ishida , Ari Hautasaari, Lost in transmittance: how transmission lag enhances and deteriorates multilingual collaboration, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441881"},{"content":"Lin Yao , Ying-xin Pan , Dan-ning Jiang, Effects of automated transcription delay on non-native speakers' comprehension in real-time computer-mediated communication, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042077"},{"content":"Chien Wen Yuan , Leslie D. Setlock , Dan Cosley , Susan R. Fussell, Understanding informal communication in multilingual contexts, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441880"}],"abstract":"Real-time transcripts generated by automated speech recognition (ASR) technologies have the potential to facilitate communication between native speakers (NS) and non-native speakers (NNS). Previous studies of ASR have focused on how transcripts aid NNS speech comprehension. In this study, we examine whether transcripts benefit multiparty real-time conversation between NS and NNS. We hypothesized that ASR transcripts would be more beneficial when the transcripts were publicly shared by all group members as opposed to when they were seen only by the NNS. To test our hypothesis, we conducted a lab experiment in which 14 groups of native and non-native speakers engaged in a story-telling task. Half of the groups received private transcripts that were available only to the NNS; the other half received publicly shared transcripts that were available to all group members. NS spoke more clearly, and both NS and NNS rated the quality of communication higher, when transcripts were publicly shared. These findings inform the design of future tools to support multilingual group communication.","video":"http://www.youtube.com/embed/hhpBRDRTkT4?rel=0","title":"Effects of public vs. private automated transcripts on multiparty communication between native and non-native english speakers","filename":"CHI14/p843","authors":["Ge Gao","Naomi Yamashita","Ari MJ Hautasaari","Andy Echenique","Susan R. Fussell"],"conference":"CHI '14"}