{"paperId":2557015,"citation":[{"content":"Nataliya Kosmyna , Franck Tarpin-Bernard , Bertrand Rivet, Conceptual Priming for In-game BCI Training, ACM Transactions on Computer-Human Interaction (TOCHI), v.22 n.5, p.1-25, October 2015","paperID":"2808228"},{"content":"Nataliya Kosmyna , Franck Tarpin-Bernard , Bertrand Rivet, Adding Human Learning in Brain--Computer Interfaces (BCIs): Towards a Practical Control Modality, ACM Transactions on Computer-Human Interaction (TOCHI), v.22 n.3, p.1-37, June 2015","paperID":"2723162"}],"reference":[{"content":"Bates, A. T., Patel, T. P. and Liddle, P. F. External Behavior Monitoring Mirrors Internal Behavior Monitoring. J. of Psychophysiology 281--288. 2005.","paperID":"None"},{"content":"Blankertz, B., Muller, K., Krusienski, D. J., Schalk, G., Wolpaw, J. R., Schlogl, A., Pfurtscheller, G., Millan, J. R., Schroder, M. and Birbaumer, N. The BCI competition III: validating alternative approaches to actual BCI problems. IEEE Trans. Neural Syst. Rehabil. Eng. 2006.","paperID":"None"},{"content":"Christoforos, A., Dimitris, T., Niall, A. and David, H. Temporally adaptive estimation of logistic classifiers on data streams. ADAC, 3, 3 243--261. 2009.","paperID":"None"},{"content":"Coles., M. K. S. a. M. G. H. Performance Monitoring in a Confusing World: Error-Related Brain Activity, Judgments of Response Accuracy, and Types of Errors. Proc. of JEPHPP, 26, 1 141--151. 2000.","paperID":"None"},{"content":"Bernardo Dal Seno , Matteo Matteucci , Luca Mainardi, Online detection of p300 and error potentials in a BCI speller, Computational Intelligence and Neuroscience, 2010, p.1-1, January 2010","paperID":"1840654"},{"content":"De Bruijn, E. R. A. and von Rhein, D. T. Is your error my concern' An event-related potential study on own and observed error detection in cooperation and competition. Frontiers in Neuroscience, 6. 2012.","paperID":"None"},{"content":"Eriksen, C. and Schultz, D. Information processing in visual search: A continuous flow conception and experimental results. Attention, Perceptionn & Psychophysics, 25, 4 249--263. 1979.","paperID":"None"},{"content":"Pierre W. Ferrez , José Del R. Millán, You are wrong!: automatic detection of interaction errors from brain waves, Proceedings of the 19th international joint conference on Artificial intelligence, p.1413-1418, July 30-August 05, 2005, Edinburgh, Scotland","paperID":"1642517"},{"content":"Lesya Y. Ganushchak , Niels O. Schiller, Brain errormonitoring activity is affected by semantic relatedness: An event-related brain potentials study, Journal of Cognitive Neuroscience, v.20 n.5, p.927-940, May 2008","paperID":"1362447"},{"content":"Saul Greenberg , Carl Gutwin , Mark Roseman, Semantic Telepointers for Groupware, Proceedings of the 6th Australian Conference on Computer-Human Interaction (OZCHI '96), p.54, November 24-27, 1996","paperID":"883204"},{"content":"Carl Gutwin , Saul Greenberg, A Descriptive Framework of Workspace Awareness for Real-Time Groupware, Computer Supported Cooperative Work, v.11 n.3, p.411-446, 2002","paperID":"586339"},{"content":"Carl Gutwin , Andy Cockburn, Improving list revisitation with ListMaps, Proceedings of the working conference on Advanced visual interfaces, May 23-26, 2006, Venezia, Italy","paperID":"1133347"},{"content":"Hjelm, S. I. and Browall, C. Brainball - using brain activity for cool competition. NordiCHI. 2000.","paperID":"None"},{"content":"Margit Kristensen , Morten Kyng , Leysia Palen, Participatory design in emergency medical service: designing for future practice, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124798"},{"content":"Krusienski, D. J., Sellers, E. W., McFarland, D. J., Vaughan, T. M. and Wolpaw, J. R. Toward enhanced P300 speller performance. Neuroscience Methods2008","paperID":"None"},{"content":"Johnny Chung Lee , Desney S. Tan, Using a low-cost electroencephalograph for task classification in HCI research, Proceedings of the 19th annual ACM symposium on User interface software and technology, October 15-18, 2006, Montreux, Switzerland","paperID":"1166268"},{"content":"Luu, P., Tucker, D. M. and Makeig, S. Frontal midline theta and the error-related negativity: neurophysiological mechanisms of action regulation. J. Clin Neurophysiol, 115, 8 1821--1835. 2004.","paperID":"None"},{"content":"Wolfgang H. R. Miltner , Christoph H. Braun , Michael G. H. Coles, Event-related brain potentials following incorrect feedback in a time-estimation task: Evidence for a “generic” neural system for error detection, Journal of Cognitive Neuroscience, v.9 n.6, p.788-798, November 1997","paperID":"1331172"},{"content":"Miltner, W. H. R., Brauer, J., Hecht, H., Trippe, R. and Coles, M. Parallel brain activity for self-generated and observed errors. 2004.","paperID":"None"},{"content":"Parra, L., Alvino, C., Tang, A., Pearlmutter, B., Yeung, N., Osman, A. and Sajda, P. Linear Spatial Integration for Single-Trial Detection in Encephalography. NeuroImage, 17, 1 223--230. 2002.","paperID":"None"},{"content":"David Pinelle , Miguel Nacenta , Carl Gutwin , Tadeusz Stach, The effects of co-present embodiments on awareness and collaboration in tabletop groupware, Proceedings of Graphics Interface 2008, May 28-30, 2008, Windsor, Ontario, Canada","paperID":"1375716"},{"content":"van Schie, H. T., Mars, R. B., Coles, M. G. H. and Bekkering, H. Modulation of activity in medial frontal and motor cortices during error observation. Nature Neuroscience, 7, 5 549--554. 2004.","paperID":"None"},{"content":"Chi Vi , Sriram Subramanian, Detecting error-related negativity for interaction design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207744"},{"content":"Vi, C., Takashima, K., Yokoyama, H., Liu, G., Itoh, Y., Subramanian, S. and Kitamura, Y. D-FLIP: Dynamic and Flexible Interactive PhotoShow. Springer. 2013.","paperID":"None"},{"content":"Laurie Williams , Robert Kessler, Pair Programming Illuminated, Addison-Wesley Longman Publishing Co., Inc., Boston, MA, 2002","paperID":"548833"},{"content":"Yeung, N. and Cohen, J. D. The Impact of Cognitive Deficits on Conflict Monitoring: Predictable Dissociations Between the Error-Related Negativity and N2. Psychological Science, 17164--171. 2006.","paperID":"None"},{"content":"Beste F. Yuksel , Michael Donnerer , James Tompkin , Anthony Steed, A novel brain-computer interface using a multi-touch surface, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753452"},{"content":"Zander, T., Kothe, C., Jatzev, S. and Gaertner, M. Enhancing Human-Computer Interaction with Input from Active and Passive Brain-Computer Interfaces. 2010.","paperID":"None"},{"content":"Zander, T. O. and Kothe, C. Towards passive brain' computer interfaces: applying brain'computer interface technology to human'machine systems in general. Journal of Neural Engineering, 8, 2. 2011.","paperID":"None"}],"abstract":"Error Related Negativity is triggered when a user either makes a mistake or the application behaves differently from their expectation. It can also appear while observing another user making a mistake. This paper investigates ERN in collaborative settings where observing another user (the executer) perform a task is typical and then explores its applicability to HCI. We first show that ERN can be detected on signals captured by commodity EEG headsets like an Emotiv headset when observing another person perform a typical multiple-choice reaction time task. We then investigate the anticipation effects by detecting ERN in the time interval when an executer is reaching towards an answer. We show that we can detect this signal with both a clinical EEG device and with an Emotiv headset. Our results show that online single trial detection is possible using both headsets during tasks that are typical of collaborative interactive applications. However there is a trade-off between the detection speed and the quality/prices of the headsets. Based on the results, we discuss and present several HCI scenarios for use of ERN in observing tasks and collaborative settings.","video":"http://www.youtube.com/embed/Vj5Ur2Aacsk?rel=0","title":"Error related negativity in observing interactive tasks","filename":"CHI14/p3787","authors":["Chi Thanh Vi","Izdihar Jamil","David Coyle","Sriram Subramanian"],"conference":"CHI '14"}