{"paperId":2557133,"citation":[{"content":"Sam Alexander, mHealth technologies for the self-management of diabetes in the older population, ACM SIGACCESS Accessibility and Computing","paperID":"2809908"},{"content":"Robin N. Brewer , Jasmine Jones, Pinteresce: Exploring Reminiscence as an Incentive to Digital Reciprocity for Older Adults, Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2699017"},{"content":"Robin Brewer, Connecting Older Adults through Voice-Based Interfaces, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2874350"},{"content":"Robin Brewer , Raymundo Cornejo Garcia , Tedmond Schwaba , Darren Gergle , Anne Marie Piper, Exploring Traditional Phones as an E-Mail Interface for Older Adults, ACM Transactions on Accessible Computing (TACCESS), v.8 n.2, p.1-20, January 2016","paperID":"2839303"},{"content":"Barbara Barbosa Neves , Rachel L. Franz , Cosmin Munteanu , Ronald Baecker , Mags Ngo, \"My Hand Doesn't Listen to Me!\": Adoption and Evaluation of a Communication Technology for the 'Oldest Old', Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702430"},{"content":"José Coelho , Carlos Duarte, A literature survey on older adults' use of social network services and social applications, Computers in Human Behavior, v.58 n.C, p.187-205, May 2016","paperID":"2901992"}],"reference":[{"content":"Rajiv Arjan , Ulrike Pfeil , Panayiotis Zaphiris, Age differences in online social networking, CHI '08 Extended Abstracts on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1358754"},{"content":"Caroline Bell , Cara Fausset , Sarah Farmer , Julie Nguyen , Linda Harley , W. Bradley Fain, Examining social media use among older adults, Proceedings of the 24th ACM Conference on Hypertext and Social Media, p.158-163, May 01-03, 2013, Paris, France","paperID":"2481509"},{"content":"Jeremy Birnholtz , McKenzie Jones-Rounds, Independence and interaction: understanding seniors' privacy and awareness needs for aging in place, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753349"},{"content":"boyd, d. Why youth (heart) social network sites: The role of networked publics in teenage social life. In Youth, identity, and digital media, D. Buckingham, Ed., MIT Press, Cambridge (2008).","paperID":"None"},{"content":"Michael T. Braun, Obstacles to social networking website use among older adults, Computers in Human Behavior, v.29 n.3, p.673-680, May, 2013","paperID":"2444321"},{"content":"Carstensen, L. Socioemotional selectivity theory and the regulation of emotion in the second half of life. Motivation and Emotion 27, 2 (2003), 103'123.","paperID":"None"},{"content":"Chalfen, R. Snapshot versions of life. Bowling Green State University Popular Press, OH, 1987.","paperID":"None"},{"content":"Cherlin, A., and Furstenberg, F. The New American Grandparent: A Place in the Family, a Life Apart. Basic Books, New York, 1986.","paperID":"None"},{"content":"Cicirelli, V. G. Feelings of attachment to siblings and well-being in later life. Psychology and Aging 4, 2 (1989), 211'216.","paperID":"None"},{"content":"Raymundo Cornejo , Mónica Tentori , Jesús Favela, Ambient Awareness to Strengthen the Family Social Network of Older Adults, Computer Supported Cooperative Work, v.22 n.2-3, p.309-344, April     2013","paperID":"2457902"},{"content":"Davis, H., Vetere, F., Francis, P., Gibbs, M., and Howard, S. 'I wish we could get together': exploring intergenerational play across a distance via a 'Magic Box'. Intergen. Relat. 6, 2 (2008), 191'210.","paperID":"None"},{"content":"Dickinson, A., and Hill, R. Keeping in touch: Talking to older people about computers and communication. Educ Gerontology (2007), 613'630.","paperID":"None"},{"content":"Diener, E., and Suh, M. Subjective wellbeing and age: An international analysis. In Annual review of gerontology and geriatrics, K. Schaie and M. Lawton, Eds., Springer, New York (1997), 304'324.","paperID":"None"},{"content":"J. Donath , D. Boyd, Public Displays of Connection, BT Technology Journal, v.22 n.4, p.71-82, October 2004","paperID":"1031348"},{"content":"Duggan, M., and Smith, A. Social media update 2013. Pew Internet and American Life Project (2013).","paperID":"None"},{"content":"Ellison, N., Steinfeld, C., and Lampe, C. Spatially bounded online social networks and social capital: the role of facebook. In ICA (2006).","paperID":"None"},{"content":"Lorna Gibson , Wendy Moncur , Paula Forbes , John Arnott , Christopher Martin , Amritpal S. Bhachu, Designing social networking sites for older adults, Proceedings of the 24th BCS Interaction Specialist Group Conference, September 06-10, 2010, Dundee, United Kingdom","paperID":"2146331"},{"content":"Glaser, B., and Strauss, A. The Discovery of Grounded Theory: Strategies for Qualitative Research. Aldine Publishing Company, Chicago, 1967.","paperID":"None"},{"content":"Gordon, C., and Gaitz, C. Leisure and lives. Handbook of Aging and the Social Sciences 1 (1976), 310'341.","paperID":"None"},{"content":"Granovetter, M. The strength of weak ties: A network theory revisited. In Social structure and network analysis, P. Marsden and N. Lin, Eds., Sage (1982).","paperID":"None"},{"content":"Harvey, A., and Singleton, J. Canadian activity patterns across the life span: A time budget perspective. Canadian Journal on Aging 8 (1989), 268'285.","paperID":"None"},{"content":"Kanayama, T. Ethnographic research on the experience of japanese elderly people online. New Media and Society 5 (2003).","paperID":"None"},{"content":"Karimi, A., and Neustaedter, C. My grandma uses facebook: Communication practices of older adults in an age of social media. Technical Report 2011--1116-04 (2011).","paperID":"None"},{"content":"Cliff A.C. Lampe , Nicole Ellison , Charles Steinfield, A familiar face(book): profile elements as signals in an online social network, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240695"},{"content":"Vilma Lehtinen , Jaana Näsänen , Risto Sarvas, \"A little silly and empty-headed\": older adults' understandings of social networking sites, Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology, p.45-54, September 01-05, 2009, Cambridge, United Kingdom","paperID":"1671017"},{"content":"Siân E. Lindley, Shades of lightweight: supporting cross-generational communication through home messaging, Universal Access in the Information Society, v.11 n.1, p.31-43, March 2012","paperID":"2157591"},{"content":"Siân E. Lindley , Richard Harper , Abigail Sellen, Designing for elders: exploring the complexity of relationships in later life, Proceedings of the 22nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction, September 01-05, 2008, Liverpool, United Kingdom","paperID":"1531525"},{"content":"Siân E. Lindley , Richard Harper , Abigail Sellen, Desiring to be in touch in a changing communications landscape: attitudes of older adults, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518962"},{"content":"Lubben, J., and Gironda, M. Centrality of social ties to the health and well-being of older adults. Social work and health care in an aging society (2003), 319'350.","paperID":"None"},{"content":"Madden, M. Older adults and social media. Pew Internet and American Life Project (2010).","paperID":"None"},{"content":"McLuhan, M. Understanding Media: The Extensions of Man. McGraw Hill, New York, 1964.","paperID":"None"},{"content":"McMellon, C., and Schiffman, L. Cybersenior empowerment: How some older individuals are taking control of their lives. Jour of Applied Geront 21 (2002).","paperID":"None"},{"content":"Moffatt, K., David, J., and Baecker, R. M. Connecting grandparents and grandchildren. In Connecting Families: The Impact of New Communication Technologies on Domestic Life, C. Neustaedter, S. Harrison, and A. Sellen, Eds., Springer (London, 2012), 173'193.","paperID":"None"},{"content":"Ulrike Pfeil , Raj Arjan , Panayiotis Zaphiris, Age differences in online social networking - A study of user profiles and the social capital divide among teenagers and older users in MySpace, Computers in Human Behavior, v.25 n.3, p.643-654, May, 2009","paperID":"1534972"},{"content":"Quadrello, T., Hurme, H., Menzinger, J., Smith, P. K., Veisson, M., Vidal, S., and Westerback, S. Grandparents use of new communication technologies in a european perspective. Eur J Ageing (2005).","paperID":"None"},{"content":"Selwyn, N. The information aged: A qualitative study of older adults use of information and communications technology. Jour of Aging Studies 18 (2004), 369'384.","paperID":"None"},{"content":"Sum, S., Mathews, R., Hughes, I., and Campbell, A. Internet use and loneliness in older adults. Cyberpsychol Behav 11 (2008).","paperID":"None"},{"content":"S. Shyam Sundar , Anne Oeldorf-Hirsch , Jon Nussbaum , Richard Behr, Retirees on Facebook: can online social networking enhance their health and wellness?, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979931"},{"content":"Kimberly Tee , A.J. Bernheim Brush , Kori M. Inkpen, Exploring communication and sharing between extended families, International Journal of Human-Computer Studies, v.67 n.2, p.128-138, February, 2009","paperID":"1466156"},{"content":"Jenny Waycott , Frank Vetere , Sonja Pedell , Lars Kulik , Elizabeth Ozanne , Alan Gruner , John Downs, Older adults as digital content producers, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470662"},{"content":"Xie, B. Older chinese, the internet, and well-being. Jour of Long Term Home Health Care 8 (2007).","paperID":"None"},{"content":"Panayiotis Zaphiris , Rifaht Sarwar, Trends, similarities, and differences in the usage of teen and senior public online newsgroups, ACM Transactions on Computer-Human Interaction (TOCHI), v.13 n.3, p.403-422, September 2006","paperID":"1183461"},{"content":"Zickuhr, K. Generations 2010. Pew Internet and American Life Project (2010).","paperID":"None"},{"content":"Zickuhr, K., and Madden, M. Older adults and internet use. Pew Internet and American Life Project (2012).","paperID":"None"}],"abstract":"Online technologies are promising for helping older adults maintain social connectedness, particularly with younger people, yet many older adults resist or participate minimally in the mainstream technologies used by younger members of their social network. We present results from an interview study involving 22 older adults (age 71-92) to understand communication preferences and values related to social media. Seniors articulate many concerns with online social media, including the time required for legitimate participation, the loss of deeper communication, content irrelevance, and privacy. Additionally, older adults engage in social practices that could be supported by online social technologies, but they rarely use such tools. The theme of material social communications emerges from our data, and we examine this in context of online social media. We conclude with design considerations for the development of social media for older adults, and as part of this we describe the notion of bridging technologies as a framework for intergenerational communication design.","video":"http://www.youtube.com/embed/h4PCBYBQjEM?rel=0","title":"Understanding digital and material social communications for older adults","filename":"CHI14/p3903","authors":["Alexis Hope","Ted Schwaba","Anne Marie Piper"],"conference":"CHI '14"}