{"paperId":2557080,"citation":[{"content":"Jessy Barré , Stéphanie Buisine , Jérôme Guegan , Fabrice Mantelet , Améziane Aoussat, Anticipating user's needs with playful methods, Proceedings of the 2014 Ergonomie et Informatique Avancée Conference - Design, Ergonomie et IHM: quelle articulation pour la co-conception de l'interaction, October 15-17, 2014, Bidart-Biarritz, France","paperID":"2671474"},{"content":"Lene Nielsen , Kira Storgaard Hansen , Jan Stage , Jane Billestrup, A Template for Design Personas: Analysis of 47 Persona Descriptions from Danish Industries and Organizations, International Journal of Sociotechnology and Knowledge Development, v.7 n.1, p.45-61, January 2015","paperID":"2820352"},{"content":"Daniel G. Cabrero, User-created persona: Namibian rural Otjiherero speakers, Proceedings of the 33rd Annual International Conference on the Design of Communication, July 16-17, 2015, Limerick, Ireland","paperID":"2775484"}],"reference":[{"content":"Alissa Nicole Antle, Child-personas: fact or fiction?, Proceedings of the 6th conference on Designing Interactive systems, June 26-28, 2006, University Park, PA, USA","paperID":"1142411"},{"content":"Andrea Atzeni , Cesare Cameroni , Shamal Faily , John Lyle , Ivan Flechais, Here's Johnny: A Methodology for Developing Attacker Personas, Proceedings of the 2011 Sixth International Conference on Availability, Reliability and Security, p.722-727, August 22-26, 2011","paperID":"2066262"},{"content":"Åsa Blomquist , Mattias Arvola, Personas in action: ethnography in an interaction design team, Proceedings of the second Nordic conference on Human-computer interaction, October 19-23, 2002, Aarhus, Denmark","paperID":"572044"},{"content":"Susanne Bødker , Ellen Christiansen , Tom Nyvang , Pär-Ola Zander, Personas, people and participation: challenges from the trenches of local government, Proceedings of the 12th Participatory Design Conference: Research Papers, August 12-16, 2012, Roskilde, Denmark","paperID":"2347649"},{"content":"Yen-ning Chang , Youn-kyung Lim , Erik Stolterman, Personas: from theory to practices, Proceedings of the 5th Nordic conference on Human-computer interaction: building bridges, October 20-22, 2008, Lund, Sweden","paperID":"1463214"},{"content":"Chapman, C. N., Love, E., Milham, R. P., ElRif, P., and Alford, J. L. Quantitative Evaluation of Personas as Information. Proc. HFES 52nd Annual Meeting, (2008) 1107--1111.","paperID":"None"},{"content":"Alan Cooper, About Face 3.0: The Essentials of Interaction Design, John Wiley & Sons, Inc., New York, NY, 2007","paperID":"1207736"},{"content":"Alan Cooper , Paul Saffo, The  Inmates Are Running the Asylum, Macmillan Publishing Co., Inc., Indianapolis, IN, 1999","paperID":"553473"},{"content":"Amir Dotan , Neil Maiden , Valentina Lichtner , Lola Germanovich, Designing with Only Four People in Mind? --- A Case Study of Using Personas to Redesign a Work-Integrated Learning Support System, Proceedings of the 12th IFIP TC 13 International Conference on Human-Computer Interaction: Part II, August 24-28, 2009, Uppsala, Sweden","paperID":"1616286"},{"content":"Shamal Faily , Ivan Flechais, Persona cases: a technique for grounding personas, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979274"},{"content":"Floyd, I. R., Jones, C. M., and Twidale, M. B. Resolving Incommensurable Debates: A Preliminary Identification of Persona Kinds, Attributes, and Characteristics. Artifact 2, 1, (2008) 12--26.","paperID":"None"},{"content":"Friess, E. The Sword of Data: Does Human-Centered Design Fulfill Its Rhetorical Responsibility? Design Issues 26, 3, (2010) 40--50.","paperID":"None"},{"content":"Gudjónsdóttir, R. and Lindquist, S. Personas and Scenarios: Design Tool or a Communication Device? Proc. COOP'08, (2008) 165--176.","paperID":"None"},{"content":"Hosono, S., Hasegawa, M., Hara, T., Shimomura, Y., and Arai, T. A Methodology of Persona-centric Service Design. Proc. 19th CIRP, (2009) 541--547.","paperID":"None"},{"content":"Plinio Thomaz Aquino Junior , Lucia Vilela Leite Filgueiras, User modeling with personas, Proceedings of the 2005 Latin American conference on Human-computer interaction, p.277-282, October 23-26, 2005, Cuernavaca, Mexico","paperID":"1111388"},{"content":"Vesa Kantola , Sauli Tiitta , Katri Mehto , Tomi Kankainen, Using dramaturgical methods to gain more dynamic user understanding in user-centered design, Proceedings of the 6th ACM SIGCHI conference on Creativity & cognition, June 13-15, 2007, Washington, DC, USA","paperID":"1254985"},{"content":"Kvale, S. InterView. Hans Reitzel. (1997).","paperID":"None"},{"content":"Lieve Laporte , Karin Slegers , Dirk De Grooff, Using correspondence analysis to monitor the persona segmentation process, Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, October 14-17, 2012, Copenhagen, Denmark","paperID":"2399058"},{"content":"Long, F. Real or Imaginary - the Effect of Using Personas in Product Design. Proc. IES Conference, 2009. Irish Ergonomics Review, (2009).","paperID":"None"},{"content":"Ma, J. and LeRouge, C. Introducing User Profiles and Personas into Information Systems Development. Proc. AMCIS 2007, (2007) paper 237.","paperID":"None"},{"content":"Erik Markensten , Henrik Artman, Procuring a usable system using unemployed personas, Proceedings of the third Nordic conference on Human-computer interaction, p.13-22, October 23-27, 2004, Tampere, Finland","paperID":"1028017"},{"content":"Massanari, A. L. Designing for Imaginary Friends: Information Architecture, Personas and the Politics of User-centered Design. New Media & Society, 12, 3, (2010) 401--416.","paperID":"None"},{"content":"Tara Matthews , Tejinder Judge , Steve Whittaker, How do designers and user experience professionals actually perceive and use personas?, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208573"},{"content":"Jennifer (Jen) McGinn , Nalini Kotamraju, Data-driven persona development, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357292"},{"content":"Miaskiewicza, T., Kozarb, K. A.: Personas and Usercentered Design: How Can Personas Benefit Product Design Processes? Design Studies 32, 5, (2011) 417--430.","paperID":"None"},{"content":"Negru, S. and Buraga S. Towards a Conceptual Model for Describing the Personas Methodology. Proc ICCP '12 IEEE (2012).","paperID":"None"},{"content":"James E. Nieters , Subbarao Ivaturi , Iftikhar Ahmed, Making personas memorable, CHI '07 Extended Abstracts on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, CA, USA","paperID":"1240905"},{"content":"Nielsen, L. Engaging Personas and Narrative Scenarios. Vol. 17, PhD Series. Samfundslitteratur (2004).","paperID":"None"},{"content":"Lene Nielsen, Personas - User Focused Design, Springer Publishing Company, Incorporated, 2012","paperID":"2371206"},{"content":"Nielsen, L., Nielsen, K. S., Stage, J. and Billestrup, J. Going Global with Personas. Proc. INTERACT 2013. Springer, (2013).","paperID":"None"},{"content":"Nielsen, L. and Nielsen, K. S. Personas - from Poster to Performance. Proc. PIN-C. 1, Chap. 273, (2013) 270--273.","paperID":"None"},{"content":"Pruitt, J., Adlin, T. The Persona Lifecycle. Morgan Kaufmann (2006).","paperID":"None"},{"content":"Pruitt, J., Grudin, J. Personas: Practice and Theory. http://research.microsoft.com/en-us/um/people/jgrudin/publications/personas/pruitt-grudin.pdf (2003).","paperID":"None"},{"content":"Kari Rönkkö , Mats Hellman , Britta Kilander , Yvonne Dittrich, Personas is not applicable: local remedies interpreted in a wider context, Proceedings of the eighth conference on Participatory design: Artful integration: interweaving media, materials and practices, July 27-31, 2004, Toronto, Ontario, Canada","paperID":"1011884"},{"content":"Rashmi Sinha, Persona development for information-rich domains, CHI '03 Extended Abstracts on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"766017"},{"content":"van Velsen, L., van Gemert-Pijnen, L., Nijland, N., Beaujean, D. and van Steenbergen, J. Personas: The Linking Pin in Holistic Design for eHealth. In proc. eTELEMED 2012 (2012).","paperID":"None"}],"abstract":"The persona method is gaining widespread use and support. Many researchers have reported from single cases and novel domains how they have used the method. Few have conducted literature studies in order to identify and discuss the different understandings of the method. Fewer still have reported on ethnographic studies of practice. This paper falls within the last category, reporting on a study on how practitioners in Denmark use the method, and their perceptions of benefits and challenges when using the method. Finally, different casts of personas obtained from the involved companies are analyzed. The findings are compared to reported studies of practice. Contrary to the existing findings the study reports that the method is well integrated into existing practices.","video":"http://www.youtube.com/embed/1z2n2YhxfUs?rel=0","title":"Personas is applicable: a study on the use of personas in Denmark","filename":"CHI14/p1665","authors":["Lene Nielsen","Kira Storgaard Hansen"],"conference":"CHI '14"}