{"paperId":2557061,"citation":[{"content":"Airi Lampinen , Victoria Bellotti , Andrés Monroy-Hernández , Coye Cheshire , Alexandra Samuel, Studying the \"Sharing Economy\": Perspectives to Peer-to-Peer Exchange, Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2699339"},{"content":"Amy Voida , Zheng Yao , Matthias Korn, (Infra)structures of Volunteering, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675153"},{"content":"Patrick C. Shih , Victoria Bellotti , Kyungsik Han , John M. Carroll, Unequal Time for Unequal Value: Implications of Differing Motivations for Participation in Timebanking, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702560"},{"content":"Syed Ishtiaque Ahmed , Maruf Hasan Zaber , Mehrab Bin Morshed , Md. Habibullah Bin Ismail , Dan Cosley , Steven J. Jackson, Suhrid: A Collaborative Mobile Phone Interface for Low Literate People, Proceedings of the 2015 Annual Symposium on Computing for Development, December 01-02, 2015, London, United Kingdom","paperID":"2830640"},{"content":"John M. Carroll , Victoria Bellotti, Creating Value Together: The Emerging Design Space of Peer-to-Peer Currency and Exchange, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675270"},{"content":"Steven Tait , Chiara Leonardi , Massimo Zancanaro , Michele Caraviello , Bruno Lepri , Paolo Massa, Towards collaborative communities: a preliminary study on exchange of goods and services in local contexts, Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational, October 26-30, 2014, Helsinki, Finland","paperID":"2670260"},{"content":"Jennifer Ferreira , Mark Perry , Sriram Subramanian, Spending Time with Money: From Shared Values to Social Connectivity, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675230"},{"content":"Alex S. Taylor , Siân Lindley , Tim Regan , David Sweeney , Vasillis Vlachokyriakos , Lillie Grainger , Jessica Lingel, Data-in-Place: Thinking through the Relations Between Data and Community, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702558"},{"content":"Lone Malmborg , Ann Light , Geraldine Fitzpatrick , Victoria Bellotti , Margot Brereton, Designing for Sharing in Local Communities, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702645"},{"content":"Siân E. Lindley, Making Time, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675157"},{"content":"Susanne Bødker , Henrik Korsgaard , Joanna Saad-Sulonen, 'A Farmer, a Place and at least 20 Members': The Development of Artifact Ecologies in Volunteer-based Communities, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820029"},{"content":"Peng Liu , Xianghua Ding , Ning Gu, “Helping Others Makes Me Happy”: Social Interaction and Integration of People with Disabilities, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819998"},{"content":"Federico Cabitza , Angela Locoro , Carla Simone , Tunazzina Sultana, Moving Western Neighborliness to East?: A study on Local Exchange in Bangladesh, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819971"},{"content":"Victoria Bellotti , Alexander Ambard , Daniel Turner , Christina Gossmann , Kamila Demkova , John M. Carroll, A Muddle of Models of Motivation for Using Peer-to-Peer Economy Systems, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702272"}],"abstract":"Commercial peer-to-peer service exchange businesses, such as AirBnB, Lyft and TaskRabbit, are expanding rapidly, but their non-profit counterparts are lagging behind. We conducted a field study of the most prominent of these, timebanking; a system in which 'time dollars' are earned and spent by people providing services for and receiving them from each other. Our study exposed problems with the very metaphor of banking itself, which deter participation. In this paper we discuss how these problems can be tackled with user experience design for systems supporting timebanking. Our design ideas emphasize the personal and social benefits of participation, and avoid such unappealing concepts as debt and neediness that the timebanking metaphor falls afoul of.","video":"http://www.youtube.com/embed/RVoIEvgbyHs?rel=0","reference":[{"content":"AirBnB Global Growth in Guest Nights Booked. https://www.airbnb.com/global-growth.","paperID":"None"},{"content":"Barr, P. User-Interface Metaphors in Theory and in Practice. University of Wellington Master of Science Dissertation. (2003). http://www.pippinbarr.com/academic/Pippin_Barr_MSc_Thesis.pdf","paperID":"None"},{"content":"Batson, C. D. Prosocial motivation: Is it ever truly altruistic? In L. Berkowitz (Ed.), Advances in Experimental Social Psychology 20 (1987), 65--122.","paperID":"None"},{"content":"Batson, C. D. & Powell, A. A. Altruism and prosocial behavior. In T. Millon & M. J. Lerner (Eds.), Handbook of Psychology, Volume 5: Personality and Social Psychology. Hoboken, NJ, Wiley, (2003), 463--48","paperID":"None"},{"content":"Bellotti, V., Carroll, J.M., & Han, K. Random Acts of Kindness: The Intelligent and Context-Aware Future of Reciprocal Altruism and Community Collaboration. Proc. CTS 2013, IEEE (2013), 1--12.","paperID":"None"},{"content":"Binder, M. & Freytag, A. Volunteering, subjective well-being and public policy. Journal of Economic Psychology 34, 1 (2013), 97--119.","paperID":"None"},{"content":"Bowles, S. & Gintis, H. The evolution of strong reciprocity: cooperation in heterogeneous populations. Theoretical Popular Biology, 65, 1 (2004), 17--28.","paperID":"None"},{"content":"Brown, S. L., Nesse, R. M., Vinokur, A. D., & Smith, D. M. Providing social support may be more beneficial than receiving it: Results from a prospective study of mortality. Psychological Science 14, 4 (2003), 320--327.","paperID":"None"},{"content":"Cahn, E.S. & Barr, N. Service Credits: A New Currency for the Welfare State. Welfare State Programme Discussion Paper No WSP/8, Suntory-Toyota International Centre for Economics and Related Disciplines, London School of Economics, 1986.","paperID":"None"},{"content":"Cahn, E.S. No More Throw-Away People: The Co-Production Imperative. Essential Books, Washington, D.C., USA, 2000.","paperID":"None"},{"content":"Cahn, E.S. & Rowe J. Time Dollars: The New Currency that Enables Americans to Turn Their Hidden Resource -- Time -- Into Personal Security and Community Renewal. Rodale Press, Emmaus, PA, USA, 2000.","paperID":"None"},{"content":"Carroll, J.M. Co-production scenario for mobile time banking. Proc. IS-EUD 2013, Springer Berlin Heidelberg (2013), 137--152.","paperID":"None"},{"content":"Cialdini, R. B. Influence (rev): The Psychology of Persuasion. HarperCollins, New York, NY, USA, 1993.","paperID":"None"},{"content":"Cialdini, R. B. influence: Science and Practice. Allyn & Bacon, Boston, MA, USA, 2001.","paperID":"None"},{"content":"Coleman, J. S. Social capital in the creation of human capital. American Journal of Sociology (1988), S95--S120.","paperID":"None"},{"content":"Collom, E. The motivations, engagement, satisfaction, outcomes, and demographics of timebank participants: survey findings from a U.S. system. International Journal of Community Currency Research 11, (2007), 36--83.","paperID":"None"},{"content":"Collom, E. Motivations and differential participation in a community currency system: The dynamics within a local social movement organization. Sociological Forum, 26, 1 (2011), 144--168.","paperID":"None"},{"content":"Collom, E., Lasker, J.Y., & Kyriacou, C. Equal Time, Equal Value: Community Currencies and Time Banking in the US. Ashgate Publishing, Burlington, VT, USA, 2012.","paperID":"None"},{"content":"Sebastian Deterding , Miguel Sicart , Lennart Nacke , Kenton O'Hara , Dan Dixon, Gamification. using game-design elements in non-gaming contexts, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979575"},{"content":"Diener, E. & Biswas-Diener R. Will money increase subjective well-being?: A literature review and guide to needed research. Social Indicators Research 57, 2 (2002), 119--169.","paperID":"None"},{"content":"Diener, E. & Biswas-Diener, R. Happiness: Unlocking the Mysteries of Psychological Wealth. Wiley-Blackwell, Boston, MA, USA, 2008.","paperID":"None"},{"content":"Fehr, E. & Fischbacher, U. The nature of human altruism. Nature, 425, 6960 (2003), 785--791.","paperID":"None"},{"content":"Glynos, J. & Speed, E. Varieties of co-production in public services: Timebanks in a UK health policy context. Critical Policy Studies, 6, 4 (2012), 402--433.","paperID":"None"},{"content":"Jonathan Grudin, The case against user interface consistency, Communications of the ACM, v.32 n.10, p.1164-1173, Oct. 1989","paperID":"67934"},{"content":"Heady, B. The set point theory of well-being has serious flaws: On the eve of a scientific revolution? Social Indicators Research 97, 1 (2010), 7--21.","paperID":"None"},{"content":"Lakoff, G. & Johnson, M. Metaphors We Live By. The University of Chicago Press, Chicago, IL, USA, 1980.","paperID":"None"},{"content":"Lasker, J., Collom, E., Bealer, T., Niclaus, E., Keefe, J.Y. et al. Timebanking and health: The Role of a community currency organization in enhancing well-being. Health Promotion Practice 12, 1 (2011), 102--115.","paperID":"None"},{"content":"Lietaer, B. A. The Future of Money: Creating New Wealth, Work and a Wiser World. Random House, London, UK, 2000.","paperID":"None"},{"content":"Lyubomirsky, S., Sheldon, K. M., & Schkade, D. Pursuing happiness: The architecture of sustainable change. Review of General Psychology 9, 2 (2005), 111--131.","paperID":"None"},{"content":"Molnar, S. Time is of the essence: The challenges and achievements of a Swedish time banking initiative. International Journal of Community Currency Research 15, (2011), 13--22.","paperID":"None"},{"content":"Neale, D.C. & Carroll, J.M. The role of metaphors in user interface design. In: M. Helander et al. (Ed.), Handbook of Human-Computer Interaction. Elsevier, New York, NY, USA, (1997), 441--462.","paperID":"None"},{"content":"Nelson, T.H. The right way to think about software design. In B. Laurel, (Ed.), The Art of Human-Computer Interface Design, Addison-Wesley Publishing Company, (1990), 235--243.","paperID":"None"},{"content":"Ozanne, L.K. Learning to exchange time: Benefits and obstacles to time banking. International Journal of Community Currency Research 14, (2010), 1--16.","paperID":"None"},{"content":"Post, S. Altruism, happiness, and health: It's good to be good. International Journal of Behavioral Medicine 12, 2 (2005), 66--77.","paperID":"None"},{"content":"Regan, R. T. Effects of a favor and liking on compliance. Journal of Experimental Social Psychology 7 (1971), 627--639.","paperID":"None"},{"content":"Dirk Riehle , Heinz Züllighoven, Understanding and using patterns in software development, Theory and Practice of Object Systems, v.2 n.1, p.3-13, 1996","paperID":"246280"},{"content":"Robinson, D. & Bellotti, V. A preliminary taxonomy of gamification elements for varying anticipated commitment. Proc. ACM CHI 2013 Workshop on Designing Gamification: Creating Gameful and Playful Experiences. http://gamification-research.org/wp-content/uploads/2013/03/Robinson_Bellotti.pdf.","paperID":"None"},{"content":"Maung K. Sein , Robert P. Bostrom, Individual differences and conceptual models in training novice users, Human-Computer Interaction, v.4 n.3, p.197-229, September 1989","paperID":"1455745"},{"content":"Seligman, M. E. Authentic Happiness: Using the New Positive Psychology to Realize Your Potential for Lasting Fulfillment. Simon and Schuster, 2002.","paperID":"None"},{"content":"Seyfang, G. With a little help from my friends: Evaluating timebanks as a tool for community self-help. Local Economy 18, 3 (2003), 257--264.","paperID":"None"},{"content":"Seyfang, G. Time banks: Rewarding community self-help in the inner city? Community Development Journal 39, 1 (2004), 62--71.","paperID":"None"},{"content":"Seyfang, G. & Longhurst, N. Growing green money? Mapping community currencies for sustainable development. Ecological Economics 86 (2013), 65--77.","paperID":"None"},{"content":"Smilowitz, E. D. Do metaphors make Web browsers easier to use. Proc. Microsoft Workshop, Designing for the Web: Empirical Studies, Sandia National Lab, Albuquerque, NM, USA, 1996.","paperID":"None"},{"content":"Smith, D.C., Irby, C., Kimball, R., Verplank, B., & Harslem, E. Designing the Star user interface. Byte 7, 4 (1982), 242--282.","paperID":"None"},{"content":"Steger, M. F., Kashdan, T. B., & Oishi, S. Being good by doing good: Daily eudaimonic activity and well-being. Journal of Research in Personality, 42, 1 (2008), 22--42.","paperID":"None"},{"content":"Ivan E. Sutherland, Sketchpad: a man-machine graphical communication system, Proceedings of the May 21-23, 1963, spring joint computer conference, May 21-23, 1963, Detroit, Michigan","paperID":"1461591"},{"content":"Thoits, P. A. & Hewitt, L. N. Volunteer work and well-being. Journal of Health and Social Behavior 42, (2001), 115--131.","paperID":"None"},{"content":"Trivers, R. L. The evolution of reciprocal altruism. The Quarterly Review of Biology 46, 1 (1971), 35--57.","paperID":"None"}],"title":"","authors":""}