{"paperId":2557294,"citation":[],"reference":[{"content":"Bjork, R. A. (1994). Memory and metamemory considerations in the training of human beings. In J. Metcalfe and A. Shimamura (Eds.) Metacognition: Knowing about knowing. (pp.185--205). Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Chi, M. T., Glaser, R., & Rees, E. (1981). Expertise in problem solving. Pittsburgh: Learning Research and Development Center, University of Pittsburg","paperID":"None"},{"content":"Alexei Czeskis , Ivayla Dermendjieva , Hussein Yapit , Alan Borning , Batya Friedman , Brian Gill , Tadayoshi Kohno, Parenting from the pocket: value tensions and technical directions for secure and private parent-teen mobile safety, Proceedings of the Sixth Symposium on Usable Privacy and Security, July 14-16, 2010, Redmond, Washington","paperID":"1837130"},{"content":"Duschl, R. A., & Gitomer, D. H. (1991). Epistemological perspectives on conceptual change: Implications for educational practice. Journal of research in science teaching, 28(9), 839--858.","paperID":"None"},{"content":"Edelson, D. C., & Reiser, B. J. (2006). Making authentic practices accessible to learners: Design challenges and strategies. Cambridge handbook of the learning sciences, 335--354.","paperID":"None"},{"content":"Fegraus, E. H. , Lin, K., Ahumada, J. A., Baru, C., Chandra, S., Youn, C. Data acquisition and management software for camera trap data: A case study from the TEAM Network, Ecological Informatics, Volume 6, Issue 6, November 2011, Pages 345--353.","paperID":"None"},{"content":"Gallagher, J. (2002). The learning theory of Piaget and Inhelder. iUniverse.","paperID":"None"},{"content":"Gentner, D., & Toupin, C. (1988). Systematicity and surface similarity in the development of analogy. Cognitive Science, 10, 277--300.","paperID":"None"},{"content":"Hammerman, J. K., & Rubin, A. (2004). Strategies for managing statistical complexity with new software tools. Statistics Education Research Journal, 3(2), 17--41.","paperID":"None"},{"content":"Hancock, C., Kaput, J. J., & Goldsmith, L. T. (1992). Authentic enquiry with data: Critical barriers to classroom implementation. Educational Psychologist, 27(3), 337--364.","paperID":"None"},{"content":"Jeffrey Heer , Ben Shneiderman, Interactive dynamics for visual analysis, Communications of the ACM, v.55 n.4, April 2012","paperID":"2133821"},{"content":"Konold, C., & Higgins, T. L. (2002). Highlights of related research. In S. J. Russell, D. Schifter & V. Bastable (Eds.), Developing mathematical ideas (DMI): Working with data casebook, (pp. 165--201). Parsippany, NY: Dale Seymour Publications.","paperID":"None"},{"content":"Konold, C., Higgins, T. L., Russell, S. J., & Khalil, K. (2003). Data seen through different lenses. Unpublished manuscript, Amherst, MA.","paperID":"None"},{"content":"Konold, C., & Miller, C. (2004). TinkerPlotsTM Dynamic Data Exploration (Version Beta 1.0). Emeryville, CA: Key Curriculum Press.","paperID":"None"},{"content":"Krajcik, J., Blumenfeld, P., Marx, R. and Soloway, E. (2000). Instructional, curricular, and technological supports for inquiry in science classrooms. In J. Minstrell and E. H. van Zee (eds), Inquiring into Inquiry Learning and Teaching in Science (Washington, DC: American Association for the Advancement of Science), 283--315.","paperID":"None"},{"content":"Lee, H. and Songer, N. (2003). Making authentic science accessible to students, International Journal of Science Education, 25(8), 923--948.","paperID":"None"},{"content":"Linn, M. C., Clark, D., & Slotta, J. D. (2003). WISE design for knowledge integration. Science Education, 87, 517--538.","paperID":"None"},{"content":"Marx, R. W., Blumenfeld, P. C., Krajcik, J. S., Fishman, B., Soloway, E., Geier, R., & Tal, R. T. (2004). Inquiry-based science in the middle grades: Assessment of learning in urban systemic reform. Journal of Research in Science Teaching, 41(10), 1063--1080.","paperID":"None"},{"content":"Metz, K. E. (2004). Children's Understanding of Scientific Inquiry: Their Conceptualization of Uncertainty in Investigations of Their Own Design. Cog. and Instruction, 22(2), 219--290.","paperID":"None"},{"content":"Jessica K. Miller , Batya Friedman , Gavin Jancke , Brian Gill, Value tensions in design: the value sensitive design, development, and appropriation of a corporation's groupware system, Proceedings of the 2007 international ACM conference on Supporting group work, November 04-07, 2007, Sanibel Island, Florida, USA","paperID":"1316668"},{"content":"Moher, T., Brown, J., Reiser, B. J., Silva, A., Shelley, T., Lyons, L. (2013). The Urban Game Park: A Pilot Study of Student Investigations of Animal Behavior Using Motion-Detecting Cameras. American Educational Research Association Annual Meeting 2013.","paperID":"None"},{"content":"Piaget, J. (1977). Problems of equilibration. In Topics in cognitive development (pp. 3--13). Springer US.","paperID":"None"},{"content":"Reiser, B. J., Tabak, I., Sandoval, W. A., Smith, B. K., Steinmuller, F., & Leone, A. J. (2001). BGuILE: Strategic and conceptual scaffolds for scientific inquiry in biology classrooms. In S. M. Carver & D. Klahr (Eds.), Cognition and instruction: Twenty-five years of progress (pp. 263--305). Mahwah, NJ: Erlbaum.","paperID":"None"},{"content":"Resnick, M., Berg, R., & Eisenberg, M. (2000). Beyond black boxes: Bringing transparency and aesthetics back to scientific investigation. The Journal of the Learning Sciences, 9(1), 7--30.","paperID":"None"},{"content":"Silva , A., Dasgupta, C., Shelley, T., Lopez Silva, B. A., Lyons, L., Moher, T. (2014). Shaping the Construction of Learner Questions. In review: American Educational Research Association Annual Meeting 2014.","paperID":"None"},{"content":"Simons, D. J., & Keil, F. C. (1995). An abstract to concrete shift in the development of biological thought: the insides story. Cognition, 56(2), 129--163.","paperID":"None"},{"content":"Songer, N. (2006). BioKIDS: An Animated Conversation on the Development of Curricular Activity Structures for Inquiry Science. In R. K. Sawyer (Ed.), The Cambridge Handbook of the Learning Sciences. New York, NY: Cambridge University Press.","paperID":"None"},{"content":"Tobler, M. (2013). Camera Base. http://www.atriumbiodiversity.org/tools/camerabase/.","paperID":"None"},{"content":"Wellman, H. M., & Gelman, S. A. (1992). Cognitive development: foundational theories of core domains. Annual Review of Psychology, 43, 337--375.","paperID":"None"},{"content":"Daisy Yoo , Alina Huldtgren , Jill Palzkill Woelfer , David G. Hendry , Batya Friedman, A value sensitive action-reflection model: evolving a co-design space with stakeholder and designer prompts, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470715"}],"abstract":"The propagation of Inquiry Based Learning has lead to many more elementary students interacting with authentic scientific tools and practices. However, the more problematic realities of scientific data collection, such as noise and large data sets, are often deliberately hidden from students. Students will need to confront these realities and be able to make skillful data scoping decisions in order to make sense of ever more prevalent large datasets. We dub software designed to support these activities Information-Building Applications (IBAs). This paper presents the design considerations that went into building an exemplar IBA, PhotoMAT (Photo Management and Analysis Tool), a brief user study to show how the solutions enacted by following these principles are taken up by actual students, and a discussion of how the design considerations identified by our work might be applied to another IBA.","video":"http://www.youtube.com/embed/yGNKh9Vskxk?rel=0","title":"Information-building applications: designing for data exploration and analysis by elementary school students","filename":"CHI14/p2123","authors":["Tia Shelley","Leilah Lyons","Tom Moher","Chandan Dasgupta","Brenda Lopez Silva","Alexandra Silva"],"conference":"CHI '14"}