{"paperId":2557060,"citation":[{"content":"Sujin Jang , Niklas Elmqvist , Karthik Ramani, GestureAnalyzer: visual analytics for pattern analysis of mid-air hand gestures, Proceedings of the 2nd ACM symposium on Spatial user interaction, October 04-05, 2014, Honolulu, Hawaii, USA","paperID":"2659772"}],"reference":[{"content":"J. K. Aggarwal , Q. Cai, Human motion analysis: a review, Computer Vision and Image Understanding, v.73 n.3, p.428-440, March 1999","paperID":"312615"},{"content":"Barsalou, L. W. (2008). Grounded cognition. Annual Review of Psychology, 59, 617--645.","paperID":"None"},{"content":"Biswas, K., & Basu, S. K. (2011). Gesture recognition using Microsoft Kinect. International Conference on Automation, Robotics and Applications (ICARA).","paperID":"None"},{"content":"Nathan Bos , Judy Olson , Darren Gergle , Gary Olson , Zach Wright, Effects of four computer-mediated communications channels on trust development, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 20-25, 2002, Minneapolis, Minnesota, USA","paperID":"503401"},{"content":"Chartrand, T.L., & Bargh, J.A. (1999). The chameleon effect: The perception behavior link and social interaction. Journal of Personality & Social Psychology, 76, 893--910.","paperID":"None"},{"content":"Clark, H. H., & Brennan, S. E. (1991). Grounding in communication. In L. B. Resnick, J. M. Levine, & S. D. Teasley (Eds.), Perspectives on socially shared cognition (pp. 127--149). Washington, DC: APA.","paperID":"None"},{"content":"R L Daft , R H Lengel, Organizational information requirements, media richness and structural design, Management Science, v.32 n.5, p.554-571, May 1986","paperID":"8433"},{"content":"Driskell, J. E., & Radtke, P. H. (2003). The effect of gesture on speech production and comprehension. Human Factor, 45, 445--454.","paperID":"None"},{"content":"Dunbar, N. E., Jensen, M. L., & Burgoon, J. K. (2011). A dyadic approach to the detection of deception. Proceedings of the Annual Hawaii International Conference on System Sciences (HICSS).","paperID":"None"},{"content":"Susan R. Fussell , Leslie D. Setlock , Jie Yang , Jiazhi Ou , Elizabeth Mauer , Adam D. I. Kramer, Gestures over video streams to support remote collaboration on physical tasks, Human-Computer Interaction, v.19 n.3, p.273-309, September 2004","paperID":"1466558"},{"content":"Garrod, S., & Pickering, M. J. (2004). Why is conversation so easy? Trends in Cognitive Sci., 8, 8--11.","paperID":"None"},{"content":"Darren Gergle , Alan T. Clark, See what i'm saying?: using Dyadic Mobile Eye tracking to study collaborative reference, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958892"},{"content":"Giles, H. (1973). Accent mobility: A model and some data. Anthropological Linguistics, 15, 87--105.","paperID":"None"},{"content":"Giles, H., Coupland, J. & Coupland, N. (1991). Contexts of Accommodation. NY: Cambridge University Press.","paperID":"None"},{"content":"Goldin-Meadow, S. (1999). The role of gesture in communication and thinking. Trends in Cognitive Sciences, 3, 419--429.","paperID":"None"},{"content":"Kenny, D. A., Mannetti, L., Pierro, A., & Livi, S. (2002). The statistical analysis of data from small groups. J. Personality and Social Psych., 83, 126--137.","paperID":"None"},{"content":"Khoshelham, K, & Elberink, S. O. (2012). Accuracy and resolution of Kinect depth data for indoor mapping applications. Sensor, 1437--1454.","paperID":"None"},{"content":"Krauss, R. M., Chen, Y., & Chawla, P. (1996). Nonverbal behavior and nonverbal communication: What do conversational hand gestures tell us? In M. Zanna (Ed.), Advances in Experimental Social Psychology (pp. 389--450). Academic Press.","paperID":"None"},{"content":"Littell, R., Milliken, G. A., Stroup, W. W., & Wolfinger, R. D. (1996). SAS system for mixed models. SAS Inst.","paperID":"None"},{"content":"Mauer, R. E., & Tindall, J. H. (1983). Effects of postural congruence on client's perceptions of counselor empathy. J. Counseling Psych., 30, 158--163.","paperID":"None"},{"content":"McNeill, D. (2005). Gesture and thought. Chicago: University of Chicago Press.","paperID":"None"},{"content":"Niederhoffer, K., & Pennebaker, J.W. (2002). Linguistic style matching in social interaction. Journal of Language & Social Psychology, 21(4), 337--360.","paperID":"None"},{"content":"Osborn, A. (1957). Applied Imagination. NY: Scribner.","paperID":"None"},{"content":"Poppe, R., Van Der Zee, S., Heylen, D. K., & Taylor, P. J. (2013). AMAB: Automated measurement and analysis of body motion. Behavior Research Methods.","paperID":"None"},{"content":"Pickering, M. J., & Garrod, S. (2004). Toward a mechanistic psychology of dialogue. Behavioral and Brain Sciences, 27, 169--190.","paperID":"None"},{"content":"Reyes, M., Dominguez, G., & Escalera, S. (2011). Feature weighting in dynamic time warping for gesture recognition in depth data. Proceedings of ICCV Workshops 2011.","paperID":"None"},{"content":"Lauren E. Scissors , Alastair J. Gill , Kathleen Geraghty , Darren Gergle, In CMC we trust: the role of similarity, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518783"},{"content":"Leslie D. Setlock , Susan R. Fussell , Christine Neuwirth, Taking it out of context: collaborating within and across cultures in face-to-face settings and via instant messaging, Proceedings of the 2004 ACM conference on Computer supported cooperative work, November 06-10, 2004, Chicago, Illinois, USA","paperID":"1031712"},{"content":"L Sproull , S Kiesler, Reducing social context cues: electronic mail in organizational communication, Management Science, v.32 n.11, p.1492-1512, Nov. 1986","paperID":"8428"},{"content":"Elizabeth S. Veinott , Judith Olson , Gary M. Olson , Xiaolan Fu, Video helps remote work: speakers who need to negotiate common ground benefit from seeing each other, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.302-309, May 15-20, 1999, Pittsburgh, Pennsylvania, USA","paperID":"303067"},{"content":"Hao-Chuan Wang , Susan F. Fussell , Leslie D. Setlock, Cultural difference and adaptation of communication styles in computer-mediated group brainstorming, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518806"},{"content":"Hao-Chuan Wang , Susan Fussell, Groups in groups: conversational similarity in online multicultural multiparty brainstorming, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718980"},{"content":"Hao-Chuan Wang , Susan R. Fussell , Dan Cosley, From diversity to creativity: stimulating group brainstorming with cultural differences and conversationally-retrieved pictures, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958864"},{"content":"Whittaker, S., & O'Conaill, B. (1997). The role of vision in face-to-face and mediated communication. In K. E. Finn, A. J. Sellen, & S. B. Wilbur (Eds.), Videomediated communication (pp. 23--49).","paperID":"None"},{"content":"Takeshi Yabe , Katsumi Tanaka, Similarity Retrieval of Human Motion As Multi-Stream Time Series Data, Proceedings of the 1999 International Symposium on Database Applications in Non-Traditional Environments, p.279, November 28-30, 1999","paperID":"789191"}],"abstract":"One key difference between face-to-face (F2F) communication and computer-mediated communication (CMC) is the availability of visual cues. It is often assumed that the reduction of visibility in audio and video conferencing may negatively impact the use of gesture to communicate, and thus negatively influence other outcomes. In this paper we \"Kinect-taped\" F2F and CMC communication in brainstorming groups by using motion sensors to record and analyze group members' hand movements during communication. We investigate how different media influence gesture use and gestural similarity, and how the use of gesture associates with level of understanding and brainstorming performance. Implications to future research and design are discussed.","video":"http://www.youtube.com/embed/QlbDovH0IzA?rel=0","title":"Kinect-taped communication: using motion sensing to study gesture use and similarity in face-to-face and computer-mediated brainstorming","filename":"CHI14/p3205","authors":["Hao-Chuan Wang","Chien-Tung Lai"],"conference":"CHI '14"}