{"paperId":2557334,"reference":[{"content":"Birch, J. Diagnosis of defective color vision. Oxford : Butterworth-Heinemann, 2001.","paperID":"None"},{"content":"Birch, J. Efficiency of the Ishihara test for identifying red-green color vision deficiency. Ophthalmic Physiol Opt 17, 5 (1997), 403'8.","paperID":"None"},{"content":"Birch, J. Use of the Farnsworth'Munsell 100'Hue test in the examination of congenital color vision defects, Ophthalmic and Physiological Optics, Wiley Online Library, 1998.","paperID":"None"},{"content":"Choi, S.Y., Hwang, J.M. Ishihara test in 3- to 6-year-old children, Jpn J Ophthalmol 53 5 (2009), 455--7","paperID":"None"},{"content":"Cotter S.A., Lee, French A.L. Evaluation of a new color vision test: 'Color Vision Testing Made Easy. Optom Vis Sci 76 (1999), 631'6.","paperID":"None"},{"content":"Dain, S.J.Clinical colour vision tests, Clin Exp Optom 87 4--5 (2004), 276--293","paperID":"None"},{"content":"Dougherty, B., Wade, A. Vischeck simulates colourblind vision. http://www.vischeck.com","paperID":"None"},{"content":"Dimitris Grammenos , Anthony Savidis , Constantine Stephanidis, Designing universally accessible games, Computers in Entertainment (CIE), v.7 n.1, February 2009","paperID":"1486516"},{"content":"Hoffmann, A., Menozzi, M. Applying the Ishihara test to a PC-based screening system, Displays 20 1 (1998), 39--47","paperID":"None"},{"content":"Kohei, M. Color Universal Design (CUD)-- How to make figures and presentations that are friendly to Colorblind people. http://jfly.iam.u-tokyo.ac.jp/color/#see","paperID":"None"},{"content":"Ling, B.Y., Dain, S.J. Color vision in children and the Lanthony New Color Test. Visual Neuroscience 25 (2008), 441--444.","paperID":"None"},{"content":"Melamud, A., Hagstrom, S., Traboulsi, E. I., Color vision testing, Ophthalmic Genetics 25 3 (2004), 159' 187.","paperID":"None"},{"content":"Neitz, M., Neitz, J. A new mass screening test for colorvision deficiencies in children, Color Research & Application, Special Issue: In Proc of the International Color Vision Society 26 S1 (2001), 239--249.","paperID":"None"},{"content":"NPD Group. Among American kids ages 2--17, 82 percent report that are gamers. Press Release (Dec 2) Port Washington, New York, 2009.","paperID":"None"},{"content":"Pardo, P.J. PeÂrez, A.L., Suero, A.L. A new color vision test in a PC-based screening system, Displays 21 5 (2002), 203--6","paperID":"None"},{"content":"Soegaard, M. Gestalt principles of form perception. www.interactiondesign.org/encyclopedia/gestalt_principles_of_form_per ception.html","paperID":"None"}],"citation":[{"content":"Ellen Yi-Luen Do, Creating Unique Technology for Everyone, Proceedings of the ASEAN CHI Symposium'15, p.42-45, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2780363"}],"abstract":"This paper presents 'DoDo's Catching Adventure,' a new color vision deficient screening test for young children. Early detection of color blindness among children is useful for parents and teachers to better understand children's needs, to overcome difficulties in learning, and for life and career planning. Unfortunately, current color screening tests are not designed for young children; most require more advanced verbal or cognitive skills. DoDo game has taken a new approach by embedding game elements into a color vision screening test. A user study conducted at Singapore National Eye Centre on twenty-eight children, identified fourteen as Red-Green deficient subjects as did by Ishihara screening test, showed that DoDo was adequately effective in identifying Red-Green color vision deficiency and comparable to two current gold standard colorblind tests, Ishihara and D15.","video":"http://www.youtube.com/embed/T2BUMrS10yQ?rel=0","title":"DoDo game, a color vision deficiency screening test for young children","filename":"CHI14/p2289","authors":["Linh Chi Nguyen","Ellen Yi-Luen Do","Audrey Chia","Yuan Wang","Henry Been-Lirn Duh"],"conference":"CHI '14"}