{"paperId":2557160,"reference":[{"content":"Gazihan Alankus , Amanda Lazar , Matt May , Caitlin Kelleher, Towards customizable games for stroke rehabilitation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753649"},{"content":"Allen, N.E., Canning, C.G., Sherrington, C., Lord, S.R., Latt, M.D., Close, J.C.T., O'Rourke, S.D., Murray, S.M., Fung, V.S.C., 2010. The effects of an exercise program on fall risk factors in people with Parkinson's disease: A randomized controlled trial. Mov. Disord. 25, 1217--1225.","paperID":"None"},{"content":"Bangor, A., Kortum, P.T., Miller, J.T., 2008. An Empirical Evaluation of the System Usability Scale. Int. J. Hum.-Comput. Interact. 24, 574--594.","paperID":"None"},{"content":"Campbell, A., 1999. Falls prevention over 2 years: a randomized controlled trial in women 80 years and older. Age Ageing 28, 513--518.","paperID":"None"},{"content":"Chui, K., Hood, E., Klima, D., 2012. Meaningful Change in Walking Speed. Top. Geriatr. Rehabil. 28, 97--103.","paperID":"None"},{"content":"Cumming, R.G., Thomas, M., Szonyi, G., Frampton, G., Salkeld, G., Clemson, L., 2001. Adherence to occupational therapist recommendations for home modifications for falls prevention. Am. J. Occup. Ther. Off. Publ. Am. Occup. Ther. Assoc. 55, 641--648.","paperID":"None"},{"content":"Garcia, J.A., Felix Navarro, K., Schoene, D., Smith, S.T., Pisan, Y., 2012. Exergames for the elderly: towards an embedded Kinect-based clinical test of falls risk. Stud. Health Technol. Inform. 178, 51--57.","paperID":"None"},{"content":"Gardner, M.M., Buchner, D.M., Robertson, M.C., Campbell, A.J., 2001. Practical implementation of an exercise-based falls prevention programme. Age Ageing 30, 77--83.","paperID":"None"},{"content":"Kathrin Gerling , Ian Livingston , Lennart Nacke , Regan Mandryk, Full-body motion-based game interaction for older adults, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208324"},{"content":"Jurkiewicz, M.T., Marzolini, S., Oh, P., 2011. Adherence to a Home-Based Exercise Program for Individuals After Stroke. Top. Stroke Rehabil. 18, 277--284.","paperID":"None"},{"content":"McNulty, P., Mouawad, M., Doust, C., Max, M., 2011. Wii-based movement therapy to promote improved upper extremity function post-stroke: A pilot study. J. Rehabil. Med. 43, 527--533.","paperID":"None"},{"content":"Microsoft Kinect for Xbox 360 (Accessed September 2013). http://www.xbox.com/en-US/kinect.","paperID":"None"},{"content":"Morton, L., Baillie, L., Ramirez-Iniguez, R., 2013. Pose Calibrations for Inertial Sensors in Rehabilitation Applications. IEEE WiMob 2013 conference (In Press).","paperID":"None"},{"content":"Nintendo Wii (Accessed Sept 2013) http://www.nintendo.co.uk/NOE/en_GB/wii_54.html.","paperID":"None"},{"content":"Nyman, S.R., Victor, C.R., 2011. Older people's recruitment, sustained participation, and adherence to falls prevention interventions in institutional settings: a supplement to the Cochrane systematic review. Age Ageing 40, 430--436.","paperID":"None"},{"content":"Quach, L., Galica, A.M., Jones, R.N., Procter-Gray, E., Manor, B., Hannan, M.T., Lipsitz, L.A., 2011. The Nonlinear Relationship Between Gait Speed and Falls: The Maintenance of Balance, Independent Living, Intellect, and Zest in the Elderly of Boston Study. J. Am. Geriatr. Soc. 59, 1069--1073.","paperID":"None"},{"content":"Rademaker, A., Linden, S.V. der, Wiersinga, J., 2009. SilverFit, a virtual rehabilitation system. Gerontechnology 8.","paperID":"None"},{"content":"Radomski, M.V., 2011. More than good intentions: advancing adherence to therapy recommendations. Am. J. Occup. Ther. Off. Publ. Am. Occup. Ther. Assoc. 65, 471--477.","paperID":"None"},{"content":"Saposnik, G., Teasell, R., Mamdani, M., Hall, J., McIlroy, W., Cheung, D., Thorpe, K.E., Cohen, L.G., Bayley, M., 2010. Effectiveness of Virtual Reality Using Wii Gaming Technology in Stroke Rehabilitation: A Pilot Randomized Clinical Trial and Proof of Principle. Stroke 41, 1477--1484.","paperID":"None"},{"content":"Sherrington, C., Tiedemann, A., Fairhall, N., Close, J.C.T., Lord, S.R., 2011. Exercise to prevent falls in older adults: an updated meta-analysis and best practice recommendations. NSW, Public Heal. Bull. 22, 78.","paperID":"None"},{"content":"Skelton, D., 2005. Tailored group exercise (Falls Management Exercise -- FaME) reduces falls in community-dwelling older frequent fallers (an RCT). Age Ageing 34, 636--639.","paperID":"None"},{"content":"Sugarman, H., Weisel-Eichler, A., Burstin, A., Brown, R., 2009. Use of the Wii Fit system for the treatment of balance problems in the elderly: A feasibility study. IEEE, pp. 111--116.","paperID":"None"},{"content":"Tinetti, M.E., Baker, D.I., McAvay, G., Claus, E.B., Garrett, P., Gottschalk, M., Koch, M.L., Trainor, K., Horwitz, R.I., 1994. A multifactorial intervention to reduce the risk of falling among elderly people living in the community. N. Engl. J. Med. 331, 821--827.","paperID":"None"},{"content":"Stephen Uzor , Lynne Baillie, Exploring & designing tools to enhance falls rehabilitation in the home, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466159"},{"content":"Stephen Uzor , Lynne Baillie , Dawn Skelton, Senior designers: empowering seniors to design enjoyable falls rehabilitation tools, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208568"},{"content":"Van Uden, C.J.T., Besser, M.P., 2004. Test-retest reliability of temporal and spatial gait characteristics measured with an instrumented walkway system (GAITRite). BMC Musculoskelet. Disord. 5, 13.","paperID":"None"},{"content":"Viccaro, L.J., Perera, S., Studenski, S.A., 2011. Is Timed Up and Go Better Than Gait Speed in Predicting Health, Function, and Falls in Older Adults': IS TIMED UP AND GO BETTER THAN GAIT SPEED? J. Am. Geriatr. Soc. 59, 887--892.","paperID":"None"},{"content":"Anthony Whitehead , Nick Crampton , Kaitlyn Fox , Hannah Johnston, Sensor networks as video game input devices, Proceedings of the 2007 conference on Future Play, November 14-17, 2007, Toronto, Canada","paperID":"1328210"},{"content":"Yong Joo, L., Soon Yin, T., Xu, D., Thia, E., Pei Fen, C., Kuah, C., Kong, K., 2010. A feasibility study using interactive commercial off-the-shelf computer gaming in upper limb rehabilitation in patients after stroke. J. Rehabil. Med. 42, 437--441.","paperID":"None"},{"content":"Young, W., Ferguson, S., Brault, S., Craig, C., 2011. Assessing and training standing balance in older adults: a novel approach using the \"Nintendo Wii\" Balance Board. Gait Posture 33, 303--305.","paperID":"None"}],"citation":[{"content":"Guanyun Wang , Ye Tao , Dian Yu , Chuan Cao , Hongyu Chen , Cheng Yao, Trainer: a motion-based interactive game for balance rehabilitation training, Proceedings of the adjunct publication of the 27th annual ACM symposium on User interface software and technology, October 05-08, 2014, Honolulu, Hawaii, USA","paperID":"2658783"},{"content":"Marilyn Lennon , Lynne Baillie , Jettie Hoonhout , Judy Robertson , Geraldine Fitzpatrick, Crossing HCI and Health: Advancing Health and Wellness Technology Research in Home and Community Settings, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702652"},{"content":"Carlos Miguel Dias de Brito , João Tiago Pinheiro Neto Jacob , Rui Nóbrega , António Manuel Nogueira Santos, Balance Assessment in Fall-Prevention Exergames, Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, October 26-28, 2015, Lisbon, Portugal","paperID":"2811342"},{"content":"Kathrin Gerling , Bob De Schutter , Julie Brown , Jason Allaire, Ageing Playfully: Advancing Research on Games for Older Adults Beyond Accessibility and Health Benefits, Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, October 05-07, 2015, London, United Kingdom","paperID":"2810261"},{"content":"Jan David Smeddinck , Marc Herrlich , Rainer Malaka, Exergames for Physiotherapy and Rehabilitation: A Medium-term Situated Study of Motivational Aspects and Impact on Functional Reach, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702598"},{"content":"Richard Tang , Xing-Dong Yang , Scott Bateman , Joaquim Jorge , Anthony Tang, Physio@Home: Exploring Visual Guidance and Feedback Techniques for Physiotherapy Exercises, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702401"},{"content":"Kathrin M. Gerling , Regan L. Mandryk , Conor Linehan, Long-Term Use of Motion-Based Video Games in Care Home Settings, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702125"},{"content":"Fedwa Laamarti , Mohamad Eid , Abdulmotaleb El Saddik, An overview of serious games, International Journal of Computer Games Technology, 2014, p.11-11, January 2014","paperID":"2728206"}],"abstract":"Rehabilitation has been shown to significantly reduce the risk of falling in older adults. However, low adherence to rehabilitation exercises in the home means that seniors often do not get the therapy that they require. We propose that the use of tailored exergames could encourage adherence to falls rehabilitation in the home, as exergames have proved successful in clinical settings. We describe the results from the first known study to investigate the long-term (12 weeks) use of exergames, designed in close collaboration with elderly users, for falls rehabilitation in the home. Our findings suggest that there is an untapped potential of exergames for home rehabilitation use, as our findings show that there was better adherence to exercise in participants who used the exergames, versus those who used standard care. Finally, we make recommendations for designers, on the design of exergames for the rehabilitation of seniors.","video":"http://www.youtube.com/embed/IO2KdOujp_4?rel=0","title":"Investigating the long-term use of exergames in the home with elderly fallers","filename":"CHI14/p2813","authors":["Stephen Uzor","Lynne Baillie"],"conference":"CHI '14"}