{"paperId":2557177,"abstract":"This work explores the role of communication technologies during romantic couple conflict, and the impact that self-esteem has on behavior, preferences for communication channels, and attitudes about mediated communication during conflict. Results revealed that lower levels of self-esteem and communicating via text messaging (vs. face-to-face) were associated with increased distancing and perceived partner distancing behaviors. Lower levels of self-esteem and using mediated communication were also associated with a greater likelihood of thinking that a conflict had a negative impact on the relationship. Yet, there was no evidence to suggest that individuals with lower levels of self-esteem exhibited more negative behaviors and perceptions in text-based communication than in FtF communication. In addition, lower levels of self-esteem were associated with increased use of and preferences for text-based mediated communication over FtF communication during conflict. Overall, this study suggests that both self-esteem and communication channel impact the nature of romantic couple conflict.","reference":[{"content":"Bellavia, G., & Murray, S. (2003). Did I do that' Selfesteem related differences in reactions to romantic partners' moods. Personal Relationships, 10, 77--95.","paperID":"None"},{"content":"Burge, J., & Tatar, D. (2009). Affect and dyads: Conflict across different technological media. In S. Harrison (Ed.), Media Space 20+ Years of Mediated Life (pp. 123--144): Springer.","paperID":"None"},{"content":"Coyne, S. M., Stockdale, L., Busby, D., Iverson, B., & Grant, D. M. (2011). \"I luv u :)\": A descriptive study of the media use of individuals in romantic relationships. Family Relations, 60, 150--162.","paperID":"None"},{"content":"Ehrenberg, A., Juckes, S., White, K. M., & Walsh, S. P. (2008). Personality and self-esteem as predictors of young people's technology use. CyberPsychology & Behavior, 11(6), 739--741.","paperID":"None"},{"content":"Frisby, B. N., & Westerman, D. (2010). Rational actors: Channel selection and rational choices in romantic conflict episodes. Journal of Social and Personal Relationships, 27(7), 970--981.","paperID":"None"},{"content":"Hess, J. A. (2000). Maintaining nonvoluntary relationships with disliked partners: An investigation into the use of distancing behaviors. Human Communication Research, 26(3), 458--488.","paperID":"None"},{"content":"Johnson, K. L., & Roloff, M. E. (2000). Correlates of the perceived resolvability and relational consequences of serial arguing in dating relationships: Argumentative features and the use of coping strategies. Journal of Social and Personal Relationships, 17(4--5), 676--686.","paperID":"None"},{"content":"Joinson, A. N. (2004). Self-esteem, interpersonal risk, and preference for e-mail to face-to-face communication. CyberPsych.ology & Behavior, 7(4), 479--485.","paperID":"None"},{"content":"Kiecolt-Glaser, J. K., & Newton, T. L. (2001). Marriage and health: His and hers. Psychological Bulletin, 127(4), 472--503.","paperID":"None"},{"content":"Marigold, D. C., Holmes, J. G., & Ross, M. (2007). More than words: Reframing compliments from romantic partners fosters security in low self-esteem individuals. Journal of Personality and Social Psychology, 92(2), 232--248.","paperID":"None"},{"content":"Merkle, E. R., & Richardson, R. A. (2000). Digital dating and virtual relating: Conceptualizing computer mediated romantic relationships. Family Relations, 49, 187--192.","paperID":"None"},{"content":"Mitchell, M. M., Rankin, C. T., D'Urso, S. C., & Malone, P. (2002). The impact of intention to handle conflict face-to-face or via e-mail on perceived conflict resolution style. Paper presented at ICA 2002.","paperID":"None"},{"content":"Morey, J. N., Gentzler, A. L., Creasy, B., Oberhauser, A. M., & Westerman, D. (2013). Young adults' use of communication technology within their romantic relationships and associations with attachment style. Computers in Human Behavior, 29, 1771--1778.","paperID":"None"},{"content":"Murray, S. L., Bellavia, G., Rose, R., & Griffin, D. (2003). Once hurt, twice hurtful: How perceived regard regulates daily marital inter- action. Journal of Personality and Social Psychology, 84, 126--147.","paperID":"None"},{"content":"Murray, S. L., Holmes, J. G., & Griffin, D. W. (2000). Self-esteem and the quest for felt security: How perceived regard regulates attachment processes. J. of Personality and Social Psychology, 78(3), 478--498.","paperID":"None"},{"content":"Murray, S. L., Rose, P., Bellavia, G. M., Holmes, J. G., & Kusche, A. G. (2002). When rejection stings: How self-esteem constrains relationship-enhancement processes. Interpersonal Relations and Group Processes, 83(3), 556--573.","paperID":"None"},{"content":"Ofcom (2013). Communications Market Report 2013. http://stakeholders.ofcom.org.uk/binaries/research/cmr/c mr13/2013_UK_CMR.pdf.","paperID":"None"},{"content":"O'Sullivan, P. B. (2000). What you don't know won't hurt me: Impression management functions of communication channels in relationships. Human Communication Research, 26(3), 403--431.","paperID":"None"},{"content":"Ramirez, A., Walther, J. B., Burgoon, J. K., & Sunnafrank, M. (2002). Information-seeking strategies, uncertainty, and computer-mediated communication: Toward a conceptual model. Human Communication Research, 28(2), 213--228.","paperID":"None"},{"content":"Roloff, M., & Soule, K. (2002). Interpersonal Conflict: A review. In M. L. Knapp & J. A. Daly (Eds.), Handbook of Interpersonal Communication, 3rd edition. Thousand Oaks, CA: Sage.","paperID":"None"},{"content":"Rosenberg, M. (1965). Society and the adolescent selfimage. Princeton, NJ: Princeton University Press.","paperID":"None"},{"content":"Rusbult, C. E., Martz, J. M., & Agnew, C. R. (1998). The investment model scale: Measuring commitment level, satisfaction level, quality of alternatives, and investment size. Personal Relationships, 5, 357--391.","paperID":"None"},{"content":"Lauren E. Scissors , Darren Gergle, \"Back and forth, back and forth\": channel switching in romantic couple conflict, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441804"},{"content":"Turner, M. M., D'Urso, S. C., Rankin, C. T., & Malone, P. C. (2003). Cognition during conflict: The impact of communication medium and perceived intentions on attributions. Paper presented at ICA 2003.","paperID":"None"},{"content":"Walther, J. B. (1992). Interpersonal effects in computermediated interaction: A relational perspective. Communication Research, 19(1), 52--90.","paperID":"None"},{"content":"Xuan Zhao , Victoria Schwanda Sosik , Dan Cosley, It's complicated: how romantic partners use facebook, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207788"}],"citation":[{"content":"Lauren Scissors , Moira Burke , Steven Wengrovitz, What's in a Like?: Attitudes and behaviors around receiving Likes on Facebook, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820066"},{"content":"Lauren Scissors , Darren Gergle, On the bias: Self-esteem biases across communication channels during romantic couple conflict, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820080"},{"content":"Noah Liebman , Darren Gergle, It's (Not) Simply a Matter of Time: The Relationship Between CMC Cues and Interpersonal Affinity, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819945"}],"title":"Room for interpretation: the role of self-esteem and CMC in romantic couple conflict","filename":"CHI14/p3953","authors":["Lauren E. Scissors","Michael E Roloff","Darren Gergle"],"conference":"CHI '14"}