{"paperId":2557262,"citation":[{"content":"Avi Segal , Ya'akov (Kobi) Gal , Robert J. Simpson , Victoria Victoria Homsy , Mark Hartswood , Kevin R. Page , Marina Jirotka, Improving Productivity in Citizen Science through Controlled Intervention, Proceedings of the 24th International Conference on World Wide Web, May 18-22, 2015, Florence, Italy","paperID":"2743051"},{"content":"Andrea Wiggins , Yurong He, Community-based Data Validation Practices in Citizen Science, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820063"},{"content":"Corey Jackson , Carsten Østerlund , Veronica Maidel , Kevin Crowston , Gabriel Mugar, Which Way Did They Go?: Newcomer Movement through the Zooniverse, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2835197"}],"reference":[{"content":"Amabile, T. M., Hill, K. G., Hennessey, B. A., and Tighe, E. M. The Work Preference Inventory: Assessing intrinsic and extrinsic motivational orientations. Journal of Personality and Social Psychology 66(5) (1994), 950.","paperID":"None"},{"content":"Borst, W. A. M. Understanding Crowdsourcing: Effects of motivation and rewards on participation and performance in voluntary online activities (2010). hdl.handle.net/1765/1.","paperID":"None"},{"content":"Bowser, A., Hansen, D., and Preece, J. Gamifying Citizen Science: Lessons and Future Directions. Workshop on Designing Gamification: Creating Gameful and Playful Experiences (2013).","paperID":"None"},{"content":"Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative research in psychology 3(2) (2006), 77--101.","paperID":"None"},{"content":"Causer, T. and Wallace, V. Building A Volunteer Community: Results and Findings from Transcribe Bentham. Digital Humanities Quarterly 6(2) (2012).","paperID":"None"},{"content":"Crowston, K. and Fagnot, I. The motivational arc of massive virtual collaboration. Proc IFIP WG 9.5 Working Conference on Virtuality and Society: Massive Virtual Communities (2008).","paperID":"None"},{"content":"Kevin Crowston , Nathan R. Prestopnik, Motivation and Data Quality in a Citizen Science Game: A Design Science Evaluation, Proceedings of the 2013 46th Hawaii International Conference on System Sciences, p.450-459, January 07-10, 2013","paperID":"2471287"},{"content":"Crowds and Communities: Light and Heavyweight Models of Peer Production, Proceedings of the 42nd Hawaii International Conference on System Sciences, p.1-10, January 05-08, 2009","paperID":"1490017"},{"content":"Ioanna Iacovides , Charlene Jennett , Cassandra Cornish-Trestrail , Anna L. Cox, Do games attract or sustain engagement in citizen science?: a study of volunteer motivations, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468553"},{"content":"Lintott, C., Schawinski, K., Keel, W., et al. Galaxy Zoo: 'Hanny's Voorwerp', a quasar light echo? (2009). arxiv.org/abs/0906.5304.","paperID":"None"},{"content":"Elaine Massung , David Coyle , Kirsten F. Cater , Marc Jay , Chris Preist, Using crowdsourcing to support pro-environmental community activism, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470708"},{"content":"Newman, G., Wiggins, A., Crall, A., Graham, E., Newman, S., and Crowston, K. The future of citizen science: emerging technologies and shifting paradigms. Frontiers in Ecology and the Environment 10(6) (2012), 298--304.","paperID":"None"},{"content":"Nov, O., Arazy, O., and Anderson, D. Technology-Mediated Citizen Science Participation: A Motivational Model. Proc ICWSM (2011).","paperID":"None"},{"content":"Oded Nov , Ofer Arazy , David Anderson, Dusting for science: motivation and participation of digital citizen science volunteers, Proceedings of the 2011 iConference, p.68-74, February 08-11, 2011, Seattle, Washington","paperID":"1940771"},{"content":"Nathan R. Prestopnik , Kevin Crowston, Gaming for (Citizen) Science: Exploring Motivation and Data Quality in the Context of Crowdsourced Science through the Design and Evaluation of a Social-Computational System, Proceedings of the 2011 IEEE Seventh International Conference on e-Science Workshops, p.28-33, December 05-08, 2011","paperID":"2117582"},{"content":"Raddick, M. J., Bracey, G., Gay, P. L., et al. Galaxy Zoo: Exploring the Motivations of Citizen Science Volunteers. Astronomy Education Review 9(1) (2010), 010103.","paperID":"None"},{"content":"Raddick, M. J., Bracey, G., Gay, P. L., et al. Galaxy Zoo: Motivations of Citizen Scientists. arXiv preprint (2013) arXiv:1303.6886.","paperID":"None"},{"content":"Raymond, E. S. The Cathedral and the Bazaar. First Monday 3(3) (1998).","paperID":"None"},{"content":"Jason Reed , M. Jordan Raddick , Andrea Lardner , Karen Carney, An Exploratory Factor Analysis of Motivations for Participating in Zooniverse, a Collection of Virtual Citizen Science Projects, Proceedings of the 2013 46th Hawaii International Conference on System Sciences, p.610-619, January 07-10, 2013","paperID":"2471409"},{"content":"Romeo, F. and Blaser, L. Bringing Citizen Scientists and Historians Together. Proc Museums and the Web (2011).","paperID":"None"},{"content":"Dana Rotman , Jenny Preece , Jen Hammock , Kezee Procita , Derek Hansen , Cynthia Parr , Darcy Lewis , David Jacobs, Dynamic changes in motivation in collaborative citizen-science projects, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145238"},{"content":"Wiggins, A. and Crowston, K. Developing a conceptual model of virtual organisations for citizen science. International Journal of Organisational Design and Engineering 1(1) (2010), 148--162.","paperID":"None"},{"content":"Zooniverse: Old Weather - Our Weather's Past, the Climate's Future. www.oldweather.org/.","paperID":"None"},{"content":"Zooniverse: Purpose. www.zooniverse.org/about.","paperID":"None"}],"abstract":"In most online citizen science projects, a large proportion of participants contribute in small quantities. To investigate how low contributors differ from committed volunteers, we distributed a survey to members of the Old Weather project, followed by interviews with respondents selected according to a range of contribution levels. The studies reveal a complex relationship between motivations and contribution. Whilst high contributors were deeply engaged by social or competitive features, low contributors described a solitary experience of 'dabbling' in projects for short periods. Since the majority of participants exhibit this small-scale contribution pattern, there is great potential value in designing interfaces to tempt lone workers to complete 'just another page', or to lure early drop-outs back into participation. This includes breaking the work into components which can be tackled without a major commitment of time and effort, and providing feedback on the quality and value of these contributions.","video":"http://www.youtube.com/embed/zOPCmtfLfRw?rel=0","title":"Designing for dabblers and deterring drop-outs in citizen science","filename":"CHI14/p2985","authors":["Alexandra Eveleigh","Charlene Jennett","Ann Blandford","Philip Brohan","Anna L. Cox"],"conference":"CHI '14"}