{"paperId":2557387,"citation":[{"content":"Helena M. Mentis , Ahmed Rahim , Pierre Theodore, Crafting the Image in Surgical Telemedicine, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819978"},{"content":"Torgeir K. Haavik, Keep your coats on: augmented reality and sensework in surgery and surgical telemedicine, Cognition, Technology and Work, v.18 n.1, p.175-191, February  2016","paperID":"2883794"}],"reference":[{"content":"Margunn Aanestad, The Camera as an ActorDesign-in-Use of Telemedicine Infrastructure inSurgery, Computer Supported Cooperative Work, v.12 n.1, p.1-20, February 2003","paperID":"635490"},{"content":"Alac, M. (2008). Working with brain scans: Digital images and gestural interaction in fMRI laboratory. Social Studies of Science, 38(4), 483--508.","paperID":"None"},{"content":"Roman Bednarik, Expertise-dependent visual attention strategies develop over time during debugging with multiple code representations, International Journal of Human-Computer Studies, v.70 n.2, p.143-155, February, 2012","paperID":"2072965"},{"content":"Bohan, M., McConnell, D.S., Chaparro, A., Thompson, S. G. (2010). The effects of visual magnification and physical movement scale on the manipulation of a tool with indirect vision. Journal of Experimental Psychology: Applied, 16(1), 33--44.","paperID":"None"},{"content":"Bosk, C. (1979) Forgive and Remember: Managing Medical Failure. Chicago: University of Chicago Press.","paperID":"None"},{"content":"Breedveld, P. & Wentink, M. (2001). Eye-hand coordination in laparoscopy - An overview of experiments and supporting aids. Minimally Invasive Therapy and Allied Technologies, 10(3), 155--162.","paperID":"None"},{"content":"Burri, R.V. (2008) Boundary work and symbolic capital in radiology. Social Studies of Science, 38(1), 35--62.","paperID":"None"},{"content":"Charness, N., Reingold, E., Pomplun, M., & Stampe, D. (2001). The perceptual aspect of skilled performance in chess: Evidence from eye movements. Memory & Cognition, 29(8), 1146--1152.","paperID":"None"},{"content":"Dolezal, L. (2009). The remote body: The phenomenology of telepresence and re-embodiment. Human Technology, 5(2), 208--226.","paperID":"None"},{"content":"Shahram Eivazi , Roman Bednarik , Markku Tukiainen , Mikael von und zu Fraunberg , Ville Leinonen , Juha E. Jääskeläinen, Gaze behaviour of expert and novice microneurosurgeons differs during observations of tumor removal recordings, Proceedings of the Symposium on Eye Tracking Research and Applications, March 28-30, 2012, Santa Barbara, California","paperID":"2168641"},{"content":"Ellis, R. D., Cao, A., Pandya, A., Composto, A., Chacko, M., Klein, M. D., & Auner, G. (2004). In optimizing the surgeon-robot interface: The effect of control-display gain and zoom level on movement time. HFES, 1713--1717.","paperID":"None"},{"content":"Ferrel, C., Leifflen, D., Orliaguett, J. P., & Coello, Y (2000). Pointing movement visually controlled through a video display: Adaptation to scale change. Ergonomics, 43, 461--473.","paperID":"None"},{"content":"David Feygin , Madeleine Keehner , Frank Tendick, Haptic Guidance: Experimental Evaluation of a Haptic Training Method for a Perceptual Motor Skill, Proceedings of the 10th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, p.40, March 24-25, 2002","paperID":"797513"},{"content":"Gallagher, S. (2005). How the body shapes the mind. Oxford: Oxford University Press.","paperID":"None"},{"content":"Goodwin, C. (1994). Professional vision. American Anthropologist, 96(3), 606--633.","paperID":"None"},{"content":"Goodwin, C. (2000). Practice of color classification. Mind, Culture, and Activity, 7(1-2), 19--36.","paperID":"None"},{"content":"Hanna, G. B., Shimi, S. M., Cuschieri, A. (1998). Task performance in endoscopic surgery is influenced by location of the image display. Ann. of Surg., 227, 481--4.","paperID":"None"},{"content":"Heath, C. & Hindmarsh, J. (2000). Configuring action in objects: From mutual space to media space. Mind, Culture and Activity, 7(1-2), 81--104.","paperID":"None"},{"content":"Christian Heath , Paul Luff, Disembodied conduct: communication through video in a multi-media office environment, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.99-103, April 27-May 02, 1991, New Orleans, Louisiana, USA","paperID":"108859"},{"content":"Christian Heath , Paul Luff, Media space and communicative asymmetries: preliminary observations of video-mediated interaction, Human-Computer Interaction, v.7 n.3, p.315-346, September 1992","paperID":"1461849"},{"content":"Christian Heath , Paul Luff, Technology in Action, Cambridge University Press, New York, NY, 2000","paperID":"556346"},{"content":"Hindmarsh, J., Reynolds, P. and Dunne, S. (2011). Exhibiting Understanding: the body in apprenticeship. Journal of Pragmatics, 43 (2), 489--503.","paperID":"None"},{"content":"Hindmarsh, J. & Heath C. (2000). Embodied reference: A study of deixis in workplace interaction. Journal of Pragmatics, 32, 1855--1878.","paperID":"None"},{"content":"Hirschauer, S. (1991). The manufacture of bodies in surgery. Social Studies of Science, 21(2), 279--319.","paperID":"None"},{"content":"Ihde, D. (2002). Bodies in Technology. Minneapolis, MN: University of Minnesota Press.","paperID":"None"},{"content":"Ellen A. Isaacs , John C. Tang, What video can and cannot do for collaboration: a case study, Multimedia Systems, v.2 n.2, p.63-73, Aug. 1994","paperID":"194822"},{"content":"Rose Johnson , Kenton O'Hara , Abigail Sellen , Claire Cousins , Antonio Criminisi, Exploring the potential for touchless interaction in image-guided interventional radiology, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979436"},{"content":"Jones, D. B., Maithel, S. K., & Schneider, B. E. (2006). Laparoscopic Cholecystectomy. In Jones, D. B., Maithel, S. K., & Schneider, B. E. (eds) Atlas of Minimally Invasive Surgery, Cine-Med, Inc.,Woodbury (CT), pp 12--39.","paperID":"None"},{"content":"Joyce, K. (2005). Appealing images: Magnetic resonance imaging and the production of authoritative knowledge. Social Studies of Science, 35(3), 437--462.","paperID":"None"},{"content":"Kaplan, B. (1995). Objectification and negotiation in interpreting clinical images: Implications for computerbased patient records. Artificial Intelligence in Medicine, 7, 439--454.","paperID":"None"},{"content":"Kasarskis, P., Stehwien, J., Hickox, J., Aretz, A., & Wickens, C. (2001). Comparison of expert and novice scan behaviors during vfr flight. In Proceedings of the 11th International Symposium on Aviation Psychology.","paperID":"None"},{"content":"Koschmann, T., LeBaron, C., Goodwin, C., & Feltovich, P. (2011). \"Can you see the cystic artery yet?\" A simple matter of trust. Journal of Pragmatics, 43(2), 521--541.","paperID":"None"},{"content":"Koschmann, T., LeBaron, C., Goodwin, C., Zemel, A. and Dunnington, G. (2007) Formulating the \"Triangle of Doom\", Gesture, 7, 1, 97--118.","paperID":"None"},{"content":"Langolf, G. D., Chaffin, D. B., & Foulke, J. A. (1976). An investigation of Fitts' law using a wide range of movement amplitudes. Journal of Motor Behavior, 8, 113--128.","paperID":"None"},{"content":"Lave, J. and Wenger, E. (1991) Situated Learning: Legitimate Peripheral Participation. Cambridge, MA: Cambridge University Press.","paperID":"None"},{"content":"Benjamin Law , M. Stella Atkins , A. E. Kirkpatrick , Alan J. Lomax, Eye gaze patterns differentiate novice and experts in a virtual laparoscopic surgery training environment, Proceedings of the 2004 symposium on Eye tracking research & applications, p.41-48, March 22-24, 2004, San Antonio, Texas","paperID":"968370"},{"content":"Luff, P. K., Hindmarsh, J. J. and Heath, C. C. (eds) (2000) Workplace Studies: Recovering Work Practice and Informing System Design. New York and Cambridge: Cambridge University Press.","paperID":"None"},{"content":"Helena M. Mentis , Alex S. Taylor, Imaging the body: embodied vision in minimally invasive surgery, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466197"},{"content":"Helena M. Mentis , Kenton O'Hara , Abigail Sellen , Rikin Trivedi, Interaction proxemics and image use in neurosurgery, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208536"},{"content":"Mondada, L. (2003). Working with video: how surgeons produce video records of their actions. Visual Studies, 18(1), 58--73.","paperID":"None"},{"content":"Nishizaka, A. (2000). Seeing what one sees: Perception, emotion and activity. Mind, Culture, and Activity, 7(12), 105--123.","paperID":"None"},{"content":"Kenton O'hara , Richard Harper , Helena Mentis , Abigail Sellen , Alex Taylor, On the naturalness of touchless: Putting the “interaction” back into NUI, ACM Transactions on Computer-Human Interaction (TOCHI), v.20 n.1, p.1-25, March 2013","paperID":"2442111"},{"content":"Pope, C. (2002). Contingency in everyday surgical work. Sociology of Health and Illness, 24, 4, 369--84.","paperID":"None"},{"content":"Prasad, A. (2005). Making images/making bodies: Visibilizing and disciplining through magnetic resonance imaging. Science, Technology & Human Values, 30(2), 291--316.","paperID":"None"},{"content":"Prentice, R. (2007). Drilling surgeons: the social lessons of embodied surgical learning, Science, Technology and Human Values, 32(5), 534--53.","paperID":"None"},{"content":"Suchman, L. (2000). Embodied practices of engineering work. Mind, Culture and Activity, 7(1-2), 4--18.","paperID":"None"},{"content":"Svensson, M. S., Luff, P., & Heath, C. (2009). Embedding instruction in practice: Contingency and collaboration during surgical training. Sociology of Health and Illness, 31(6), 889--906.","paperID":"None"},{"content":"Tang, J. & Isaacs, E. (1993). Why do users like video? Studies of multimedia-supported collaboration. Computer Supported Cooperative Work, 1(3), 163--196.","paperID":"None"},{"content":"Tendrick, F., Bhoyrul, S., & Way, L. W. (1997). Comparison of laparoscopic imaging systems and conditions using a knot tying task. Computer Aided Surgery, 2, 24--33.","paperID":"None"},{"content":"Tendrick, F., Jennings, R., Tharp, G., & Stark, L. (1993). Sensing and manipulation problems in endoscopic surgery: Experiment, analysis and observation. Presence: Teleoperators and Virtual Environments, 2, 66--81.","paperID":"None"},{"content":"Geoffrey Tien , M. Stella Atkins , Bin Zheng , Colin Swindells, Measuring situation awareness of surgeons in laparoscopic training, Proceedings of the 2010 Symposium on Eye-Tracking Research & Applications, March 22-24, 2010, Austin, Texas","paperID":"1743703"},{"content":"Ueno, N. (2000). Ecologies of inscriptions: Technologies of making the social organization of work and the mass production of machine parts visible in collaborative activity. Mind, Culture, and Activity, 7(12), 59--80.","paperID":"None"},{"content":"Van Doorn, R. R. A., Unema, P. J. A. (2005). Effects of adaptation to altered display gain on the control of single aimed movements. Motor Control, 9, 3--22.","paperID":"None"},{"content":"Van Wynsberghe, A., & Gastmans, P. (2008). Telesurgery: An ethical appraisal. Journal of Medical Ethics, 34(10), e22.","paperID":"None"}],"abstract":"Learning the practices and the performance of physically manipulating instruments in minimally invasive surgeries is an impetus for the development of surgical training simulators. However, an often-overlooked aspect of surgical training is learning how to see the body through the various imaging mechanisms. With this study, we address the ways in which surgeons demonstrate and instruct residents in seeing the body during minimally invasive surgical procedures. Drawing on observations and analysis of video recordings of minimally invasive surgical operations, we examine how particular anatomy and movement within the body to see and conceptualize that anatomy are made visible by the instructive practices of the surgeon. We use these findings to discuss further directions for minimally invasive surgical training through mechanisms for making the body visible during situated surgical training and surgical training simulation systems.","video":"http://www.youtube.com/embed/G-GIwtiuQLk?rel=0","title":"Learning to see the body: supporting instructional practices in laparoscopic surgical procedures","filename":"CHI14/p2113","authors":["Helena M. Mentis","Amine Chellali","Steven Schwaitzberg"],"conference":"CHI '14"}