{"paperId":2557176,"citation":[{"content":"Walter S. Lasecki , Mitchell Gordon , Steven P. Dow , Jeffrey P. Bigham, Glance: enabling rapid interactions with data using the crowd, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2574817"},{"content":"Walter S. Lasecki, Powering interactive intelligent systems with the crowd, Proceedings of the adjunct publication of the 27th annual ACM symposium on User interface software and technology, October 05-08, 2014, Honolulu, Hawaii, USA","paperID":"2661168"},{"content":"Reuben Kirkham , Carlton Shepherd , Thomas Plötz, BlobSnake: gamification of feature extraction for 'plug and play' human activity recognition, Proceedings of the 2015 British HCI Conference, July 13-17, 2015, Lincoln, Lincolnshire, United Kingdom","paperID":"2783579"},{"content":"Walter S. Lasecki , Mitchell Gordon , Danai Koutra , Malte F. Jung , Steven P. Dow , Jeffrey P. Bigham, Glance: rapidly coding behavioral video with the crowd, Proceedings of the 27th annual ACM symposium on User interface software and technology, October 05-08, 2014, Honolulu, Hawaii, USA","paperID":"2647367"},{"content":"Walter S. Lasecki , Luz Rello , Jeffrey P. Bigham, Measuring text simplification with the crowd, Proceedings of the 12th Web for All Conference, May 18-20, 2015, Florence, Italy","paperID":"2746658"}],"reference":[{"content":"James F. Allen, Towards a general theory of action and time, Artificial Intelligence, v.23 n.2, p.123-154, July 1984","paperID":"1065"},{"content":"Lydia B. Chilton , Greg Little , Darren Edge , Daniel S. Weld , James A. Landay, Cascade: crowdsourcing taxonomy creation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466265"},{"content":"Lasecki, W.S., White, S., Murray, K.I., and Bigham, J. P. Crowd memory: Learning the collective. CI 2012.","paperID":"None"},{"content":"Lasecki, W. S., Song, Y. C., Kautz, H., and Bigham, J. P. Training activity recognition systems online using real-time crowdsourcing. CSCW 2012.","paperID":"None"},{"content":"Greg Little , Lydia B. Chilton , Max Goldman , Robert C. Miller, TurKit: human computation algorithms on mechanical turk, Proceedings of the 23nd annual ACM symposium on User interface software and technology, October 03-06, 2010, New York, New York, USA","paperID":"1866040"},{"content":"Quinn, E. J., Bederson, B. B., Yeh, T., and Lin, J. Crowdflow: Integrating machine learning with mechanical turk for speed-cost-quality flexibility. Tech. Rep., University of Maryland, 2010.","paperID":"None"},{"content":"Richardson, M., and Domingos, P. Learning with knowledge from multiple experts ICML 2003.","paperID":"None"},{"content":"Tapia, E., Intille, S., and Larson, K. Activity recognition the home using simple and ubiquitous sensors. Pervasive 2004.","paperID":"None"},{"content":"Zhao, L., Sukthankar, G., and Sukthankar, R. Robust active learning using crowdsourced annotations for activity recognition. HC 2011.","paperID":"None"}],"abstract":"Activity recognition can provide computers with the context underlying user inputs, enabling more relevant responses and more fluid interaction. However, training these systems is difficult because it requires observing every possible sequence of actions that comprise a given activity. Prior work has enabled the crowd to provide labels in real-time to train automated systems on-the-fly, but numerous examples are still needed before the system can recognize an activity on its own. To reduce the need to collect this data by observing users, we introduce ARchitect, a system that uses the crowd to capture the dependency structure of the actions that make up activities. Our tests show that over seven times as many examples can be collected using our approach versus relying on direct observation alone, demonstrating that by leveraging the understanding of the crowd, it is possible to more easily train automated systems.","video":"http://www.youtube.com/embed/_bMQmViZqaY?rel=0","title":"Finding dependencies between actions using the crowd","filename":"CHI14/p3095","authors":["Walter S. Lasecki","Leon Weingard","George Ferguson","Jeffrey P. Bigham"],"conference":"CHI '14"}