{"paperId":2557253,"citation":[{"content":"Todd Kulesza , Margaret Burnett , Weng-Keen Wong , Simone Stumpf, Principles of Explanatory Debugging to Personalize Interactive Machine Learning, Proceedings of the 20th International Conference on Intelligent User Interfaces, March 29-April 01, 2015, Atlanta, Georgia, USA","paperID":"2701399"},{"content":"Nathan Souviraà-Labastie , Anaik Olivero , Emmanuel Vincent , Frédéric Bimbot, Multi-channel audio source separation using multiple deformed references, IEEE/ACM Transactions on Audio, Speech and Language Processing (TASLP), v.23 n.11, p.1775-1787, November 2015","paperID":"2824164"}],"reference":[{"content":"Saleema Amershi , Bongshin Lee , Ashish Kapoor , Ratul Mahajan , Blaine Christian, CueT: human-guided fast and accurate network alarm triage, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1978966"},{"content":"Battenberg, E., and Wessel, D. Accelerating non-negative matrix factorization for audio source separation on multi-core and many-core architectures. In Proc. ISMIR (2009), 501--506.","paperID":"None"},{"content":"Bogaards, N., Röbel, A., and Rodet, X. Sound analysis and processing with audiosculpt 2. In Proc. ICMC (2004).","paperID":"None"},{"content":"C. G. v. d. Boogaart , R. Lienhart, Audio brush: a tool for computer-assisted smart audio editing, Proceedings of the 1st ACM workshop on Audio and music computing multimedia, October 27-27, 2006, Santa Barbara, California, USA","paperID":"1178741"},{"content":"Bryan, N. J., and Mysore, G. J. An efficient posterior regularized latent variable model for interactive sound source separation. In Proc. ICML (2013).","paperID":"None"},{"content":"Bryan, N. J., and Mysore, G. J. Interactive refinement of supervised and semi-supervised sound source separation estimates. In Proc. ICASSP (2013).","paperID":"None"},{"content":"Bryan, N. J., Mysore, G. J., and Wang, G. Source separation of polyphonic music with interactive user-feedback on a piano roll display. In Proc. ISMIR (2013).","paperID":"None"},{"content":"Cohn, D., Caruana, R., and Mccallum, A. Semi-supervised clustering with user feedback. In Constrained Clustering: Advances in Algorithms, Theory, and Applications, S. Basu, I. Davidson, and K. Wagstaff, Eds. Chapman & Hall/CRC, 2008.","paperID":"None"},{"content":"Jean-Louis Durrieu , Jean-Philippe Thiran, Musical audio source separation based on user-selected f0 track, Proceedings of the 10th international conference on Latent Variable Analysis and Signal Separation, March 12-15, 2012, Tel Aviv, Israel","paperID":"2187380"},{"content":"V. Emiya , E. Vincent , N. Harlander , V. Hohmann, Subjective and Objective Quality Assessment of Audio Source Separation, IEEE Transactions on Audio, Speech, and Language Processing, v.19 n.7, p.2046-2057, September 2011","paperID":"2335954"},{"content":"Jerry Alan Fails , Dan R. Olsen, Jr., Interactive machine learning, Proceedings of the 8th international conference on Intelligent user interfaces, January 12-15, 2003, Miami, Florida, USA","paperID":"604056"},{"content":"Cédric Févotte , Nancy Bertin , Jean-Louis Durrieu, Nonnegative matrix factorization with the itakura-saito divergence: With application to music analysis, Neural Computation, v.21 n.3, p.793-830, March 2009","paperID":"1512591"},{"content":"Rebecca Anne Fiebrink , Perry R. Cook, Real-time human interaction with supervised learning algorithms for music composition and performance, Princeton University, Princeton, NJ, 2011","paperID":"2125776"},{"content":"James Fogarty , Desney Tan , Ashish Kapoor , Simon Winder, CueFlik: interactive concept learning in image search, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357061"},{"content":"Fowler, T. Giraffe (modified). http://www.flickr.com/photos/j33pman/7701103436/, 2012. Attribution-NonCommercial-ShareAlike 2.0 Generic License.","paperID":"None"},{"content":"Free Software Foundation. GPL Version 3. http://gplv3.fsf.org/, 2007.","paperID":"None"},{"content":"Frigo, M., and Johnson, S. G. The design and implementation of FFTW3. Proc. of the IEEE Special Issue on Program Generation, Optimization, and Platform Adaptation 93, 2 (2005), 216--231.","paperID":"None"},{"content":"Kuzman Ganchev , João Graça , Jennifer Gillenwater , Ben Taskar, Posterior Regularization for Structured Latent Variable Models, The Journal of Machine Learning Research, 11, p.2001-2049, 3/1/2010","paperID":"1859918"},{"content":"Guennebaud, G., Jacob, B., et al. Eigen v3. http://eigen.tuxfamily.org, 2010.","paperID":"None"},{"content":"Thomas Hofmann, Probabilistic latent semantic indexing, Proceedings of the 22nd annual international ACM SIGIR conference on Research and development in information retrieval, p.50-57, August 15-19, 1999, Berkeley, California, USA","paperID":"312649"},{"content":"Lee, D. D., and Seung, H. S. Algorithms for non-negative matrix factorization. In Proc. NIPS (2001), 556--562.","paperID":"None"},{"content":"Lefèvre, A., Bach, F., and Févotte, C. Semi-supervised nmf with time-frequency annotations for single-channel source separation. In Proc. ISMIR (2012).","paperID":"None"},{"content":"Ono, N., Koldovsky, Z., Miyabe, S., and Ito, N. The 2013 signal separation evaluation campaign. In Machine Learning for Signal Processing (MLSP), 2013 IEEE International Workshop on, IEEE (2013), 1--6.","paperID":"None"},{"content":"Ozerov, A., Févotte, C., Blouet, R., and Durrieu, J.-L. Multichannel nonnegative tensor factorization with structured constraints for user-guided audio source separation. In Proc. ICASSP (May 2011), 257--260.","paperID":"None"},{"content":"Ozerov, A., Vincent, E., and Bimbot, F. A general flexible framework for the handling of prior information in audio source separation. IEEE Transactions on Audio, Speech, and Language Processing 20, 4 (2012), 1118--1133.","paperID":"None"},{"content":"Raj, B., and Smaragdis, P. Latent variable decomposition of spectrograms for single channel speaker separation. In Proc. IEEE WASPAA (2005), 17--20.","paperID":"None"},{"content":"Carsten Rother , Vladimir Kolmogorov , Andrew Blake, \"GrabCut\": interactive foreground extraction using iterated graph cuts, ACM SIGGRAPH 2004 Papers, August 08-12, 2004, Los Angeles, California","paperID":"1015720"},{"content":"Burr Settles, Closing the loop: fast, interactive semi-supervised annotation with queries on features and instances, Proceedings of the Conference on Empirical Methods in Natural Language Processing, July 27-31, 2011, Edinburgh, United Kingdom","paperID":"2145588"},{"content":"SiSEC Audio Committee. Signal separation evaluation campaign (sisec). http://sisec.wiki.irisa.fr/tiki-index.php, 2013.","paperID":"None"},{"content":"Paris Smaragdis, User guided audio selection from complex sound mixtures, Proceedings of the 22nd annual ACM symposium on User interface software and technology, October 04-07, 2009, Victoria, BC, Canada","paperID":"1622193"},{"content":"Smaragdis, P., and Brown, J. Non-negative matrix factorization for polyphonic music transcription. In IEEE WASPAA (2003), 177--180.","paperID":"None"},{"content":"Smaragdis, P., and Mysore, G. J. Separation by \"humming\": User-guided sound extraction from monophonic mixtures. In Proc. IEEE WASPAA (2009), 69--72.","paperID":"None"},{"content":"Smaragdis, P., Raj, B., and Shashanka, M. A probabilistic latent variable model for acoustic modeling. In NIPS Workshop on Advances in Modeling for Acoustic Processing (2006).","paperID":"None"},{"content":"Paris Smaragdis , Bhiksha Raj , Madhusudana Shashanka, Supervised and semi-supervised separation of sounds from single-channel mixtures, Proceedings of the 7th international conference on Independent component analysis and signal separation, September 09-12, 2007, London, UK","paperID":"1776739"},{"content":"Storer, J. JUCE (Jules' Utility Class Extensions). http://rawmaterialsoftware.com/juce.php, 2013. online.","paperID":"None"},{"content":"Simone Stumpf , Vidya Rajaram , Lida Li , Margaret Burnett , Thomas Dietterich , Erin Sullivan , Russell Drummond , Jonathan Herlocker, Toward harnessing user feedback for machine learning, Proceedings of the 12th international conference on Intelligent user interfaces, January 28-31, 2007, Honolulu, Hawaii, USA","paperID":"1216316"},{"content":"Justin Talbot , Bongshin Lee , Ashish Kapoor , Desney S. Tan, EnsembleMatrix: interactive visualization to support machine learning with multiple classifiers, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518895"},{"content":"E. Vincent , R. Gribonval , C. Fevotte, Performance measurement in blind audio source separation, IEEE Transactions on Audio, Speech, and Language Processing, v.14 n.4, p.1462-1469, July 2006","paperID":"2210050"},{"content":"Tuomas Virtanen, Monaural Sound Source Separation by Nonnegative Matrix Factorization With Temporal Continuity and Sparseness Criteria, IEEE Transactions on Audio, Speech, and Language Processing, v.15 n.3, p.1066-1074, March 2007","paperID":"2210082"}],"abstract":"Traditional audio editing tools do not facilitate the task of separating a single mixture recording (e.g. pop song) into its respective sources (e.g. drums, vocal, etc.). Such ability, however, would be very useful for a wide variety of audio applications such as music remixing, audio denoising, and audio-based forensics. To address this issue, we present ISSE - an interactive source separation editor. ISSE is a new open-source, freely available, and cross-platform audio editing tool that enables a user to perform source separation by painting on time-frequency visualizations of sound, resulting in an interactive machine learning system. The system brings to life our previously proposed interaction paradigm and separation algorithm that learns from user-feedback to perform separation. For evaluation, we conducted user studies and compared results between inexperienced and expert users. For a variety of real-world tasks, we found that inexperienced users can achieve good separation quality with minimal instruction and expert users can achieve state-of-the-art separation quality.","video":"http://www.youtube.com/embed/m8pyoAcd5Mo?rel=0","title":"ISSE: an interactive source separation editor","filename":"CHI14/p257","authors":["Nicholas J. Bryan","Gautham J. Mysore","Ge Wang"],"conference":"CHI '14"}