{"paperId":2557364,"citation":[{"content":"Mu Mu , Mark Rouncefield , Yehia Elkhatib , Steven Simpson , Jacco Taal , Nicholas Race, Ethical Challenges in Collaborative Storytelling, Proceedings of the 2015 ACM SIGCOMM Workshop on Ethics in Networked Systems Research, August 21-21, 2015, London, United Kingdom","paperID":"2793019"},{"content":"Christian B. J. Hansen, When brain computer interfaces move from research to commercial use, ACM SIGCAS Computers and Society, v.45 n.3, p.356-360, September 2015","paperID":"2874292"},{"content":"Steve Benford , Chris Greenhalgh , Bob Anderson , Rachel Jacobs , Mike Golembewski , Marina Jirotka , Bernd Carsten Stahl , Job Timmermans , Gabriella Giannachi , Matt Adams , Ju Row Farr , Nick Tandavanitj , Kirsty Jennings, The Ethical Implications of HCI's Turn to the Cultural, ACM Transactions on Computer-Human Interaction (TOCHI), v.22 n.5, p.1-37, August 2015","paperID":"2775107"}],"reference":[{"content":"Barben, D., Fisher, E., Selin, C., and Guston, D. Anticipatory governance of nanotechnology: Foresight, Engagement, and Integration. In The Handbook of Science and technology Studies, Hackett, E., Amsterdamska, O., Lynch, M., Wajcman, J., eds., MIT Press, Cambridge (2007), 979--1000.","paperID":"None"},{"content":"Eric P.S. Baumer , M. Six Silberman, When the implication is not to design (technology), Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979275"},{"content":"Beck, U. Risk society: towards a new modernity. Sage Publications, London ; Newbury Park, Calif, 1992.","paperID":"None"},{"content":"Botero, A. Expanding design space(s) - design in communal endeavours, PhD Thesis. Aalto University, School of Arts, Design and Architecture, 2013.","paperID":"None"},{"content":"Bowen, S. Critical theory and participatory design. In Proc. CHI 2010, ACM Press (2010).","paperID":"None"},{"content":"Eden G., Jirotka, M. and Stahl, B. Responsible Research and Innovation: Critical reflection into the potential social consequences of ICT. IEEE RCIS 2013 (2013).","paperID":"None"},{"content":"Franqueira, T. Reshaping urban lives - design as a social intervention towards community networks. In Proc. IASDR 2007 (2007).","paperID":"None"},{"content":"Batya Friedman, Value-sensitive design, interactions, v.3 n.6, p.16-23, Nov./Dec. 1996","paperID":"242493"},{"content":"William W. Gaver , John Bowers , Andrew Boucher , Hans Gellerson , Sarah Pennington , Albrecht Schmidt , Anthony Steed , Nicholas Villars , Brendan Walker, The drift table: designing for ludic engagement, CHI '04 Extended Abstracts on Human Factors in Computing Systems, April 24-29, 2004, Vienna, Austria","paperID":"985947"},{"content":"Greenhalgh, T., Wherton, J., Sugarhood, P., Hinder, S., Procter, R., and Stones, R. What matters to older people with assisted living needs? A phenomenological analysis of the use and non-use of telehealth and telecare. Social Science & Medicine 93 (2013), 86--94.","paperID":"None"},{"content":"Gregory, J. Scandinavian approaches to participatory design. Internat. J. of Engineering Education 19, 1 (2003), 62--74.","paperID":"None"},{"content":"Guston, D.H., and Sarewitz, D. Real-time technology assessment. Technology in Society 24 (2002), 93--109.","paperID":"None"},{"content":"Lars Hallnäs , Johan Redström, Slow Technology – Designing for Reflection, Personal and Ubiquitous Computing, v.5 n.3, p.201-212, August 2001","paperID":"593604"},{"content":"Vicki L. Hanson, Influencing technology adoption by older adults, Interacting with Computers, v.22 n.6, p.502-509, November, 2010","paperID":"1879937"},{"content":"Haraway, D. Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective. In Simians, Cyborgs, and Women. The Reinvention of Nature. Free Association Books, London (1991), 183--201.","paperID":"None"},{"content":"R. Harper , D. Randall , N. Smyth , C. Evans , L. Heledd , R. Moore, The past is a different place: they do things differently there, Proceedings of the 7th ACM conference on Designing interactive systems, p.271-280, February 25-27, 2008, Cape Town, South Africa","paperID":"1394474"},{"content":"Healy, T. The unanticipated consequences of technology. In Nanotechnology: ethical and social Implications, A.S. Khan, ed. Taylor & Francis, Boca Raton, FL (2012), 155--174.","paperID":"None"},{"content":"Hill, L., Roberts, G., Wildgoose, J., Perkins, R., and Hahn, S. Recovery and person-centred care in dementia: common purpose, common practice? Advances in Psychiatric Treatment 16 (2010), 288--298.","paperID":"None"},{"content":"Hofmann, J. B. http://www.janellburleyhofmann.com/slow-techmanifesto/","paperID":"None"},{"content":"Holmes, M. Emotional reflexivity in contemporary friendships: understanding it using Elias and Facebook etiquette. Sociological Research Online 16, 1 (2011).","paperID":"None"},{"content":"Hyysalo, S. Health technology development and use. From practice bound imaginations to evolving impacts. Routledge, London, 2010.","paperID":"None"},{"content":"Inside Out of Mind. http://www.meetinggroundtheatrecompany.co.uk/projec ts/inside-out-of-mind","paperID":"None"},{"content":"Steven J. Jackson , Sarah Barbrow, Infrastructure and vocation: field, calling and computation in ecology, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2481397"},{"content":"Kelly, P., Marshall, S.J., Badland, H., Kerr, J., Oliver, M., Doherty, A.R., and Foster, C. An ethical framework for automated, wearable cameras in health behavior research. Am. J. of Prev. Medicine 44 (2013), 314--319.","paperID":"None"},{"content":"Larab, A., Conchon, E., Bastide, R., and Singer, N. A sustainable software architecture for home care monitoring applications. In Proc. IEEE DEST (2012).","paperID":"None"},{"content":"Latour, B. We have never been modern. Harvard University Press, Cambridge, Mass, 1993.","paperID":"None"},{"content":"Lynch, M. Against reflexivity as an academic virtue and source of privileged knowledge. Theory Culture Society 17 (2000): 26--54.","paperID":"None"},{"content":"Leadbeater, C. The user innovation revolution: how business can unlock the value of customers' ideas. National Consumer Council, London, 2006.","paperID":"None"},{"content":"Lezaun, J., and Soneryd, L. Consulting citizens: technologies of elicitation and the mobility of publics. Public Understanding of Science 16 (2007), 279--297.","paperID":"None"},{"content":"Wendy Moncur, The emotional wellbeing of researchers: considerations for practice, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466248"},{"content":"Mort, M., Roberts, C., and Milligan, C. Telecare and older people: Re-ordering social relations. In Towards Responsible Research and Innovation in the Information and Communication Technologies and Security Technologies Fields, R. Schomberg, ed. Publications Office of the EU, Luxemburg, (2011), 149--164.","paperID":"None"},{"content":"Owen, R., Stilgoe, J.,Macnaghten, P., Gorman, M., Fisher, E., Guston, D. A framework for responsible innovation. In Responsible Innovation: Managing the Responsible Emergence of Science and Innovation in Society, Owen, R., Bessant, J., and Heintz, M., ed., Wiley (2013), 27--50.","paperID":"None"},{"content":"Xinru Page , Alfred Kobsa, The Circles of Latitude: Adoption and Usage of Location Tracking in Online Social Networking, Proceedings of the 2009 International Conference on Computational Science and Engineering, p.1027-1030, August 29-31, 2009","paperID":"1633650"},{"content":"Pellizzoni, L. Responsibility and environmental governance. Environm. Politics 13 (2004), 541--565.","paperID":"None"},{"content":"Neil Pollock , Robin Williams, Who decides the shape of product markets? The knowledge institutions that name and categorise new technologies, Information and Organization, v.21 n.4, p.194-217, December, 2011","paperID":"2048881"},{"content":"ProGReSS. http://www.progressproject.eu/","paperID":"None"},{"content":"Randles, S., Youtie, J., Guston, D., Harthorn, B., Newfield, C., Shapira, P., Wickson, F., Rip, A., von Schomberg, R., and Pidgeon, N. A trans-atlantic conversation on Responsible Innovation and Responsible Governance. 2012. http://works.bepress.com/pshapira/54/","paperID":"None"},{"content":"Stuart Reeves, Envisioning ubiquitous computing, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208278"},{"content":"Daniela Rosner , Jonathan Bean, The weapons factory in the den, interactions, v.20 n.3, May + June 2013","paperID":"2451874"},{"content":"Schienke, E.W., Tuana, N., Brown, D.A., Davis, K.J., Keller, K., Shortle, J.S., Stickler, M., and Baum, S.D. The role of the National Science Foundation Broader Impacts Criterion in enhancing research ethics pedagogy. Social Epistemology 23 (2009), 317--336.","paperID":"None"},{"content":"Abigail Sellen , Yvonne Rogers , Richard Harper , Tom Rodden, Reflecting human values in the digital age, Communications of the ACM, v.52 n.3, March 2009","paperID":"1467265"},{"content":"Phoebe Sengers , Kirsten Boehner , Shay David , Joseph 'Jofish' Kaye, Reflective design, Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility, August 20-24, 2005, Aarhus, Denmark","paperID":"1094569"},{"content":"Singer, N., Trouilhet, S., Rammal, A., and Pécatte, J.-M. Collecting and classifying large scale data to build an adaptive and collective memory: A case study in eHealth for a pro-active management. In Multi-Agent Systems - Modeling, Interactions, Simulations and Case Studies, F. Alkhateeb, E. Al Maghayreh, and I. Abu Doush, eds. (2011), 439--454.","paperID":"None"},{"content":"Stilgoe, J., Owen, R., and Macnaghten, P. Developing a framework for responsible innovation. Research Policy, 42 (2013), 1568--1580.","paperID":"None"},{"content":"Sutcliffe, H. A report on Responsible Research & Innovation., 2011. http://www.matterforall.org/pdf/RRIReport2.pdf","paperID":"None"},{"content":"Latanya Sweeney, Discrimination in Online Ad Delivery, Queue, v.11 n.3, March 2013","paperID":"2460278"},{"content":"Ure, J., Pinnock, H., Hanley, J., Kidd G, McCall Smith, E., Tarling, A., Pagliari, C., Sheikh, A., MacNee, W., McKinstry, B. Piloting telemonitoring in COPD: a mixed methods exploration of issues in design and implementation. PRIM Care Resp J 21, 1 (2012), 57--64.","paperID":"None"},{"content":"Vincent, N.A. A structured taxonomy of responsibility concepts. In Moral Responsibility, N.A. Vincent, I. van de Poel, and J. Hoven, eds., Springer (2011), 15--35.","paperID":"None"},{"content":"Yetim, F. Bringing discourse ethics to value sensitive design: pathways toward a deliberative future. AIS Trans. on Human-Comp. Interact. 3, 2 (2011), 133--155.","paperID":"None"},{"content":"Von Schomberg, R. A vision of Responsible Research and Innovation. In Responsible Innovation: Managing the Responsible Emergence of Science and Innovation in Society, Owen, R., Bessant, J., and Heintz, M., ed., Wiley, Hoboken (2013), 51--74.","paperID":"None"}],"abstract":"Given the potent and pervasive nature of modern technologies, this paper lays out the complexities involved in achieving responsible design. In order to do this we will first compare an emerging policy-oriented programme of research known as RRI (Responsible Research and Innovation) with initiatives in HCI. A focus on the similarities and differences may highlight to what extent responsibility is already and successfully embedded within the concerns and practices of design and use, and what may yet need to be incorporated for responsible design. The paper then discusses the challenges of 'naturalising' the very ambitious programme of RRI within specific design activities and concerns, through the lens of four analytic concepts: reflexivity; responsiveness; inclusion; and anticipation. Finally, we make a case for a pragmatic, 'unromantic', but engaged reinterpretation of RRI for HCI.","video":"http://www.youtube.com/embed/B__WoKeSFj8?rel=0","title":"Towards a closer dialogue between policy and practice: responsible design in HCI","filename":"CHI14/p2965","authors":["Barbara Grimpe","Mark Hartswood","Marina Jirotka"],"conference":"CHI '14"}