{"paperId":2557035,"citation":[{"content":"Peter Bennett , Heidi Hinder , Seana Kozar , Christopher Bowdler , Elaine Massung , Tim Cole , Helen Manchester , Kirsten Cater, TopoTiles: Storytelling in Care Homes with Topographic Tangibles, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2732918"},{"content":"Peng Liu , Xianghua Ding , Ning Gu, “Helping Others Makes Me Happy”: Social Interaction and Integration of People with Disabilities, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819998"}],"reference":[{"content":"Alzheimer's association. 2013 Alzheimer's disease facts and figures. Alzheimer's association (2013).","paperID":"None"},{"content":"Bharucha, A. J., Anand, V., Forlizzi, J., & Dew, M. Intelligent assistive technology applications to dementia care: current capabilities, limitations, and future challenges. The American journal of geriatric psychiatry: official journal of the American Association for Geriatric Psychiatry 17, 2 (2009), 88104.","paperID":"None"},{"content":"Timothy W. Bickmore , Lisa Caruso , Kerri Clough-Gorr , Tim Heeren, 'It's just like you talk to a friend' relational agents for older adults, Interacting with Computers, v.17 n.6, p.711-735, December, 2005","paperID":"1712147"},{"content":"Boers, N. M., Chodos, D., Huang, J., Gburzynski, P., Nikolaidis, I., & Stroulia, E.. The Smart Condo: Visualizing independent living environments in a virtual world. Pervasive Computing Technologies for Healthcare, 2009. PervasiveHealth 2009. IEEE (2009), 1--8.","paperID":"None"},{"content":"Borghi , A. M., & Cimatti, F. Embodied cognition and beyond: Acting and sensing the body. Neuropsychologia, 48, 3 (2010), 763'773.","paperID":"None"},{"content":"Botella, C., Etchemendy, E., Cast, D., Baños, R. M., García-Palacios, A., Quero, S., et al. An e-Health System for the Elderly (Butler Project): A Pilot Study on Acceptance and Satisfaction. CyberPsychology & Behavior 12,3 (2009), 255--262.","paperID":"None"},{"content":"Bózzola, F. C., Gorelick, P. B., & Freels, S. Personality changes in Alzheimer's disease. Archives of Neurology, 49,5 (1992), 486--491.","paperID":"None"},{"content":"Caldwell, P. Finding You Finding Me: Using Intensive Interaction To Get In Touch With People Whose Severe Learning Disabilities Are Combined With Autistic Spectrum Disorder. Jessica Kingsley Pub : London (2006).","paperID":"None"},{"content":"Chaudhury, H. Journey Back Home Recollecting Past Places by People with Dementia. Journal of Housing For the Elderly 16,1--2 (2008), 85--106.","paperID":"None"},{"content":"Cohen, D., & Eisdorfer, C. the loss of self: A family resource for the care of Alzheimer's disease and related disorders. . Norton & Company, (2001).","paperID":"None"},{"content":"Creusen, M. E., & Schoormans, J. P. The different roles of product appearance in consumer choice. J. of product innovation management 22,1(2005), 63--81.","paperID":"None"},{"content":"Czaja, S. J., & Lee, C. C. Information technology and older adults. In A. Sears, & J. A. Jacko, HCI Handbook: Fundamentals, Evolving Technologies and Emerging Applications. New York: Lawrence Elbaum Associates. 2007, 777--792.","paperID":"None"},{"content":"Dupuis, S. L., B. J., & Wiersma, E. Creating open environments in long-term care settings: an examination of influencing factors. Therapeutic Recreation Journal, 39,4 (2005), 277'298.","paperID":"None"},{"content":"Edvardsson, D, Edvardsson, B & Sandman, PO Personcentred care of people with severe Alzheimer's disease: current status and ways forward. The Lancet Neurology. 7, 4 (2008), 362--367","paperID":"None"},{"content":"Ephraim, G. A brief introduction to augmented mothering. Playtrack pamphlet, Harpebury Hospital School:Radlet Herts, (1986)","paperID":"None"},{"content":"Flynn, D., van Schaik, P., Blackman, T., Femcott, C., Hobbs, B., & Calderon, C. Developing a virtual realitybased methodology for people with dementia: a feasibility study. CyberPsychology & Behavior 6, 6 (2003), 591--611.","paperID":"None"},{"content":"William Gaver , Andy Boucher , John Bowers , Mark Blythe , Nadine Jarvis , David Cameron , Tobie Kerridge , Alex Wilkie , Robert Phillips , Peter Wright, The photostroller: supporting diverse care home residents in engaging with the world, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979198"},{"content":"Gary Gowans , Jim Campbell , Norm Alm , Richard Dye , Arlene Astell , Maggie Ellis, Designing a multimedia conversation aid for reminiscence therapy in dementia care environments, CHI '04 Extended Abstracts on Human Factors in Computing Systems, April 24-29, 2004, Vienna, Austria","paperID":"985943"},{"content":"T.C. Nicholas Graham , Irina Schumann , Mrunal Patel , Quentin Bellay , Raimund Dachselt, Villains, architects and micro-managers: what tabula rasa teaches us about game orchestration, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470754"},{"content":"Head, D. M., Portnoy, S., & Woods, R. T. The impact of reminiscence groups in two different settings. International Journal of Geriatric Psychiatry 5,5 (1990), 295--302.","paperID":"None"},{"content":"Wijnand Ijsselsteijn , Henk Herman Nap , Yvonne de Kort , Karolien Poels, Digital game design for elderly users, Proceedings of the 2007 conference on Future Play, November 14-17, 2007, Toronto, Canada","paperID":"1328206"},{"content":"Jaffe, D. J. Problematizing meaning. In Qualitative methods in aging research. Thousand Oaks, CA: Sage Publications, 1994.","paperID":"None"},{"content":"Noriaki Kuwahara , Shinji Abe , Kiyoshi Yasuda , Kazuhiro Kuwabara, Networked reminiscence therapy for individuals with dementia by using photo and video sharing, Proceedings of the 8th international ACM SIGACCESS conference on Computers and accessibility, October 23-25, 2006, Portland, Oregon, USA","paperID":"1169010"},{"content":"Light, J. C., Drager, K. D., & Nemser, J. G. Enhancing the Appeal of AAC Technologies for Young Children: Lessons from the Toy Manufacturers. Augmentative and Alternative Communication 20,3(2004), 137--149.","paperID":"None"},{"content":"Lin, Y. C., Dai, Y. T., & Hwang, S. L. The Effect of Reminiscence on the Elderly Population: A systematic Review.' Public Health Nursing. 20,4(2003), 297--306.","paperID":"None"},{"content":"Luengo-Fernandez, R., Leal, J., & Gray, A. Dementia 2010: The economic burden of dementia and associated research funding in the United Kingdom. Cambridge: Alzheimer's Research Trust, 2010.","paperID":"None"},{"content":"Marshall, M. The challenge of looking after people with dementia: Professional carers need higher expectations and better training and support. BMJ: British Medical Journal 323, 7310 (2001), 410--411","paperID":"None"},{"content":"Mayeux, R. Early Alzheimer's Disease. New England Journal of Medicine, 362 (2010), 2194--2201.","paperID":"None"},{"content":"McGuinness, B., Barrett, S. L., Craig, D., Lawson, J., & Passmore, P. A. Attention deficits in Alzheimer's disease and vascular dementia. Journal of Neurology, Neurosurgery and Psychiatry, 81,2 (2010), 157--159.","paperID":"None"},{"content":"Moffat, S. D., Zonderman, A. B., & Resnick, S. M. Age differences in spatial memory in a virtual environment navigation task. . Neurobiology of aging, 22,5 (2001), 787--796.","paperID":"None"},{"content":"Daniela Petrelli , Steve Whittaker, Family memories in the home: contrasting physical and digital mementos, Personal and Ubiquitous Computing, v.14 n.2, p.153-169, February  2010","paperID":"1731502"},{"content":"Philippa Riley , Norman Alm , Alan Newell, An interactive tool to promote musical creativity in people with dementia, Computers in Human Behavior, v.25 n.3, p.599-608, May, 2009","paperID":"1534975"},{"content":"Rogers, W. A. Human factors, applied cognition, and aging. (2000).","paperID":"None"},{"content":"Twigger-Ross, C. L., & Uzzell, D. L. Place and identity processes. Journal of Environmental Psychology 16,3 (1996), 205'220.","paperID":"None"},{"content":"Jayne Wallace , Peter C. Wright , John McCarthy , David Philip Green , James Thomas , Patrick Olivier, A design-led inquiry into personhood in dementia, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2481363"},{"content":"Wang, J. J. Group reminiscence therapy for cognitive and affective function of demented elderly in Taiwan. International Journal of Geriatric Psychiatry 22,12 (2007), 1235--1240.","paperID":"None"},{"content":"Whalley, L. Early Onset Dementia. In S. Hunter, Dementia: Challenges and new directions. Jessica Kingsley Publishers. 1997, 71--78.","paperID":"None"},{"content":"Williams, A. Changing geographies of care: employing the concept of therapeutic landscapes as a framework in examining home space. Social Science & Medicine, 55,1 (2002), 141--154.","paperID":"None"},{"content":"Woods, B., Spector, A. E., Jones, C. A., Orrell, M., & Davies, S. P. Reminiscence therapy for dementia. Cochrane Database Syst Rev 2 (2005).","paperID":"None"}],"abstract":"This paper describes a study aimed to understand the use of 3D virtual world (VW) technology to support life engagement for people with dementia in long-term care. Three versions of VW prototypes (reminiscence room, virtual tour and gardening) utilising gestured-base interaction were developed iteratively. These prototypes were tested with older residents (80+) with dementia in care homes and their caregivers. Data collection was based on observations of how the residents and care staff interacted collaboratively with the VW. We discussed in depth the use of VWs in stimulating past memories and how this technology could help enhance their sense of self through various means. We also highlighted key approaches in designing VWs to sustain attention, create ludic experiences and facilitate interaction for older people with dementia.","video":"http://www.youtube.com/embed/dqmzLYfO1Mo?rel=0","title":"Recreating living experiences from past memories through virtual worlds for people with dementia","filename":"CHI14/p3977","authors":["Panote Siriaraya","Chee Siang Ang"],"conference":"CHI '14"}