{"paperId":2557371,"reference":[{"content":"Paul André , Aniket Kittur , Steven P. Dow, Crowd synthesis: extracting categories and clusters from complex data, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531653"},{"content":"Alexander, C., Ishikawa, S., and Silverstein, M. A., Pattern Language: Towns, Buildings, Construction. Oxford University Press, 1977.","paperID":"None"},{"content":"Buxton, B. Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann, 2010.","paperID":"None"},{"content":"Cheng, P. W. and Holyoak, K. J. Pragmatic reasoning schemas. Cognitive psychology 17, 4 (1985), 391--416.","paperID":"None"},{"content":"Lydia B. Chilton , Greg Little , Darren Edge , Daniel S. Weld , James A. Landay, Cascade: crowdsourcing taxonomy creation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466265"},{"content":"Clement, C. A. Effect of structural embedding on analogical transfer: Manifest versus latent analogs. The American journal of psychology, (1994), 1--38.","paperID":"None"},{"content":"Finke, R. A., Ward, T. B., and Smith, S. M. Creative cognition: Theory, research, and applications. MIT press Cambridge, MA, 1992.","paperID":"None"},{"content":"Fisher, R., Statistical methods for research workers. Oliver and Boyd, 1954.","paperID":"None"},{"content":"Galton, F. The geometric mean, in vital and social statistics. In Proc RSL 29, (1879), 365--367.","paperID":"None"},{"content":"Gentner, D. Structure-mapping: A theoretical framework for analogy. Cognitive Science 7, (1983), 155--170.","paperID":"None"},{"content":"Gentner, D., S. Brem, R. Ferguson, P. Wolff, A. B. Markaman, K. and Forbus. Analogy and creativity in the works of Johannes Kepler. T. N. Ward, S. M. Smith, J. Vaid, eds. Creative Thought. Amer. Psych. Association, Washington, DC, (1997). 403--460.","paperID":"None"},{"content":"Gick, M. L. and Holyoak, K. J. Schema induction and analogical transfer. Cognitive psychology 15, (1983), 1--38.","paperID":"None"},{"content":"Gick, M. L. and Paterson, K. Do contrasting examples facilitate schema acquisition and analogical transfer? Canadian Journal of Psychology 46, 4 (1992), 539.","paperID":"None"},{"content":"Hargadon, A. B. Brokering knowledge: Linking learning and innovation. Research in Organizational behavior 24, (2002), 41--85.","paperID":"None"},{"content":"Hesse, Mary B., The Structure of Scientific Inference. Macmillan, London, 1974.","paperID":"None"},{"content":"Hutter, K., Hautz, J., Füller, J., Mueller, J., and Matzler, K. The Tension between Competition and Collaboration in Community-Based Design Contests. Creativity and Innovation Management 20, 1 (2011), 3--21.","paperID":"None"},{"content":"Hummel, J. E. and Holyoak K. J., Distributed representations of structure: a theory of analogical access and mapping. Psychological Review 104, (1997), 427--66.","paperID":"None"},{"content":"Hummel, J. E. and Holyoak, K. J., A symbolic-connectionist theory of relational inference and generalization. Psychological Review 110, (2003), 220--264.","paperID":"None"},{"content":"Aniket Kittur , Ed H. Chi , Bongwon Suh, Crowdsourcing user studies with Mechanical Turk, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357127"},{"content":"Kittur, A., Holyoak, K. J. and Hummel, J. E. Using idea observers in higher-order human category learning. In Proc. CogSci, 2006.","paperID":"None"},{"content":"Aniket Kittur , Robert E. Kraut, Harnessing the wisdom of crowds in wikipedia: quality through coordination, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460572"},{"content":"Tat Koon Koh , Mark Fichman, Essays on technology-enabled platforms, Carnegie Mellon University, Pittsburgh, PA, 2012","paperID":"2521054"},{"content":"Kulkarni, C., Dow, S. P., and Klemmer, S. R. Early and Repeated Exposure to Examples Improves Creative Work. In Proc. CogSci, 2012.","paperID":"None"},{"content":"Lakhani, K. R. and Panetta, J. A. The principles of distributed innovation. Innovations 2, 3 (2007), 97--112.","paperID":"None"},{"content":"Linsey, J., Laux, J., Clauss, E., Wood, K. L., and Markman, A. Increasing innovation: A trilogy of experiments towards a design-by-analogy method. Proceedings of the ASME 2007.","paperID":"None"},{"content":"Reeves, L. and Weisberg, R. W. The role of content and abstract information in analogical transfer. Psychological Bulletin 115, 3 (1994), 381.","paperID":"None"},{"content":"Smith, S. M., Ward, T. B., and Schumacher, J. S. Constraining effects of examples in a creative generation task. Memory & Cognition 21, 6 (1993), 837--845.","paperID":"None"},{"content":"Sternberg, R. J. Handbook of creativity. Cambridge University Press, 1998.","paperID":"None"},{"content":"Jerry Talton , Lingfeng Yang , Ranjitha Kumar , Maxine Lim , Noah Goodman , Radomír Měch, Learning design patterns with bayesian grammar induction, Proceedings of the 25th annual ACM symposium on User interface software and technology, October 07-10, 2012, Cambridge, Massachusetts, USA","paperID":"2380127"},{"content":"Wolfgang Pree, Design patterns for object-oriented software development, ACM Press/Addison-Wesley Publishing Co., New York, NY, 1995","paperID":"189440"},{"content":"Yang, Y., Chen, P. Y., and Pavlou, P. Open innovation: An empirical study of online contests. In Proc. ICIS 2009.","paperID":"None"},{"content":"Lixiu Yu , Aniket Kittur , Robert E. Kraut, Searching for analogical ideas with crowds, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557378"},{"content":"Lixiu Yu , Jeffrey V. Nickerson, Cooks or cobblers?: crowd creativity through combination, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979147"},{"content":"Lixiu Yu , Yasuaki Sakamoto, Feature selection in crowd creativity, Proceedings of the 6th international conference on Foundations of augmented cognition: directing the future of adaptive systems, July 09-14, 2011, Orlando, FL","paperID":"2021821"}],"citation":[{"content":"Pao Siangliulue, Supporting Collaborative Innovation at Scale, Adjunct Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2815588"},{"content":"Lixiu Yu , Aniket Kittur , Robert E. Kraut, Encouraging “Outside- the- box” Thinking in Crowd Innovation Through Identifying Domains of Expertise, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820025"},{"content":"Lixiu Yu , Robert E. Kraut , Aniket Kittur, Distributed Analogical Idea Generation with Multiple Constraints, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2835201"},{"content":"Lixiu Yu , Aniket Kittur , Robert E. Kraut, Searching for analogical ideas with crowds, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557378"},{"content":"Pao Siangliulue , Kenneth C. Arnold , Krzysztof Z. Gajos , Steven P. Dow, Toward Collaborative Ideation at Scale: Leveraging Ideas from Others to Generate More Creative and Diverse Ideas, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675239"},{"content":"Anbang Xu , Huaming Rao , Steven P. Dow , Brian P. Bailey, A Classroom Study of Using Crowd Feedback in the Iterative Design Process, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675140"},{"content":"Pao Siangliulue , Kenneth C. Arnold , Krzysztof Z. Gajos , Steven P. Dow, Toward Collaborative Ideation at Scale: Leveraging Ideas from Others to Generate More Creative and Diverse Ideas, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675239"},{"content":"Justin Cheng , Michael S. Bernstein, Flock: Hybrid Crowd-Machine Learning Classifiers, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675214"}],"abstract":"Harnessing crowds can be a powerful mechanism for increasing innovation. However, current approaches to crowd innovation rely on large numbers of contributors generating ideas independently in an unstructured way. We introduce a new approach called distributed analogical idea generation, which aims to make idea generation more effective and less reliant on chance. Drawing from the literature in cognitive science on analogy and schema induction, our approach decomposes the creative process in a structured way amenable to using crowds. In three experiments we show that distributed analogical idea generation leads to better ideas than example-based approaches, and investigate the conditions under which crowds generate good schemas and ideas. Our results have implications for improving creativity and building systems for distributed crowd innovation.","video":"http://www.youtube.com/embed/yyQhhyk_PJU?rel=0","title":"Distributed analogical idea generation: inventing with crowds","filename":"CHI14/p1245","authors":["Lixiu Yu","Aniket Kittur","Robert E. Kraut"],"conference":"CHI '14"}