{"paperId":2557261,"citation":[{"content":"Claudia Müller , Dominik Hornung , Theodor Hamm , Volker Wulf, Practice-based Design of a Neighborhood Portal: Focusing on Elderly Tenants in a City Quarter Living Lab, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702449"}],"reference":[{"content":"Thomas Binder , Giorgio De Michelis , Pelle Ehn , Giulio Jacucci , Per Linde , Ina Wagner, What is the object of design?, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2212780"},{"content":"John Bowers, The logic of annotated portfolios: communicating the value of 'research through design', Proceedings of the Designing Interactive Systems Conference, June 11-15, 2012, Newcastle Upon Tyne, United Kingdom","paperID":"2317968"},{"content":"Brandt, E. & Binder, T. Experimental design research: genealogy, intervention, argument. Proceedings of the International Association of Societies and Design Research, Hong Kong (2007).","paperID":"None"},{"content":"Bundesministerium für Bildung und Forschung (BMBF). The HighTec Strategy for Germany, 2006. http://www.fona.de/pdf/publikationen/bmbf_the_high_tech_strategy_for_germany.pdf","paperID":"None"},{"content":"Bundesministerium für Bildung und Forschung (BMBF). Research for Civil Security. Bonifatius, Bonn/Berlin, Germany, 2009.","paperID":"None"},{"content":"Bundesministerium für Bildung und Forschung (BMBF). Bundesbericht Forschung und Innovation 2012. Media-Print, Bonn/Berlin, Germany, 2012.","paperID":"None"},{"content":"Corbin, J and Strauss, A. Basics of Qualitative Research. Techniques and Procedures for Developing Grounded Theory. Sage, Thousand Oaks, USA, 2008.","paperID":"None"},{"content":"Dittrich, Y., Eriksen, S., & Wessels, B. From Knowledge Transfer to Situated Innovation: cultivating spaces for co-operation in innovation and design between academics, user-groups and ICT providers. Blekinge Techiska Hogskola, Sweden, 2009.","paperID":"None"},{"content":"European Commission. Seventh European Research Programme, 2011. http://cordis.europa.eu/fp7/cooperation/home_en.html","paperID":"None"},{"content":"European Commission. The Seventh European Research Programme. Taking European Research at the Forefront. 2007. http://ec.europa.eu/research/fp7/pdf/fp7-brochure_en.pdf","paperID":"None"},{"content":"Fischer, G. Symmetry of Ignorance, Social Creativity, and MetaDesign. Special Issue on \"Creativity & Cognition 1999\" of the International Journal \"Knowledge-Based Systems 13, 7-8 (2000), 527--537.","paperID":"None"},{"content":"Funtowicz, S. O., & J. R. Ravetz. The emergence of post-normal science. In R. von Schomberg (Ed.), Science, politics, and morality: Scientific uncertainty and decision making. Kluwer (1993), 85--123.","paperID":"None"},{"content":"Gibbons, M., Limoges, C., Nowotny, H., Scott, P. and Trow, M. The New production of Knowledge: the dynamics of science and research in contemporary societies, Sage, London, 1994.","paperID":"None"},{"content":"Hessels, L. K., van Lente, H., 2008. Re-thinking new knowledge production: A literature review and a research agenda. Research Policy 37, 740--760.","paperID":"None"},{"content":"Hevner, A. R. A Three Cycle View of Design Science Research. Scandinavian Journal of Information Systems 19, 2 (2007), 87--92.","paperID":"None"},{"content":"Alan Hevner , Samir Chatterjee, Design Research in Information Systems: Theory and Practice, Springer Publishing Company, Incorporated, 2010","paperID":"1859261"},{"content":"Finn Kensing , Jeanette Blomberg, Participatory Design: Issues and Concerns, Computer Supported Cooperative Work, v.7 n.3-4, p.167-185, 1998","paperID":"593393"},{"content":"Ludvigsen, M. Designing for Social Interaction. PhD-thesis, 2006. http://www.mvl.dk/dissertation/DesigningforSocialInteraction_dissertationMVL_web.pdf","paperID":"None"},{"content":"Mambrey, P., Mark, G. and Pankoke-Babatz, U. Integrating user advocacy into participatory design: The designer's perspective. In Proc. PDC 1996. ACM Press (1996), 251--259.","paperID":"None"},{"content":"Mcdermott, R. Learning Across Teams: The Role of Communities of Practice in Team Organizations. Knowledge Management Review 8, 2 (1999), 32--36.","paperID":"None"},{"content":"Michel, R. (Ed.). Design Research now. Birkhäuser, Basel/Boston/Berlin, Switzerland/USA/Germany, 2007.","paperID":"None"},{"content":"Nowotny, H., Scott, P., & Gibbons, M. Re-Thinking Science: Knowledge and the Public in an Age of Uncertainty. Polity, Cambridge, UK, 2001.","paperID":"None"},{"content":"Gary M. Olson , Ann Zimmerman , Nathan Bos, Scientific Collaboration on the Internet, The MIT Press, 2008","paperID":"1522423"},{"content":"Markus Rohde , Gunnar Stevens , Peter Brödner , Volker Wulf, Towards a paradigmatic shift in IS: designing for social practice, Proceedings of the 4th International Conference on Design Science Research in Information Systems and Technology, May 07-08, 2009, Philadelphia, Pennsylvania","paperID":"1555639"},{"content":"Liz Sanders, ON MODELINGAn evolving map of design practice and design research, interactions, v.15 n.6, November + December 2008","paperID":"1409043"},{"content":"Weingart, P. From \"Finalization\" to Mode 2: new wine in old bottles? Social Science Information 36, 4 (1997), 591--613.","paperID":"None"},{"content":"Wenger, E. Communities of Practice - Learning, Meaning, and Identity. Cambridge University Press. Cambridge, UK, 1998.","paperID":"None"},{"content":"Volker Wulf , Markus Rohde , Volkmar Pipek , Gunnar Stevens, Engaging with practices: design case studies as a research framework in CSCW, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958902"},{"content":"Ziman, J. Post-academic Science: Constructing Knowledge with networks and Norms. Royal Society Medawar Lecture, London, UK, 1995.","paperID":"None"},{"content":"John Zimmerman , Erik Stolterman , Jodi Forlizzi, An analysis and critique of Research through Design: towards a formalization of a research approach, Proceedings of the 8th ACM Conference on Designing Interactive Systems, August 16-20, 2010, Aarhus, Denmark","paperID":"1858228"}],"abstract":"Design research processes often take place in publicly funded projects. Besides designers and users, public funding increasingly requires industry partners to participate in such projects. We present empirical insights from a joint research project in order to assess the claims connected with such funding structures and to report on challenges for design research within them. We identify three themes of conflict between academic and industry partners and elaborate on the sources of them. The presentation of our results builds on the distinction between 'academia' and 'industry', which is frequently applied by political funding agencies. The analysis of the respective stakeholders' actual interests, however, will prove such a dichotomy to be misleading and simplistic.","video":"http://www.youtube.com/embed/kbKBCpKM1d8?rel=0","title":"Research on research: design research at the margins: academia, industry and end-users","filename":"CHI14/p713","authors":["Juri Dachtera","Dave Randall","Volker Wulf"],"conference":"CHI '14"}