{"paperId":2557094,"citation":[{"content":"Lisa Kleinman , Tad Hirsch , Matt Yurdana, Exploring Mobile Devices as Personal Public Displays, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, August 24-27, 2015, Copenhagen, Denmark","paperID":"2785833"},{"content":"Yiran Wang , Melissa Niiya , Gloria Mark , Stephanie M. Reich , Mark Warschauer, Coming of Age (Digitally): An Ecological View of Social Media Use among College Students, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675271"},{"content":"Da-jung Kim , Youn-kyung Lim, Dwelling Places in KakaoTalk: Understanding the Roles and Meanings of Chatrooms in Mobile Instant Messengers, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675198"},{"content":"Lauren Scissors , Moira Burke , Steven Wengrovitz, What's in a Like?: Attitudes and behaviors around receiving Likes on Facebook, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820066"},{"content":"Roberta M. Melvin , Andrea Bunt , Erick Oduor , Carman Neustaedter, The Effect of Signal Expense and Dependability on Family Communication in Rural and Northern Canada, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702301"},{"content":"Sungkyu Park , Inyeop Kim , Sang Won Lee , Jaehyun Yoo , Bumseok Jeong , Meeyoung Cha, Manifestation of Depression and Loneliness on Social Networks: A Case Study of Young Adults on Facebook, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675139"},{"content":"Moira Burke , Mike Develin, Once More with Feeling: Supportive Responses to Social Sharing on Facebook, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2835199"},{"content":"Tasos Spiliotopoulos , Diogo Pereira , Ian Oakley, Predicting Tie Strength with the Facebook API, Proceedings of the 18th Panhellenic Conference on Informatics, October 02-04, 2014, Athens, Greece","paperID":"2645817"},{"content":"Sarah L. Buglass , Jens F. Binder , Lucy R. Betts , Jean D.M. Underwood, When 'friends' collide, Computers in Human Behavior, v.54 n.C, p.62-72, January 2016","paperID":"2840574"},{"content":"Mark Kibanov , Martin Atzmueller , Jens Illig , Christoph Scholz , Alain Barrat , Ciro Cattuto , Gerd Stumme, Is Web Content a Good Proxy for Real-Life Interaction?: A Case Study Considering Online and Offline Interactions of Computer Scientists, Proceedings of the 2015 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining 2015, August 25-28, 2015, Paris, France","paperID":"2810060"},{"content":"Adam Barker , Blesson Varghese , Jonathan Stuart Ward , Ian Sommerville, Academic cloud computing research: five pitfalls and five opportunities, Proceedings of the 6th USENIX conference on Hot Topics in Cloud Computing, p.2-2, June 17-18, 2014, Philadelphia, PA","paperID":"2696537"},{"content":"Yi-Chia Wang , Moira Burke , Robert Kraut, Modeling Self-Disclosure in Social Networking Sites, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820010"}],"reference":[{"content":"Allan, G.A. A sociology of friendship and kinship. G. Allen & Unwin, 1979.","paperID":"None"},{"content":"Berger, C.R. Beyond initial interaction: Uncertainty, understanding, and the development of interpersonal relationships. Language and social psychology, (1979), 122-144.","paperID":"None"},{"content":"Bernard, H.R., Killworth, P., Kronenfeld, D., and Sailer, L. The problem of informant accuracy: The validity of retrospective data. Annual Review of Anthropology 13, (1984), 495--517.","paperID":"None"},{"content":"Berscheid, E. and Reis, H.T. Attraction and close relationships. The handbook of social psychology 2, (1998), 193--281.","paperID":"None"},{"content":"Burke, M. Reading, Writing, Relationships: The Impact of Social Network Sites on Relations and Well-Being. Carnegie Mellon University Doctoral Dissertation. (2011). http://reportsarchive.adm.cs.cmu.edu/anon/hcii/Carnegie Mellon University-HCII-11--107.pdf.","paperID":"None"},{"content":"Moira Burke , Robert Kraut , Cameron Marlow, Social capital on facebook: differentiating uses and users, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979023"},{"content":"Burt, R. Decay functions. Social Networks 22, (2000), 1--28.","paperID":"None"},{"content":"Collins, N.L. and Miller, L.C. Self-disclosure and liking: A meta-analytic review. Psychological Bulletin 116, 3 (1994), 457.","paperID":"None"},{"content":"Donath, J. Signals in social supernets. Journal of Computer-Mediated Communication 13, 1 (2008), 231--251.","paperID":"None"},{"content":"Duck, S. Relating to others. Dorsey Press, 1988.","paperID":"None"},{"content":"Duck, S., Rutt, D.J., Hurst, M.H., and Strejc, H. Some evident truths about conversations in everyday relationships. Human Communication Research 18, 2 (1991), 228--267.","paperID":"None"},{"content":"Ellison, N., Vitak, J., Grey, R., and Lampe, C. Cultivating Social Resources on Social Network Sites: Facebook Relationship Maintenance Behaviors and their Role in Social Capital Processes. Journal of Computer-Mediated Communication, (2014).","paperID":"None"},{"content":"Fischer, C.S. To dwell among friends: Personal networks in town and city. University of Chicago Press, 1982.","paperID":"None"},{"content":"Eric Gilbert , Karrie Karahalios, Predicting tie strength with social media, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518736"},{"content":"Hampton, K., Goulet, L.S., Rainie, L., and Purcell, K. Social networking sites and our lives. 2011.","paperID":"None"},{"content":"Hampton, K.N., Lee, C.J., and Her, E.J. How new media affords network diversity: Direct and mediated access to social capital through participation in local social settings. New Media & Society 13, 7 (2011), 1031--1049.","paperID":"None"},{"content":"Haythornthwaite, C. Strong, weak, and latent ties and the impact of new media. The Information Society 18, 5 (2002), 385--401.","paperID":"None"},{"content":"Hill, R.A. and Dunbar, R.I.M. Social network size in humans. Human Nature 14, 1 (2003), 53--72.","paperID":"None"},{"content":"Reynol Junco, Comparing actual and self-reported measures of Facebook use, Computers in Human Behavior, v.29 n.3, p.626-631, May, 2013","paperID":"2444315"},{"content":"Keele, L. and Kelly, N.J. Dynamic models for dynamic theories: The ins and outs of lagged dependent variables. Political Analysis 14, 2 (2006), 186.","paperID":"None"},{"content":"Knapp, M.L. and Vangelisti, A.L. Interpersonal communication and human relationships. Allyn and Bacon Boston, 1992.","paperID":"None"},{"content":"Kraut, R., Patterson, M., Lundmark, V., Kiesler, S., Mukophadhyay, T., and Scherlis, W. Internet paradox: A social technology that reduces social involvement and psychological well-being' American Psychologist 53, 9 (1998), 1017--1031.","paperID":"None"},{"content":"Kruger, J., Epley, N., Parker, J., and Ng, Z.W. Egocentrism over e-mail: Can we communicate as well as we think?. Journal of Personality and Social Psychology 89, 6 (2005), 925.","paperID":"None"},{"content":"Ledbetter, A.M., Mazer, J.P., DeGroot, J.M., Meyer, K.R., Yuping Mao, and Swafford, B. Attitudes Toward Online Social Connection and Self-Disclosure as Predictors of Facebook Communication and Relational Closeness. Communication Research 38, 1 (2011), 27--53.","paperID":"None"},{"content":"Litwak, E. and Szelenyi, I. Primary group structures and their functions: Kin, neighbors, and friends. American Sociological Review, (1969).","paperID":"None"},{"content":"Marin, A. and Hampton, K.N. Simplifying the Personal Network Name Generator. Field Methods 19, 2 (2007), 163--193.","paperID":"None"},{"content":"Mor Naaman , Jeffrey Boase , Chih-Hui Lai, Is it really about me?: message content in social awareness streams, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718953"},{"content":"Pollet, T.V., Roberts, S.G.B., and Dunbar, R.I.M. Use of Social Network Sites and Instant Messaging Does Not Lead to Increased Offline Social Network Size, or to Emotionally Closer Relationships with Offline Network Members. Cyberpsychology, Behavior, and Social Networking 14, 4 (2011), 253--258.","paperID":"None"},{"content":"Roberts, S. and Dunbar, R.I.M. Communication in social networks: Effects of kinship, network size, and emotional closeness. Personal Relationships, (2010).","paperID":"None"},{"content":"Spence, M. Job market signaling. The quarterly journal of Economics 87, 3 (1973), 355.","paperID":"None"},{"content":"L Sproull , S Kiesler, Reducing social context cues: electronic mail in organizational communication, Management Science, v.32 n.11, p.1492-1512, Nov. 1986","paperID":"8428"},{"content":"Sherry Turkle, Alone Together: Why We Expect More from Technology and Less from Each Other, Basic Books, Inc., New York, NY, 2011","paperID":"1972496"},{"content":"Valkenburg, P.M. and Peter, J. Preadolescents and adolescents online communication and their closeness to friends. Developmental Psychology 43, 2 (2007), 267.","paperID":"None"},{"content":"van Grove, J. Twitter analysis: 40% of tweets are pointless babble. Mashable, 2009. http://mashable.com/2009/08/12/twitter-analysis/.","paperID":"None"},{"content":"Vitak, J. Keeping connected in the Facebook age: The relationship between Facebook use, relationship maintenance strategies, and relational outcomes. (2012).","paperID":"None"},{"content":"Vitak, J. Facebook Makes the Heart Grow Fonder: Relationship Maintenance Strategies Among Geographically Dispersed and Communication-Restricted Connections. (2014).","paperID":"None"},{"content":"Zahavi, A. Mate selection--a selection for a handicap. Journal of theoretical Biology 53, 1 (1975), 205--214.","paperID":"None"}],"abstract":"Scientists debate whether people grow closer to their friends through social networking sites like Facebook, whether those sites displace more meaningful interaction, or whether they simply reflect existing ties. Combining server log analysis and longitudinal surveys of 3,649 Facebook users reporting on relationships with 26,134 friends, we find that communication on the site is associated with changes in reported relationship closeness, over and above effects attributable to their face-to-face, phone, and email contact. Tie strength increases with both one-on-one communication, such as posts, comments, and messages, and through reading friends' broadcasted content, such as status updates and photos. The effect is greater for composed pieces, such as comments, posts, and messages than for 'one-click' actions such as 'likes.' Facebook has a greater impact on non-family relationships and ties who do not frequently communicate via other channels.","video":"http://www.youtube.com/embed/uB6yfAmmMGw?rel=0","title":"Growing closer on facebook: changes in tie strength through social network site use","filename":"CHI14/p4187","authors":["Moira Burke","Robert E. Kraut"],"conference":"CHI '14"}