{"paperId":2557197,"citation":[{"content":"Saike He , Xiaolong Zheng , Daniel Zeng, A model-free scheme for meme ranking in social media, Decision Support Systems, v.81 n.C, p.1-11, January 2016","paperID":"2882381"},{"content":"Sheena L. Erete, Engaging Around Neighborhood Issues: How Online Communication Affects Offline Behavior, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675182"},{"content":"Marina Kogan , Leysia Palen , Kenneth M. Anderson, Think Local, Retweet Global: Retweeting by the Geographically-Vulnerable during Hurricane Sandy, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675218"},{"content":"Saeed Abdullah , Elizabeth L. Murnane , Jean M.R. Costa , Tanzeem Choudhury, Collective Smile: Measuring Societal Happiness from Geolocated Images, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675186"}],"reference":[{"content":"Anderson, C. A., & Bushman, B. J. (2002). The effects of media violence on society. Science, 295(5564).","paperID":"None"},{"content":"Archibold, R., and Cave, D. (2012). Numb to Carnage, Mexicans Find Diversions, and Life Goes On. NYT.","paperID":"None"},{"content":"Blog del Narco (2013) Dying for the Truth: Undercover Inside the Mexican Drug War by the Fugitive Reporters of Blog del Narco. Feral House.","paperID":"None"},{"content":"Booth, W. (2012). Mexico's crime wave has left about 25,000 missing. Washington Post.","paperID":"None"},{"content":"Bradley, M. M., & Lang, P. J. (1999). Affective norms for English words (ANEW). Gainesville, FL. The NIMH Center for the Study of Emotion and Attention.","paperID":"None"},{"content":"Bushman, B. J., & Huesmann, L. R. (2001). Effects of televised violence on aggression. Handbook of children and the media, 223--254.","paperID":"None"},{"content":"Carnagey, N., Anderson, C. and Bushman, B. (2007). The effect of video game violence on physiological desensitization of real-life violence. J Experimental Social Psychology, 43(3), 489--96.","paperID":"None"},{"content":"Cawley, M. (2013). La Extorsión Llega a Cifras Récord en México. http://es.insightcrime.org/noticias-del-dia/la-extorsion-llega-a-cifras-record-en-mexico","paperID":"None"},{"content":"Marc Cheong , Vincent C. Lee, A microblogging-based approach to terrorism informatics: Exploration and chronicling civilian sentiment and response to terrorism events via Twitter, Information Systems Frontiers, v.13 n.1, p.45-59, March     2011","paperID":"1968980"},{"content":"Committee to Protect Journalists. (2011). For journalists, coverage of political unrest proves deadly.","paperID":"None"},{"content":"Davidson, R. J., Putnam, K. M., & Larson, C. L. (2000). Dysfunction in the neural circuitry of emotion regulation - a possible prelude to violence. Science, 289 (5479), 591--594.","paperID":"None"},{"content":"De Choudhury, M., Counts, S., & Gamon, M. (2012). Not all moods are created equal! Exploring human emotional states in social media. In Proc. ICWSM.","paperID":"None"},{"content":"Munmun De Choudhury , Scott Counts , Eric J. Horvitz , Aaron Hoff, Characterizing and predicting postpartum depression from shared facebook data, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531675"},{"content":"Golder, S. A. and Macy, M. W. (2011). Diurnal and Seasonal Mood Vary with Work, Sleep, and Daylength Across Diverse Cultures. Science 333, 1878--1881.","paperID":"None"},{"content":"Gómez Leyva, C. El exitoso Blog del Narco. 2010. http://impreso.milenio.com/node/8855061","paperID":"None"},{"content":"Hernández, E. M., and Castro, R. M. (2012). El Presidente de las 83 mil ejecuciones. http://www.zetatijuana.com/ZETA/reportajez/el-presidente-de-las-83-mil-ejecuciones/","paperID":"None"},{"content":"Hopewell, J. (2013). In Mexico, violent art imitates life. Variety.com.","paperID":"None"},{"content":"Huesmann, L. R., & Taylor, L. D. (2006). The role of media violence in violent behavior. Annu. Rev. Public Health, 27, 393--415.","paperID":"None"},{"content":"Adam D.I. Kramer, An unobtrusive behavioral model of \"gross national happiness\", Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753369"},{"content":"Kendall, P. C., and Hammen, C. (1995). Abnormal psychology. Boston: Houghton Mifflin.","paperID":"None"},{"content":"Gloria Mark , Mossaab Bagdouri , Leysia Palen , James Martin , Ban Al-Ani , Kenneth Anderson, Blogs as a collective war diary, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145215"},{"content":"Mehl, M. R., & Pennebaker, J. W. (2003). The Social Dynamics of a Cultural Upheaval Social Interactions Surrounding September 11, 2001. Psychological Science, 14(6), 579--585.","paperID":"None"},{"content":"Michaelsen, M. (2012). Mental Health and Labour Supply - Evidence from Mexico's Ongoing Violent Conflicts. Ruhr Economic Paper, (378).","paperID":"None"},{"content":"Miroff, N. (2012). Mexico's drug war is at a stalemate as Calderon's presidency ends. Washington Post.","paperID":"None"},{"content":"Andrés Monroy-Hernández , danah boyd , Emre Kiciman , Munmun De Choudhury , Scott Counts, The new war correspondents: the rise of civic media curation in urban warfare, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441938"},{"content":"O'Connor, K. A. (2013). Narco-Trauma: The Phenomenology of Post-Traumatic Stress among Binational Students at the Border.","paperID":"None"},{"content":"Leysia Palen , Sarah Vieweg, The emergence of online widescale interaction in unexpected events: assistance, alliance & retreat, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460583"},{"content":"Paul, M., J.; and Dredze, M. (2011). You are What You Tweet: Analyzing Twitter for Public Health. In Proc. ICWSM '11.","paperID":"None"},{"content":"Rodriguez, O. (2010). Narco-blogger beats Mexico drug war news blackout. Huffington Post.","paperID":"None"},{"content":"Rosenberg, M., O'Carroll, P., and Powell, K. (1992). Violence is a public health problem. Journal of the American Medical Association, 267, 3071--3072.","paperID":"None"},{"content":"Rule, B. G., & Ferguson, T. J. (1986). The effects of media violence on attitudes, emotions, and cognitions. Journal of Social Issues, 42(3), 29--50.","paperID":"None"},{"content":"Shirk, D. A. (2010). Drug violence in Mexico: data and analysis from 2001-2009. Trends in Organized Crime, 13(2-3), 167--174.","paperID":"None"},{"content":"Sparks, G., & Sparks, C. (2002). Effects of media violence. Media effects: Advances of theory & research.","paperID":"None"},{"content":"Kate Starbird , Leysia Palen, (How) will the revolution be retweeted?: information diffusion and the 2011 Egyptian uprising, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145212"},{"content":"Kate Starbird , Leysia Palen , Amanda L. Hughes , Sarah Vieweg, Chatter on the red: what hazards threat reveals about the social life of microblogged information, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718965"},{"content":"Stevenson, M. (2011). Mexico Battles New 'Drug Language' To Describe Horrifying Violence. Huffington Post.","paperID":"None"},{"content":"Tejeda, A. G. (2010). La Real Academia reconoce el lenguaje del crimen organizado: http://www.jornada.unam.mx/2010/10/28/cultura/a03n1cul","paperID":"None"},{"content":"Urbán, A., and Acre, H. (2013). Crece en México número de usuarious de internet: http://www.eluniversal.com.mx/finanzas/102437.html","paperID":"None"},{"content":"Sarah Vieweg , Amanda L. Hughes , Kate Starbird , Leysia Palen, Microblogging during two natural hazards events: what twitter may contribute to situational awareness, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753486"},{"content":"Zarowsky, C. (2000). Trauma stories: Violence, emotion and politics in Somali Ethiopia. Transcultural Psychiatry, 37(3), 383--402.","paperID":"None"}],"abstract":"Social media platforms have emerged as prominent information sharing ecosystems in the context of a variety of recent crises, ranging from mass emergencies, to wars and political conflicts. We study affective responses in social media and how they might indicate desensitization to violence experienced in communities embroiled in an armed conflict. Specifically, we examine three established affect measures: negative affect, activation, and dominance as observed on Twitter in relation to a number of statistics on protracted violence in four major cities afflicted by the Mexican Drug War. During a two year period (Aug 2010 - Dec 2012), while violence was on the rise in these regions, our findings show a decline in negative emotional expression as well as a rise in emotional arousal and dominance in Twitter posts: aspects known to be psychological markers of desensitization. We discuss the implications of our work for behavioral health, facilitating rehabilitation efforts in communities enmeshed in an acute and persistent urban warfare, and the impact on civic engagement.","video":"http://www.youtube.com/embed/XJzEooVfuB0?rel=0","title":"\"Narco\" emotions: affect and desensitization in social media during the mexican drug war","filename":"CHI14/p3563","authors":["Munmun De Choudhury","Andrés Monroy-Hernández","Gloria Mark"],"conference":"CHI '14"}