{"paperId":2557277,"abstract":"Much ICTD research for sub-Saharan Africa has focused on how technology related interventions have aimed to incorporate marginalized communities towards global economic growth. Our work builds on this. We present results from an exploratory qualitative study on the family communication practices of family members who communicate both within and between rural, suburban, and urban settings in Kenya. Our findings reveal that family communication focuses on economic support, well-being, life advice, and everyday coordination of activities. We also outline social factors that affect family communication, including being an eldest child, having a widowed sibling, and having reduced access to technology because of gender, literacy, or one's financial situation. Lastly, we discuss new opportunities for technology design and articulate the challenges that designers will face if creating or deploying family communication technologies in Kenya.","citation":[{"content":"Kagonya Awori , Frank Vetere , Wally Smith, Transnationalism, Indigenous Knowledge and Technology: Insights from the Kenyan Diaspora, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702488"},{"content":"Roberta M. Melvin , Andrea Bunt , Erick Oduor , Carman Neustaedter, The Effect of Signal Expense and Dependability on Family Communication in Rural and Northern Canada, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702301"},{"content":"Nicola J. Bidwell, Moving the centre to design social media in rural Africa, AI & Society, v.31 n.1, p.51-77, February  2016","paperID":"2887238"}],"reference":[{"content":"Agesa, R. U. and Kim, S., \"Rural to urban migration as a household decision: Evidence from Kenya,\" Review of Development Economics 5, 1 (2001), 60--75.","paperID":"None"},{"content":"Best, M., Smyth, T. N, Etherton, J. & Wornyo, E. Uses of Mobile Phones in Post-Conflict Liberia. Inf. Tech. & Int'l Development Vol 6, (2) (2010), 91--108.","paperID":"None"},{"content":"Bidwell, N. J. & Siya, M. J. Situating Asynchronous Voice in Rural Africa. Proc. INTERACT, Springer, (2013), 36--53.","paperID":"None"},{"content":"Bidwell, N. J., Lalmas, M., Marsden, G., Dlutu, B., Ntlangano, S., Manjingolo, A., Tucker, W. D., Jones, M., Robinson, R., Vartiainen, E., Klampanos, I. Please call ME.N.U.4EVER: Designing for 'Callback' in Rural Africa. Proc. IWIPS'11, (2011), 117--138.","paperID":"None"},{"content":"Burrell, J., Evaluating Shared Access: social equality and the circulation of mobile phones in rural Uganda, Journal of Computer-Mediated Communication, 15(2), (2010), 230--250.","paperID":"None"},{"content":"Donner, J., \"The Rules of Beeping: Exchanging messages via intentional \"missed calls\" on mobile phones, Journal Computer Mediated Communication, 13 (1), ACM Press (2008), 1--22.","paperID":"None"},{"content":"Eriksson, E., A Case Study About Cell Phone Use by People in Rural Keyna, Vaxjo University, School of Mathematics and Systems Engineering Bachelor's Degree Thesis, Apr 2008, IV9003.","paperID":"None"},{"content":"Francis, E., (2000) Making a Living: Changing Livelihoods in Rural Africa. Routledge, London.","paperID":"None"},{"content":"Ginsburg, F. Rethinking the Digital Age, in Global Indigenous Media: Cultures, Poetics, and Politics, Wilson, P. and Stewart, M. (Eds.), Duke University Press (2008).","paperID":"None"},{"content":"Githurai Community. A Kenyatta University-Githurai Partnership http://www.ku.ac.ke/Githurai/index.html.","paperID":"None"},{"content":"Horst, H. Blessings and burdens of communication: cell phones in Jamaican transnational social fields, Global Networks, 6, 2, (2006), 143--159.","paperID":"None"},{"content":"Horst, H. and Miller, D. From Kinship to Link-up: Cell Phones and Social Networking in Jamaica, Current Anthropology, 46, 5, (2005), 755--778.","paperID":"None"},{"content":"Hughes, N. and Lonie, S., M-PESA: Mobile Money for the 'Unbanked' Turning Cellphones into 24-Hour Tellers in Kenya, Innovations: Technology, Governance, Globalization 2, 1-2 (2007), 63--81.","paperID":"None"},{"content":"Tribes in Kenya http://www.kenyanview.com/Kenyan/tribes/kenyaweb.htm","paperID":"None"},{"content":"Kisumu. http://en.wikipedia.org/wiki/Kisumu","paperID":"None"},{"content":"Kwake, K. and Adigun, M., Analyzing ICT use and access amongst rural women in Kenya, International Journal of Education and Development using Information and Communication Technology (IJEDICT), 2008, Vol. 4, Issue 4, pp. 127--147.","paperID":"None"},{"content":"Jun Liu , Ying Liu , Pei-Luen Patrick Rau , Hui Li , Xia Wang , Dingjun Li, How socio-economic structure influences rural users' acceptance of mobile entertainment, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753659"},{"content":"MigoriTown.com http://migoritown.com/","paperID":"None"},{"content":"Lucas Mimbi , Felix Olu Bankole , Michael Kyobe, Mobile phones and digital divide in East African countries, Proceedings of the South African Institute of Computer Scientists and Information Technologists Conference on Knowledge, Innovation and Leadership in a Diverse, Multidisciplinary Environment, October 03-05, 2011, Cape Town, South Africa","paperID":"2072267"},{"content":"Morawczynski, O., and Pickenism, M.-PESA: More Than Money Transfer, www.mobilepaymentsworld.com/m-pesa-more-than-money-transfer-by-olga-morawczynski-and-mark-pickens/. Mobile Payments World, Accessed 9th September 2013.","paperID":"None"},{"content":"Murphy, L. and Priebe, A. 'My co-wife can borrow my mobile phone!': gender geographies of cellphone usage and significance for rural Kenyans, Gender Technology and Development, March 2011, Vol 15, No 1, 1--23.","paperID":"None"},{"content":"Anicia Peters , Michael Oren , Nicola Bidwell, Namibian and american cultural orientations toward facebook, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2223843"},{"content":"Poverty Overview, http://www.worldbank.org/en/topic/poverty/overview.","paperID":"None"},{"content":"Nimmi Rangaswamy , Nithya Sambasivan, Cutting Chai, Jugaad, and Here Pheri: towards UbiComp for a global community, Personal and Ubiquitous Computing, v.15 n.6, p.553-564, August    2011","paperID":"2035737"},{"content":"Nithya Sambasivan , Ed Cutrell , Kentaro Toyama , Bonnie Nardi, Intermediated technology use in developing communities, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753718"},{"content":"Sambasivan, N., Rangaswamy, N., Cutrell, E., and Nardi, B. Ubicomp4D: Infrastructure for International Development - the case of Urban Indian Slums. Proc. CSCW, ACM Press (2009).","paperID":"None"},{"content":"Thomas N. Smyth , Satish Kumar , Indrani Medhi , Kentaro Toyama, Where there's a will there's a way: mobile media sharing in urban india, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753436"},{"content":"Strauss, A. and Corbin, J., Basics of Qualitative Research, 2nd Edition, Sage Publications (1998).","paperID":"None"},{"content":"Taylor, A., Out There, Proc. CHI, ACM Press (2011).","paperID":"None"},{"content":"Vertovec, S. Cheap Calls: The Social Glue of Migrant Transnationalism. Global Networks 4, 2, (2004).","paperID":"None"},{"content":"Amanda Williams , Ken Anderson , Paul Dourish, Anchored mobilities: mobile technology and transnational migration, Proceedings of the 7th ACM conference on Designing interactive systems, p.323-332, February 25-27, 2008, Cape Town, South Africa","paperID":"1394480"},{"content":"Susan P. Wyche , Andrea Forte , Sarita Yardi Schoenebeck, Hustling online: understanding consolidated facebook use in an informal settlement in Nairobi, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2481391"},{"content":"Susan P. Wyche , Rebecca E. Grinter, \"This is how we do it in my country\": a study of computer-mediated family communication among kenyan migrants in the united states, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145222"},{"content":"Susan P. Wyche , Laura L. Murphy, \"Dead China-make\" phones off the grid: investigating and designing for mobile phone use in rural Africa, Proceedings of the Designing Interactive Systems Conference, June 11-15, 2012, Newcastle Upon Tyne, United Kingdom","paperID":"2317985"},{"content":"Susan P. Wyche , Thomas N. Smyth , Marshini Chetty , Paul M. Aoki , Rebecca E. Grinter, Deliberate interactions: characterizing technology use in Nairobi, Kenya, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753719"},{"content":"Susan P. Wyche , Sarita Yardi Schoenebeck , Andrea Forte, \"Facebook is a luxury\": an exploratory study of social media use in rural Kenya, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441783"}],"title":"How technology supports family communication in rural, suburban, and urban kenya","filename":"CHI14/p2705","authors":["Erick Oduor","Carman Neustaedter","Tejinder K. Judge","Kate Hennessy","Carolyn Pang","Serena Hillman"],"conference":"CHI '14"}