{"paperId":2557344,"citation":[{"content":"Lena Mamykina , Drashko Nakikj , Noemie Elhadad, Collective Sensemaking in Online Health Forums, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702566"},{"content":"Guo Li , Xiaomu Zhou , Tun Lu , Jiang Yang , Ning Gu, SunForum: Understanding Depression in a Chinese Online Community, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819994"}],"reference":[{"content":"Armstrong, N., Koteyko, N., & Powell, J., 'Issues of identity and authority in an online diabetes community'. Health, 16, 4(2011), 347--365.","paperID":"None"},{"content":"Yunan Chen, Take it personally: accounting for individual difference in designing diabetes management systems, Proceedings of the 8th ACM Conference on Designing Interactive Systems, August 16-20, 2010, Aarhus, Denmark","paperID":"1858218"},{"content":"Andrea Civan-Hartzler , David W. McDonald , Chris Powell , Meredith M. Skeels , Marlee Mukai , Wanda Pratt, Bringing the field into focus: user-centered design of a patient expertise locator, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753577"},{"content":"Giddens, A. New rules of sociological method: A positive critique of interpretative sociologies. Stanford, CA: Stanford University Press, 1993.","paperID":"None"},{"content":"Goffman, E. The presentation of self in everyday life. New York {N.Y.}, Doubleday, 1990.","paperID":"None"},{"content":"Greene, J.A. et. al. Online Social Networking by Patients with Diabetes. Journal of General Internal Medicine, 26, 3(2010), 287--292.","paperID":"None"},{"content":"Hesketh, T., Zhu, W. X. Health in China. Traditional Chinese medicine: one country, two systems. BMJ, 315, 7100(1997), 115--117.","paperID":"None"},{"content":"Jina Huh , Rupa Patel , Wanda Pratt, Tackling dilemmas in supporting 'the whole person' in online patient communities, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208535"},{"content":"Lam, T. P. Strengths and weaknesses of traditional Chinese medicine and Western medicine in the eyes of some Hong Kong Chinese. JECH, 55, 10(2001), 762--765.","paperID":"None"},{"content":"Qinying Liao , Yingxin Pan , Michelle X. Zhou , Fei Ma, Chinese online communities: balancing managementcontrol and individual autonomy, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753658"},{"content":"Markus, H.R., Kitayama, S. Culture and the self: Implications for cognition, emotion, and motivation. Psychological Review, 98, (1991), 224--253.","paperID":"None"},{"content":"Lena Mamykina , Andrew D. Miller , Elizabeth D. Mynatt , Daniel Greenblatt, Constructing identities through storytelling in diabetes management, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753507"},{"content":"Lena Mamykina , Elizabeth Mynatt , Patricia Davidson , Daniel Greenblatt, MAHI: investigation of social scaffolding for reflective thinking in diabetes management, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357131"},{"content":"Lena Mamykina , Elizabeth D. Mynatt , David R. Kaufman, Investigating health management practices of individuals with diabetes, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124910"},{"content":"Newman, J. M. Food Culture in China. Westport, Conn: Greenwood Press, 2004.","paperID":"None"},{"content":"Nisbett, R.E. et. al. Culture and systems of thought: Holistic vs. analytic cognition. Psychological Review, 108(2001), 291--310.","paperID":"None"},{"content":"Oldenburg, Ray. The Great Good Place. New York: Marlowe & Company, 1991.","paperID":"None"},{"content":"Davy Preuveneers , Yolande Berbers, Mobile phones assisting with health self-care: a diabetes case study, Proceedings of the 10th international conference on Human computer interaction with mobile devices and services, September 02-05, 2008, Amsterdam, The Netherlands","paperID":"1409260"},{"content":"Howard Rheingold, Virtual Community: Homesteading on the Electronic Frontier, HarperTrade, 1994","paperID":"541496"},{"content":"Tilden, B. Identity and Adherence in a Diabetes Patient: Transformations in Psychotherapy. Qualitative Health Research, 15, 3(2005), 312--324.","paperID":"None"},{"content":"Xinhua. Attack prompts concern over doctor-patient tensions in China. http://www.wantchinatimes. com/news-subclass- cnt.aspx'id= 20120328000110 &cid=1103, retrieved on March 28, 2012","paperID":"None"},{"content":"Xu, Y. et al. Prevalence and Control of Diabetes in Chinese Adults. JAMA, 310, 9(2013), 948--959.","paperID":"None"},{"content":"Yang, J. et al. Activity Lifespan: In Proc. ICWSM, IAAA'10, 186--193.","paperID":"None"},{"content":"Yang, J. et. al. Collaborating Globally: Culture and Organizational Computer-Mediated Communication. In Proc. ICIS'11, 2011, 1--20.","paperID":"None"},{"content":"Jiang Yang , Mark S. Ackerman , Lada A. Adamic, Virtual gifts and guanxi: supporting social exchange in a chinese online community, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958832"},{"content":"Chen Zhao , Pamela Hinds , Ge Gao, How and to whom people share: the role of culture in self-disclosure in online communities, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145219"},{"content":"Zheng, P. et. al. Public hospitals in China. Journal of law and medicine, 13, 4 (2006), 465--470.","paperID":"None"},{"content":"Zhou, T. Understanding online community user participation: a social influence. Internet Research, 21, 1(2011), 67--81.","paperID":"None"}],"abstract":"China has overtaken India and the U.S. as host to the largest diabetic population in the world. Many problems exist in the Chinese healthcare system and very small number of diabetes patients receives treatment. Our paper reports on a case study through the lens of an online diabetes patient community, Sweet Home. We conducted participant observations, text analysis, and interviews, to understand the health management of patients at Sweet Home. Our findings reveal that patients' understanding of diabetes, their choice of treatments, their routine management, and their interactions with others (in the physical world) and among themselves (in the online world) are influenced by many factors: belief in traditional Chinese versus western medicine, cultural and social norms regarding social eating and drinking, conflicts over self-images, and responses to comments and pressures of coworkers. That is, social context may significantly affect patients' behaviors and each individual patient's actions may also help reshape the social context. We draw out implications for how our society as a whole may respond to these issues, from the perspective of public health, education, and information technology design.","video":"http://www.youtube.com/embed/M6gSnA4o3Z8?rel=0","title":"Sweet Home: understanding diabetes management via a chinese online community","filename":"CHI14/p3997","authors":["Xiaomu Zhou","Si Sun","Jiang Yang"],"conference":"CHI '14"}