{"paperId":2557064,"citation":[{"content":"Duncan P. Brumby , Susan Zhuang, Visual Grouping in Menu Interfaces, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702177"},{"content":"Xiuli Chen , Gilles Bailly , Duncan P. Brumby , Antti Oulasvirta , Andrew Howes, The Emergence of Interactive Behavior: A Model of Rational Menu Search, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702483"}],"reference":[{"content":"Anderson, J.R., Bothell, D., & Douglass, S. Eye movements do not reflect retrieval: Limits of the eyemind hypothesis. Psychological Science, 15, (2004), 225--231.","paperID":"None"},{"content":"Anne Aula , Rehan M. Khan , Zhiwei Guan, How does search behavior change as search becomes more difficult?, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753333"},{"content":"Gilles Bailly , Antti Oulasvirta , Duncan P. Brumby , Andrew Howes, Model of visual search and selection time in linear menus, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557093"},{"content":"Brumby, D.P. & Howes, A. Strategies for guiding interactive search: An empirical investigation into the consequences of label relevance for assessment and selection. Human-Computer Interaction, 23, (2008), 1--46.","paperID":"None"},{"content":"Byrne, M.D. ACT-R/PM and menu selection: Applying a cognitive architecture to HCI. International Journal of Human-Computer Studies, 55, (2001), 41--84.","paperID":"None"},{"content":"Card, S.K., Visual search of computer command menus. In H. Bouma and D. Bouwhuis (Eds.) Attention and Performance X, LEA, 1984, 97--108.","paperID":"None"},{"content":"Andy Cockburn , Carl Gutwin , Saul Greenberg, A predictive model of menu performance, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240723"},{"content":"Edward Cutrell , Zhiwei Guan, What are you looking for?: an eye-tracking study of information usage in web search, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240690"},{"content":"Wai-Tat Fu , Peter Pirolli, SNIF-ACT: a cognitive model of user navigation on the world wide web, Human-Computer Interaction, v.22 n.4, p.355-412, November 2007","paperID":"1466608"},{"content":"Anthony J. Hornof, Cognitive strategies for the visual search of hierarchical computer displays, Human-Computer Interaction, v.19 n.3, p.183-223, September 2004","paperID":"1466556"},{"content":"Lee, E. & MacGregor, J. Minimizing user search time in menu retrieval systems. Human Factors, 27, (1985), 157--162.","paperID":"None"},{"content":"McDonald, J.E., Stone, J.D., & Liebelt, L.S. Searching for items in menus: The effects of organization and type of target. Proc. Human Factors and Ergonomics Society Annual Meeting, HFES (1983), 834--837.","paperID":"None"},{"content":"Brad Mehlenbacher , Thomas M. Duffy , James Palmer, Finding information on a menu: linking menu organization to the user's goals, Human-Computer Interaction, v.4 n.3, p.231-251, September 1989","paperID":"1455746"},{"content":"Myers, C.W., Lewis, R.L., & Howes, A. Bounded optimal state estimation and control in visual search: Explaining distractor ratio effects. Proc. CogSci 2013, Cognitive Science Society (2013), 1049--1054.","paperID":"None"},{"content":"Nilsen, E.L. Perceptual-motor control in humancomputer interaction. Report 37, The Cognitive Sci. & Machine Intelligence Lab. Univ. of Michigan (1991).","paperID":"None"},{"content":"Peter Pirolli, Information Foraging Theory: Adaptive Interaction with Information, Oxford University Press, Inc., New York, NY, 2009","paperID":"1541919"},{"content":"John Rieman , Richard M. Young , Andrew Howes, A dual-space model of iteratively deepening exploratory learning, International Journal of Human-Computer Studies, v.44 n.6, p.743-775, June 1996","paperID":"229003"},{"content":"Yoon, C., Feinberg, F., Hu, P., et al. Category norms as a function of culture and age: Comparisons of item responses to 105 categories by American and Chinese adults. Psychology and Aging, 19, (2004), 379--393.","paperID":"None"},{"content":"Young, R.M., Rational analysis of exploratory choice. In M. Oaksford and N. Chater (Eds.), Rational Models of Cognition. Oxford University Press, 1998, 469--500.","paperID":"None"},{"content":"The all-telling eye, The Economist, 22 Oct 2011. http://www.economist.com/node/21533362.","paperID":"None"}],"abstract":"When searching a display, users sometimes know what the target is but sometimes do not. It has generally been assumed that for this latter case people must engage in a deeper semantic evaluation of items during the search process. This idea is central to Information Foraging theory. But do people actually spend longer assessing items when engaged in a semantically demanding search task' We investigate this by having participants locate target items in 16-item menus. Participants were either told exactly what to look for (known-item search) or they were told the category that the target belonged to (semantic search). Participants were faster and more accurate at known-item searches. Eye-movement data show that this was because participants were more likely to skip over items when performing known-item searches. Contrary to expectation, we found limited empirical evidence to support the idea that deeper semantic evaluations of items lead to longer gaze durations (this occurred only when items were arranged very close together). This finding is important because it reveals how people adopt different eye gaze strategies depending on the kind of search activity they are engaged in.","video":"http://www.youtube.com/embed/UCZ92ut9e74?rel=0","title":"How does knowing what you are looking for change visual search behavior?","filename":"CHI14/p3895","authors":["Duncan P. Brumby","Anna L. Cox","Jacqueline Chung","Byron Fernandes"],"conference":"CHI '14"}