{"paperId":2557240,"citation":[{"content":"Jennifer Marlow , Laura A. Dabbish , Jodi L. Forlizzi, Exploring the Role of Activity Trace Design on Evaluations of Online Worker Quality, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702195"},{"content":"Jennifer Marlow , Laura A. Dabbish, The Effects of Visualizing Activity History on Attitudes and Behaviors in a Peer Production Context, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675250"},{"content":"Juho Kim , Eun-Young Ko , Jonghyuk Jung , Chang Won Lee , Nam Wook Kim , Jihee Kim, Factful: Engaging Taxpayers in the Public Discussion of a Government Budget, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702352"},{"content":"John Vines , Peter C. Wright , David Silver , Maggie Winchcombe , Patrick Olivier, Authenticity, Relatability and Collaborative Approaches to Sharing Knowledge about Assistive Living Technology, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675222"},{"content":"Engin Bozdag , Jeroen Hoven, Breaking the filter bubble: democracy and design, Ethics and Information Technology, v.17 n.4, p.249-265, December  2015","paperID":"2887443"}],"reference":[{"content":"Aronson, E., Turner, J. A., & Carlsmith, J. M. Communicator credibility and communication discrepancy as determinants of opinion change. The Journal of Abnormal and Social Psychology 67, 1 (1963): 31.","paperID":"None"},{"content":"Birnbaum, M. H., & Stegner, S. E. Source credibility in social judgment: Bias, expertise, and the judge's point of view. Journal of Personality and Social Psychology 37, 1 (1979): 48.","paperID":"None"},{"content":"Bochner, S., & Insko, C. A. Communicator discrepancy, source credibility, and opinion change. Journal of Personality and Social Psychology 4, 6 (1966): 614.","paperID":"None"},{"content":"Dan Cosley , Shyong K. Lam , Istvan Albert , Joseph A. Konstan , John Riedl, Is seeing believing?: how recommender system interfaces affect users' opinions, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642713"},{"content":"Chaiken, S. Heuristic versus systematic information processing and the use of source versus message cues in persuasion. Journal of personality and social psychology 39.5 (1980): 752.","paperID":"None"},{"content":"Cronbach, L. J., Coefficient Alpha and The Internal Structure of Tests. Psychometrika 16, 3 (1951), 297--334.","paperID":"None"},{"content":"Dholakia, R. R., & Sternthal, B. Highly credible sources: persuasive facilitators or persuasive liabilities' Journal of Consumer Research (1977), 223--232.","paperID":"None"},{"content":"Festinger, L. A theory of cognitive dissonance. Vol. 2. Stanford university press, 1962.","paperID":"None"},{"content":"Frey, D. Recent Research on Selective Exposure to Information. Advances in Experimental Social Psychology 19 (1986), 41--80.","paperID":"None"},{"content":"Garrett, R. K. and P. Resnick, Resisting political fragmentation on the Internet. Daedalus140, 4 (2011), 108--120.","paperID":"None"},{"content":"Hovland, C. I., and Walter Weiss. \"The influence of source credibility on communication effectiveness.\" Public opinion quarterly 15.4 (1951): 635--650.","paperID":"None"},{"content":"Hyang-Sook Kim , S. Shyam Sundar, Using interface cues in online health community boards to change impressions and encourage user contribution, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979028"},{"content":"Travis Kriplean , Jonathan Morgan , Deen Freelon , Alan Borning , Lance Bennett, Supporting reflective public thought with considerit, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145249"},{"content":"Q. Vera Liao , Wai-Tat Fu, Can you hear me now?: mitigating the echo chamber effect by source position indicators, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531711"},{"content":"McGinnies, E., & Ward, C. D. Better Liked Than Right Trustworthiness and Expertise as Factors in Credibility. Personality and Social Psychology Bulletin 6, 3 (1980), 467--472.","paperID":"None"},{"content":"Miriam J. Metzger, Making sense of credibility on the Web: Models for evaluating online information and recommendations for future research, Journal of the American Society for Information Science and Technology, v.58 n.13, p.2078-2091, November 2007","paperID":"1315940"},{"content":"Sean A. Munson , Paul Resnick, Presenting diverse political opinions: how and how much, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753543"},{"content":"Souneil Park , Seungwoo Kang , Sangyoung Chung , Junehwa Song, NewsCube: delivering multiple aspects of news to mitigate media bias, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518772"},{"content":"Petty, R. E., and John T. Cacioppo. \"Source factors and the elaboration likelihood model of persuasion.\" Advances in Consumer Research 11.1 (1984), 668--672.","paperID":"None"},{"content":"Sears, D. O., & Freedman, J. L. Selective exposure to information: A critical review. Public Opinion Quarterly 31 2 (1967), 194--213.","paperID":"None"},{"content":"N. Sadat Shami , Kate Ehrlich , Geri Gay , Jeffrey T. Hancock, Making sense of strangers' expertise from signals in digital artifacts, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518713"},{"content":"V. G. Vinod Vydiswaran , ChengXiang Zhai , Dan Roth , Peter Pirolli, BiasTrust: teaching biased users about controversial topics, Proceedings of the 21st ACM international conference on Information and knowledge management, October 29-November 02, 2012, Maui, Hawaii, USA","paperID":"2398541"},{"content":"Walther, J. B. Computer-mediated communication impersonal, interpersonal, and hyperpersonal interaction. Communication research 23.1 (1996), 3--43.","paperID":"None"},{"content":"Walther, J. B., Van Der Heide, B., Hamel, L. M., & Shulman, H. C. Self-Generated Versus Other-Generated Statements and Impressions in Computer-Mediated Communication A Test of Warranting Theory Using Facebook. Communication Research 36, 2 (2009), 229--253.","paperID":"None"},{"content":"Winter, S., Krämer, N. C., Appel, J., & Schielke, K. Information selection in the blogosphere: The effect of expertise, community rating, and age. In Proc. annual conference of the International Communication Association (2010).","paperID":"None"},{"content":"Zuwerink Jacks, J., & Cameron, K. A. Strategies for resisting persuasion. Basic and Applied Social Psychology 25, 2(2003), 145--161.","paperID":"None"}],"abstract":"We studied how a source expertise indicator impacted users' information seeking behavior when using a system aggregating diverse opinions, and how it interacted with a source position indicator to shape users' selectivity of information. We found that, for both attitude consistent and inconsistent information, the expertise indicator increased the selection of sources indicated to have high expertise and decreased that of low expertise. Moreover, when both source expertise and position indicators were present, users' selective exposure tendency, i.e., preferential selection of attitude consistent sources over inconsistent ones, decreased among expert sources. Moreover, we found that the expertise indicator could benefit encouraging common ground seeking with different others by increasing the agreement with, and perceived expertise of inconsistent sources indicated to be experts. Design implications for moderating selective exposure by highlighting the utility of dissonant information were discussed.","video":"http://www.youtube.com/embed/TQmezdbNDio?rel=0","title":"Expert voices in echo chambers: effects of source expertise indicators on exposure to diverse opinions","filename":"CHI14/p2745","authors":["Q. Vera Liao","Wai-Tat Fu"],"conference":"CHI '14"}