{"paperId":2557246,"citation":[{"content":"Sergiu Veazanchin , Joseph J. LaViola, Jr., DynoFighter: exploring a physical activity incentive mechanism to support exergaming, Proceedings of the 41st Graphics Interface Conference, June 03-05, 2015, Halifax, Nova Scotia, Canada","paperID":"2788939"},{"content":"Mads Møller Jensen , Majken K. Rasmussen , Florian Floyd Mueller , Kaj Grønbæk, Keepin' it Real: Challenges when Designing Sports-Training Games, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702243"},{"content":"Expanding exertion gaming, International Journal of Human-Computer Studies, v.90 n.C, p.1-13, June 2016","paperID":"2928258"},{"content":"Fedwa Laamarti , Mohamad Eid , Abdulmotaleb El Saddik, An overview of serious games, International Journal of Computer Games Technology, 2014, p.11-11, January 2014","paperID":"2728206"}],"reference":[{"content":"Marc A. Adams , Simon J. Marshall , Lindsay Dillon , Susan Caparosa , Ernesto Ramirez , Justin Phillips , Greg J. Norman, A theory-based framework for evaluating exergames as persuasive technology, Proceedings of the 4th International Conference on Persuasive Technology, April 26-29, 2009, Claremont, California","paperID":"1542006"},{"content":"Ajzen, I. 1991. The theory of planned behavior. Organizational behavior and human decision processes, 50(2), 179--211.","paperID":"None"},{"content":"Fahd Albinali , Stephen Intille , William Haskell , Mary Rosenberger, Using wearable activity type detection to improve physical activity energy expenditure estimation, Proceedings of the 12th ACM international conference on Ubiquitous computing, September 26-29, 2010, Copenhagen, Denmark","paperID":"1864396"},{"content":"Armitage, C. J. and Conner, M. (2001), Efficacy of the Theory of Planned Behaviour: A meta-analytic review. Brit J Soc Psychol, 40, 471--499.","paperID":"None"},{"content":"Baer, R. A. 2003. Mindfulness Training as a Clinical Intervention: A Conceptual and Empirical Review. Clin Psychol: Sci Pract,10(2), 125--143.","paperID":"None"},{"content":"Baranowski, T., Buday, R., Thompson, D. I., & Baranowski, J. 2008. Playing for real: Video games and stories for health-related behavior change. Am J Preven Med, 34(1), 74--82.","paperID":"None"},{"content":"Bausch L, Beran J, Cahanes S, Krug L. 2008. Physiological responses while playing Nintendo Wii Sports. J Undergrad Kinesiol Res, 3(2), 19--25.","paperID":"None"},{"content":"Borg, G. 1985. An introduction to Borg's RPE-scale. Ithaca, NY: Movement Publications.","paperID":"None"},{"content":"Borg, G., Hassmen, P., & Lagerström, M. 1987. Perceived exertion related to heart rate and blood lactate during arm and leg exercise. Euro J Appl Physiol Occupat Physiol, 56(6), 679--685.","paperID":"None"},{"content":"Sunny Consolvo , David W. McDonald , Tammy Toscos , Mike Y. Chen , Jon Froehlich , Beverly Harrison , Predrag Klasnja , Anthony LaMarca , Louis LeGrand , Ryan Libby , Ian Smith , James A. Landay, Activity sensing in the wild: a field trial of ubifit garden, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357335"},{"content":"Sunny Consolvo , David W. McDonald , James A. Landay, Theory-driven design strategies for technologies that support behavior change in everyday life, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518766"},{"content":"Cronbach, L.J., & Furby, L. 1970. How we should measure \"Change\" or should we? Psych Bull, 74, 68--80.","paperID":"None"},{"content":"Crum, A. J. & Langer, E. J. 2007. Mind-set matters: exercise and the placebo effect. Psychol Sci. 18(2), 16571.","paperID":"None"},{"content":"Desharnais, R., et al. 1993. Aerobic exercise and the placebo effect: a controlled study. Psychosom Med, 55(2), 149--154.","paperID":"None"},{"content":"Dishman, R. K., Sallis, J. F., & Orenstein, D. R. 1985. The determinants of physical activity and exercise. Public Health Rep. 100(2), 158--171.","paperID":"None"},{"content":"Egan, A. D., Winchester, J. B., Foster, C., & McGuigan, M. R. 2006. Using session RPE to monitor different methods of resistance exercise. J Sports Sci Med, 5(2), 289--295.","paperID":"None"},{"content":"Eiriksdottir, E., et al. 2011. Assessing Health Games in Secondary Schools. An Investigation of the American Horsepower Challenge 2009-2010. Georgia Institute of Technology Technical Report. Atlanta.","paperID":"None"},{"content":"Ezzati, M., Lopez, A. D., Rodgers, A., & Murray, C. J. (Eds.). 2004. Comparative quantification of health risks: global and regional burden of diseases attributable to selected major risk factors (Vol. 1). World Health Organization.","paperID":"None"},{"content":"Samantha Finkelstein , Evan A. Suma, Astrojumper: Motivating exercise with an immersive virtual reality exergame, Presence: Teleoperators and Virtual Environments, v.20 n.1, p.78-92, February 2011","paperID":"2000643"},{"content":"BJ Fogg, A behavior model for persuasive design, Proceedings of the 4th International Conference on Persuasive Technology, April 26-29, 2009, Claremont, California","paperID":"1541999"},{"content":"Eric B. Hekler , Predrag Klasnja , Jon E. Froehlich , Matthew P. Buman, Mind the theoretical gap: interpreting, using, and developing behavioral theory in HCI research, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466452"},{"content":"Graves, L. E., Ridgers, N. D., Williams, K., Stratton, G., & Atkinson, G. 2010. Deakin Research Online. J Physic Activ Healt, 7, 393--401.","paperID":"None"},{"content":"Katherine Isbister , Mary Flanagan , Chelsea Hash, Designing games for learning: insights from conversations with designers, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753637"},{"content":"IGN. 2010. Dance Central Images. Internet. http://j.mp/ign_kinect Retrieved December 15, 2011.","paperID":"None"},{"content":"Min Kyung Lee , Sara Kiesler , Jodi Forlizzi, Mining behavioral economics to design persuasive technology for healthy choices, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1978989"},{"content":"James J. Lin , Lena Mamykina , Silvia Lindtner , Gregory Delajoux , Henry B. Strub, Fish'n'Steps: encouraging physical activity with an interactive computer game, Proceedings of the 8th international conference on Ubiquitous Computing, p.261-278, September 17-21, 2006, Orange County, CA","paperID":"2166299"},{"content":"Andrew Macvean , Judy Robertson, Understanding exergame users' physical activity, motivation and behavior over time, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466163"},{"content":"Jane McGonigal, Reality Is Broken: Why Games Make Us Better and How They Can Change the World, Penguin Group , The, 2011","paperID":"1972527"},{"content":"Miyachi, M., Yamamoto, K., Ohkawara, K., Tanaka, S. 2010. METs in adults while playing active video games: a metabolic chamber study. Med Sci Sports Exerc. 42(6),1149--53.","paperID":"None"},{"content":"Florian Mueller , Frank Vetere , Martin Gibbs , Darren Edge , Stefan Agamanolis , Jennifer Sheridan , Jeffrey Heer, Balancing exertion experiences, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208322"},{"content":"National Center for Health Statistics. 2013. Health, USA, 2012: With Special Feature on Emergency Care. Hyattsville, MD.","paperID":"None"},{"content":"Norman, G. J., Adams, M. A., Ramirez, E. R., Carlson, J. A., Kerr, J., Godbole, S., ... & Marshall, S. J. 2013. Effects of behavioral contingencies on adolescent active videogame play and overall activity: A randomized trial. Game Healt, 2(3), 158--165.","paperID":"None"},{"content":"O'Loughlin, E. K., Dugas, E. N., Sabiston, C. M., & O'Loughlin, J. L. 2012. Prevalence and Correlates of Exergaming in Youth. Pediatrics, 130(5), 806--814.","paperID":"None"},{"content":"Oinas-Kukkonen, H., Harjumaa, M. 2009. Persuasive Systems Design: Key Issues, Process Model, and System Features. Commun Assoc Inform Syst, 24, 28.","paperID":"None"},{"content":"Owens, S. G., et al. 2011. Changes in Physical Activity and Fitness After 3 Months of Home Wii Fit' Use. J Strengt Condition Res, 25(11), 3191--3197.","paperID":"None"},{"content":"Peng, W., Lin, J. & Crouse, J. 2011. Is playing exergames really exercising' A meta-analysis of energy expenditure in Active Video Games. Cyberpsychol, Behav Soc Network. 14(11), 681--688.","paperID":"None"},{"content":"Physical Activity Guidelines Advisory Committee. 2008. Physical activity guidelines advisory committee report, 2008. US Depart. Health and Human Services.","paperID":"None"},{"content":"Stephen Purpura , Victoria Schwanda , Kaiton Williams , William Stubler , Phoebe Sengers, Fit4life: the design of a persuasive technology promoting healthy behavior and ideal weight, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979003"},{"content":"Rosenberger, M. E. 2011. Device Measuring Heart Rate, Respiration Rate, and Motion Accurately Estimates Activity Level and Energy Expenditure. Med Sci Sport Exerc. 43 (1): 63.","paperID":"None"},{"content":"Victoria Schwanda , Steven Ibara , Lindsay Reynolds , Dan Cosley, Side effects and \"gateway\" tools: advocating a broader look at evaluating persuasive systems, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1978991"},{"content":"Sherry, J. L., Greenberg, B. S., Lucas, K., & Lachlan, K. 2006. Video game uses and gratifications as predictors of use and game preference. In P. Vorderer & J. Bryant (Eds.), Playing computer games: Motives, responses and consequences. Psychology Press.","paperID":"None"},{"content":"Sinclair, J., Hingston, P., Masek, M., & Nosaka, K. 2010. Testing an exergame for effectiveness and attractiveness. ICE-GIC'10, 1--8.","paperID":"None"},{"content":"Strachan, S. M., Woodgate, J., Brawley, L. R. and Tse, A. 2005. The Relationship of Self-Efficacy and SelfIdentity to Long-Term Maintenance of Vigorous Physical Activity. J Appl Biobehav Res, 10, 98--112.","paperID":"None"},{"content":"Sweet, T. W., Foster, C., McGuigan, M. R., & Brice, G. 2004. Quantitation of resistance training using the session rating of perceived exertion method. J Strengt Condition Res, 18, 796--802.","paperID":"None"},{"content":"Tappe, M. K., Duda, J. L. & Ehrnwald, P. M. 1989. Perceived Barriers To Exercise Among Adolescents. J School Healt, 59, 153--155.","paperID":"None"},{"content":"Taylor-Pillae, R. E. et al. 2010. Validation of the Stanford Brief Activity Survey: examining psychological factors and physical activity levels in older adults. J Phys Act Healt. 7(1):87--94.","paperID":"None"},{"content":"Kristian Torning , Harri Oinas-Kukkonen, Persuasive system design: state of the art and future directions, Proceedings of the 4th International Conference on Persuasive Technology, April 26-29, 2009, Claremont, California","paperID":"1541989"},{"content":"Watson, D., Clark, L. A., & Tellegen, A. 1988. Development and validation of brief measures of positive and negative affect: The PANAS scales. J Psychol, 54(6), 1063--1070.","paperID":"None"},{"content":"Yee, N., & Bailenson, J. 2007. The Proteus Effect: The Effect of Transformed Self-Representation on Behavior. Hum Communic Res. 33: 271--290.","paperID":"None"},{"content":"Zephyr, Inc.. Zephyr Bioharness. http://www.zephyrtechnology.com","paperID":"None"}],"abstract":"Exergames, video game systems that require exertion and interaction, have been rising in popularity in the past years. However, research on popular exergames shows mixed health benefits, potentially due to minimal energy expenditure and decreasing use over time. This paper presents a 2x2 experimental study (N = 44), using a popular exergame, where we vary the framing of intention (i.e., \"Gameplay\" or \"Exercise\") and feedback (i.e., \"Health\" or \"No health\") to explore their single and interactive impacts on perceived exertion, objectively measured energy expenditure, affect, and duration of usage in a single session. Our study showed that participants primed with exercise used the system significantly longer than those primed with game play (M = 49.2 ±2.0 min versus M = 39.3 ±2.0 min). We discuss our results and possible design implications based on our single-session experiment. We conclude with a discussion on the potential impact of focusing on \"healthifying\" exergames -highlighting an exergames\" dual purpose as both a game and exercise - as opposed to gamifying health behaviors.","video":"http://www.youtube.com/embed/4NQ6b-hshqI?rel=0","title":"\"healthifying\" exergames: improving health outcomes through intentional priming","filename":"CHI14/p1855","authors":["Frank X. Chen","Abby C. King","Eric B. Hekler"],"conference":"CHI '14"}