{"paperId":2557305,"reference":[{"content":"Appadurai, A., Disjuncture and Difference in the Global Cultural Economy. Public Culture, 1990. 2(2): p. 1--24.","paperID":"None"},{"content":"Bakhtin, M.M. and V.N. Volosinov, Marxism and the Philosophy of Language.1986, Cambridge MA and London.: Harvard University Press.","paperID":"None"},{"content":"Jakob E. Bardram , Claus Bossen, A web of coordinative artifacts: collaborative work at a hospital ward, Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work, November 06-09, 2005, Sanibel Island, Florida, USA","paperID":"1099235"},{"content":"Pernille Bjørn , Morten Hertzum, Artefactual Multiplicity: A Study of Emergency-Department Whiteboards, Computer Supported Cooperative Work, v.20 n.1-2, p.93-121, April     2011","paperID":"1960722"},{"content":"Cabitza, F. and C. Simone, \"...and do it the usual way\": Fostering awareness of work conventions in document-mediated collarboration, in ECSCW2007, Springer: Limerick, Ireland. p. 119--138.","paperID":"None"},{"content":"Lars Rune Christensen, Practices of stigmergy in architectural work, Proceedings of the 2007 international ACM conference on Supporting group work, November 04-07, 2007, Sanibel Island, Florida, USA","paperID":"1316627"},{"content":"Frohmann, B., Multiplicity, Materiality, and Autonomous Agency of Documentation, in A Document (Re)turn: contributions from a research field in transition, R. Skare, N.W. Lund, and A.Varheim, Editors. 2007, Peter Lang GmbH: Frankfurt am Main p. 27--39.","paperID":"None"},{"content":"Rebecca E. Grinter, Recomposition: Coordinating a Web of SoftwareDependencies, Computer Supported Cooperative Work, v.12 n.3, p.297-327, 2003","paperID":"871460"},{"content":"Richard P. Harper, Inside the IMF: An Ethnography of Documents, Technology, and Organizational Action, Academic Press, Inc., Orlando, FL, 1997","paperID":"522687"},{"content":"Morten Hertzum, Six roles of documents in professionals' work, Proceedings of the Sixth European conference on Computer supported cooperative work, p.41-60, August 1999, Copenghagen, Denmark","paperID":"351693"},{"content":"Jensen, C.B. and P. Lauritsen, Reading digital Denmark: IT reports as material-semiotic actors. Science, Technology & Human Values 2005. 30(3): p. 352--373.","paperID":"None"},{"content":"Jensen, R.E. and P. Bjørn, Divergence and convergence in global software development: Cultural complextities as societal structures, in COOP: Design of cooperative systems2012, Springer: France. p. 123--136.","paperID":"None"},{"content":"Kristeva, J., The Kristeva Reader, ed. T.M. (ed.)1986, Oxford.: Blackwell.","paperID":"None"},{"content":"Paul Luff , Christian Heath , David Greatbatch, Tasks-in-interaction: paper and screen based documentation in collaborative activity, Proceedings of the 1992 ACM conference on Computer-supported cooperative work, p.163-170, November 01-04, 1992, Toronto, Ontario, Canada","paperID":"143475"},{"content":"Niels Windfeld Lund, Document theory, Annual Review of Information Science and Technology, v.43 n.1, p.1-55, January 2009","paperID":"1951545"},{"content":"Thomas W. Malone, How do people organize their desks?: Implications for the design of office information systems, ACM Transactions on Information Systems (TOIS), v.1 n.1, p.99-112, Jan. 1983","paperID":"357430"},{"content":"Stina Matthiesen , Pernille Bjørn , Lise Møller Petersen, \"Figure out how to code with the hands of others\": recognizing cultural blind spots in global software development, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531612"},{"content":"Ferdinand Desaussure, Course In General Linguistics, McGraw-Hill, Inc., New York, NY, 1965","paperID":"1594067"},{"content":"Schmidt, K. and L. Bannon, Taking CSCW Seriously: Supporting Articulation Work. Computer Supported Cooperative Work (CSCW). An International Journal., 1992. 1(1--2): p. 7--40.","paperID":"None"},{"content":"Kjeld Schmidt , Ina Wagner, Ordering Systems: Coordinative Practices and Artifacts in Architectural Design and Planning, Computer Supported Cooperative Work, v.13 n.5-6, p.349-408, December  2004","paperID":"1045434"},{"content":"Søderberg, A.M., S. Krishna, and P. Bjørn, Global Software Development: Commitment, Trust and Cultural Sensitivity in Strategic Partnerships. International journal of Management, 2013.","paperID":"None"},{"content":"Star, S.L., The ethnography of infrastructure. American Behavioral Scientist, 1999. 43: p. 377--391.","paperID":"None"},{"content":"Yan Xiao , Caterina Lasome , Jacqueline Moss , Colin F. Mackenzie , Samer Faraj, Cognitive properties of a whiteboard: a case study in a trauma centre, Proceedings of the seventh conference on European Conference on Computer Supported Cooperative Work, p.259-278, September 16-20, 2001, Bonn, Germany","paperID":"1241881"},{"content":"Manuel Zacklad, Documentarisation Processes in Documents for Action (DofA): The Status of Annotations and Associated Cooperation Technologies, Computer Supported Cooperative Work, v.15 n.2-3, p.205-228, June      2006","paperID":"1149575"}],"citation":[{"content":"Morten Esbensen , Pernille Bjørn, Routine and Standardization in Global Software Development, Proceedings of the 18th International Conference on Supporting Group Work, November 09-12, 2014, Sanibel Island, Florida, USA","paperID":"2660413"},{"content":"Rasmus Eskild Jensen, Why Closely Coupled Work Matters in Global Software Development, Proceedings of the 18th International Conference on Supporting Group Work, November 09-12, 2014, Sanibel Island, Florida, USA","paperID":"2660425"},{"content":"Pernille Bjørn , Morten Esbensen , Rasmus Eskild Jensen , Stina Matthiesen, Does Distance Still Matter? Revisiting the CSCW Fundamentals on Distributed Collaboration, ACM Transactions on Computer-Human Interaction (TOCHI), v.21 n.5, p.1-26, November 2014","paperID":"2670534"},{"content":"Lars Rune Christensen, On Intertext in Chemotherapy: an Ethnography of Text in Medical Practice, Computer Supported Cooperative Work, v.25 n.1, p.1-38, February  2016","paperID":"2907288"},{"content":"Stina Matthiesen , Pernille Bjørn, Why Replacing Legacy Systems Is So Hard in Global Software Development: An Information Infrastructure Perspective, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675232"}],"abstract":"On the basis of an ethnographic field study, this article introduces the concept of documentscape to the analysis of document-centric work practices. The concept of documentscape refers to the entire ensemble of documents in their mutual intertextual interlocking. Providing empirical data from a global software development case, we show how hierarchical structures and sequentiality across the interlocked documents are critical to how actors make sense of the work of others and what to do next in a geographically distributed setting. Furthermore, we found that while each document is created as part of a quasi-sequential order, this characteristic does not make the document, as a single entity, into a stable object. Instead, we found that the documents were malleable and dynamic while suspended in intertextual structures. Our concept of documentscape points to how the hierarchical structure, sequentiality, and authorless nature of documents serve as a constitutive platform for the development of iterative and emergent work practices, making it possible for highly distributed actors to collaborate with limited communication, as the documentscape serves as a vehicle of coordination.","video":"http://www.youtube.com/embed/cmLxw2mFPms?rel=0","title":"Documentscape: intertextuality, sequentiality, & autonomy at work","filename":"CHI14/p2451","authors":["Lars Rune Christensen","Pernille Bjorn"],"conference":"CHI '14"}