{"paperId":2557191,"citation":[],"reference":[{"content":"Alan Dix , Janet Finlay , Russell Beale, Analysis of user behaviour as time series, Proceedings of the conference on People and computers VII, p.429-444, January 1993, York, United Kingdom","paperID":"164659"},{"content":"Anderson, J. R., Corbett, A. T., Koedinger, K. R., and Pelletier, R. Cognitive tutors: Lessons learned. The Journal of the Learning Sciences 4, 2 (1995), 167--207.","paperID":"None"},{"content":"Ron Baecker , Kellogg Booth , Sasha Jovicic , Joanna McGrenere , Gale Moore, Reducing the gap between what users know and what they need to know, Proceedings on the 2000 conference on Universal Usability, p.17-23, November 16-17, 2000, Arlington, Virginia, USA","paperID":"355467"},{"content":"Stuart K. Card , Thomas P. Moran , Allen Newell, The keystroke-level model for user performance time with interactive systems, Communications of the ACM, v.23 n.7, p.396-410, July 1980","paperID":"358895"},{"content":"Carley, K., and Palmquist, M. Extracting, representing, and analyzing mental models. Social Forces 70, 3 (1992), 601--636.","paperID":"None"},{"content":"John M. Carroll , Judith Reitman Olson, Mental models in human-computer interaction: research issues about what the user of software knows, National Academy Press, Washington, DC, 1987","paperID":"64799"},{"content":"Sébastien Combéfis , Charles Pecheur, A bisimulation-based approach to the analysis of human-computer interaction, Proceedings of the 1st ACM SIGCHI symposium on Engineering interactive computing systems, July 15-17, 2009, Pittsburgh, PA, USA","paperID":"1570454"},{"content":"Dhawan, R., M. O., and Borman, M. Mental models and dynamic decision making: an experimental approach for testing system methodologies. In 24th International Conference of the System Dynamics Society (2006).","paperID":"None"},{"content":"Doherty, G., Campos, J. C., and Harrison, M. D. Representational reasoning and verification. Formal Aspects of Computing 12 (1998), 260--277.","paperID":"None"},{"content":"Dong, Q. A bisimulation approach to verification of molecular implementations of formal chemical reaction networks, 2012.","paperID":"None"},{"content":"Jurgen Falb , Roman Popp , Thomas Rock , Helmut Jelinek , Edin Arnautovic , Hermann Kaindl, Fully-automatic generation of user interfaces for multiple devices from a high-level model based on communicative acts, Proceedings of the 40th Annual Hawaii International Conference on System Sciences, p.26, January 03-06, 2007","paperID":"1255600"},{"content":"Gerhard Fischer, User Modeling in Human–Computer Interaction, User Modeling and User-Adapted Interaction, v.11 n.1-2, p.65-86, 2001","paperID":"598339"},{"content":"Gentner, D., and Stevens, A. Mental models. Cognitive Science - Lawrence Erlbaum Associates. Lawrence Erlbaum Associates, Incorporated, 1983.","paperID":"None"},{"content":"Harrison, M. Modelling user structures within system Specifications. In Formal Methods in HCI: III, IEE Colloquium on (1989), 1/1--1/4.","paperID":"None"},{"content":"M. D. Harrison , Harold Thimbleby, Formal Methods in Human-Computer Interaction, Cambridge University Press, New York, NY, 1990","paperID":"575325"},{"content":"Marc Hermann , Michael Weber, When three worlds collide: a model of the tangible interaction process, Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7, November 23-27, 2009, Melbourne, Australia","paperID":"1738892"},{"content":"Heymann, M., and Degani, A. Formal analysis and automatic generation of user interfaces: approach, methodology, and an algorithm. Human Factors 49, 2 (Apr. 2007), 311--30.","paperID":"None"},{"content":"Ken Hinckley , Edward Cutrell , Steve Bathiche , Tim Muss, Quantitative analysis of scrolling techniques, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 20-25, 2002, Minneapolis, Minnesota, USA","paperID":"503389"},{"content":"Ippel, M. J., and Beem, A. L. Mental models as finite-state machines: Examples and computational methods. Tech. Rep. 9911, United State Air Force Armstrong Laboratory, October 1998.","paperID":"None"},{"content":"Bonnie E. John , David E. Kieras, The GOMS Family of Analysis Techniques: Tools for Design and Evaluation, Carnegie Mellon University, Pittsburgh, PA, 1994","paperID":"865122"},{"content":"P. N. Johnson-Laird, Mental models: towards a cognitive science of language, inference, and consciousness, Harvard University Press, Cambridge, MA, 1986","paperID":"7909"},{"content":"Kieras, D. E. Towards a practical goms model methodology for user interface design. Handbook of human-computer interaction (1988), 135--158.","paperID":"None"},{"content":"Kieras, D. E., and Bovair, S. The role of a mental model in learning to operate a device. Cognitive Science 8, 3 (1984), 255--273.","paperID":"None"},{"content":"Long, J., and Dowell, J. Formal methods: the broad and the narrow view. In Formal Methods and HCI: II, IEE Colloquium on (1988), 5/1--5/8.","paperID":"None"},{"content":"R. Milner, A  Calculus of Communicating Systems, Springer-Verlag New York, Inc., Secaucus, NJ, 1982","paperID":"539036"},{"content":"Norman, D. Some observations on mental models. Mental models 7 (1983).","paperID":"None"},{"content":"Stephen J. Payne , T. R. G. Green, Task-action grammars: a model of the mental representation of task languages, Human-Computer Interaction, v.2 n.2, p.93-133, June 1986","paperID":"1453244"},{"content":"Roman Popp , Jürgen Falb , David Raneburger , Hermann Kaindl, A transformation engine for model-driven UI generation, Proceedings of the 4th ACM SIGCHI symposium on Engineering interactive computing systems, June 25-26, 2012, Copenhagen, Denmark","paperID":"2305532"},{"content":"Xiaofan Qian , Ying Yang , Yong Gong, The art of metaphor: a method for interface design based on mental models, Proceedings of the 10th International Conference on Virtual Reality Continuum and Its Applications in Industry, December 11-12, 2011, Hong Kong, China","paperID":"2087780"},{"content":"Janet C. Read , Stuart MacFarlane , Chris Casey, What's going on?: discovering what children understand about handwriting recognition interfaces, Proceedings of the 2003 conference on Interaction design and children, July 01-03, 2003, Preston, England","paperID":"953555"},{"content":"Reeves, S. Principled formal methods in hci research. In Formal Methods in HCI: III, IEE Colloquium on (1989), 2/1--2/3.","paperID":"None"},{"content":"Romera, M. E. Using finite automata to represent mental models. Master's thesis, San Jose State University, 2000.","paperID":"None"},{"content":"Rushby, J. Using model checking to help discover mode confusions and other automation surprises. In Reliability Engineering and System Safety, vol. 75 (2002), 167--177.","paperID":"None"},{"content":"Santosh, and Himanshu. Restrcting edit operations to generate bisimilar fsms. Tech. Rep. xxxx, IIIT-Hyderabad, January 2014.","paperID":"None"},{"content":"Kevin A. Schneider , James R. Cordy, Abstract User Interfaces: A Model and Notation to Support Plasticity in Interactive Systems, Proceedings of the 8th International Workshop on Interactive Systems: Design, Specification, and Verification-Revised Papers, p.28-48, June 13-15, 2001","paperID":"680970"},{"content":"Thimbleby, B., Blandford, A., Cairns, P., Curzon, P., and Jones, M. User interface design as systems design. In People and Computers XVI - Memorable yet Invisible, Springer (2002), 281--301.","paperID":"None"},{"content":"Harold Thimbleby, Press On: Principles of Interaction Programming, The MIT Press, 2007","paperID":"1324793"},{"content":"Harold Thimbleby, Contributing to safety and due diligence in safety-critical interactive systems development by generating and analyzing finite state models, Proceedings of the 1st ACM SIGCHI symposium on Engineering interactive computing systems, July 15-17, 2009, Pittsburgh, PA, USA","paperID":"1570474"},{"content":"Joe Tullio , Anind K. Dey , Jason Chalecki , James Fogarty, How it works: a field study of non-technical users interacting with an intelligent system, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240630"},{"content":"Zade, H., and Choppella, V. Functionality or user interface: Which is easier to learn when changed? In IHCI '12 (2012), 1--6.","paperID":"None"}],"abstract":"When a user learns to use a new device, her understanding of it evolves. A progressive comparison of the evolving user models towards the device target model, for analysing learning, involves determining the behavioral proximity between them. To quantify the gap between a user model and a target model, we introduce an edit distance metric for measuring their behavioral proximity using a bisimulation-based equivalence relation. We define edit distance to be the minimum number of edges and states with incident edges required to be deleted from and/or added to a user model to make it bisimilar to the target model. We propose an algorithm to compute edit distance between two models and employ the heuristic procedure on experimental data for computing edit distance between target and user models. The data is organised into two experiments depending on the device the user interacted with: (a) a simple device resembling a vending machine and (b) a close to real-world vehicle transmission model. The results validate our proposed metric as edit distance converges with progressive user learning, increases for erroneous learning, and remains unchanged indicating no learning.","video":"http://www.youtube.com/embed/5wg-Pf3HXKI?rel=0","title":"Edit distance modulo bisimulation: a quantitative measure to study evolution of user models","filename":"CHI14/p1757","authors":["Himanshu Zade","Santosh Arvind Adimoolam","Sai Gollapudi","Anind K. Dey","Venkatesh Choppella"],"conference":"CHI '14"}