{"paperId":2557053,"citation":[{"content":"Tanguy Coenen, The design and evaluation of a pervasive engagement game in a city neighborhood, Proceedings of the 18th International Academic MindTrek Conference: Media Business, Management, Content & Services, November 04-06, 2014, Tampere, Finland","paperID":"2676495"},{"content":"Mara Balestrini , Paul Marshall , Raymundo Cornejo , Monica Tentori , Jon Bird , Yvonne Rogers, Jokebox: Coordinating Shared Encounters in Public Spaces, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2835203"},{"content":"Niels Wouters , Jonathan Huyghe , Andrew Vande Moere, StreetTalk: participative design of situated public displays for urban neighborhood interaction, Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational, p.747-756, October 26-30, 2014, Helsinki, Finland","paperID":"2641211"}],"reference":[{"content":"Bogost, I. Persuasive Games. MIT Press, 2007","paperID":"None"},{"content":"Brignull, H. and Rogers, Y. Enticing people to interact with large public displays in public spaces. Proc. Interact'03 (2003), 17--24.","paperID":"None"},{"content":"Chavis, D.M. and Wandersman, A. Sense of community in the urban environment: A catalyst for participation and community development. American Journal of Community Psychology 18, 1 (1990), 55--81.","paperID":"None"},{"content":"Peter Dalsgaard , Kim Halskov, Designing urban media façades: cases and challenges, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753670"},{"content":"Deterding, S. Playful Technologies. In C. Wiedemann and S. Zehle, eds., Depletion Design. A Glossary of Network Technologies. Institute of Network Cultures, Amsterdam, 2012.","paperID":"None"},{"content":"Sebastian Deterding , Dan Dixon , Rilla Khaled , Lennart Nacke, From game design elements to gamefulness: defining \"gamification\", Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments, September 28-30, 2011, Tampere, Finland","paperID":"2181040"},{"content":"DiMaggio, P. and Hargittai, E. From the 'digital divide' to 'digital inequality': Studying Internet use as penetration increases. Princeton University Center for Arts and Cultural Policy Studies, Working Paper Series number 15, (2001).","paperID":"None"},{"content":"Alan Dix, Designing for appropriation, Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI...but not as we know it, September 03-07, 2007, University of Lancaster, United Kingdom","paperID":"1531415"},{"content":"Patrick Tobias Fischer , Eva Hornecker, Urban HCI: spatial aspects in the design of shared encounters for media facades, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207719"},{"content":"Marcus Foth, Handbook of Research on Urban Informatics: The Practice and Promise of the Real-Time City, Information Science Reference - Imprint of: IGI Publishing, Hershey, PA, 2008","paperID":"1522476"},{"content":"William Gaver , Anthony Dunne, Projected realities: conceptual design for cultural effect, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.600-607, May 15-20, 1999, Pittsburgh, Pennsylvania, USA","paperID":"303168"},{"content":"William W. Gaver , Jacob Beaver , Steve Benford, Ambiguity as a resource for design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642653"},{"content":"Gent in cijfers. http://www.gent.be/gentincijfers/.","paperID":"None"},{"content":"Goffman, E. Behavior in Public Places. Simon and Schuster, New York, 1963.","paperID":"None"},{"content":"Greenfield, A. and Shepard, M. Urban computing and Persuasive Games its discontents. The Architectural League of New York, New York, 2007.","paperID":"None"},{"content":"Eva Hornecker , Paul Marshall , Yvonne Rogers, From entry to access: how shareability comes about, Proceedings of the 2007 conference on Designing pleasurable products and interfaces, August 22-25, 2007, Helsinki, Finland","paperID":"1314191"},{"content":"Hu, Q., Johnston, E., and Hemphill, L. Fostering cooperative community behavior with IT tools. The Journal of Community Informatics 9, 1 (2012).","paperID":"None"},{"content":"Hunicke, R., LeBlanc, M., and Zubek, R. MDA: A formal approach to game design and game research. Proc. AAAI Workshop Challenges in Game AI (2004).","paperID":"None"},{"content":"Kasperson, R.E., Renn, O., Slovic, P., et al. The social amplification of risk: A conceptual framework. Risk analysis 8, 2 (1988), 177--187.","paperID":"None"},{"content":"Khan, O. Mis(sed)information in Public Space. In K.S. Willis, G. Roussos, K. Chorianopoulos and M. Struppek, eds., Shared Encounters. Springer, 2010, 197--208.","paperID":"None"},{"content":"McGonigal, J. A Real Little Game: The Pinocchio Effect in Pervasive Play. Proc. DIGRA Conf. (2003).","paperID":"None"},{"content":"Montola, M. Exploring the edge of the magic circle: Defining pervasive games. Proc. DAC (2005).","paperID":"None"},{"content":"Kenton O'Hara, Understanding geocaching practices and motivations, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357239"},{"content":"Kenton O'Hara , Maxine Glancy , Simon Robertshaw, Understanding collective play in an urban screen game, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460576"},{"content":"Eric Paulos , Chris Beckmann, Sashay: designing for wonderment, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124901"},{"content":"Eric Paulos , Elizabeth Goodman, The familiar stranger: anxiety, comfort, and play in public places, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.223-230, April 24-29, 2004, Vienna, Austria","paperID":"985721"},{"content":"Ronald Schroeter , Marcus Foth , Christine Satchell, People, content, location: sweet spotting urban screens for situated engagement, Proceedings of the Designing Interactive Systems Conference, June 11-15, 2012, Newcastle Upon Tyne, United Kingdom","paperID":"2317980"},{"content":"Nina Valkanova , Sergi Jorda , Martin Tomitsch , Andrew Vande Moere, Reveal-it!: the impact of a social visualization projection on public awareness and discourse, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466476"},{"content":"Wandersman, A., Jakubs, F.J., and Giamartino, A.G. Participation in block organizations. Journal of Community Action, (1981), 40--84.","paperID":"None"},{"content":"Whyte, W.H. The Social Life of Small Urban Spaces. Project for Public Spaces Inc, 1980.","paperID":"None"},{"content":"Katharine S. Willis , George Roussos , Konstantinos Chorianopoulos , Mirjam Struppek, Shared Encounters, Springer Publishing Company, Incorporated, 2009","paperID":"1708075"},{"content":"Zichermann, G. and Cunningham, C. Gamification by Design. O'Reilly Media, Inc., 2011.","paperID":"None"},{"content":"Zimmerman, M.A. and Rappaport, J. Citizen participation, perceived control, and psychological empowerment. American Journal of Community Psychology 16, 5 (1988), 725--750.","paperID":"None"}],"abstract":"As information technology is increasingly embedded in our cities, opportunities arise to design novel applications that benefit urban communities. We describe the design and evaluation of ZWERM (Dutch for the term 'swarm'), a public game that was specifically designed for augmenting community participation in urban neighborhoods. A network of ten components has been designed, some of which had different interfaces and design approaches: from totem-like Trees for gathering around with RFID cards to playful Sparrows that react on whistle sounds. After implementing the urban game in two city neighborhoods, we investigated the impact of each of these components on their communities. Our insights are useful for the public interaction design of future urban, interactive networks that aim to positively influence community participation and social cohesion.","video":"http://www.youtube.com/embed/2mZzq2VES28?rel=0","title":"ZWERM: a modular component network approach for an urban participation game","filename":"CHI14/p3259","authors":["Thomas Laureyssens","Tanguy Coenen","Laurence Claeys","Peter Mechant","Johan Criel","Andrew Vande Moere"],"conference":"CHI '14"}