{"paperId":2557279,"citation":[],"reference":[{"content":"Barnard, P.J. Interacting cognitive subsystems: A psycholinguistic approach to short-term memory. In A. Ellis, (ed.), Progress in the Psychology of Language, Vol. 2, Erlbaum: London (1985), 197--258.","paperID":"None"},{"content":"Victoria Bellotti , Ann Blandford , David Duke , Allan MacLean , Jon May , Laurence Nigay, Interpersonal access control in computer-mediated communications: a systematic analysis of the design space, Human-Computer Interaction, v.11 n.4, p.357-432, December 1996","paperID":"1462968"},{"content":"Stefano Burigat , Luca Chittaro , Silvia Gabrielli, Navigation techniques for small-screen devices: An evaluation on maps and web pages, International Journal of Human-Computer Studies, v.66 n.2, p.78-97, February, 2008","paperID":"1322754"},{"content":"Simone Garlandini , Sara Irina Fabrikant, Evaluating the effectiveness and efficiency of visual variables for geographic information visualization, Proceedings of the 9th international conference on Spatial information theory, September 21-25, 2009, Aber Wrac'h, France","paperID":"1789550"},{"content":"Harrower, M., & Sheesley, B. Designing better map interfaces: A framework for panning and zooming. Transactions in GIS, 9(2), (2005),77--89.","paperID":"None"},{"content":"Kraft, R.N. The role of cutting in the evaluation and retention of film. Journal of Experimental Psychology: Learning Memory and Cognition, 12(1), (1986), 155163.","paperID":"None"},{"content":"Kraft, R.N. Rules and strategies of visual narratives. Perceptual and Motor Skills, 64, (1987), 3--14.","paperID":"None"},{"content":"Jock D. Mackinlay , Stuart K. Card , George G. Robertson, Rapid controlled movement through a virtual 3D workspace, Proceedings of the 17th annual conference on Computer graphics and interactive techniques, p.171-176, September 1990, Dallas, TX, USA","paperID":"97898"},{"content":"Manson, S.M., Kne, L. Dyke, K.R., Shannon, J. & Eria, S. Using eye-tracking and mouse metrics to test usability of web mapping navigation. Cartography and Geographic Information Science, 39(1), (2012), 48--60.","paperID":"None"},{"content":"May, J., & Barnard, P.J. Cinematography and interface design. In K. Nordby, P. Helmersen, D.J. Gilmore, & S. Arnesen (Eds.), Human-computer interaction: Interact'95, Chapman and Hall (1995), 26--31.","paperID":"None"},{"content":"Jon May , Michael P. Dean , Philip J. Barnard, Using film cutting techniques in interface design, Human-Computer Interaction, v.18 n.4, p.325-372, December 2003","paperID":"1466544"},{"content":"Harold Moellering, At the interface of cartography and computer graphics, Proceedings of the 2nd annual conference on Computer graphics and interactive techniques, p.256-259, June 25-27, 1975, Bowling Green, Ohio","paperID":"1138375"},{"content":"Monsell, S. Task switching. Trends in Cognitive Sciences, 7, (2003), 134--140.","paperID":"None"},{"content":"Scott, R. (Director). Blade Runner {MotionPicture}, USA: Warner Brothers (1982).","paperID":"None"},{"content":"Maruthappan Shanmugasundaram , Pourang Irani, The effect of animated transitions in zooming interfaces, Proceedings of the working conference on Advanced visual interfaces, May 28-30, 2008, Napoli, Italy","paperID":"1385642"},{"content":"You, M., Chen, C.-W., Liu, H. & Lin, H. A Usability Evaluation of Web Map Zoom and Pan Functions. International Journal of Design, 1(1) (2007), 15--25.","paperID":"None"},{"content":"Young, E., & Clanton, C. Film craft in user interface design. Tutorial presented at the InterCHI'93 conference, Amsterdam (1993).","paperID":"None"},{"content":"Zelinksy, G. J. Eye movements during target acquisition. Psychological Review, 115(4) (2008), 787835.","paperID":"None"}],"abstract":"May, Dean and Barnard (2003) used a theoretically based model to argue that objects in a wide range of interfaces should be collocated following screen changes such as a zoom-in to detail. Many existing online maps do not follow this principle, but move a clicked point to the centre of the subsequent display, leaving the user looking at an unrelated location. This paper presents three experiments showing that collocating the point clicked on a map so that the detailed location appears in the place previously occupied by the overview location makes the map easier to use, reducing eye movements and interaction duration. We discuss the benefit of basing design principles on theoretical models so that they can be applied to novel situations, and so designers can infer when to use and not use them.","video":"http://www.youtube.com/embed/_QNqMiUAdAc?rel=0","title":"Collocating interface objects: zooming into maps","filename":"CHI14/p2085","authors":["Jon May","Tim Gamble"],"conference":"CHI '14"}