{"paperId":2557079,"citation":[{"content":"Andrea Barbarin , Tiffany C. Veinot , Predrag Klasnja, Taking our Time: Chronic Illness and Time-Based Objects in Families, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675200"}],"reference":[{"content":"Aarts, H., & Dijksterhuis, A. Habits as knowledge structures: Automaticity in Goal-Directed Behaviour. Journal of Personality and Social Psychology, 78, 1 (2000), 53--63.","paperID":"None"},{"content":"Apple Inc. iTunes Store. http://www.apple.com/itunes/","paperID":"None"},{"content":"Bargh, J. A. The four horsemen of automaticity: awareness, intention, efficiency, and control in social cognition. In R. S. Wyer & T. K. Srull (Eds.), Handbook of social cognition: Vol I basic processes. Lawrence Erlbaum Associates (1994), 1--40.","paperID":"None"},{"content":"Frank Bentley , Konrad Tollmar, The power of mobile notifications to increase wellbeing logging behavior, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466140"},{"content":"Timothy Bickmore , Daniel Mauer , Francisco Crespo , Thomas Brown, Persuasion, task interruption and health regimen adherence, Proceedings of the 2nd international conference on Persuasive technology, April 26-27, 2007, Palo Alto, CA, USA","paperID":"1780404"},{"content":"Braun, V., & Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology, 3, 2 (2006), 77--101.","paperID":"None"},{"content":"Castaño, P. M., & Martínez, R. A. Harnessing technology for adolescent health promotion. Adolescent Medicine: State of the Art Reviews, 18, 2 (2007), XIII, 400--406.","paperID":"None"},{"content":"Chevalier, J. A., & Mayzlin, D. The effect of word of mouth on sales: Online book reviews, No. w10148 (2003), National Bureau of Economic Research.","paperID":"None"},{"content":"Cramer, J. A. Overview of Methods to Measure and Enhance Patient Compliance. In J. A. Cramer & B. Spilker (Eds.), Patient compliance in medical practice and clinical trials. Raven Press (1991), 3--10.","paperID":"None"},{"content":"Dayer, L., Heldenbrand, S., Anderson, P., Gubbins, P. O., and Martin, B. C. Smartphone medication adherence apps: Potential benefits to patients and providers. Journal of the American Pharmacists Association, 53, 2 (2013), 172--181.","paperID":"None"},{"content":"Rodrigo de Oliveira , Mauro Cherubini , Nuria Oliver, MoviPill: improving medication compliance for elders using a mobile persuasive social game, Proceedings of the 12th ACM international conference on Ubiquitous computing, September 26-29, 2010, Copenhagen, Denmark","paperID":"1864371"},{"content":"Einstein, G. O., McDaniel, M. A., Smith, R. E., and Shaw, P. Habitual Prospective Memory and Aging: Remembering Intentions and Forgetting Actions. Psychological Science, 9, 4 (1998), 284--288.","paperID":"None"},{"content":"Ellis, J. Prospective memory or the realization of delayed intentions: A conceptual framework for research. In M. Brandimonte, G. O. Einstein, & M. A. McDaniel (Eds.), Prospective memory: Theory and applications. Lawrence Erlbaum Associates (1996), 1--22.","paperID":"None"},{"content":"Fairhurst, K., & Sheikh, A. Texting appointment reminders to repeated non-attenders in primary care: randomized controlled study. Quality & Safety in Health Care, 17, 5 (2008), 373--376.","paperID":"None"},{"content":"Fjeldsoe, B. S., Marshall, A. L., & Miller, Y. D. Behavior change interventions delivered by mobile telephone short-message service. American Journal of Preventive Medicine, 36, 2 (2009), 165--173.","paperID":"None"},{"content":"Fogg, B. J. Tiny Habits. http://tinyhabits.com/","paperID":"None"},{"content":"Google. Google Play. https://play.google.com/store","paperID":"None"},{"content":"Haynes, R. B., Ackloo, E., Sahota, N., McDonald, H. P., Yao, X. Interventions for enhancing medication adherence. Cochrane database of systematic reviews, CD000011 (2008).","paperID":"None"},{"content":"Haynes, R. B., Gibson, E., Hackett, B., Sackett, D., Taylor, D. W., Roberts, R., & Johnson, A. Improvement of medication compliance in uncontrolled hypertension. The Lancet, 307, 7972 (1976), 1265--1268.","paperID":"None"},{"content":"Henry, J. D. J., Rendell, P. P. G., Phillips, L. H. L., Dunlop, L., & Kliegel, M. Prospective memory reminders: A laboratory investigation of initiation source and age effects. The Quarterly Journal of Experimental Psychology, 65, 7 (2012), 1274--1287.","paperID":"None"},{"content":"Hou, M., Murwitz, S., Kavanagh, E., Fortin, J., and Goldberg, A. Using Daily Text-Message Reminders to Improve Adherence with Oral Contraceptives: A Randomized Controlled Trial. Obstetrics & Gynecology, 3, 116 (2010), 633--640.","paperID":"None"},{"content":"Nan Hu , Paul A. Pavlou , Jennifer Zhang, Can online reviews reveal a product's true quality?: empirical findings and analytical modeling of Online word-of-mouth communication, Proceedings of the 7th ACM conference on Electronic commerce, p.324-330, June 11-15, 2006, Ann Arbor, Michigan, USA","paperID":"1134743"},{"content":"Hughes, D. A., Bagust, A., Haycox, A., and Walley, T. O. M. The impact of non-compliance on the cost-effectiveness of pharmaceuticals: a review of the literature. Health Economics, 10, May (2001), 601--615.","paperID":"None"},{"content":"Johnson, M. J. The Medication Adherence Model: A Guide for Assessing Medication Taking. Research and Theory for Nursing Practice, 16, 3 (2002), 179--192.","paperID":"None"},{"content":"Jones, R. K., Darroch, J. E., and Henshaw, S. K. Contraceptive Use Among U.S. Women Having Abortions in 2000-2001. Perspectives on Sexual and Reproductive Health, 34, 6 (2002), 294--303.","paperID":"None"},{"content":"Predrag Klasnja , Wanda Pratt, Methodological Review: Healthcare in the pocket: Mapping the space of mobile-phone health interventions, Journal of Biomedical Informatics, v.45 n.1, p.184-198, February, 2012","paperID":"2133998"},{"content":"Laird, S. (2012). How smartphones are changing healthcare. Retrieved 11/07/2013, from http://mashable.com/2012/09/26/smartphones-health-care-infographic/","paperID":"None"},{"content":"Lally, P., & Gardner, B. Promoting habit formation. Health Psychology Review, 7, sup1 (2011), 1--22.","paperID":"None"},{"content":"Lally, P., van Jaarsveld, C. H. M., Potts, H. W. W., and Wardle, J. How are habits formed: Modeling habit formation in the real world. European Journal of Social Psychology, 40, 6 (2010), 998--1009.","paperID":"None"},{"content":"Maylor, E. A. Age and prospective memory. The Quarterly Journal of Experimental Psychology, 42, 3 (1990), 471--493.","paperID":"None"},{"content":"Obiodu, V., & Obiodu, E. An Empirical Review of the Top 500 Medical Apps in a European Android Market. Journal of Mobile Technology in Medicine, 1, 4 (2012), 22--37.","paperID":"None"},{"content":"Ofcom. Communications Market Report (2012) http://stakeholders.ofcom.org.uk/binaries/research/cmr/cmr12/CMR_UK_2012.pdf","paperID":"None"},{"content":"O'Neill, S., & Brady, R. R. W. Colorectal smartphone apps: opportunities and risks. Colorectal Disease, 14, 9 (2012), e530--e534.","paperID":"None"},{"content":"Park, D. C., & Kidder, D. P. Prospective memory and medication adherence. In M. Brandimonte, G. O. Einstein, & M. A. McDaniel (Eds.), Prospective memory: Theory and applications. Lawrence Erlbaum Associates (1996), 369--390.","paperID":"None"},{"content":"Rabin, C. & Bock, B., Desired Features of Smartphone Applications Promoting Physical Activity, Telemedicine and e-Health, 17, 10 (2011), 801--803.","paperID":"None"},{"content":"Reach, G. Role of habit in adherence to medical treatment. Diabetic Medicine, 22, 4 (2005), 415--420.","paperID":"None"},{"content":"Rosenberg, M. J., & Waugh, M. S. Causes and consequences of oral contraceptive non-compliance. American Journal of Obstetrics and Gynecology, 180, 2 Pt 2 (1999), 276--279.","paperID":"None"},{"content":"Rosser, B. A., & Eccleston, C. Smartphone applications for pain management. Journal of Telemedicine and Telecare, 17, 6 (2011), 308--312.","paperID":"None"},{"content":"Juan M. Silva , Alain Mouttham , Abdulmotaleb El Saddik, UbiMeds: a mobile application to improve accessibility and support medication adherence, Proceedings of the 1st ACM SIGMM international workshop on Media studies and implementations that help improving access to disabled users, October 23-23, 2009, Beijing, China","paperID":"1631109"},{"content":"Smith, J. A. Qualitative psychology: a practical guide to research methods, London, Sage, (2003).","paperID":"None"},{"content":"Smith, J., Oakley, D. Why Do Women Miss Oral Contraceptive Pills' An Analysis of Women's Self-Described Reasons for Missed Pills, Journal of Midwifery & Women's Health, 50, 5 (2010), 380--385.","paperID":"None"},{"content":"Thryve. Foster - Pill Reminder. https://itunes.apple.com/gb/app/foster-pill-reminder/id554168976'mt=8","paperID":"None"},{"content":"Unni, E. J., & Farris, K. B. Unintentional non-adherence and belief in medicines in older adults. Patient education and counseling, 83, 2 (2011), 265--268.","paperID":"None"},{"content":"Leena Ventä , Minna Isomursu , Aino Ahtinen , Shruti Ramiah, \"My Phone is a Part of My Soul” - How People Bond with Their Mobile Phones, Proceedings of the 2008 The Second International Conference on Mobile Ubiquitous Computing, Systems, Services and Technologies, p.311-317, September 29-October 04, 2008","paperID":"1448110"},{"content":"Vermeire, E., Hearnshaw, H., Van Royen, P., and Denekens, J. Patient adherence to treatment: three decades of research. A comprehensive review. Journal of clinical pharmacy and therapeutics, 26, 5 (2001), 331--342.","paperID":"None"},{"content":"Vervolet, M., Linn, A. J., van Weert, J. C. M., de Bakker, D. H., Bouvy, M. L., and van Dijk, L., The effectiveness of interventions using electronic reminders to improve adherence to chronic medication: a systematic review of the literature, Journal of the American Medical Informatics Association: JAMIA, 19, 5 (2012), 696--704.","paperID":"None"},{"content":"WHO. Adherence to long-term therapies: Evidence for action. World Health Organization (2003).","paperID":"None"},{"content":"Julie R. Williamson , Marilyn McGee-Lennon , Stephen Brewster, Designing multimodal reminders for the home: pairing content with presentation, Proceedings of the 14th ACM international conference on Multimodal interaction, October 22-26, 2012, Santa Monica, California, USA","paperID":"2388774"},{"content":"Wood, W., & Neal, D. T. A new look at habits and the habit-goal interface. Psychological Review, 114, 4 (2007), 843--8.","paperID":"None"},{"content":"Tae-Jung Yun , Rosa I. Arriaga, A text message a day keeps the pulmonologist away, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466233"}],"abstract":"Despite the fact that a third of all cases of unintentional medication non-adherence are caused by simple forgetfulness, the majority of interventions neglect this issue. Even though patients have access to smartphone applications (\"apps\") designed to help them remember medication, neither their quality nor effectiveness has been evaluated yet. We report the findings of a functionality review of 229 medication reminder apps and a thematic analysis of their 1,012 user reviews. Our research highlights the gap between the theory and practice: while the literature shows that many medication regimens are habitual in nature and the presence of daily routines supports remembering, existing apps rely on timer-based reminders. To address this disparity, we present design requirements for building medication reminders that support the routine aspect of medication-taking and its individual nature, and demonstrate how they could be implemented to move from passive alerts to a smarter memory and routine assistant.","video":"http://www.youtube.com/embed/zPU5XBH9am0?rel=0","title":"Don't forget your pill!: designing effective medication reminder apps that support users' daily routines","filename":"CHI14/p2269","authors":["Katarzyna Stawarz","Anna L. Cox","Ann Blandford"],"conference":"CHI '14"}