{"paperId":2557119,"citation":[],"reference":[{"content":"Asgary, R., Charpentier, B., and Burnett, D. C. Socio-Medical Challenges of Asylum Seekers Prior and After Coming to the US. Journal of immigrant and minority health / Center for Minority Public Health 15, 5 (2013), 961--8.","paperID":"None"},{"content":"Eric P.S. Baumer , M. Six Silberman, When the implication is not to design (technology), Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979275"},{"content":"Fatima A. Boujarwah , Nazneen , Hwajung Hong , Gregory D. Abowd , Rosa I. Arriaga, Towards a framework to situate assistive technology design in the context of culture, The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility, October 24-26, 2011, Dundee, Scotland, UK","paperID":"2049542"},{"content":"Carballo, M. and Mboup, M. International Migration and Health. Global Commission on International Migration (2005).","paperID":"None"},{"content":"Rachel Clarke , Peter Wright , John McCarthy, Sharing narrative and experience: digital stories and portraits at a women's centre, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2223663"},{"content":"Collins, E., Shakya, Y. B., Guruge, S., and Santos, E. J. Services for Women: Access, Equity and Quality. In Working with Women: Issues and Strategies for Mental Health. 2008, 119--133.","paperID":"None"},{"content":"Collins, E. Recognizing Spirituality as a Vital Component in Mental Health Care. In Working with Women: Issues and Strategies for Mental Health. 2008, 89--102.","paperID":"None"},{"content":"David Coyle , Gavin Doherty , Mark Matthews , John Sharry, Computers in talk-based mental health interventions, Interacting with Computers, v.19 n.4, p.545-562, July, 2007","paperID":"1275453"},{"content":"Gavin Doherty , David Coyle , Mark Matthews, Design and evaluation guidelines for mental health technologies, Interacting with Computers, v.22 n.4, p.243-252, July, 2010","paperID":"1808641"},{"content":"Dumont, J.-C., Spielvogel, G., and Widmaier, S. International Migrants in Developed, Emerging and Developing Countries: An extended Profile. 2010.","paperID":"None"},{"content":"Elliott, S.J . and Gillie, J. Moving Experiences: A Qualitative Analysis of Health and Migration. Health & Place 4, 4 (1998), 327--39.","paperID":"None"},{"content":"Andrea Grimes , Martin Bednar , Jay David Bolter , Rebecca E. Grinter, EatWell: sharing nutrition-related memories in a low-income community, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460579"},{"content":"Andrea Grimes , Richard Harper, Celebratory technology: new directions for food research in HCI, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357130"},{"content":"Mona Leigh Guha , Allison Druin , Gene Chipman , Jerry Alan Fails , Sante Simms , Allison Farber, Mixing ideas: a new technique for working with young children as design partners, Proceedings of the 2004 conference on Interaction design and children: building a community, p.35-42, June 01-03, 2004, Maryland","paperID":"1017838"},{"content":"Tad Hirsch , Jeremy Liu, Speakeasy: overcoming barriers and promoting community development in an immigrant neighborhood, Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques, August 01-04, 2004, Cambridge, MA, USA","paperID":"1013176"},{"content":"Jochen Meyer , Susanne Boll , Young S. Lee , Oscar Mayora , Katie Siek , Carsten Röcker, Wellness interventions and HCI: theory, practice, and technology, ACM SIGHIT Record, v.2 n.2, p.51-53, September 2012","paperID":"2384564"},{"content":"Popovic-Lipovac, A. and Strasser, B. A Review on Changes in Food Habits Among Immigrant Women and Implications for Health. Journal of immigrant and minority health (2013).","paperID":"None"},{"content":"Prochaska, J. O., Redding, C. A., and Evers, K. E. The Transtheoretical model and stages of change. Health Behavior and Health Education, (2008), 97--121.","paperID":"None"},{"content":"Melissa S. Quintanilha, Buddywall: a tangible user interface for wireless remote communication, CHI '08 Extended Abstracts on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1358918"},{"content":"Raghavi Sakpal, Virtual patients to teach cultural competency, Proceedings of the 14th ACM international conference on Multimodal interaction, October 22-26, 2012, Santa Monica, California, USA","paperID":"2388754"},{"content":"Seidman, I. Interviewing as Qualitative Research. Teachers College Press, 2005.","paperID":"None"},{"content":"Katie A. Siek , Jeffrey S. LaMarche , Julie Maitland, Bridging the information gap: collaborative technology design with low-income at-risk families to engender healthy behaviors, Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7, November 23-27, 2009, Melbourne, Australia","paperID":"1738841"},{"content":"Sisley, E. J., Hutton, J. M., Louise Goodbody, C., and Brown, J. S. L. An interpretative phenomenological analysis of African Caribbean women's experiences and management of emotional distress. Health & social care in the community 19, 4 (2011), 392--402.","paperID":"None"},{"content":"Meredith M. Skeels , Kenton T. Unruh , Christopher Powell , Wanda Pratt, Catalyzing social support for breast cancer patients, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753353"},{"content":"Turner, R. J. Social Support and Coping. In A. V. Horwitz and T. L. Scheid, eds., Handbook of coping Theory research applications. Cambridge University Press, 1999, 198--210.","paperID":"None"},{"content":"Susan P. Wyche , Gillian R. Hayes , Lonnie D. Harvel , Rebecca E. Grinter, Technology in spiritual formation: an exploratory study of computer mediated religious communications, Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work, November 04-08, 2006, Banff, Alberta, Canada","paperID":"1180908"},{"content":"Zallman, L., Himmelstein, D. H., Woolhandler, S., et al. Undiagnosed and Uncontrolled Hypertension and Hyperlipidemia among Immigrants in the US. Journal of immigrant and minority health / Center for Minority Public Health 15, 5 (2013), 858--65.","paperID":"None"},{"content":"Withings Scale. http://www.withings.com/.","paperID":"None"},{"content":"National African HIV/AIDS Initiative NAHI Summit Reports. Atlanta, GA, 2007.","paperID":"None"}],"abstract":"Women comprise nearly half of the immigrant population worldwide and are susceptible to a wider range of health challenges compared to immigrant men. We present the findings of four participatory design sessions with immigrant women from the Caribbean to identify health and wellness challenges they faced and to conceptualize technologies to help them manage these issues. Stress, dietary challenges (specifically obesity), mental health, and domestic abuse, as identified by the women, form the focal themes for the design sessions. Their design approaches emphasized rebuilding the support structure, reducing stressors through entertainment and relaxation and encouraging positive gradational lifestyle changes. In conceiving health and wellness technologies for immigrant women, our work highlights opportunities for HCI to consider the role of others (and who benefits) and to reflect on the role of design and the underlying values and themes designs encompass. Finally, we emphasize how the technologies conceived by these women support rather than replace social solutions to the health and wellness challenges faced by these and other immigrant women.","video":"http://www.youtube.com/embed/y2KtLbIZogI?rel=0","title":"Reflection through design: immigrant women's self-reflection on managing health and wellness","filename":"CHI14/p1605","authors":["Deana Brown","Victoria Ayo","Rebecca E. Grinter"],"conference":"CHI '14"}