{"paperId":2557295,"citation":[],"reference":[{"content":"1. Ainsworth, M. D. S., Blehar, M. C., and ans Sally Wall, E. W. Patterns of attachment: a psychological study of the strange situation. Lawrence Erlbaum Associates, Hilsdale, New Jersey, USA, 1978.","paperID":"None"},{"content":"2. Belk, R. W. Possessions and the Extended Self. Journal of Consumer Research: An Interdisciplinary Quarterly 15, 2 (1988), 139'68.","paperID":"None"},{"content":"3. Bowlby, J. Attachment and loss, Vol. 1: Attachment. Basic Books, New York, 1969.","paperID":"None"},{"content":"4. Bowlby, J. The Making and Breaking of Affectional Bonds. Tavistock, London, 1979.","paperID":"None"},{"content":"5. Csikszentmihalyi, M., and Rochberg-Halton, E. The Meaning of Things, Domestic Symbols and the Self. Cambridge University Press, New York, NY, USA, 1981.","paperID":"None"},{"content":"6. Geser, H. Are girls (even) more addicted' Some gender patterns of cell phone usage. Sociology in Switzerland: Sociology of the Mobile Phone. Online Publications (June 2006).","paperID":"None"},{"content":"7. Greenwald, A. G. A social-cognitive account of the self's development. In Self, ego, and identity: Integrative approaches, D. K. Lapsley and F. C. Power, Eds. Springer-Verlag, New York, 1988, 30'42.","paperID":"None"},{"content":"Marc Hassenzahl , Stephanie Heidecker , Kai Eckoldt , Sarah Diefenbach , Uwe Hillmann, All You Need is Love: Current Strategies of Mediating Intimate Relationships through Technology, ACM Transactions on Computer-Human Interaction (TOCHI), v.19 n.4, p.1-19, December 2012","paperID":"2395137"},{"content":"9. Huuskonen, P. Interaction Through Non-interaction: Context Awareness and Distributed Applications. Keynote speech at Applied Spoken Language Interaction in Distributed Environments (ASIDE2005), November 10--11 2005.","paperID":"None"},{"content":"Matt Jones , Gary Marsden, Mobile Interaction Design, John Wiley & Sons, 2006","paperID":"1204709"},{"content":"11. Jordan, P. W. Designing Pleasurable Products: An Introduction to the New Human Factors. Taylor and Francis Ltd, Philadelphia, PA, USA, 2000.","paperID":"None"},{"content":"Evangelos Karapanos , John Zimmerman , Jodi Forlizzi , Jean-Bernard Martens, User experience over time: an initial framework, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518814"},{"content":"13. Katz, J. E., and Suygiyama, S. Mobile phones as fashion statements: The co-creation of mobile communication's public meaning. In Mobile Communication and the Re-negotiation of the Social Sphere, R. Ling and P. E. Pedersen, Eds., CSCW. Springer-Verlag, London, UK, 2005.","paperID":"None"},{"content":"Poh Wah Khong , Jing Pu Song, Exploring user's emotional relationships with IT products: a structural equation model, Proceedings of the 2003 international conference on Designing pleasurable products and interfaces, June 23-26, 2003, Pittsburgh, PA, USA","paperID":"782908"},{"content":"15. Kleine, S. S., and Baker, S. M. An Integrative Review of Material Possession Attachment. Academy of Marketing Science Review 2004, 1 (2004), 1'35.","paperID":"None"},{"content":"Sari Kujala , Talya Miron-Shatz, Emotions, experiences and usability in real-life mobile phone use, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466135"},{"content":"Effie Lai-Chong Law , Virpi Roto , Marc Hassenzahl , Arnold P.O.S. Vermeeren , Joke Kort, Understanding, scoping and defining user experience: a survey approach, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518813"},{"content":"Moon-Hwan Lee , Da-Hoon Kim , Hyun-Jeong Kim , Tek-Jin Nam, Understanding impacts of hidden interfaces on mobile phone user experience, Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, October 14-17, 2012, Copenhagen, Denmark","paperID":"2399024"},{"content":"19. Mugge, R. Emotional Bonding with Products: Investigating Product Attachment from a Design Perspective. VDM Verlag, Saarbrücken, Germany, 2008.","paperID":"None"},{"content":"William Odom , John Zimmerman , Jodi Forlizzi, Teenagers and their virtual possessions: design opportunities and issues, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979161"},{"content":"William Odom , John Zimmerman , Jodi Forlizzi , Ana López Higuera , Mauro Marchitto , José Cañas , Youn-kyung Lim , Tek-Jin Nam , Moon-Hwan Lee , Yeoreum Lee , Da-jung Kim , Yea-kyung Row , Jinmin Seok , Bokyung Sohn , Heather Moore, Fragmentation and transition: understanding perceptions of virtual possessions among young adults in Spain, South Korea and the United States, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466242"},{"content":"22. Park, C. W., MacInnis, D. J., and Priester, J. R. Beyond Attitudes: Attachment and Consumer Behavior. Seoul National Journal 12, 2 (2006), 3'36.","paperID":"None"},{"content":"23. Roto, V. User Experience from Product Creation Perspective. In Proceedings of the COST294-MAUSE affiliated workshop: Towards a UX Manifesto, E. Law, A. Vermeeren, M. Hassenzahl, and M. Blythe, Eds. (Lancaster, UK, 2007), 31'34.","paperID":"None"},{"content":"24. Schifferstein, H. N., and Zwartkruis-Pelgrim, E. P. Consumer-Product Attachment: Measurement and Design Implications. International Journal of Design 2, 3 (2008), 1'13.","paperID":"None"},{"content":"25. Schifferstein, H. N. J., Mugge, R., and Hekkert, P. Designing consumer-product attachment. In Design and Emotion, D. McDonagh, P. Hekkert, J. van Erp, and D. Gyi, Eds. CRC Press, London, UK, 2003, 378'383.","paperID":"None"},{"content":"26. Schultz, S. E., Kleine, R. E., and Kernan, J. B. 'These are a few of my favourite thing' toward an explication of attachment as a consumer behavior construct. Advances in Consumer Research 16 (1989), 359'366.","paperID":"None"},{"content":"27. Vincent, J. Emotional attachment and mobile phones. In Thumb Culture: The Meaning Of Mobile Phones For Society, G. P. Bertschi S., Ed. Transcript Verlag/Transaction US, Bielefeld, Germany, 2006.","paperID":"None"},{"content":"Kai Wehmeyer, User-device attachment scale development and initial test, International Journal of Mobile Communications, v.6 n.3, p.280-295, March 2008","paperID":"1359999"},{"content":"John Zimmerman, Designing for the self: making products that help people become the person they desire to be, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518765"}],"abstract":"This paper addresses the phenomenon of emotional attachments to mobile phones. We introduce the term \"mobile attachment\" and define it as a bond between a person's self and a mobile phone that varies in strength. Based on a critical reflection of interdisciplinary literature, a conceptual mobile attachment model is developed. Within this model causes, consequences and influencing factors of mobile attachment are exposed and elaborated. We argue that mobile attachment emerges when the mobile phone becomes part of the user's self concept. The link between the user and their mobile phone may be fostered when it empowers, enriches, or gratifies the user's self. Attachment causes lead to \"design space determinants\" that enable user experience designers to design for mobile attachment. Attachment consequences may be operationalized for user experience evaluation.","video":"http://www.youtube.com/embed/s8E6ArgXo0k?rel=0","title":"Mobile attachment causes and consequences for emotional bonding with mobile phones","filename":"CHI14/p2317","authors":["Alexander Meschtscherjakov","David Wilfinger","Manfred Tscheligi"],"conference":"CHI '14"}