{"paperId":2702485,"abstract":"Recognized stress management techniques include cultivating mindfulness, breathing exercises, and meditation. While these approaches have been shown to mitigate the negative effects of stress, they can be difficult to learn or consistently apply. To support these techniques, we developed MoodLight, a playful system that uses ambient colored light to provide feedback regarding an individual's current arousal levels. Like many affective computing systems, MoodLight was designed to help users observe their internal state and learn to relax. However, our findings indicate that prompting or leading feedback can be more effective than real time feedback in helping users relax. This work contributes to affective computing by suggesting alternative approaches to designing biofeedback systems for stress management.","reference":[{"content":"SPSS Technical Report - Linear Effects Mixed Modeling.","paperID":"None"},{"content":"Anderson, N.B., Johnson, S.N., Belar, C.D., Breckler, S.J., and Nordal, K.C., 2012. Stress in America: Our health at risk. Amer Psychological Assoc.","paperID":"None"},{"content":"APA, Psychologically healthy workplace program: Creating a psychologically healthy workplace.","paperID":"None"},{"content":"Bouchard, S., Bernier, F., Boivin, E., Morin, B., and Robillard, G., 2012. Using biofeedback while immersed in a stressful videogame increases the effectivess of stress management skills in soldiers. PloS one 7, 4, e36169.","paperID":"None"},{"content":"Carmody, J. and Baer, R.A., 2009. How long does a mindfulness based stress reduction program need to be? A review of class contact hours and effect sizes for psychological distress. J clin psych 65, 6, 627--638.","paperID":"None"},{"content":"Chak, K. and Leung, L., 2004. Shyness and locus of control as predictors of internet addiction and internet use. CyberPsych & Behav 7, 5, 559--570.","paperID":"None"},{"content":"Consolvo, S., Mcdonald, D.W., Toscos, T., Chen, M.Y., Froehlich, J., Harrison, B., Klasnja, P., Lamarca, A., Legrand, L., Libby, R., Smith, I., and Landay, J.A., 2008. Activity sensing in the wild: a trial of UbiFit Garden. Proc CHI, 1797--1806.","paperID":"None"},{"content":"Grossman, P., Niemann, L., Schmidt, S., and Walach, H., 2004. Mindfulness-based stress reduction and health benefits: A meta-analysis. J psychosomatic research 57, 1, 35--43.","paperID":"None"},{"content":"Mcduff, D., Karlson, A., Kapoor, A., Roseway, A., and Czerwinski, M., 2012. AffectAura: an intelligent system for emotional memory. Proc CHI, 849--858.","paperID":"None"},{"content":"Russell, J.A., Weiss, A., and Mendelsohn, G. A., Affect Grid: A Single-Item Scale of Pleasure and Arousal. J Personality and Social Pscyh, 57, 3 (1989), 493--502.,","paperID":"None"},{"content":"Sharry, J., McDermott, M., and Condron, J. 2003. Relax To Win: Treating children with anxiety problems with a biofeedback video game. Eisteach, 2, 22--26.","paperID":"None"},{"content":"Sheldon, K.M. and Lyumbomirsky, S., 2006. How to increase and sustain positive emotion: The effects of visualizing best possible selves. J Pos Psych 1, 2, 7382.","paperID":"None"},{"content":"Snyder, J., Matthews, M., Chien, J., Chang, P., Sun, E., Abdullah, S & Gay, G. 2015. MoodLight: Exploring Personal and Social Implications of Ambient Display of Biosensor Data. To appear in Proc CSCW. 2015. ACM.","paperID":"None"},{"content":"Spielberger, C.D., 2010. State-Trait Anxiety Inventory. State-Trait Anxiety Inventory. John Wiley & Sons, Inc.","paperID":"None"},{"content":"Walters, J., Apter, M.J., and Svebak, S., 1982. Color preference, arousal, and the theory of psychological reversals. Motivation and Emotion 6, 3, 193--215.","paperID":"None"},{"content":"Yuen, C.N. and Lavin, M.J., 2004. Internet dependence in the collegiate population: the role of shyness. CyberPsychology & Behavior 7, 4, 379--383.","paperID":"None"}],"citation":[],"title":"Real-Time Representation Versus Response Elicitation in Biosensor Data","filename":"CHI15/p605","authors":["Mark Matthews","Jaime Snyder","Lindsay Reynolds","Jacqueline T. Chien","Adam Shih","Jonathan W. Lee","Geri Gay"],"conference":"CHI '15"}