{"paperId":2702463,"abstract":"There has been a massive growth in the number of people who film and upload amateur footage of events to services such as Facebook and Youtube, or even stream live to services such as LiveStream. We present an exploratory study that investigates the potential of these spectators in creating footage en masse; in this case, during a live trial at a local marathon. We deployed a prototype app, RunSpotRun, as a technology probe to see what kinds of footage spectators would produce. We present an analysis of this footage in terms of its coverage, quality, and contents, and also discuss the implications for a) spectators enjoying the race, and b) extracting the stories of individual runners throughout the race. We conclude with a discussion of the challenges that remain for deploying such technology at a larger scale.","citation":[{"content":"Raphael Velt , Steve Benford , Stuart Reeves , Michael Evans , Maxine Glancy , Phil Stenton, Towards an Extended Festival Viewing Experience, Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video, June 03-05, 2015, Brussels, Belgium","paperID":"2745206"},{"content":"Edward Anstead , Steve Benford , Robert Houghton, MarathOn Multiscreen: Group Television Watching and Interaction in a Viewing Ecology, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820003"}],"reference":[{"content":"Ames, M., Eckles, D., Naaman, M., Spasojevic, M., and House, N. 2010. Requirements for mobile photoware. Personal Ubiquitous Computing.14, 2, 95--109","paperID":"None"},{"content":"Ames, M. and Naaman, M., 2007. Why we tag. In Proc. Of CHI '07. ACM, NY.","paperID":"None"},{"content":"Bartindale, T., Hook, J., and Olivier, P. 2009. Media Crate: tangible live media production interface. In Proc of TEI '09. ACM, New York, NY, USA, 255--262.","paperID":"None"},{"content":"Ben-Ami, I., Basha, T. and Avidan, S., 2012. Racing Bib Numbers Recognition. In Proc of British Machine Vision Conference 2012. 19.1--19.10.","paperID":"None"},{"content":"Curmi, F., et al. 2013. HeartLink: open broadcast of live biometric data to social networks. In Proc. of CHI '13. ACM, New York, NY, USA, 1749--1758","paperID":"None"},{"content":"Durrant, A., et al. 2011. Automics: souvenir generating photoware for theme parks. In Proc. Of CHI. ACM, NY, 1767--1776","paperID":"None"},{"content":"Engström, A., Perry, M., and Juhlin, O. 2012. Amateur vision and recreational orientation:: creating live video together. In Proc of CSCW '12. ACM, New York, NY, USA, 651--660","paperID":"None"},{"content":"Esbjörnsson, M. et al., 2006. Watching the cars go round and round. In Proc. Of CHI '06. ACM, NY.","paperID":"None"},{"content":"Jacucci, G. et al., 2007. Comedia. In Proc. Of CHI '07 ACM, NY.","paperID":"None"},{"content":"Juhlin, O., Engström, A. and Reponen, E., 2010. Mobile broadcasting: the whats and hows of live video as a social medium. In Proc. of MobileHCI '10. ACM, NY","paperID":"None"},{"content":"Kennedy, L. and Naaman, M.. 2009. Less talk, more rock: automated organization of community-contributed collections of concert videos. In Proc of WWW '09. ACM, New York, NY, USA, 311--320.","paperID":"None"},{"content":"Laibowitz, M.,et al. 2010. Multimedia content creation using societal-scale ubiquitous camera networks and human-centric wearable sensing. In Proc. of Multimedia '10. ACM, New York, NY, USA, 571--580","paperID":"None"},{"content":"Ludvigsen, M. and Veerasawmy, R., 2010. Designing technology for active spectator experiences at sporting events. In Proc. of OZCHI '10. ACM, NY","paperID":"None"},{"content":"Nottingham Evening Post Article. 2012. http://www.nottinghampost.com/guide-Nottingham-sRobin-Hood-Half-Marathon/story-17004302detail/story.html","paperID":"None"},{"content":"Nottingham Marathon Results. 2013. http://robinhoodhalfmarathon.co.uk/","paperID":"None"},{"content":"Radiohead Prague. 2009. http://radioheadprague.nataly.fr/. Retrieved 09/14","paperID":"None"},{"content":"De Sá, M., Shamma, D., and Churchill, E. 2014. Live mobile collaboration for video production: design, guidelines, and requirements. Personal Ubiquitous Computing. 18, 3 (March 2014), 693--707.","paperID":"None"},{"content":"Salovaara, et al. 2006. Collective creation and sensemaking of mobile media. In Proc. of CHI '06. ACM, NY, 1211--1220","paperID":"None"},{"content":"Shrestha, P., et al 2010. Automatic mashup generation from multiple-camera concert recordings. In Proc. of Multimedia '10. ACM, New York, NY, USA, 541--550.","paperID":"None"},{"content":"SiSLive, 2011. Case Study: London Marathon 2012, Available at: http://www.sislive.tv/casestudies/LondonMarathon.pdf","paperID":"None"},{"content":"Sniderman, Z., 2011. New York Marathon Runners Getting Digital Love from RFID Chips. 28/10/2011. Available at: http://mashable.com/2011/10/27/marathonrunners-rfid-chips/","paperID":"None"},{"content":"Snoek, C., et al. 2010. Crowdsourcing rock n' roll multimedia retrieval. In Proc. of Multimedia '10. ACM, New York, NY, USA, 1535--1538","paperID":"None"},{"content":"Sundaram, H. and Campbell, M., 2008. Event Mining in Multimedia Streams. Proceedings of the IEEE, 96(4), pp.623--647.","paperID":"None"},{"content":"Swedberg, C., 2011. New York City Marathon Offers Enhanced RFID-enabled Apps. RFID Journal.","paperID":"None"},{"content":"Teevan, J., Collins-Thompson, K., White, R., and Dumais, S. 2014. Slow search. Commun. ACM 57, 8 (August 2014), 36--38.","paperID":"None"},{"content":"Van Velsen, L. and Melenhorst, M. 2009. Incorporating user motivations to design for video tagging. Interacting with Computers, 21(3), pp.221--228","paperID":"None"},{"content":"Vihavainen, S., et al. 2011. We want more: humancomputer collaboration in mobile social video remixing of music concerts. In Proc of CHI '11. ACM, New York, NY, USA, 287--296","paperID":"None"}],"title":"Run Spot Run: Capturing and Tagging Footage of a Race by Crowds of Spectators","filename":"CHI15/p747","authors":["Martin D. Flintham","Raphael Velt","Max L. Wilson","Edward J. Anstead","Steve Benford","Anthony Brown","Timothy Pearce","Dominic Price","James Sprinks"],"conference":"CHI '15"}