{"paperId":2702126,"citation":[{"content":"Mathieu Berthellemy , Elodie Cayez , Marwan Ajem , Gilles Bailly , Sylvain Malacria , Eric Lecolinet, SpotPad, LociPad, ChordPad and InOutPad: investigating gesture-based input on touchpad, Proceedings of the 27th Conference on l'Interaction Homme-Machine, p.1-8, October 27-30, 2015, Toulouse, France","paperID":"2820623"}],"reference":[{"content":"Anderson, F. and Bischof, W.F. Learning and performance with gesture guides. In Proc. CHI'13, ACM (2013), 1109--1118.","paperID":"None"},{"content":"Andrade, J., Meudell, P. Is spatial information encoded automatically in memory? The Quarterly Journal of Experimental Psychology 46, 2 (1993), 365--375.","paperID":"None"},{"content":"Angesleva, J., Oakley, I., Hughes, S., O'Modhrain, Body mnemonics: portable device interaction design concept. In Adjunct Proc UIST'03, ACM.","paperID":"None"},{"content":"Ark W., Dryer, Selker T., Zhai S. Representation Matters: The Effect of 3D Objects and a Spatial Metaphor in a Graphical User Interface. In Proc. HCI'98, ACM (1998), 209--219.","paperID":"None"},{"content":"Baddeley, A.D. Essentials of Human Memory (Classic Edition). Psychology Press Classic Editions, 2013.","paperID":"None"},{"content":"Bailly, G., Lecolinet, E. and Nigay, L. Wave menus: improving the novice mode of hierarchical marking menus. In Proc Interact 2007, Springer, 475--488.","paperID":"None"},{"content":"Bailly, G., Müller, J., Lecolinet, E. Design and Evaluation of Finger-Count Interaction: Combining multitouch gestures and menus. Int. Journal of HumanComputer Studies 70, 10 (2012), 673--689.","paperID":"None"},{"content":"Bolt, R. A. \"Put-that-there\": Voice and gesture at the graphics interface. In Proc. SIGGRAPH'80, 262--270.","paperID":"None"},{"content":"Bower, G. H., Clark, M.C., Lesgold, A.M., and Winzenz, D. Hierarchical retrieval schemes in recall of categorized word lists. Journal of Verbal Learning and Verbal Behavior 8, 3 (1969), 323--343.","paperID":"None"},{"content":"Bower, G. Analysis of a Mnemonic Device. American Scientist 58 (1970), 496--510.","paperID":"None"},{"content":"Briggs, Gary G., Hawkins, Stephen; Crovitz, Herbert F. Bizarre images in artificial memory. Psychonomic Science 19, 6 (1970), 353--354.","paperID":"None"},{"content":"Crovitz, Herbert F. Memory loci in artificial memory. Psychonomic Science 16, 2 (1969), 82--83.","paperID":"None"},{"content":"Cloutier, J., and Neil Macrae, C. The feeling of choosing: Self-involvement and the cognitive status of things past. Consciousness and cognition 17, 1 (2008).","paperID":"None"},{"content":"Czerwinski, M., Van Dantzich, M., Robertson, G., and Hoffman, H. The contribution of thumbnail image, mouse-over text and spatial location memory to web page retrieval in 3D In Proc. Interact (1999), 163--170.","paperID":"None"},{"content":"Gutwin, C., Cockburn, A. Improving List Revistation with ListMaps. In Proc. AVI'06, ACM, (2006), 396--403.","paperID":"None"},{"content":"Gutwin, C., Cockburn, A., Scarr, J., Malacria, S. and Olson, S. C. Faster command selection on tablets with FastTap. In Proc. CHI '14. ACM, 2617--2626.","paperID":"None"},{"content":"Higbee K.L. Your Memory: How It Works and How to Improve It. Marlowe & Company, 2001.","paperID":"None"},{"content":"Ikei Y., Ota1 H., and Kayahara T. Spatial Electronic Mnemonics: A Virtual Memory Interface. In Proc. HCII'07, LNCS 4558, Springer (2007), 30--37.","paperID":"None"},{"content":"Jones, W., and Dumais, S.T. The Spatial Metaphor for User Interfaces: Experimental Tests of Reference by Location versus Name. ACM Trans. Office Information Systems 4,1 (1986), 42--63.","paperID":"None"},{"content":"Kurtenbach, G. and Buxton, W. User Learning and Performance with Marking Menus. In Proc. CHI'94.","paperID":"None"},{"content":"Li, F., Dearman, D., and Truong, K. Virtual shelves: interactions with orientation aware devices. In Proc. UIST'09, ACM (2009), 125--128.","paperID":"None"},{"content":"Maguire, EA, Valentine, ER, Wilding, JM and Kapur, N. Routes to remembering: the brains behind superior memory. Nature Neuroscience 6, 1 (2003), 90--5.","paperID":"None"},{"content":"Mandler, G. Organization and memory. The psychology of learning and motivation (1967), 381.","paperID":"None"},{"content":"Nacenta, M.A., Kamber, Y., Qiang, Y., and Kristensson, P.O. Memorability of pre-designed and user-defined gesture sets. In Proc CHI'13, ACM (2013), 1099--1108.","paperID":"None"},{"content":"Norman, D. A. Natural user interfaces are not natural. Interactions 17, 3 ACM (2010), 6--10.","paperID":"None"},{"content":"Oakley, I. and Park, J. Motion marking menus: An eyesfree approach to motion input for handheld devices. Int. J. Human-Computing Studies 67, 6 (2009), 515--532.","paperID":"None"},{"content":"Paivio, A. Imagery and verbal process. Holt, Rinehart, & Winston, 1971.","paperID":"None"},{"content":"Raz, A., Packard, M. G., Alexander, G. M., Buhle, J. T., Zhu, H., Yu, S., Peterson, B. S. A slice of -- : An exploratory neuroimaging study of digit encoding and retrieval in a superior memorist. Neurocase 15, 5 (2009), 361--372.","paperID":"None"},{"content":"Robertson, G., Czerwinski, M., Larson, K., Robbins, D., Thiel, D., and Van Dantzich, M. Data mountain: using spatial memory for document management. In Proc. CHI'98, ACM (1998), 153--162.","paperID":"None"},{"content":"Scarr, J., Cockburn, A., Gutwin, C. and Bunt, A. 2012. Improving command selection with CommandMaps. In Proc. CHI'12, ACM (2012), 257--266.","paperID":"None"},{"content":"Scarr, J., Cockburn, A., Gutwin, G. and Malacria, S. Testing the Robustness and Performance of Spatially Consistent Interfaces. In Proc. CHI'13, ACM (2013).","paperID":"None"},{"content":"Serrano, M., Lecolinet, E. and Guiard, Y. Bezel-Tap gestures: quick activation of commands from sleep mode on tablets. In Proc. CHI'13 (2013), 3027--3036.","paperID":"None"},{"content":"Wagner, J., Lecolinet, E., Selker, T. Multi-finger Chords for Hand-held Tablets: Recognizable and Memorable. In Proc. CHI'14, ACM, (2014), 2883--2892.","paperID":"None"},{"content":"Wilson, A. and Shafer, S. XWand: UI for intelligent spaces. In Proc. CHI'03, ACM (2003), 545--552.","paperID":"None"},{"content":"Wobbrock, J., Morris, M., and Wilson, A. User-defined gestures for surface computing. In Proc. CHI'09, ACM 1083--1092.","paperID":"None"},{"content":"Yates, F. The art of memory, Random House, 1992.","paperID":"None"},{"content":"Zhao, S., and Balakrishnan, R. Simple vs. compound mark hierarchical marking menus. In Proc. UIST'04, ACM (2004), pp. 33--42.","paperID":"None"}],"abstract":"Physical Loci, a technique based on an ancient memory technique, allows users to quickly learn a large command set by leveraging spatial, object and verbal/semantic memory to create a cognitive link between individual commands and nearby physical objects in a room (called loci). We first report on an experiment that showed that for learning 25 items Physical Loci outperformed a mid-air Marking Menu baseline. A long-term retention experiment with 48 items then showed that recall was nearly perfect one week later and, surprisingly, independent of whether the command/locus mapping was one's own choice or somebody else's. A final study suggested that recall performance is robust to alterations of the learned mapping, whether systematic or random.","title":"Physical Loci: Leveraging Spatial, Object and Semantic Memory for Command Selection","filename":"CHI15/p299","authors":["Simon T. Perrault","Eric Lecolinet","Yoann Pascal Bourse","Shengdong Zhao","Yves Guiard"],"conference":"CHI '15"}