{"paperId":2702575,"citation":[{"content":"Aliaksei Miniukovich , Antonella De Angeli, Visual diversity and user interface quality, Proceedings of the 2015 British HCI Conference, July 13-17, 2015, Lincoln, Lincolnshire, United Kingdom","paperID":"2783580"}],"reference":[{"content":"Armstrong, T. and Detweiler-Bedel, B. Beauty as an emotion: the exhilarating prospect of mastering a challenging world. Review of general psychology, 12, 4 (2008), 305--329.","paperID":"None"},{"content":"Balinsky, H. Evaluating interface aesthetics: measure of symmetry. In Digital Publishing Conference (San Jose 2006), International Society for Optics and Photonics.","paperID":"None"},{"content":"Balinsky, H. Y., Wiley, A. J., & Roberts, M. C. Aesthetic measure of alignment and regularity. In the 9th ACM symposium on Document Engineering (Munich 2009), ACM, 56--65.","paperID":"None"},{"content":"Cao, J., Mao, B., and Luo, J. A segmentation method for web page analysis using shrinking and dividing. International Journal of Parallel, Emergent and Distributed Systems, 25, 2 (2010), 93--104.","paperID":"None"},{"content":"Choi, J. H. and Lee, H. J. Facets of simplicity for the smartphone interface: A structural model. International Journal of Human-Computer Studies, 70, 2 (2012), 129--142.","paperID":"None"},{"content":"De Angeli, A., Sutcliffe, A., and Hartmann, J. Interaction, usability and aesthetics: what influences users' preferences? In the 6th conference on Designing Interactive systems (2006), ACM, 271--280.","paperID":"None"},{"content":"Fei-Fei, L., Iyer, A., Koch, C., and Perona, P. What do we perceive in a glance of a real-world scene? Journal of vision, 7, 1 (2007), 1--29.","paperID":"None"},{"content":"Gartus, A. and Leder, H. The small step toward asymmetry: Aesthetic judgment of broken symmetries. i-Perception, 4, 5 (2013), 352--355.","paperID":"None"},{"content":"Hall, R. H. and Hanna, P. The impact of web page textbackground colour combinations on readability, retention, aesthetics and behavioural intention. Behaviour & information technology, 23, 3 (2004), 183--195.","paperID":"None"},{"content":"Harper, S., Michailidou, E., and Stevens, R. Toward a definition of visual complexity as an implicit measure of cognitive load. ACM Transactions on Applied Perception, 6, 2 (2009).","paperID":"None"},{"content":"Ivory, M. Y., Sinha, R. R., and Hearst, M. A. Empirically validated web page design metrics. In Proceedings of the SIGCHI conference on Human factors in computing systems (2001), ACM, 53--60.","paperID":"None"},{"content":"Kim, H. and Fesenmaier, D. R. Persuasive design of destination web sites: An analysis of first impression. Journal of Travel Research., 47, 1 (2008), 3--13.","paperID":"None"},{"content":"Lee, S. and Koubek, R. J. Understanding user preferences based on usability and aesthetics before and after actual use. Interacting with Computers, 22, 6 (2010), 530--543.","paperID":"None"},{"content":"Lindgaard, G., Fernandes, G., Dudek, C., and Brown, J. Attention web designers: You have 50 milliseconds to make a good first impressoin! Behavior & information technology, 25, 2 (2006), 115--126.","paperID":"None"},{"content":"Michailidou, E., Harper, S., and Bechhofer, S. Visual complexity and aesthetic perception of web pages. In the 26th annual ACM international conference on Design of communication (2008), ACM, 215--224.","paperID":"None"},{"content":"MiniUnited Kingdomovich, A., De Angeli A.. Quantification of Interface Visual Complexity. In the 2014 International Working Conference on Advanced Visual Interfaces (2014), ACM, 153--160.","paperID":"None"},{"content":"MiniUnited Kingdomovich, A., De Angeli A.. Visual Impression of Mobile App Interfaces. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (2014), ACM, 31--40.","paperID":"None"},{"content":"Nadkarni, S. and Gupta, R. A Task-Based Model of Perceived Website Complexity. Mis Quarterly, 31, 3 (2007).","paperID":"None"},{"content":"Ngo, D. C. L., Teo, L. S., and Byrne, J. G. Modelling interface aesthetics. Information Sciences, 152 (2003), 25--46.","paperID":"None"},{"content":"Oliva, A., Mack, M. L., Shrestha, M., and Peeper, A. Identifying the perceptual dimensions of visual complexity of scenes. In the 26th Annual Meeting of the Cognitive Science Society (2004).","paperID":"None"},{"content":"Purchase, H. C., Freeman, E., and Hamer, J. An exploration of visual complexity. Digrammatic representation and inferences (2012), 200--213.","paperID":"None"},{"content":"Purchase, H. C., Hamer, J., Jameson, A., and Ryan, O. Investigating objective measures of web page aesthetics and usability. In 12th Australasian user interface conference (AUIC 2011) (2011), Australian computer society, Inc., 19--28.","paperID":"None"},{"content":"Reber, R., Schwarz, N., and Winkielman, P. Processing fluency and aesthetic pleasure: is beauty in the perceiver's processing experience? Personality and social psychology review, 8, 4 (2004), 364--382.","paperID":"None"},{"content":"Reber, R., Winkielman, P., and Schwarz, N. Effects of perceptual fluency on affective judgments. Psychological science, 9, 5 (1998), 45--48.","paperID":"None"},{"content":"Reinecke, K. and Gajos, K. Z. Quantifying visual preferences around the world. In the 32nd annual ACM conference on Human factors in computing systems ( 2014), ACM.","paperID":"None"},{"content":"Reinecke, K., Yeh, T., Miratrix, L., Mardiko, R., Zhao, Y., and Liu, J., Gajos, K. Z. Predicting users' first impressions of website aesthetics with a quantification of perceived visual complexity and colorfulness. In CHI (2013), ACM, 2049--2058.","paperID":"None"},{"content":"Rosenholtz, R., Li, Y., and Nakano, L. Measuring visual clutter. Journal of vision, 7, 2 (2007), 1--22.","paperID":"None"},{"content":"Sereno, S. C. and Rayner, K. Measuring word recognition in reading: eye movements and eventrelated potentials. Trends in cognitive sciences, 7, 11 (2003), 489--493.","paperID":"None"},{"content":"Sonderegger, A., Zbinden, G., Uebelbacher, A., and Sauer, J. The influence of product aesthetics and usability over the course of time: a longitudinal field experiment. Ergonomics, 55 (2012), 713--730.","paperID":"None"},{"content":"Thielsch, M. T., Blotenberg, I., and Jaron, R. User evaluation of websites: From first impression to recommendation. Interacting with Computers, 26, 1 (2013), 89--102.","paperID":"None"},{"content":"Tinio, P. P. and Leder, H. Just how stable are stable aesthetic features? Symmetry, complexity, and the jaws of massive familiarization. Acta Psychologica, 130, 3 (2009), 241--250.","paperID":"None"},{"content":"Tractinsky, N. Visual Aesthetics. In Soegaard, Mads and Dam, Rikke Friis, eds., The Encyclopedia of Human-Computer Interaction, 2nd Ed. The InteractionDesign.org Foundation, Aarhus, 2013.","paperID":"None"},{"content":"Tractinsky, N., Cokhavi, A., Kirschenbaum, M., and Sharfi, T. Evaluating the consistency of immediate aesthetic perceptions of web pages. International journal of human-computer studies, 64, 11 (2006), 1071--1083.","paperID":"None"},{"content":"Tuch, A. N., Bargas-Avila, J. A., and Opwis, K. Symmetry and aesthetics in website design: It's a man's business. Computers in Human Behavior, 26, 6 (2010), 1831--1837.","paperID":"None"},{"content":"Tuch, A. N., Bargas-Avila, J. A., Opwis, K., and Wilhelm, F. H. Visual complexity of websites: effects on users' experience, physiology, perfomance, and memory. International journal of human-computer studies, 67 (2009), 703--715.","paperID":"None"},{"content":"Tuch, A. N., Presslaber, E. E., Stocklin, M., Opwis, K., and Bargas-Avila, J. A. The role of visual complexity and prototypicality regarding first impression of websites: Working towards understanding aesthetic judgments. International Journal of Human-Computer Studies, 70 (2012), 794--811.","paperID":"None"},{"content":"Van Den Berg, R., Cornelissen, F. W., and Roerdink, J. B. A crowding model of visual clutter. Journal of Vision, 9, 4 (2009), 1--11.","paperID":"None"},{"content":"Van Schaik, P. and Ling, J. The role of context in perceptions of the aesthetics of web pages over time. International Journal of Human-Computer Studies, 67, 1 (2009), 79--89.","paperID":"None"},{"content":"Wu, O., Hu, W., and Shi, L. Measuring the visual complexities of Web pages. ACM Transactions on the Web (TWEB), 7, 1 (2013), 1--34.","paperID":"None"},{"content":"Zheng, X. S., Chakraborty, I., Lin, J. J. W., and Rauschenberger, R. Correlating low-level image statistics with users-rapid aesthetic and affective judgments of web pages. In SIGCHI Conference on Human Factors in Computing Systems ( 2009), ACM, 1--10","paperID":"None"}],"abstract":"People prefer attractive interfaces. Designers strive to outmatch competitors, and create apps and websites that stand out. However, significant expenses on design are unaffordable to small companies; instead, they could adopt automatic tools of interface aesthetics evaluation, a cheaper strategy to good design. This paper describes an important step towards such a tool; it presents eight automatic metrics of graphical user interface (GUI) aesthetics. We tested the metrics in two exploratory studies -- on desktop webpages (N = 62) and on iPhone apps (N = 53) -- and found them to function on both GUI types and for both immediate (150ms exposure) and deliberate (4s exposure) aesthetics impressions. Our best-fit regression models explained up to 49% of variance in webpage aesthetics and up to 32% (if app genre is considered) of variance in iPhone app aesthetics. These results confirm past results and suggest the metrics are valid and reliable enough to be widely discussed, and possibly, to be embedded in our prospective GUI evaluation tool, tLight.","video":"http://www.youtube.com/embed/Mt5ZO16FPpo?rel=0","title":"Computation of Interface Aesthetics","filename":"CHI15/p1163","authors":["Aliaksei Miniukovich","Antonella De Angeli"],"conference":"CHI '15"}