{"paperId":2702131,"abstract":"In this paper, we present the design and evaluation of dynamic security questions for fallback authentication. In case users lose access to their device, the system asks questions about their usage behavior (e.g. calls, text messages or app usage). We performed two consecutive user studies with real users and real adversaries to identify questions that work well in the sense that they are easy to answer for the genuine user, but hard to guess for an adversary. The results show that app installations and communication are the most promising categories of questions. Using three questions from the evaluated categories was sufficient to get an accuracy of 95.5% - 100%.","reference":[{"content":"Apple Support. ios: Forgotten passcode or device disabled after entering wrong passcode. http://support.apple.com/kb/ht1212 (Accessed: 03/03/2014).","paperID":"None"},{"content":"Babic, A., Xiong, H., Yao, D., and Iftode, L. Building robust authentication systems with activity-based personal questions. In Proc. SafeConfig 2009, ACM Press (2009), pp. 19--24.","paperID":"None"},{"content":"Das, S., Hayashi, E., and Hong, J. I. Exploring capturable everyday memory for autobiographical authentication. In Proc. UbiComp 2013, ACM Press (2013), 211--220.","paperID":"None"},{"content":"Furnell, S. An assessment of website password practices. Computers & Security 26, 7--8 (2007), 445--451.","paperID":"None"},{"content":"Garfinkel, S. L. Email-based identification and authentication: An alternative to pki? IEEE Security & Privacy 1, 6 (2003), 20--26.","paperID":"None"},{"content":"Griffith, V., and Jakobsson, M. Messin' with texas deriving mother's maiden names using public records. In Proc. ACNS 2014. Springer (2005), pp. 91--103.","paperID":"None"},{"content":"Gupta, P., Gottipati, S., Jiang, J., and Gao, D. Your love is public now: Questioning the use of personal information in authentication. In Proc. ASIA CCS 2013, ACM Press (2013), 49--60.","paperID":"None"},{"content":"Haga, W. J., and Zviran, M. Question-and-answer passwords: An empirical evaluation. Information Systems 16, 3 (1991), 335--343.","paperID":"None"},{"content":"Jakobsson, M., Stolterman, E., Wetzel, S., and Yang, L. Love and authentication. In Proc. CHI 2008, ACM Press (2008), 197--200.","paperID":"None"},{"content":"Just, M. Designing and evaluating challenge-question systems. IEEE Security & Privacy 2, 5 (2004), pp. 32--39.","paperID":"None"},{"content":"Just, M., and Aspinall, D. Personal choice and challenge questions: A security and usability assessment. In Proc. SOUPS 2009, ACM Press (2009), 8:1--8:11.","paperID":"None"},{"content":"Microsoft. Microsoft live mail. https://login.live.com/ (Accessed: 04/08/2014).","paperID":"None"},{"content":"Muslukhov, I., Boshmaf, Y., Kuo, C., Lester, J., and Beznosov, K. Know your enemy: The risk of unauthorized access in smartphones by insiders. In Proc. MobileHCI 2013, ACM Press (2013), 271--280.","paperID":"None"},{"content":"Polakis, I., Lancini, M., Kontaxis, G., Maggi, F., Ioannidis, S., Keromytis, A. D., and Zanero, S. All your face are belong to us: Breaking facebook's social authentication. In Proc. ACSAC 2012, ACM Press (2012), 399--408.","paperID":"None"},{"content":"Rabkin, A. Personal knowledge questions for fallback authentication: Security questions in the era of facebook. In Proc. SOUPS 2008, ACM Press (New York, NY, USA, 2008), pp. 13--23.","paperID":"None"},{"content":"Rysgaard, B. A method for protecting user data stored in memory of a mobile communication device, particularly a mobile phone, 2001. European Patent No. EP 1107627 (2001).","paperID":"None"},{"content":"Schechter, S., Brush, A. J. B., and Egelman, S. It's no secret: Measuring the security and reliability of authentication via \"secret\" questions. In Proc. SOUPS 2009, ACM Press (2009), 40:1--40:1.","paperID":"None"},{"content":"Schechter, S., Egelman, S., and Reeder, R. W. It's not what you know, but who you know: A social approach to last-resort authentication. In Proc.CHI 2009, ACM Press (2009), pp. 1983--1992.","paperID":"None"},{"content":"Schechter, S., and Reeder, R. W. 1 + 1 = you: Measuring the comprehensibility of metaphors for configuring backup authentication. In Proc. Soups 2009, ACM Press (2009), 9:1--9:31.","paperID":"None"},{"content":"Statista: The Statistics Portal. Top 20 smartphone-apps in deutschland 2012. http://de.statista.com/statistik/daten/studie/ 239434/umfrage/nutzeranteile-der-top-20smartphone-apps-in-deutschland (Accessed: 03/03/2014).","paperID":"None"}],"citation":[{"content":"Alina Hang , Alexander De Luca , Emanuel von Zezschwitz , Manuel Demmler , Heinrich Hussmann, Locked Your Phone? Buy a New One? From Tales of Fallback Authentication on Smartphones to Actual Concepts, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, August 24-27, 2015, Copenhagen, Denmark","paperID":"2785839"},{"content":"Huiping Sun , Ke Wang , Xu Li , Nan Qin , Zhong Chen, PassApp: My App is My Password!, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, August 24-27, 2015, Copenhagen, Denmark","paperID":"2785880"}],"title":"I Know What You Did Last Week! Do You?: Dynamic Security Questions for Fallback Authentication on Smartphones","filename":"CHI15/p1383","authors":["Alina Hang","Alexander De Luca","Heinrich Hussmann"],"conference":"CHI '15"}