{"paperId":2702547,"citation":[],"reference":[{"content":"Ames, M.G., Bardzell, J., Bardzell, S., Lindtner, S., Mellis, D.A., and Rosner, D.K. Making Cultures: Empowerment, Participation, and Democracy - or Not Proc. CHI EA '14.","paperID":"None"},{"content":"Anderson, C. Makers: The New Industrial Revolution. Crown Business, New York, 2012.","paperID":"None"},{"content":"Barthes, R. Elements of Semiology. Hill and Wang, New York, 1977.","paperID":"None"},{"content":"Charmaz, K. Constructing Grounded Theory: A Practical Guide through Qualitative Analysis. SAGE Publications Ltd, London, 2006.","paperID":"None"},{"content":"Dewey, J. Art as Experience. Perigee Trade, New York, 2005.","paperID":"None"},{"content":"Gershenfeld, N. Fab: The Coming Revolution on Your Desktop. Basic Books, New York, 2007.","paperID":"None"},{"content":"Goldberg, R. Performance Art: From Futurism to the Present. Thames & Hudson, London, 2011.","paperID":"None"},{"content":"Golsteijn, C., Hoven, E. van den, Frohlich, D., and Sellen, A. Hybrid crafting: towards an integrated practice of crafting with physical and digital components. Personal and Ubiquitous Computing 18, 3 (2014), 593--611.","paperID":"None"},{"content":"Hudson, S.E. Printing Teddy Bears: A Technique for 3D Printing of Soft Interactive Objects. Proc. CHI '14.","paperID":"None"},{"content":"Ingold, T. The textility of making. Cambridge Journal of Economics 34, 1 (2010), 91--102.","paperID":"None"},{"content":"Ingold, T. Making: Anthropology, Archaeology, Art and Architecture. Routledge, London, 2013.","paperID":"None"},{"content":"Maestri, L. and Wakkary, R. Understanding Repair As a Creative Process of Everyday Design. Proc. C&C '11","paperID":"None"},{"content":"Morozov, E. Making It. The New Yorker, 2014.","paperID":"None"},{"content":"Mueller, S., Lopes, P., and Baudisch, P. Interactive Construction: Interactive Fabrication of Functional Mechanical Devices. Proc. UIST '12.","paperID":"None"},{"content":"Petersen, M.G., Iversen, O.S., Krogh, P.G., and Ludvigsen, M. Aesthetic Interaction: A Pragmatist's Aesthetics of Interactive Systems. Proc. DIS '04.","paperID":"None"},{"content":"Ranellucci, A. Slic3r.","paperID":"None"},{"content":"Rivers, A., Adams, A., and Durand, F. Sculpting by Numbers. ACM Trans. Graph. 31, 6 (2012).","paperID":"None"},{"content":"Rivers, A., Moyer, I.E., and Durand, F. Positioncorrecting Tools for 2D Digital Fabrication. ACM Trans. Graph. 31, 4 (2012).","paperID":"None"},{"content":"Rosner, D. and Bean, J. Learning from IKEA Hacking: I'm Not One to Decoupage a Tabletop and Call It a Day. Proc. CHI '09.","paperID":"None"},{"content":"Rosner, D.K., Lindtner, S., Erickson, I., Forlano, L., Jackson, S.J., and Kolko, B. Making Cultures: Building Things & Building Communities. Proc. CSCW '14.","paperID":"None"},{"content":"Shewbridge, R., Hurst, A., and Kane, S.K. Everyday Making: Identifying Future Uses for 3D Printing in the Home. Proc. DIS '14.","paperID":"None"},{"content":"Studio Homunculus. Haptic Intelligentsia.","paperID":"None"},{"content":"Willis, K.D.D., Lin, J., Mitani, J., and Igarashi, T. Spatial Sketch: Bridging Between Movement & Fabrication. Proc. TEI '10.","paperID":"None"},{"content":"Willis, K.D.D., Xu, C., Wu, K.-J., Levin, G., and Gross, M.D. Interactive Fabrication: New Interfaces for Digital Fabrication. Proc. TEI '11.","paperID":"None"},{"content":"Wright, P., Wallace, J., and McCarthy, J. Aesthetics and Experience-centered Design. ACM Trans. Comput.-Hum. Interact. 15, 4 (2008).","paperID":"None"},{"content":"Zoran, A. and Paradiso, J.A. FreeD: A Freehand Digital Sculpting Tool. Proc. CHI '13.","paperID":"None"},{"content":"Zoran, A., Shilkrot, R., Nanyakkara, S., and Paradiso, J. The Hybrid Artisans: A Case Study in Smart Tools. ACM Trans. Comput.-Hum. Interact. 21, 3 (2014)","paperID":"None"},{"content":"Yes We Can. But Should We? -- re:form. Medium.","paperID":"None"},{"content":"Emerging Objects. http://www.emergingobjects.com/.","paperID":"None"}],"abstract":"This paper details the design and evaluation of Being the Machine, a portable digital fabrication system that places digital fabrication activity outside of the traditional fab lab environment. Being the Machine invites people to (re)consider materials found in their everyday and personal environment as part of the fabrication activity. We expand the design space involving hybrid (physical-digital) fabrication by describing how our system draws from art to support critical and reflective modes of making. In interaction with our system, participants distributed control between human and machine actors to support their preferred mode of making. These patterns reveal new opportunities and challenges for future hybrid fabrication systems, and suggest that designing for qualities of experience, like meditation and reflection, could support meaningful making experiences for many different kinds of makers.","video":"http://www.youtube.com/embed/ilRIKCR405g?rel=0","title":"Being the Machine: Reconfiguring Agency and Control in Hybrid Fabrication","filename":"CHI15/p2477","authors":["Laura Devendorf","Kimiko Ryokai"],"conference":"CHI '15"}