{"paperId":2702520,"reference":[{"content":"Arigbabu OA; Ahmad SMS, Adnan WAN, Yussof S, Iranmanesh V, Malallah, FL, Gender recognition on real world faces based on shape representation and neural network. ICCOINS 2014.","paperID":"None"},{"content":"Baker P, Potts A. \"Why do white people have thin lips?\" Google and the perpetuation of stereotypes via autocomplete search forms. Crit Disc St 10(2): 187--204.","paperID":"None"},{"content":"Behm-Morawitz E, Mastro D. The Effects of the Sexualization of Female Video Game Characters on Gender Stereotyping and Female Self-Concept. Sex Roles 2009; 61(11--12): 808--823.","paperID":"None"},{"content":"Bodenhausen GV, Wyer RS. Effects of stereotypes in decision making and information-processing strategies. J Pers Soc Psychol 1985; 48(2): 267.","paperID":"None"},{"content":"Bureau of Labor Statistics. Labor Force Statistics from the Current Population Survey, Section 11. 5 February 2013. http://www.bls.gov/cps/aa2012/cpsaat11.htm.","paperID":"None"},{"content":"Coltrane S, Adams M. Work-family imagery and gender stereotypes: Television and the reproduction of difference. J Vocat Behav 1997; 50(2): 323--347.","paperID":"None"},{"content":"Correll SJ. Gender and the career choice process: The role of biased self-assessments. Am J Sociol 2001; 106(6): 1691--1730.","paperID":"None"},{"content":"Correll SJ. Constraints into preferences: Gender, status, and emerging career aspirations. Am Sociol Rev 2004; 69(1): 93--113.","paperID":"None"},{"content":"Executive Office of the President. Big Data: Seizing Opportunities, Preserving Values. May 2014.","paperID":"None"},{"content":"Friedman B, Nissenbaum H. Bias in computer systems. ACM T Inform Syst 1996; 14(3): 330--347.","paperID":"None"},{"content":"Gerbner G, Gross L, Morgan M, Signorielli N. Living with television: The dynamics of the cultivation process. Perspectives on media effects 1986: 17--40.","paperID":"None"},{"content":"Graves SB. Television and Prejudice Reduction: When Does Television as a Vicarious Experience Make a Difference? J Soc Issues 1999; 55(4): 707--727.","paperID":"None"},{"content":"Grossman P. New Partnership with LeanIn.org. InFocus by Getty Images. http://infocus.gettyimages.com/post/ new-partnership-with-leaninorg.","paperID":"None"},{"content":"Halpert JA, Wilson ML, Hickman JL. Pregnancy as a source of bias in performance appraisals. J Organ Behav 1993.","paperID":"None"},{"content":"Haslam SA, Turner JC, Oakes PJ, Reynolds KJ, Doosje, B From personal pictures in the head to collective tools in the word: how shared stereotypes allow groups to represent and change social reality. In C McGarty, VY Yzerbyt, R Spears (eds.). Stereotypes as explanations: The formation of meaningful beliefs about social groups 2002. Cambridge University Press, 157--185.","paperID":"None"},{"content":"Heilman ME. Description and prescription: How gender stereotypes prevent women's ascent up the organizational ladder. J Soc Issues 2001; 57(4): 657--674.","paperID":"None"},{"content":"Heilman ME. Okimoto, TG. 2008. Motherhood: A potential source of bias in employment decisions. J Appl Psychol 2008; 93(1): 189--198.","paperID":"None"},{"content":"Hilton JL, & Von Hippel W. Stereotypes. Annu Rev Psychol 1996; 47(1): 237--271.","paperID":"None"},{"content":"Hooper B. Porn star appears on cover of Thai math textbook. United Press International. http://upi.com/5031410787947","paperID":"None"},{"content":"Introna L, Nissenbaum H. Defining the web: The politics of search engines. Computer 2000; 33(1): 54--62.","paperID":"None"},{"content":"Jacobs J. Gender Inequality at Work. Thousand Oaks, CA: SAGE Publications, 1995.","paperID":"None"},{"content":"Kammerer,Y, Gerjets P. How search engine users evaluate and select Web search results: The impact of the search engine interface on credibility assessments. Libr Inform Sci 2012; 4: 251--279.","paperID":"None"},{"content":"Keane MT, O'Brien M, Smyth B. Are people biased in their use of search engines? Commun ACM 2008; 51(2): 49--52.","paperID":"None"},{"content":"Khorsandi R, Abdel-Mottaleb M. Gender classification using 2-D ear images and sparse representation. 2013 IEEE Workshop on Applications of Computer Vision (WACV), 461--466.","paperID":"None"},{"content":"Lean In Foundation. Getty Image Collection. http://leanin.org/getty.","paperID":"None"},{"content":"Makinen E, Raisamo R. Evaluation of Gender Classification Methods with Automatically Detected and Aligned Faces, IEEE T Pattern Anal 2008; 30(3): 541--547.","paperID":"None"},{"content":"Massey D. Categorically Unequal: The American Stratification System. NY: Russell Sage Foundation, 2007.","paperID":"None"},{"content":"Miller CC. 10 February 2014. LeanIn.org and Getty Aim to Change Women's Portrayal in Stock Photos. New York Times, B3. http://nyti.ms/1eLY7ij","paperID":"None"},{"content":"Pariser E. The Filter Bubble: What the Internet Is Hiding from You. 2011. Penguin Press.","paperID":"None"},{"content":"Potter WJ. Cultivation theory and research, Hum Commun Res 1993; 19(4): 564--601.","paperID":"None"},{"content":"Shan C. Learning local binary patterns for gender classification on real-world face images, Pattern Recogn Lett 2012; 33(4), 431--437.","paperID":"None"},{"content":"Shrum LJ. Assessing the Social Influence of Television A Social Cognition Perspective on Cultivation Effects. Commun Res 1995; 22(4): 402--429.","paperID":"None"},{"content":"Spencer SJ, Steele CM, Quinn DM. Stereotype threat and women's math performance. J Exp Soc Psychol 1999; 35(1): 4--28.","paperID":"None"},{"content":"Snyder M, Tanke ED, Berscheid E. Social perception and interpersonal behavior: On the self-fulfilling nature of social stereotypes. J Pers Soc Psychol 1977; 35(9): 656--666.","paperID":"None"},{"content":"Sweeney L. Discrimination in online ad delivery. Commun ACM 2013; 56(5): 44--54.","paperID":"None"},{"content":"Tajfel H. Social stereotypes and social groups. In Turner JC, Giles H. Intergroup Behaviour 1981. Oxford: Blackwell. 144--167.","paperID":"None"},{"content":"Vaughan L, Thelwall M. Search engine coverage bias: evidence and possible causes. Inform Process Manag 2004; 40(4): 693--707.","paperID":"None"},{"content":"Williams D. Virtual Cultivation: Online Worlds, Offline Perceptions. J Commun 1996; 56(1): 69--87.","paperID":"None"},{"content":"Word CO, Zanna MP, Cooper J. The nonverbal mediation of self-fulfilling prophecies in interracial interaction. J Exp Soc Psychol 1974; 10(2): 109--120.","paperID":"None"},{"content":"X Tang, K Liu, J Cui, F Wen, X Wang. IntentSearch: Capturing User Intention for One-Click Internet Image Search, IEEE T Pattern Anal 34(7): 1342--1353.","paperID":"None"},{"content":"Zha ZJ, Yang L, Mei T, Wang M, Wang Z, Chua TS, Hua XS. 2010. Visual query suggestion: Towards capturing user intent in internet image search. ACM T Multim Comput 2010; 6(3): a13.","paperID":"None"}],"citation":[{"content":"Neil Savage, When computers stand in the schoolhouse door, Communications of the ACM, v.59 n.3, March 2016","paperID":"2875029"}],"abstract":"Information environments have the power to affect people's perceptions and behaviors. In this paper, we present the results of studies in which we characterize the gender bias present in image search results for a variety of occupations. We experimentally evaluate the effects of bias in image search results on the images people choose to represent those careers and on people's perceptions of the prevalence of men and women in each occupation. We find evidence for both stereotype exaggeration and systematic underrepresentation of women in search results. We also find that people rate search results higher when they are consistent with stereotypes for a career, and shifting the representation of gender in image search results can shift people's perceptions about real-world distributions. We also discuss tensions between desires for high-quality results and broader societal goals for equality of representation in this space.","video":"http://www.youtube.com/embed/xeZherjrfSE?rel=0","title":"Unequal Representation and Gender Stereotypes in Image Search Results for Occupations","filename":"CHI15/p3819","authors":["Matthew Kay","Cynthia Matuszek","Sean A. Munson"],"conference":"CHI '15"}