{"paperId":2702567,"abstract":"Despite significant progress in sustainable HCI towards theoretical frameworks to guide design, there is a gap between theory and practice, so that the impact of such frameworks is limited. As an initial exploration in bridging the theory-practice gap, we conducted a study using one well-established design framework, the Attachment Framework, to evaluate its applicability in use. We conducted a comparative study with 14 designers to explore the effect of the Attachment Framework on design, and evaluated their designs with 10 design experts using a set of six design criteria. Our results indicated a positive effect on the criterion of novelty, with mixed effects on attachment, presentation, aesthetics, usefulness, and feasibility. We contribute a set of challenges in the application of design frameworks to practice and offer a critical reflection on how researchers can more effectively communicate sustainable HCI design frameworks to practitioners.","citation":[],"reference":[{"content":"Paul M. Aoki , R. J. Honicky , Alan Mainwaring , Chris Myers , Eric Paulos , Sushmita Subramanian , Allison Woodruff, A vehicle for research: using street sweepers to explore the landscape of environmental community action, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518762"},{"content":"Ernesto Arroyo , Leonardo Bonanni , Ted Selker, Waterbot: exploring feedback and persuasive techniques at the sink, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 02-07, 2005, Portland, Oregon, USA","paperID":"1055059"},{"content":"Eli Blevis, Sustainable interaction design: invention & disposal, renewal & reuse, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240705"},{"content":"Chetty, M., Brush, A.J.B., Meyers, B.R., and Johns, P. It's not easy being green. In Proc. CHI 2009.","paperID":"None"},{"content":"Cross, N. Expertise in design: an overview. Design Studies 25, 5 (2004).","paperID":"None"},{"content":"Cross, N. Engineering Design Methods. J. Wiley, 2008.","paperID":"None"},{"content":"Demirbilek, O. and Park, M. A survey of criteria for the assessment of \"Good Product Design\". Proc. EAD 2001.","paperID":"None"},{"content":"Carl DiSalvo , Phoebe Sengers , Hrönn Brynjarsdóttir, Mapping the landscape of sustainable HCI, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753625"},{"content":"Eckert, C. and Stacey, M. Sources of inspiration: a language of design. Design Studies 21, 5 (2000).","paperID":"None"},{"content":"Silke Gegenbauer , Elaine M. Huang, Inspiring the design of longer-lived electronics through an understanding of personal attachment, Proceedings of the Designing Interactive Systems Conference, June 11-15, 2012, Newcastle Upon Tyne, United Kingdom","paperID":"2318052"},{"content":"Gegenbauer, S. The Nature of People's Attachment to Objects, Univ. of Zurich, 2011.","paperID":"None"},{"content":"Goldschmidt, G. and Sever, A.L. Inspiring design ideas with texts. Design Studies 32, 2 (2011).","paperID":"None"},{"content":"Goldschmidt, G. and Smolkov, M. Variances in the impact of visual stimuli on design problem solving performance. Design Studies 27, 5 (2006).","paperID":"None"},{"content":"Gonçalves, M.G., Cardoso, C., and Badke-Schaub, P. Around You: How Designers Get Inspired. In Proc. ICED 2011.","paperID":"None"},{"content":"Barbara Grosse-Hering , Jon Mason , Dzmitry Aliakseyeu , Conny Bakker , Pieter Desmet, Slow design for meaningful interactions, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466472"},{"content":"Sabrina Hauser , Audrey Desjardins , Ron Wakkary, Design activism in the HCI classroom, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468731"},{"content":"Herring, S.R., Chang, C.-C., Krantzler, J., et al. Getting Inspired!. In Proc. CHI 2009.","paperID":"None"},{"content":"Elaine M. Huang , Khai N. Truong, Breaking the disposable technology paradigm: opportunities for sustainable interaction design for mobile phones, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357110"},{"content":"Kruger, C. and Cross, N. Solution driven versus problem driven design. Design Studies 27, 5 (2006).","paperID":"None"},{"content":"Stacey Kuznetsov , George Noel Davis , Eric Paulos , Mark D. Gross , Jian Chiu Cheung, Red balloon, green balloon, sensors in the sky, Proceedings of the 13th international conference on Ubiquitous computing, September 17-21, 2011, Beijing, China","paperID":"2030145"},{"content":"Kuznetsov, S. and Paulos, E. UpStream. In Proc. CHI 2010.","paperID":"None"},{"content":"Lawson, B. How Designers Think: The Design Process Demystified. Elsevier/Architectural, 2006.","paperID":"None"},{"content":"Morris, R. The Fundamentals of Product Design. AVA, 2009.","paperID":"None"},{"content":"Muller, W. Design discipline and the significance of visuo-spatial thinking. Design Studies 10, 1 (1989).","paperID":"None"},{"content":"Nielsen, J. Usability Engineering. Morgan Kaufm. 1994.","paperID":"None"},{"content":"William Odom , James Pierce , Erik Stolterman , Eli Blevis, Understanding why we preserve some things and discard others in the context of interaction design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518862"},{"content":"James Pierce , David Roedl, COVER STORYChanging energy use through design, interactions, v.15 n.4, July + August 2008","paperID":"1374491"},{"content":"Reed, C.J., Wang, H., and Blevis, E. Recognizing individual needs and desires in the case of designing an inventory of humanity-centered, sustainability-directed concepts for time and travel. In Proc. DPPI 2005.","paperID":"None"},{"content":"David J. Roedl , Erik Stolterman, Design research at CHI and its applicability to design practice, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466257"},{"content":"Rogers, Y. New theoretical approaches for humancomputer interaction. Annual Review of Information Science and Technology 38, 1 (2004).","paperID":"None"},{"content":"M. Six Silberman , Bill Tomlinson, Toward an ecological sensibility: tools for evaluating sustainable HCI, CHI '10 Extended Abstracts on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1754003"},{"content":"M. Six Silberman , Lisa Nathan , Bran Knowles , Roy Bendor , Adrian Clear , Maria Håkansson , Tawanna Dillahunt , Jennifer Mankoff, Next steps for sustainable HCI, interactions, v.21 n.5, September + October 2014","paperID":"2651820"},{"content":"Smith, G.F. Idea-Generation Techniques. Journal of Creative Behavior 32, 2 (1998).","paperID":"None"},{"content":"Stolterman, E. The nature of design practice and implications for interaction design research. Int. Journal of Design 2, 1 (2008).","paperID":"None"},{"content":"Yolande A.A. Strengers, Designing eco-feedback systems for everyday life, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979252"},{"content":"Alistair Sutcliffe, On the effective use and reuse of HCI knowledge, ACM Transactions on Computer-Human Interaction (TOCHI), v.7 n.2, p.197-221, June 2000","paperID":"353488"},{"content":"Ueki-Polet, K. and Klemp, K. Less and more. Gestalten, 2009.","paperID":"None"},{"content":"Martin Woolley, Choreographing obsolescence - ecodesign: the pleasure/dissatisfaction cycle, Proceedings of the 2003 international conference on Designing pleasurable products and interfaces, June 23-26, 2003, Pittsburgh, PA, USA","paperID":"782916"}],"title":"Bridging the Theory-Practice Gap: Lessons and Challenges of Applying the Attachment Framework for Sustainable HCI Design","filename":"CHI15/p1305","authors":["Christian Remy","Silke Gegenbauer","Elaine M. Huang"],"conference":"CHI '15"}