{"paperId":2702447,"citation":[],"abstract":"Video games provide unique interactive player experiences (PX) often categorised into different genres. Prior research has looked at different game genres, but rarely through a PX lens. Especially, PX in the emerging area of massive online battle arena (MOBA) games is not well understood by researchers in the field. We address this knowledge gap by presenting a PX study of different game genres, which we followed up with a second semi-structured interview study about PX in MOBA games. Among the results of our analyses are that games that are likely played with other players, such as MOBA games, stimulate less immersion and presence for players. Additionally, while challenge and frustration are significantly higher in this genre, players get a sense of satisfaction from teamwork, competition and mastery of complex gameplay interactions. Our study is the first to contribute a comprehensive insight into key motivators of MOBA players and how PX in this genre is different from other genres.","reference":[{"content":"Anderson, C., Shibuya, A., Ihori, N., et al. Violent Video Game Effects on Aggression, Empathy, and Prosocial Behavior in Eastern and Western Countries. Psyc. Bull. 136, 2 (2010), 151--173.","paperID":"None"},{"content":"Birk, M. and Mandryk, R.L. Control your game-self: effects of controller type on enjoyment, motivation, and personality in game. Proc. CHI '13, 685--694.","paperID":"None"},{"content":"Boyle, E., Connolly, T.M., Hainey, T., and Boyle, J.M. Engagement in digital entertainment games: A systematic review. Comp. Hum. Beh. 28, 3 (2011), 771--780.","paperID":"None"},{"content":"Brockmyer, J.H., Fox, C.M., Curtiss, K.A., McBroom, E., Burkhart, K.M., and Pidruzny, J.N. The development of the Game Engagement Questionnaire: A measure of engagement in video game-playing. Journal of Experimental Social Psychology 45, 4 (2009), 624.","paperID":"None"},{"content":"Csikszentmihalyi, M. Flow: The Psychology of Optimal Experience. Harper Perennial Modern Classics, 2008.","paperID":"None"},{"content":"Dauphin, B. and Heller, G. Going to other worlds: the relationships between videogaming, psychological absorption, and daydreaming styles. Cyberpsych, Behavior And Social Networking 13, 2 (2010), 169--172.","paperID":"None"},{"content":"Elliott, L., Golub, A., Ream, G., and Dunlap, E. Video game genre as a predictor of problem use. Cyberpsych., behavior and social networking 15, 3 (2012), 155--61.","paperID":"None"},{"content":"Feng, X., Chan, S., Brzezinski, J., and Nair, C. Measuring enjoyment of computer game play. AMCIS 2008 Proceedings, (2008), 1--10.","paperID":"None"},{"content":"Gajadhar, B., De Kort, Y., and Ijsselsteijn, W. Shared fun is doubled fun: Player enjoyment as a function of social setting. Fun and Games, (2008), 106--117.","paperID":"None"},{"content":"Gerling, K., Miller, M., and Mandryk, R. Effects of balancing for physical abilities on player performance, experience and self-esteem in exergames. Proc. CHI '14, 2201--2210.","paperID":"None"},{"content":"Ghuman, D. and Griffiths, M. A Cross-Genre Study of Online Gaming. Int. Journal of CyberBehavior, Psychology and Learning 2, 1 (2012), 13--29.","paperID":"None"},{"content":"Ijsselsteijn, W.A., de Kort, Y.A.W., and Poels, K. The Game Experience Questionnaire:Development of a selfreport measure to assess the psychological impact of digital games. Manuscript in preparation, (2013).","paperID":"None"},{"content":"Iosup, A., van de Bovenkam, R., Jia, A., and Kuipers, F. Analyzing Implicit Social Networks in Multiplayer Online Games. IEEE Int. Comp., 18, 3 (2014), 36--44.","paperID":"None"},{"content":"Jackson, S. a, Martin, A.J., and Eklund, R.C. Long and short measures of flow: the construct validity of the FSS2, DFS-2, and new brief counterparts. Journal of Sport & Exercise Psych., 30, 5 (2008), 561--87.","paperID":"None"},{"content":"Jennett, C., Cox, A.L., Cairns, P., et al. Measuring and defining the experience of immersion in games. Int. Journal of Hum-Comp. Studies 66, 9 (2008), 641--661.","paperID":"None"},{"content":"Johnson, D. and Gardner, J. Personality, Motivation and Video Games. Proc' OZCHI 2010, 276--279.","paperID":"None"},{"content":"Johnson, D., Wyeth, P., Sweetser, P., and Gardner, J. Personality, genre and videogame play experience. Proc' FnG '12, ACM Press (2012), 117--120.","paperID":"None"},{"content":"Jones, C.M., Scholes, L., Johnson, D., and Katsikitis, M. Gaming Well: Existing links between videogames and flourishing mental health. Frontiers in Psych., 5 (2014).","paperID":"None"},{"content":"Kuikkaniemi, K. and Laitinen, T. The influence of implicit and explicit biofeedback in first-person shooter games. Proc. CHI '10, 859--868.","paperID":"None"},{"content":"Al Mahmud, A., Mubin, O., Shahid, S., and Martens, J.B. Designing and evaluating the tabletop game experience for senior citizens. Proc. NordiCHI '08, ACM Press, 403.","paperID":"None"},{"content":"Mekler, E.D., Bopp, J.A., Tuch, A.N., and Opwis, K. A systematic review of quantitative studies on the enjoyment of digital entertainment games. Proc. CHI '14, (2014), 927--936.","paperID":"None"},{"content":"Nacke, L.E., Grimshaw, M.N., and Lindley, C.A. More than a feeling: Measurement of sonic user experience and psychophysiology in a first-person shooter game. Interacting with Computers 22, 5 (2010), 336--343.","paperID":"None"},{"content":"Norman, K.L. GEQ (Game Engagement/Experience Questionnaire): A Review of Two Papers. Interacting with Computers 25, 4 (2013), 278--283.","paperID":"None"},{"content":"Przybylski, A.K., Rigby, C.S., and Ryan, R.M. A motivational model of video game engagement. Review of General Psychology 14, 2 (2010), 154--166.","paperID":"None"},{"content":"Przybylski, A.K., Weinstein, N., Ryan, R.M., and Rigby, C.S. Having to versus wanting to play: background and consequences of harmonious versus obsessive engagement in video games. CyberPsychology & Behavior 12, 5 (2009), 485--492.","paperID":"None"},{"content":"Ryan, R.M., Rigby, C.S., and Przybylski, A. The motivational pull of video games: a self-determination theory approach. Motiv. & Emo. 30, 4 (2006), 347--363.","paperID":"None"},{"content":"Shores, K., Swanenburg, K.L., Kraut, R., and Riedl, J. The Identification of Deviance and its Impact on Retention in a Multiplayer Game. Proc CSCW '14, 1356--1365.","paperID":"None"},{"content":"Wang, C.K.J., Liu, W.C., and Khoo, A. The psychometric properties of dispositional flow scale-2 in internet gaming. Current Psych.: Research & Reviews 28, 3 (2009), 194--201.","paperID":"None"}],"title":"All about that Base: Differing Player Experiences in Video Game Genres and the Unique Case of MOBA Games","filename":"CHI15/p2265","authors":["Daniel Johnson","Lennart E. Nacke","Peta Wyeth"],"conference":"CHI '15"}