{"paperId":2702381,"abstract":"We introduce D-Coil, a new digital 3D modeling approach using wax coiling to bring tangibility to the design of digital models. After defining a shape to extrude, the users follow the lead of a hand-held actuated extruder to instantiate the actual extrusion using wax. The tangibility of the wax extrusion sets the stage to create the next components until the digital model is completed. The digital model affords all digital attributes (ease of transformation, distribution, and 3D printing) while the wax artifact can be discarded or kept as a one-of-a-kind memento. We present a proof-of-concept implementation of D-Coil and showcase how this additive approach can also be extended to a subtractive process using a digitally actuated cutter. By adding a 6DOF mouse, users can also include scaling, rotation, and bending effects to create a wide variety of shapes often difficult for novices to produce in standard CAD software.","citation":[{"content":"Christian Weichel , John Hardy , Jason Alexander , Hans Gellersen, ReForm: Integrating Physical and Digital Design through Bidirectional Fabrication, Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2807451"}],"reference":[{"content":"Anderson, C., Makers : the new industrial revolution. 2012, New York: Crown Business.","paperID":"None"},{"content":"Anderson, D., J.S. Yedidia, J.L. Frankel, J. Marks, A. Agarwala, P. Beardsley, J.H.D. Leigh, K. Ryall, and E. Sullivan. Tangible interaction + graphical interpretation: a new approach to 3D modeling. Proceedings of SigGraph'00, pp. 393--402.","paperID":"None"},{"content":"Bae, S.-H., R. Balakrishnan, and K. Singh. ILoveSketch: As-Natural-As-Possible Sketching System for Creating 3D Curve Models. Proceedings of UIST' 08, pp. 181--190.","paperID":"None"},{"content":"Geo Wax Wire, http://www.renfert.com/24185/Preformedwaxes/GEO Waxwire/20836/catalog.aspx,","paperID":"None"},{"content":"Gershenfeld, N., FAB: the Coming Revolution on your Desktop - From Personal Computers to Personal Fabrication. 2005, New York: Basic Books.","paperID":"None"},{"content":"Google, SketchUp. 2006.","paperID":"None"},{"content":"Igarashi, T., S. Matsuoka, and H. Tanaka. Teddy: a sketching interface for 3D freeform design. Proceedings of SigGraph'99, pp. 409--416.","paperID":"None"},{"content":"Lee, J.H., Haptic Intelligentsia, http://studiohomunculus.com/, September 4th.","paperID":"None"},{"content":"Mataerial, Mataerial, http://www.mataerial.com, September 4th.","paperID":"None"},{"content":"Menné, H., http://www.tomchristoffersen.dk/artists/henrik_menne/ henrik_menne.html, Accessed Jan 07 2015.","paperID":"None"},{"content":"Mueller, S., P. Lopes, and P. Baudisch. Interactive construction: interactive fabrication of functional mechanical devices. Proceedings of UIST'12, pp. 599--606.","paperID":"None"},{"content":"Mueller, S., S. Im, S. Gurevich, A. Teibrich, L. Pfisterer, F. Guimbretiere, and P. Baudisch. WirePrint: 3D printed previews for fast prototyping. Proceedings of UIST'14, pp. 273--280.","paperID":"None"},{"content":"Myers, B., S.E. Hudson, and R. Pausch, Past, present, and future of user interface software tools. ACM Trans. Comput.-Hum. Interact., 2000. 7(1): p. 3--28.","paperID":"None"},{"content":"Rivers, A., I.E. Moyer, Fr, #233, and d. Durand, Position-correcting tools for 2D digital fabrication. ACM Trans. Graph., 2012. 31(4): p. 1--7.","paperID":"None"},{"content":"Schön, D.A., The Reflective Practitioner: How Professionals Think In Action. 1984: Basic Books.","paperID":"None"},{"content":"Sheng, J., R. Balakrishnan, and K. Singh. An Interface for Virtual 3D Sculpting via Physical Proxy. Proceedings of GRAPHITE 2006, pp. 213--220.","paperID":"None"},{"content":"Song, H., F. Guimbretiere, H. Lipson, and C. Hu, ModelCraft Framework: Capturing Freehand Annotations and Edits on Physical 3D Models. ACM Trans. Comput.-Hum. Interaction, 2009. 16(3): p. 1--33.","paperID":"None"},{"content":"Sugru, Sugru, http://sugru.com/, 01/12/2014.","paperID":"None"},{"content":"Willis, K.D.D., C. Xu, K.-J. Wu, G. Levin, and M.D. Gross. Interactive fabrication: new interfaces for digital fabrication. Proceedings of TEI'11, pp. 69--72.","paperID":"None"},{"content":"WobbleWork, 3Doodler: The World's First 3D Printing Pen by WobbleWorks LLC, http://www.the3doodler.com/, September 4th.","paperID":"None"},{"content":"Yamaoka, J. and Y. Kakehi. dePEDd: augmented handwriting system using ferromagnetism of a ballpoint pen. Proceedings of UIST'13, pp. 203--210.","paperID":"None"},{"content":"Yee, B., Y. Ning, and H. Lipson. Augmented Reality In-Situ 3D Sketching of Physical Objects. Proceedings of IUI'09, pp.","paperID":"None"},{"content":"Yuebo Shen, K.D., and Jiawei Gu. RoCuModel: an iterative tangible modeling system. Proceedings of TEI '14, pp. 73--76.","paperID":"None"},{"content":"Zeleznik, R.C., K.P. Herndon, and K.P. Herndon. SKETCH: an interface for sketching 3D scenes. Proceedings of SigGraph'96, pp. 163--170.","paperID":"None"},{"content":"Zoran, A. and J.A. Paradiso. FreeD: a freehand digital sculpting tool. Proceedings of CHI'13, pp. 2613--2616.","paperID":"None"},{"content":"Zoran, A., R. Shilkrot, and J. Paradiso. Humancomputer interaction for hybrid carving. Proceedings of UIST'13, pp. 433--440.","paperID":"None"},{"content":"Zoran, A., R. Shilkrot, S. Nanyakkara, and J. Paradiso, The Hybrid Artisans: A Case Study in Smart Tools. ACM Trans. Comput.-Hum. Interact., 2014. 21(3): p. 1--29.","paperID":"None"}],"title":"D-Coil: A Hands-on Approach to Digital 3D Models Design","filename":"CHI15/p1807","authors":["Huaishu Peng","Amit Zoran","François V. Guimbretière"],"conference":"CHI '15"}