{"paperId":2702492,"citation":[{"content":"Jessica Tsimeris , Duncan Stevenson , Michael Broughton , Tom Gedeon, Adapting a Soft 2.5D Actuated Shape Display for Rebound Tenderness Simulation and Training, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838750"}],"reference":[{"content":"Ahmaniemi, T.T., Kildal, J., and Haveri, M. 2014. What is a Device Bend Gesture Really Good for? In CHI'14. Conference on Human Factors in Computing Systems, ACM, New York, NY, USA (2014), 3503--3512.","paperID":"None"},{"content":"Bacim, F., Sinclair, M., and Benko, H. 2012. Challenges of Multitouch Interaction on Deformable Surfaces. In ITS'12. Beyond Flat Displays Workshop, ACM, Cambridge, Massachusetts, USA.","paperID":"None"},{"content":"Bodker, K., Kensing, F., and Simonsen, J. 2004. Participatory It Design: Designing for Business and Workplace Realities. MIT Press, Cambridge, MA, USA.","paperID":"None"},{"content":"Boem, A. 2013. Sculpton: A malleable interface for musical expression. ACM, New York, NY, USA.","paperID":"None"},{"content":"Burstyn, J., Banerjee, A., and Vertegaal, R. 2013. FlexView: An Evaluation of Depth Navigation on Deformable Mobile Devices. In TEI'13. 7th International Conference on Tangible, Embedded and Embodied Interaction, ACM, New York, NY, USA, 193--200.","paperID":"None"},{"content":"Cassinelli, A. and Ishikawa, M. 2005. Khronos projector. In Proc. ACM SIGGRAPH'05. Emerging technologies, Donna Cox (Ed.). ACM, New York, NY, USA, 10.","paperID":"None"},{"content":"Chang, A. and Ishii, H. 2007. Zstretch: A Stretchy Fabric Music Controller. In Proc. NIME'07. 7th International Conference on New Interfaces for Musical Expression, ACM, New York, NY, USA (2007), 46--49.","paperID":"None"},{"content":"Gallant, D.T., Seniuk, A.G., and Vertegaal, R. 2008. Towards More Paper-like Input: Flexible Input Devices for Foldable Interaction Styles. In Proc. UIST'08, ACM, New York, NY, USA, 283--286.","paperID":"None"},{"content":"Grierson, M. and Kiefer, C. 2013. NoiseBear: A wireless malleable instrument designed in participation with disabled children. In Proc. NIME'13. International Conference on New Interfaces for Musical Expression, KAIST, Daejeon, Korea, 122--126.","paperID":"None"},{"content":"Jensenius, A.R. and Voldsund, A. 2012. The Music Ball Project: Concept, Design, Development, Performance. .","paperID":"None"},{"content":"Kiefer, C. 2010. A malleable interface for sonic exploration. In Proc. NIME'10. 10th International Conference on New Interfaces for Musical Expression, ACM, New York, NY, USA (2010).","paperID":"None"},{"content":"Kildal, J. and Boberg, M. 2013. Feel the Action: Dynamic Tactile Cues in the Interaction with Deformable Uis. In CHI'13 Extended Abstracts on Human Factors in Computing Systems, ACM, New York, NY, USA, 1563--1568.","paperID":"None"},{"content":"Kildal, J., Lucero, A., and Boberg, M. 2013. Twisting Touch: Combining Deformation and Touch As Input Within the Same Interaction Cycle on Handheld Devices. In Proc. MobileHCI'13. 15th International Conference on Human-computer Interaction with Mobile Devices and Services, ACM, New York, NY, USA (2013), 237--246.","paperID":"None"},{"content":"Kildal, J. and Wilson, G. 2012. Feeling It: The Roles of Stiffness, Deformation Range and Feedback in the Control of Deformable Ui. In Proc. ICMI'12. 14th ACM International Conference on Multimodal Interaction, ACM, New York, NY, USA, 393--400.","paperID":"None"},{"content":"Lahey, B., Girouard, A., Burleson, W., and Vertegaal, R. 2011. PaperPhone: understanding the use of bend gestures in mobile devices with flexible electronic paper displays. In Proc. CHI'11, ACM, New York, NY, USA, 1303--1312.","paperID":"None"},{"content":"Lee, S., Lim, Y., and Lee, K.-P. 2012. Exploring the Effects of Size on Deformable User Interfaces. In Proc. MobileHCI'12. 14th International Conference on Human-computer Interaction with Mobile Devices and Services Companion, ACM, New York, NY, USA, 89--94.","paperID":"None"},{"content":"Lee, S.-S., Kim, S., Jin, B., et al. 2010. How Users Manipulate Deformable Displays As Input Devices. In CHI'10. Conference on Human Factors in Computing Systems, ACM, New York, NY, USA, 1647--1656.","paperID":"None"},{"content":"Matoba, Y., Sato, T., Takahashi, N., and Koike, H. 2012. ClaytricSurface: An Interactive Surface with Dynamic Softness Control Capability. In Proc. ACM SIGGRAPH'12. Emerging Technologies, ACM, New York, NY, USA, 6:1--6:1.","paperID":"None"},{"content":"Milczynski, M., Hermann, T., Bovermann, T., and Ritter, H. 2006. A malleable device with applications to sonification-based data exploration. In Proc. ICAD'06. 12th International Conference on Auditory Display, London, UK, 69--76.","paperID":"None"},{"content":"Pedersen, E.W. and Hornbaek, K. 2009. mixiTUI: A Tangible Sequencer for Electronic Live Performances. In Proc. TEI'09. 3rd International Conference on Tangible and Embedded Interaction, ACM, New York, NY, USA, 223--230.","paperID":"None"},{"content":"Peschke, J., Göbel, F., Gründer, T., Keck, M., Kammer, D., and Groh, R. 2012. DepthTouch: an elastic surface for tangible computing. In Proc. AVI'12, Genny Tortora, Stefano Levialdi, and Maurizio Tucci (Eds.). ACM, New York, NY, USA, 770--771.","paperID":"None"},{"content":"Rogers, Y., Connelly, K., Tedesco, L., et al. 2007. Why It's Worth the Hassle: The Value of In-situ Studies when Designing Ubicomp. In Proc. UbiComp'07. The 9th International Conference on Ubiquitous Computing, Springer, Berlin, Heidelberg, 336--353.","paperID":"None"},{"content":"Schwesig, C., Poupyrev, I., and Mori, E. 2003. Gummi: User Interface for Deformable Computers. In CHI'03 Extended Abstracts on Human Factors in Computing Systems, ACM, New York, NY, USA, 954--955.","paperID":"None"},{"content":"Shaer, O. and Hornecker, E. 2010. Tangible User Interfaces: Past, Present, and Future Directions. Found. Trends Hum.-Comput. Interact., , 1--137.","paperID":"None"},{"content":"Sheng, J., Balakrishnan, R., and Singh, K. 2006. An Interface for Virtual 3D Sculpting via Physical Proxy. In Proc. GRAPHITE'06. 4th International Conference on Computer Graphics and Interactive Techniques in Australasia and Southeast Asia, ACM, New York, NY, USA, 213--220.","paperID":"None"},{"content":"Singer, E. 2003. Sonic Banana: A Novel Bend-sensorbased MIDI Controller. In Proc. NIME'03. 3rd Internationl Conference on New Interfaces for Musical Expression, National University of Singapore (2003), 220--221.","paperID":"None"},{"content":"Smith, R.T., Thomas, B.H., and Piekarski, W. 2008. Digital Foam Interaction Techniques for 3D Modeling. In proc VRST'08 . ACM Symposium on Virtual Reality Software and Technology, ACM, 61--68.","paperID":"None"},{"content":"Steimle, J., Jordt, A., and Maes, P. 2013. Flexpad: highly flexible bending interactions for projected handheld displays. In Proc. CHI'13, ACM, New York, NY, USA, 237--246.","paperID":"None"},{"content":"Troiano, G.M., Pedersen, E.W., and Hornbæk, K. 2014. User-defined Gestures for Elastic, Deformable Displays. In Proc. AVI'14 International Working Conference on Advanced Visual Interfaces, ACM, New York, NY, USA, 1--8.","paperID":"None"},{"content":"Vanderloock, K., Vanden Abeele, V., Suykens, J.A.K., and Geurts, L. 2013. The Skweezee System: Enabling the Design and the Programming of Squeeze Interactions. In Proc. UIST'13. Annual ACM Symposium on User Interface Software and Technology, ACM, New York, NY, USA, 521--530.","paperID":"None"},{"content":"Vavoula, G.N. and Sharples, M. 2007. Future technology workshop: A collaborative method for the design of new learning technologies and activities. 2, 4, 393--419.","paperID":"None"},{"content":"Warren, K., Lo, J., Vadgama, V., and Girouard, A. 2013. Bending the Rules: Bend Gesture Classification for Flexible Displays. In Proc. CHI'13. Conference on Human Factors in Computing Systems, ACM, New York, NY, USA, 607--610.","paperID":"None"},{"content":"Watanabe, E., Hanzawa, Y., and Inakage, M. 2007. Clay Tone: A Music System Using Clay for User Interaction. In SIGGRAPH'07 Posters, ACM, New York, NY, USA.","paperID":"None"},{"content":"Watanabe, Y., Cassinelli, A., Komuro, T., and Ishikawa, M. 2008. The deformable workspace: A membrane between real and virtual space. In Proc. TABLETOP'08. 3rd IEEE International Workshop on Horizontal Interactive Human-Computer Systems, IEEE Computer Society, Washington, DC, USA, 145--152.","paperID":"None"},{"content":"Weinberg, G., Orth, M., and Russo, P. 2000. The Embroidered Musical Ball: A Squeezable Instrument for Expressive Performance. In CHI'00 Extended Abstracts on Human Factors in Computing Systems, ACM, New York, NY, USA, 283--284.","paperID":"None"},{"content":"Wensveen, S.A.G., Djajadiningrat, J.P., and Overbeeke, C.J. 2004. Interaction Frogger: A Design Framework to Couple Action and Function Through Feedback and Feedforward. In Proc. DIS'04. 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, ACM, New York, NY, USA, 177--184.","paperID":"None"},{"content":"Wikström, V., Overstall, S., Tahiroğlu, K., Kildal, J., and Ahmaniemi, T. 2013. MARSUI: Malleable Audioreactive Shape-retaining User Interface. In CHI '13 Extended Abstracts on Human Factors in Computing Systems, ACM, New York, NY, USA, 3151--3154.","paperID":"None"},{"content":"Ye, Z. and Khalid, H. 2010. Cobra: flexible displays for mobilegaming scenarios. In Proc. CHI'10, ACM, New York, NY, USA, 4363--4368.","paperID":"None"},{"content":"sculpTon: alberto boem. http://www.albertoboem.com/index.php/project/sculpton /.","paperID":"None"}],"abstract":"Deformable interfaces offer new possibilities for gestures, some of which have been shown effective in controlled laboratory studies. Little work, however, has attempted to match deformable interfaces to a demanding domain and evaluate them out of the lab. We investigate how musicians use deformable interfaces to perform electronic music. We invited musicians to three workshops, where they explored 10 deformable objects and generated ideas on how to use these objects to perform music. Based on the results from the workshops, we implemented sensors in the five preferred objects and programmed them for controlling sounds. Next, we ran a performance study where six musicians performed music with these objects at their studios. Our results show that (1) musicians systematically map deformations to certain musical parameters, (2) musicians use deformable interfaces especially to filter and modulate sounds, and (3) musicians think that deformable interfaces embody the parameters that they control. We discuss what these results mean to research in deformable interfaces.","video":"http://www.youtube.com/embed/ZCLNu9IKpZw?rel=0","title":"Deformable Interfaces for Performing Music","filename":"CHI15/p377","authors":["Giovanni Maria Troiano","Esben Warming Pedersen","Kasper Hornbæk"],"conference":"CHI '15"}