{"paperId":2702469,"citation":[],"abstract":"Crowds are increasingly being adopted to solve complex problems. Size and diversity are two key characteristics of crowds; however their relationship to performance is often paradoxical. To better understand the effects of crowd size and diversity on crowd performance we conducted a study on the quality of 4,317 articles in the WikiProject Film community. The results of our study suggest that crowd size leads to better performance when crowds are more diverse. However, there is a break-even point -- smaller, less diverse crowds can outperform more diverse crowds of similar size. Our results offer new insights into the effects of size and diversity on the performance of crowds.","reference":[{"content":"Omar Alnuaimi , Lionel Robert, Jr. , Likoebe Maruping, Team Size, Dispersion, and Social Loafing in Technology-Supported Teams: A Perspective on the Theory of Moral Disengagement, Journal of Management Information Systems, v.27 n.1, p.203-230, Number 1 / Summer 2010","paperID":"2069577"},{"content":"Jilin Chen , Yuqing Ren , John Riedl, The effects of diversity on group productivity and member withdrawal in online volunteer groups, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753447"},{"content":"Dan Cosley , Dan Frankowski , Loren Terveen , John Riedl, SuggestBot: using intelligent task routing to help people find work in wikipedia, Proceedings of the 12th international conference on Intelligent user interfaces, January 28-31, 2007, Honolulu, Hawaii, USA","paperID":"1216309"},{"content":"Cummings, J.N., Kiesler, S., Zadeh, R.B., and Balakrishnan, A.D. (2013) Group Heterogeneity Increases the Risks of Large Group Size: A Longitudinal Study of Productivity in Research Groups. Psychological Science, 24(6):880--890.","paperID":"None"},{"content":"Earley, P.C. and Mosakowski, E. (2000) Creating hybrid team cultures: An empirical test of transnational team functioning. Academy of Management Journal, 43:26--49.","paperID":"None"},{"content":"Jehn, K.A, Northcraft, G.B., Neale, M.A. (1999) Why differences make a difference: A field study of diversity, conflict, and performance in workgroups. Administrative Science Quarterly 4:741.","paperID":"None"},{"content":"Kittur, A., Chi, E., and Suh, B. (2008) Crowdsourcing for usability: Using micro-task markets for rapid, remote, and low-cost user measurements. Proc. CHI.","paperID":"None"},{"content":"Aniket Kittur , Robert E. Kraut, Harnessing the wisdom of crowds in wikipedia: quality through coordination, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460572"},{"content":"Van Knippenberg, D. and Schippers, M.C. (2007) Work group diversity. Annual Review of Psychology, 58:515--541.","paperID":"None"},{"content":"Larson, J.R., Christensen, C., Abbott, A.S., Franz, T.M. (1996) Diagnosing groups: charting the flow of information in medical decision-making teams. J. of Personality and Social Psychology 2:315--330.","paperID":"None"},{"content":"Jun Liu , Sudha Ram, Who does what: Collaboration patterns in the wikipedia and their impact on article quality, ACM Transactions on Management Information Systems (TMIS), v.2 n.2, p.1-23, June 2011","paperID":"1985352"},{"content":"David W. McDonald, Recommending collaboration with social networks: a comparative evaluation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642714"},{"content":"Oliver, P. E., and Marwell, G. (1988). The Paradox of Group Size in Collective Action: A Theory of the Critical Mass. II. American Sociological Review. 1--8.","paperID":"None"},{"content":"O'Reilly, C.A., Caldwell, D.F., and Barnett, W.P. (1989) Work group demography, social integration, and turnover. Administrative Science Quarterly. 34:21--37.","paperID":"None"},{"content":"Scott E. Page, The Difference: How the Power of Diversity Creates Better Groups, Firms, Schools, and Societies, Princeton University Press, Princeton, NJ, 2007","paperID":"1296125"},{"content":"Lionel P. Robert, A multi-level analysis of the impact of shared leadership in diverse virtual teams, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441818"},{"content":"Stasser, G., Taylor L.A., Hanna C. (1994) Information sampling in structured and unstructured discussions of three- and six-person groups. J. Personality Social Psych. 3","paperID":"None"},{"content":"Stvilia, B., Twidale, M. B., Smith, L.C., and Gasser, L. (2005) Assessing information quality of a community-based encyclopedia. Proc. ICIQ.","paperID":"None"},{"content":"Wilkinson, D.M., and Huberman, B.A. (2007) Assessing the value of cooperation in Wikipedia. First Monday 12(4).","paperID":"None"},{"content":"Williams, K.Y. and O'Reilly, C.A. (1998) Demography and diversity in organizations: A review of 40 years of research. Research in Organizational Behavior, 20:77--140.","paperID":"None"}],"title":"Crowd Size, Diversity and Performance","filename":"CHI15/p1379","authors":["Lionel Robert","Daniel M. Romero"],"conference":"CHI '15"}