{"paperId":2702374,"citation":[],"reference":[{"content":"Bandura, A. Guide for constructing self-efficacy scales. Self-efficacy beliefs of adolescents 5 (2006), 307--337.","paperID":"None"},{"content":"Bianchi-Berthouze, N. (2013). Understanding the role of body movement in player engagement. Human Computer Interaction 28(1), 42--75.","paperID":"None"},{"content":"Botvinick, M., and Cohen, J. Rubber hands 'feel' touch that eyes see. Nature 391 (1998), 756.","paperID":"None"},{"content":"Boucsein, W. Electrodermal activity. New York: Plenum press, 1992.","paperID":"None"},{"content":"Bradley M.M., and Lang, P.J. Affective reactions to acoustic stimuli. Psychophysiology 37(2000), 204--215.","paperID":"None"},{"content":"Bradley M.M., and Lang, P.J. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of behavior therapy and experimental psychiatry 25, 1(1994), 49--59.","paperID":"None"},{"content":"Bresin, R., de Witt, A., Papetti, S., Civolani, M., and Fontana, F. Expressive sonification of footstep sounds. Proc. ISON (2010), 51--54.","paperID":"None"},{"content":"Carney, D.R., Cuddy, A.J., and Yap, A.J. Power posing brief nonverbal displays affect neuroendocrine levels and risk tolerance. Psychological Science 21(2010), 1363--1368.","paperID":"None"},{"content":"Carruthers, G. Types of body representation and the sense of embodiment. Consciousness and Cognition 17(2008), 1302--1316","paperID":"None"},{"content":"Cazzato, V., Mian, E., Serino, A., Mele, S., and Urgesi, C. Distinct contributions of extrastriate body area and temporoparietal junction in perceiving one's own and others' body. Cognitive, Affective, & Behavioral Neuroscience (2014), 1--18.","paperID":"None"},{"content":"Cesarini, D., Hermann, T., and Ungerechts, B. A realtime auditory biofeedback system for sports swimming. Proc. ICAD (2014).","paperID":"None"},{"content":"David Cunado , Mark S. Nixon , John N. Carter, Automatic extraction and description of human gait models for recognition purposes, Computer Vision and Image Understanding, v.90 n.1, p.1-41, April 2003","paperID":"864145"},{"content":"de Vignemont, F., Ehrsson, H.H., and Haggard, P. Bodily illusions modulate tactile perception. Current Biology 15, 14(2005), 1286--1290.","paperID":"None"},{"content":"Furfaro, E., Bianchi-Berthouze, N., Bevilacqua, F., and Tajadura-Jiménez, A. Sonification of surface tapping: Influences on behaviour, emotion and surface perception. Proc. ISON (2013), 21--18.","paperID":"None"},{"content":"Galbraith F., and Barton M. Ground loading from footsteps. JASA 48, 5B (1970).","paperID":"None"},{"content":"Gallagher, S. How the body shapes the mind. Clarendon Press, Oxford; New York, 2005.","paperID":"None"},{"content":"Giordano, B.L., and Bresin, R. (2006). Walking and playing: what's the origin of emotional expressiveness in music? Proc. ICMPC9 (2006), 149.","paperID":"None"},{"content":"Giordano, B.L., Visell, Y., Yao, H.Y., Hayward, V., Cooperstock, J.R., and McAdams, S. Identification of walked-upon materials in auditory, kinesthetic, haptic, and audio-haptic conditions. JASA 131(2012), 4002--12.","paperID":"None"},{"content":"Großhauser, T., Bläsing, B., Spieth, C., Hermann, T. Wearable sensor-based real-time sonification of motion and foot pressure in dance teaching and training. J. of the Audio Engineering Society 60, 7/8(2012),580--589.","paperID":"None"},{"content":"Guest S., Catmur C., Lloyd D., and Spence C. Audiotactile interactions in roughness perception. Experimental Brain Research 146 (2002), 161--171.","paperID":"None"},{"content":"Daniel Harrison , Paul Marshall , Nadia Berthouze , Jon Bird, Tracking physical activity: problems related to running longitudinal studies with commercial devices, Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication, September 13-17, 2014, Seattle, Washington","paperID":"2641320"},{"content":"Hennighausen, K., Enkelmann, D., Wewetzer, C., and Remschmidt, H. Body image distortion in Anorexia Nervosa--is there really a perceptual deficit? European Child & Adolescent Psychiatry, 8 (1999), 200--206.","paperID":"None"},{"content":"ISO 226:2003. Acoustics -- Normal equal-loudnesslevel contours.","paperID":"None"},{"content":"Jousmäki, V., and Hari, R. (1998). Parchment-skin illusion: sound-biased touch. Current Biology 8(1998), R190--191.","paperID":"None"},{"content":"Ko, S.-u., Stenholm, S., and Ferrucci, L. Characteristic gait patterns in older adults with obesity-Results from the Baltimore Longitudinal Study of Aging. Journal of Biomechanics, 43(2010), 1104--1110.","paperID":"None"},{"content":"Yosuke Kurihara , Taku Hachisu , Katherine J. Kuchenbecker , Hiroyuki Kajimoto, Jointonation: robotization of the human body by vibrotactile feedback, SIGGRAPH Asia 2013 Emerging Technologies, p.1-3, November 19-22, 2013, Hong Kong, Hong Kong","paperID":"2542295"},{"content":"Legenbauer, T., Vocks, S., Betz, S., Baguena Puigcerver, M.J., Benecke, A., Troje, N.F., and Ruddel, H. Differences in the nature of body image disturbances between female obese individuals with versus without a comorbid binge eating disorder: an exploratory study including static and dynamic aspects of body image. Behavior Modification, 35, 2 (2011), 162--186.","paperID":"None"},{"content":"Leman, M., Moelants, D., Varewyck, M., Styns, F., van Noorden, L., and Martens, J.P. Activating and relaxing music entrains the speed of beat synchronized walking. PloS one 8, 7(2013), e67932.","paperID":"None"},{"content":"Li, X.F., Logan, R.J., and Pastore, R.E. Perception of acoustic source characteristics: walking sounds. JASA 90, 6(1991), 3036--3049.","paperID":"None"},{"content":"Magill, R.A., and Anderson, D.I. The roles and uses of augmented feedback in motor skill acquisition. Skill Acquisition in Sport: Research, Theory and Practice. N. Hodges, A.M. Williams, eds. Routledge, 2012.","paperID":"None"},{"content":"Menzer, F., Brooks, A., Halje, P., Faller, C., Vetterli, M., and Blanke, O. Feeling in control of your footsteps: Conscious gait monitoring and the auditory consequences of footsteps. Cognitive Neuroscience 1(2010), 184--192.","paperID":"None"},{"content":"NHS, Cosmetic surgery. www.nhs.uk/conditions/Cosmetic-surgery","paperID":"None"},{"content":"NHS, Health and fitness. www.nhs.uk/livewell/fitness","paperID":"None"},{"content":"NHS, Walking for Health. www.nhs.uk/Livewell","paperID":"None"},{"content":"Nordahl, R. (2006). Increasing the motion of users in photo-realistic virtual environments by utilising auditory rendering of the environment and ego-motion. Proc. Presence (2006), 57--63.","paperID":"None"},{"content":"OECD. Health at a Glance 2013: OECD Indicators. OECD Publishing, 2013.","paperID":"None"},{"content":"Pastore, R.E., Flint, J.D., Gaston, J.R., and Solomon, M.J. Auditory event perception: the source-perception loop for posture in human gait. Perception & psychophysics 70(2008), 13--29.","paperID":"None"},{"content":"Petkova, V.I. and Ehrsson, H.H. If I were you: Perceptual illusion of body swapping. PLoS ONE 3, 12(2008).","paperID":"None"},{"content":"Ivelina V. Piryankova , Jeanine K. Stefanucci , Javier Romero , Stephan De La Rosa , Michael J. Black , Betty J. Mohler, Can I Recognize My Body's Weight? The Influence of Shape and Texture on the Perception of Self, ACM Transactions on Applied Perception (TAP), v.11 n.3, p.1-18, October 2014","paperID":"2641568"},{"content":"Polich, J. Habituation of P300 from auditory stimuli. Psychobiology 17, 1 (1989), 19--28.","paperID":"None"},{"content":"Pollatos, O., Kurz, A.-L., Albrecht, J., Schreder, T., et al. Reduced perception of bodily signals in anorexia nervosa. Eating Behaviours 9, 4(2008), 381--388.","paperID":"None"},{"content":"Giulio Rosati , Antonio Rodà , Federico Avanzini , Stefano Masiero, On the role of auditory feedback in robot-assisted movement training after stroke: review of the literature, Computational Intelligence and Neuroscience, 2013, p.11-11, January 2013","paperID":"2610925"},{"content":"Sho Sakurai , Toki Katsumura , Takuji Narumi , Tomohiro Tanikawa , Michitaka Hirose, Interactonia Balloon, SIGGRAPH Asia 2012 Emerging Technologies, p.1-3, November 28-December 01, 2012, Singapore, Singapore","paperID":"2407722"},{"content":"Sanchez-Vives, M.V., and Slater, M. From presence to consciousness through virtual reality. Nature Reviews Neuroscience 6, 4(2005), 332--339.","paperID":"None"},{"content":"Savva, N., Scarinzi, A., and Bianchi-Berthouze, N. (2012). Continuous recognition of player's affective body expression as dynamic quality of aesthetic experience. IEEE IEEE Transactions on Computational Intelligence and AI in Games 4(3), 199--212","paperID":"None"},{"content":"Schaffert, N., Mattes, K., and Effenberg, A.O. Listen to the boat motion: acoustic information for elite rowers. Proc. ISON (2010), 31--38.","paperID":"None"},{"content":"Senna, I., Maravita, A., Bolognini, N., and Parise, C.V. (2014). The Marble-Hand Illusion. PloS one 9, 3 (2014).","paperID":"None"},{"content":"Sigrist, R., Rauter, G., Riener, R., Wolf, P. Augmented visual, auditory, haptic, and multimodal feedback in motor learning: A review. Psychonomic Bulletin & Review 20, 1 (2013), 21--53.","paperID":"None"},{"content":"Aneesha Singh , Annina Klapper , Jinni Jia , Antonio Fidalgo , Ana Tajadura-Jiménez , Natalie Kanakam , Nadia Bianchi-Berthouze , Amanda Williams, Motivating people with chronic pain to do physical activity: opportunities for technology design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557268"},{"content":"Styns, F., van Noorden, L., Moelants, D., and Leman, M. Walking on music. Human movement science 26, 5(2007), 769--785.","paperID":"None"},{"content":"Tajadura-Jiménez, A., Väljamäe, A., Toshima, I., Kimura, T., Tsakiris, M., and Kitagawa, N. Action sounds recalibrate perceived tactile distance. Current Biology 22, 13(2012), R516--R517.","paperID":"None"},{"content":"Tiggemann, M. Gender differences in the interrelationships between weight dissatisfaction, restraint, and selfesteem. Sex Roles 30 (1994), 319--330.","paperID":"None"},{"content":"Tonetto, P.L.M., Klanovicz, C.P., Spence, C. Modifying action sounds influences people's emotional responses and bodily sensations. i-Perception, 5(2014), 153--163.","paperID":"None"},{"content":"Troje, N.F. (2008) Retrieving information from human movement patterns. In Understanding Events: How Humans See, Represent, and Act on Events (pp. 308--334). Oxford University Press, 2008.","paperID":"None"},{"content":"Tsakiris, M. My body in the brain: a neurocognitive model of body ownership. Neuropsychologia 48, 3(2010), 703--712.","paperID":"None"},{"content":"Vaughan, C.L., Davis, B.L., and O'connor, J.C. Dynamics of human gait. Champaign, Illinois: Human Kinetics Publishers, 1992 15--43.","paperID":"None"},{"content":"Y. Visell , F. Fontana , B. L. Giordano , R. Nordahl , S. Serafin , R. Bresin, Sound design and perception in walking interactions, International Journal of Human-Computer Studies, v.67 n.11, p.947-959, November, 2009","paperID":"1628613"},{"content":"Katharina Vogt , David Pirrò , Ingo Kobenz , Robert Höldrich , Gerhard Eckel, PhysioSonic - evaluated movement sonification as auditory feedback in physiotherapy, Proceedings of the 6th international conference on Auditory Display, May 18-22, 2009, Copenhagen, Denmark","paperID":"2174866"},{"content":"Junji Watanabe , Hideyuki Ando, Pace-sync shoes: intuitive walking-pace guidance based on cyclic vibro-tactile stimulation for the foot, Virtual Reality, v.14 n.3, p.213-219, September 2010","paperID":"1858563"},{"content":"Wolpert, D.M., and Ghahramani, Z. Computational principles of movement neuroscience. Nature Neuroscience 3(2000), 1212--1217.","paperID":"None"},{"content":"World Health Organization (2009). Global health risks: mortality and burden of disease attributable to selected major risks. Geneva, 2009.","paperID":"None"},{"content":"Zanotto, D., Rosati, G., Spagnol, S., Stegall, P., and Agrawal, S.K. Effects of complementary auditory feedback in robot-assisted lower extremity motor adaptation. IEEE Transactions on Neural Systems and Rehabilitation Engineering, 21, 5(2013), 775--786.","paperID":"None"}],"abstract":"An ever more sedentary lifestyle is a serious problem in our society. Enhancing people's exercise adherence through technology remains an important research challenge. We propose a novel approach for a system supporting walking that draws from basic findings in neuroscience research. Our shoe-based prototype senses a person's footsteps and alters in real-time the frequency spectra of the sound they produce while walking. The resulting sounds are consistent with those produced by either a lighter or heavier body. Our user study showed that modified walking sounds change one's own perceived body weight and lead to a related gait pattern. In particular, augmenting the high frequencies of the sound leads to the perception of having a thinner body and enhances the motivation for physical activity inducing a more dynamic swing and a shorter heel strike. We here discuss the opportunities and the questions our findings open.","title":"As Light as your Footsteps: Altering Walking Sounds to Change Perceived Body Weight, Emotional State and Gait","filename":"CHI15/p2943","authors":["Ana Tajadura-Jiménez","Maria Basia","Ophelia Deroy","Merle Fairhurst","Nicolai Marquardt","Nadia Bianchi-Berthouze"],"conference":"CHI '15"}