{"paperId":2702378,"citation":[],"abstract":"Volunteer campaigns for data collection make it possible for non-profit organizations to extend their ability to monitor and respond to critical environmental and societal issues. Yet mobile data collection technologies that have the potential to lower the costs and increase the accuracy of volunteer-collected data are not commonly used in these campaigns. In this paper we conduct a series of studies that reveal the complex issues affecting technology adoption in this domain. First, we surveyed and interviewed existing volunteering campaigns to map out current technology usage within volunteer campaigns. Next, we provided two organizations with a customizable tool for data collection (Sensr) and studied its use and non-use across six real volunteer-driven campaigns over six months. Our study explored success and failure across the first few phases of the campaign lifecycle (campaign creation, initial deployment, and adoption). Our results highlight the impact of resource constraints, cognitive factors, the depth of volunteer engagement, and stakeholders' perspective on technology as important factors contributing to the adoption and usage of mobile data collection technologies. We use these findings to argue for specific design features to accelerate the adoption and use of such tools in volunteer data collection campaigns.","reference":[{"content":"Aanensen, D. M., Huntley, D. M., Feil, E. J., & Spratt, B. G. (2009). EpiCollect: linking smartphones to web applications for epidemiology, ecology and community data collection. PloS one, 4(9), e6968.","paperID":"None"},{"content":"Carroll, J. (2004). Completing design in use: Closing the appropriation cycle. ECIS 2004, pp.44","paperID":"None"},{"content":"Cohn, J. P. (2008), Citizen Science: Can Volunteers Do Real Research? Bioscience 58:192--197.","paperID":"None"},{"content":"Corburn, J. (2003). Bringing local knowledge into environmental decision making improving urban planning for communities at risk. J. of Planning Educ. and Research, 22(4), 420--433.","paperID":"None"},{"content":"Corburn, J., Osleeb, J., & Porter, M. (2006). Urban asthma and the neighbourhood environment in New York City. Health & Place, 12(2), 167--179.","paperID":"None"},{"content":"Capturing the Complexity in Advanced Technology Use: Adaptive Structuration Theory, Organization Science, v.5 n.2, p.121-147, May 1994","paperID":"2734156"},{"content":"Friedman, B. et al. (2013). Value sensitive design and information systems. In Early engagement and new technologies: Opening up the laboratory (pp. 55--95). Springer Netherlands.","paperID":"None"},{"content":"Jonathan Grudin, Why CSCW applications fail: problems in the design and evaluationof organizational interfaces, Proceedings of the 1988 ACM conference on Computer-supported cooperative work, p.85-93, September 26-28, 1988, Portland, Oregon, USA","paperID":"62273"},{"content":"Hackler, D., & Saxton, G. D. (2007). The strategic use of information technology by nonprofit organizations: Increasing capacity and untapped potential. Public Administration Review, 67(3), 474--487.","paperID":"None"},{"content":"Carl Hartung , Adam Lerer , Yaw Anokwa , Clint Tseng , Waylon Brunette , Gaetano Borriello, Open data kit: tools to build information services for developing regions, Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development, p.1-12, December 13-16, 2010, London, United Kingdom","paperID":"2369236"},{"content":"Sunyoung Kim , Jennifer Mankoff , Eric Paulos, Sensr: evaluating a flexible framework for authoring mobile data-collection tools for citizen science, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441940"},{"content":"Sunyoung Kim , Christine Robson , Thomas Zimmerman , Jeffrey Pierce , Eben M. Haber, Creek watch: pairing usefulness and usability for successful citizen science, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979251"},{"content":"Christopher A. Le Dantec , W. Keith Edwards, The view from the trenches: organization, power, and technology at two nonprofit homeless outreach centers, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460656"},{"content":"Leonardi, P. M. (2009). Why do people reject new technologies and stymie organizational changes of which they are in favor? Exploring misalignments between social interactions and materiality. Human Communication Research, 35(3), 407--441.","paperID":"None"},{"content":"Liu, S. Iacucci, A.A., & Meier, P. Ushahidi Haiti & Chile: Next Generation Crisis Mapping. American Congress on Surveying and Mapping, August 2010.","paperID":"None"},{"content":"MAP & Idealware. (2012). Unleashing innovation: Using everyday technology to improve nonprofit services. St. Paul, MN","paperID":"None"},{"content":"Miles, M.B. and Huberman, A.M. Qualitative data analysis: An expanded sourcebook. SAGE publications, Inc, 1994","paperID":"None"},{"content":"NTEN (2011), Technology: the Smart Investigation, http://blog.techimpact.org/10-nonprofit-tech-stats-on-digital-planning/","paperID":"None"},{"content":"Wanda J. Orlikowski, Using Technology and Constituting Structures: A Practice Lens for Studying Technology in Organizations, Organization Science, v.11 n.4, p.404-428, July 2000","paperID":"768937"},{"content":"Orlikowski, W. J. (2005). Material works: Exploring the situated entanglement of technological performativity and human agency. Scand. J. of Info. Systems, 17(1), 6.","paperID":"None"},{"content":"Raddick, M. J., Bracey, G., Gay, P. L., Lintott, C. J., Murray, P., Schawinski, K., ... & Vandenberg, J. (2010). Galaxy zoo: Exploring the motivations of citizen science volunteers. Astronomy Educ. Review, 9(1), 010103.","paperID":"None"},{"content":"Ramanathan, N., Alquaddoomi, F., et al. (2012). ohmage: An open mobile system for activity and experience sampling. Pervasive Health, IEEE, 2012.","paperID":"None"},{"content":"Saeed, S., Rohde, M., & Wulf, V. (2011) Conducting ICT research in voluntary organizations: Reflections from a long term study of the european social forum, The J. of Community Informatics, 7(3).","paperID":"None"},{"content":"Schneider, J. A. (2003). Small, minority-based nonprofits in the information age. Nonprofit Management and Leadership, 13(4), 383--399.","paperID":"None"},{"content":"Douglas Schuler , Aki Namioka, Participatory Design: Principles and Practices, L. Erlbaum Associates Inc., Hillsdale, NJ, 1993","paperID":"563076"},{"content":"Silvertown, J. (2009). A new dawn for citizen science. Trends in ecology & evolution, 24(9), 467--471.","paperID":"None"},{"content":"Strauss, A. L. and Corbin, J. Basics of Qualitative Research. Sage Publications, 1990.","paperID":"None"},{"content":"Sullivan, B. L., Wood, C. L., Iliff, M. J., Bonney, R. E., Fink, D., & Kelling, S. (2009). eBird: A citizen-based bird observation network in the biological sciences. Biological Conservation, 142(10), 2282--2292.","paperID":"None"},{"content":"Amy Voida , Ellie Harmon , Ban Al-Ani, Homebrew databases: complexities of everyday information management in nonprofit organizations, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979078"},{"content":"Wastell, D. G., & McMaster, T. (2008). Organizational dynamics of technology-based innovation: diversifying the research agenda. J. of Info. Tech., 23(2), 63--70.","paperID":"None"},{"content":"Andrea Wiggins , Kevin Crowston, From Conservation to Crowdsourcing: A Typology of Citizen Science, Proceedings of the 2011 44th Hawaii International Conference on System Sciences, p.1-10, January 04-07, 2011","paperID":"1956101"}],"title":"Exploring Barriers to the Adoption of Mobile Technologies for Volunteer Data Collection Campaigns","filename":"CHI15/p3117","authors":["Sunyoung Kim","Jennifer Mankoff","Eric Paulos"],"conference":"CHI '15"}