{"paperId":2702207,"reference":[{"content":"Chan, L., M¨uller, S., Roudaut, A., and Baudisch, P. CapStones and ZebraWidgets: Sensing stacks of building blocks, dials and sliders on capacitive touch screens. In CHI '12, 2189--2192.","paperID":"None"},{"content":"de Bruijn, N. G. A combinatorial problem. In Koninklijke Nederlandse Akademie v. Wetenschappen 49, Indagationes Mathematicae (1946), 758--764.","paperID":"None"},{"content":"Gupta, S., Morris, D., Patel, S., and Tan, D. SoundWave: Using the Doppler effect to sense gestures. In CHI '12, 1911--1914.","paperID":"None"},{"content":"Harrison, C., and Hudson, S. E. Scratch input: Creating large, inexpensive, unpowered and mobile finger input surfaces. In UIST '08, 205--208.","paperID":"None"},{"content":"Harrison, C., Schwarz, J., and Hudson, S. E. TapSense: Enhancing finger interaction on touch surfaces. In UIST '11, 627--636.","paperID":"None"},{"content":"Harrison, C., Tan, D., and Morris, D. Skinput: Appropriating the body as an input surface. In CHI '10, 453--462.","paperID":"None"},{"content":"Harrison, C., Xiao, R., and Hudson, S. Acoustic barcodes: Passive, durable and inexpensive notched identification tags. In UIST '12, 563--568.","paperID":"None"},{"content":"Hwang, S., Ahn, M., and Wohn, K.-y. MagGetz: Customizable passive tangible controllers on and around conventional mobile devices. In UIST '13, 411--416.","paperID":"None"},{"content":"Klemmer, S. R., Hartmann, B., and Takayama, L. How bodies matter: Five themes for interaction design. In DIS '06, 140--149.","paperID":"None"},{"content":"Meirovitch, L. Analytical Methods in Vibration. The MacMillan Company, 1967.","paperID":"None"},{"content":"Murray-Smith, R., Williamson, J., Hughes, S., and Quaade, T. Stane: Synthesized surfaces for tactile input. In CHI '08, 1299--1302.","paperID":"None"},{"content":"Ono, M., Shizuki, B., and Tanaka, J. Touch & Activate: Adding interactivity to existing objects using active acoustic sensing. In UIST '13, 31--40.","paperID":"None"},{"content":"Savage, V., Chang, C., and Hartmann, B. Sauron: Embedded single-camera sensing of printed physical user interfaces. In UIST '13, 447--456.","paperID":"None"},{"content":"Umetani, N., Mitani, J., and Igarashi, T. Designing custom-made metallophone with concurrent eigenanalysis. In NIME '10, 26--30.","paperID":"None"},{"content":"Weiss, M., Wagner, J., Jansen, Y., Jennings, R., Khoshabeh, R., Hollan, J. D., and Borchers, J. SLAP Widgets: Bridging the gap between virtual and physical controls on tabletops. In CHI '09, 481--490.","paperID":"None"},{"content":"Willis, K. D. D., Brockmeyer, E., Hudson, S., and Poupyrev, I. Printed optics: 3D printing of embedded optical elements for interactive devices. In UIST '12, 589--598.","paperID":"None"}],"citation":[{"content":"Chin-yu Chien , Rong-Hao Liang , Long-Fei Lin , Liwei Chan , Bing-Yu Chen, FlexiBend: Enabling Interactivity of Multi-Part, Deformable Fabrications Using Single Shape-Sensing Strip, Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2807456"}],"abstract":"We describe Lamello, an approach for creating tangible input components that recognize user interaction via passive acoustic sensing. Lamello employs comb-like structures with varying-length tines at interaction points (e.g., along slider paths). Moving a component generates tine strikes; a real-time audio processing pipeline analyzes the resultant sounds and emits high-level interaction events. Our main contributions are in the co-design of the tine structures, information encoding schemes, and audio analysis. We demonstrate 3D printed Lamello-powered buttons, sliders, and dials.","title":"Lamello: Passive Acoustic Sensing for Tangible Input Components","filename":"CHI15/p1277","authors":["Valkyrie Savage","Andrew Head","Björn Hartmann","Dan B. Goldman","Gautham Mysore","Wilmot Li"],"conference":"CHI '15"}