{"paperId":2702372,"citation":[],"reference":[{"content":"Alzheimer's Association. 2013 Alzheimer's disease facts and figures. Alzheimer's & Dementia 9, 2 (Mar. 2013), 208--245.","paperID":"None"},{"content":"Carletta, J., Evert, S., Heid, U., Kilgour, J., Robertson, J., and Voormann, H. The NITE XML Toolkit: flexible annotation for multi-modal language data. Behavior Research Methods, Instruments, and Computers 35, 3 (2003), 353--363.","paperID":"None"},{"content":"Dahlbäck, N., Jönsson, A., and Ahrenberg, L. Wizard of Oz Studies - Why and How. Knowledge-Based Systems 6 (1993), 258--266.","paperID":"None"},{"content":"Georgila, K., Wolters, M., Moore, J. D., and Logie, R. H. The MATCH corpus: a corpus of older and younger users interactions with spoken dialogue systems. Language Resources and Evaluation 44, 3 (Mar. 2010), 221--261.","paperID":"None"},{"content":"Grijincu, D., Nacenta, M. A., and Kristensson, P. O. User-defined Interface Gestures. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces - ITS '14, ACM Press (New York, New York, USA, Nov. 2014), 25--34.","paperID":"None"},{"content":"Hoey, J., Plötz, T., Jackson, D., Monk, A., Pham, C., and Olivier, P. Rapid specification and automated generation of prompting systems to assist people with dementia. Pervasive and Mobile Computing 7, 3 (Dec. 2011), 299--318.","paperID":"None"},{"content":"Mihailidis, A., Boger, J. N., Candido, M., and Hoey, J. The coach prompting system to assist older adults with dementia through handwashing: An efficacy study. BMC Geriatrics 8, 28 (2008).","paperID":"None"},{"content":"Mioshi, E., Dawson, K., Mitchell, J., Arnold, R., and Hodges, J. R. The Addenbrooke's Cognitive Examination Revised (ACE-R): a brief cognitive test battery for dementia screening. Int J Geriatr Psychiatry 21, 11 (Nov. 2006), 1078--1085.","paperID":"None"},{"content":"Moore, J., Kronenthal, M., and Ashby, S. Guidelines for AMI Speech Transcriptions. Tech. rep., Deliverable, AMI Project, 2005.","paperID":"None"},{"content":"O'Neill, B., Moran, K., and Gillespie, A. Scaffolding rehabilitation behaviour using a voice-mediated assistive technology for cognition. Neuropsychological rehabilitation 20, 4 (Aug. 2010), 509--27.","paperID":"None"},{"content":"Orpwood, R., Chadd, J., Howcroft, D., Sixsmith, A., Torrington, J., Gibson, G., and Chalfont, G. Designing technology to improve quality of life for people with dementia: user-led approaches. Universal Access in the Information Society 9, 3 (Aug. 2010), 249--259.","paperID":"None"},{"content":"Schulenberg, S. E., and Melton, A. M. A. The Computer Aversion, Attitudes, and Familiarity Index (CAAFI): A validity study. Computers in Human Behavior 24, 6 (2008), 2620--2638.","paperID":"None"},{"content":"Szymkowiak, A., Morrison, K., Gregor, P., Shah, P., Evans, J., and Wilson, A. A memory aid with remote communication using distributed technology. Personal and Ubiquitous Computing 9, 1 (2005), 1--5.","paperID":"None"},{"content":"Turner, K. J., Gillespie, A., and McMichael, L. J. Rigorous development of prompting dialogues. Journal of biomedical informatics 44, 5 (Oct. 2011), 713--27.","paperID":"None"},{"content":"Wechsler, D. Wechsler Abbreviated Test of Intelligence. Psychological Corporation, San Antonio, TX, 1999.","paperID":"None"},{"content":"Wechsler, D. Wechsler Adult Intelligence Scale IV, 2009.","paperID":"None"},{"content":"Wherton, J. P., and Monk, A. F. Technological opportunities for supporting people with dementia who are living at home. International Journal of Human-Computer Studies 66, 8 (Aug. 2008), 571--586.","paperID":"None"},{"content":"Zajicek, M., and Khin Kyaw, Z. The Speech Dialogue Design for a PDA/Web Based Reminder System. In Proc. 9th IASTED, Hawaii (2005), 394--399.","paperID":"None"}],"abstract":"Papers on voice interfaces for people with cognitive impairment or demenita only provide small snapshots of actual interactions, if at all. This is a major obstacle to the development of better interfaces. Transcripts of interactions between users and systems contain rich evidence of typical language patterns, indicate how users conceptualise their computer interlocutor, and highlight key design issues. In this paper, we introduce the CADENCE corpus and outline how it can be used to stimulate replicable research on inclusive voice interfaces. The CADENCE corpus is first data set of its kind to include rich data from people with cognitive impairment and free for research use. The corpus consists of transcribed spoken interactions between older people with and without cognitive impairment and a simulated Intelligent Cognitive Assistant and includes comprehensive data on users' cognitive abilities.","title":"The CADENCE Corpus: A New Resource for Inclusive Voice Interface Design","filename":"CHI15/p3963","authors":["Maria K. Wolters","Jonathan Kilgour","Sarah E. MacPherson","Myroslava Dzikovska","Johanna D. Moore"],"conference":"CHI '15"}