{"paperId":2702394,"citation":[],"abstract":"Secondhand fashion is a rapidly growing, lucrative market with both off- and online outlets. Studies of secondhand consumption have focused primarily on people's motivations for secondhand shopping, highlighting sustainability and/or thrift. We extend this work by looking at the motivations and practices of secondhand shoppers who are driven instead by style, playfulness and treasure-hunting. We present findings from ethnographic observation and interviews with 13 secondhand shoppers. Three secondhand shopping orientations emerged. Perfection Seeking involves seeking items that fit with an individual look or personal brand. These items are seen as unique, and demonstrate an alternative to mainstream fashion and consumption. Casual curiosity is less focused, more engaged in browsing, and driven by both secondhand objects and the secondhand experience itself. Digging involves the focused pursuit of hidden \"gems\" or treasures, following the belief that unusual items are waiting to be found. We offer ideas for designing secondhand shopping experiences to support the needs for storytelling, experiential pleasure, and negotiation around durable value.","reference":[{"content":"Ailawadi, K., Neslin, S., Luan, J. and Taylor, G. Does retailer CSR enhance behavioral loyalty? A case for benefit segmentation. International Journal of Research and Marketing, 31, 2 (2013), 156--167.","paperID":"None"},{"content":"Albinsson, P. and Perera, Y. Alternative marketplaces in the 21st century: Building community through sharing events. Jour. of Consumer Behavior, 11 (2012), 303--315.","paperID":"None"},{"content":"Bardhi, F. and Arnould, E. Thrift shopping: Combining utilitarian thrift and hedonic treat benefits. Journal of Consumer Behaviour, 4, 4 (2005), 1572--0817.","paperID":"None"},{"content":"Bosch, L. and Kanis, M. Encouraging sustainable fashion with a playful recycling system. Proc. BCS-HCI 2013, British Computer Society (2013), Article No. 46.","paperID":"None"},{"content":"Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology, 3, 2 (2006), 77--101.","paperID":"None"},{"content":"Cervellon, M., Carey, L. and Harms, T. Something old, something used: Determinants of women's purchase of vintage fashion vs second-hand fashion. International Journal of Retail & Distribution Management, 40, 12 (2012), 956--974.","paperID":"None"},{"content":"Cheal, D. \"Showing them you love them\": Gift giving and the dialectic of intimacy. The Sociological Review, 35, 1 (1987), 150--169.","paperID":"None"},{"content":"deJode, M., Barthel, R., Rogers, J., Karpovich, A., HudsonSmith, A., Quigley, M. and Speed, C. Enhancing the 'second-hand' retail experience with digital object memories. Proc. Ubicomp (2012), 451--460.","paperID":"None"},{"content":"Duffy, K., Hewer, P. and Wilson, J. 'Granny would be proud': On the labours of doing vintage, practices and emergent socialities. Advances in Consumer Research, 40 (2012), 519--525.","paperID":"None"},{"content":"eBay beats expectations with $11B in revenue in 2011. http://venturebeat.com/2012/01/19/ebay-q4-earnings/","paperID":"None"},{"content":"Farnham, S.D. and Churchill, E.F. Faceted identity, faceted lives: Social and technical issues with being yourself online. Proceedings of CSCW (2011), 359--368.","paperID":"None"},{"content":"Gegenbauer, S. and Huang, E. Inspiring the design of longer-loved electronics through an understanding of personal attachment. Proc. DIS (2012), 635--644.","paperID":"None"},{"content":"Gegenbauer, S. and Huang, E. iPods, Ataris, and Polaroids: A personal inventories study of out-of-use electronics in Swiss households. Proc. Ubicomp (2012), 531--534.","paperID":"None"},{"content":"Gregson, N & Crewe, L. Second-hand cultures. Journal of Design History, 18, 2 (2005), 214--216.","paperID":"None"},{"content":"Guiot, D. and Roux, D. A second-hand shoppers' motivation scale: Antecedents, consequences, and implications for retailers. Journal of Retailing, 86, 4 (2010), 389--399.","paperID":"None"},{"content":"Harrison, S. and Dourish, P. Replacing space: The roles of place and space in collaborative systems. Proc. CSCW (1996) 67--76.","paperID":"None"},{"content":"Hiller-Connell, K. Exploring consumers' perceptions of eco-conscious apparel acquisition behaviors. Social Responsibility Journal, 7, 1 (2011), 61--73.","paperID":"None"},{"content":"Huh, J., Nam, K. and Sharma, N. Finding the lost treasure: Understanding reuse of used computing devices. Proc. CHI (2010), 1975--1884.","paperID":"None"},{"content":"Industry Statistics & Trends. http://www.narts.org/i4a/pages/index.cfm?pageid=3285","paperID":"None"},{"content":"Juhlin, O. and Zhang, Unpacking social interaction that make us adore: On the aesthetics of mobile phones as shopping items. Proc. MobileHCI (2011), 241--250.","paperID":"None"},{"content":"Juhlin, O., Zhang, Y., Sundbor, C. and Fernaeus, Y. Fashion shape switching: Explorations in outfit-centric design. Proc. CHI (2013), 1353--1362.","paperID":"None"},{"content":"Jung, H., Barzdell, S., Blevis, E., Pierce, J. & Stolterman, E. (2011). How deep is your love: Deep narratives of ensoulment and heirloom status. Int. J. Design, 5, 1, 59--71.","paperID":"None"},{"content":"McCracken, G.D. Culture and Consumption: New Approaches to the Symbolic Character of Consumer Goods and Activities. Indiana University Press, 1990.","paperID":"None"},{"content":"Milligan, M. Interaction past and potential: The social construction of place attachment. Symbolic Interaction, 21, 1 (1998), 1--33.","paperID":"None"},{"content":"Nobbs, K., McColl, J., Shearer, L., Canning, C. & McBride, L. An exploratory study into the strategic significance of visual merchandising: The case of fashion retailing. In Pedroni, M., Ed., From Production To Consumption. Oxford: Interdisciplinary Press, 2013.","paperID":"None"},{"content":"Odom, W. Personal inventories: toward durable humanproduct relationships. CHI EA (2008), 3777--3782.","paperID":"None"},{"content":"Odom, W., Pierce, J., Stolterman, E. and Blevis, E. Understanding why we preserve some things and discard others in the context of interaction design. Proc. CHI (2009), 1053--1062.","paperID":"None"},{"content":"Pan, Y. and Blevis, E. Fashion thinking: Lessons from fashion and sustainable interaction design, concepts and issues. Proc. DIS (2014), 1105--1014.","paperID":"None"},{"content":"Pierce, J. and Paulos, E. Second-hand interactions: Investigating reacquisition and dispossession practices around domestic objects. Proc. CHI (2011), 2385--2394.","paperID":"None"},{"content":"Portigal, S. Interviewing Users. New York: Rosenfeld Media, 2013.","paperID":"None"},{"content":"Raptis, D., Kjeldskov, J. and Skov, M. Understanding \"cool\" in Human-Computer Interaction research and design. Proc. of CHI (2013), 53--62.","paperID":"None"}],"title":"On Vintage Values: The Experience of Secondhand Fashion Reacquisition","filename":"CHI15/p897","authors":["Anne E. Bowser","Oliver L. Haimson","Edward F. Melcer","Elizabeth F. Churchill"],"conference":"CHI '15"}