{"paperId":2702196,"citation":[],"abstract":"Preventable behaviors contribute to many life threatening health problems. Behavior-change technologies have been deployed to modify these, but such systems typically draw on traditional behavioral theories that overlook affect. We examine the importance of emotion tracking for behavior change. First, we conducted interviews to explore how emotions influence unwanted behaviors. Next, we deployed a system intervention, in which 35 participants logged information for a self-selected, unwanted behavior (e.g., smoking or overeating) over 21 days. 16 participants engaged in standard behavior tracking using a Fact-Focused system to record objective information about goals. 19 participants used an Emotion-Focused system to record emotional consequences of behaviors. Emotion-Focused logging promoted more successful behavior change and analysis of logfiles revealed mechanisms for success: greater engagement of negative affect for unsuccessful days and increased insight were key to motivating change. We present design implications to improve behavior-change technologies with emotion tracking.","reference":[{"content":"Abraham, C., & Sheeran, P. (2003). Acting on intentions: The role of anticipated regret. British Journal of Social Psychology, 42(4), 495--511.","paperID":"None"},{"content":"Adriaanse, M. A., et al. (2011). Planning what not to eat: Ironic effects of implementation intentions negating unhealthy habits. Personality and Social Psychology Bulletin, 37(1), 69--81.","paperID":"None"},{"content":"Ajzen, I. (1991). The theory of planned behavior. Organizational behavior and human decision processes, 50(2), 179--211.","paperID":"None"},{"content":"Bandura, A. (1994). Self-efficacy.Wiley, New York.","paperID":"None"},{"content":"Bandura, A. (2001). Social cognitive theory: An agentic perspective. Annual review of psychology, 52(1), 1--26.","paperID":"None"},{"content":"Baumeister, R. F., et al. (2007). How emotion shapes behavior: Feedback, anticipation, and reflection, rather than direct causation. Personality and Social Psychology Review, 11(2), 167--203.","paperID":"None"},{"content":"Bentley, F., et al. (2013). Health Mashups: Presenting statistical patterns between wellbeing data and context in natural language to promote behavior change. TOCHI, 20(5), 30.","paperID":"None"},{"content":"Bitsmedia (2014) Quit Pro (Version 2.2.1) [Mobile app.] Retrieved from https://itunes.apple.com/us/app/ quit-pro-your-smoking-cessation/id336786774?mt=8","paperID":"None"},{"content":"Burke, L. E., et al. (2011). Self-monitoring in weight loss: a systematic review of the literature. Journal of the American Dietetic Association,111(1), 92--102.","paperID":"None"},{"content":"Carroll, E. A. et al., (2013). Food and Mood: Just-inTime Support for Emotional Eating. In Proceedings of ACII'13. (pp. 252--257). IEEE.","paperID":"None"},{"content":"Carver, C. S., et al. (1994). Behavioral inhibition, behavioral activation, and affective responses to impending reward and punishment: the BIS/BAS scales. Journal of personality and social psychology, 67(2), 319.","paperID":"None"},{"content":"Consolvo, S. et al., (2009). Theory-driven design strategies for technologies that support behavior change in everyday life. In Proceedings of CHI'09.","paperID":"None"},{"content":"Eysenbach, G. (2005). The law of attrition. Journal of medical Internet research, 7(1).","paperID":"None"},{"content":"Gould, R. A., et al. (1993). A meta-analysis of self-help treatment approaches. Clinical psychology review, 13(2), 169--186.","paperID":"None"},{"content":"He, H. A. et al., (2010). One size does not fit all: applying the transtheoretical model to energy feedback technology design. In Proceedings of CHI'10. (pp. 927--936). ACM.","paperID":"None"},{"content":"inSight One, Inc. (2012) Mood Runner (Version 1.03) [Mobile app. software.] Retrieved from https://itunes. apple.com/us/app/mood-runner/id404822869?mt=8","paperID":"None"},{"content":"Isaacs, E., et al. (2013). Echoes from the past: how technology mediated reflection improves well-being. In Proceedings of CHI'13. (pp. 1071--1080). ACM.","paperID":"None"},{"content":"Klasnja, P. et al., (2011). How to evaluate technologies for health behavior change in HCI research. In Proceedings of CHI'11.","paperID":"None"},{"content":"Li, I. (2012). Personal informatics & context: Using context to reveal factors that affect behavior. Journal of Ambient Intelligence and Smart Environments, 4(1), 71--72.","paperID":"None"},{"content":"Locke, E. A., & Latham, G. P. (2002). Building a practically useful theory of goal setting and task motivation: A 35-year odyssey. American psychologist, 57(9), 705.","paperID":"None"},{"content":"Lopez et al., (2006). Global and regional burden of disease and risk factors, 2001: systematic analysis of population health data. The Lancet, 367(9524), 1747--1757.","paperID":"None"},{"content":"Martin, G. L., & Pear, J. (1992). Behavior Modification: What It Is and How To Do It, 9/E.","paperID":"None"},{"content":"McFall, R. M. (1970). Effects of self-monitoring on normal smoking behavior. Journal of Consulting and Clinical Psychology, 35(2), 135.","paperID":"None"},{"content":"Pennebaker, J.W., et al. (2007). The development and psychometric properties of LIWC2007. [Software manual]. Austin, TX (www.liwc.net)","paperID":"None"},{"content":"Perugini, M., & Bagozzi, R. P. (2001). The role of desires and anticipated emotions in goal-directed behaviours: Broadening and deepening the theory of planned behaviour. British Journal of Social Psychology, 40(1), 79--98.","paperID":"None"},{"content":"Powers, T. A., et al. (2005). Implementation intentions, perfectionism, and goal progress: Perhaps the road to hell is paved with good intentions. Personality and Social Psychology Bulletin, 31(7), 902--912.","paperID":"None"},{"content":"Prochaska, J., et al. (1997). The transtheoretical model of health behavior change. Am. J. Health Promot. 12, 1, 38--48.","paperID":"None"},{"content":"Runtastic. (2014) Runtastic (Version 5.3) [Mobile app.] Retrieved from http://itunes.apple.com/us/app/runtastic -gps-running-walking/id336599882?mt=8","paperID":"None"},{"content":"Thriveport (2013) MoodKit (Version 2.2) [Mobile app.] Retrieved from https://itunes.apple.com/us/app/ moodkit-mood-improvement-tools/id427064987?mt=8","paperID":"None"},{"content":"Webb, T., et al. (2010). Using the internet to promote health behavior change: a systematic review and metaanalysis of the impact of theoretical basis, use of behavior change techniques, and mode of delivery on efficacy. Journal of medical Internet research, 12(1), e4.","paperID":"None"}],"title":"Change of Heart: Emotion Tracking to Promote Behavior Change","filename":"CHI15/p2643","authors":["Victoria Hollis","Artie Konrad","Steve Whittaker"],"conference":"CHI '15"}