{"paperId":2702206,"citation":[{"content":"Jessica Tsimeris , Duncan Stevenson , Michael Broughton , Tom Gedeon, Adapting a Soft 2.5D Actuated Shape Display for Rebound Tenderness Simulation and Training, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838750"}],"reference":[{"content":"Alrøe, T. et al., Aerial Tunes: Exploring Interaction Qualities of Mid-air Displays. In Proc. NordiCHI '12. ACM Press (2012), 514--523.","paperID":"None"},{"content":"Benford, S. et al., Uncomfortable Interactions. In Proc. CHI'12. ACM Press (2012), p. 2005--2014.","paperID":"None"},{"content":"Carroll, J. M. (Ed.) (2003). HCI Models, Theories and Frameworks: Toward a Multidisciplinary Science. San Francisco: Morgan Kaufmann publishers.","paperID":"None"},{"content":"Döring, T., Sylvester, A., Schmidt, A. A Design Space for Ephemeral User Interfaces. In Proc. TEI '13, ACM Press (2013). 75--82.","paperID":"None"},{"content":"H. C. Hulst and H. C. van de Hulst, Light Scattering by Small Particles. Dover Publications, 1957.","paperID":"None"},{"content":"Isenberg, C. The Science of Soap Films and Soap Bubbles. Dover Publications, 1978.","paperID":"None"},{"content":"Ishii, H. and Ullmer, B. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proc. CHI'97. ACM Press, 234--241.","paperID":"None"},{"content":"Koleva, B. et al., \"Orchestrating a Mixed Reality Performance,\" In Proc. CHI'01 ACM Press, p. 38--45.","paperID":"None"},{"content":"Martinez P, D., Joyce, E., Subramanian, S. MisTable: Reach-through Personal Screens for Tabletops, In Proc. CHI'14, ACM Press 3493--3502.","paperID":"None"},{"content":"Marshall, J. et al., Breath control of amusement rides. In Proc. CHI'11. ACM Press (2011). 73--82.","paperID":"None"},{"content":"Monk, A. and Gilbert, G. N. Perspectives on HCI: Diverse Approaches. Academic Press, 1995.","paperID":"None"},{"content":"Murer, M., Aslan, I., and Tscheligi, M. LOLLio: exploring taste as playful modality. In Proc. TEI'13, ACM Press (2013) 299--302.","paperID":"None"},{"content":"Nakamura, M. et al. Bubble Cosmos. SIGGRAPH '06 Emerging Technologies. ACM Press (2006).","paperID":"None"},{"content":"Norman, D. 1991. Cognitive artifacts. In Designing interaction, John M. Carroll (Ed.). Cambridge University Press, 17--38.","paperID":"None"},{"content":"Ochiai, Y., Hoshi, A.O.T. & Rekimoto, J. Reflective, deformable, colloidal display. In Post. SIGGRAPH '13. ACM Press (2013). 1.","paperID":"None"},{"content":"Ochiai, Y., Hoshi, T., Oyama, A. and Rekimoto, J., \"Poppable display: A display that enables popping, breaking, and tearing interactions with people,\" Consumer Electronics, IEEE (2013). 124--128.","paperID":"None"},{"content":"Popp, J. Bit.Fall {Installation}. 2004. Various locations.","paperID":"None"},{"content":"Rakkolainen, I. et al. The Interactive FogScreen. In SIGGRAPH '05 Emerging Technologies. ACM (2005).","paperID":"None"},{"content":"Rydarowski, A., Samanci, O. and Mazalek, A. Murmur: kinetic relief sculpture, multi-sensory display, listening machine. In Proc. TEI 2008, ACM (2008), 231--238.","paperID":"None"},{"content":"Sas, C. and Whittaker, S. Design for forgetting. In Proc. CHI'13, ACM Press (2013), p. 1823.","paperID":"None"},{"content":"Seah, S A. et al. SensaBubble: a chrono-sensory mid-air display of sight and smell. In Proc. CHI '14. ACM, 2863--2872.","paperID":"None"},{"content":"Shapiro, L., and Stockman, G. (2002). Computer Vision. Prentice Hall. pp. 69--73","paperID":"None"},{"content":"Shein, E. Ephemeral Data. Commun. ACM Press (2013). 20--22.","paperID":"None"},{"content":"Slater, M. and Wilbur, S. A Framework for Immersive Virtual Environments (FIVE): Speculations on the Role of Presence in Virtual Environments Presence 6: (1997) 603--616.","paperID":"None"},{"content":"Sylvester, A. et al., \"Liquids, Smoke, and Soap Bubbles: Reflections on Materials for Ephemeral User Interfaces\". In Proc. TEI'10, ACM (2010). 269--270.","paperID":"None"},{"content":"Tolmie, P. et al. Unremarkable computing. In Proc. CHI '02, ACM (2002). p. 399--406.","paperID":"None"},{"content":"Uriu, D. and Okude, N. ThanatoFenestra: photographic family altar supporting a ritual to pray for the deceased. In Proc. DIS '10. ACM Press (2010). 422--425.","paperID":"None"},{"content":"Weiser, M. Creating the invisible interface: (invited talk). In Proc. UIST '94. ACM Press (1994). 1--.","paperID":"None"},{"content":"Weiser, M. The computer for the 21st century. SIGMOBILE Mob. Comput. Commun. Rev.3, ACM Press (1999). 3--11.","paperID":"None"},{"content":"Weiser, M., Brown, J.S. The coming age of calm technology. In Beyond calculation, Copernicus, USA 1997. 75--85.","paperID":"None"}],"abstract":"This paper introduces FugaciousFilm, a soap film based touch display, as a platform for Attentive Interaction that encourages the user to be highly focused throughout the use of the interface. Previous work on ephemeral user interfaces has primarily focused on the development of ambient and peripheral displays. In contrast, FugaciousFilm is an ephemeral display that aims to promote highly attentive interaction. We present the iterative process of developing this interface, spanning technical explorations, prototyping and a user study. We report lessons learnt when designing the interface; ranging from the soap film mixture to the impact of frames and apertures. We then describe developing the touch, push, pull and pop interactions. Our user study shows how FugaciousFilm led to focused and attentive interactions during a tournament of enhanced Tic-Tac-Toe. We then finish by discussing how the principles of vulnerability and delicacy can motivate the design of attentive ephemeral interfaces.","title":"FugaciousFilm: Exploring Attentive Interaction with Ephemeral Material","filename":"CHI15/p1285","authors":["Hyosun Kwon","Shashank Jaiswal","Steve Benford","Sue Ann Seah","Peter Bennett","Boriana Koleva","Holger Schnädelbach"],"conference":"CHI '15"}