{"paperId":2702294,"citation":[{"content":"Martin Dittus, Large-scale Volunteer Engagement in Humanitarian Mapping, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2874351"},{"content":"Martin Dittus , Giovanni Quattrone , Licia Capra, Analysing Volunteer Engagement in Humanitarian Mapping: Building Contributor Communities at Large Scale, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819939"},{"content":"Megan Finn , Elisa Oreglia, A Fundamentally Confused Document: Situation Reports and the Work of Producing Humanitarian Information, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820031"}],"reference":[{"content":"Michael S. Bernstein , Greg Little , Robert C. Miller , Björn Hartmann , Mark S. Ackerman , David R. Karger , David Crowell , Katrina Panovich, Soylent: a word processor with a crowd inside, Proceedings of the 23nd annual ACM symposium on User interface software and technology, October 03-06, 2010, New York, New York, USA","paperID":"1866078"},{"content":"Beschastnikh, I., Kriplean, T., McDonald, D. W. Wikipedian Self-Governance in Action: Motivating the Policy Lens. Proc of ICWSM. (2008).","paperID":"None"},{"content":"Matthew J. Bietz , Toni Ferro , Charlotte P. Lee, Sustaining the development of cyberinfrastructure: an organization adapting to change, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145339"},{"content":"Budhathoki, N., Haythornthwaite, C. Motivation for open collaboration crowd and community models and the case of OpenStreetMap. American Behavioral Scientist 54, 5 (2013), 548--575.","paperID":"None"},{"content":"Chilton, S. Crowdsourcing is radically changing the geodata landscape: case study of OpenStreetMap. Proc. of UK Cartographic Conf, (2009).","paperID":"None"},{"content":"Fairhurst, R. OpenStreetMap opens up to more contributors with easy \"add a note\" feature. OSM Foundation Blog. (4/29/13).","paperID":"None"},{"content":"Andrea Forte , Amy Bruckman, Scaling Consensus: Increasing Decentralization in Wikipedia Governance, Proceedings of the Proceedings of the 41st Annual Hawaii International Conference on System Sciences, p.157, January 07-10, 2008","paperID":"1334978"},{"content":"Haklay, M. How good is volunteered geographical information? A comparative study of OpenStreetMap & Ordnance Survey datasets. Environment & Planning B: Planning & Design 34, 4 (2010), 682--703.","paperID":"None"},{"content":"Haklay, M., Antoniou, V., Basiouka, S., R Soden, R., Mooney, P. Crowdsourced Geographic Information Use in Government. World Bank. (2014).","paperID":"None"},{"content":"Halfaker, A., Geiger, R. S., Morgan, J. T., Riedl, J. The rise and decline of an open collaboration system: How Wikipedia's reaction to popularity is causing its decline. American Behavioral Scientist. (2012).","paperID":"None"},{"content":"Brent Hecht , Johannes Schöning , Thomas Erickson , Reid Priedhorsky, Geographic human-computer interaction, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979532"},{"content":"HOT Tasking Manager. Typhoon Haiyan. http://tasks.hotosm.org/job/350.","paperID":"None"},{"content":"Hristova, D., Quattrone, G., Mashhadi, A. J., Capra, L. The Life of the Party: Impact of Social Mapping in OpenStreetMap. Proc of ICWSM (2013).","paperID":"None"},{"content":"Human Rights Watch (HRW). World Report 2011. Seven Stories Press (2011).","paperID":"None"},{"content":"ITO World Blog. January 20, 2010. http://itoworld.blogspot.com/2010/01/mapping-crisisopenstreetmap-response.html.","paperID":"None"},{"content":"Brian Keegan , Darren Gergle , Noshir Contractor, Hot off the wiki: dynamics, practices, and structures in Wikipedia's coverage of the Tōhoku catastrophes, Proceedings of the 7th International Symposium on Wikis and Open Collaboration, October 03-05, 2011, Mountain View, California","paperID":"2038577"},{"content":"Shyong (Tony) K. Lam , Anuradha Uduwage , Zhenhua Dong , Shilad Sen , David R. Musicant , Loren Terveen , John Riedl, WP:clubhouse?: an exploration of Wikipedia's gender imbalance, Proceedings of the 7th International Symposium on Wikis and Open Collaboration, October 03-05, 2011, Mountain View, California","paperID":"2038560"},{"content":"Lave, J., Wenger, E. Situated Learning: Legitimate Peripheral Participation. Cambridge Univ, (1991), 138.","paperID":"None"},{"content":"Yu-Wei Lin, A qualitative enquiry into OpenStreetMap making, The New Review of Hypermedia and Multimedia, v.17 n.1, p.53-71, April 2011","paperID":"1970253"},{"content":"Mileti, D.S. 1999. Disasters by Design: A Reassessment of Natural Hazards in the US. Joseph Henry D.C.","paperID":"None"},{"content":"Mooney, P, & Corcoran, P. How social is OSM. In Proc of AGILE Conf on GIS. 2012. (24--27).","paperID":"None"},{"content":"OpenStreetMap Development. http://pierzen.dev.openstreetmap.org/hot/leaflet/OSMCompare-before-after-philippines.html.","paperID":"None"},{"content":"OSM Foundation. We are Changing the License. (2012).","paperID":"None"},{"content":"Reid Priedhorsky , Benjamin Jordan , Loren Terveen, How a personalized geowiki can help bicyclists share information more effectively, Proceedings of the 2007 international symposium on Wikis, p.93-98, October 21-25, 2007, Montreal, Quebec, Canada","paperID":"1296962"},{"content":"Schmidt, K, & L Bannon. \"Taking CSCW seriously.\" Journal of CSCW, 1.1--2 (1992): 7--40.","paperID":"None"},{"content":"Schmidt, M., Klettner, S. Gender and Experience-Related Motivators for Contributing to OSM. ACTIVITY (2013).","paperID":"None"},{"content":"Simonite, T. The Decline of Wikipedia. MIT Technology Review. October 22, 2013.","paperID":"None"},{"content":"Soden, R., Budhathoki, N., Palen, L. Resilience-Building and the Crisis Informatics Agenda: Lessons Learned from Open Cities Kathmandu. ISCRAM, (2014).","paperID":"None"},{"content":"Soden R., Palen, L. From crowdsourcing to community mapping: the post-earthquake work of OpenStreetMap Haiti. In Proc. of COOP, (2014).","paperID":"None"},{"content":"Kate Starbird , Leysia Palen, \"Voluntweeters\": self-organizing by digital volunteers in times of crisis, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979102"},{"content":"Kate Starbird , Leysia Palen, Working and sustaining the virtual \"Disaster Desk\", Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441832"},{"content":"United Nations Office for Coordination of Humanitarian Affairs (UNOCHA) 2013. https://docs.unocha.org/sites/dms/CAP/SRP_20132014_Philippines_Typhoon_Haiyan.pdf","paperID":"None"},{"content":"USAID Yolanda Factsheet http://www.usaid.gov/haiyan/fy14/fs20","paperID":"None"},{"content":"Joanne I. White , Leysia Palen , Kenneth M. Anderson, Digital mobilization in disaster response: the work & self-organization of on-line pet advocates in response to hurricane sandy, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531633"}],"abstract":"OpenStreetMap (OSM) is a volunteer-driven, globally distributed organization whose members work to create a common digital map of the world. OSM embraces ideals of open data, and to that end innovates both socially and technically to develop practices and processes for coordinated operation. This paper provides a brief history of OSM and then, through quantitative and qualitative examination of the OSM database and other sites of articulation work, examines organizational growth through the lens of two catastrophes that spurred enormous humanitarian relief responses-the 2010 Haiti Earthquake and the 2013 Typhoon Yolanda. The temporally- and geographically- constrained events scope analysis for what is a rapidly maturing, whole-planet operation. The first disaster identified how OSM could support other organizations responding to the event. However, to achieve this, OSM has had to refine mechanisms of collaboration around map creation, which were tested again in Typhoon Yolanda. The transformation of work between these two events yields insights into the organizational development of large, data-producing online organizations.","title":"Success & Scale in a Data-Producing Organization: The Socio-Technical Evolution of OpenStreetMap in Response to Humanitarian Events","filename":"CHI15/p4113","authors":["Leysia Palen","Robert Soden","T. Jennings Anderson","Mario Barrenechea"],"conference":"CHI '15"}