{"paperId":2702499,"abstract":"This paper presents an investigation into musicians' ability to control sound synthesiser parameters using various inter- faces. The principal aim was to compare separate, 1D parameter controls (touchscreen sliders) to multidimensional con- trollers (an XY touchpad for 2D, the Leap Motion for 3D). Subjects had to match a target sound as quickly and accurately as possible. Results show that after about two hours of practice, the XY pad is 9% faster than two sliders for no accuracy loss, and the Leap is 17% faster than 3 sliders with 9% accuracy loss. The multidimensional controllers improved most with practice. A new perspective on Fitts' index of difficulty is presented: \"Index of Search Space Reduction\" (ISSR). ISSR and retrospective accuracy thresholds on the search trajectory are used to obtain straight line plots and throughput values. These plots reveal that the Leap's speed improvement was mainly due to reaction time, but the XY pad traversed the space faster.","citation":[{"content":"Steven Gelineck , Dan Overholt, Haptic and Visual feedback in 3D Audio Mixing Interfaces, Proceedings of the Audio Mostly 2015 on Interaction With Sound, p.1-6, October 07-09, 2015, Thessaloniki, Greece","paperID":"2814918"},{"content":"Nan Zhao , Matthew Aldrich , Christoph F. Reinhart , Joseph A. Paradiso, A Multidimensional Continuous Contextual Lighting Control System Using Google Glass, Proceedings of the 2nd ACM International Conference on Embedded Systems for Energy-Efficient Built Environments, November 04-05, 2015, Seoul, South Korea","paperID":"2821673"}],"reference":[{"content":"Alexander Travis Adams , Berto Gonzalez , Celine Latulipe, SonicExplorer: fluid exploration of audio parameters, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557206"},{"content":"Caramiaux, B., Tahiroğlu, K., Fiebrink, R., and Tanaka, A., Eds. Proceedings of the International Conference on New Interfaces for Musical Expression, Goldsmiths, University of London, UK (2014).","paperID":"None"},{"content":"Stuart K. Card , Allen Newell , Thomas P. Moran, The  Psychology of Human-Computer Interaction, L. Erlbaum Associates Inc., Hillsdale, NJ, 1983","paperID":"578027"},{"content":"Despain, A., and Westervelt, R. High performance human-computer interfaces. Tech. Rep. JSR-96--130, Advanced Research Projects Agency (ARPA), September 1997.","paperID":"None"},{"content":"Heiko Drewes, Only one Fitts' law formula please!, CHI '10 Extended Abstracts on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753867"},{"content":"Ericsson, K. A. The influence of experience and deliberate practice on the development of superior expert performance. The Cambridge handbook of expertise and expert performance (2006), 683--703.","paperID":"None"},{"content":"Fitts, P. M. The information capacity of the human motor system in controlling the amplitude of movement. Journal of experimental psychology 47, 6 (1954), 381.","paperID":"None"},{"content":"George W. Fitzmaurice , William Buxton, An empirical evaluation of graspable user interfaces: towards specialized, space-multiplexed input, Proceedings of the ACM SIGCHI Conference on Human factors in computing systems, p.43-50, March 22-27, 1997, Atlanta, Georgia, USA","paperID":"258578"},{"content":"Garner, W. R. The stimulus in information processing. American Psychologist 25, 4 (1970), 350.","paperID":"None"},{"content":"Tovi Grossman , Ravin Balakrishnan, Pointing at trivariate targets in 3D environments, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.447-454, April 24-29, 2004, Vienna, Austria","paperID":"985749"},{"content":"Hick, W. E. On the rate of gain of information. Quarterly Journal of Experimental Psychology 4, 1 (1952), 11--26.","paperID":"None"},{"content":"Andy Hunt , Marcelo M. Wanderley, Mapping performer parameters to synthesis engines, Organised Sound, v.7 n.2, p.97-108, August 2002","paperID":"972351"},{"content":"Robert J. K. Jacob , Linda E. Sibert , Daniel C. McFarlane , M. Preston Mullen, Jr., Integrality and separability of input devices, ACM Transactions on Computer-Human Interaction (TOCHI), v.1 n.1, p.3-26, March 1994","paperID":"174631"},{"content":"Kemler Nelson, D. G. Processing integral dimensions: The whole view. Journal of Experimental Psychology: Human Perception and Performance 19 (October 1993), 1105--1113.","paperID":"None"},{"content":"I. Scott MacKenzie, Fitts' law as a research and design tool in human-computer interaction, Human-Computer Interaction, v.7 n.1, p.91-139, March 1992","paperID":"1461857"},{"content":"I. Scott MacKenzie , William Buxton, Extending Fitts' law to two-dimensional tasks, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.219-226, May 03-07, 1992, Monterey, California, USA","paperID":"142794"},{"content":"Thor Magnusson , Enrike Hurtado Mendieta, The acoustic, the digital and the body: a survey on musical instruments, Proceedings of the 7th international conference on New interfaces for musical expression, June 06-10, 2007, New York, New York","paperID":"1279757"},{"content":"Murata, A., and Iwase, H. Extending Fitts' law to a three-dimensional pointing task. Human Movement Science 20, 6 (2001), 791--805.","paperID":"None"},{"content":"Bruce W. Pennycook, Computer-music interfaces: a survey, ACM Computing Surveys (CSUR), v.17 n.2, p.267-289, June 1985","paperID":"4470"},{"content":"Ivan Poupyrev , Michael J. Lyons , Sidney Fels , Tina Blaine (Bean), New interfaces for musical expression, CHI '01 Extended Abstracts on Human Factors in Computing Systems, March 31-April 05, 2001, Seattle, Washington","paperID":"634348"},{"content":"Puckette, M. Pure Data: another integrated computer music environment. Proceedings of the Second Intercollege Computer Music Concerts (1996), 37--41.","paperID":"None"},{"content":"Vertegaal, R., and Eaglestone, B. Comparison of input devices in an ISEE direct timbre manipulation task. Interacting with Computers 8, 1 (1996), 13--30.","paperID":"None"},{"content":"Marcelo Mortensen Wanderley , Nicola Orio, Evaluation of Input Devices for Musical Expression: Borrowing Tools from HCI, Computer Music Journal, v.26 n.3, p.62-76, Fall 2002","paperID":"1245202"},{"content":"Weichert, F., Bachmann, D., Rudak, B., and Fisseler, D. Analysis of the accuracy and robustness of the leap motion controller. Sensors 13, 5 (2013), 6380--6393.","paperID":"None"},{"content":"Shumin Zhai, Characterizing computer input with Fitts' law parameters: the information and non-information aspects of pointing, International Journal of Human-Computer Studies, v.61 n.6, p.791-809, December 2004","paperID":"1056156"},{"content":"Shumin Zhai , Paul Milgram, Quantifying coordination in multiple DOF movement and its application to evaluating 6 DOF input devices, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.320-327, April 18-23, 1998, Los Angeles, California, USA","paperID":"274689"}],"title":"An Evaluation of Multidimensional Controllers for Sound Design Tasks","filename":"CHI15/p47","authors":["Robert Tubb","Simon Dixon"],"conference":"CHI '15"}