{"paperId":2702578,"citation":[],"abstract":"Being able to identify colours is a fundamental human activity; colour identification helps us work, get dressed, prepare food, and keep safe. But for the 5% of the world with impaired colour vision (ICV), colour identification is often a challenge, resulting in frustration and confusion with sometimes dangerous consequences. Colour namer tools have been proposed as a solution, however these are often slow to use and imprecise. To address these shortcomings, we developed three new colour identification techniques (ColourNames, ColourMeters, ColourPopper) using a new colour name dictionary based on the largest colour naming experiment to date. We compared our techniques to colour namers using participants with ICV in desktop and mobile conditions, and found that ColourNames and ColourPopper resulted in ~99% colour identification accuracy (10% higher than the colour namer), ColourMeters and ColourPopper were three times faster, and ColourPopper had lower perceived effort and was ranked significantly higher. With the benefits provided by our new colour identification techniques, people with ICV are one step closer to seeing the world like everyone else.","reference":[{"content":"Benavente, R., Vanrell, M., and Baldrich, R. Parametric fuzzy sets for automatic color naming. JOSA A 25, 10 (2008), 2582--2593.","paperID":"None"},{"content":"Berlin, B., and Kay, P. Basic Color Terms: Their Universality and Evolution. UCalifornia Press, 1969.","paperID":"None"},{"content":"Birch, J. Diagnosis of Defective Colour Vision, 2 ed. Oxford University Press, 2001.","paperID":"None"},{"content":"Cole, B. L. The handicap of abnormal colour vision. Clin. & Exp. Opt. 87, 4--5 (July 2004), 258--275.","paperID":"None"},{"content":"Davies, I. R. L., Laws, G., Corbett, G. G., and Jerrett, D. J. Cross-cultural differences in colour vision: Acquired \"colour-blindness\" in africa. Personality and Individual Differences 25, 6 (1998), 1153--1162.","paperID":"None"},{"content":"Eisemann, L. Pantone's Guide to Communicating with Color. Grafix Press, Ltd., 2000.","paperID":"None"},{"content":"Fitzmaurice, G., Khan, A., Pieké, R., Buxton, B., Kurtenbach, G. Tracking menus. In Proc UIST (2003), 71--79.","paperID":"None"},{"content":"Flatla, D. R., and Gutwin, C. SSMRecolor: improving recoloring tools with situation-specific models of color differentiation. In Proc CHI (2012), 2297--2306.","paperID":"None"},{"content":"Hardy, L. H., Rand, G., and Rittler, M. C. HRR polychromatic plates. JOSA 44, 7 (1954), 509--521.","paperID":"None"},{"content":"Hart, S. G., and Staveland, L. E. Development of NASA-TLX (task load index): Results of empirical and theoretical research. Adv. in psych. 52 (1988), 139--183.","paperID":"None"},{"content":"Heer, J., and Stone, M. Color naming models for color selection, image editing and palette design. In Proc CHI (2012), 1007--1016.","paperID":"None"},{"content":"Herbst, M., and Brinkman, B. Color-via-pattern: distinguishing colors of confusion without affecting perceived brightness. In Proc ASSETS (2014), 245--246.","paperID":"None"},{"content":"Hung, P., and Hiramatsu, N. A colour conversion method which allows colourblind and normal-vision people share documents with colour content. Tech. rep., Konica Minolta, 2013.","paperID":"None"},{"content":"Knoblauch, K., Vital-Durand, F., and Barbur, J. L. Variation of chromatic sensitivity across the life span. Vision research 41, 1 (2001), 23--36.","paperID":"None"},{"content":"Lammens, J. M. G. A computational model of color perception and color naming. PhD thesis, State University of New York, 1994.","paperID":"None"},{"content":"Lomax, R. B., Ridgway, P., and Meldrum, M. Does occupational exposure to organic solvents affect colour discrimination? Toxic. Rev. 23, 2 (2004), 91--121.","paperID":"None"},{"content":"Mojsilovic, A. A method for color naming and description of color composition in images. In Proc ICIP, vol. 2 (2002), 789--792.","paperID":"None"},{"content":"Mojsilovic, A. A computational model for color naming and describing color composition of images. Trans. on Image Processing 14, 5 (2005), 690--699.","paperID":"None"},{"content":"Moroney, N. Unconstrained web-based color naming experiment. In Proc Elec. Imag. (2003), 36--46.","paperID":"None"},{"content":"Munsell, A. H. A Color Notation. Munsell color company, 1919.","paperID":"None"},{"content":"Pokorny, J., Smith, V., and Lutze, M. Aging of the human lens. Applied Optics 26, 8 (1987), 1437--1440.","paperID":"None"},{"content":"Regier, T., Kay, P., and Khetarpal, N. Color naming reflects optimal partitions of color space. PNAS 104, 4 (2007), 1436--1441.","paperID":"None"},{"content":"Sajadi, B., Majumder, A., Oliveira, M. M., Schneider, R. G., and Raskar, R. Using patterns to encode color information for dichromats. IEEE Trans. Vis. Comput. Graphics 19, 1 (2013), 118--129.","paperID":"None"},{"content":"Schneck, M. E., and Haegerstrom-Portnoy, G. Color vision defect type and spatial vision in the optic neuritis treatment trial. Investigative ophthalmology & visual science 38, 11 (1997), 2278--2289.","paperID":"None"},{"content":"Steward, J. M., and Cole, B. L. What do color vision defectives day about everyday tasks? Optometry and Vision Science 66, 5 (May 1989), 288--295.","paperID":"None"},{"content":"Stone, M. A Field Guide to Digital Color. AK Peters, 2003.","paperID":"None"},{"content":"Tanuwidjaja, E., Huynh, D., Koa, K., Nguyen, C., Shao, C., Torbett, P., Emmenegger, C., and Weibel, N. Chroma: A wearable augmented-reality solution for color blindness. In Proc UbiComp (2014), 799--810.","paperID":"None"},{"content":"Ware, C. Information Visualization - Perception for Design. Morgan Kaufmann, California, USA, 2000.","paperID":"None"},{"content":"Wyszecki, G., and Stiles, W. Color science: concepts and methods, quantitative data and formulae. Wiley-VCH, 2000.","paperID":"None"},{"content":"Yates, J. T., Diamantopoulos, I., and Daumann, F.-J. Acquired (transient and permanent) colour vision disorders. Operational Colour Vision NATO RTO Technical Report 16 (2001), 43--47.","paperID":"None"}],"title":"ColourID: Improving Colour Identification for People with Impaired Colour Vision","filename":"CHI15/p3543","authors":["David R. Flatla","Alan R. Andrade","Ross D. Teviotdale","Dylan L. Knowles","Craig Stewart"],"conference":"CHI '15"}