{"paperId":2702526,"citation":[{"content":"Carman Neustaedter , Gina Venolia , Jason Procyk , Daniel Hawkins, To Beam or Not to Beam: A Study of Remote Telepresence Attendance at an Academic Conference, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819922"}],"reference":[{"content":"Baudisch, P., Good, N., and Stewart, P. Focus plus context screens. In Proc. UIST'01 (2001), 31--40.","paperID":"None"},{"content":"Chen, J. Y., Haas, E. C., and Barnes, M. J. Human performance issues and user interface design for teleoperated robots. IEEE Trans Syst, Man, Cybern C, Appl Rev 37, 6 (2007), 1231--1245.","paperID":"None"},{"content":"Darken, R. P., Kempster, M. K., and Peterson, B. Effects of streaming video quality of service on spatial comprehension in a reconnaissance task. In Proc. I/ITSEC'01 (2001).","paperID":"None"},{"content":"Darken, R. P., and Peterson, B. Spatial orientation, wayfinding, and representation. In Handbook of Virtual Environment Technology, K. Stanney, Ed. 2002, 493--518.","paperID":"None"},{"content":"DeJong, B. P., Colgate, J. E., and Peshkin, M. A. Improving teleoperation: reducing mental rotations and translations. In Proc. ICRA'04 (2004), 3708--3714.","paperID":"None"},{"content":"Desai, M., Tsui, K. M., Yanco, H. A., and Uhlik, C. Essential features of telepresence robots. In Proc. TePRA'11 (2011), 15--20.","paperID":"None"},{"content":"Double Robotics. Double, 2014 (accessed Sept. 20, 2014). http://www.doublerobotics.com/.","paperID":"None"},{"content":"Draper, J. V., Kaber, D. B., and Usher, J. M. Telepresence. Hum Factors 40, 3 (1998), 354--375.","paperID":"None"},{"content":"Drury, J. L., Scholtz, J., and Yanco, H. A. Awareness in human-robot interactions. In Proc. SMC'03 (2003), 912--918.","paperID":"None"},{"content":"Endsley, M. R. Measurement of situation awareness in dynamic systems. Hum Factors 37, 1 (1995), 65--84.","paperID":"None"},{"content":"Fels, D. I., Waalen, J. K., Zhai, S., and Weiss, P. Telepresence under exceptional circumstances. In Proc. Interact'01 (2001), 617--624.","paperID":"None"},{"content":"Gorawara-Bhat, R., Cook, M. A., and Sachs, G. A. Nonverbal communication in doctor-elderly patient trans. Patient Educ Couns 66, 2 (2007), 223--234.","paperID":"None"},{"content":"Gutwin, C., and Greenberg, S. A descriptive framework of workspace awareness for real-time groupware. CSCW 11, 3--4 (2002), 411--446.","paperID":"None"},{"content":"Hollan, J., and Stornetta, S. Beyond being there. In Proc. CHI'92 (1992), 119--125.","paperID":"None"},{"content":"Howard, I. P. Binocular vision and stereopsis. Oxford University Press, 1995.","paperID":"None"},{"content":"Ishiguro, H., and Trivedi, M. Integrating a perceptual information infrastructure with robotic avatars. In Proc. IROS'99 (1999), 1032--1038.","paperID":"None"},{"content":"Johnson, S., Gibson, M., and Mutlu, B. Handheld or handsfree? Remote collaboration via lightweight head-mounted displays and handheld devices. In Proc. CSCW'15 (2015).","paperID":"None"},{"content":"Jouppi, N. P. First steps towards mutually-immersive mobile telepresence. In Proc. CSCW'02 (2002), 354--363.","paperID":"None"},{"content":"Keyes, B., Casey, R., Yanco, H. A., Maxwell, B. A., and Georgiev, Y. Camera placement and multi-camera fusion for remote robot operation. In Proc. of IEEE Workshop on Safety, Security and Rescue Robotics (2006), 22--24.","paperID":"None"},{"content":"Kraut, R. E., Miller, M. D., and Siegel, J. Collaboration in performance of physical tasks: Effects on outcomes and communication. In Proc. CSCW'96 (1996), 57--66.","paperID":"None"},{"content":"Kress, G., and Almaula, H. Sensorimotor requirements for teleoperation. FMC Corporation, San Diego, CA, Report R-6279 (1988).","paperID":"None"},{"content":"Kristoffersson, A., Eklundh, K. S., and Loutfi, A. Measuring the quality of interaction in mobile robotic telepresence: a pilot's perspective. Int J Soc Robot 5, 1 (2013), 89--101.","paperID":"None"},{"content":"Lee, M. K., and Takayama, L. Now, I have a body: Uses and social norms for mobile remote presence in the workplace. In Proc. CHI'11 (2011), 33--42.","paperID":"None"},{"content":"McGovern, D. E. Experiences in teleoperation of land vehicles. Spatial Displays and Spatial Instruments (1989).","paperID":"None"},{"content":"Meyerson, D., Weick, K. E., and Kramer, R. M. Swift trust and temporary groups. In Trust in organizations: Frontiers of theory and research, vol. 166. 1996, 195.","paperID":"None"},{"content":"Michaud, F., Boissy, P., Labonte, D., Corriveau, H., Grant, A., Lauria, M., Cloutier, R., Roux, M.-A., Iannuzzi, D., and Royer, M.-P. Telepresence robot for home care assistance. In Multidisciplinary Collaboration for Socially Assistive Robotics (2007), 50--55.","paperID":"None"},{"content":"Osaka, N. Speed estimation through restricted visual field during driving in day and night: naso-temporal hemifield differences. In Proc. VIV II (1988).","paperID":"None"},{"content":"Paulos, E., and Canny, J. Delivering real reality to the world wide web via telerobotics. In Proc. ICRA'96, vol. 2 (1996), 1694--1699.","paperID":"None"},{"content":"Rae, I., Mutlu, B., and Takayama, L. Bodies in motion: Mobility, presence, and task awareness in telepresence. In Proc. CHI'13 (2013), 1921--1930.","paperID":"None"},{"content":"Rae, I., Venolia, G., Tang, J., and Molnar, D. A framework for understanding and designing telepresence. In Proc. CSCW'15 (2015).","paperID":"None"},{"content":"Revolve Robotics. Kubi, 2014 (accessed Sept. 20, 2014). http://www.kubi.me/.","paperID":"None"},{"content":"Scholtz, J. C. Human-robot interactions: Creating synergistic cyber forces. Multi-Robot Systems: From Swarms to Intelligent Automata (2002), 177--184.","paperID":"None"},{"content":"Schubert, T., Friedmann, F., and Regenbrecht, H. The experience of presence: Factor analytic insights. Presence 10, 3 (2001), 266--281.","paperID":"None"},{"content":"Scribner, D. R., and Gombash, J. W. The effect of stereoscopic and wide field of view conditions on teleoperator performance. DTIC Document (1998).","paperID":"None"},{"content":"Shiroma, N., Sato, N., Chiu, Y.-h., and Matsuno, F. Study on effective camera images for mobile robot teleoperation. In Proc. RO-MAN'04 (2004), 107--112.","paperID":"None"},{"content":"Smyth, C. C. Indirect vision driving with fixed flat panel displays for near unity, wide, and extended fields of camera view. In Proc. HFES'00 (2000), 541--544.","paperID":"None"},{"content":"Suitable Technologies. Beampro, 2014 (accessed Sept. 20, 2014). https://www.suitabletech.com/beam/.","paperID":"None"},{"content":"Thomas, G., Robinson, W. D., and Dow, S. Improving the visual experience for mobile robotics. In Proc. Seventh Annual Iowa Space Grant (1997), 10--20.","paperID":"None"},{"content":"Thomas, L. C., and Wickens, C. D. Effects of display frames of reference on spatial judgments and change detection. DTIC Document (2000).","paperID":"None"},{"content":"Tittle, J. S., Roesler, A., and Woods, D. D. The remote perception problem. In Proc. HFES'02, vol. 46 (2002), 260--264.","paperID":"None"},{"content":"Tsui, K. M., Desai, M., Yanco, H. A., and Uhlik, C. Exploring use cases for telepresence robots. In Proc. HRI'11 (2011), 11--18.","paperID":"None"},{"content":"Tsui, K. M., and Yanco, H. A. Assistive, rehabilitation, and surgical robots from the perspective of medical and healthcare professionals. In Proc. AAAI Workshop on Human Implications of Human-Robot Interaction (2007).","paperID":"None"},{"content":"Van Erp, J. B., and Padmos, P. Image parameters for driving with indirect viewing systems. Ergonomics 46, 15 (2003), 1471--1499.","paperID":"None"},{"content":"Venolia, G., Tang, J., Cervantes, R., Bly, S., Robertson, G., Lee, B., and Inkpen, K. Embodied social proxy. In Proc. CHI'10 (2010), 1049--1058.","paperID":"None"},{"content":"Voshell, M., Woods, D. D., and Phillips, F. Overcoming the keyhole in human-robot coordination. In Proc. HFES'05 (2005), 442--446.","paperID":"None"},{"content":"Wickens, T. D., and Keppel, G. Design and analysis: a researchers handbook, 2004.","paperID":"None"},{"content":"Witmer, B. G., and Sadowski, W. J. Nonvisually guided locomotion to a previously viewed target in real and virtual environments. Hum Factors 40, 3 (1998), 478--488.","paperID":"None"},{"content":"Woods, D. D., Tittle, J., Feil, M., and Roesler, A. Envisioning human-robot coordination in future operations. IEEE Trans Syst, Man, Cybern C, Appl Rev 34, 2 (2004), 210--218.","paperID":"None"},{"content":"Yanco, H. A., and Drury, J. \"Where am I?\" acquiring situation awareness using a remote robot platform. In Proc. SMC'04 (2004), 2835--2840.","paperID":"None"}],"abstract":"Robotic telepresence systems-videoconferencing systems that allow a remote user to drive around in another location-are an emerging technology for supporting geographically-distributed teams. Thus far, many of these systems rely on affordances designed for stationary systems, such as a single, narrow-view camera to provide vision for the remote user. Teleoperation has offered some solutions to this via an augmented field-of-view, but how these solutions support task outcomes in collaborative mobile telepresence tasks has yet to be understood. To investigate this, we conducted a three condition (field-of-view: narrow (45°) vs. wide-angle (180°) vs. panoramic (360°)) between-participants controlled laboratory experiment. We asked participants (N=24) to collaborate with a confederate via a robotic telepresence system while using one of these views in a redecoration task. Our results showed that wider views supported task efficiency and fewer collisions, but were perceived as more difficult to use.","video":"http://www.youtube.com/embed/mh2QnFopvqw?rel=0","title":"Can You See Me Now?: How Field of View Affects Collaboration in Robotic Telepresence","filename":"CHI15/p2397","authors":["Steven Johnson","Irene Rae","Bilge Mutlu","Leila Takayama"],"conference":"CHI '15"}