{"paperId":2702322,"citation":[{"content":"Ryan Heartfield , George Loukas, A Taxonomy of Attacks and a Survey of Defence Mechanisms for Semantic Social Engineering Attacks, ACM Computing Surveys (CSUR), v.48 n.3, p.1-39, February 2016","paperID":"2835375"},{"content":"Ajaya Neupane , Md. Lutfor Rahman , Nitesh Saxena , Leanne Hirshfield, A Multi-Modal Neuro-Physiological Study of Phishing Detection and Malware Warnings, Proceedings of the 22nd ACM SIGSAC Conference on Computer and Communications Security, October 12-16, 2015, Denver, Colorado, USA","paperID":"2813660"}],"reference":[{"content":"Devdatta Akhawe , Adrienne Porter Felt, Alice in warningland: a large-scale field study of browser security warning effectiveness, Proceedings of the 22nd USENIX conference on Security, August 14-16, 2013, Washington, D.C.","paperID":"2534789"},{"content":"Bravo-Lillo, C., Cranor, L., Komanduri, S., Schechter, S., and Sleeper, M. Harder to ignore? Revisiting pop-up fatigue and approaches to prevent it. In Proc. SOUPS 2014, USENIX Association (2014), 105--111.","paperID":"None"},{"content":"Cristian Bravo-Lillo , Lorrie Faith Cranor , Julie Downs , Saranga Komanduri , Manya Sleeper, Improving computer security dialogs, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042286"},{"content":"Cristian Bravo-Lillo , Saranga Komanduri , Lorrie Faith Cranor , Robert W. Reeder , Manya Sleeper , Julie Downs , Stuart Schechter, Your attention please: designing security-decision UIs to make genuine risks harder to ignore, Proceedings of the Ninth Symposium on Usable Privacy and Security, July 24-26, 2013, Newcastle, United Kingdom","paperID":"2501610"},{"content":"José Carlos Brustoloni , Ricardo Villamarín-Salomón, Improving security decisions with polymorphic and audited dialogs, Proceedings of the 3rd symposium on Usable privacy and security, July 18-20, 2007, Pittsburgh, Pennsylvania, USA","paperID":"1280691"},{"content":"Buckner, R.L., Andrews-Hanna, J.R., and Schacter, D.L. The brain's default network. Ann. N. Y. Acad. Sci. 1124, 1 (2008), 1--38.","paperID":"None"},{"content":"Buschman, T.J. and Miller, E.K. Top-down versus bottom-up control of attention in the prefrontal and posterior parietal cortices. Science 315, 5820 (2007), 1860--1862.","paperID":"None"},{"content":"Robert W. Cox, AFNI: software for analysis and visualization of functional magnetic resonance neuroimages, Computers and Biomedical Research, v.29 n.3, p.162-173, June 1996","paperID":"230831"},{"content":"Desimone, R. Neural mechanisms for visual memory and their role in attention. Proc. Natl. Acad. Sci. 93, 24 (1996), 13494--13499.","paperID":"None"},{"content":"Angelika Dimoka, How to conduct a functional magnetic resonance (fMRI) study in social science research, MIS Quarterly, v.36 n.3, p.811-840, September 2012","paperID":"2481664"},{"content":"Angelika Dimoka , Rajiv D. Banker , Izak Benbasat , Fred D. Davis , Alan R. Dennis , David Gefen , Alok Gupta , Anja Ischebeck , Peter H. Kenning , Paul A. Pavlou , Gernot Müller-Putz , René Riedl , Jan Vom Brocke , Bernd Weber, On the use of neurophysiological tools in is research: developing a research agenda for neurois, MIS Quarterly, v.36 n.3, p.679-702, September 2012","paperID":"2481657"},{"content":"Freeman, J.B. and Ambady, N. Mousetracker: Software for studying real-time mental processing using a computer mouse-tracking method. Behav. Res. Methods 42, 1 (2010), 226--241.","paperID":"None"},{"content":"Grill-Spector, K., Henson, R., and Martin, A. Repetition and the brain: Neural models of stimulus-specific effects. Trends Cogn. Sci. 10, 1 (2006), 14--23.","paperID":"None"},{"content":"Qi Guo , Eugene Agichtein, Towards predicting web searcher gaze position from mouse movements, CHI '10 Extended Abstracts on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1754025"},{"content":"Cormac Herley, So long, and no thanks for the externalities: the rational rejection of security advice by users, Proceedings of the 2009 workshop on New security paradigms workshop, September 08-11, 2009, Oxford, United Kingdom","paperID":"1719050"},{"content":"Kalsher, M. and Williams, K. Behavioral compliance: Theory, methodology, and result. In Handbook of warnings Lawrence Erlbaum Associates, Mahwah NJ (2006), 313--331, 2006.","paperID":"None"},{"content":"Kandel, E.R. The molecular biology of memory storage: A dialogue between genes and synapses. Science 294, 5544 (2001), 1030--1038.","paperID":"None"},{"content":"Lueschow, A., Miller, E.K., and Desimone, R. Inferior temporal mechanisms for invariant object recognition. Cereb. Cortex 4, 5 (1994), 523--531.","paperID":"None"},{"content":"Naresh K. Malhotra , Sung S. Kim , James Agarwal, Internet Users' Information Privacy Concerns (IUIPC): The Construct, the Scale, and a Causal Model, Information Systems Research, v.15 n.4, p.336-355, December 2004","paperID":"1045839"},{"content":"Brad S. Minnery , Michael S. Fine, FEATURENeuroscience and the future of human-computer interaction, interactions, v.16 n.2, March + April 2009","paperID":"1487649"},{"content":"Motley, S.E. and Kirwan, C.B. A parametric investigation of pattern separation processes in the medial temporal lobe. J. Neurosci. 32, 38 (2012), 13076--13084.","paperID":"None"},{"content":"Stuart E. Schechter , Rachna Dhamija , Andy Ozment , Ian Fischer, The Emperor's New Security Indicators, Proceedings of the 2007 IEEE Symposium on Security and Privacy, p.51-65, May 20-23, 2007","paperID":"1264196"},{"content":"Joshua Sunshine , Serge Egelman , Hazim Almuhimedi , Neha Atri , Lorrie Faith Cranor, Crying wolf: an empirical study of SSL warning effectiveness, Proceedings of the 18th conference on USENIX security symposium, p.399-416, August 10-14, 2009, Montreal, Canada","paperID":"1855793"},{"content":"Talairach, J. and Tournoux, P. Co-planar stereotaxic atlas of the human brain: 3-dimensional proportional system: An approach to cerebral imaging. Thieme, Stuttgart, 1988.","paperID":"None"},{"content":"Vance, A., Anderson, B.B., Kirwan, C.B., and Eargle, D. Using measures of risk perception to predict information security behavior: Insights from electroencephalography (EEG). J. Assoc. Inf. Syst. 15, 10 (2014), 679--722.","paperID":"None"},{"content":"Vuilleumier, P., Henson, R., Driver, J., and Dolan, R. Multiple levels of visual object constancy revealed by event-related fMRI of repetition priming. Nat. Neurosci. 5, 5 (2002), 491--499.","paperID":"None"},{"content":"Wogalter, M.S. Communication-human information processing (C-HIP) model. In Handbook of warnings, M.S. WOGALTER Ed. Lawrence Erlbaum Associates, Mahwah, NJ (2006), 51--61, 2006.","paperID":"None"}],"abstract":"Research on security warnings consistently points to habituation as a key reason why users ignore security warnings. However, because habituation as a mental state is difficult to observe, previous research has examined habituation indirectly by observing its influence on security behaviors. This study addresses this gap by using functional magnetic resonance imaging (fMRI) to open the \"black box\" of the brain to observe habituation as it develops in response to security warnings. Our results show a dramatic drop in the visual processing centers of the brain after only the second exposure to a warning, with further decreases with subsequent exposures. To combat the problem of habituation, we designed a polymorphic warning that changes its appearance. We show in two separate experiments using fMRI and mouse cursor tracking that our polymorphic warning is substantially more resistant to habituation than conventional warnings. Together, our neurophysiological findings illustrate the considerable influence of human biology on users' habituation to security warnings.","title":"How Polymorphic Warnings Reduce Habituation in the Brain: Insights from an fMRI Study","filename":"CHI15/p2883","authors":["Bonnie Brinton Anderson","C. Brock Kirwan","Jeffrey L. Jenkins","David Eargle","Seth Howard","Anthony Vance"],"conference":"CHI '15"}