{"paperId":2702574,"citation":[{"content":"Martin Porcheron, Reflecting on the Study of Mobile Collocated Interactions: The Changing Face of Wearable Devices, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, August 24-27, 2015, Copenhagen, Denmark","paperID":"2794345"},{"content":"Martin Porcheron , Joel E. Fischer , Sarah Sharples, Using Mobile Phones in Pub Talk, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820014"}],"abstract":"A home away from home, the pub is synonymous with good conversation. Yet, the art of conversation in pubs is changing with the ubiquity of mobile phones. We present a qualitative study spanning over three years describing experiences and rhetoric surrounding the relationship that mobiles have and should have with our conversation in the pub. We found that mobile phones are able to enhance conversation but can also cause a disruption to the informal and adhoc nature of pubs. The use of Facebook on mobile phones has also changed pubs from what Oldenburg terms a third space to a space that is potentially being surveilled. We suggest future designs should not necessarily discourage or encourage mobile use in pubs, but rather provoke us into reflecting on how intertwined modern conversation is with mobile technology in the context of the pub space.","video":"http://www.youtube.com/embed/m9-vTvfRil4?rel=0","reference":[{"content":"Abbott, L. News on Digital Advertising, Online Marketing, Social Media & Trends from EigthyTwenty » Facebook Users in Ireland by County, Dec. 2013. http://www.eightytwenty.ie/blog/facebook-users-in-ireland-by-county/","paperID":"None"},{"content":"2. Ames, M. G. Managing Mobile Multitasking: The Culture of iPhones on Stanford Campus. In Proc. of CSCW'13, ACM (New York, 2013), 1487--1498.","paperID":"None"},{"content":"3. Banjo, O., Hu, Y., and Sundar, S. Cell Phone Usage and Social Interaction with Proximate Others: Ringing in a Theoretical Model. Open Communication Journal 2 (2008), 127--135.","paperID":"None"},{"content":"4. Benford, S., Tolmie, P., Ahmed, A. Y., Crabtree, A., and Rodden, T. Supporting Traditional Music-Making: Designing for Situated Discretion. In Proc. of CSCW'12, ACM (New York, 2012), 127--136.","paperID":"None"},{"content":"5. Bowcott, O. 'Boozer Bus' to Save Irish Pubs. The Guardian (Jan. 2007).","paperID":"None"},{"content":"6. Campbell, S. W. Perceptions of Mobile Phone use in Public Settings: A Cross-Cultural Comparison. International Journal of Communication 1, 1 (Nov. 2007), 20.","paperID":"None"},{"content":"7. Campbell, S. W., and Park, Y. J. Social Implications of Mobile Telephony: The Rise of Personal Communication Society. Sociology Compass 2, 2 (Mar. 2008), 371--387.","paperID":"None"},{"content":"8. Chesley, N. Blurring Boundaries? Linking Technology use, Spillover, Individual Distress, and Family Satisfaction. Journal of Marriage and Family 67, 5 (Dec. 2005), 1237--1248.","paperID":"None"},{"content":"9. Church, K., Cousin, A., and Oliver, N. I Wanted to Settle a Bet!: Understanding Why and How People Use Mobile Search in Social Settings. In Proc. of MobileHCI'12, ACM (New York, 2012), 393--402.","paperID":"None"},{"content":"10. Church, K., and Oliver, N. Understanding Mobile Web and Mobile Search Use in Today's Dynamic Mobile Landscape. In Proc. of MobileHCI '11, ACM (New York, 2011), 67--76.","paperID":"None"},{"content":"11. Connolly, R. E. The Rise and Fall of the Irish Pub. The Liffey Press, Dublin, Nov. 2010.","paperID":"None"},{"content":"12. Dalsgaard, P., and Hansen, L. K. Performing Perception-Staging Aesthetics of Interaction. ACM TOCHI 15, 3 (2008), 1--33.","paperID":"None"},{"content":"13. Davenport, F., Nevez, C. L., Quintero, J., Berkmoes, R. V., and Wilson, N. Lonely Planet Ireland, 11th ed. Lonely Planet, Melbourne, Australia, Apr. 2014.","paperID":"None"},{"content":"14. Fortunati, L. The mobile phone: Towards new categories and social relations. Information, Communication & Society 5, 4 (2002), 513--528.","paperID":"None"},{"content":"15. Geser, H. Towards a sociological theory of the mobile phone. In E-Merging Media: Communication and the Media Economy of the Future, A. Zerdick, A. Picot, K. Schrape, J.-C. Burgelman, and R. Silverstone, Eds. Springer-Verlag, Berlin, 2005, 235--260.","paperID":"None"},{"content":"16. Geser, H. Is the Cell Phone Undermining the Social Order?: Understanding mobile technology from a sociological perspective. Knowledge, Technology & Policy 19, 1 (2006), 8--18.","paperID":"None"},{"content":"17. Grantham, B. Craic in a box: Commodifying and exporting the Irish pub. Continuum: Journal of Media & Cultural Studies 23, 2 (Apr. 2009), 257--267.","paperID":"None"},{"content":"18. Habuchi, I. Accelerating Reflexivity. In Personal, Portable, Pedestrian: Mobile Phones in Japanese Life, M. Ito, D. Okabe, and M. Matsuda, Eds. MIT Press, Cambridge, MA, 2005, 165--182.","paperID":"None"},{"content":"19. Harmon, E., and Mazmanian, M. Stories of the Smartphone in Everyday Discourse: Conflict, Tension & Instability. In Proc. of CHI'13, ACM (New York, 2013), 1051--1060.","paperID":"None"},{"content":"20. Harrison, S., and Dourish, P. Re-Place-ing Space: The Roles of Place and Space in Collaborative Systems. In Proc. of CSCW'96, ACM (New York, 1996), 67--76.","paperID":"None"},{"content":"21. Kearns, Kevin C. Dublin Pub Life and Lore: An Oral History. Gill and Macmillan, Dublin, 1996.","paperID":"None"},{"content":"22. Ling, R. \" One Can Talk about Common Manners!\": The Use of Mobile Telephones in Inappropriate Situations. Telenor, 1996.","paperID":"None"},{"content":"23. Ling, R. The social juxtaposition of mobile telephone conversations and public spaces. In Conference on the Social Consequence of Mobile Telephones (Chunchon, Korea, July 2002).","paperID":"None"},{"content":"24. Ling, R., and Yttri, B. Hyper-coordination via mobile phones in Norway. In Perpetual Contact: Mobile Communication, Private Talk, Public Performance, J. E. Katz and M. Aakhus, Eds. Cambridge University Press, Cambridge, United Kingdom, 2002, 139--169.","paperID":"None"},{"content":"25. McGovern, M. 'The Cracked Pint Glass of the Servant': The Irish Pub, Irish Identity and the Tourist Eye. In Irish Tourism: Image, Culture and Identity, M. Cronin, B. O'Connor, and M. Robinson, Eds., no. 1 in Tourism and Cultural Change. Channel View Publications, Clevedon, United Kingdom, 2003, 83--103.","paperID":"None"},{"content":"26. Monk, A., Carroll, J., Parker, S., and Blythe, M. Why are mobile phones annoying? Behaviour & Information Technology 23, 1 (2004), 33--41.","paperID":"None"},{"content":"27. Oldenburg, R. The Great Good Place: Cafes, Coffee Shops, Bookstores, Bars, Hair Salons, and Other Hangouts at the Heart of a Community, 3rd ed. Marlowe & Company, New York, Aug. 1999.","paperID":"None"},{"content":"28. Oldenburg, R., and Brissett, D. The Third Place. Qualitative Sociology 5, 4 (Dec. 1982), 265--284.","paperID":"None"},{"content":"29. Oulasvirta, A., Tamminen, S., Roto, V., and Kuorelahti, J. Interaction in 4-Second Bursts: The Fragmented Nature of Attentional Resources in Mobile HCI. In Proc. of CHI'05, ACM (New York, 2005), 919--928.","paperID":"None"},{"content":"30. Palen, L., Salzman, M., and Youngs, E. Going Wireless: Behavior & Practice of New Mobile Phone Users. In Proc. of CSCW'00, ACM (New York, 2000), 201--210.","paperID":"None"},{"content":"31. Phillips, N., and Hardy, C. Discourse Analysis: Investigating Processes of Social Construction, 2nd ed. Sage Publications, Thousand Oaks, CA, 2002.","paperID":"None"},{"content":"32. Robles, E., Sukumaran, A., Rickertsen, K., and Nass, C. Being Watched or Being Special: How I Learned to Stop Worrying and Love Being Monitored, Surveilled, and Assessed. In Proc. of CHI'06, ACM (New York, 2006), 831--839.","paperID":"None"},{"content":"33. Schiano, D., Elliott, A., and Bellotti, V. A Look at Tokyo Youth at Leisure: Towards the Design of New Media to Support Leisure Outings. CSCW 16, 1 (Apr. 2007), 45--73.","paperID":"None"},{"content":"34. Share, P. A Genuine 'Third Place'? Towards an Understanding of the Pub in Contemporary Irish society. In Proc. of the SAI Annual Conference. (2003).","paperID":"None"},{"content":"35. Sohn, T., Li, K. A., Griswold, W. G., and Hollan, J. D. A Diary Study of Mobile Information Needs. In Proc. of CHI'08, ACM (New York, 2008), 433--442.","paperID":"None"},{"content":"36. Srivastava, L. Mobile phones and the evolution of social behaviour. Behaviour & Information Technology 24, 2 (2005), 111--129.","paperID":"None"},{"content":"37. Stelmaszewska, H., Fields, B., and Blandford, A. The Roles of Time, Place, Value and Relationships in Collocated Photo Sharing with Camera Phones. In Proc. of BCS-HCI'08, British Computer Society (Swinton, United Kingdom, 2008), 141--150.","paperID":"None"},{"content":"38. Su, N. M. The Social Life of Tunes: Representing the Aesthetics of Reception. In Proc. of ECSCW'13, Springer (London, 2013), 207--228.","paperID":"None"},{"content":"39. Sutter, N., and Holtgraves, T. Perceptions of public mobile phone conversations and conversationalists. Telematics and Informatics 30, 2 (May 2013), 158--164.","paperID":"None"},{"content":"40. Wei, R., and Leung, L. Blurring public and private behaviors in public space: policy challenges in the use and improper use of the cell phone. Telematics and Informatics 16, 1-2 (Feb. 1999), 11--26.","paperID":"None"},{"content":"41. Wei, R., and Lo, V.-H. Staying connected while on the move: Cell phone use and social connectedness. New Media & Society 8, 1 (Feb. 2006), 53--72.","paperID":"None"}],"title":"From Third to Surveilled Place: The Mobile in Irish Pubs","filename":"CHI15/p1659","authors":["Norman Makoto Su","Lulu Wang"],"conference":"CHI '15"}