{"paperId":2702533,"citation":[],"abstract":"Mobile Instant Messaging (MIM) apps such as WhatsApp are heralding new communication behaviors amongst students in peri-urban India. From an ethnographic study of a co-ed engineering college, we describe and analyze the role of WhatsApp in both engendering and balancing the ripples caused by cross gender communication. Through in-depth interviews and immersive participant observations in both physical as well as digital spaces, we show how WhatsApp emerges as the backbone of student interactions in a gender segregated academic environment. In analyzing social conditions and identifying structural features of WhatsApp that led to its bottoms up appropriation, our study presents possibilities for educators and designers aiming to create technology enabled collaborative spaces between people otherwise hemmed in by social norms from reaching out to one another.","reference":[{"content":"Abraham, L. Bhai-behen, true love, time pass, friendships and sexual partnerships among youth in an Indian metropolis. In An International Journal for Research, Intervention and Care, (2001). 337--353.","paperID":"None"},{"content":"Morgan G. Ames, Managing mobile multitasking: the culture of iPhones on stanford campus, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441945"},{"content":"Chanana, K. Hinduism and female sexuality: social control and education of girls in India. In Sociological Bulletin, 50, (2001), 37--63.","paperID":"None"},{"content":"Karen Church , Rodrigo de Oliveira, What's up with whatsapp?: comparing mobile instant messaging behaviors with traditional SMS, Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services, August 27-30, 2013, Munich, Germany","paperID":"2493225"},{"content":"Das, V. (1998). Femininity and the orientation to the body. In Socialization, Education and Women, Chanana, K, Ed. Orient Longman (1988), 193--207.","paperID":"None"},{"content":"De Certeau, M. (1984) The Practice of Everyday Life, Berkeley: University of California Press.","paperID":"None"},{"content":"Dube, L. Women and Kinship: Comparative Perspectiveson Gender in South and South-East Asia, United Nations University Press, (1988).","paperID":"None"},{"content":"Rebecca E. Grinter , Leysia Palen, Instant messaging in teen life, Proceedings of the 2002 ACM conference on Computer supported cooperative work, November 16-20, 2002, New Orleans, Louisiana, USA","paperID":"587082"},{"content":"Rebecca Grinter , Margery Eldridge, Wan2tlk?: everyday text messaging, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642688"},{"content":"http://whatsapp.com"},{"content":"Ito, M. Mobile phones, Japanese youth, and the replacement of social contact. In Ling, R. and Pederson, P. (eds) In Mobile Communication and Renegotiation of the Public Sphere. Springer (2005), 131--148.","paperID":"None"},{"content":"Nisbett, N. Friendship, consumption, morality: practising identity, negotiating hierarchy in middle-class Bangalore. In Journal of the Royal Anthropological Institute, 13, (2007) 935--950","paperID":"None"},{"content":"Kenton P. O'Hara , Michael Massimi , Richard Harper , Simon Rubens , Jessica Morris, Everyday dwelling with WhatsApp, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531679"},{"content":"Osella, C & Osella, F. Friendship and Flirting: MicroPolitics in Kerala, South India Author(s): The Journal of the Royal Anthropological Institute, 4, 2 (1998), 189--206","paperID":"None"},{"content":"Rangaswamy, N and Cutrell, E. 'Re-Sourceful Networks: Notes from a Mobile Social Networking Platform in India', Pacific Affairs, Fall, 2012","paperID":"None"},{"content":"Rogers, M. Modernity, 'authenticity', and ambivalence: subaltern masculinities on a South Indian college campus. Journal of the Royal Anthropological Institute 14, 79--95. (2008).","paperID":"None"},{"content":"Strauss, A. and Corbin, J. Basics of qualitative research: Techniques and procedures for developing grounded theory. Thousand Oaks, CA: Sage Publications, 1998.","paperID":"None"},{"content":"Alex S. Taylor , Richard Harper, Age-old practices in the 'new world': a study of gift-giving between teenage mobile phone users, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 20-25, 2002, Minneapolis, Minnesota, USA","paperID":"503455"},{"content":"Marion Walton , Gary Marsden , Silke Haßreiter , Sena Allen, Degrees of sharing: proximate media sharing and messaging by young people in khayelitsha, Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services, September 21-24, 2012, San Francisco, California, USA","paperID":"2371636"}],"title":"Offline Strangers, Online Friends: Bridging Classroom Gender Segregation with WhatsApp","filename":"CHI15/p3799","authors":["Preeti Mudliar","Nimmi Rangaswamy"],"conference":"CHI '15"}