{"paperId":2702428,"citation":[],"reference":[{"content":"Allan, L. The perception of time. Perception & Psychophysics 26, 5 (1979), 340--354.","paperID":"None"},{"content":"Allan, L. G. The influence of the scalar timing model on human timing research. Behavioural Processes 44, 2 (1998), 101--117.","paperID":"None"},{"content":"Allon, G., and Bassamboo, A. The impact of delaying the delay announcements. Operations research 59, 5 (2011), 1198--1210.","paperID":"None"},{"content":"Allon, G., Bassamboo, A., and Gurvich, I. \"We will be right with you\": Managing customer expectations with vague promises and cheap talk. Operations research 59, 6 (2011), 1382--1394.","paperID":"None"},{"content":"Armony, M., Shimkin, N., and Whitt, W. The impact of delay announcements in many-server queues with abandonment. Operations Research 57, 1 (2009), 66--81.","paperID":"None"},{"content":"Bland, J. M., and Altman, D. G. The logrank test. BMJ 328, 7447 (2004), 1073.","paperID":"None"},{"content":"Block, F., and Gellersen, H. The impact of cognitive load on the perception of time. In Proc. of the 6th Nordic Conference on Human-Computer Interaction, NordiCHI '10 (2010).","paperID":"None"},{"content":"Block, R. Prospective and retrospective duration judgment: The role of information processing and memory. In Time, Action and Cognition, vol. 66. Springer, 1992, 141--152.","paperID":"None"},{"content":"Block, R., and Zakay, D. Prospective and retrospective duration judgments: A meta-analytic review. Psychonomic Bulletin & Review (1997), 184--197.","paperID":"None"},{"content":"Block, R. A. Cognitive models of psychological time. Psychology Press, 2014.","paperID":"None"},{"content":"Block, R. A., Hancock, P. A., and Zakay, D. How cognitive load affects duration judgments: A meta-analytic review. Acta Psychologica (2010).","paperID":"None"},{"content":"Bouch, A., Kuchinsky, A., and Bhatti, N. Quality is in the eye of the beholder: Meeting users' requirements for internet quality of service. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, CHI '00 (2000).","paperID":"None"},{"content":"Branaghan, R. J., and Sanchez, C. A. Feedback preferences and impressions of waiting. Human Factors: The Journal of the Human Factors and Ergonomics Society 51, 4 (2009), 528--538.","paperID":"None"},{"content":"Church, R. M., and Broadbent, H. A. Alternative representations of time, number, and rate. Cognition 37, 12 (1990), 55--81. Special Issue Animal Cognition.","paperID":"None"},{"content":"Feigin, P. D. Analysis of customer patience in a bank call center. Tech. rep., The Technion, Haifa, Israel, 2006.","paperID":"None"},{"content":"Fröhlich, P. Dealing with system response times in interactive speech applications. In CHI '05 Extended Abstracts on Human Factors in Computing Systems, CHI EA '05 (2005).","paperID":"None"},{"content":"Gaonac'h, D., and Larigauderie, P. Mémoire et fonctionnement cognitif: la mémoire de travail. Armand Colin, 2000.","paperID":"None"},{"content":"Grondin, S. Timing and time perception: a review of recent behavioral and neuroscience findings and theoretical directions. Attention, Perception, & Psychophysics 72, 3 (2010), 561--582.","paperID":"None"},{"content":"Harrison, C., Amento, B., Kuznetsov, S., and Bell, R. Rethinking the progress bar. In Proc. of the 20th Annual ACM Symposium on User Interface Software and Technology, UIST '07 (2007).","paperID":"None"},{"content":"Harrison, C., Yeo, Z., and Hudson, S. E. Faster progress bars: Manipulating perceived duration with visual augmentations. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, CHI '10 (2010).","paperID":"None"},{"content":"Hart, S. G., and Staveland, L. E. Development of nasa-tlx (task load index): Results of empirical and theoretical research. In Human Mental Workload, Advances in Psychology. North-Holland, 1988.","paperID":"None"},{"content":"Hurter, C., Cowan, B. R., Girouard, A., and Riche, N. H. Active Progress Bar: Aiding the Switch to Temporary Activities. In Proc. of the 26th Annual BCS Interaction Specialist Group Conference on People and Computers, British Computer Society (2012), 99--108.","paperID":"None"},{"content":"Jin, Z., Lin, D., Wei, L., and Ying, Z. Rank-based inference for the accelerated failure time model. Biometrika 90, 2 (2003), 341--353.","paperID":"None"},{"content":"Jouini, O., Akin, Z., and Dallery, Y. Call centers with delay information: Models and insights. Manufacturing & Service Operations Management (2011), 534--548.","paperID":"None"},{"content":"Kleinbaum, D. G., and Klein, M. Survival analysis. Springer, 1996.","paperID":"None"},{"content":"Kortum, P., Peres, S. C., and Stallmann, K. Extensible auditory progress bar design: Performance and aesthetics. Int'l Journal of Human-Computer Interaction 27, 9 (2011), 864--884.","paperID":"None"},{"content":"Lallemand, C., and Gronier, G. Enhancing User eXperience During Waiting Time in HCI: Contributions of Cognitive Psychology. In Proc. of the Designing Interactive Systems Conference, DIS '12 (2012).","paperID":"None"},{"content":"Lejeune, H. Switching or gating? the attentional challenge in cognitive models of psychological time. Behavioural Processes 44, 2 (1998), 127--145.","paperID":"None"},{"content":"Munichor, N., and Rafaeli, A. Numbers or apologies? customer reactions to telephone waiting time fillers. Journal of Applied Psychology 92, 2 (2007), 511.","paperID":"None"},{"content":"Myers, B. A. The importance of percent-done progress indicators for computer-human interfaces. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, CHI '85 (1985).","paperID":"None"},{"content":"Nah, F. F.-H. A study on tolerable waiting time: how long are web users willing to wait? Behaviour & Information Technology 23, 3 (2004), 153--163.","paperID":"None"},{"content":"Nielsen, J. Usability Engineering. Morgan Kaufmann Publishers Inc., 1993.","paperID":"None"},{"content":"Niida, S., Uemura, S., Nakamura, H., and Harada, E. Field study of a waiting-time filler delivery system. In Proc. of the 13th Int'l Conference on Human Computer Interaction with Mobile Devices and Services, ACM (2011), 177--180.","paperID":"None"},{"content":"Peres, S., Kortum, P., and Stallmann, K. Auditory progress bars: Preference, performance and aesthetics. In Proc. of the International Conference on Auditory Display (ICAD2007) (2007).","paperID":"None"},{"content":"Peto, R., and Peto, J. Asymptotically efficient rank invariant test procedures. Journal of the Royal Statistical Society. Series A (General) (1972), 185--207.","paperID":"None"},{"content":"Sauro, J., and Lewis, J. R. Average task times in usability tests: What to report? In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, CHI '10, ACM (2010), 2347--2350.","paperID":"None"},{"content":"Scapin, D. L., and Bastien, J. C. Ergonomic criteria for evaluating the ergonomic quality of interactive systems. Behaviour & Information technology (1997), 220--231.","paperID":"None"},{"content":"Treisman, M. Temporal discrimination and the indifference interval: Implications for a model of the \"internal clock\". Psychological Monographs: General and Applied 77, 13 (1963), 1.","paperID":"None"},{"content":"Zakay, D. Gating or switching? gating is a better model of prospective timing (a response to switching or gating? by lejeune). Behavioural Processes 50, 1 (2000), 1--7.","paperID":"None"},{"content":"Zakay, D. Attention and duration judgment. Psychologie Bulletin Francaise 50 (2005), 65--79.","paperID":"None"},{"content":"Zakay, D., and Block, R. A. Temporal cognition. Current Directions in Psychological Science (1997), 12--16.","paperID":"None"},{"content":"Zijlstra, F. R. H. Efficiency in Work Behaviour: A Design Approach for Modern Tools. Delft University Press, 1993.","paperID":"None"}],"abstract":"Waiting for the completion of a system process is an everyday experience. While waiting, system provides feedback to the user about ongoing process through temporal metaphors (Progress bar, Busy icons, etc.). One of the key performance requirement for temporal metaphors is to retain the user till the process completes. Researchers have evaluated these metaphors through subjective means, and objective assessment has not been well explored. In this paper, we present survival analysis as objective assessment method to evaluate temporal metaphors. Through a field experiment, we demonstrate the application of survival analysis and empirically establish that auditory progress bar (temporal metaphor for audio interfaces) works for callers of a distress helpline. To the best of our knowledge, it is the first study on distress callers. The paper further discusses the applicability of survival analysis for evaluating temporal metaphors and wait time experiments for other applications, tasks, and settings.","title":"Survival Analysis: Objective assessment of Wait Time in HCI","filename":"CHI15/p367","authors":["Siddhartha Asthana","Pushpendra Singh","Parul Gupta"],"conference":"CHI '15"}