{"paperId":2702266,"abstract":"We know very little about the use of computers by children under the age of three. While few children in that age range used computers before the advent of smartphones and tablets, these devices have made computers much more accessible to infants and toddlers. In this paper, we provide a window into how these children are using tablets through an analysis of relevant YouTube videos. A majority of children aged 12 to 17 months in the videos in our dataset showed at least moderate ability to use the tablets. For children aged two, it was over 90 percent who displayed at least moderate ability. Our analysis also includes trends in interaction styles, child and device positioning, social aspects, and app genres. These findings point both to opportunities for research and starting points for design.","citation":[{"content":"Svetlana Yarosh , Elizabeth Bonsignore , Sarah McRoberts , Tamara Peyton, YouthTube: Youth Video Authorship on YouTube and Vine, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819961"},{"content":"Alexis Hiniker , Kiley Sobel , Sungsoo (Ray) Hong , Hyewon Suh , India Irish , Julie A. Kientz, Hidden symbols, International Journal of Human-Computer Studies, v.90 n.C, p.53-67, June 2016","paperID":"2928262"}],"reference":[{"content":"Alliance for Childhood. (2001). Fool's Gold: A Critical Look at Computers in Childhood. Retrieved from http://www.allianceforchildhood.org/publications","paperID":"None"},{"content":"American Academy of Pediatrics. (n.d.). Media and Children. Retrieved September 15, 2014, from http://www.aap.org/en-us/advocacy-and-policy/aap-health-initiatives/Pages/Media-and-Children.aspx","paperID":"None"},{"content":"Anthony, L., Kim, Y., & Findlater, L. (2013). Analyzing user-generated youtube videos to understand touchscreen use by people with motor impairments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. pp. 1223--1232. Retrieved from http://dl.acm.org/citation.cfm?id=2466158","paperID":"None"},{"content":"Bavelier, D., Green, C. S., & Dye, M. W. G. (2010). Children, Wired: For Better and for Worse. Neuron, 67(5), 692--701.","paperID":"None"},{"content":"Castles, A., McLean, G. M., Bavin, E., Bretherton, L., Carlin, J., Prior, M., Reilly, S. (2013). Computer use and letter knowledge in pre-school children: A population-based study. Journal of Paediatrics and Child Health, 49(3), pp. 193--198. doi:10.1111/jpc.12126","paperID":"None"},{"content":"CDC. (n.d.). Milestone Moments. Retrieved from http://www.cdc.gov/ncbddd/actearly/pdf/parents_pdfs/milestonemomentseng508.pdf","paperID":"None"},{"content":"Fish, A. M., Li, X., McCarrick, K., Butler, S. T., Stanton, B., Brumitt, G., Partridge, T. (2008). Early Childhood Computer Experience and Cognitive Development among Urban Low-Income Preschoolers. Journal of Educational Computing Research, 38(1), pp. 97--113.","paperID":"None"},{"content":"Hernandez, A. (2014). Toddlers and Tablets: Emerging Apps Take Cues from Learning Science. Education Next, 14(1). Retrieved from http://www.questia.com/library/journal/1G1--352376588/toddlers-and-tablets-emerging-apps-take-cues-from#/","paperID":"None"},{"content":"Hourcade, J. P. (2008). Interaction Design and Children. Foundations and Trends in Human-Computer Interaction, 1(4), 277--392. doi:10.1561/1100000006","paperID":"None"},{"content":"Hourcade, J. P., Bederson, B. B., Druin, A., & Guimbretière, F. (2004). Differences in Pointing Task Performance Between Preschool Children and Adults Using Mice. ACM Trans. Comput.-Hum. Interact., 11(4), 357--386. doi:1145/1035575.1035577","paperID":"None"},{"content":"1Hourcade, J. P., Crowther, M., & Hunt, L. (2007). Does Mouse Size Affect Study and Evaluation Results?: A Study Comparing Preschool Children's Performance with Small and Regular-sized Mice. In Proceedings of the 6th International Conference on Interaction Design and Children (pp. 109--116). New York, NY, USA: ACM. doi:10.1145/1297277.1297300","paperID":"None"},{"content":"Hourcade, J. P., Perry, K. B., & Sharma, A. (2008). PointAssist: Helping Four Year Olds Point with Ease. In Proceedings of the 7th International Conference on Interaction Design and Children (pp. 202--209). New York, NY, USA: ACM. doi:10.1145/1463689.1463757","paperID":"None"},{"content":"Johnston M.V., Nishimura A., Harum K., Pekar J., and Blue ME. (2001). Sculpting the developing brain. Advances in Pediatrics, 48, 1--38.","paperID":"None"},{"content":"Kottner, J., Audige, L., Brorson, S., Donner, A., Gajewski, B. J., Hróbjartsson, A., & Streiner, D. L. (2011). Guidelines for reporting reliability and agreement studies (GRRAS) were proposed. International journal of nursing studies, 48(6), 661--671.","paperID":"None"},{"content":"Lieberman, D. A., Bates, C. H., & So, J. (2009). Young Children's Learning With Digital Media. Computers in the Schools, 26(4), 271--283. doi:10.1080/07380560903360194","paperID":"None"},{"content":"Lieberman, D. A., Fisk, M. C., & Biely, E. (2009). Digital Games for Young Children Ages Three to Six: From Research to Design. Computers in the Schools, 26(4), 299--313. doi:10.1080/07380560903360178","paperID":"None"},{"content":"Linebarger, D. L., & Walker, D. (2005). Infants' and Toddlers' Television Viewing and Language Outcomes. American Behavioral Scientist, 48(5), pp. 624--645. doi:10.1177/0002764204271505","paperID":"None"},{"content":"Li, X., & Atkins, M. S. (2004). Early Childhood Computer Experience and Cognitive and Motor Development. Pediatrics, 113(6), 1715--1722.","paperID":"None"},{"content":"Li, X., Atkins, M. S., & Stanton, B. (2006). Effects of Home and School Computer Use on School Readiness and Cognitive Development Among Head Start Children: A Randomized Controlled Pilot Trial. Merrill-Palmer Quarterly, 52(2), 239--263.","paperID":"None"},{"content":"McCarrick, K., & Li, X. (2007). Buried Treasure: The Impact of Computer Use on Young Children's Social, Cognitive, Language Development and Motivation. Association for the Advancement of Computing in Education (AACE) Journal, 15(1), 73--95.","paperID":"None"},{"content":"McCarrick, K., Li, X., Fish, A., Holtrop, T., Bhavnagri, N. P., Stanton, B., Partridge, T. (2007). Parental Involvement in Young Children's Computer Use and Cognitive Development. NHSA Dialog, 10(2), 67--82. doi:10.1080/15240750701436410","paperID":"None"},{"content":"2Plowman, L., McPake, J., & Stephen, C. (2008). Just picking it up? Young children learning with technology at home. Cambridge Journal of Education, 38(3), 303--319. doi:10.1080/03057640802287564","paperID":"None"},{"content":"Plowman, L., & Stephen, C. (2005). Children, play, and computers in pre-school education. British Journal of Educational Technology, 36(2), 145--157.","paperID":"None"},{"content":"Plowman, L., Stevenson, O., Stephen, C., & McPake, J. (2012). Preschool children's learning with technology at home. Computers & Education, 59(1), pp. 30--37. doi:http://dx.doi.org/10.1016/j.compedu.2011.11.014","paperID":"None"},{"content":"Raffle, H., Ballagas, R., Revelle, G., Horii, H., Follmer, S., Go, J., Spasojevic, M. (2010). Family Story Play: Reading with Young Children (and Elmo) over a Distance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 1583--1592). New York, NY, USA: ACM. doi:10.1145/1753326.1753563","paperID":"None"},{"content":"Raffle, H., Revelle, G., Mori, K., Ballagas, R., Buza, K., Horii, H., Spasojevic, M. (2011). Hello, is Grandma There? Let's Read! StoryVisit: Family Video Chat and Connected e-Books. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 1195--1204). New York, NY, USA: ACM. doi:10.1145/1978942.1979121","paperID":"None"},{"content":"Revelle, G. L., & Strommen, E. F. (1990). The Effects of Practice and Input Device Used on Young Children's Computer Control. Collegiate Microcomput., 8(4), 33--41.","paperID":"None"},{"content":"Schmidt, M. E., Rich, M., Rifas-Shiman, S. L., Oken, E., & Taveras, E. M. (2009). Television Viewing in Infancy and Child Cognition at 3 Years of Age in a US Cohort. Pediatrics, 123(3), e370--e375. doi:10.1542/peds.2008--3221","paperID":"None"},{"content":"Strommen, E. F., Revelle, G. L., Medoff, L. M., & Razavi, S. (1996). Slow and steady wins the race? Three-year-old children and pointing device use. Behaviour & Information Technology, 15(1), 57--64. doi:10.1080/014492996120409","paperID":"None"},{"content":"Sweetser, P., Johnson, D. M., Ozdowska, A., & Wyeth, P. (2012). Active versus passive screen time for young children | QUT ePrints. Australasian Journal of Early Childhood, 37(4), pp. 94--98.","paperID":"None"},{"content":"3Thelen, E., & Bates, E. (2003). Connectionism and dynamic systems: are they really different? Developmental Science, 6(4), 378--391. doi:10.1111/1467--7687.00294","paperID":"None"},{"content":"3Zimmerman, F. J., Christakis, D. A., & Meltzoff, A. N. (2007). Associations between Media Viewing and Language Development in Children Under Age 2 Years. The Journal of Pediatrics, 151(4), 364--368. doi:http://dx.doi.org/10.1016/j.jpeds.2007.04.071","paperID":"None"}],"title":"Look, My Baby Is Using an iPad! An Analysis of YouTube Videos of Infants and Toddlers Using Tablets","filename":"CHI15/p1915","authors":["Juan Pablo Hourcade","Sarah L. Mascher","David Wu","Luiza Pantoja"],"conference":"CHI '15"}