{"paperId":2702342,"citation":[],"abstract":"The purpose of this study is to address the use of movement assessment sensors for clinical diagnosis and treatment. Eleven patients with Parkinson's disease who had under-gone deep brain stimulation (DBS) surgery were observed during follow-up appointments for adjustments to the stimulation settings. We examine the ways in which the patients and clinicians assess movement ability together in the clinic and how these assessments relate to the treatment of functional disability through DBS. We have found that effective assessment of movement and treatment efficacy is a collaborative and interpretive process (co-interpretation) that relies on input from patients, clinicians, and caregivers. From these findings we describe the design directions for movement sensors to support co-interpretation of movement in a clinical context as opposed to simply movement definition.","reference":[{"content":"Alač, M. (2008). Working with brain scans: Digital images and gestural interaction in fMRI laboratory. Social Studies of Science, 38(4), 483--508.","paperID":"None"},{"content":"Baston, C., Mancini, M., Schoneburg, B., Horak, F., & Rocchi, L. (2014). Postural strategies assessed with inertial sensors in healthy and parkinsonian subjects. Gait & posture, 40(1), 70--5.","paperID":"None"},{"content":"Bonato, P., Sherrill, D. M., Standaert, D. G., Salles, S. S. & Akay, M. (2004). Data mining techniques to detect motor fluctuations in Parkinson's disease. Proc. Conf. IEEE Eng. Med. Biol. Soc., 7, 4766--9.","paperID":"None"},{"content":"Brown, R.G., MacCarthy, B., Jahanshahi, M., Marsden, C.D. (1989). Accuracy of self-reported disability in patients with Parkinsonism. Arch Neurol., 46, 955--9.","paperID":"None"},{"content":"Yunan Chen, Health information use in chronic care cycles, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958898"},{"content":"Sally A. Coovert , Adam Ducey , Mark Grichanik , Michael D. Coovert , Robert Nelson, Hey doc, is that your stethoscope?: increasing engagement in medical education and training with iPads, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion, February 11-15, 2012, Seattle, Washington, USA","paperID":"2141545"},{"content":"El-Gohary, M., Pearson, S., Mcnames, J., Mancini, M., Horak, F., Mellone, S., and Chiari. L. (2014). Continuous Monitoring of Turning in Patients with Movement Disability. Sensors, 14(1), 356--69.","paperID":"None"},{"content":"Jeana Frost , Brian Smith, Visualizing health practice to treat diabetes, CHI '02 Extended Abstracts on Human Factors in Computing Systems, April 20-25, 2002, Minneapolis, Minnesota, USA","paperID":"506506"},{"content":"Gabel M., Renshaw E., Schuster A., & Gilad-Bachrach R. (2012). Full Body Gait Analysis with Kinect. Annual International Conference of the IEEE Engineering in Medicine and Biology Society.","paperID":"None"},{"content":"Ghika, J., Wiegner, A. W., Fang, J. J., Davies, L. , Young, R. R. & Growdon, J. H. (1993). Portable system for quantifying motor abnormalities in Parkinson's disease. IEEE Trans. Biomed. Eng., 40(3), 276--83.","paperID":"None"},{"content":"Andrea Grimes , Brian M. Landry , Rebecca E. Grinter, Characteristics of shared health reflections in a local community, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718992"},{"content":"Hasegawa, H., Samuel, M., Douiri, A., Ashkan, K. (2014). Patients' Expectations in Subthalamic Nucleus Deep Brain Stimulation Surgery for Parkinson Disease. World Federation of Neurosurgical Societies.","paperID":"None"},{"content":"Heath, C., Hindmarsh, J., & Luff, P. (2010). Video in qualitative research. Sage Publications.","paperID":"None"},{"content":"Higginson IJ, Astin P., Dolan S. (1998). Where do cancer patients die? Ten-year trends in the place of death of cancer patients in England. Pall. Med., 12, 353--63.","paperID":"None"},{"content":"Hirschauer, S. (1991). The manufacture of bodies in surgery. Social Studies of Science, 21(2), 279--319.","paperID":"None"},{"content":"Hoff, J.I., van den Plas, A.A., Wagemans, E.A., & van Hilten, J.J. (2001). Accelerometric assessment of levodopa-induced dyskinesias in Parkinson's disease. Move. Dis., 16, 58--61.","paperID":"None"},{"content":"Horak, F. B., & Mancini, M. (2013). Objective biomarkers of balance and gait for Parkinson's disease using body-worn sensors. Move. Dis., 28(11), 1544--51.","paperID":"None"},{"content":"Joyce, K. (2005). Appealing images: Magnetic resonance imaging and the production of authoritative knowledge. Social Studies of Science, 35(3), 437--462.","paperID":"None"},{"content":"Kaplan, B. (1995). Objectification and negotiation in interpreting clinical images: Implications for computerbased patient records. Art. Intell. in Med., 7, 439--54.","paperID":"None"},{"content":"Keijsers, N. L., Horstink, M.W. & Gielen, S. C. (2006). Ambulatory motor assessment in Parkinson's disease. Move. Dis., 21, 34--44.","paperID":"None"},{"content":"Keijsers, N.L., Horstink, M.W., van Hilten, J.J., Hoff, J.I. & Gielen, C.C. (2000). Detection and assessment of the severity of levodopa-induced dyskinesia in patients with Parkinson's disease by neural networks. Move. Dis., 15, 1104--11.","paperID":"None"},{"content":"Kim, J.W., Lee, J.H., Kwon, Y., Kim, C.S., Eom, G.M., Koh, S.B., & Park, K.W. (2010). Quantification of bradykinesia during clinical finger taps using a gyrosensor in patient's with Parkinson's disease. Med. & Bio. Engin. & Comp., 49, 365--71.","paperID":"None"},{"content":"Leslie S. Liu , Sen H. Hirano , Monica Tentori , Karen G. Cheng , Sheba George , Sun Young Park , Gillian R. Hayes, Improving communication and social support for caregivers of high-risk infants through mobile technologies, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958897"},{"content":"Mamykina, L., & Mynatt, E. (2009). Interpreting Health and Wellness Information. Symonds, J. et al. (eds.) Auto-identification and Ubiquitous Computing Applications, Idea Group Inc.","paperID":"None"},{"content":"Jennifer Mankoff , Gillian R. Hayes , Devva Kasnitz, Disability studies as a source of critical inquiry for the field of assistive technology, Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility, October 25-27, 2010, Orlando, Florida, USA","paperID":"1878807"},{"content":"Meekosha, H., & Shuttleworth, R. (2009). What's so'critical'about critical disability studies?. Australian Journal of Human Rights, 15(1), 47.","paperID":"None"},{"content":"Helena M. Mentis , Alex S. Taylor, Imaging the body: embodied vision in minimally invasive surgery, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466197"},{"content":"Mol, A. (2002). The body multiple: Ontology in medical practice. Duke University Press.","paperID":"None"},{"content":"Morrow, C. D., Smentkowski, K., Schwartz, S., Armstrong, M. J., Gruber-Baldini, A. L., Anderson, K. E., ... & Shulman, L. M. (2014). Does spouse participation influence quality of life reporting in patients with Parkinson's disease? Quality of Life Research, 1--5.","paperID":"None"},{"content":"Pareés, I., Saifee, T.A., Kassavetis, P., Kojovic, M., Rubio-Agusti, I., Rothwell, J.C., & Edwards, M.J. (2012). Believing is perceiving: Mismatch between selfreport and actigraphy in psychogenic tremor. Brain, 135(1), 117--23.","paperID":"None"},{"content":"Shyamal Patel , Konrad Lorincz , Richard Hughes , Nancy Huggins , John Growdon , David Standaert , Metin Akay , Jennifer Dy , Matt Welsh , Paolo Bonato, Monitoring motor fluctuations in patients with Parkinson's disease using wearable sensors, IEEE Transactions on Information Technology in Biomedicine, v.13 n.6, p.864-873, November 2009","paperID":"1721260"},{"content":"Patrick, S.K., Denington, A.A., Gauthier, M.J.A., Gillard, D.M., and Prochazka, A. (2001). Quantification of the UPDRS rigidity scale. IEEE Trans. on Neural Systems and Rehabilitation Engineering, 9(1), 31--41.","paperID":"None"},{"content":"Prasad, A. (2005). Making images/making bodies: Visibilizing and disciplining through magnetic resonance imaging. Science, Technology & Human Values, 30(2), 291--316.","paperID":"None"},{"content":"Wanda Pratt , Kenton Unruh , Andrea Civan , Meredith M. Skeels, Personal health information management, Communications of the ACM, v.49 n.1, January 2006","paperID":"1107490"},{"content":"Shulman, L. M., Gruber-Baldini, A. L., Anderson, K. E., Vaughan, C. G., Reich, S. G., Fishman, P. S., & Weiner, W. J. (2008). The evolution of disability in Parkinson disease. Movement Disorders, 23(6), 790--796.","paperID":"None"},{"content":"Spieker, S., Jentgens, C., Boose, A. & Dichgans, J. (1995). Reliability, specificity and sensitivity of longterm tremor recordings. Electroencephalography & Clinical Neurophysiology, 97, 326--331.","paperID":"None"},{"content":"Storni, C. (2009). The politics of design in Sociotechnical dispositif. Reconciling Healthcare toward a future patient-centric perspective. Proc. of Interact.","paperID":"None"},{"content":"Thielgen, T., Foerster, F., Fuchs, G., Hornig, A., & Fahrenberg, J. (2004). Tremor in Parkinson's disease: 24-hr monitoring with calibrated accelerometry. Electromyography and Clinical Neurophysiology, 44, 137--146.","paperID":"None"},{"content":"Weiss, A., Herman, T., Giladi, N., & Hausdorff, J. M. (2014). Objective Assessment of Fall Risk in Parkinson's Disease Using a Body-Fixed Sensor Worn for 3 Days. PloS one, 9(5), e96675.","paperID":"None"},{"content":"Weiss, A., Herman, T., Plotnik, M., Brozgol, M., Maidan, I., Giladi, N., ... & Hausdorff, J. M. (2010). Can an accelerometer enhance the utility of the Timed Up & Go Test when evaluating patients with Parkinson's disease?. Medical engineering & physics, 32(2), pp. 119--125.","paperID":"None"}],"title":"Being Seen: Co-Interpreting Parkinson's Patient's Movement Ability in Deep Brain Stimulation Programming","filename":"CHI15/p511","authors":["Helena M. Mentis","Rita Shewbridge","Sharon Powell","Paul Fishman","Lisa Shulman"],"conference":"CHI '15"}