{"paperId":2702489,"citation":[{"content":"Roberto González-Ibáñez , Carlos Barrera-Pulgar , José Luis Varela-Otárola, Evaluating Touch-Based Interactions in an Image Search Task, Proceedings of the 2016 ACM on Conference on Human Information Interaction and Retrieval, March 13-17, 2016, Carrboro, North Carolina, USA","paperID":"2854999"},{"content":"Salvatore Andolina , Khalil Klouche , Diogo Cabral , Tuukka Ruotsalo , Giulio Jacucci, InspirationWall: Supporting Idea Generation Through Automatic Information Exploration, Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition, June 22-25, 2015, Glasgow, United Kingdom","paperID":"2757252"},{"content":"Patrick Cheong-Iao Pang , Karin Verspoor , Jon Pearce , Shanton Chang, Better Health Explorer: Designing for Health Information Seekers, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838772"}],"reference":[{"content":"Ahlberg, C., and Shneiderman, B. Visual information seeking: Tight coupling of dynamic query filters with starfield displays. In Proc. CHI, ACM (New York, NY, USA, 1994), 313--317.","paperID":"None"},{"content":"Ahn, J., and Brusilovsky, P. Adaptive visualization for exploratory information retrieval. Information Processing & Management 49, 5 (2013), 1139--1164.","paperID":"None"},{"content":"Ahn, J.-w., and Brusilovsky, P. Adaptive visualization of search results: Bringing user models to visual analytics. Information Visualization 8, 3 (2009), 167--179.","paperID":"None"},{"content":"Andolina, S., Klouche, K., Peltonen, J., Hoque, M., Ruotsalo, T., Cabral, D., Klami, A., Głowacka, D., Floréen, P., and Jacucci, G. Intentstreams: smart parallel search streams for branching exploratory search. In Proc. IUI, ACM (2015).","paperID":"None"},{"content":"Athukorala, K., Oulasvirta, A., Głowacka, D., Vreeken, J., and Jacucci, G. Narrow or broad?: Estimating subjective specificity in exploratory search. In Proc. CIKM, ACM (New York, NY, USA, 2014), 819--828.","paperID":"None"},{"content":"Brooke, J. Sus-a quick and dirty usability scale. Usability evaluation in industry 189 (1996), 194.","paperID":"None"},{"content":"Capra, R., Marchionini, G., Oh, J. S., Stutzman, F., and Zhang, Y. Effects of structure and interaction style on distinct search tasks. In Proc. JCDL, ACM (2007), 442--451.","paperID":"None"},{"content":"Chau, D. H., Kittur, A., Hong, J. I., and Faloutsos, C. Apolo: Making sense of large network data by combining rich user interaction and machine learning. In Proc. CHI, ACM, ACM (New York, NY, USA, 2011), 167--176.","paperID":"None"},{"content":"Coutrix, C., Kuikkaniemi, K., Kurvinen, E., Jacucci, G., Avdouevski, I., and Mäkelä, R. Fizzyvis: designing for playful information browsing on a multitouch public display. In Proc. DPPI, ACM (2011), 27.","paperID":"None"},{"content":"Esenther, A., and Ryall, K. Fluid dtmouse: Better mouse support for touch-based interactions. In Proc. AVI, ACM (New York, NY, USA, 2006), 112--115.","paperID":"None"},{"content":"Głowacka, D., Ruotsalo, T., Konyushkova, K., Athukorala, K., Jacucci, G., and Kaski, S. Directing exploratory search: Reinforcement learning from user interactions with keywords. In Proc. IUI, ACM (New York, NY, USA, 2013), 117--128.","paperID":"None"},{"content":"Havre, S., Hetzler, E., Perrine, K., Jurrus, E., and Miller, N. Interactive visualization of multiple query results. In Proc. InfoVis, IEEE Computer Society (Washington, DC, USA, 2001), 105.","paperID":"None"},{"content":"Hinrichs, U., Schmidt, H., and Carpendale, S. Emdialog: Bringing information visualization into the museum. Visualization and Computer Graphics, IEEE Transactions on 14, 6 (2008), 1181--1188.","paperID":"None"},{"content":"Jacucci, G., Morrison, A., Richard, G. T., Kleimola, J., Peltonen, P., Parisi, L., and Laitinen, T. Worlds of information: designing for engagement at a public multi-touch display. In Proc. CHI, ACM (2010), 2267--2276.","paperID":"None"},{"content":"Jeh, G., and Widom, J. Scaling personalized web search. In Proc. WWW, ACM (New York, NY, USA, 2003), 271--279.","paperID":"None"},{"content":"Jones, M., Buchanan, G., Harper, R., and Xech, P.-L. Questions not answers: A novel mobile search technique. In Proc. CHI, ACM (New York, NY, USA, 2007), 155--158.","paperID":"None"},{"content":"Käki, M. Findex: Search result categories help users when document ranking fails. In Proc. CHI, ACM (New York, NY, USA, 2005), 131--140.","paperID":"None"},{"content":"Karlson, A. K., Robertson, G. G., Robbins, D. C., Czerwinski, M. P., and Smith, G. R. Fathumb: A facet-based interface for mobile search. In Proc. CHI, ACM (New York, NY, USA, 2006), 711--720.","paperID":"None"},{"content":"Kules, W., Wilson, M. L., Schraefel, M. C., and Shneiderman, B. From keyword search to exploration: How result visualization aids discovery on the web. Tech. rep., University of Southampton, 2008.","paperID":"None"},{"content":"Li, Y. Gesture search: a tool for fast mobile data access. In Proc. UIST, ACM (2010), 87--96.","paperID":"None"},{"content":"Manning, C. D., Raghavan, P., and Schütze, H. Introduction to information retrieval, vol. 1. Cambridge university press Cambridge, 2008.","paperID":"None"},{"content":"Marchionini, G. Exploratory search: from finding to understanding. Commun. ACM 49, 4 (Apr. 2006), 41--46.","paperID":"None"},{"content":"Matejka, J., Grossman, T., and Fitzmaurice, G. Citeology: Visualizing paper genealogy. In CHI '12 Extended Abstracts on Human Factors in Computing Systems, ACM (New York, NY, USA, 2012), 181--190.","paperID":"None"},{"content":"Morris, M. R., Fisher, D., and Wigdor, D. Search on surfaces: Exploring the potential of interactive tabletops for collaborative search tasks. Information processing & management 46, 6 (2010), 703--717.","paperID":"None"},{"content":"Morris, M. R., Lombardo, J., and Wigdor, D. Wesearch: supporting collaborative search and sensemaking on a tabletop display. In Proc. CSCW, ACM (2010), 401--410.","paperID":"None"},{"content":"O'Brien, H. L., and Toms, E. G. Examining the generalizability of the user engagement scale (ues) in exploratory search. Information Processing & Management 49, 5 (2013), 1092--1107.","paperID":"None"},{"content":"Ruotsalo, T., and Hyvönen, E. Exploiting semantic annotations for domain-specific entity search. In Proc. ECIR, Springer (2015).","paperID":"None"},{"content":"Ruotsalo, T., Jacucci, G., Myllymäki, P., and Kaski, S. Interactive intent modeling: Information discovery beyond search. Communications of the ACM 58, 1 (Jan. 2015), 86--92.","paperID":"None"},{"content":"Ruotsalo, T., Peltonen, J., Eugster, M., Głowacka, D., Konyushkova, K., Athukorala, K., Kosunen, I., Reijonen, A., Myllymäki, P., Jacucci, G., et al. Directing exploratory search with interactive intent modeling. In Proc. CIKM, ACM (2013), 1759--1764.","paperID":"None"},{"content":"Sadler, E. B. Project blacklight: a next generation library catalog at a first generation university. Library Hi Tech 27, 1 (2009), 57--67.","paperID":"None"},{"content":"Stasko, J., Görg, C., and Liu, Z. Jigsaw: supporting investigative analysis through interactive visualization. Information visualization 7, 2 (2008), 118--132.","paperID":"None"},{"content":"Terveen, L., Hill, W., and Amento, B. Constructing, organizing, and visualizing collections of topically related web resources. ACM Transactions on Computer-Human Interaction 6, 1 (1999), 67--94.","paperID":"None"},{"content":"Thudt, A., Hinrichs, U., and Carpendale, S. The bohemian bookshelf: supporting serendipitous book discoveries through information visualization. In Proc. CHI, ACM (2012), 1461--1470.","paperID":"None"},{"content":"Varcholik, P. D., LaViola, J. J., and Hughes, C. E. Establishing a baseline for text entry for a multi-touch virtual keyboard. Int. J. of Human-Computer Studies 70, 10 (2012), 657--672.","paperID":"None"},{"content":"Verbert, K., Parra, D., Brusilovsky, P., and Duval, E. Visualizing recommendations to support exploration, transparency and controllability. In Proc. IUI, ACM, ACM (New York, NY, USA, 2013), 351--362.","paperID":"None"},{"content":"White, R. W., and Drucker, S. M. Investigating behavioral variability in web search. In Proc. WWW, ACM (2007), 21--30.","paperID":"None"},{"content":"White, R. W., Drucker, S. M., Marchionini, G., Hearst, M., and schraefel, m. c. Exploratory search and hci: Designing and evaluating interfaces to support exploratory search interaction. In CHI '07 Extended Abstracts on Human Factors in Computing Systems, ACM (New York, NY, USA, 2007), 2877--2880.","paperID":"None"},{"content":"White, R. W., and Roth, R. A. Exploratory search: Beyond the query-response paradigm. Synth. Lec. on Inf. Conc., Retr., and Serv. 1, 1 (2009), 1--98.","paperID":"None"},{"content":"Wigdor, D., and Wixon, D. Brave NUI world: designing natural user interfaces for touch and gesture. Elsevier, 2011.","paperID":"None"},{"content":"Wildemuth, B. M., and Freund, L. Assigning search tasks designed to elicit exploratory search behaviors. In Proc. HCIR, ACM (New York, NY, USA, 2012), 4:1--4:10.","paperID":"None"},{"content":"Zhai, C., and Lafferty, J. A study of smoothing methods for language models applied to information retrieval. ACM Trans. Inf. Syst. 22, 2 (2004), 179--214.","paperID":"None"},{"content":"Zhai, S., Kristensson, P.-O., and Smith, B. A. In search of effective text input interfaces for off the desktop computing. Interacting with computers 17, 3 (2005), 229--250.","paperID":"None"}],"abstract":"Exploratory search confront users with challenges in expressing search intents as the current search interfaces require investigating result listings to identify search directions, iterative typing, and reformulating queries. We present the design of Exploration Wall, a touch-based search user interface that allows incremental exploration and sense-making of large information spaces by combining entity search, flexible use of result entities as query parameters, and spatial configuration of search streams that are visualized for interaction. Entities can be flexibly reused to modify and create new search streams, and manipulated to inspect their relationships with other entities. Data comprising of task-based experiments comparing Exploration Wall with conventional search user interface indicate that Exploration Wall achieves significantly improved recall for exploratory search tasks while preserving precision. Subjective feedback supports our design choices and indicates improved user satisfaction and engagement. Our findings can help to design user interfaces that can effectively support exploratory search on touch devices.","video":"http://www.youtube.com/embed/zRJEhb0y050?rel=0","title":"Designing for Exploratory Search on Touch Devices","filename":"CHI15/p4189","authors":["Khalil Klouche","Tuukka Ruotsalo","Diogo Cabral","Salvatore Andolina","Andrea Bellucci","Giulio Jacucci"],"conference":"CHI '15"}