{"paperId":2702400,"citation":[{"content":"Silvia Lindtner , Anna Greenspan , David Li, Designed in Shenzhen: Shanzhai manufacturing and maker entrepreneurs, Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives, August 17-21, 2015, Aarhus, Denmark","paperID":"2882869"}],"abstract":"The paper offers theoretical support for research through design (RtD) by arguing that in order to legitimize and make use of research through design as research, HCI researchers need to explore and clarify how RtD objects might contribute to knowledge. Leveraging the tradition of aesthetics in the arts and humanities, we argue that while the intentions of the object's designer are important and while annotations are a good mechanism to articulate them, the critical reception of objects is equally foundational to RtD's broader knowledge impacts within HCI. Such a scholarly critical reception is needed precisely because of the potential inexhaustibility of design objects' meanings; their inability to be paraphrased simply and adequately. Offering a multilevel analysis of the (critical) design fiction Menstruation Machine by Sputniko!, the paper explores how design objects co-produce knowledge, by working through complex design problem spaces in non-reductive ways, proposing new connections and distinctions, and embodying design ideas and processes across time and minds.","reference":[{"content":"Archer, B. (1995). The Nature of Research. Co-design, interdisciplinary journal of design, Jan 1995, 6--13.","paperID":"None"},{"content":"Bardzell, J. (2011). Interaction criticism: An introduction to the practice. Interacting with computers, 23(6), 604--621.","paperID":"None"},{"content":"Bardzell, J., and Bardzell, S. (2013). What is critical about critical design?. In Proc. of CHI'13. ACM.","paperID":"None"},{"content":"Bardzell, J., Bardzell, S., and Stolterman, E. (2014). Reading critical designs: Supporting reasoned debates about critical designs. In Proc. of CHI'2014. ACM.","paperID":"None"},{"content":"Bertelsen, O., and Pold, S. (2004). Criticism as an approach to interface aesthetics. In Proc. of NordiCHI'04. ACM.","paperID":"None"},{"content":"Blythe, M. (2014). Research through design fiction: Narrative in real and imaginary abstracts. In Proc. of CHI'2014. ACM.","paperID":"None"},{"content":"Bolter, J. D. and Gromala, D. (2003). Windows and Mirrors: Interaction Design, Digital Art, and the Myth of Transparency. The MIT Press.","paperID":"None"},{"content":"Bowers, J. (2012). The logic of annotated portfolios: Communicating the value of \"Research through Design.\" In Proc. of DIS2012. ACM.","paperID":"None"},{"content":"Carroll, J. M. & Kellogg, W. A. (1989) Artifact as theory-nexus: hermeneutics meets theory-based design. In Proc. of CHI '89, 7--14. ACM.","paperID":"None"},{"content":"Carroll, N. (2009). On Criticism. Routledge.","paperID":"None"},{"content":"Dalsgaard, P. (2010). Research in and through design: An interaction design research approach. In Proc. of OzCHI '10. ACM.","paperID":"None"},{"content":"DiSalvo, C. (2012). Spectacles and Tropes: Speculative Design and Contemporary Food Cultures. The Fiberculture Journal 2012 (20), 109--122.","paperID":"None"},{"content":"Dunne, A. and Raby, F. (2013). Speculative Everything. The MIT Press.","paperID":"None"},{"content":"Eldridge, R. (2003). An Introduction to the Philosophy of Art. Cambridge: Cambridge University Press.","paperID":"None"},{"content":"Fallman, D. (2003). Design-oriented human-computer interaction. In Proc. of CHI'03. ACM.","paperID":"None"},{"content":"Feinberg, M., Carter, D., & Bullard, J. Always somewhere, never there: Using critical design to understand database interactions. Proc. CHI'14, ACM, 1941--1950.","paperID":"None"},{"content":"Fernaeus, Y. and Vallgårda, A. (2014) Ajna: negotiating forms in the making of a musical cabinet. In Proc. of DIS'14. ACM.","paperID":"None"},{"content":"Flusser, V. (1995) On the Word Design: An Etymological Essay. Design Issues, 11(3), 50--53.","paperID":"None"},{"content":"Flyvbjerg, B. (2006). Five Misunderstandings about case-study research. Qualitative Inquiry 12(2), 219--245.","paperID":"None"},{"content":"Frayling, C. (1993/4). Research in art and design. Royal College of Art Research Papers 1(1), 1--5.","paperID":"None"},{"content":"Galey, A. & Reuker, S. (2010). How a prototype argues. Literary and Linguistic Computing 25(4), 405--24.","paperID":"None"},{"content":"Gaver, W. (2012). What should we expect from research through design? In Proc. of CHI'12. ACM.","paperID":"None"},{"content":"Gibson, J. (2007). Fiction and the Weave of Life. Oxford: Oxford University Press.","paperID":"None"},{"content":"Goodman, N. (1976). Languages of Art. Hackett.","paperID":"None"},{"content":"Graham, G. (2005). Philosophy of the Arts. 3rd ed. Routledge.","paperID":"None"},{"content":"Guyer, P. History of Modern Aesthetics. In J. Levinson, ed., 2003, The Oxford Handbook of Aesthetics, Oxford University Press, 25--62.","paperID":"None"},{"content":"Hansen, L.K. (2011) The Interface at the Skin. In Andersen, C.U. and Pold, S. (eds.) Interface Criticism. Aesthetics Beyond Buttons. Aarhus University Press.","paperID":"None"},{"content":"Hansen, L. K. and Kozel, S. (2007) Embodied imagination: a hybrid method of designing for intimacy. Digital Creativity, 18 (4), 207--220.","paperID":"None"},{"content":"Koskinen, I., Zimmerman, J., Binder, T., Redstrom, J., & Wensveen, S. (2011). Design research through practice: From the lab, field, and showroom. Elsevier.","paperID":"None"},{"content":"Kyndrup, M. (2008). Den æstetiske relation. Gyldendal.","paperID":"None"},{"content":"Löwgren, J. (2009). Toward an articulation of interaction esthetics. New Review of Hypermedia and Multimedia 15(2), 129--146","paperID":"None"},{"content":"Ludvigsen, M. (2006). Designing for social interaction: physical, co-located social computing. PhD Dissertation, Center for Interactive Spaces, Aarhus.","paperID":"None"},{"content":"Mol, A. (2002). The Body Multiple: Ontology in Medical Practice. Duke University Press: Durham.","paperID":"None"},{"content":"Nelson, H. and Stolterman, E. (2013). The Design Way. 2nd ed. The MIT Press.","paperID":"None"},{"content":"Ozaki, H. (2010). Menstruation Machine. http://www.di10.rca.ac.uk/hiromiozaki/menstruationmachine.html (accessed 20 Sept 2014)","paperID":"None"},{"content":"Seel, M. (2005). Aesthetics of Appearing. Stanford University Press.","paperID":"None"},{"content":"Stolterman, E., and Wiberg, M. (2010). Concept-driven interaction design research. Human-Computer Interaction, 25(2), 95--118.","paperID":"None"},{"content":"Verbeek, P.-P. (2012). Politics at Issue. On Art and the Democratization of Things. In Boomgaard, J. et al. (eds.), Open 24: Politics of Things. nai010, Rotterdam.","paperID":"None"},{"content":"Yang, H. (2014). Review of MoMA Design and Violence Debate. http://yanghanzi.com/2014/04/13/to-whatextent-can-design-transcend-human-experienceboundaries/ (accessed 20 Sept 2014)","paperID":"None"},{"content":"Zimmerman, J. & Forlizzi, J. (2014) Research through design in HCI. In Olson, J. & Kellogg, W., eds., Ways of Knowing in HCI, Springer.","paperID":"None"},{"content":"Zimmerman, J., Forlizzi, E., Evenson, S. (2007). Research through design as a method for interaction design research in HCI. In Proc. of CHI'07. ACM.","paperID":"None"},{"content":"Zimmerman, J., Stolterman, E., & Forlizzi, J. (2010). An analysis and critique of Research through Design. In Proc. of DIS'10. ACM.","paperID":"None"}],"title":"Immodest Proposals: Research Through Design and Knowledge","filename":"CHI15/p2093","authors":["Jeffrey Bardzell","Shaowen Bardzell","Lone Koefoed Hansen"],"conference":"CHI '15"}