{"paperId":2702382,"citation":[{"content":"Daniel Boland , Mark McGill, Lost in the rift: engaging with mixed reality, XRDS: Crossroads, The ACM Magazine for Students, v.22 n.1, Fall 2015","paperID":"2810046"}],"reference":[{"content":"Barrett, J., and Krueger, H. Performance effects of reduced proprioceptive feedback on touch typists and casual users in a typing task. Behaviour & Information Technology 13, 6 (1994), 373--381.","paperID":"None"},{"content":"Benford, S., et al. Understanding and constructing shared spaces with mixed-reality boundaries. ACM TOCHI 5, 3 (1998), 185--223.","paperID":"None"},{"content":"Billinghurst, M., and Kato, H. Collaborative mixed reality. In Proc. ISMR '99, ACM (1999), 261--284.","paperID":"None"},{"content":"Bruder, G., and et al. Augmented virtual studio for architectural exploration, 2010.","paperID":"None"},{"content":"Carvalho, F. G., et al. Toward the design of transitional interfaces: an exploratory study on a semi-immersive hybrid user interface. Virtual Reality 16, 4 (2012).","paperID":"None"},{"content":"Davis, L., et al. Enabling a continuum of virtual environment experiences. IEEE Comput. Graph. Appl. 23, 2 (Mar. 2003), 10--12.","paperID":"None"},{"content":"Gonzalez, G., et al. Evaluation of text input techniques in immersive virtual environments. In New Trends on HumanComputer Interaction, J. A. Macas et al., Eds. Springer London, 2009, 109--118.","paperID":"None"},{"content":"Grasset, R., Lamb, P., and Billinghurst, M. Evaluation of mixed-space collaboration. In Proc. ISMAR '05, IEEE (2005), 90--99.","paperID":"None"},{"content":"Hutchison, A. Back to the holodeck: New life for virtual reality? In Proc. DIMEA '07, ACM (2007), 98--104.","paperID":"None"},{"content":"Kaber, D. B., and Zhang, T. Human factors in virtual reality system design for mobility and haptic task performance. Reviews of Human Factors and Ergonomics 7, 1 (2011), 323--366.","paperID":"None"},{"content":"Kristensson, P. O., and Vertanen, K. Performance comparisons of phrase sets and presentation styles for text entry evaluations. In Proc. IUI '12, ACM (2012).","paperID":"None"},{"content":"Lombard, M., et al. Measuring presence: the temple presence inventory. In Proc. ISPR '09 (2009).","paperID":"None"},{"content":"Metzger, P. Adding reality to the virtual. In Proc. VR '93, IEEE (1993), 7--13.","paperID":"None"},{"content":"Milgram, P., and Colquhoun, H. A taxonomy of real and virtual world display integration. Mixed reality: Merging real and virtual worlds (1999), 5--30.","paperID":"None"},{"content":"Milgram, P., and Kishino, F. A Taxonomy Of Mixed Reality Visual Displays. IEICE Transactions on Information and Systems 77, 12 (1994), 1321--1329.","paperID":"None"},{"content":"Pohl, H., and Murray-Smith, R. Focused and casual interactions: Allowing users to vary their level of engagement. In Proc. CHI 2013, ACM (2013).","paperID":"None"},{"content":"Rekimoto, J., and Nagao, K. The world through the computer: Computer augmented interaction with real world environments. In Proc. UIST '95, ACM (1995).","paperID":"None"},{"content":"Schubert, T., Friedmann, F., and Regenbrecht, H. The experience of presence: Factor analytic insights. Presence: Teleoperators and virtual environments 10, 3 (2001), 266--281.","paperID":"None"},{"content":"Slater, M. Place illusion and plausibility can lead to realistic behaviour in immersive virtual environments. Phil. Trans. R. Soc. Lond. B: Biological Sciences 364, 1535 (2009), 3549--3557.","paperID":"None"},{"content":"Soukoreff, R. W., and MacKenzie, I. S. Metrics for text entry research. In Proc. CHI '03, ACM (2003), 113--120.","paperID":"None"},{"content":"Steinicke, F., et al. A virtual body for augmented virtuality by chroma-keying of egocentric videos. In 3DUI 2009, IEEE (2009), 125--126.","paperID":"None"},{"content":"Tecchia, F., et al. I'M in VR!: Using Your Own Hands in a Fully Immersive MR System. In Proc. VRST '14, ACM (2014), 73--76.","paperID":"None"},{"content":"Thomas, B. H. A survey of visual, mixed, and augmented reality gaming. Computers in Entertainment 10, 3 (2012), 3:1--3:33.","paperID":"None"},{"content":"Van Baren, J., and IJsselsteijn, W. Measuring presence: A guide to current measurement approaches. OmniPres project (2004).","paperID":"None"}],"abstract":"We identify usability challenges facing consumers adopting Virtual Reality (VR) head-mounted displays (HMDs) in a survey of 108 VR HMD users. Users reported significant issues in interacting with, and being aware of their real-world context when using a HMD. Building upon existing work on blending real and virtual environments, we performed three design studies to address these usability concerns. In a typing study, we show that augmenting VR with a view of reality significantly corrected the performance impairment of typing in VR. We then investigated how much reality should be incorporated and when, so as to preserve users' sense of presence in VR. For interaction with objects and peripherals, we found that selectively presenting reality as users engaged with it was optimal in terms of performance and users' sense of presence. Finally, we investigated how this selective, engagement-dependent approach could be applied in social environments, to support the user's awareness of the proximity and presence of others.","title":"A Dose of Reality: Overcoming Usability Challenges in VR Head-Mounted Displays","filename":"CHI15/p2143","authors":["Mark McGill","Daniel Boland","Roderick Murray-Smith","Stephen Brewster"],"conference":"CHI '15"}