{"paperId":2702201,"citation":[],"abstract":"The increasing availability of 3D interfaces brings promise of improved user experience in diverse areas. Our study focuses on visual analytics, testing whether 3D interactivity improves performance in a visual data exploration task. Specifically, we compared scene rotation around vertical axis to a full 3D rotation using a InterSense IS-900 3D controller, in a task involving trivariate trend detection in a 3D scatterplot. We found that, while 3D rotation leads to slower performance, previous exposure to single-axis rotation removes that difference. This shows that an interactive 3D scatterplot can be an effective visual exploration technique for detecting trivariate patterns in the data, and highlights the role of interface learning in design and assessment of novel interfaces.","reference":[{"content":"Kevin W. Arthur , Kellogg S. Booth , Colin Ware, Evaluating 3D task performance for fish tank virtual worlds, ACM Transactions on Information Systems (TOIS), v.11 n.3, p.239-265, July 1993","paperID":"155359"},{"content":"Doug A. Bowman , Ernst Kruijff , Joseph J. LaViola , Ivan Poupyrev, 3D User Interfaces: Theory and Practice, Addison Wesley Longman Publishing Co., Inc., Redwood City, CA, 2004","paperID":"993837"},{"content":"Dang, N. T., Tavanti, M., Rankin, I., and Cooper, M. A comparison of different input devices for a 3D environment. International Journal of Industrial Ergonomics 39, 3 (2009), 554--563.","paperID":"None"},{"content":"Elmqvist, N., Dragicevic, P., and Fekete, J.-D. Rolling the dice: Multidimensional visual exploration using scatterplot matrix navigation. IEEE Transactions on Visualization and Computer Graphics 14, 6 (2008), 1539--1148.","paperID":"None"},{"content":"Gibson, E. J. Principles of perceptual learning and development. Appleton-Century-Crofts, 1969.","paperID":"None"},{"content":"Joseph J. LaViola , Daniel F. Keefe, 3D spatial interaction: applications for art, design, and science, ACM SIGGRAPH 2011 Courses, p.1-75, August 07-11, 2011, Vancouver, British Columbia, Canada","paperID":"2037637"},{"content":"Harald Sanftmann , Daniel Weiskopf, 3D Scatterplot Navigation, IEEE Transactions on Visualization and Computer Graphics, v.18 n.11, p.1969-1978, November 2012","paperID":"2377453"},{"content":"Michael Sedlmair , Tamara Munzner , Melanie Tory, Empirical Guidance on Scatterplot and Dimension Reduction Technique Choices, IEEE Transactions on Visualization and Computer Graphics, v.19 n.12, p.2634-2643, December 2013","paperID":"2553778"},{"content":"Shovman, M. M., Scott-Brown, K. C., Szymkowiak, A., and Bown, J. The meaning of graphs: Scatterplots as a test-bed for theories of object-hood. Gestalt Theory 34, 3/4 (2012).","paperID":"None"},{"content":"Mark M. Shovman , Andrea Szymkowiak , James L. Bown , Kenneth C. Scott-Brown, Changing the View: Towards the Theory of Visualisation Comprehension, Proceedings of the 2009 13th International Conference Information Visualisation, p.135-138, July 15-17, 2009","paperID":"1589212"},{"content":"Tommaso, M. A trivariate model of participation, fertility and wages: the italian case. Cambridge Journal of Economics 23, 5 (1999), 623--640.","paperID":"None"},{"content":"Watson, J. D., Crick, F. H., et al. Molecular structure of nucleic acids. Nature 171, 4356 (1953), 737--738.","paperID":"None"},{"content":"Wickens, C. D., Merwin, D. H., and Lin, E. L. Implications of graphics enhancements for the visualization of scientific data. Human Factors 36, 1 (1994), 44--61.","paperID":"None"}],"title":"Twist and Learn: Interface Learning in 3DOF Exploration of 3D Scatterplots","filename":"CHI15/p313","authors":["Mark Shovman","James Bown","Andrea Szymkowiak","Kenneth C. Scott-Brown"],"conference":"CHI '15"}