{"paperId":2702386,"citation":[],"abstract":"Information and communication technologies (ICTs) continue to give us increased flexibility about when and where we choose to work and the freedom to deal with home tasks whilst at work. However more use of ICT for work during non-work time has been linked with negative outcomes including lower work and life satisfaction and increased stress. Previous work has suggested that in order to reduce some of these negative effects, people should adopt technology use strategies that aid separation of their home and work lives. In this paper we report the results of a questionnaire study investigating work-life balance boundary behaviours and technology use. We find that people use multiple devices as a way of creating boundaries between home and work, and the extent to which they do this relates to their boundary behaviour style. These findings have particular relevance given the increasing trend for Bring Your Own Device (BYOD) policies.","reference":[{"content":"Ashforth, B.E., Kreiner, G.E., and Fugate, M. All in a day's work: Boundaries and micro role transitions. Academy of Management review 25, 3 (2000), 472--491.","paperID":"None"},{"content":"Battard, N., and Mangematin, V. Idiosyncratic distances: Impact of mobile technology practices on role segmentation and integration. Technological Forecasting and Social Change 80, 2 (2013), 231--242.","paperID":"None"},{"content":"Diaz, I., Chiaburu, D.S., Zimmerman, R.D., and Boswell, W.R. Communication technology: Pros and cons of constant connection to work. Journal of Vocational Behavior 80, 2 (2012), 500--508.","paperID":"None"},{"content":"Duxbury, L., Higgins, C., Smart, R., and Stevenson, M. Mobile technology and boundary permeability. British Journal of Management 25, 3 (2014), 570--588.","paperID":"None"},{"content":"Grevet, C. Managing the work-home boundary in a BYOD culture. Workshop on Socio-Technical Systems and Work-Home Boundaries. Mobile HCI'14 (2014).","paperID":"None"},{"content":"Kirchmeyer, C. Managing the work-nonwork boundary: An assessment of organizational responses. Human Relations 48, 5 (1995), 515--536.","paperID":"None"},{"content":"Kossek, E.E., and Lautsch, B.A. CEO of me: Creating a life that works in the flexible job age. Pearson Prentice Hall, (2007).","paperID":"None"},{"content":"Kossek, E.E., Ruderman, M.N., Braddy, P.W., and Hannum, K.M. Work-nonwork boundary management profiles: A person-centered approach. Journal of Vocational Behavior 81, 1 (2012), 112--128.","paperID":"None"},{"content":"Kreiner, G.E., Hollensbe, E.C., and Sheep, M.L. Balancing borders and bridges: Negotiating the workhome interface via boundary work tactics. Academy of Management Journal 52, 4 (2009), 704--730.","paperID":"None"},{"content":"Nam, T. Technology Use and Work-Life Balance. Applied Research in Quality of Life (2013), 1--24.","paperID":"None"},{"content":"Park, Y., and Jex, S.M. Work-home boundary management using communication and information technology. International Journal of Stress Management 18, 2 (2011), 133.","paperID":"None"}],"title":"Balancing Boundaries: Using Multiple Devices to Manage Work-Life Balance","filename":"CHI15/p3985","authors":["Rowanne Fleck","Anna L. Cox","Rosalyn A.V. Robison"],"conference":"CHI '15"}