{"paperId":2702503,"citation":[],"reference":[{"content":"1. Azenkot, S., and Zhai, S. Touch behavior with different postures on soft smartphone keyboards. In Proceedings of the International Conference on Human Computer Interaction with Mobile Devices and Services, MobileHCI '12, ACM (2012), 251--260.","paperID":"None"},{"content":"2. Bellegarda, J. R. Statistical language model adaptation: review and perspectives. Speech Communication 42 (2004), 93--108.","paperID":"None"},{"content":"3. Bi, X., Ouyang, T., and Zhai, S. Both complete and correct? multi-objective optimization of touchscreen keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '14, ACM (2014).","paperID":"None"},{"content":"4. Charniak, E., Blaheta, D., Ge, N., Hall, K., Hale, J., and Johnson, M. BLLIP 1987--89 Wall Street Journal Corpus Release 1.","paperID":"None"},{"content":"5. Chelba, C., Brants, T., Neveitt, W., and Xu, P. Study on Interaction between Entropy Pruning and Kneser-Ney Smoothing. In Proc. Interspeech, ISCA (Makuhari, Japan, 2010), 2242--2245.","paperID":"None"},{"content":"6. Chen, S. F., Beeferman, D., and Rosenfield, R. Evaluation metrics for language models. Tech. rep., Carnegie Mellon University, 1998.","paperID":"None"},{"content":"7. Chiticariu, L., Krishnamurthy, R., Li, Y., Reiss, F., and Vaithyanathan, S. Domain adaptation of rule-based annotators for named-entity recognition tasks. In Proceedings of the Conference on Empirical Methods in Natural Language Processing, EMNLP '10, Association for Computational Linguistics (2010), 1002--1012.","paperID":"None"},{"content":"8. Clarkson, P. R., and Robinson, A. J. Language model adaptation using mixtures and an exponentially decaying cache. In Proceedings of the International Conference on Acoustics, Speech and Signal Processing, vol. 2 of ICASSP '97, IEEE (1997), 799--802.","paperID":"None"},{"content":"9. DeMori, R., and Federico, M. Language model adaptation. In Computational models of speech pattern processing. Springer, 1999, 280--303.","paperID":"None"},{"content":"10. Findlater, L., Wobbrock, J. O., and Wigdor, D. Typing on flat glass: examining ten-finger expert typing patterns on touch surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '11, ACM (2011), 2453--2462.","paperID":"None"},{"content":"11. Goodman, J., Venolia, G., Steury, K., and Parker, C. Language modeling for soft keyboards. In Proceedings of the International Conference on Intelligent User Interfaces, IUI '02, ACM (New York, NY, USA, 2002), 194--195.","paperID":"None"},{"content":"12. Goodman, J. T. A bit of progress in language modeling. Computer Speech & Language 15, 4 (2001), 403--434.","paperID":"None"},{"content":"13. Holz, C., and Baudisch, P. Understanding touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '11, ACM (2011), 2501--2510.","paperID":"None"},{"content":"14. Jones, K. S. Towards better NLP system evaluation. In Proceedings of the Workshop on Human Language Technology, Association for Computational Linguistics (1994), 102--107.","paperID":"None"},{"content":"15. Jurafsky, D., and Martin, J. H. Speech & Language Processing, second ed. Prentice Hall, 2008.","paperID":"None"},{"content":"16. Katz, S. Estimation of probabilities from sparse data for the language model component of a speech recognizer. In Proceedings of the International Conference on Acoustics, Speech and Signal Processing, vol. 35 number 3 of ICASSP '87, IEEE (1987), 400--01.","paperID":"None"},{"content":"17. Klarlund, N., and Riley, M. Word n-grams for cluster keyboards. In Proceedings of the EACL Workshop on Language Modeling for Text Entry Methods, TextEntry '03, Association for Computational Linguistics (Stroudsburg, PA, USA, 2003), 51--58.","paperID":"None"},{"content":"18. Klimt, B., and Yang, Y. Introducing the Enron corpus. In Proceedings of the Conference on Email and Anti-Spam, CEAS '04 (2004).","paperID":"None"},{"content":"19. Kneser, R., and Ney, H. Improved backing-off for m-gram language modeling. In Proceedings of the International Conference on Acoustics, Speech and Signal Processing, vol. 1 of ICASSP '95, IEEE (1995), 181--184.","paperID":"None"},{"content":"20. Kristensson, P. O., and Vertanen, K. Asynchronous multimodal text entry using speech and gesture keyboards. In Proc. Interspeech (2011), 581--584.","paperID":"None"},{"content":"21. Kristensson, P. O., and Vertanen, K. Performance comparisons of phrase sets and presentation styles for text entry evaluations. In Proceedings of the International Conference on Intelligent User Interfaces, IUI '12, ACM (2012), 29--32.","paperID":"None"},{"content":"22. Kristensson, P. O., and Zhai, S. SHARK2: A large vocabulary shorthand writing system for pen-based computers. In Proceedings of the ACM Symposium on User Interface Software and Technology, UIST '04, ACM (New York, NY, USA, 2004), 43--52.","paperID":"None"},{"content":"23. Kristensson, P. O., and Zhai, S. Improving word-recognizers using an interactive lexicon with active and passive words. In Proceedings of the International Conference on Intelligent User Interfaces, IUI '08, ACM (2008), 353--356.","paperID":"None"},{"content":"24. Kuhn, R., and De Mori, R. A cache-based natural language model for speech recognition. Pattern Analysis and Machine Intelligence, IEEE Transactions on 12, 6 (1990), 570--583.","paperID":"None"},{"content":"25. MacKenzie, I. S., and Soukoreff, R. W. Text entry for mobile computing: Models and methods, theory and practice. Human-Computer Interaction 17, 2--3 (2002), 147--198.","paperID":"None"},{"content":"26. Paek, T., and Hsu, B.-J. P. Sampling representative phrase sets for text entry experiments: a procedure and public resource. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '11, ACM (2011), 2477--2480.","paperID":"None"},{"content":"27. Sandu, O., Carenini, G., Murray, G., and Ng, R. Domain adaptation to summarize human conversations. In Proceedings of the Workshop on Domain Adaptation for Natural Language Processing, Association for Computational Linguistics (2010), 16--22.","paperID":"None"},{"content":"28. Smith, S. L., and Goodwin, N. C. Alphabetic data entry via the Touch-Tone pad: A comment. Human Factors: The Journal of the Human Factors and Ergonomics Society 13, 2 (1971), 189--190.","paperID":"None"},{"content":"29. Stolcke, A. Entropy-based pruning of back-off language models. In Proceedings of News Transcription and Understanding Workshop, DARPA (Lansdowne, VA, 1998), 270--274.","paperID":"None"},{"content":"30. Tanaka-Ishii, K. Word-based predictive text entry using adaptive language models. Natural Language Engineering 13 (2 2007), 51--74.","paperID":"None"},{"content":"31. Vertanen, K., and Kristensson, P. O. A versatile dataset for text entry evaluations based on genuine mobile emails. In Proceedings of the International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI '11 (August 2011).","paperID":"None"},{"content":"32. Ward, D. J., Blackwell, A. F., and MacKay, D. J. Dashera data entry interface using continuous gestures and language models. In Proceedings of the ACM Symposium on User Interface Software and Technology, UIST '00, ACM (2000), 129--137.","paperID":"None"},{"content":"33. Weir, D., Pohl, H., Rogers, S., Vertanen, K., and Kristensson, P. O. Uncertain text entry on mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '14 (April 2014), 2307--2316.","paperID":"None"},{"content":"34. Yin, Y., Ouyang, T. Y., Partridge, K., and Zhai, S. Making touchscreen keyboards adaptive to keys, hand postures, and individuals: a hierarchical spatial backoff model approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (2013), 2775--2784.","paperID":"None"},{"content":"35. Zajic, D. M., Dorr, B. J., and Lin, J. Single-document and multi-document summarization techniques for email threads using sentence compression. Information Processing & Management 44, 4 (2008), 1600--1610.","paperID":"None"},{"content":"36. Zhai, S., and Kristensson, P. O. Shorthand writing on stylus keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '03, ACM (New York, NY, USA, 2003), pp. 97--104.","paperID":"None"},{"content":"37. Zhai, S., and Kristensson, P. O. The word-gesture keyboard: reimagining keyboard interaction. Commun. ACM 55, 9 (Sept. 2012), pp. 91--101.","paperID":"None"}],"abstract":"Modern smartphones correct typing errors and learn user-specific words (such as proper names). Both techniques are useful, yet little has been published about their technical specifics and concrete benefits. One reason is that typing accuracy is difficult to measure empirically on a large scale. We describe a closed-loop, smart touch keyboard (STK) evaluation system that we have implemented to solve this problem. It includes a principled typing simulator for generating human-like noisy touch input, a simple-yet-effective decoder for reconstructing typed words from such spatial data, a large web-scale background language model (LM), and a method for incorporating LM personalization. Using the Enron email corpus as a personalization test set, we show for the first time at this scale that a combined spatial-language model reduces word error rate from a pre-model baseline of 38.4% down to 5.7%, and that LM personalization can improve this further to 4.6%.","video":"http://www.youtube.com/embed/ZFQrQo3ejU0?rel=0","title":"Effects of Language Modeling and its Personalization on Touchscreen Typing Performance","filename":"CHI15/p649","authors":["Andrew Fowler","Kurt Partridge","Ciprian Chelba","Xiaojun Bi","Tom Ouyang","Shumin Zhai"],"conference":"CHI '15"}