{"paperId":2702139,"citation":[],"abstract":"Psychological research has shown that 'peak-end' effects influence people's retrospective evaluation of hedonic and affective experience. Rather than objectively reviewing the total amount of pleasure or pain during an experience, people's evaluation is shaped by the most intense moment (the peak) and the final moment (end). We describe an experiment demonstrating that peak-end effects can influence a user's preference for interaction sequences that are objectively identical in their overall requirements. Participants were asked to choose which of two interactive sequences of five pages they preferred. Both sequences required setting a total of 25 sliders to target values, and differed only in the distribution of the sliders across the five pages -- with one sequence intended to induce positive peak-end effects, the other negative. The study found that manipulating only the peak or the end of the series did not significantly change preference, but that a combined manipulation of both peak and end did lead to significant differences in preference, even though all series had the same overall effort.","reference":[{"content":"Agarwal, R. and Karahanna, E. Time Flies When You're Having Fun: Cognitive Absorption and Beliefs about Information Technology Usage. MIS Quarterly 24, 4 (2000), 665--694.","paperID":"None"},{"content":"Carroll, J. The adventure of getting to know a computer. in Baecker, R. and Buxton, W. eds. Readings in HumanComputer Interaction: A Multidisciplinary Approach, Morgan Kaufmann Publishers Inc., 1987, 639--648.","paperID":"None"},{"content":"Csikszentmihalyi, M. Flow: The Psychology of Optimal Experience. Harper and Row, New York, 1991.","paperID":"None"},{"content":"Davis, F.D., Bagozzi, R.P. and Warshaw, P.R. Extrinsic and Intrinsic Motivation to Use Computers in the Workplace1. J Appl. Social Psych. 22, 14 (1992), 1111--1132.","paperID":"None"},{"content":"Finn, B. Ending on a High Note: Adding a Better End to Effortful Study. J. Experimental Psychology: Learning, Memory, and Cognition 36, 6 (2010), 1548--1553.","paperID":"None"},{"content":"Fredrickson, B. and Kahneman, D. Duration neglect in retrospective evaluations of affective episodes. J. Personality and Social Psychology 65, 1 (1993), 45--55.","paperID":"None"},{"content":"Harrison, C., Amento, B., Kuznetsov, S. and Bell, R. Rethinking the progress bar. in Proc.UIST'07, ACM, (2007), 115--118.","paperID":"None"},{"content":"Harrison, C., Yeo, Z. and Hudson, S.E. Faster progress bars: manipulating perceived duration with visual augmentations. in Proc. CHI'10, ACM, (2010), 1545--1548.","paperID":"None"},{"content":"Hartmann, J., Sutcliffe, A. and Angeli, A.D. Towards a theory of user judgment of aesthetics and user interface quality. ACM ToCHI. 15, 4 (2008), 1--30.","paperID":"None"},{"content":"Hassenzahl, M. The Interplay of Beauty, Goodness, and Usability in Interactive Products. Human-Computer Interaction 19, 4 (2004), 319--349.","paperID":"None"},{"content":"Hassenzahl, M., Platz, A., Burmester, M. and Lehner, K. Hedonic and ergonomic quality aspects determine a software's appeal. in Proc. CHI'00, ACM, The Hague, The Netherlands, 2000, 201--208.","paperID":"None"},{"content":"Hassenzahl, M. and Sandweg, N. From mental effort to perceived usability: transforming experiences into summary assessments. Extended Abstracts CHI '04, ACM, Vienna, Austria, 2004, 1283--1286","paperID":"None"},{"content":"Kahneman, D. Thinking, Fast and Slow. Farrar, Straus and Giroux, 2011.","paperID":"None"},{"content":"Kahneman, D., Fredrickson, B., Schreiber, C. and Redelmeier, D. When More Pain Is Preferred to Less: Adding a Better End. J. Personality and Social Psych. 65, 1 (1993), 401--405.","paperID":"None"},{"content":"Kapp, K. The gamification of learning and instruction: Game-based methods and strategies for training and education. Pfeiffer, San Francisco, 2012.","paperID":"None"},{"content":"Langer, T., Sarin, R. and Weber, M. The retrospective evaluation of payment sequences: duration neglect and peak-and-end effects. Journal of Economic Behavior & Organization 58, 1 (2005), 157--175.","paperID":"None"},{"content":"Malone, T. What makes things fun to learn? A study of intrinsically motivating computer games. Dept. of Psychology, Stanford University, Palo Alto, CA, 1980.","paperID":"None"},{"content":"McAuley, J. Perception of Time as Phase: Toward and Adaptive-Oscillator Model of Rhythmic Pattern Processing. Computer Science and Cognitive Science, Indiana University, Bloomington, IN, 1995.","paperID":"None"},{"content":"Nasiry, J. and Popescu, I. Dynamic Pricing with LossAverse Consumers and Peak-End Anchoring. Operations Research 59, 6 (2011), 1361--1368.","paperID":"None"},{"content":"Redelmeier, D.A. and Kahneman, D. Patients' memories of painful medical treatments: real-time and retrospective evaluations of two minimally invasive procedures. Pain 66, 1 (1996), 3--8.","paperID":"None"},{"content":"Redelmeier, D.A., Katz, J. and Kahneman, D. Memories of colonoscopy: a randomized trial. Pain 104, 1 (2003), 187--194.","paperID":"None"},{"content":"Reinecke, K. and Bernstein, A. Improving performance, perceived usability, and aesthetics with culturally adaptive user interfaces. ACM ToCHI. 18, 2 (2011), 1--29.","paperID":"None"},{"content":"Rode, E., Rozin, P. and Durlach, P. Experienced and remembered pleasure for meals: Duration neglect but minimal peak, end (recency) or primacy effects. Appetite 49, 1 (2007), 18--29.","paperID":"None"},{"content":"Statistica. 2012. Why do online shoppers leave without paying? Retrieved September, 2014, from http://www.statista.com/statistics/232285/reasons-foronline-shopping-cart-abandonment/.","paperID":"None"},{"content":"Treisman, M., Faulkner, A., Naish, P.L.N. and Brogan, D. The internal clock: evidence for a temporal oscillator underlying time perception with some estimates of its characteristic frequency. Perception 19, 6 (1990), 705743.","paperID":"None"},{"content":"Venkatesh, V., Morris, M.G., Davis, G.B. and Davis, F.D. User Acceptance of Information Technology: Toward a Unified View. MIS Quart. 27, 3 (2003), 425--478.","paperID":"None"},{"content":"Vierordt, K. Der Zeitsinn nach Versuchen. Laupp, H, Tubingen, 1868.","paperID":"None"},{"content":"Weybrew, B.B. The Zeigarnik Phenomenon Revisited: Implications for Enhancement of Morale. Perceptual and Motor Skills 58, 1 (1984), 223--226.","paperID":"None"},{"content":"Zimmermann, P. Beyond Usability -- Measuring Aspects of User Experience, Swiss Federal Institute of Technology Zurich, 2008.","paperID":"None"}],"title":"Examining the Peak-End Effects of Subjective Experience","filename":"CHI15/p357","authors":["Andy Cockburn","Philip Quinn","Carl Gutwin"],"conference":"CHI '15"}