{"paperId":2702264,"citation":[],"abstract":"Despite the growing interests in video games as consumer products as well as objects of research, current methods for accessing video games are limited. We present Vizmo as a new way of browsing video games based on their visual style and mood. In order to test the usability and usefulness of Vizmo, we asked 19 video game experts to evaluate their interaction with the tool. The results show that experts perceived Vizmo as a novel and aesthetically pleasing game discovery tool which would be most useful for game research on historical and aesthetic aspects. We discuss five key points for improving the design of Vizmo as well as our future plan for the next iteration of this prototype game browser.","reference":[{"content":"Dachselt, R. and Frisch, M. Mambo: a facet-based zoomable music browser. In Proc. MUM '07, ACM (2007), 110--117.","paperID":"None"},{"content":"Donovan, A., Cho, H., Magnifico, C., and Lee, J. H. Pretty as a pixel: issues and challenges in developing a controlled vocabulary for video game visual styles. In Proc. JCDL '13, ACM (2013), 412--414.","paperID":"None"},{"content":"Hearst, M. A. Clustering versus faceted categories for information exploration. Commun. ACM 49, 4, (2006), 59--61.","paperID":"None"},{"content":"Järvinen, A. Gran stylissimo: The audiovisual elements and styles in computer and video games. In Proc. CDGC, Tampere University Press (2002), 113--128.","paperID":"None"},{"content":"Karlson, A. K., Robertson, G. G., Robbins, D. C., Czerwinski, M. P., and Smith, G. R. FaThumb: a facetbased interface for mobile search. In Proc. CHI, ACM (2006), 711--720.","paperID":"None"},{"content":"Kyprianidis, J., Collomosse, J., Wang, T., and Isenberg, T. State of the art: A taxonomy of artistic stylization techniques for images and video. In IEEE Trans. Vis. Comput. Graphics, IEEE (2012), 1--20.","paperID":"None"},{"content":"Lee, J. H., Clarke, R. I., and Perti, A. Empirical evaluation of metadata for video games and interactive media. JASIST, in press.","paperID":"None"},{"content":"Martins, P., Langlois, T. and Chambel, T. MovieClouds: content-based overviews and exploratory browsing of movies. In Proc. MindTrek '11, ACM (2011), 133--140.","paperID":"None"},{"content":"Medynskiy, Y., Dontcheva, M., and Drucker, S. M. Exploring websites through contextual facets. In Proc. CHI 2009, ACM (2009), 2013--2022.","paperID":"None"},{"content":"Shneiderman, B. The eyes have it: a task by data type taxonomy for information visualizations. In IEEE Sym. on Visual Languages, IEEE (1996), 336--343.","paperID":"None"},{"content":"Tavinor, G. The art of video games. Wiley-Blackwell, Malden, MA, 2009.","paperID":"None"},{"content":"Tellegen, A., Watson, D., and Clark, L. A. On the dimensional and hierarchical structure of affect. Psychological Science, 10, 4, (1999), 297--303.","paperID":"None"},{"content":"Van Gulik, R. and Vignoli, F. Visual playlist generation on the artist map. In Proc. ISMIR '05, (2005), 520--523.","paperID":"None"},{"content":"Yee, K-P., Swearingen, K., Li, K., and Hearst, M. Faceted metadata for image search and browsing. In Proc. CHI 2003, ACM (2003), 401--408.","paperID":"None"}],"title":"VIZMO Game Browser: Accessing Video Games by Visual Style and Mood","filename":"CHI15/p149","authors":["Jin Ha Lee","Sungsoo (Ray) Hong","Hyerim Cho","Yea-Seul Kim"],"conference":"CHI '15"}