{"paperId":2702275,"abstract":"Although the infographic and design communities have used simple pictographic representations for decades, it is still unclear whether they can make visualizations more effective. Using simple charts, we tested how pictographic representations impact (1) memory for information just viewed, as well as under the load of additional information, (2) speed of finding information, and (3) engagement and preference in seeking out these visualizations. We find that superfluous images can distract. But we find no user costs -- and some intriguing benefits -- when pictographs are used to represent the data.","citation":[{"content":"Felicidad García-Sánchez , Juan Cruz-Benito , Roberto Therón , José Gómez-Isla, Designing and building systems and tools to analyze visual communications on social networks, Proceedings of the 3rd International Conference on Technological Ecosystems for Enhancing Multiculturality, October 07-09, 2015, Porto, Portugal","paperID":"2808629"}],"reference":[{"content":"Annink, E. and Bruinsma, M., eds. gerd arntz: graphic designer. 010 publishers, 2013.","paperID":"None"},{"content":"Bateman, S., Mandryk, R., Gutwin, C., Genest, A., McDine, D., and Brooks, C. Useful Junk? The Effects of Visual Embellishment on Comprehension and Memorability of Charts. ACM Conference on Human Factors in Computing Systems, (2010), 2573--2582.","paperID":"None"},{"content":"Borgo, R., Abdul-Rahman, A., Mohamed, F., Grant, P.W., Reppa, I., and Floridi, L. An Empirical Study on Using Visual Embellishments in Visualization. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2759--2768.","paperID":"None"},{"content":"Borkin, M.A., Vo, A.A., Bylinskii, Z., et al. What Makes a Visualization Memorable? Transactions on Visualization and Computer Graphics, 6 (2013).","paperID":"None"},{"content":"Brady, T.F., Konkle, T., and Alvarez, G.A. A review of visual memory capacity: Beyond individual items and toward structured representations. Journal of vision 11, 5 (2011).","paperID":"None"},{"content":"Brinton, W.C. Graphic Methods for Presenting Facts. The Engineering Magazine Company, New York, 1914.","paperID":"None"},{"content":"Chevalier, F., Vuillemot, R., and Gali, G. Using concrete scales: a practical framework for effective visual depiction of complex measures. IEEE transactions on visualization and computer graphics 19, 12 (2013), 2426--35.","paperID":"None"},{"content":"Choo, H. and Franconeri, S.L. Enumeration of small collections violates Weber's law. Psychonomic bulletin & review 21, 1 (2014), 93--9.","paperID":"None"},{"content":"Cowan, N. The magical number 4 in short-term memory: a reconsideration of mental storage capacity. The Behavioral and brain sciences 24, (2001), 87--114; discussion 114--185.","paperID":"None"},{"content":"Dickinson, C.A. and Intraub, H. Spatial Asymmetries in Viewing and Remembering Scenes: Consequences of an Attentional Bias' Attention, Perception, & Psychophysics 71, 6 (2009), 1251--1262.","paperID":"None"},{"content":"Droit-Volet, S., Clément, A., and Fayol, M. Time, number and length: similarities and differences in discrimination in adults and children. Quarterly journal of experimental psychology 61, 12 (2008), 1827--46.","paperID":"None"},{"content":"Franconeri, S.L. The nature and status of visual resources. In Oxford handbook of cognitive psychology. 2013.","paperID":"None"},{"content":"Godden, D.R. and Baddeley, a D. Context-dependent memory in two natural environments: On land and underwater. British Journal of Psychology 66, (1975).","paperID":"None"},{"content":"Halberda, J., Sires, S.F., and Feigenson, L. Multiple spatially overlapping sets can be enumerated in parallel. Psychological science 17, 7 (2006), 572--6.","paperID":"None"},{"content":"Haroz, S. and Whitney, D. How Capacity Limits of Attention Influence Information Visualization Effectiveness. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2402--2410.","paperID":"None"},{"content":"Heer, J. and Bostock, M. Crowdsourcing graphical perception. Proceedings of the 28th international conference on Human factors in computing systems - CHI '10, ACM Press (2010), 203--212.","paperID":"None"},{"content":"Holmes, N. Pictograms: A view from the drawing board or, what I have learned from Otto Neurath and Gerd Arntz (and jazz). Information design journal 10, 2 (2001), 133--144.","paperID":"None"},{"content":"Kaufman, E.L. and Lord, M.W. The discrimination of visual number. The American journal of psychology 62, 4 (1949), 498--525.","paperID":"None"},{"content":"Lin, S., Fortuna, J., Kulkarni, C., Stone, M.C., and Heer, J. Selecting Semantically-Resonant Colors for Data Visualization. EuroVis, (2013), 1--10.","paperID":"None"},{"content":"Michal, A.L. and Franconeri, S.L. The order of attentional shifts determines what visual relations we extract. Journal of Vision 14, 10 (2014), 1033--1033.","paperID":"None"},{"content":"Neurath, O. From hieroglyphs to Isotype: a visual autobiography. Hyphen Press, 2010.","paperID":"None"},{"content":"Setlur, V. and Mackinlay, J.D. Automatic generation of semantic icon encodings for visualizations. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (2014).","paperID":"None"},{"content":"Standing, L. Learning 10,000 pictures. The Quarterly journal of experimental psychology 25, 2 (1973).","paperID":"None"},{"content":"Tufte, E.R. The visual display of quantitative information. Graphics press, 1983.","paperID":"None"}],"title":"ISOTYPE Visualization: Working Memory, Performance, and Engagement with Pictographs","filename":"CHI15/p1191","authors":["Steve Haroz","Robert Kosara","Steven L. Franconeri"],"conference":"CHI '15"}