{"paperId":2702422,"abstract":"A method for primed product comparisons was developed, based on the methodological considerations of emotional appraisal process and affective mental contents. The method was implemented as a computer tool, which was utilised in two experiments (N = 18 for both). Ten adjectives served as primes, and five drinking glass pictures as stimuli. Participants' task was to choose a preference between two glasses, given the priming adjective. The results validate the method by providing test-retest reliability measures and showing convergence with questionnaires. Further, different evaluation times between the primes and the stimuli reveal the existence of different mental processes associated with various aspects of product experience, as predicted by appraisal theory. The results have various implications for experience research and development in HCI, as they demonstrate how the method can be used for product evaluation and the analysis of the mental processes, which users use to evaluate the products.","citation":[{"content":"Jussi P. P. Jokinen, Emotional user experience and feeling of control, Proceedings of the 19th International Academic Mindtrek Conference, September 22-24, 2015, Tampere, Finland","paperID":"2818284"},{"content":"Johanna M. Silvennoinen , Rebekah Rousi , Jussi P. P. Jokinen , Piia M. H. Perälä, Apperception as a multisensory process in material experience, Proceedings of the 19th International Academic Mindtrek Conference, September 22-24, 2015, Tampere, Finland","paperID":"2818285"}],"reference":[{"content":"AttrakDiff. http://attrakdiff.de/index-en.html.","paperID":"None"},{"content":"Javier A. Bargas-Avila , Kasper Hornbæk, Old wine in new bottles or novel challenges: a critical analysis of empirical studies of user experience, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979336"},{"content":"Barrett, L.F. Are emotions natural kinds? Perspectives on Psychological Science 1, 1 (2006), 28--58.","paperID":"None"},{"content":"Bloch, P.H. Seeking the ideal form: Product design and consumer response. Journal of Marketing 59, 3 (1995), 16--29.","paperID":"None"},{"content":"Bornstein, R.F. Exposure and affect: Overview and meta-analysis of research, 1968--1987. Psychological Bulletin 106, 2 (1989), 265--289.","paperID":"None"},{"content":"Brakus, J.J., Schmitt, B.H., and Zarantonello, L. Brand experience: What is it? How is it measured? Does it affect loyalty? Journal of Marketing 73, 3 (2009), 5268.","paperID":"None"},{"content":"Cohen, J. A power primer. Psychological Bulletin 112, 1 (1992), 155--159.","paperID":"None"},{"content":"Jan Hartmann , Antonella De Angeli , Alistair Sutcliffe, Framing the user experience: information biases on website quality judgement, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357190"},{"content":"Marc Hassenzahl, The interplay of beauty, goodness, and usability in interactive products, Human-Computer Interaction, v.19 n.4, p.319-349, December 2004","paperID":"1466561"},{"content":"Hassenzahl, M., Burmester, M., and Koller, F. AttrakDiff: Ein Fragebogen zur Messung wahrgenommener hedonischer und pragmatischer Qualität. In J. Ziegler and G. Szwillus (Eds.), Mensch & Computer, B. G. Teubner, Stuttgart, 2003, 187--196.","paperID":"None"},{"content":"Hassenzahl, M., and Tractinsky, N. User experience -- a research agenda. Behaviour & Information Technology 25, 2 (2006), 91--97.","paperID":"None"},{"content":"Hox, J.J. Multilevel analysis. 2nd ed. Routledge, Hove, 2010.","paperID":"None"},{"content":"Gijs Huisman , Marco van Hout , Elisabeth van Dijk , Thea van der Geest , Dirk Heylen, LEMtool: measuring emotions in visual interfaces, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470706"},{"content":"Pieter Desmet, Measuring emotion: development and application of an instrument to measure emotional responses to products, Funology: from usability to enjoyment, Kluwer Academic Publishers, Norwell, MA, 2005","paperID":"1139023"},{"content":"Desmet, P. Faces of product pleasure: 25 positive emotions in human-product interactions. Int. Journal of Design 6, 2 (2012), 2--29.","paperID":"None"},{"content":"Desmet, P. and Hekkert, P. Framework of product experience. Int. Journal of Design, 1, 1 (2007), 57--66.","paperID":"None"},{"content":"Sarah Diefenbach , Eva Lenz , Marc Hassenzahl, An interaction vocabulary. describing the how of interaction., CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468463"},{"content":"Eimer, M., and Schlaghecken, F. Links between conscious awareness and response inhibition: Evidence from masked priming. Psychonomic Bulletin & Review 9, 3 (2002), 514--520.","paperID":"None"},{"content":"Ekman, P., Basic emotions. In T. Dalgleish and M. Power (Eds.), Handbook of cognition and emotion, John Wiley & Sons, New York, 1999, 45--60.","paperID":"None"},{"content":"Ericsson, K.A., and Simon, H.A. Protocol analysis: Verbal reports as data. MIT Press, Cambridge, MA, 1984.","paperID":"None"},{"content":"Five Second Test, Click Test and Nav Flow -- UsabilityHub. https://usabilityhub.com/","paperID":"None"},{"content":"Fodor, J. Fodor's guide to mental representation. Mind, 94 (1985), 76--100.","paperID":"None"},{"content":"Frijda, N. The laws of emotion. American Psychologist 43, 5 (1988), 349--358.","paperID":"None"},{"content":"Google Analytics Official Website -- Web Analytics & Reporting. www.google.com/analytics/","paperID":"None"},{"content":"Lazarus, R.S. Emotion and adaptation. Oxford University Press, New York, 1991.","paperID":"None"},{"content":"Lindgaard, G., Fernandes, G., Dudek, C. and Brown, J. Attention web designers: You have 50 milliseconds to make a good first impression! Behavior & Information Technology 25, 2 (2006), 115--126.","paperID":"None"},{"content":"Marcel, A.J. Conscious and unconscious perception: Experiments on visual masking and word recognition. Cognitive psychology 15, 2 (1983), 197--237.","paperID":"None"},{"content":"Norman, D.A. Emotional design. Basic Books, New York, 2004.","paperID":"None"},{"content":"Eleftherios Papachristos , Nikolaos Avouris, Are first impressions about websites only related to visual appeal?, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042104"},{"content":"PrEmo. http://www.premotool.com/","paperID":"None"},{"content":"Reber, R., Schwarz, N., and Winkielman, P. Processing fluency and aesthetic pleasure: Is beauty in the perceiver's processing experience? Personality and Social Psychology Review 8, 4 (2004), 364--382.","paperID":"None"},{"content":"Roto, V., Rantavuo, H., and Väänänen-Vainio-Mattila, K. Evaluating user experience of early product concepts. In Proc DPPI09, Compiegne University of Technology (2009), 1--10.","paperID":"None"},{"content":"Saariluoma P. Apperception, content based psychology and design. In U. Lindemann (Ed.), Human behaviour in design, Springer, Berlin, 2003, 72--78.","paperID":"None"},{"content":"Saariluoma, P., and Jokinen, J.P.P. Emotional dimensions of user experience -- a user psychological analysis. Int. Journal of Human-Computer Interaction 30, 4 (2014), pp. 303--320.","paperID":"None"},{"content":"Saariluoma, P., Jokinen, J., Kuuva, S., and Leikas, J. User experience as mental contents. In Proc10th European Academy of Design Conference, Chalmers University of Technology (2013).","paperID":"None"},{"content":"Saariluoma, P., and Oulasvirta, A. User psychology: Reassessing the boundaries of a discipline. Psychology 1, 5 (2010), 317--328.","paperID":"None"},{"content":"Paul van Schaik , Jonathan Ling, The role of context in perceptions of the aesthetics of web pages over time, International Journal of Human-Computer Studies, v.67 n.1, p.79-89, January, 2009","paperID":"1465384"},{"content":"Scherer, K.R. What are emotions? And how can they be measured? Social Science Information 44, 4 (2005), 695729.","paperID":"None"},{"content":"Scherer, K.R. The dynamic architecture of emotion: Evidence for the component process model. Cognition & Emotion 23, 7 (2009), 1307--1351.","paperID":"None"},{"content":"Smith, C. A. and Ellsworth, P.C. Patterns of cognitive appraisal in emotion. Journal of Personality and Social Psychology, 48, 4 (1985), 813--838.","paperID":"None"},{"content":"Smith, C.A. and Kirby, L.D. Toward delivering on the promise of appraisal theory. In K. A. Scherer, A. Schorr,, and T. Johnstone, (Eds.), Appraisal Process in Emotion, Oxford University Press, New York, 2001, pp. 121--138.","paperID":"None"},{"content":"Optimal Workshop. http://www.optimalworkshop.com/optimalsort.htm","paperID":"None"},{"content":"Thielsch, M.T., and Hirschfeld, G. Spatial frequencies in aesthetic website evaluations -- explaining how ultrarapid evaluations are formed. Ergonomics 55, 7 (2012), 731--742.","paperID":"None"},{"content":"Thüring, M., and Mahlke, S. Usability, aesthetics and emotions in human-technology interaction. Int. Journal of Psychology 42, 4 (2007), 253--264.","paperID":"None"},{"content":"Noam Tractinsky , Avivit Cokhavi , Moti Kirschenbaum , Tal Sharfi, Evaluating the consistency of immediate aesthetic perceptions of web pages, International Journal of Human-Computer Studies, v.64 n.11, p.1071-1083, November 2006","paperID":"1225977"},{"content":"UEQ-Online. http://www.ueq-online.org/.","paperID":"None"},{"content":"UserTesting. http://www.usertesting.com/","paperID":"None"},{"content":"Arnold P. O. S. Vermeeren , Effie Lai-Chong Law , Virpi Roto , Marianna Obrist , Jettie Hoonhout , Kaisa Väänänen-Vainio-Mattila, User experience evaluation methods: current state and development needs, Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, October 16-20, 2010, Reykjavik, Iceland","paperID":"1868973"},{"content":"Zajonc, R.B. Attitudinal effects of mere exposure. Journal of Personality and Social Psychology 9, 2 (1968), pp. 1--27.","paperID":"None"},{"content":"Haotian Zhou , Xiaolan Fu, Understanding, measuring, and designing user experience: the causal relationship between the aesthetic quality of products and user affect, Proceedings of the 12th international conference on Human-computer interaction: interaction design and usability, July 22-27, 2007, Beijing, China","paperID":"1772529"}],"title":"Quick Affective Judgments: Validation of a Method for Primed Product Comparisons","filename":"CHI15/p2221","authors":["Jussi P.P. Jokinen","Johanna M. Silvennoinen","Piia M.H. Perälä","Pertti Saariluoma"],"conference":"CHI '15"}