{"paperId":2702516,"abstract":"FluxPaper is a new paper-based medium that enables physical movement and dynamic interaction between a high-power magnetized paper and a programmable magnetic field. FluxPaper has a very thin patterned magnetic layer (0.1 mm) pasted behind the paper. A thin but strong neodymium-based magnet realizes fast, powerful, and precise physical actions while retaining the original characteristics of the paper that is widely used in our daily lives. Owing to an effective magnetic pattern and a computer-controlled magnetic field, FluxPaper can add new interaction modality to ordinary paper. We describe the functions of magnetized paper; challenges through realization; and the interaction scenarios in several applications, such as self-alignment, self-construction, floating on the board, and quickly picking out a target card from a stack.","citation":[{"content":"Simon Olberding , Sergio Soto Ortega , Klaus Hildebrandt , Jürgen Steimle, Foldio: Digital Fabrication of Interactive and Shape-Changing Objects With Foldable Printed Electronics, Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2807494"}],"reference":[{"content":"3M Post-it notes, http://www.post-it.com/","paperID":"None"},{"content":"Coelho, M., Hall, L., Berzowska, J., and Maes, P. Pulpbased computing: A framework for building computers out of paper. In Proc. CHI EA '09. ACM, 3527--3528.","paperID":"None"},{"content":"Felton, S., Tolley, M., Demaine, E., Rus, D., and Wood, R. A method for building self-folding machines. Wood Science 8 August 2014: 345 (6197), 644--646.","paperID":"None"},{"content":"Figueiredo, A. C., Pinto, A. L., Branco, P., Zagalo, N., and Coquet, E. Bridging book: a not-so-electronic children's picturebook. In Proc. IDC '13. ACM, 569572.","paperID":"None"},{"content":"Girouard, A., Tarun, A., and Vertegaal, R. DisplayStacks: interaction techniques for stacks of flexible thin-film displays. In Proc. CHI '12. ACM, 2431--2440.","paperID":"None"},{"content":"Gorbet, M. G., Orth, M., and Ishii, H. Triangles: tangible interface for manipulation and exploration of digital information topography. In Proc. CHI '98, ACM Press/Addison-Wesley Publishing Co., 49--56.","paperID":"None"},{"content":"Huang, Y., and Eisenberg, M. Easigami: Virtual creation by physical folding. In Proc TEI '12. ACM, 4148.","paperID":"None"},{"content":"Kaihou, T., and Wakita, A. Electronic origami with the color-changing function. In Proc SMI '13. ACM, 7--12.","paperID":"None"},{"content":"Karagozler, M. E., Poupyrev, I., Fedder, G. K., and Suzuki, Y. Paper generators: Harvesting energy from touching, rubbing and sliding. In Proc UIST '13. ACM, 23--30.","paperID":"None"},{"content":"Kawahara, Y., Hodges, H., Cook, B. S., Zhang, C., and Abowd, G. D. Instant inkjet circuits: Lab-based inkjet printing to support rapid prototyping of UbiComp devices. In Proc. UbiComp '13. ACM, 363--372.","paperID":"None"},{"content":"Klemmer, S. R., Newman, M. W., Farrell, R., Bilezikjian, M., and Landay, J. A. The designers' outpost: A tangible interface for collaborative web site. In Proc UIST '01. ACM, 1--10.","paperID":"None"},{"content":"Koizumi, N., Yasu, K., Liu, A., Sugimoto, M., and Inami, M. Animated paper: A toolkit for building moving toys. Comput. Entertain. 8, 2, Article 7 (December 2010), 16 pages.","paperID":"None"},{"content":"Lahey, B., Girouard, A., Burleson, W., and Vertegaal, R. PaperPhone: Understanding the use of bend gestures in mobile devices with flexible electronic paper displays. In Proc. CHI '11. ACM, 1303--1312.","paperID":"None"},{"content":"Lee, J., Post, R., and Ishii, H. ZeroN: Mid-air tangible interaction enabled by computer controlled magnetic levitation. In Proc. UIST '11. ACM, 327--336.","paperID":"None"},{"content":"Mellis, D. A., Jacoby, S., Buechley, L., Perner-Wilson, H., and Qi, J. Microcontrollers as material: Crafting circuits with paper, conductive ink, electronic components, and an \"untoolkit\". In Proc. TEI '13. ACM, 83--90.","paperID":"None"},{"content":"Molycorp Magnequench MQFP Datasheet, http://www.mqitechnology.com/downloads/brochures_P DF/MQFP-Overview.pdf","paperID":"None"},{"content":"Pangaro, G., Maynes-Aminzade, D., and Ishii, H. The actuated workbench: computer-controlled actuation in tabletop tangible interfaces. In Proc. UIST '02. ACM, 181--190.","paperID":"None"},{"content":"Probst, K., Haller, M., Yasu, K., Sugimoto, M., and Inami, M. Move-it sticky notes providing active physical feedback through motion. In Proc. TEI '14. ACM, 29--36.","paperID":"None"},{"content":"Qi, J., and Buechley, L. Animating paper using shape memory alloys. In Proc. CHI '12. ACM, 749--752.","paperID":"None"},{"content":"Qi, J., and Buechley, L. Sketching in circuits: designing and building electronics on paper. In Proc. CHI '14. ACM, 1713--1722.","paperID":"None"},{"content":"Saul, G., Xu, C., and Gross, M. D. Interactive paper devices: end-user design & fabrication. In Proc TEI '10. ACM, 205--212.","paperID":"None"},{"content":"Shorter, M., Rogers, J., and McGhee, J. Enhancing everyday paper interactions with paper circuits. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, 39--42.","paperID":"None"},{"content":"Tsuji, K., and Wakita, A. Anabiosis: An interactive pictorial art based on polychrome paper computing. In Proc ACE '11, ACM, Article 80, 2 pages.","paperID":"None"},{"content":"Wakita, A., Nakano, A., and Kobayashi, N. Programmable blobs: A rheologic interface for organic shape design. In Proc. TEI '11. ACM, 273--276.","paperID":"None"},{"content":"Weiss, M., Schwarz, F., Jakubowski, S., and Borchers, J. Madgets: Actuating widgets on interactive tabletops. In Proc UIST '10. ACM, 293--302.","paperID":"None"},{"content":"Yao, L., Niiyama, R., Ou, J., Follmer, S., Silva, C. D., and Ishii, H. PneUI: Pneumatically actuated soft composite materials for shape changing interfaces. In Proc. UIST '13. ACM, 13--22.","paperID":"None"},{"content":"Yasu, K., and Inami, M. POPAPY: Instant paper craft made up in a microwave oven. In Proc. ACE'12, Springer-Verlag, 406--420.","paperID":"None"},{"content":"Zhu, K., Nii, H., Fernando, O., and Cheok, A. D. Selective inductive powering system for paper computing. In Proc. ACE '11. ACM, Article 59, 7 pages.","paperID":"None"},{"content":"Zhu, K., and Zhao, S. AutoGami: A low-cost rapid prototyping toolkit for automated movable paper craft. In Proc. CHI '13. ACM, pp. 661--670.","paperID":"None"}],"title":"FluxPaper: Reinventing Paper with Dynamic Actuation Powered by Magnetic Flux","filename":"CHI15/p29","authors":["Masa Ogata","Masaaki Fukumoto"],"conference":"CHI '15"}