{"paperId":2702299,"citation":[{"content":"Majeed Kazemitabaar , Leyla Norooz , Mona Leigh Guha , Jon E. Froehlich, MakerShoe: towards a wearable e-textile construction kit to support creativity, playful making, and self-expression, Proceedings of the 14th International Conference on Interaction Design and Children, p.449-452, June 21-24, 2015, Boston, Massachusetts","paperID":"2771883"},{"content":"Renaud Gervais , Jérémy Frey , Alexis Gay , Fabien Lotte , Martin Hachet, TOBE: Tangible Out-of-Body Experience, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2839486"}],"reference":[{"content":"Antle, A.N. and Wise, A.F. Getting Down to Details: Using Theories of Cognition and Learning to Inform Tangible User Interface Design. Interacting with Computers 25, 1 (2013), 1--20.","paperID":"None"},{"content":"Michael Bajura , Henry Fuchs , Ryutarou Ohbuchi, Merging virtual objects with the real world: seeing ultrasound imagery within the patient, ACM SIGGRAPH Computer Graphics, v.26 n.2, p.203-210, July 1992","paperID":"134061"},{"content":"Blum, L.H. Health information via mass media: Study of the individual's concepts of the body and its parts. Psychological Reports 40, (1977), 991--999.","paperID":"None"},{"content":"Tobias Blum , Valerie Kleeberger , Christoph Bichlmeier , Nassir Navab, mirracle: An augmented reality magic mirror system for anatomy education, Proceedings of the 2012 IEEE Virtual Reality, p.115-116, March 04-08, 2012","paperID":"2224747"},{"content":"Brasell, H. The effect of real-time laboratory graphing on learning graphic representations of distance and velocity. Journal of Research in Science Teaching 24, 4 (1987), 385--395.","paperID":"None"},{"content":"Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.","paperID":"None"},{"content":"Sunny Consolvo , David W. McDonald , Tammy Toscos , Mike Y. Chen , Jon Froehlich , Beverly Harrison , Predrag Klasnja , Anthony LaMarca , Louis LeGrand , Ryan Libby , Ian Smith , James A. Landay, Activity sensing in the wild: a field trial of ubifit garden, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357335"},{"content":"Cuthbert, A. Do Children Have a Holistic View Of Their Internal Body Maps. The School Science Review 82, 299 (2000), 25--32.","paperID":"None"},{"content":"Eston, R., Rowlands, A., and Ingledew, D. Validity of heart rate, pedometry, and accelerometry for predicting the energy cost of children's activities. J. of Appl. Physiology 84, 1 (1998), 362--71.","paperID":"None"},{"content":"Morten Fjeld , Daniel Hobi , Lukas Winterthaler , Benedikt Voegtli , Patrick Juchli, Teaching Electronegativity and Dipole Moment in a TUI, Proceedings of the IEEE International Conference on Advanced Learning Technologies, p.792-794, August 30-September 01, 2004","paperID":"1020120"},{"content":"Garcia-Barros, S., Martínez-Losada, C., and Garrido, M. What do Children Aged Four to Seven Know about the Digestive System and the Respiratory System of the Human Being and of Other Animals' Intl. J. of Sci Edu 33, 15 (2011), 2095--2122.","paperID":"None"},{"content":"Gatt, S. and Saliba, M. Young Children's Ideas About the Heart. 3rd Intl. Conference on Hands-On Science, (2006), 17--23.","paperID":"None"},{"content":"Gellert, E. Children's Conceptions of the Content and Functions of the Human Body. Genetic Psych. Mono. 65, (1962), 293--405.","paperID":"None"},{"content":"Gillet, A., Sanner, M., Stoffler, D., Olson, A. Tangible interfaces for structural molecular biology. Structure 13, 3 (2005), 483--91.","paperID":"None"},{"content":"Guha, M., Druin, A., Fails, J. Cooperative Inquiry revisited: Reflections of the past and guidelines for the future. Intl J ChildComputer Interaction 1, 1 (2013), 14--23.","paperID":"None"},{"content":"Hailstone, J. and Kilding, A.E. Reliability and Validity of the ZephyrTM BioHarnessTM to Measure Respiratory Responses to Exercise. Meas. Phys Edu & Exercise Sci 15, 4 (2011), 293--300.","paperID":"None"},{"content":"Hmelo-Silver, C.E., Marathe, S., and Liu, L. Fish Swim, Rocks Sit, and Lungs Breathe: Expert-Novice Understanding of Complex Systems. J. Learning Sciences 16, 3 (2007), 307--331.","paperID":"None"},{"content":"Hruschka, D.J., Schwartz, D., et al. Reliability in Coding OpenEnded Data: Lessons Learned from HIV Behavioral Research. Field Methods 16 , 3 (2004), 307--331.","paperID":"None"},{"content":"Kim, J.-H., Roberge, R., et al. Measurement Accuracy of Heart Rate and Respiratory Rate during Graded Exercise and Sustained Exercise in the Heat Using the Zephyr BioHarnessTM. Intl. Journal of Sports Medicine 34, 06 (2013), 497--501.","paperID":"None"},{"content":"Krippendorff, K.H. Content Analysis: An Introduction to Its Methodology. Sage Publications, Inc, 2003.","paperID":"None"},{"content":"Lam, N. and Ngo, S. Warning Signs. NYU's ITP, 2010. http://blog.nienlam.com/2010/12/19/warning-signs/.","paperID":"None"},{"content":"Victor R. Lee , Joel Drake, Quantified recess: design of an activity for elementary students involving analyses of their own movement data, Proceedings of the 12th International Conference on Interaction Design and Children, p.273-276, June 24-27, 2013, New York, New York, USA","paperID":"2485822"},{"content":"Lee, V.R. and DuMont, M. An Exploration into How Physical Activity Data-Recording Devices Could be Used in ComputerSupported Data Investigations. International Journal of Computers for Mathematical Learning 15, 3 (2010), 167--189.","paperID":"None"},{"content":"Lee, V.R. and Thomas, J.M. Integrating physical activity data technologies into elementary school classrooms. Educational Technology Research and Development 59, 6 (2011), 865--884.","paperID":"None"},{"content":"Paul Marshall, Do tangible interfaces enhance learning?, Proceedings of the 1st international conference on Tangible and embedded interaction, February 15-17, 2007, Baton Rouge, Louisiana","paperID":"1227004"},{"content":"Meng, M., Fallavollita, P., Blum, T., et al. Kinect for interactive AR anatomy learning. Proc. of ISMA'13, 277--278.","paperID":"None"},{"content":"Leyla Norooz , Jon Froehlich, Exploring early designs for teaching anatomy and physiology to children using wearable e-textiles, Proceedings of the 12th International Conference on Interaction Design and Children, p.577-580, June 24-27, 2013, New York, New York, USA","paperID":"2485869"},{"content":"Osborne, J., Wadsworth, P., and Black, P. Primary SPACE Research Research Report: Processes of Life. Liverpool University Press, Liverpool, UK, 1992.","paperID":"None"},{"content":"Óskarsdóttir, G. The development of children's ideas about the body: How these ideas change in a teaching environment. PhD Dissertation, Univ. of Iceland, Social Sciences, (2006), 1--240.","paperID":"None"},{"content":"Schmidt, C.K. Development of Children's Body Knowledge, Using Knowledge of the Lungs as An Exemplar. Issues in Comprehensive Pediatric Nursing 24, 3 (2001), 177--191.","paperID":"None"},{"content":"Schmidt, C.K. Comparison of three teaching methods on 4--7 year old children's understanding of the lungs in relation to a peak flow meter in the management of asthma: A pilot study. Journal of Asthma 39, 7 (2002), 641--648.","paperID":"None"},{"content":"Tinker, R.F. and Papert, S. Tools for Science Education. In J.D. Ellis, ed., Information Technology & Sci Education. 1988 Assoc. for the Ed. of Teachers in Sci. Yearbook. Columbus, OH, 1989.","paperID":"None"},{"content":"Tonkin, A. Inside Story. Nursery World, 2007. http://www.nurseryworld.co.uk/news/722623/Inside-story.","paperID":"None"},{"content":"B. Ullmer , H. Ishii, Emerging frameworks for tangible user interfaces, IBM Systems Journal, v.39 n.3-4, p.915-931, July 2000","paperID":"1011452"},{"content":"Vessey, J., Braithwaite, K., & Widemann, M. Teaching Children About Their Internal Bodies. Ped. Nursing 16, 1 (1990), 29--33.","paperID":"None"},{"content":"Vessey, J.A. Comparison of two teaching methods on children's knowledge of their internal bodies. Nursing Research 37, 5 (1988), 262--267.","paperID":"None"},{"content":"Weaver, L.T., Austin, S., and Cole, T.J. Small intestinal length: a factor essential for gut adaptation. Gut 32, 11 (1991), 1321--3.","paperID":"None"},{"content":"Weaver, L.T. and Steiner, H. The bowel habit of young children. Archives of Disease in Childhood 59, 7 (1984), 649--652.","paperID":"None"},{"content":"Koji Yatani , Khai N. Truong, BodyScope: a wearable acoustic sensor for activity recognition, Proceedings of the 2012 ACM Conference on Ubiquitous Computing, September 05-08, 2012, Pittsburgh, Pennsylvania","paperID":"2370269"},{"content":"Zephyr Inc. Zephyr BioHarness 3: Model BH3. 2014. http://www.zephyranywhere.com/products/bioharness-3/.","paperID":"None"},{"content":"Zucker, A.A., Tinker, R., et. al. Learning Science in Grades 3-8 Using Probeware and Computers: Findings from the TEEMSS II Project. J. of Sci Education & Technology 17, 1 (2007), 42--48.","paperID":"None"}],"abstract":"Internal organs are hidden and untouchable, making it difficult for children to learn their size, position, and function. Traditionally, human anatomy (body form) and physiology (body function) are taught using techniques ranging from worksheets to three-dimensional models. We present a new approach called BodyVis, an e-textile shirt that combines biometric sensing and wearable visualizations to reveal otherwise invisible body parts and functions. We describe our 15-month iterative design process including lessons learned through the development of three prototypes using participatory design and two evaluations of the final prototype: a design probe interview with seven elementary school teachers and three single-session deployments in after-school programs. Our findings have implications for the growing area of wearables and tangibles for learning.","title":"BodyVis: A New Approach to Body Learning Through Wearable Sensing and Visualization","filename":"CHI15/p1025","authors":["Leyla Norooz","Matthew Louis Mauriello","Anita Jorgensen","Brenna McNally","Jon E. Froehlich"],"conference":"CHI '15"}