{"paperId":2702376,"abstract":"Visual history tools provide visual representations of the workflow during data analysis tasks. While there is an established need for reviewing analytic processes, and many visual history tools provide visualizations to do so, it is not well known how helpful the tools actually are for process recall. Through a controlled experiment, we evaluated how the presence of a visual history aid and varying levels of visual detail affect process memory. Participants conducted an analysis task using a visual text-document analysis tool. We evaluated their memories of the process both immediately after the analysis and then again one week later. Results showed that even visual history views with reduced data-resolution were effective for aiding process memory. Further, even without inclusion of any data in the visual history aids, the visual cues alone from the final workspace were enough to improve memory of the main themes of analyses.","citation":[],"reference":[{"content":"Ahern, S. Scientific discovery at the exascale. Houston, TX, 2011.","paperID":"None"},{"content":"Christopher Andrews , Alex Endert , Chris North, Space to think: large high-resolution displays for sensemaking, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753336"},{"content":"Steven P. Callahan , Juliana Freire , Emanuele Santos , Carlos E. Scheidegger , Cláudio T. Silva , Huy T. Vo, VisTrails: visualization meets data management, Proceedings of the 2006 ACM SIGMOD international conference on Management of data, June 27-29, 2006, Chicago, IL, USA","paperID":"1142574"},{"content":"Czerwinski, M. and Horvitz, E. An investigation of memory for daily computing events. People and Computers XVI-Memorable Yet Invisible (2002), 229245.","paperID":"None"},{"content":"Del Rio, N. and da Silva, P. P. Identifying and explaining map imperfections through knowledge provenance visualization. University of Texas at El Paso, 2007.","paperID":"None"},{"content":"Cody Dunne , Nathalie Henry Riche , Bongshin Lee , Ronald Metoyer , George Robertson, GraphTrail: analyzing large multivariate, heterogeneous networks while supporting exploration history, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208293"},{"content":"Juliana Freire , David Koop , Emanuele Santos , Cláudio T. Silva, Provenance for Computational Tasks: A Survey, Computing in Science and Engineering, v.10 n.3, p.11-21, May 2008","paperID":"1399195"},{"content":"David Gotz , Michelle X. Zhou, Characterizing users' visual analytic activity for insight provenance, Information Visualization, v.8 n.1, p.42-55, January 2009","paperID":"1598932"},{"content":"Grinstein, G., Konecni, S., Plaisant, C., Scholtz, J. and Whiting, M. VAST 2010 challenge: arms dealings and pandemics. IEEE Symposium on Visual Analytics Science and Technology (VAST), (2010), 263--264.","paperID":"None"},{"content":"Dennis P. Groth , Kristy Streefkerk, Provenance and Annotation for Visual Exploration Systems, IEEE Transactions on Visualization and Computer Graphics, v.12 n.6, p.1500-1510, November 2006","paperID":"1176162"},{"content":"Jeffrey Heer , Jock Mackinlay , Chris Stolte , Maneesh Agrawala, Graphical Histories for Visualization: Supporting Analysis, Communication, and Evaluation, IEEE Transactions on Visualization and Computer Graphics, v.14 n.6, p.1189-1196, November 2008","paperID":"1477414"},{"content":"Jeffrey Heer , Ben Shneiderman, Interactive Dynamics for Visual Analysis, Queue, v.10 n.2, February 2012","paperID":"2146416"},{"content":"Hess, S. M., Detweiler, M. C. and Ellis, R. D. The Utility of Display Space in Keeping Track of Rapidly Changing Information. Human Factors: The Journal of the Human Factors and Ergonomics Society, 41, 2 (1999), 257--281.","paperID":"None"},{"content":"W. Javed , N. Elmqvist, ExPlates: spatializing interactive analysis to scaffold visual exploration, Proceedings of the 15th Eurographics Conference on Visualization, June 17-21, 2013, Leipzig, Germany","paperID":"2600595"},{"content":"Kadivar, N., Chen, V., Dunsmuir, D., Lee, E., Qian, C., Dill, J., Shaw, C. and Woodbury, R. Capturing and supporting the analysis process. IEEE Symposium on Visual Analytics Science and Technology (2009), 131138.","paperID":"None"},{"content":"David Kirsh, The context of work, Human-Computer Interaction, v.16 n.2, p.305-322, December 2001","paperID":"1463120"},{"content":"David Kirsh, The intelligent use of space, Artificial Intelligence, v.73 n.1-2, p.31-68, Feb. 1995","paperID":"201248"},{"content":"Guangxia Li , Andrew C. Bragdon , Zhigeng Pan , Mingmin Zhang , Sharon M. Swartz , David H. Laidlaw , Chaoyang Zhang , Hanyu Liu , Jian Chen, VisBubbles: a workflow-driven framework for scientific data analysis of time-varying biological datasets, SIGGRAPH Asia 2011 Posters, December 12-15, 2011, Hong Kong, China","paperID":"2073333"},{"content":"Lipford, H. R., Stukes, F., Dou, W., Hawkins, M. E. and Chang, R. Helping users recall their reasoning process. IEEE Symposium on Visual Analytics Science and Technology (VAST) (2010), 187--194.","paperID":"None"},{"content":"Youngjoo Park , Richard Furuta, Keeping narratives of a desktop to enhance continuity of on-going tasks, Proceedings of the 8th ACM/IEEE-CS joint conference on Digital libraries, June 16-20, 2008, Pittsburgh PA, PA, USA","paperID":"1378960"},{"content":"Pirolli, P. and Card, S. The sensemaking process and leverage points for analyst technology as identified through cognitive task analysis. Proc. International Conference on Intelligence Analysis, 5 (2005).","paperID":"None"},{"content":"Pylyshyn, Z. The role of location indexes in spatial perception: A sketch of the FINST spatial-index model. Cognition, 32, 1 (1989), 65--97.","paperID":"None"},{"content":"Ragan, E. D., Bowman, D. A. and Huber, K. J. Supporting Cognitive Processing with Spatial Information Presentations in Virtual Environments. Virtual Reality, 15, 2--3 (2012), 301--314.","paperID":"None"},{"content":"Eric D. Ragan , John R. Goodall, Evaluation methodology for comparing memory and communication of analytic processes in visual analytics, Proceedings of the Fifth Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization, November 10-10, 2014, Paris, France","paperID":"2669563"},{"content":"Eric D. Ragan, The effects of higher levels of immersion on procedure memorization performance and implications for educational virtual environments, Presence: Teleoperators and Virtual Environments, v.19 n.6, p.527-543, December 2010","paperID":"1971106"},{"content":"George Robertson , Mary Czerwinski , Kevin Larson , Daniel C. Robbins , David Thiel , Maarten van Dantzich, Data mountain: using spatial memory for document management, Proceedings of the 11th annual ACM symposium on User interface software and technology, p.153-162, November 01-04, 1998, San Francisco, California, USA","paperID":"288596"},{"content":"Shrout, P. E. and Fleiss, J. L. Intraclass correlations: uses in assessing rater reliability. Psychological Bulletin, 86, 2 (1979), 420--428.","paperID":"None"},{"content":"Stemler, S. E. and Tsai, J. Best practices in interrater reliability: Three common approaches. Sage Publications, 2008.","paperID":"None"},{"content":"Treisman, A. M. and Gelade, G. A feature-integration theory of attention. Cognitive psychology, 12, 1 (1980), 97--136.","paperID":"None"},{"content":"Tulving, E. What Is Episodic Memory? Current Directions in Psychological Science, 2, 3 (1993), 6770.","paperID":"None"},{"content":"Tulving, E. and Osler, S. Effectiveness of retrieval cues in memory for words. Journal of experimental psychology, 77, 4 (1968), 593--601.","paperID":"None"}],"title":"Evaluating How Level of Detail of Visual History Affects Process Memory","filename":"CHI15/p2711","authors":["Eric D. Ragan","John R. Goodall","Albert Tung"],"conference":"CHI '15"}