{"paperId":2702454,"abstract":"The accurate classification of psychophysiological data is an important determinant of the quality when interacting with a physiological computing system. Previous research has focused on classification accuracy of psychophysiological data in purely mathematical terms but little is known about how accuracy metrics relate to users' perceptions of accuracy during real-time interaction. A group of 14 participants watched a series of movie trailers and were asked to subjectively indicate their level of interest in a binary high/low fashion. Psychophysiological data (EEG, ECG and SCL) were used to create a binary classification of interest via a Support Vector Machine (SVM) algorithm. After a period of training, participants received real-time feedback from the classification algorithm and perceptions of accuracy were assessed. The purpose of the study was to compare mathematical classification accuracy with the perceived accuracy of the system as experienced by the users. Results indicated that perceived accuracy was subject to a number of psychological biases resulting from expectations, entrainment and development of trust. The F1 score was generally a significant predictor of perceived accuracy.","citation":[],"reference":[{"content":"Soleymani, M, Pantic, M & Pun, T. 2012. Multimodal emotion recognition in response to videos. IEEE Transactions on Affective Computing, 3(2), 211--223.","paperID":"None"},{"content":"Soleymani, M. & Pantic, M. 2012. Human-centred implicit tagging: overview and perspectives. In Proceedings of the 2012 IEEE International Conference on Systems, Man and Cybernetics, 3304--3309.","paperID":"None"},{"content":"Gilroy, S. W., Porteous, J., Charles, F., Cavazza, M., Soreq, E., Raz, G., Ikar, L., Or-Borichov, A., Ben-Arie, U., Klovatch, I. & Hendler, T. (2013). A BrainComputer Interface to a Plan-Based Narrative. In F. Rossi (ed.), IJCAI, 633--2","paperID":"None"},{"content":"Fairclough, S.H. 2009. Fundamentals of physiological computing. Interacting With Computers, 21, 133--145.","paperID":"None"},{"content":"Fairclough, S.H. & Gilleade, K.E. 2012. Construction of the biocybernetic loop: a case study. In Proceedings of the 14th ACM international conference on Multimodal interaction (ICMI '12). ACM, New York, NY, USA, 571--578.","paperID":"None"},{"content":"Koelstra, S., Mühl, C., Soleymani, M., Lee, J., Yazdani, A., Ebrahimi, T, Pun, T., Nijholt, A., and Patras, I. 2012. DEAP: A Database for Emotion Analysis ;Using Physiological Signals. IEEE Transactions on Affective Computing, 3(1), 18--31.","paperID":"None"},{"content":"Russell, J.A. 1980. A circumplex model of affect. Journal of Personality and Social Psychology, 39(6), 1161--1178.","paperID":"None"},{"content":"van der Zwaag, M.D., Janssen, J.H & Westerink, J.H.D.M. 2013. Directing physiology and mood through music: validation of an affective music Player, IEEE Transactions on Affective Computing, 4(1), 57--68.","paperID":"None"},{"content":"Karran, A.J., Fairclough, S.H. and Gilleade, K.E. 2013. Towards an adaptive cultural heritage experience using physiological computing. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 1683--1688.","paperID":"None"},{"content":"Karran, A.J. & Kreplin, U. 2014. The drive to explore: physiological computing in a cultural heritage context. In Fairclough, S.H. & Gilleade, K. (Eds.) Advances in Physiological Computing. Springer. 169--195.","paperID":"None"},{"content":"Novak, D., Mihelj, M. & Munih, M. 2012. A survey of methods for data fusion and system adaptation using autonomic nervous system responses in physiological computing. Interacting With Computers, 24, 154--172.","paperID":"None"},{"content":"Lotte, F., Congedo, M., Lécuyer, A., Lamarche, F. & Arnaldi, B. 2007. A review of classification algorithms for EEG-based Brain-Computer Interfaces. Journal of Neural Engineering, 4, R1-R13.","paperID":"None"},{"content":"Miller, C. A. 2005. Trust in adaptive automation: The role of etiquette in tuning trust via analogic and affective methods. Paper presented at the First International Conference on Augmented Cognition, Las Vegas, NV.","paperID":"None"},{"content":"Van de Laar, B, Bos Plass-Oude, D., Reuderink, B., Poels, M. & Nijholt, A. 2013. How much control is enough? Influence of unreliable input on user experience. IEEE Transactions on Cybernetics, 43(6), 1584--1592.","paperID":"None"},{"content":"Novak, D., Nagle, A. & Riener, R. 2014. Linking recognition accuracy and user experience in an affective feedback loop. IEEE Transactions on Affective Computing, 5(2), 168--172.","paperID":"None"},{"content":"Ramnani, N. & Owen, A.M. 2004. Anterior prefrontal cortex: insights into function from anatomy and neuroimaging. Nature Reviews Neuroscience, 5, 184--194.","paperID":"None"},{"content":"Coan J.A., Allen J.J. 2004. Frontal EEG asymmetry as a moderator and mediator of emotion. Biological Psychology. 67(1) 7--49.","paperID":"None"},{"content":"Platt J.C. 1999. Fast training of support vector machines using sequential minimal optimization. In Advances in kernel methods, Bernhard Schlkopf, Christopher J. C. Burges, and Alexander J. Smola (Eds.). MIT Press, Cambridge, MA, USA 185--208","paperID":"None"},{"content":"Isaksson, A., Wallman, M., Göransson, H. & Gustafsson, M.G. 2008. \"Cross-validation and bootstrapping are unreliable in small sample classification\". Pattern Recognition Letters, 29(14), 1960--1965","paperID":"None"},{"content":"Kelley, J. F., \"An iterative design methodology for userfriendly natural language office information applications\". ACM Transactions on Office Information Systems, March 1984, 2:1, pp. 26--41","paperID":"None"}],"title":"Classification Accuracy from the Perspective of the User: Real-Time Interaction with Physiological Computing","filename":"CHI15/p3029","authors":["Stephen H. Fairclough","Alexander J. Karran","Kiel Gilleade"],"conference":"CHI '15"}