{"paperId":2702195,"abstract":"Websites can record individual users' activities and display them in a variety of ways. There is a tradeoff between detail and abstraction in visualization, especially when the amount of content increases and becomes more difficult to process. We conducted an experiment on Mechanical Turk varying the quality, detail, and visual presentation of information about an individual's past work to see how these design features affected perceptions of the worker. We found that providing detail in the display through text increased processing time and led to less positive evaluations. Visually abstract displays required less processing time but decreased confidence in evaluation. This suggests that different design parameters may engender differing psychological processes that influence reactions towards an unknown person.","reference":[{"content":"Shaaron Ainsworth, The functions of multiple representations, Computers & Education, v.33 n.2-3, p.131-152, Sept/Nov. 1999","paperID":"333450"},{"content":"Alter, A.L. and Oppenheimer, D.M. Uniting the tribes of fluency to form a metacognitive nation. Personality and Social Psychology Review 13, 3 (2009), 219--235.","paperID":"None"},{"content":"Berger, C.R. and Calabrese, R.J. Some explorations in initial interaction and beyond: Toward a developmental theory of interpersonal communication. Human Communication Research 1, 2 (1975), 99--112.","paperID":"None"},{"content":"Bontcheva, K. and Rout, D. Making sense of social media streams through semantics: a survey. Semantic Web Journal, (2012), 373--403.","paperID":"None"},{"content":"Counts, S. and Fisher, K. Taking it all in? Visual attention in microblog consumption. In Proc. ICWSM (2011), 97--104.","paperID":"None"},{"content":"Jessica Hullman , Eytan Adar , Priti Shah, Benefitting InfoVis with Visual Difficulties, IEEE Transactions on Visualization and Computer Graphics, v.17 n.12, p.2213-2222, December 2011","paperID":"2068622"},{"content":"DoHyoung Kim , Frank M. Shipman, III, Visualizing history to improve users' location and comprehension of collaborative work, Proceedings of the 17th ACM international conference on Supporting group work, October 27-31, 2012, Sanibel Island, Florida, USA","paperID":"2389179"},{"content":"Q. Vera Liao , Wai-Tat Fu, Expert voices in echo chambers: effects of source expertise indicators on exposure to diverse opinions, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557240"},{"content":"Norton, M.I., Frost, J.H., and Ariely, D. Less is more: the lure of ambiguity, or why familiarity breeds contempt. Journal of Personality and Social Psychology 92, 1 (2007), pp. 97--105.","paperID":"None"},{"content":"Leif Singer , Fernando Figueira Filho , Brendan Cleary , Christoph Treude , Margaret-Anne Storey , Kurt Schneider, Mutual assessment in the social programmer ecosystem: an empirical investigation of developer profile aggregators, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441791"},{"content":"Stephan, E., Liberman, N., and Trope, Y. The effects of time perspective and level of construal on social distance. Journal of Experimental Social Psychology 47(2), (2011), pp. 397--402.","paperID":"None"},{"content":"Ramona Su Thompson , Esa M. Rantanen , William Yurcik , Brian P. Bailey, Command line or pretty lines?: comparing textual and visual interfaces for intrusion detection, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240807"},{"content":"Tsai, C.I. and McGill, A.L. No pain, no gain? How fluency and construal level affect consumer confidence. Journal of Consumer Research 37, 5 (2011), 807--821.","paperID":"None"}],"citation":[],"title":"Exploring the Role of Activity Trace Design on Evaluations of Online Worker Quality","filename":"CHI15/p1617","authors":["Jennifer Marlow","Laura A. Dabbish","Jodi L. Forlizzi"],"conference":"CHI '15"}