{"paperId":2702384,"citation":[],"reference":[{"content":"Ahtinen, A., Isomursu, M., Huhtala, Y., and Kaasinen, J. Tracking Outdoor Sports -- User Experience Perspective. Ambient Intelligence, (2008), 192--209.","paperID":"None"},{"content":"Ahtinen, A., Ramiah, S., Blom, J., and Isomursu, M. Design of Mobile Wellness Applications: Identifying Cross-Cultural Factors. in Proc. OzCHI, ACM Press (2008), 164--171.","paperID":"None"},{"content":"Ainsworth, B.E., Sternfeld, B., Slattery, M.L., Daguisé, V., and Zahm, S.H. Physical activity and breast cancer: evaluation of physical activity assessment methods. Cancer 83, 3 Suppl (1998), 611--20.","paperID":"None"},{"content":"Albinali, F., Intille, S., Haskell, W., and Rosenberger, M. Using wearable activity type detection to improve physical activity energy expenditure estimation. In Proc. UbiComp 2010, ACM Press (2010), 311.","paperID":"None"},{"content":"Annesi, J.J. Effects of music, television, and a combination entertainment system on distraction, exercise adherence, and physical output in adults. Can. J. of Behavioural Science 33, 3 (2001) 193.","paperID":"None"},{"content":"Anshel, M.H. and Marisi, D.Q. Effect of Music and Rhythm on Physical Performance. Res. Quart. Am. All. for Health, Phys. Ed. and Rec. 49, 2 (1978), 109--113.","paperID":"None"},{"content":"Bardram, J.E. Plans as Situated Action: An Activity Theory Approach to Workflow Systems. In Proc. ECSCW 1997, Springer (1997), 17--32.","paperID":"None"},{"content":"Baumer, E.P.S., Ames, M.G., Brubaker, J.R., Burrell, J., and Dourish, P. Refusing, Limiting, Departing: Why We Should Study Technology Non-use. In Proc. CHI EA 2014, ACM Press (2014), 65--68.","paperID":"None"},{"content":"Blythe, M. and Monk, A. Notes towards an ethnography of domestic technology. In Proc. DIS 2002, ACM Press (2002), 277.","paperID":"None"},{"content":"Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.","paperID":"None"},{"content":"Brown, B., McGregor, M., and Laurier, E. iPhone in Vivo: Video Analysis of Mobile Device Use. In Proc. CHI 2013, ACM (2013), 1031--1040.","paperID":"None"},{"content":"Buttussi, F., Chittaro, L., and Nadalutti, D. Bringing mobile guides and fitness activities together: a solution based on an embodied virtual trainer. In Proc. Mobile HCI 2006, ACM. (2006), 29--36.","paperID":"None"},{"content":"Cobb, L.E., Stone, W.J., Anonsen, L.J., and Klein, D. a. The Influence of Goal Setting on Exercise Adherence. J. of Health Ed. 31, 5 (2000), 277--281.","paperID":"None"},{"content":"Consolvo, S., Harrison, B., Smith, I., et al. Conducting In Situ Evaluations for and With Ubiquitous Computing Technologies. IJHCI 22, 1--2 (2007), 103--118.","paperID":"None"},{"content":"Consolvo, S., Libby, R., Smith, I., et al. Activity sensing in the wild. In Proc. CHI 2008, ACM Press (2008), 1797.","paperID":"None"},{"content":"Corbin, J.M. and Strauss, A. Grounded theory research: Procedures, canons, and evaluative criteria. Qual. Soc. 13, 1 (1990), 3--21.","paperID":"None"},{"content":"Csikszentmihalyi, M. and Csikszentmihalyi, S. Optimal Experience: Psychological Studies of Flow in Consciousness. Cambridge University Press, 1992.","paperID":"None"},{"content":"Dourish, P. What we talk about when we talk about context. Per. and Ubiq. Comput. 8, 1 (2004), 19--30.","paperID":"None"},{"content":"Fritz, T., Huang, E.M., Murphy, G.C., and Zimmermann, T. Persuasive Technology in the Real World: A Study of Long-Term Use of Activity Sensing Devices for Fitness. In Proc. CHI 2014, ACM (2014), 487--496.","paperID":"None"},{"content":"Future Fit Training. The UK Fitness Industry Report commentary. 2013. http://www.futurefit.co.uk/personaltraining/news-and-views/2013/10/02/uk-fitnessindustry-report/.","paperID":"None"},{"content":"Gittleson, K. BBC News - Can Nike's Fuelband really motivate you to exercise? 2013. http://www.bbc.co.uk/news/technology-24543910","paperID":"None"},{"content":"Goodman, E. Seeing fit: Visualizing physical activity in context. In Proc. CHI EA 2006, ACM (2006), 797--802.","paperID":"None"},{"content":"Gupta, N. and Jilla, S. Digital Fitness Connector: Smart Wearable System. In Proc. ICI 2011, IEEE (2011), 118--121.","paperID":"None"},{"content":"Hartson, H.R. and Pyla, P.S. The UX Book: process and guidelines for ensuring a quality user experience. Elsevier, Amsterdam; Boston, 2012.","paperID":"None"},{"content":"Holtzblatt, K. and Jones, S. Contextual inquiry: A participatory technique for system design. Participatory design, (1993), 180--193.","paperID":"None"},{"content":"Karageorghis, C.I. and Priest, D.-L. Music in the exercise domain: a review and synthesis (Part I). Int. Review of sport and exercise psych. 5, 1 (2012), 44--66.","paperID":"None"},{"content":"Lin, J.J., Mamykina, L., Lindtner, S., Delajoux, G., and Strub, H.B. Fish ' n ' Steps: Encouraging Physical Activity with an Interactive Computer Game. UbiComp (2006), 261--278.","paperID":"None"},{"content":"Moran, T.P. and Dourish, P. Introduction to this special issue on context-aware computing. HCI 16, 2-4 (2001), 87--95.","paperID":"None"},{"content":"Nylander, S., Tholander, J., Mueller, F., and Marshall, J. HCI and sports. In Proc. CHI EA 2014, ACM Press (2014), 115--118.","paperID":"None"},{"content":"O'Kane, A.A., Rogers, Y., and Blandford, A.E. Gaining empathy for non-routine mobile device use through autoethnography. In Proc. CHI 2014, ACM Press (2014), 987--990.","paperID":"None"},{"content":"Oulasvirta, A., Kurvinen, E., and Kankainen, T. Understanding Contexts by Being There: Case Studies in Bodystorming. Per. Ubiq. Comput. 7, 2 (2003), 125--134.","paperID":"None"},{"content":"Pelletier, Luc G., Michelle S. Fortier, Robert J. Vallerand, Kim M. Tuson, Nathalie M. Briere, M.R.B. Toward a new measure of intrinsic motivation, extrinsic motivation, and amotivation in sports: The Sport Motivation Scale (SMS). J. Sport & Exercise Psych. 17, 35--53.","paperID":"None"},{"content":"Petosa, R.L. and Holtz, B. Flow for Exercise Adherence: Testing an Intrinsic Model of Health Behavior. Amer. J. Health Edu. 44, 5 (2013), 273--277.","paperID":"None"},{"content":"Potteiger, J.A., Schroeder, J.M., and Goff, K.L. Influence of music on ratings of perceived exertion during 20 minutes of moderate intensity exercise. Perceptual and motor skills 91, 3 Pt 1 (2000), 848--54.","paperID":"None"},{"content":"Rogers, Y. Interaction design gone wild: striving for wild theory. Interactions 18, 4 (2011), 58.","paperID":"None"},{"content":"Rooksby, J., Rost, M., Morrison, A., and Chalmers, M.C. Personal tracking as lived informatics. In Proc. CHI 2014, (2014), 1163--1172.","paperID":"None"},{"content":"Satchell, C. and Dourish, P. Beyond the User: Use and Non-use in HCI. In Proc. OZCHI 2009, ACM (2009), 9--16.","paperID":"None"},{"content":"Speck, B.J. and Looney, S.W. Effects of a minimal intervention to increase physical activity in women: daily activity records. Nursing Research 50, 6 (2001), 374--8.","paperID":"None"},{"content":"Suchman, L. Plans and Situated Actions. Cambridge University Press, 1987.","paperID":"None"},{"content":"Vallerand, R.J. and Losier, G.F. An integrative analysis of intrinsic and extrinsic motivation in sport. J. Applied Sport Psych. 11, 1 (1999), 142--169.","paperID":"None"}],"abstract":"The use of wearable technology will become significantly more prevalent in the coming years, with major companies releasing devices such as the Samsung Gear Fit. With sensors, such as pedometers and heart rate monitors, embedded in these devices it is possible to use them for fitness purposes. However, little is known about how wearable adopters actually use wearable and existing technologies during exercise. In an exploratory situated study of technology use and non-use in the context of the gym, fitness informatics adopters showed varied practices related to distraction, appropriating technology into their routines, and information needs. We discuss this variance in relation to individual differences and the impact of the physical nature of the gym. Although further research might show other influencing factors such as the social context, we make a case for the use of situated studies to uncover tensions that lead to use and non-use of technology that arise in the different unfolding situations of using wearables in everyday life, including at the gym, which is a surprisingly complex context.","title":"Contextual Influences on the Use and Non-Use of Digital Technology While Exercising at the Gym","filename":"CHI15/p2923","authors":["Misha Patel","Aisling Ann O'Kane"],"conference":"CHI '15"}