{"paperId":2702517,"citation":[{"content":"Dakuo Wang, How People Write Together Now: Exploring and Supporting Today's Computer-Supported Collaborative Writing, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2874352"},{"content":"Ryan Kelly , Leon Watts , Stephen J. Payne, Can Visualization of Contributions Support Fairness in Collaboration?: Findings from Meters in an Online Game, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819977"}],"reference":[{"content":"Beck, E. E. (1993). A survey of experiences of collaborative writing. In E. E. Beck (Ed.) Computer Supported Collaborative Writing Springer London. 87112.","paperID":"None"},{"content":"Bostock, M., Ogievetsky, V., & Heer, J. (2011). D³ datadriven documents. Visualization and Computer Graphics, IEEE Transactions on, 17(12), 2301--2309.","paperID":"None"},{"content":"Cross, G. A. (1990). A Bakhtinian exploration of factors affecting the collaborative writing of an executive letter of an annual report. Research in the Teaching of English, 173--203.","paperID":"None"},{"content":"Curtis, B., Krasner, H., & Iscoe, N. (1988). A field study of the software design process for large systems. Communications of the ACM, 31(11), 1268--1287.","paperID":"None"},{"content":"Dabbish, L., Stuart, C., Tsay, J., & Herbsleb, J. (2012). Social coding in GitHub: transparency and collaboration in an open software repository. In Proceedings of CSCW 2012, 1277--1286.","paperID":"None"},{"content":"Dourish, P., & Bellotti, V. (1992). Awareness and coordination in shared workspaces. In Proceedings of the 1992 ACM conference on Computer-supported cooperative work, 107--114","paperID":"None"},{"content":"Ede, L. S., & Lunsford, A. A. (1990). Singular texts/plural authors: Perspectives on collaborative writing. SIU Press.","paperID":"None"},{"content":"Eick, S. G., Steffen, J. L., & Sumner Jr, E. E. (1992). Seesoft-a tool for visualizing line oriented software statistics. Software Engineering, IEEE Transactions on, 18(11), pp. 957--968.","paperID":"None"},{"content":"Ellis, C. A., & Gibbs, S. J. (1989). Concurrency control in groupware systems. In ACM SIGMOD Record Vol. 18(2), 399--407.","paperID":"None"},{"content":"Fraser, N. (2012). google-diff-match-patch Diff, Match and Patch libraries for Plain Text. https://code.google.com/p/google-diff-match-patch/","paperID":"None"},{"content":"Froehlich, J., & Dourish, P. (2004). Unifying artifacts and activities in a visual tool for distributed software development teams. In Proc. of the 26th International Conference on Software Engineering, 387--396.","paperID":"None"},{"content":"Google Docs. https://docs.google.com/","paperID":"None"},{"content":"Google Drive API. https://developers.google.com/drive/","paperID":"None"},{"content":"Higgins, L., Flower, L., & Petraglia, J. (1992). Planning text together: The role of critical reflection in student collaboration. Written communication, 9(1), pp. 48--84.","paperID":"None"},{"content":"Hunt, J. W., & Szymanski, T. G. (1977). A fast algorithm for computing longest common subsequences. Communications of the ACM, 20(5), 350353.","paperID":"None"},{"content":"JQuery. http://jquery.com/","paperID":"None"},{"content":"JSON. http://json.org/","paperID":"None"},{"content":"Keys, C. W. (1994). The development of scientific reasoning skills in conjunction with collaborative writing assignments: An interpretive study of six ninth-grade students. Journal of Research in Science Teaching, 31(9), 1003--1022.","paperID":"None"},{"content":"Lowry, P. B., Curtis, A., & Lowry, M. R. (2004). Building a taxonomy and nomenclature of collaborative writing to improve interdisciplinary research and practice. Journal of Business Communication, 41(1), 6699.","paperID":"None"},{"content":"McCarthey, S. J., & McMahon, S. (1992). From convention to invention: Three approaches to peer interactions during writing. Interaction in Cooperative Groups: The Theoretical Anatomy of Group Learning, 1735.","paperID":"None"},{"content":"McGuffin, L. J., & Olson, G. M. (1992). ShrEdit: A Shared Electronic Work Space. CSMIL Technical Report #45, The University of Michigan.","paperID":"None"},{"content":"Michailidis, A., & Rada, R. (1996). A review of collaborative authoring tools. Groupware and authoring. Academic Press, London, 9--43.","paperID":"None"},{"content":"Microsoft Word. http://office.microsoft.com/","paperID":"None"},{"content":"Miller, W., & Myers, E. W. (1985). A file comparison program. Software: Practice and Experience, 15(11), 1025--1040.","paperID":"None"},{"content":"Myers, E. W. (1986). AnO (ND) difference algorithm and its variations. Algorithmica, 1(1--4), 251--266.","paperID":"None"},{"content":"Noël, S., & Robert, J. M. (2004). Empirical study on collaborative writing: What do co-authors do, use, and like? Computer Supported Cooperative Work, (CSCW), 13(1), 63--89.","paperID":"None"},{"content":"Olson, J. S., & Olson, G. M. (2013). Working Together Apart: Collaboration over the Internet. Springer.","paperID":"None"},{"content":"Posner, I. R., & Baecker, R. M. (1992) How people write together. In Proceedings of the Twenty-Fifth Hawaii International Conference on System Sciences Vol. 4, 127--138.","paperID":"None"},{"content":"Rada, R. (1996). Groupware and Authoring. Academic Press.","paperID":"None"},{"content":"Rice, R. P., & Huguley Jr, J. T. (1994). Describing collaborative forms: A profile of the team-writing process. IEEE Transactions on Professional Communication, 37(3), 163--170.","paperID":"None"},{"content":"Roskams, T. (1999). Chinese EFL students' attitudes to peer feedback and peer assessment in an extended pairwork setting. RELC Journal, 30(1), 79--123.","paperID":"None"},{"content":"Sharples, M., Goodlet, J. S., Beck, E. E., Wood, C. C., Easterbrook, S. M., & Plowman, L. (1993). Research Issues in the Study of Computer Supported Collaborative Writing (pp. 9--28). Springer London.","paperID":"None"},{"content":"Southavilay, V., Yacef, K., Reimann, P., & Calvo, R. A. (2013). Analysis of collaborative writing processes using revision maps and probabilistic topic models. In Proceedings of the Third International Conference on Learning Analytics and Knowledge, 38--47.","paperID":"None"},{"content":"Storch, N. (2005). Collaborative writing: Product, process, and students' reflections. Journal of Second Language Writing, 14(3), 153--173.","paperID":"None"},{"content":"Viégas, F. B., Wattenberg, M., & Dave, K. (2004). Studying cooperation and conflict between authors with history flow visualizations. In Proceedings of CHI 2004, pp. 575--582.","paperID":"None"},{"content":"Voinea, L., Telea, A., & Van Wijk, J. J. (2005). CVSscan: visualization of code evolution. In Proceedings of the 2005 ACM symposium on Software visualization, pp. 47--56.","paperID":"None"}],"abstract":"Collaborative writing is on the increase. In order to write well together, authors often need to be aware of who has done what recently. We offer a new tool, DocuViz, that displays the entire revision history of Google Docs, showing more than the one-step-at-a-time view now shown in revision history and tracking changes in Word. We introduce the tool and present cases in which the tool has the potential to be useful: To authors themselves to see recent \"seismic activity,\" indicating where in particular a co-author might want to pay attention, to instructors to see who has contributed what and which changes were made to comments from them, and to researchers interested in the new patterns of collaboration made possible by simultaneous editing capabilities.","video":"http://www.youtube.com/embed/TwXm9oS4CgY?rel=0","title":"DocuViz: Visualizing Collaborative Writing","filename":"CHI15/p1865","authors":["Dakuo Wang","Judith S. Olson","Jingwen Zhang","Trung Nguyen","Gary M. Olson"],"conference":"CHI '15"}