{"paperId":2702444,"citation":[],"abstract":"We present an elevating tangible block, G-raff that supports spatial interaction in a tabletop computing environment. The elevating head part of G-raff moves according to the given height and angle data. We adopted two rollable metal tape structures to create large movements with a small volume block. On the head part, a smartphone can be mounted either horizontally or vertically. G-raff becomes a device that can connect a mobile device with a tabletop computer, thus a new spatial representation and control interaction is made. This paper introduces the design details, key features and applications of G-raff. We report on the results of a preliminary user study and discuss future work to improve the elevating device. This work contributes to maximizing the availability of augmented reality space above the tabletop display.","reference":[{"content":"Baudisch, P., Becker, T., & Rudeck, F. Lumino: tangible blocks for tabletop computers based on glass fiber bundles. In Proc. CHI '10 ACM Press (pp. 1165--1174).","paperID":"None"},{"content":"Chan, L., Müller, S., Roudaut, A., & Baudisch, P. CapStones and ZebraWidgets: sensing stacks of building blocks, dials and sliders on capacitive touch screens. In Proc. CHI '12 ACM Press (pp. 2189--2192).","paperID":"None"},{"content":"Dalsgaard, P., & Halskov, K. Tangible 3D tabletops: combining tangible tabletop interaction and 3D projection. In Proc. CHI '12 ACM Press (pp. 109--118).","paperID":"None"},{"content":"Follmer, S., Leithinger, D., Olwal, A., Hogge, A., & Ishii, H. inFORM: dynamic physical affordances and constraints through shape and object actuation. In Proc. UIST '13 ACM Press (pp. 417--426).","paperID":"None"},{"content":"Julian, S., Sebastian, B., Christian, W., Florian, S., Fabian, S., Steffen, H., -- Enrico, R. Hover Pad: interacting with autonomous and self-actuated displays in space. In Proc. UIST '14 ACM Press (pp.139--147).","paperID":"None"},{"content":"Mi, H., & Sugimoto, M. HATs: interact using heightadjustable tangibles in tabletop interfaces. In Proc. ITS '11 ACM Press (pp. 71--74).","paperID":"None"},{"content":"Nowacka, D., Ladha, K., Hammerla, N. Y., Jackson, D., Ladha, C., Rukzio, E., & Olivier, P. Touchbugs: Actuated tangibles on multi-touch tables. In Proc. CHI '10 ACM Press (pp. 759--762).","paperID":"None"},{"content":"Pedersen, E. W., & Hornbæ k, K. Tangible bots: interaction with active tangibles in tabletop interfaces. In Proc. CHI'11 ACM Press (pp. 2975--2984).","paperID":"None"},{"content":"Spindler, M., Buschel, W., and Dachselt, R. Use your head: tangible windows for 3D information spaces in a tabletop environment. In Proc. ITS '12 ACM Press (pp. 245--254).","paperID":"None"},{"content":"Spindler, M., Tominski, C., Schumann, H., & Dachselt, R. Tangible views for information visualization. In Proc. ITS '10 ACM Press (pp. 157--166).","paperID":"None"}],"title":"G-raff: An Elevating Tangible Block for Spatial Tabletop Interaction","filename":"CHI15/p4161","authors":["Chang-Min Kim","Tek-Jin Nam"],"conference":"CHI '15"}