{"paperId":2702242,"citation":[{"content":"John Harris , Mark Hancock , Stacey D. Scott, \"Beam Me 'Round, Scotty!\": Studying Asymmetry and Interdependence in a Prototype Cooperative Game, Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, October 05-07, 2015, London, United Kingdom","paperID":"2810274"},{"content":"Alena Denisova , Paul Cairns, Adaptation in Digital Games: The Effect of Challenge Adjustment on Player Performance and Experience, Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, October 05-07, 2015, London, United Kingdom","paperID":"2793141"}],"reference":[{"content":"Abuhamdeh, S., & Csikszentmihalyi, M. The importance of challenge for the enjoyment of intrinsically motivated, goal-directed activities. Pers. & Soc. Psych. Bull., 38 (3), 2012, 317--330.","paperID":"None"},{"content":"Abuhamdeh, S., Csikszentmihalyi, M., & Jalal, B. Enjoying the possibility of defeat: Outcome uncertainty, suspense, and intrinsic motivation. Motiv. & Emot., 110, 2014. Published online.","paperID":"None"},{"content":"Asano, T., Sharlin, E., Kitamura, Y., Takashima, K., Kishino, F. Predictive interaction using the Delphian desktop. UIST 2005, 133--141.","paperID":"None"},{"content":"Balakrishnan, R. \"Beating\" Fitt's law: virtual enhancements for pointing facilitation. IJHCS 61, 2004, 857--874.","paperID":"None"},{"content":"Baldwin, A., Johnson, D., Wyeth, P. The effect of multiplayer dynamic difficulty adjustment on the player experience of video games. CHI EA 2014, 1489--1494.","paperID":"None"},{"content":"Bateman, S., Mandryk, R.L., Stach, T. and Gutwin, C. Target assistance for subtly balancing competitive play. CHI 2011, 2355--2364.","paperID":"None"},{"content":"Baudisch, P., Cutrell, E., Robbins, D., Czerwinski, M., Tandler, P. Bederson, B., Zierlinger, A. Drag-and-Pop and Drag-and-Pick: Techniques for Accessing Remote Screen Content. Interact 2003, 57--64.","paperID":"None"},{"content":"Bostan, B., and Öüt, S. Game challenges and difficulty levels: lessons learned From RPGs. International Simulation and Gaming Association Conference, 2009.","paperID":"None"},{"content":"Cechanowicz, J., Gutwin, C., Bateman, S., Mandryk, R.L., and Stavness, I., Improving Player Balancing in Racing Games, CHI Play 2014, 47--56.","paperID":"None"},{"content":"Falstein, N. Understanding fun -- the Theory of Natural Funativity. In Introduction to Game Development, S. Rabin ed., 2005, 71--98.","paperID":"None"},{"content":"Findlater, L, Jansen, A., Shinohara, K., Dixon, M., Kamb, P., Rakita. J., Wobbrock, J.O. Enhanced Area Cursors Reducing Fine Pointing Demands for People with Motor Impairments. UIST 2010, 153--162.","paperID":"None"},{"content":"Fitts, P.M. The information capacity of the human motor system in controlling the amplitude of movement. J.Exp. Psych., 47, 1954, 381--391.","paperID":"None"},{"content":"Gerling, K.M., Miller, M.K., Mandryk, R.L., Birk, M., Smeddinck, J.D. Effects of Balancing for Physical Abilities on Player Performance, Experience and SelfEsteem in Exergames. CHI 2014, 2201--2210.","paperID":"None"},{"content":"Go, J., Ballagas, R., Spasojevic, M. Brothers and sisters at play: exploring game play with siblings. CSCW 2012, 739--748.","paperID":"None"},{"content":"Hunicke, R. The case for dynamic difficulty adjustment in games. Advances in Computer Entertainment Technology vol. 265, 2005. 429--433.","paperID":"None"},{"content":"Klimmt, C., Blake, C., Hefner, D., Vorderer, P., and Roth, C. Player Performance, Satisfaction, and Video Game Enjoyment. ICEC 2009, 1--12.","paperID":"None"},{"content":"Kabbash, P. and Buxton, W. The \"Prince\" Technique: Fitts' Law and Selection Using Area Cursors. CHI 1995, 273--279.","paperID":"None"},{"content":"Looser, J., Cockburn, A. and Savage, J. On the Validity of Using First-Person Shooters for Fitts' Law Studies. British HCI 2005, 33--36.","paperID":"None"},{"content":"McAuley, E., Duncan, T., & Tammen, V. V. (1989). Psychometric properties of the Intrinsic Motivation Inventory in a competitive sport setting: A confirmatory factor analysis. Res. Q. Exercise and Sport, 60, 48--58.","paperID":"None"},{"content":"Natapov, D., Castellucci, S. J., and MacKenzie, I. S. ISO 9241--9 evaluation of video game controllers. GI 2009, 223--230.","paperID":"None"},{"content":"Newheiser, Mark. Playing Fair: A Look at Competition in Gaming. Strange Horizons. March 2009. strangehorizons.com/2009/20090309/newheiser-a.shtml","paperID":"None"},{"content":"Ryan, R., Rigby, C., Przybylski, A. K. Motivational pull of video games: A self-determination theory approach. Motivation and Emotion 30, 2006, 347--365","paperID":"None"},{"content":"Sweetser, P. and Wyeth, P. GameFlow: a model for evaluating player enjoyment in games. Computers in Entertainment 3, 205, 3--3.","paperID":"None"},{"content":"Vicencio-Moreira, R., Mandryk, R. L., Gutwin, C., Bateman, S. The effectiveness (or lack thereof) of aimassist techniques in First Person Shooter games. CHI 2014, 937--946.","paperID":"None"},{"content":"Wobbrock, J., Fogarty, J., Liu, S., Kimuro, S., Harada, S. The Angle Mouse: Target-Agnostic Dynamic Gain Adjustment Based on Angular Deviation. CHI 2009, 1401--1410.","paperID":"None"},{"content":"Worden A, Walker N, Bharat K, Hudson S. Making Computers Easier for Older Adults to Use: Area Cursors and Sticky Icons. CHI 1997, 266--271.","paperID":"None"}],"abstract":"When player skill levels differ widely in a competitive First-Person Shooter (FPS) game, enjoyment suffers: weaker players become frustrated and stronger players become less engaged. Player balancing techniques attempt to assist the weaker player and make games more competitive, but these techniques have limitations for deployment when skill levels vary substantially. We developed new player balancing schemes to deal with a range of FPS skill difference, and tested these techniques in one-on-one deathmatches using a commercial-quality FPS game developed with the UDK engine. Our results showed that the new balancing schemes are extremely effective at balancing, even for players with large skill differences. Surprisingly, the techniques that were most effective at balancing were also rated as most enjoyable by both players -- even though these schemes were the most noticeable. Our study is the first to show that player balancing can work well in realistic FPS games, providing developers with a way to increase the audience for this popular genre. In addition, our results demonstrate the idea that successful balancing is as much about the way the technique is applied as it is about the specific manipulation.","title":"Now You Can Compete With Anyone: Balancing Players of Different Skill Levels in a First-Person Shooter Game","filename":"CHI15/p2255","authors":["Rodrigo Vicencio-Moreira","Regan L. Mandryk","Carl Gutwin"],"conference":"CHI '15"}