{"paperId":2702127,"reference":[{"content":"Bigham, J. P., and Cavender, A. C. Evaluating Existing Audio CAPTCHAs and an Interface Optimized for Non-visual Use. In Proc. SIGCHI, CHI '09 (2009).","paperID":"None"},{"content":"Bursztein, E., Bauxis, R., Paskov, H., Perito, D., Fabry, C., and Mitchell, J. C. The Failure of Noise-Based Non-Continuous Audio Captchas. In Proc. S&P (2011).","paperID":"None"},{"content":"Carnegie Mellon University. The Carnegie Mellon University Pronouncing Dictionary, Carnegie Mellon Universitydict (v. 0.7a). http://www.speech.cs.cmu.edu/cgi-bin/cmudict.","paperID":"None"},{"content":"Crowdflower. http://www.crowdflower.com.","paperID":"None"},{"content":"Meutzner, H., Nguyen, V.-H., Holz, T., and Kolossa, D. Using Automatic Speech Recognition for Attacking Acoustic CAPTCHAs: The Trade-off between Usability and Security. In Proc. ACSAC (2014).","paperID":"None"},{"content":"Ogden, C. K. Basic english, 1930. http://ogden.basic-english.org/basiceng.html.","paperID":"None"},{"content":"Rabiner, L., and Juang, B.-H. Fundamentals of Speech Recognition. Prentice Hall, 1993.","paperID":"None"},{"content":"Sano, S., Otsuka, T., and Okuno, H. Solving Google's Continuous Audio CAPTCHA with HMM-Based Automatic Speech Recognition. In Advances in Information and Computer Security. Springer, 2013.","paperID":"None"},{"content":"Wolters, M. K., Isaac, K., and Renals, S. Evaluating speech synthesis intelligibility using Amazon Mechanical Turk. In SSW (2010).","paperID":"None"},{"content":"Young, S. The HTK Hidden Markov Model Toolkit: Design and Philosophy. Entropic Cambridge Research Laboratory, Ltd (1994).","paperID":"None"},{"content":"Zen, H., Nose, T., Yamagishi, J., Sako, S., Masuko, T., Black, A. W., and Tokuda, K. The HMM-based speech synthesis system (HTS) version 2.0. In SSW (2007).","paperID":"None"}],"citation":[{"content":"Gerardo Reynaga , Sonia Chiasson , Paul C. van Oorschot, Heuristics for the evaluation of captchas on smartphones, Proceedings of the 2015 British HCI Conference, July 13-17, 2015, Lincoln, Lincolnshire, United Kingdom","paperID":"2783583"}],"abstract":"To prevent abuses of Internet services, CAPTCHAs are used to distinguish humans from programs where an audio-based scheme is beneficial to support visually impaired people. Previous studies show that most audio CAPTCHAs, albeit hard to solve for humans, are lacking security strength. In this work we propose an audio CAPTCHA that is far more robust against automated attacks than it is reported for current CAPTCHA schemes. The CAPTCHA exhibits a good trade-off between human usability and security. This is achieved by exploiting the fact that the human capabilities of language understanding and speech recognition are clearly superior compared to current machines. We evaluate the CAPTCHA security by using a state-of-the-art attack and assess the intelligibility by means of a large-scale listening experiment.","title":"Constructing Secure Audio CAPTCHAs by Exploiting Differences between Humans and Machines","filename":"CHI15/p2335","authors":["Hendrik Meutzner","Santosh Gupta","Dorothea Kolossa"],"conference":"CHI '15"}