{"paperId":2702343,"citation":[{"content":"Julia Mayer , Quentin Jones, Encount'r: Exploring Passive Context-Awareness for Opportunistic Social Matching, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2869080"}],"reference":[{"content":"Abowd, G.D., Dey, A.K., Brown, P.J., Davies, N., Smith, M., and Steggles, P. Towards a Better Understanding of Context and Context-Awareness. In H.-W. Gellersen, ed., Handheld and Ubiquitous Computing. Springer Berlin Heidelberg, 1999, 304--307.","paperID":"None"},{"content":"Bandura, A. The psychology of chance encounters and life paths. American Psychologist 37, 7 (1982), 747--755.","paperID":"None"},{"content":"Beach, A., Gartrell, M., Akkala, S., et al. WhozThat? evolving an ecosystem for context-aware mobile social networks. IEEE Network 22, 4 (2008), 50--55.","paperID":"None"},{"content":"Dey, A.K. Understanding and Using Context. Personal Ubiquitous Comput. 5, 1 (2001), 4--7.","paperID":"None"},{"content":"Dourish, P. What We Talk About when We Talk About Context. Personal Ubiquitous Comput. 8, 1 (2004), 19--30.","paperID":"None"},{"content":"Eagle, N. and Pentland, A. Social serendipity: mobilizing social software. IEEE Pervasive Computing 4, 2 (2005), 28--34.","paperID":"None"},{"content":"Festinger, L., Back, K.W., and Schachter, S. Social Pressures in Informal Groups: A Study of Human Factors in Housing. Stanford University Press, 1950.","paperID":"None"},{"content":"Glaser, B. and Strauss, A. The Discovery of Grounded Theory: Strategies for Qualitative Research. Aldine Transaction, 1967.","paperID":"None"},{"content":"Goffman, E. Behavior in Public Places. Simon and Schuster, 1966.","paperID":"None"},{"content":"Grandhi, S. and Jones, Q. Technology-mediated interruption management. International Journal of Human-Computer Studies 68, 5 (2010), 288--306.","paperID":"None"},{"content":"Grandhi, S.A., Jones, Q., and Karam, S. Sharing the big apple: a survey study of people, place and locatability. CHI '05 Extended Abstracts on Human Factors in Computing Systems, ACM (2005), 1407--1410.","paperID":"None"},{"content":"Granovetter, M.S. The Strength of Weak Ties. American Journal of Sociology 78, 6 (1973), 1360--1380.","paperID":"None"},{"content":"Greenberg, S., Marquardt, N., Ballendat, T., Diaz-Marino, R., and Wang, M. Proxemic Interactions: The New Ubicomp interactions 18, 1 (2011), 42--50.","paperID":"None"},{"content":"Hall, E.T. The Hidden Dimension. Anchor, New York, 1990.","paperID":"None"},{"content":"Harrison, S. and Dourish, P. Re-place-ing space: the roles of place and space in collaborative systems. Proceedings of the 1996 ACM conference on Computer supported cooperative work, ACM (1996), 67--76.","paperID":"None"},{"content":"Hughes, J., King, V., Rodden, T., and Andersen, H. Moving out from the control room: ethnography in system design. Proceedings of the 1994 ACM conference on Computer supported cooperative work, ACM (1994), 429--439.","paperID":"None"},{"content":"Insko, C.A. and Wilson, M. Interpersonal attraction as a function of social interaction. Journal of Personality and Social Psychology 35, 12 (1977), 903--911.","paperID":"None"},{"content":"Jones, Q., Grandhi, S.A., Whittaker, S., Chivakula, K., and Terveen, L. Putting systems into place: a qualitative study of design requirements for location-aware community systems. ACM (2004), 202--211.","paperID":"None"},{"content":"Larson, R. and Csikszentmihalyi, M. The Experience Sampling Method. New Directions for Methodology of Social & Behavioral Science 15, (1983), 41--56.","paperID":"None"},{"content":"Levine, R.V. The Kindness of Strangers: People's Willingness to help somone during a chance encounter on a city street varies considerably around the world. American Scientist 91, 3 (2003), 226--233.","paperID":"None"},{"content":"Mardenfeld, S., Boston, D., Pan, S.J., Jones, Q., Iamntichi, A., and Borcea, C. GDC: Group Discovery Using Co-location Traces. 2010 IEEE Second International Conference on Social Computing (SocialCom), (2010), 641--648.","paperID":"None"},{"content":"Mayer, J.M., Motahari, S., Schuler, R.P., and Jones, Q. Common attributes in an unusual context: predicting the desirability of a social match. Proceedings of the 4th ACM Conference on Recommender Systems, ACM (2010), 337--340.","paperID":"None"},{"content":"Mayer, J.M., Schuler, R.P., and Jones, Q. Towards an understanding of social inference opportunities in social computing. Proceedings of the 17th ACM intl. Conference on Supporting Group Work, ACM (2012), 239--248.","paperID":"None"},{"content":"McPherson, M., Smith-Lovin, L., and Cook, J.M. Birds of a Feather: Homophily in Social Networks. Annual Review of Sociology 27, (2001), 415--444.","paperID":"None"},{"content":"Merton, R.K. Social Theory and Social Structure. Simon and Schuster, 1968.","paperID":"None"},{"content":"Milgram, S. The Familiar Stranger: An Aspect of Urban Anonymity. In The Individual in a Social World: Essays and Experiments. MA: Addison-Wesley, 1977, 51--53.","paperID":"None"},{"content":"Morry, M.M., Kito, M., and Ortiz, L. The attraction-similarity model and dating couples: Projection, perceived similarity, and psychological benefits. Personal Relationships 18, 1 (2011), 125--143.","paperID":"None"},{"content":"Newcomb, T.M. The Prediction of Interpersonal Attraction. American Psychologist 11, 11 (1956), 575--586.","paperID":"None"},{"content":"Paulos, E. and Goodman, E. The familiar stranger: anxiety, comfort, and play in public places. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2004), 223--230.","paperID":"None"},{"content":"Persson, P. and Jung, Y. Nokia sensor: from research to product. Proceedings of the 2005 conference on Designing for User eXperience, AIGA: American Institute of Graphic Arts (2005).","paperID":"None"},{"content":"Putnam, R.D. Bowling Alone: The Collapse and Revival of American Community. Simon and Schuster, 2000.","paperID":"None"},{"content":"Schilit, B.N. and Theimer, M.M. Disseminating active map information to mobile hosts. IEEE Network 8, 5 (1994), 22--","paperID":"None"},{"content":"Shimanoff, S.B. Communication rules: Theory and research. Sage Publications, Beverly Hills, CA, 1980.","paperID":"None"},{"content":"Sykes, R.E. Initial Interaction between Strangers and Acquaintances: A Multivariate Analysis of Factors Affecting Choice of Communication Partners. Human Communication Research 10, 1 (1983), 27--53.","paperID":"None"},{"content":"Terry, M. and Mynatt, E.D. Social Net: Using Patterns of Physical Proximity Over Time to Infer Shared Interests. In Proceedings of Human Factors in Computing Systems (CHI 2002, ACM Press (2002), 816--817.","paperID":"None"},{"content":"Terveen, L. and McDonald, D.W. Social matching: A framework and research agenda. ACM Transactions on Computer-Human Interactions 12, 3 (2005), pp. 401--434.","paperID":"None"}],"abstract":"Social matching systems recommend people to people. In an ideal world, such systems could be context-aware, in that they would introduce users to each other in situations where they are mutually interested, available and open to meeting (i.e., facilitate a valuable encounter). Unfortunately, today's systems primarily match individuals based on simple similarity and proximity metrics. This paper explores how contextual information available on today's mobile phones could be used to identify opportunities for people to make valuable new connections. Three types of context that are relevant for this work are: relational, social and personal. We present insights gained from several iterations of semi-structured interviewing (N=58) exploring these three types of contexts and propose novel context-aware social matching concepts such as: sociability of others as an indicator of opportune social context; activity involvement as an indicator of opportune personal context; and contextual rarity as an indicator of opportune relational context.","title":"Making Social Matching Context-Aware: Design Concepts and Open Challenges","filename":"CHI15/p545","authors":["Julia M. Mayer","Starr Roxanne Hiltz","Quentin Jones"],"conference":"CHI '15"}