{"paperId":2702380,"citation":[],"abstract":"Reference is increasingly made to 'digital collections', yet this term encompasses accumulated digital objects of varying form, purpose and value. We review social science literature on material collections and draw from in-depth interviews with 20 people in the UK in order to offer a clearer understanding of what constitutes a digital collection and what does not. We develop a taxonomy that presents three distinct types of digital collection and demonstrate ways in which the affordances of digital environments may facilitate or impede meaningful practices of acquisition, curation and exhibition in each case. Through doing so, we present a framework for design in support of collecting practices and the development of more meaningful and valued digital collections.","reference":[{"content":"Akhtar, S. Objects of Our Desire: Exploring our Intimate Connections with the Things around Us. New York: Harmony Books, 2005.","paperID":"None"},{"content":"Baker, S.M. and Gentry, J.W. Kids as collectors: a phenomenological study of first and fifth graders. Advances in Consumer Research 23, (1996), 132--137.","paperID":"None"},{"content":"Belk, R.W. Possessions and the extended self. Journal of Consumer Research 15, 2 (1988) 139--168.","paperID":"None"},{"content":"Belk, R.W. Collecting in a Consumer Society. Psychology Press, 1995.","paperID":"None"},{"content":"Belk, R.W. Extended self in a digital world. Journal of Consumer Research 40, 3 (2013), 477--500.","paperID":"None"},{"content":"Belk, R.W. \"Ownership and Collecting,\" in Randy O. Frost and Gail Steketee, eds., Oxford Handbook ofHoarding and Acquiring, Oxford: Oxford University Press (forthcoming).","paperID":"None"},{"content":"Belk, R.W., Wallendorf, M., Sherry, J.F. Jr. and Holbrook, M.B. Collecting in a consumer culture. In Belk, R.W. (Ed.), Highways and Buyways: Naturalistic Research from the Consumer Behavior Odyssey (pp. 178--215). Association for Consumer Research, 1991.","paperID":"None"},{"content":"Belk, R.W., Wallendorf, M., Sherry, J.F. Jr., Holbrook, M.B. and Roberts, S. Collectors and collecting. Advances in Consumer Research, 15 (1988), p.548--553.","paperID":"None"},{"content":"Bianchi, M. Collecting as a paradigm of consumption. Journal of Cultural Economics 21, (1997), 275--289.","paperID":"None"},{"content":"Brown, B. A. T., Geelhoed, E., Sellen, A. J. (2001). The use of conventional and new music media: Implications for future technologies. INTERACT. Tokyo, Japan.","paperID":"None"},{"content":"Danet, B. and Katriel, T. No two alike: play and aesthetics in collecting. Play and Culture 2, 3 (1989), 255--71.","paperID":"None"},{"content":"Dannefer, D. Rationality and passion in private experience: modern consciousness and the social world of old-car collectors, Social Problems 27, (1980), 392--412.","paperID":"None"},{"content":"Denegri-Knott, J., Watkins, R. and Wood, J. Transforming digital virtual goods into meaningful possessions. In M. Molesworth and J. Denegri-Knott (Eds.), Digital Virtual Consumption (pp. 76--91). Oxford: Routledge, 2012.","paperID":"None"},{"content":"Douglas, M. and Isherwood, B. The World of Goods: Towards an Anthropology of Consumption. 2nd ed. London: Routledge, 1996.","paperID":"None"},{"content":"Gregson, N. Living with Things: Ridding, Accommodation, Dwelling. Sean Kingston Publishing, 2007.","paperID":"None"},{"content":"Hogan, B. The presentation of self in the age of social media: distinguishing performances & exhibitions online. Bulletin of Science, Technology & Society, 30, (2010), 377--386.","paperID":"None"},{"content":"Joseph 'Jofish' Kaye , Janet Vertesi , Shari Avery , Allan Dafoe , Shay David , Lisa Onaga , Ivan Rosero , Trevor Pinch, To have and to hold: exploring the personal archive, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124814"},{"content":"Lehdonvirta, V., Wilska, T. and Johnson, M. Virtual consumerism: case habbo hotel. Information, Communication & Society 12, 7 (2009), 1059--1079.","paperID":"None"},{"content":"Rhema Linder , Clair Snodgrass , Andruid Kerne, Everyday ideation: all of my ideas are on pinterest, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557273"},{"content":"Siân E. Lindley , Catherine C. Marshall , Richard Banks , Abigail Sellen , Tim Regan, Rethinking the web as a personal archive, Proceedings of the 22nd international conference on World Wide Web, May 13-17, 2013, Rio de Janeiro, Brazil","paperID":"2488454"},{"content":"Martin, P. Popular Collecting and the Everyday Self: The Reinvention of Museums, London: Leicester Press, 1999.","paperID":"None"},{"content":"McCracken, G. Culture and Consumption: New Approaches to the Symbolic Character of Consumer Goods and Activities. Bloomington: Indiana Univ. Press, 1988.","paperID":"None"},{"content":"Molesworth, M. and R. D. Watkins. Adult Videogame Consumption as Individualized Episodic Progress. Journal of Consumer Culture. (Forthcoming)","paperID":"None"},{"content":"William Odom , Abi Sellen , Richard Harper , Eno Thereska, Lost in translation: understanding the possession of digital things in the cloud, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207789"},{"content":"William Odom , John Zimmerman , Jodi Forlizzi, Teenagers and their virtual possessions: design opportunities and issues, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979161"},{"content":"William Odom , John Zimmerman , Jodi Forlizzi, Placelessness, spacelessness, and formlessness: experiential qualities of virtual possessions, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598577"},{"content":"Kenton O'Hara , Tim Kindberg , Maxine Glancy , Luciana Baptista , Byju Sukumaran , Gil Kahana , Julie Rowbotham, Collecting and Sharing Location-based Content on Mobile Phones in a Zoo Visitor Experience, Computer Supported Cooperative Work, v.16 n.1-2, p.11-44, April     2007","paperID":"1265277"},{"content":"Pearce, S.M. The urge to collect. In Pearce, S.M. (Ed), Interpreting Objects and Collections (pp. 157--159). Routledge: New York, 1994.","paperID":"None"},{"content":"Pearce, S.M. Collecting in Contemporary Practice. London: Sage, 1998.","paperID":"None"},{"content":"Shankar, A. Identity and Consumption: An Interpretive Study of People and Their Record Collections. Unpublished doctoral thesis, 2002.","paperID":"None"},{"content":"Siddiqui, S., & Turley, D. Extending the self in a virtual world. Advances in Consumer Research 33, 1 (2006), 647--648.","paperID":"None"},{"content":"Spiggle, S. Analysis and interpretation of qualitative data in consumer research, Journal of Consumer Research 21 (December 1994), 491--503.","paperID":"None"},{"content":"Thompson, C. Interpreting consumers: a hermeneutical framework for deriving marketing insights from the texts of consumers' consumption stories, Journal of Marketing Research, 34 (November 1997), 438--55.","paperID":"None"},{"content":"Watkins, R. & Molesworth, M. Attachment to digital virtual possessions in videogames. Research in Consumer Behavior 14, (2012), 153--171.","paperID":"None"}],"title":"Digital Collections and Digital Collecting Practices","filename":"CHI15/p3423","authors":["Rebecca D. Watkins","Abigail Sellen","Siân E. Lindley"],"conference":"CHI '15"}