{"paperId":2702536,"citation":[],"abstract":"Real-time synchronization is increasingly available in web-based environments for editing textual data, and this has changed how groups of people collaborate. We present a novel approach for real-time collaborative editing of geo-data. We introduce Ethermap, an open source web-application that implements this approach and enables multiple users to map data concurrently. It supports synchronous and collaborative mapping in several ways: it visually highlights mapping activities, it allows for fine-grained reviewing of all changes, and it enhances text-based communication with cross-modal references to geo-objects. We report on key results from a multi-tiered evaluation of Ethermap based on a user-study and on expert interviews. The concept of real-time collaborative editing was received favorably by users and experts. Participants of the study learned to use Ethermap quickly, and successfully completed a collaborative mapping task. Experts and users agreed that, given the right scenario (e.g., disaster mapping, teaching, planning), the approach could benefit the process of working on geo-data collaboratively.","reference":[{"content":"Pedro Antunes , Valeria Herskovic , Sergio F. Ochoa , José A. Pino, Reviewing the quality of awareness support in collaborative applications, Journal of Systems and Software, 89, p.146-169, March, 2014","paperID":"2576491"},{"content":"Armstrong, M. P., and Densham, P. Cartographic support for collaborative spatial decision-making. In Autocarto-Conference (1995), 49--58.","paperID":"None"},{"content":"Balram, S., and Dragicevic, S. Collaborative Geographic Information Systems. IGI Global, 2006.","paperID":"None"},{"content":"Butt, M. A., and Li, S. Open source based online map sharing to support real-time collaboration. In OSGeo J., vol. 10, FOSS4G (Jan. 2012), 10.","paperID":"None"},{"content":"John M. Carroll , Dennis C. Neale , Philip L. Isenhour , Mary Beth Rosson , D. Scott McCrickard, Notification and awareness: synchronizing task-oriented collaborative activity, International Journal of Human-Computer Studies, v.58 n.5, p.605-632, May 2003","paperID":"780893"},{"content":"Chang, Z. E., and Li, S. Geo-Social Model: A Conceptual Framework for Real-time Geocollaboration. Trans. GIS 17, 2 (Apr. 2013), 182--205.","paperID":"None"},{"content":"Mauro Cherubini , Pierre Dillenbourg, The effects of explicit referencing in distance problem solving over shared maps, Proceedings of the 2007 international ACM conference on Supporting group work, November 04-07, 2007, Sanibel Island, Florida, USA","paperID":"1316674"},{"content":"Crampton, J. Maps as social constructions: power, communication and visualization. Prog. Hum. Geogr. 25, 2 (June 2001), 235--252.","paperID":"None"},{"content":"Dabbish, L., Stuart, C., Tsay, J., and Herbsleb, J. Social coding in GitHub. In Proc. of CSCW '12, ACM Press (Feb. 2012), 1277.","paperID":"None"},{"content":"Clarence A. Ellis , Simon J. Gibbs , Gail Rein, Groupware: some issues and experiences, Communications of the ACM, v.34 n.1, p.39-58, Jan. 1991","paperID":"99987"},{"content":"Elwood, S. Critical Issues in Participatory GIS: Deconstructions, Reconstructions, and New Research Directions. Trans. GIS 10, 5 (Nov. 2006), 693--708.","paperID":"None"},{"content":"Max Goldman , Greg Little , Robert C. Miller, Real-time collaborative coding in a web IDE, Proceedings of the 24th annual ACM symposium on User interface software and technology, October 16-19, 2011, Santa Barbara, California, USA","paperID":"2047215"},{"content":"Victor Grishchenko, Deep hypertext with embedded revision control implemented in regular expressions, Proceedings of the 6th International Symposium on Wikis and Open Collaboration, July 07-09, 2010, Gdansk, Poland","paperID":"1832777"},{"content":"Hopf, C. 5.2 Qualitative Interviews - ein Überblick, vol. 55628. Uwe Flick, Ernst von Kardoff, Ines Steinke (Hrsgg.) Qualitative Forschung. Ein Handbuch. Reinbeck bei Hamburg., 2004.","paperID":"None"},{"content":"Jankowski, P., Nyerges, T. L., Smith, A., Morre, T. J., and Horvath, E. Spatial group choice: a SDSS tool for collaborative spatial decisionmaking. J. Geogr. Inf. Sci. 11, 6 (Sept. 1997), 577--602.","paperID":"None"},{"content":"Koren, I., Guth, A., and Klamma, R. Shared editing on the web: A classification of developer support libraries. In Proc. of Collaboratecom 2013, IEEE (Oct. 2013), 468--477.","paperID":"None"},{"content":"Robert E. Kraut , Darren Gergle , Susan R. Fussell, The use of visual information in shared visual spaces: informing the development of virtual co-presence, Proceedings of the 2002 ACM conference on Computer supported cooperative work, November 16-20, 2002, New Orleans, Louisiana, USA","paperID":"587084"},{"content":"Michele Lanza , Lile Hattori , Anja Guzzi, Supporting Collaboration Awareness with Real-Time Visualization of Development Activity, Proceedings of the 2010 14th European Conference on Software Maintenance and Reengineering, p.202-211, March 15-18, 2010","paperID":"1955934"},{"content":"MacEachren, A. M. Cartography and GIS: facilitating collaboration. Prog. Hum. Geogr. 24, 3 (2000), 445--456.","paperID":"None"},{"content":"MacEachren, A. M., Cai, G., Sharma, R., Rauschert, I., Brewer, I., Bolelli, L., Shaparenko, B., Fuhrmann, S., and Wang, H. Enabling collaborative geoinformation access and decisionmaking through a natural, multimodal interface. Int. J. Geogr. Inf. Sci. 19, 3 (Mar. 2005), 293--317.","paperID":"None"},{"content":"Maurer, T. J., and Andrews, K. D. Traditional, Likert, and Simplified Measures of Self-Efficacy. Educ. Psychol. Meas. 60, 6 (Dec. 2000), 965--973.","paperID":"None"},{"content":"Jonathan T. Morgan , Michael Gilbert , David W. McDonald , Mark Zachry, Editing beyond articles: diversity & dynamics of teamwork in open collaborations, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531654"},{"content":"Nam, T.-J., and Wright, D. The development and evaluation of Syco3D: a real-time collaborative 3D CAD system. Des. Stud. 22, 6 (Nov. 2001), 557--582.","paperID":"None"},{"content":"Dennis C. Neale , John M Carroll , Mary Beth Rosson, Evaluating computer-supported cooperative work: models and frameworks, Proceedings of the 2004 ACM conference on Computer supported cooperative work, November 06-10, 2004, Chicago, Illinois, USA","paperID":"1031626"},{"content":"Katherine Panciera , Reid Priedhorsky , Thomas Erickson , Loren Terveen, Lurking? cyclopaths?: a quantitative lifecycle analysis of user behavior in a geowiki, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753615"},{"content":"David Pinelle , Carl Gutwin, A Review of Groupware Evaluations, Proceedings of the 9th IEEE International Workshops on Enabling Technologies: Infrastructure for Collaborative Enterprises, p.86-91, June 04-16, 2000","paperID":"715503"},{"content":"Reid Priedhorsky , Loren Terveen, The computational geowiki: what, why, and how, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460606"},{"content":"Rinner, C. Argumentation Mapping in Collaborative Spatial Decision Making. In Collab. Geogr. Inf. Syst. IGI Global, 2006, 85--102.","paperID":"None"},{"content":"Chengzheng Sun , David Chen, Consistency maintenance in real-time collaborative graphics editing systems, ACM Transactions on Computer-Human Interaction (TOCHI), v.9 n.1, p.1-41, March 2002","paperID":"505152"}],"title":"Ethermap: Real-time Collaborative Map Editing","filename":"CHI15/p3583","authors":["Thore Fechner","Dennis Wilhelm","Christian Kray"],"conference":"CHI '15"}