{"paperId":2702344,"abstract":"Because the nature of chronic pain is complex, pharmacological analgesics are often not enough to achieve an ideal treatment plan. Virtual Reality (VR) technologies have emerged within medical research in recent years for treating acute pain, and proved to be an effective strategy based on pain distraction. This paper describes a VR system designed for chronic pain patients. The system incorporates biofeedback sensors, an immersive virtual environment, and stereoscopic sound titled the \"Virtual Meditative Walk\" (VMW). It was designed to enable chronic pain patients to learn Mindfulness-based stress reduction (MBSR), a form of meditation. By providing real-time visual and sonic feedback, VMW enables patients to learn how to manage their pain. A proof-of-concept user study was conducted to investigate the effectiveness of the VR system with chronic pain patients in clinical settings. Results show that the VMW was more effective in reducing perceived pain compared to the non-VR control condition.","citation":[{"content":"Ilkka Kosunen , Mikko Salminen , Simo Järvelä , Antti Ruonala , Niklas Ravaja , Giulio Jacucci, RelaWorld: Neuroadaptive and Immersive Virtual Reality Meditation System, Proceedings of the 21st International Conference on Intelligent User Interfaces, March 07-10, 2016, Sonoma, California, USA","paperID":"2856796"}],"reference":[{"content":"Macfarlane G. J., McBeth J., and Silman A. J., Widespread body pain and mortality: prospective population based study. BMJ, 323 (2001), 662--665.","paperID":"None"},{"content":"Gatchel R. J., Peng Y. B., Peters M. L., Fuchs P. N., and Turk D. C., The biopsychosocial approach to chronic pain: scientific advances and future directions. Psychol. Bull., 133 (2007), 581--624.","paperID":"None"},{"content":"Fishbain D. A., Cole B., Lewis J., Rosomoff H. L., and Rosomoff R. S., What percentage of chronic nonmalignant pain patients exposed to chronic opioid analgesic therapy develop abuse/addiction and/or aberrant drug-related behaviors? A structured evidence-based review. Pain Med. Malden Mass, 9 (2008), 444--459.","paperID":"None"},{"content":"Jamison R. N., Ross E. L., Michna E., Chen L. Q., Holcomb C., and Wasan A. D., Substance misuse treatment for high-risk chronic pain patients on opioid therapy: a randomized trial. Pain, 150 (2010), 390--400.","paperID":"None"},{"content":"Reibel D. K., Greeson J. M., Brainard G. C., and Rosenzweig S., Mindfulness-based stress reduction and health-related quality of life in a heterogeneous patient population. Gen. Hosp. Psychiatry, 23 (2001), 183--192.","paperID":"None"},{"content":"Hoffman H. G., Chambers G. T., Meyer W. J., Arceneaux L. L., Russell W. J., Seibel E. J., Richards T. L., Sharar S. R., and Patterson D. R., Virtual reality as an adjunctive non-pharmacologic analgesic for acute burn pain during medical procedures. Ann. Behav. Med. Publ. Soc. Behav. Med., 41 (2011), 183--191.","paperID":"None"},{"content":"Hoffman H. G., Patterson D. R., Carrougher G. J., and Sharar S. R., Effectiveness of virtual reality-based pain control with multiple treatments. Clin. J. Pain, 17 (2001), 229--235.","paperID":"None"},{"content":"Baer R. A., Mindfulness Training as a Clinical Intervention: A Conceptual and Empirical Review. Clin. Psychol. Sci. Pract., 10 (2003), 125--143.","paperID":"None"},{"content":"Satava R. M., Surgical robotics: the early chronicles: a personal historical perspective. Surg. Laparosc. Endosc. Percutan. Tech., 12 (2002), 6--16, Feb.2002.","paperID":"None"},{"content":"Shaw C., Gromala D., and Song M., The Meditation Chamber: Towards Self-Modulation. Proc. ENACTIVE (2007), 121--133.","paperID":"None"},{"content":"1Murray C. D., Pettifer S., Howard T., Patchick E. L., Caillette F., Kulkarni J., and Bamford C., The treatment of phantom limb pain using immersive virtual reality: three case studies. Disabil. Rehabil., 29 (2007), 1465--1469.","paperID":"None"},{"content":"Shiri S., Feintuch U., Weiss N., Pustilnik A., Geffen T., Kay B., Meiner Z., and Berger I., A virtual reality system combined with biofeedback for treating pediatric chronic headache--a pilot study. Pain Med. Malden Mass, 14 (2013), 621--627.","paperID":"None"},{"content":"Varni J. W., Seid M., and Rode C. A., The PedsQL: measurement model for the pediatric quality of life inventory. Med. Care, 37 (1999), 126--139.","paperID":"None"},{"content":"Hudlicka E., Virtual training and coaching of health behavior: example from mindfulness meditation training. Patient Education and Counseling, 92 (2013), pp. 160--166.","paperID":"None"}],"title":"The Virtual Meditative Walk: Virtual Reality Therapy for Chronic Pain Management","filename":"CHI15/p521","authors":["Diane Gromala","Xin Tong","Amber Choo","Mehdi Karamnejad","Chris D. Shaw"],"conference":"CHI '15"}