{"paperId":2702479,"reference":[{"content":"Bunch, D., Bradley, M., Golob, T., Kitamura, R. & Occhiuzzo, G. Demand for clean-fuel vehicles in California: A discrete-choice stated preference pilot project. In Transportation Research Part A: Policy and Practice 27:3 (1993), 237--253.","paperID":"None"},{"content":"Franke, T., Cocron, P., Bühler, F., Neumann, I., & Krems, J. F. Adapting to the range of an electric vehicle-the relation of experience to subjectively available mobility resources. In Proceedings of the European conference on human centered design for intelligent transport systems, (2012), 95--103.","paperID":"None"},{"content":"Franke, T., Neumann, I., Bühler, F., Cocron, P. & Krems, J., Experiencing range in an electric vehicle: Understanding psychological barriers. In Applied Psychology: An International Review 61 (2012), 368--391.","paperID":"None"},{"content":"Harrison, C., Amento, B., Kuznetsov, S., & Bell, R. Rethinking the progress bar. In Proc. UIST'07, ACM Press (2007), 115--118.","paperID":"None"},{"content":"Jian, J. Y., Bisantz, A. M. and Drury, C. G., Foundations for an empirically determined scale of trust in automated systems. International Journal of Cognitive Ergonomics 4 (2000), 53--71.","paperID":"None"},{"content":"Langer, E. J., & Piper, A. I. The prevention of mindlessness. Journal of Personality and Social Psychology 53, 2 (1987), 280--287.","paperID":"None"},{"content":"Lundström, A. Differentiated Driving Range: Exploring a Solution to the Problems with the Guess-O-Meter in Electric Cars. In Proc. AutomotiveUI 2014, ACM Press (2014), 1--8.","paperID":"None"},{"content":"Lundström, A. & Bogdan, C. (2012) COPE1 -- Taking Control over EV Range. In: In adjunct proc. Automitive-UI 2012. [Online]. 2012 pp. 17--18","paperID":"None"},{"content":"Lundström, A., Bogdan, C., Kis, F., Olsson, I. & Fahlén, L. Enough power to move: dimensions for representing energy availability. In Proc. MobileHCI 2012, ACM Press (2012), 201--210.","paperID":"None"},{"content":"Lee, J. D. & See, K. Trust in automation: Designing for appropriate reliance. In Human Factors: The Journal of the Human Factors and Ergonomics Society 46:1 (2004), 50--80.","paperID":"None"},{"content":"Leshed, G., Velden, T., Rieger, O., Kot, B., & Sengers, P. In-car gps navigation: engagement with and disengagement from the environment. In Proc, CHI 2008, ACM Press (2008), 1675--1684.","paperID":"None"},{"content":"Mallela, V., Ilankumaran, V. & Srinivasa Rao, N. Trends in cardiac pacemaker batteries. In Indian pacing and Electrophysiology Journal 4:4 (2004), 201--212.","paperID":"None"},{"content":"Myers, B. A. (1985). The importance of percent-done progress indicators for computer-human interfaces. In Proc. CHI '85, ACM Press (1985), 11--17.","paperID":"None"},{"content":"Parasuraman, R., & Miller, C. A.. Trust and etiquette in high-criticality automated systems. Communications of the ACM 47, 4 (2004), 51--55","paperID":"None"},{"content":"Rahmati, A., Qian, A. & Zhong, L. Understanding human-battery interaction on mobile phones. In Proc. MobileHCI 2007, ACM Press (2007), 265--272.","paperID":"None"},{"content":"Rauh, N., Franke, T., & Krems J. F., Understanding the impact of electric vehicle driving experience on range anxiety. Human Factors (2014), 1--19.","paperID":"None"},{"content":"Reeves, B. & Nass, C. The media equation: How people treat computers, television, and new media like real people and places. CSLI Publications and Cambridge University Press, (1996).","paperID":"None"},{"content":"Russell, J. A., Weiss, A., & Mendelsohn, G. A. Affect grid: a single-item scale of pleasure and arousal. Journal of personality and social psychology 57,3 (1989), 493--502.","paperID":"None"},{"content":"Sheridan, T. B., & Parasuraman, R., Human-Automation Interaction, Reviews of Human Factors and Ergonomics 1 (2005), 89--129","paperID":"None"},{"content":"Strömberg, H., Andersson, P., Almgren, S., Ericsson, J., Karlsson, M., & Nåbo, A. Driver interfaces for electric vehicles. In Proc. AutomotiveUI 2011, ACM Press (2011), 177--184.","paperID":"None"},{"content":"Zhang, Y., Wang, W., Kobayashi, Y. & Shirai, K. Remaining driving range estimation of electric vehicle. In Proc. IEVC 2012. IEEE (2012), 1--7. IEEE.","paperID":"None"},{"content":"Gaver, W. W., Beaver, J. & Benford, S. (2003, April). Ambiguity as a resource for design. In Proc. CHI 2003, ACM Press (2003), 233--240.","paperID":"None"}],"citation":[{"content":"Benjamin Pichler , Andreas Riener, Evaluation of historical electric vehicle (EV) driving data to suggest improvements in driving efficiency, Adjunct Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, September 01-03, 2015, Nottingham, United Kingdom","paperID":"2809756"}],"abstract":"We explore the impact of the displayed precision of instrumentation estimates of range and state-of-charge on drivers' attitudes towards an all-electric vehicle (EV), on their driving experience, and driving behavior under varying conditions of resource availability. Participants (N=73) completed a 19-mile long drive through highway, rural town and mountain road conditions in an EV that displayed high vs. low remaining range, and gave estimates of that range with high and low information ambiguity. We found that an ambiguous display of range preserved drivers' feelings of trust towards the vehicle, despite encountering situations intended to induce severe range anxiety. Furthermore, compared to drivers facing an unambiguous display of range, drivers presented with an ambiguous range display reported improved driving experience, and exhibited driving behavior better adapted to road and remaining range conditions.","title":"Displayed Uncertainty Improves Driving Experience and Behavior: The Case of Range Anxiety in an Electric Car","filename":"CHI15/p2201","authors":["Malte F. Jung","David Sirkin","Turgut M. Gür","Martin Steinert"],"conference":"CHI '15"}