{"paperId":2702568,"reference":[{"content":"ISO 9241--11:1998 Ergonomic requirements for office work with visual display terminals (VDTs) -- Part 11: Guidance on usability, 1998.","paperID":"None"},{"content":"ISO/IEC 25010:2011: Systems and software engineering -- Systems and software Quality Requirements and Evaluation (SQuaRE) -- System and software quality models, 2011.","paperID":"None"},{"content":"Atterer, R., Wnuk, M., and Schmidt, A. Knowing the User's Every Move -- User Activity Tracking for Website Usability Evaluation and Implicit Interaction. In Proc. WWW (2006).","paperID":"None"},{"content":"Bangor, A., Kortum, P. T., and Miller, J. T. An Empirical Evaluation of the System Usability Scale. IJHCI 24, 6 (2008).","paperID":"None"},{"content":"Bernstein, M. S., Little, G., Miller, R. C., Hartmann, B., Ackerman, M. S., Karger, D. R., Crowell, D., and Panovich, K. Soylent: A Word Processor with a Crowd Inside. In Proc. UIST (2010).","paperID":"None"},{"content":"Bozzon, A., Brambilla, M., and Comai, S. A Characterization of the Layout Definition Problem for Web Search Results. In OTM Workshops (2010).","paperID":"None"},{"content":"Brooke, J. SUS: A \"quick and dirty\" usability scale. In Usability Evaluation in Industry, P. W. Jordan, B. Thomas, B. A. Weerdmeester, and A. L. McClelland, Eds. Taylor and Francis, 1996. https://www.mturk.com/mturk/welcome (Sep 10, 2014).","paperID":"None"},{"content":"Carta, T., Patern'o, F., and Santana, V. F. Web Usability Probe: A Tool for Supporting Remote Usability Evaluation of Web Sites. In Proc. INTERACT (2011).","paperID":"None"},{"content":"de Vasconcelos, L. G., and Baldochi Jr., L. A. Towards an Automatic Evaluation of Web Applications. In Proc. SAC (2012).","paperID":"None"},{"content":"Gajos, K., and Weld, D. S. Preference Elicitation for Interface Optimization. In Proc. UIST (2005).","paperID":"None"},{"content":"Gajos, K., Wobbrock, J. O., and Weld, D. S. Improving the Performance of Motor-Impaired Users with Automatically-Generated, Ability-Based Interfaces. In Proc. CHI (2008).","paperID":"None"},{"content":"Grigera, J., Garrido, A., and Rivero, J. M. A Tool for Detecting Bad Usability Smells in an Automatic Way. In Proc. ICWE (Demos) (2014).","paperID":"None"},{"content":"Hassenzahl, M. User Experience (UX): Towards an experiential perspective on product quality. In Proc. IHM (2008).","paperID":"None"},{"content":"John, G. H., and Langley, P. Estimating Continuous Distributions in Bayesian Classifiers. In Proc. UAI (1995).","paperID":"None"},{"content":"Lew, P., Olsina, L., and Zhang, L. Quality, Quality in Use, Actual Usability and User Experience as Key Drivers for Web Application Evaluation. In Proc. ICWE (2010).","paperID":"None"},{"content":"Nebeling, M., Matulic, F., and Norrie, M. C. Metrics for the Evaluation of News Site Content Layout in Large-Screen Contexts. In Proc. CHI (2011).","paperID":"None"},{"content":"Nebeling, M., Speicher, M., and Norrie, M. C. CrowdAdapt: Enabling Crowdsourced Web Page Adaptation for Individual Viewing Conditions and Preferences. In Proc. EICS (2013).","paperID":"None"},{"content":"Nebeling, M., Speicher, M., and Norrie, M. C. W3Touch: Metrics-based Web Page Adaptation for Touch. In Proc. CHI (2013).","paperID":"None"},{"content":"Nielsen, J. Putting A/B Testing in Its Place, 2005. http://www.nngroup.com/articles/putting-ab-testing-in-its-place/, retrieved September 1, 2014.","paperID":"None"},{"content":"Nielsen, J., and Molich, R. Heuristic Evaluation of User Interfaces. In Proc. CHI (1990).","paperID":"None"},{"content":"Speicher, M. W3Touch: Crowdsourced Evaluation and Adaptation of Web Interfaces for Touch. Master's thesis, ETH Zurich, Switzerland, 2012.","paperID":"None"},{"content":"Speicher, M., Both, A., and Gaedke, M. Towards Metric-based Usability Evaluation of Online Web Interfaces. In Mensch & Computer Workshopband (2013).","paperID":"None"},{"content":"Speicher, M., Both, A., and Gaedke, M. Ensuring Web Interface Quality through Usability-based Split Testing. In Proc. ICWE (2014).","paperID":"None"}],"abstract":"Over the past 20 years, search engines have become emph{the} entry point of the WWW. Due to evolving needs for different and new kinds of information, the interfaces of search engine results pages (SERPs) change over time. Thus, their usability must be continuously evaluated to ensure user satisfaction and competitive edge. As no complete solution exists, we present emph{S.O.S.:} the emph{SERP Optimization Suite}. Our approach comprises (a) emph{WaPPU}, which is a near real-time tool for evaluating web interfaces based on usability scores, and (b) a emph{catalog of best practices} that maps bad scores to potential causes and corresponding adjustments for optimization. During a case study in which we assessed and optimized a real-world SERP, S.O.S. has proven its feasibility and effectiveness by significantly improving the SERP's usability.","citation":[],"title":"S.O.S.: Does Your Search Engine Results Page (SERP) Need Help?","filename":"CHI15/p1005","authors":["Maximilian Speicher","Andreas Both","Martin Gaedke"],"conference":"CHI '15"}