{"paperId":2702397,"citation":[],"reference":[{"content":"Antle, A. N. Research opportunities: Embodied child? computer interaction. International Journal of ChildComputer Interaction 1, 1 (2013), 30--36.","paperID":"None"},{"content":"Antle, A. N., Droumeva, M., & Ha, D. Hands on what?: comparing children's mouse based and tangiblebased interaction. In Proc. IDC 2009, ACM Press (2009), 80--88.","paperID":"None"},{"content":"Back, M, Cohen, J, Gold, R, Harrison, S and Minneman,S, Listen Reader: an electronically augmented paper-based book. In Proc. CHI 2001, ACM Press (2001), 23--29.","paperID":"None"},{"content":"Bakker, S., van den Hoven, E., & Antle, A. N. MoSo tangibles: evaluating embodied learning. In Proc.of Tangible, embedded, and embodied interaction 2011, ACM Press (2011), 85--92.","paperID":"None"},{"content":"Bruner, J. Toward a Theory of Instruction. Vol. 59. Harvard University Press (1966).","paperID":"None"},{"content":"Carini, R. M., George D. K., and Stephen P. Klein. Student engagement and student learning: Testing the linkages*. Research in Higher Education 47.1 (2006), 1--32","paperID":"None"},{"content":"DeLoache, J. S., et al. \"Do babies learn from baby media?.\" Psychological Science (2010).","paperID":"None"},{"content":"Englekamp, J. & Zimmer, H. D. Memory for action events: A new field of research. Psychological Research 51.4 (1989), 153--157.","paperID":"None"},{"content":"Glenberg, Arthur M. What memory is for: Creating meaning in the service of action. Behavioral and brain sciences 20,01 (1997), 41--50.","paperID":"None"},{"content":"Hayne, H., Herbert, J. & Simcock, G. Imitation from television by 24- and 30-month-olds. Developmental Science, 6, 3 (2003), 254--261.","paperID":"None"},{"content":"Henning, P. (1998). Everyday Cognition and Situated Learning. In Jonassen, D. (Ed.), Handbook of Research on Educational Communications and Technology. (2004), 829--861.","paperID":"None"},{"content":"Kahn, P. H., Severson, R. L., & Ruckert, J. H. The human relation with nature and technological nature. Current Directions in Psychological Science, 18, 1 (2009), 37--42.","paperID":"None"},{"content":"Klahr, D., Triona, L. M., and Williams, C. Hands on what? The relative effectiveness of physical versus virtual materials in an engineering design project by middle school children. Journal of Research in Science Teaching 44.1 (2007), 183--203.","paperID":"None"},{"content":"Martin, T., & Schwartz, D. L. Physically distributed learning: Adapting and reinterpreting physical environments in the development of the fraction concept. Cognitive Science, 29 (2005), 587--625.","paperID":"None"},{"content":"Montessori, M. Montessori method. Random House Digital, Inc., (1964).","paperID":"None"},{"content":"Olympiou, G., and Zacharias C. Z. Blending physical and virtual manipulatives: An effort to improve students' conceptual understanding through science laboratory experimentation. Science Education 96, 1 (2012), 21--47.","paperID":"None"},{"content":"O'Malley, C., Stanton-Fraser, D.: Literature review in learning with tangible technologies, Nesta FutureLab Series, report 12 (2004).","paperID":"None"},{"content":"Pouw, W. T., Van Gog, T., & Paas, F. An embedded and embodied cognition review of instructional manipulatives. Educational Psychology Review, 26, 1 (2014),, 51--72.","paperID":"None"},{"content":"Quinn, H. et al., A Framework for K-12 Science Education: Practices, Crosscutting Concepts, and Core Ideas, The National Academies Press (2012)","paperID":"None"},{"content":"Raffle, Hayes Solos, Amanda J. Parkes, and Hiroshi Ishii. Topobo: a constructive assembly system with kinetic memory. In Proc CHI 2004, ACM Press (2004), 647--654.","paperID":"None"},{"content":"Resnick, M., et al. Digital manipulatives: new toys to think with. In Proc. CHI 1998, ACM Press (1998), 281--287.","paperID":"None"},{"content":"Rieser, J.J., Garing, A.E. and Young M.F. Imagery, action and young children's spatial orientation-it's not being there that counts, it's what one has in mind. Child Development, 65, 5 (1994), 1262--1278.","paperID":"None"},{"content":"Rizzolatti, G., Craighero, L. The mirror-neuron system, Annual Review of Neuroscience, 27 (2004) 169--192.","paperID":"None"},{"content":"Rogers, Y., et al. A conceptual framework for mixed reality environments: designing novel learning activities for young children. Presence: Teleoperators and Virtual Environments 11, 6 (2002), 677--686.","paperID":"None"},{"content":"Ryokai, R. and Cassell, J. (1999). StoryMat: a play space for collaborative storytelling. In Proc. CHI 1999, ACM Press (1999), 272--273","paperID":"None"},{"content":"Schneider, B., Jermann, P., Zufferey, G., & Dillenbourg, P. Benefits of a Tangible Interface for Collaborative Learning and Interaction. IEEE Transactions on Learning Technologies, 4 (2011), 222--232.","paperID":"None"},{"content":"Shelley, T., Lyons, L., Zellner, M., & Minor, E. Evaluating the embodiment benefits of a paper-based tui for educational simulations. Ext. Abstracts CHI 2011, ACM Press (2011), 1375--1380.","paperID":"None"},{"content":"Ullmer, B. and Ishii, H. Emerging frameworks for tangible user interfaces. IBM Syst. J. (2000) 915--931.","paperID":"None"},{"content":"Yannier, N., Basdogan, C., Tasiran, S., Sen, O. L., Using Haptics to Convey Cause and Effect Relations in Climate Visualization, IEEE Transactions on Haptics, 1, 2 (2009), 130--141.","paperID":"None"},{"content":"Yannier, N., Hudson. E. S, Wiese, E., Koedinger, K., Adding Physicality to an Interactive Game Improves Learning and Enjoyment: Evidence from EarthShake, Under Review","paperID":"None"},{"content":"Yannier, N., Koedinger, K. R. and Hudson, S. E. Tangible Collaborative Learning with a Mixed-Reality Game: EarthShake. Artificial Intelligence in Education. Springer Berlin Heidelberg (2013), 131--140.","paperID":"None"},{"content":"Walker, E., & Burleson, W. Using Need Validation to Design an Intelligent Tangible Learning Environment, Ext. Abstracts CHI 2012, ACM Press (2012), 2123--2128.","paperID":"None"}],"abstract":"The possibility of leveraging technology to support children's learning in the real world is both appealing and technically challenging. We have been exploring factors in tangible games that may contribute to both learning and enjoyment with an eye toward technological feasibility and scalability. Previous research found that young children learned early physics principles better when interactively predicting and observing experimental comparisons on a physical earthquake table than when seeing a video of the same. Immersing children in the real world with computer vision-based feedback appears to evoke embodied cognition that enhances learning. In the current experiment, we replicated this intriguing result of the mere difference between observing the real world versus a flat-screen. Further, we explored whether a simple and scalable addition of physical control (such as shaking a tablet) would yield an increase in learning and enjoyment. Our 2x2 experiment found no evidence that adding simple forms of hands-on control enhances learning, while demonstrating a large impact of physical observation. A general implication for educational game design is that affording physical observation in the real world accompanied by interactive feedback may be more important than affording simple hands-on control on a tablet.","title":"Learning from Mixed-Reality Games: Is Shaking a Tablet as Effective as Physical Observation?","filename":"CHI15/p1045","authors":["Nesra Yannier","Kenneth R. Koedinger","Scott E. Hudson"],"conference":"CHI '15"}