{"paperId":2702192,"abstract":"Implantable cardioverter-defibrillator (ICD) patients have increased safety when connected to remote monitoring as ICD problems and issues are instantly discovered compared to patients without a monitor. While remote monitoring is intrusive in the domestic environment, little HCI research has investigated how people live and interact with such monitoring technologies. We conducted a study with 19 ICD patients and their spouses using diaries and interviews. Our findings illustrate that our participants were satisfied with the monitoring despite the fact that they had almost no knowledge of the data collected and they lacked feedback from the monitor on transmission and operation. Based on our findings, we describe a safety paradox for remote monitoring as participants experienced less safety while being safer, and identify privacy and surveillance concerns in the unequal monitoring of ICD patients.","citation":[],"reference":[{"content":"Al-Khatib, S. M., Piccini, J. P., Knight, D., Stewart, M., Clapp-Channing, N., and Sanders, G. D. Remote Monitoring of Implantable Cardioverter Defibrillators versus Quarterly Device Interrogations in Clinic: Results from a Randomized Pilot Clinical Trial. Journal of Cardiovascular Electrophysiology, Vol. 21, No. 5 (2010), 545--550","paperID":"None"},{"content":"Ballegaard, S. A., Hansen, T. R., and Kyng, M. Healthcare in Everyday Life -- Designing Healthcare Services for Daily Life. Proc CHI 2008, Florence, Italy, ACM Press (2008), 1807--1816","paperID":"None"},{"content":"Birnholtz, J. and Jones-Rounds, M. Independence and Interaction: Understanding Seniors' Privacy and Awareness Needs for Aging in Place. Proc CHI 2010, Atlanta, USA, ACM Press (2010), 143--152","paperID":"None"},{"content":"Brugada, P. What Evidence do we have to Replace InHospital Implantable Cardioverter Defibrillator FollowUp? Clinical Research in Cardiology, Vol. 95 (2006), 3--9","paperID":"None"},{"content":"Burri, H. and Senouf, D. Remote Monitoring and Follow-Up of Pacemakers and Implantable Cardioverter Defibrillators. Europace, Vol. 11 (2009), 701--709","paperID":"None"},{"content":"Carter, S. and Mankoff, J. When Participants do the Capturing: The Role of Media in Diary Studies. Proc CHI 2005, Oregon, USA, ACM Press (2005), 899--908","paperID":"None"},{"content":"Choe, E. K., Consolve, S., Jung, J., Harrison, B., and Kientz, J. A. Living in a Glass House: A Survey of Private Moments in the Home. Proc UbiComp '11, Beijing, China, ACM Press (2011), 41--44","paperID":"None"},{"content":"Denning, T., Borning, A., Friedman, B., Gill, B. T., Kohno, T., and Maisel, W. H. Patients, Pacemakers, and Implantable Defibrillators: Human Values and Security for Wireless Implantable Medical Devices. Proc CHI 2010, Atlanta, USA, ACM Press (2010), 917--926","paperID":"None"},{"content":"DiMarco, J. P. Implantable Cardioverter-Defibrillators. The New England Journal of Medicine, Vol. 349, November (2003), 1836--1847","paperID":"None"},{"content":"Elliott, H. The Use of Diaries in Sociological Research on Health Experience. Sociological Research Online, Vol. 2, No. 2 (1997)","paperID":"None"},{"content":"European Medicines Agency. Guideline for Good Clinical Practice. EMEA, (2006)","paperID":"None"},{"content":"Hindricks, G. et al. Implant-Based Multiparameter Telemonitoring of Patients with Heart Failure (INTIME): A Randomised Controlled Trial. The Lancet, Vol. 384, No. 9943 (2014), 583--590","paperID":"None"},{"content":"Huber, L., Shankar, K., Caine, K., Connelly, K., Camp, L. J., Walker, B. A. and Borrero, L. How In-Home Technologies Mediate Caregiving Relationships in Later Life. International Journal of Human-Computer Interaction. Vol. 29, No. 7 (2013), 441--455","paperID":"None"},{"content":"Kumar, S., Kambhatia, K., Hu, F., Lifson, m., and Xiao, Y. Ubiquitous Computing for Remote Cardiac Patient Monitoring: A Survey. International Journal of Telemedicine and Applications, Vol. 4 (2008), 1--19","paperID":"None"},{"content":"Leith, B. A. Patient and Family Members' Perceptions of Transfer from Intensive Care. Heart and Lung, Vol. 28, No. 3 (1999), 210--218","paperID":"None"},{"content":"Lorenzen-Huber, L., Boutain, M., Camp, L. J., Shankar, K., and Connelly, K. H. Privacy, technology, and aging: A Proposed Framework. Ageing International, Vol. 36 (2011), 232--252","paperID":"None"},{"content":"Magyar-Russell, G., Thombs, B. D. et al. The Prevalence of Anxiety and Depression in Adults with Implantable Cardioverter Defibrillators: A Systematic Review. Journal of Psychosomatic Research. Elsevier, Vol. 71 (2011), pp. 223--231","paperID":"None"},{"content":"Maitland, J. and Chalmers, M. Self-Monitoring, SelfAwareness, and Self-Determination in Cardiac Rehabilitation. Proc CHI 2010, Atlanta, USA, ACM Press (2010), 1213--1222","paperID":"None"},{"content":"Masella, C., Zanaboni, P., Di Stasi, F., Gilardi, S., Ponzi, P., and Valsecchi, S. Assessment of a Remote Monitoring System for Implantable Cardioverter Defibrillators. Journal of Telemedicine and Telecare, Vol. 14 (2008), 290--294","paperID":"None"},{"content":"Matlock, D. D. Big Brother is Watching You: What do Patients Think About ICD Home Monitoring? Ciculation, American Heart Association, (2010), 319-","paperID":"None"},{"content":"Nielsen, J. C. et al. Automatic Home Monitoring of Implantable Cardioverter Defibrillators. Europace, Vol. 10 (2008), 729--735","paperID":"None"},{"content":"Oulasvirta, A., Pihlajamaa, A., Perkiö, J., Ray, R., Vähäkangas, T., Hasu, T., Vainio, N., and Myllymäki, P. Long-Term Effects of Ubiquitous Surveillance in the Home. Proc UbiComp '13, Zurich, Switzerland, ACM Press (2013), 41--50","paperID":"None"},{"content":"Palen, L. and Dourish, P. Unpacking \"Privacy\" for a Networked World. Proc CHI 2003, Fort Lauderdale, USA, ACM Press (2003), 129--136","paperID":"None"},{"content":"Riceur, P. From Text to Action: Essays in Hermeneutics II, trans. Northwestern University Press,","paperID":"None"},{"content":"Rogers, W. A. and Fisk A. D. Toward A Psychological Science of Advanced Technology Design for Older Adults. The Journals of Gerontology Series B: Psychological Sciences and Social Sciences, Vol. 65 (2010), 645","paperID":"None"},{"content":"Shanker, K., Camp, L. J., Connely, K., and Huber, L. Aging, Privacy, and Home-Based Computing: Developing a Design Framework. Pervasive Computing, October-December (2012), 46--54","paperID":"None"},{"content":"Theuns, D. A. M. J., Res, J. C. J., and Jordaens, L. J. Home monitoring in ICD therapy: future perspectives. Europace, Vol. 5 (2003), 139--142","paperID":"None"},{"content":"Vines, J., Lindsay, S., Pritchard, G. W., Lie, M., Greathead, D., Olivier, P., and Brittain, K. Making Family Care Work: Dependence, Privacy and Remote Home Monitoring Telecare Systems. Proc UbiComp '13, Zurich, Switzerland, ACM Press (2013), 607--616","paperID":"None"},{"content":"Walker, A. The Economic \"Burden\" of Ageing and the Prospect of Intergenerational Conflict. Ageing and Society, Vol. 10, No. 4 (1990), 377--396","paperID":"None"},{"content":"Wilcox, L., Morris, D., Tan, D., and Gatewood, J. Designing Patient-Centric Information Displays for Hospitals. Proc CHI 2010, Atlanta, USA, ACM Press (2010), 2123--2132","paperID":"None"},{"content":"World Medical Association. Declaration of Helsinki: Ethical Principles for Medical Research Involving Human Subjects. 64th WMA General Assembly, Fortaleza, Brazil, October (2013)","paperID":"None"},{"content":"Zayac, S. and Finch, N. Recipients' of Implanted Cardioverter-Defibrillators Actual and Perceived Adaptation: A Review of the Literature. Journal of the American Academy of Nurse Practitioners, Vol. 21 (2009), 549--556","paperID":"None"}],"title":"No News is Good News: Remote Monitoring of Implantable Cardioverter-Defibrillator Patients","filename":"CHI15/p827","authors":["Mikael B. Skov","Pauline G. Johansen","Charlotte S. Skov","Astrid Lauberg"],"conference":"CHI '15"}