{"paperId":2702215,"reference":[{"content":"Ashbrook, D., Lyons, K., and Starner, T. An investigation into round touchscreen wristwatch interaction. Proc. of ACM MobileHCI'08.","paperID":"None"},{"content":"Badam, S.K. and Elmqvist, N. PolyChrome: A CrossDevice Framework for Collaborative Web Visualization. Proc. of ACM ITS'14.","paperID":"None"},{"content":"Baudisch, P. and Chu, G. Back-of-device interaction allows creating very small touch devices. Proc. of ACM CHI'09.","paperID":"None"},{"content":"Blasko, G. and Feiner, S. An interaction system for watch computers using tactile guidance and bidirectional segmented strokes. Proc. of IEEE ISWC 2004.","paperID":"None"},{"content":"Butler, A., Izadi, S., and Hodges, S. SideSight: multitouch interaction around small devices. Proc. of ACM UIST'08.","paperID":"None"},{"content":"Cao, X. and Balakrishnan, R. Interacting with dynamically defined information spaces using a handheld projector and a pen. Proc. of ACM UIST'09.","paperID":"None"},{"content":"Chen, X., Grossman, T., Wigdor, D.J., and Fitzmaurice, G. Duet: exploring joint interactions on a smart phone and a smart watch. Proc. of ACM CHI'14.","paperID":"None"},{"content":"Funk, M., Sahami, A., Henze, N., and Schmidt, A. Using a touch-sensitive wristband for text entry on smart watches. ACM CHI'14 EA.","paperID":"None"},{"content":"Greenberg, S. Toolkits and interface creativity. Multimedia Tools and Applications, (2007).","paperID":"None"},{"content":"Hamilton, P. and Wigdor, D.J. Conductor: enabling and understanding cross-device interaction. Proc. of ACM CHI'14.","paperID":"None"},{"content":"Hardy, R. and Rukzio, E. Touch & interact: touch-based interaction of mobile phones with displays. Proc. of ACM MobileHCI'08.","paperID":"None"},{"content":"Harrison, C. and Hudson, S.E. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. Proc. of ACM UIST'09.","paperID":"None"},{"content":"Harrison, C., Schwarz, J., and Hudson, S.E. TapSense: enhancing finger interaction on touch surfaces. Proc. of ACM UIST'11.","paperID":"None"},{"content":"Hartmann, B., Beaudouin-Lafon, M., and Mackay, W.E. HydraScope: creating multi-surface meta-applications through view synchronization and input multiplexing. Proc. of ACM PerDis'13.","paperID":"None"},{"content":"Heikkinen, T., Goncalves, J., Kostakos, V., Elhart, I., and Ojala, T. Tandem Browsing Toolkit: Distributed MultiDisplay Interfaces with Web Technologies. Proc. of ACM PerDis'14.","paperID":"None"},{"content":"Hinckley, K., Ramos, G., Guimbretiere, F., Baudisch, P., and Smith, M. Stitching: pen gestures that span multiple displays. Proc. of ACM AVI'04.","paperID":"None"},{"content":"Hinckley, K. Synchronous gestures for multiple persons and computers. Proc. of ACM UIST'03.","paperID":"None"},{"content":"Huang, D.-Y., Tsai, M.-C., Tung, Y.-C., et al. TouchSense: expanding touchscreen input vocabulary using different areas of users' finger pads. Proc. of ACM CHI'14.","paperID":"None"},{"content":"Kim, J., He, J., Lyons, K., and Starner, T. The gesture watch: A wireless contact-free gesture based wrist interface. Proc. of IEEE ISWC'07,.","paperID":"None"},{"content":"Knibbe, J., Martinez Plasencia, D., Bainbridge, C., et al. Extending interaction for smart watches: enabling bimanual around device control. ACM CHI'14 EA.","paperID":"None"},{"content":"Laput, G., Xiao, R., Chen, X., Hudson, S.E., and Harrison, C. Skin buttons: cheap, small, low-powered and clickable fixed-icon laser projectors. Proc. of ACM UIST'14.","paperID":"None"},{"content":"Lyons, K., Nguyen, D., Ashbrook, D., and White, S. Facet: a multi-segment wrist worn system. Proc. of ACM UIST'12.","paperID":"None"},{"content":"Marquardt, N., Ballendat, T., Boring, S., Greenberg, S., and Hinckley, K. Gradual engagement: facilitating information exchange between digital devices as a function of proximity. Proc. of ACM ITS'12.","paperID":"None"},{"content":"Mayer, S. and Sörös, G. User Interface Beaming Seamless Interaction with Smart Things using Personal Wearable Computers\". Proc. of IEEE BSN 2014.","paperID":"None"},{"content":"Merrill, D., Kalanithi, J., and Maes, P. Siftables: towards sensor network user interfaces. Proc. of ACM TEI'07.","paperID":"None"},{"content":"Myers, B., Hudson, S.E., and Pausch, R. Past, present, and future of user interface software tools. TOCHI 2000.","paperID":"None"},{"content":"Nebeling, M., Mintsi, T., Husmann, M., and Norrie, M. Interactive development of cross-device user interfaces. Proc. of ACM CHI'14.","paperID":"None"},{"content":"Nebeling, M., Teunissen, E., Husmann, M., and Norrie, M.C. XDKinect: development framework for crossdevice interaction using kinect. Proc. of ACM EICS'14.","paperID":"None"},{"content":"Oakley, I. and Lee, D. Interaction on the edge: offset sensing for small devices. Proc. of ACM CHI'14.","paperID":"None"},{"content":"Olberding, S., Yeo, K.P., Nanayakkara, S., and Steimle, J. AugmentedForearm: exploring the design space of a display-enhanced forearm. Proc. of ACM AH'13.","paperID":"None"},{"content":"Olsen Jr, D.R. Evaluating user interface systems research. Proc. of ACM UIST'07.","paperID":"None"},{"content":"Pasquero, J., Stobbe, S.J., and Stonehouse, N. A haptic wristwatch for eyes-free interactions. Proc. of ACM CHI'11.","paperID":"None"},{"content":"Perrault, S.T., Lecolinet, E., Eagan, J., and Guiard, Y. Watchit: simple gestures and eyes-free interaction for wristwatches and bracelets. Proc. of ACM CHI'13.","paperID":"None"},{"content":"Rekimoto, J. Pick-and-drop: a direct manipulation technique for multiple computer environments. Proc. of ACM UIST'97.","paperID":"None"},{"content":"Rekimoto, J. Gesturewrist and gesturepad: Unobtrusive wearable interaction devices. Proc. of IEEE ISWC'01.","paperID":"None"},{"content":"Schmidt, D., Chehimi, F., Rukzio, E., and Gellersen, H. PhoneTouch: a technique for direct phone interaction on surfaces. Proc. of ACM UIST'10.","paperID":"None"},{"content":"Schmidt, D., Seifert, J., Rukzio, E., and Gellersen, H. A cross-device interaction style for mobiles and surfaces. Proc. of ACM DIS'12.","paperID":"None"},{"content":"Xiao, R., Laput, G., and Harrison, C. Expanding the input expressivity of smartwatches with mechanical pan, twist, tilt and click. Proc. of ACM CHI'14.","paperID":"None"},{"content":"Yang, J. and Wigdor, D. Panelrama: enabling easy specification of cross-device web applications. Proc. of ACM CHI'14.","paperID":"None"},{"content":"Von Zadow, U., Büschel, W., Langner, R., and Dachselt, Raimund. SleeD: Using a Sleeve Display to Interact with Touch-sensitive Display Walls. Proc. of ACM ITS'14.","paperID":"None"},{"content":"Pebble. http://developer.getpebble.com.","paperID":"None"},{"content":"Sony Watch. http://developer.sony.com/.","paperID":"None"},{"content":"Apple Watch. http://apple.com/watch/.","paperID":"None"},{"content":"Phidgets. http://phidgets.com.","paperID":"None"},{"content":"Arduino. http://arduino.cc.","paperID":"None"}],"citation":[{"content":"Steven Houben , Jo Vermeulen , Clemens Klokmose , Nicolai Marquardt , Johannes Schöning , Harald Reiterer, Cross-Surface: Workshop on Interacting with Multi-Device Ecologies in the Wild, Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces, November 15-18, 2015, Madeira, Portugal","paperID":"2835067"},{"content":"Steven Houben , Simon Perrault , Marcos Serrano, Bonjour! Greeting Gestures for Collocated Interaction with Wearables, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, August 24-27, 2015, Copenhagen, Denmark","paperID":"2794347"},{"content":"Jens Grubert , Matthias Kranz , Aaron Quigley, Design and Technology Challenges for Body Proximate Display Ecosystems, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, August 24-27, 2015, Copenhagen, Denmark","paperID":"2794310"},{"content":"Giuseppe Ghiani , Marco Manca , Fabio Paternò, Authoring context-dependent cross-device user interfaces based on trigger/action rules, Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia, November 30-December 02, 2015, Linz, Austria","paperID":"2836073"},{"content":"Michael Nebeling , Fabio Paternò , Frank Maurer , Jeffrey Nichols, Systems and tools for cross-device user interfaces, Proceedings of the 7th ACM SIGCHI Symposium on Engineering Interactive Computing Systems, June 23-26, 2015, Duisburg, Germany","paperID":"2777463"},{"content":"Mikael B. Skov , Jesper Kjeldskov , Jeni Paay , Heidi P. Jensen , Marius P. Olsen, Investigating Cross-Device Interaction Techniques: A Case of Card Playing on Handhelds and Tablets, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838763"},{"content":"Teddy Seyed , Alaa Azazi , Edwin Chan , Yuxi Wang , Frank Maurer, SoD-Toolkit: A Toolkit for Interactively Prototyping and Developing Multi-Sensor, Multi-Device Environments, Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces, November 15-18, 2015, Madeira, Portugal","paperID":"2817750"},{"content":"Marcos Serrano , Barrett Ens , Xing-Dong Yang , Pourang Irani, Gluey: Developing a Head-Worn Display Interface to Unify the Interaction Experience in Distributed Display Environments, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, August 24-27, 2015, Copenhagen, Denmark","paperID":"2785838"}],"abstract":"People increasingly use smartwatches in tandem with other devices such as smartphones, laptops or tablets. This allows for novel cross-device applications that use the watch as both input device and output display. However, despite the increasing availability of smartwatches, prototyping cross-device watch-centric applications remains a challenging task. Developers are limited in the applications they can explore as available toolkits provide only limited access to different types of input sensors for cross-device interactions. To address this problem, we introduce WatchConnect, a toolkit for rapidly prototyping cross-device applications and interaction techniques with smartwatches. The toolkit provides developers with (i) an extendable hardware platform that emulates a smartwatch, (ii) a UI framework that integrates with an existing UI builder, and (iii) a rich set of input and output events using a range of built-in sensor mappings. We demonstrate the versatility and design space of the toolkit with five interaction techniques and applications.","title":"WatchConnect: A Toolkit for Prototyping Smartwatch-Centric Cross-Device Applications","filename":"CHI15/p1247","authors":["Steven Houben","Nicolai Marquardt"],"conference":"CHI '15"}