{"paperId":2702399,"abstract":"Quantitative assessment for cognitive load and mental stress is very important in optimizing human-computer system designs to improve performance and efficiency. Traditional physiological measures, such as heart rate variation (HRV), blood pressure and electrodermal activity (EDA), are widely used but still have limitations in sensitivity, reliability and usability. In this study, we propose a novel photoplethysmogram-based stress induced vascular index (sVRI) to measure cognitive load and stress. We also provide the basic methodology and detailed algorithm framework. We employed a classic experiment with three levels of task difficulty and three stages of testing period to verify the new measure. Compared with the blood pressure, heart rate and HRV components recorded simultaneously, the sVRI reached the same level of significance on the effect of task difficulty/period as the most significant other measure. Our findings showed sVRI's potential as a sensitive, reliable and usable parameter.","citation":[],"reference":[{"content":"Paas, F., Tuovinen, J.E., Tabbers, H., et al. Cognitive Load Measurement as a Means to Advance Cognitive Load Theory. Educ. Psychol. 38, 1 (2003), 63--71.","paperID":"None"},{"content":"Sharon Oviatt, Human-centered design meets cognitive load theory: designing interfaces that help people think, Proceedings of the 14th annual ACM international conference on Multimedia, October 23-27, 2006, Santa Barbara, CA, USA","paperID":"1180831"},{"content":"Brouwer, A.-M., Hogervorst, M.A., Holewijn, M., et al. Evidence for effects of task difficulty but not learning on neurophysiological variables associated with effort. Int. J. Psychophysiol. 93, 2 (2014), 242--252.","paperID":"None"},{"content":"Brunken, R., Plass, J.L., and Leutner, D. Direct Measurement of Cognitive Load in Multimedia Learning. Educ. Psychol. 38, 1 (2003), 53--61.","paperID":"None"},{"content":"Javier Hernandez , Pablo Paredes , Asta Roseway , Mary Czerwinski, Under pressure: sensing stress of computer users, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557165"},{"content":"David Sun , Pablo Paredes , John Canny, MouStress: detecting stress from mouse motion, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557243"},{"content":"Chiew Seng Sean Tan , Johannes Schöning , Kris Luyten , Karin Coninx, Investigating the effects of using biofeedback as visual stress indicator during video-mediated collaboration, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557038"},{"content":"Lazarus, R.S. Psychological stress and the coping process. McGraw-Hill (1966), New York.","paperID":"None"},{"content":"Hart, S.G. and Staveland, L.E. Development of NASATLX (Task Load Index): Results of Empirical and Theoretical Research. In Advances in Psychology, North-Holland (1988), 139--183.","paperID":"None"},{"content":"Verwey, W.B. and Veltman, H.A. Detecting short periods of elevated workload: A comparison of nine workload assessment techniques. J. Exp. Psychol. Appl. 2, 3 (1996), 270--285.","paperID":"None"},{"content":"Matthews, G., Campbell, S.E., Falconer, S., et al. Fundamental dimensions of subjective state in performance settings: Task engagement, distress, and worry. Emotion 2, 4 (2002), 315--340.","paperID":"None"},{"content":"Yuan Gao , Nadia Bianchi-Berthouze , Hongying Meng, What Does Touch Tell Us about Emotions in Touchscreen-Based Gameplay?, ACM Transactions on Computer-Human Interaction (TOCHI), v.19 n.4, p.1-30, December 2012","paperID":"2395138"},{"content":"Dennerlein, J., Becker, T., Johnson, P., et al. Frustrating computer users increases exposure to physical factors. In Proceedings of the International Ergonomics Association, Seoul, Korea(2003).","paperID":"None"},{"content":"Kreibig, S.D. Autonomic nervous system activity in emotion: A review. Biol. Psychol. 84, 3 (2010), 394--421.","paperID":"None"},{"content":"Berntson, G.G., Cacioppo, J.T., and Quigley, K.S. Autonomic determinism: The modes of autonomic control, the doctrine of autonomic space, and the laws of autonomic constraint. Psychological. Review 98, 4 (1991), 459--487.","paperID":"None"},{"content":"Iani, C., Gopher, D., and Lavie, P. Effects of task difficulty and invested mental effort on peripheral vasoconstriction. Psychophysiology 41, 5 (2004), 789798.","paperID":"None"},{"content":"Mulder, G. The concept and measurement of mental effort. In Energetics and human information processing, Springer (1986), 175--198.","paperID":"None"},{"content":"Brouwer, A.-M., Hogervorst, M.A., Van Erp, J.B., et al. Estimating workload using EEG spectral power and ERPs in the n-back task. Journal of neural engineering 9, 4 (2012), 045008.","paperID":"None"},{"content":"Li Luo , Lijun Xiao , Danmin Miao , Xiaomin Luo, The Relationship between Mental Stress Induced Changes in Cortisol Levels and Vascular Responses Quantified by Waveform Analysis: Investigating Stress-Dependent Indices of Vascular Changes, Proceedings of the 2012 International Conference on Biomedical Engineering and Biotechnology, p.929-933, May 28-30, 2012","paperID":"2356829"},{"content":"Hjortskov, N., Rissén, D., Blangsted, A.K., et al. The effect of mental stress on heart rate variability and blood pressure during computer work. Eur. J. Appl. Physiol. 92, 1--2 (2004), 84--89.","paperID":"None"},{"content":"Frédéric Bousefsaf , Choubeila Maaoui , Alain Pruski, Remote detection of mental workload changes using cardiac parameters assessed with a low-cost webcam, Computers in Biology and Medicine, v.53 n.C, p.154-163, October, 2014","paperID":"2724270"},{"content":"Yoo, K.-S. and Lee, W.-H. Mental stress assessment based on pulse photoplethysmography. In Proc. ISCE 2011, IEEE (2011), 323--326.","paperID":"None"},{"content":"Hiroshi Chigira , Atsuhiko Maeda , Minoru Kobayashi, Area-based photo-plethysmographic sensing method for the surfaces of handheld devices, Proceedings of the 24th annual ACM symposium on User interface software and technology, October 16-19, 2011, Santa Barbara, California, USA","paperID":"2047262"},{"content":"Schäfer, A. and Vagedes, J. How accurate is pulse rate variability as an estimate of heart rate variability?: A review on studies comparing photoplethysmographic technology with an electrocardiogram. Int. J. Cardiol. 166, 1 (2013), 15--29.","paperID":"None"},{"content":"Wijshoff, R.W.C.G.R., Veen, J., Van Der Lee, A.M., et al. PPG motion artifact handling using a self-mixing interferometric sensor. In SPIE2011, SPIE(2011), 78940F-78940F-78913.","paperID":"None"},{"content":"Wijshoff, R.W.C.G.R., Mischi, M., Veen, J., et al. Reducing motion artifacts in photoplethysmograms by using relative sensor motion: phantom study. Journal of Biomedical Optics 17, 11 (2012), 117007--117007.","paperID":"None"},{"content":"Chen, C.-C., Lin, S.-C., Young, M.-S., et al. Accumulated Mental Stress Study Using the Meridians of Traditional Chinese Medicine with Photoplethysmography. The Journal of Alternative and Complementary Medicine 20, 11 (2014), 860--867.","paperID":"None"},{"content":"Ritter, F.E., Reifers, A.L., Klein, L.C., et al. Lessons from defining theories of stress for cognitive architectures. Integrated models of cognitive systems(2007), 254--262.","paperID":"None"}],"title":"Measuring Photoplethysmogram-Based Stress-Induced Vascular Response Index to Assess Cognitive Load and Stress","filename":"CHI15/p857","authors":["Yongqiang Lyu","Xiaomin Luo","Jun Zhou","Chun Yu","Congcong Miao","Tong Wang","Yuanchun Shi","Ken-ichi Kameyama"],"conference":"CHI '15"}