{"paperId":2702528,"citation":[],"reference":[{"content":"Association of Energy Engineers. Certified Energy Auditor. 2014. http://www.aeecenter.org/i4a/pages/index.cfm?pageid=3365.","paperID":"None"},{"content":"Balaras, C.A. and Argiriou, A.A. Infrared thermography for building diagnostics. Energy and Buildings 34, 2 (2002), 171--183.","paperID":"None"},{"content":"Bardhan, A., Jaffee, D., Kroll, C., and Wallace, N. Energy efficiency retrofits for U.S. housing: Removing the bottlenecks. Regional Science and Urban Economics 47, (2014), 45--60.","paperID":"None"},{"content":"Eric P.S. Baumer , M. Six Silberman, When the implication is not to design (technology), Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979275"},{"content":"Eli Blevis, Sustainable interaction design: invention & disposal, renewal & reuse, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240705"},{"content":"Borrmann, D., Nüchter, A., Dakulovic, M., et al. The Project ThermalMapper-Thermal 3D mapping of indoor environments for saving energy. Proc. of SYROCO'12, 1--8.","paperID":"None"},{"content":"Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.","paperID":"None"},{"content":"Brooks, P. Testing Building Envelopes with Infrared Thermography: Delivering the \"Big Picture.\" Interface, the Technical Journal of RCI July, (2007).","paperID":"None"},{"content":"Hronn Brynjarsdottir , Maria Håkansson , James Pierce , Eric Baumer , Carl DiSalvo , Phoebe Sengers, Sustainably unpersuaded: how persuasion narrows our vision of sustainability, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208539"},{"content":"Demisse, G.G., Borrmann, D., and Nuchter, A. Interpreting thermal 3D models of indoor environments for energy efficiency. Proc. of ICAR'13, 1--8.","paperID":"None"},{"content":"Tawanna Dillahunt , Jennifer Mankoff , Eric Paulos , Susan Fussell, It's not all about \"Green\": energy use in low-income communities, Proceedings of the 11th international conference on Ubiquitous computing, September 30-October 03, 2009, Orlando, Florida, USA","paperID":"1620583"},{"content":"Tawanna Dillahunt , Jennifer Mankoff , Eric Paulos, Understanding conflict between landlords and tenants: implications for energy sensing and feedback, Proceedings of the 12th ACM international conference on Ubiquitous computing, September 26-29, 2010, Copenhagen, Denmark","paperID":"1864376"},{"content":"Dios, J.R.M.-D. and Ollero, A. Automatic Detection of Windows Thermal Heat Losses in Buildings Using UAVs. 2006 World Automation Congress, IEEE (2006), 1--6.","paperID":"None"},{"content":"Carl DiSalvo , Phoebe Sengers , Hrönn Brynjarsdóttir, Mapping the landscape of sustainable HCI, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753625"},{"content":"Paul Dourish, HCI and environmental sustainability: the politics of design and the design of politics, Proceedings of the 8th ACM Conference on Designing Interactive Systems, August 16-20, 2010, Aarhus, Denmark","paperID":"1858173"},{"content":"Jon Froehlich , Leah Findlater , James Landay, The design of eco-feedback technology, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753629"},{"content":"Golparvar-Fard, M. and Ham, Y. Automated Diagnostics and Visualization of Potential Energy Performance Problems in Existing Buildings Using Energy Performance Augmented Reality Models. J. of Computing in Civil Engineering 28, 1 (2014), 17--29.","paperID":"None"},{"content":"Goodhew, J., Pahl, S., Auburn, T., and Goodhew, S. Making Heat Visible: Promoting Energy Conservation Behaviors Through Thermal Imaging. Environment and Behavior, (2014).","paperID":"None"},{"content":"Maria Håkansson , Phoebe Sengers, Beyond being green: simple living families and ICT, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2481378"},{"content":"Youngjib Ham , Mani Golparvar-Fard, An automated vision-based method for rapid 3D energy performance modeling of existing buildings using thermal and digital imagery, Advanced Engineering Informatics, v.27 n.3, p.395-409, August, 2013","paperID":"2501295"},{"content":"Helcke, G.A., Conti, F., et al. A detailed comparison of energy audits carried out by four separate companies on the same set of buildings. Energy and Buildings 14, 2 (1990), 153--164.","paperID":"None"},{"content":"Hruschka, D.J., Schwartz, D., et al. Reliability in Coding OpenEnded Data: Lessons Learned from HIV Behavioral Research. Field Methods 16 , 3 (2004), 307--331.","paperID":"None"},{"content":"Ingle, A., Moezzi, M., Lutzenhiser, L., and Diamond, R. How well do home energy audits serve the homeowner? Proc. of ACEEE Summer Study on Energy Efficiency in Buildings'12.","paperID":"None"},{"content":"Ingle, A., Moezzi, M., Lutzenhiser, L., and Diamond, R. Better home energy audit modelling: incorporating inhabitant behaviours. Building Research & Info. 42, 4 (2014), 409--421.","paperID":"None"},{"content":"Ingle, A., Moezzi, M., Lutzenhiser, L., et al. Behavioral Perspectives on Home Energy Audits: The Role of Auditors, Labels, Reports, and Audit Tools on Homeowner Decision Making. 2013, 1--396. http://goo.gl/74iRfR.","paperID":"None"},{"content":"ISO 6781:1983: Thermal Insulation-Qualitative detection of thermal irregularities in building envelopes-IR method. 2012.","paperID":"None"},{"content":"Krippendorff, K.. Content Analysis: An Introduction to Its Methodology. Sage Publications, Inc., (2003).","paperID":"None"},{"content":"Kylili, A., Fokaides, P.A., Christou, P., and Kalogirou, S.A. Infrared thermography (IRT) applications for building diagnostics: A review. Applied Energy 134, (2014), 531--549.","paperID":"None"},{"content":"Lagüela, S., Armesto, J., Arias, P., and Herráez, J. Automation of thermographic 3D modelling through image fusion and image matching techniques. Automation in Constr. 27, (2012), 24--31.","paperID":"None"},{"content":"Lagüela, S., Diaz-Vilarino, L., et al. Aerial oblique thermographic imagery for the generation of building 3D models to complement Geographic Information Systems. Proc. of QIRT'14.","paperID":"None"},{"content":"Lagüela, S., Martínez, J., Armesto, J., and Arias, P. Energy efficiency studies through 3D laser scanning and thermographic technologies. Energy and Buildings 43, 6 (2011), 1216--1221.","paperID":"None"},{"content":"Latour, B. and Woolgar, S. Laboratory Life: The Construction of Scientific Facts. Princeton University Press, 1986.","paperID":"None"},{"content":"Jennifer Mankoff, HCI and sustainability: a tale of two motivations, interactions, v.19 n.3, May + June 2012","paperID":"2168937"},{"content":"Matheson, R. Drive-By Heat Mapping. MIT News, 2015. http://goo.gl/ZxFDff.","paperID":"None"},{"content":"Matthew Louis Mauriello , Jon E. Froehlich, Towards automated thermal profiling of buildings at scale using unmanned aerial vehicles and 3D-reconstruction, Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication, September 13-17, 2014, Seattle, Washington","paperID":"2638731"},{"content":"Moghadam, P. and Vidas, S. HeatWave: the next generation of thermography devices. SPIE Sensing Technology + Applications, International Society for Optics and Photonics (2014), 91050F.","paperID":"None"},{"content":"Norberg-Bohm, V. and White, C. Building America Program Evaluation. 2004.","paperID":"None"},{"content":"Oreifej, O., Cramer, J., and Zakhor, A. Automatic Generation of 3D Thermal Maps of Building Interiors. ASHRAE Trans., (2014).","paperID":"None"},{"content":"Palmer, K., Walls, M., Gordon, H., and Gerarden, T. Assessing the energy-efficiency information gap: results from a survey of home energy auditors. Energy Efficiency 6, 2 (2012), 271--292.","paperID":"None"},{"content":"James Pierce, Undesigning technology: considering the negation of design by design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208540"},{"content":"Mattia Previtali , Luigi Barazzetti , Raffaella Brumana , Fabio Roncoroni, Thermographic analysis from UAV platforms for energy efficiency retrofit applications, Journal of Mobile Multimedia, v.9 n.1-2, p.66-82, November 2013","paperID":"2600439"},{"content":"Tom A. Rodden , Joel E. Fischer , Nadia Pantidi , Khaled Bachour , Stuart Moran, At home with agents: exploring attitudes towards future smart energy infrastructures, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466152"},{"content":"M. Six Silberman , Lisa Nathan , Bran Knowles , Roy Bendor , Adrian Clear , Maria Håkansson , Tawanna Dillahunt , Jennifer Mankoff, Next steps for sustainable HCI, interactions, v.21 n.5, September + October 2014","paperID":"2651820"},{"content":"Yolande A.A. Strengers, Designing eco-feedback systems for everyday life, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979252"},{"content":"Thumann, A. and Younger, W.J. Handbook of Energy Audits. The Fairmont Press, Inc., 2008.","paperID":"None"},{"content":"US Dept. of Energy. Buildings Energy Data Book. 2011.","paperID":"None"},{"content":"US Dept. of Energy. Thermographic Inspections. 2012. http://energy.gov/energysaver/articles/thermographic-inspections.","paperID":"None"},{"content":"US Dept. of Energy. Blower Door Tests. 2012. http://energy.gov/energysaver/articles/blower-door-tests.","paperID":"None"},{"content":"US Dept. of Energy. Home Energy Audits. 2014. http://energy.gov/articles/askenergysaver-home-energy-audits.","paperID":"None"},{"content":"Vavilov, V.P. A pessimistic view of the energy auditing of building structures with the use of infrared thermography. Russian Journal of Nondestructive Testing 46, 12 (2011), 906--910.","paperID":"None"},{"content":"Wang, C., Cho, Y.K., and Gai, M. As-Is 3D Thermal Modeling for Existing Building Envelopes Using a Hybrid LIDAR System. Journal of Computing in Civil Engineering 27, 6 (2013), 645--656.","paperID":"None"},{"content":"Allison Woodruff , Jay Hasbrouck , Sally Augustin, A bright green perspective on sustainable choices, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357109"}],"abstract":"The building sector accounts for 41% of primary energy consumption in the US, contributing an increasing portion of the country's carbon dioxide emissions. With recent sensor improvements and falling costs, auditors are increasingly using thermography-infrared (IR) cameras-to detect thermal defects and analyze building efficiency. Research in automated thermography has grown commensurately, aimed at reducing manual labor and improving thermal models. Though promising, we could find no prior work exploring the professional auditor's perspectives of thermography or reactions to emerging automation. To address this gap, we present results from two studies: a semi-structured interview with 10 professional energy auditors, which includes design probes of five automated thermography scenarios, and an observational case study of a residential audit. We report on common perspectives, concerns, and benefits related to thermography and summarize reactions to our automated scenarios. Our findings have implications for thermography tool designers as well as researchers working on automated solutions in robotics, computer science, and engineering.","video":"http://www.youtube.com/embed/_99FLD8xxnM?rel=0","title":"Understanding the Role of Thermography in Energy Auditing: Current Practices and the Potential for Automated Solutions","filename":"CHI15/p1993","authors":["Matthew Louis Mauriello","Leyla Norooz","Jon E. Froehlich"],"conference":"CHI '15"}