{"paperId":2702480,"citation":[],"reference":[{"content":"BC Search and Rescue Association, Rescue Techniques, 2014. [Online]. Available: http://www.bcsara.com/sargroups/rescue-techniques/. [Accessed: 09-Sep-2014].","paperID":"None"},{"content":"E. A. Bier, M. C. Stone, K. Pier, W. Buxton, and T. D. DeRose, Toolglass and magic lenses: the see-through interface, in Computer graphics and interactive techniques, (1993), 73--80.","paperID":"None"},{"content":"C. Bortolaso, M. Oskamp, T.C.N. Graham, and D. Brown, OrMiS: a tabletop interface for simulation based training, ITS '13, (2013), pp. 145--154.","paperID":"None"},{"content":"C. Burns, T. Seyed, F. Maurer, and M. Sousa, MultiSurface Visualization of Fused Hydrocarbon Microseep and Reservoir Data, GeoConvention, (2012), pp. 2--5.","paperID":"None"},{"content":"D. Caldwell and M. Mineter, Analysis and visualization of visibility surfaces, GeoComputation, (2003).","paperID":"None"},{"content":"C. Davies and D. Medyckyj-Scott, GIS Usability: Recommendation Based on the User's View, Int. J. Geogr. Inf. Syst., (1994), vol. 8, no. 2, pp. 175--189.","paperID":"None"},{"content":"J. Detwiler, Internet Maps vs. Paper Maps, The Pennsylvania State University, 2014. [Online]. Available: https://www.eeducation.psu.edu/geog863/print/book/export/html/1912 [Accessed: 09-Sep-2014].","paperID":"None"},{"content":"Fjeld, M., Bichsel, M., and Rauterberg, M. BUILD-IT: a brick-based tool for direct interaction. 4, 1, 205--212.","paperID":"None"},{"content":"Fjeld, M., Lauche, K., Bichsel, M., Voorhorst, F., Krueger, H., and Rauterberg, M. Physical and Virtual Tools: Activity Theory Applied to the Design of Groupware. CSCW 11, 1--2 (2002), 153--180.","paperID":"None"},{"content":"M. J. Germino, W. a. Reiners, B. J. Blasko, D. McLeod, and C. T. Bastian, Estimating visual properties of Rocky Mountain landscapes using GIS, Landsc. Urban Plan., (2001), vol. 53, no. 1-4, pp. 71--83.","paperID":"None"},{"content":"C. Grindle, M. Lewis, R. Glinton, J. Giampapa, S. Owens, and K. Sycara, Automating Terrain Analysis: Algorithms for Intelligence Preparation of the Battlefield, Hum. Factors Ergon. Soc. Annu. Meet., (2004) vol. 48, no. 3, pp. 533--537.","paperID":"None"},{"content":"S. G. Hart, NASA-task load index (NASA-TLX); 20 years later, in Hum. Factors Ergon. Soc. Annu. Meet., 2006, vol. 50, no. 9, pp. 904--908.","paperID":"None"},{"content":"John, M. S., Cowen, M. B., Smallman, H. S., & Oonk, The use of 2D and 3D displays for shape-understanding versus relative-position tasks, in The Journal of the Hum. Factors Ergon. Soc., (2001), 79--98.","paperID":"None"},{"content":"Y. J. Kim and C. M. Hoffmann, Enhanced battlefield visualization for situation awareness, Comput. & Graph., (2003), vol. 27, no. 6, pp. 873--885.","paperID":"None"},{"content":"K. Kobayashi, A. Narita, M. Hirano, K. Tanaka, T. Katada, and N. Kuwasawa, DIGTable: a tabletop simulation system for disaster education, in Pervasive Computing, (2008), pp. 57--60.","paperID":"None"},{"content":"Nipissing University, GEOG 4106 Terrain Analysis, 2014. [Online]. Available: http://www.nipissingu.ca/calendar/Pages/Course.aspx?C+ourseName=GEOG-4106. [Accessed: 09-Sep-2014].","paperID":"None"},{"content":"D. O'Sullivan and A. Turner, Visibility graphs and landscape visibility analysis, Int. J. Geogr. Inf. Syst., (2001).","paperID":"None"},{"content":"Patten, J. and Ishii, H. Mechanical constraints as computational constraints in tabletop tangible interfaces. CHI '07, (2007), 809.","paperID":"None"},{"content":"S. Popelka and V. Vozenilek, Landscape Visibility Analysis and Their Visualisation, ISPRS Arch., (2010).","paperID":"None"},{"content":"Raytheon, ABACUS (Advanced Battlefield Computer Simulation). [Online]. Available: www.raytheon.com. [Accessed: 09-Sep-2014].","paperID":"None"},{"content":"C. Savery and T.C.N. Graham, Timelines: simplifying the programming of lag compensation for the next generation of networked games, Multimed. Syst., vol. 19, no. 3, pp. 271--287, Jun. 2012.","paperID":"None"},{"content":"S.D. Scott, A. Allavena, K. Cerar, G. Franck, M. Hazen, T. Shuter and C. Colliver, Investigating Tabletop Interfaces to Support Collaborative Decision-Making in Maritime Operations, 2010.","paperID":"None"},{"content":"M. Sevenant and M. Antrop, Settlement models, land use and visibility in rural landscapes: Two case studies in Greece, Landsc. Urban Plan., (2007), vol. 80, no. 4, pp. 362--374.","paperID":"None"},{"content":"H. S. Smallman, M. St. John, H. M. Oonk, and M. B. Cowen, Information availability in 2D and 3D displays, IEEE Comput. Graph. Appl., (2001) vol. 21, no. 4, pp. 51--57.","paperID":"None"},{"content":"M. Spindler and R. Dachselt, PaperLens: Advanced Magic Lens Interaction Above the Tabletop, in ITS '09, (2009), p. 7.","paperID":"None"},{"content":"J. C. Tracy, Plane surveying: a text-book and pocket manual. J. Wiley & Sons, (1907), p. 794.","paperID":"None"},{"content":"Ullmer, B. and Ishii, H. The metaDESK: models and prototypes for tangible user interfaces. Proceedings of the 10th annual ACM symposium on, (1997).","paperID":"None"},{"content":"US Army, Field Manual, in Operations, Washington, DC: US Government Printing Office, (1982), pp. 100--5.","paperID":"None"},{"content":"S. J. Winterbottom and D. Long, From abstract digital models to rich virtual environments: landscape contexts in Kilmartin Glen, Scotland, J. Archaeol. Sci., (2006), vol. 33, no. 10, pp. 1356--1367.","paperID":"None"},{"content":"ArcGIS. [Online]. Available: www.arcgis.com. [Accessed: 09-Sep-2014]","paperID":"None"}],"abstract":"Terrain visibility analysis is a challenging task that is currently supported by complex digital tools with cumbersome interfaces. In this paper, we present TerraGuide, a novel multi-surface environment for exploratory terrain analysis. TerraGuide provides three tightly coupled displays including a real-time viewshed, a 3D panoramic view, and a helicopter view controlled by an optically tracked tablet. A user study compared these techniques and identified users' strategies in solving a complex terrain analysis problem. Users overwhelmingly adopted a bi-manual use of the tabletop viewshed and tablet-based helicopter techniques. This paper gives insight into how multi-surface environments can be designed to allow complementary use of and fluid switching between techniques.","video":"http://www.youtube.com/embed/iKrPvpeWi_Y?rel=0","title":"TerraGuide: Design and Evaluation of a Multi-Surface Environment for Terrain Visibility Analysis","filename":"CHI15/p3553","authors":["Matthew Oskamp","Christophe Bortolaso","Robin Harrap","T.C. Nicholas Graham"],"conference":"CHI '15"}