{"paperId":2702317,"abstract":"Sporting championships and other media events can induce very strong feelings of co-presence that can change communication patterns within large communities. Live tweeting reactions to media events provide high-resolution data with time-stamps to understand these behavioral dynamics. We employ a computational focus group method to identify a population of 790,744 international Twitter users, and we track their behavior before, during, and after the 2014 FIFA World Cup. We pick, in particular, a set of Twitter users who specified the teams that they are supporting, such that we can identify communities of fans of the teams, as well as the entire community of World Cup fans. The structure, dynamics, and content of communication of these communities of users are analyzed to compare behavior outside of the matches to behavior during the event and to examine behavioral responses across languages. Specifically, the temporal patterns of the tweeting volume, topics, retweet- ing, and mentioning behaviors are analyzed. We find there are similarities in the responses to media events, characteristic changes in activity patterns of users, and substantial differences in linguistic features. These findings have implications for designing more resilient socio-technical systems during crises and developing better models of complex social behavior.","citation":[{"content":"Lei Le , Emilio Ferrara , Alessandro Flammini, On Predictability of Rare Events Leveraging Social Media: A Machine Learning Perspective, Proceedings of the 2015 ACM on Conference on Online Social Networks, November 02-03, 2015, Palo Alto, California, USA","paperID":"2817949"}],"reference":[{"content":"A.-L. Barabasi. The origin of bursts and heavy tails in human dynamics. Nature, 435(7039):207--211, 2005.","paperID":"None"},{"content":"L. Barbosa and J. Feng. Robust sentiment detection on twitter from biased and noisy data. In Proceedings of the 23rd International Conference on Computational Linguistics: Posters, pages 36--44. Association for Computational Linguistics, 2010.","paperID":"None"},{"content":"H. Becker, M. Naaman, and L. Gravano. Learning similarity metrics for event identification in social media. In Proc. WSDM 2010, 2010.","paperID":"None"},{"content":"D. M. Blei, A. Y. Ng, and M. I. Jordan. Latent dirichlet allocation. Journal of Machine Learning Research, 3:993--1022, 2003.","paperID":"None"},{"content":"d. boyd, S. Golder, and G. Lotan. Tweet, tweet, retweet: Conversational aspects of retweeting on Twitter. In Proc. HICSS 2010. IEEE, 2010.","paperID":"None"},{"content":"J. Boyd-Graber and D. M. Blei. Multilingual topic models for unaligned text. In Proceedings of the Twenty-Fifth Conference on Uncertainty in Artificial Intelligence, pages 75--82. AUAI Press, 2009.","paperID":"None"},{"content":"H.-C. Chang. A new perspective on twitter hashtag use: difiusion of innovation theory. Proceedings of the American Society for Information Science and Technology, 47(1):1--4, 2010.","paperID":"None"},{"content":"H. H. Clark and S. E. Brennan. Grounding in communication. Perspectives on socially shared cognition, 13(1991):127--149, 1991.","paperID":"None"},{"content":"D. Dayan and E. Katz. Media events: The live broadcasting of history. Harvard University Press, 1992.","paperID":"None"},{"content":"N. Diakopoulos and D. Shamma. Characterizing debate performance via aggregated Twitter sentiment. In Proc. CHI 2010, 2010.","paperID":"None"},{"content":"N. Ducheneaut, R. J. Moore, L. Oehlberg, J. D. Thornton, and E. Nickell. Social TV: Designing for distributed, sociable television viewing. Int'l Journal of Human-Computer Interaction, 24(2), 2008.","paperID":"None"},{"content":"I. Eleta and J. Golbeck. Multilingual use of Twitter: Social networks at the language frontier. Computers in Human Behavior, 2014.","paperID":"None"},{"content":"R. Garcíá-Gavilanes, Y. Mejova, and D. Quercia. Twitter ain't without frontiers: Economic, social, and cultural boundaries in international communication. In Proc. CSCW 2014, pages 1511--1522. ACM, 2014.","paperID":"None"},{"content":"D. Geerts and D. De Groofi. Supporting the social uses of television: sociability heuristics for social TV. In Proc. CHI 2009, 2009.","paperID":"None"},{"content":"F. Giglietto and D. Selva. Second screen and participation: A content analysis on a full season dataset of tweets. Journal of Communication, 64(2):260--277, 2014.","paperID":"None"},{"content":"E. Gilbert. Designing social translucence over social networks. In Proc. CHI 2012, 2012.","paperID":"None"},{"content":"H. Giles, N. Coupland, and I. Coupland. Accommodation theory: Communication, context, and consequence. In Contexts of accommodation: Developments in applied sociolinguistics. Cambridge University Press, 1991.","paperID":"None"},{"content":"E. Goffman. Behavior in Public Places: Notes on the Social Organization of Gatherings. Free Press, New York, 1966.","paperID":"None"},{"content":"T. L. Grifiths and M. Steyvers. Finding scientific topics. Proceedings of the National academy of Sciences of the USA of America, 101(Suppl 1):5228--5235, 2004.","paperID":"None"},{"content":"S. A. Hale. Global connectivity and multilinguals in the Twitter network. In Proc. CHI 2014. ACM, 2014.","paperID":"None"},{"content":"G. Harboe, C. J. Metcalf, F. Bentley, J. Tullio, N. Massey, and G. Romano. Ambient social tv: drawing people into a shared experience. In Proc. CHI'08, pages 1--10, New York, NY, USA, 2008. ACM.","paperID":"None"},{"content":"B. Hecht and D. Gergle. The tower of babel meets web 2.0: User-generated content and its applications in a multilingual context. In Proc. CHI 2010, pages 291--300. ACM, 2010.","paperID":"None"},{"content":"T. Highfield, S. Harrington, and A. Bruns. Twitter as a technology for audiencing and fandom: the #eurovision phenomenon. Information, Communication & Society, 16(3):315--339, 2013.","paperID":"None"},{"content":"L. Hong, G. Convertino, and E. H. Chi. Language matters in Twitter: A large scale study. In Proc. ICWSM 2011. AAAI, 2011.","paperID":"None"},{"content":"D. Horton and R. R. Wohl. Mass communication and para-social interaction: Observations on intimacy at a distance. Psychiatry, 19(3), 1956.","paperID":"None"},{"content":"M. Hu, S. Liu, F. Wei, Y. Wu, J. Stasko, and K.-L. Ma. Breaking news on Twitter. In Proc. CHI 2012, 2012.","paperID":"None"},{"content":"W. Ju and L. Leifer. The design of implicit interactions: Making interactive systems less obnoxious. Design Issues, 24(3):72--84, 2008.","paperID":"None"},{"content":"R. E. Kraut, P. Resnick, S. Kiesler, M. Burke, Y. Chen, N. Kittur, J. Konstan, Y. Ren, and J. Riedl. Building successful online communities: Evidence-based social design. MIT Press, 2012.","paperID":"None"},{"content":"H. Kwak, C. Lee, H. Park, and S. Moon. What is Twitter, a social network or a news media? In Proc. WWW 2010, 2010.","paperID":"None"},{"content":"D. Lazer, A. Pentland, L. Adamic, S. Aral, A.-L. Barabási, D. Brewer, N. Christakis, N. Contractor, J. Fowler, M. Gutmann, T. Jebara, G. King, M. Macy, D. Roy, and M. V. Alstyne. Computational social science. Science, 323(5915):721--723, 2009.","paperID":"None"},{"content":"Y.-R. Lin, B. Keegan, D. Margolin, and D. Lazer. Rising tides or rising stars?: Dynamics of shared attention on Twitter during media events. PLoS ONE, 9(5):e94093, 2014.","paperID":"None"},{"content":"Y.-R. Lin, D. Margolin, B. Keegan, A. Baronchelli, and D. Lazer. # bigbirds never die: Understanding social dynamics of emergent hashtags. In Proc. ICWSM 2013. AAAI, 2013.","paperID":"None"},{"content":"Y.-R. Lin, D. Margolin, B. Keegan, and D. Lazer. Voices of victory: A computational focus group framework for tracking opinion shift in real time. In Proc. WWW 2013, 2013.","paperID":"None"},{"content":"J. Lull. The social uses of television. Human communication research, 6(3):197--209, 1980.","paperID":"None"},{"content":"A. E. Marwick and d. boyd. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society, 13(1):114--133, 2010.","paperID":"None"},{"content":"D. Mocanu, A. Baronchelli, N. Perra, B. Gonçalves, Q. Zhang, and A. Vespignani. The Twitter of Babel: Mapping world languages through microblogging platforms. PLoS ONE, 8(4):e61981, 2013.","paperID":"None"},{"content":"J. Nichols, J. Mahmud, and C. Drews. Summarizing sporting events using Twitter. In Proc. IUI'12. ACM, 2012.","paperID":"None"},{"content":"R. S. Nickerson. How we know-and sometimes misjudge-what others know: Imputing one's own knowledge to others. Psychological Bulletin, 125(6):737--759, 1999.","paperID":"None"},{"content":"K. G. Niederhoffer and J. W. Pennebaker. Linguistic style matching in social interaction. Journal of Language and Social Psychology, 21(4):337--360, 2002.","paperID":"None"},{"content":"L. Palen and S. B. Liu. Citizen communications in crisis: Anticipating a future of ICT-supported public participation. In Proc. CHI'07, pages 727--736, New York, NY, USA, 2007. ACM.","paperID":"None"},{"content":"R. Rehurek and P. Sojka. Software Framework for Topic Modelling with Large Corpora. In Proc. LREC 2010, pages 45--50, Valletta, Malta, 2010. ELRA.","paperID":"None"},{"content":"T. Sakaki, M. Okazaki, and Y. Matsuo. Earthquake shakes Twitter users: Real-time event detection by social sensors. In Proc. WWW 2010. ACM, 2010.","paperID":"None"},{"content":"L. E. Scissors, A. J. Gill, K. Geraghty, and D. Gergle. In CMC we trust: The role of similarity. In Proc. CHI 2009, pages 527--536. ACM, 2009.","paperID":"None"},{"content":"G. Valkanas and D. Gunopulos. How the live web feels about events. In Proc. CIKM 2013, 2013.","paperID":"None"},{"content":"A. Vespignani. Predicting the behavior of techno-social systems. Science, 325(5939):425--428, 2009.","paperID":"None"},{"content":"J. D. Weisz, S. Kiesler, H. Zhang, Y. Ren, R. E. Kraut, and J. A. Konstan. Watching together: integrating text chat with video. In Proc. CHI 2007, 2007.","paperID":"None"}],"title":"Social Media Dynamics of Global Co-presence During the 2014 FIFA World Cup","filename":"CHI15/p2623","authors":["Jae Won Kim","Dongwoo Kim","Brian Keegan","Joon Hee Kim","Suin Kim","Alice Oh"],"conference":"CHI '15"}