{"paperId":2702157,"abstract":"Non-homeless youths outperform their homeless peers in school even if they live in extreme poverty. This disadvantage can have long-term consequences for engagement with and navigation of wider society. In this paper we examine how differences in achievement could be tackled outside of school through the re-envisioning of ecologies of digital education. Through interviews, design workshops, and a street visit with a total of 20 homeless young adults during a three-week engagement with a centre for people of low social stability in Bucharest, Romania, we examine the perceptions of education among street involved youth or adults. We identify the core values, aspirations, opportunities and barriers for education among these people, including survival, friendship, learning networks, and curiosity. These findings resulted in five implications for design: learning \"happens\", learning \"works\", designing for distanced learning, designing for the social politics of learning, and designing artefacts of everyday learning. These show the importance and necessity of educational reform in the field of HCI.","citation":[],"reference":[{"content":"Aviv, R., Erlich, Z., Ravid, G., and Geva, A. Network Analysis of Knowledge Construction In Asynchronous Learning Networks. JALN 7, 3 (2003), 1--23.","paperID":"None"},{"content":"Belzberg, E. Children underground. USA, 2002.","paperID":"None"},{"content":"Brandon, D., Khoo, R., Maglajlic, R., and AbuelEaleh, M. European snapshot homeless survey: Results of questions asked of passers-by in 11 European cities. International Journal of Nursing Practice 6, 1 (2000), 39--45.","paperID":"None"},{"content":"British Educational Research Association, . BERA. Ethics and guidance, 2011. https://www.bera.ac.uk/researchersresources/resources-for-researchers.","paperID":"None"},{"content":"Charmaz, K. Constructing Grounded Theory. SAGE Publications, 2014.","paperID":"None"},{"content":"Clark, J., Laing, K., Tiplady, L., and Woolner, P. Connected Communities. Making Conections: Theory and Practice of Using Visual Methods to Aid Participation in Research. Newcastle Upon Tyne, 2013.","paperID":"None"},{"content":"Le Dantec, C.A. and Edwards, W.K. Designs on dignity. Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI '08, ACM Press (2008), 627.","paperID":"None"},{"content":"Le Dantec, C.A., Farrell, R.G., Christensen, J.E., et al. Publics in practice. Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, ACM Press (2011), 1687.","paperID":"None"},{"content":"Dolan, P., Leat, D., Mazzoli Smith, L., Mitra, S., Todd, L., and Wall, K. Self-Organised Learning Environments (SOLEs) in an English School: an example of transformative pedagogy? Online Educational Research Journal. http://www.oerj.org/View?action=viewPDF&paper =109. Page 10 of 10","paperID":"None"},{"content":"European Commission, . The social dimension of the Europe 2020 strategy. 2011.","paperID":"None"},{"content":"Farrugia, D. Youth homelessness and individualised subjectivity. Journal of Youth Studies 14, 7 (2011), 761--775.","paperID":"None"},{"content":"FEANTSA. ETHOS: Typology of Homelessness and housing exclusion. ETHOS, 2006. http://www.feantsa.org/spip.php?article120 .","paperID":"None"},{"content":"Fielding, M. and Moss, P. Radical Education and the Common School, a democratic alternative. Routledge, London, 2011.","paperID":"None"},{"content":"Friedman Robertson, D. Homeless students: a search for understanding. International Journal of Leardership in Education 1, 2 (1998), 155--168.","paperID":"None"},{"content":"Hendry, D.G., Woelfer, J.P., Harper, R., Bauer, T., Fitzer, B., and Champagne, M. How to integrate digital media into a drop-in for homeless young people for deepening relationships between youth and adults. Children and Youth Services Review 33, 774--802 (2011).","paperID":"None"},{"content":"Hodgson, A. and Spours, K. Tackling the crisis facing young people: building \"high opportunity progression eco-systems.\" Oxford Review of Education 39, 2 (2013), 211--228.","paperID":"None"},{"content":"Human Rights, . More Than 100 Million Homeless Worldwide. ipsnews.net, 2014. http://www.ipsnews.net/2005/03/human-rightsmore-than-100-million-homeless-worldwide/ .","paperID":"None"},{"content":"Illich, I. Deschooling Society. Marion Boyars Publisher Ltd, London, 1970.","paperID":"None"},{"content":"Illich, I. Deschooling Society. Marion Boyars Publisher Ltd, London, 1970.","paperID":"None"},{"content":"Maslow, A.H. Toward a Psychology of Being. Start Publishing LLC, 2013.","paperID":"None"},{"content":"Mitra, S. and Quiroga, M. Children and the Internet - A Preliminary Study in Uruguay. International Journal of Humanitites and Social Science 2, 15 (2012), 123--129.","paperID":"None"},{"content":"Mitra, S. The hole in the wall: self organising systems in education. 2010. http://repository.alt.ac.uk/855/1/ALTC_2010_keyn ote_Sugata_Mitra_transcript.pdf.","paperID":"None"},{"content":"Murphy, J. Homeless Children and Youth at Risk: The Educational Impact of Displacement. (2011).","paperID":"None"},{"content":"O'Sullivan, T., Rice, J., Saunders, C., Owen, A., and Rothwell, A. Research skills for students. Kogan Page, London, 1996.","paperID":"None"},{"content":"Jahmeilah Roberson , Bonnie Nardi, Survival needs and social inclusion: technology use among the homeless, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718993"},{"content":"Rokach, A. The causes of loneliness in homeless youth. The Journal of psychology 139, 5 (2005), 469--80.","paperID":"None"},{"content":"Shane, P.G. What About America's Homeless Children?: Hide and Seek. SAGE Publications, 1996.","paperID":"None"},{"content":"Snow, David, A. and Anderson, L. Down on Their Luck. University of California Press, Los Angeles, 1993.","paperID":"None"},{"content":"University, N. Students. www.ncl.ac.uk, 2014. http://www.ncl.ac.uk/res/research/ethics_governanc e/ethics/procedures/students.htm.","paperID":"None"},{"content":"Vasilis Vlachokyriakos , Rob Comber , Karim Ladha , Nick Taylor , Paul Dunphy , Patrick McCorry , Patrick Olivier, PosterVote: expanding the action repertoire for local political activism, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598523"},{"content":"Warschauer, M., Turbee, L., and Roberts, B. Computer learning networks and student empowerment. System 24, 1 (1996), 1--14.","paperID":"None"},{"content":"Wilson, S. Patterns of Personal Learning Environments. (2008).","paperID":"None"},{"content":"Jill Palzkill Woelfer , David G. Hendry, Homeless young people's experiences with information systems: life and work in a community technology center, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753520"},{"content":"Jill Palzkill Woelfer , David G. Hendry, Homeless young people and living with personal digital artifacts, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979190"},{"content":"Yamaguchi, B.J., Strawser, S., and Higgins, K. Children Who Are Homeless: Implications for Educators. Intervention in School and Clinic 33, 2 (1997), 90--97.","paperID":"None"},{"content":"Svetlana Yarosh, Shifting dynamics or breaking sacred traditions?: the role of technology in twelve-step fellowships, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466468"}],"title":"Exploring Learning Ecologies among People Experiencing Homelessness","filename":"CHI15/p2275","authors":["Angelika Strohmayer","Rob Comber","Madeline Balaam"],"conference":"CHI '15"}