{"paperId":2702607,"citation":[{"content":"Raghunathan Rajesh , M. Reena, A review on worksystem interactions in a technology enabled class room, International Journal of Technology Enhanced Learning, v.7 n.2, p.99-115, September 2015","paperID":"2833878"}],"reference":[{"content":"Myroslav Bachynskyi , Antti Oulasvirta , Gregorio Palmas , Tino Weinkauf, Is motion capture-based biomechanical simulation valid for HCI studies?: study and implications, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557027"},{"content":"Jérôme Barbé , Nicolas Chatrenet , Régis Mollard , Marion Wolff , Patxi Bérard, Physical ergonomics approach for touch screen interaction in an aircraft cockpit, Proceedings of the 2012 Conference on Ergonomie et Interaction homme-machine, October 16-19, 2012, Biarritz, France","paperID":"2653402"},{"content":"Benko, H., and Wigdor, D. Imprecision, inaccuracy, and frustration: The tale of touch input. In Tabletops-Horizontal Interactive Displays. Springer, 2010, 249--275.","paperID":"None"},{"content":"Beringer, D. B., and Peterson, J. G. Underlying behavioral parameters of the operation of touch-input devices: Biases, models, and feedback. Human Factors 27, 4 (1985), 445--458.","paperID":"None"},{"content":"Davis, K., Hammer, M., Kotowski, S., and Bhattacharya, A. An ergonomic comparison of data entry work using a keyboard vs. touch screen input device while standing and sitting. J Ergonomics S 4 (2014), 2.","paperID":"None"},{"content":"Delp, S. L., Anderson, F. C., Arnold, A. S., Loan, P., Habib, A., et al. OpenSim: Open-source software to create and analyze dynamic simulations of movement. IEEE Trans. Biomedical Engineering 54, 11 (2007), 1940--1950.","paperID":"None"},{"content":"Glitsch, U., and Baumann, W. The three-dimensional determination of internal loads in the lower extremity. Journal of Biomechanics 30, 1112 (1997), 1123--1131.","paperID":"None"},{"content":"Hastie, T., Tibshirani, R., Friedman, J., Hastie, T., Friedman, J., and Tibshirani, R. The elements of statistical learning, vol. 2. Springer, 2009.","paperID":"None"},{"content":"Christian Holz , Patrick Baudisch, The generalized perceived input point model and how to double touch accuracy by extracting fingerprints, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753413"},{"content":"Christian Holz , Patrick Baudisch, Understanding touch, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979308"},{"content":"Holzbaur, K. R. S., Murray, W. M., and Delp, S. L. A model of the upper extremity for simulating musculoskeletal surgery and analyzing neuromuscular control. Ann. of Biomed. Eng. 33 (2005), 829--840.","paperID":"None"},{"content":"Kim, D.-S., and Chae, W.-S. Biomechanical analysis of a smartphone task with different postures. Korean Journal of Sport Biomechanics 22, 2 (2012), 253--259.","paperID":"None"},{"content":"Kenrick Kin , Maneesh Agrawala , Tony DeRose, Determining the benefits of direct-touch, bimanual, and multifinger input on a multitouch workstation, Proceedings of Graphics Interface 2009, May 25-27, 2009, Kelowna, British Columbia, Canada","paperID":"1555910"},{"content":"Micire, M., Schedlbauer, M., and Yanco, H. Horizontal selection: An evaluation of a digital tabletop input device. Proc. AMCIS (2007), 164.","paperID":"None"},{"content":"Morris, M. R., Brush, A. B., and Meyers, B. R. Reading revisited: Evaluating the usability of digital display surfaces for active reading tasks. In Proc. Tabletop, IEEE (2007), 79--86.","paperID":"None"},{"content":"Muller-Tomfelde, C., Wessels, A., and Schremmer, C. Tilted tabletops: In between horizontal and vertical workspaces. In Proc. Tabletop, IEEE (2008), 49--56.","paperID":"None"},{"content":"Michael Oehl , Christine Sutter , Martina Ziefle, Considerations on efficient touch interfaces: how display size influences the performance in an applied pointing task, Proceedings of the 2007 conference on Human interface: Part I, July 22-27, 2007, Beijing, China","paperID":"1766469"},{"content":"Palmas, G., Bachynskyi, M., Oulasvirta, A., Seidel, H.-P., and Weinkauf, T. MovExp: A versatile visualization tool for human-computer interaction studies with 3D performance and biomechanical data. IEEE Trans. Vis. Comput. Graphics 20, 12 (Dec 2014), 2359--2368.","paperID":"None"},{"content":"Pekka Parhi , Amy K. Karlson , Benjamin B. Bederson, Target size study for one-handed thumb use on small touchscreen devices, Proceedings of the 8th conference on Human-computer interaction with mobile devices and services, September 12-15, 2006, Helsinki, Finland","paperID":"1152260"},{"content":"Park, Y. S., and Han, S. H. One-handed thumb interaction of mobile devices from the input accuracy perspective. IJIE 40, 6 (2010), 746--756.","paperID":"None"},{"content":"Barry A. Po , Brian D. Fisher , Kellogg S. Booth, Mouse and touchscreen selection in the upper and lower visual fields, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.359-366, April 24-29, 2004, Vienna, Austria","paperID":"985738"},{"content":"Sasangohar, F., MacKenzie, I. S., and Scott, S. D. Evaluation of mouse and touch input for a tabletop display using Fitts' reciprocal tapping task. In Proc. HFES, vol. 53, SAGE Publications (2009), 839--843.","paperID":"None"},{"content":"Schultz, K. L., Batten, D. M., and Sluchak, T. J. Optimal viewing angle for touch-screen displays: Is there such a thing? IJIE 22, 4 (1998), 343--350.","paperID":"None"},{"content":"Andrew Sears , Ben Shneiderman, High precision touchscreens: design strategies and comparisons with a mouse, International Journal of Man-Machine Studies, v.34 n.4, p.593-613, April 1991","paperID":"105301"},{"content":"R. William Soukoreff , I. Scott MacKenzie, Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI, International Journal of Human-Computer Studies, v.61 n.6, p.751-789, December 2004","paperID":"1056155"},{"content":"Julie Wagner , Stéphane Huot , Wendy Mackay, BiTouch and BiPad: designing bimanual interaction for hand-held tablets, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208391"},{"content":"Feng Wang , Xiangshi Ren, Empirical evaluation for finger input properties in multi-touch interaction, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518864"},{"content":"Malte Weiss , Simon Voelker , Christine Sutter , Jan Borchers, BendDesk: dragging across the curve, ACM International Conference on Interactive Tabletops and Surfaces, November 07-10, 2010, Saarbrücken, Germany","paperID":"1936654"},{"content":"Whitefield, A. Human factors aspects of pointing as an input technique in interactive computer systems. Applied Ergonomics 17, 2 (1986), 97--104.","paperID":"None"},{"content":"Winter, D. A. Biomechanics and motor control of human movement. Wiley, 2009.","paperID":"None"},{"content":"Young, J. G., Trudeau, M. B., Odell, D., Marinelli, K., and Dennerlein, J. T. Wrist and shoulder posture and muscle activity during touch-screen tablet use: Effects of usage configuration, tablet type, and interacting hand. Work: A Journal of Prevention, Assessment and Rehabilitation 45, 1 (2013), 59--71.","paperID":"None"}],"abstract":"Although different types of touch surfaces have gained extensive attention in HCI, this is the first work to directly compare them for two critical factors: performance and ergonomics. Our data come from a pointing task (N=40) carried out on five common touch surface types: public display (large, vertical, standing), tabletop (large, horizontal, seated), laptop (medium, adjustably tilted, seated), tablet (seated, in hand), and smartphone (single- and two-handed input). Ergonomics indices were calculated from biomechanical simulations of motion capture data combined with recordings of external forces. We provide an extensive dataset for researchers and report the first analyses of similarities and differences that are attributable to the different postures and movement ranges.","video":"http://www.youtube.com/embed/TIDoc1nkbSo?rel=0","title":"Performance and Ergonomics of Touch Surfaces: A Comparative Study using Biomechanical Simulation","filename":"CHI15/p1817","authors":["Myroslav Bachynskyi","Gregorio Palmas","Antti Oulasvirta","Jürgen Steimle","Tino Weinkauf"],"conference":"CHI '15"}