{"paperId":2702282,"citation":[],"abstract":"This paper presents results of a controlled trial using a clash-of-clans style game as an extrinsic motivator to encourage revision in 15-16 year olds preparing for a maths exam. The trial demonstrates a statistically significant improvement in performance among those using the game. We discuss differences between our work and a previous trial that showed no performance improvement from an extrinsically linked educational game, and present hypotheses as to why the game structure we used may be effective within our chosen deployment environment.","reference":[{"content":"Deci, E. L., Koestner, R., and Ryan, R. M. \"Extrinsic rewards and intrinsic motivation in education: Reconsidered once again.\" Review of Educational Research, 71(1), 1--27,2001.","paperID":"None"},{"content":"Paul Denny, The effect of virtual achievements on student engagement, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470763"},{"content":"Dondlinger, M. J. (2007). \"Educational video game design: A review of the literature.\" Journal of Applied Educational Technology, 4(1), 21--31.","paperID":"None"},{"content":"Habgood, M. J. and Ainsworth, S. E. \"Motivating children to learn effectively: Exploring the value of intrinsic integration in educational games.\" Journal of the Learning Sciences, 20(2), 169--206, 2011.","paperID":"None"},{"content":"Feltovich, N. \"Nonparametric tests of differences in medians: comparison of the Wilcoxon-Mann-Whitney and robust rank-order tests.\" Experimental Econ, 6(3), 273--297, 2003.","paperID":"None"},{"content":"Conor Linehan , Ben Kirman , Shaun Lawson , Gail Chan, Practical, appropriate, empirically-validated guidelines for designing educational games, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979229"},{"content":"Eleanor O'Rourke , Kyla Haimovitz , Christy Ballweber , Carol Dweck , Zoran Popović, Brain points: a growth mindset incentive structure boosts persistence in an educational game, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557157"},{"content":"Wouters, P., van Nimwegen, C., van Oostendorp, H., & van der Spek, E. D. \"A meta-analysis of the cognitive and motivational effects of serious games.\" Journal of Educational Psychology, 105(2), 249, 2013.","paperID":"None"}],"title":"The Use of Games as Extrinisic Motivation in Education","filename":"CHI15/p3735","authors":["Chris Preist","Robert Jones"],"conference":"CHI '15"}