{"paperId":2702146,"citation":[{"content":"Arkaitz Zubiaga , Maria Liakata , Rob Procter , Kalina Bontcheva , Peter Tolmie, Crowdsourcing the Annotation of Rumourous Conversations in Social Media, Proceedings of the 24th International Conference on World Wide Web, May 18-22, 2015, Florence, Italy","paperID":"2743052"},{"content":"Maximilian Altmeyer , Pascal Lessel , Antonio Krüger, Expense Control: A Gamified, Semi-Automated, Crowd-Based Approach For Receipt Capturing, Proceedings of the 21st International Conference on Intelligent User Interfaces, March 07-10, 2016, Sonoma, California, USA","paperID":"2856790"}],"abstract":"A large, seemingly overwhelming task can sometimes be transformed into a set of smaller, more manageable microtasks that can each be accomplished independently. For example, it may be hard to subjectively rank a large set of photographs, but easy to sort them in spare moments by making many pairwise comparisons. In crowdsourcing systems, microtasking enables unskilled workers with limited commitment to work together to complete tasks they would not be able to do individually. We explore the costs and benefits of decomposing macrotasks into microtasks for three task categories: arithmetic, sorting, and transcription. We find that breaking these tasks into microtasks results in longer overall task completion times, but higher quality outcomes and a better experience that may be more resilient to interruptions. These results suggest that microtasks can help people complete high quality work in interruption-driven environments.","reference":[{"content":"Cutrell, E., Czerwinski, M., and Horvitz, E. Notification, disruption, and memory: Effects of messaging interruptions on memory and performance. In INTERACT (2001).","paperID":"None"},{"content":"González, V. M., and Mark, G. Constant, constant, multi-tasking craziness: managing multiple working spheres. In CHI (2004).","paperID":"None"},{"content":"Hart, S. G., and Staveland, L. E. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. Adv. Psychol. (1988).","paperID":"None"},{"content":"Shamsi T. Iqbal , Brian P. Bailey, Effects of intelligent notification management on users and their tasks, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357070"},{"content":"Walter Lasecki , Christopher Miller , Adam Sadilek , Andrew Abumoussa , Donato Borrello , Raja Kushalnagar , Jeffrey Bigham, Real-time captioning by groups of non-experts, Proceedings of the 25th annual ACM symposium on User interface software and technology, October 07-10, 2012, Cambridge, Massachusetts, USA","paperID":"2380122"},{"content":"Lasecki, W. S., Marcus, A., Rzeszotarski, J. M., and Bigham, J. P. Using microtask continuity to improve crowdsourcing. Tech. rep., 2014.","paperID":"None"},{"content":"Greg Little , Lydia B. Chilton , Max Goldman , Robert C. Miller, TurKit: human computation algorithms on mechanical turk, Proceedings of the 23nd annual ACM symposium on User interface software and technology, October 03-06, 2010, New York, New York, USA","paperID":"1866040"},{"content":"David Martin , Benjamin V. Hanrahan , Jacki O'Neill , Neha Gupta, Being a turker, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531663"},{"content":"Sakai, K., Rowe, J. B., and Passingham, R. E. Parahippocampal reactivation signal at retrieval after interruption of rehearsal. J. Neurosci. (2002).","paperID":"None"},{"content":"Jaime Teevan , Daniel J. Liebling , Walter S. Lasecki, Selfsourcing personal tasks, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2581181"},{"content":"Rajan Vaish , Keith Wyngarden , Jingshu Chen , Brandon Cheung , Michael S. Bernstein, Twitch crowdsourcing: crowd contributions in short bursts of time, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2556996"},{"content":"Wickens, C. D. Multiple resources and performance prediction. Theor. Issues. Ergon. (2002).","paperID":"None"},{"content":"Zacks, J. M., Tversky, B., and Iyer, G. Perceiving, remembering, and communicating structure in events. J. Exp. Psychol. Gen. (2001).","paperID":"None"}],"title":"Break It Down: A Comparison of Macro- and Microtasks","filename":"CHI15/p4061","authors":["Justin Cheng","Jaime Teevan","Shamsi T. Iqbal","Michael S. Bernstein"],"conference":"CHI '15"}