{"paperId":2702522,"abstract":"Communities of making have been at the center of attention in popular, business, political, and academic research circles in recent years. In HCI, they seem to carry the promise of new forms of computer use, education, innovation, and even ways of life. In the West in particular, the maker manifestos of these communities have shown strong elements of a neoliberal ethos, one that prizes self-determination, tech-savvy, independence, freedom from government, suspicion of authority, and so forth. Yet such communities, to function as communities, also require values of collaboration, cooperation, interpersonal support-in a word, care. In this ethnographic study, we studied and participated as members of a hackerspace for 19 months, focusing in particular not on their technical achievements, innovations, or for glimmers of a more sustainable future, but rather to make visible and to analyze the community maintenance labor that helps the hackerspace support the practices that its members, society, and HCI research are so interested in. We found that the maker ethic entails a complex negotiation of both a neoliberal libertarian ethos and a care ethos.","reference":[{"content":"Ames, M. G., Bardzell, J., Bardzell, S., Lindtner, S., Mellis, D. A., and Rosner, D. K. (2014). Making Cultures: Empowerment, Participation, and Democracy - or not? In Proc. of CHI2014 EA. ACM Press.","paperID":"None"},{"content":"Bardzell, J. (2007). Creativity in Amateur Multimedia: Popular Culture, Critical Theory, and HCI. Human Technology, 3 (1), 12--33.","paperID":"None"},{"content":"Bardzell, J., Bardzell, S., and Toombs, A. (2014). \"Now that's definitely a proper hack\": Self-made Tools in Hackerspaces. In Proc. of CHI2014. ACM Press.","paperID":"None"},{"content":"Bardzell, J., Bardzell, S., DiSalvo, C., Light, A., D. K. Rosner. (2014). \"Making Cultures\" Spotlight.","paperID":"None"},{"content":"Bardzell, S. (in press). Through the \"Cracks and Fissures\" in the Smart Home to Ubiquitous Utopia. In Bardzell, J., Bardzell, S., and Blythe, M. (eds.). Critical Theory and Interaction Design. MIT Press.","paperID":"None"},{"content":"Bardzell, S., Rosner, D. K., and Bardzell, J. (2012). Crafting quality in design: Integrity, creativity, and public sensibility. In Proc. of DIS2012. ACM Press.","paperID":"None"},{"content":"Buechley, L. (2010). LilyPad Arduino: Rethinking the Materials and Cultures of Educational Technology. In Proc. of ICLS2010, International Society of the Learning Sciences, pp. 127--128.","paperID":"None"},{"content":"Carspecken, P. F. (1996). Critical ethnography in educational research: A theoretical and practical guide. Psychology Press","paperID":"None"},{"content":"DiSalvo, C., Nourbakhsh, I., Holstius, D., Akin, A. and Louw M. (2008). The Neighborhood Networks Project: A Case Study of Critical Engagement and Creative Expression through Participatory Design. In Proc. of PDC2008.","paperID":"None"},{"content":"Fisher, B., and Tronto, J. (1990). Toward a Feminist Theory of Caring. In Circles of care: Work and identity in women's lives, pp. 35--62.","paperID":"None"},{"content":"Gilligan, C. (1982). In a Different Voice. Harvard University Press.","paperID":"None"},{"content":"Grimme, S., Bardzell, J., and Bardzell, S. (2014, accepted). \"We've conquered dark\": Shedding a light on empowerment in critical making. Proc. of NordiCHI2014. ACM Press.","paperID":"None"},{"content":"Hamington, M., and Miller, D. C. (2006). Introduction: A Modern Moral Imperative. In Hamington, M., and Miller, D. C. (eds.) Socializing care: Feminist ethics and public issues. Rowman & Littlefield Publishers.","paperID":"None"},{"content":"Hamington, M. (Ed.). (2010). Feminist Interpretations of Jane Addams. Penn State Press.","paperID":"None"},{"content":"Jackson, S. J., and Kang, L. (2014). Breakdown, Obsolescence and Reuse: HCI and the Art of Repair. In Proc. of CHI2014. ACM Press.","paperID":"None"},{"content":"Kohtala, C., and Bosqué, C. (2014, in press). The Story of MIT-Fablab Norway: Community Embedding of Peer Production. Journal of Peer Production.","paperID":"None"},{"content":"Korth, B. (2003). A critical reconstruction of care-inaction. The Qualitative Report, 8(3), 487--512","paperID":"None"},{"content":"Kuznetsov, S., and Paulos, E. (2010). Rise of the Expert Amateur: DIY Projects, Communities, and Cultures. In Proc. of NORDICHI2010. ACM Press.","paperID":"None"},{"content":"Lecompte, M. and Schensul, J. (1999). Analyzing and Interpreting Ethnographic Data. AltaMira Press.","paperID":"None"},{"content":"Levy, S. (2001). Hackers: Heroes of the Computer Revolution. Penguin Books.","paperID":"None"},{"content":"Light, A. and Akama, Y. (2014, to appear). Structuring Future Social Relations: The Politics of Care in Participatory Practice. Proc. of PDC2014.","paperID":"None"},{"content":"Lindtner, S., Hertz, G. D., and Dourish, P. (2014). Emerging sites of HCI innovation: Hackerspaces, hardware startups & incubators. In Proc. of CHI2014. ACM Press.","paperID":"None"},{"content":"Maxigas. (2012). Hacklabs and Hackerspaces - Tracing Two Genealogies. Journal of Peer Production (2): n. pag.","paperID":"None"},{"content":"Mellis, D. A. and Buechley, L. (2012). Case Studies in the Personal Fabrication of Electronic Products. In Proc. of DIS2012. ACM Press.","paperID":"None"},{"content":"Mellis, D., Follmer, S., Hartmann, B., Buechley, L., and Gross, M. D. (2013). FAB at CHI: Digital Fabrication Tools, Design, and Community. In Proc. of CHI2013 EA. ACM Press.","paperID":"None"},{"content":"Mota, C. (2011). The Rise of Personal Fabrication. In Proc. of Creativity and Cognition 2011. ACM Press.","paperID":"None"},{"content":"Murphy, J., and Gilligan, C. Moral development in late adolescence and adulthood: A critique and reconstruction of Kohlberg's theory. Human Development, 23 (1980), 77--104.","paperID":"None"},{"content":"Noddings, Nel. (1982). Caring: A Feminine Approach to Ethics and Moral Education. University of CA Press.","paperID":"None"},{"content":"Pace, T., Toombs, A., Gross, S., Pattin, T., Bardzell, J., and Bardzell, S. (2013). A tribute to Mad Skill: Expert Amateur Visuality and World of Warcraft Machinima. In Proc. of CHI2013. ACM Press.","paperID":"None"},{"content":"Puig de la Bellacasa, M. (2011). Matters of Care in Technoscience: Assembling Neglected Things. Social Studies of Science, 41 (1): 85--106.","paperID":"None"},{"content":"Rosner, D. K., and Ames, M. (2014). Designing for Repair?: Infrastructures and Materialities of Breakdown. In Proc. of CSCW2014. ACM Press.","paperID":"None"},{"content":"Rosner, D. K., Lindtner, S., Erickson, I., Forlano, L., Jackson, S. J., and Kolko, B. (2014). Making Cultures: Building Things & Building Communities. In Proc. of CSCW2014. ACM Press.","paperID":"None"},{"content":"Rosner, D., and Bean, J. (2009). Learning from IKEA Hacking: I'm Not One to Decoupage a Tabletop and Call it a Day. In Proc. of CHI2009. ACM Press.","paperID":"None"},{"content":"Tanenbaum, J., Tanenbaum, K. and Wakkary, R. (2012). Steampunk as Design Fiction. In Proc. of CHI2012. ACM Press.","paperID":"None"},{"content":"Tanenbaum, J., Williams, A. M., Desjardins, A., and Tanenbaum, K. (2013). Democratizing Technology: Pleasure, Utility and Expressiveness in DIY and Maker Practice. In Proc. of CHI2013. ACM Press.","paperID":"None"},{"content":"Toombs, A., Bardzell, S., and Bardzell, J. (2014, in press). Becoming Makers: Hackerspace Member Habits, Values, and Identities. Journal of Peer Production.","paperID":"None"},{"content":"Tronto, J. C. (1993). Moral boundaries: A political argument for an ethic of care. Psychology Pres","paperID":"None"},{"content":"Tronto, J. C. (2006). Vicious Circles of Privatized Caring. In Hamington, M., and Miller, D. C. (eds.) Socializing care: Feminist ethics and public issues. Rowman & Littlefield Publishers.","paperID":"None"},{"content":"Wakkary, R., and Maestri, L. (2007). The resourcefulness of Everyday Design. In Proc. of Creativity and Cognition. ACM Press.","paperID":"None"},{"content":"Wakkary, R. and Maestri, L. (2008). Aspects of Everyday Design: Resourcefulness, Adaptation, and Emergence. International Journal of Human-Computer Interaction, vol. 24, no. 5, pp. 478--491.","paperID":"None"}],"citation":[],"title":"The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making","filename":"CHI15/p629","authors":["Austin L. Toombs","Shaowen Bardzell","Jeffrey Bardzell"],"conference":"CHI '15"}