{"paperId":2702552,"citation":[],"reference":[{"content":"Aras, H., Krause, M., Haller, A., & Malaka, R. (2010). Webpardy: Harvesting QA by HC. In Proc. HCOMP 2010, (pp. 49--52). ACM.","paperID":"None"},{"content":"Argall, B. D., Chernova, S., Veloso, M., & Browning, B. (2009). A survey of robot learning from demonstration. Robotics and Autonomous Systems, 57(5), 469--483.","paperID":"None"},{"content":"Beetz, M., Klank, U., Kresse, I., Maldonado, A., Mosenlechner, L., Pangercic, D., Ruhr, T., & Tenorth, M. (2011). Robotic roommates making pancakes. In Proc. Humanoids 2011, (pp. 529--536). IEEE.","paperID":"None"},{"content":"Billard, A., Calinon, S., Dillmann, R., & Schaal, S. (2008). Robot programming by demonstration. In B. Siciliano, & O. Khatib (Eds.) Springer Handbook of Robotics, chap. 60, (pp. 1371--1394). Springer.","paperID":"None"},{"content":"Bollini, M., Tellex, S., Thompson, T., Roy, N., & Rus, D. (2013). Interpreting and executing recipes with a cooking robot. In J. P. Desai, G. Dudek, O. Khatib, & V. Kumar (Eds.) Experimental Robotics, vol. 88 of Springer Tracts in Advanced Robotics, (pp. 481--495). Springer.","paperID":"None"},{"content":"Bonetta, L. (2009). New citizens for the life sciences. Cell, 138(6), 1043--1045.","paperID":"None"},{"content":"Bowman, D. A., Kruijff, E., LaViola, J. J., & Poupyrev, I. (2004). 3D User Interfaces: Theory and Practice. Addison-Wesley.","paperID":"None"},{"content":"Deterding, S., Dixon, D., Khaled, R., & Nacke, L. (2011). From game design elements to gamefulness: Defining \"gamification\". In Proc MindTrek 2011, (pp. 9--15). New York, NY, USA: ACM.","paperID":"None"},{"content":"Flatla, D. R., Gutwin, C., Nacke, L. E., Bateman, S., & Mandryk, R. L. (2011). Calibration games: Making calibration tasks enjoyable by adding motivating game elements. In Proc. UIST 2011, (pp. 403--412). ACM.","paperID":"None"},{"content":"Forbes, M., Chung, M. J., Cakmak, M., & Rao, R. P. N. (2014). Robot programming by demonstration with crowdsourced action fixes. In Proc. HCOMP 2014, (pp. 67--76). AAAI Press.","paperID":"None"},{"content":"Haidu, A., Kohlsdorf, D., & Beetz, M. (2014). Learning task outcome prediction for robot control from interactive environments. In Proc. Intelligent Robots and Systems. IEEE/RSJ.","paperID":"None"},{"content":"Hunicke, R., LeBlanc, M., & Zubek, R. (2004). MDA: A formal approach to game design and game research. In D. Fu, S. Henke, & J. Orkin (Eds.) AAAI Workshop Challenges in Game Artificial Intelligence. AAAI Press.","paperID":"None"},{"content":"Kanda, T., Ishiguro, H., Imai, M., & Ono, T. (2004). Development and evaluation of interactive humanoid robots. Proceedings of the IEEE, 92(11), 1839--1850.","paperID":"None"},{"content":"Krause, M., & Smeddinck, J. (2012). Human Computation: A New Aspect of Serious Games., (pp. 1027--1047). In Handbook of Research on Serious Games as Educational, Business and Research Tools: Development and Design. IGI Global.","paperID":"None"},{"content":"Krause, M., Takhtamysheva, A., Wittstock, M., & Malaka, R. (2010). Frontiers of a paradigm: Exploring human computation with digital games. In Proc HCOMP 10, (pp. 22--25). ACM.","paperID":"None"},{"content":"Kunze, L., Haidu, A., & Beetz, M. (2013). Acquiring task models for imitation learning through games with a purpose. In Proc. IROS, 2013, (pp. 102--107). IEEE.","paperID":"None"},{"content":"Leap Motion, Inc. http://leapmotion.com (last visited on 2015-01-07).","paperID":"None"},{"content":"Matyas, S., Matyas, C., Schlieder, C., Kiefer, P., Mitarai, H., & Kamata, M. (2008). Designing locationbased mobile games with a purpose: Collecting geospatial data with CityExplorer. In Proc. ACE 2008, (pp. 244--247). ACM.","paperID":"None"},{"content":"McCarthy, J. (1968). Programs with common sense. In Semantic Information Processing, vol. 1, (pp. 403--418).","paperID":"None"},{"content":"Pollard, N. S., Hodgins, J. K., Riley, M. J., & Atkeson, C. G. (2002). Adapting human motion for the control of a humanoid robot. In Proc. ICRA 2002, vol. 2, (pp. 1390--1397). IEEE.","paperID":"None"},{"content":"Quinn, A. J., & Bederson, B. B. (2011). Human computation: A survey and taxonomy of a growing field. In Proc. CHI 2011, (pp. 1403--1412). ACM.","paperID":"None"},{"content":"Ryan, R. M., Rigby, C. S., & Przybylski, A. (2006). The motivational pull of video games: A Self-Determination theory approach. Motivation and Emotion, 30(4), 344--360.","paperID":"None"},{"content":"Schaal, S. (1999). Is imitation learning the route to humanoid robots? Trends in Cognitive Sciences, 3(6), 233--242.","paperID":"None"},{"content":"Shamsuddin, S., Ismail, L. I., Yussof, H., Ismarrubie Zahari, N., Bahari, S., Hashim, H., & Jaffar, A. (2011). Humanoid robot NAO: Review of control and motion exploration. In Proc. ICCSCE, (pp. 511--516). IEEE.","paperID":"None"},{"content":"Toris, R., Kent, D., & Chernova, S. (2014). The robot management system: A framework for conducting Human-Robot interaction studies through crowdsourcing. Journal of Human-Robot Interaction, 3(2), 25+.","paperID":"None"},{"content":"Tuite, K., Snavely, N., Hsiao, D. Y., Smith, A. M., & Popović, Z. (2010). Reconstructing the world in 3D: Bringing games with a purpose outdoors. In Proc. FDG 2010, (pp. 232--239). ACM.","paperID":"None"},{"content":"von Ahn, L., & Dabbish, L. (2008). Designing games with a purpose. Commun. ACM, 51(8), 58--67.","paperID":"None"},{"content":"Yuen, M.-C., Chen, L.-J., & King, I. (2009). A survey of human computation systems. In Proc. CSE, vol. 4, (pp. 723--728). Los Alamitos, CA, USA: IEEE.","paperID":"None"}],"abstract":"Autonomous manipulation robots can be valuable aids as interactive agents in the home, yet it has proven extremely difficult to program their behavior. Imitation learning uses data on human demonstrations to build behavioral models for robots. In order to cover a wide range of action strategies, data from many individuals is needed. Acquiring such large amounts of data can be a challenge. Tools for data capturing in this domain must thus implement a good user experience. We propose to use human computation games in order to gather data on human manual behavior. We demonstrate the idea with a strategy game that is operated via a natural user interface. A comparison between using the game for action execution and demonstrating actions in a virtual environment shows that people interact longer and have a better experience when playing the game.","video":"http://www.youtube.com/embed/REEgBzvcjMQ?rel=0","title":"Robots, Pancakes, and Computer Games: Designing Serious Games for Robot Imitation Learning","filename":"CHI15/p3623","authors":["Benjamin Walther-Franks","Jan Smeddinck","Peter Szmidt","Andrei Haidu","Michael Beetz","Rainer Malaka"],"conference":"CHI '15"}