{"paperId":2702445,"citation":[{"content":"Afra Mashhadi , Fahim Kawsar , Akhil Mathur , Casey Dugan , N. Shami, Let's Talk About the Quantified Workplace, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2855514"}],"reference":[{"content":"Albrecht, S. L. Handbook of employee engagement: Perspectives, issues, research and practice. Edward Elgar, Cheltenham, United Kingdom, 2010.","paperID":"None"},{"content":"Anderson, L. Employee Engagement and its Impact on Brand Value. Performance Improvement Council (2012).","paperID":"None"},{"content":"Archambault, A. and Grudin, J. A longitudinal study of facebook, linkedin, and twitter use. In Proc. CHI 2012, ACM Press (2012).","paperID":"None"},{"content":"Bakker, A. B. L. M. P. Work engagement: A handbook of essential theory and research. Psychology Press, New York, 2010.","paperID":"None"},{"content":"Breevaart, K., Bakker, A. B., Demerouti, E. and Hetland, J. The measure of state work engagement: A Figure 3. Proposed model of Employee Engagement multilevel factor analytic study. European Journal of Psychological Assessment 28, 4 (2012), 305--312.","paperID":"None"},{"content":"Brown, C., Efstratiou, C., Leontiadis, I., Quercia, D. and Mascolo, C. Tracking serendipitous interactions: How individual cultures shape the office. In Proc. CSCW 2014, ACM Press (2014), 1072--1081.","paperID":"None"},{"content":"Chalofsky, N. E. Meaningful Workplaces: Reframing How and Where we Work. Jossey-Bass, San Francisco, CA, 2010.","paperID":"None"},{"content":"Chen, J., Hsieh, G., Mahmud, J. U. and Nichols, J. Understanding individuals' personal values from social media word use. In Proc. CSCW 2014, ACM Press (2014), 405--414.","paperID":"None"},{"content":"Choudhury, M. D. and Counts, S. Understanding affect in the workplace via social media. In Proc. CSCW 2013, ACM Press (2013).","paperID":"None"},{"content":"Choudhury, M. D., Counts, S. and Horvitz, E. Predicting postpartum changes in emotion and behavior via social media. In Proc. CHI 2013, ACM Press (2013).","paperID":"None"},{"content":"Choudhury, M. D., Counts, S., Horvitz, E. J. and Hoff, A. Characterizing and predicting postpartum depression from shared facebook data. In Proc. CSCW 2014, ACM Press (2014), 626--638.","paperID":"None"},{"content":"Chui, M., Manyika, J., Bughin, J., Dobbs, R., Roxburgh, C., Sarrazin, H., Sands, G. and Westergren, M. The social economy: Unlocking value and productivity through social technologies. McKinsey Global Institute (2012).","paperID":"None"},{"content":"Csikszentmihalyi, M. Flow: The psychology of optimal experience. Harper & Row, New York, 1990.","paperID":"None"},{"content":"Culotta, A. Estimating county health statistics with twitter. In Proc. CHI 2014, ACM Press (2014).","paperID":"None"},{"content":"Dredze, M. How Social Media Will Change Public Health. Intelligent Systems, IEEE 27, 4 (2012), 81--84.","paperID":"None"},{"content":"Feldman, R. Techniques and applications for sentiment analysis. Commun. ACM 56, 4 (2013), 82--89.","paperID":"None"},{"content":"Fine, S., Horowitz, I., Weigler, H. and Basis, L. Is good character good enough? The effects of situational variables on the relationship between integrity and counterproductive work behaviors. Human Resource Management Review 20, 1 (2010), 73--84.","paperID":"None"},{"content":"General Inqurier. Retrieved May 26, 2014, from http://www.wjh.harvard.edu/~inquirer/","paperID":"None"},{"content":"Gill, A. J., Nowson, S. and Oberlander, J. What are they blogging about? Personality, topic and motivation in blogs. In Proc. ICWSM 2009, AAAI Press (2009).","paperID":"None"},{"content":"Golbeck, J., Robles, C., Edmondson, M. and Turner, K. Predicting Personality from Twitter. In Proc. SocialCom 2011, (2011), 149--156.","paperID":"None"},{"content":"Gou, L., Zhou, M. X. and Yang, H. KnowMe and ShareMe: Understanding automatically discovered personality traits from social media and user sharing preferences. In Proc. CHI 2014, ACM Press (2014), 955--964.","paperID":"None"},{"content":"Harter, J. K., Schmidt, F. L. and Hayes, T. L. Businessunit-level relationship between employee satisfaction, employee engagement, and business outcomes: A metaanalysis. Journal of Applied Psychology 87 (2002), 268--279.","paperID":"None"},{"content":"Harter, J. K., Schmidt, F. L. and Keyes, C. L. Wellbeing in the workplace and its relationship to business outcomes: A review of the Gallup studies. . In C. L. Keyes and J. Haidt (Eds.), Flourishing: The positive person and the good life (pp. 205--224). Washington, DC: American Psychological Association, 2003.","paperID":"None"},{"content":"Hyland, K. Metadiscourse: Exploring interaction in writing. Continuum, London, United Kingdom, 2005.","paperID":"None"},{"content":"Irani, L. C. and Silberman, M. S. Turkopticon: interrupting worker invisibility in amazon mechanical turk. In Proc. CHI 2013, ACM Press (2013).","paperID":"None"},{"content":"Johnson, G. Otherwise engaged. Training 41, 10 (2004), 4.","paperID":"None"},{"content":"Kahn, W. A. Psychological Conditions of Personal Engagement and Disengagement at Work. Academy of Management Journal 33, 4 (1990), 692--724.","paperID":"None"},{"content":"Lawler, E. High-Involvement Management. Participative Strategies for Improving Organizational Performance. Jossey-Bass Inc. Publishers, 1986.","paperID":"None"},{"content":"Lilienthal, P. If you give your employees a voice, do you listen? The Journal for Quality and Participation 25, 3 (2002), 38--40.","paperID":"None"},{"content":"Macey, W. H. Employee engagement: Tools for analysis, practice, and competitive advantage. WileyBlackwell, Chichester, United Kingdom, 2009.","paperID":"None"},{"content":"Macey, W. H. and Schneider, B. The Meaning of Employee Engagement. Industrial and Organizational Psychology 1, 1 (2008), 3--30.","paperID":"None"},{"content":"Mark, G., Iqbal, S. T., Czerwinski, M. and Johns, P. Bored mondays and focused afternoons: The rhythm of attention and online activity in the workplace. In Proc. CHI 2014, ACM Press (2014).","paperID":"None"},{"content":"Mark, G., Voida, S. and Cardello, A. \"A pace not dictated by electrons\": An empirical study of work without email. In Proc. CHI 2012, ACM Press (2012).","paperID":"None"},{"content":"Mazmanian, M. and Erickson, I. The product of availability: understanding the economic underpinnings of constant connectivity. In Proc. CHI 2014, ACM Press (2014), 763--772.","paperID":"None"},{"content":"Mohammad, S. and Turney, P. D. Crowdsourcing a Word-Emotion Association Lexicon. Computational Intelligence 29, 3 (2013), 436--465.","paperID":"None"},{"content":"Mone, E. M. and London, M. Employee engagement through effective performance management: A practical guide for managers. Routledge, New York, 2010.","paperID":"None"},{"content":"Muller, H., Sedley, A. and Ferrall-Nunge, E. Survey Research in HCI. In J. S. Olson and W. A. Kellogg (Eds.), Ways of Knowing in HCI. New York: Springer, 2014.","paperID":"None"},{"content":"Neeli, B. K. A Method to Engage Employees Using Gamification in BPO Industry. In Proc. ICSEM 2012, IEEE Computer Society (2012), 142--146.","paperID":"None"},{"content":"NRC word-emotion association lexicon. Retrieved May 26, 2014, from http://www.saifmohammad.com/ WebPages/ResearchInterests.html.","paperID":"None"},{"content":"Pennebaker, J. W., Chung, C. K., Ireland, M., Gonzales, A. and Booth, R. J. The development and psychometric properties of LIWC2007. Austin, TX, LIWC.Net (2007).","paperID":"None"},{"content":"Rich, B. L., Lepine, J. A. and Crawford, E. R. Job Engagement: Antecedents and Effects on Job Performance. Academy of Management Journal 53, 3 (2010), 617--635.","paperID":"None"},{"content":"Sadilek, A., Kautz, H. and Silenzio, V. Predicting Disease Transmission from Geo-Tagged Micro-Blog Data. In Proc. AAAI Conference on Artificial Intelligence, (2012).","paperID":"None"},{"content":"Saks, A. M. Antecedents and consequences of employee engagement. Journal of Managerial Psychology 21, 7 (2006), 600--619.","paperID":"None"},{"content":"Schaufeli, W. and Salanova, M. Work engagement: An emerging psychological concept and its implications for organizations. In G. S. W, D. D. Steiner and D. P. Skarlicki (Eds.), Managing social and ethical issues in organizations (pp. 135--177). Greenwich, CT: Information Age Publishing, 2007.","paperID":"None"},{"content":"Schaufeli, W., Salanova, M., González-romá, V. and Bakker, A. The Measurement of Engagement and Burnout: A Two Sample Confirmatory Factor Analytic Approach. Journal of Happiness Studies 3, 1 (2002).","paperID":"None"},{"content":"Schaufeli, W. B., Bakker, A. B. and Salanova, M. The Measurement of Work Engagement With a Short Questionnaire: A Cross-National Study. Educational and Psychological Measurement 66, 4 (2006), 701--716.","paperID":"None"},{"content":"Schwartz, H. A., Eichstaedt, J. C., Kern, M. L., Dziurzynski, L., Lucas, R. E., Agrawal, M., Park, G. J., Lakshmikanth, S. K., Jha, S., Seligman, M. E. P. and Ungar, L. Characterizing Geographic Variation in WellBeing Using Tweets. In Proc. ICWSM 2013, (2013).","paperID":"None"},{"content":"Shami, N. S., Nichols, J. and Chen, J. Social media participation and performance at work: a longitudinal study. In Proc. CHI 2014, ACM Press (2014), 115--118.","paperID":"None"},{"content":"Shami, N. S., Yang, J., Panc, L., Dugan, C., Ratchford, T., Rasmussen, J. C., Assogba, Y. M., Steier, T., Soule, T., Lupushor, S., Geyer, W., Guy, I. and Ferrar, J. Understanding employee social media chatter with enterprise social pulse. In Proc. CSCW 2014, ACM Press (2014), 379--392.","paperID":"None"},{"content":"Sonnentag, S., Dormann, C. and Demerouti, E. Not all days are created equal: The concept of state work engagement. In A. B. Bakker and M. P. Leiter (Eds.), Work engagement: A handbook of essential theory and research (pp. 25--38). Hove: Psychology Press, 2010.","paperID":"None"},{"content":"Stone, P. J. Thematic text analysis: New agendas for analyzing text content. In C. Roberts (Ed.), Text analysis for the social sciences. Hillsdale, NY: Erlbaum, 1997.","paperID":"None"},{"content":"Sumner, C., Byers, A., Boochever, R. and Park, G. J. Predicting Dark Triad Personality Traits from Twitter Usage and a Linguistic Analysis of Tweets. In Proc. ICMLA 2012, IEEE Computer Society (2012), 386--393.","paperID":"None"},{"content":"Teodoro, R., Ozturk, P., Naaman, M., Mason, W. and Lindqvist, J. The motivations and experiences of the ondemand mobile workforce. In Proc. CSCW 2014, ACM Press (2014).","paperID":"None"},{"content":"Towers-Perrin. Working today: Understanding what drives employee engagement, Stamford, CT, 2003.","paperID":"None"},{"content":"Vance, R. J. Employee Engagement and Commitment: A Guide to Understanding, Measuring and Increasing Engagement in your Organization. SHRM Foundation, Alexandria, VA, 2006.","paperID":"None"},{"content":"Voida, A., Olson, J. S. and Olson, G. M. Turbulence in the clouds: challenges of cloud-based information work. In Proc. CHI 2013, ACM (2013), 2273--2282.","paperID":"None"},{"content":"Webb, E. N. Gamification: When it works, when it doesn't. In Proc. DUXU 2013, Springer-Verlag (2013).","paperID":"None"},{"content":"Wiley, J. W. Strategic employee surveys: Evidencebased guidelines for driving organizational success. Jossey-Bass, San Francisco, 2010.","paperID":"None"},{"content":"Wiley, J. W., Herman, A. E. and Kowske, B. J. Developing and Validating a Global Model of Employee Engagement. In S. L. Albrecht (Ed.), Handbook of Employee Engagement. Cheltenham, United Kingdom: Edward Elgar Publishing, 2010.","paperID":"None"},{"content":"Yardi, S., Golder, S. A. and Brzozowski, M. J. Blogging at work and the corporate attention economy. In Proc. CHI 2009, ACM Press (2009), 2071--2080.","paperID":"None"},{"content":"Yarkoni, T. Personality in 100,000 Words: A large-scale analysis of personality and word use among bloggers. Journal of Research in Personality 44, 3 (2010).","paperID":"None"},{"content":"Zhang, H., Choudhury, M. D. and Grudin, J. Creepy but inevitable?: the evolution of social networking. In Proc. CSCW 2014, ACM Press (2014), 368--378.","paperID":"None"}],"abstract":"Employees increasingly are expressing ideas and feelings through enterprise social media. Recent work in CHI and CSCW has applied linguistic analysis towards understanding employee experiences. In this paper, we apply dictionary based linguistic analysis to measure 'Employee Engagement'. Employee engagement is a measure of employee willingness to apply discretionary effort towards organizational goals, and plays an important role in organizational outcomes such as financial or operational results. Organizations typically use surveys to measure engagement. This paper describes an approach to model employee engagement based on word choice in social media. This method can potentially complement surveys, thus providing more real-time insights into engagement and allowing organizations to address engagement issues faster. Our results predicting engagement scores on a survey by combining demographics with social media text demonstrate that social media text has significant predictive power compared to demographic data alone. We also find that engagement may be a state than a stable trait since social media posts closer to the administration of the survey had the most predictive power. We further identify the minimum number of social media posts required per employee for the best prediction.","title":"Inferring Employee Engagement from Social Media","filename":"CHI15/p3999","authors":["N. Sadat Shami","Michael Muller","Aditya Pal","Mikhil Masli","Werner Geyer"],"conference":"CHI '15"}