{"paperId":2702433,"citation":[{"content":"Mark A. Musen, The protégé project: a look back and a look forward, AI Matters, v.1 n.4, p.4-12, June 2015","paperID":"2757003"}],"reference":[{"content":"Oscar Corcho , Mariano Fernández-López , Asunción Gómez-Pérez, Methodologies, tools and languages for building ontologies: where is their meeting point?, Data & Knowledge Engineering, v.46 n.1, p.41-64, July 2003","paperID":"864179"},{"content":"Ren, Y., Parvizi, A., Mellish, C., Pan, J. Z., van Deemter, K., and Stevens, R. Towards competency question-driven ontology authoring. In The Semantic Web: Trends and Challenges. Springer, 2014, 752--767.","paperID":"None"},{"content":"Markel Vigo , Caroline Jay , Robert Stevens, Design insights for the next wave ontology authoring tools, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557284"},{"content":"Wilson Wong , Wei Liu , Mohammed Bennamoun, Ontology learning from text: A look back and into the future, ACM Computing Surveys (CSUR), v.44 n.4, p.1-36, August 2012","paperID":"2333115"}],"abstract":"An ontology is a machine processable artifact that captures knowledge about some domain of interest. Ontologies are used in various domains including healthcare, science, and commerce. In this paper we examine the ontology bootstrapping problem. Specifically, we look at an approach that uses both competency questions and knowledge source reuse via recommendations to address the \"cold start problem\" that is, the task of creating an ontology from scratch. We describe this approach, an implementation of it, and we present an evaluation in the form of a controlled user study. We find that the approach leads users into creating significantly more detailed initial ontologies that have a greater domain coverage than ontologies produced without this support. Furthermore, in spite of a more involved workflow, the usability and user satisfaction of the bootstrapping approach is as good as a state-of-the-art ontology editor with no additional support.","title":"Helping Users Bootstrap Ontologies: An Empirical Investigation","filename":"CHI15/p3395","authors":["Yuhao Zhang","Tania Tudorache","Matthew Horridge","Mark A. Musen"],"conference":"CHI '15"}