{"paperId":2702557,"abstract":"Social media sites are increasingly adopted by small nonprofit organizations (NPOs) to help them meet their public engagement goals. However, several characteristics of small organizations make it hard for them to effectively use social media sites. We present findings from interviews with 26 small NPOs' social media professionals on how they use multiple social media sites to support public engagement. Small NPOs use multiple social media sites to engage with different stakeholders toward various ends. However, these NPOs are not using social media to its full potential with regard to community-building and action mobilization. Several challenges in small NPOs, such as ineffective measurement of social media performance, deficient organizational resources, and lack of control over work, lead to strong tensions between social media engagement strategies and outcomes. Drawing on these findings, we present several practical implications for the design of successful public engagement social media tools.","citation":[{"content":"Youyang Hou, Understand the Design and Implementation of Civic Technologies in Public Organizations, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2874353"},{"content":"Sheena Erete , Emily Ryou , Geoff Smith , Khristina Marie Fassett , Sarah Duda, Storytelling with Data: Examining the Use of Data by Non-Profit Organizations, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820068"}],"reference":[{"content":"Anduiza, E., Cristancho, C. and Sabucedo, J. M. Mobilization through online social networks: The political protest of the indignados in Spain. Information, Communication & Society 17, 6 (2014), 750--764.","paperID":"None"},{"content":"Bernard, H. R. and Bernard, H. R. Social research methods: Qualitative and quantitative approaches. Sage, 2012.","paperID":"None"},{"content":"Bertot, J. C., Jaeger, P. T. and Hansen, D. The impact of polices on government social media usage: Issues, challenges, and recommendations. Government Information Quarterly 29, 1 (2012), 30--40.","paperID":"None"},{"content":"Briones, R. L., Kuch, B., Liu, B. F. and Jin, Y. Keeping up with the digital age: How the American Red Cross uses social media to build relationships. Public Relations Review 37, 1 (2011), 37--43.","paperID":"None"},{"content":"Christensen, H. S. Political activities on the Internet: Slacktivism or political participation by other means. First Monday 16, 2 (2011).","paperID":"None"},{"content":"Capturing the Complexity in Advanced Technology Use: Adaptive Structuration Theory, Organization Science, v.5 n.2, p.121-147, May 1994","paperID":"2734156"},{"content":"Joan DiMicco , David R. Millen , Werner Geyer , Casey Dugan , Beth Brownholtz , Michael Muller, Motivations for social networking at work, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460674"},{"content":"Derek Foster , Shaun Lawson , Jamie Wardman , Mark Blythe , Conor Linehan, \"Watts in it for me?\": design implications for implementing effective energy interventions in organisations, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208396"},{"content":"Gibbs, J. L., Rozaidi, N. A. and Eisenberg, J. Overcoming the \"ideology of openness\": Probing the affordances of social media for organizational knowledge sharing. Journal of Computer-Mediated Communication 19, 1 (2013), 102--120.","paperID":"None"},{"content":"Guo, C. and Saxton, G. D. Tweeting Social Change: How Social Media Are Changing Nonprofit Advocacy. Nonprofit and Voluntary Sector Quarterly 43, 1 (2014), 57--79.","paperID":"None"},{"content":"Hoffman, D. L. and Fodor, M. Can you measure the ROI of your social media marketing? Sloan Management Review 52, 1 (2010).","paperID":"None"},{"content":"Christopher A. Le Dantec , W. Keith Edwards, The view from the trenches: organization, power, and technology at two nonprofit homeless outreach centers, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460656"},{"content":"Kristen Lovejoy , Gregory D. Saxton, Information, Community, and Action: How Nonprofit Organizations Use Social Media, Journal of Computer-Mediated Communication, v.17 n.3, p.337-353, April 2012","paperID":"2239151"},{"content":"Tara Matthews , Steve Whittaker , Hernan Badenes , Barton Smith, Beyond end user content to collaborative knowledge mapping: interrelations among community social tools, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531694"},{"content":"Cecelia Merkel , Umer Farooq , Lu Xiao , Craig Ganoe , Mary Beth Rosson , John M. Carroll, Managing technology use and learning in nonprofit community organizations: methodological challenges and opportunities, Proceedings of the 2007 symposium on Computer human interaction for the management of information technology, March 30-31, 2007, Cambridge, Massachusetts","paperID":"1234783"},{"content":"Miles, M. B. and Huberman, A. M. Qualitative data analysis: An expanded sourcebook. Sage, 2013.","paperID":"None"},{"content":"Miller, D. and Miller, D. M. Nonprofit Organizations and the Emerging Potential of Social Media and Internet Resources. SPNHA Review 6, 1 (2011), 4.","paperID":"None"},{"content":"Nah, S. and Saxton, G. D. Modeling the adoption and use of social media by nonprofit organizations. New Media & Society 15, 2 (2012), 294--313.","paperID":"None"},{"content":"NVivo NVivo qualitative data analysis software. QSR International Pty Ltd, City, 2012.","paperID":"None"},{"content":"Obar, J. A., Zube, P. and Lampe, C. Advocacy 2.0: An analysis of how advocacy groups in the USA perceive and use social media as tools for facilitating civic engagement and collective action. Journal of Information Policy 2 (2012), 1--15.","paperID":"None"},{"content":"Powell, W. W. and Steinberg, R. The nonprofit sector: A research handbook. Yale University Press, 2006.","paperID":"None"},{"content":"Quinton, S. and Fennemore, P. Missing a strategic marketing trick? The use of online social networks by United Kingdom charities. International Journal of Nonprofit and Voluntary Sector Marketing 18, 1 (2013), 36--51.","paperID":"None"},{"content":"Christine Robson , Marti Hearst , Chris Kau , Jeffrey Pierce, Comparing the use of social networking and traditional media channels for promoting citizen science, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441941"},{"content":"Meredith M. Skeels , Jonathan Grudin, When social networks cross boundaries: a case study of workplace use of facebook and linkedin, Proceedings of the ACM 2009 international conference on Supporting group work, May 10-13, 2009, Sanibel Island, Florida, USA","paperID":"1531689"},{"content":"Sommerfeldt, E. J., Kent, M. L. and Taylor, M. Activist practitioner perspectives of website public relations: Why aren't activist websites fulfilling the dialogic promise? Public Relations Review 38, 2 (2012), 303--312.","paperID":"None"},{"content":"Charles Steinfield , Joan M. DiMicco , Nicole B. Ellison , Cliff Lampe, Bowling online: social networking and social capital within the organization, Proceedings of the fourth international conference on Communities and technologies, June 25-27, 2009, University Park, PA, USA","paperID":"1556496"},{"content":"Jennifer Stoll , W. Keith Edwards , Elizabeth D. Mynatt, Interorganizational coordination and awareness in a nonprofit ecosystem, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718930"},{"content":"Thrall, A. T., Stecula, D. and Sweet, D. May we have your attention please? Human-rights NGOs and the problem of global communication. The International Journal of Press/Politics 19, 2 (2014), 135--159.","paperID":"None"},{"content":"Treem, J. W. and Leonardi, P. M. 7 social media use in organizations. Communication Yearbook 36 (2012), 143.","paperID":"None"},{"content":"Using Facebook to Meet Your Mission : Results of a Survey. http://www.idealware.org/facebook_survey.","paperID":"None"},{"content":"Uzunoğlu, E. and Misci Kip, S. Building relationships through websites: A content analysis of Turkish environmental non-profit organizations' (NPO) websites. Public Relations Review (2013), 1--3.","paperID":"None"},{"content":"Amy Voida, Shapeshifters in the voluntary sector: exploring the human-centered-computing challenges of nonprofit organizations, interactions, v.18 n.6, November + December 2011","paperID":"2029985"},{"content":"Waters, R. D., Burnett, E., Lamm, A. and Lucas, J. Engaging stakeholders through social networking: How nonprofit organizations are using Facebook. Public Relations Review 35, 2 (2009), 102--106.","paperID":"None"},{"content":"Waters, R. D. and Jamal, J. Y. Tweet, tweet, tweet: A content analysis of nonprofit organizations' Twitter updates. Public Relations Review 37, 3 (2011), 321--324.","paperID":"None"},{"content":"Yuan, Y. C., Zhao, X., Liao, Q. and Chi, C. The use of different information and communication technologies to support knowledge sharing in organizations: From email to microblogging. Journal of the American Society for Information Science and Technology 64, 8 (2013), 1659--1670.","paperID":"None"},{"content":"Hui Zhang , Munmun De Choudhury , Jonathan Grudin, Creepy but inevitable?: the evolution of social networking, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531685"}],"title":"Social Media Effectiveness for Public Engagement: Example of Small Nonprofits","filename":"CHI15/p3107","authors":["Youyang Hou","Cliff Lampe"],"conference":"CHI '15"}