{"paperId":2702387,"abstract":"A natural way of communicating an audio concept is to imitate it with one's voice. This creates an approximation of the imagined sound (e.g. a particular owl's hoot), much like how a visual sketch approximates a visual concept (e.g a drawing of the owl). If a machine could understand vocal imitations, users could communicate with software in this natural way, enabling new interactions (e.g. programming a music synthesizer by imitating the desired sound with one's voice). In this work, we collect thousands of crowd-sourced vocal imitations of a large set of diverse sounds, along with data on the crowd's ability to correctly label these vocal imitations. The resulting data set will help the research community understand which audio concepts can be effectively communicated with this approach. We have released the data set so the community can study the related issues and build systems that leverage vocal imitation as an interaction modality.","reference":[{"content":"1. Blancas, D. S., and Janer, J. Sound retrieval from voice imitation queries in collaborative databases. In Proc. of Audio Engineering Society 53rd Int'l Conf. (2014).","paperID":"None"},{"content":"2. Cartwright, M., and Pardo, B. Synthassist: Querying an audio synthesizer by vocal imitation. In Conference on New Interfaces for Musical Expression (2014).","paperID":"None"},{"content":"Mathias Eitz , James Hays , Marc Alexa, How do humans sketch objects?, ACM Transactions on Graphics (TOG), v.31 n.4, p.1-10, July 2012","paperID":"2185540"},{"content":"Inger Ekman , Michal Rinott, Using vocal sketching for designing sonic interactions, Proceedings of the 8th ACM Conference on Designing Interactive Systems, August 16-20, 2010, Aarhus, Denmark","paperID":"1858195"},{"content":"5. Fritts, L. University of iowa musical instrument samples, 2012. http://theremin.music.uiowa.edu/MIS.html.","paperID":"None"},{"content":"Asif Ghias , Jonathan Logan , David Chamberlin , Brian C. Smith, Query by humming: musical information retrieval in an audio database, Proceedings of the third ACM international conference on Multimedia, p.231-236, November 05-09, 1995, San Francisco, California, USA","paperID":"215273"},{"content":"Olivier Gillet , Gaël Richard, Drum loops retrieval from spoken queries, Journal of Intelligent Information Systems, v.24 n.2, p.159-177, May 2005","paperID":"1119999"},{"content":"8. Janer Mestres, J. Singing-driven interfaces for sound synthesizers. PhD thesis, Universitat Pompeu Fabra, 2008.","paperID":"None"},{"content":"9. Lemaitre, G., Dessein, A., Susini, P., and Aura, K. Vocal imitations and the identification of sound events. Ecological Psychology 23, 4 (2011), 267--307.","paperID":"None"},{"content":"10. Lemaitre, G., and Rocchesso, D. On the effectiveness of vocal imitations and verbal descriptions of sounds. The Journal of the Acoustical Society of America 135, 2 (2014), 862--873.","paperID":"None"},{"content":"11. Marcell, M. M., Borella, D., Greene, M., Kerr, E., and Rogers, S. Confrontation naming of environmental sounds. Journal of Clinical and Experimental Neuropsychology 22, 6 (2000), 830--864.","paperID":"None"},{"content":"12. Smaragdis, P., and Mysore, G. J. Separation by \"humming\": User-guided sound extraction from monophonic mixtures. In Proc. of IEEE Workshop on Applications of Signal Processing to Audio and Acoustics (2009).","paperID":"None"},{"content":"13. Stowell, D. Making music through real-time voice timbre analysis: machine learning and timbral control. PhD thesis, Queen Mary University of London, 2010.","paperID":"None"},{"content":"14. Sundaram, S., and Narayanan, S. Vector-based representation and clustering of audio using onomatopoeia words. In Proc. of AAAI (2006).","paperID":"None"}],"citation":[{"content":"D. A. Mauro , D. Rocchesso, Analyzing and organizing the sonic space of vocal imitations, Proceedings of the Audio Mostly 2015 on Interaction With Sound, p.1-7, October 07-09, 2015, Thessaloniki, Greece","paperID":"2814921"},{"content":"David Stubbe Teglbjærg , Jesper S. Andersen , Stefania Serafin, The StringPhone: a novel voice driven physically based synthesizer, Proceedings of the Audio Mostly 2015 on Interaction With Sound, p.1-6, October 07-09, 2015, Thessaloniki, Greece","paperID":"2814916"},{"content":"Davide Rocchesso , Davide A. Mauro , Stefano Delle Monache, miMic: The Microphone as a Pencil, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2839467"}],"title":"VocalSketch: Vocally Imitating Audio Concepts","filename":"CHI15/p43","authors":["Mark Cartwright","Bryan Pardo"],"conference":"CHI '15"}