{"paperId":2702587,"citation":[],"reference":[{"content":"Ali, M., Chandramouli, B., Goldstein, J., and Schindlauer, R. The Extensibility Framework in Microsoft StreamInsight. Proc. ICDE, IEEE (2011), 1242--1253.","paperID":"None"},{"content":"Burnett, M., Atwood, J., Walpole Djang, R., Reichwein, J., Gottfried, H., and Yang, S. Forms/3: A First-order Visual Language to Explore the Boundaries of the Spreadsheet Paradigm. J. Funct. Program. 11, 2, Cambridge University Press (2001), 155--206.","paperID":"None"},{"content":"Chang, K.S.-P. and Myers, B.A. Creating Interactive Web Data Applications with Spreadsheets. Proc. UIST, ACM (2014), 87--96.","paperID":"None"},{"content":"Oney, S., Myers, B., and Brandt, J. ConstraintJS: Programming Interactive Behaviors for the Web by Integrating Constraints and States. Proc. UIST, ACM (2012), 229--238.","paperID":"None"},{"content":"Vaziri, M., Tardieu, O., Rabbah, R., Suter, P., and Hirzel, M. Stream Processing with a Spreadsheet. In R. Jones, ed., ECOOP 2014 -- Object-Oriented Programming SE 15. Springer Berlin Heidelberg (2014), 360--384.","paperID":"None"},{"content":"Woo, A., Seth, S., Olson, T., Liu, J., and Zhao, F. A spreadsheet approach to programming and managing sensor networks. Proc. ISPN, ACM (2006), 424--431.","paperID":"None"}],"abstract":"We present a spreadsheet model for working with streaming data. Our prototype tool presents techniques to let the user stream data from web services and web input elements to a spreadsheet without preprogramming those sources into the tool. Spreadsheet cells record metadata about where and when the data came from, allowing the user to view and manipulate streaming data using temporal information. Starting and pausing a data stream in the spreadsheet can be controlled programmatically using values computed by spreadsheet cells, making the spreadsheet program highly dynamic and interactive. We demonstrate the range of our design with a series of examples highlighting its ability to create different kinds of applications that process real-time data from the web using simple spreadsheet formulas.","video":"http://www.youtube.com/embed/js5T6NSnLjw?rel=0","title":"A Spreadsheet Model for Handling Streaming Data","filename":"CHI15/p3399","authors":["Kerry Shih-Ping Chang","Brad A. Myers"],"conference":"CHI '15"}