{"paperId":2702411,"citation":[],"abstract":"Striking up a good conversation with new acquaintances is often a difficult problem. In this paper we report on the perceptions of wearable device users who were given real-time personalized topic suggestions during a conversation with a person they just met. Suggestions were generated using a ranking recommendation algorithm, and were delivered via Google Glasses. We conducted a study with 38 pairs of strangers, who received such suggestions while conversing for the first time. Participants found the suggestions to be helpful, but only at the right moments, and for certain types of speakers. Our results contribute to the understanding of how communication interventions influence people's experience and behaviors, and enhance interpersonal interactions. Our study also presents design implications for applications on wearable devices to facilitate conversations between strangers.","reference":[{"content":"Altman, I., & Taylor, D. A. (1973). Social penetration: The development of interpersonal relationships., Oxford: Holt, Rinehart & Winston.","paperID":"None"},{"content":"Tony Bergstrom , Karrie Karahalios, Conversation Clock: Visualizing audio patterns in co-located groups, Proceedings of the 40th Annual Hawaii International Conference on System Sciences, p.78, January 03-06, 2007","paperID":"1255645"},{"content":"Burgoon, J. K., & Hale, J. L. (1987). Validation and measurement of the fundamental themes of relational communication. Communication Monographs, 54, 1, 19--41.","paperID":"None"},{"content":"Clark, H. (1992). Arenas of Language Use. Chicago: The University of Chicago Press & CSLI.","paperID":"None"},{"content":"Clark, H. H., & Brennan, S. E. (1991). Grounding in communication. Perspectives on socially shared cognition, 13, 127--149.","paperID":"None"},{"content":"Gosling, S. D., Rentfrow, P. J., & Swann Jr, W. B. (2003). A very brief measure of the Big-Five personality domains. Journal of Research in personality, 37, 6, 504528.","paperID":"None"},{"content":"Goffman, E. (1967). On face-work. In Interaction Ritual: Essays on Face-to-Face Behavior, 5--46. New York: Pantheon.","paperID":"None"},{"content":"Granovetter, M. S. (1973). The strength of weak ties. American Journal of Sociology, 1360--1380.","paperID":"None"},{"content":"John Hannon , Mike Bennett , Barry Smyth, Recommending twitter users to follow using content and collaborative filtering approaches, Proceedings of the fourth ACM conference on Recommender systems, September 26-30, 2010, Barcelona, Spain","paperID":"1864746"},{"content":"Manning, C. D., Surdeanu, M., Bauer, J., Finkel, J., Bethard, S. J., & McClosky, D. (2014). The Stanford CoreNLP Natural Language Processing Toolkit. Proc. ALC'14, 55--60.","paperID":"None"},{"content":"McCarthy, J. (2002). Using public displays to create conversation opportunities. Proc. CSCW'02 Workshop.","paperID":"None"},{"content":"McLaughlin, M. L., & Cody, M. J. (1982). Awkward silences: Behavioral antecedents and consequences of the conversational lapse. Human Communication Research, 8, 4, 299--316.","paperID":"None"},{"content":"Tien T. Nguyen , Daniel Kluver , Ting-Yu Wang , Pik-Mai Hui , Michael D. Ekstrand , Martijn C. Willemsen , John Riedl, Rating support interfaces to improve user experience and recommender accuracy, Proceedings of the 7th ACM conference on Recommender systems, October 12-16, 2013, Hong Kong, China","paperID":"2507188"},{"content":"Nguyen, D. T., & Fussell, S. R. (2014). Lexical Cues of Interaction Involvement in Dyadic Instant Messaging Conversations. Discourse Processes, 51, 468--493.","paperID":"None"},{"content":"Eyal Ofek , Shamsi T. Iqbal , Karin Strauss, Reducing disruption from subtle information delivery during a conversation: mode and bandwidth investigation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466425"},{"content":"Parviz, B., Tan, D. (2011). Functional Contact Lens Monitors Blood Sugar Without Needles http://research.microsoft.com/enus/collaboration/stories/nui_contactlens_cs.pdf, retrieved 2014-09--17.","paperID":"None"},{"content":"Evie Powell , Rachel Brinkman , Tiffany Barnes , Veronica Catete, Table tilt: making friends fast, Proceedings of the International Conference on the Foundations of Digital Games, May 29-June 01, 2012, Raleigh, North Carolina","paperID":"2282386"},{"content":"Paul Resnick , Neophytos Iacovou , Mitesh Suchak , Peter Bergstrom , John Riedl, GroupLens: an open architecture for collaborative filtering of netnews, Proceedings of the 1994 ACM conference on Computer supported cooperative work, p.175-186, October 22-26, 1994, Chapel Hill, North Carolina, USA","paperID":"192905"},{"content":"Rhodes, B. J. (1997). The wearable remembrance agent: A system for augmented memory. Personal Technologies, 1, 4, 218--224.","paperID":"None"},{"content":"Bradley J. Rhodes , Nelson Minar , Josh Weaver, Wearable Computing Meets Ubiquitous Computing: Reaping the Best of Both Worlds, Proceedings of the 3rd IEEE International Symposium on Wearable Computers, p.141, October 18-19, 1999","paperID":"856497"},{"content":"Sunnafrank, M. J., & Miller, G. R. (1981). The role of initial conversations in determining attraction to similar and dissimilar strangers. Human Communication Research, 8, 16--25.","paperID":"None"},{"content":"Svennevig, J. (2000). Getting acquainted in conversation: a study of initial interactions (Vol. 64). Amsterdam: John Benjamins Publishing.","paperID":"None"},{"content":"Thorne, A. The press of personality: A study of conversations between introverts and extraverts. Journal of Personality and Social Psychology, 53, 718--726.","paperID":"None"},{"content":"Peter Tolmie , Andy Crabtree , Tom Rodden , Steve Benford, \"Are you watching this film or what?\": interruption and the juggling of cohorts, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460605"},{"content":"Jesse Vig , Shilad Sen , John Riedl, The Tag Genome: Encoding Community Knowledge to Support Novel Interaction, ACM Transactions on Interactive Intelligent Systems (TiiS), v.2 n.3, p.1-44, September 2012","paperID":"2362395"},{"content":"Hao-Chuan Wang , Dan Cosley , Susan R. Fussell, Idea expander: supporting group brainstorming with conversationally triggered visual thinking stimuli, Proceedings of the 2010 ACM conference on Computer supported cooperative work, February 06-10, 2010, Savannah, Georgia, USA","paperID":"1718938"},{"content":"Weiss, R. S. (1973). Loneliness: The experience of emotional and social isolation. Cambridge: MIT Press.","paperID":"None"},{"content":"Zhibiao Wu , Martha Palmer, Verbs semantics and lexical selection, Proceedings of the 32nd annual meeting on Association for Computational Linguistics, p.133-138, June 27-30, 1994, Las Cruces, New Mexico","paperID":"981751"},{"content":"Zhiquan Yeo, Emotional instant messaging with KIM, CHI '08 Extended Abstracts on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1358921"},{"content":"Jennifer Yoon , Jun Oishi , Jason Nawyn , Kazue Kobayashi , Neeti Gupta, FishPong: encouraging human-to-human interaction in informal social environments, Proceedings of the 2004 ACM conference on Computer supported cooperative work, November 06-10, 2004, Chicago, Illinois, USA","paperID":"1031669"},{"content":"Chien Wen Yuan , Leslie D. Setlock , Dan Cosley , Susan R. Fussell, Understanding informal communication in multilingual contexts, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441880"}],"title":"The Known Stranger: Supporting Conversations between Strangers with Personalized Topic Suggestions","filename":"CHI15/p555","authors":["Tien T. Nguyen","Duyen T. Nguyen","Shamsi T. Iqbal","Eyal Ofek"],"conference":"CHI '15"}