{"paperId":2702130,"citation":[{"content":"Arnaud Prouzeau , Anastasia Bezerianos , Olivier Chapuis, Road traffic monitoring on a wall display, Proceedings of the 27th Conference on l'Interaction Homme-Machine, p.1-6, October 27-30, 2015, Toulouse, France","paperID":"2825009"}],"reference":[{"content":"Appert C., Chapuis O. & Pietriga E. High-precision magnification lenses. CHI '10, ACM (2010), 273--282.","paperID":"None"},{"content":"Bertin J. Semiology of Graphics. University of Wisconsin Press, 1983.","paperID":"None"},{"content":"Bier E. A., Stone M. C., Pier K., Buxton W. & DeRose T. D. Toolglass and magic lenses: The see-through interface. SIGGRAPH '93, ACM (1993), 73--80.","paperID":"None"},{"content":"Bonanni L., Xiao X., Hockenberry M., Subramani P., Ishii H., Seracini M. & Schulze J. Wetpaint: Scraping through multi-layered images. CHI '09, ACM (2009), 571--574.","paperID":"None"},{"content":"Böttger J., Brandes U., Deussen O. & Ziezold H. Map warping for the annotation of metro maps. IEEE Computer Graphics & Applications 28, 5 (2008), 56--65.","paperID":"None"},{"content":"Cockburn A., Karlson A. & Bederson B. B. A review of overview+detail, zooming, and focus+context interfaces. ACM Comput. Surv. 41, 1 (2009), 2:1--2:31.","paperID":"None"},{"content":"Elias M., Elson J., Fisher D. & Howell J. Do I Live in a Flood Basin?: Synthesizing Ten Thousand Maps. CHI '08, ACM (2008), 255--264.","paperID":"None"},{"content":"Elmqvist N., Riche Y., Henry-Riche N. & Fekete J.-D. Mélange: Space folding for visual exploration. IEEE TVCG 16, 3 (2010), 468--483.","paperID":"None"},{"content":"Gleicher M., Albers D., Walker R., Jusufi I., Hansen C. D. & Roberts J. C. Visual comparison for information visualization. Information Visualization 10, 4 (2011), 289--309.","paperID":"None"},{"content":"Gustafson S., Baudisch P., Gutwin C. & Irani P. Wedge: Clutter-free visualization of off-screen locations. CHI '08, ACM (2008), 787--796.","paperID":"None"},{"content":"Harrison B. L., Ishii H., Vicente K. J. & Buxton W. A. S. Transparent layered user interfaces: An evaluation of a display design to enhance focused and divided attention. CHI '95, ACM Press/Addison-Wesley (1995), 317--324.","paperID":"None"},{"content":"Hoarau C., Christophe S. & Musti'ere S. Mixing, blending, merging or scrambling topographic maps and orthoimagery in geovisualizations? In International Cartographic Conference (2013).","paperID":"None"},{"content":"Hornbæk K., Bederson B. B. & Plaisant C. Navigation patterns and usability of zoomable user interfaces with and without an overview. ACM ToCHI 9, 4 (2002), 362--389.","paperID":"None"},{"content":"Javed W. & Elmqvist N. Exploring the design space of composite visualization. PacificVis, IEEE (2012), 1--8.","paperID":"None"},{"content":"Javed W., Ghani S. & Elmqvist N. Polyzoom: Multiscale and Multifocus Exploration in 2D Visual Spaces. CHI '12, ACM (2012), 287--296.","paperID":"None"},{"content":"Koch T. The map as intent: variations on the theme of John Snow. Cartographica: Int. Jour. for Geographic Information and Geovisualization 39, 4 (2004), 1--14.","paperID":"None"},{"content":"Lee H., Lee S., Kim N. & Seo J. JigsawMap: Connecting the Past to the Future by Mapping Historical Textual Cadasters. CHI '12, ACM (2012), 463--472.","paperID":"None"},{"content":"Lieberman H. Powers of ten thousand: Navigating in large information spaces. UIST, ACM (1994), 15--16.","paperID":"None"},{"content":"Luz S. & Masoodian M. Readability of a background map layer under a semi-transparent foreground layer. AVI '14, ACM (2014), 161--168.","paperID":"None"},{"content":"MacEachren A. M. The roles of maps. In The Map Reader. Wiley & Sons, 2011, 244--251.","paperID":"None"},{"content":"MacEachren A. M. & Kraak M.-J. Research Challenges in Geovisualization. Cartography and Geographic Information Science 28, 1 (2001), 3--12.","paperID":"None"},{"content":"Pietriga E. A Toolkit for Addressing HCI Issues in Visual Language Environments. VLHCC '05, IEEE (2005), 145--152.","paperID":"None"},{"content":"Pietriga E., Appert C. & Beaudouin-Lafon M. Pointing and beyond: An operationalization and preliminary evaluation of multi-scale searching. CHI '07, ACM (2007), 1215--1224.","paperID":"None"},{"content":"Pietriga E., Bau O. & Appert C. Representation-Independent In-Place Magni'cation with Sigma Lenses. IEEE TVCG 16, 3 (2010), 455--467.","paperID":"None"},{"content":"Pindat C., Pietriga E., Chapuis O. & Puech C. Jellylens: content-aware adaptive lenses. UIST '12, ACM (2012), 261--270.","paperID":"None"},{"content":"Plumlee M. D. & Ware C. Zooming versus multiple window interfaces: Cognitive costs of visual comparisons. ACM ToCHI 13, 2 (2006), 179--209.","paperID":"None"},{"content":"Raposo P. & Brewer C. Comparison of topographic map designs for overlay on orthoimage backgrounds. In International Cartographic Conference (2011), 3--8.","paperID":"None"},{"content":"Reilly D. F. & Inkpen K. M. Map morphing: Making sense of incongruent maps. GI '04 (2004), 231--238.","paperID":"None"},{"content":"Rønne Jakobsen M. & Hornbæk K. Sizing up visualizations: Effects of display size in focus+context, overview+detail, and zooming interfaces. CHI '11, ACM (2011), 1451--1460.","paperID":"None"},{"content":"Roth R. E. An empirically-derived taxonomy of interaction primitives for interactive cartography and geovisualization. IEEE TVCG 19, 12 (2013), 2356--2365.","paperID":"None"},{"content":"Roth R. E. Interactive maps: What we know and what we need to know. Journal of Spatial Information Science, 6 (2013), 59--115.","paperID":"None"},{"content":"Slingsby A., Dykes J., Wood J. & Radburn R. Designing an exploratory visual interface to the results of citizen surveys. International Journal of Geographical Information Science 28, 10 (2014), 2090--2125.","paperID":"None"},{"content":"Touya G. Social welfare to assess the global legibility of a generalized map. In International Conference on Geographic Information, Springer (2012), 198--211.","paperID":"None"},{"content":"Touya G. & Girres J.-F. ScaleMaster 2.0: a ScaleMaster extension to monitor automatic multi-scales generalizations. Cartography and Geographic Information Science 40, 3 (2013), 192--200.","paperID":"None"},{"content":"Tversky B. Some ways that maps and diagrams communicate. In Spatial Cognition II. Springer-Verlag, 2000, 72--79.","paperID":"None"},{"content":"Ware C. & Lewis M. The DragMag Image Magnifier. CHI '95 companion, ACM (1995), 407--408.","paperID":"None"},{"content":"Yatani K., Partridge K., Bern M. & Newman M. W. Escape: A target selection technique using visually-cued gestures. CHI '08, ACM (2008), 285--294.","paperID":"None"}],"abstract":"Geovisualization applications typically organize data into layers. These layers hold different types of geographical features, describe different characteristics of the same features, or represent those features at different points in time. Layers can be composited in various ways, most often employing a juxtaposition or superimposition strategy, to produce maps that users can explore interactively. From an HCI perspective, one of the main challenges is to design interactive compositions that optimize the legibility of the resulting map and that ease layer comparison. We characterize five representative techniques, and empirically evaluate them using a set of real-world maps in which we purposefully introduce six types of differences amenable to inter-layer visual comparison. We discuss the merits of these techniques in terms of visual interference, user attention and scanning strategy. Our results can help inform the design of map-based visualizations for supporting geo-analysis tasks in many application areas.","title":"An Evaluation of Interactive Map Comparison Techniques","filename":"CHI15/p3573","authors":["María-Jesús Lobo","Emmanuel Pietriga","Caroline Appert"],"conference":"CHI '15"}