{"paperId":2702468,"abstract":"The current study sought to identify the impact of whether teammates in a cooperative videogame were controlled by other humans (avatars) or by the game (agents). The impact on player experience was explored through both subjective questionnaire measures and brain wave activity measurement (electroencephalography). Play with human teammates was associated with a greater sense of relatedness, but less competence and flow than play with other computer-controlled teammates. In terms of brain activity, play with human teammates was associated with greater activity in the alpha, theta and beta power bands than play with computer-controlled teammates. Overall, the results suggest that play with human teammates involves greater cognitive activity in terms of 'mentalising' than play with computer-controlled teammates. Additionally, the associations between subjective measures of player experience and brain activity are described. Limitations of the current study are identified and key directions for future research are discussed.","citation":[{"content":"Gabriel Culbertson , Erik Andersen , Walker White , Daniel Zhang , Malte Jung, Crystallize: An Immersive, Collaborative Game for Second Language Learning, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820020"}],"reference":[{"content":"Paul Cairns , Anna L. Cox , Matthew Day , Hayley Martin , Thomas Perryman, Who but not where: The effect of social play on immersion in digital games, International Journal of Human-Computer Studies, v.71 n.11, p.1069-1077, November, 2013","paperID":"2535197"},{"content":"Cole, H. and W.J. Ray, EEG correlates of emotional tasks related to attentional demands. International Journal of Psychophysiology 3, 1 (1985), 33--41.","paperID":"None"},{"content":"Cooper, N.R., et al., Paradox lost? Exploring the role of alpha oscillations during externally vs. internally directed attention and the implications for idling and inhibition hypotheses. J. Psy-phys 47, 1 (2003), 65--74.","paperID":"None"},{"content":"Anders Drachen , Lennart E. Nacke , Georgios Yannakakis , Anja Lee Pedersen, Correlation between heart rate, electrodermal activity and player experience in first-person shooter games, Proceedings of the 5th ACM SIGGRAPH Symposium on Video Games, p.49-54, July 28-29, 2010, Los Angeles, California","paperID":"1836143"},{"content":"Fisch, B.J. and R. Spehlmann, Fisch and Spehlmann's EEG primer: basic principles of digital and analog EEG. (1999), Amsterdam: Elsevier Health Sciences.","paperID":"None"},{"content":"Brian J. Gajadhar , Yvonne A. Kort , Wijnand A. Ijsselsteijn, Shared Fun Is Doubled Fun: Player Enjoyment as a Function of Social Setting, Proceedings of the 2nd International Conference on Fun and Games, October 20-21, 2008, Eindhoven, The Netherlands","paperID":"1462519"},{"content":"Gallagher, H.L., et al., Imaging the intentional stance in a competitive game. Neuroimage 16, 3 (2002), 814--821.","paperID":"None"},{"content":"Gasser, T., L. Sroka, and J. Mocks, The transfer of EOG activity into the EEG for eyes open and closed. Elecenceph. & Clin. Neurophys 61, 2 (1985), 181--193.","paperID":"None"},{"content":"Hagemann, D. and E. Naumann, The effects of ocular artifacts on (lateralized) broadband power in the EEG. Clinical Neurophysiology 112, 2 (2001), 215--231.","paperID":"None"},{"content":"IJsselsteijn, W., Y. De Kort, and K. Poels, The Game Experience Questionnaire: Development of a self-report measure to assess the psychological impact of digital games. Manuscript in Prep (2008).","paperID":"None"},{"content":"Daniel Johnson , John Gardner, Personality, motivation and video games, Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction, November 22-26, 2010, Brisbane, Australia","paperID":"1952281"},{"content":"Daniel Johnson , Peta Wyeth , Penny Sweetser , John Gardner, Personality, genre and videogame play experience, Proceedings of the 4th International Conference on Fun and Games, p.117-120, September 04-06, 2012, Toulouse, France","paperID":"2367633"},{"content":"Sohye Lim , Byron Reeves, Computer agents versus avatars: Responses to interactive game characters controlled by a computer or other player, International Journal of Human-Computer Studies, v.68 n.1-2, p.57-68, January, 2010","paperID":"1660438"},{"content":"Lucas, K. and J.L. Sherry, Sex Differences in Video Game Play: A Communication-Based Explanation. Communication Research 31, 5 (2004), 499--523.","paperID":"None"},{"content":"Regan L. Mandryk , M. Stella Atkins , Kori M. Inkpen, A continuous and objective evaluation of emotional experience with interactive play environments, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124926"},{"content":"Mandryk, R.L., K.M. Inkpen, and T.W. Calvert, Using psychophysiological techniques to measure user experience with entertainment technologies. Behaviour & Information Technology 25, 2 (2006), 141--158.","paperID":"None"},{"content":"Mitchell, D.J., et al., Frontal-midline theta from the perspective of hippocampal \"theta\". Progress in Neurobiology 86, 3 (2008), 156--185.","paperID":"None"},{"content":"Lennart E. Nacke, Wiimote vs. controller: electroencephalographic measurement of affective gameplay interaction, Proceedings of the International Academic Conference on the Future of Game Design and Technology, May 06-07, 2010, Vancouver, British Columbia, Canada","paperID":"1920801"},{"content":"Lennart E. Nacke , Mark N. Grimshaw , Craig A. Lindley, More than a feeling: Measurement of sonic user experience and psychophysiology in a first-person shooter game, Interacting with Computers, v.22 n.5, p.336-343, September, 2010","paperID":"1837819"},{"content":"Nacke, L. E., Stellmach, S., & Lindley, C. A. Electroencephalographic Assessment of Player Experience: A Pilot Study in Affective Ludology. Simulation & Gaming, 42, 5 (2010), 632--655.","paperID":"None"},{"content":"Olson, C.K., Children's motivations for video game play in the context of normal development. Review of General Psychology 14, 2 (2010), 180--187.","paperID":"None"},{"content":"Pasch, M., et al., Movement-based sports video games: Investigating motivation and gaming experience. Entertainment Computing 1, 2 (2009), 49--61.","paperID":"None"},{"content":"Przybylski, A.K., C.S. Rigby, and R.M. Ryan, A motivational model of video game engagement. Review of General Psychology 14, 2 (2010), 154--166.","paperID":"None"},{"content":"Ravaja, N., et al., Phasic emotional reactions to video game events: a psychophysiological investigation. Media Psychology 8, (2006), 343--367.","paperID":"None"},{"content":"Niklas Ravaja , Timo Saari , Marko Turpeinen , Jari Laarni , Mikko Salminen , Matias Kivikangas, Spatial Presence and Emotions during Video Game Playing: Does It Matter with Whom You Play?, Presence: Teleoperators and Virtual Environments, v.15 n.4, p.381-392, August 2006","paperID":"1176831"},{"content":"Russoniello, C.V., K. O'Brien, and J.M. Parks, EEG, HRV and Psychological Correlates while Playing Bejeweled II: A Randomized Controlled Study. Studies in health technology and informatics 144, (2009), 18992.","paperID":"None"},{"content":"Ryan, R.M. and E.L. Deci, Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American Psychologist 55, 1 (2000), 68--78.","paperID":"None"},{"content":"Ryan, R.M., C.S. Rigby, and A.K. Przybylski, The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30, 4 (2006), 344--360.","paperID":"None"},{"content":"Salminen, M., et al. Frontal EEG asymmetry in the study of player experiences during competitive and cooperative play. In Proc. of IADIS Int. Conf. Game and Entertainment Technologies (2009).","paperID":"None"},{"content":"Salminen, M. and N. Ravaja, Oscillatory brain responses evoked by video game events: The case of Super Monkey Ball 2. CyberPsy & Beh 10, 3 (2007), 330--338.","paperID":"None"},{"content":"Sanei, S. and J.A. Chambers, EEG Signal Processing. 2008, Chichester: John Wiley & Sons, Ltd.","paperID":"None"},{"content":"Schier, M.A., Changes in EEG alpha power during simulated driving: a demonstration. International Journal of Psychophysiology 37, (2000), 155--162.","paperID":"None"},{"content":"Barbara G. Tabachnick , Linda S. Fidell, Using Multivariate Statistics (5th Edition), Allyn  & Bacon, Inc., Needham Heights, MA, 2006","paperID":"1213888"},{"content":"Kellie Vella , Daniel Johnson , Leanne Hides, Positively playful: when videogames lead to player wellbeing, Proceedings of the First International Conference on Gameful Design, Research, and Applications, p.99-102, October 02-04, 2013, Toronto, Ontario, Canada","paperID":"2583024"},{"content":"David Weibel , Bartholomäus Wissmath , Stephan Habegger , Yves Steiner , Rudolf Groner, Playing online games against computer- vs. human-controlled opponents: Effects on presence, flow, and enjoyment, Computers in Human Behavior, v.24 n.5, p.2274-2291, September 2008","paperID":"1385827"},{"content":"Yee, N., Motivations for Play in Online Games. CyberPsychology & Behavior 9, 6 (2006), 772--77","paperID":"None"}],"title":"Cooperative Game Play with Avatars and Agents: Differences in Brain Activity and the Experience of Play","filename":"CHI15/p3721","authors":["Daniel Johnson","Peta Wyeth","Madison Clark","Christopher Watling"],"conference":"CHI '15"}