{"paperId":2702190,"reference":[{"content":"Abowd, G. D., Atkeson, C. G., Hong, J., Long, S., Kooper, R., and Pinkerton, M. Cyberguide: A mobile context-aware tour guide. Wir. Net. 3, 5 (1997), 421--433.","paperID":"None"},{"content":"Amemiya, T., and Sugiyama, H. Haptic handheld wayfinder with pseudo-attraction force for pedestrians with visual impairments. In Proc. Assets '09, ACM (2009), 107--114.","paperID":"None"},{"content":"Belda-Lois, J.-M., del Horno, S. M., et al. Rehabilitation of gait after stroke: A review towards a top-down approach. Jour. NeuEng. and Reha. 8, 66 (Dec 2011).","paperID":"None"},{"content":"Fitzpatrick, R. C., Wardman, D. L., and Taylor, J. L. Effects of galvanic vestibular stimulation during human walking. The Journal of Physiology 517, 3 (June 1999), 931--939.","paperID":"None"},{"content":"Frey, M. CabBoots: Shoes with integrated guidance system. In Proc., TEI '07, ACM (2007), 245--246.","paperID":"None"},{"content":"Hase, K., and Stein, R. B. Turning strategies during human walking. Journal of Neurophysiology 81 (1999), 2914--2922.","paperID":"None"},{"content":"Heuten, W., Henze, N., Boll, S., and Pielot, M. Tactile wayfinder: A non-visual support system for wayfinding. In Proc. NordiCHI'08, ACM (2008), 172--181.","paperID":"None"},{"content":"Imamura, Y., Arakawa, H., Kamuro, S., Minamizawa, K., and Tachi, S. HAPMAP: Haptic walking navigation system with support by the sense of handrail. In ACM SIGGRAPH 2011 Emerging Technologies (2011).","paperID":"None"},{"content":"Jacob, R., Mooney, P., and Winstanley, A. C. Guided by touch: Tactile pedestrian navigation. In Proc. MLBS'11, ACM (2011), 11--20.","paperID":"None"},{"content":"Kammoun, S., Jouffrais, C., Guerreiro, T., Nicolau, H., and Jorge, J. Guiding blind people with haptic feedback. Frontiers in Accessibility for Pervasive Computing (Pervasive 2012) (2012).","paperID":"None"},{"content":"Kojima, Y., Hashimoto, Y., Fukushima, S., and Kajimoto, H. Pull-Navi: A novel tactile navigation interface by pulling the ears. In ACM SIGGRAPH 2009 Emerging Technologies (2009).","paperID":"None"},{"content":"Lyons, G., Sinkjaer, T., Burridge, J., and Wilcox, D. A review of portable FES-based neural orthoses for the correction of drop foot. IEEE Trans. on Neu. Sys. and Reha. Eng. 10, 4 (Dec 2002), 260--279.","paperID":"None"},{"content":"Maeda, T., Ando, H., Amemiya, T., Nagaya, N., Sugimoto, M., and Inami, M. Shaking the world: Galvanic vestibular stimulation as a novel sensation interface. In ACM SIGGRAPH 2005 Emerging Technologies (2005).","paperID":"None"},{"content":"Miyazaki, Y., and Kamiya, T. Pedestrian navigation system for mobile phones using panoramic landscape images. In Proc. SAINT'06, IEEE (2006), 102--108.","paperID":"None"},{"content":"Morrison, A., Oulasvirta, A., Peltonen, P., et al. Like bees around the hive: A comparative study of a mobile augmented reality map. In Proc. CHI'09, ACM (2009), 1889--1898.","paperID":"None"},{"content":"Pielot, M., Poppinga, B., and Boll, S. Pocketnavigator: Vibro-tactile waypoint navigation for everyday mobile devices. In Proc. MobileHCI '10, ACM (2010), 423--426.","paperID":"None"},{"content":"Pohl, H., and Murray-Smith, R. Focused and casual interactions: Allowing users to vary their level of engagement. In Proc. CHI'13, ACM (2013), 2223--2232.","paperID":"None"},{"content":"Rümelin, S., Rukzio, E., and Hardy, R. Naviradar: A novel tactile information display for pedestrian navigation. In Proc. UIST'11, ACM (2011), 293--302.","paperID":"None"},{"content":"Seager, W., and Fraser, D. S. Comparing physical, automatic and manual map rotation for pedestrian navigation. In Proc. CHI'07, ACM (2007), 767--776.","paperID":"None"},{"content":"Takeuchi, Y. Gilded gait: Reshaping the urban experience with augmented footsteps. In Proc. UIST '10, ACM (2010), 185--188.","paperID":"None"},{"content":"Tamaki, E., Miyaki, T., and Rekimoto, J. PossessedHand: A hand gesture manipulation system using electrical stimuli. In Proc. AH'10 (2010), 2:1--2:5.","paperID":"None"},{"content":"Tsukada, K., and Yasumura, M. Activebelt: Belt-type wearable tactile display for directional navigation. In Proc. UbiComp'04. Springer, 2004, 384--399.","paperID":"None"},{"content":"Zhang, D., Guan, T. H., Widjaja, F., and Ang, W. T. Functional electrical stimulation in rehabilitation engineering: A survey. In Proc. iCREATe'07, ACM (2007), 221--226.","paperID":"None"}],"citation":[{"content":"Richard Byrne , Joe Marshall , Florian Floyd Mueller, Designing the Vertigo Experience: Vertigo as a Design Resource for Digital Bodily Play, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2839465"},{"content":"Verena Schnitzler , Ioannis Giannopoulos , Christoph Hölscher , Iva Barisic, The interplay of pedestrian navigation, wayfinding devices, and environmental features in indoor settings, Proceedings of the Ninth Biennial ACM Symposium on Eye Tracking Research & Applications, March 14-17, 2016, Charleston, South Carolina","paperID":"2857533"}],"abstract":"Pedestrian navigation systems require users to perceive, interpret, and react to navigation information. This can tax cognition as navigation information competes with information from the real world. We propose actuated navigation, a new kind of pedestrian navigation in which the user does not need to attend to the navigation task at all. An actuation signal is directly sent to the human motor system to influence walking direction. To achieve this goal we stimulate the sartorius muscle using electrical muscle stimulation. The rotation occurs during the swing phase of the leg and can easily be counteracted. The user therefore stays in control. We discuss the properties of actuated navigation and present a lab study on identifying basic parameters of the technique as well as an outdoor study in a park. The results show that our approach changes a user's walking direction by about 16°/m on average and that the system can successfully steer users in a park with crowded areas, distractions, obstacles, and uneven ground.","title":"Cruise Control for Pedestrians: Controlling Walking Direction using Electrical Muscle Stimulation","filename":"CHI15/p2505","authors":["Max Pfeiffer","Tim Dünte","Stefan Schneegass","Florian Alt","Michael Rohs"],"conference":"CHI '15"}