{"paperId":2702231,"reference":[{"content":"Antle, A.N., Bevans, A., Tanenbaum, J., Seaborn, K. & Wang, S. Futura: design for collaborative learning and game play on a multi-touch digital tabletop. In Proc. TEI '11, pp. 93--100, 2010.","paperID":"None"},{"content":"Benton, D. P. Intergenerational interaction in museums. New York: Columbia University Teachers College. Ed. D. dissertation, 1979.","paperID":"None"},{"content":"Bitgood, S., Kitazawa, C., Cavender, A. & Nettles, K.A. Study of Social Influence. Poster presented at the 1993 Visitor Studies Conference, Albuquerque, NM, 1977.","paperID":"None"},{"content":"Block, F. Wigdor, D. Phillips, B. C., Horn, M.S. & Shen, C. FlowBlocks: a multi-touch UI for crowd interaction. In Proc. UIST '12, pp. 497--508, 2012.","paperID":"None"},{"content":"Block, F., Horn, M.S. Phillips, B.C., Diamond, J., Evans, E.M., Chia Shen. The DeepTree Exhibit: Visualizing the Tree of Life to Facilitate Informal Learning. In TVCG 18(12), pp. 2789--2798, 2012.","paperID":"None"},{"content":"Borun, M., Chambers, M. B., Dritsas, J. & Johnson, J. I. Enhancing Family Learning Through Exhibits. In Curator 40(4), pp. 279--295, 2010.","paperID":"None"},{"content":"Buisine, S. Besacier, G., Aoussat, A. & Vernier, F. How do interactive tabletop systems influence collaboration? In Computers in Human Behavior, 28(1), 2012.","paperID":"None"},{"content":"Cone, C., & Kendall, K. Space, time and family interaction: Visitor behavior at the Science Museum of Minnesota. In Curator, 21, 345--258, 1978.","paperID":"None"},{"content":"Crowley, K., Callanan, M. A., Lipson, J. L., Galco, J., Topping, K. & Shrager, J. Shared scientific thinking in everyday parent-child activity. In Science Education 85(6), pp. 712--732, 2001.","paperID":"None"},{"content":"Diamond, J. The behavior of family groups in science museums. In Curator, 29(20), pp. 139--154, 1986.","paperID":"None"},{"content":"Diamond, J., Smith, A. & Bond, A. California Academy of Sciences discovery room. Curator 31, 157--166, 1988.","paperID":"None"},{"content":"Falk, J. H., & Dierking, L. D. Learning from museums: Visitor experiences and the making of meaning. Altamira Press, 2000.","paperID":"None"},{"content":"Fleck, R., Rogers, Y., Yuill, N., Marshall, P., Carr, A., Rick, J. & Bonnett, V. Actions speak loudly with words: unpacking collaboration around the table. In Proc ITS'09, pp. 189--196, 2009.","paperID":"None"},{"content":"Hinrichs, U., & Carpendale, S. Gestures in the wild: studying multi-touch gesture sequences on interactive tabletop exhibits. In Proc. CHI'11, 3023--3032, 2011.","paperID":"None"},{"content":"Horn, M., Leong, Z., Block, F., Diamond J., Evans, E.M., Phillips, B. & Shen C. BATs and APEs: Designing an interactive tabletop game for natural history museums. In Proc. CHI'12, 2059--2068, 2012.","paperID":"None"},{"content":"Hornecker, E., \"I don't understand it either, but it is cool - visitor interactions with a multi-touch table in a museum,\" In Proc. ITS'08, pp.113--120, 1--3 Oct. 2008.","paperID":"None"},{"content":"Humphrey, T. and Gutwill, J. Fostering active prolonged engagement: The art of creating APE exhibits. Exploratorium (2005).","paperID":"None"},{"content":"Jacucci, G., Morrison, A., Richard, G.T., Kleimola, J., Peltonen, P., Parisi, L. & Laitinen, T. Worlds of information: designing for engagement at a public multitouch display. In Proc. CHI'10, pp. 2267--2276, 2010.","paperID":"None"},{"content":"Kendon, A. The F-Formation System: SpatialOrientational Relations in Face to Face Interaction. In Man Environment Systems(6), pp. 291--296, 1976.","paperID":"None"},{"content":"Koran, J., Koran, M. & Longino, S. The relationship of age, sex attention, and holding power with two types of science exhibits. In Curator, 29(3), pp. 227--224, 1986.","paperID":"None"},{"content":"Kremer, K. & Mullins, G. Children's gender behavior at science museum exhibits. Curator, 35(1), 39--48, 1992.","paperID":"None"},{"content":"Leinhardt, G., Crowley, K., & Knutson, K. (Eds.). Learning conversations in museums. 2002.","paperID":"None"},{"content":"Leinhardt, G., & Crowley, K. Museum learning as conversational elaboration: a proposal to capture, code, and analyze talk in museums. Museum Learning Collaborative, 1998. http://museumlearning. org/paperresearch. html (accessed March 1, 2007).","paperID":"None"},{"content":"Lyons, L. et al. Synergistic Scaffolding of Technologically-enhanced STEM Learning in Informal Institutions. In Proc. ICLS'14 Vol. 3, 1456--1465, 2014.","paperID":"None"},{"content":"Ma, J., Liao, I., Ma, K., Frazier, J. Living Liquid: Design and evaluation of an exploratory visualization tool for museum visitors. In TVCG 18(12), pp. 27992808, 2012.","paperID":"None"},{"content":"McManus, P. It's the company you keep? The social determination of learning-related behavior in a science museum. In International Journal of Museum Management and Curatorhip, 53, pp. 32--50, 1987.","paperID":"None"},{"content":"Marshall, P., Morris, R., Rogers, Y., Kreitmayer, S. & Davies, M. 2011. Rethinking 'multi-user': an in-the-wild study of how groups approach a walk-up-and-use tabletop interface. In CHI'11, pp. 3033--3042, 2011.","paperID":"None"},{"content":"Marshall, P., Rogers, Y. & Pantidi, N. Using Fformations to analyse spatial patterns of interaction in physical environments. In CSCW'11, 445--454, 2011.","paperID":"None"},{"content":"Olson, I.C., Leong, Z.A., Wilensky, U. & Horn, M.S. It's just a toolbar!: using tangibles to help children manage conflict around a multi-touch tabletop. In Proc. TEI'11, pp. 29--36, 2010.","paperID":"None"},{"content":"Peltonen, P., Kurvinen, E., Salovaara, A., Jacucci, G., Ilmonen, T., Evans, J, Oulasvirta, A. & Saarikko, P. It's Mine, Don't Touch!: interactions at a large multi-touch display in a city centre. In CHI'08, 1285--1294, 2008.","paperID":"None"},{"content":"Rick, J., Marshall, P., & Yuill, N. Beyond one-size-fitsall: how interactive tabletops support collaborative learning. In Proc. IDC'11, pp. 109--117, 2011.","paperID":"None"},{"content":"Rosenfeld, S. & Turkel, A. A naturalistic study of visitors at an interactive mini-zoo. Curator, 25(3), 187212, 1982.","paperID":"None"},{"content":"Ryall, K., Forlines, C., Shen, C. & Morris, M.R. Exploring the effects of group size and table size on interactions with tabletop shared-display groupware. In Proc. CSCW'04, pp. 284--293, 2004.","paperID":"None"},{"content":"Setti, F., Russell, C., Bassetti, C. and Cristani, M. Fformation Detection: Individuating Free-standing Conversational Groups in Images. Preprint on arXiv.org, http://arxiv.org/pdf/1409.2702.pdf, 2014.","paperID":"None"},{"content":"Shaer, O., Strait, M, Valdes, C., Feng, T., Lintz, M. & Wang, H. Enhancing genomic learning through tabletop interaction. In Proc. CHI'11, pp. 2817--2826, 2011.","paperID":"None"},{"content":"Tang, A., Tory, M., Po, B., Neumann, P. & Carpendale, S. Collaborative coupling over tabletop displays. In Proc. CHI'06, pp. 1181--1190, 2006.","paperID":"None"},{"content":"Tse, E., Shen, C., Greenberg, S., Forlines, C. How Pairs Interact Over a Multimodal Digital Table. In CHI'07.","paperID":"None"}],"citation":[{"content":"Sarah D'Angelo , D. Harmon Pollock , Michael Horn, Fishing with friends: using tabletop games to raise environmental awareness in aquariums, Proceedings of the 14th International Conference on Interaction Design and Children, p.29-38, June 21-24, 2015, Boston, Massachusetts","paperID":"2771843"}],"abstract":"Interactive surfaces are increasingly common in museums and other informal learning environments where they are seen as a medium for promoting social engagement. However, despite their increasing prevalence, we know very little about factors that contribute to collaboration and learning around interactive surfaces. In this paper we present analyses of visitor engagement around several multi-touch tabletop science exhibits. Observations of 629 visitors were collected through two widely used techniques: video study and shadowing. We make four contributions: 1) we present an algorithm for identifying groups within a dynamic flow of visitors through an exhibit hall; 2) we present measures of group-level engagement along with methods for statistically analyzing these measures; 3) we assess the effect of observational techniques on visitors' engagement, demonstrating that consented video studies do not necessarily reflect visitor behavior in more naturalistic circumstances; and 4) we present an analysis showing that groups of two, groups with both children and adults, and groups that take turns spend longer at the exhibits and engage more with scientific concepts.","title":"Fluid Grouping: Quantifying Group Engagement around Interactive Tabletop Exhibits in the Wild","filename":"CHI15/p867","authors":["Florian Block","James Hammerman","Michael Horn","Amy Spiegel","Jonathan Christiansen","Brenda Phillips","Judy Diamond","E. Margaret Evans","Chia Shen"],"conference":"CHI '15"}