{"paperId":2702291,"citation":[{"content":"Tom Feltwell , Jamie Mahoney , Shaun Lawson, \"Aye, have a dream #IndyRef\": use of instagram during the scottish referendum, Proceedings of the 2015 British HCI Conference, July 13-17, 2015, Lincoln, Lincolnshire, United Kingdom","paperID":"2783604"}],"abstract":"This paper presents an empirical investigation of how people appropriated Twitter for socio-political talk in response to a television (TV) portrayal of people supported by state welfare and benefits. Our findings reveal how online discussion during, and in-between, TV broadcasts was characterised by distinctly different qualities, topics and user behaviours. These findings offer design opportunities for social media services to (i) support more balanced real-time commentaries of politically-charged media, (ii) actively promote discussion to continue after, and between, programming; and (iii) incorporate different motivations and attitudes towards socio-political concerns, as well as different practices of communicating those concerns. We contribute to the developing HCI literature on how social media intersects with political and civic engagement and specifically highlight the ways in which Twitter interacts with other forms of media as a site of everyday socio-political talk and debate.","reference":[{"content":"Ampofo, L., Anstead, N., O'Loughlin, B. Trust, confidence & confidentiality: Citizen responses on twitter to opinion polls during the 2010 UK general election. Information, comm & soc, 14 (2011), 850--871.","paperID":"None"},{"content":"Anstead, N., and O'Loughlin, B. The emerging viewertariat and BBC Question Time: The International Journal of Press/Politics, 16 (2011), 1--23.","paperID":"None"},{"content":"Björgvinsson, E., Ehn, P., and Hillgren, P. A. Agonistic participatory design: working with marginalised social movements. CoDesign, 8 (2012), 127--144.","paperID":"None"},{"content":"Blumler, J. G., & Coleman, S. (2001). Realising democracy online: A civic commons in cyberspace (Vol. 2). London: IPPR.","paperID":"None"},{"content":"Bourdieu, P. (1999) On Television. London: New Press.","paperID":"None"},{"content":"Braun, V. & Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology. 3 (2006), 77--101.","paperID":"None"},{"content":"Crivellaro, C., Comber, R., Bowers, J., et al. A pool of dreams: Facebook, politics and the emergence of a social movement. Proc. CHI '14, ACM, 3573--3582.","paperID":"None"},{"content":"Dahlberg, L. The Internet and democratic discourse: Exploring the prospects of online deliberative forums extending the public sphere. Information, Communication & Society, 4(2001), 615--633.","paperID":"None"},{"content":"DiSalvo, C. Adversarial design. MIT Press, 2013.","paperID":"None"},{"content":"Disalvo, C., Nourbakhsh, I., Holstius, D., et al. The neighborhood networks project: a case study of critical engagement and creative expression through participatory design. Proc. PDC '08, ACM, 41--50.","paperID":"None"},{"content":"Doughty, M., Rowland, D., and Lawson, S. Co-viewing live TV with digital backchannel streams. In Proc. EuroITV '11, ACM, 141--144.","paperID":"None"},{"content":"Doughty, M., Rowland, D., Lawson, S. Who is on your sofa? TV audience communities and second screening social networks. Proc. EuroITV '12, ACM, 79--86.","paperID":"None"},{"content":"Doughty, M., Lawson, S., Linehan, C., et al. Disinhibited abuse of othered communities by secondscreening audiences. Proc. TVX '14, ACM, 164--171.","paperID":"None"},{"content":"Dunne, A., and Raby, F. Hertzian Tales. RCA Press, London, UK, 2005.","paperID":"None"},{"content":"Ekman, J., and Amnå, E. Political participation and civic engagement: Towards a new typology. Human affairs, 22 (2012), 283--300.","paperID":"None"},{"content":"Elster, J. (Ed.). (1998). Deliberative democracy Cambridge University Press.","paperID":"None"},{"content":"Foth, M., Parra Agudelo, L., Palleis, R. Digital soapboxes: towards an interaction design agenda for situated civic innovation. Proc. UbiComp '13, 725--728.","paperID":"None"},{"content":"Freelon, D., Travis, K., Morgan, J., Bennett, W., and Borning, A. Facilitating Encounters with Political Difference: Engaging Voters with the Living Voters Guide. Proc. JITP '11, paper 5.","paperID":"None"},{"content":"Fuchs, C. Social media: A critical introduction. 2013.","paperID":"None"},{"content":"Gold, T. After Benefits Street, it's another round of poverty porn -- with added celebrity. The Guardian, London, 2014: http://tinyurl.com/neoza7q","paperID":"None"},{"content":"Graham, T and Wright S. Analysing 'SuperParticipation' in Online Third Spaces in: Cantijoch, M., Gibson, R. & S. Ward (eds.) Palgrave Macmillan, 2014.","paperID":"None"},{"content":"Graham, T. Everyday Political Talk in the InternetBased Public Sphere. To be published in: Stephen Coleman and Deen Freelon (Eds). Handbook of Digital Politics. Cheltenham, UK: Edward Elgar (forthcoming).","paperID":"None"},{"content":"Habermas, J. The structural transformation of the public sphere. MIT Press, 1991.","paperID":"None"},{"content":"Halpern, D., and Gibbs J. Social media as a catalyst for online deliberation? Exploring the affordances of Facebook and YouTube for political expression. Computers in Human Behavior, 29 (2013), 1159--1168.","paperID":"None"},{"content":"Hjarvard, S. (2013). The mediatization of culture and society. Routledge.","paperID":"None"},{"content":"Howard, P.N., Duffy, A., Freelon, D., Hussain, M., Mari, W. & Mazaid, M. Opening Closed Regimes: What Was the Role of Social Media During the Arab Spring?. 2011. Seattle: PIPTI.","paperID":"None"},{"content":"Jackson, D., Scullion, R., & Molesworth, M. (2013). 15 'Ooh, politics. You're brave'. Politics in everyday talk. The Media, Political Participation and Empowerment.","paperID":"None"},{"content":"Janssen, D., and Kies, R. Online forums and deliberative democracy. Acta política, 40. 2005. 317--335.","paperID":"None"},{"content":"Jensen, T. Welfare Commonsense, Poverty Porn and Doxosophy. Sociological Research Online, 19(2014), 3.","paperID":"None"},{"content":"Jones, O. Chavs: The demonization of the working class. Verso Books, London, 2012.","paperID":"None"},{"content":"Lotan, G., Graeff, E., Ananny, M., et al. The Arab Spring| the revolutions were tweeted: Information flows during the 2011 Tunisian and Egyptian revolutions. International Journal of Communication, 5, 2011 31.","paperID":"None"},{"content":"Massung, E., Coyle, D., Cater, K., et al. Using crowdsourcing to support pro-environmental community activism. Proc. CHI '13, ACM, 371--380.","paperID":"None"},{"content":"Munson, S.A., Lee, S.Y. and, Resnick. P. Encouraging Reading of Diverse Political Viewpoints with a Browser Widget. Proc ICWSM '13. AAAI.","paperID":"None"},{"content":"Mooney, G. Stigmatising poverty? The 'Broken Society' and reflections on anti-welfarism in the UK today. Oxfam, London, 2011.","paperID":"None"},{"content":"Nandakumar, A., and Murray, J. Companion apps for long arc TV series: supporting new viewers in complex storyworlds with tightly synchronized context-sensitive annotations. Proc of TVX 2014, ACM, 3--10.","paperID":"None"},{"content":"Nielsen. The follow back: understanding the two way causal influence between Twitter activity and TV viewship. http://tinyurl.com/ps59dmk","paperID":"None"},{"content":"Papacharissi, Z. (2002). The virtual sphere The internet as a public sphere. New media & society, 4(1), 9--27.","paperID":"None"},{"content":"Pariser, E. The filter bubble: What the Internet is hiding from you. Penguin, London, 2011.","paperID":"None"},{"content":"Schirra, S., Sun, H., and Bentley, F. Together alone: Motivations for live-tweeting a television series. In Proc. CHI '14, ACM Press, 2441--2450.","paperID":"None"},{"content":"Semaan, B. C., Robertson, S. P., Douglas, S., & Maruyama, M. Social media supporting political deliberation across multiple public spheres: towards depolarization. Proc CSCW 14. 1409--1421. ACM Press.","paperID":"None"},{"content":"Seymour, D. Reporting poverty in the UK. Joseph Rowntree Foundation, London, 2009.","paperID":"None"},{"content":"Shamma, D., Kennedy, L., & Churchill, E. Tweetgeist: Can the twitter timeline reveal the structure of broadcast events. CSCW Horizons. 2010.","paperID":"None"},{"content":"Shirky, C. Political Power of Social Media-Technology, the Public Sphere, and Political Change, The. Foreign Aff., 90, 28. 2011.","paperID":"None"},{"content":"Suler, J. The Online Disinhibition Effect. CyberPsychology & Behavior, 7 (2004), 321--326.","paperID":"None"},{"content":"Twitter. The Search API. Available at https://dev.twitter.com/rest/public/search","paperID":"None"},{"content":"Tumasjan, A., Sprenger, T. O., et al. Predicting Elections with Twitter: What 140 Characters Reveal about Political Sentiment. Proc of ICWSM '10, 178--185.","paperID":"None"},{"content":"Wulf, V., Aal, K., Ktesh, I.A., et al. Fighting against the wall: social media use by political activists in a Palestinian village. Proc. CHI '13, ACM, 1979--1988.","paperID":"None"}],"title":"Debating Poverty Porn on Twitter: Social Media as a Place for Everyday Socio-Political Talk","filename":"CHI15/p3177","authors":["Phil Brooker","John Vines","Selina Sutton","Julie Barnett","Tom Feltwell","Shaun Lawson"],"conference":"CHI '15"}