{"paperId":2702523,"abstract":"Researchers have been studying personal information management (PIM) for many years, but little exists by way of practical advice for how individuals should manage their own information. We employed the Delphi Method to engage PIM researchers with expertise in a variety of relevant areas in a five-round extended dialog about PIM practices. Participants identified key everyday choices of PIM, suggested alternatives, and identified pros and cons of each alternative. Our contributions include: 1) a set of 36 PIM practices, along with pros, cons, and recommendations for or against each practice, 2) directions of future research and development including \"near-future\" improvements in tool support and 3) a detailed description of how we applied the Delphi Method to study PIM and how it might be used more widely in HCI research as a complement to more established methods of inquiry.","citation":[{"content":"Leslie Thomson , Mohammad Hossein Jarrahi, Information practices in the broader 'deportment' of mobile knowledge work, Proceedings of the 78th ASIS&T Annual Meeting: Information Science with Impact: Research in and for the Community, p.1-10, November 06-10, 2015, St. Louis, Missouri","paperID":"2857127"}],"reference":[{"content":"Barreau, D. and Nardi, B.A. Finding and reminding: file organization from the desktop. SIGCHI Bull. 27, 3 (1995), 39--43.","paperID":"None"},{"content":"Bellotti, V., Dalal, B., Good, N., Flynn, P., Bobrow, D.G., and Ducheneaut, N. What a to-do: Studies of task management towards the design of a personal task list manager. Proc. CHI 2004, 735--742.","paperID":"None"},{"content":"Bellotti, V., Ducheneaut, N., Howard, M., and Smith, I. Taking email to task: The design and evaluation of a task management centered email tool. Proc. CHI 2003, 345--352.","paperID":"None"},{"content":"Bergman, O., Beyth-Marom, R., and Nachmias, R. The project fragmentation problem in personal information management. Proc. CHI 2006, 271--274.","paperID":"None"},{"content":"Bergman, O., Beyth-Marom, R., Nachmias, R., Gradovitch, N., and Whittaker, S. Improved search engines and navigation preference in personal information management. ACM Trans. Inf. Syst. 26, 4 (2008), 1--24.","paperID":"None"},{"content":"Bergman, O., Gradovitch, N., Bar-Ilan, J., and BeythMarom, R. Folder versus tag preference in personal information management. J. Am. Soc. Inf. Sci. Technol. 64, 10 (2013), 1995--2012.","paperID":"None"},{"content":"Bergman, O., Tucker, S., Beyth-Marom, R., Cutrell, E., and Whittaker, S. It's not that important: Demoting personal information of low subjective importance using GrayArea. Proc. CHI 2009, 269--278.","paperID":"None"},{"content":"Bergman, O., Whittaker, S., Sanderson, M., Nachmias, R., and Ramamoorthy, A. The effect of folder structure on personal file navigation. J. Am. Soc. Inf. Sci. Technol. 61, 12 (2010), 2426--2441.","paperID":"None"},{"content":"Bergman, O., Whittaker, S., Sanderson, M., Nachmias, R., and Ramamoorthy, A. How do we find personal files? The effect of OS, presentation and depth on file navigation. Proc. CHI 2012, 2977--2980.","paperID":"None"},{"content":"Boardman, R. and Sasse, M.A. Stuff goes into the computer and doesn't come out: A cross-tool study of personal information management. Proc. CHI 2004, 583--590.","paperID":"None"},{"content":"Bruce, H., Jones, W., and Dumais, S. Information behavior that keeps found things found. Information Research 10, 1 (2004).","paperID":"None"},{"content":"Civan, A., Jones, W., Klasnja, P., and Bruce, H. Better to organize personal information by folders or by Tags? The devil is in the details. Proc. ASIST 2008.","paperID":"None"},{"content":"Dalkey, N. and Helmer, O. An experimental application of the Delphi method to the use of experts. Management Science 9, 3 (1963), 458--467.","paperID":"None"},{"content":"Jones, W. Finders, keepers' The present and future perfect in support of personal information management. First Monday 9, 3 (2004).","paperID":"None"},{"content":"Jones, W., Hou, D., Sethanandha, B.D., Bi, S., and Gemmell, J. Planz to put our digital information in its place. Proc. CHI 2010 Extended Abstract, 2803--2812.","paperID":"None"},{"content":"Jones, W. and Teevan, J. Personal Information Management. Univ.Washington Press, Seattle, WA, 2007.","paperID":"None"},{"content":"Jones, W., Wenning, A., and Bruce, H. How do people re-find files, emails and web pages? Proc. iConference 2014.","paperID":"None"},{"content":"Kwasnik, B.H. How a personal document's intended use or purpose affects its classification in an office. Proc. SIGIR 1989, 207--210.","paperID":"None"},{"content":"Lansdale, M. The psychology of personal information management. Appl. Ergon. 19, 1 (1988), 55--66.","paperID":"None"},{"content":"Linstone, H.A. and Turoff, M. The Delphi method: Techniques and applications. Addison-Wesley Reading, MA, 1975.","paperID":"None"},{"content":"Linstone, H.A. and Turoff, M. Delphi: A brief look backward and forward. Technological Forecasting and Social Change 78, 9 (2011), 1712--1719.","paperID":"None"},{"content":"Mankoff, J., Rode, J.A., and Faste, H. Looking past yesterday's tomorrow: Using futures studies methods to extend the research horizon. Proc. CHI 2013, 1629--1638.","paperID":"None"},{"content":"Rowe, G. and Wright, G. The Delphi technique as a forecasting tool: Issues and analysis. Int. J. Forecasting 15, 4 (1999), 353--375.","paperID":"None"},{"content":"Teevan, J., Alvarado, C., Ackerman, M.S., and Karger, D.R. The perfect search engine is not enough: A study of orienteering behavior in directed search. Proc. CHI 2004, 415--422.","paperID":"None"},{"content":"Teevan, J., Liebling, D.J., and Lasecki, W.S. Selfsourcing personal tasks. Proc. CHI 2014 Extended Abstract, 2527--2532.","paperID":"None"},{"content":"Turoff, M. Delphi and its potential impact on information systems. Proc. Fall Joint Computer Conference (AFIPS 1971), 317--326.","paperID":"None"},{"content":"Whittaker, S., Matthews, T., Cerruti, J., Badenes, H., and Tang, J. Am I wasting my time organizing email? A study of email refinding. Proc. CHI 2011, 3449--3458.","paperID":"None"},{"content":"Whittaker, S. and Sidner, C. Email overload: Exploring personal information management of email. Proc. CHI 1996. 276--283.","paperID":"None"},{"content":"Woudenberg, F. An evaluation of Delphi. Technological Forecasting and Social Change 40, 2 (1991), 131--150.approximately equal length. Remove these two lines from your final version.","paperID":"None"}],"title":"\"For Telling\" the Present: Using the Delphi Method to Understand Personal Information Management Practices","filename":"CHI15/p3513","authors":["William Jones","Robert Capra","Anne Diekema","Jaime Teevan","Manuel Pérez-Quiñones","Jesse David Dinneen","Bradley Hemminger"],"conference":"CHI '15"}