{"paperId":2702288,"abstract":"We explored how emotional cues presented in visual and haptic modalities interact. We constructed an affective haptic dataset, and used the emotional visual stimuli from the International Affective Picture System (IAPS). Participants were asked to rate the visual stimuli, haptic stimuli and visualhaptic stimuli. Analysis of the results indicates that the presence of haptic stimulus affects the arousal of the visual stimulus, but does not affect the valence significantly. We further explored this interaction in terms of the intensity, frequency, waveform and rhythm of the haptic stimuli. We then provide a set of guidelines on visual-haptic interaction that could be used in design of multimodal affective feedback.","citation":[{"content":"Felecia Davis, The Textility of Emotion: A Study Relating Computational Textile Textural Expression to Emotion, Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition, June 22-25, 2015, Glasgow, United Kingdom","paperID":"2757231"}],"reference":[{"content":"Bertelson, P., and Radeau, M. Cross-modal bias and perceptual fusion with auditory-visual spatial discordance. Perception & psychophysics 29, 6 (1981), 578--584.","paperID":"None"},{"content":"Timothy W. Bickmore , Rukmal Fernando , Lazlo Ring , Daniel Schulman, Empathic Touch by Relational Agents, IEEE Transactions on Affective Computing, v.1 n.1, p.60-71, January 2010","paperID":"1920248"},{"content":"Bonnet, D., Ammi, M., and Martin, J.-C. Improvement of the recognition of facial expressions with haptic feedback. In Haptic Audio Visual Environments and Games (HAVE), 2011 IEEE International Workshop on, IEEE (2011), 81--87.","paperID":"None"},{"content":"Botvinick, M., and Cohen, J. Rubber hands feel touch that eyes see. Nature 391, 6669 (1998), 756--756.","paperID":"None"},{"content":"Bradley, M. M., and Lang, P. J. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of behavior therapy and experimental psychiatry 25, 1 (1994), 49--59.","paperID":"None"},{"content":"Stephen A. Brewster , Lorna M. Brown, Non-visual information display using tactons, CHI '04 Extended Abstracts on Human Factors in Computing Systems, April 24-29, 2004, Vienna, Austria","paperID":"985936"},{"content":"Jennifer L. Burke , Matthew S. Prewett , Ashley A. Gray , Liuquin Yang , Frederick R. B. Stilson , Michael D. Coovert , Linda R. Elliot , Elizabeth Redden, Comparing the effects of visual-auditory and visual-tactile feedback on user performance: a meta-analysis, Proceedings of the 8th international conference on Multimodal interfaces, November 02-04, 2006, Banff, Alberta, Canada","paperID":"1181017"},{"content":"Collignon, O., Girard, S., Gosselin, F., Roy, S., Saint-Amour, D., Lassonde, M., and Lepore, F. Audio-visual integration of emotion expression. Brain research 1242 (2008), 126--135.","paperID":"None"},{"content":"De Gelder, B., and Bertelson, P. Multisensory integration, perception and ecological validity. Trends in cognitive sciences 7, 10 (2003), 460--467.","paperID":"None"},{"content":"De Gelder, B., and Vroomen, J. The perception of emotions by ear and by eye. Cognition & Emotion 14, 3 (2000), 289--311.","paperID":"None"},{"content":"Delplanque, S., Ndiaye, K., Scherer, K., and Grandjean, D. Spatial frequencies or emotional effects?: A systematic measure of spatial frequencies for iaps pictures by a discrete wavelet analysis. Journal of neuroscience methods 165, 1 (2007), 144--150.","paperID":"None"},{"content":"Diez, D. M., Barr, C. D., and Cetinkaya-Rundel, M. OpenIntro statistics. CreateSpace, 2012.","paperID":"None"},{"content":"Sidney D'mello , Art Graesser, AutoTutor and affective autotutor: Learning by talking with cognitively and emotionally intelligent computers that talk back, ACM Transactions on Interactive Intelligent Systems (TiiS), v.2 n.4, p.1-39, December 2012","paperID":"2395128"},{"content":"Rana el Kaliouby , Matthew S. Goodwin, iSET: interactive social-emotional toolkit for autism spectrum disorder, Proceedings of the 7th international conference on Interaction design and children, June 11-13, 2008, Chicago, Illinois","paperID":"1463723"},{"content":"Ernst, M. O., and Banks, M. S. Humans integrate visual and haptic information in a statistically optimal fashion. Nature 415, 6870 (2002), 429--433.","paperID":"None"},{"content":"Geldard, F. A. Some neglected possibilities of communication. Science (1960).","paperID":"None"},{"content":"Eve Hoggan , Stephen Brewster, New parameters for tacton design, CHI '07 Extended Abstracts on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, CA, USA","paperID":"1241017"},{"content":"Eve Hoggan , Stephen A. Brewster , Jody Johnston, Investigating the effectiveness of tactile feedback for mobile touchscreens, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357300"},{"content":"Eve E. Hoggan , Stephen A. Brewster, Crossmodal icons for information display, CHI '06 Extended Abstracts on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1125619"},{"content":"Jousmöaki, V., and Hari, R. Parchment-skin illusion: sound-biased touch. Current Biology 8, 6 (1998), R190--R191.","paperID":"None"},{"content":"Lang, P. J., Bradley, M. M., and Cuthbert, B. N. International affective picture system (iaps): Affective ratings of pictures and instruction manual. Technical Report A-8, University of Florida (2008).","paperID":"None"},{"content":"Jana Machajdik , Allan Hanbury, Affective image classification using features inspired by psychology and art theory, Proceedings of the international conference on Multimedia, October 25-29, 2010, Firenze, Italy","paperID":"1873965"},{"content":"Pavani, F., Spence, C., and Driver, J. Visual capture of touch: Out-of-the-body experiences with rubber gloves. Psychological Science 11, 5 (2000), 353--359.","paperID":"None"},{"content":"Leah M. Reeves , Jennifer Lai , James A. Larson , Sharon Oviatt , T. S. Balaji , Stéphanie Buisine , Penny Collings , Phil Cohen , Ben Kraal , Jean-Claude Martin , Michael McTear , TV Raman , Kay M. Stanney , Hui Su , Qian Ying Wang, Guidelines for multimodal user interface design, Communications of the ACM, v.47 n.1, January 2004","paperID":"962106"},{"content":"Russell, J. A. A circumplex model of affect. Journal of personality and social psychology 39, 6 (1980), 1161.","paperID":"None"},{"content":"Seifi, H., and MacLean, K. E. A first look at individuals' affective ratings of vibrations. In World Haptics Conference (WHC), 2013, IEEE (2013), 605--610.","paperID":"None"},{"content":"Sherrick, C. E. A scale for rate of tactual vibration. The Journal of the Acoustical Society of America 78, 1 (1985), 78--83.","paperID":"None"},{"content":"David Ternes , Karon E. Maclean, Designing Large Sets of Haptic Icons with Rhythm, Proceedings of the 6th international conference on Haptics: Perception, Devices and Scenarios, June 10-13, 2008, Madrid, Spain","paperID":"1423799"},{"content":"Jacob O. Wobbrock , Leah Findlater , Darren Gergle , James J. Higgins, The aligned rank transform for nonparametric factorial analyses using only anova procedures, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1978963"}],"title":"Towards Multimodal Affective Feedback: Interaction between Visual and Haptic Modalities","filename":"CHI15/p2043","authors":["Akshita","Harini Alagarai Sampath","Bipin Indurkhya","Eunhwa Lee","Yudong Bae"],"conference":"CHI '15"}