{"paperId":2702286,"abstract":"In this paper we report on some experiments with a high fidelity media space, t-Room, an immersive system that presents full scale, real-time images of co-participants. The system has been enhanced to provide more flexibility in the ways participants could organise themselves and the materials they are working on. Drawing on some quasi-naturalistic experiments, where the participants were required to undertake a range of complex tasks, we consider the formations they adopt and the issues and problems that arise when they attempt to establish and preserve a common focus and alignment. We conclude by briefly discussing the consequences for developing advanced spaces to support collaborative work and understanding complex video-mediated interaction.","reference":[{"content":"Anstis, S.M., Mayhew, J. W & T. Morley, The Perception of Where a Face or Television 'Portrait' Is Looking, Am Jour of Psychology, 82, 4 (1969), 474--489","paperID":"None"},{"content":"Bjorn P. Co-constructing Globally Collaborative Spaces: A Conceptual Study of War Rooms, Lecture Notes in Business Info Processing 86, (2011), 16--28.","paperID":"None"},{"content":"Garfinkel, H. A Conception of and Experiments with Trust as a Condition of Stable Concerted Actions In Motivation and Social Interaction. Ronald Press, 1963.","paperID":"None"},{"content":"Gaver, W.W., et al. Realizing a video environment: EuroPARC's RAVE system. in Proc CHI 92. Monterey, CA: (1992), 27--35.","paperID":"None"},{"content":"Goodwin, C. Conversational Organisation. Academic Press: New York and London. 1981.","paperID":"None"},{"content":"Gergle, D., Clark, A., See What I'm Saying? Using Dyadic Mobile Eye Tracking to Study Collaborative Reference, CSCW 2011, pp. 435--444.","paperID":"None"},{"content":"Heath, C. Hindmarsh, J. & Luff, P. Video in Qualitative Research. Sage, London. 2010.","paperID":"None"},{"content":"Heath, C., & Luff, P. Disembodied Conduct: Communication Through Video in a Multi-Media Environment, in Proc of CHI '91, 99--103.","paperID":"None"},{"content":"Heath, C & Luff, P. Technology in Action. Cambridge University Press. 2000.","paperID":"None"},{"content":"Heath, C., Luff, P., Kuzuoka, H., & Yamazaki, K. Creating Coherent Environments for Collaboration, in Proc of ECSCW 2001, Kluwer, 119--128.","paperID":"None"},{"content":"Hindmarsh, J., Fraser, M., Heath, C. & Benford, S.. Object-Focused Interaction in Collaborative Virtual Environments. ToCHI, 7, (2000) 477--509.","paperID":"None"},{"content":"Hirata, K. et al. Video Communication System Supporting Spatial Cues of Mobile Users. In Proceedings of CollabTech 2008, IPSJ, 84--97.","paperID":"None"},{"content":"Ishii, H. & Kobayashi, M. ClearBoard: a seamless medium for shared drawing and conversation with eye contact. Proc. of CHI'92, ACM Press, 525--532.","paperID":"None"},{"content":"Kendon, A. Conducting Interaction. Cambridge University Press. Cambridge. 1990.","paperID":"None"},{"content":"Kunert, A. Kulik, A., Beck, S. & B. Froehlich. Photoportals: shared references in space and time. In Proc of CSCW 2014., 1388--1399.","paperID":"None"},{"content":"Kuzuoka, H., Yamashita, J., Yamazaki, K. & Yamazaki, A. Agora: A Remote Collaboration System that Enables Mutual Monitoring, Ext. Abstr. of CHI 1999, 190--191.","paperID":"None"},{"content":"Luff, P., Heath, C., Kuzuoka, H., Yamazaki, K. & Yamashita, J.. Handling Documents and Discriminating Objects in Hybrid Spaces In Proc of the CHI 2006 Montreal, 561--570.","paperID":"None"},{"content":"Luff, P., Yamashita, N., Kuzuoka, H & Heath, C, Hands on Hitchcock: embodied reference to a moving scene, In Proc. CHI 2011, 43--52","paperID":"None"},{"content":"Mark G. Extreme Collaboration. Communications of the ACM, Volume 45 Issue 6, (June 2002), Pages 89--93","paperID":"None"},{"content":"Minatani, S., Kitahara, I, Kameda, Y. & Ohta, Y. Faceto-Face Tabletop Remote Collaboration in Mixed Reality. Proc. of ISMAR'07, (2007), IEEE Comp. Soc., 43--46.","paperID":"None"},{"content":"Nguyen, D. & Canny, J. MultiView: Spatially Faithful Group Video Conferencing. Proc of CHI 2005.","paperID":"None"},{"content":"O'Hara, K., Kjeldskov, J. & Paay, J., Blended Interaction Spaces for Distributed Team Collaboration. ToCHI, 18, 3--3. 2011","paperID":"None"},{"content":"Salvadori, F. Waiting to talk: Coordinating openings in open plan offices. 4th Intl Conf on Conversation Analysis, UCLA CA. Jun 25--29, 2014.","paperID":"None"},{"content":"Tang, A., Pahud, M., Inkpen, K., Benko, H., Tang, J. C., & Buxton, B., Three's Company: Understanding Communication Channels in Three-way Distributed Collaboration. Proc of CSCW 2010, 271--280.","paperID":"None"},{"content":"Tang, J. & Minneman, S. VideoDraw: a video interface for collaborative drawing. ACM Transactions on Information Systems 9, 2 (1991), 453--469.","paperID":"None"},{"content":"Wong, N. & Gutwin, C. Support for deictic pointing in CVEs: still fragmented after all these years'. Proc of CSCW 2014, 1377--1387.","paperID":"None"}],"citation":[{"content":"Mankyung Lee , Joohee Kim , Kwangjae Lee , Jundong Cho, CIRCLE ROUND: Flexible Communication using Multiple Access at Face-to-Face Meeting, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2874326"},{"content":"Mohamad H. Salimian, Exploring group awareness in a mixed reality collaborative environment, Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers, September 07-11, 2015, Osaka, Japan","paperID":"2801654"}],"title":"Flexible Ecologies And Incongruent Locations","filename":"CHI15/p877","authors":["Paul K. Luff","Naomi Yamashita","Hideaki Kuzuoka","Christian Heath"],"conference":"CHI '15"}