{"paperId":2702427,"citation":[{"content":"Michael J. Paul , Ryen W. White , Eric Horvitz, Diagnoses, Decisions, and Outcomes: Web Search as Decision Support for Cancer, Proceedings of the 24th International Conference on World Wide Web, May 18-22, 2015, Florence, Italy","paperID":"2741662"}],"reference":[{"content":"Allen, K. Parents online. Pew research center's internet & American life project, 2002. http://www.pewinternet.org/2002/11/17/parents-online/.","paperID":"None"},{"content":"American Congress of Obstetricians and Gynecologists. Group B streptococcus and pregnancy. 2011. http://www.acog.org/Patients/FAQs/Group-B-Streptococcusand-Pregnancy.","paperID":"None"},{"content":"Amy, F. First trimester fatigue. University of Rochester medical center: health encyclopedia, 2014. http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=134&ContentID=4.","paperID":"None"},{"content":"Bennett, P.N., White, R.W., Chu, W., et al. Modeling the impact of short- and long-term behavior on search personalization. In Proc. SIGIR '12, ACM (2012), 185--194.","paperID":"None"},{"content":"Bernhardt, J.M. and Felter, E.M. Online pediatric information seeking among mothers of young children: results from a qualitative study using focus groups. Journal of Medical Internet Research 6, 1 (2004).","paperID":"None"},{"content":"Butler, S.A., Khanlian, S.A., and Cole, L.A. Detection of early pregnancy forms of human chorionic gonadotropin by home pregnancy test devices. Clinical Chemistry 47, 12 (2001), 2131--2136.","paperID":"None"},{"content":"Choi, H. and Varian, H. Predicting the present with google trends. Economic Record 88, s1, (2012), 2--9.","paperID":"None"},{"content":"Cooper, P.C., Mallon, P.K., Leadbetter, S., et al. Cancer internet search activity on a major search engine, USA 2001--2003. J Med Internet Res 7, 3 (2005), e36.","paperID":"None"},{"content":"De Choudhury, M., Counts, S., and Horvitz, E. Predicting postpartum changes in emotion and behavior via social media. In Proc. CHI '13, ACM (2013), 3267--3276.","paperID":"None"},{"content":"De Choudhury, M., Counts, S., Horvitz, E.J., and Hoff, A. Characterizing and predicting postpartum depression from shared Facebook data. In Proc. CSCW '14, ACM (2014), 626--638.","paperID":"None"},{"content":"De Choudhury, M., Morris, M.R., and White, R.W. Seeking and sharing health information online: comparing search engines and social media. In Proc. CHI '14, ACM (2014), 1365--1376.","paperID":"None"},{"content":"Duhigg, C. How companies learn your secrets. The New York Times, 2012. http://www.nytimes.com/2012/02/19/magazine/shopping-habits.html.","paperID":"None"},{"content":"Gibson, L. and Hanson, V.L. Digital motherhood: how does technology help new mothers? In Proc. CHI '13, ACM (2013), 313--322.","paperID":"None"},{"content":"Ginsberg, J., Mohebbi, M.H., Patel, R.S., Brammer, L., Smolinski, M.S., and Brilliant, L. Detecting influenza epidemics using search engine query data. Nature 457, (2009), 1012--1014.","paperID":"None"},{"content":"Levene, M.I., Tudehope, D.I., and Thearle, M.J. Definitions and terminology. In Essentials of Neonatal Medicine. Wiley, 2000, 9.","paperID":"None"},{"content":"Martin, J.A., Hamilton, B.E., Osterman, M.J., Curtin, S.C., and Mathews, T. Births: final data for 2012. National Vital Statistics Report 62, 9 (2013), 1--87.","paperID":"None"},{"content":"Morris, M.R. Social networking site use by mothers of young children. In Proc. CSCW '14, ACM (2014), 1272--1282.","paperID":"None"},{"content":"Nicolaides, K.H., Azar, G., Byrne, D., Mansur, C., and Marks, K. Fetal nuchal translucency: ultrasound screening for chromosomal defects in first trimester of pregnancy. BMJ: British Medical Journal 304, 6831 (1992), 867--869.","paperID":"None"},{"content":"Oshiro, B.T., Henry, E., Wilson, J., Branch, D.W., and Varner, M.W. Decreasing elective deliveries before 39 weeks of gestation in an integrated health care system: Obstetrics & Gynecology 113, 4 (2009), 804--811.","paperID":"None"},{"content":"Richardson, M. Learning about the world through longterm query logs. ACM Trans. Web 2, 4 (2008).","paperID":"None"},{"content":"Rost, J., Johnsmeyer, B., and Mooney, A. Diapers to diplomas: what's on the minds of new parents. Think with Google, 2014. http://www.thinkwithgoogle.com/articles/newparents.html.","paperID":"None"},{"content":"Rousseeuw, P.J. and Leroy, A.M. Other techniques for simple regression. In Robust Regression and Outlier Detection. John Wiley & Sons, 2003, 67--78.","paperID":"None"},{"content":"Russell, S. and Norvig, P. Choosing attribute tests. In Artificial Intelligence a Modern Approach. Prentice Hall, 2003, 660.","paperID":"None"},{"content":"Sacks, D.A., Greenspoon, J.S., Abu-Fadil, S., Henry, H.M., Wolde-Tsadik, G., and Yao, J.F.F. Toward universal criteria for gestational diabetes: The 75-gram glucose tolerance test in pregnancy. American Journal of Obstetrics and Gynecology 172, 2, Part 1 (1995), 607--614.","paperID":"None"},{"content":"Salomon, L.J., Alfirevic, Z., Berghella, V., et al. Practice guidelines for performance of the routine mid-trimester fetal ultrasound scan. Ultrasound in Obstetrics & Gynecology 37, 1 (2011), 116--126.","paperID":"None"},{"content":"Shokouhi, M., and Radinsky, K. Time-sensitive query autocompletion. In Proc. SIGIR '12, ACM (2012), 601--610.","paperID":"None"},{"content":"Spink, A., Yang, Y., Jansen, J., et al. A study of medical and health queries to web search engines. Health Information & Libraries Journal 21, 1 (2004), 44--51.","paperID":"None"},{"content":"Stephens-davidowitz, S. What do pregnant women want? The New York Times, 2014. http://www.nytimes.com/2014/05/18/opinion/sunday/what-do-pregnantwomen-want.html.","paperID":"None"},{"content":"Teevan, J., Dumais, S.T., and Horvitz, E. Personalizing search via automated analysis of interests and activities. In Proc. SIGIR '05, ACM (2005), 449--456.","paperID":"None"},{"content":"Tiran, D. Complementary therapies: your questions answered. Use of pineapple for induction of labour. Pract Midwife 12, 9 (2009), 33--4.","paperID":"None"},{"content":"West, R., White, R.W., and Horvitz, E. From cookies to cooks: insights on dietary patterns via analysis of web usage logs. In Proc. WWW '13 (2013), 1399--1410.","paperID":"None"},{"content":"White, R.W., Harpaz, R., Shah, N.H., DuMouchel, W., and Horvitz, E. Toward enhanced pharmacovigilance using patient-generated data on the Internet. Clinical Pharmacology & Therapeutics 96, 2 (2014), 239--246.","paperID":"None"},{"content":"White, R.W., Tatonetti, N.P., Shah, N.H., Altman, R.B., and Horvitz, E. Web-scale pharmacovigilance: listening to signals from the crowd. Journal of the American Medical Informatics Association, 20, 3 (2013), 404--408.","paperID":"None"},{"content":"Google's top health searches for 2012: cancer, pregnancy symptoms and ... hemorrhoid? MedCity news. http://medcitynews.com/2012/12/googles-top-healthsearches-for-2012-cancer-pregnancy-symptoms-and-hemorrhoid/.","paperID":"None"},{"content":"Pregnant again: What to expect this time around. BabyCenter. http://www.babycenter.com/0_pregnant-again-whatto-expect-this-time-around_10305185.bc","paperID":"None"}],"abstract":"We study time-dependent patterns of information seeking about pregnancy, birth, and the first several weeks of caring for newborns via analyses of queries drawn from anonymized search engine logs. We show how we can detect and align web search behavior for a population of searchers with the natural clock of gestational physiology via proxies for ground truth based on searchers' self-report queries (e.g., [I am 30 weeks pregnant and my baby is moving a lot]). Then, we present a methodology for performing additional alignments, that are valuable for learning about the concerns, curiosities, and needs that arise over time with pregnancy and early parenting. Our findings have implications for learning about the temporal dynamics of pregnancy-related interests and concerns, and also for the design of systems that tailor their responses to point estimates of each searcher's current stage in pregnancy.","title":"Exploring Time-Dependent Concerns about Pregnancy and Childbirth from Search Logs","filename":"CHI15/p737","authors":["Adam Fourney","Ryen W. White","Eric Horvitz"],"conference":"CHI '15"}