{"paperId":2702441,"abstract":"Open source software (OSS) projects are often seen as participatory and egalitarian settings where people collaboratively develop software to serve their needs as well as the needs of others. In this paper, however, we argue that power and politics also characterize OSS development, and that this has serious implications for OSS usability. The existing Human-Computer Interaction (HCI) research on OSS usability has already shown that power and politics play a role; this study offers a theoretical treatment of the matter. A theoretical framework on power and empowerment is utilized in analyzing empirical data on OSS usability as well as the existing body of knowledge on the topic. With the help of this framework, HCI research can address the aspects of power and empowerment in OSS usability in a more systematic and comprehensive manner.","citation":[],"reference":[{"content":"Mark Aberdour, Achieving Quality in Open Source Software, IEEE Software, v.24 n.1, p.58-64, January 2007","paperID":"1262594"},{"content":"Andreasen, M., Nielsen, H., Schrøder, S. and Stage, J. Usability in Open Source Software Development: Opinions and Practice. Information Technology and Control 25, 3A (2006), 303--312.","paperID":"None"},{"content":"Arlene F. Aucella, Ensuring success with usability engineering, interactions, v.4 n.3, p.19-22, May/June 1997","paperID":"255395"},{"content":"Bach, P. M and Carroll, J. M. Characterizing the Dynamics of Open User Experience Design: The Cases of Firefox and OpenOffice.org. JAIS 11, 12 (2010).","paperID":"None"},{"content":"Paula M. Bach , Robert DeLine , John M. Carroll, Designers wanted: participation and the user experience in open source software development, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518852"},{"content":"Paula M. Bach , Michael Twidale, Social participation in open source: what it means for designers, interactions, v.17 n.3, May + June 2010","paperID":"1744177"},{"content":"Beck, E. P for Political. Participation is not enough. Scandinavian Journal of Information Systems 14, 1 (2002), 77--92.","paperID":"None"},{"content":"Calum Benson , Matthias Muller-Prove , Jiri Mzourek, Professional usability in open source projects: GNOME, OpenOffice.org, NetBeans, CHI '04 Extended Abstracts on Human Factors in Computing Systems, April 24-29, 2004, Vienna, Austria","paperID":"985991"},{"content":"Tom Butler , Brian Fitzgerald, A case study of user participation in the information systems development process, Proceedings of the eighteenth international conference on Information systems, p.411-426, December 14-17, 1997, Atlanta, Georgia, USA","paperID":"353200"},{"content":"Mads Bødker , Lene Nielsen , Rikke N. Orngreen, Enabling user centered design processes in open source communities, Proceedings of the 2nd international conference on Usability and internationalization, July 22-27, 2007, Beijing, China","paperID":"1769824"},{"content":"Di Tullio, D. and Staples, D.S. The Governance and Control of Open Source Software Projects. Journal of Management Information Systems 30, 3 (2013), 49--80.","paperID":"None"},{"content":"Joseph Feller , Brian Fitzgerald, A framework analysis of the open source software development paradigm, Proceedings of the twenty first international conference on Information systems, p.58-69, December 2000, Brisbane, Queensland, Australia","paperID":"359723"},{"content":"Brian Fitzgerald, The transformation of open source software, MIS Quarterly, v.30 n.3, p.587-598, September 2006","paperID":"2017298"},{"content":"Gallivan, M. J. Striking a balance between trust and control in a virtual organization: a content analysis of open source software case studies. Information Systems Journal 11, 4 (2001), 277--304.","paperID":"None"},{"content":"Jan Gulliksen , Inger Boivie , Bengt Göransson, Usability professionals-current practices and future development, Interacting with Computers, v.18 n.4, p.568-600, July, 2006","paperID":"1221391"},{"content":"Hardy, C. and Leiba-O'Sullivan, S. The power behind empowerment: Implications for research and practice. Human Relations 51, 4 (1998), 451--483.","paperID":"None"},{"content":"Pekka Himanen , Manuel Castells , Linus Torvalds, The  Hacker Ethic and the Spirit of the Information Age, Random House Inc., New York, NY, 2001","paperID":"558235"},{"content":"Alan R. Hevner , Salvatore T. March , Jinsoo Park , Sudha Ram, Design science in information systems research, MIS Quarterly, v.28 n.1, p.75-105, March 2004","paperID":"2017217"},{"content":"Howcroft, D. and Wilson, M. Paradoxes of participatory practices: the Janus role of the systems developer. Information and Organization 13, 1 (2003), 1--24.","paperID":"None"},{"content":"Iivari, N. Discourses on \"culture\" and \"usability work\" in software product development. Acta Universitatis Ouluensis, Series A, Scientiae rerum nat. 457, (2006).","paperID":"None"},{"content":"Heli Ikonen , Netta Iivari , Henrik Hedberg, Controlling the use of collaboration tools in open source software development, Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, October 16-20, 2010, Reykjavik, Iceland","paperID":"1868944"},{"content":"Krishnamurthy, S. Cave or community?: An empirical examination of 100 mature open source projects. First Monday (2002).","paperID":"None"},{"content":"de Laat, P. Governance of open source software: state of the art. Journal of Management & Governance 11, 2 (2007), 165--177.","paperID":"None"},{"content":"J. Ljungberg, Open source movements as a model for organising, European Journal of Information Systems, v.9 n.4, p.208-216, Dec. 1, 2000","paperID":"372716"},{"content":"Salvatore T. March , Gerald F. Smith, Design and natural science research on information technology, Decision Support Systems, v.15 n.4, p.251-266, December, 1995","paperID":"1700867"},{"content":"Deborah J. Mayhew, Business: Strategic development of the usability engineering function, interactions, v.6 n.5, p.27-34, Sept.-Oct. 1999","paperID":"312706"},{"content":"Audris Mockus , Roy T. Fielding , James Herbsleb, A case study of open source software development: the Apache server, Proceedings of the 22nd international conference on Software engineering, p.263-272, June 04-11, 2000, Limerick, Ireland","paperID":"337209"},{"content":"Moghaddam, R., Twidale, M. and Bongen, K. Open source interface politics: identity, acceptance, trust, and lobbying. Extended Abstracts of the CHI2011 (2011)","paperID":"None"},{"content":"Nichols, D. and Twidale, M. The Usability of Open Source Software. First Monday 8, 1, (2003).","paperID":"None"},{"content":"Rajanen, M. Different approaches to Usability Cost-Benefit Analysis. Proc. ECITE 2006 (2006).","paperID":"None"},{"content":"Rajanen, M. Applying Usability Cost-Benefit Analysis -- Explorations in Commercial and Open Source Software Development Contexts. Acta Universitatis Ouluensis, Ser. A, Scient. rerum nat. 587 (2011).","paperID":"None"},{"content":"Rajanen, M., Iivari, N. and Anttila K. Introducing Usability Activities into Open Source Software Development Projects -- Searching for a Suitable Approach. Journal of Information Technology Theory and Application 12, 4 (2011), 5--26.","paperID":"None"},{"content":"Mikko Rajanen , Netta Iivari , Eino Keskitalo, Introducing usability activities into open source software development projects: a participative approach, Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, October 14-17, 2012, Copenhagen, Denmark","paperID":"2399120"},{"content":"Eric S. Raymond , Tim O'Reilly, The  Cathedral and the Bazaar, O'Reilly & Associates, Inc., Sebastopol, CA, 1999","paperID":"580808"},{"content":"Robbins, J. Adopting open source software engineering (OSSE) practices by adopting OSSE Tools. In Feller et al. (2005), 245--264.","paperID":"None"},{"content":"Rolandsson, B., Bergquist, M. and Ljungberg, J. Open source programmer's strategies to cope with ideological tensions. Proc. OLKC 2009 (2009).","paperID":"None"},{"content":"Stephanie Rosenbaum , Janice Anne Rohn , Judee Humburg, A toolkit for strategic usability: results from workshops, panels, and surveys, Proceedings of the SIGCHI conference on Human Factors in Computing Systems, p.337-344, April 01-06, 2000, The Hague, The Netherlands","paperID":"332454"},{"content":"Michael Terry , Matthew Kay , Ben Lafreniere, Perceptions and practices of usability in the free/open source software (FoSS) community, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753476"},{"content":"von Hippel, E. Innovation by User Communities: Learning from Open-Source Software. MIT Sloan Management Review 42, 4 (2001), 82--86.","paperID":"None"},{"content":"Eric von Hippel , Georg von Krogh, Open Source Software and the \"Private-Collective\" Innovation Model: Issues for Organization Science, Organization Science, v.14 n.2, p.209-223, March 2003","paperID":"970585"},{"content":"Von Krogh, G., Spaeth, S., & Lakhani, K. R. Community, joining, and specialization in open source software innovation: a case study. Research Policy, 32,7 (2003), 1217--1241.","paperID":"None"}],"title":"Power, Empowerment and Open Source Usability","filename":"CHI15/p3413","authors":["Mikko Rajanen","Netta Iivari"],"conference":"CHI '15"}