{"paperId":2702281,"citation":[],"reference":[{"content":"Arase, Y., Xie, X., Duan, M., Hara, T., & Nishio, S. (2009). A game based approach to assign geographical relevance to web images. Proc. WWW'09. ACM. 811--820.","paperID":"None"},{"content":"Benford, S., Anastasi, R., Flintham, M., Drozd, A., Crabtree, A., Greenhalgh, C., Tandavanitj, N., Adams, M., & Row-Farr, J. (2003). Coping with uncertainty in a location-based game. IEEE pervasive computing, 2(3), 34--41","paperID":"None"},{"content":"Bodenhamer, D. J., Corrigan, J., and Harris, T. M., eds. (2010) Spatial Humanities : GIS and the Future of Humanities Scholarship. Indiana University Press.","paperID":"None"},{"content":"Brown, B., & Perry, M. (2002). Of maps and guidebooks: designing geographical technologies. Proc. DIS'02. ACM. 246--254","paperID":"None"},{"content":"Chalmers, M., & Galani, A. (2004). Seamful interweaving: heterogeneity in the theory and design of interactive systems. Proc. DIS'04. ACM. 243--252","paperID":"None"},{"content":"De Certeau, M. (1984) The Practice of Everyday Life, tr. by S. Rendall, Berkeley California: University of California Press. 117","paperID":"None"},{"content":"Dourish, P. (2006). Re-space-ing place: place and space ten years on. In Proc. CSCW'06. ACM. 299--308","paperID":"None"},{"content":"Erickson, I. (2010). Documentary with ephemeral media: Curation practices in online social spaces. Bulletin. Science Technology & Society, 30(6), 387--397","paperID":"None"},{"content":"Gaver, W., Beaver, J. & Benford, S. (2003). Ambiguity as a resource for design. Proc. CHI'03. ACM, 233--240","paperID":"None"},{"content":"Geonames, http://www.geonames.org/","paperID":"None"},{"content":"Google Places, https://developers.google.com/places/","paperID":"None"},{"content":"http://www.theguardian.com/profile/halley-docherty"},{"content":"Harrison, S., & Dourish, P. (1996). Re-place-ing space: the roles of place and space in collaborative systems. Proc. CSCW'96. ACM. 67--76","paperID":"None"},{"content":"Harrison, S., & Tatar, D. (2008). Places: people, events, loci-the relation of semantic frames in the construction of place. J. of CSCW, 17(2--3), 97--133","paperID":"None"},{"content":"History Pin: https://www.historypin.org/projects/","paperID":"None"},{"content":"Ingold, T. (2009). Against space: Place, movement, knowledge. In. Boundless worlds: An anthropological approach to movement, 29--43","paperID":"None"},{"content":"Lopatovska, I., Bierlein, I., Lember, H., & Meyer, E. (2013). Exploring requirements for online art collections. Proceedings of the American Society for Information Science and Technology, 50(1), 1--4","paperID":"None"},{"content":"Neustaedter, C., Tang, A., & Tejinder, J. K. (2010). The role of community and groupware in geocache creation and maintenance. Proc. CHI'10, ACM. 1757--1766","paperID":"None"},{"content":"O'Hara, K. (2008). Understanding geocaching practices and motivations. Proc. CHI'08. ACM. 1177--1186","paperID":"None"},{"content":"Phillips, L. B. (2013). The temple and the bazaar: Wikipedia as a platform for open authority in museums. Curator: The Museum Journal, 56(2), 219--235","paperID":"None"},{"content":"Quercia, D., O'Hare, N. K., & Cramer, H. (2014). Aesthetic capital: what makes London look beautiful, quiet, and happy?. Proc. CSCW'14. ACM. 945--955","paperID":"None"},{"content":"Schaefer, M., Tatar, D., Harrison, S., (2010) Can CSCW Technologies Help Us Re-construct Places?, Proc. CSCW'10. ACM. 567--576","paperID":"None"},{"content":"Sengers, P., & Gaver, B. (2006). Staying open to interpretation: engaging multiple meanings in design and evaluation. Proc. DIS'06. ACM. 99--108","paperID":"None"},{"content":"Trant, J., & the participants in the steve.museum project. (2006). Exploring the potential for social tagging and folksonomy in art museums: Proof of concept. New Review of Hypermedia and Multimedia, 12(1), 83--105","paperID":"None"}],"abstract":"Creating and utilizing simple links between items and locations in map-based systems has become a mainstream component of modern computing. In this paper, we explore support for \"art mapping\", an activity that requires consideration of more complex interpretations of spatial relationships as users engage with identifying locations of relevance to artworks. Through a user study of the ArtMaps platform, and an exploratory study with professional artists, we identify diverse interpretations of spatial meaning in relation to art. We find that art mapping highlights potential for more active engagement with art through technology, but challenges existing systems for spatial representation. Through connecting our findings with work on designing for interpretation, and on space and place in HCI, we contribute new understanding of creating engagement through the spatial interpretation of art, and define potential characteristics and uses of holistic \"footprints\" for artworks.","title":"ArtMaps: Interpreting the Spatial Footprints of Artworks","filename":"CHI15/p407","authors":["Tim Coughlan","Laura Carletti","Gabriella Giannachi","Steve Benford","Derek McAuley","Dominic Price","Cristina Locatelli","Rebecca Sinker","John Stack"],"conference":"CHI '15"}