{"paperId":2702193,"citation":[],"reference":[{"content":"Ball, C. Moral foundations for a discourse on same-sex marriage. Geogetown Law Journal 85 (1996), 1871.","paperID":"None"},{"content":"Berry, F., and Berry, W. State lottery adoptions as policy innovations. American Political Science Review (1990), 395--415.","paperID":"None"},{"content":"Bollen, J., Mao, H., and Pepe, A. Modeling public mood and emotion: Twitter sentiment and socio-economic phenomena. Proc. ICWSM (2011).","paperID":"None"},{"content":"Carney, D., Jost, J., Gosling, S., and Potter, J. The secret lives of liberals and conservatives. Political Psychology 29, 6 (2008), 807--840.","paperID":"None"},{"content":"Clifford, S., and Jerit, J. How words do the work of politics. The Journal of Politics 75, 03 (2013), 659--671.","paperID":"None"},{"content":"Cohen, R., and Ruths, D. Classifying political orientation on Twitter: It's not easy! Proc. ICWSM (2013).","paperID":"None"},{"content":"Conover, M., Ratkiewicz, J., Francisco, M., Gonçalves, B., Menczer, F., and Flammini, A. Political polarization on Twitter. Proc. ICWSM (2011).","paperID":"None"},{"content":"De Choudhury, M., Counts, S., and Horvitz, E. Major life changes and behavioral markers in social media: case of childbirth. Proc. CSCW (2013).","paperID":"None"},{"content":"Diakopoulos, N., Zhang, A., Elgesem, D., and Salway, A. Identifying and analyzing moral evaluation frames in climate change blog discourse. Proc. ICWSM (2014).","paperID":"None"},{"content":"Gallup. The State of the States, 2014 (accessed on August 30, 2014). http: //www.gallup.com/poll/125066/State-States.aspx.","paperID":"None"},{"content":"Gayo-Avello, D. A meta-analysis of state-of-the-art electoral prediction from Twitter data. Social Science Computer Review (2013).","paperID":"None"},{"content":"Geer, J. From tea leaves to opinion polls. Columbia University Press, 1996.","paperID":"None"},{"content":"Gerbaudo, P. Tweets and the streets: Social media and contemporary activism. Pluto Press, 2012.","paperID":"None"},{"content":"Gilens, M. Affluence and influence. Princeton University Press, 2012.","paperID":"None"},{"content":"Gottipati, S., Qiu, M., Yang, L., Zhu, F., and Jiang, J. Predicting users political party using ideological stances. In Social Informatics. Springer, 2013, 177--191.","paperID":"None"},{"content":"Graells-Garrido, E., Lalmas, M., and Quercia, D. People of opposing views can share common interests. Proc. WWW Companion (2014).","paperID":"None"},{"content":"Graham, J., Haidt, J., and Nosek, B. A. Liberals and conservatives rely on different sets of moral foundations. Journal of Personality and Social Psychology 96, 5 (2009), 1029.","paperID":"None"},{"content":"Grossback, L., Nicholson-Crotty, S., and Peterson, D. Ideology and learning in policy diffusion. American Politics Research 32, 5 (2004), 521--545.","paperID":"None"},{"content":"Hecht, B., and Stephens, M. A tale of cities: Urban biases in volunteered geographic information. Proc. ICWSM (2014).","paperID":"None"},{"content":"Jost, J., Nosek, B., and Gosling, S. Ideology: Its resurgence in social, personality, and political psychology. Perspectives on Psychological Science 3, 2 (2008), 126--136.","paperID":"None"},{"content":"Laver, M., Benoit, K., and Garry, J. Extracting policy positions from political texts using words as data. American Political Science Review 97, 02 (2003), 311--331.","paperID":"None"},{"content":"Lax, J., and Phillips, J. Gay rights in the states. American Political Science Review 103, 03 (2009), 367--386.","paperID":"None"},{"content":"Levitt, S. How do senators vote? Disentangling the role of voter preferences, party affiliation, and senator ideology. The American Economic Review (1996), 425--441.","paperID":"None"},{"content":"Liao, Q., and Fu, W. Beyond the filter bubble. Proc. CHI (2013).","paperID":"None"},{"content":"Lin, Y., Bagrow, J., and Lazer, D. More voices than ever? Quantifying media bias in networks. Proc. ICWSM (2011).","paperID":"None"},{"content":"McGuire, K., and Stimson, J. The least dangerous branch revisited: New evidence on supreme court responsiveness to public preferences. Journal of Politics 66, 4 (2004), 1018--1035.","paperID":"None"},{"content":"Munson, S., and Resnick, P. Presenting diverse political opinions: how and how much. Proc. CHI (2010).","paperID":"None"},{"content":"Naaman, M., Zhang, A., Brody, S., and Lotan, G. On the study of diurnal urban routines on Twitter. Proc. ICWSM (2012).","paperID":"None"},{"content":"O'Connor, B., Balasubramanyan, R., Routledge, B., and Smith, N. From tweets to polls. Proc. ICWSM (2010).","paperID":"None"},{"content":"Pennebaker, J., Chung, C., Ireland, M., Gonzales, A., and Booth, R. The development and psychometric properties of LIWC2007. LIWC.net (2007).","paperID":"None"},{"content":"Sim, Y., Acree, B., Gross, J., and Smith, N. Measuring ideological proportions in political speeches. Proc. EMNLP (2013).","paperID":"None"},{"content":"Tumasjan, A., Sprenger, T., Sandner, P., and Welpe, I. Predicting elections with Twitter. Proc. ICWSM (2010).","paperID":"None"},{"content":"Yarkoni, T. Personality in 100,000 words: A large-scale analysis of personality and word use among bloggers. Journal of Research in Personality 44, 3 (2010), 363--373.","paperID":"None"},{"content":"Zhou, D., Resnick, P., and Mei, Q. Classifying the political leaning of news articles and users from user votes. Proc. ICWSM (2011).","paperID":"None"}],"abstract":"Social media has emerged as a prominent platform where people can express their feelings about social and political issues of our time. We study the many voices discussing an issue within a constituency and how they reflect ideology and may signal the outcome of important policy decisions. Focusing on the issue of same-sex marriage legalization, we examine almost 2 million public Twitter posts related to same-sex marriage in the U.S. states over the course of 4 years starting from 2011. Among other findings, we find evidence of moral culture wars between ideologies and show that constituencies that express higher levels of emotion and have fewer actively engaged participants often precede legalization efforts that fail. From our measures, we build statistical models to predict the outcome of potential policy changes, with our best model achieving 87% accuracy. We also achieve accuracies of 70%, comparable to public opinion surveys, many months before a policy decision. We discuss how these analyses can augment traditional political science techniques as well as assist activists and policy analysts in understanding discussions on important issues at a population scale.","title":"Modeling Ideology and Predicting Policy Change with Social Media: Case of Same-Sex Marriage","filename":"CHI15/p2603","authors":["Amy X. Zhang","Scott Counts"],"conference":"CHI '15"}