{"paperId":2702348,"citation":[],"reference":[{"content":"Adamski, A. and Westrum, R. 2003. Requisite Imagination: The Fine Art of Anticipating What Might go Wrong. Handbook of cognitive task design. LEA","paperID":"None"},{"content":"Comfort, L.K., Boin, A., and Demchak, C.C. 2011. Designing Resilience: Preparing for Extreme Events. University of Pittsburgh Press, Pittsburgh, PA","paperID":"None"},{"content":"De Haan, J., Kwakkel, J.H., Walker, W.E., Spirco, J., and Thissen, W.A.H. 2011. Framing flexibility!: Theorising and data mining to develop a useful definition of flexibility and related concepts. Futures 43","paperID":"None"},{"content":"Hollnagel, E., Woods, D., and Leveson, N. 2006 Resilience Engineering: Concepts and Precepts. Ashgate","paperID":"None"},{"content":"Mörel, G., Amalberti, R., and Chauvin, C. 2008. Articulating the differences between safety and resilience: the decision-making process of professional sea-fishing skippers. Human Factors 50, 1, 1--16.","paperID":"None"},{"content":"Wears, R.L. and Morrison, J.B. 2013. Levels of Resilience!: Moving from Resilience to Resilience Engineering. Proceedings of the 5th Resilience Engineering Symposium, Soesterberg, The Netherlands","paperID":"None"},{"content":"Wong, J., Eakin, J., Migram, P., Cafazzo, J. a, Halifax, N.V.D., and Chan, C.T. 2009. Patients' experiences with learning a complex medical device for the selfadministration of nocturnal home hemodialysis. Nephrology Nursing Journal 36, 1, 27--32.","paperID":"None"}],"abstract":"Resilience, the ability to bounce back or manage sufficiently despite ongoing adversity, has received considerable interest from several domains over the last two decades. A concept that is easily and widely applicable, it has evolved a variety of nuanced interpretations. Recent work in the systems theory and resilience engineering domains has moved towards some sharper definitions. This paper discusses and develops these definitions, and by contrasting with robustness, applies them as an approach for HCI evaluation. Ethnographic data from a hospital training environment is used to examine how patients learn to operate home haemodialysis devices, and how patients' safety is managed and maintained. This paper concludes that to improve recovery of adverse situations within the home, there is a necessity for design to support the acquirement of resilient reaction as a skill, in hand with temporal management. These ideas are developed in conjunction with the consideration of how technology can support, or nudge, the expression of resilient behaviours.","title":"Resilience Ex Machina: Learning a Complex Medical Device for Haemodialysis Self-Treatment","filename":"CHI15/p4147","authors":["Paul James Noble"],"conference":"CHI '15"}