{"paperId":2702515,"reference":[{"content":"Altavilla, A., Caramiaux, B., and Tanaka, A. Towards Gestural Sonic Affordances. Proc. NIME'13, (2013), 61--64.","paperID":"None"},{"content":"Augoyard, J.-F. and Torgue, H. Sonic Experience: A Guide To Everyday Sounds. McGill-Queen's Press - MQUP, 2006.","paperID":"None"},{"content":"Avanzini, F., De Götzen, A., Spagnol, S., and Rodá, A. Integrating auditory feedback in motor rehabilitation systems. Proc. International Conference on Multimodal Interfaces for Skills Transfer (SKILLS), (2009), 53--58.","paperID":"None"},{"content":"Beaudouin-Lafon, M. Instrumental interaction: an interaction model for designing post-WIMP user interfaces. Proc. CHI, (2000), 446--453.","paperID":"None"},{"content":"Beaudouin-Lafon, M. Designing interaction, not interfaces. Proc. Working Conference on Advanced Visual Interfaces AVI, (2004), 15--22.","paperID":"None"},{"content":"Burns, C., Dishman, E., Johnson, B., and Verplank, B. \"Informance\": Min(d)ing future contexts for scenario-based interaction design. Presented at BayCHI. 1995.","paperID":"None"},{"content":"Caramiaux, B., Bevilacqua, F., Bianco, T., Schnell, N., Houix, O., and Susini, P. The Role of Sound Source Perception in Gestural Sound Description. ACM Transactions on Applied Perception 11, 1 (2014), 1--19.","paperID":"None"},{"content":"Caramiaux, B., Françoise, J., Bevilacqua, F., and Schnell, N. Mapping Through Listening. Computer Music Journal 38, 3 (2014), 34--48.","paperID":"None"},{"content":"Caramiaux, B. and Tanaka, A. Machine Learning of Musical Gestures. Proc. NIME, (2013), 513--518.","paperID":"None"},{"content":"Dourish, P. Where the action is: the foundations of embodied interaction. The MIT Press, 2001.","paperID":"None"},{"content":"Ekman, I., Rinott, M., and Box, P.O. Using Vocal Sketching for Designing Sonic Interactions. Proc. DIS, (2010), 123--131.","paperID":"None"},{"content":"Flanagan, J.C. The critical incident technique. Psychological bulletin 51, 4 (1954), 327--58.","paperID":"None"},{"content":"Franinović, K., Gaye, L., and Behrendt, F. Exploring Sonic Interaction with Artifacts in Everyday Contexts. Proc. ICAD, (2008), 1--4.","paperID":"None"},{"content":"Franinović, K., Hug, D., and Visell, Y. Sound Embodied: Explorations of sonic interaction design for everyday objects in a workshop setting. Proc. ICAD, (2007), 334--341.","paperID":"None"},{"content":"Franinović, K. and Salter, C. The Experience of Sonic Interaction. In S. Franinović, Karmen, Serafin, ed., Sonic Interaction Design. MIT Press, 2013, 39--75.","paperID":"None"},{"content":"Franinović, K. and Serafin, S. Sonic Interaction Design. Mit Press, 2013.","paperID":"None"},{"content":"Gaver, W. The SonicFinder: An Interface That Uses Auditory Icons. Human-Computer Interaction 4, 1 (1989), 67--94.","paperID":"None"},{"content":"Gaver, W.W. What in the World Do We Hear?: An Ecological Approach to Auditory Event Perception. Ecological Psychology 5, 1 (1993), 1--29.","paperID":"None"},{"content":"Goodman, S. Sonic Warfare: Sound, Affect, and the Ecology of Fear. MIT Press, 2009.","paperID":"None"},{"content":"Hartson, H.R. and Castillo, J.C. Remote evaluation for post-deployment usability improvement. Proc. Working Conference on Advanced Visual Interfaces AVI, (1998), 22--29.","paperID":"None"},{"content":"Henriques, J.F. The Vibrations of Affect and their Propagation on Night Out on Kingston's Dancehall scene. Body Society 16, (2010), 57--89.","paperID":"None"},{"content":"Hermann, T. and Hunt, A. An introduction to interactive sonification. IEEE Multimedia 12, 2005, 20--24.","paperID":"None"},{"content":"Hermann, T. Sonification for Exploratory Data Analysis. University of Bielefeld, 2002.","paperID":"None"},{"content":"Houix, O., Gutierrez, F., Susini, P., and Misdariis, N. Participatory Workshops: Everyday Objects and Sound Metaphors. Proc. CMMR, (2013), 41--53.","paperID":"None"},{"content":"Hug, D. Using a systematic design process to investigate narrative sound design strategies for interactive commodities. Proc. ICAD, (2009), 1--8.","paperID":"None"},{"content":"Kramer, G., Walker, B., and Bargar, R. Sonification report: Status of the field and research agenda. International Community for Auditory Display, (1999).","paperID":"None"},{"content":"Leman, M., Desmet, F., Styns, F., Van Noorden, L., and Moelants, D. Sharing musical expression through embodied listening: A case study based on Chinese Guqin music. Music Perception 26, 3 (2009), 263--278.","paperID":"None"},{"content":"MacKay, W. Using Video to Support Interaction Design. Tutorial CHI, 2002.","paperID":"None"},{"content":"Maes, P.-J., Leman, M., Palmer, C., and Wanderley, M.M. Action-based effects on music perception. Frontiers in psychology 4, 1 (2014).","paperID":"None"},{"content":"Norman, D.A. and Verganti, R. Incremental and Radical Innovation: Design Research versus Technology and Meaning Change. Design Issues 30, 1 (2014), 78--96.","paperID":"None"},{"content":"Pauletto, S., Hug, D., Barrass, S., and Luckhurst, M. Integrating Theatrical Strategies into Sonic Interaction Design. Proc. Audio Mostly, (2009), 1--6.","paperID":"None"},{"content":"Rasamimanana, N., Bevilacqua, F., Bloit, J., et al. The Urban Musical Game: Using Sport Balls As Musical Interfaces. Proc. CHI EA'12, (2012), 1027--1030.","paperID":"None"},{"content":"Roby-Brami, A., Van Zandt-Escobar, A., Jarrassé, N., et al. Toward the use of augmented auditory feedback for the rehabilitation of arm movements in stroke patients. Annals of Physical and Rehabilitation Medicine 57, (2014), e4--e5.","paperID":"None"},{"content":"Rocchesso, D., Polotti, P., and Monache, S.D. Designing continuous sonic interaction. International Journal of Design 3, 3 (2009), 13--25.","paperID":"None"},{"content":"Shneiderman, B. Designing the User Interface: Strategies for Effective Human-Computer Interaction. Reading, MA: Addison-Wesley, 1998.","paperID":"None"},{"content":"Svanaes, D. and Seland, G. Putting the users center stage: Role playing and low-fi prototyping enable end users to design mobile systems. Proc. CHI, (2004), 479--486.","paperID":"None"},{"content":"Tanaka, A., Altavilla, A., and Spowage, N. Gestural Musical Affordances. Proc. SMC, (2012), 318--325.","paperID":"None"},{"content":"Varela, F.J., Thompson, E.T., and Rosch, E. The Embodied Mind: Cognitive Science and Human Experience. MIT press, 1991.","paperID":"None"},{"content":"Zatorre, R.J., Chen, J.L., and Penhune, V.B. When the brain plays music: auditory--motor interactions in music perception and production. Nature Reviews Neuroscience 8, 7 (2007), 547--558.","paperID":"None"}],"citation":[{"content":"Christian Heinrichs , Andrew McPherson, Performance-Led Design of Computationally Generated Audio for Interactive Applications, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2854109"},{"content":"Cumhur Erkut , Stefania Serafin , Michael Hoby , Jonniy Sårde, Product Sound Design: Form, Function, and Experience, Proceedings of the Audio Mostly 2015 on Interaction With Sound, p.1-6, October 07-09, 2015, Thessaloniki, Greece","paperID":"2814920"},{"content":"Davide Rocchesso , Davide A. Mauro , Stefano Delle Monache, miMic: The Microphone as a Pencil, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2839467"},{"content":"Cumhur Erkut , Stefania Serafin, From Ecological Sounding Artifacts Towards Sonic Artifact Ecologies, Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2016, Santa Clara, California, USA","paperID":"2892583"}],"abstract":"Sonic interaction is the continuous relationship between user actions and sound, mediated by some technology. Because interaction with sound may be task oriented or experience-based it is important to understand the nature of action-sound relationships in order to design rich sonic interactions. We propose a participatory approach to sonic interaction design that first considers the affordances of sounds in order to imagine embodied interaction, and based on this, generates interaction models for interaction designers wishing to work with sound. We describe a series of workshops, called Form Follows Sound, where participants ideate imagined sonic interactions, and then realize working interactive sound prototypes. We introduce the Sonic Incident technique, as a way to recall memorable sound experiences. We identified three interaction models for sonic interaction design: conducting; manipulating; substituting. These three interaction models offer interaction designers and developers a framework on which they can build richer sonic interactions.","video":"http://www.youtube.com/embed/yHEB7arGOQs?rel=0","title":"Form Follows Sound: Designing Interactions from Sonic Memories","filename":"CHI15/p3943","authors":["Baptiste Caramiaux","Alessandro Altavilla","Scott G. Pobiner","Atau Tanaka"],"conference":"CHI '15"}