{"paperId":2702514,"abstract":"This note explores the issue of women's participation in Wikipedia through the lens of emotional labor. Using a grounded theory approach, we detail the kinds of tasks women Wikipedians choose to do and explore why they choose the work they do. We also explore the emotional costs of their labor and their strategies for coping. Our analysis of 20 interviews leads us to posit that the gendered and emotional labor required of many women to participate in Wikipedia's production renders it, problematically, a space of conflicting public and private spheres, motivated by antithetical open and closed values. In addition to other contributions, we believe this insight sheds light on some of the complex dynamics behind Wikipedia's observed gender gap.","citation":[{"content":"Noopur Raval , Paul Dourish, Standing Out from the Crowd: Emotional Labor, Body Labor, and Temporal Labor in Ridesharing, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820026"},{"content":"Karin Hansson , Michael Muller , Tanja Aitamurto , Ann Light , Athanasios Mazarakis , Neha Gupta , Thomas Ludwig, Toward a Typology of Participation in Crowdwork, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2855510"}],"reference":[{"content":"Antin, J., Yee, R., Cheshire, C., and Oded, N. (2011). Gender differences in Wikipedia editing. In Proceedings WikiSym 2011, ACM Press (2011), 11--14.","paperID":"None"},{"content":"Bardzell, S. (2010). Feminist HCI: taking stock and outlining an agenda for design. In Proceedings CHI 2010, ACM Press (2010), 1301--1310.","paperID":"None"},{"content":"Bardzell, S and Bardzell, J. (2011). Towards a feminist HCI methodology: social science, feminism, and HCI. In Proceedings CHI 2011, ACM Press (2011), 675--684.","paperID":"None"},{"content":"Charting diversity: Working together toward diversity in Wikipedia. (2014). https://upload.wikimedia.org/wikipedia/commons/5/57/ Charting_Diversity.pdf","paperID":"None"},{"content":"Cohen, N. (2011, January 30). Define gender gap? Look up Wikipedia's contributor list. The New York Times.","paperID":"None"},{"content":"Collier, B., and Bear, J. (2012). Conflict, criticism, or confidence: An empirical examination of the gender gap in Wikipedia contributions. In Proceedings CSCW 2012, ACM Press (2012), 383--392.","paperID":"None"},{"content":"Duggan, M. and Brenner, J. (2013). The demographics of social media users, 2012. Pew Research Center, Washington, D.C.","paperID":"None"},{"content":"Eckert, S. and Steiner, L. (2013). (Re)triggering backlash: Responses to news about Wikipedia's gender gap. Journal of Communication Inquiry, 37: 284.","paperID":"None"},{"content":"Filipacchi, A. (2013, April 30). Sexism on Wikipedia is not the work of 'a single misguided editor'. Atlantic.","paperID":"None"},{"content":"Flöck, F., Vrandečić, D. and Simperl, E. Towards a diversity-minded Wikipedia. In Proc. WebSci '11, ACM Press (2011).","paperID":"None"},{"content":"Gardner, S. (2011). Nine reasons women don't edit Wikipedia. Sue Gardner's blog.","paperID":"None"},{"content":"Glaser, B. (1992). Basics of grounded theory analysis. Mill Valley, CA: Sociology Press.","paperID":"None"},{"content":"Halfaker, A., Geiger, R.S. and Terveen, L.G. (2014). Snuggle: Designing for efficient socialization and ideological critique. In Proceedings CHI 2014, ACM, Press (2014), 311--320.","paperID":"None"},{"content":"Hill, B.M. and Shaw, A. (2013). The Wikipedia gender gap revisited: Characterizing survey response bias with propensity score estimation. PLoS ONE, 8:6.","paperID":"None"},{"content":"Hochschild, A. (1979). Emotion Work, Feeling Rules, and Social Structure. American Journal of Sociology, 85:3, 551--575.","paperID":"None"},{"content":"Iosub, D. et al. (2014). Emotions under discussion: Gender, status and communication in online collaboration. PLoS ONE, 9:8.","paperID":"None"},{"content":"Kannabiran, G (2014). Ecofeminism and sustainable HCI. In Proceedings DIS Companion 2014, ACM Press (2014), 185--190.","paperID":"None"},{"content":"Kittur, A., Bongwon, S., Pendleton, B., and Chi, E. (2007). He says, she says: Conflict and coordination in Wikipedia. In Proceedings CHI 2007, ACM Press (2007), 453--462.","paperID":"None"},{"content":"Kittur, A., and Kraut, R. (2008). Harnessing the wisdom of crowds in Wikipedia: Quality through coordination. In Proceedings CSCW 2008, ACM Press (2008), 37--46.","paperID":"None"},{"content":"Lam, S., Uduwage, A., Dong, Z., Sen, S., Musicant, D., Terveen, L., and Riedl, J. (2011). WP:Clubhouse: An exploration of Wikipedia's gender imbalance. In Proceedings WikiSym 2011, ACM Press (2011), 1--10.","paperID":"None"},{"content":"Leonard, A. (2013, April 29). Wikipedia's shame. Salon.","paperID":"None"},{"content":"Niederer, S. and van Dijck, J. (2010). Wisdom of the crowd or technicity of content? Wikipedia as a sociotechnical system. New Media Society, 12:1368.","paperID":"None"},{"content":"Nov, O. (2007). What motivates Wikipedians? Communications of the ACM, 50:11, 60--64.","paperID":"None"},{"content":"Panciera, K., Halfaker, A., and Terveen, L. (2009). Wikipedians are born, not made: A study of power editors on Wikipedia. In Proceedings GROUP 2009, ACM Press (2009), 51--60.","paperID":"None"},{"content":"Van der Velden, M. (2013). Decentering design: Wikipedia and indigenous knowledge. International Journal of Human-Computer Interaction, 29:4.","paperID":"None"},{"content":"Weibert, A., Marshall, A., Aal, K., Schubert, K. and Rode, J. (2014). Sewing interest in E-textiles: analyzing making from a gendered perspective. In Proceedings DIS (2014), ACM Press (2014), 15--24.","paperID":"None"},{"content":"Where are the women in Wikipedia? (2011, February 2). The Opinion Pages: Room for Debate. The New York Times.","paperID":"None"},{"content":"Wikimedia: Gendergap mailing list. (n.d.). https://lists.wikimedia.org/mailman/listinfo/gendergap","paperID":"None"},{"content":"Wikipedia 'completely failed' to fix gender imbalance [Video file]. (2014, August 8). BBC News.","paperID":"None"}],"title":"The Heart Work of Wikipedia: Gendered, Emotional Labor in the World's Largest Online Encyclopedia","filename":"CHI15/p207","authors":["Amanda Menking","Ingrid Erickson"],"conference":"CHI '15"}