{"paperId":2702273,"citation":[{"content":"Tovi Grossman , Xiang Anthony Chen , George Fitzmaurice, Typing on Glasses: Adapting Text Entry to Smart Eyewear, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, August 24-27, 2015, Copenhagen, Denmark","paperID":"2785867"}],"reference":[{"content":"Bates, R., and Istance, H. Zooming interfaces!: Enhancing the performance of eye controlled pointing devices. Proc. Assets 2002, ACM Press (2002), 119-- 126.","paperID":"None"},{"content":"Hwang, S. and Lee, G. Qwerty-like 3x4 keypad layouts for mobile phone. Ext. Abstracts CHI 2005, ACM Press (2005), 1479--1482.","paperID":"None"},{"content":"Isokoski, P. Performance of menu-augmented soft keyboards. Proc. CHI 2004, ACM Press (2004), 423--430.","paperID":"None"},{"content":"Isokoski, P., Martin, B., Gandouly, P., and Stephanov, T. Motor efficiency of text entry in a combination of a soft keyboard and unistrokes. Proc. NordiCHI 2010, ACM Press (2010), 683--686.","paperID":"None"},{"content":"Isokoski, P., and Raisamo, R. Device independent text input: A rationale and an example. Proc. AVI 2000, ACM Press (2000), 76--83.","paperID":"None"},{"content":"MacKenzie, I. Kspc as a characteristic of text entry techniques. In Human Computer Interaction with Mobile Devices, F. Paterno, Ed., vol. 2411 of LNCS. Springer Berlin Heidelberg, 2002, 195--210.","paperID":"None"},{"content":"MacKenzie, I. S., and Soukoreff, R. W. Phrase sets for evaluating text entry techniques. Ext. Abstracts CHI 2003, ACM Press (2003), 754--755.","paperID":"None"},{"content":"McCallum, D. C., Mak, E., Irani, P., and Subramanian, S. Pressuretext: Pressure input for mobile phone text entry. Ext. Abstracts CHI 2009, ACM Press (2009), 4519--4524.","paperID":"None"},{"content":"Nesbat, S. B. A system for fast, full-text entry for small electronic devices. Proc. ICMI 2003, ACM Press (2003), 4--11.","paperID":"None"},{"content":"Oney, S., Harrison, C., Ogan, A., and Wiese, J. Zoomboard: A diminutive QWERTY soft keyboard using iterative zooming for ultra-small devices. Proc. CHI 2013, ACM Press (2013), 2799--2802.","paperID":"None"},{"content":"Raghunath, M. T., and Narayanaswami, C. User interfaces for applications on a wrist watch. Personal Ubiquitous Comput. 6, 1 (2002), 17--30.","paperID":"None"},{"content":"Thapa, A. Beginners Performance with MessagEase and QWERTY. Master's thesis, University of Tampere, 2013.","paperID":"None"},{"content":"Wigdor, D., and Balakrishnan, R. Tilttext: Using tilt for text input to mobile phones. Proc. UIST 2003, ACM Press (2003), 81--90.","paperID":"None"},{"content":"Wobbrock, J. O., Myers, B. A., and Kembel, J. A. Edgewrite: A stylus-based text entry method designed for high accuracy and stability of motion. Proc. UIST 2003, ACM Press (2003), 61--70.","paperID":"None"},{"content":"Zhai, S., and Kristensson, P. O. The word-gesture keyboard: Reimagining keyboard interaction. Commun. ACM 55, 9 (Sept. 2012), 91--10.","paperID":"None"}],"abstract":"Text entry on a smartwatch is a challenging problem due to the device's limited screen area. In this paper, we introduce the SplitBoard, which is a soft keyboard designed for a smartwatch. As the user flicks left or right on the keyboard, it switches between the left and right halves of a QWERTY keyboard. We report the results of two user experiments where the SplitBoard was compared to an ordinary QWERTY keyboard, the ZoomBoard, SlideBoard, and Qwerty-like keypad. We measured the initial performance with new users for each method. The SplitBoard outperformed all other techniques in the experiments. The SplitBoard is expected to be a viable option for smartwatch text entry because of its light processing requirements, good performance, and immediate learnability.","title":"SplitBoard: A Simple Split Soft Keyboard for Wristwatch-sized Touch Screens","filename":"CHI15/p1233","authors":["Jonggi Hong","Seongkook Heo","Poika Isokoski","Geehyuk Lee"],"conference":"CHI '15"}