{"paperId":2702144,"citation":[{"content":"Michelle Annett , Tovi Grossman , Daniel Wigdor , George Fitzmaurice, MoveableMaker: Facilitating the Design, Generation, and Assembly of Moveable Papercraft, Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2807483"}],"abstract":"Many children's books contain movable pictures with elements that can be physically opened, closed, pushed, pulled, spun, flipped, or swung. But these tangible, interactive reading experiences are inaccessible to children with visual impairments. This paper presents a set of 3D-printable models designed as building blocks for creating movable tactile pictures that can be touched, moved, and understood by children with visual impairments. Examples of these models are canvases, connectors, hinges, spinners, sliders, lifts, walls, and cutouts. They can be used to compose movable tactile pictures to convey a range of spatial concepts, such as in/out, up/down, and high/low. The design and development of these models were informed by three formative studies including 1) a survey on popular moving mechanisms in children's books and 3D-printed parts to implement them, 2) two workshops on the process creating movable tactile pictures by hand (e.g., Lego, Play-Doh), and 3) creation of wood-based prototypes and an informal testing on sighted preschoolers. Also, we propose a design language based on XML and CSS for specifying the content and structure of a movable tactile picture. Given a specification, our system can generate a 3D-printable model. We evaluate our approach by 1) transcribing six children's books, and 2) conducting six interviews on domain experts including four teachers for the visually impaired, one blind adult, two publishers at the National Braille Press, a renowned tactile artist, and a librarian.","reference":[{"content":"Alborzi, H., et al. Designing StoryRooms: Interactive Storytelling Spaces for Children. Proc. DIS '00, ACM Press, p95--104","paperID":"None"},{"content":"Beukelman, D., & Mirenda, P., (2005) Augmentative and alternative communication: Supporting children and adults with complex communication needs. Paul H.Brookes, Baltimore.","paperID":"None"},{"content":"Brown, C., Hurst, A., VizTouch: Automatically Generated Tactile Visualizations of Coordinate Spaces TEI'12, ACM Press, p131--138","paperID":"None"},{"content":"Budd J., Madej K., Stephens-WellsJ., Jong , J., Katzur E., Mulligan L. PageCraft: learning in context a tangible interactive storytelling platform to support early narrative development for young children. IDC '07, ACM Press, p97--100","paperID":"None"},{"content":"Bus, A. G., (2003). Joint Caregiver-Child Storybook Reading: A Route to Literacy Development, Handbook of Early Literacy Research., Vol.1, ISBN/UPC 9781572306530, The Guilford Press","paperID":"None"},{"content":"Cassell J, Ryokai K., (2001). Making Space for Voice: Technologies to Support Children's Fantasy and Storytelling, Personal and Ubiquitous Computing, Vol.5, Issue 3, Springer, p169--190","paperID":"None"},{"content":"Craig, J C, and Sherrick, C E (1982). Dynamic Tactile Displays in Tactual Perception, Ed Schiff, W and Foulke, E, Cambridge: University Press.","paperID":"None"},{"content":"Fontijn, W., and Mendels, P. StoryToy the Interactive Storytelling Toy. Pervasive Computing'05","paperID":"None"},{"content":"Garzotto, f., Bordogna, M., Paper-based Multimedia Interaction as Learning Tool for Disabled Children Proc. IDC '10, ACM Press, p79--88","paperID":"None"},{"content":"Garzotto, F. Broadening children's involvement as design partners: from technology to \"experience\", IDC '08. ACM Press, p186--194","paperID":"None"},{"content":"Google SketchUp 3D warehouse https://3dwarehouse.sketchup.com","paperID":"None"},{"content":"Hengeveld B., Hummels C., Overbeeke K. Tangibles for Toddlers Learning Language. TEI'09, ACM Press, p161--168","paperID":"None"},{"content":"Kim, J., Stangl, A., Eisenberg, A., & Yeh, T. Tactile Picture Books for Young Children with Visual Impairment, Works-in-Progress, TEI'14","paperID":"None"},{"content":"Lipson, H. & Kurman, M., (2013). Fabricated: The New World of 3D Printing, Wisely","paperID":"None"},{"content":"MakerBot Thingiverse http://thingiverse.com","paperID":"None"},{"content":"Marshall P., Do tangible interfaces enhance learning?, TEI '07, ACM Press, p163--170","paperID":"None"},{"content":"McGookin, D., Robertson, E., and Brewster, S.A., Clutching at straws: using tangible interaction to provide non-visual access to graphs, CHI'10, ACM Press, p10--15","paperID":"None"},{"content":"Philippe C., (2009). The Typhlo & Tactus Guide to Children's Book with tactile illustrations, Les Doigts Qui Revent","paperID":"None"},{"content":"Stangl, A., Kim, J., Yeh, T., 3D Printed Tactile Picture Books for Children with Visual Impairments: A Design Probe, IDC '14, ACM Press, p321--324","paperID":"None"},{"content":"Suzette, W., (2013). Guide to Designing Tactile Illustrations for Children's Books, the American Printing House for the Blind","paperID":"None"},{"content":"Yahoo japan Hands On Search, http://sawareru.jp/en/","paperID":"None"}],"title":"Toward 3D-Printed Movable Tactile Pictures for Children with Visual Impairments","filename":"CHI15/p2815","authors":["Jeeeun Kim","Tom Yeh"],"conference":"CHI '15"}