{"paperId":2702458,"abstract":"This paper identifies the design challenges for creating collaborative technologies supporting the practices of organizing elections. We ethnographically investigate the distributed nature of knowledge as enacted between heterogeneous groups over the course of three elections in Denmark. We 1) identify fundamental characteristics of elections, 2) provide a comprehensive account of the distributed nature of knowledge in organizing and executing elections, and 3) point to new challenging areas for human-computer interaction (HCI) design supporting distributed collaborative knowledge practices. We found that organizational pattern of elections complicates the embodiment of nomadic knowledge, which is crucial for managing the effective organization of an election. Thus, one of the relevant design challenges is finding out how to support the timely distribution of large amounts of information, while still ensuring it is appropriately divided and delivered to various groups participating in planning and executing elections.","citation":[],"reference":[{"content":"Ackerman, M., Pipek, V. and Wulf, V. Sharing Expertise: Beyond-Knowledge Management. MIT Press, Cambridge, MA, 2002.","paperID":"None"},{"content":"Ackerman, M. and Halverson, C. Organizational Memory: Processes, Boundary Objects, and Trajectories. Comput Support Coop Work 13, 2 (2004), 155--189.","paperID":"None"},{"content":"Ackerman, M., Dachtera, J., Pipek, V. and Wulf, V. Sharing Knowledge and Expertise: The CSCW View of Knowledge Management. Comput Support Coop Work, 22 (2013), 531--573.","paperID":"None"},{"content":"Alvarez, R., Hall, T. and Llewellyn, M. Are Americans confident their ballots are counted? Journal of Politics 70 (2008), 754--766.","paperID":"None"},{"content":"Bederson, B., Lee, B., Sherman, R., Herrnson, P. and Niemi, R. Electronic voting system usability issues. In Proc. CHI 2003, ACM Press (2003).","paperID":"None"},{"content":"Bouillot, F., Poncelet, P. and Roche, M. Frence presidential elections: What are the most efficient measures for tweets? In Proc. PLEAD 2012, ACM Press (2012)","paperID":"None"},{"content":"Boulus, N. and Bjørn, P. A cross-case analysis of technology-in-use practices: EPR-adaptation in Canada and Norway. Int J Med Inform, 79, 6 (2008), 97--108.","paperID":"None"},{"content":"Boulus-Rødje, N. Mapping the Literature: sociocultural, organizational and technological dimensions of e-voting technologies. Lecture Notes in Informatics (2012), 205ff.","paperID":"None"},{"content":"Byrne, M., Greene, K. and Everett, S. Usability of voting systems: Baseline data for paper, punch cards, and lever machines. In Proc. CHI 2007, ACM Press (2007).","paperID":"None"},{"content":"Carpenter, K., Nardi, B., Moore, J., Roberson, S., Foot, K., Drezner, D., Benson, I. and Jett, Q. Online political organizing: Lessons from the field: Panel. In Proc. CSCW 2004, ACM Press (2004).","paperID":"None"},{"content":"Carpenter, K., Roberson, S., Foot, K., Nardi, B., Drezner, D., Jett, Q., Moore, J. and Benson, I. Online political organizing: Lessons from the field: Panel. In Proc. CSCW 2004, ACM Press (2004).","paperID":"None"},{"content":"Everett, S., Greene, K., Byrne, M., Wallach, D., Derr, K., Sandler, D. and Torous, T. Electronic voting machines versus traditional methods: Improved preference, similar performance. In Proc. CHI 2008, ACM Press (2008).","paperID":"None"},{"content":"Grevet, C., Terveen, L. and Gilbert, E. Managing political differences in social media. In Proc. CSCW 2014, ACM Press (2014).","paperID":"None"},{"content":"Heath, C. and Luff, P. Documents and Professional Practice: \"Bad\" Organizational Reasons for \"Good\" Clinical Records. In Proc. CSCW 1996, ACM Press (1996)","paperID":"None"},{"content":"Hellström, J. and Karefelt, A. Participation through mobile phones: A study of SMS use during the Ugandan general elections 2011. In Proc. ICTD 2012, ACM Press.","paperID":"None"},{"content":"Hutchins, E. Cognition in the wild. MIT Press, Cambridge, Massachusetts, 1995.","paperID":"None"},{"content":"Kriplean, T., Bonnar, C., Borning, A., Kinney, B. and Gill, B. Integrating On-demand Fact-checking with Public Dialogue. In Proc. CSCW 2014, ACM Press (2014).","paperID":"None"},{"content":"Lutters, W. and Ackerman, M. Beyond Boundary Objects: Collaborative Reuse in Aircraft Technical Support. Comput Support Coop Work, 16, 3 (2007), 341--372.","paperID":"None"},{"content":"Nonaka, I. The knowledge-creating company Harvard Business Review, 85, 7/8 (2007), 162.","paperID":"None"},{"content":"Pipek, V., Wulf, V. and Johri, A. Bridging Artifacts and Actors: Expertise Sharing in Organizational Ecosystems. Comput Support Coop Work 21 (2011), 261--282.","paperID":"None"},{"content":"Randall, D., Harper, R. and Rouncefield, M. Fieldwork for design: Theory and practice. Springer, London, 2007.","paperID":"None"},{"content":"Robertson, S. Voter-Centered Design: Towards a voter decision support system. ACM Transactions on Computer-Human Interaction 12, 2 (2005), 263--291.","paperID":"None"},{"content":"Saeed, S., Pipek, V., Rohde, M. and Wulf, V. Managing nomadic knowledge: a case study of the European social forum. In Proc. CHI 2010, ACM Press (2010).","paperID":"None"},{"content":"Spence, P. and Reddy, M. Beyond Expertise Seeking: A Field Study of the Informal Knowledge Practices of Healthcare IT Teams. Comput Support Coop Work, 21 (2011), 283--315.","paperID":"None"}],"title":"Design Challenges in Supporting Distributed Knowledge: An Examination of Organizing Elections","filename":"CHI15/p3137","authors":["Nina Boulus-Rødje","Pernille Bjorn"],"conference":"CHI '15"}