{"paperId":2702590,"citation":[],"abstract":"Individual differences matter. While this has been the theme for many recent works in the Visualization and HCI communities, the mystery of how to develop personalized visualizations remains. This is largely because very little is known about how users actually use visualizations to solve problems and even less is known about how individual differences affect these problem-solving strategies. In this paper, we provide evidence that strategies are indeed influenced by individual differences. We demonstrate how the personality trait locus of control impacts strategies on hierarchical visualizations, and we introduce design recommendations for personalized visualizations.","reference":[{"content":"Anderson, C. R. Locus of control, coping behaviors, and performance in a stress setting: A longitudinal study. Journal of Applied Psychology 62 (1977), 446--451.","paperID":"None"},{"content":"Brown, E. T., Ottley, A., Zhao, H., Lin, Q., Souvenir, R., Endert, A., and Chang, R. Finding waldo: Learning about users from their interactions. IEEE Symposium on Visual Analytics Science and Technology (VAST) (2014).","paperID":"None"},{"content":"Cassidy, S., and Eachus, P. Learning style, academic belief systems, self-report student proficiency and academic achievement in higher education. Educational Psychology 20 (2000), 307--320.","paperID":"None"},{"content":"Findley, M. J., and Cooper, H. M. Locus of control and academic achievement: A literature review. Journal of Personality and Social Psychology 44 (1983), 419--427.","paperID":"None"},{"content":"Fisher, K., and Johnstion, M. Experimental manipulation of perceived control and its effect on disability. Psychology and Health 11, 5 (1996), 657--669.","paperID":"None"},{"content":"Goldberg, L. R., Johnson, J. A., Eber, H. W., Hogan, R., Ashton, M. C., Cloninger, C. R., and Gough, H. G. The international personality item pool and the future of public-domain personality measures. Journal of Research in Personality 40, 1 (2006), 84--96.","paperID":"None"},{"content":"Green, T. M., and Fisher, B. Towards the personal equation of interaction: The impact of personality factors on visual analytics interface interaction. In IEEE Symposium on Visual Analytics Science and Technology (VAST), IEEE (2010), 203--210.","paperID":"None"},{"content":"Judge, T. A., and Bono, J. E. Relationship of core self-evaluations traits-self-esteem, generalized self-efficacy, locus of control, and emotional stability-with job satisfaction and job performance: A meta-analysis. Journal of Applied Psychology 86 (2001), 80--92.","paperID":"None"},{"content":"National Center for Biotechnology Information. NCBI genome database. http://www.ncbi.nlm.nih.gov/genome/. Accessed 11/18/2010.","paperID":"None"},{"content":"Ottley, A., Crouser, R. J., Ziemkiewicz, C., and Chang, R. Manipulating and controlling for personality effects on visualization tasks. Information Visualization (2013).","paperID":"None"},{"content":"Peck, E. M., Ottley, A., Yuksel, B. F., Chang, R., and Harrison, L. ICD 3: Towards a 3-dimensional model of individual cognitive differences. ACM BELIV'12: Beyond Time and Errors: Novel Evaluation Methods for Information Visualization (2012).","paperID":"None"},{"content":"Shneiderman, B. The eyes have it: A task by data type taxonomy for information visualizations. In Visual Languages, 1996. Proceedings., IEEE Symposium on, IEEE (1996), 336--343.","paperID":"None"},{"content":"Steichen, B., Carenini, G., and Conati, C. User-adaptive information visualization: using eye gaze data to infer visualization tasks and user cognitive abilities. In Proceedings of the 2013 international conference on Intelligent user interfaces, ACM (2013), 317--328.","paperID":"None"},{"content":"Ziemkiewicz, C., Ottley, A., Crouser, R. J., Yauilla, A. R., Su, S. L., Ribarsky, W., and Chang, R. How visualization layout relates to locus of control and other personality factors. Visualization and Computer Graphics, IEEE Transactions on 19, 7 (2013), 1109--1121.","paperID":"None"}],"title":"Personality as a Predictor of User Strategy: How Locus of Control Affects Search Strategies on Tree Visualizations","filename":"CHI15/p3251","authors":["Alvitta Ottley","Huahai Yang","Remco Chang"],"conference":"CHI '15"}