{"paperId":2702521,"abstract":"Conflicts between the pilot and the automation, when pilots detect but do not understand them, cause \"automation surprise\" situations and jeopardize flight safety. We conducted an experiment in a 3-axis motion flight simulator with 16 pilots equipped with an eye-tracker to analyze their behavior and eye movements during the occurrence of such a situation. The results revealed that this conflict engages participant's attentional abilities resulting in excessive and inefficient visual search patterns. This experiment confirmed the crucial need to design solutions for detecting the occurrence of conflictual situations and to assist the pilots. We therefore proposed an approach to formally identify the occurrence of \"automation surprise\" conflicts based on the analysis of \"silent mode changes\" of the autopilot. A demonstrator was implemented and allowed for the automatic trigger of messages in the cockpit that explains the autopilot behavior. We implemented a real-time demonstrator that was tested as a proof-of-concept with 7 subjects facing 3 different conflicts with automation. The results shown the efficacy of this approach which could be implemented in existing cockpits.","citation":[{"content":"Sergio Pizziol , Catherine Tessier , Michael Feary , Fédéric Dehais, Action reversibility in human-machine systems, Proceedings of the 5th International Conference on Application and Theory of Automation in Command and Control Systems, p.21-31, September 30-October 02, 2015, Toulouse, France","paperID":"2899364"}],"reference":[{"content":"Billings, C. E. Aviation automation: The search for a human-centered approach. Mahwah, NJ: Erlbaum, 1997.","paperID":"None"},{"content":"Boeing. Statistical summary of commercial jet airplane accidents. worldwide operations 1959--2011, 2012.","paperID":"None"},{"content":"Breen, B. C. Controlled flight into terrain and the enhanced ground proximity warning system. Aerospace and Electronic Systems Magazine, IEEE 14, 1 (1999), 19--24.","paperID":"None"},{"content":"Bureau Enquetes et Analyses. Final Report on the Accident on 1st June 2009 to the Airbus 1330--203 registered F-GZCP operated by air france flight AF447 Rio de Janeiro-Paris, 2012.","paperID":"None"},{"content":"Butler, R. W., Miller, S. P., Potts, J. N., and Carreno, V. A. A formal methods approach to the analysis of mode confusion. In Digital Avionics Systems Conference, 1998. Proceedings., 17th DASC. The AIAA/IEEE/SAE, vol. 1, IEEE (1998), C41--1.","paperID":"None"},{"content":"Castelfranchi, C. Conflict ontology. In Computational conflicts. Springer, 2000, 21--40.","paperID":"None"},{"content":"Chialastri, A. Automation in aviation, 2012.","paperID":"None"},{"content":"Crow, J., Javaux, D., and Rushby, J. Models of mechanised methods that integrate human factors into automation design. In International Conference on Human-Computer Interaction in Aeronautics: HCI-Aero 2000, Citeseer (2000).","paperID":"None"},{"content":"De Keyser, V., and Woods, D. Fixation errors: Failures to revise situation assessment in dynamic and risky systems. In Systems reliability assessment. Springer, 1990, 231--251.","paperID":"None"},{"content":"Dehais, F., Causse, M., and Pastor, J. Embedded eye tracker in a real aircraft: new perspectives on pilot/aircraft interaction monitoring. In Proceedings from The 3rd International Conference on Research in Air Transportation. Fairfax, USA: Federal Aviation Administration (2008).","paperID":"None"},{"content":"Dehais, F., Causse, M., and Tremblay, S. Mitigation of conflicts with automation use of cognitive countermeasures. Human Factors: The Journal of the Human Factors and Ergonomics Society 53, 5 (2011), 448--460.","paperID":"None"},{"content":"Dehais, F., Causse, M., Vachon, F., and Tremblay, S. Cognitive conflict in human-automation interactions: a psychophysiological study. Applied ergonomics 43, 3 (2012), 588--595.","paperID":"None"},{"content":"Dehais, F., Goudou, A., Lesire, C., and Tessier, C. Towards an anticipatory agent to help pilots. In AAAI 2005 Fall Symposium\" From Reactive to Anticipatory Cognitive Embodied Systems\", Arlington, Virginia (2005).","paperID":"None"},{"content":"Dehais, F., Tessier, C., and Chaudron, L. Ghost: experimenting conflicts countermeasures in the pilot's activity. In IJCAI, vol. 3 (2003), 164--168.","paperID":"None"},{"content":"Diez, M., Boehm-Davis, D. A., Holt, R. W., Pinney, M. E., Hansberger, J. T., and Schoppek, W. Tracking pilot interactions with flight management systems through eye movements. In Proceedings of the 11th International Symposium on Aviation Psychology (2001), 1--6.","paperID":"None"},{"content":"Easterbrook, S. Handling conflict between domain descriptions with computer-supported negotiation. Knowledge acquisition 3, 3 (1991), 255--289.","paperID":"None"},{"content":"Feary, M. Automatic detection of interaction vulnerabilities in an executable specification. In Engineering Psychology and Cognitive Ergonomics. Springer, 2007, 487--496.","paperID":"None"},{"content":"Goldberg, J. H., and Kotval, X. P. Computer interface evaluation using eye movements: methods and constructs. International Journal of Industrial Ergonomics 24, 6 (1999), 631--645.","paperID":"None"},{"content":"Huettig, G., Anders, G., and Tautz, A. Mode awareness in a modern glass cockpit. In Proceedings of the 10th International Symposium on Aviation Psychology, vol. 1 (1999), 130--135.","paperID":"None"},{"content":"Javaux, D. A method for predicting errors when interacting with finite state systems. how implicit learning shapes the user's knowledge of a system. Reliability Engineering & System Safety 75, 2 (2002), 147--165.","paperID":"None"},{"content":"Leveson, N., Pinnel, L. D., Sandys, S. D., Koga, S., and Reese, J. D. Analyzing software specifications for mode confusion potential. In Proceedings of a workshop on human error and system development, Glasgow, Scotland, Citeseer (1997), 132--146.","paperID":"None"},{"content":"Leveson, N. G., and Palmer, E. Designing automation to reduce operator errors. In Systems, Man, and Cybernetics. Computational Cybernetics and Simulation. IEEE International Conference on, vol. 2, IEEE (1997), 1144--1150.","paperID":"None"},{"content":"Mack, A., and Rock, I. Inattentional blindness. The MIT Press, 1998.","paperID":"None"},{"content":"Manor, B. R., and Gordon, E. Defining the temporal threshold for ocular fixation in free-viewing visuocognitive tasks. Journal of neuroscience methods 128, 1 (2003), 85--93.","paperID":"None"},{"content":"Norman, D. A. The \"problem\" with automation: inappropriate feedback and interaction, not-over-automation. Philosophical Transactions of the Royal Society of London. B, Biological Sciences 327, 1241 (1990), 585--593.","paperID":"None"},{"content":"Parasuraman, R., and Riley, V. Humans and automation: Use, misuse, disuse, abuse. Human Factors: The Journal of the Human Factors and Ergonomics Society 39, 2 (1997), 230--253.","paperID":"None"},{"content":"Pizziol, S., Tessier, C., and Dehais, F. Petri net-based modelling of human-automation conflicts in aviation. Ergonomics 57, 3 (2014), 319--331.","paperID":"None"},{"content":"Poole, A., and Ball, L. J. Eye tracking in hci and usability research. Encyclopedia of human computer interaction 1 (2006), 211--219.","paperID":"None"},{"content":"Regis, N., Dehais, F., Tessier, C., and Gagnon, J.-F. Ocular metrics for detecting attentional tunnelling. Human Factors and Ergonomics Society-Chapter Europe, Toulouse, France (2012).","paperID":"None"},{"content":"Rushby, J. Using model checking to help discover mode confusions and other automation surprises. Reliability Engineering & System Safety 75, 2 (2002), 167--177.","paperID":"None"},{"content":"Rushby, J., Crow, J., and Palmer, E. An automated method to detect potential mode confusions. In Digital Avionics Systems Conference, 1999. Proceedings. 18th, vol. 1, IEEE (1999), 4--B.","paperID":"None"},{"content":"Salthouse, T. A., and Ellis, C. L. Determinants of eye-fixation duration. The American journal of psychology (1980), 207--234.","paperID":"None"},{"content":"Sarter, N. B., Mumaw, R. J., and Wickens, C. D. Pilots' monitoring strategies and performance on automated flight decks: An empirical study combining behavioral and eye-tracking data. Human Factors: The Journal of the Human Factors and Ergonomics Society 49, 3 (2007), 347--357.","paperID":"None"},{"content":"Sarter, N. B., Woods, D. D., and Billings, C. E. Automation surprises. Handbook of human factors and ergonomics 2 (1997), 1926--1943.","paperID":"None"},{"content":"Scannella, S., Causse, M., Chauveau, N., Pastor, J., and Dehais, F. Effects of the audiovisual conflict on auditory early processes. International Journal of Psychophysiology 89, 1 (2013), 115--122.","paperID":"None"},{"content":"Tintarev, N., Kutlak, R., Oren, N., Van Deemter, K., Green, M., Masthoff, J., and Vasconcelos, W. SAsSy scrutable autonomous systems. Proceedings of The Society for the Study of Artificial Intelligence and the Simulation of Behaviour 2013 (2013).","paperID":"None"},{"content":"Tracy, J. I., Mohamed, F., Faro, S., Tiver, R., Pinus, A., Bloomer, C., Pyrros, A., and Harvan, J. The effect of autonomic arousal on attentional focus. Neuroreport 11, 18 (2000), 4037--4042.","paperID":"None"},{"content":"Wiener, E. L. Human factors of advanced technology (\"glass cockpit\") transport aircraft. NASA contractor report no. 177528, Moffet Field, NASA-Ames Research Center, 1989.","paperID":"None"},{"content":"Wiener, E. L., and Curry, R. E. Flight-deck automation: Promises and problems. Ergonomics 23, 10 (1980), 995--1011.","paperID":"None"},{"content":"Woods, D. D., and Sarter, N. B. Learning from automation surprises and \"going sour\" accidents. Cognitive engineering in the aviation domain (2000), 327--353.","paperID":"None"}],"title":"\"Automation Surprise\" in Aviation: Real-Time Solutions","filename":"CHI15/p2525","authors":["Frederic Dehais","Vsevolod Peysakhovich","Sébastien Scannella","Jennifer Fongue","Thibault Gateau"],"conference":"CHI '15"}