{"paperId":2702212,"reference":[{"content":"Andrea Bianchi , Ian Oakley , Dong Soo Kwon, Counting clicks and beeps: Exploring numerosity based haptic and audio PIN entry, Interacting with Computers, v.24 n.5, p.409-422, September, 2012","paperID":"2379926"},{"content":"Alexander De Luca , Katja Hertzschuch , Heinrich Hussmann, ColorPIN: securing PIN entry through indirect input, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753490"},{"content":"Harbach, M., von Zezschwitz, E., Fichtner, A., De Luca, A., and Smith, M. It's a hard lock life: A field study of smartphone (un)locking behavior and risk perception. In Proc. SOUPS 2014, USENIX Association (Menlo Park, CA, July 2014), 213--230.","paperID":"None"},{"content":"Kwon, T., and Na, S. Tinylock: Affordable defense against smudge attacks on smartphone pattern lock systems. Computers & Security 42, 0 (2014), 137--150.","paperID":"None"},{"content":"Mun-Kyu Lee, Security Notions and Advanced Method for Human Shoulder-Surfing Resistant PIN-Entry, IEEE Transactions on Information Forensics and Security, v.9 n.4, p.695-708, April 2014","paperID":"2714004"},{"content":"Volker Roth , Kai Richter , Rene Freidinger, A PIN-entry method resilient against shoulder surfing, Proceedings of the 11th ACM conference on Computer and communications security, October 25-29, 2004, Washington DC, USA","paperID":"1030116"}],"citation":[],"abstract":"In this paper, we present SwiPIN, a novel authentication system that allows input of traditional PINs using simple touch gestures like up or down and makes it secure against human observers. We present two user studies which evaluated different designs of SwiPIN and compared it against traditional PIN. The results show that SwiPIN performs adequately fast (3.7 s) to serve as an alternative input method for risky situations. Furthermore, SwiPIN is easy to use, significantly more secure against shoulder surfing attacks and switching between PIN and SwiPIN feels natural.","title":"SwiPIN: Fast and Secure PIN-Entry on Smartphones","filename":"CHI15/p1403","authors":["Emanuel von Zezschwitz","Alexander De Luca","Bruno Brunkow","Heinrich Hussmann"],"conference":"CHI '15"}