{"paperId":2702417,"citation":[],"abstract":"Online dating sites have become a common means of finding a romantic partner. And yet, these sites differ greatly from many other socially oriented websites: perhaps most notably, the pairwise style of interaction afforded by these sites prevents a robust online community from forming. Users, however, have taken matters into their own hands by creating thriving external forums for discussion of specific dating sites. We report on a multiple methods study of two online dating services, via observation and interviews with users of the forums associated with these sites. Our findings suggest that these forums play an essential role in creating an \"outsourced community\" for the dating sites, and also reveal practices around how some users \"game the system\" in online dating, the prevalence of harassment in online dating, and users' frustrations with current dating sites. We conclude with a number of recommendations for system design.","reference":[{"content":"Best of Tinder -- /r/Tinder. 14 Sept 2014. https://reddit.com/r/tinder.","paperID":"None"},{"content":"Georgia Institute of Technology. 22 Sept 2014. http://www.news.gatech.edu/2014/02/17/couplet-love-story.","paperID":"None"},{"content":"OkCupid on Reddit -- /r/OkCupid. 14. Sept 2014. Available from: https://reddit.com/r/okcupid.","paperID":"None"},{"content":"Terms | OkCupid. 12. Sept 2014. http://www.okcupid.com/legal/terms.","paperID":"None"},{"content":"The Tinder-O-Matic. Sink Hacks. 22 Sept 2014. http://sinkhacks.com/tinder-o-matic/.","paperID":"None"},{"content":"Usenet Personals: Advice for Straights FAQ (1/3. 14 Sept 2014. http://www.faqs.org/faqs/personals/straightfaq/part1","paperID":"None"},{"content":"Shaowen Bardzell , Jeffrey Bardzell, Towards a feminist HCI methodology: social science, feminism, and HCI, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979041"},{"content":"Bernard, H.H.R. et. al, Analyzing Qualitative Data: Systematic Approaches. 2009: SAGE publications.","paperID":"None"},{"content":"Joan-Isaac Biel , Daniel Gatica-Perez, The YouTube Lens: Crowdsourced Personality Impressions and Audiovisual Analysis of Vlogs, IEEE Transactions on Multimedia, v.15 n.1, p.41-55, January 2013","paperID":"2719396"},{"content":"Amy Bruckman , Catalina Danis , Cliff Lampe , Janet Sternberg , Chris Waldron, Managing deviant behavior in online communities, CHI '06 Extended Abstracts on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1125458"},{"content":"Susan L. Bryant , Andrea Forte , Amy Bruckman, Becoming Wikipedian: transformation of participation in a collaborative online encyclopedia, Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work, November 06-09, 2005, Sanibel Island, Florida, USA","paperID":"1099205"},{"content":"Collins, S.A., C. Missing, Vocal and Visual Attractiveness are Related in Women. Animal behaviour, 2003. 65(5): p. 997--1004.","paperID":"None"},{"content":"DeSanctis, G., et al., Learning in Online Forums. European Management Journal, 2003. 21(5): p. 565--577.","paperID":"None"},{"content":"Jill P. Dimond , Michaelanne Dye , Daphne Larose , Amy S. Bruckman, Hollaback!: the role of storytelling online in a social movement organization, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441831"},{"content":"Ellison, N.B., Social Network Sites: Definition, History, and Scholarship. Journal of Computer-Mediated Communication, 2007. 13(1): p. 210--230.","paperID":"None"},{"content":"Finkel, E.J., et al., Online Dating A Critical Analysis From the Perspective of Psychological Science. Psychological Science in the Public Interest, 2012. 13(1): p. 3--66.","paperID":"None"},{"content":"Andrew T. Fiore , Judith S. Donath, Online personals: an overview, CHI '04 Extended Abstracts on Human Factors in Computing Systems, April 24-29, 2004, Vienna, Austria","paperID":"986073"},{"content":"Andrew T. Fiore , Judith S. Donath, Homophily in online dating: when do you like someone like yourself?, CHI '05 Extended Abstracts on Human Factors in Computing Systems, April 02-07, 2005, Portland, OR, USA","paperID":"1056919"},{"content":"Andrew T. Fiore , Lindsay Shaw Taylor , G.A. Mendelsohn , Marti Hearst, Assessing attractiveness in online dating profiles, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357181"},{"content":"Frost, J.H., et al., People are Experience Goods: Improving Online Dating with Virtual Dates. Journal of Interactive Marketing, 2008. 22(1): p. 51--61.","paperID":"None"},{"content":"Goffman, E., The Presentation of Self in Everyday Life. 1959.","paperID":"None"},{"content":"Jennifer Golbeck , Cristina Robles , Karen Turner, Predicting personality with social media, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979614"},{"content":"Hall, J.A., et al., Strategic misrepresentation in online dating: The effects of gender, self-monitoring, and personality traits. Journal of Social and Personal Relationships, 2010. 27(1): p. 117--135.","paperID":"None"},{"content":"Jeffrey T. Hancock , Catalina Toma , Nicole Ellison, The truth about lying in online dating profiles, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240697"},{"content":"Hancock, J.T. and C.L. Toma, Putting Your Best Face Forward: The Accuracy of Online Dating Photographs. Journal of Communication, 2009. 59(2): p. 367--386.","paperID":"None"},{"content":"Hitsch, G.J. et al. What Makes You Click-Mate Preferences in Online Dating. Quantitative Marketing and Economics, 2010. 8(4): p. 393--427.","paperID":"None"},{"content":"Lilly C. Irani , M. Six Silberman, Turkopticon: interrupting worker invisibility in amazon mechanical turk, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470742"},{"content":"Jones, Q., Virtual-Communities, Virtual Settlements & Cyber-Archaeology: A Theoretical Outline. Journal of Computer-Mediated Communication, 1997. 3(3).","paperID":"None"},{"content":"Kosinski, M., D. Stillwell, and T. Graepel, Private traits and attributes are predictable from digital records of human behavior. Proceedings of the National Academy of Sciences, 2013. 110(15): p. 5802--5805.","paperID":"None"},{"content":"Cliff Lampe , Erik Johnston, Follow the (slash) dot: effects of feedback on new members in an online community, Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work, November 06-09, 2005, Sanibel Island, Florida, USA","paperID":"1099206"},{"content":"Debra Lauterbach , Hung Truong , Tanuj Shah , Lada Adamic, Surfing a Web of Trust: Reputation and Reciprocity on CouchSurfing.com, Proceedings of the 2009 International Conference on Computational Science and Engineering, p.346-353, August 29-31, 2009","paperID":"1633622"},{"content":"Lave, J. and E. Wenger, Situated Learning: Legitimate Peripheral Participation. 1991: Cambridge university press.","paperID":"None"},{"content":"Adeline Y. Lee , Amy S. Bruckman, Judging you by the company you keep: dating on social networking sites, Proceedings of the 2007 international ACM conference on Supporting group work, November 04-07, 2007, Sanibel Island, Florida, USA","paperID":"1316680"},{"content":"Christina A. Masden , Catherine Grevet , Rebecca E. Grinter , Eric Gilbert , W. Keith Edwards, Tensions in scaling-up community social media: a multi-neighborhood study of nextdoor, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557319"},{"content":"Oldenburg, R., The Great Good Place: Cafes, Coffee Shops, Bookstores, Bars, Hair Salons, and Other Hangouts at the Heart of a Community. 1999: Marlowe New York.","paperID":"None"},{"content":"PRWeb. Dating Services in the US Industry Market Research Report from IBISWorld Has Been Updated. 2013 16 Mar. 2013; Available from: http://www.prweb.com/releases/2013/3/prweb10537905.htm.","paperID":"None"},{"content":"Putnam, R.D., The Strange Disappearance of Civic America. American Prospect, 1996: p. 34--49.","paperID":"None"},{"content":"Larry D. Rosen , Nancy A. Cheever , Cheyenne Cummings , Julie Felt, The impact of emotionality and self-disclosure on online dating versus traditional dating, Computers in Human Behavior, v.24 n.5, p.2124-2157, September 2008","paperID":"1385820"},{"content":"Christian Rudder, Dataclysm: Who We Are (When We Think No One's Looking), Crown Publishing Group, New York, NY, 2014","paperID":"2677103"},{"content":"Skopek, J. et al. Who Contacts Whom? Educational Homophily in Online Mate Selection. European Sociological Review, 2010: p. jcp068","paperID":"None"},{"content":"Smith, A., M. Duggan. Online Dating & Relationships. Pew Internet & American Life Project, 2013.","paperID":"None"},{"content":"Toma, C.L. et al., Separating Fact From Fiction: An Examination of Deceptive Self-Presentation in Online Dating Profiles. Personality and Social Psychology Bulletin, 2008. 34(8): p. 1023--1036","paperID":"None"},{"content":"Nick Yee , Nicolas Ducheneaut , Les Nelson , Peter Likarish, Introverted elves & conscientious gnomes: the expression of personality in world of warcraft, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979052"},{"content":"Douglas Zytko , Sukeshini A. Grandhi , Quentin (Gad) Jones, Impression management through communication in online dating, Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2556487"}],"title":"Understanding the Role of Community in Online Dating","filename":"CHI15/p535","authors":["Christina Masden","W. Keith Edwards"],"conference":"CHI '15"}