{"paperId":2702367,"citation":[],"reference":[{"content":"Adler, R.F., and Benbunan-Fich, R. Self-Interruptions in Discretionary Multitasking. Computers in Human Behavior 29, 4 (2013), 1441--1449.","paperID":"None"},{"content":"Beers, S.F., and Nagy, W.E. Syntactic complexity as a predictor of adolescent writing quality: Which measures? Which genre? Reading & Writing 22, 2(2009), 185--200.","paperID":"None"},{"content":"Borst, J.P., Taatgen, N.A., & Van Rijn, H. The problem state: A cognitive bottleneck in multitasking. Journal of Experimental Psychology: Learning, Memory, & Cognition 36, (2010), 363--382.","paperID":"None"},{"content":"Bowman, L.L., Levine, L.E., Waite, B.M., and Gendron, M. Can students really multi task? An experimental study of instant messaging while reading. Computers & Education 5, 4 (2010), 927--931.","paperID":"None"},{"content":"Clapp, W.C., Rubens, M.T., Sabharwal, J., and Gazzaley, A. Deficit in switching between functional brain networks underlies the impact of multitasking on working memory in older adults. Proc. of the National Academy of Sciences 108, 17 (2011), 7212--7217.","paperID":"None"},{"content":"Dabbish, L., Mark, G., and Gonzalez, V. Why do I keep interrupting myself?: Self interruption, habit, and environment. Proc. CHI (2011), 3127- 3130.","paperID":"None"},{"content":"Ellis, Y., Daniels, B., and Jauregui, A. The effect of multitasking on the grade performance of business students. Research in Higher Education Journal 8, (2010), 1--10.","paperID":"None"},{"content":"Flesch, R. A new readability yardstick. Journal of Applied Psychology 32, (1948), 221--233.","paperID":"None"},{"content":"Foehr, U.G. Media multitasking among American youth: Prevalence, pairings and predictors. Unpublished doctoral dissertation (2006), Stanford, CA, USA.","paperID":"None"},{"content":"Fox, A.B., Rosen, J., and Crawford, M. Distractions, Distractions: Does Instant Messaging Affect College Students' Performance on a Concurrent Reading Comprehension Task? Cyberpsychology & Behavior, 12, 1 (2009), 51--53.","paperID":"None"},{"content":"Hembrooke, H., and Gay, G. The Laptop and the Lecture: The Effects of Multitasking in Learning Environments. Journal of Computing in Higher Education 15, 1 (2003), 46--64.","paperID":"None"},{"content":"Iqbal, S.T., and Bailey, B.P. Leveraging Characteristics of task structure to predict costs of interruption. Proc. CHI (2006), 741--750.","paperID":"None"},{"content":"Jeong, S.H., and Fishbein, M. Predictors of Multitasking with Media: Media Factors and Audience Factors. Media Psychology 10, 3 (2007), 364--384.","paperID":"None"},{"content":"Kirsch, D. A Few Thoughts on Cognitive Overload. Intellectica 1, 30 (2000), 19--51.","paperID":"None"},{"content":"Kuncel, N.R., Hezlett, S.A., and Ones, D.S. A comprehensive meta-analysis of the predictive validity of the Graduate Record Examinations: Implications for graduate student selection and performance. Psychological Bulletin 127, 1 (2001), 162--181.","paperID":"None"},{"content":"LaLonde, S.M. Transforming variables for normality and linearity-when, how, why and why not's. SAS NESUG (2005), 11--14.","paperID":"None"},{"content":"Ophir, E., Nass, C., and Wagner, A. D. Cognitive control in media multitaskers. Proc. of the National Academy of Sciences 106, 37 (2009). 15583--15587.","paperID":"None"},{"content":"Payne, S. J., Duggan, G. B., and Neth, H. Discretionary task interleaving: Heuristics for time allocation in cognitive foraging. Journal of Experimental Psychology: General 136, 3 (2007), 370--388.","paperID":"None"},{"content":"Pea, R., Nass, C., Meheula, L., Rance, M., Kumar, A., Bamford, H., Nass, M., Simha, A., Stillerman, B., Yang, S., and Zhou, M. Media use, face-to-face communication, media multitasking, and social wellbeing among 8- to 12-year-old girls. Developmental Psychology 48, 2 (2012), 327--336.","paperID":"None"},{"content":"Reader, W., and Payne, S. Allocating time across multiple texts: sampling and satisficing. HumanComputer Interaction 22, 3 (2007), 263--298.","paperID":"None"},{"content":"Roberts, D.F., and Foehr, U.G. Trends in Media Use. The Future of Children. Children and Electronic Media 18, 1 (2008), 11--37.","paperID":"None"},{"content":"Rosen, L.D., Carrier, L.M., and Cheever, N. A. Facebook and texting made me do it: Media-induced task-switching while studying. Computers in Human Behavior 29, 3 (2013), 948--958.","paperID":"None"},{"content":"Salvucci, D. D., Taatgen, N. A., and Borst, J. P. Toward a unified theory of the multitasking continuum: from concurrent performance to task switching, interruption, and resumption. Proc. CHI (2009), 1819--1828.","paperID":"None"},{"content":"Spink, A., and Park, M. Information and noninformation multitasking interplay. Journal of Documentation 61, 4 (2005), 548--555.","paperID":"None"},{"content":"Tombu, M.N., Asplund, C.L., Dux, P.E., Godwin, D., Martin, J.W., and Marois, R. A Unified attentional bottleneck in the human brain. Proc. of the National Academy of Sciences 108, 33 (2011), 13426--13431.","paperID":"None"},{"content":"Vega, V., McCracken, K., Nass, C.I., and Labs, L. Multitasking Effects on Visual Working Memory, Working Memory and Executive Control. ICA (2008).","paperID":"None"}],"abstract":"Chronic multitaskers perform worse on core multitasking skills: memory management, cognitive filtering and task switching, likely due to their inability to filter irrelevant stimuli [17]. Our experiment examines effects of chronic multitasking with task-relevant and irrelevant distractors on analytical writing quality. We found a general switch cost and, when controlling for that cost, effects of chronic multitasking habits: heavy multitaskers write worse essays in the irrelevant condition and better essays in the relevant condition. Our study changes multitasking research paradigms in two fundamental ways: it studied a realistic writing scenario including access to both irrelevant and relevant distractors. We found that the effect of chronic multitasking is complex; heavy multitaskers are seduced by unrelated distractors but able to integrate multiple sources of relevant information.","title":"The Effects of Chronic Multitasking on Analytical Writing","filename":"CHI15/p2967","authors":["Danielle M. Lottridge","Christine Rosakranse","Catherine S. Oh","Sean J. Westwood","Katherine A. Baldoni","Abrey S. Mann","Clifford I. Nass"],"conference":"CHI '15"}