{"paperId":2702579,"citation":[],"abstract":"UX and design culture are beginning to dominate corporate priorities, but despite the current hype there is often a disconnect between the organizational efficiencies desired by executives and the knowledge of how UX can or should address these issues. This exploratory study addresses this space by reframing the concept of competence in UX to include the flow of competence between individual designers and the companies in which they work. Our reframing resulted in a preliminary schema based on interviews conducted with six design practitioners, which allows this flow to be traced in a performative way on the part of individuals and groups over time. We then trace this flow of individual and organizational competence through three case studies of UX adoption. Opportunities for use of this preliminary schema as a generative, rhetorical tool for HCI researchers to further interrogate UX adoption are considered, including accounting for factors that affect adoption.","reference":[{"content":"Argyris, C. and Schön, D.A. Theory in practice: Increasing professional effectiveness. Jossey-Bass Publishers, San Francisco, 1974.","paperID":"None"},{"content":"Arvola, M. and Artman, H. Studio life: The construction of digital design competence. Digital Kompetanse 3, 2 (2008), 78--96.","paperID":"None"},{"content":"Klaus B. Bærentsen , Henning Slavensky, A contribution to the design process, Communications of the ACM, v.42 n.5, p.72-77, May 1999","paperID":"301422"},{"content":"Bødker, S., Ehn, P., Sjögren, D. and Sundblad, Y. Cooperative design \"Perspectives on 20 years with the Scandinavian IT Design Model\". Proc. NordiCHI, (2000), 22--24.","paperID":"None"},{"content":"Jacob Buur , Susanne Bødker, From usability lab to “design collaboratorium”: reframing usability practice, Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques, p.297-307, August 17-19, 2000, New York City, New York, USA","paperID":"347768"},{"content":"Alan Cooper, The Inmates Are Running the Asylum: Why High Tech Products Drive Us Crazy and How to Restore the Sanity (2nd Edition), Pearson Higher Education, 2004","paperID":"984201"},{"content":"Fabricant, R. Scaling your UX Strategy. Harvard Business Review, 2013, January 7. Retrieved from http://blogs.hbr.org/2013/01/scaling-your-ux-strategy/","paperID":"None"},{"content":"Liam Friedland , Jon Innes , Roman Longoria , Wayne Hom , Pradeep Henry , Richard Anderson, Outsourcing & offshoring: impact on the user experience, CHI '05 Extended Abstracts on Human Factors in Computing Systems, April 02-07, 2005, Portland, OR, USA","paperID":"1056866"},{"content":"Futt, Y.S. and Rasid, H. Meta Design. 2011, May. 156159. Retrieved from http://www.ideo.com/images/ uploads/news/pdfs/Designare.pdf","paperID":"None"},{"content":"Glaser, B.G. and Strauss, A.L. The discovery of grounded theory: Strategies for qualitative research. Alpine de Gruyter, New York, 1967.","paperID":"None"},{"content":"Danielle Gobert , Virginia Howlett , Carolyn Snyder , Howard Tamler , Thomas S. Tullis , Chauncey Wilson, What the best usability specialists are made of, CHI '02 Extended Abstracts on Human Factors in Computing Systems, April 20-25, 2002, Minneapolis, Minnesota, USA","paperID":"506556"},{"content":"Governor, J. On The Importance of Design at IBM: Love and Margins. 2013, January 7. Retrieved from http://redmonk.com/jgovernor/2013/01/07/on-theimportance-of-design-at-ibm-love-and-margins/","paperID":"None"},{"content":"Colin M. Gray, Evolution of design competence in UX practice, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557264"},{"content":"Colin M. Gray , Erik Stolterman , Martin A. Siegel, Reprioritizing the relationship between HCI research and practice: bubble-up and trickle-down effects, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598595"},{"content":"Holmlid, S. and Arvola, M. 2007. Developing a thematic design curriculum as a Bologna master. International Conference on Engineering and Product Design Education (2007), 13--14.","paperID":"None"},{"content":"Harold G. Nelson , Erik Stolterman, The Design Way: Intentional Change in an Unpredictable World, The MIT Press, 2012","paperID":"2380996"},{"content":"Mika P. Nieminen , Mikael Runonen , Marko Nieminen , Mari Tyllinen, Designer experience: exploring ways to design in experience, CHI '11 Extended Abstracts on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979581"},{"content":"Olsson, E. What active users and designers contribute in the design process. Interacting with computers 16, 2 (2004), 377--401.","paperID":"None"},{"content":"Rychen, D.S. and Salganik, L.H. A holistic model of competence. In Key competencies for a successful life and a well-functioning society. Hogrefe & Huber, Göttingen, Germany, 2003, pp. 41--62.","paperID":"None"},{"content":"Agnieszka (Aga) Szóstek, A look into some practices behind microsoft UX management, CHI '12 Extended Abstracts on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2212833"},{"content":"Carola Fellenz Thompson , Richard I. Anderson , Irene Au , Cordell Ratzlaff , Nida Zada, Managing user experience: managing change, CHI '10 Extended Abstracts on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753938"},{"content":"Yin, R.K. Case study research: Design and methods. Sage Publications, Los Angeles, Calif., 2009.","paperID":"None"},{"content":"Weinert, F.E. Concept of competence: A conceptual clarification. In D.S. Rychen and L.A. Salganik, editor, Defining and selecting key competencies. Hogrefe & Huber, Seattle, WA, 2001, 45--66","paperID":"None"}],"title":"Flow of Competence in UX Design Practice","filename":"CHI15/p3285","authors":["Colin M. Gray","Austin L. Toombs","Shad Gross"],"conference":"CHI '15"}