{"paperId":2702305,"citation":[{"content":"Xianjun Sam Zheng , Patrik Matos da Silva , Cedric Foucault , Siddharth Dasari , Meng Yuan , Stuart Goose, Wearable Solution for Industrial Maintenance, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2725442"},{"content":"Markus Funk , Thomas Kosch , Scott W. Greenwald , Albrecht Schmidt, A benchmark for interactive augmented reality instructions for assembly tasks, Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia, November 30-December 02, 2015, Linz, Austria","paperID":"2836067"},{"content":"Markus Funk , Sven Mayer , Albrecht Schmidt, Using In-Situ Projection to Support Cognitively Impaired Workers at the Workplace, Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, October 26-28, 2015, Lisbon, Portugal","paperID":"2809853"}],"reference":[{"content":"Aleksy, M., Rissanen, M. J., Maczey, S., & Dix. M. Wearable computing in industrial service applications. Procedia Computer Science, 5:394--400, 2011.","paperID":"None"},{"content":"M. Billinghurst , J. Bowskill , M. Jessop , J. Morphett, A Wearable Spatial Conferencing Space, Proceedings of the 2nd IEEE International Symposium on Wearable Computers, p.76, October 19-20, 1998","paperID":"858019"},{"content":"Caudell, T.P., & Mizell, D.W. Augmented reality: an application of heads-up display technology to manual manufacturing processes. In Proc. 25th Hawaii International Conf. on System Sciences, 659--669, 1992.","paperID":"None"},{"content":"Anind K. Dey , Daniel Salber , Gregory D. Abowd , Masayasu Futakawa, The Conference Assistant: Combining Context-Awareness with Wearable Computing, Proceedings of the 3rd IEEE International Symposium on Wearable Computers, p.21, October 18-19, 1999","paperID":"856496"},{"content":"Wolfgang Friedrich, ARVIKA \" Augmented Reality for Development, Production and Service, Proceedings of the 1st International Symposium on Mixed and Augmented Reality, p.3, September 30-October 01, 2002","paperID":"854993"},{"content":"Gartner Says Smartglasses Will Bring Innovation to Workplace Efficiency. http://gtnr.it/1qqbXce.","paperID":"None"},{"content":"Stuart Goose , Sandra Sudarsky , Xiang Zhang , Nassir Navab, Speech-Enabled Augmented Reality Supporting Mobile Industrial Maintenance, IEEE Pervasive Computing, v.2 n.1, p.65-70, January 2003","paperID":"642742"},{"content":"Steven J. Henderson , Steven K. Feiner, Augmented reality in the psychomotor phase of a procedural task, Proceedings of the 2011 10th IEEE International Symposium on Mixed and Augmented Reality, p.191-200, October 26-29, 2011","paperID":"2120187"},{"content":"Hung, G. K., & Ciuffreda, K. J. Models of the Visual System. Springer Science, 2002.","paperID":"None"},{"content":"Robert E. Kraut , Susan R. Fussell , Jane Siegel, Visual information as a conversational resource in collaborative physical tasks, Human-Computer Interaction, v.18 n.1, p.13-49, June 2003","paperID":"1466532"},{"content":"Lee, J. D., & See, K. A. Trust in automation: Designing for appropriate reliance. Human Factors, 46(1):50--80, 2004.","paperID":"None"},{"content":"Machinery Maintenance & Heavy Equipment Repair Services Market Research Report, 2014. http://bit.ly/1kVmv6N.","paperID":"None"},{"content":"Mackay, W. E.. Users and customizable software: A coadaptive phenomenon. PhD thesis, 1990.","paperID":"None"},{"content":"Mann, S. Wearable computing. The Encyclopedia of HCI, 2nd Ed., 2013.","paperID":"None"},{"content":"Mann, S., Lo, R. C., Ovtcharov, K., Gu, S., Dai, D., Ngan, C., & Ai, T. Realtime high dynamic range video for eyetap wearable computers, fpga- based seeing aids, and glasseye. In Proc. 25th CCECE, 1--6, 2012.","paperID":"None"},{"content":"U. Neumann , A. Majoros, Cognitive, Performance, and Systems Issues for Augmented Reality Applications in Manufacturing and Maintenance, Proceedings of the Virtual Reality Annual International Symposium, p.4, March 14-18, 1998","paperID":"836112"},{"content":"Jennifer J. Ockerman , Amy R. Pritchett, Preliminary Investigation of Wearable Computers for Task Guidance in Aircraft Inspection, Proceedings of the 2nd IEEE International Symposium on Wearable Computers, p.33, October 19-20, 1998","paperID":"858012"},{"content":"Parasuraman, R., & Riley, V. Humans and automation: Use, misuse, disuse, abuse. Human Factors, 39(2):230253, 1997.","paperID":"None"},{"content":"Pineles, S. L., Velez, F. G., Isenberg, S. J., Fenoglio, Z., Birch, E., Nusinowitz, S., & Demer, J. L. Functional burden of strabismus: Decreased binocular summation and binocular inhibition. JAMA ophthalmology, 131(11):1413--1419, 2013.","paperID":"None"},{"content":"Reiss, M., & Reiss, G. Ocular dominance: some family data. Laterality: Asymmetries of Body, Brain and Cognition, 2(1):7--16, 1997.","paperID":"None"},{"content":"Richardson, M., Jones, G. & Torrance, M.. Identifying the task variables that influence perceived object assembly complexity, Ergonomics, 47(9), 945--64, 2004.","paperID":"None"},{"content":"Rhodes, B. J. The wearable remembrance agent: A system for augmented memory. Personal Technologies, 1(4):218--224, 1997.","paperID":"None"},{"content":"Jane Siegel , Malcolm Bauer, A Field Usability Evaluation of a Wearable System, Proceedings of the 1st IEEE International Symposium on Wearable Computers, p.18, October 13-14, 1997","paperID":"856446"},{"content":"D. Siewiorek , A. Smailagic , L. Bass , J. Siegel , R. Martin , B. Bennington, Adtranz: A Mobile Computing System for Maintenance and Collaboration, Proceedings of the 2nd IEEE International Symposium on Wearable Computers, p.25, October 19-20, 1998","paperID":"858011"},{"content":"Asim Smailagic , Daniel Siewiorek, Application Design for Wearable and Context-Aware Computers, IEEE Pervasive Computing, v.1 n.4, p.20-29, October 2002","paperID":"612873"},{"content":"Smart Glass Market by Technology -- 2020. http://bit.ly/1thCiOK.","paperID":"None"},{"content":"Thad Starner, The Challenges of Wearable Computing: Part 1, IEEE Micro, v.21 n.4, p.44-52, July 2001","paperID":"624463"},{"content":"Starner, T., Mann, S., Rhodes, B., Levine, J., Healey, J., Kirsch, D., Picard, R. W., & Pentland, A. Augmented reality through wearable computing. Presence: Teleoperators and Virtual Environments, 6(4):386--398, 1997.","paperID":"None"},{"content":"Stidwill, D., & Fletcher, R. Normal Binocular Vision: Theory, Investigation and Practical Aspects. John Wiley & Sons, 2010.","paperID":"None"},{"content":"Thompson, C., Najjar, L. J., & Ockerman, J. J. Wearable computer based training and performance support systems. In Proc. the Interservice/Industry Training, Simulation & Education Conf., 1997.","paperID":"None"},{"content":"Marjaana Träskbäack , Michael Haller, Mixed reality training application for an oil refinery: user requirements, Proceedings of the 2004 ACM SIGGRAPH international conference on Virtual Reality continuum and its applications in industry, June 16-18, 2004, Singapore","paperID":"1044658"},{"content":"Trope, Y., & Liberman, N. Construal-level theory of psychological distance. Psychological review, 117(2):440, 2010.","paperID":"None"},{"content":"Kimberly A. Weaver , Hannes Baumann , Thad Starner , Hendrick Iben , Michael Lawo, An empirical task analysis of warehouse order picking using head-mounted displays, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753580"},{"content":"Wickens, C. D. Processing resources in attention. (Parasuraman R, Davies R), editors. Varieties of attention, 1984.","paperID":"None"},{"content":"Williams, L. E. & Bargh, J. A. Keeping one's distance the influence of spatial distance cues on aect and evaluation. Psychological Science, 19(3):302--308, 200.","paperID":"None"},{"content":"World Vehicle Population Tops 1 Billion Units WardsAuto. http://bit.ly/1jugNFm.","paperID":"None"}],"abstract":"Exciting developments in eye-wearable technology and its potential industrial applications warrant a thorough understanding of its advantages and drawbacks through empirical evidence. We conducted an experiment to investigate what characteristics of eye-wearable technology impact user performance in machine maintenance, which included a representative set of car maintenance tasks involving Locate, Manipulate, and Compare actions. Participants were asked to follow instructions displayed on one of four technologies: a peripheral eye-wearable display, a central eye-wearable display, a tablet, or a paper manual. We found a significant effect of display position: the peripheral eye-wearable display resulted in longer completion time than the central display; but no effect for hands-free operation. The technology effects were also modulated by different Tasks and Action types. We discuss the human factors implications for designing more effective eye-wearable technology, including display position, issues of monocular display, and how the physical proximity of the technology affects users' reliance level.","title":"Eye-Wearable Technology for Machine Maintenance: Effects of Display Position and Hands-free Operation","filename":"CHI15/p2125","authors":["Xianjun Sam Zheng","Cedric Foucault","Patrik Matos da Silva","Siddharth Dasari","Tao Yang","Stuart Goose"],"conference":"CHI '15"}