{"paperId":2702483,"abstract":"One reason that human interaction with technology is difficult to understand is because the way in which people perform interactive tasks is highly adaptive. One such interactive task is menu search. In the current article we test the hypothesis that menu search is rationally adapted to (1) the ecological structure of interaction, (2) cognitive and perceptual limits, and (3) the goal to maximise the trade-off between speed and accuracy. Unlike in previous models, no assumptions are made about the strategies available to or adopted by users, rather the menu search problem is specified as a reinforcement learning problem and behaviour emerges by finding the optimal Markov Decision Process (MDP). The model is tested against existing empirical findings concerning the effect of menu organisation and menu length. The model predicts the effect of these variables on task completion time and eye movements. The discussion considers the pros and cons of the modelling approach relative to other well-known mod- elling approaches.","citation":[],"reference":[{"content":"Gilles Bailly , Sylvain Malacria, MenuInspector: Outil pour l'analyse des menus et cas d'étude, Proceedings of the 25th IEME conference francophone on l'Interaction Homme-Machine, November 12-15, 2013, Talence, France","paperID":"2534917"},{"content":"Gilles Bailly , Antti Oulasvirta , Duncan P. Brumby , Andrew Howes, Model of visual search and selection time in linear menus, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557093"},{"content":"Gilles Bailly , Antti Oulasvirta , Timo Kötzing , Sabrina Hoppe, MenuOptimizer: interactive optimization of menu systems, Proceedings of the 26th annual ACM symposium on User interface software and technology, October 08-11, 2013, St. Andrews, Scotland, United Kingdom","paperID":"2502024"},{"content":"Baloh, R. W., Sills, A. W., Kumley, W. E., and Honrubia, V. Quantitative measurement of saccade amplitude, duration, and velocity. Neurology 25, 11 (1975), 1065--1065.","paperID":"None"},{"content":"Baron, S., and Kleinman, D. L. The human as an optimal controller and information processor. Man-Machine Systems, IEEE Transactions on 10, 1 (1969), 9--17.","paperID":"None"},{"content":"Brumby, D., and Howes, A. Strategies for Guiding Interactive Search: An Empirical Investigation Into the Consequences of Label Relevance for Assessment and Selection. Human-Computer Interaction 23, 1 (Jan. 2008), 1--46.","paperID":"None"},{"content":"Duncan P. Brumby , Anna L. Cox , Jacqueline Chung , Byron Fernandes, How does knowing what you are looking for change visual search behavior?, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557064"},{"content":"Brumby, D. P., and Howes, A. Good enough but i'll just check: Web-page search as attentional refocusing. In ICCM (2004), 46--51.","paperID":"None"},{"content":"Duncan P. Brumby , Dario D. Salvucci , Andrew Howes, Focus on driving: how cognitive constraints shape the adaptation of strategy when dialing while driving, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518950"},{"content":"Byrne, M. D. ACT-R/PM and menu selection: Applying a cognitive architecture to HCI. International Journal of Human-Computer Studies 55, 1 (2001), 41--84.","paperID":"None"},{"content":"Charman, S. C., and Howes, A. The adaptive user: an investigation into the cognitive and task constraints on the generation of new methods. Journal of experimental psychology. Applied 9, 4 (2003), 236--48.","paperID":"None"},{"content":"Chen, X, Howes, A., Lewis, R.L., Myers, C.W., Houpt, J. Discovering computationally rational eye movements in the distractor ratio task. In Reinforcement Learning and Decision Making (Princeton, 2013).","paperID":"None"},{"content":"Andy Cockburn , Carl Gutwin , Saul Greenberg, A predictive model of menu performance, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240723"},{"content":"Fu, W.-T., and Gray, W. D. Resolving the paradox of the active user : stable suboptimal performance in interactive tasks. Cognitive Science 28 (2004), 901--935.","paperID":"None"},{"content":"Wai-Tat Fu , Peter Pirolli, SNIF-ACT: a cognitive model of user navigation on the world wide web, Human-Computer Interaction, v.22 n.4, p.355-412, November 2007","paperID":"1466608"},{"content":"Gray, W. D., Sims, C. R., Fu, W.-T., and Schoelles, M. J. The soft constraints hypothesis: a rational analysis approach to resource allocation for interactive behavior. Psychological review 113, 3 (2006), 461--82.","paperID":"None"},{"content":"Tim Halverson , Anthony J. Hornof, A minimal model for predicting visual search in human-computer interaction, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240693"},{"content":"Tim Halverson , AnthonyJ. Hornof, A Computational Model of “Active Vision” for Visual Search in Human–Computer Interaction, Human-Computer Interaction, v.26 n.4, p.285-314, October-December","paperID":"2499326"},{"content":"Hayhoe, M., and Ballard, D. Modeling task control of eye movements. Current Biology 24, 13 (2014), R622--R628.","paperID":"None"},{"content":"Anthony J. Hornof , Tim Halverson, Cognitive strategies and eye movements for searching hierarchical computer displays, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642656"},{"content":"Howes, A., Lewis, R. L., and Vera, A. Rational adaptation under task and processing constraints: implications for testing theories of cognition and action. Psychological Review 116, 4 (2009), 717--751.","paperID":"None"},{"content":"Howes, A., Vera, A., Lewis, R. L., and McCurdy, M. Cognitive constraint modeling: A formal approach to supporting reasoning about behavior. Proc. Cognitive Science Society (2004), 595--600.","paperID":"None"},{"content":"Inhoff, A. W., and Rayner, K. Parafoveal word perception: A case against semantic preprocessing. Perception & Psychophysics 27, 5 (1980), 457--464.","paperID":"None"},{"content":"Janssen, C. P., Brumby, D. P., Dowell, J., Chater, N., and Howes, A. Identifying optimum performance trade-offs using a cognitively bounded rational analysis model of discretionary task interleaving. Topics in Cognitive Science 3, 1 (2011), 123--139.","paperID":"None"},{"content":"David E. Kieras , Anthony J. Hornof, Towards accurate and practical predictive models of active-vision-based visual search, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557324"},{"content":"Stelios Lelis , Andrew Howes, Informing decisions: how people use online rating information to make choices, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979278"},{"content":"Lewis, R., Howes, A., and Singh, S. Computational rationality: linking mechanism and behavior through bounded utility maximization. Topics in Cognitive Science 6, 2 (2014), 279--311.","paperID":"None"},{"content":"Craig S. Miller , Roger W. Remington, Modeling information navigation: implications for information architecture, Human-Computer Interaction, v.19 n.3, p.225-271, September 2004","paperID":"1466557"},{"content":"Jose Nunez-Varela , Jeremy L. Wyatt, Models of gaze control for manipulation tasks, ACM Transactions on Applied Perception (TAP), v.10 n.4, p.1-22, October 2013","paperID":"2536767"},{"content":"O'Hara, K. P., and Payne, S. J. The effects of operator implementation cost on planfulness of problem solving and learning. Cognitive psychology 35, 1 (1998), 34--70.","paperID":"None"},{"content":"Stephen J. Payne , Andrew Howes, Adaptive Interaction: A Utility Maximization Approach to Understanding Human Interaction with Technology, Morgan & Claypool Publishers, 2013","paperID":"2534478"},{"content":"Payne, S. J., Howes, A., and Reader, W. R. Adaptively distributing cognition: a decision-making perspective on human-computer interaction. Behaviour & Information Technology 20, 5 (2001), 339--346.","paperID":"None"},{"content":"Peter L. T. Pirolli, Information Foraging Theory: Adaptive Interaction with Information, Oxford University Press, Inc., New York, NY, 2007","paperID":"1450927"},{"content":"Pirolli, P., and Card, S. Information foraging. Psychological Review 106 (1999), 643--675.","paperID":"None"},{"content":"Rayner, K. Eye movements in reading and information processing: 20 years of research. Psychological bulletin 124, 3 (1998), 372.","paperID":"None"},{"content":"Stuart J. Russell , Devika Subramanian, Provably bounded-optimal agents, Journal of Artificial Intelligence Research, v.2 n.1, p.575-609, August 1994","paperID":"1622844"},{"content":"Sprague, N., and Ballard, D. Eye movements for reward maximization. Advances in neural information processing systems 16 (2004), 1419--1433.","paperID":"None"},{"content":"Richard S. Sutton , Andrew G. Barto, Introduction to Reinforcement Learning, MIT Press, Cambridge, MA, 1998","paperID":"551283"},{"content":"Trommershäuser, J., Maloney, L. T., and Landy, M. S. The Expected Utility of Movement. Brain (2009), 95--111.","paperID":"None"},{"content":"Yuan-Chi Tseng , Andrew Howes, The adaptation of visual search strategy to expected information gain, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357221"},{"content":"Alonso Vera , Andrew Howes , Michael McCurdy , Richard L. Lewis, A constraint satisfaction approach to predicting skilled interactive cognition, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.121-128, April 24-29, 2004, Vienna, Austria","paperID":"985708"},{"content":"Yunfeng Zhang , Anthony J. Hornof, Understanding multitasking through parallelized strategy exploration and individualized cognitive modeling, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557351"}],"title":"The Emergence of Interactive Behavior: A Model of Rational Menu Search","filename":"CHI15/p4217","authors":["Xiuli Chen","Gilles Bailly","Duncan P. Brumby","Antti Oulasvirta","Andrew Howes"],"conference":"CHI '15"}