{"paperId":2702470,"citation":[{"content":"Alvin Yuan , Kurt Luther , Markus Krause , Sophie Isabel Vennix , Steven P Dow , Bjorn Hartmann, Almost an Expert: The Effects of Rubrics and Expertise on Perceived Value of Crowdsourced Design Critiques, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819953"}],"reference":[{"content":"Clarke, A.D., Halley, F., Newell, A.J., Griffin, L.D. and Chantler, M.J. Perceptual similarity: a texture challenge. In Proc BMVC, (2011).","paperID":"None"},{"content":"Coffield, F., Moseley, D., Hall, E. and Ecclestone, K. Should we be using learning styles?: what research has to say to practice. Learning & Skills Research Centre. (2004).","paperID":"None"},{"content":"Cook, E., Teasley, S.D., and Ackerman, M.S. Contribution, commercialization & audience: understanding participation in an online creative community. In Proc Group2009, ACM (2009), 41--50.","paperID":"None"},{"content":"Corbin, J. and Strauss, A. Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage. (2008).","paperID":"None"},{"content":"Cox, T.F. and Cox, M.A.A. Multidimensional Scaling (Second Edition ed.). Chapman & Hall/CRC. (2001).","paperID":"None"},{"content":"CrowdFlower, http://www.crowdflower.com (last accessed Sept.20th 2014)","paperID":"None"},{"content":"Delort, J.Y., Arunasalam, B. and Paris, C. Automatic Moderation of Online Discussion Sites. IJEC, 15(3), (2011), 9--30.","paperID":"None"},{"content":"Dow, S., Gerber, E., and Wong, A. A pilot study of using crowds in the classroom. In Proc CHI2013, ACM (2013), 227--236.","paperID":"None"},{"content":"Egorova, M., Safonov, I. and Korobkov, N. Collage for Cover of PhotoBook. In GraphiCon, (2008), 160--163.","paperID":"None"},{"content":"Ekman, P. Expression and the nature of emotion. Approaches to emotion. Lawrence Erlbaum Associates (1984), 319--344.","paperID":"None"},{"content":"Evans, J. St B. T. Two minds rationality. Thinking & Reasoning, 20(2), Routledge (2013), 129--146.","paperID":"None"},{"content":"Everitt B. Cluster Analysis. Heinemann. (1974).","paperID":"None"},{"content":"Fan, J., Gao, Y., Luo, H., Keim, D.A. and Li, Z. A novel approach to enable semantic and visual image summarization for exploratory image search. In Proc MIR2008, ACM (2008), 358--365.","paperID":"None"},{"content":"Garner, S. and McDonagh-Philp, D. Problem interpretation and resolution via visual stimuli: the use of \"mood boards\" in design education. J Art Design Educ, 20(1), Blackwell (2001), 57--64.","paperID":"None"},{"content":"Junghöfer, M., Bradley, M.M., Elbert, T.R. and Lang, P.J. Fleeting images: A new look at early emotion discrimination. Psychophysiology, 38(2), Cambridge Univ Press (2001), 175--178.","paperID":"None"},{"content":"Kozhevnikov, M. Cognitive styles in the context of modern psychology: Toward an integrated framework of cognitive style. Psychol Bull, 133(3), APA (2007), 464--481.","paperID":"None"},{"content":"Lee, J., Park, D.H. and Han, I. The effect of negative online consumer reviews on product attitude: An information processing view. Electron Com R A, 7(3), Elsevier (2008), 341--352.","paperID":"None"},{"content":"Lerner, J.S., Small, D.A. and Loewenstein, G. Research Report Heart Strings and Purse Strings Carryover Effects of Emotions on Economic Decisions. Psychological Science, 15(5), APS (2004), 337--341.","paperID":"None"},{"content":"Luther, K., Pavel, A., Wu, W., Tolentino, J.-l., Agrawala, M., Hartmann, B., Dow, S.P. CrowdCrit: crowdsourcing and aggregating visual design critique. In Proc CSCW2014, ACM (2014), 21--24.","paperID":"None"},{"content":"McCandless, D. Information is beautiful, Collins. (2009).","paperID":"None"},{"content":"Mikels, J.A., Fredrickson, B.L., Larkin, G.R., Lindberg, C.M., Maglio, S.J. and Reuter-Lorenz, P.A. Emotional category data on images from the International Affective Picture System. Behav Res Methods, 37(4), Springer (2005), 626--630.","paperID":"None"},{"content":"Nagamachi M. Kansei engineering: a new ergonomic consumer-oriented technology for product development, Int J.Industrial Ergonomics 15(1) (1995), 3--11.","paperID":"None"},{"content":"Oppenheim A.N. Questionnaire Design and Attitude Measurement, Heinemann, (1966).","paperID":"None"},{"content":"Padilla, S., Halley, F., Robb, D. and Chantler, M.J. Intuitive Large Image Database Browsing using Perceptual Similarity Enriched by Crowds. In Proc CAIP2013, Springer (2013).","paperID":"None"},{"content":"Plutchik, R. Emotions and life : perspectives from psychology, biology, and evolution (1st ed.), APA. (2003).","paperID":"None"},{"content":"Riding, R.J. On the nature of cognitive style. Educational Psychology, 17(1--2), Routledge (1997), 2949.","paperID":"None"},{"content":"Riding, R.J. and Cheema, I. Cognitive Styles - an overview and integration. Educational Psychology, 11(3-4), Routledge (1991), 193--215.","paperID":"None"},{"content":"Rother, C., Bordeaux, L., Hamadi, Y. and Blake, A. AutoCollage. ACM Trans. Graph., 25(3), (2006), 847--852.","paperID":"None"},{"content":"Sanders, L. and Simons, G. A Social Vision for Value Co-creation in Design. (Value Co-Creation) Open Source Business Resource, (2009).","paperID":"None"},{"content":"Strauss, A.L. Qualitative analysis for social scientist, Cambridge University Press. (1987).","paperID":"None"},{"content":"Surowiecki, J. The wisdom of crowds: why the many are smarter than the few and how collective wisdom shapes business, Economies, Societies and Nations. Anchor. (2004).","paperID":"None"},{"content":"Talwar, A., Jurca, R. and Faltings, B. Understanding user behavior in online feedback reporting. In Proc EC2007, ACM (2007), 132--142.","paperID":"None"},{"content":"Tiedens, L.Z. and Linton, S. Judgment under emotional certainty and uncertainty: the effects of specific emotions on information processing. J Pers Soc Psychol, 81(6), APA (2001), 973.","paperID":"None"},{"content":"Tsytsarau M. and Palpanas T. Survey on mining subjective data on the web. Data Min Knowl Discov 24(3), ACM (2012), 478--514.","paperID":"None"},{"content":"Vesanto, J., Himberg, J., Alhoniemi, E. and Parhankangas, J. Self-organizing map in Matlab: the som toolbox. In Proc. Matlab DSP Conf, (1999), 35--40.","paperID":"None"},{"content":"Xu, A., and Bailey, B. What do you think?: a case study of benefit, expectation, and interaction in a large online critique community. In Proc CSCW2012, ACM (2012), 295--304.","paperID":"None"},{"content":"Xu, A., Huang, S.-W. and Bailey, B.P. Voyant: Generating Structured Feedback on Visual Designs Using a Crowd of Non-Experts. In Proc CSCW2014, ACM (2014), 37--40.","paperID":"None"}],"abstract":"Cognitive styles theories suggest that we divide into visual and verbal thinkers. In this paper we describe a method designed to encourage visual communication between designers and their audiences. This new visual feedback method is based on enabling fast intuitive selections by the crowd from image banks when responding to an idea. Visual summarization reduces the massed image choices to a small number of representative images. These summaries are then consumed at a glance by designers receiving the feedback leading to thoughtful reflection on their designs. We report an evaluation using two types of imagery for feedback. Twelve designers took part, receiving visual feedback in response to their designs. In semi-structured interviews they described their interpretation of the feedback, how it inspired them to change their designs and contrasted it with text feedback. Eleven of the twelve designers revealed that they would be enthusiastic users of a service providing this new mode of feedback.","video":"http://www.youtube.com/embed/8PIfMwpx2Qc?rel=0","title":"Crowdsourced Feedback With Imagery Rather Than Text: Would Designers Use It?","filename":"CHI15/p1355","authors":["David A. Robb","Stefano Padilla","Britta Kalkreuter","Mike J. Chantler"],"conference":"CHI '15"}