{"paperId":2702223,"abstract":"We address in this work the process of agreement rate analysis for characterizing the level of consensus between participants' proposals elicited during guessability studies. Two new measures, i.e., disagreement rate for referents and coagreement rate between referents, are proposed to accompany the widely-used agreement rate formula of Wobbrock et al. [37] when reporting participants' consensus for symbolic input. A statistical significance test for comparing the agreement rates of k>=2 referents is presented in analogy with Cochran's success/failure Q test [5], for which we express the test statistic in terms of agreement and coagreement rates. We deliver a toolkit to assist practitioners to compute agreement, disagreement, and coagreement rates, and run statistical tests for agreement rates at p=.05, .01, and .001 levels of significance. We validate our theoretical development of agreement rate analysis in relation with several previously published elicitation studies. For example, when we present the probability distribution function of the agreement rate measure, we also use it (1) to explain the magnitude of agreement rates previously reported in the literature, and (2) to propose qualitative interpretations for agreement rates, in analogy with Cohen's guidelines for effect sizes [6]. We also re-examine previously published elicitation data from the perspective of the agreement rate test statistic, and highlight new findings on the effect of referents over agreement rates, unattainable prior to this work. We hope that our contributions will advance the current knowledge in agreement rate analysis, providing researchers and practitioners with new techniques and tools to help them understand user-elicited data at deeper levels of detail and sophistication.","citation":[],"reference":[{"content":"Bailly, G., Pietrzak, T., Deber, J., and Wigdor, D. J. Métamorphe: Augmenting hotkey usage with actuated keys. In Proc. of CHI '13, ACM (2013), 563--572.","paperID":"None"},{"content":"Bergvall-Kåreborn, B., and Ståhlbrost, A. Participatory design: One step back or two steps forward? In Proc. of PDC '08, Indiana University (2008), 102--111.","paperID":"None"},{"content":"Buchanan, S., Floyd, B., Holderness, W., and LaViola, J. J. Towards user-defined multi-touch gestures for 3D objects. In Proc. of ITS '13, ACM (2013), 231--240.","paperID":"None"},{"content":"Chong, M. K., and Gellersen, H. W. How groups of users associate wireless devices. In Proc. of CHI '13, ACM (2013), 1559--1568.","paperID":"None"},{"content":"Cochran, W. G. The comparison of percentages in matched samples. Biometrika 37, 3/4 (1950), 256--266.","paperID":"None"},{"content":"Cohen, J. A coefficient of agreement for nominal scales. 37--46.","paperID":"None"},{"content":"Cohen, J. A power primer. Psychological Bulletin 112, 1 (1992), 155--159.","paperID":"None"},{"content":"Findlater, L., Lee, B., and Wobbrock, J. Beyond QWERTY: Augmenting touch screen keyboards with multi-touch gestures for non-alphanumeric input. In Proc. of CHI '12, ACM (2012), 2679--2682.","paperID":"None"},{"content":"James, R. C. The Mathematics Dictionary, 5th Ed. Chapman & Hall, New York, 1992.","paperID":"None"},{"content":"Kaptein, M., and Robertson, J. Rethinking statistical analysis methods for CHI. In Proc. of CHI '12, ACM (2012), 1105--1114.","paperID":"None"},{"content":"Kaptein, M. C., Nass, C., and Markopoulos, P. Powerful and consistent analysis of likert-type ratingscales. In Proc. of CHI '10, ACM (2010), 2391--2394.","paperID":"None"},{"content":"Kendall, M. G., and Babington Smith, B. The problem of m rankings. Annals of Math. Stats. 10, 3 (1939), 275--287.","paperID":"None"},{"content":"Kensing, F., and Blomberg, J. Participatory design: Issues and concerns. Computer Supported Cooperative Work 7, 3--4 (Jan. 1998), 167--185.","paperID":"None"},{"content":"Kray, C., Nesbitt, D., Dawson, J., and Rohs, M. User-defined gestures for connecting mobile phones, public displays, and tabletops. In Proc. of MobileHCI '10, ACM (2010), 239--248.","paperID":"None"},{"content":"KurdyUnited Kingdomova, E., Redlin, M., and André, E. Studying user-defined ipad gestures for interaction in multi-display environment. In Proc. of UI '12, ACM (2012), 93--96.","paperID":"None"},{"content":"Liang, H.-N., Williams, C., Semegen, M., Stuerzlinger, W., and Irani, P. User-defined surface+motion gestures for 3D manipulation of objects at a distance through a mobile device. In Proc. of APCHI '12, ACM (2012), 299--308.","paperID":"None"},{"content":"Martens, J.-B. Interactive statistics with illmo. ACM Trans. Interact. Intell. Syst. 4, 1 (Apr. 2014), 4:1--4:28.","paperID":"None"},{"content":"Mauney, D., Howarth, J., Wirtanen, A., and Capra, M. Cultural similarities and differences in user-defined gestures for touchscreen user interfaces. In Proc. of CHI EA '10, ACM (2010), 4015--4020.","paperID":"None"},{"content":"McNemar, Q. Note on the sampling error of the difference between correlated proportions or percentages. Psychometrika 12, 2 (June 1947), 153--157.","paperID":"None"},{"content":"Morris, M. R. Web on the wall: Insights from a multimodal interaction elicitation study. In Proc. of ITS '12, ACM (2012), 95--104.","paperID":"None"},{"content":"Morris, M. R., Danielescu, A., Drucker, S., Fisher, D., Lee, B., schraefel, m. c., and Wobbrock, J. O. Reducing legacy bias in gesture elicitation studies. Interactions 21, 3 (May 2014), 40--45.","paperID":"None"},{"content":"Morris, M. R., Wobbrock, J. O., and Wilson, A. D. Understanding users' preferences for surface gestures. In Proc. of GI '10, Canadian Inf. Proc.Soc. (2010), 261--268.","paperID":"None"},{"content":"Obaid, M., Häring, M., Kistler, F., Bühling, R., and André, E. User-defined body gestures for navigational control of a humanoid robot. In Proc. of ICSR'12, Springer-Verlag (2012), 367--377.","paperID":"None"},{"content":"Piumsomboon, T., Clark, A., Billinghurst, M., and Cockburn, A. User-defined gestures for augmented reality. In Proc. of CHI EA '13, ACM (2013), 955--960.","paperID":"None"},{"content":"Piumsomboon, T., Clark, A., Billinghurst, M., and Cockburn, A. User-defined gestures for augmented reality. In Proc. of INTERACT '13, Springer (2013), 282--299.","paperID":"None"},{"content":"Pyryeskin, D., Hancock, M., and Hoey, J. Comparing elicited gestures to designer-created gestures for selection above a multitouch surface. In Proc. of ITS '12, ACM (2012), 1--10.","paperID":"None"},{"content":"Ruiz, J., Li, Y., and Lank, E. User-defined motion gestures for mobile interaction. In Proc. of CHI '11, ACM (2011), 197--206.","paperID":"None"},{"content":"Sedgewick, R. Permutation generation methods. ACM Computing Surveys 9, 2 (June 1977), 137--164.","paperID":"None"},{"content":"Seyed, T., Burns, C., Costa Sousa, M., Maurer, F., and Tang, A. Eliciting usable gestures for multi-display environments. In Proc. of ITS '12, ACM (2012), 41--50.","paperID":"None"},{"content":"Sheskin, D. J. Handbook of Parametric and Nonparametric Statistical Procedures: Third Edition. CRC Press, 2004.","paperID":"None"},{"content":"Valdes, C., Eastman, D., Grote, C., Thatte, S., Shaer, O., Mazalek, A., Ullmer, B., and Konkel, M. K. Exploring the design space of gestural interaction with active tokens through user-defined gestures. In Proc. of CHI '14, ACM (2014), 4107--4116.","paperID":"None"},{"content":"Vatavu, R.-D. User-defined gestures for free-hand TV control. In Proc. of EuroiTV '12, ACM (2012), 45--48.","paperID":"None"},{"content":"Vatavu, R.-D. A comparative study of user-defined handheld vs. freehand gestures for home entertainment environments. Journal of Ambient Intelligence and Smart Environments 5, 2 (2013), 187--211.","paperID":"None"},{"content":"Vatavu, R.-D., and Zaiti, I.-A. Leap gestures for TV: Insights from an elicitation study. In Proc. of TVX '14, ACM (2014), 131--138.","paperID":"None"},{"content":"Weigel, M., Mehta, V., and Steimle, J. More than touch: Understanding how people use skin as an input surface for mobile computing. In Proc. of CHI '14, ACM (2014), 179--188.","paperID":"None"},{"content":"Weisstein, E. W. CRC Concise Encyclopedia of Mathematics, 2nd Ed. Chapman & Hall, New York, 2003.","paperID":"None"},{"content":"Wobbrock, J. O., Aung, H. H., Rothrock, B., and Myers, B. A. Maximizing the guessability of symbolic input. In Proc. of CHI EA '05, ACM (2005), 1869--1872.","paperID":"None"},{"content":"Wobbrock, J. O., Findlater, L., Gergle, D., and Higgins, J. J. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proc. of CHI '11, ACM (2011), 143--146.","paperID":"None"},{"content":"Wobbrock, J. O., Morris, M. R., and Wilson, A. D. User-defined gestures for surface computing. In Proc. of CHI '09, ACM (2009), 1083--1092.","paperID":"None"}],"title":"Formalizing Agreement Analysis for Elicitation Studies: New Measures, Significance Test, and Toolkit","filename":"CHI15/p1325","authors":["Radu-Daniel Vatavu","Jacob O. Wobbrock"],"conference":"CHI '15"}