{"paperId":2702362,"abstract":"People have been making things for a long time, yet digital making has developed mostly within an industrial context. We question how non-digital craft cultures can inform the design of digital tools. Furthermore, what methods can help us understand these cultures in ways that are relevant to digital practice? As makers ourselves, we see potential for collaborative making to mitigate barriers in communication and provide insight into non-digital practices and values. To evaluate this approach, we visited a hunter-gatherer community that preserves an ancient craft, bringing with us digital design and fabrication tools. Working together, we merged digital tools with ostrich eggshell jewelry craft. We use this experience to draw conclusions about making as a form of communication, the importance of supporting appropriation and immediacy in collaborations, the challenge of combining abstract design tools with concrete approaches, and the value of incorporating design and making into communal life.","citation":[{"content":"Cesar Torres , Eric Paulos, MetaMorphe: Designing Expressive 3D Models for Digital Fabrication, Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition, June 22-25, 2015, Glasgow, United Kingdom","paperID":"2757235"},{"content":"Kristin A. Searle , Yasmin B. Kafai, Boys' Needlework: Understanding Gendered and Indigenous Perspectives on Computing and Crafting with Electronic Textiles, Proceedings of the eleventh annual International Conference on International Computing Education Research, July 09-13, 2015, Omaha, Nebraska, USA","paperID":"2787724"}],"reference":[{"content":"Bardzell, S., Rosner, D. K., and Bardzell, J. 2012. Crafting quality in design: integrity, creativity, and public sensibility. Proceedings of the Designing Interactive Systems Conference, June 11--15.","paperID":"None"},{"content":"Biesele, M. 1996. Women Like Meat: The Folklore and Foraging Ideology of the Kalahari Ju/'Hoan. Wits University Press, January.","paperID":"None"},{"content":"Biesele, M. and Robert K. H. 2013. The Ju/'Hoan San of Nyae Nyae and Namibian Independence: Development, Democracy, and Indigenous Voices in Southern Africa. Berghahn Books; Reprint edition, February.","paperID":"None"},{"content":"Buechley. L., and Perner-Wilson, H. 2012. Crafting technology: Reimagining the processes, materials, and cultures of electronics. ACM Trans. Comput.-Hum. Interact. 19, 3, Article 21, October, 21 pages.","paperID":"None"},{"content":"Dray, S. M., Siegel, D. A., and Kotzé, P. 2003. Indra's Net: HCI in the developing world. Interactions 10(2): 28--37.","paperID":"None"},{"content":"Fab Foundation. http://www.fabfoundation.org/fab-labs/ Last accessed July 23, 2014.","paperID":"None"},{"content":"Follmer, S., Carr D., Lovell, E., and Ishii, H. 2010. CopyCAD: remixing physical objects with copy and paste from the real world. In Adjunct proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10).","paperID":"None"},{"content":"Hiller, J., and Lipson, H. 2009. Design and analysis of digital materials for physical 3D voxel printing. Rapid Prototyping Journal, 15/2, 137--149. Emerald.","paperID":"None"},{"content":"Kensing, F. and Blomberg, J. 1998. Participatory design: Issues and concerns. Computer Supported Cooperative Work (CSCW).","paperID":"None"},{"content":"Jacobs, J., and Buechley, L. 2013. Codeable objects: computational design and digital fabrication for novice programmers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13).","paperID":"None"},{"content":"Jacobs, J., Resnick, M., and Buechley, L. 2014. Dresscode: supporting youth in computational design and making. In Proceedings of Constructionism 2014 Conference. Vienna, Austria.","paperID":"None"},{"content":"Lee, R. 2012. The dobe Ju/'hoansi, 4th ed. Thomson learning.","paperID":"None"},{"content":"Marshall, L. J. 2004. Nyae Nyae !Kung Beliefs and Rites. Peabody Museum Press, December.","paperID":"None"},{"content":"Mueller, S., Mohr, T., Guenther, K., Frohnhofen, J., Rollmann, K.A., and Baudisch, P. 2014. faBrickation: fast 3D printing of functional objects by integrating construction kit building blocks. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14).","paperID":"None"},{"content":"Papert, S. 1980. Mindstorms: children, computers, and powerful ideas. Basic Books, Inc., New York, NY.","paperID":"None"},{"content":"Reas, C., McWilliams, C., and LUST. 2010. Form and Code: In Design, Art and Architecture, A Guide to Computational Aesthetics. Princeton Architectural Press.","paperID":"None"},{"content":"Schmitt, P. and Seitinger, S. 2009. Plywood punk: a holistic approach to designing animated artifacts. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (TEI '09). ACM.","paperID":"None"},{"content":"Schneegass, S., Shirazi, A. S., Döring, T., Schmid, D., and Schmidt, A. 2014. NatCut: an interactive tangible editor for physical object fabrication. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14).","paperID":"None"},{"content":"Tanenbaum, J., Williams, A., Desjardins, A., and Tanenbaum, K. 2013. Democratizing technology: pleasure, utility and expressiveness in DIY and maker practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13).","paperID":"None"},{"content":"Wiessner, P. 1997. Seeking Guidelines through an Evolutionary Approach: Style Revisited among the !Kung San (Ju/'hoansi) of the 1990s. Archeological Papers of the American Anthropological Association.","paperID":"None"},{"content":"Zoran, A. 2013. Hybrid Basketry: Interweaving digital practice within contemporary craft. In ACM SIGGRAPH 2013 Art Gallery.","paperID":"None"},{"content":"Zoran, A. and Buechley, L. 2013. Hybrid reAssemblage: An Exploration of Craft, Digital Fabrication and Artifact Uniqueness. Leonardo, Journal of Arts, Sciences and Technology, volume 46, issue 1, February 2013.","paperID":"None"},{"content":"Zoran, A., Shilkrot R., and Paradiso, J. A. 2013. Human computer Interaction for Hybrid Carving. The 26th annual ACM symposium on User interface software and technology (UIST '13).","paperID":"None"}],"title":"Hybrid Practice in the Kalahari: Design Collaboration through Digital Tools and Hunter-Gatherer Craft","filename":"CHI15/p619","authors":["Jennifer Jacobs","Amit Zoran"],"conference":"CHI '15"}