{"paperId":2702496,"citation":[],"abstract":"We present a novel approach that integrates algorithmic recommender techniques with interactive faceted filtering methods. We refer to this approach as blended recommending. It allows users to interact with a set of filter facets representing criteria that can serve as input for different recommendation methods including both collaborative and content-based filtering. Users can select filter criteria from these facets and weight them to express their preferences and to exert control over the hybrid recommendation process. In contrast to hard Boolean filtering, the method aggregates the weighted criteria and calculates a ranked list of recommendations that is visualized and immediately updated when users change the filter settings. Based on this approach, we implemented an interactive movie recommender, MyMovieMixer. In a user study, we compared the system with a conventional faceted filtering system that served as a baseline to obtain insights into user interaction behavior and to assess recommendation quality for our system. The results indicate, among other findings, a higher level of perceived user control, more detailed preference settings, and better suitability when the search goal is vague.","video":"http://www.youtube.com/embed/Fr-o3a3XgRs?rel=0","reference":[{"content":"Ahlberg, C., and Shneiderman, B. Visual information seeking: Tight coupling of dynamic query filters with starfield displays. In Proc. CHI '94, ACM (1994), 313--317.","paperID":"None"},{"content":"Baeza-Yates, R., and Ribeiro-Neto, B. Modern Information Retrieval. ACM, 1999.","paperID":"None"},{"content":"Bennett, J., and Lanning, S. The netflix prize. In Proc. KDD Cup and Workshop '07, ACM (2007), 3--6.","paperID":"None"},{"content":"Bostandjiev, S., O'Donovan, J., and Höllerer, T. TasteWeights: A visual interactive hybrid recommender system. In Proc. RecSys '12, ACM (2012), 35--42.","paperID":"None"},{"content":"Brooke, J. SUS -- A quick and dirty usability scale. In Usability Evaluation in Industry. Taylor & Francis, 1996, 189--194.","paperID":"None"},{"content":"Burke, R. Hybrid web recommender systems. In The Adaptive Web. Methods and Strategies of Web Personalization, P. Brusilovsky, A. Kobsa and W. Nejdl, Eds., Springer, 2007, 377--408.","paperID":"None"},{"content":"Celik, I., Abel, F., and Siehndel, P. Towards a framework for adaptive faceted search on twitter. In Proc. DAH '11 (2011).","paperID":"None"},{"content":"Chen, L., and Pu, P. Critiquing-based recommenders: Survey and emerging trends. User Mod. and UserAdapted Interaction 22, 1--2 (2012), 125--150.","paperID":"None"},{"content":"Chi, E. H. Transient user profiling. In Proc. Workshop on User Profiling (2004), 521--523.","paperID":"None"},{"content":"Dooms, S., de Pessemier, T., and Martens, L. Improving IMDb movie recommendations with interactive settings and filters. In Proc. RecSys '14, ACM (2014).","paperID":"None"},{"content":"Gantner, Z., Rendle, S., Freudenthaler, C., and Schmidt-Thieme, L. MyMediaLite: A free recommender system library. In Proc. RecSys '11, ACM (2011), 305--308.","paperID":"None"},{"content":"Girgensohn, A., Shipman, F., Chen, F., and Wilcox, L. DocuBrowse: Faceted searching, browsing, and recommendations in an enterprise context. In Proc. IUI '10, ACM (2010), 189--198.","paperID":"None"},{"content":"Gretarsson, B., O'Donovan, J., Bostandjiev, S., Hall, C., and Höllerer, T. SmallWorlds: Visualizing social recommendations. Computer Graphics Forum 29, 3 (2010), 833--842.","paperID":"None"},{"content":"Hearst, M. A. Search User Interfaces. Cambridge University Press, 2009.","paperID":"None"},{"content":"Karimi, R., Freudenthaler, C., Nanopoulos, A., and Schmidt-Thieme, L. Exploiting the characteristics of matrix factorization for active learning in recommender systems. In Proc. RecSys '12, ACM (2012), 317--320.","paperID":"None"},{"content":"Knijnenburg, B. P., Willemsen, M. C., Gantner, Z., Soncu, H., and Newell, C. Explaining the user experience of recommender systems. User Mod. and User-Adapted Interaction, 22, 4--5 (2012), 441--504.","paperID":"None"},{"content":"Konstan, J. A., and Riedl, J. Recommender systems: From algorithms to user experience. User Mod. and User-Adapted Interaction 22, 1--2 (2012), 101--123.","paperID":"None"},{"content":"Koren, J., Zhang, Y., and Liu, X. Personalized interactive faceted search. In Proc. WWW '08, ACM (2008), 477--485.","paperID":"None"},{"content":"Koren, Y., Bell, R. M., and Volinsky, C. Matrix factorization techniques for recommender systems. IEEE Computer 42, 8 (2009), 30--37.","paperID":"None"},{"content":"Loepp, B., Hussein, T., and Ziegler, J. Choice-based preference elicitation for collaborative filtering recommender systems. In Proc. CHI '14, ACM (2014), 3085--3094.","paperID":"None"},{"content":"Linden, G., Smith, B., and York, J. Amazon.com recommendations: Item-to-item collaborative filtering. IEEE Internet Computing 7, 1 (2003), 76--80.","paperID":"None"},{"content":"Pariser, E. The Filter Bubble: What the Internet is Hiding From You. Penguin Press, 2011.","paperID":"None"},{"content":"Parra, D., Brusilovsky, P., and Trattner, C. See what you want to see: Visual user-driven approach for hybrid recommendation. In Proc. IUI '14, ACM (2014), 235--240.","paperID":"None"},{"content":"Pu, P., Chen, L., and Hu, R. Evaluating recommender systems from the users perspective: Survey of the state of the art. User Mod. and User-Adapted Interaction 22, 4--5 (2012), 317--355.","paperID":"None"},{"content":"Ricci, F., Rokach, L., and Shapira, B. Recommender Systems Handbook. Springer, 2010, ch. Introduction to Recommender Systems Handbook, 1--35.","paperID":"None"},{"content":"Sacco, G. M., and Tzitzikas, Y. Dynamic Taxonomies and Faceted Search. Springer, 2009.","paperID":"None"},{"content":"Salton, G., and Buckley, C. Improving retrieval performance by relevance feedback. In Readings in Information Retrieval. Morgan Kaufmann, 1997, 355--364.","paperID":"None"},{"content":"Thai, V., Rouille, P.-Y., and Handschuh, S. Visual abstraction and ordering in faceted browsing of text collections. ACM Trans. Intell. Syst. Technol. 3, 2 (2012), 21:1--21:24.","paperID":"None"},{"content":"Tintarev, N., and Masthoff, J. Recommender Systems Handbook. Springer, 2010, ch. Designing and Evaluating Explanations for Recommender Systems, 479--510.","paperID":"None"},{"content":"Tvarozek, M., Barla, M., Frivolt, G., Tomsa, M., and Bieliková, M. Improving semantic search via integrated personalized faceted and visual graph navigation. In Proc. SOFSEM '08, Springer (2008), 778--789.","paperID":"None"},{"content":"Vig, J., Sen, S., and Riedl, J. Navigating the tag genome. In Proc. IUI '11, ACM (2011), 93--102.","paperID":"None"},{"content":"Voigt, M., Werstler, A., Polowinski, J., and Meißner, K. Weighted faceted browsing for characteristics-based visualization selection through end users. In Proc. EICS '12, ACM (2012), 151--156.","paperID":"None"},{"content":"Xiao, B., and Benbasat, I. E-commerce product recommendation agents: Use, characteristics, and impact. MIS Quarterly 31, 1 (2007), 137--209.","paperID":"None"},{"content":"Yee, K.-P., Swearingen, K., Li, K. and Hearst, M. Faceted metadata for image search and browsing. In Proc. CHI '03, ACM (2003), 401--408.","paperID":"None"},{"content":"Zadeh, L. Fuzzy sets. Information and Control, 8, 3 (1965), 338--353.","paperID":"None"},{"content":"Zhang, J., Jones, N., and Pu, P. A visual interface for critiquing-based recommender systems. In Proc. EC '08, ACM (2008), 230--239.","paperID":"None"},{"content":"Zhao, X., Zhang, W., and Wang, J. Interactive collaborative filtering. In Proc. CIKM '13, ACM (2013), 1411--1420.","paperID":"None"}],"title":"Blended Recommending: Integrating Interactive Information Filtering and Algorithmic Recommender Techniques","filename":"CHI15/p975","authors":["Benedikt Loepp","Katja Herrmanny","Jürgen Ziegler"],"conference":"CHI '15"}