{"paperId":2702256,"citation":[{"content":"Alena Denisova , Paul Cairns, Adaptation in Digital Games: The Effect of Challenge Adjustment on Player Performance and Experience, Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, October 05-07, 2015, London, United Kingdom","paperID":"2793141"}],"abstract":"Contemporary digital game developers offer a variety of games for the diverse tastes of their customers. Although the gaming experience often depends on one's preferences, the same may not apply to the level of their immersion. It has been argued whether the player perspective can influence the level of player's involvement with the game. The aim of this study was to research whether interacting with a game in first person perspective is more immersive than playing in the third person point of view (POV). The set up to test the theory involved participants playing a role-playing game in either mode, naming their preferred perspective, and subjectively evaluating their immersive experience. The results showed that people were more immersed in the game play when viewing the game world through the eyes of the character, regardless of their preferred perspectives.","reference":[{"content":"Bethesda Game Studios. The Elder Scrolls V: Skyrim. www.elderscrolls.com/skyrim, (2011).","paperID":"None"},{"content":"Emily Brown , Paul Cairns, A grounded investigation of game immersion, CHI '04 Extended Abstracts on Human Factors in Computing Systems, April 24-29, 2004, Vienna, Austria","paperID":"986048"},{"content":"Cairns, P., Cox, A., and Nordin, A. I. Immersion in digital games: a review of gaming experience research. Handbook of digital games, MC Angelides and H. Agius, Eds. Wiley-Blackwell (2014), 339--361.","paperID":"None"},{"content":"Gerald A. Voorhees , Joshua Call , Katie Whitlock, Guns, Grenades, and Grunts: First-Person Shooter Games, Continuum, 2012","paperID":"2424227"},{"content":"Anna Cox , Paul Cairns , Pari Shah , Michael Carroll, Not doing but thinking: the role of challenge in the gaming experience, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207689"},{"content":"Ermi, L., and Mäyrä, F. Power and control of games: children as the actors of game cultures. In DIGRA Conf. (2003).","paperID":"None"},{"content":"Gard, T. Building character. Gama Network: Gamasutra.com (2000).","paperID":"None"},{"content":"Charlene Jennett , Anna L. Cox , Paul Cairns , Samira Dhoparee , Andrew Epps , Tim Tijs , Alison Walton, Measuring and defining the experience of immersion in games, International Journal of Human-Computer Studies, v.66 n.9, p.641-661, September, 2008","paperID":"1393920"},{"content":"Kotaku Magazine. First or third person - what's your perspective? goo.gl/LYlL2W, Apr 2011.","paperID":"None"},{"content":"Francois Dominic Laramee, Game Design Perspectives, Charles River Media, Inc., Rockland, MA, 2002","paperID":"515391"},{"content":"Lombard, M., and Ditton, T. At the heart of it all: The concept of presence. Journal of Computer-Mediated Communication 3, 2 (1997).","paperID":"None"},{"content":"McMahan, A. Immersion, engagement and presence. The video game theory reader (2003), 67--86.","paperID":"None"},{"content":"Richard Rouse, III, What's your perspective?, ACM SIGGRAPH Computer Graphics, v.33 n.3, p.9-12, Aug. 1999","paperID":"330575"},{"content":"Ryan, R. M., Rigby, C. S., and Przybylski, A. The motivational pull of video games: A self-determination theory approach. Motivation and emotion 30, 4 (2006), 344--360.","paperID":"None"},{"content":"Slater, M., Spanlang, B., Sanchez-Vives, M. V., and Blanke, O. First person experience of body transfer in virtual reality. PloS one 5, 5 (2010).","paperID":"None"},{"content":"Taylor, L. N. Video games: Perspective, point-of-view, and immersion. PhD thesis, University of Florida, 2002.","paperID":"None"},{"content":"Unity3d Forum. First person vs third person perspective. goo.gl/m1c4c9, Aug 2010.","paperID":"None"}],"title":"First Person vs. Third Person Perspective in Digital Games: Do Player Preferences Affect Immersion?","filename":"CHI15/p145","authors":["Alena Denisova","Paul Cairns"],"conference":"CHI '15"}