{"paperId":2702518,"abstract":"Recent mobile phones integrate fingerprint scanners to authenticate users biometrically and replace passwords, making authentication more convenient for users. However, due to their cost, capacitive fingerprint scanners have been limited to top-of-the-line phones, a result of the required resolution and quality of the sensor. We present Bodyprint, a biometric authentication system that detects users' biometric features using the same type of capacitive sensing, but uses the touchscreen as the image sensor instead. While the input resolution of a touchscreen is ~6 dpi, the surface area is larger, allowing the touch sensor to scan users' body parts, such as ears, fingers, fists, and palms by pressing them against the display. Bodyprint compensates for the low input resolution with an increased false rejection rate, but does not compromise on authentication precision: In our evaluation with 12 participants, Bodyprint classified body parts with 99.98% accuracy and identifies users with 99.52% accuracy with a retry likelihood of 26.82% to prevent false positives, thereby bringing reliable biometric user authentication to a vast number of commodity devices.","citation":[{"content":"Robert Tartz , Ted Gooding, Hand Biometrics Using Capacitive Touchscreens, Adjunct Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2815721"},{"content":"Anhong Guo , Robert Xiao , Chris Harrison, CapAuth: Identifying and Differentiating User Handprints on Commodity Capacitive Touchscreens, Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces, November 15-18, 2015, Madeira, Portugal","paperID":"2817722"},{"content":"Christian Holz , Marius Knaust, Biometric Touch Sensing: Seamlessly Augmenting Each Touch with Continuous Authentication, Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2807458"}],"reference":[{"content":"Abate, A.F., Nappi, M., Riccio, D., Sabatino, G. 2D and 3D face recognition. Pattern Recognition Letters (28):14, 2007.","paperID":"None"},{"content":"Bay, H., Ess, A., Tuytelaars, T., Van Gool, L. Speededup Robust Features. Proc. CVIU '07, 346--359.","paperID":"None"},{"content":"Ben-Asher, N., Kirschnick, N., Sieger, H., Meyer, J., Ben-Oved, A., Möller, S. On the need for different security methods on mobile phones. Proc. MobileHCI '11.","paperID":"None"},{"content":"Biddle, R., Chiasson, S., Van Oorschot, P. Graphical passwords: Learning from the first twelve years. ACM Computing Surveys, (44)4, 2012.","paperID":"None"},{"content":"Bo, C., Zhang, L., Li, X., Huang, Q., Wang, Y. SilentSense: silent user identification via touch and movement behavioral biometrics. Proc. MobiCom '13.","paperID":"None"},{"content":"Burge, M. and Burger, W. Ear biometrics. Biometrics 273--285, Springer US, 1996.","paperID":"None"},{"content":"Cho, D., Park, K.R., Rhee, D.W., Kim, Y., Yang, J. Pupil and Iris Localization for Iris Recognition in Mobile Phones. Proc. SNPD '06, 197--201.","paperID":"None"},{"content":"Everitt, K., Bragin, T., Fogarty, J., Kohno, T. A comprehensive study of frequency, interference, and training of multiple graphical passwords. Proc. CHI '09.","paperID":"None"},{"content":"Harrison, C., Sato, M., Poupyrev, I. Capacitive Fingerprinting: Exploring User Differentiation by Sensing Electrical Properties of the Human Body. Proc. UIST '12.","paperID":"None"},{"content":"Holz, C. and Baudisch, P. Fiberio: A Touchscreen that Senses Fingerprints. Proc. UIST '13, 41--50.","paperID":"None"},{"content":"Holz, C. and Baudisch, P. The Generalized Perceived Input Point Model and How to Double Touch Accuracy by Extracting Fingerprints. Proc. CHI '10, 581--590.","paperID":"None"},{"content":"Kirschnick, N., Kratz, S. and Moller, S. An improved approach to gesture-based authentication for mobile devices. Proc. SOUPS '10.","paperID":"None"},{"content":"Kurkovsky, S. and Syta, E. Digital natives and mobile phones: A survey of practices and attitudes about privacy and security. Proc. ISTAS '10, 441--449.","paperID":"None"},{"content":"Richter, S., Holz, C., Baudisch, P. Bootstrapper: Recognizing Tabletop Users by their Shoes. Proc CHI '12.","paperID":"None"}],"title":"Bodyprint: Biometric User Identification on Mobile Devices Using the Capacitive Touchscreen to Scan Body Parts","filename":"CHI15/p3011","authors":["Christian Holz","Senaka Buthpitiya","Marius Knaust"],"conference":"CHI '15"}