{"paperId":2702170,"abstract":"Localness is an oft-cited benefit of volunteered geographic information (VGI). This study examines whether localness is a constant, universally shared benefit of VGI, or one that varies depending on the context in which it is produced. Focusing on articles about geographic entities (e.g. cities, points of interest) in 79 language editions of Wikipedia, we examine the localness of both the editors working on articles and the sources of the information they cite. We find extensive geographic inequalities in localness, with the degree of localness varying with the socioeconomic status of the local population and the health of the local media. We also point out the key role of language, showing that information in languages not native to a place tends to be produced and sourced by non-locals. We discuss the implications of this work for our understanding of the nature of VGI and highlight a generalizable technical contribution: an algorithm that determines the home country of the original publisher of online content.","citation":[],"reference":[{"content":"World Development Indicators 2012. World Bank, 2012.","paperID":"None"},{"content":"Einat Amitay , Nadav Har'El , Ron Sivan , Aya Soffer, Web-a-where: geotagging web content, Proceedings of the 27th annual international ACM SIGIR conference on Research and development in information retrieval, July 25-29, 2004, Sheffield, United Kingdom","paperID":"1009040"},{"content":"Patti Bao , Brent Hecht , Samuel Carton , Mahmood Quaderi , Michael Horn , Darren Gergle, Omnipedia: bridging the wikipedia language gap, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208553"},{"content":"Zhiyuan Cheng , James Caverlee , Kyumin Lee, You are where you tweet: a content-based approach to geo-locating twitter users, Proceedings of the 19th ACM international conference on Information and knowledge management, October 26-30, 2010, Toronto, ON, Canada","paperID":"1871535"},{"content":"S. Elwood, M. F. Goodchild, and D. Z. Sui. Researching volunteered geographic information: Spatial data, geographic research, and new social practice. Annals of the Association of American Geographers, 102(3):571--590, 2012.","paperID":"None"},{"content":"E. Fischer. Locals and tourists (Flickr), June 2010.","paperID":"None"},{"content":"Heather Ford , Shilad Sen , David R. Musicant , Nathaniel Miller, Getting to the source: where does Wikipedia get its information from?, Proceedings of the 9th International Symposium on Open Collaboration, August 05-07, 2013, Hong Kong, China","paperID":"2491064"},{"content":"M. Graham and B. Hogan. Uneven openness: Barriers to mena representation on wikipedia. SSRN, 2014.","paperID":"None"},{"content":"M. Graham, B. Hogan, R. K. Straumann, and A. Medhat. Uneven geographies of user-generated information: Patterns of increasing informational poverty. Annals of the Association of American Geographers, pages 1--19, 2014. http://www.shilad.com/localness","paperID":"None"},{"content":"M. Graham and M. Zook. Augmented realities and uneven geographies: exploring the geolinguistic contours of the web. Environment and Planning A, 45(1):77--99, 2013.","paperID":"None"},{"content":"M. Graham, M. Zook, and A. Boulton. Augmented reality in urban places: contested content and the duplicity of code. Transactions of the Institute of British Geographers, 38(3):464--479, 2013.","paperID":"None"},{"content":"M. Haklay. How good is volunteered geographical information? a comparative study of OpenStreetMap and ordnance survey datasets. Environment and Planning B: Planning and Design, 37(4):682--703, 2010.","paperID":"None"},{"content":"Scott A. Hale, Net Increase? Cross-Lingual Linking in the Blogosphere, Journal of Computer-Mediated Communication, v.17 n.2, p.135-151, January 2012","paperID":"2306401"},{"content":"Darren Hardy , James Frew , MichaelF. Goodchild, Volunteered geographic information production as a spatial process, International Journal of Geographical Information Science, v.26 n.7, p.1191-1212, July 2012","paperID":"2443099"},{"content":"Brent Hecht , Darren Gergle, Measuring self-focus bias in community-maintained knowledge repositories, Proceedings of the fourth international conference on Communities and technologies, June 25-27, 2009, University Park, PA, USA","paperID":"1556463"},{"content":"Brent Hecht , Darren Gergle, The tower of Babel meets web 2.0: user-generated content and its applications in a multilingual context, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753370"},{"content":"B. Hecht and M. Stephens. A tale of cities: Urban biases in volunteered geographic information. In ICWSM, 2014.","paperID":"None"},{"content":"M. Helft. Online maps: Everyman offers new directions. The New York Times, Nov. 2009.","paperID":"None"},{"content":"Rob Kitchin , Martin Dodge, Code/Space: Software and Everyday Life, The MIT Press, 2011","paperID":"2000712"},{"content":"L. Li, M. F. Goodchild, and B. Xu. Spatial, temporal, and socioeconomic patterns in the use of twitter and flickr. Cartography and Geographic Information Science, 40(2):61--77, 2013.","paperID":"None"},{"content":"M. D. Lieberman and J. Lin. You are where you edit: Locating wikipedia contributors through edit histories. In ICWSM, 2009.","paperID":"None"},{"content":"Brendan Luyt , Daniel Tan, Improving Wikipedia's credibility: References and citations in a sample of history articles, Journal of the American Society for Information Science and Technology, v.61 n.4, p.715-722, April 2010","paperID":"1753145"},{"content":"Kevin S. McCurley, Geospatial mapping and navigation of the web, Proceedings of the 10th international conference on World Wide Web, p.221-229, May 01-05, 2001, Hong Kong, Hong Kong","paperID":"372056"},{"content":"A. Mislove, S. Lehmann, Y.-Y. Ahn, J.-P. Onnela, and J. N. Rosenquist. Understanding the demographics of twitter users. In ICWSM, 2011.","paperID":"None"},{"content":"P. Neis, D. Zielstra, and A. Zipf. The street network evolution of crowdsourced maps: OpenStreetMap in Germany 2007--2011. Future Internet, 4(1):1--21, 2011.","paperID":"None"},{"content":"N. J. Obermeyer. The evolution of public participation GIS. Cartography and Geographic Information Systems, 25(2):65--66, 1998.","paperID":"None"},{"content":"Eli Pariser, The Filter Bubble: What the Internet Is Hiding from You, Penguin Group , The, 2011","paperID":"2029079"},{"content":"Robert Pasley , Paul Clough , Ross S. Purves , Florian A. Twaroch, Mapping geographic coverage of the web, Proceedings of the 16th ACM SIGSPATIAL international conference on Advances in geographic information systems, November 05-07, 2008, Irvine, California","paperID":"1463459"},{"content":"Ingmar Poese , Steve Uhlig , Mohamed Ali Kaafar , Benoit Donnet , Bamba Gueye, IP geolocation databases: unreliable?, ACM SIGCOMM Computer Communication Review, v.41 n.2, April 2011","paperID":"1971171"},{"content":"Giovanni Quattrone , Licia Capra , Pasquale De Meo, There's No Such Thing as the Perfect Map: Quantifying Bias in Spatial Crowd-sourcing Datasets, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675235"},{"content":"T. A. Slocum, R. B. McMaster, F. C. Kessler, and H. H. Howard. Thematic Cartography and Geovisualization. Prentice Hall, N.J., USA, 2009.","paperID":"None"},{"content":"Denny Vrandečić, Wikidata: a new platform for collaborative data collection, Proceedings of the 21st international conference companion on World Wide Web, April 16-20, 2012, Lyon, France","paperID":"2188242"},{"content":"Morten Warncke-Wang , Anuradha Uduwage , Zhenhua Dong , John Riedl, In search of the ur-Wikipedia: universality, similarity, and translation in the Wikipedia inter-language link network, Proceedings of the Eighth Annual International Symposium on Wikis and Open Collaboration, August 27-29, 2012, Linz, Austria","paperID":"2462959"}],"title":"Barriers to the Localness of Volunteered Geographic Information","filename":"CHI15/p197","authors":["Shilad W. Sen","Heather Ford","David R. Musicant","Mark Graham","Oliver S.B. Keyes","Brent Hecht"],"conference":"CHI '15"}