{"paperId":2702251,"citation":[],"reference":[{"content":"G. D. Abowd, G. R. Hayes, G. Iachello, J. A. Kientz, S. N. Patel, M. M. Stevens, and K. N. Truong. Prototypes and paratypes: Designing mobile and ubiquitous computing applications. IEEE Pervasive Computing, 4(4):67--73, Oct. 2005.","paperID":"None"},{"content":"G. D. Abowd and E. D. Mynatt. Charting past, present, and future research in ubiquitous computing. ACM Trans. Comput.-Hum. Interact., 7(1):29--58, Mar. 2000.","paperID":"None"},{"content":"V. Bellotti and A. Sellen. Design for privacy in ubiquitous computing environments. In Proceedings of the third conference on European Conference on Computer-Supported Cooperative Work, pages 77--92, Norwell, MA, USA, 1993. Kluwer Academic Publishers.","paperID":"None"},{"content":"A. R. Beresford, A. Rice, N. Skehin, and R. Sohan. Mockdroid: Trading privacy for application functionality on smartphones. In Proceedings of the 12th Workshop on Mobile Computing Systems and Applications, HotMobile '11, pages 49--54, New York, NY, USA, 2011. ACM.","paperID":"None"},{"content":"M. S. Bernstein, G. Little, R. C. Miller, B. Hartmann, M. S. Ackerman, D. R. Karger, D. Crowell, and K. Panovich. Soylent: A word processor with a crowd inside. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology, UIST '10, pages 313--322, New York, NY, USA, 2010. ACM.","paperID":"None"},{"content":"M. B. Curry, S. J. McDougall, and O. de Bruijn. The effects of the visual metaphor in determining icon efficacy. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, volume 42, pages 1590--1594. SAGE Publications, 1998.","paperID":"None"},{"content":"L. D'Antoni, A. Dunn, S. Jana, T. Kohno, B. Livshits, D. Molnar, A. MoshchUnited Kingdom, E. Ofek, F. Roesner, S. Saponas, M. Veanes, and H. J. Wang. Operating system support for augmented reality applications. In Proceedings of the 14th USENIX Conference on Hot Topics in Operating Systems, HotOS'13, pages 21--21, Berkeley, CA, USA, 2013. USENIX Association.","paperID":"None"},{"content":"S. P. Dow, A. Glassco, J. Kass, M. Schwarz, D. L. Schwartz, and S. R. Klemmer. Parallel prototyping leads to better design results, more divergence, and increased self-efficacy. ACM Trans. Comput.-Hum. Interact., 17(4):18:1--18:24, Dec. 2010.","paperID":"None"},{"content":"W. K. Edwards and R. E. Grinter. At home with ubiquitous computing: Seven challenges. In Proceedings of the 3rd International Conference on Ubiquitous Computing, UbiComp '01, pages 256--272, London, United Kingdom, United Kingdom, 2001. Springer-Verlag.","paperID":"None"},{"content":"W. Enck, P. Gilbert, B.-G. Chun, L. P. Cox, J. Jung, P. McDaniel, and A. N. Sheth. Taintdroid: an information-flow tracking system for realtime privacy monitoring on smartphones. In Proceedings of the 9th USENIX conference on Operating systems design and implementation, OSDI'10, pages 1--6, Berkeley, CA, USA, 2010. USENIX Association.","paperID":"None"},{"content":"A. P. Felt, E. Ha, S. Egelman, A. Haney, E. Chin, and D. Wagner. Android permissions: user attention, comprehension, and behavior. In Proceedings of the Eighth Symposium on Usable Privacy and Security, SOUPS '12, New York, NY, USA, 2012. ACM.","paperID":"None"},{"content":"S. Guha, M. Jain, and V. N. Padmanabhan. Koi: A location-privacy platform for smartphone apps. In Proceedings of the 9th USENIX Conference on Networked Systems Design and Implementation, NSDI'12, pages 14--14, Berkeley, CA, USA, 2012. USENIX Association.","paperID":"None"},{"content":"J. I. Hong, J. D. Ng, S. Lederer, and J. A. Landay. Privacy risk models for designing privacy-sensitive ubiquitous computing systems. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, DIS '04, pages 91--100, New York, NY, USA, 2004. ACM.","paperID":"None"},{"content":"P. Hornyack, S. Han, J. Jung, S. Schechter, and D. Wetherall. These aren't the droids you're looking for: retrofitting android to protect data from imperious applications. In Proceedings of the 18th ACM conference on Computer and communications security, CCS '11, pages 639--652, New York, NY, USA, 2011. ACM.","paperID":"None"},{"content":"G. Iachello and G. D. Abowd. Privacy and proportionality: Adapting legal evaluation techniques to inform design in ubiquitous computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '05, pages 91--100, New York, NY, USA, 2005. ACM.","paperID":"None"},{"content":"Intel Corporation. Intel RealSense Technology, 2014. http://www.intel.com/content/www/us/en/ architecture-and-technology/ realsense-overview.html.","paperID":"None"},{"content":"R. Kang, S. Brown, L. Dabbish, and S. Kiesler. Privacy Attitudes of Mechanical Turk Workers and the U.S. Public. pages 37--49. USENIX Association, Submitted.","paperID":"None"},{"content":"R. Kannavara and K. Shippy. Topics in Biometric Human-Machine Interaction Security. Potentials, IEEE, 32(6):18--25, 2013.","paperID":"None"},{"content":"P. G. Kelley. Conducting Usable Privacy & Security Studies with Amazon's Mechanical Turk. In Proceedings of the 6th Symposium on Usable Privacy and Security (SOUPS), SOUPS 2010. USENIX Association, 2010.","paperID":"None"},{"content":"T. Kindberg and A. Fox. System software for ubiquitous computing. IEEE Pervasive Computing, 1(1):70--81, Jan. 2002.","paperID":"None"},{"content":"A. Kittur, E. H. Chi, and B. Suh. Crowdsourcing User Studies with Mechanical Turk. In CHI '08: Proceeding of The Twenty-Sixth Annual SIGCHI Conference on Human Factors in Computing Systems, pages 453--456, New York, NY, USA, 2008. ACM.","paperID":"None"},{"content":"R. Kumar, J. O. Talton, S. Ahmad, and S. R. Klemmer. Bricolage: Example-based retargeting for web design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '11, pages 2197--2206, New York, NY, USA, 2011. ACM.","paperID":"None"},{"content":"M. Langheinrich. Privacy by design - principles of privacy-aware ubiquitous systems. In Proceedings of the 3rd international conference on Ubiquitous Computing, UbiComp '01, pages 273--291, London, United Kingdom, United Kingdom, 2001. Springer-Verlag.","paperID":"None"},{"content":"S. Lederer, J. I. Hong, A. K. Dey, and J. A. Landay. Personal privacy through understanding and action: Five pitfalls for designers. Personal Ubiquitous Comput., 8(6):440--454, Nov. 2004.","paperID":"None"},{"content":"J. Lin, N. Sadeh, S. Amini, J. Lindqvist, J. I. Hong, and J. Zhang. Expectation and purpose: understanding users' mental models of mobile app privacy through crowdsourcing. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing, UbiComp '12, pages 501--510, New York, NY, USA, 2012. ACM.","paperID":"None"},{"content":"Microsoft Corporation. Xbox One, 2014. http://www.xbox.com/en-US/xbox-one/innovation.","paperID":"None"},{"content":"J. Moyes and P. W. Jordan. Icon design and its effect on guessability, learnability, and experienced user performance. People and computers, (8):49--60, 1993.","paperID":"None"},{"content":"J. Newman. Pebble smartwatch pre-orders are sold out, $10+ million pledged. Time, May 10 2012. http://techland.time.com/2012/05/10/ pebble-smartwatch-pre-orders-sold-out/.","paperID":"None"},{"content":"L. Palen and P. Dourish. Unpacking \"privacy\" for a networked world. In CHI '03: Proceedings of the SIGCHI conference on Human factors in computing systems. ACM New York, NY, USA, April 5--10 2003.","paperID":"None"},{"content":"A. Raij, A. Ghosh, S. Kumar, and M. Srivastava. Privacy risks emerging from the adoption of innocuous wearable sensors in the mobile environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '11, pages 11--20, New York, NY, USA, 2011. ACM.","paperID":"None"},{"content":"F. Roesner, T. Kohno, and D. Molnar. Security and privacy for augmented reality systems. Communications of The ACM, 2014. http://www.franziroesner.com/ pdf/arsec-cacm2014-preprint.pdf.","paperID":"None"},{"content":"J. H. Saltzer and M. D. Schroeder. The protection of information in computer systems. Proceedings of the IEEE, 63(9):1278--1308, 1975.","paperID":"None"},{"content":"J. Stern. Google glass explorer edition to ship this month. ABC News, April 10 2013. http://abcnews.go.com/blogs/technology/2013/04/ google-glass-explorer-edition-to-ship-this-month/.","paperID":"None"},{"content":"C. Thompson, M. Johnson, S. Egelman, D. Wagner, and J. King. When it's better to ask forgiveness than get permission: Designing usable audit mechanisms for mobile permissions. In Proceedings of the 2013 Symposium on Usable Privacy and Security (SOUPS), 2013.","paperID":"None"},{"content":"L. von Ahn and L. Dabbish. Labeling images with a computer game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '04, pages 319--326, New York, NY, USA, 2004. ACM.","paperID":"None"},{"content":"M. Weiser. The computer for the 21st century. Scientific American, pages 94--104, 1991.","paperID":"None"}],"abstract":"We are approaching an environment where ubiquitous computing devices will constantly accept input via audio and video channels: kiosks that determine demographic information of passersby, gesture controlled home entertainment systems and audio controlled wearable devices are just a few examples. To enforce the principle of least privilege, recent proposals have suggested technical approaches to limit third-party applications to receiving only the data they need, rather than entire audio or video streams. For users to make informed privacy decisions, applications will still need to communicate what data they are accessing and indicators will be needed to communicate this information. We performed several crowdsourcing experiments to examine how potential users might conceptualize and understand privacy indicators on ubiquitous sensing platforms.","title":"Is This Thing On?: Crowdsourcing Privacy Indicators for Ubiquitous Sensing Platforms","filename":"CHI15/p1669","authors":["Serge Egelman","Raghudeep Kannavara","Richard Chow"],"conference":"CHI '15"}