{"paperId":2702270,"citation":[{"content":"Tsubasa Morioka , Nicole B. Ellison , Michael Brown, Identity Work on Social Media Sites: Disadvantaged Students' College Transition Processes, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819959"}],"reference":[{"content":"Acquisti, A. and Gross, R. Imagined communities: Awareness, information sharing, and privacy on the Facebook. Privacy Enhancing Technologies. Springer, 2006, 36--58.","paperID":"None"},{"content":"boyd, d. Social network sites as networked public: Affordances, dynamics, and implications. Networked Self: Identity, Community, and Culture on Social Network Sites. Routledge, 2010, 39--58.","paperID":"None"},{"content":"boyd, d. and Heer, J. Profiles as conversation: Networked identity performance on Friendster. Proc. HICSS (2006).","paperID":"None"},{"content":"Bruckman, A.S. Gender Swapping on the Internet. Proceedings of INET (1993).","paperID":"None"},{"content":"Butler, J. Bodies That Matter: On the Discursive Limits of \"Sex.\" Routledge, 2014.","paperID":"None"},{"content":"Chang, S. et al. Specialization, homophily, and gender in a social curation site: Findings from Pinterest. Proceedings of CSCW (2014).","paperID":"None"},{"content":"Churchill, E.F. Sugared puppy-dog tails: Gender and design. interactions. 17, 2 (2010), 52--56.","paperID":"None"},{"content":"Corbin, J. and Strauss, A. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage, 2008.","paperID":"None"},{"content":"DiMicco, J.M. and Millen, D.R. Identity management: Multiple presentations of self in Facebook. Proceedings of GROUPS (2007).","paperID":"None"},{"content":"Ellison, N.B. et al. The benefits of Facebook \"friends:\" Social capital and college students' use of online social network sites. J of CMC. 12, 4 (2007), 1143--1168.","paperID":"None"},{"content":"Entwistle, J. The Fashioned Body: Fashion, Dress and Modern Social Theory. Polity, 2000.","paperID":"None"},{"content":"Facebook. \"Maintain an authentic personal account,\" 2014. https://www.facebook.com/help/206559146047897","paperID":"None"},{"content":"Farnham, S.D. and Churchill, E.F. Faceted identity, faceted lives: Social and technical issues with being yourself online. Proceedings of CSCW (2011).","paperID":"None"},{"content":"Fashion industry, retailers and the gender binary: http://bigstory.ap.org/article/fashion-industry-retailersand-gender-binary. Accessed: 2014-07--31.","paperID":"None"},{"content":"Gagné, P. et al. Coming out and crossing over: Identity formation and proclamation in a transgender community. Gender & Society. 11, 4 (1997), 478--508.","paperID":"None"},{"content":"Garfinkel, H. Passing and the managed achievement of sex status in an \"intersexed\" person. The Transgender Studies Reader. Routledge, 2006.","paperID":"None"},{"content":"Gilbert, E. et al. \"I need to try this!\": A statistical overview of Pinterest. Proceedings of CHI (2013).","paperID":"None"},{"content":"Goffman, E. Presentation of Self in Everyday Life. Doubleday Anchor Books, 1959.","paperID":"None"},{"content":"Goffman, E. Stigma: Notes on the Management of Spoiled Identity. Simon and Schuster, 2009.","paperID":"None"},{"content":"Grant, J.M. et al. Injustice at Every Turn: A Report of the National Transgender Discrimination Survey. NCTE & NGLTF, 2011.","paperID":"None"},{"content":"Hall, C. and Zarro, M. Social curation on the website Pinterest.com. Proceedings of ASIST (2012).","paperID":"None"},{"content":"Hebdige, D. Subculture: The Meaning of Style. Routledge, 1979.","paperID":"None"},{"content":"Haimson, O.L. et al. Disclosure, stress and support during gender transition on Facebook. Proc. of CSCW (2015).","paperID":"None"},{"content":"Hines, S. and Sanger, T. Transgender Identities: Towards a Social Analysis of Gender Diversity. Taylor & Francis, 2010.","paperID":"None"},{"content":"Illouz, E. Cold Intimacies: The Making of Emotional Capitalism. Polity, 2007.","paperID":"None"},{"content":"Kondo, D.K. Crafting Selves: Power, Gender, and Discourses of Identity in a Japanese Workplace. University of Chicago Press, 2009.","paperID":"None"},{"content":"Liao, C. Virtual fashion play as embodied identity re/assembling: Second Life fashion bloggers and their avatar bodies. Reinventing Ourselves: Contemporary Concepts of Identity in Virtual Worlds. Springer, 2011.","paperID":"None"},{"content":"Linder, R. et al. Everyday ideation: All of my ideas are on Pinterest. Proceedings of CHI (2014).","paperID":"None"},{"content":"Lingel, J. and Gillespie, T. One Name to Rule Them All: Facebook's Identity Problem. The Atlantic, 2014.","paperID":"None"},{"content":"Marwick, A.E. and boyd, d. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1 (2011), 114--133.","paperID":"None"},{"content":"McCracken, G.D. Culture and Consumption: New Approaches to the Symbolic Character of Consumer Goods and Activities. Indiana University Press, 1990.","paperID":"None"},{"content":"Schau, H.J. and Gilly, M.C. We are what we post? Self! presentation in personal web space. Journal of Consumer Research. 30, 3 (2003), 385--404.","paperID":"None"},{"content":"Schouten, J.W. Selves in transition: Symbolic consumption in personal rites of passage and identity reconstruction. J Consumer Rsrch. 17, 4 (1991), 412--425.","paperID":"None"},{"content":"Stryker, S. Transgender History. Seal Press, 2009.","paperID":"None"},{"content":"Turkle, S. Cyberspace and Identity. Contemporary Sociology. 28, 6 (1999), 643--648.","paperID":"None"},{"content":"Valentine, D. Imagining Transgender: An Ethnography of a Category. Duke University Press, 2007.","paperID":"None"},{"content":"Wang, Y. et al. A Field Trial of Privacy Nudges for Facebook. Proceedings of CHI (2014).","paperID":"None"},{"content":"Yin, R.K. Case Study Research: Design and Methods. SAGE Publications, 2013.","paperID":"None"},{"content":"Zarro, M. et al. Wedding dresses and wanted criminals: Pinterest.com as an infrastructure for repository building. Proceedings of ICWSM (2013).","paperID":"None"}],"abstract":"Self-representation online can be difficult for those who are in life transitions that involve exploring new identity facets and changes in personal style. Many desire to tailor their online representations for different audiences. Social media site profiles and sharing settings offer varying levels of anonymity, privacy, and thus safety, but these settings are often opaque and poorly understood. To understand the complex relationship between identity, personal style and online self-representation, we examine how people explore and experiment with new styles in public and in private online settings during gender transition. We present the results of interviews with transgender people who have recently reinvented their personal style, or are planning to do so in the near future. We find that people explore new styles in online settings to craft possible or ideal future selves. When involving others, people engage intimate and unknown others, but often avoid weak ties. Our results indicate that to account for changing identities, social media sites must be designed to support finding inspiration and advice from strangers and style experimentation with close friends.","title":"Online Inspiration and Exploration for Identity Reinvention","filename":"CHI15/p3809","authors":["Oliver L. Haimson","Anne E. Bowser","Edward F. Melcer","Elizabeth F. Churchill"],"conference":"CHI '15"}