{"paperId":2702440,"citation":[],"reference":[{"content":"Brown, B. A., Sellen, A. J., and O'hara, K. P. A diary study of information capture in working life. In Proc. CHI (2000).","paperID":"None"},{"content":"Cheng, L.-P., Hsiao, F.-I., Liu, Y.-T., and Chen, M. Y. iRotate: automatic screen rotation based on face orientation. In Proc. CHI (2012).","paperID":"None"},{"content":"Cheng, L.-P., Lee, M. H., Wu, C.-Y., Hsiao, F.-I., Liu, Y.-T., Liang, H.-S., Chiu, Y.-C., Lee, M.-S., and Chen, M. Y. iRotateGrasp: automatic screen rotation based on grasp of mobile devices. In Proc. CHI (2013).","paperID":"None"},{"content":"Hinckley, K., Pierce, J., Sinclair, M., and Horvitz, E. Sensing techniques for mobile interaction. In Proc. UIST (2000).","paperID":"None"},{"content":"Kindberg, T., Spasojevic, M., Fleck, R., and Sellen, A. The ubiquitous camera: an in-depth study of camera phone use. IEEE Pervasive Computing (2005).","paperID":"None"},{"content":"Lee, J., and Ju, D. Y. Defying gravity: a novel method of converting screen orientation. IJSH (2013).","paperID":"None"},{"content":"Sahami Shirazi, A., Henze, N., Dingler, T., Kunze, K., and Schmidt, A. Upright or sideways?: analysis of smartphone postures in the wild. In Proc. MobileHCI (2013).","paperID":"None"},{"content":"Sellen, A., Fleck, R., Kindberg, T., and Spasojevic, M. How and why people use camera phones. Microsoft Technical Report (2004).","paperID":"None"}],"abstract":"Document capturing with smartphone cameras is performed increasingly often in our daily lives. However, our user study results (n=10) showed that more than 80% of landscape tasks had incorrect orientations. To solve this problem, we systematically analyzed user behavior of document capturing and proposed a novel solution called ScanShot that detects document capturing moments to help users correct the orientation errors. ScanShot tracks the gravity direction to capture document capturing moments, analyzes logged gyroscope data to automatically update orientation changes, and provides visual feedback of the inferred orientation for manual correction. Our user study results (n=20) confirmed that capturing moments can be recognized with accuracy of 97.5%, our update mechanism can reduce the orientation errors by 59 percentage points.","title":"ScanShot: Detecting Document Capture Moments and Correcting Device Orientation","filename":"CHI15/p953","authors":["Jeungmin Oh","Woohyeok Choi","Joohyun Kim","Uichin Lee"],"conference":"CHI '15"}