{"paperId":2702345,"abstract":"Mobile video conferencing, where one or more participants are moving about in the real world, enables entirely new interaction scenarios (e.g., asking for help to construct or repair an object, or showing a physical location). While we have a good understanding of the challenges of video conferencing in office or home environments, we do not fully understand the mechanics of camera work-how people use mobile devices to communicate with one another-during mobile video calls. To provide an understanding of what people do in mobile video collaboration, we conducted an observational study where pairs of participants completed tasks using a mobile video conferencing system. Our analysis suggests that people use the camera view deliberately to support their interactions-for example, to convey a message or to ask questions-but the limited field of view, and the lack of camera control can make it a frustrating experience.","citation":[{"content":"Shunichi Kasahara , Jun Rekimoto, JackIn head: immersive visual telepresence system with omnidirectional wearable camera for remote collaboration, Proceedings of the 21st ACM Symposium on Virtual Reality Software and Technology, November 13-15, 2015, Beijing, China","paperID":"2821608"}],"reference":[{"content":"Brubacker, J. et al. (2012). Focusing on Shared Experiences Moving Beyond the Camera in Video Communication. In Proc. DIS 2012, 96--105.","paperID":"None"},{"content":"Clark, H.H., and Marshall, C.R. (1981). Definite reference and mutual knowledge. In Elements of Discourse Understanding, 10--63.","paperID":"None"},{"content":"Fussell, S.R. et al. (2003). Effects of Head-Mounted and Scene-Oriented Video Systems on Remote Collaboration on Physical Tasks. In Proc. CHI 2003, 513--520.","paperID":"None"},{"content":"Fussell, S.R. et al. (2003). Where do Helpers Look?: Gaze Targets During Collaborative Physical Tasks. In EA CHI 2003, 768--769.","paperID":"None"},{"content":"Fussell, S.R. et al. (2003). Assessing the Value of a Cursor Pointing Device for Remote Collaboration on Physical Tasks. In EA CHI 2003, 788--789.","paperID":"None"},{"content":"Fussell, S.R. et al. (2004). Gestures Over Video Streams to Support Remote Collaboration on Physical Tasks. HCI 19(3), 273--309.","paperID":"None"},{"content":"Gauglitz, S. et al. (2012). Integrating the Physical Environment into Mobile Remote Collaboration. In Proc. MobileHCI 2012, 241--250.","paperID":"None"},{"content":"Gauglitz, S. et al. (2014). World-Stabilized Annotations and Virtual Scene Navigation for Remote Collaboration. In Proc. UIST 2014, 449--459.","paperID":"None"},{"content":"Gaver, W.W. et al. (1993). One is not enough: multiple views in a media space. In Proc. CHI 1993, 335--341.","paperID":"None"},{"content":"Gergle, D. et al. (2004). Action as Language in a Shared Visual Space. In Proc. CSCW 2004, 487--496.","paperID":"None"},{"content":"Gutwin, C., and Penner, R. (2002). Improving Interpretation of Remote Gestures with Telepointer Traces. In Proc. CSCW 2002, 49--57.","paperID":"None"},{"content":"Inkpen, K. et al. (2013). Experiences2Go: Sharing Kids'Activities Outside the Home with Remote Family Members. In Proc. CSCW 2013, 1329--1340.","paperID":"None"},{"content":"Jordan, B., and Henderson, A. (1995). Interaction Analysis: Foundations and Practice. Journal of the Learning Sciences 4 (1), 39--103.","paperID":"None"},{"content":"Judge, T.K., and Neustaedter, C. (2010). Sharing Conversation and Sharing Life: Video Conferencing in the Home. In Proc. CHI 2010, 655--658.","paperID":"None"},{"content":"Judge, T.K. et al. (2011). Family Portals: Connecting Families Through a Multifamily Media Space. In Proc. CHI 2011, 1205--1214.","paperID":"None"},{"content":"Kasahara, S., and Rekimoto, J. (2014). JackIn: Integrating First-Person View with Out-of-Body Vision Generation for Human-Human Augmentation. In Proc. AH 2014.","paperID":"None"},{"content":"Kirk, D., and Fraser, D.S. (2006). Comparing Remote Gesture Technologies for Supporting Collaborative Physical Tasks. In Proc. CHI 2006, 1191--1200.","paperID":"None"},{"content":"Kirk, D. S. et al. (2005). Ways of the Hands. In Proc. ECSCW 2005, 1--21.","paperID":"None"},{"content":"Kirk, D. et al. (2007). Turn It This Way: Grounding Collaborative Action with Remote Gestures. In Proc. CHI 2007, 1039--1048.","paperID":"None"},{"content":"Kirk, D. et al. (2010). Home Video Communication: Mediating 'Closeness'. In Proc. CSCW 2010, 135--144.","paperID":"None"},{"content":"Kraut, R.E. et al. (2003). Visual Information as a Conversational Resource in Collaborative Physical Tasks. HCI 18 (1), 13--49.","paperID":"None"},{"content":"Kuzuoka, H. (1992). Spatial workspace collaboration: a SharedView video support system for remote collaboration capability. In Proc. CHI 1992, 533--540.","paperID":"None"},{"content":"Licoppe, C., and Morel, J. (2009). The Collaborative Work of Producing Meaningful Shots in Mobile Video Telephony. In Proc. MobileHCI 2009, 254--263.","paperID":"None"},{"content":"Mann, S. (2000). Telepointer: Hands-free completely self-contained wearable visual augmented reality without headwear and without any infrastructural reliance. In Proc. ISWC 2000, 177--178.","paperID":"None"},{"content":"Norris, J. et al. (2012). CamBlend: An Object Focused Collaboration Tool. In Proc. CHI 2012, 627--636.","paperID":"None"},{"content":"O'Hara, K. et al. (2006). Everyday Practices with Mobile Video Telephony. In Proc. CHI 2006, 871--880.","paperID":"None"},{"content":"Ou, J. et al. (2003). DOVE: Drawing over Video Environment. In Proc. MULTIMEDIA 2003, 100--101.","paperID":"None"},{"content":"Procyk, J. et al. (2014). Exploring video streaming in public settings: shared geocaching over distance using mobile video chat. In Proc. CHI 2014, 2163--2172.","paperID":"None"},{"content":"Raffle, H. et al. (2010). Family Story Play: Reading with Young Children (and Elmo) Over a Distance. In Proc. CHI 2010, 1583--1592.","paperID":"None"},{"content":"Sakata, N. et al. (2003). WACL: Supporting Telecommunications Using Wearable Active Camera with Laser Pointer. In Proc. ISWC 2003, 53--56.","paperID":"None"},{"content":"Sodhi, R.S. et al. (2013). BeThere: 3D Mobile Collaboration with Spatial Input. In Proc. CHI 2013, 179--188.","paperID":"None"},{"content":"Tang, J.C. et al. (2013). HomeProxy: Exploring a Physical Proxy for Video Communication in the Home. In Proc. CHI 2013, 1339--1342.","paperID":"None"},{"content":"Virtual Photo Walks. http://www.virtualphotowalks.org.","paperID":"None"},{"content":"Yarosh, S. et al. (2010). Video playdate: toward free play across distance. In Proc. CHI 2010, 1251--1260.","paperID":"None"}],"title":"Mechanics of Camera Work in Mobile Video Collaboration","filename":"CHI15/p957","authors":["Brennan Jones","Anna Witcraft","Scott Bateman","Carman Neustaedter","Anthony Tang"],"conference":"CHI '15"}