{"paperId":2702174,"citation":[{"content":"David A. Shamma , Lyndon Kennedy , Jia Li , Bart Thomee , Haojian Jin , Jeff Yuan, Finding Weather Photos: Community-Supervised Methods for Editorial Curation of Online Sources, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819989"},{"content":"Engin Bozdag , Jeroen Hoven, Breaking the filter bubble: democracy and design, Ethics and Information Technology, v.17 n.4, p.249-265, December  2015","paperID":"2887443"}],"abstract":"People are becoming increasingly reliant on online socio-technical systems that employ algorithmic curation to organize, select and present information. We wanted to understand how individuals make sense of the influence of algorithms, and how awareness of algorithmic curation may impact their interaction with these systems. We investigated user understanding of algorithmic curation in Facebook's News Feed, by analyzing open-ended responses to a survey question about whether respondents believe their News Feeds show them every post their Facebook Friends create. Responses included a wide range of beliefs and causal inferences, with different potential consequences for user behavior in the system. Because user behavior is both input for algorithms and constrained by them, these patterns of belief may have tangible consequences for the system as a whole.","reference":[{"content":"Social Networking Fact Sheet, 2014. http://www.pewinternet.org/fact-sheets/socialnetworking-fact-sheet/.","paperID":"None"},{"content":"Backstrom, L. A Window Into News Feed, Aug. 2013. https://www.facebook.com/business/news/News-FeedFYI-A-Window-Into-News-Feed.","paperID":"None"},{"content":"Eytan Bakshy , Itamar Rosenn , Cameron Marlow , Lada Adamic, The role of social networks in information diffusion, Proceedings of the 21st international conference on World Wide Web, April 16-20, 2012, Lyon, France","paperID":"2187907"},{"content":"Michael S. Bernstein , Bongwon Suh , Lichan Hong , Jilin Chen , Sanjay Kairam , Ed H. Chi, Eddi: interactive topic-based browsing of social status streams, Proceedings of the 23nd annual ACM symposium on User interface software and technology, October 03-06, 2010, New York, New York, USA","paperID":"1866077"},{"content":"Engin Bozdag, Bias in algorithmic filtering and personalization, Ethics and Information Technology, v.15 n.3, p.209-227, September 2013","paperID":"2560640"},{"content":"Bucher, T. Want to be on the top? Algorithmic power and the threat of invisibility on Facebook. New Media & Society 14, 7 (Oct. 2012), 1164--1180.","paperID":"None"},{"content":"Jilin Chen , Rowan Nairn , Ed Chi, Speak little and well: recommending conversations in online social streams, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1978974"},{"content":"Clegg, C. W. Sociotechnical principles for system design. Applied Ergonomics (2000).","paperID":"None"},{"content":"Facebook. Company Info: Facebook Newsroom. http://newsroom.fb.com/company-info/, 2014.","paperID":"None"},{"content":"Facebook. How News Feed Works. https://www.facebook.com/help/327131014036297/, 2014.","paperID":"None"},{"content":"Daniel Fleder , Kartik Hosanagar, Blockbuster Culture's Next Rise or Fall: The Impact of Recommender Systems on Sales Diversity, Management Science, v.55 n.5, p.697-712, May 2009","paperID":"1538968"},{"content":"Gelman, S. A., and Legare, C. H. Concepts and folk theories. Annual Review of Anthropology (2011).","paperID":"None"},{"content":"Gillespie, T. The Relevance of Algorithms. In Media Technologies Essays on Communication, Materiality, and Society, P. Boczkowski and K. Foot, Eds. MIT Press, 2014.","paperID":"None"},{"content":"Hallinan, B., and Striphas, T. Recommended for you: The Netflix Prize and the production of algorithmic culture. New Media & Society (2014).","paperID":"None"},{"content":"Kevin Hamilton , Karrie Karahalios , Christian Sandvig , Motahhare Eslami, A path to understanding the effects of algorithm awareness, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2578883"},{"content":"Hogan, B. From Invisible Algorithms to Interactive Affordances: Data After the Ideology of Machine Learning. In Roles, Trust, and Reputation in Social Media Knowledge Markets. Springer International Publishing, Cham, 2015, 103--117.","paperID":"None"},{"content":"Jannach, D., Lerche, L., Gedikli, F., and Bonnin, G. What recommenders recommend-an analysis of accuracy, popularity, and sales diversity effects. User Modeling, Adaptation and Personalization (2013), pp. 25--37.","paperID":"None"},{"content":"Adam N. Joinson, Looking at, looking up or keeping up with people?: motives and use of facebook, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357213"},{"content":"Jones, N. A., Ross, H., Lynam, T., Perez, P., and Leitch, A. Mental Models: An Interdisciplinary Synthesis of Theory and Methods. Ecology And Society 16, 1 (2011).","paperID":"None"},{"content":"Kramer, A. D. I., Guillory, J. E., and Hancock, J. T. Experimental evidence of massive-scale emotional contagion through social networks. PNAS 111, 24 (2014), pp. 8788--8790.","paperID":"None"},{"content":"Talia Lavie , Michal Sela , Ilit Oppenheim , Ohad Inbar , Joachim Meyer, User attitudes towards news content personalization, International Journal of Human-Computer Studies, v.68 n.8, p.483-495, August, 2010","paperID":"1805371"},{"content":"Lenhart, A. Adults and social network sites. Tech. rep., Pew Research Center, 2009.","paperID":"None"},{"content":"Yuanhua Lv , Taesup Moon , Pranam Kolari , Zhaohui Zheng , Xuanhui Wang , Yi Chang, Learning to model relatedness for news recommendation, Proceedings of the 20th international conference on World wide web, March 28-April 01, 2011, Hyderabad, India","paperID":"1963417"},{"content":"Meadows, D. H. Thinking in Systems: A Primer. Chelsea Green Publishing, 2008.","paperID":"None"},{"content":"Tien T. Nguyen , Pik-Mai Hui , F. Maxwell Harper , Loren Terveen , Joseph A. Konstan, Exploring the filter bubble: the effect of using recommender systems on content diversity, Proceedings of the 23rd international conference on World wide web, April 07-11, 2014, Seoul, Korea","paperID":"2568012"},{"content":"Owens, E., and Vickrey, D. News Feed FYI: Showing More Timely Stories from Friends and Pages. http://newsroom.fb.com/news/2014/09/news-feed-fyishowing-more-timely-stories-from-friends-and-pages/, September 2014.","paperID":"None"},{"content":"William B. Rouse , Nicoleta Serban, Understanding change in complex socio-technical systems, Information-Knowledge-Systems Management, v.10 n.1-4, p.25-49, January 2011","paperID":"2596469"},{"content":"Sharma, A., and Cosley, D. Network-Centric Recommendation: Personalization with and in Social Networks. In IEEE SocialCom 2011 (2011), 282--289.","paperID":"None"},{"content":"Sharma, A., Gemici, M., and Cosley, D. Friends, Strangers, and the Value of Ego Networks for Recommendation. In ICWSM '13 (2013), 721--724.","paperID":"None"},{"content":"Singer, J. B. User-generated visibility: Secondary gatekeeping in a shared media space. New Media & Society 16, 1 (Jan. 2014), 55--73.","paperID":"None"},{"content":"Harald Steck, Item popularity and recommendation accuracy, Proceedings of the fifth ACM conference on Recommender systems, October 23-27, 2011, Chicago, Illinois, USA","paperID":"2043957"},{"content":"Abhay Sukumaran , Stephanie Vezich , Melanie McHugh , Clifford Nass, Normative influences on thoughtful online participation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979450"}],"title":"Understanding User Beliefs About Algorithmic Curation in the Facebook News Feed","filename":"CHI15/p173","authors":["Emilee Rader","Rebecca Gray"],"conference":"CHI '15"}