{"paperId":2702293,"citation":[{"content":"Niels van Berkel , Chu Luo , Denzil Ferreira , Jorge Goncalves , Vassilis Kostakos, The curse of quantified-self: an endless quest for answers, Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers, September 07-11, 2015, Osaka, Japan","paperID":"2800946"}],"reference":[{"content":"Adali, S., and Golbeck, J. Predicting personality with social behavior. In Proc. of ASONAM 2012, IEEE Computer Society (2012), 302--309.","paperID":"None"},{"content":"Bellotti, V., and Sellen, A. Design for privacy in ubiquitous computing environments. In Proc. of ECSCW '93, Kluwer Academic Publishers (1993), 77--92.","paperID":"None"},{"content":"Chen, J., Hsieh, G., Mahmud, J. U., and Nichols, J. Understanding individuals' personal values from social media word use. In Pro. of CSCW'14 (2014), 405--414.","paperID":"None"},{"content":"Cohen, A. A value based perspective on commitment in the workplace. International Journal of Intercultural Relations 33, 4 (2009), 332--345.","paperID":"None"},{"content":"Cormac, E. R. M. A Cognitive Theory of Metaphor. MIT Press, 1990.","paperID":"None"},{"content":"De Choudhury, M., Counts, S., and Horvitz, E. Predicting postpartum changes in emotion and behavior via social media. In Proc. of SIGCHI '13 (2013), 3267--3276.","paperID":"None"},{"content":"Egelman, S., Oates, A., and Krishnamurthi, S. Oops, i did it again: Mitigating repeated access control errors on facebook. In Proc. of SIGCHI '11, ACM (2011), 2295--2304.","paperID":"None"},{"content":"Fang, L., and LeFevre, K. Privacy wizards for social networking sites. In Proc. of WWW '10, ACM (2010), 351--360. 00179.","paperID":"None"},{"content":"Funder, D. C. The personality puzzle. WW Norton & Co, 1997.","paperID":"None"},{"content":"Gilbert, E., and Karahalios, K. Predicting tie strength with social media. In Proc. of SIGCHI '09, ACM (2009), 211--220.","paperID":"None"},{"content":"Golbeck, J., Robles, C., Edmondson, M., and Turner, K. Predicting ersonality from twitter. In Privacy, security, risk and trust in SocialCom '11 (2011), 149--156.","paperID":"None"},{"content":"Golbeck, J., Robles, C., and Turner, K. Predicting personality with social media. In Proc. CHI'11 EA, ACM (2011), 253--262.","paperID":"None"},{"content":"Gou, L., Zhou, M. X., and Yang, H. KnowMe and ShareMe: Understanding automatically discovered personality traits from social media and user sharing preferences. In Proc. of SIGCHI '14, ACM (2014), 955--964.","paperID":"None"},{"content":"Horvitz, E. Principles of mixed-initiative user interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '99, ACM (New York, NY, USA, 1999), 159--166. 00675.","paperID":"None"},{"content":"Iachello, G., and Hong, J. End-user privacy in human-computer interaction. Foundations and Trends in Human-Computer Interaction 1, 1 (2007), 1--137.","paperID":"None"},{"content":"Inc., F. Facebook audience preview, 2014.","paperID":"None"},{"content":"Junglas, I. A., Johnson, N. A., and Spitzmller, C. Personality traits and concern for privacy: an empirical study in the context of location-based services. Eur. J. of Info. Sys. 17, 4 (2008), 387--402.","paperID":"None"},{"content":"Knijnenburg, B. P., Kobsa, A., and Jin, H. Preference-based location sharing: are more privacy options really better? In Proc. of SIGCHI '13, ACM (2013), 2667--2676.","paperID":"None"},{"content":"Korzaan, M., Brooks, N., and Greer, T. Demystifying personality and privacy: An empirical investigation into antecedents of concerns for information privacy. Journal of Behavioral Studies in Business 1 (2009), 1--17.","paperID":"None"},{"content":"Lipford, H. R., Watson, J., Whitney, M., Froiland, K., and Reeder, R. W. Visual vs. compact: A comparison of privacy policy interfaces. In Proc. of SIGCHI '10, ACM (2010), 1111--1114.","paperID":"None"},{"content":"Liu, K., and Terzi, E. A framework for computing the privacy scores of users in online social networks. ACM Trans. Knowl. Discov. Data 5, 1 (Dec. 2010).","paperID":"None"},{"content":"Mairesse, F., Walker, M. A., Mehl, M. R., and Moore, R. K. Using linguistic cues for the automatic recognition of personality in conversation and text. J. Artif. Intell. Res.(JAIR) 30 (2007), 457--500.","paperID":"None"},{"content":"Mazzia, A., LeFevre, K., and Adar, E. The PViz comprehension tool for social network privacy settings. In Proc. of SOUPS '12, ACM (2012), 13:1--13:12.","paperID":"None"},{"content":"Olson, J. S., Grudin, J., and Horvitz, E. A study of preferences for sharing and privacy. In Proc. of CHI '05 EA, ACM (2005), 1985--1988.","paperID":"None"},{"content":"Palen, L., and Dourish, P. Unpacking \"privacy\" for a networked world. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '03, ACM (New York, NY, USA, 2003), 129--136.","paperID":"None"},{"content":"Patil, S., and Lai, J. Who gets to know what when: Configuring privacy permissions in an awareness application. In Proc. of SIGCHI '05, ACM (2005), 101--110.","paperID":"None"},{"content":"Patil, S., Schlegel, R., Kapadia, A., and Lee, A. J. Reflection or action?: How feedback and control affect location sharing decisions. In Proc. of SIGCHI '14, ACM (2014), 101--110.","paperID":"None"},{"content":"Pennacchiotti, M., and Popescu, A.-M. A machine learning approach to twitter user classification. In ICWSM (2011).","paperID":"None"},{"content":"Reeder, R. W., Bauer, L., Cranor, L. F., Reiter, M. K., Bacon, K., How, K., and Strong, H. Expandable grids for visualizing and authoring computer security policies. In Proc. of SIGCHI '08, ACM (2008), 1473--1482.","paperID":"None"},{"content":"Roberts, B. W., Kuncel, N. R., Shiner, R., Caspi, A., and Goldberg, L. R. The power of personality: The comparative validity of personality traits, socioeconomic status, and cognitive ability for predicting important life outcomes. Persp. on Psy. Sci. 2, 4 (2007), 313--345.","paperID":"None"},{"content":"Rode, J., Johansson, C., DiGioia, P., Filho, R. S., Nies, K., Nguyen, D. H., Ren, J., Dourish, P., and Redmiles, D. Seeing further: Extending visualization as a basis for usable security. In Proc. of SOUPS '06, ACM (2006), 145--155.","paperID":"None"},{"content":"Sadeh, N., Hong, J., Cranor, L., Fette, I., Kelley, P., Prabaker, M., and Rao, J. Understanding and capturing people's privacy policies in a mobile social networking application. Personal Ubiq. Comput. 13, 6 (2009), 401--412.","paperID":"None"},{"content":"Schlegel, R., Kapadia, A., and Lee, A. J. Eyeing your exposure: Quantifying and controlling information sharing for improved privacy. In Proc. of SOUPS '11, ACM (2011), 14:1--14:14.","paperID":"None"},{"content":"Shen, J., Brdiczka, O., and Liu, J. Understanding email writers: Personality prediction from email messages. In User Modeling, Adaptation, and Personalization. Springer, 2013, 318--330.","paperID":"None"},{"content":"Smith, H. J., Dinev, T., and Xu, H. Information privacy research: An interdisciplinary review. MIS quarterly 35, 4 (2011), 989--1016.","paperID":"None"},{"content":"Sweeny, L. k-anonymity: A model for protecting privacy. Int. J. Unc. Fuzz. Knowl. Based Syst. 10, 05 (2002), 557--570.","paperID":"None"},{"content":"Tausczik, Y. R., and Pennebaker, J. W. The psychological meaning of words: LIWC and computerized text analysis methods. J. of Lang.and Soc. Psy. 29, 1 (2010), 24--54.","paperID":"None"},{"content":"Westin, A. F., Maurici, D., Business, P. . A., LLP, P. W., and Associates, L. H. a. E-commerce & Privacy: What Net Users Want. Privacy & American Business, 1998.","paperID":"None"},{"content":"Yang, J., and Li, Y. Identifying user needs from social media. Tech. rep., IBM Tech. Report, 2013.","paperID":"None"},{"content":"Yarkoni, T. Personality in 100,000 words: A large-scale analysis of personality and word use among bloggers. J. of Res. in Personality 44, 3 (2010), 363--373.","paperID":"None"}],"abstract":"With the recent advances in using data analytics to automatically infer one's personality traits from their social media data, users are facing a growing tension between the use of the technology to aid self development in workplace and the privacy concerns of such use. Given the richness of personality data that can be derived today and the varied sensitivity of revealing such data, it is a non-trivial task for users to configure their privacy settings for sharing and protecting their derived personality data. Here we present the design, development, and evaluation of an interactive visualization tool, VeilMe, which helps users configure the privacy settings for the use of their personality portraits derived from social media. Unlike other privacy configuration tools, our tool offers two distinct advantages. First, it presents a novel and intuitive visual interface that aids users in understanding and exploring their own personality traits derived from their social media data, and configuring their privacy preferences. Second, our tool helps users to jump start their privacy settings by suggesting initial sharing strategies based on a set of factors, including the users' personality and target audience. We have evaluated the use of our tool with 124 participants in an enterprise context. Our results show that VeilMe effectively supports various user privacy configuration tasks, and also suggest several design implications, including the approaches to personalized privacy configurations.","title":"VeilMe: An Interactive Visualization Tool for Privacy Configuration of Using Personality Traits","filename":"CHI15/p817","authors":["Yang Wang","Liang Gou","Anbang Xu","Michelle X. Zhou","Huahai Yang","Hernan Badenes"],"conference":"CHI '15"}