{"paperId":2702302,"citation":[],"reference":[{"content":"App inventor. http://appinventor.mit.edu/.","paperID":"None"},{"content":"Blockly. https://code.google.com/p/blockly/.","paperID":"None"},{"content":"Bootstrap block editor. http://bootstrap-block-editor.appspot.com/.","paperID":"None"},{"content":"Natural deduction visualized as a game of dominoes. http://www.winterdrache.de/freeware/domino/.","paperID":"None"},{"content":"Scratch. http://scratch.mit.edu/.","paperID":"None"},{"content":"Tinkerblocks. http://www.tinkerblocks.org/.","paperID":"None"},{"content":"Broda, K., Ma, J., Sinnadurai, G., and Summers, A. Pandora: A reasoning toolbox using natural deduction style. Logic Journal of the IGLP 15, 4 (2007), 293--304.","paperID":"None"},{"content":"Carroll, J. M., Mack, R. L., and Kellogg, W. A. Interface metaphors and user interface design. In Handbook of Human-Computer Interaction, M. Helander, Ed. Elsevier Science, 1988, 67--85.","paperID":"None"},{"content":"Cooper, S., Khatib, F., Treuille, A., Barbero, J., Lee, J., Beenen, M., Leaver-Fay, A., Baker, D., and Popović, Z. Predicting protein structures with a multiplayer online game. Nature 466, 7307 (Aug. 2010), 756--760.","paperID":"None"},{"content":"Dietl, W., Dietzel, S., Ernst, M. D., Mote, N., Walker, B., Cooper, S., Pavlik, T., and Popović, Z. Verification games: Making verification fun. In FTfJP 2012: 14th Workshop on Formal Techniques for Java-like Programs (Beijing, China, June 12, 2012), 42--49.","paperID":"None"},{"content":"Esper, S., Foster, S. R., and Griswold, W. G. Codespells: Embodying the metaphor of wizardry for programming. In Proceedings of the 18th ACM Conference on Innovation and Technology in Computer Science Education, ITiCSE '13 (2013).","paperID":"None"},{"content":"Fast, E., Lee, C., Aiken, A., Bernstein, M. S., Koller, D., and Smith, E. Crowd-scale interactive formal reasoning and analytics. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology, UIST '13 (2013).","paperID":"None"},{"content":"Gasquet, O., Schwarzentruber, F., and Strecker, M. Panda: A proof assistant in natural deduction for all. A gentzen style proof assistant for undergraduate students. In Tools for Teaching Logic - Third International Congress, TICTTL (2011).","paperID":"None"},{"content":"Heer, J., and Robertson, G. Animated transitions in statistical data graphics. In IEEE Information Visualization (InfoVis) (2007).","paperID":"None"},{"content":"Hutchins, E. L., Hollan, J. D., and Norman, D. A. Direct manipulation interfaces. Hum.-Comput. Interact. 1, 4 (Dec. 1985), 311--338.","paperID":"None"},{"content":"Larkin, J. H., and Simon, H. A. Why a diagram is (sometimes) worth ten thousand words. Cognitive science 11, 1 (1987), 65--100.","paperID":"None"},{"content":"Martin, T., Smith, C. P., Andersen, E., Liu, Y.-E., and Popović, Z. Refraction time: Making split decisions in an online fraction game. In American Educational Research Association Annual Meeting (AERA) (2012).","paperID":"None"},{"content":"Pierce, B. C. Types and Programming Languages. MIT Press, Cambridge, MA, USA, 2002.","paperID":"None"},{"content":"Vasek, M. Representing Expressive Types in Blocks Programming Languages. Undergraduate honors thesis, Wellesley College, 2012.","paperID":"None"},{"content":"von Ahn, L., and Dabbish, L. Labeling images with a computer game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '04, ACM (New York, NY, USA, 2004), 319--326.","paperID":"None"},{"content":"Windsteiger, W. Theorema 2.0: A graphical user interface for a mathematical assistant system. In CEUR Workshop Proceedings (2012), 73--81.","paperID":"None"}],"abstract":"We present a novel block-based UI called Polymorphic Blocks, in which a connector's shape visually represents the structure of the data being passed through the connector. We use Polymorphic Blocks to add visual type information to block-based programming environments like Blockly or Scratch. We also use Polymorphic Blocks to represent logical proofs. In this context, if we erase all symbols, our UI becomes a puzzle game, where solving the puzzle amounts to building a proof. We show through a user study that our Logical Puzzle Game is faster, more fun, and more engaging than an equivalent pen-and-paper interface.","title":"Polymorphic Blocks: Formalism-Inspired UI for Structured Connectors","filename":"CHI15/p3063","authors":["Sorin Lerner","Stephen R. Foster","William G. Griswold"],"conference":"CHI '15"}