{"paperId":2702181,"citation":[],"reference":[{"content":"Bickmore, T., and Cassell, J. Social dialogue with embodied conversational agents. In Advances in natural multimodal dialogue systems. Springer, 2005, 23--54.","paperID":"None"},{"content":"Breazeal, C. Emotion and sociable humanoid robots. Int J Hum-Comput St 59, 1 (2003), 119--155.","paperID":"None"},{"content":"Brogårdh, T. Present and future robot control development-an industrial perspective. Annu Rev Control 31, 1 (2007), 69--79.","paperID":"None"},{"content":"Fogg, B. J. Persuasive computers: Perspectives and research directions. In Proc. CHI '98 (1998), 225--232.","paperID":"None"},{"content":"Forlizzi, J. How robotic products become social products: An ethnographic study of cleaning in the home. In Proc. HRI '07 (2007), 129--136.","paperID":"None"},{"content":"Forlizzi, J., and DiSalvo, C. Service robots in the domestic environment: A study of the Roomba vacuum in the home. In Proc. HRI '06 (2006), 258--265.","paperID":"None"},{"content":"Glaser, B. G., Strauss, A. L., and Strutzel, E. The discovery of grounded theory: Strategies for qualitative research. Nurs Res 17, 4 (1968), 364.","paperID":"None"},{"content":"Goetz, J., Kiesler, S., and Powers, A. Matching robot appearance and behavior to tasks to improve human-robot cooperation. In Proc. ROMAN '03 (2003), 55--60.","paperID":"None"},{"content":"Hirschfeld, R., Aghazadeh, F., and Chapleski, R. Survey of robot safety in industry. Int J Hum Factor Man 3, 4 (1993), 369--379.","paperID":"None"},{"content":"Kock, S., Vittor, T., Matthias, B., Jerregard, H., Kallman, M., Lundberg, I., Mellander, R., and Hedelind, M. Robot concept for scalable, flexible assembly automation: A technology study on a harmless dual-armed robot. In Proc. of ISAM (2011), 1--5.","paperID":"None"},{"content":"Kopp, S., Gesellensetter, L., Krämer, N. C., and Wachsmuth, I. A conversational agent as museum guide-design and evaluation of a real-world application. In Proc. IVA '05 (2005), 329--343.","paperID":"None"},{"content":"Lee, M. K., Kiesler, S., Forlizzi, J., and Rybski, P. Ripple effects of an embedded social agent: A field study of a social robot in the workplace. In Proc. CHI '12 (2012), 695--704.","paperID":"None"},{"content":"Ljungblad, S., Kotrbova, J., Jacobsson, M., Cramer, H., and Niechwiadowicz, K. Hospital robot at work: Something alien or an intelligent colleague? In Proc. CSCW '12 (2012), 177--186.","paperID":"None"},{"content":"Matthias, B., Kock, S., Jerregard, H., Kallman, M., Lundberg, I., and Mellander, R. Safety of collaborative industrial robots: Certification possibilities for a collaborative assembly robot concept. In Proc. ISAM '11 (2011), 1--6.","paperID":"None"},{"content":"Moon, Y. Intimate exchanges: Using computers to elicit self-disclosure from consumers. J Consum Res 26, 4 (2000), 323--339.","paperID":"None"},{"content":"Mutlu, B., and Forlizzi, J. Robots in organizations: The role of workflow, social, and environmental factors in human-robot interaction. In Proc. HRI '08 (2008), 287--294.","paperID":"None"},{"content":"Nass, C., and Lee, K. M. Does computer-generated speech manifest personality? An experimental test of similarity-attraction. In Proc. CHI '00 (2000), 329--336.","paperID":"None"},{"content":"Nass, C., and Moon, Y. Machines and mindlessness: Social responses to computers. J Soc Issues 56, 1 (2000), 81--103.","paperID":"None"},{"content":"Shibata, T. An overview of human interactive robots for psychological enrichment. In Proc. of the IEEE, vol. 92 (2004), 1749--1758.","paperID":"None"},{"content":"Siino, R., and Hinds, P. J. Robots, gender & sensemaking: Sex segregation's impact on workers making sense of a mobile autonomous robot. In Proc. ICRA '05, vol. 3 (2005), 2773.","paperID":"None"},{"content":"Sung, J.-Y., Christensen, H. I., and Grinter, R. E. Robots in the wild: Understanding long-term use. In Proc. HRI '09 (2009), 45--52.","paperID":"None"},{"content":"Sung, J.-Y., Grinter, R. E., Christensen, H. I., and Guo, L. Housewives or technophiles?: Understanding domestic robot owners. In Proc. HRI '08 (2008), 129--136.","paperID":"None"},{"content":"Sung, J.-Y., Guo, L., Grinter, R., and Christensen, H. \"My Roomba is Rambo:\" Intimate home appliances. In Proc. UbiComp '07 (2007), 145--162.","paperID":"None"},{"content":"Vertesi, J. Seeing like a rover: Embodied experience on the mars exploration rover mission. In Proc. CHI '08 Extended Abstracts (2008), 2523--2532.","paperID":"None"}],"abstract":"Across history and cultures, robots have been envisioned as assistants working alongside people. Following this vision, an emerging family of products-collaborative manufacturing robots-is enabling human and robot workers to work side by side as collaborators in manufacturing tasks. Their introduction presents an opportunity to better understand people's interactions with and perceptions of a robot \"co-worker\" in a real-world setting to guide the design of these products. In this paper, we present findings from an ethnographic field study at three manufacturing sites and a Grounded Theory analysis of observations and interviews. Our results show that, even in this safety-critical manufacturing setting, workers relate to the robot as a social entity and rely on cues to understand the robot's actions, which we observed to be critical for workers to feel safe when near the robot. These findings contribute to our understanding of interactions with robotic products in real-world settings and offer important design implications.","title":"The Social Impact of a Robot Co-Worker in Industrial Settings","filename":"CHI15/p3613","authors":["Allison Sauppé","Bilge Mutlu"],"conference":"CHI '15"}