{"paperId":2702585,"citation":[],"reference":[{"content":"Bertini, E. and Santucci, G. (2004). Quality Metrics for 2D Scatterplot Graphics: Automatically Reducing Visual Clutter. Smart Graphics, 77--89.","paperID":"None"},{"content":"Fast, M. (2010). What the heck is PITCHf/x. The Hardball Times Annual, 153--8.","paperID":"None"},{"content":"Few, S. (2008). Solutions to the Problem of Over-plotting in Graphs. Visual Business Intelligence Newsletter.","paperID":"None"},{"content":"Jeffrey Heer , Michael Bostock, Crowdsourcing graphical perception: using mechanical turk to assess visualization design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753357"},{"content":"Aniket Kittur , Ed H. Chi , Bongwon Suh, Crowdsourcing user studies with Mechanical Turk, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357127"},{"content":"Martin Luboschik , Axel Radloff , Heidrun Schumann, A new weaving technique for handling overlapping regions, Proceedings of the International Conference on Advanced Visual Interfaces, May 26-28, 2010, Roma, Italy","paperID":"1842999"},{"content":"Adrian Mayorga , Michael Gleicher, Splatterplots: Overcoming Overdraw in Scatter Plots, IEEE Transactions on Visualization and Computer Graphics, v.19 n.9, p.1526-1538, September 2013","paperID":"2511851"},{"content":"Thomas Porter , Tom Duff, Compositing digital images, Proceedings of the 11th annual conference on Computer graphics and interactive techniques, p.253-259, January 1984","paperID":"808606"},{"content":"Stone, M. and Bartram, L. (2008). Alpha, contrast and the perception of visual metadata. C&IC, 355--359.","paperID":"None"}],"abstract":"Scatterplots are an effective and commonly used technique to show the relationship between two variables. However, as the number of data points increases, the chart suffers from \"over-plotting\" which obscures data points and makes the underlying distribution of the data difficult to discern. Reducing the opacity of the data points is an effective way to address over-plotting, however, setting the individual point opacity is a manual task performed by the chart designer. We present a user-driven model of opacity scaling for scatter plots built from crowd-sourced responses to opacity scaling tasks using several synthetic data distributions, and then test our model on a collection of real-world data sets.","video":"http://www.youtube.com/embed/JP80ajFX9o4?rel=0","title":"Dynamic Opacity Optimization for Scatter Plots","filename":"CHI15/p2707","authors":["Justin Matejka","Fraser Anderson","George Fitzmaurice"],"conference":"CHI '15"}