{"paperId":2702323,"citation":[],"reference":[{"content":"Google Finance. https://www.google.com/finance.","paperID":"None"},{"content":"Lava lamp. http://lavalamp.com/.","paperID":"None"},{"content":"Twitter. https://twitter.com/.","paperID":"None"},{"content":"WebGL. http://get.webgl.org/.","paperID":"None"},{"content":"Yahoo! Finance. http://finance.yahoo.com/.","paperID":"None"},{"content":"Andrews, C., Endert, A., Yost, B., and North, C. Information visualization on large, high-resolution displays: Issues, challenges, and opportunities. Information Visualization 10, 4 (2011), 341--355.","paperID":"None"},{"content":"Blinn, J. A generalization of algebraic surface drawing. ACM Transactions of Graphics (1982), 235--256.","paperID":"None"},{"content":"Block, F., Horn, M., Phillips, B., Diamond, J., Evans, E., and Shen, C. The deeptree exhibit: Visualizing the tree of life to facilitate informal learning. IEEE Transactions on Visualization and Computer Graphics (2012), 2789--2798.","paperID":"None"},{"content":"Bostock, M., Ogievetsky, V., and Heer, J. D3: Data driven documents. IEEE Transactions on Visualization and Computer Graphics (2011), 2301--2309.","paperID":"None"},{"content":"Brignull, H., and Rogers, Y. Enticing people to interact with large public displays in public spaces. In Proceedings of the IFIP International Conference on Human-Computer Interaction (2003), 17--24.","paperID":"None"},{"content":"Chittaro, L. Visualizing information on mobile devices. Computer 39, 3 (2006), 40--45.","paperID":"None"},{"content":"Edge, D., and Blackwell, A. F. Peripheral tangible interaction by analytic design. In Proceedings of the 3rd ACM International Conference on Tangible and Embedded Interaction (2009), 69--76.","paperID":"None"},{"content":"Elby, A. What students' learning of representations tells us about constructivism. The Journal of Mathematical Behavior 19, 4 (2000), 481--502.","paperID":"None"},{"content":"Evans, J. L., and Archer, S. H. Diversification and the reduction of dispersion: An empirical analysis. The Journal of Finance 23, 5 (1968), 761--767.","paperID":"None"},{"content":"Fekete, J.-D., Wijk, J. J., Stasko, J. T., and North, C. The value of information visualization. In Information Visualization. Springer-Verlag, 2008, 1--18.","paperID":"None"},{"content":"Haroz, S., and Whitney, D. How capacity limits of attention influence information visualization effectiveness. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2402--2410.","paperID":"None"},{"content":"Hart, S. G., and Staveland, L. E. Development of nasa-tlx (task load index): Results of empirical and theoretical research. Advances in psychology 52 (1988), 139--183.","paperID":"None"},{"content":"Heer, J., and Agrawala, M. Design considerations for collaborative visual analytics. In IEEE Symposium on Visual Analytics Science and Technology (2007), 171--178.","paperID":"None"},{"content":"Isenberg, P., Elmqvist, N., Scholtz, J., Cernea, D., Ma, K.-L., and Hagen, H. Collaborative visualization: Definition, challenges, and research agenda. Information Visualization 10, 4 (2011), 310--326.","paperID":"None"},{"content":"Jafarinaimi, N., Forlizzi, J., Hurst, A., and Zimmerman, J. Breakaway: an ambient display designed to change human behavior. In Proceedings of ACM Extended Abstracts on Human Factors in Computing Systems (2005), 1945--1948.","paperID":"None"},{"content":"Jansen, Y., and Dragicevic, P. An interaction model for visualizations beyond the desktop. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2396--2405.","paperID":"None"},{"content":"Jim Barrett. Whack A Mole. http://www.ictgames.com/whackAMole/.","paperID":"None"},{"content":"Kawato, S., and Ohya, J. Two-step approach for real-time eye tracking with a new filtering technique. In IEEE International Conference on Systems, Man, and Cybernetics, vol. 2 (2000), 1366--1371.","paperID":"None"},{"content":"Lee Brodie. How many stocks should you own at one time? http://www.cnbc.com/, 2014.","paperID":"None"},{"content":"Levin, G., and Lieberman, Z. In-situ speech visualization in real-time interactive installation and performance. In Proceedings of the 3rd International Symposium on Non-photorealistic Animation and Rendering (2004), 7--14.","paperID":"None"},{"content":"Ma, J., Liao, I., Ma, K.-L., and Frazier, J. Living liquid: Design and evaluation of an exploratory visualization tool for museum visitors. IEEE Transactions on Visualization and Computer Graphics (2012), 2799--2808.","paperID":"None"},{"content":"Ogawa, M., and Ma, K.-L. code swarm: A design study in organic software visualization. IEEE Transactions on Visualization and Computer Graphics (2009), 1097--1104.","paperID":"None"},{"content":"Pousman, Z., and Stasko, J. A taxonomy of ambient information systems: four patterns of design. In Proceedings of ACM working conference on Advanced visual interfaces (2006), 67--74.","paperID":"None"},{"content":"Pousman, Z., Stasko, J., and Mateas, M. Casual information visualization: Depictions of data in everyday life. IEEE Transactions on Visualization and Computer Graphics (2007), 1145--1152.","paperID":"None"},{"content":"Skog, T., Ljungblad, S., and Holmquist, L. Between aesthetics and utility: designing ambient information visualizations. In Proceedings of IEEE Symposium on Information Visualization. (2003), 233--240.","paperID":"None"},{"content":"Somervell, J., McCrickard, D. S., North, C., and Shukla, M. An evaluation of information visualization in attention-limited environments. In Proceedings of the Eurographics - IEEE TCVG Symposium on Data Visualisation (2002), 211--216.","paperID":"None"},{"content":"Sprague, D., and Tory, M. Motivation and procrastination: Methods for evaluating pragmatic casual information visualizations. IEEE Transactions on Computer Graphics and Applications (2009), 86--91.","paperID":"None"},{"content":"Vogel, D., and Balakrishnan, R. Interactive public ambient displays: Transitioning from implicit to explicit, public to personal, interaction with multiple users. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (2004), 137--146.","paperID":"None"}],"abstract":"Design methodologies for information visualizations are typically based on the assumption that the users will be fully engaged in the visual exploration of the displayed information. However, recent research suggests that there is an increasing diversity in how users engage with modern visualizations, and that the traditional design theories do not always satisfy the varied users needs. In this paper, we present a new design concept, engagement-versatile design, for visualizations that target users with a variety of engagement styles. Without losing generality, we demonstrate the feasibility of this concept through the designing of a system called Stock Lamp, an engagement-versatile visualization that helps users keep track of the stock market in real-time. This design process includes identifying different modes of engagement, deriving design implications from each engagement-mode, and applying them to the visualization's design. Our user study shows that Stock Lamp is able to consistently relay market information even when the users are multi-tasking. We believe this study establishes a new concept that promotes a systematic design approach that leverages both theoretical and empirical design methodologies for future visualization development.","title":"Stock Lamp: An Engagement-Versatile Visualization Design","filename":"CHI15/p595","authors":["Yuzuru Tanahashi","Kwan-Liu Ma"],"conference":"CHI '15"}