{"paperId":2702497,"citation":[],"reference":[{"content":"Axivity Limited. http://axivity.com.","paperID":"None"},{"content":"Barad, K. (2003). Posthumanist Performativity: Toward an Understanding of How Matter Comes to Matter. Signs: Journal of Women in Culture and Society, 28(3), pp.801--831.","paperID":"None"},{"content":"Butler, J. (1993). Gender Trouble: Feminism and the subversion of identity. Routledge: London.","paperID":"None"},{"content":"Cooley, J. & Tukey, J. (1965). \"An algorithm for the machine calculation of complex Fourier series\". Math. Comput. 19: 297--301.","paperID":"None"},{"content":"William Gaver, What should we expect from research through design?, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208538"},{"content":"Godbout, A., & Boyd, J. E. (2010). Corrective sonic feedback for speed skating: a case study. In Proc. ICAD 2010 (pp. 23--30).","paperID":"None"},{"content":"Gowtow, B. Kinect hand tracking visualization. {Online}. http://blog.foundry376.com/2011/02/kinect-handtracking-visualization/.","paperID":"None"},{"content":"Hermann, T. & Ritter, H., (2004) Sound and meaning in auditory data display. Proceedings of the IEEE 92(4), pp. 730--741.","paperID":"None"},{"content":"Hermann, T., & Hunt, A. (2011). The sonification handbook. Berlin: Logos Verlag.","paperID":"None"},{"content":"Ingold, T. (2013). Making: anthropology, archeology, art and architecture. Routledge: Milton Park.","paperID":"None"},{"content":"International Community for Auditory Display. {Online} http://www.icad.org/.","paperID":"None"},{"content":"Jensenius, A. R. (2007). Action-Sound, developing methods and tools to study music-related body movement. PhD thesis, University of Oslo, 2007.","paperID":"None"},{"content":"LeapMotion. {Online}. http://www.leapmotion.com.","paperID":"None"},{"content":"Perry, G., & Krippendorff, K. (2013). On the reliability of identifying design moves in protocol analysis. Design Studies, 34(5), pp. 612--635.","paperID":"None"},{"content":"Polanyi, M (1966), The Tacit Dimension, University of Chicago Press: Chicago.","paperID":"None"},{"content":"PureData. {Online}. http://puredata.info.","paperID":"None"},{"content":"Roberts, J, Jones, R, Mansfield, N, & Rothberg, S. (2005) Evaluation of impact sound on the 'feel' of a golf shot, Journal of Sound and Vibration, vol. 287, no. 4--5, pp. 651--666.","paperID":"None"},{"content":"Schaffert, N., Mattes, K., & Effenberg, A. O. (2009). A sound design for the purposes of movement optimisation in elite sport (using the example of rowing). In Proc ICAD 2009.","paperID":"None"},{"content":"Schön, D. A. (1983). The reflective practitioner: How professionals think in action. New York: Basic Books.","paperID":"None"},{"content":"Phoebe Sengers , Kirsten Boehner , Shay David , Joseph 'Jofish' Kaye, Reflective design, Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility, August 20-24, 2005, Aarhus, Denmark","paperID":"1094569"},{"content":"Jaka Sodnik , Christina Dicke , Sašo Tomazič , Mark Billinghurst, A user study of auditory versus visual interfaces for use while driving, International Journal of Human-Computer Studies, v.66 n.5, p.318-332, May, 2008","paperID":"1360936"},{"content":"Star, S. & Griesemer, J. (1989). \"Institutional Ecology, 'Translations' and Boundary Objects: Amateurs and Professionals in Berkeley's Museum of Vertebrate Zoology, 1907--39\". Social Studies of Science 19 (3): 387--420.","paperID":"None"},{"content":"Wood. N. (2006). Transmitting craft knowledge: designing interactive media to support tacit skills learning. PhD thesis, Sheffield Hallam University, November 2006.","paperID":"None"},{"content":"Wood N & Horne G (2008). The new journeyman; the role of an expert learner in eliciting and transmitting skilled knowledge. Proceedings of the Design Research Society Conference, Sheffield, July 2008.","paperID":"None"},{"content":"John Zimmerman , Erik Stolterman , Jodi Forlizzi, An analysis and critique of Research through Design: towards a formalization of a research approach, Proceedings of the 8th ACM Conference on Designing Interactive Systems, August 16-20, 2010, Aarhus, Denmark","paperID":"1858228"}],"abstract":"Much of the knowing employed in skilled craft practice is difficult to communicate solely through written or verbal description. Consequently, the reflection and development of a craft practice in this manner may miss important nuances of practitioners' skills and experiences. We created digital technologies to sonify (using audio to perceptualize data) a group of craft practitioners' gestures to explore how we can aid their reflection in and on their craft, and consequently develop it. Over a number of workshops, the design of these sonifications were iterated based on how the practitioners responded to them. We found that direct sonification of gesture (sounds generated directly from motion sensor data) helped practitioners understand and reflect upon their own and each other's practice, encouraged discussion and enabled modification of craft technique.","video":"http://www.youtube.com/embed/lfj5ruis5jk?rel=0","title":"Exploring Gesture Sonification to Support Reflective Craft Practice","filename":"CHI15/p67","authors":["Thomas Smith","Simon J. Bowen","Bettina Nissen","Jonathan Hook","Arno Verhoeven","John Bowers","Peter Wright","Patrick Olivier"],"conference":"CHI '15"}