{"paperId":2702513,"citation":[],"abstract":"Smartphones are becoming larger, mainly because bigger screens offer a better experience for viewing content. One drawback of larger screens is that they make single-hand interactions difficult because of hard to reach touch targets and of the need to re-grip the device, both factors significantly reducing their usability. Flexible smartphones offer an opportunity for addressing this issue. We first set out to determine the use of common single-hand mobile interactions through an online survey. Then, we designed and evaluated one-handed deformable gestures that offer the potential for addressing the finger reach limitation on large smartphones. We identified that the top right up bend and the center squeeze up gestures are the fastest and preferred gestures. We found no hand preference, which indicates that the gestures could be implemented to fit the needs of a wider range of the population, instead of favoring right-handed users. Finally, we discuss the impact on deformable gestures on one-handed interactions issues.","reference":[{"content":"Ahmaniemi, T., Kildal, J., and Haveri, M. What is a device bend gesture really good for? Proc. CHI, (2014), 3503--3512.","paperID":"None"},{"content":"Balakrishnan, R. and Fitzmaurice, G. Exploring interactive curve and surface manipulation using a bend and twist sensitive input strip. Proc. Interactive 3D graphics, (1999), 111--119.","paperID":"None"},{"content":"Bergstrom-Lehtovirta, J. and Oulasvirta, A. Modeling the functional area of the thumb on mobile touchscreen surfaces. Proc. CHI, (2014), 1991--2000.","paperID":"None"},{"content":"Boring, S., Ledo, D., Chen, X.A., Marquardt, N., Tang, A., and Greenberg, S. The Fat Thumb: Using the Thumb's Contact Size for Single-Handed Mobile Interaction. Proc. MobileHCI, (2012), 39--48.","paperID":"None"},{"content":"Burstyn, J. FlexView: An Evaluation of Depth Navigation on Deformable Mobile Devices. Proc. TEI, (2012), 193--200.","paperID":"None"},{"content":"Dijkstra, R., Perez, C., and Vertegaal, R. Evaluating effects of structural holds on pointing and dragging performance with flexible displays. Proc. CHI, (2011), 1293--1302.","paperID":"None"},{"content":"Gallant, D., Seniuk, A., and Vertegaal, R. Towards more paper-like input: flexible input devices for foldable interaction styles. Proc. UIST, (2008), 283--286.","paperID":"None"},{"content":"Holman, D., Hollatz, A., Banerjee, A., and Vertegaal, R. Unifone: Designing for auxiliary finger input in onehanded mobile interactions. Proc. TEI, (2013), 177--184.","paperID":"None"},{"content":"Karlson, A. and Bederson, B. ThumbSpace: Generalized One-handed Input for Touchscreen-based Mobile Devices. Proc. INTERACT, (2007), 324--338.","paperID":"None"},{"content":"Kildal, J., Paasovaara, S., and Aaltonen, V. Kinetic Device?: Designing Interactions with a Deformable Mobile Interface. Proc. CHI EA, (2012), 1871--1876.","paperID":"None"},{"content":"Kildal, J. Interacting with deformable user interfaces: effect of material stiffness and type of deformation gesture. Haptic and Audio Interaction Design, (2012), 71--80.","paperID":"None"},{"content":"Kim, S., Yu, J., and Lee, G. Interaction Techniques for Unreachable Objects on the Touchscreen. Proc. OzCHI, (2012), 295--298.","paperID":"None"},{"content":"Lahey, B., Girouard, A., Burleson, W., and Vertegaal, R. PaperPhone: Understanding the Use of Bend Gestures in Mobile Devices with Flexible Electronic Paper Displays. Proc. CHI, (2011), 1303--1312.","paperID":"None"},{"content":"Lee, S., Lim, Y., and Lee, K.-P. Exploring the effects of size on deformable user interfaces. Proc. CHI, (2012), 89.","paperID":"None"},{"content":"Lee, S., Maeng, S., Kim, D., Lee, K., and Lee, W. FlexRemote: Exploring the effectiveness of deformable user interface as an input device for TV. Proc. HCII, (2011), 62--65.","paperID":"None"},{"content":"Lee, S.-S., Kim, S., Jin, B., et al. How Users Manipulate Deformable Displays as Input Devices. Proc. CHI, (2010), 1647.","paperID":"None"},{"content":"Lo, J. and Girouard, A. Fabricating Bendy: Design and Development of Deformable Prototypes. IEEE Pervasive Special Issue on Fabrication and Printing 13, 3 (2014), 40--46.","paperID":"None"},{"content":"Miyaki, T. and Rekimoto, J. GraspZoom: zooming and scrolling control model for single-handed mobile interaction. Proc. MobileHCI, (2009).","paperID":"None"},{"content":"Roudaut, A. and Huot, S. TapTap and MagStick?: Improving One-Handed Target Acquisition on Small Touch-screens. Proc. AVI, (2008), 146--153.","paperID":"None"},{"content":"Schwesig, C., Poupyrev, I., and Mori, E. Gummi: A Bendable Computer. Proc. CHI, (2004), 263--270.","paperID":"None"},{"content":"Spelmezan, D., Appert, C., Chapuis, O., and Pietriga, E. Controlling widgets with one power-up button. Proc. UIST, (2013), 71--74.","paperID":"None"},{"content":"Spelmezan, D., Appert, C., Chapuis, O., and Pietriga, E. Side pressure for bidirectional navigation on small devices. Proc. MobileHCI, (2013), 11--20.","paperID":"None"},{"content":"Steimle, J., Jordt, A., and Maes, P. Flexpad?: Highly Flexible Bending Interactions for Projected Handheld Displays. Proc. CHI, (2013).","paperID":"None"},{"content":"Warren, K., Lo, J., Vadgama, V., and Girouard, A. Bending the Rules: Bend Gesture Classification for Flexible Displays. Proc. CHI, (2013).","paperID":"None"},{"content":"Watanabe, J., Mochizuki, A., and Horry, Y. Bookisheet: Bendable Device for Browsing Content Using the Metaphor of Leafing Through the Pages. Proc. UbiComp, (2008), 360--369.","paperID":"None"},{"content":"Wightman, D., Ginn, T., and Vertegaal, R. BendFlip: Examining Input Techniques for Electronic Book Readers with Flexible Form Factors. Proc. INTERACT, (2011), 117--133.","paperID":"None"},{"content":"Wilson, G., Brewster, S., and Halvey, M. Towards utilising one-handed multi-digit pressure input. Proc. CHI EA, (2013), 1317--1322.","paperID":"None"},{"content":"Ye, Z. and Khalid, H. Cobra: Flexible Displays for Mobile Gaming Scenarios. Proc. CHI EA, (2010), 4363--4367.","paperID":"None"},{"content":"Yu, N.-H., Huang, D.-Y., Hsu, J.-J., and Hung, Y.-P. Rapid Selection of Hard-to-Access Targets by Thumb on Mobile Touch-Screens. Proc. MobileHCI, (2013), p. 400.","paperID":"None"}],"title":"One-Handed Bend Interactions with Deformable Smartphones","filename":"CHI15/p1509","authors":["Audrey Girouard","Jessica Lo","Md Riyadh","Farshad Daliri","Alexander Keith Eady","Jerome Pasquero"],"conference":"CHI '15"}