{"paperId":2702486,"abstract":"When trying to satisfy an information need, smartphone users frequently transition from mobile search engines to mobile apps and vice versa. However, little is known about the nature of these transitions nor how mobile search and mobile apps interact. We report on a 2-week, mixed-method study involving 18 Android users, where we collected real-world mobile search and mobile app usage data alongside subjective insights on why certain interactions between apps and mobile search occur. Our results show that when people engage with mobile search they tend to interact with more mobile apps and for longer durations. We found that certain categories of apps are used more intensely alongside mobile search. Furthermore we found differences in app usage before and after mobile search and show how mobile app interactions can both prompt mobile search and enable users to take action. We conclude with a discussion on what these patterns mean for mobile search and how we might design mobile search experiences that take these app interactions into account.","citation":[{"content":"Karen Church , Denzil Ferreira , Nikola Banovic , Kent Lyons, Understanding the Challenges of Mobile Phone Usage Data, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, August 24-27, 2015, Copenhagen, Denmark","paperID":"2785891"}],"reference":[{"content":"Amin, A., Townsend, S., Ossenbruggen, J., and Hardman, L. Fancy a drink in canary wharf?: A user study on location-based mobile search. In Proceedings of INTERACT '09:, Springer-Verlag (2009), 736--749.","paperID":"None"},{"content":"Baeza-Yates, R., and Velasco, J. A study of mobile search queries in japan. In Query Log Analysis: Social and Technological Challenges, WWW Workshop (2007).","paperID":"None"},{"content":"Böhmer, M., Hecht, B., Schöning, J., Krüger, A., and Bauer, G. Falling asleep with angry birds, facebook and kindle: a large scale study on mobile application usage. In Proceedings of Mobile HCI'11, ACM (2011), 47--56.","paperID":"None"},{"content":"Brown, B., McGregor, M., and Laurier, E. iphone in vivo: Video analysis of mobile device use. In Proceedings of CHI'13, ACM (2013), 1031--1040.","paperID":"None"},{"content":"Chua, A. Y. K., Balkunje, R. S., and Goh, D. H.-L. Fulfilling mobile information needs: a study on the use of mobile phones. In Proceedings of ICUIMC '11, ACM (2011), 92:1--92:7.","paperID":"None"},{"content":"Church, K., Cherubini, M., and Oliver, N. A large-scale study of daily information needs captured in situ. In TOCHI 21, 2 (2014), 10.","paperID":"None"},{"content":"Church, K., and Oliver, N. Understanding mobile web and mobile search use in today's dynamic mobile landscape. In Proceedings of MobileHCI'11, ACM (2011), 67--76.","paperID":"None"},{"content":"Church, K., Smyth, B., Cotter, P., and Bradley, K. Mobile information access: A study of emerging search behavior on the mobile internet. In TWEB 1, 1 (2007), 4.","paperID":"None"},{"content":"Cui, Y., and Roto, V. How people use the web on mobile devices. In Proceeding of WWW '08, ACM (2008), 905--914.","paperID":"None"},{"content":"Dearman, D., Kellar, M., and Truong, K. N. An examination of daily information needs and sharing opportunities. In Proceedings of CSCW'08, ACM (2008), 679--688.","paperID":"None"},{"content":"Ferreira, D., Gonc¸alves, J., Kostakos, V., Barkhuus, L., and Dey, A. K. Contextual experience sampling of mobile application micro-usage. In Proceedings of MobileHCI'14, ACM (2014).","paperID":"None"},{"content":"Heimonen, T. Information needs and practices of active mobile internet users. In Proceedings of Mobility '09, ACM (2009), 1--8.","paperID":"None"},{"content":"Kamvar, M., and Baluja, S. A large scale study of wireless search behavior: Google mobile search. In Proceedings of CHI'06, ACM (2006), 701--709.","paperID":"None"},{"content":"Kamvar, M., Kellar, M., Patel, R., and Xu, Y. Computers and iphones and mobile phones, oh my!: a logs-based comparison of search users on different devices. In Proceedings of WWW'09, ACM (2009), 801--810.","paperID":"None"},{"content":"Komaki, D., Hara, T., and Nishio, S. How does mobile context affect people's web search behavior?: A diary study of mobile information needs and search behaviors. In Proceedings of AINA, IEEE (2012), 245--252.","paperID":"None"},{"content":"Lee, I., Kim, J., and Kim, J. Use contexts for the mobile internet: A longitudinal study monitoring actual use of mobile internet services. International Journal of Human-Computer Interaction 18, 3 (2005), 269--292.","paperID":"None"},{"content":"Lee, U., Lee, J., Ko, M., Lee, C., Kim, Y., Yang, S., Yatani, K., Gweon, G., Chung, K.-M., and Song, J. Hooked on smartphones: an exploratory study on smartphone overuse among college students. In Proceedings of CHI'14, ACM (2014), 2327--2336.","paperID":"None"},{"content":"McGregor, M., Brown, B., and McMillan, D. 100 days of iphone use: Mobile recording in the wild. In Proceedings of CHI '14 EA, ACM (2014), 2335--2340.","paperID":"None"},{"content":"Nielsen. An era of growth: The cross-platform report. http://bit.ly/1pcoQFU, March 2014.","paperID":"None"},{"content":"Nylander, S., Lundquist, T., and Brännström, A. At home and with computer access: why and where people use cell phones to access the internet. In Proceedings of CHI'09, ACM (2009), 1639--1642.","paperID":"None"},{"content":"Sohn, T., Li, K. A., Griswold, W. G., and Hollan, J. D. A diary study of mobile information needs. In Proceedings of CHI'08, ACM (2008), 433--442.","paperID":"None"},{"content":"Song, Y., Ma, H., Wang, H., and Wang, K. Exploring and exploiting user search behavior on mobile and tablet devices to improve search relevance. In Proceedings of WWW'13, ACM (2013), 1201--1212.","paperID":"None"},{"content":"Taylor, C. A., Anicello, O., Somohano, S., Samuels, N., Whitaker, L., and Ramey, J. A. A framework for understanding mobile internet motivations and behaviors. In Proceedings of CHI'08 EA, ACM (2008), 2679--2684.","paperID":"None"},{"content":"Teevan, J., Karlson, A., Amini, S., Brush, A. B., and Krumm, J. Understanding the importance of location, time, and people in mobile local search behavior. In Proceedings of MobileHCI'11 (2011).","paperID":"None"},{"content":"Tossell, C., Kortum, P., Rahmati, A., Shepard, C., and Zhong, L. Characterizing web use on smartphones. In Proceedings of CHI '12, ACM (2012), 2769--2778.","paperID":"None"},{"content":"Vojnovic, M. On mobile user behaviour patterns. In International Zurich Seminar on Communications, IEEE Communications Society (2008).","paperID":"None"},{"content":"Yi, J., Maghoul, F., and Pedersen, J. Deciphering mobile search patterns: a study of yahoo! mobile search queries. In Proceedings of WWW'08, ACM (2008), 257--266.","paperID":"None"}],"title":"An In-Situ Study of Mobile App & Mobile Search Interactions","filename":"CHI15/p2739","authors":["Juan Pablo Carrascal","Karen Church"],"conference":"CHI '15"}