{"paperId":2702546,"abstract":"The Energy Babble is a kind of automated talk-radio that is obsessed with energy and the environment. We developed it with, and deployed it to, a number of existing \"energy communities\" in the UK. The system gathers content from a variety of online sources, including Twitter? feeds from the communities, from governmental departments, and from the National Grid, and chats about it continually using a number of synthesised voices interspersed with a variety of jingles and sound effects. Designed to playfully reflect and comment on the existing state of discourse and reports of practice in the UK, the Babble can be considered both as a product and as a research tool, in which role it worked to highlight issues, understandings, practices and difficulties in the communities with whom we worked.","citation":[{"content":"Florian Güldenpfennig , Geraldine Fitzpatrick, De+re: a design concept for provoking meaningful interactive experiences, Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia, November 30-December 02, 2015, Linz, Austria","paperID":"2836072"}],"reference":[{"content":"Abrahamse, W., Steg, L., Vlek, C., & Rothengatter, T. (2005). A review of intervention studies aimed at household energy conservation. Journal of environmental psychology, 25(3), 273--291.","paperID":"None"},{"content":"Hronn Brynjarsdottir , Maria Håkansson , James Pierce , Eric Baumer , Carl DiSalvo , Phoebe Sengers, Sustainably unpersuaded: how persuasion narrows our vision of sustainability, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208539"},{"content":"Callon, M. (2004) The Role of Hybrid Communities and Socio-Technical Arrangements in the Participatory Design. Journal of the Center for Information Studies 5(3): 3--10.","paperID":"None"},{"content":"DiSalvo, C. (2009). Design and the Construction of Publics. Design Issues, 25(1), 48--63.","paperID":"None"},{"content":"Paul Dourish, HCI and environmental sustainability: the politics of design and the design of politics, Proceedings of the 8th ACM Conference on Designing Interactive Systems, August 16-20, 2010, Aarhus, Denmark","paperID":"1858173"},{"content":"Gaver, W. 2009. Designing for Homo Ludens, Still. In (Re)searching the Digital Bauhaus. Binder, T., Löwgren, J., and Malmborg, L. (eds.). London: Springer, pp. 163--178.","paperID":"None"},{"content":"William Gaver, Making spaces: how design workbooks work, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979169"},{"content":"Kerridge, T. (Forthcoming). Designing Debate: The Entanglement of Speculative Design and Upstream Public Engagement with Science and Technology. PhD thesis, Goldsmiths, University of London, London.","paperID":"None"},{"content":"Michael, M. (2012). \"What Are We Busy Doing\"? Engaging the Idiot. Science, Technology & Human Values, 37(5), 528--554.","paperID":"None"},{"content":"Schultz, P. W., Nolan, J. M., Cialdini, R. B., Goldstein, N. J., & Griskevicius, V. (2007). The constructive, destructive, and reconstructive power of social norms, Psychological Science, 18(5), 429--434.","paperID":"None"},{"content":"Phoebe Sengers , Bill Gaver, Staying open to interpretation: engaging multiple meanings in design and evaluation, Proceedings of the 6th conference on Designing Interactive systems, June 26-28, 2006, University Park, PA, USA","paperID":"1142422"},{"content":"Shove, E. (2004). Comfort, cleanliness and convenience. Berg.","paperID":"None"},{"content":"Stengers, I. (2005). The cosmopolitical proposal. Making things public, 994--1003.","paperID":"None"},{"content":"Strengers, Y. (2013) Smart Energy Technologies in Everyday Life: Smart Utopia? Palgrave MacMillan.","paperID":"None"},{"content":"UK Research Council (2010), Energy and Communities call for proposals. http://web.archive.org/web/ 20100813103416/http://www.esrc.ac.uk/ESRCInfoCent re/opportunities/current_funding_opportunities/Energy _and_Communities_Collaborative_Venture.aspx (accessed 22.09.14).","paperID":"None"},{"content":"Wilkie, A. (2013) Prototyping as Event: Designing the Future of Obesity, Journal of Cultural Economy: 1--17.","paperID":"None"},{"content":"Wilkie, A., Michael, M., & Plummer Fernandez, M. (2014). Speculative method and Twitter. The Sociological Review.","paperID":"None"},{"content":"Wilkie, A., Michael, M., Kerridge, T., Gaver, W., Ovalle, L,. DiSalvo, C., Gabrys, J., (2012). Design, STS and cosmopolitics: From intervention to emergence in participation and sustainability. Proc. EASST 2012.","paperID":"None"}],"title":"Energy Babble: Mixing Environmentally-Oriented Internet Content to Engage Community Groups","filename":"CHI15/p1115","authors":["William Gaver","Mike Michael","Tobie Kerridge","Alex Wilkie","Andy Boucher","Liliana Ovalle","Matthew Plummer-Fernandez"],"conference":"CHI '15"}