{"paperId":2702161,"citation":[],"reference":[{"content":"Doshi, A. and Trivedi, M. M. Head and eye gaze dynamics during visual attention shifts in complex environments. Journal of vision, 12(2), 1--16, 2012.","paperID":"None"},{"content":"Kiefer, R. Defining the \"HUD benefit time window\". Vision in Vehicles-VI, 133--142. 1998.","paperID":"None"},{"content":"Lauber, F., and Butz, A. Are HMDs the better HUDs? In Proc. ISMAR, 267--268, IEEE 2013.","paperID":"None"},{"content":"Liebner, M., Ruhhammer, C., Klanner, F., Stiller, C. Generic driver intent inference based on parametric models. In Proc. ITSC, 268--275, IEEE 2013.","paperID":"None"},{"content":"Yung-Ching Liu , Ming-Hui Wen, Comparison of head-up display (HUD) vs. head-down display (HDD): driving performance of commercial vehicle operators in Taiwan, International Journal of Human-Computer Studies, v.61 n.5, p.679-697, November 2004","paperID":"1039700"},{"content":"Sujitha Martin , Ashish Tawari , Erik Murphy-Chutorian , Shinko Y. Cheng , Mohan Trivedi, On the design and evaluation of robust head pose for visual user interfaces: algorithms, databases, and comparisons, Proceedings of the 4th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, October 17-19, 2012, Portsmouth, New Hampshire","paperID":"2390281"},{"content":"Martin, S., Tawari, A. and Trivedi, M.M. Monitoring head dynamics for driver assistance systems: A multiperspective approach. In Proc. ITSC, 2286 -2291. IEEE 2009.","paperID":"None"},{"content":"Plavšic, M., Duschl, M., Tönnis, M., Bubb, H. and Klinker, G. Ergonomic Design and Evaluation of Augmented Reality Based Cautionary Warnings for Driving Assistance in Urban Environments. In Proc. International Ergonomics Association. 2009.","paperID":"None"},{"content":"Wickens, C. D., Vincow, M., and Yeh, M. Design applications of visual spatial thinking: The importance of frame of reference. The Cambridge handbook of visuospatial thinking. 383--425. 2005.","paperID":"None"},{"content":"Zangemeister, W. H. and Stark, L. Types of gaze movement: variable interactions of eye and head movements. Experimental neurology, 77(3), 563--577. 1982. Occlusion World Occlusion Vehicle Unsteadyness Interplay Driving Task Alpha Blending Vehicle Stabilized Screen Stabilized * ***","paperID":"None"}],"abstract":"With recent progress in display technology, visual see-through head-mounted displays are beginning to enter our everyday lives. Especially in cars they may replace head-up displays, as they can theoretically perfectly imitate them but are more flexible to use. However, prior work has shown that both screen- and vehicle-stabilized content suffer from drawbacks such as occlusion or technological limitations. As a potential alternative, we propose three concept alternatives, in which head rotation is used to manipulate the displayed content differently from both of the known stabilization techniques. In a qualitative user study, we identify the best concept proposal and then evaluate it against the established content stabilization techniques. The presented concept is perceived to be more applicable for the proposed use case and effectively reduces some of the known problems of both stabilization techniques.","title":"Content Destabilization for Head-Mounted Displays","filename":"CHI15/p2139","authors":["Felix Lauber","Sophia Cook","Andreas Butz"],"conference":"CHI '15"}