{"paperId":2702495,"citation":[],"abstract":"Ontologies are complex knowledge representation artefacts used widely across biomedical, media and industrial domains. They are used for defining terminologies and providing metadata, especially for linked open data, and as such their use is rapidly increasing, but so far development tools have not benefited from empirical research into the ontology authoring process. This paper presents the results of a study that identifies common activity patterns through analysis of eye-tracking data and the event logs of the popular authoring tool, Protégé. Informed by the activity patterns discovered, we propose design guidelines for bulk editing, efficient reasoning and increased situational awareness. Methodological implications go beyond the remit of knowledge artefacts: we establish a method for studying the usability of software designed for highly specialised complex domains.","reference":[{"content":"Edward Benson , David R. Karger, End-users publishing structured information on the web: an observational study of what, why, and how, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557036"},{"content":"Bizer, C., Heath, T., and Berners-Lee, T. Linked data the story so far. International Journal on Semantic Web and Information Systems 5, 3 (2009), 1--22.","paperID":"None"},{"content":"British Broadcasting Corporation. BBC ontologies. Retrieved from http://www.bbc.co.uk/ontologies.","paperID":"None"},{"content":"Buchta, C., Hornik, K., Feinerer, I., and Meyer, D. tau: Text analysis utilities. Available at http://cran.r-project.org/web/packages/tau/.","paperID":"None"},{"content":"Jorge Cardoso, The Semantic Web Vision: Where Are We?, IEEE Intelligent Systems, v.22 n.5, p.84-88, September 2007","paperID":"1304523"},{"content":"Parmit K. Chilana , Jacob O. Wobbrock , Andrew J. Ko, Understanding usability practices in complex domains, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753678"},{"content":"A. J. Duineveld , R. Stoter , M. R. Weiden , B. Kenepa , V. R. Benjamins, WonderTools?: a comparative study of ontological engineering tools, International Journal of Human-Computer Studies, v.52 n.6, p.1111-1133, June 2000","paperID":"347897"},{"content":"Dzbor, M., Motta, E., Buil, C., Gomez, J. M., Goerlitz, O., and Lewen, H. Developing ontologies in OWL: An observational study. In OWL: Experiences and Directions Workshop (2006).","paperID":"None"},{"content":"Rafael S. Gonçalves , Bijan Parsia , Ulrike Sattler, Categorising logical differences between OWL ontologies, Proceedings of the 20th ACM international conference on Information and knowledge management, October 24-28, 2011, Glasgow, Scotland, UK","paperID":"2063797"},{"content":"Matthew Horridge , Samantha Bail , Bijan Parsia , Ulrike Sattler, The cognitive complexity of OWL justifications, Proceedings of the 10th international conference on The semantic web, October 23-27, 2011, Bonn, Germany","paperID":"2063033"},{"content":"Ian Horrocks, Ontologies and the semantic web, Communications of the ACM, v.51 n.12, December 2008","paperID":"1409377"},{"content":"Ali Khalili , Sören Auer, Review article: User interfaces for semantic authoring of textual content: A systematic literature review, Web Semantics: Science, Services and Agents on the World Wide Web, 22, p.1-18, October, 2013","paperID":"2537384"},{"content":"Lambrix, P., Habbouche, M., and Pérez, M. Evaluation of ontology development tools for bioinformatics. Bioinformatics 19, 12 (2003), 1564--1571.","paperID":"None"},{"content":"Martin, D., Brun, C., Remy, E., Mouren, P., Thieffry, D., and Jacq, B. Gotoolbox: functional analysis of gene datasets based on Gene Ontology. Genome Biology 5, 12 (2004), R101.","paperID":"None"},{"content":"Deborah L. McGuinness , Peter F. Patel-Schneider, Usability issues in knowledge representation systems, Proceedings of the fifteenth national/tenth conference on Artificial intelligence/Innovative applications of artificial intelligence, p.608-614, July 1998, Madison, Wisconsin, USA","paperID":"295749"},{"content":"David J. Piorkowski , Scott D. Fleming , Irwin Kwan , Margaret M. Burnett , Christopher Scaffidi , Rachel K.E. Bellamy , Joshua Jordahl, The whats and hows of programmers' foraging diets, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466418"},{"content":"Quesada-Martínez, M., Fernández-Breis, J., and Stevens, R. Lexical characterization and analysis of the BioPortal ontologies. In Artificial Intelligence in Medicine, vol. 7885 of LNCS. 2013, 206--215.","paperID":"None"},{"content":"Dave Randall , Rob Procter , Yuwei Lin , Meik Poschen , Wes Sharrock , Robert Stevens, Distributed ontology building as practical work, International Journal of Human-Computer Studies, v.69 n.4, p.220-233, April, 2011","paperID":"1944106"},{"content":"Rector, A., Drummond, N., Horridge, M., Rogers, J., Knublauch, H., Stevens, R., Wang, H., and Wroe, C. OWL pizzas: Practical experience of teaching OWL-DL: Common errors & common patterns. In Proc. of EKAW '04, vol. 3257 of LNCS. 2004, 63--81.","paperID":"None"},{"content":"Spackman, K. A., and Campbell, K. E. Compositional concept representation using SNOMED: towards further convergence of clinical terminologies. In Proc. of the AMIA Symposium (1998), 740.","paperID":"None"},{"content":"The Gene Ontology Consortium. Gene Ontology: Tool for the Unification of Biology. Nature Genetics 25 (2000), 25--29.","paperID":"None"},{"content":"Harold Thimbleby , Paul Cairns , Matt Jones, Usability analysis with Markov models, ACM Transactions on Computer-Human Interaction (TOCHI), v.8 n.2, p.99-132, June 2001","paperID":"376941"},{"content":"Vigo, M., Bail, S., Jay, C., and Stevens, R. Overcoming the pitfalls of ontology authoring: Strategies and implications for tool design. International Journal of Human-Computer Studies 72, 12 (2014), 835--845.","paperID":"None"},{"content":"Markel Vigo , Caroline Jay , Robert Stevens, Design insights for the next wave ontology authoring tools, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557284"},{"content":"Vigo, M., Jay, C., and Stevens, R. Protégé4US: Harvesting ontology authoring data with Protégé. In The Semantic Web: ESWC 2014 Satellite Events, vol. 8798 of LNCS. 2014, 86--99.","paperID":"None"},{"content":"Amy Voida , Ellie Harmon , Ban Al-Ani, Homebrew databases: complexities of everyday information management in nonprofit organizations, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979078"},{"content":"W3C Consortium. The Wine Ontology. Retrieved from http://www.w3.org/TR/owl-guide/wine.rdf.","paperID":"None"},{"content":"W3C OWL Working Group. OWL 2 Web Ontology Language Document Overview, 2012. http://www.w3.org/TR/owl2-overview/.","paperID":"None"},{"content":"Wang, H., Tudorache, T., Dou, D., Noy, N. F., and Musen, M. A. Analysis of user editing patterns in ontology development projects. In On the Move to Meaningful Internet Systems: OTM 2013 Conferences, vol. 8185 of LNCS. 2013, 470--487.","paperID":"None"},{"content":"Warren, P. Ontology users' survey -- summary of results. Tech. Rep. KMI-13--1, Knowledge Media Institute, 2013.","paperID":"None"},{"content":"Warren, P., Mulholland, P., Collins, T., and Motta, E. The usability of description logics. In Proc. of ESWC '14, vol. 8465 of LNCS. 2014, 550--564.","paperID":"None"}],"title":"Constructing Conceptual Knowledge Artefacts: Activity Patterns in the Ontology Authoring Process","filename":"CHI15/p3385","authors":["Markel Vigo","Caroline Jay","Robert Stevens"],"conference":"CHI '15"}