{"paperId":2702391,"reference":[{"content":"Chan, L., Liang, R.-H., Tsai, M.-C., Cheng, K.-Y., Su, C.-H., Chen, M., Cheng, W.-H., and Chen, B.-Y. FingerPad: Private and Subtle Interaction Using Fingertips. In ACM UIST '13 (2013).","paperID":"None"},{"content":"Davison, B. Techniques for Robust Touch Sensing Design. http://ww1.microchip.com/downloads/en/ AppNotes/00001334B.pdf. Accessed: 2015-01-01.","paperID":"None"},{"content":"Dezfuli, N., Khalilbeigi, M., Huber, J., Müller, F., and Mühlhäuser, M. PalmRC: Imaginary Palm-based Remote Control for Eyes-free Television Interaction. In EuroiTV '12 (2012), 27.","paperID":"None"},{"content":"Gong, N.-W., Steimle, J., Olberding, S., Hodges, S., Gillian, N. E., Kawahara, Y., and Paradiso, J. A. PrintSense: A Versatile Sensing Technique to Support Multimodal Flexible Surface Interaction. In ACM CHI '14 (2014), 1407--1410.","paperID":"None"},{"content":"Gong, N.-W., Zhao, N., and Paradiso, J. A. A Customizable Sensate Surface for Music Control. 417--420.","paperID":"None"},{"content":"Gustafson, S. G., Rabe, B., and Baudisch, P. M. Understanding palm-based imaginary interfaces. In ACM CHI '13 (2013), 889.","paperID":"None"},{"content":"Hammock, M. L., Chortos, A., Tee, B. C.-K., Tok, J. B.-H., and Bao, Z. 25th Anniversary Article: The Evolution of Electronic Skin (E-Skin): A Brief History, Design Considerations, and Recent Progress. Advanced Materials 25, 42 (2013), 5997--6038.","paperID":"None"},{"content":"Harrison, C., Benko, H., and Wilson, A. D. OmniTouch: Wearable Multitouch Interaction Everywhere. In ACM UIST '11 (2011), 441.","paperID":"None"},{"content":"Harrison, C., Ramamurthy, S., and Hudson, S. E. On-body Interaction: Armed and Dangerous. In ACM TEI '12 (2012), 69.","paperID":"None"},{"content":"Harrison, C., Tan, D., and Morris, D. Skinput: Appropriating the Body As an Input Surface. Communications of the ACM 54, 8 (2011), 111.","paperID":"None"},{"content":"Hawkes, E., An, B., Benbernou, N. M., Tanaka, H., Kim, S., Demaine, E. D., Rus, D., and Wood, R. J. Programmable matter by folding. In PNAS 107, 28 (2010), 12441--12445.","paperID":"None"},{"content":"Holz, C., Grossman, T., Fitzmaurice, G., and Agur, A. Implanted user interfaces. In ACM CHI '12 (2012), 503.","paperID":"None"},{"content":"Karrer, T., Wittenhagen, M., Lichtschlag, L., Heller, F., and Borchers, J. Pinstripe: Eyes-free Continuous Input Anywhere on Interactive Clothing. In ACM CHI '11 (2011), 1313.","paperID":"None"},{"content":"Kim, D.-H., et al. Epidermal Electronics. Science 333, 6044 (2011), 838--843.","paperID":"None"},{"content":"Kramer, R., Majidi, C., and Wood, R. Wearable tactile keypad with stretchable artificial skin. In IEEE ICRA '11 (2011), 1103--1107.","paperID":"None"},{"content":"Lissermann, R., Huber, J., Hadjakos, A., and Mühlhäuser, M. EarPut: Augmenting Behind-the-ear Devices for Ear-based Interaction. In ACM CHI EA '13 (2013), 1323--1328.","paperID":"None"},{"content":"Lu, T., Finkenauer, L., Wissman, J., and Majidi, C. Rapid Prototyping for Soft-Matter Electronics. Advanced Functional Materials (2014).","paperID":"None"},{"content":"Lumelsky, V. J., Shur, M., and Wagner, S. Sensitive skin. IEEE Sensors Journal (2001), 41--51.","paperID":"None"},{"content":"McCann, J., Hurford, R., and Martin, A. A Design Process for the Development of Innovative Smart Clothing That Addresses End-User Needs from Technical, Functional, Aesthetic and Cultural View Points. In IEEE ISWC '05 (2005), 70--77.","paperID":"None"},{"content":"Mistry, P., Maes, P., and Chang, L. WUW - wear Ur world. In ACM CHI EA '09 (2009), 4111.","paperID":"None"},{"content":"Nakatsuma, K., Shinoda, H., Makino, Y., Sato, K., and Maeno, T. Touch Interface on Back of the Hand. In ACM SIGGRAPH '11 (2011).","paperID":"None"},{"content":"Niu, X., Peng, S., Liu, L., Wen, W., and Sheng, P. Characterizing and Patterning of PDMS-Based Conducting Composites. Advanced Materials 19, 18 (2007), 2682--2686.","paperID":"None"},{"content":"Ogata, M., Sugiura, Y., Makino, Y., Inami, M., and Imai, M. SenSkin: Adapting Skin as a Soft Interface. In ACM UIST '13 (2013).","paperID":"None"},{"content":"Ogata, M., Sugiura, Y., Osawa, H., and Imai, M. iRing: Intelligent Ring Using Infrared Reflection. In ACM UIST '12 (2012), 131.","paperID":"None"},{"content":"Olberding, S., Wessely, M., and Steimle, J. PrintScreen: Fabricating Highly Customizable Thin-film Touch-displays. In ACM UIST '14 (2014), 281--290.","paperID":"None"},{"content":"Olberding, S., Yeo, K. P., Nanayakkara, S., and Steimle, J. AugmentedForearm: Exploring the Design Space of a Display-enhanced Forearm. In AH '13 (2013), 9--12.","paperID":"None"},{"content":"Perrault, S. T., Lecolinet, E., Eagan, J., and Guiard, Y. Watchit: Simple gestures and eyes-free interaction for wristwatches and bracelets. In ACM CHI '13 (2013), 1451--1460.","paperID":"None"},{"content":"Rendl, C., Greindl, P., Haller, M., Zirkl, M., Stadlober, B., and Hartmann, P. PyzoFlex: Printed Piezoelectric Pressure Sensing Foil. In ACM UIST '12 (2012), 509--518.","paperID":"None"},{"content":"Rosenberg, I. D., Grau, A., Hendee, C., Awad, N., and Perlin, K. IMPAD: An Inexpensive Multi-touch pressure Acquisition Device. In ACM CHI EA '09 (2009), 3217--3222.","paperID":"None"},{"content":"Sekitani, T., Kaltenbrunner, M., Yokota, T., and Someya, T. Imperceptible Electronic Skin. SID Information Display 30, 1 (2014), 20--25.","paperID":"None"},{"content":"Serrano, M., Ens, B. M., and Irani, P. P. Exploring the Use of Hand-To-Face Input for Interacting with Head-Worn Displays. In ACM CHI'14 (2014).","paperID":"None"},{"content":"Someya, T. Stretchable Electronics. Wiley-VCH, 2013.","paperID":"None"},{"content":"Someya, T., Sekitani, T., Iba, S., Kato, Y., Kawaguchi, H., and Sakurai, T. A large-area, flexible pressure sensor matrix with organic field-effect transistors for artificial skin applications. In PNAS 101, 27 (2004), 9966--9970.","paperID":"None"},{"content":"Su, C.-H., Chan, L., Weng, C.-T., Liang, R.-H., Cheng, K.-Y., and Chen, B.-Y. NailDisplay: Bringing an Always Available Visual Display to Fingertips. In ACM CHI '13 (2013), 1461--1464.","paperID":"None"},{"content":"Sugiura, Y., Inami, M., and Igarashi, T. A Thin Stretchable Interface for Tangential Force Measurement. In ACM UIST '12 (2012), 529--536.","paperID":"None"},{"content":"Tamaki, E., Miyak, T., and Rekimoto, J. BrainyHand:: A Wearable Computing Device Without HMD and It's Interaction Techniques. In AVI '10 (2010), 387--388.","paperID":"None"},{"content":"Vega, K., and Fuks, H. Beauty Technology: Muscle Based Computing Interaction. In ACM ITS '13 (2013), 469--474.","paperID":"None"},{"content":"Wagner, J., Nancel, M., Gustafson, S. G., Huot, S., and Mackay, W. E. Body-centric design space for multi-surface interaction. In ACM CHI '13 (2013), 1299.","paperID":"None"},{"content":"Webb, R. C., Bonifas, A. P., Behnaz, A., Zhang, Y., Yu, K. J., Shi, H. C. M., Bian, Z., Liu, Z., Kim, Y.-S., Yeo, W.-H., Park, J. S., Song, J., Li, Y., Huang, Y., Gorbach, A. M., and Rogers, J. A. Ultrathin conformal devices for precise and continuous thermal characterization of human skin. Nature Materials 12 (2013), 938944.","paperID":"None"},{"content":"Weigel, M., Mehta, V., and Steimle, J. More Than Touch: Understanding How People Use Skin As an Input Surface for Mobile Computing. In ACM CHI '14 (2014), 179--188.","paperID":"None"},{"content":"Windmiller, J. R., and Wang, J. Wearable Electrochemical Sensors and Biosensors: A Review. In Electroanalysis (2013).","paperID":"None"},{"content":"Woo, S.-J., Kong, J.-H., Kim, D.-G., and Kim, J.-M. A thin all-elastomeric capacitive pressure sensor array based on micro-contact printed elastic conductors. J. Mater. Chem. C 2 (2014), 4415--4422.","paperID":"None"}],"citation":[{"content":"Alan Poole , Robb Mitchell , Katrin Wolf , Rahimullah Sarban, Bodily Sketching With Sensable Stretchables, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2854122"},{"content":"Denys J. C. Matthies , Simon T. Perrault , Bodo Urban , Shengdong Zhao, Botential: Localizing On-Body Gestures by Measuring Electrical Signatures on the Human Skin, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, August 24-27, 2015, Copenhagen, Denmark","paperID":"2785859"},{"content":"Uran Oh , Leah Findlater, A Performance Comparison of On-Hand versus On-Phone Nonvisual Input by Blind and Sighted Users, ACM Transactions on Accessible Computing (TACCESS), v.7 n.4, p.1-20, November 2015","paperID":"2820616"},{"content":"Xin Liu , Katia Vega , Pattie Maes , Joe A. Paradiso, Wearability Factors for Skin Interfaces, Proceedings of the 7th Augmented Human International Conference 2016, p.1-8, February 25-27, 2016, Geneva, Switzerland","paperID":"2875248"}],"abstract":"We propose iSkin, a novel class of skin-worn sensors for touch input on the body. iSkin is a very thin sensor overlay, made of biocompatible materials, and is flexible and stretchable. It can be produced in different shapes and sizes to suit various locations of the body such as the finger, forearm, or ear. Integrating capacitive and resistive touch sensing, the sensor is capable of detecting touch input with two levels of pressure, even when stretched by 30% or when bent with a radius of 0.5cm. Furthermore, iSkin supports single or multiple touch areas of custom shape and arrangement, as well as more complex widgets, such as sliders and click wheels. Recognizing the social importance of skin, we show visual design patterns to customize functional touch sensors and allow for a visually aesthetic appearance. Taken together, these contributions enable new types of on-body devices. This includes finger-worn devices, extensions to conventional wearable devices, and touch input stickers, all fostering direct, quick, and discreet input for mobile computing.","title":"iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing","filename":"CHI15/p2991","authors":["Martin Weigel","Tong Lu","Gilles Bailly","Antti Oulasvirta","Carmel Majidi","Jürgen Steimle"],"conference":"CHI '15"}