{"paperId":2702402,"abstract":"Difficulty in navigating daily life can lead to frustration and decrease independence for people with autism. While they turn to online autism communities for information and advice for coping with everyday challenges, these communities may present only a limited perspective because of their in-group nature. Obtaining support from out-group sources beyond the in-group community may prove valuable in dealing with challenging situations such as public anxiety and workplace conflicts. In this paper, we explore the value of supplementary out-group support from crowdsourced responders added to in-group support from a community of members. We find that out-group sources provide relatively rapid, concise responses with direct and structured information, socially appropriate coping strategies without compromising emotional value. Using an autism community as a motivating example, we conclude by providing design implications for combining in-group and out-group resources that may enhance the question-and-answer experience.","citation":[{"content":"Tiffany Y. Tang , Relic Yongfu Wang , Yuhui You , Leila Zeqian Huang , Christine Piao Chen, Supporting collaborative play via an affordable touching + singing plant for children with autism in China, Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers, September 07-11, 2015, Osaka, Japan","paperID":"2800913"},{"content":"Elena Agapie , Lucas Colusso , Sean A. Munson , Gary Hsieh, PlanSourcing: Generating Behavior Change Plans with Friends and Crowds, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819943"},{"content":"Hwajung Hong , Gregory D. Abowd , Rosa I. Arriaga, Towards designing social question-and-answer systems for behavioral support of individuals with autism, Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare, p.17-24, May 20-23, 2015, Istanbul, Turkey","paperID":"2826168"}],"reference":[{"content":"Bartko, J.J. The intraclass correlation coefficient as a measure of reliability. Psychological reports 19, 1 (1966), 3--11.","paperID":"None"},{"content":"Benford, P. The use of Internet-based communication by people with autism. Ph.D Dissertation. University of Nottingham, 2008.","paperID":"None"},{"content":"Bigham, J., Jayant, C., Ji, H., and Little, G. VizWiz: nearly real-time answers to visual questions. UIST 2010.","paperID":"None"},{"content":"Boujarwah, F.A., Abowd, G.D., and Arriaga, R.I. Socially Computed Scripts to Support Social Problem Solving Skills. CHI 2012.","paperID":"None"},{"content":"Burke, M., Kraut, R., and Williams, D. Social use of computer-mediated communication by adults on the autism spectrum. CSCW 2010.","paperID":"None"},{"content":"Burton, M., Brady, E., Brewer, R., and Neylan, C. Crowdsourcing Subjective Fashion Advice Using VizWiz: Challenges and Opportunities. ASSETS 2012.","paperID":"None"},{"content":"Harper, M.F., Raban, D., Rafaeli, S., and Konstan, J.A. Predictors of answer quality in online Q&A sites. CHI 2008.","paperID":"None"},{"content":"Hong, H., Yarosh, S., Kim, J.G., Abowd, G.D., and Arriaga, R.I. Investigating the Use of Circles in Social Networks to Support Independence of Individuals with Autism. CHI 2013.","paperID":"None"},{"content":"Huh, J. and Ackerman, M.S. Collaborative help in chronic disease management: supporting individualized problems. CSCW 2012.","paperID":"None"},{"content":"Jeong, J., Morris, M.R., Teevan, J., and Liebling, D. A CrowdPowered Socially Embedded Search Engine. ICWSM 2013.","paperID":"None"},{"content":"Krippendorff, K. Reliability in Content Analysis: Some Common Misconceptions and Recommendations. Human Communication Research 30, 3 (2004), 411--433.","paperID":"None"},{"content":"Langford, C.P., Bowsher, J., Maloney, J.P., and Lillis, P.P. Social support: a conceptual analysis. Journal of advanced nursing 25, 1 (1997), 95--100.","paperID":"None"},{"content":"Massimi, M. and Bender, J. Life transitions and online health communities: reflecting on adoption, use, and disengagement. CSCW 2014.","paperID":"None"},{"content":"Morris, M., Inkpen, K., and Venolia, G. Remote Shopping Advice: Enhancing In-Store Shopping with Social Technologies. CSCW 2014.","paperID":"None"},{"content":"Morris, M., Teevan, J., and Panovich, K. What Do People Ask Their Social Networks, and Why? A Survey Study of Status Message Q&A Behavior. CHI 2010.","paperID":"None"},{"content":"Myles, B. and Simpson, R. Understanding the Hidden Curriculum An Essential Social Skill for Children and Youth with Asperger Syndrome. Intervention in School and Clinic, (2001).","paperID":"None"},{"content":"Newton, A.T., Kramer, A.A.D.I., and McIntosh, D. Autism online: a comparison of word usage in bloggers with and without autism spectrum disorders. CHI 2009.","paperID":"None"},{"content":"Ochs, E. and Kremer-Sadlik, T. Autism and the social world: an anthropological perspective. Discourse Studies 6, 2 (2004), 147--183.","paperID":"None"},{"content":"Olney, M. Working with Autism and Other Social Communication Disorders. Journal of Rehabilitation, (2000).","paperID":"None"},{"content":"Palmen, A., Didden, R., and Arts, M. Improving question asking in high-functioning adolescents with autism spectrum disorders Effectiveness of small-group training. Autism 12, 1 (2008), 83--98.","paperID":"None"},{"content":"Schoenebeck, S. The Secret Life of Online Moms: Anonymity and Disinhibition on YouBeMom. com. ICWSM 2013.","paperID":"None"},{"content":"Tajfel, H. Social Psychology of Intergroup Relations. Annual review of psychology, (1982), 1--39.","paperID":"None"},{"content":"Teevan, J., Morris, M., and Panovich, K. Factors Affecting Response Quantity, Quality, and Speed for Questions Asked via Social Network Status Messages. ICWSM 2011.","paperID":"None"},{"content":"Vlahovic, T.A., Wang, Y.-C., Kraut, R.E., and Levine, J.M. Support matching and satisfaction in an online breast cancer support community. CHI 2014.","paperID":"None"},{"content":"Wang, K. and Chua, T. Exploiting salient patterns for question detection and question retrieval in community-based question answering. Computational Lingui, (2010), 1155--1163.","paperID":"None"},{"content":"Wang, Y., Kraut, R., and Levine, J.M. To Stay or Leave? The Relationship of Emotional and Informational Support to Commitment in Online Health Support Groups. CSCW 2012.","paperID":"None"},{"content":"Autism Spectrum Disorders and the Transition to Adulthood. Virginia Department of Education, 2010.","paperID":"None"}],"title":"In-group Questions and Out-group Answers: Crowdsourcing Daily Living Advice for Individuals with Autism","filename":"CHI15/p777","authors":["Hwajung Hong","Eric Gilbert","Gregory D. Abowd","Rosa I. Arriaga"],"conference":"CHI '15"}