{"paperId":2702180,"reference":[{"content":"Alexander, J., Lucero, A., and Subramanian, S. Tilt Displays: Designing display surfaces with multi-axis tilting and actuation. In Mobile HCI (2012), 161--170.","paperID":"None"},{"content":"Andrews, C., Endert, A., Yost, B., and North, C. Information visualization on large, high-resolution displays: Issues, challenges, and opportunities. Information Visualization 10, 4 (2011), 341--355.","paperID":"None"},{"content":"Ascher, M., and Ascher, R. Mathematics of the Incas: Code of the Quipu. Dover Publications, 2013.","paperID":"None"},{"content":"Barrass, S. Digital fabrication of acoustic sonifications. J. Audio Eng. Soc. 60, 9 (2012), 709--715.","paperID":"None"},{"content":"Benko, H., Wilson, A. D., Zannier, F., and Benko, H. Dyadic projected spatial augmented reality. In Proc. UIST (2014), 645--655.","paperID":"None"},{"content":"Bezerianos, A., and Isenberg, P. Perception of visual variables on tiled wall-sized displays for information visualization applications. TVCG 18, 12 (2012), 2516--2525.","paperID":"None"},{"content":"Borghi, A. M., and Cimatti, F. Embodied cognition and beyond: acting and sensing the body. Neuropsychologia 48, 3 (2009), 763--773.","paperID":"None"},{"content":"Borkin, M., Vo, A., Bylinskii, Z., Isola, P., Sunkavalli, S., Oliva, A., and Pfister, H. What makes a visualization memorable? TVCG 19, 12 (2013), 2306--2315.","paperID":"None"},{"content":"Calvert, G., Spence, C., and Stein, B. E. The Handbook of Multisensory Processes. MIT Press, 2004.","paperID":"None"},{"content":"Card, S., Mackinlay, J. D., and Shneiderman, B., Eds. Readings In Information Visualization: Using Vision To Think. Morgan Kaufmann Publishers, 1999.","paperID":"None"},{"content":"Carello, C., Wagman, J. B., and Turvey, M. T. Acoustic specification of object properties. In Moving Image Theory: Ecological Considerations. Southern Illinois University, 2005, 79--104.","paperID":"None"},{"content":"Challis, B. P., and Edwards, A. D. N. Design principles for tactile interaction. In Haptic Human-Computer Interaction. Springer, 2001, 17--24.","paperID":"None"},{"content":"Cleveland, W. S., and McGill, R. Graphical perception: Theory, experimentation, and application to the development of graphical methods. J. Am. Stat. Assoc. 79, 387 (1984), 531--554.","paperID":"None"},{"content":"Danziger, M. Information visualization for the people. Master's thesis, MIT, 2008.","paperID":"None"},{"content":"Dragicevic, P., and Jansen, Y. List of physical visualizations. dataphys.org/list, 2012.","paperID":"None"},{"content":"Edman, P. Tactile Graphics. AFB, 1992.","paperID":"None"},{"content":"Follmer, S., Leithinger, D., Olwal, A., Cheng, N., and Ishii, H. Jamming user interfaces: Programmable particle stiffness and sensing for malleable and shape-changing devices. In Proc. UIST (2012), 519--528.","paperID":"None"},{"content":"Follmer, S., Leithinger, D., Olwal, A., Hogge, A., and Ishii, H. inFORM: Dynamic physical affordances and constraints through shape and object actuation. In Proc. UIST (2013), 417--426.","paperID":"None"},{"content":"Froebel, F. The Education of Man. A. Lovell & Co, 1885.","paperID":"None"},{"content":"Gibson, J. J. The Ecological Approach to Visual Perception. Psychology Press, 1986.","paperID":"None"},{"content":"Gilpin, K., Koyanagi, K., and Rus, D. Making self-disassembling objects with multiple components in the Robot Pebbles system. In ICRA (2011), 3614--3621.","paperID":"None"},{"content":"Griffin, A. L. Feeling it out: the use of haptic visualization for exploratory geographic analysis. Cartographic Perspectives, 39 (2001), 12--29.","paperID":"None"},{"content":"Heer, J., Ham, F., Carpendale, S., Weaver, C., and Isenberg, P. Creation and collaboration: Engaging new audiences for information visualization. In Information Visualization, LNCS. Springer, 2008, 92--133.","paperID":"None"},{"content":"Heer, J., and Robertson, G. G. Animated transitions in statistical data graphics. TVCG 13, 6 (2007), 1240--1247.","paperID":"None"},{"content":"Hiller, J., and Lipson, H. Design and analysis of digital materials for physical 3d voxel printing. Rapid Prototyping Journal 15, 2 (2009), 137--149.","paperID":"None"},{"content":"Hogan, T., and Hornecker, E. How does representation modality affect user-experience of data artifacts? In Haptic & Audio Inter. Design. Springer, 2012, 141--151.","paperID":"None"},{"content":"Hornecker, E. The role of physicality in tangible and embodied interactions. Interactions 18, 2 (2011), 19--23.","paperID":"None"},{"content":"Hornecker, E., and Buur, J. Getting a grip on tangible interaction: a framework on physical space and social interaction. In Proc. CHI (2006), 437--446.","paperID":"None"},{"content":"Huron, S., Jansen, Y., and Carpendale, S. Constructing visual representations: investigating the use of tangible tokens. TVCG 20, 12 (2014), 2102--2111.","paperID":"None"},{"content":"Ishii, H., Lakatos, D., Bonanni, L., and Labrune, J.-B. Radical Atoms: Beyond Tangible Bits, toward transformable materials. Interactions 19, 1 (2012), 38--51.","paperID":"None"},{"content":"Ishii, H., and Ullmer, B. Tangible Bits: towards seamless interfaces between people, bits and atoms. In Proc. CHI, ACM (1997), 234--241.","paperID":"None"},{"content":"Jansen, Y. Physical and Tangible Information Visualization. PhD thesis, Université Paris-Sud XI, 2014.","paperID":"None"},{"content":"Jansen, Y., and Dragicevic, P. An interaction model for visualizations beyond the desktop. TVCG 19, 12 (2013), 2396--2405.","paperID":"None"},{"content":"Jansen, Y., Dragicevic, P., and Fekete, J.-D. Evaluating the efficiency of physical visualizations. In Proc. CHI (2013), 2593--2602.","paperID":"None"},{"content":"Kildal, J. Kooboh: Variable tangible properties in a handheld Haptic-Illusion box. In Proc. EuroHaptics'12. Springer, 2012, 191--194.","paperID":"None"},{"content":"Kosara, R. Visualization criticism-the missing link between information visualization and art. In Proc. IV (2007), 631--636.","paperID":"None"},{"content":"Lam, H., Bertini, E., Isenberg, P., Plaisant, C., and Carpendale, S. Empirical studies in information visualization: Seven scenarios. TVCG 18, 9 (2012), 1520--1536.","paperID":"None"},{"content":"Lederman, S. J., and Klatzky, R. L. Hand movements: a window into haptic object recognition. Cogn. Psychol. 19, 3 (July 1987), 342--368.","paperID":"None"},{"content":"Lee, J., Post, R., and Ishii, H. ZeroN: Mid-air tangible interaction enabled by computer controlled magnetic levitation. In Proc. UIST (2011), 327--336.","paperID":"None"},{"content":"Lee, J. C. In search of a natural gesture. ACM Crossroads 16, 4 (2010), 9--12.","paperID":"None"},{"content":"McGookin, D., Robertson, E., and Brewster, S. Clutching at straws: using tangible interaction to provide non-visual access to graphs. In Proc. CHI (2010), 1715--1724.","paperID":"None"},{"content":"McGookin, D. K., and Brewster, S. A. SoundBar: Exploiting multiple views in multimodal graph browsing. In Proc. NordiCHI (2006), 145--154.","paperID":"None"},{"content":"Moere, A. V. Beyond the tyranny of the pixel: Exploring the physicality of information visualization. In Proc. IV (2008), 469--474.","paperID":"None"},{"content":"Munzner, T. Process and pitfalls in writing information visualization research papers. In Information Visualization. Springer, 2008, 134--153.","paperID":"None"},{"content":"Murata, S., Yoshida, E., Kamimura, A., Kurokawa, H., Tomita, K., and Kokaji, S. M-TRAN: Self-reconfigurable modular robotic system. TMECH 7, 4 (2002), 431--441.","paperID":"None"},{"content":"Niiyama, R., Yao, L., and Ishii, H. Weight and volume changing device with liquid metal transfer. In Proc. TEI (2014), 49--52.","paperID":"None"},{"content":"Olberding, S., Wessely, M., and Steimle, J. Printscreen: fabricating highly customizable thin-film touch-displays. In Proc. UIST (2014), 281--290.","paperID":"None"},{"content":"O'Malley, C., and Fraser, S. Literature review in learning with tangible technologies. Tech. rep., Futurelab, 2004.","paperID":"None"},{"content":"Piper, B., Ratti, C., and Ishii, H. Illuminating clay: A 3-D tangible interface for landscape analysis. In Proc. CHI (2002), 355--362.","paperID":"None"},{"content":"Plaisant, C. The challenge of information visualization evaluation. In Proc. AVI (2004), 109--116.","paperID":"None"},{"content":"Plaisant, C., Fekete, J., and Grinstein, G. Promoting insight-based evaluation of visualizations: From contest to benchmark repository. TVCG 14, 1 (2008), 120--134.","paperID":"None"},{"content":"Poupyrev, I., Nashida, T., Maruyama, S., Rekimoto, J., and Yamaji, Y. Lumen: interactive visual and shape display for calm computing. In SIGGRAPH Emerging Technologies (2004), 17.","paperID":"None"},{"content":"Pousman, Z., Stasko, J. T., and Mateas, M. Casual information visualization: Depictions of data in everyday life. TVCG 13, 6 (2007).","paperID":"None"},{"content":"Rasmussen, M. K., Pedersen, E. W., Petersen, M. G., and Hornbæk, K. Shape-changing interfaces: a review of the design space and open research questions. In Proc. CHI (2012), 735--744.","paperID":"None"},{"content":"Reber, R., Schwarz, N., and Winkielman, P. Processing fluency and aesthetic pleasure: Is beauty in the perceiver's processing experience? Personality and Social Psychology Review 8, 4 (2004), 364--382.","paperID":"None"},{"content":"Roberts, J. C., and Walker, R. Using all our senses: the need for a unified theoretical approach to multi-sensory information visualization. In VisWeek Workshop (2010).","paperID":"None"},{"content":"Romanishin, J., Gilpin, K., and Rus, D. M-blocks: Momentum-driven, magnetic modular robots. In Proc. IROS, IEEE/RSJ (2013), 4288--4295.","paperID":"None"},{"content":"Roudaut, A., Karnik, A., Löchtefeld, M., and Subramanian, S. Morphees: Toward high \"shape resolution\" in self-actuated flexible mobile devices. In Proc. CHI (2013), 593--602.","paperID":"None"},{"content":"Schmandt-Besserat, D. How Writing Came About. University of Texas Press, 1996.","paperID":"None"},{"content":"Schweikardt, E., and Gross, M. D. roBlocks: A robotic construction kit for mathematics and science education. In Proc. ICMI (2006), 72--75.","paperID":"None"},{"content":"Seah, S., Drinkwater, B., Carter, T., Malkin, R., and Subramanian, S. Dexterous ultrasonic levitation of millimeter-sized objects in air. UFFC 61, 7 (2014), 1233--1236.","paperID":"None"},{"content":"Seah, S. A., Martinez Plasencia, D., Bennett, P. D., Karnik, A., Otrocol, V. S., Knibbe, J., Cockburn, A., and Subramanian, S. SensaBubble: A chrono-sensory mid-air display of sight and smell. In Proc. CHI (2014), 2863--2872.","paperID":"None"},{"content":"Shaer, O., and Hornecker, E. Tangible user interfaces: Past, present, and future directions. Found. Trends Hum. -Comput. Interact. 3 (2010), 1--137.","paperID":"None"},{"content":"Spelke, E. S. The development of intermodal perception. In Handbook of Infant Perception. Academic Press, 1987, 233--273.","paperID":"None"},{"content":"Steimle, J., Jordt, A., and Maes, P. Flexpad: highly flexible bending interactions for projected handheld displays. In Proc. CHI (2013), 237--246.","paperID":"None"},{"content":"Stusak, S., and Aslan, A. Beyond physical bar charts: An exploration of designing physical visualizations. In Proc. CHI-EA (2014), 1381--1386.","paperID":"None"},{"content":"Stusak, S., Tabard, A., and Butz, A. Can physical visualizations support analytical tasks? In Posters of IEEE InfoVis (2013).","paperID":"None"},{"content":"Stusak, S., Tabard, A., Sauka, F., Khot, R., and Butz, A. Activity sculptures: Exploring the impact of physical visualizations on running activity. TVCG 20, 12 (2014), 2201--2210.","paperID":"None"},{"content":"Swaminathan, S., Shi, C., Jansen, Y., Dragicevic, P., Oehlberg, L., and Fekete, J.-D. Supporting the design and fabrication of physical visualizations. In Proc. CHI (2014), 3845--3854.","paperID":"None"},{"content":"Tang, S. K., Sekikawa, Y., Leithinger, D., Follmer, S., and Ishii, H. Tangible cityscape, 2013. tinyurl.com/tcityscape.","paperID":"None"},{"content":"Ullmer, B., and Ishii, H. Emerging frameworks for tangible user interfaces. IBM Syst. J. 39 (July 2000).","paperID":"None"},{"content":"Ullmer, B., Ishii, H., and Jacob, R. J. K. Tangible query interfaces: Physically constrained tokens for manipulating database queries. In Proc. INTERACT (2003), 279--286.","paperID":"None"},{"content":"Underkoffier, J., and Ishii, H. Urp: A luminous-tangible workbench for urban planning and design. In Proc. CHI (1999), 386--393.","paperID":"None"},{"content":"Van Wijk, J. J. The value of visualization. In Proc. VIS (2005), 79--86.","paperID":"None"},{"content":"Vande Moere, A., and Patel, S. The Physical Visualization of Information: Designing Data Sculptures in an Educational Context. In Visual Information Communication. Springer, 2010, pp. 1--23.","paperID":"None"},{"content":"Wobbrock, J. O., Morris, M. R., and Wilson, A. D. User-defined gestures for surface computing. In Proc. CHI (2009), 1083--1092.","paperID":"None"},{"content":"Wu, H.-K., and Shah, P. Exploring visuospatial thinking in chemistry learning. Science Education 88, 3 (2004), 465--492.","paperID":"None"},{"content":"Yao, L., Niiyama, R., Ou, J., Follmer, S., Della Silva, C., and Ishii, H. PneUI: Pneumatically actuated soft composite materials for shape changing interfaces. In Proc. UIST (2013), 13--22.","paperID":"None"},{"content":"Zhao, J., and Vande Moere, A. Embodiment in data sculpture: A model of the physical visualization of information. In Proc. DIMEA (2008), 343--350.","paperID":"None"}],"citation":[{"content":"Trevor Hogan , Eva Hornecker , Simon Stusak , Yvonne Jansen , Jason Alexander , Andrew Vande Moere , Uta Hinrichs , Kieran Nolan, Tangible Data, explorations in data physicalization, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2854112"},{"content":"Jason Alexander , Yvonne Jansen , Kasper Hornbæk , Johan Kildal , Abhijit Karnik, Exploring the Challenges of Making Data Physical, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702659"},{"content":"Joanna Kwiatkowska , Wiesław Bartkowski , Olga Górnicka , David Lamas, Applying Generative Techniques to Avoid Technology Push Effect in Ideas and Prototypes Created by Technology-oriented People, Proceedings of the Mulitimedia, Interaction, Design and Innnovation, June 29-30, 2015, Warsaw, Poland","paperID":"2814480"},{"content":"Ken Nakagaki , Sean Follmer , Hiroshi Ishii, LineFORM: Actuated Curve Interfaces for Display, Interaction, and Constraint, Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2807452"},{"content":"Simon Stusak , Moritz Hobe , Andreas Butz, If Your Mind Can Grasp It, Your Hands Will Help, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2839476"}],"abstract":"Physical representations of data have existed for thousands of years. Yet it is now that advances in digital fabrication, actuated tangible interfaces, and shape-changing displays are spurring an emerging area of research that we call Data Physicalization. It aims to help people explore, understand, and communicate data using computer-supported physical data representations. We call these representations physicalizations, analogously to visualizations -- their purely visual counterpart. In this article, we go beyond the focused research questions addressed so far by delineating the research area, synthesizing its open challenges and laying out a research agenda.","title":"Opportunities and Challenges for Data Physicalization","filename":"CHI15/p3227","authors":["Yvonne Jansen","Pierre Dragicevic","Petra Isenberg","Jason Alexander","Abhijit Karnik","Johan Kildal","Sriram Subramanian","Kasper Hornbæk"],"conference":"CHI '15"}