{"paperId":2702204,"citation":[{"content":"Max V. Birk , Ioanna Iacovides , Daniel Johnson , Regan L. Mandryk, The False Dichotomy between Positive and Negative Affect in Game Play, Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, October 05-07, 2015, London, United Kingdom","paperID":"2810258"},{"content":"Sharon T. Steinemann , Elisa D. Mekler , Klaus Opwis, Increasing Donating Behavior Through a Game for Change: The Role of Interactivity and Appreciation, Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, October 05-07, 2015, London, United Kingdom","paperID":"2793125"}],"reference":[{"content":"Belman, J., & Flanagan, M. Designing Games to Foster Empathy, Cognitive Technology, 14(2), (2010), 5--15.","paperID":"None"},{"content":"Benford, S., Greenhalgh, C., Giannachi, G., Walker, B., Marshall, J, Rodden, T., Uncomfortable interactions, Proc. CHI 2012, ACM (2012), 2005--2014.","paperID":"None"},{"content":"Bogost. I., Persuasive Games: The expressive power of video games. MIT Press, 2007.","paperID":"None"},{"content":"D'Aprix, R., & Tyler, C. F. Four essential ingredients for transforming culture. Strategic Communication Management, 10, (2006), pp. 22--25.","paperID":"None"},{"content":"Dunne, A.: Hertzian Tales: Electronic Products, Aesthetic Experience, and Critical Design.The MIT Press, 2006.","paperID":"None"},{"content":"Dunwell, I., de Freitas, S., Petridis, P., Hendrix, M., Arnab, S., Lameras, P., and Stewart, C. A game-based learning approach to road safety: he code of Everand. Proc. CHI 2014, ACM Press (2014), 3389--3398.","paperID":"None"},{"content":"Flanagan, M. Critical Play: Radical Game Design. MIT press, 2009.","paperID":"None"},{"content":"Flanagan, M., & Nissenbaum, H. A game design methodology to incorporate social activist themes. Proc. CHI 2007, ACM Press (2007), 181--190.","paperID":"None"},{"content":"Gaver, W., Bowers, J., Kerridge, T., Boucher, A., & Jarvis, N. Anatomy of a failure: how we knew when our design went wrong, and what we learned from it. Proc. CHI 2009, ACM Press (2009), 2213--2222.","paperID":"None"},{"content":"Halbert, H., & Nathan, L.P. Designing for negative affect and critical reflection. Ext. Abstracts CHI 2014, ACM Press, (2014), pp. 2569--2574.","paperID":"None"},{"content":"Iacovides, I., & Cox, A.L. Designing persuasive games through competition. Paper presented at Workshop on Persuasive Participatory Design for Serious Game Design: Truth and Lies, at CHI Play 2014, Toronto, Canada, October 2014.","paperID":"None"},{"content":"Iacovides, I., McAndrew, P., Scanlon, E., & Aczel, J.C. The gaming involvement and informal learning framework. Simulation & Gaming, Online First, (in press). http://sag.sagepub.com/content/early/2014/11/20/10468 78114554191.full.pdf+html","paperID":"None"},{"content":"Khaled, R., Fischer, R., Noble, J., Biddle R. A qualitative study of culture and persuasion in a smoking cessation game, Proc of the 3rd International conference on Persuasive Technology, (2008), 224--236.","paperID":"None"},{"content":"Kirriemuir, J., & McFarlane, A. Literature review in games and learning. Futurelab series, Bristol: Futurelab, 2004. http://hal.archivesouvertes.fr/docs/00/19/04/53/PDF/kirriemuir-j-2004r8.pdf","paperID":"None"},{"content":"Lee, S. \"I lose, therefore I think\": a search for contemplation amid wars of push-button glare. Game Studies, 3, (2003).","paperID":"None"},{"content":"Lin, J.J., Mamykina, L., Lindtner, S., Delajoux, G., & Strub, H.B., Fish-n-Steps: encouraging physical activity with an interactive computing game, Proc. UbiComp 06, (2006), 261--78.","paperID":"None"},{"content":"Linehan, C., Kirman, B., Lawson, S. & Doughty, M. Blowtooth: pervasive gaming in unique and challenging environments. Ext. Abstracts CHI 2010, ACM Press, (2010), 2695--2704","paperID":"None"},{"content":"Marsh, T., & Costello, B. Lingering Serious Experience as Trigger to Raise Awareness, Encourage Reflection and Change Behavior. Persuasive Technology, (2013), 116--124.","paperID":"None"},{"content":"Mekler, E. D., Bopp, J. A., Tuch, A. N., & Opwis, K. (2014). A systematic review of quantitative studies on the enjoyment of digital entertainment games. In Proc. CHI 2014, ACM Press (2014), 927--936.","paperID":"None"},{"content":"Montola, M. The positive negative experience in extreme role-playing. Proc. of 1st Nordic DiGRA 2010, DiGRA, (2010).","paperID":"None"},{"content":"Nacke, L. E., Drachen, A. & Goebel, S. Methods for evaluating gameplay experience in a serious gaming context. International Journal of Computer Science in Sport, 9 (2), (2010).","paperID":"None"},{"content":"Ruggiero, D. Spent: changing students' affective learning toward homelessness through persuasive video game play. Proc. CHI 2014, ACM Press (2014), 34233432.","paperID":"None"},{"content":"Scott, M. & Wheeless, L. Communication apprehension, student attitudes, and levels of satisfaction. Western Journal of Speech Communication, 41, (1975), pp. 188--198.","paperID":"None"},{"content":"Wilson, D. & Sicart, M. (2010). Now it's personal: on abusive game design. Proc. of FuturePlay 2010 , (2010), pp. 64--71.","paperID":"None"}],"abstract":"Games are normally considered to be \"fun\", though recently there is growing interest in how gameplay can promote empathy and encourage reflection through \"serious experience\". However, when looking beyond enjoyment, it is not clear how to actually evaluate serious experience. We present an evaluation of four games that were submitted to a student game design competition; the competition challenged teams to design a game that inspired curiosity around human error and blame culture within the context of healthcare. The entries were judged by a panel of six experts and subjected to a round of play testing by twelve participants. Methods included gameplay observation, questionnaires, post-play interviews and follow-up email questions. We discuss the utility of these methods, with particular emphasis on how they enabled a consideration of the immediate and longer term impact of serious experience on players.","title":"Moving Beyond Fun: Evaluating Serious Experience in Digital Games","filename":"CHI15/p2245","authors":["Ioanna Iacovides","Anna L. Cox"],"conference":"CHI '15"}