{"paperId":2702494,"abstract":"Researchers have created innovative technological solutions to support people with common chronic illnesses. In this study, we investigate design opportunities for people with rare diseases who are not well studied or have smaller populations to work with, because although an individual's disease may be rare, the number of people living with a rare disease is substantial. We conducted an interview study with 19 individuals with rare diseases from around the world to understand common problems and experiences that could be supported through design. We found that communicating with friends, family, and providers about her disease were challenges for participants. Additionally, participants thought of their disease as being a large part of who they were. We discuss these findings in the context of prior work on common chronic illnesses, addressing the potential relevance of existing technological interventions for people with rare diseases.","citation":[],"reference":[{"content":"Ballegaard, S., Hansen, T., and Kyng, M. Healthcare in everyday life: designing healthcare services for daily life. In CHI 2008 (2008), 1807--1816.","paperID":"None"},{"content":"Belluz, J. The truth about the ice bucket challenge: Viral memes shouldn't dictate our charitable giving, 2014.","paperID":"None"},{"content":"Bodenheimer, T., Lorig, K., Holman, H., and Grumbach, K. Patient self-management of chronic disease in primary care. JAMA 288, 19 (2002), 2469--2475.","paperID":"None"},{"content":"boyd, d. Faceted id/entity: Managing representation in a digital world. Master's thesis, MIT, 2002.","paperID":"None"},{"content":"Broom, A. Virtually he@lthy: the impact of internet use on disease experience and the doctor-patient relationship. Qual Health Res 15, 3 (2005), 325--345.","paperID":"None"},{"content":"Consolvo, S., Roessler, P., Shelton, B., LaMarca, A., Schilit, B., and Bly, S. Technology for care networks of elders. Pervasive Comput. 3, 2 (2004), 22--29.","paperID":"None"},{"content":"Gibson, L., and Hanson, V. 'Digital motherhood': How does technology support new mothers? In CHI 2013 (2013), 313--322.","paperID":"None"},{"content":"Glantz, M., Chamberlain, M., Liu, Q., Hsieh, C., Edward, K., Van Horn, A., and Recht, L. Gender disparity in the rate of partner abandonment in patients with serious medical illness. Cancer 115, 22 (2009), 5237--5242.","paperID":"None"},{"content":"Hartzler, A., and Pratt, W. Managing the personal side of health: How patient expertise differs from the expertise of clinicians. JMIR 13, 3 (2011).","paperID":"None"},{"content":"Huh, J., and Ackerman, M. Collaborative help in chronic disease management. In CSCW 2012 (2012), 853--862.","paperID":"None"},{"content":"Huh, J., Patel, R., and Pratt, W. Tackling dilemmas in supporting 'the whole person' in online patient communities. In CHI 2012 (2012), 923--926.","paperID":"None"},{"content":"Huh, J., and Pratt, W. Weaving clinical expertise in online health communities. In CHI 2014 (2014), 1355--1364.","paperID":"None"},{"content":"Jacobs, M., Clawson, J., and Mynatt, E. My journey compass: A preliminary investigation of a mobile tool for cancer patients. In CHI 2014 (2014), 663--672.","paperID":"None"},{"content":"Joinson, A. Looking at, looking up or keeping up with people?: Motives and use of facebook. In CHI 2008 (2008), 1027--1036.","paperID":"None"},{"content":"Kientz, J., Hayes, G., Westeyn, T., Starner, T., and Abowd, G. Pervasive computing and autism: Assisting caregivers of children with special needs. Pervasive Comput. 6, 1 (2007), 28--35.","paperID":"None"},{"content":"Klasnja, P., Civan Hartzler, A., Unruh, K., and Pratt, W. Blowing in the wind: Unanchored patient information work during cancer care. In CHI 2010 (2010), 193--202.","paperID":"None"},{"content":"Liu, L., Huh, J., Neogi, T., Inkpen, K., and Pratt, W. Health vlogger-viewer interaction in chronic illness management. In CHI 2013 (2013), 49--58.","paperID":"None"},{"content":"MacLeod, H., Tang, A., and Carpendale, S. Personal informatics in chronic illness management. In GI 2013 (2013), 149--156.","paperID":"None"},{"content":"Maitland, J., and Chalmers, M. Self-monitoring, self-awareness, and self-determination in cardiac rehabilitation. In CHI 2010 (2010), 1213--1222.","paperID":"None"},{"content":"Mamykina, L., Mynatt, E., Davidson, P., and Greenblatt, D. MAHI: Investigation of social scaffolding for reflective thinking in diabetes management. In CHI 2008 (2008), 477--486.","paperID":"None"},{"content":"Mamykina, L., Mynatt, E., and Kaufman, D. Investigating health management practices of individuals with diabetes. In CHI 2006 (2006), 927--936.","paperID":"None"},{"content":"Moen, A., and Brennan, P. Health @ home: The work of health information management in the household (HIMH). JAMIA 12, 6 (2005), 648--656.","paperID":"None"},{"content":"Newman, M., Lauterbach, D., Munson, S., Resnick, P., and Morris, M. \"It's not that I don't have problems, I'm just not putting them on Facebook\": Challenges and opportunities in using online social networks for health. In CSCW 2011 (2011).","paperID":"None"},{"content":"Pang, C. Technology preferences and routines for sharing health information during the treatment of a chronic illness. In CHI 2013 (2013).","paperID":"None"},{"content":"Pratt, W., Unruh, K., Civan, A., and Skeels, M. Personal health information management. Commun ACM 49, 1 (2006), 51--55.","paperID":"None"},{"content":"Siek, K., Connelly, K., and Rogers, Y. Pride and prejudice: Learning how chronically ill people think about food. In CHI 2006 (2006), 947--950.","paperID":"None"},{"content":"Skeels, M., Unruh, K., Powell, C., and Pratt, W. Catalyzing social support for breast cancer patients. In CHI 2010 (2010), 173--182.","paperID":"None"},{"content":"Stone, A., Shiffman, S., Schwartz, J., Broderick, J., and Hufford, M. Patient compliance with paper and electronic diaries. Control Clin Trials 24, 2 (2003), 182--199.","paperID":"None"},{"content":"Strauss, A., and Corbin, J. Grounded theory in practice. Sage, 1997.","paperID":"None"},{"content":"Strine, T., Kobau, R., Chapman, D., Thurman, D., Price, P., and Balluz, L. Psychological distress, comorbidities, and health behaviors among us adults with seizures. Epilepsia 46, 7 (2005), 1133--1139.","paperID":"None"},{"content":"Suh, H., Porter, J., Hiniker, A., and Kientz, J. @BabySteps: Design and evaluation of a system for using Twitter for tracking children's developmental milestones. In CHI 2014 (2014), 2279--2288.","paperID":"None"},{"content":"Therapies, S. H. G. Rare disease impact report: Insights from patients and the medical community. Tech. rep., Shire Human Genetic Therapies, 2013.","paperID":"None"},{"content":"Turkle, S. The second self. Simon and Schuster, 1984.","paperID":"None"},{"content":"Unruh, K., and Pratt, W. The invisible work of being a patient and implications for health care. In Ethnogr Prax Ind (2008), 40--50.","paperID":"None"},{"content":"Wesch, M. Youtube and you: Experiences of self-awareness in the context collapse of the recording webcam. EME 8, 2 (2009), 19--34.","paperID":"None"},{"content":"Yun, T., and Arriaga, R. A text message a day keeps the pulmonologist away. In CHI 2013 (2013), 1769--1778.","paperID":"None"}],"title":"Rare World: Towards Technology for Rare Diseases","filename":"CHI15/p1145","authors":["Haley MacLeod","Kim Oakes","Danika Geisler","Kay Connelly","Katie Siek"],"conference":"CHI '15"}