{"paperId":2702584,"citation":[{"content":"Fabian Hemmert , Gesche Joost, On the Other Hand: Embodied Metaphors for Interactions with Mnemonic Objects in Live Presentations, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2839470"}],"reference":[{"content":"André, E., Rist, T., & Müller, J. (1998). WebPersona: a lifelike presentation agent for the World-Wide Web. Knowledge-Based Systems, 11(1), 25--36.","paperID":"None"},{"content":"Apple Keynote. http://www.apple.com/iwork/keynote.","paperID":"None"},{"content":"Matthew P. Aylett , Christopher J. Pidcock, The CereVoice Characterful Speech Synthesiser SDK, Proceedings of the 7th international conference on Intelligent Virtual Agents, September 17-19, 2007, Paris, France","paperID":"1421955"},{"content":"Bishop, J. B., Bauer, K.W., & Becker, E.T. (1998). A survey of counseling needs of male and female college students. Journal of College Student Development, 39, 205--210.","paperID":"None"},{"content":"Cassell, J., Vilhjálmsson, H. H., & Bickmore, T. (2004). BEAT: The behavior expression animation toolkit. LifeLike Characters, 163--185. Springer Berlin Heidelberg.","paperID":"None"},{"content":"Daly, J. A., McCroskey, J. C., Ayres, J., Hopf, T., & Ayres, D. M. (1997). Avoiding communication: shyness, reticence, & communication apprehension (2nd ed.). Hampton Press.","paperID":"None"},{"content":"Daly, J. A., Vangelisti, A. L., & Weber, D. J. (1995). Speech anxiety affects how people prepare speeches: A protocol analysis of the preparation processes of speakers. Communication Monographs, 62, 383--397.","paperID":"None"},{"content":"Darren Edge , Joan Savage , Koji Yatani, HyperSlides: dynamic presentation prototyping, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470749"},{"content":"Goodman, A. (2006). Why bad presentations happen to good causes. Andy Goodman & Cause Communication.","paperID":"None"},{"content":"Mohammed (Ehsan) Hoque , Matthieu Courgeon , Jean-Claude Martin , Bilge Mutlu , Rosalind W. Picard, MACH: my automated conversation coach, Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing, September 08-12, 2013, Zurich, Switzerland","paperID":"2493502"},{"content":"Jackson, J. M., & Latané, B. (1981). All alone in front of all those people: Stage fright as a function of number and type of co-performers and audience. Journal of Personality and Social Psychology, 40(1), 73.","paperID":"None"},{"content":"Kang, N., Brinkman, W. P., van Riemsdijk, M. B., & Neerincx, M. A. (2013). An expressive virtual audience with flexible behavioral styles. IEEE Transactions on Affective Computing, 4(4), 326--340.","paperID":"None"},{"content":"Kasl, S. V., & Mahl, G. F. (1965). The relationship of disturbances and hesitations in spontaneous speech to anxiety. Journal of Applied Behavioral Analysis, 1, 425--433.","paperID":"None"},{"content":"Latané, B., & Nida, S. (1980). Social impact theory and group influence: A social engineering perspective. Psychology of Group Influence.","paperID":"None"},{"content":"McCroskey, J. C., & McCroskey, L. L. (1988). Self-report as an approach to measuring communication competence. Communication Research Reports, 5, 108--113.","paperID":"None"},{"content":"Menzel, K. E., & Carrell, L. J. (1994). The relationship between preparation and performance in public speaking. Communication Education, 43, 17--26.","paperID":"None"},{"content":"Microsoft PowerPoint. http://office.microsoft.com/enus/powerpoint.","paperID":"None"},{"content":"Nijholt, A., van Welbergen, H., & Zwiers, J. (2005). Introducing an embodied virtual presenter agent in a virtual meeting room. Artificial Intelligence and Applications, 579--584.","paperID":"None"},{"content":"Noma, T., Badler, N. I., & Zhao, L. (2000). Design of a virtual human presenter. Center for Human Modeling and Simulation, 75.","paperID":"None"},{"content":"Paul G. L. (1966). Insight and desensitization in psychotherapy: An experiment in anxiety reduction. Stanford University Press.","paperID":"None"},{"content":"David-Paul Pertaub , Mel Slater , Chris Barker, An experiment on public speaking anxiety in response to three different types of virtual audience, Presence: Teleoperators and Virtual Environments, v.11 n.1, p.68-78, February 2002","paperID":"641638"},{"content":"Bahador Saket , Sijie Yang , Hong Tan , Koji Yatani , Darren Edge, TalkZones: section-based time support for presentations, Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, September 23-26, 2014, Toronto, ON, Canada","paperID":"2628399"},{"content":"Spielberger, C. D. (1989). State-trait anxiety inventory: bibliography (2nd ed.). Consulting Psychologists Press.","paperID":"None"},{"content":"Ha Trinh , Koji Yatani , Darren Edge, PitchPerfect: integrated rehearsal environment for structured presentation preparation, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557286"},{"content":"Turning Technologies. http://www.turningtechnologies.com/responsesolutions/responsecard-ir.","paperID":"None"}],"abstract":"The quality of most professional oral presentations is often poor, owing to a number of factors, including public speaking anxiety. We present DynamicDuo, a system that uses an automated, life-sized, animated agent to help inexperienced speakers deliver their presentations in front of an audience. The design of the system was informed by an analysis of TED talks given by two human presenters to identify the most common dual-presentation formats and transition behaviors used. In a within-subjects study (N=12) comparing co-presenting with DynamicDuo against solo-presenting with conventional presentation software, we demonstrated that our system led to significant improvements in public speaking anxiety and speaking confidence for non-native English speakers. Judges who viewed videotapes of these presentations rated those with DynamicDuo significantly higher on speech quality and overall presentation quality for all presenters.","video":"http://www.youtube.com/embed/Hxjz3PqcvdE?rel=0","title":"DynamicDuo: Co-presenting with Virtual Agents","filename":"CHI15/p1739","authors":["Ha Trinh","Lazlo Ring","Timothy Bickmore"],"conference":"CHI '15"}