{"paperId":2702592,"citation":[],"reference":[{"content":"Sean Andrist , Xiang Zhi Tan , Michael Gleicher , Bilge Mutlu, Conversational gaze aversion for humanlike robots, Proceedings of the 2014 ACM/IEEE international conference on Human-robot interaction, March 03-06, 2014, Bielefeld, Germany","paperID":"2559666"},{"content":"Timothy W. Bickmore , Lisa Caruso , Kerri Clough-Gorr, Acceptance and usability of a relational agent interface by urban older adults, CHI '05 Extended Abstracts on Human Factors in Computing Systems, April 02-07, 2005, Portland, OR, USA","paperID":"1056879"},{"content":"Bruno, B., Mastrogiovanni, F., and Sgorbissa, A. Functional requirements and design issues for a socially assistive robot for elderly people with mild cognitive impairments. In Proc RO-MAN'13 (2013), 768--773.","paperID":"None"},{"content":"Bull, R., and Gibson-Robinson, E. The influences of eye-gaze, style of dress, and locality on the amounts of money donated to a charity. Hum Relat 34, 10 (1981), 895--905.","paperID":"None"},{"content":"Burroughs, N. F. A reinvestigation of the relationship of teacher nonverbal immediacy and student compliance-resistance with learning. Commun Educ 56, 4 (2007), 453--475.","paperID":"None"},{"content":"Christophel, D. M. The relationships among teacher immediacy behaviors, student motivation, and learning. Commun Educ 39, 4 (1990), 323--340.","paperID":"None"},{"content":"Davies, D. R., Matthews, G., Stammers, R. B., and Westerman, S. J. Human performance: Cognition, stress and individual differences. Psychology Press, 2013.","paperID":"None"},{"content":"Emery, N. The eyes have it: the neuroethology, function and evolution of social gaze. Neurosci Biobehav R 24, 6 (2000), 581--604.","paperID":"None"},{"content":"Eriksson, J., Matarić, M. J., and Winstein, C. Hands-off assistive robotics for post-stroke arm rehabilitation. In Proc ICORR'05 (2005), 21--24.","paperID":"None"},{"content":"Fasola, J., and Mataric, M. J. Using socially assistive human-robot interaction to motivate physical exercise for older adults. Proc IEEE 100, 8 (2012), 2512--2526.","paperID":"None"},{"content":"Feil-Seifer, D., and Mataric, M. J. Defining socially assistive robotics. In Proc ICORR'05 (2005), 465--468.","paperID":"None"},{"content":"Feil-Seifer, D., and Matarić, M. J. Toward socially assistive robotics for augmenting interventions for children with autism spectrum disorders. In Experimental Robotics (2009), 201--210.","paperID":"None"},{"content":"Gifford, R. Personality and nonverbal behavior: A complex conundrum. 2006, 159--179.","paperID":"None"},{"content":"Goetz, J., Kiesler, S., and Powers, A. Matching robot appearance and behavior to tasks to improve human-robot cooperation. In Proc RO-MAN'03 (2003), 55--60.","paperID":"None"},{"content":"Guay, F., Mageau, G. A., and Vallerand, R. J. On the hierarchical structure of self-determined motivation: A test of top-down, bottom-up, reciprocal, and horizontal effects. Pers Soc Psychol B 29, 8 (2003), 992--1004.","paperID":"None"},{"content":"Hendrick, C., and Brown, S. R. Introversion, extraversion, and interpersonal attraction.","paperID":"None"},{"content":"Chien-Ming Huang , Bilge Mutlu, Robot behavior toolkit: generating effective social behaviors for robots, Proceedings of the seventh annual ACM/IEEE international conference on Human-Robot Interaction, March 05-08, 2012, Boston, Massachusetts, USA","paperID":"2157694"},{"content":"Iizuka, Y. Extraversion, introversion, and visual interaction. Percept Motor Skill 74, 1 (1992), 43--50.","paperID":"None"},{"content":"John, O. P., and Srivastava, S. The big five trait taxonomy: History, measurement, and theoretical perspectives. vol. 2. 1999, 102--138.","paperID":"None"},{"content":"Kang, K. I., Freedman, S., Mataric, M. J., Cunningham, M. J., and Lopez, B. A hands-off physical therapy assistance robot for cardiac patients. In Proc ICORR'05 (2005), 337--340.","paperID":"None"},{"content":"Cory David Kidd , Cynthia Breazeal, Designing for long-term human-robot interaction and application to weight loss, Massachusetts Institute of Technology, Cambridge, MA, 2008","paperID":"1414971"},{"content":"Kwan Min Lee , Clifford Nass, Designing social presence of social actors in human computer interaction, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642662"},{"content":"Lee, K. M., Peng, W., Jin, S.-A., and Yan, C. Can robots manifest personality?: An empirical test of personality recognition, social responses, and social presence in human-robot interaction. J Commun 56, 4 (2006), 754--772.","paperID":"None"},{"content":"Iolanda Leite , Ginevra Castellano , André Pereira , Carlos Martinho , Ana Paiva, Modelling empathic behaviour in a robotic game companion for children: an ethnographic study in real-world settings, Proceedings of the seventh annual ACM/IEEE international conference on Human-Robot Interaction, March 05-08, 2012, Boston, Massachusetts, USA","paperID":"2157811"},{"content":"Lippa, R. A., and Dietz, J. K. The relation of gender, personality, and intelligence to judges' accuracy in judging strangers' personality from brief video segments. J Nonverbal Behav 24, 1 (2000), 25--43.","paperID":"None"},{"content":"Marti, P., Bacigalupo, M., Giusti, L., Mennecozzi, C., and Shibata, T. Socially assistive robotics in the treatment of behavioural and psychological symptoms of dementia. In Proc BioRob '06 (2006), 483--488.","paperID":"None"},{"content":"AJung Moon , Daniel M. Troniak , Brian Gleeson , Matthew K.X.J. Pan , Minhua Zheng , Benjamin A. Blumer , Karon MacLean , Elizabeth A. Croft, Meet me where i'm gazing: how shared attention gaze affects human-robot handover timing, Proceedings of the 2014 ACM/IEEE international conference on Human-robot interaction, March 03-06, 2014, Bielefeld, Germany","paperID":"2559656"},{"content":"Jonathan Mumm , Bilge Mutlu, Designing motivational agents: The role of praise, social comparison, and embodiment in computer feedback, Computers in Human Behavior, v.27 n.5, p.1643-1650, September, 2011","paperID":"2007639"},{"content":"Bilge Mutlu , Takayuki Kanda , Jodi Forlizzi , Jessica Hodgins , Hiroshi Ishiguro, Conversational gaze mechanisms for humanlike robots, ACM Transactions on Interactive Intelligent Systems (TiiS), v.1 n.2, p.1-33, January 2012","paperID":"2070725"},{"content":"Bilge Mutlu , Toshiyuki Shiwa , Takayuki Kanda , Hiroshi Ishiguro , Norihiro Hagita, Footing in human-robot conversations: how robots might shape participant roles using gaze cues, Proceedings of the 4th ACM/IEEE international conference on Human robot interaction, March 09-13, 2009, La Jolla, California, USA","paperID":"1514109"},{"content":"Clifford Nass , Ing-Marie Jonsson , Helen Harris , Ben Reaves , Jack Endo , Scott Brave , Leila Takayama, Improving automotive safety by pairing driver emotion and car voice emotion, CHI '05 Extended Abstracts on Human Factors in Computing Systems, April 02-07, 2005, Portland, OR, USA","paperID":"1057070"},{"content":"Nikolopoulos, C., Kuester, D., Sheehan, M., Ramteke, S., Karmarkar, A., Thota, S., Kearney, J., Boirum, C., Bojedla, S., and Lee, A. Robotic agents used to help teach social skills to children with autism: the third generation. In Proc RO-MAN'11 (2011), 253--258.","paperID":"None"},{"content":"Osterberg, L., and Blaschke, T. Adherence to medication. New Engl J Med 353, 5 (2005), 487--497.","paperID":"None"},{"content":"Peters, P. Gaining compliance through non-verbal communication. Pepp Disp Resol L J 7 (2007), 87.","paperID":"None"},{"content":"Rauthmann, J. F., Seubert, C. T., Sachse, P., and Furtner, M. R. Eyes as windows to the soul: Gazing behavior is related to personality. J Res Pers 46, 2 (2012), 147--156.","paperID":"None"},{"content":"Richter, L. A., and Salvendy, G. Effects of personality and task strength on performance in computerized tasks. Ergonomics 38, 2 (1995), 281--291.","paperID":"None"},{"content":"Rutter, D., Morley, I. E., and Graham, J. C. Visual interaction in a group of introverts and extraverts. Eur J Soc Psychol 2, 4 (1972), 371--384.","paperID":"None"},{"content":"Ryan, R. M., and Deci, E. L. Intrinsic and extrinsic motivations: Classic definitions and new directions. Contemp Educ Psychol 25, 1 (2000), 54--67.","paperID":"None"},{"content":"Scassellati, B., Admoni, H., and Matarić, M. Robots for use in autism research. Annu Rev Biomed Eng 14 (2012), 275--294.","paperID":"None"},{"content":"Segrin, C. The effects of nonverbal behavior on outcomes of compliance gaining attempts. Commun Stud 44, 3-4 (1993), 169--187.","paperID":"None"},{"content":"Staudte, M., and Crocker, M. W. Investigating joint attention mechanisms through spoken human-robot interaction. Cognition 120, 2 (2011), 268--291.","paperID":"None"},{"content":"Takacs, B., and Hanak, D. A prototype home robot with an ambient facial interface to improve drug compliance. J Telemed Telecare 14, 7 (2008), 393--395.","paperID":"None"},{"content":"Tapus, A., and Mataric, M. J. Socially assistive robots: The link between personality, empathy, physiological signals, and task performance. In Proc AAAI Spring Symposium: Emotion, Personality, and Social Behavior (2008), 133--140.","paperID":"None"},{"content":"Tapus, A., and Matarić, M. J. User personality matching with a hands-off robot for post-stroke rehabilitation therapy. In Experimental Robotics (2008), 165--175.","paperID":"None"},{"content":"Tapus, A., Tapus, C., and Mataric, M. The role of physical embodiment of a therapist robot for individuals with cognitive impairments. In Proc Ro-Man'09 (2009), 103--107.","paperID":"None"},{"content":"Tapus, A., Tapus, C., and Mataric, M. J. The use of socially assistive robots in the design of intelligent cognitive therapies for people with dementia. In Proc ICORR'09 (2009), 924--929.","paperID":"None"},{"content":"Cristen Torrey , Aaron Powers , Matthew Marge , Susan R. Fussell , Sara Kiesler, Effects of adaptive robot dialogue on information exchange and social relations, Proceedings of the 1st ACM SIGCHI/SIGART conference on Human-robot interaction, March 02-03, 2006, Salt Lake City, Utah, USA","paperID":"1121264"},{"content":"Vallerand, R. J., and Reid, G. On the causal effects of perceived competence on intrinsic motivation: A test of cognitive evaluation theory. J Sport Psychol 6, 1 (1984), 94--102.","paperID":"None"},{"content":"Wade, E., Parnandi, A., Mead, R., and Matarić, M. Socially assistive robotics for guiding motor task practice. Paladyn 2, 4 (2011), 218--227.","paperID":"None"}],"abstract":"Socially assistive robots are envisioned to provide social and cognitive assistance where they will seek to motivate and engage people in therapeutic activities. Due to their physicality, robots serve as a powerful technology for motivating people. Prior work has shown that effective motivation requires adaption to user needs and characteristics, but how robots might successfully achieve such adaptation is still unknown. In this paper, we present work on matching a robot's personality-expressed via its gaze behavior-to that of its users. We confirmed in an online study with 22 participants that the robot's gaze behavior can successfully express either an extroverted or introverted personality. In a laboratory study with 40 participants, we demonstrate the positive effect of personality matching on a user's motivation to engage in a repetitive task. These results have important implications for the design of adaptive robot behaviors in assistive human-robot interaction.","video":"http://www.youtube.com/embed/zHCmz4hNoR0?rel=0","title":"Look Like Me: Matching Robot Personality via Gaze to Increase Motivation","filename":"CHI15/p3603","authors":["Sean Andrist","Bilge Mutlu","Adriana Tapus"],"conference":"CHI '15"}