{"paperId":2702593,"abstract":"Interruptions of knowledge workers are common and can cause a high cost if they happen at inopportune moments. With recent advances in psycho-physiological sensors and their link to cognitive and emotional states, we are interested whether such sensors might be used to measure interruptibility of a knowledge worker. In a lab and a field study with a total of twenty software developers, we examined the use of psycho-physiological sensors in a real-world context. The results show that a Naive Bayes classifier based on psycho-physiological features can be used to automatically assess states of a knowledge worker's interruptibility with high accuracy in the lab as well as in the field. Our results demonstrate the potential of these sensors to avoid expensive interruptions in a real-world context. Based on brief interviews, we further discuss the usage of such an interruptibility measure and interruption support for software developers.","citation":[{"content":"Katja Kevic , Braden M. Walters , Timothy R. Shaffer , Bonita Sharif , David C. Shepherd , Thomas Fritz, Tracing software developers' eyes and interactions for change tasks, Proceedings of the 2015 10th Joint Meeting on Foundations of Software Engineering, August 30-September 04, 2015, Bergamo, Italy","paperID":"2786864"}],"reference":[{"content":"Piotr D. Adamczyk , Brian P. Bailey, If not now, when?: the effects of interruption at different moments within task execution, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.271-278, April 24-29, 2004, Vienna, Austria","paperID":"985727"},{"content":"Altmann, E. M., and Trafton, J. G. Memory for goals: An activation-based model. Cognitive science 26, 1 (2002).","paperID":"None"},{"content":"Altmann, E. M., and Trafton, J. G. Task interruption: Resumption lag and the role of cues. Tech. rep., DTIC Document, 2004.","paperID":"None"},{"content":"Ernesto Arroyo , Ted Selker, Attention and intention goals can mediate disruption in human-computer interaction, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042162"},{"content":"Brian P. Bailey , Shamsi T. Iqbal, Understanding changes in mental workload during execution of goal-directed tasks and its application for interruption management, ACM Transactions on Computer-Human Interaction (TOCHI), v.14 n.4, p.1-28, January 2008","paperID":"1314689"},{"content":"Bailey, B. P., and Konstan, J. A. On the need for attention-aware systems: Measuring effects of interruption on task performance, error rate, and affective state. Computers in Human Behavior 22, 4 (2006).","paperID":"None"},{"content":"Bailey, B. P., Konstan, J. A., and Carlis, J. V. The effects of interruptions on task performance, annoyance, and anxiety in the user interface. In Proc. INTERACT'01 (2001), 593--601.","paperID":"None"},{"content":"Beatty, J. Task-evoked pupillary responses, processing load, and the structure of processing resources. Psychological bulletin 91, 2 (1982).","paperID":"None"},{"content":"Berger, H. Uber das elektrenkephalogramm des menschen. Archiv für Psychiatrie und Nervenkrankheiten 87, 1 (1929), 527--570.","paperID":"None"},{"content":"Matthias Böhmer , Christian Lander , Sven Gehring , Duncan P. Brumby , Antonio Krüger, Interrupted by a phone call: exploring designs for lowering the impact of call notifications for smartphone users, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557066"},{"content":"Boucsein, W. Electrodermal activity. Springer, 2012.","paperID":"None"},{"content":"Daniel Chen , Jamie Hart , Roel Vertegaal, Towards a physiological model of user interruptability, Proceedings of the 11th IFIP TC 13 international conference on Human-computer interaction, September 10-14, 2007, Rio de Janeiro, Brazil","paperID":"1778380"},{"content":"Daniel Chen , Roel Vertegaal, Using mental load for managing interruptions in physiologically attentive user interfaces, CHI '04 Extended Abstracts on Human Factors in Computing Systems, April 24-29, 2004, Vienna, Austria","paperID":"986103"},{"content":"Collet, C., Vernet-Maury, E., Delhomme, G., and Dittmar, A. Autonomic nervous system response patterns specificity to basic emotions. Journal of the autonomic nervous system 62, 1--2 (1997).","paperID":"None"},{"content":"Conard, M. A., and Marsh, R. Single and multiple interruptions increase task performance time, but don't affect stress, pressure or flow. 2010.","paperID":"None"},{"content":"Mary Czerwinski , Eric Horvitz , Susan Wilhite, A diary study of task switching and interruptions, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.175-182, April 24-29, 2004, Vienna, Austria","paperID":"985715"},{"content":"James Fogarty , Scott E. Hudson , Christopher G. Atkeson , Daniel Avrahami , Jodi Forlizzi , Sara Kiesler , Johnny C. Lee , Jie Yang, Predicting human interruptibility with sensors, ACM Transactions on Computer-Human Interaction (TOCHI), v.12 n.1, p.119-146, March 2005","paperID":"1057243"},{"content":"James Fogarty , Andrew J. Ko , Htet Htet Aung , Elspeth Golden , Karen P. Tang , Scott E. Hudson, Examining task engagement in sensor-based statistical models of human interruptibility, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 02-07, 2005, Portland, Oregon, USA","paperID":"1055018"},{"content":"Gevins, A., Smith, M. E., Leong, H., McEvoy, L., Whitfield, S., Du, R., and Rush, G. Monitoring working memory load during computer-based tasks with eeg pattern recognition methods. Human Factors: The Journal of the Human Factors and Ergonomics Society 40, 1 (1998).","paperID":"None"},{"content":"Victor M. González , Gloria Mark, \"Constant, constant, multi-tasking craziness\": managing multiple working spheres, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.113-120, April 24-29, 2004, Vienna, Austria","paperID":"985707"},{"content":"David Grimes , Desney S. Tan , Scott E. Hudson , Pradeep Shenoy , Rajesh P.N. Rao, Feasibility and pragmatics of classifying working memory load with an electroencephalograph, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357187"},{"content":"Eija Haapalainen , SeungJun Kim , Jodi F. Forlizzi , Anind K. Dey, Psycho-physiological measures for assessing cognitive load, Proceedings of the 12th ACM international conference on Ubiquitous computing, September 26-29, 2010, Copenhagen, Denmark","paperID":"1864395"},{"content":"Handy, T. C. Event-related potentials: a methods handbook. MIT Press, 2005.","paperID":"None"},{"content":"Joyce Ho , Stephen S. Intille, Using context-aware computing to reduce the perceived burden of interruptions from mobile devices, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 02-07, 2005, Portland, Oregon, USA","paperID":"1055100"},{"content":"Scott Hudson , James Fogarty , Christopher Atkeson , Daniel Avrahami , Jodi Forlizzi , Sara Kiesler , Johnny Lee , Jie Yang, Predicting human interruptibility with sensors: a Wizard of Oz feasibility study, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2003, Ft. Lauderdale, Florida, USA","paperID":"642657"},{"content":"Shamsi T. Iqbal , Brian P. Bailey, Investigating the effectiveness of mental workload as a predictor of opportune moments for interruption, CHI '05 Extended Abstracts on Human Factors in Computing Systems, April 02-07, 2005, Portland, OR, USA","paperID":"1056948"},{"content":"Shamsi T. Iqbal , Brian P. Bailey, Leveraging characteristics of task structure to predict the cost of interruption, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124882"},{"content":"Shamsi T. Iqbal , Xianjun Sam Zheng , Brian P. Bailey, Task-evoked pupillary response to mental workload in human-computer interaction, CHI '04 Extended Abstracts on Human Factors in Computing Systems, April 24-29, 2004, Vienna, Austria","paperID":"986094"},{"content":"Jacob, R. J., and Karn, K. S. Eye tracking in human-computer interaction and usability research: Ready to deliver the promises. Mind 2, 3 (2003), 4.","paperID":"None"},{"content":"Kramer, A. F. Physiological metrics of mental workload: A review of recent progress. Multiple-task Performance (1991).","paperID":"None"},{"content":"Kruglanski, A. W. Lay epistemic theory in social-cognitive psychology. Psychological Inquiry 1, 3 (1990).","paperID":"None"},{"content":"Johnny Chung Lee , Desney S. Tan, Using a low-cost electroencephalograph for task classification in HCI research, Proceedings of the 19th annual ACM symposium on User interface software and technology, October 15-18, 2006, Montreux, Switzerland","paperID":"1166268"},{"content":"Lemaire, P. The role of working memory resources in simple cognitive arithmetic. European Journal of Cognitive Psychology 8, 1 (1996).","paperID":"None"},{"content":"Malik, M., Bigger, J. T., Camm, A. J., Kleiger, R. E., Malliani, A., Moss, A. J., and Schwartz, P. J. Heart rate variability standards of measurement, physiological interpretation, and clinical use. European heart journal 17, 3 (1996).","paperID":"None"},{"content":"Plamen Manoilov, Eye-blinking artefacts analysis, Proceedings of the 2007 international conference on Computer systems and technologies, June 14-15, 2007, Bulgaria","paperID":"1330654"},{"content":"Mathan, S., Whitlow, S., Dorneich, M., Ververs, P., and Davis, G. Neurophysiological Estimation of Interruptibility: Demonstrating Feasibility in a Field Context. In Proc. ICACS'07 (2007).","paperID":"None"},{"content":"Daniel McFarlane, Comparison of four primary methods for coordinating the interruption of people in human-computer interaction, Human-Computer Interaction, v.17 n.1, p.63-139, March 2002","paperID":"1464475"},{"content":"Monk, C. A., Trafton, J. G., and Boehm-Davis, D. A. The effect of interruption duration and demand on resuming suspended goals. Journal of Experimental Psychology: Applied 14, 4 (2008), 299.","paperID":"None"},{"content":"Nargess Nourbakhsh , Yang Wang , Fang Chen , Rafael A. Calvo, Using galvanic skin response for cognitive load measurement in arithmetic and reading tasks, Proceedings of the 24th Australian Computer-Human Interaction Conference, p.420-423, November 26-30, 2012, Melbourne, Australia","paperID":"2414602"},{"content":"Chris Parnin , Spencer Rugaber, Resumption strategies for interrupted programming tasks, Software Quality Control, v.19 n.1, p.5-34, March     2011","paperID":"1938268"},{"content":"Peper, E., Harvey, R., Lin, I.-M., Tylova, H., and Moss, D. Is there more to blood volume pulse than heart rate variability, respiratory sinus arrhythmia, and cardiorespiratory synchrony? Biofeedback 35, 2 (2007).","paperID":"None"},{"content":"Schmidt, S., and Walach, H. Electrodermal activity (eda): State-of-the-art measurement and techniques for parapsychological purposes. Journal of Parapsychology 63, 3 (1999).","paperID":"None"},{"content":"Takahisa Tani , Seiji Yamada, Estimating user interruptibility by measuring table-top pressure, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468662"},{"content":"J. Gregory Trafton , Erik M. Altmann , Derek P. Brock , Farilee E. Mintz, Preparing to resume an interrupted task: effects of prospective goal encoding and retrospective rehearsal, International Journal of Human-Computer Studies, v.58 n.5, p.583-603, May 2003","paperID":"780892"},{"content":"Rini van Solingen , Egon Berghout , Frank van Latum, Interrupts: Just a Minute Never Is, IEEE Software, v.15 n.5, p.97-103, September 1998","paperID":"625911"},{"content":"Vinkers, C. H., Penning, R., Hellhammer, J., Verster, J. C., Klaessens, J. H., Olivier, B., and Kalkman, C. J. The effect of stress on core and peripheral body temperature in humans. Stress 16, 5 (2013).","paperID":"None"},{"content":"Wilson, G. F. An analysis of mental workload in pilots during flight using multiple psychophysiological measures. The International Journal of Aviation Psychology 12, 1 (2002).","paperID":"None"},{"content":"Ian H. Witten , Eibe Frank, Data Mining: Practical Machine Learning Tools and Techniques, Second Edition (Morgan Kaufmann Series in Data Management Systems), Morgan Kaufmann Publishers Inc., San Francisco, CA, 2005","paperID":"1205860"}],"title":"Interruptibility of Software Developers and its Prediction Using Psycho-Physiological Sensors","filename":"CHI15/p2981","authors":["Manuela Züger","Thomas Fritz"],"conference":"CHI '15"}