{"paperId":2702216,"abstract":"In this paper we report the results of a qualitative research study of the GENI cyberinfrastructure: a program of four federated cyberinfrastructures. Drawing on theories of stakeholder positioning, we examine how different GENI stakeholders attempt to enlist new participants in the cyberinfrastructures of GENI, and leverage existing relationships to create sustainable infrastructure. This study contributes to our understanding of how cyberinfrastructures emerge over time through processes of stakeholder alignment, enrollment, and through synergies among stakeholder groups. We explore these issues to better understand how cyberinfrastructures can be designed to sustain over time.","citation":[],"reference":[{"content":"Atkins, D. Revolutionizing Science and Engineering Through Cyberinfrastructure: Report of the National Science Foundation Blue-Ribbon Advisory Panel on Cyberinfrastructure. 2003.","paperID":"None"},{"content":"Barki, H. and Hartwick, J. Rethinking the Concept of User Involvement. MIS Quarterly 13, 1 (1989), 53.","paperID":"None"},{"content":"Baroudi, J.J., Olson, M.H., and Ives, B. An empirical study of the impact of user involvement on system usage and information satisfaction. Communications of the ACM 29, 3 (1986), 232--238.","paperID":"None"},{"content":"Bettencourt, L.A., Ostrom, A.L., Brown, S.W., and Roundtree, R.I. Client Co-Production in KnowledgeIntensive Business Services. California Management Review 44, 4 (2002).","paperID":"None"},{"content":"Bietz, M.J., Baumer, E.P.S., and Lee, C.P. Synergizing in Cyberinfrastructure Development. Computer Supported Cooperative Work (CSCW) 19, 3-4 (2010), 245--281.","paperID":"None"},{"content":"Bietz, M.J., Ferro, T., and Lee, C.P. Sustaining the development of cyberinfrastructure. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work - CSCW '12, ACM Press (2012), 901.","paperID":"None"},{"content":"Callon, M. Some elements of a sociology of translation: domestication of the scallops and the fishermen of St Brieuc Bay. In J. Law, ed., Power, action and belief: a new sociology of knowledge?. Routledge, London, 1986, 196--223.","paperID":"None"},{"content":"Charmaz, K. Constructing Grounded Theory: A Practical Guide Through Qualitative Analysis. Pine Forge Press, 2006.","paperID":"None"},{"content":"Cockburn, A. Agile Software Development. AddisonWesley, Reading, MA, 2001.","paperID":"None"},{"content":"Davis, F. Perceived usefulness, perceived ease of use, and user acceptance of information technology. MIS Quarterly 13, 3 (1989), 319--340.","paperID":"None"},{"content":"Edwards, P.N., Jackson, S.J., Bowker, G.C., and Knobel, C.P. Understanding infrastructure: Dynamics, tensions. and design. 2007.","paperID":"None"},{"content":"Edwards, W.K., Newman, M.W., and Poole, E.S. The infrastructure problem in HCI. Proceedings of the 28th international conference on Human factors in computing systems - CHI '10, ACM Press (2010), 423.","paperID":"None"},{"content":"Eisenhardt, K.M. Building Theories from Case Study Research. Academy of Management Review 14, 4 (1989), 532--550.","paperID":"None"},{"content":"Finholt, T.A. Collaboratories as a new form of scientific organization. Economics of Innovation and New Technology 12, 1 (2003), 5--25.","paperID":"None"},{"content":"Galison, P. Big Science: The Growth of Large-scale Research. Stanford University Press, 1992.","paperID":"None"},{"content":"Gallivan, M.. Value in triangulation: a comparison of two approaches for combining qualitative and quantitative methods. In A.. Lee, J. Liebenau and J. DeGross, eds., Information Systems and Qualitative Research. Chapman & Hall, London, 1997, 417--443.","paperID":"None"},{"content":"Hey, T. and Trefethen, A. e-Science and its implications. Philosophical transactions. Series A, Mathematical, physical, and engineering sciences 361, 1809 (2003), 1809--25.","paperID":"None"},{"content":"Latour, B. Science in Action: How to Follow Scientists and Engineers Through Society. Harvard University Press, 1987.","paperID":"None"},{"content":"Latour, B. Reassembling the Social - An Introduction to Actor-Network-Theory. Reassembling the Social An Introduction to Actor-Network-Theory, by Bruno Latour, pp. 316. Foreword by Bruno Latour. Oxford University Press, Sep 2005. ISBN-10: 0199256047. ISBN-13: 9780199256044-1, (2005).","paperID":"None"},{"content":"Law, J. Notes on the theory of the actor-network: Ordering, strategy, and heterogeneity. Systems Practice 5, 4 (1992), 379--393.","paperID":"None"},{"content":"Lee, C.P., Dourish, P., and Mark, G. The human infrastructure of cyberinfrastructure. Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work - CSCW '06, ACM Press (2006), 483.","paperID":"None"},{"content":"Lee, J.W., Zhang, J., Zimmerman, A.S., and Lucia, A. DataNet: An emerging cyberinfrastructure for sharing, reusing and preserving digital data for scientific discovery and learning. AIChE Journal 55, 11 (2009), 2757--2764.","paperID":"None"},{"content":"Mambrey, P., Mark, G., and Pankoke-Babatz, U. User Advocacy in Participatory Design: Designers' Experiences with a New Communication Channel. Computer Supported Cooperative Work (CSCW) 7, 3-4 (1998), 291--313.","paperID":"None"},{"content":"Miranda, S.M. and Kavan, C.B. Moments of governance in IS outsourcing: conceptualizing effects of contracts on value capture and creation. Journal of Information Technology 20, 3 (2005), 152--169.","paperID":"None"},{"content":"Mirel, B. Interaction Design for Complex Problem Solving: Developing Useful and Usable Software. Morgan Kaufmann, 2004.","paperID":"None"},{"content":"Olson, G.M., Zimmerman, A., and Bos, N. Scientific Collaboration on the Internet. (2008).","paperID":"None"},{"content":"Palys. Research Decisions: Quantitative and Qualitative Perspectives. Thompson, Toronto, 2008.","paperID":"None"},{"content":"Procter, R., Borgman, C., Bowker, G., et al. Usability research challenges for cyberinfrastructure and tools. CHI '06 extended abstracts on Human factors in computing systems - CHI EA '06, ACM Press (2006), 1675.","paperID":"None"},{"content":"Redish, J. Expanding Usability Testing to Evaluate Complex Systems. Journal of Usability Studies 2, 3 (2007), 102--111.","paperID":"None"},{"content":"Ribes, D. and Finholt, T. The Long Now of Technology Infrastructure: Articulating Tensions in Development. Journal of the Association for Information Systems. May2009 10, 5 (2009).","paperID":"None"},{"content":"Ribes, D. and Lee, C.P. Sociotechnical Studies of Cyberinfrastructure and e-Research: Current Themes and Future Trajectories. Computer Supported Cooperative Work (CSCW) 19, 3-4 (2010), 231--244.","paperID":"None"},{"content":"Rogers, E.M. Diffusion of Innovations, 4th Edition. Simon and Schuster, 2010.","paperID":"None"},{"content":"Schopf, J.M. Sustainability and the Office of CyberInfrastructure. 2009 Eighth IEEE International Symposium on Network Computing and Applications, IEEE (2009), 1--3.","paperID":"None"},{"content":"Şeker, Ş.E. Possible Social Impacts of E-Government: A Case Study of Turkey. 2004.","paperID":"None"},{"content":"Shin, D.-H. A socio-technical framework for cyberinfrastructure design. Technological Forecasting and Social Change 77, 5 (2010), 783--795.","paperID":"None"},{"content":"Sonnenwald, D.H. Scientific collaboration. Annual Review of Information Science and Technology 41, 1 (2007), 643--681.","paperID":"None"},{"content":"Star, S.L. and Ruhleder, K. Steps Toward an Ecology of Infrastructure: Design and Access for Large Information Spaces. Information Systems Research 7, 1 (1996), 111--134.","paperID":"None"},{"content":"Star, S.L. The Ethnography of Infrastructure. American Behavioral Scientist 43, 3 (1999), 377--391.","paperID":"None"},{"content":"Steinhardt, S. and Jackson, S. Reconciling rhythms: plans and temporal alignment in collaborative scientific work. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, (2014), 134--145.","paperID":"None"},{"content":"Stewart, C.A., Almes, G.T., and Wheeler, B.C. (eds. Cyberinfrastructure Software Sustainability and Reusability: Report from an NSF-funded workshop. (2010).","paperID":"None"},{"content":"Venkatesh, V., Morris, M.G., Davis, G.B., and Davis, F.D. User acceptance of information technology: toward a unified view. MIS Quarterly 27, 3 (2003), 425--478.","paperID":"None"},{"content":"Walsham, G. Actor-network theory and IS research: current status and future prospects. In A.S. Lee, J. Liebenau and J.I. DeGross, eds., Information Systems and Qualitative Research. Springer US, Boston, MA, 1997, 466--480.","paperID":"None"},{"content":"Wulf, W. The collaboratory opportunity. Science 261, 5123 (1993), 854--855.","paperID":"None"},{"content":"Yin, R.K. Case Study Research: Design and Methods. SAGE, 2009.","paperID":"None"},{"content":"Zimmerman, A. and Finholt, T.A. Growing an infrastructure. Proceedings of the 2007 international ACM conference on Conference on supporting group work - GROUP '07, ACM Press (2007), 239.","paperID":"None"},{"content":"Zimmerman, A. and Nardi, B.A. Whither or whether HCI. CHI '06 extended abstracts on Human factors in computing systems - CHI EA '06, ACM Press (2006), 1601.","paperID":"None"},{"content":"GENI» Meet the GENI Project Office (GPO). http://www.geni.net/?page_id=26.","paperID":"None"},{"content":"National Research Council. Committee on Metagenomics: Challenges and Functional Applications New science of metagenomics: Revealing the secrets of our microbial planet0. 2007.","paperID":"None"}],"title":"Creating Sustainable Cyberinfrastructures","filename":"CHI15/p1759","authors":["David P. Randall","E. Ilana Diamant","Charlotte P. Lee"],"conference":"CHI '15"}