{"paperId":2702603,"citation":[],"reference":[{"content":"Antifakos, S., Schwaninger, A., and Schiele, B. Evaluating the Effects of Displaying Uncertainty in Context-Aware Applications. UbiComp '04, (2004).","paperID":"None"},{"content":"Bellotti, V., Back, M., Edwards, W.K., Grinter, R.E., Henderson, A., and Lopes, C. Making sense of sensing systems: five questions for designers and researchers. CHI '02, 1 (2002), 415--422.","paperID":"None"},{"content":"Choe, E.K., Consolvo, S., Jung, J., Harrison, B., Patel, S.N., and Kientz, J. a. Investigating receptiveness to sensing and inference in the home using sensor proxies. UbiComp '12, (2012), 61.","paperID":"None"},{"content":"Consolvo, S., Chen, M.Y., Everitt, K., and Landay, J.A. Conducting in situ evaluations for and with ubiquitous computing technologies. Int J Hum-Comput Int 22, (2007), 103--118.","paperID":"None"},{"content":"Consolvo, S., McDonald, D.W., Toscos, T., et al. Activity sensing in the wild: a field trial of ubifit garden. CHI '08, (2008), 1797--1806.","paperID":"None"},{"content":"Davis, F.D. Perceived usefulness, perceived ease of use, and user acceptance of information technology. MIS quarterly 13, 3 (1989), 319--340.","paperID":"None"},{"content":"Froehlich, J., Larson, E., Campbell, T., Haggerty, C., Fogarty, J., and Patel, S.N. HydroSense: infrastructuremediated single-point sensing of whole-home water activity. Ubicomp '09, (2009).","paperID":"None"},{"content":"Gigerenzer, G. and Hoffrage, U. How to improve Bayesian reasoning without instruction: Frequency formats. Psychological Review 102, 4 (1995), 684--704.","paperID":"None"},{"content":"Gupta, S., Reynolds, M.S., and Patel, S.N. ElectriSense: single-point sensing using EMI for electrical event detection and classification in the home. Ubicomp '10, (2010), 139--148.","paperID":"None"},{"content":"Koleva, B., Anastasi, R.O.B., Greenhalgh, C., et al. Expected, sensed, and desired: A framework for designing sensing-based interaction. ACM Transactions on Computer-Human Interaction 12, 1 (2005), 3--30.","paperID":"None"},{"content":"Kruschke, J.K. Doing Bayesian Data Analysis. Elsevier Inc., 2011.","paperID":"None"},{"content":"Larson, E.C., Lee, T., Liu, S., Rosenfeld, M., and Patel, S.N. Accurate and privacy preserving cough sensing using a low-cost microphone. UbiComp '11, (2011).","paperID":"None"},{"content":"Li, X., Wang, Y.-Y., and Acero, A. Learning query intent from regularized click graphs. SIGIR '08, (2008), 339.","paperID":"None"},{"content":"Lim, B.Y. and Dey, A.K. Assessing Demand for Intelligibility in Context-Aware Applications. Ubicomp '09, (2009), 195--204.","paperID":"None"},{"content":"Lim, B.Y. and Dey, A.K. Investigating Intelligibility for Uncertain Context-Aware Applications. Ubicomp '11, (2011), 415--424.","paperID":"None"},{"content":"Or, C.K.L. and Karsh, B.-T. A systematic review of patient acceptance of consumer health information technology. JAMIA 16, 4, 550--60.","paperID":"None"},{"content":"Patel, S.N., Robertson, T., Kientz, J.A., Reynolds, M.S., and Abowd, G.D. At the Flick of a Switch: Detecting and Classifying Unique Electrical Events on the Residential Power Line. UbiComp '07, (2007).","paperID":"None"},{"content":"Pavlou, P. Consumer acceptance of electronic commerce: integrating trust and risk with the technology acceptance model. Int J Electron Comm 7, 3 (2003).","paperID":"None"},{"content":"Pentland, A. and Choudhury, T. Face recognition for smart environments. Computer, February (2000).","paperID":"None"},{"content":"Popescu, M. and Li, Y. An acoustic fall detector system that uses sound height information to reduce the false alarm rate. IEEE EMBS, (2008), 4628--4631.","paperID":"None"},{"content":"Powers, D.M.W. Evaluation: From precision, recall and F-measure to ROC, informedness, markedness & correlation. J of Mach Lear Tech 2, 1 (2011), 37--63.","paperID":"None"},{"content":"Van Rijsbergen, C.J. Evaluation. In Information Retrieval. Butterworth & Co., 1975, 95--132.","paperID":"None"},{"content":"Rogers, Y., Connelly, K., Tedesco, L., et al. Why it's worth the hassle: The value of in-situ studies when designing UbiComp. UbiComp '07, (2007), 336--353.","paperID":"None"},{"content":"Rukzio, E., Hamard, J., Noda, C., and Luca, A. De. Visualization of Uncertainty in Context Aware Mobile Applications. (2006), 247--250.","paperID":"None"},{"content":"Scholtz, J. and Consolvo, S. Toward a framework for evaluating ubiquitous computing applications. IEEE Pervasive Computing 3, 2 (2004), 82--88.","paperID":"None"},{"content":"Silver, N. The Weatherman Is Not a Moron. The New York Times, 2012. www.nytimes.com/2012/09/09/ magazine/the-weatherman-is-not-a-moron.html.","paperID":"None"},{"content":"Venkatesh, V. and Davis, F.D. A theoretical extension of the Technology Acceptance Model: Four longitudinal field studies. Manage Sci 46, 2 (2000), 186--204.","paperID":"None"},{"content":"Venkatesh, V., Morris, M.G., Davis, G.B., and Davis, F.D. User acceptance of information technology: Toward a unified view. MIS quarterly 27, 3 (2003), 425--478.","paperID":"None"},{"content":"Ward, A., Jones, A., and Hopper, A. A new location technique for the active office. IEEE Personal Communications, October (1997), 42--47.","paperID":"None"}],"abstract":"Many HCI and ubiquitous computing systems are characterized by two important properties: their output is uncertain-it has an associated accuracy that researchers attempt to optimize-and this uncertainty is user-facing-it directly affects the quality of the user experience. Novel classifiers are typically evaluated using measures like the F1 score-but given an F-score of (e.g.) 0.85, how do we know whether this performance is good enough? Is this level of uncertainty actually tolerable to users of the intended application-and do people weight precision and recall equally? We set out to develop a survey instrument that can systematically answer such questions. We introduce a new measure, acceptability of accuracy, and show how to predict it based on measures of classifier accuracy. Out tool allows us to systematically select an objective function to optimize during classifier evaluation, but can also offer new insights into how to design feedback for user-facing classification systems (e.g., by combining a seemingly-low-performing classifier with appropriate feedback to make a highly usable system). It also reveals potential issues with the ubiquitous F1-measure as applied to user-facing systems.","video":"http://www.youtube.com/embed/CD6_YkXh-8Q?rel=0","title":"How Good is 85%?: A Survey Tool to Connect Classifier Evaluation to Acceptability of Accuracy","filename":"CHI15/p347","authors":["Matthew Kay","Shwetak N. Patel","Julie A. Kientz"],"conference":"CHI '15"}