{"paperId":2702184,"citation":[],"reference":[{"content":"Bohus, D., and Rudnicky, A. I. Sorry, i didnt catch that! In Recent Trends in Discourse and Dialogue, no. 39 in Text, Speech and Language Technology. Springer Netherlands, 2008, 123--154.","paperID":"None"},{"content":"Combaz, A., Chumerin, N., Manyakov, N. V., Robben, A., Suykens, J. A. K., and Van Hulle, M. M. Towards the detection of error-related potentials and its integration in the context of a p300 speller braincomputer interface. Neurocomputing 80 (2012), 73--82.","paperID":"None"},{"content":"Ferrez, P. W., and Jos del R. Millan. Error-related EEG potentials generated during simulated brain computer interaction. IEEE Transactions on Biomedical Engineering 55, 3 (2008), 923--929.","paperID":"None"},{"content":"Frster, K., Biasiucci, A., Chavarriaga, R., Millan, J. d. R., Roggen, D., and Trster, G. On the use of brain decoded signals for online user adaptive gesture recognition systems. In Pervasive Computing, no. 6030 in Lecture Notes in Computer Science. Springer Berlin Heidelberg, 2010, 427--444.","paperID":"None"},{"content":"Groe, P. W., Holzapfel, H., and Waibel, A. Confidence based multimodal fusion for person identification. In Proceedings of the 16th International Conference on Multimedia (New York, USA, 2008).","paperID":"None"},{"content":"Iturrate, I., Chavarriaga, R., Montesano, L., Minguez, J., and Millan, J. d. R. Latency correction of error potentials between different experiments reduces calibration time for single-trial classification. Proceedings of Annual International Conference of the Engineering in Medicine and Biology Society. 2012 (2012), 3288--3291.","paperID":"None"},{"content":"Jameson, A. D. Understanding and dealing with usability side effects of intelligent processing. AI Magazine 30, 4 (2009), 23--40.","paperID":"None"},{"content":"Krusienski, D. J., Sellers, E. W., McFarland, D. J., Vaughan, T. M., and Wolpaw, J. R. Toward enhanced p300 speller performance. Journal of Neuroscience Methods 167, 1 (2008), 15--21.","paperID":"None"},{"content":"Llera, A., van Gerven, M. A. J., Gmez, V. M., Jensen, O. K., and Kappen, H. J. On the use of interaction error potentials for adaptive brain computer interfaces. Neural Networks 24, 10 (2011), 1120--1127.","paperID":"None"},{"content":"Marathe, A. R., Ries, A. J., and McDowell, K. A novel method for single-trial classification in the face of temporal variability. In Foundations of Augmented Cognition, no. 8027 in Lecture Notes in Computer Science. Springer Berlin Heidelberg, 2013, 345--352.","paperID":"None"},{"content":"Margaux, P., Emmanuel, M., Sbastien, D., Olivier, B., and Jrmie, M. Objective and subjective evaluation of online error correction during p300-based spelling. Adv. in Hum.-Comp. Int. 2012 (2012).","paperID":"None"},{"content":"Putze, F., Heger, D., and Schultz, T. Reliable subject-adapted recognition of EEG error potentials using limited calibration data. In 6th International Conference on Neural Engineering (San Diego, USA, 2013).","paperID":"None"},{"content":"Schmidt, N. M., Blankertz, B., and Treder, M. S. Online detection of error-related potentials boosts the performance of mental typewriters. BMC Neuroscience 13 (2012), 13--19.","paperID":"None"},{"content":"Scholl, P. M., van Laerhoven, K., Gordon, D., Scholz, M., and Berning, M. jNode: A sensor network platform that supports distributed inertial kinematic monitoring. In Proceedings of the Ninth International Conference on Networked Sensing Systems (2012).","paperID":"None"},{"content":"Spler, M., Bensch, M., Kleih, S., Rosenstiel, W., Bogdan, M., and Kbler, A. Online use of error-related potentials in healthy users and people with severe motor impairment increases performance of a p300-BCI. Clinical neurophysiology: official journal of the International Federation of Clinical Neurophysiology 123, 7 (2012), 1328--1337.","paperID":"None"},{"content":"Stoyanchev, S., Salletmayr, P., Yang, J., and Hirschberg, J. Localized detection of speech recognition errors. In Proceedings of the Spoken Language Technology Workshop (2012), 25--30.","paperID":"None"},{"content":"Vi, C., and Subramanian, S. Detecting error-related negativity for interaction design. In Proceedings of the Conference on Human Factors in Computing Systems (New York, USA, 2012).","paperID":"None"},{"content":"Vu, N. T., Kraus, F., and Schultz, T. Multilingual a-stabil: A new confidence score for multilingual unsupervised training. In Proceedings of the Spoken Language Technology Workshop (2010), 183--188.","paperID":"None"}],"abstract":"Any user interface which automatically interprets the user's input using natural modalities like gestures makes mistakes. System behavior depending on such mistakes will confuse the user and lead to an erroneous interaction flow. The automatic detection of error potentials in electroencephalographic data recorded from a user allows the system to detect such states of confusion and automatically bring the interaction back on track. In this work, we describe the design of such a self-correcting gesture interface, implement different strategies to deal with detected errors, use a simulation approach to analyze performance and costs of those strategies and execute a user study to evaluate user satisfaction. We show that self-correction significantly improves gesture recognition accuracy at lower costs and with higher acceptance than manual correction.","title":"Design and Evaluation of a Self-Correcting Gesture Interface based on Error Potentials from EEG","filename":"CHI15/p3375","authors":["Felix Putze","Christoph Amma","Tanja Schultz"],"conference":"CHI '15"}