{"paperId":2702151,"citation":[],"reference":[{"content":"Baker, P. and Potts, A. \"Why do white people have thin lips?\" Google and the perpetuation of stereotypes via auto-complete search forms. Critical Discourse Studies 10, 2 (2013), 187--204.","paperID":"None"},{"content":"Bem, S.L. Gender schema theory: a cognitive account of sex typing. Psychological Review 88, 4 (1981), 354--364.","paperID":"None"},{"content":"Beukeboom, C.J. Mechanisms of linguistic bias: How words reflect and maintain stereotypic expectancies. In: Laszlo, J., Forgas, J. and Vincze, O. (eds.), Social Cognition and Communication (pp. 313--330). New York, NY: Psychology Press, 2013.","paperID":"None"},{"content":"Geoffery C. Bowker , Susan Leigh Star, Sorting things out: classification and its consequences, MIT Press, Cambridge, MA, 2000","paperID":"380681"},{"content":"Sheryl Brahnam , Antonella De Angeli, Gender affordances of conversational agents, Interacting with Computers, v.24 n.3, p.139-153, May, 2012","paperID":"2318417"},{"content":"Brown, R.W. Linguistic determinism and the part of speech. The Journal of Abnormal and Social Psychology 55, 1 (1957), 1--5.","paperID":"None"},{"content":"Cohen, J. A coefficient of agreement for nominal scales. Education and Psychological Measurement 20, (1960), 37--46.","paperID":"None"},{"content":"Cohen, J. Statistical power analysis for the behavioral sciences. Erlbaum, Hillsdale NJ, 1988.","paperID":"None"},{"content":"Devine, P.G. and Elliot, A.J. Are racial stereotypes really fading? The Princeton trilogy revisited. Personality and Social Psychology Bulletin 21, 11 (1995), 1139--1150.","paperID":"None"},{"content":"Anhai Doan , Raghu Ramakrishnan , Alon Y. Halevy, Crowdsourcing systems on the World-Wide Web, Communications of the ACM, v.54 n.4, April 2011","paperID":"1924442"},{"content":"Eagly, A.H. Sex differences in social behavior: a socialrole interpretation. Erlbaum, Hillsdale, NJ, 1997.","paperID":"None"},{"content":"Fellbaum, C. WordNet and wordnets. In: Brown, K. et al. (eds.), Encyclopedia of Language and Linguistics, Second Edition, (pp. 665--670). Oxford: Elsevier, 2005.","paperID":"None"},{"content":"Fiedler, K. and Semin, G. On the causal information conveyed by different interpersonal verbs: the role of implicit sentence context. Social Cognition 6, 1 (1988), 21--39.","paperID":"None"},{"content":"Mary Flanagan , Daniel C. Howe , Helen Nissenbaum, Values at play: design tradeoffs in socially-oriented game design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 02-07, 2005, Portland, Oregon, USA","paperID":"1055076"},{"content":"Mary Flanagan , Helen Nissenbaum, A game design methodology to incorporate social activist themes, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240654"},{"content":"Garside, R., and Smith, N. A hybrid grammatical tagger: CLAWS4, in Garside, R., Leech, G., and McEnery, A. (eds.) Corpus Annotation: Linguistic Information from Computer Text Corpora. London: Longman (1997), 102--121.","paperID":"None"},{"content":"Riste Gligorov , Michiel Hildebrand , Jacco van Ossenbruggen , Guus Schreiber , Lora Aroyo, On the role of user-generated metadata in audio visual collections, Proceedings of the sixth international conference on Knowledge capture, June 26-29, 2011, Banff, Alberta, Canada","paperID":"1999702"},{"content":"Greenwald, A.G. and Banaji, M.R. Implicit social cognition: Attitudes, self-esteem and stereotypes. Psychological Review 102, 1 (1995), 4--27.","paperID":"None"},{"content":"Chien-Ju Ho , Tao-Hsuan Chang , Jong-Chuan Lee , Jane Yung-jen Hsu , Kuan-Ta Chen, KissKissBan: a competitive human computation game for image annotation, Proceedings of the ACM SIGKDD Workshop on Human Computation, June 28-28, 2009, Paris, France","paperID":"1600153"},{"content":"Jaccard, J., Becker, M.A., and Wood, B. Pairwise multiple comparison procedures: a review. Psychological Bulletin 96, 3 (1984), 589--596.","paperID":"None"},{"content":"J. Jeon , V. Lavrenko , R. Manmatha, Automatic image annotation and retrieval using cross-media relevance models, Proceedings of the 26th annual international ACM SIGIR conference on Research and development in informaion retrieval, July 28-August 01, 2003, Toronto, Canada","paperID":"860459"},{"content":"Maass, A., Salvi, D., Arcuri, L, and Semin, G. Language use in intergroup contexts: the Linguistic Intergroup Bias. Journal of Personality and Social Psychology 57, 6 (1989), 981--993.","paperID":"None"},{"content":"McGarty, C., Yzerbyt, V.Y. and Spears, R. Stereotypes as explanations: the formation of meaningful beliefs about social groups. Cambridge University Press, Cambridge, United Kingdom, 2002.","paperID":"None"},{"content":"Johan Oomen , Lora Aroyo, Crowdsourcing in the cultural heritage domain: opportunities and challenges, Proceedings of the 5th International Conference on Communities and Technologies, June 29-July 02, 2011, Brisbane, Australia","paperID":"2103373"},{"content":"Park, J.-R. Metadata quality in digital repositories: a survey of the current state of the art. Cataloging & Classification Quarterly 47, (2009), 213--228.","paperID":"None"},{"content":"Pennebaker, J.W., Booth, R.J and Francis, M.E. Linguistic Inquiry and Word Count (LIWC): A computerized text analysis program. LIWC.net, 2007.","paperID":"None"},{"content":"Prentice, D.A. and Carranza. What women and men should be, shouldn't be, are allowed to be and don't have to be: the contents of prescriptive gender stereotypes. Psychology of Women Quarterly 26, (2002), 269--281.","paperID":"None"},{"content":"Rittman, R., Wacholder, N., Kantor, P., Ng, K.B., Strzalkowski, T., and Sun, Y. Adjectives and indicators of subjectivity in documents. In Proc. 67th ASIS&T Annual Meeting vol. 41 (2004), 349--359.","paperID":"None"},{"content":"Stephen Robertson , Milan Vojnovic , Ingmar Weber, Rethinking the ESP game, CHI '09 Extended Abstracts on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1520597"},{"content":"Rubin, M., Paolini, S. and Crisp, R. Linguistic description moderates the evaluations of counterstereotypical people. Social Psychology 44, (2013), 289--298.","paperID":"None"},{"content":"Smith, E.R. and Semin, G.R. Situated social cognition. Current Directions in Psychological Science 16, 3 (2007), 132--135.","paperID":"None"},{"content":"Tausczik, Y.R. and Pennebaker, J. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of Language and Social Psychology 29, 1 (2010), 24--54.","paperID":"None"},{"content":"ter Doest, L., Semin, G.R. and Sherman, S.J. Linguistic context and social perception: Does stimulus abstraction moderate processing style? Journal of Language and Social Psychology 31, 3 (2002), 195--229.","paperID":"None"},{"content":"Thogersen, R. Data quality in an output-agreement game: A comparison between game-generated tags and professional descriptors. Collaboration and Technology, Lecture Notes in Computer Science 8224, (2013), 126142.","paperID":"None"},{"content":"Luis von Ahn, Games with a Purpose, Computer, v.39 n.6, p.92-94, June 2006","paperID":"1155342"},{"content":"Luis von Ahn , Laura Dabbish, Labeling images with a computer game, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, p.319-326, April 24-29, 2004, Vienna, Austria","paperID":"985733"},{"content":"Wajcman, J. Feminist theories of technology. Cambridge Journal of Economics (2009), 1--10.","paperID":"None"},{"content":"Sigboldus, D.H.J., Spears, R. and Semin, G.R. When do we communicate stereotypes? Influence of the social context on the Linguistic Expectancy Bias. Group Processes & Intergroup Relations 8, 3 (2005), 215--230.","paperID":"None"},{"content":"Theresa Wilson , Janyce Wiebe , Paul Hoffmann, Recognizing contextual polarity in phrase-level sentiment analysis, Proceedings of the conference on Human Language Technology and Empirical Methods in Natural Language Processing, p.347-354, October 06-08, 2005, Vancouver, British Columbia, Canada","paperID":"1220619"},{"content":"Winkielman, P., Halberstadt, J., Fazendeiro, T. and Catty, S. Prototypes are attractive because they are easy on the mind. Psychological Science 17, 9 (2006), 799806.","paperID":"None"}],"abstract":"Games with a Purpose (GWAP) is a popular approach for metadata creation, enabling institutions to collect descriptions of digital artifacts on a mass scale. Creating metadata is challenging not only because one must recognize the artifact; the description must then be encoded into natural language. Language behaviors are influenced by many social factors, particularly when we are asked to describe other people. We consider labels for images of people generated via the ESP Game. While ESP has been shown to produce relevant labels, critics claim they are obvious and stereotypical. Based on theories of linguistic biases, we examine whether there are systematic differences in the ways players describe images of men versus women. Our first analysis considers images of people generally, and reveals a tendency for women to be described with subjective adjectives. A second analysis compares images depicting men and women within each of six occupational roles. Images of women receive more labels related to appearance, whereas those depicting men receive more occupation-related labels. Our work exposes the presence of gender-based stereotypes through linguistic biases, illustrates the forms in which they manifest, and raises important implications for those who design systems or train algorithms using data produced via GWAP.","title":"Crowdsourcing Stereotypes: Linguistic Bias in Metadata Generated via GWAP","filename":"CHI15/p1955","authors":["Jahna Otterbacher"],"conference":"CHI '15"}