{"paperId":2702138,"citation":[],"reference":[{"content":"Bailly, G., Lecolinet, E., and Guiard, Y. Finger-count & radial-stroke shortcuts: 2 techniques for augmenting linear menus on multi-touch surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI'10, ACM (New York, NY, USA, 2010), 591--594.","paperID":"None"},{"content":"Bailly, G., Walter, R., Müller, J., Ning, T., and Lecolinet, E. Comparing free hand menu techniques for distant displays using linear, marking and finger-count menus. In Human-Computer Interaction INTERACT 2011, vol. 6947 of LNCS. Springer Berlin Heidelberg, 2011, 248--262.","paperID":"None"},{"content":"Barfield, W., Hendrix, C., and Bystrom, K.-E. Effects of stereopsis and head tracking on performance using desktop virtual environment displays. Presence: Teleoper. Virtual Environ. 8, 2 (Apr 1999), 237--240.","paperID":"None"},{"content":"Bowman, D. A., Kruijff, E., LaViola Jr, J. J., and Poupyrev, I. 3D User Interfaces: Theory and Practice. Addison-Wesley, 2004.","paperID":"None"},{"content":"Fisher, R. A. The design of experiments. Oxford, England: Oliver & Boyd, 1935.","paperID":"None"},{"content":"Fujimoto, M., and Ishibashi, Y. The effect of stereoscopic viewing of a virtual space on a networked game using haptic media. In Proceedings of the ACM SIGCHI international Conference on Advances in Computer Entertainment, ACM (New York, NY, 2005), 317--320.","paperID":"None"},{"content":"Holm, S. A simple sequentially rejective multiple test procedure. Scandinavian Journal of Statistics 6, 2 (1979), 65--70.","paperID":"None"},{"content":"Howarth, P. A. Potential hazards of viewing 3D stereoscopic television, cinema and computer games: a review. Ophthalmic & Physiological Optics : The Journal of the British College of Ophthalmic Opticians (Optometrists) 31, 2 (2011), 111--122.","paperID":"None"},{"content":"Kulshreshth, A., and LaViola, Jr., J. J. Exploring the usefulness of finger-based 3d gesture menu selection. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '14, ACM (New York, NY, USA, 2014), 1093--1102.","paperID":"None"},{"content":"Kulshreshth, A., and LaViola Jr., J. J. Evaluating performance benefits of head tracking in modern video games. In Proceedings of the 1st symposium on Spatial user interaction, SUI '13, ACM (New York, NY, USA, 2013), 55--60.","paperID":"None"},{"content":"Kulshreshth, A., Schild, J., and LaViola Jr., J. J. Evaluating user performance in 3D stereo and motion enabled video games. In Proceedings of the International Conference on the Foundations of Digital Games, ACM (New York, NY, 2012), 33--40.","paperID":"None"},{"content":"LaViola, J. J., Forsberg, A. S., Huffman, J., and Bragdon, A. The influence of head tracking and stereo on user performance with non-isomorphic 3d rotation. In Proceedings of the 14th Eurographics Conference on Virtual Environments, EGVE'08, Eurographics Association (Aire-la-Ville, Switzerland, Switzerland, 2008), 111--118.","paperID":"None"},{"content":"Litwiller, T., and LaViola Jr., J. J. Evaluating the benefits of 3D stereo in modern video games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI'11, ACM (New York, NY, USA, 2011), 2345--2354.","paperID":"None"},{"content":"McMahan, R. P., Bowman, D. A., Zielinski, D. J., and Brady, R. B. Evaluating display fidelity and interaction fidelity in a virtual reality game. IEEE Transactions on Visualization and Computer Graphics 18, 4 (Apr. 2012), 626--633.","paperID":"None"},{"content":"Ragan, E. D., Kopper, R., Schuchardt, P., and Bowman, D. A. Studying the effects of stereo, head tracking, and field of regard on a small-scale spatial judgment task. IEEE Transactions on Visualization and Computer Graphics 19, 5 (2013), 886--896.","paperID":"None"},{"content":"Rajae-Joordens, R. J. Measuring experiences in gaming and tv applications. In Probing Experience, vol. 8 of Philips Re. Springer Netherlands, 2008, 77--90.","paperID":"None"},{"content":"Schild, J., Bölicke, L., LaViola Jr., J. J., and Masuch, M. Creating and analyzing stereoscopic 3D graphical user interfaces in digital games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (New York, NY, USA, 2013), 169--178.","paperID":"None"},{"content":"Schild, J., LaViola, Jr., J. J., and Masuch, M. Altering gameplay behavior using stereoscopic 3d vision-based video game design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '14, ACM (New York, NY, USA, 2014), 207--216.","paperID":"None"},{"content":"Schild, J., LaViola Jr., J. J., and Masuch, M. Understanding user experience in stereoscopic 3D games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '12, ACM (New York, NY, USA, 2012), 89--98.","paperID":"None"},{"content":"Schild, J., and Masuch, M. Fundamentals of stereoscopic 3D game design. In ICEC, International Federation For Information Processing (2011), 155--160.","paperID":"None"},{"content":"Sko, T., and Gardner, H. Head tracking in first-person games: Interaction using a web-camera. In Human-Computer Interaction - INTERACT 2009, vol. 5726 of Lecture Notes in Computer Science. Springer Berlin / Heidelberg, 2009, 342--355.","paperID":"None"},{"content":"Sko, T., Gardner, H., and Martin, M. Studying a head tracking technique for first-person-shooter games in a home setting. In Human-Computer Interaction INTERACT 2013, vol. 8120 of Lecture Notes in Computer Science. Springer Berlin Heidelberg, 2013, 246--263.","paperID":"None"},{"content":"Terlecki, M., and Newcombe, N. How important is the digital divide? the relation of computer and videogame usage gender differences in mental rotation ability. Sex Roles 53 (2005), 433--441.","paperID":"None"},{"content":"Wang, S., Xiong, X., Xu, Y., Wang, C., Zhang, W., Dai, X., and Zhang, D. Face-tracking as an augmented input in video games: enhancing presence, role-playing and control. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '06, ACM (New York, NY, USA, 2006), 1097--1106.","paperID":"None"},{"content":"Ware, C. Dynamic stereo displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '95, ACM Press/Addison-Wesley Publishing Co. (New York, NY, USA, 1995), 310--316.","paperID":"None"},{"content":"Yim, J., Qiu, E., and Graham, T. C. N. Experience in the design and development of a game based on head-tracking input. In Proceedings of the 2008 Conference on Future Play: Research, Play, Share, Future Play '08, ACM (New York, NY, USA, 2008), 236--239.","paperID":"None"},{"content":"You, J., Jiang, G., Xing, L., and Perkis, A. Quality of visual experience for 3D presentation - stereoscopic image. In High-Quality Visual Experience, M. Mrak, M. Grgic, and M. Kunt, Eds., Signals and Communication Technology. Springer Berlin Heidelberg, 2010, 51--77.","paperID":"None"}],"abstract":"We present the results of a comprehensive video game study which explores how the gaming experience is effected when several 3D user interface technologies are used simultaneously. We custom designed an air-combat game integrating several 3DUI technologies (stereoscopic 3D, head tracking, and finger-count gestures) and studied the combined effect of these technologies on the gaming experience. Our game design was based on existing design principles for optimizing the usage of these technologies in isolation. Additionally, to enhance depth perception and minimize visual discomfort, the game dynamically optimizes stereoscopic 3D parameters (convergence and separation) based on the user's look direction. We conducted a within subjects experiment where we examined performance data and self-reported data on users perception of the game. Our results indicate that participants performed significantly better when all the 3DUI technologies (stereoscopic 3D, head-tracking and finger-count gestures) were available simultaneously with head tracking as a dominant factor. We explore the individual contribution of each of these technologies to the overall gaming experience and discuss the reasons behind our findings.","title":"Exploring 3D User Interface Technologies for Improving the Gaming Experience","filename":"CHI15/p125","authors":["Arun Kulshreshth","Joseph J. LaViola, Jr."],"conference":"CHI '15"}