{"paperId":2702257,"citation":[],"reference":[{"content":"Adams B., Venkatesh, S., & Jain, R. 2005. IMCE: Integrated media creation environment. ACM Trans. Multimedia Comput. Commun. Appl, 1(3):211--247, 2005 (August).","paperID":"None"},{"content":"Arev, I., Park, H. S., Sheikh, Y., Hodgins, J., & Shamir, A. Automatic Editing of Footage from Multiple Social Cameras. ACM Transactions on Graphics (SIGGRAPH), ACM, New York, 2014.","paperID":"None"},{"content":"Baker, C. D. Knowing things and saying things: How a natural world in discursively fabricated on a documentary film set. Journal of Pragmatics, Volume 13, Issue 3, June 1989, pp. 381--393.","paperID":"None"},{"content":"Bao, X. & Choudhury, R. R. MoVi: mobile phone based video highlights via collaborative sensing. In Proc. MobiSys '10, pp. 357--370, 2010.","paperID":"None"},{"content":"Bernstein, M. S., Brandt, J., Miller, R. C., & Karger, D. R. Crowds in two seconds: enabling realtime crowdpowered interfaces. In Proc. UIST '11, pp. 33--42, 2011.","paperID":"None"},{"content":"Benford, S., Greenhalgh, C., Crabtree, A., Flintham, M., Walker, B., Marshall, J., Koleva, B., Egglestone, S. R., Giannachi, G., Adams, M., Tandavanitj, N. et al, Performance-led research in the wild. ACM Trans. Comput.-Hum. Interact. 20(3), Article 14, July 2013.","paperID":"None"},{"content":"Broth, M. The Production of a Live TV-interview through Mediated Interaction. In: C. van Dijkum, J. Blasius, H. Kleijer & B. van Hilten (eds.), Recent Developments and Applications in Social Research Methodology, Proc. of the Sixth International Conference on Logic and Methodology, 2004.","paperID":"None"},{"content":"Broth, M., Laurier, E. & Mondada, L. (eds.) Studies of Video Practices: Video at Work, Routledge, 2014.","paperID":"None"},{"content":"Dezfuli, N., Huber, J., Olberding, S., & Mühlhäuser, M. CoStream: in-situ co-construction of shared experiences through mobile video sharing during live events. In Ex. Abs. of CHI '12, pp. 2477--2482, 2012.","paperID":"None"},{"content":"Engström, A., Juhlin, O., Perry, M. & Broth, M. Temporal hybridity: Mixing live video footage with instant replay in real time. In Proc. CHI '10, pp. 1495--1504, 2010.","paperID":"None"},{"content":"Engström, A., Perry, M., & Juhlin, O. Amateur vision and recreational orientation: Creating live video together. In Proc. CSCW '12, pp. 651--660, 2012.","paperID":"None"},{"content":"Flintham, M., Benford, S., Anastasi, R., Hemmings, T., Crabtree, A., Greenhalgh, C., Tandavanitj, N., Adams, M., and Row-Farr, J. Where on-line meets on the streets: experiences with mobile mixed reality games. In Proc CHI '03, pp. 569--576, 2003.","paperID":"None"},{"content":"Garfinkel, H. Studies in Ethnomethodology. Prentice Hall, 1967.","paperID":"None"},{"content":"Goffman, E. Forms of Talk, Philadelphia: University of Pennsylvania Press, 1981.","paperID":"None"},{"content":"Higuchi K., Rekimoto, J. Flying head: a head motion synchronization mechanism for unmanned aerial vehicle control. CHI '13 EA, pp. 2029--2038, 2013.","paperID":"None"},{"content":"Juhlin, O., Engström, A., & Reponen, E. Mobile broadcasting: The whats and hows of live video as a social medium. In Proc. MobileHCI '10, pp. 35--44, 2010.","paperID":"None"},{"content":"Kirk, D. S., Sellen, A., Harper, R. & Wood, K. Understanding Videowork. In Proc. CHI '07, pp. 61--70, 2007.","paperID":"None"},{"content":"Licoppe, C. & Morel, J. Mundane Video Directors in Interaction: Showing One's Environment in Skype and Mobile Video Calls. In Broth, M., Laurier, E. and Mondada, L. (eds.), Studies of Video Practices: Video at Work, Routledge, 2014.","paperID":"None"},{"content":"Macbeth, D. H. Glances, trances and their relevance for a visual sociology. In Jalbert, P. L. (ed.), Media Studies: Ethnomethodological Approaches, pp. 135--170, University Press of America, 1999.","paperID":"None"},{"content":"Mughal, M. A., & Juhlin, O. Context-dependent software solutions to handle video synchronization and delay in collaborative live mobile video production. Personal and Ubiquitous Computing, 18(3):709--721, Springer, 2014.","paperID":"None"},{"content":"Mueller, F., Edge, D., Vetere, F., Gibbs, M., Agamanolis, S., Bongers, B. & Sheridan, J. Designing sports: a framework for exertion games. In Proc. CHI '11, pp. 2651--2660, 2011.","paperID":"None"},{"content":"Palen, L, Salzman, M. & Youngs, E. Going Wireless: Behavior and Practice of New Mobile Phone Users. In Proc. CSCW '00, pp. 201--210, 2000.","paperID":"None"},{"content":"Perry, M., Juhlin, O., Esbjörnsson, M., & Engström, A. Lean collaboration through video gestures: coordinating the production of live televised sport. In Proc. CHI '09, pp. 2279--2288.","paperID":"None"},{"content":"de Sá, M., Shamma, D. A., & Churchill, E. F. Live mobile collaboration for video production: design, guidelines, and requirements. Personal and Ubiquitous Computing, 18(3):693--707, Springer, 2014.","paperID":"None"},{"content":"Vihavainen, S., Mate, S., Seppälä, L., Cricri, F., & Curcio, I. We want more: human-computer collaboration in mobile social video remixing of music concerts. In Proc. CHI '11, pp. 287--296, 2011.","paperID":"None"},{"content":"Weilenmann, A., Säljö, R., & Engström, A. Mobile video literacy: Negotiating the use of a new visual technology. Personal and Ubiquitous Computing, 18(3):737--752, Springer 2014.","paperID":"None"}],"abstract":"We present a study of a mixed reality game called 'I'd Hide You' that involves live video streaming from the city streets. We chart the significant challenges facing performers on the streets who must simultaneously engage in the game, stream compelling video footage featuring themselves, and interact with a remote online audience. We reveal how these street performers manage four key tensions: between their body and camera; between the demands of online audiences and what takes place on-the-street; between what appears 'frontstage' on camera versus what happens 'backstage'; and balancing being a player of the game with being a performer. By reflecting on how they achieve this, we are able to draw out wider lessons for future interfaces aimed at supporting people broadcasting video of themselves to online audiences while engaged in games, sports and other demanding real-world activities.","title":"I'd Hide You: Performing Live Broadcasting in Public","filename":"CHI15/p2573","authors":["Stuart Reeves","Christian Greiffenhagen","Martin Flintham","Steve Benford","Matt Adams","Ju Row Farr","Nicholas Tandavantij"],"conference":"CHI '15"}