{"paperId":2702298,"citation":[{"content":"Claus Bossen , Kathleen Pine , Gunnar Elllingsen , Federico Cabitza, Data-work in Healthcare: The New Work Ecologies of Healthcare Infrastructures, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2855505"}],"reference":[{"content":"Agre, P.E. (1994) Surveillance and capture: two models of privacy.? The Information Society, 10, 101--127.","paperID":"None"},{"content":"Philip E. Agre, Accountability and discipline: a comment on Suchman and Winograd, Computer Supported Cooperative Work, v.3 n.1, p.31-35, 1994/1995","paperID":"208545"},{"content":"Barocas, S., Hood, S., & Ziewitz, M. (2013). Governing algorithms: a provocation piece. SSRN Electronic Journal.","paperID":"None"},{"content":"Bjørn, P., & Balka, E. (2007). Health Care Categories Have Politics Too: Unpacking the Managerial Agendas of Electronic Triage Systems. ECSCW '07.","paperID":"None"},{"content":"Bowker, G.C. (2000). \"Biodiversity Datadiversity.\" Social Studies of Science, 30, 643--683.","paperID":"None"},{"content":"Bowker, G.C. (2008). Memory Practices in the Sciences. Cambridge: The MIT Press.","paperID":"None"},{"content":"Geoffery C. Bowker , Susan Leigh Star, Sorting things out: classification and its consequences, MIT Press, Cambridge, MA, 2000","paperID":"380681"},{"content":"Boyd, D., & Crawford, C. (2012). Critical questions for big data. Information, Communication & Society 15 (5), 662--79.","paperID":"None"},{"content":"Callaghan, W.M., Creanga, A.A., & Kuklina, E.V. (2012). Severe maternal morbidity among delivery and postpartum hospitalizations in the USA. Obstetrics and Gynecology, 120(5), 1029--36.","paperID":"None"},{"content":"Callon, M. (2007). What does it mean to say economics is performative? In MacKenzie, D. A., Muniesa, F., & Siu, L. (Eds.). Do economists make markets?: on the performativity of economics. Princeton: Princeton University Press.","paperID":"None"},{"content":"Callon, M., & Law, J. (2005). \"On Qualculation, Agency, and Otherness.\" Environment and Planning D: Society and Space 23(5), 717--33.","paperID":"None"},{"content":"Canguilhem, Georges. (1991). The Normal and the Pathological. Cambridge: MIT Press.","paperID":"None"},{"content":"Cardon, D. (2013). Présentation. Dossier Politique Des Algorithmes, Réseaux 177(1), 9--21.","paperID":"None"},{"content":"Centers for Disease Control. Severe Maternal Morbidity in the USA - Maternal and Infant Health Reproductive Health. Accessed September 19, 2014. http://www.cdc.gov/reproductivehealth/MaternalInfantH ealth/SevereMaternalMorbidity.html.","paperID":"None"},{"content":"Deneux-Tharaux, C., Carmona, E., Bouvier-Colle, M.E., & Bréart, G. (2006). Postpartum Maternal Mortality and Cesarean Delivery. Obstetrics and Gynecology 108(3), 541--48.","paperID":"None"},{"content":"Dourish, P. (In Press). \"NoSQL: the shifting materialities of database technology.\" Computational Culture.","paperID":"None"},{"content":"Desrosières, A. (2002). The Politics of Large Numbers: A History of Statistical Reasoning. Cambridge: Harvard University Press.","paperID":"None"},{"content":"Douglas, M. (1986). How Institutions Think. Syracuse: Syracuse University Press, 1986.","paperID":"None"},{"content":"Foucault, M. Power/Knowledge: Selected Interviews and Other Writings, 1972--1977. 1st American Ed edition. New York: Vintage, 1980.","paperID":"None"},{"content":"Frankland, E. (1880). Water Analysis for Sanitary Purposes. N.p.","paperID":"None"},{"content":"Frankland, E. (1877). Experimental Researches in Pure, Applied and Physical Chemistry. J. Van Voorst.","paperID":"None"},{"content":"Frankland, E., and Royal Institution of Great Britain. (1867). On the Water Supply of the Metropolis. N.p.","paperID":"None"},{"content":"Gaskin, I.M. (2008). Maternal death in the USA: a problem solved or a problem ignored? The Journal of Perinatal Education 17(2), 9--13.","paperID":"None"},{"content":"Gitelman, L. (2013). Raw Data Is an Oxymoron. Boston: MIT Press.","paperID":"None"},{"content":"Hacking, I. (1990). The Taming of Chance. 1st edition. Cambridge England?; New York: Cambridge University Press.","paperID":"None"},{"content":"Hacking, I. (1991). The making and molding of child abuse. Critical Inquiry, 253--288.","paperID":"None"},{"content":"Hacking, I. (1999). The Social Construction of What? Cambridge: Harvard University Press.","paperID":"None"},{"content":"Hamlin, C. (1990) Edward Frankland: The Analyst as Activist. Berkeley: University of California Press.","paperID":"None"},{"content":"Hamlin, C. (1990). A Science of Impurity: Water Analysis in Nineteenth Century Britain. Berkeley: University of California Press.","paperID":"None"},{"content":"Haraway, D.J. (1989). Primate Visions: Gender, Race, and Nature in the World of Modern Science. Psychology Press.","paperID":"None"},{"content":"Lilly Irani , Janet Vertesi , Paul Dourish , Kavita Philip , Rebecca E. Grinter, Postcolonial computing: a lens on design and development, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753522"},{"content":"Irwin, S., & Jordan, B. (1987). Knowledge, practice, and power: court-ordered cesarean sections. Medical Anthropology Quarterly 1(3), 319--34.","paperID":"None"},{"content":"Helena Karasti , Karen S. Baker , Eija Halkola, Enriching the Notion of Data Curation in E-Science: Data Managing and Information Infrastructuring in the Long Term Ecological Research (LTER) Network, Computer Supported Cooperative Work, v.15 n.4, p.321-358, August    2006","paperID":"1166839"},{"content":"Kleinman, D.L. & Suryanarayanan, S. (2013). Dying bees and the social production of ignorance. Science, Technology & Human Values 38(4), 492--517.","paperID":"None"},{"content":"Kuklina, E.V., Whiteman, M.K., Hillis, S.D., Jamieson, D.J., Meikle, S.F., Posner, S.F., & Marchbanks, P.A. (2008). An enhanced method for identifying obstetric deliveries: implications for estimating maternal morbidity. Maternal and Child Health Journal 12(4), 469--77.","paperID":"None"},{"content":"Larrick, R.P., & Soll, J.B. (2008). The MPG illusion. Science, 320, 1593--1594.","paperID":"None"},{"content":"Liboiron, M. (2012). Terrible and charismatic waste. Peabody Museum of Archaeology & Ethnology.","paperID":"None"},{"content":"Liboiron, M. (2013). Plasticizers: a twenty-first-century miasma. In Accumulation: The Material Politics of Plastic, 2013.","paperID":"None"},{"content":"Liboiron, M. (2015). Disaster data, data activism: grassroots Responses to Representing Hurricane Sandy, in Extreme Weather and Global Media, Eds. Julia Leyda and Diane Negra, Routledge.","paperID":"None"},{"content":"MacKenzie, D. (2006). Is economics performative? Option theory and the construction of derivatives markets. Journal of the History of Economic Thought, 28(1), 29--55.","paperID":"None"},{"content":"Morrison, M. (2009). Models, measurement and computer simulation: the changing face of experimentation. Philosophical Studies 143, 33--57.","paperID":"None"},{"content":"Moser, I., & Law, J. (2006). Fluids or flows? Information and qualculation in medical practice. Information Technology & People, 19(1), 55--73.","paperID":"None"},{"content":"Mudry, J.J. (2009). Measured Meals: Nutrition in America. SUNY Press.","paperID":"None"},{"content":"Nagel, E. (1931). On the Logic of Measurement. Thesis (PH.D.) Columbia University, Source: American Doctoral Dissertations,.","paperID":"None"},{"content":"Orlikowski, W. J., & Scott, S. V. (2013). Knowledge eclipse: producing sociomaterial reconfigurations in the hospitality sector. In: Tsoukas, H., Nicolini, D. and Carlisle, P., (eds.) How Matter Matters: Objects, Artifacts, and Materiality in Organization Studies. Oxford: Oxford University Press.","paperID":"None"},{"content":"Pasquale, F. (2013). The emperor's new codes: reputation and search algorithms in the finance sector. Governing Algorithms Conference, May 16, 2013.","paperID":"None"},{"content":"Katie Pine, Fragmentation and choreography: caring for a patient and a chart during childbirth, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145336"},{"content":"Kathleen H. Pine , Melissa Mazmanian, Institutional logics of the EMR and the problem of 'perfect' but inaccurate accounts, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531652"},{"content":"Pine, K.H., Wolf, C.T., & Mazmanian, M.. The Work of Re-use: Quality Measurement in Healthcare Organizations. CSCW '14 Workshop: Sharing, Re-Use and Circulation of Resources in Cooperative Scientific Work.","paperID":"None"},{"content":"Potts, J. (2009). A history of charisma. Basingstoke, UK: Palgrave Macmillan.","paperID":"None"},{"content":"Porter, T.M. (1996). Trust in Numbers: The Pursuit of Objectivity in Science and Public Life. Princeton: Princeton University Press.","paperID":"None"},{"content":"Proctor, R., & Schiebinger, L.L. (2008). Agnotology: The Making and Unmaking of Ignorance. Palo Alto: Stanford University Press.","paperID":"None"},{"content":"Ribes, D., & Jackson, S.J. (2013). Data bite man: the work of sustaining a long-term study. In \"Raw Data\" Is an Oxymoron, 147--66. Cambridge: MIT Press.","paperID":"None"},{"content":"Richards, T. (1993). The Imperial Archive: Knowledge and the Fantasy of Empire. Verso.","paperID":"None"},{"content":"Rittel, H.W.J., & Webber, M.M. (1973). Dilemmas in a general theory of planning. Policy Sciences, 4, 155--69.","paperID":"None"},{"content":"Robertson, M. (2012). Measurement and alienation: making a world of ecosystem services. Transactions of the Institute of British Geographers 37, 386--401.","paperID":"None"},{"content":"Scott, J.C. (1998). Seeing Like a State: How Certain Schemes to Improve the Human Condition Have Failed. Yale University Press.","paperID":"None"},{"content":"Scott, J. (1994). Power: Critical Concepts. Taylor & Francis.","paperID":"None"},{"content":"Smolan, R. (2012). The Human Face of Big Data. Sausalito: Against All Odds Productions.","paperID":"None"},{"content":"Steiner, C., & Dixon, W. (2012). Automate This: How Algorithms Came to Rule Our World. New York: Portfolio/Penguin.","paperID":"None"},{"content":"Suchman, Lucy. (1993). \"Do Categories Have Politics\"? Computer Supported Cooperative Work, 2(3), 177--190.","paperID":"None"},{"content":"Thrift, N. (2004). Movement-Space: the changing domain of thinking resulting from the development. Economy and Society 33(4), 582--604.","paperID":"None"},{"content":"\"A Healthy Nation Timeline.\" UK National Archives, n.d. http://www.nationalarchives.gov.uk/education/victorian britain/healthy/timeline2.htm.","paperID":"None"},{"content":"Vertesi, J. (2011). Transnational, never neutral: regulatory politics and the deployment of technological systems, workshop paper for Transnational HCI workshop at CHI 2011, Vancouver, BC, Canada.","paperID":"None"},{"content":"Winner, L. (1986): 'Do Artifacts have Politics?' In L. Winner (ed.): The Whale and The Reactor: A Search for Limites in an age of High Technology, University of Chicaga Press, Chicago, 1986, pp. 28--40.","paperID":"None"},{"content":"World Health Organization. Maternal Mortality Accessed September 19, 2014. http://www.who.int/mediacentre/factsheets/fs348/en/..","paperID":"None"}],"abstract":"Contemporary decisions about the management of populations, public services, security, and the environment are increasingly made through knowledge gleaned from \"big data\" and its attendant infrastructures and algorithms. Though often described as \"raw,\" this data is produced by techniques of measurement that are imbued with judgments and values that dictate what is counted and what is not, what is considered the best unit of measurement, and how different things are grouped together and \"made\" into a measureable entity. In this paper, we analyze these politics of measurement and how they relate to action through two case studies involving high stake public health measurements where experts intentionally leverage measurement to change definitions of harm and health. That is, they use measurement for activism. The case studies offer a framework for thinking about of how the politics of measurement are present in user interfaces. It is usually assumed that the human element has been scrubbed from the database and that significant political and subjective interventions come from the analysis or use of data after the fact. Instead, we argue that human-computer interactions start before the data reaches the computer because various measurement interfaces are the invisible premise of data and databases, and these measurements are political.","title":"The Politics of Measurement and Action","filename":"CHI15/p3147","authors":["Kathleen H. Pine","Max Liboiron"],"conference":"CHI '15"}