{"paperId":2702472,"reference":[{"content":"Airdog. http://www.airdog.com/.","paperID":"None"},{"content":"Drone flying takes off as a popular hobby. http://www.theage.com.au/digital-life/digital-lifenews/drone-flying-takes-off-as-a-popular-hobby20140709-zst12.html.","paperID":"None"},{"content":"Sensoria Fitness. http://www.sensoriafitness.com/.","paperID":"None"},{"content":"U-M researcher honored for MABEL, the jogging robot. http://ns.umich.edu/new/multimedia/videos/20819-u-mresearcher-honored-for-mabel-the-jogging-robot.","paperID":"None"},{"content":"Baca, A. and Kornfeind, P. Rapid feedback systems for elite sports training. Pervasive Computing, IEEE, 5 (4). (2006), 70--76.","paperID":"None"},{"content":"Breazeal, C. Toward sociable robots. Robotics and autonomous systems, 42 (3). (2003), 167--175.","paperID":"None"},{"content":"Cohen, E.E.A., Ejsmond-Frey, R., Knight, N. and Dunbar, R.I.M. Rowers' high: behavioural synchrony is correlated with elevated pain thresholds. Biology Letters, 6 (1). (2010), 106.","paperID":"None"},{"content":"Csikszentmihalyi, M. Flow: The psychology of optimal performance. New York: Harper and Row, 1990.","paperID":"None"},{"content":"Curmi, F., Ferrario, M.A. and Whittle, J. BioShare: a research tool for analyzing social networks effects when sharing biometric data. In Companion Proc. DIS 2014, ACM Press (2014), 101--104.","paperID":"None"},{"content":"Dourish, P. Where the Action Is: The Foundations of Embodied Interaction. Boston, USA: MIT Press, 2001.","paperID":"None"},{"content":"Eresha, G., Haring, M., Endrass, B., Andre, E. and Obaid, M. Investigating the influence of culture on proxemic behaviors for humanoid robots. In RO-MAN, 2013 IEEE, (2013), IEEE, 430--435.","paperID":"None"},{"content":"Fong, T., Nourbakhsh, I. and Dautenhahn, K. A survey of socially interactive robots. Robotics and autonomous systems, 42 (3). (2003), 143--166.","paperID":"None"},{"content":"Gaver, W. What should we expect from research through design? In Proc. CHI 2012, ACM Press, 937--946.","paperID":"None"},{"content":"Graether, E. and Mueller, F. Joggobot: a flying robot as jogging companion. In Proc. CHI 2012 Extended Abstracts, ACM Press (2012), 1063--1066.","paperID":"None"},{"content":"Greenberg, S., Marquardt, N., Ballendat, T., DiazMarino, R. and Wang, M. Proxemic interactions: the new ubicomp? ACM Interactions, 18 (1). (2011), 42--50.","paperID":"None"},{"content":"Higuchi, K., Shimada, T. and Rekimoto, J., Flying sports assistant: external visual imagery representation for sports training. In Proc. Augmented Human 2011, ACM Press (2011), 1--4.","paperID":"None"},{"content":"Hoffman, G. and Ju, W. Designing Robots With Movement in Mind. Journal of Human-Robot Interaction, 3 (1). (2014), 89--122.","paperID":"None"},{"content":"Hornecker, E. and Buur, J. Getting a grip on tangible interaction: a framework on physical space and social interaction. In Proc. CHI 2006, ACM Press, 437--446.","paperID":"None"},{"content":"Lieberman, H. Out of many, one: reliable results from unreliable recognition. In Proc. CHI 2002 Extended Abstracts, ACM Press (2002), 728--729.","paperID":"None"},{"content":"Mueller, F., Agamanolis, S. and Picard, R., Exertion Interfaces: Sports over a Distance for Social Bonding and Fun. In Proc. CHI 2003, ACM Press, 561--568.","paperID":"None"},{"content":"Mueller, F., Edge, D., Vetere, F., Gibbs, M.R., Agamanolis, S., Bongers, B. and Sheridan, J.G. Designing Sports: A Framework for Exertion Games. In Proc. CHI 2011, ACM Press (2011), 2651--2660.","paperID":"None"},{"content":"Mueller, F., Graether, E. and Toprak, C. Joggobot: jogging with a flying robot. In Proc. CHI 2013 Extended Abstracts, ACM Press (2013), 2845--2846.","paperID":"None"},{"content":"Mueller, F., Khot, R.A., Chatham, A.D., Pijnappel, S., Toprak, C.C. and Marshall, J. HCI with sports. In Proc. CHI 2013 Extended Abstracts, ACM Press, 2509--2512.","paperID":"None"},{"content":"Mueller, F., Marshall, J., Khot, R.A., Nylander, S. and Tholander, J. Jogging with technology: interaction design supporting sport activities. In Proc. CHI 2014 Extended abstracts, ACM Press (2014), 1131--1134.","paperID":"None"},{"content":"Mueller, F., Muirhead, M. Understanding the Design of a Flying Jogging Companion. In Adjunct Proc. UIST 2014, ACM Press (2014), 81--82.","paperID":"None"},{"content":"Mueller, F., Vetere, F., Gibbs, M., Edge, D., Agamanolis, S., Sheridan, J. and Heer, J. Balancing exertion experiences. In Proc. CHI 2012, ACM Press (2012), 1853--1862.","paperID":"None"},{"content":"Mueller, F., Vetere, F., Gibbs, M.R., Agamanolis, S. and Sheridan, J. Jogging over a Distance: The Influence of Design in Parallel Exertion Games. In ACM SIGGRAPH 2010, 2010, ACM.","paperID":"None"},{"content":"Mueller, F., Vetere, F., Gibbs, M.R., Edge, D., Agamanolis, S. and Sheridan, J.G. Jogging over a distance between Europe and Australia. In Proc. UIST 2010, ACM Press (2010), 189--198.","paperID":"None"},{"content":"O'Brien, S. and Mueller, F. Jogging the distance. In Proc. CHI 2007, ACM Press (2007), 523--526.","paperID":"None"},{"content":"Park, T., Yoo, C., Choe, S.P., Park, B. and Song, J., Transforming solitary exercises into social exergames. In Proc. CSCW 2012, ACM Press (2012), 863--866.","paperID":"None"},{"content":"Pijnappel, S. and Mueller, F. Designing interactive technology for skateboarding. In Proc. TEI 2014, ACM Press (2014), 141--148.","paperID":"None"},{"content":"Rigby, S. and Ryan, R. Glued to games. Praeger, 2011.","paperID":"None"},{"content":"Rogers, Y. Interaction design gone wild: striving for wild theory. interactions, 18 (4). (2011), 58--62.","paperID":"None"},{"content":"Sheridan, J. and Bryan-Kinns, N. Designing for Performative Tangible Interaction. Journal of Arts and Technology. 1 (3/4). (2008), 288--308.","paperID":"None"},{"content":"Sheridan, J. and Mueller, F. Fostering Kinesthetic Literacy Through Exertion Games. In Workshop on Whole-Body Interactions at CHI 2010.","paperID":"None"},{"content":"van Dijk, J., van der Lugt, R. and Hummels, C. Beyond distributed representation: Embodied cognition design supporting socio-sensorimotor couplings. In Proc. TEI 2014, ACM Press (2014), 181--188.","paperID":"None"},{"content":"Wallis, M., Popat, S., McKinney, J., Bryden, J. and Hogg, D.C. Embodied conversations: performance and the design of a robotic dancing partner. Design Studies, 31 (2). (2010), 99--117.","paperID":"None"},{"content":"Walmink, W., Wilde, D. and Mueller, F. Displaying heart rate data on a bicycle helmet to support social exertion experiences. In Proc. TEI 2014, ACM Press (2014), 97--104.","paperID":"None"},{"content":"Witkowski, E. Running from zombies. In Proc. Interactive Entertainment 2013, ACM Press (2013), 1--8.","paperID":"None"}],"citation":[{"content":"Chek Tien Tan , Richard Byrne , Simon Lui , Weilong Liu , Florian Mueller, JoggAR: a mixed-modality AR approach for technology-augmented jogging, SIGGRAPH Asia 2015 Mobile Graphics and Interactive Applications, November 02-06, 2015, Kobe, Japan","paperID":"2818434"},{"content":"Jessica R. Cauchard , Jane L. E , Kevin Y. Zhai , James A. Landay, Drone & me: an exploration into natural human-drone interaction, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2805823"},{"content":"Mohammad Obaid , Omar Mubin , Christina Anne Basedow , A. Ayça Ünlüer , Matz Johansson Bergström , Morten Fjeld, A Drone Agent to Support a Clean Environment, Proceedings of the 3rd International Conference on Human-Agent Interaction, October 21-24, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2814947"},{"content":"Hyun Young Kim , Bomyeong Kim , Jinwoo Kim, The Naughty Drone: A Qualitative Research on Drone as Companion Device, Proceedings of the 10th International Conference on Ubiquitous Information Management and Communication, p.1-6, January 04-06, 2016, Danang, Viet Nam","paperID":"2857639"}],"abstract":"Jogging is a popular exertion activity. The abundance of jogging apps suggests to us that joggers can appreciate the opportunity for technology to support the jogging experience. We want to take this investigation a step further by exploring if, and how, robotic systems can support the jogging experience. We designed and built a flying robotic system, a quadcopter, as a jogging companion and studied its use with 13 individual joggers. By analyzing their experiences, we derived three design dimensions that describe a design space for flying robotic jogging companions: Perceived Control, Focus and Bodily Interaction. Additionally, we articulate a series of design tactics, described by these dimensions, to guide the design of future systems. With this work we hope to inspire and guide designers interested in creating robotic systems to support exertion experiences.","video":"http://www.youtube.com/embed/u6HVwOCq3as?rel=0","title":"Jogging with a Quadcopter","filename":"CHI15/p2023","authors":["Florian 'Floyd' Mueller","Matthew Muirhead"],"conference":"CHI '15"}