{"paperId":2702493,"abstract":"This study concerns the practical methods used to design segmentation models for digital advertising. I illuminate some of the collaborative activities workers rely on to create these web analytics based groupings. This work remains overlooked as the popularity of automation and statistical methods for segmenting customers continues to grow. I explain some of the ways the advertising customer is present as a background expectancy while workers make segment composition decisions. This approach is meant to complement established evaluative, technical, and statistical methods used to create segments and personas in design and marketing. This may inspire similar approaches to designing for specific groups of people while working with large data sets. Incorporating these customer-orienting practices in design and advertising processes could lead to novel approaches for both segment targeting and customer relationship management (CRM) software.","citation":[],"reference":[{"content":"Barter, P. and DeChambeau, J. From Mad Men to Math Men. The Intelligent Application of Technology. http://www.t4g.com/articles/from-mad-men-to-mathmen/","paperID":"None"},{"content":"Chamberlin, E.H., The Theory of Monopolistic Competition, Harvard University Press, Cambridge, MA, USA, 1933.","paperID":"None"},{"content":"Chapman, C.N., Love, E., Milham, R.P., ElRif, P., and Alford, J.L., Quantitative Evaluation of Personas as Information, In Proc of the Human Factors and Ergonomics Society 52nd Annual Meeting, Human Factors and Ergonomics Society (2008), 1107--1111.","paperID":"None"},{"content":"Chapman, C.N. and Milham, R.P. The Persona's New Clothes: Methodological and Practical Arguments Against a Popular Method, In Proc of Human Factors and Ergonomics Society 50th Annual Meeting, Human Factors and Ergonomics Society (2006), 634--636.","paperID":"None"},{"content":"Alan Cooper , Paul Saffo, The  Inmates Are Running the Asylum, Macmillan Publishing Co., Inc., Indianapolis, IN, 1999","paperID":"553473"},{"content":"Paul Dourish, Implications for design, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124855"},{"content":"Firat, A.F., and Venkatesh, A, 1993, Postmodernity: the age of marketing, International Journal of Research in Marketing 10, 3 (1993), 227--249.","paperID":"None"},{"content":"Garfinkel, H., Studies in Ethnomethodology, Englewood Cliffs, New Jersey, NJ, USA, 1967.","paperID":"None"},{"content":"Greiffenhagen, C., Mair, M., Sharrock, W.W., From Methodology to Methodography: A Study of Qualitative and Quantitative Reasoning in Practice, Methodological Innovations Online 6, 2 (2011), 93--107.","paperID":"None"},{"content":"Hof, R. Not Just for Nerds: Automated Ad Buying Goes Mainstream. Forbes. http://www.forbes.com/sites/roberthof/2014/03/24/notjust-for-nerds-automated-ad-buying-goes-mainstream/","paperID":"None"},{"content":"John Hughes , Val King , Tom Rodden , Hans Andersen, Moving out from the control room: ethnography in system design, Proceedings of the 1994 ACM conference on Computer supported cooperative work, p.429-439, October 22-26, 1994, Chapel Hill, North Carolina, USA","paperID":"193065"},{"content":"Lynch, M. Preliminary Notes on Judges' Work: The Judge as a Constituent of Courtroom Hearings. In Law in Action: Ethnomethodological & Conversation Analytic Approaches to Law. Dartmouth Publishing, Aldershot, UK, 1997.","paperID":"None"},{"content":"Lynch, M., Art and Artifact in Laboratory Science: A Study of Shop Work and Shop Talk in a Research Laboratory, Routledge Kegan & Paul, Boston, MA, USA, 1985.","paperID":"None"},{"content":"Lynch, M., Scientific practice and ordinary action: Ethnomethodology and social studies of science, Cambridge University Press, Cambridge, UK, 1993.","paperID":"None"},{"content":"Martin, D., O'Neill, J., and Randall, D., 'Talking about (my) Generation': Creativity, Practice, Technology & Talk. In Proc of ECSCW 2009, ACM (2009), 171--190.","paperID":"None"},{"content":"Mitchell, A., The Nine American Lifestyles: Who We Are and Where We're Going, Warner Books, New York, NY, USA, 1983.","paperID":"None"},{"content":"John Pruitt , Jonathan Grudin, Personas: practice and theory, Proceedings of the 2003 conference on Designing for user experiences, June 06-07, 2003, San Francisco, California","paperID":"997089"},{"content":"Dave Randall , Richard Harper , Mark Rouncefield, Fieldwork for Design: Theory and Practice (Computer Supported Cooperative Work), Springer-Verlag New York, Inc., Secaucus, NJ, 2007","paperID":"1296077"},{"content":"Robinson, H.W., The Equilibrium Price in a Perfect Inter-Temporal Market, Econometrica 6, 1 (1938), 4862.","paperID":"None"},{"content":"Sacks, H., Schegloff, E.A., Jefferson, G., A Simplest Systematics for the Organization of Turn-Taking for Conversation, Language 50,4 (1974), 696--735.","paperID":"None"},{"content":"Schutz, A., The Phenomenology of the Social World, Heinemann, London, UK, 1972.","paperID":"None"},{"content":"Sharrock, W. and Anderson, B., The user as a scenic feature of the design space, Design Studies 15,1 (1994), 5--18.","paperID":"None"},{"content":"Smith, W.R., Product Differentiation and Market Segmentation as Alternative Marketing Strategies, Journal of Marketing 21,1 (1956) 3--8.","paperID":"None"},{"content":"Stigler, G., The Theory of Competitive Price, MacMillan, London, UK, 1946.","paperID":"None"},{"content":"Thielman, S. How Agencies Are Retooling for the Automated Ad Buy. Adweek. http://www.adweek.com/news/advertisingbranding/how-agencies-are-retooling-automated-adbuy-153589","paperID":"None"},{"content":"van Raaij, W.F., Postmodern consumption, Journal of Economic Psychology 14, 3 (1993), 541--563.","paperID":"None"}],"title":"The Work of Mad Men that Makes the Methods of Math Men Work: Practically Occasioned Segment Design","filename":"CHI15/p3275","authors":["Michael F. Clarke"],"conference":"CHI '15"}