{"paperId":2702560,"abstract":"Timebanking is a service-based community currency, built on the principle that everyone's time is valued equally. It has potential for community building and reenergizing neighborhoods, but it faces several adoption challenges. We report on the largest investigation of timebanking practices to date by analyzing a combination of service exchange records from the three largest hOurworld timebanks with over 3,500 members with 33,000 completed service exchanges, and a survey of 446 members of over 120 hOurworld timebanks. Our findings suggest that the ideal of 'equal time, equal value' that is at the foundation of timebanking is a source of tension between members with instrumental versus idealistic and altruistic motivations. We suggest that future peer-to-peer systems must incorporate different rewards and incentives in order to accommodate users with different motivations.","citation":[{"content":"Lukas Valek, Open Ways for Time Banking Research: Project Management and Beyond, International Journal of Human Capital and Information Technology Professionals, v.7 n.1, p.35-47, January 2016","paperID":"2876928"},{"content":"Federico Cabitza , Angela Locoro , Carla Simone , Tunazzina Sultana, Moving Western Neighborliness to East?: A study on Local Exchange in Bangladesh, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819971"}],"reference":[{"content":"Victoria M.E. Bellotti , Sara Cambridge , Karen Hoy , Patrick C. Shih , Lisa Renery Handalian , Kyungsik Han , John M. Carroll, Towards community-centered support for peer-to-peer service exchange: rethinking the timebanking metaphor, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557061"},{"content":"Bellotti, V., Carroll, J. M., & Han, K. Random acts of kindness: The intelligent and context-aware future of reciprocal altruism and community collaboration. In Proc. CTS 2013, IEEE Press (2013), 1--12.","paperID":"None"},{"content":"Victoria Bellotti , Alexander Ambard , Daniel Turner , Christina Gossmann , Kamila Demkova , John M. Carroll, A Muddle of Models of Motivation for Using Peer-to-Peer Economy Systems, Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2702272"},{"content":"Botsman, R., & Rogers, R. What's mine is yours. HarperBusiness, New York, 2010.","paperID":"None"},{"content":"Cahn, E.S. No more throw-away people: The coproduction imperative. Essential Books, Washington, D.C., 2000.","paperID":"None"},{"content":"Cahn, E. S. & Barr, N. Service credits: a new currency for the welfare state. Welfare State Programme Discussion Papers, WSP 008. Centre for Analysis of Social Exclusion, The London School of Economics and Political Science, London, UK, 1986.","paperID":"None"},{"content":"Carroll, J. M. (2013). Co-production scenarios for mobile time banking. In Proc. IS-EUD 2013, Springer Berlin Heidelberg (2013), 137--152.","paperID":"None"},{"content":"John M. Carroll , Victoria Bellotti, Creating Value Together: The Emerging Design Space of Peer-to-Peer Currency and Exchange, Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, March 14-18, 2015, Vancouver, BC, Canada","paperID":"2675270"},{"content":"Collom, E. The motivations, engagement, satisfaction, outcomes, and demographics of time bank participants: survey findings from a US system. International Journal of Community Currency research 11 (2007), 36--83.","paperID":"None"},{"content":"Collom, E. Banking time in an alternative market: A quantitative case study of a local currency system. In 103rd Annual Meeting of the American Sociological Association, Boston, 2008.","paperID":"None"},{"content":"Collom, E. Engagement of the elderly in time banking: The potential for social capital generation in an aging society. Journal of Aging & Social Policy, 20, 4 (2008), 414--436.","paperID":"None"},{"content":"Collom, E. Motivations and Differential Participation in a Community Currency System: The Dynamics Within a Local Social Movement Organization. Sociological Forum 26, 1 (2011), 144--168.","paperID":"None"},{"content":"Collom, E., Lasker, J. N., & Kyriacou, C. Equal Time, Equal Value: Community Currencies and Time Banking in the US. Ashgate Publishing, Ltd, 2012.","paperID":"None"},{"content":"Glynos, J., & Speed, E. Varieties of co-production in public services: time banks in a UK health policy context. Critical Policy Studies, 6, 4 (2012), 402--433.","paperID":"None"},{"content":"Gregory, L. Spending time locally: the benefit of time banks for local economies. Local Economy, 24, 4 (2009), 323--333.","paperID":"None"},{"content":"Gregory, L. Time in service design: exploring the use of time credits to deliver social policies. In Cardiff School of Social Sciences Working Papers Series, 132 (2010).","paperID":"None"},{"content":"Kyungsik Han , Patrick C. Shih , Victoria Bellotti , John M. Carroll, It's Time There Was an App for That Too: A Usability Study of Mobile Timebanking, International Journal of Mobile Human Computer Interaction, v.7 n.2, p.1-22, April 2015","paperID":"2756454"},{"content":"Kyungsik Han , Patrick C. Shih , Mary Beth Rosson , John M. Carroll, Enhancing community awareness of and participation in local heritage with a mobile application, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531640"},{"content":"Airi Lampinen , Vilma Lehtinen , Coye Cheshire , Emmi Suhonen, Indebtedness and reciprocity in local online exchange, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441850"},{"content":"Lasker, J., Collom, E., Bealer, T., Niclaus, E., Keefe, J. Y., Kratzer, Z., ... & Perlow, K. Time banking and health: the role of a community currency organization in enhancing well-being. Health Promotion Practice, 12, 1 (2011), 102--115.","paperID":"None"},{"content":"Marks, M. B. Time banking service exchange systems: A review of the research and policy and practice implications in support of youth in transition. Children and Youth Services Review, 34, 7 (2012), 1230--1236.","paperID":"None"},{"content":"Ozanne, L. K. Learning to exchange time: Benefits and obstacles to time banking. International Journal of Community Currency Research, 14, 1 (2010), 1--16.","paperID":"None"},{"content":"Ryan, R. M., & Deci, E. L. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American Psychologist 55 (2000), 68--78","paperID":"None"},{"content":"Seyfang, G. Tackling social exclusion with community currencies: learning from LETS to Time Banks. International Journal of Community Currency Research, 6, 1 (2002), 1--11.","paperID":"None"},{"content":"Seyfang, G. 'With a little help from my friends.' Evaluating time banks as a tool for community self-help. Local Economy, 18, 3 (2003), 257--264.","paperID":"None"},{"content":"Seyfang, G. Time banks: rewarding community selfhelp in the inner city? Community Development Journal, 39, 1 (2004), 62--71.","paperID":"None"},{"content":"Seyfang, G. Harnessing the potential of the social economy? Time banks and UK public policy. International Journal of Sociology and Social Policy, 26, 9/10 (2006), 430--443.","paperID":"None"},{"content":"Seyfang, G. New economics of sustainable consumption: seeds of change. Energy (2009).","paperID":"None"},{"content":"Seyfang, G. & Smith, K. The time of our lives: Using timebanking for neighbourhood renewal and community capacity-building. New Economics Foundation, London, 2002.","paperID":"None"},{"content":"Seyfang, G., & Longhurst, N. Growing green money? Mapping community currencies for sustainable development. Ecological Economics, 86 (2013), 65--77.","paperID":"None"},{"content":"Emmi Suhonen , Airi Lampinen , Coye Cheshire , Judd Antin, Everyday favors: a case study of a local online gift exchange system, Proceedings of the 16th ACM international conference on Supporting group work, November 07-10, 2010, Sanibel Island, Florida, USA","paperID":"1880074"},{"content":"Shih, P. C., Han, K., Poole, E. S., Rosson, M. B., & Carroll, J. M. Use and adoption challenges of wearable activity trackers. In Proc. iConference (2015).","paperID":"None"},{"content":"Williams, C. C. Are Local Currencies An Effective Tool for Tackling Social Exclusion? Town and Country Planning, 69, 11 (2000), 323--325.","paperID":"None"}],"title":"Unequal Time for Unequal Value: Implications of Differing Motivations for Participation in Timebanking","filename":"CHI15/p1075","authors":["Patrick C. Shih","Victoria Bellotti","Kyungsik Han","John M. Carroll"],"conference":"CHI '15"}