{"paperId":2702407,"citation":[],"abstract":"Language barrier is the primary challenge for effective cross-lingual conversations. Spoken language translation (SLT) is perceived as a cost-effective alternative to less affordable human interpreters, but little research has studied how people interact with such technology. Using a prototype translator application, we performed a formative evaluation to elicit how people interact with the technology and adapt their conversation style. We conducted two sets of studies with a total of 23 pairs (46 participants). Participants worked on storytelling tasks to simulate natural conversations with 3 different interface settings. Our findings show that collocutors naturally adapt their style of speech production and comprehension to compensate for inadequacies in SLT. We conclude the paper with design guidelines that emerged from the analysis.","reference":[{"content":"Bazzi, I. and Glass, J.R. Modeling Out-Of-Vocabulary Words For Robust Speech Recognition. Doctoral Dissertation. 2000.","paperID":"None"},{"content":"Berg, B.L. and Lune, H. Qualitative research methods for the social sciences. Pearson Boston, 2001.","paperID":"None"},{"content":"Costantini, E., Pianesi, F., and Burger, S. The added value of multimodality in the NESPOLE! speech-to-speech translation system: an experimental study. IEEE ICMI, (2002), 235--240.","paperID":"None"},{"content":"Creutz, M., Hirsimäki, T., Kurimo, M., et al. Morph-based Speech Recognition and Modeling of Out-of-vocabulary Words Across Languages. ACM TSLP. 5, 1 (2007), 3:1--3:29.","paperID":"None"},{"content":"Deng, L. and Huang, X. Challenges in Adopting Speech Recognition. Commun. ACM 47, 1 (2004), 69--75.","paperID":"None"},{"content":"Feely, A.J. and Harzing, A.-W. Language management in multinational companies. IJCCM 10, 2 (2003), 37--52.","paperID":"None"},{"content":"Fügen, C., Waibel, A., and Kolss, M. Simultaneous Translation of Lectures and Speeches. MT 21, 4 (2007), 209--252.","paperID":"None"},{"content":"Gao, G., Xu, B., Cosley, D., and Fussell, S.R. How Beliefs About the Presence of Machine Translation Impact Multilingual Collaborations. Proc. of CSCW (2014), 1549--1560.","paperID":"None"},{"content":"Gao, G., Yamashita, N., Hautasaari, A.M.J., Echenique, A., and Fussell, S.R. Effects of Public vs. Private Automated Transcripts on Multiparty Communication Between Native and Non-native English Speakers. Proc. of CHI (2014), 843--852.","paperID":"None"},{"content":"Gile, D. Theoretical components in interpreter and translator training. . John Benjamins Publishing Company, 2009.","paperID":"None"},{"content":"Hamon, O., Fügen, C., Mostefa, D., et al. End-to-end Evaluation in Simultaneous Translation. Proc. of ECACL (2009), 345--353.","paperID":"None"},{"content":"He, X. and Deng, L. Speech-Centric Information Processing: An Optimization-Oriented Approach. Proc. of the IEEE 101, 5 (2013), 1116--1135.","paperID":"None"},{"content":"Janssen, C.P., Iqbal, S.T., and Ju, Y.-C. Sharing a driver's context with a caller via continuous audio cues to increase awareness about driver state. J. of E. Psychology, (2014).","paperID":"None"},{"content":"Kale, E. and Syed, H.R. Language barriers and the use of interpreters in the public health services. A questionnairebased survey. PEC 81, 2 (2010), 187--191.","paperID":"None"},{"content":"Morita, N. Negotiating Participation and Identity in Second Language Academic Communities. TESOL Quarterly 38, 4 (2004), 573--603.","paperID":"None"},{"content":"Nakamura, S., Markov, K., Nakaiwa, H., et al. The ATR multilingual speech-to-speech translation system. IEEE Trans. on ASLP 14, 2 (2006), 365--376.","paperID":"None"},{"content":"Pan, Y., Jiang, D., Picheny, M., and Qin, Y. Effects of Realtime Transcription on Non-native Speaker's Comprehension in Computer-mediated Communications. Proc. of CHI (2009), 2353--2356.","paperID":"None"},{"content":"Prasad, R., Kumar, R., Ananthakrishnan, S., et al. Active error detection and resolution for speech-to-speech translation. IWSLT, (2012), 150--157.","paperID":"None"},{"content":"Singer, A. Contemporary Immigrant Gateways in Historical Perspective. Daedalus 142, 3 (2013), 76--91.","paperID":"None"},{"content":"Stolcke, A., Coccaro, N., Bates, R., et al. Dialogue Act Modeling for Automatic Tagging and Recognition of Conversational Speech. Comp. Ling. 26, 3 (2000), 339--373.","paperID":"None"},{"content":"Takezawa, T., Sugaya, F., Yokoo, A., and Yamamoto, S. A new evaluation method for speech translation systems and a case study on ATR-MATRIX from Japanese to English. Proc. of MTS. (1999), 299--307.","paperID":"None"},{"content":"Waibel, A., Jain, A.N., McNair, A.E., Saito, H., Hauptmann, A.G., and Tebelskis, J. JANUS: a speech-to-speech translation system using connectionist and symbolic processing strategies. ICASSP, (1991), 793--796 vol.2.","paperID":"None"},{"content":"Wang, H.-C., Fussell, S., and Cosley, D. Machine Translation vs. Common Language: Effects on Idea Exchange in Crosslingual Groups. Proc. of CSCW (2013), 935--944.","paperID":"None"},{"content":"Wobbrock, J.O., Findlater, L., Gergle, D., and Higgins, J.J. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. Proc. of CHI (2011), 143--146.","paperID":"None"},{"content":"Yamashita, N., Inaba, R., Kuzuoka, H., and Ishida, T. Difficulties in Establishing Common Ground in Multiparty Groups Using Machine Translation. Proc. of CHI (2009), 679--688.","paperID":"None"},{"content":"Yamashita, N. and Ishida, T. Effects of Machine Translation on Collaborative Work. Proc. of CSCW (2006), 515--524.","paperID":"None"},{"content":"AIIC-UN Agreement rates (viewed Sept 2014). http://aiic.net/page/275/aiic-un-agreement-rates-last-updatejuly-2014/lang/1.","paperID":"None"}],"title":"Effect of Machine Translation in Interlingual Conversation: Lessons from a Formative Study","filename":"CHI15/p3473","authors":["Kotaro Hara","Shamsi T. Iqbal"],"conference":"CHI '15"}