{"paperId":2702413,"citation":[{"content":"Katie Davis , Simrat Singh, Digital badges in afterschool learning, Computers & Education, v.88 n.C, p.72-83, October 2015","paperID":"2838195"}],"abstract":"This paper investigates high school students' perceptions of the opportunities and challenges of using digital badges to recognize and reward the skills and achievements they acquire in an afterschool science education program. Focus groups and usability tests were conducted with 10 students during the design of a badge system prototype for use in the program. We found that students recognized opportunities for personal empowerment in their use of badges, but also expressed concerns about sharing badges in various online contexts. The findings provide new insight into the values and goals that learners bring to discussions of digital badges in education. These insights hold relevance for designers of education-based badge systems as well as educators seeking to introduce badges into their practice.","reference":[{"content":"Abramovich, S., Schunn, C., & Higashi, R.M. Are badges useful in education? it depends upon the type of badge and expertise of learner. Education Tech Research Development 61, 2 (2013), 217--232.","paperID":"None"},{"content":"Antin, J. & Churchill, E. Badges in social media: a social psychological perspective. SIGCHI 2011, ACM (2011), 1--4.","paperID":"None"},{"content":"Bowker, B. & Starr, S. Sorting things out: classification and its consequences. MIT Press, Cambridge. 2000.","paperID":"None"},{"content":"boyd, d. It's complicated: the social lives of networked teens. Yale University Press, New Haven. 2014.","paperID":"None"},{"content":"Casilli, C. Mozilla Open Badges: the ecosystem begins to take shape. 2012. http://carlacasilli.wordpress.com/2012/07/31/mozillaopen-badges-the-ecosystem-begins-to-take-shape/","paperID":"None"},{"content":"Denny, P. The effect of virtual achievements on student engagement. SIGCHI 2013, ACM (2013), 763--772.","paperID":"None"},{"content":"Design-Based Research Collective. Design-based research: an emerging paradigm for educational inquiry. Educational Researcher 32, 1 (2003), pp. 5--8.","paperID":"None"},{"content":"Deterding, S., Dixon, D., Khaled, R., and Nacke, L. From game design elements to gamefulness: defining \"gamification\". Proc. MindTrek '11, ACM (2011), 9--15.","paperID":"None"},{"content":"Ito, M., Gutiérrez, K., Livingstone, et al. Connected learning: an agenda for research and design. 2013. http://dmlhub.net/sites/default/files/ConnectedLearning_ report.pdf","paperID":"None"},{"content":"Lincoln, Y. S., & Guba, E. G. (1985). Naturalistic inquiry. Sage, Beverly Hills. 1985.","paperID":"None"},{"content":"Riconscente, M.M., Kamarainen, A., & Honey, M. STEM Badges: current terrain and the road ahead. New York Hall of Science. 2013. http://badgesnysci.files.wordpress.com/2013/08/nsf_ste mbadges_final_report.pdf","paperID":"None"},{"content":"Rughinis, R. Talkative objects in need of interpretation: re-thinking digital badges in education. SIGCHI 2013 Extended Abstracts, ACM (2013), pp. 2099--2108.","paperID":"None"}],"title":"Investigating High School Students' Perceptions of Digital Badges in Afterschool Learning","filename":"CHI15/p4043","authors":["Katie Davis","Eve Klein"],"conference":"CHI '15"}