{"paperId":2702259,"citation":[],"abstract":"Collective intelligence (CI) is a property of groups that emerges from the coordination and collaboration of members and predicts group performance on a wide range of tasks. Previous studies of CI have been conducted with lab-based groups in the USA. We introduce a new standardized online battery to measure CI and demonstrate consistent emergence of a CI factor across three different studies despite broad differences in (a) communication media (face-to-face vs online), (b) group contexts (short-term ad hoc groups vs long-term groups) and (c) cultural settings (US, Germany, and Japan). In two of the studies, we also show that CI is correlated with a group's performance on more complex tasks. Consequently, the CI metric provides a generalizable performance measure for groups that is robust to broad changes in media, context, and culture, making it useful for testing the effects of general-purpose collaboration technologies intended to improve group performance.","reference":[{"content":"Barlow, J.B. and Dennis, A.R. Not as smart as we think: A study of collective intelligence in virtual groups. Proceedings of Collective Intelligence 2014, (2014).","paperID":"None"},{"content":"Stephen P. Borgatti , Rob Cross, A Relational View of Information Seeking and Learning in Social Networks, Management Science, v.49 n.4, p.432-445, April 2003","paperID":"970435"},{"content":"Erran Carmel, Global software teams: collaborating across borders and time zones, Prentice Hall PTR, Upper Saddle River, NJ, 1999","paperID":"293968"},{"content":"Chabris, C.F. Cognitive and neurobiological mechanisms of the law of general intelligence. In M.J. Roberts, ed., Integrating the Mind: Domain General versus Domain specific Processes in Higher Cognition. Psychology Press, Hove, United Kingdom, 2007, 449--491.","paperID":"None"},{"content":"R L Daft , R H Lengel, Organizational information requirements, media richness and structural design, Management Science, v.32 n.5, p.554-571, May 1986","paperID":"8433"},{"content":"Deary, I.J. Looking Down on Human Intelligence: From Psychometrics to the Brain. Oxford University Press, New York, 2000.","paperID":"None"},{"content":"Devine, D.J. and Philips, J.L. Do smarter teams do better: A meta-analysis of cognitive ability and team performance. Small Group Research 32, 5 (2001), 507--532.","paperID":"None"},{"content":"Engel, D., Woolley, A.W., Jing, L.X., Chabris, C.F., and Malone, T.W. Reading the mind in the eyes or reading between the lines? Theory of Mind predicts collective intelligence equally well online and face-toface. PLoS ONE 9, 12 (2014).","paperID":"None"},{"content":"Gersick, C.J. and Hackman, J.R. Habitual routines in task-performing groups. Organizational Behavior and Human Decision Processes 47, (1990), 65--97.","paperID":"None"},{"content":"Hall, E.T. Beyond Culture. Anchor Press--Doubleday, New York, 1976.","paperID":"None"},{"content":"Hertel, G., Konradt, U., and Orlikowsi, B. Managing distance by interdependence: Goal setting, task interdependence and team-based rewards in virtual teams. European Journal of Work and Organizational Psychology 13, (2004), 1--28.","paperID":"None"},{"content":"Pamela Hinds , Katharina Reinecke, Advancing methodologies for cross- cultural studies of collaborative systems, Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2558856"},{"content":"Hofstede, G.H. Culture's Consequences, International Differences in Work-related Values. Sage, Beverly Hills, CA, 1980.","paperID":"None"},{"content":"Shipra Kayan , Susan R. Fussell , Leslie D. Setlock, Cultural differences in the use of instant messaging in Asia and North America, Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work, November 04-08, 2006, Banff, Alberta, Canada","paperID":"1180956"},{"content":"Kitayama, S. Culture and basic psychological processes: Toward a system view of culture: Comment on Oyserman et al. (2002). Psychological Bulletin 128, (2002), 89--96.","paperID":"None"},{"content":"Lafferty, J.C., Pond, A.W., and International, H.S. Desert Survival Situation. Human Synergistics International, 1987.","paperID":"None"},{"content":"Larson, J.R. In Search of Synergy in Small Group Performance. Psychology Press, New York, NY, 2009.","paperID":"None"},{"content":"Lepine, J.A., Hollenbeck, J.R., Ilgen, D.R., and Hedlund, J. Effects of individual differences on the performance of hierarchical decision-making teams: Much more than g. Journal of Applied Psychology 82, 5 (1997), 803--811.","paperID":"None"},{"content":"Kyle Lewis, Knowledge and Performance in Knowledge-Worker Teams: A Longitudinal Study of Transactive Memory Systems, Management Science, v.50 n.11, p.1519-1533, November 2004","paperID":"1045796"},{"content":"Lorenzo-Seva, U. and Ten Berge, J.M. Tucker's congruence coefficient as a meaningful index of factor similarity. Methodology: European Journal of Research Methods for the Behavioral and Social Sciences 2, 2 (2006), 57--64.","paperID":"None"},{"content":"Markus, M.L. Electronic mail as the medium of managerial choice. Organization Science 5, 4 (1994), 502--527.","paperID":"None"},{"content":"Martins, L.L., Gilson, L.L., and Maynard, M.T. Virtual teams: What do we know and where do we go from here? Journal of Management 30, 6 (2004), 805--836.","paperID":"None"},{"content":"McDonough, E. An investigation of the use of global, virtual, and colocated new product development teams. Journal of Product Innovation Management 18, (2001), 110--120.","paperID":"None"},{"content":"McGrath, J.E. Groups: Interaction and Performance. Prentice-Hall, Englewood Cliffs, NJ, 1984.","paperID":"None"},{"content":"Michael D. Myers , Felix B. Tan, Beyond models of national culture in information systems research, Advanced topics in global information management, IGI Global, Hershey, PA, 2003","paperID":"960185"},{"content":"Neuman, G.A., Wagner, S.H., and Christiansen, N.D. The relationship between work-team personality composition and the job performance of teams. Group & Organization Management 24, (1999), 28--45.","paperID":"None"},{"content":"Noftle, E.E. and Robins, R.W. Personality predictors of academic outcomes: Big five correlates of GPA and SAT scores. Journal of Personality and Social Psychology 93, 1 (2007), 116--130.","paperID":"None"},{"content":"Nye, J.L. and Brower, A.M. What's Social about Social Cognition? Research on Socially Shared Cognition in Small Groups. Sage, Thousand Oaks, CA, 1996.","paperID":"None"},{"content":"Oyserman, D., Coon, H.M., and Kemmelmeier, M. Rethinking individualism and collectivism: Evaluation of theoretical assumptions and meta-analyses. Psychological Bulletin 128, 1 (2002), 3--72.","paperID":"None"},{"content":"Probst, T.M., Carnevale, P.J., and Triandis, H.C. Cultural values in intergroup and single-group social dilemmas. Organizational Behavior and Human Decision Processes 77, 3 (1999), 171--191.","paperID":"None"},{"content":"Ren, Y. and Argote, L. Transactive memory systems 1985--2010: An integrative framework of key dimensions, antecedents, and consequences. The Academy of Management Annals 5, 1 (2011), 189--229.","paperID":"None"},{"content":"Rousseau, D.M. Issues of level in organizational research: Multi-level and cross-level perspectives. In L.L. Cummings and B. Staw, eds., Research in Organizational Behavior. JAI, Greenwich, CT, 1985, 1--37.","paperID":"None"},{"content":"Stuart Russell , Peter Norvig, Artificial Intelligence: A Modern Approach, Prentice Hall Press, Upper Saddle River, NJ, 2009","paperID":"1671238"},{"content":"Lauren Scissors , N. Sadat Shami , Tatsuya Ishihara , Steven Rohall , Shin Saito, Real-time collaborative editing behavior in USA and Japanese distributed teams, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979109"},{"content":"Leslie D. Setlock , Susan R. Fussell , Christine Neuwirth, Taking it out of context: collaborating within and across cultures in face-to-face settings and via instant messaging, Proceedings of the 2004 ACM conference on Computer supported cooperative work, November 06-10, 2004, Chicago, Illinois, USA","paperID":"1031712"},{"content":"Short, J., Williams, E., and Christie, B. The Social Psychology of Telecommunications. Wiley, New York, 1976.","paperID":"None"},{"content":"Smith, E.E. Cognitive Psychology: Mind and Brain. Pearson/Prentice Hall, Upper Saddle River, N.J, 2007.","paperID":"None"},{"content":"Spearman, C. General intelligence, objectively determined and measured. American Journal of Psychology 15, 2 (1904), 201--293.","paperID":"None"},{"content":"Tschan, F. Ideal cycles of communication (or cognitions) in triads, dyads, and individuals. Small Group Research 33, 6 (2002), 615--643.","paperID":"None"},{"content":"Tucker, L.R. A Method of Synthesis of Factor Analysis Studies. Dept of the Army, Washington, D.C., 1951.","paperID":"None"},{"content":"Wagner, J.A. and Moch, M.K. Individualismcollectivism: Concept and measure. Group & Organization Management 11, 3 (1986), 280--304.","paperID":"None"},{"content":"Walther, J.B. Interpersonal effects in computermediated interaction: A relational perspective. Communication Research 19, 1 (1992), 52--90.","paperID":"None"},{"content":"Woolley, A.W., Chabris, C.F., Pentland, A., Hashmi, N., and Malone, T.W. Evidence for a collective intelligence factor in the performance of human groups. Science 330, (2010), 686--688.","paperID":"None"}],"title":"Collective Intelligence in Computer-Mediated Collaboration Emerges in Different Contexts and Cultures","filename":"CHI15/p3769","authors":["David Engel","Anita Williams Woolley","Ishani Aggarwal","Christopher F. Chabris","Masamichi Takahashi","Keiichi Nemoto","Carolin Kaiser","Young Ji Kim","Thomas W. Malone"],"conference":"CHI '15"}