{"paperId":2702168,"citation":[],"abstract":"The persona approach is often treated as a single user-centered design method, but there are variations and adaptations for different design contexts which go beyond local customization. The paper discusses a set of dimensions and success criteria for describing the different persona uses, presenting a new framework. It then specifically investigates personas in the context of end-user development. Professional designers need to consider the design space for potential end-user tools. In addition they need to understand that their users are often designers themselves (they are designer-users), requiring that they also consider the design spaces of their users. Two-level personas are introduced to make professional designers more aware of such nested design spaces. A two-level persona consists of one first-level persona and a set of second-level personas to additionally represent complex designer-user relationships. The effectiveness of the approach is investigated in an exploratory empirical study. The results suggest that two-level personas add value when designing end-user design tools.","reference":[{"content":"Batalas, N., and Markopoulos, P. Considerations for Computerized in Situ Data Collection Platforms. In Proc. of EICS '12, ACM (2012), 231--236.","paperID":"None"},{"content":"Biskjaer, M. M., Dalsgaard, P., and Halskov, K. A constraint-based understanding of design spaces. In Proc. of DIS '14, ACM (2014), 453--462.","paperID":"None"},{"content":"Blomquist, A., and Arvola, M. Personas in Action: Ethnography in an Interaction Design Team. In Proc. of NordiCHI '02, ACM (2002), 197--200.","paperID":"None"},{"content":"Bødker, S., Christiansen, E., Nyvang, T., and Zander, P.-O. Personas, People and Participation: Challenges from the Trenches of Local Government. In Proc. of PDC '12, ACM (2012), 91--100.","paperID":"None"},{"content":"Burnett, M. What Is End-User Software Engineering and Why Does It Matter? In Proc. of IS-EUD'09, IS-EUD '09, Springer-Verlag (2009), 15--28.","paperID":"None"},{"content":"Buxton, B. Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann Publishers Inc., 2007.","paperID":"None"},{"content":"Chapman, C. N., and Milham, R. P. The personas' new clothes: methodological and practical arguments against a popular method. In The Human Factors and Ergonomics Society Annual Meeting (2006), 634--636.","paperID":"None"},{"content":"Cooper, A. The Inmates Are Running the Asylum. Macmillan Publishing Co., Inc., 1999.","paperID":"None"},{"content":"Cooper, A., and Reimann, R. About Face 3.0: The Essentials of Interaction Design, 3rd revised ed. Wiley & Sons, 2007.","paperID":"None"},{"content":"Dharwada, P., Greenstein, J. S., Gramopadhye, A. K., and Davis, S. J. A Case Study on Use of Personas in Design and Development of an Audit Management System. Human Factors and Ergonomics Society Annual Meeting (2007), 469--473.","paperID":"None"},{"content":"Dotan, A., Maiden, N. A. M., Lichtner, V., and Germanovich, L. Designing with Only Four People in Mind? - A Case Study of Using Personas to Redesign a Work-Integrated Learning Support System. In INTERACT (2), vol. 5727 of LNCS, Springer (2009), 497--509.","paperID":"None"},{"content":"Eriksson, E., Artman, H., and Swartling, A. The Secret Life of a Persona: When the Personal Becomes Private. In Proc. of CHI '13, ACM (2013), 2677--2686.","paperID":"None"},{"content":"Faily, S., and Fléchais, I. The Secret Lives of Assumptions: Developing and Refining Assumption Personas for Secure System Design. In Proc. of HCSE'10, Springer-Verlag (2010), 111--118.","paperID":"None"},{"content":"Faily, S., and Fléchais, I. Persona Cases: A Technique for Grounding Personas. In Proc. of CHI '11, ACM (2011), 2267--2270.","paperID":"None"},{"content":"Fischer, G., Giaccardi, E., Ye, Y., Sutcliffe, A. G., and Mehandjiev, N. Meta-design: a manifesto for end-user development. Commun. ACM 47, 9 (2004), 33--37.","paperID":"None"},{"content":"Floyd, I. R., Jones, M. C., and Twidale, M. B. Resolving Incommensurable Debates: A Preliminary Identification of Persona Kinds, Attributes, and Properties. Artifact: Journal of Virtual Design 2, 1 (2008), 12--26.","paperID":"None"},{"content":"Friess, E. Personas and Decision Making in the Design Process: An Ethnographic Case Study. In Proc. of CHI '12, ACM (2012), 1209--1218.","paperID":"None"},{"content":"Grudin, J. Why personas work: The psychological evidence. In The Persona Lifecycle: Keeping People in Mind Throughout Product Design [37].","paperID":"None"},{"content":"Grudin, J., and Pruitt, J. Personas, participatory design and product development: An infrastructure for engagement. In Proc. of PDC'02 (2002), 144--161.","paperID":"None"},{"content":"Gudjonsdottir, R., and Lindquist, S. Personas and scenarios: Design tool or a communication device? In Proc. 8th Int. Conf. on the Design of Cooperative Systems (2008).","paperID":"None"},{"content":"Hague, R., Blackwell, A. F., and Robinson, P. End-User Programming in the Networked Home. In Equator IRC Workshop on Ubiquitous Computing in Domestic Environments (2001).","paperID":"None"},{"content":"Jones, M. C., Floyd, I. R., and Twidale, M. B. Teaching Design with Personas. In Proc. of HCIEd (2008).","paperID":"None"},{"content":"Judge, T., Matthews, T., and Whittaker, S. Comparing Collaboration and Individual Personas for the Design and Evaluation of Collaboration Software. In Proc. of CHI '12, ACM (2012), 1997--2000.","paperID":"None"},{"content":"Ko, A. J., Abraham, R., Beckwith, L., Blackwell, A., Burnett, M., Erwig, M., Scaffidi, C., Lawrance, J., Lieberman, H., Myers, B., Rosson, M. B., Rothermel, G., Shaw, M., and Wiedenbeck, S. The state of the art in end-user software engineering. ACM Comput. Surv. 43, 3 (2011), 21:1--21:44.","paperID":"None"},{"content":"Laporte, L., Slegers, K., and Grooff, D. D. Using correspondence analysis to monitor the persona segmentation process. In NordiCHI'12 (2012), 265--274.","paperID":"None"},{"content":"Larson, R., and Csikszentmihalyi, M. The Experience Sampling Method. New Directions for Methodology of Social and Behavioral Science 15 (1983), 41--56.","paperID":"None"},{"content":"Lieberman, H., Paterno, F., and Wulf, V., Eds. End-User Development. Kluwer/ Springer, 2006.","paperID":"None"},{"content":"Long, F. Real or Imaginary: The effectiveness of using personas in product design. In Proc. of the IES Conference 2009 (2009), 1--10.","paperID":"None"},{"content":"MacLean, A., Young, R. M., Bellotti, V. M. E., and Moran, T. P. Questions, options, and criteria: elements of design space analysis. Hum.-Comput. Interact. 6, 3 (1991), 201--250.","paperID":"None"},{"content":"Massanari, A. Designing for imaginary friends: information architecture, personas and the politics of user-centered design. New Media & Society 12, 3 (2010), 401--416.","paperID":"None"},{"content":"Matthews, T., Judge, T., and Whittaker, S. How Do Designers and User Experience Professionals Actually Perceive and Use Personas? In Proc. of CHI '12, ACM (2012), 1219--1228.","paperID":"None"},{"content":"Matthews, T., Whittaker, S., Moran, T., and Yuen, S. Collaboration Personas: A New Approach to Designing Workplace Collaboration Tools. In Proc. of CHI '11, ACM (2011), 2247--2256.","paperID":"None"},{"content":"Nielsen, L. From User to Character: An Investigation into User-descriptions in Scenarios. In Proc. of DIS '02, ACM (2002), 99--104.","paperID":"None"},{"content":"Nielsen, L., and Hansen, K. S. Personas is applicable: a study on the use of personas in denmark. In CHI (2014), 1665--1674.","paperID":"None"},{"content":"Norman, D. Ad-Hoc Personas & Empathetic Focus. In The Persona Lifecycle: Keeping People in Mind Throughout Product Design [37].","paperID":"None"},{"content":"Portigal, S. TRUE TALES: Persona Non Grata. interactions 15, 1 (Jan. 2008), 72--73.","paperID":"None"},{"content":"Pruitt, J., and Adlin, T. The Persona Lifecycle: Keeping People in Mind Throughout Product Design. Morgan Kaufmann Publishers Inc., 2005.","paperID":"None"},{"content":"Pruitt, J., and Grudin, J. Personas: Practice and Theory. In Proc. of the 2003 Conference on Designing for User Experiences, DUX '03, ACM (2003), 1--15.","paperID":"None"},{"content":"Putnam, C., Kolko, B., and Wood, S. Communicating About Users in ICTD: Leveraging HCI Personas. In Proc. of ICTD '12, ACM (2012), 338--349.","paperID":"None"},{"content":"Rittel, H. W. J., and Webber, M. M. Dilemmas in a General Theory of Planning. Policy Sciences 4 (1973), 155--169.","paperID":"None"},{"content":"Rönkkö, K. An Empirical Study Demonstrating How Different Design Constraints, Project Organization and Contexts Limited the Utility of Personas. In HICSS, IEEE Computer Society (2005).","paperID":"None"},{"content":"Rönkkö, K., Hellman, M., Kilander, B., and Dittrich, Y. Personas is Not Applicable: Local Remedies Interpreted in a Wider Context. In Proc. of PDC'04, ACM (2004), 112--120.","paperID":"None"},{"content":"Siegel, D. A. The Mystique of Numbers: Belief in Quantitative Approaches to Segmentation and Persona Development. In Proc. of CHI '10 (2010), 4721--4732.","paperID":"None"},{"content":"Sinha, R. Persona Development for Information-rich Domains. In Proc. of CHI EA '03, ACM (2003), 830--831.","paperID":"None"},{"content":"Turner, P., and Turner, S. Is stereotyping inevitable when designing with personas? Design Studies 32, 1 (2011), 30--44.","paperID":"None"},{"content":"Vincent, C. J., and Blandford, A. The challenges of delivering validated personas for medical equipment design. Applied Ergonomics, in press (2014).","paperID":"None"},{"content":"Wärnestål, P., Svedberg, P., and Nygren, J. Co-constructing Child Personas for Health-promoting Services with Vulnerable Children. In Proc. of CHI '14 (2014), 3767--3776.","paperID":"None"},{"content":"Westerlund, B. Design Space Exploration - co-operative creation of proposals for desired interactions with future artefacts. Dissertation, Kungliga Tekniska högskolan, Stockholm, 2009.","paperID":"None"},{"content":"Wright, P., and McCarthy, J. The value of the novel in designing for experience. In Future Interaction Design, A. Pirhonen, P. Saariluoma, H. Isomki, and C. Roast, Eds. Springer London, 2005, 9--30.","paperID":"None"}],"title":"Two-Level Personas for Nested Design Spaces","filename":"CHI15/p3265","authors":["Anke Dittmar","Maximilian Hensch"],"conference":"CHI '15"}