{"paperId":2702524,"citation":[{"content":"Nanna Gorm , Irina Shklovski, Steps, Choices and Moral Accounting: Observations from a Step-Counting Campaign in the Workplace, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819944"},{"content":"Daniel A. Epstein , An Ping , James Fogarty , Sean A. Munson, A lived informatics model of personal informatics, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2804250"}],"reference":[{"content":"Ian Anderson , Julie Maitland , Scott Sherwood , Louise Barkhuus , Matthew Chalmers , Malcolm Hall , Barry Brown , Henk Muller, Shakra: tracking and sharing daily activity levels with unaugmented mobile phones, Mobile Networks and Applications, v.12 n.2-3, p.185-199, March 2007","paperID":"1295212"},{"content":"Ayres I. Carrots and Sticks 2010, New York: Bantam Books.","paperID":"None"},{"content":"Bravata DM, Smith-Spangler C, Sundaram V, Gienger AL, Lin N, Lewis R, Stave CD, Olkin I, Sirard JR. Using pedometers to increase physical activity and improve health: a systematic review, JAMA 2007; 298(19): 2296--2304.","paperID":"None"},{"content":"Bryan G, Karlan D, Nelson S, Commitment Devices. Annu Rev Econ 2010; 2: 671--698.","paperID":"None"},{"content":"Cialdini RB. Influence: Science and Practice (5th edition) 2009. Boston: Pearson.","paperID":"None"},{"content":"Sunny Consolvo , Katherine Everitt , Ian Smith , James A. Landay, Design requirements for technologies that encourage physical activity, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124840"},{"content":"Sunny Consolvo , David W. McDonald , Tammy Toscos , Mike Y. Chen , Jon Froehlich , Beverly Harrison , Predrag Klasnja , Anthony LaMarca , Louis LeGrand , Ryan Libby , Ian Smith , James A. Landay, Activity sensing in the wild: a field trial of ubifit garden, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357335"},{"content":"Eakin EG, Lawler SP, Vandelanotte C, Owen N. Telephone Interventions for Physical Activity & Dietary Behavior Change: A systematic review, Am J Prev Med 2007; 32(5): 419--434.","paperID":"None"},{"content":"Eysenbach G. The law of attrition. J Med Internet Res, 2005; 7(1): e11.","paperID":"None"},{"content":"Gollwitzer PM, Sheeran P, Michalski V, Seifert AE. When Intentions Go Public. Psychol Sci 2009; 20(5): 612--618.","paperID":"None"},{"content":"Goodrich DE, Larkin AR, Lowery JC, Holleman RG, Richardson CR. Adverse events among high-risk participants in a home-based walking study: a descriptive study. Int J Behav Nutr Phys Act 2007; 4: 20.","paperID":"None"},{"content":"Greaves CJ, Sheppard KE, Abraham C, Hardeman W, Roden M, Evans PH, Schwarz P. Systematic review of reviews of intervention components associated with increased effectiveness in dietary and physical activity interventions. BMC Public Health 2011; 11(1): 119.","paperID":"None"},{"content":"Hollenbeck JR, Williams CR, Klein HJ. An empirical examination of the antecedents of commitment to difficult goals. J Appl Psychol 1989; 74(1): 18--23.","paperID":"None"},{"content":"Kahn EB, Ramsey LT, Brownson RC, Heath GW, Howze EH, Powell KE, Stone EJ, Rajab MW, Corso P. The effectiveness of interventions to increase physical activity: A systematic review. Am J Prev Med 2002; 22(4): 73--107.","paperID":"None"},{"content":"James J. Lin , Lena Mamykina , Silvia Lindtner , Gregory Delajoux , Henry B. Strub, Fish'n'Steps: encouraging physical activity with an interactive computer game, Proceedings of the 8th international conference on Ubiquitous Computing, p.261-278, September 17-21, 2006, Orange County, CA","paperID":"2166299"},{"content":"Locke EA, Latham GP. Building a practically useful theory of goal setting and task motivation: A 35-year odyssey. Am Psychol 2002; 57(9): 705--717.","paperID":"None"},{"content":"Michie S, Abraham C, Whittington C, McAteer J, Gupta S. Effective Techniques in Healthy Eating and Physical Activity Interventions: A Meta-Regression. Health Psychol 2009; 28(6).","paperID":"None"},{"content":"Munson SA, Consolvo S. Exploring Goal-setting, Rewards, Self-monitoring, and Sharing to Motivate Physical Activity, Pervasive Health 2012.","paperID":"None"},{"content":"Sean A. Munson , Debra Lauterbach , Mark W. Newman , Paul Resnick, Happier together: integrating a wellness application into a social network site, Proceedings of the 5th international conference on Persuasive Technology, p.27-39, June 07-10, 2010, Copenhagen, Denmark","paperID":"2164022"},{"content":"Murphy MH, Nevill AM, Murtagh EM, Holder RL.The effect of walking on fitness, fatness and resting blood pressure: A meta-analysis of randomised, controlled trials. Prev Med 2007; 44(5): 377--85.","paperID":"None"},{"content":"Mark W. Newman , Debra Lauterbach , Sean A. Munson , Paul Resnick , Margaret E. Morris, It's not that i don't have problems, i'm just not putting them on facebook: challenges and opportunities in using online social networks for health, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958876"},{"content":"Richardson CR, Buis LR, Janney AW, Goodrich DE, Sen A, Hess ML, Mehari KS, Fortlage LA, Resnick PJ, Zikmund-Fisher BJ, Strecher VJ, Piette JD. An Online Community Improves Adherence in an InternetMediated Walking Program. Part 1: Results of a Randomized Controlled Trial. J Med Internet Res 2010; 12(4): e71.","paperID":"None"},{"content":"Richardson CR, Mehari KS, McIntyre LG, Janney AW, Fortlage LA, Sen A, Strecher VJ, Piette JD. A randomized trial comparing structured and lifestyle goals in an internet-mediated walking program for people with type 2 diabetes. Int J Behav Nutr Phys Act 2007; 4: 59.","paperID":"None"},{"content":"Richardson CR, Newton TL, Abraham JJ, Sen A, Jimbo M, Swartz AM. A meta-analysis of pedometer-based walking interventions and weight loss. Ann Fam Med 2008; 6(1): 69--77.","paperID":"None"},{"content":"Salancik G. Commitment and the control of organizational behavior and belief. in New directions in organizational behavior, B. Staw and G. Salancik, eds. 1977, Krieger. 1--54.","paperID":"None"},{"content":"Schelling TC. Self-Command in Practice, in Policy, and in a Theory of Rational Choice. The American Economic Review 1984; 74(2): 1--11.","paperID":"None"},{"content":"Strecher VJ, Seijts GH, Kok GJ, Glasgow R, DeVellis B, Meertens RM, Bulger DW. Goal Setting as a Strategy for Health Behavior Change, Health Educ Behav 1995; 22(2).","paperID":"None"},{"content":"Teodoro R, Naaman M. Fitter with Twitter: Understanding Personal Health and Fitness Activity in Social Media. ICWSM 2013.","paperID":"None"},{"content":"Tudor-Locke C, Bassett DR, How Many Steps/Day Are Enough?: Preliminary Pedometer Indices for Public Health. Sports Medicine 2004; 34(1): 1--8.","paperID":"None"},{"content":"U.S. Dept. of Health and Human Services, Physical Activity and Health: A Report of the Surgeon General, 1996, Center for Disease Control and Prevention, National Center for Chronic Disease Prevention and Health Promotion: Atlanta, GA.","paperID":"None"},{"content":"U.S. Dept. of Health and Human Services. Physical activity data. Healthy People 2020. http://www.healthypeople.gov/2020/topicsobjectives2020/nati onaldata.aspx?topicId=33.","paperID":"None"},{"content":"Wing RR, Jeffery RW. Benefits of recruiting participants with friends and increasing social support for weight loss and maintenance. J Consult Clin Psych 1999; 67(1), 132.","paperID":"None"}],"abstract":"Walking and other forms of physical activity have many health benefits, but people often fail to follow through on their own goals of being more active. To address gaps in current understanding of how to design technology-supported physical activity interventions, we conducted a randomized field experiment of a commitment device: making public announcements. In a control condition, weekly commitments were kept private. In two treatment conditions, they were announced on Facebook and by email. In one of the two, the announcements also included results: whether the previous week's commitment was kept. We find that, with or without public results, these posts can elicit supportive replies from the poster's social networks. People in both public announcements conditions were less likely to make commitments. We conclude that the prospect of public accountability may suppress the making of commitments in a way that counteracts the benefits of that accountability. Designers will need to address this limitation in order to make effective use of public accountability as a commitment device.","video":"http://www.youtube.com/embed/-XJ0yYhNuI8?rel=0","title":"Effects of Public Commitments and Accountability in a Technology-Supported Physical Activity Intervention","filename":"CHI15/p1135","authors":["Sean A. Munson","Erin Krupka","Caroline Richardson","Paul Resnick"],"conference":"CHI '15"}