{"paperId":2702217,"abstract":"Analyzing multiple networks at once is a common yet difficult task in many domains. Using adjacency matrices for this purpose, however, can be effective because of its superior ability to accommodate dense networks in a small area. We evaluate various representations and juxtaposition designs for visualizing adjacency matrices through a series of controlled experiments. We investigate the effect of using square matrices and triangular matrices on the speed and accuracy of performing graphical-perception tasks. Based on human symmetric perception, we propose two alternative juxtaposition designs to the conventional side-by-side juxtaposition, and study how users perform visual search and comparison tasks regarding different juxtaposition types. Our results show that the matrix representations have similar performance, and the matrix juxtaposition types perform differently. With the design guidelines derived from our studies, we present a compact visualization termed TileMatrix for juxtaposing a large number of matrices, and demonstrate its effectiveness in analyzing multi-faceted, time-varying networks using real-world data.","reference":[{"content":"Albers, D., Correll, M., and Gleicher, M. Task-driven evaluation of aggregation in time series visualization. In CHI (2014).","paperID":"None"},{"content":"Alper, B., Bach, B., Henry Riche, N., Isenberg, T., and Fekete, J.-D. Weighted graph comparison techniques for brain connectivity analysis. In CHI (2013).","paperID":"None"},{"content":"Archambault, D., Purchase, H. C., and Pinaud, B. Animation, small multiples, and the effect of mental map preservation in dynamic graphs. TVCG (2011).","paperID":"None"},{"content":"Bach, B., Pietriga, E., and Fekete, J.-D. Visualizing dynamic networks with matrix cubes. In CHI (2014).","paperID":"None"},{"content":"Behrisch, M., Davey, J., Fischer, F., Thonnard, O., Schreck, T., Keim, D., and Kohlhammer, J. Visual analysis of sets of heterogeneous matrices using projection-based distance functions and semantic zoom. Computer Graphics Forum 33, 3 (2014), 411--420.","paperID":"None"},{"content":"Bertin, J. Semiology of graphics: diagrams, networks, maps, 1983.","paperID":"None"},{"content":"Cleveland, W. S., and McGill, R. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American statistical association (1984).","paperID":"None"},{"content":"Dinkla, K., Westenberg, M. A., and van Wijk, J. J. Compressed adjacency matrices: untangling gene regulatory networks. TVCG 18, 12 (2012), 2457--2466.","paperID":"None"},{"content":"Fuchs, J., Fischer, F., Mansmann, F., Bertini, E., and Isenberg, P. Evaluation of alternative glyph designs for time series data in a small multiple setting. In CHI, ACM (2013), 3237--3246.","paperID":"None"},{"content":"Ghoniem, M., Fekete, J.-D., and Castagliola, P. On the readability of graphs using node-link and matrix-based representations: A controlled experiment and statistical analysis. Information Visualization (July 2005).","paperID":"None"},{"content":"Gillan, D. J., and Lewis, R. A componential model of human interaction with graphs: 1. linear regression modeling. Human Factors: The Journal of the Human Factors and Ergonomics Society 36, 3 (1994), 419--440.","paperID":"None"},{"content":"Gleicher, M., Albers, D., Walker, R., Jusufi, I., Hansen, C. D., and Roberts, J. C. Visual comparison for information visualization. Information Visualization 10, 4 (2011), 289--309.","paperID":"None"},{"content":"Heer, J., Kong, N., and Agrawala, M. Sizing the horizon: The effects of chart size and layering on the graphical perception of time series visualizations. In CHI (2009).","paperID":"None"},{"content":"Henry, N., Fekete, J., and McGuffin, M. Nodetrix: a hybrid visualization of social networks. TVCG 13, 6 (Nov 2007), 1302--1309.","paperID":"None"},{"content":"Henry, N., and Fekete, J.-D. Matrixexplorer: a dual-representation system to explore social networks. TVCG 12, 5 (2006), 677--684.","paperID":"None"},{"content":"Henry, N., and Fekete, J.-D. Matlink: Enhanced matrix visualization for analyzing social networks. In Human-computer Interaction (2007).","paperID":"None"},{"content":"Javed, W., and Elmqvist, N. Exploring the design space of composite visualization. In Pacific Visualization Symposium, IEEE (2012), 1--8.","paperID":"None"},{"content":"Javed, W., McDonnel, B., and Elmqvist, N. Graphical perception of multiple time series. TVCG 16, 6 (2010).","paperID":"None"},{"content":"Keller, R., Eckert, C. M., and Clarkson, P. J. Matrices or node-link diagrams: Which visual representation is better for visualising connectivity models' Information Visualization 5, 1 (Mar. 2006), 62--76.","paperID":"None"},{"content":"Lam, H., Munzner, T., and Kincaid, R. Overview use in multiple visual information resolution interfaces. TVCG 13, 6 (2007), 1278--1285.","paperID":"None"},{"content":"Lohse, G. L. A cognitive model for understanding graphical perception. Human-Computer Interaction 8, 4 (1993), 353--388.","paperID":"None"},{"content":"Lohse, J. A cognitive model for the perception and understanding of graphs. In CHI (1991).","paperID":"None"},{"content":"Mueller, C., Martin, B., and Lumsdaine, A. Interpreting large visual similarity matrices. In APVIS (2007), 149--152.","paperID":"None"},{"content":"Robertson, G., Fernandez, R., Fisher, D., Lee, B., and Stasko, J. Effectiveness of animation in trend visualization. TVCG 14, 6 (2008), 1325--1332.","paperID":"None"},{"content":"Simons, D. J., and Levin, D. T. Change blindness. Trends in cognitive sciences 1, 7 (1997), 261--267.","paperID":"None"},{"content":"Tang, J., Rangayyan, R., Xu, J., El Naqa, I., and Yang, Y. Computer-aided detection and diagnosis of breast cancer with mammography: Recent advances. IEEE Transactions on Information Technology in Biomedicine 13, 2 (March 2009), 236--251.","paperID":"None"},{"content":"TODAY, U. Online nba statistics. http://www.usatoday.com/sports/nba/statistics/.","paperID":"None"},{"content":"Tominski, C., Forsell, C., and Johansson, J. Interaction support for visual comparison inspired by natural behavior. TVCG 18, 12 (2012), 2719--2728.","paperID":"None"},{"content":"Tufte, E. Envisioning Information. Graphics Press, 1990.","paperID":"None"},{"content":"Tyler, C. W. Human symmetry perception and its computational analysis. Psychology Press, 2003.","paperID":"None"}],"citation":[],"title":"The Effects of Representation and Juxtaposition on Graphical Perception of Matrix Visualization","filename":"CHI15/p269","authors":["Xiaotong Liu","Han-Wei Shen"],"conference":"CHI '15"}