{"paperId":2702538,"citation":[{"content":"Sarah Webber , Mitchell Harrop , John Downs , Travis Cox , Niels Wouters , Andrew Vande Moere, Everybody Dance Now: Tensions between Participation and Performance in Interactive Public Installations, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838801"}],"reference":[{"content":"S. Benford, C. Magerkurth, and P. Ljungstrand, \"Bridging the Physical and Digital in Pervasive Gaming,\" Commun. ACM, vol. 48, no. 3, pp. 54--57, 2005.","paperID":"None"},{"content":"D. Maynes-Aminzade, R. Pausch, and S. Seitz, \"Techniques for interactive audience participation,\" in Fourth IEEE International Conference on Multimodal Interfaces, 2002. Proceedings, 2002, pp. 15--20.","paperID":"None"},{"content":"\"Kinoautomat.\" [Online]. Available: http://www.kinoautomat.cz/. [Accessed: 03-Jan-2015].","paperID":"None"},{"content":"\"Cinematrix Inc.\" [Online]. Available: http://usa.cinematrix.info/. [Accessed: 03-Jan-2015].","paperID":"None"},{"content":"M. Denninger, \"TED oder die Tele-Demokratie.\" [Online]. Available: http://www.zdfjahrbuch.de/2004/produktion/denninger.htm. [Accessed: 03-Jan-2015].","paperID":"None"},{"content":"B. Gonzalez, E. Carroll, and C. Latulipe, \"Danceinspired Technology, Technology-inspired Dance,\" in Proceedings of the 7th Nordic Conference on HumanComputer Interaction, NY, USA, 2012, pp. 398--407.","paperID":"None"},{"content":"S. Reeves, Designing Interfaces in Public Settings (Human-computer Interaction Series): Understanding the Role of the Spectator in Human-Computer Interaction, 2011th ed. Springer London Ltd, 2013.","paperID":"None"},{"content":"E. Judson and D. Sawada, \"Learning from Past and Present: Electronic Response Systems in College Lecture Halls,\" J. Comput. Math. Sci. Teach., vol. 21, no. 2, pp. 167--181, 2002.","paperID":"None"},{"content":"S. Benford, A. Crabtree, S. Reeves, J. Sheridan, A. Dix, M. Flintham, and A. Drozd, \"The Frame of the Game: Blurring the Boundary Between Fiction and Reality in Mobile Experiences,\" in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, New York, NY, USA, 2006, pp. 427--436.","paperID":"None"}],"abstract":"The Smartphone Project (TSP) is an interactive dance-performance in a professional setting that exploits the communication channels provided by smartphone-apps as a new material in the dance-theatre domain. We present an account of the experience and its staging. Based on an initial study with 36 participants from the audience, we present results and discuss lessons learned from this project that might guide similar future work.","video":"http://www.youtube.com/embed/UpUXYf_Bzek?rel=0","title":"The Smartphone Project: An Augmented Dance Performance","filename":"CHI15/p2569","authors":["Leif Oppermann","Clemens Putschli","Constantin Brosda","Oleksandr Lobunets","Fabien Prioville"],"conference":"CHI '15"}