{"paperId":2702569,"reference":[{"content":"Borgatti, M. Thingiverse: Trefoil tentacle. http://www.thingiverse.com/thing:92103. Last accessed on 08/27/14.","paperID":"None"},{"content":"Calí, J., Calian, D. A., Amati, C., Kleinberger, R., Steed, A., Kautz, J., and Weyrich, T. 3d-printing of non-assembly, articulated models. ACM Trans. Graph. 31, 6 (Nov. 2012).","paperID":"None"},{"content":"Clark, L. How hair gel enables freeform 3d printing with an undo function. Wired.co.uk, July 2013. http://www.wired.co.uk/news/archive/2013-07/25/ undo-3d-printing.","paperID":"None"},{"content":"Clarkson, R. Blossom. http://www.richardclarkson.com/blossom. Last accessed on 01/02/15.","paperID":"None"},{"content":"Follmer, S., Leithinger, D., Olwal, A., Cheng, N., and Ishii, H. Jamming user interfaces: Programmable particle stiffness and sensing for malleable and shape-changing devices. In Proc. UIST'12 (2012).","paperID":"None"},{"content":"Harrison, C., and Hudson, S. E. Providing dynamically changeable physical buttons on a visual display. In Proc. CHI'09 (2009), 299--308.","paperID":"None"},{"content":"Kataria, A., and Rosen, D. W. Building around inserts: methods for fabricating complex devices in stereolithography. Rapid Prototyping Journal 7, 5 (2001), 253--262.","paperID":"None"},{"content":"Lee, J. C., Dietz, P. H., Leigh, D., Yerazunis, W. S., and Hudson, S. E. Haptic pen: A tactile feedback stylus for touch screens. In Proc. UIST'04 (2004), 291--294.","paperID":"None"},{"content":"Malone, E., and Lipson, H. Multi-material freeform fabrication of active systems. In Proc. ESDA'08 (2008).","paperID":"None"},{"content":"Mosadegh, B., Polygerinos, P., Keplinger, C., Wennstedt, S., Shepherd, R. F., Gupta, U., Shim, J., Bertoldi, K., Walsh, C. J., and Whitesides, G. M. Soft robotics: Pneumatic networks for soft robotics that actuate rapidly. Advanced Functional Materials 24, 2109 (2014).","paperID":"None"},{"content":"Ou, J., Yao, L., Tauber, D., Steimle, J., Niiyama, R., and Ishii, H. jamsheets: Thin interfaces with tunable stiffness enabled by layer jamming. In Proc. TEI'14 (2014).","paperID":"None"},{"content":"Robins, M., and Bean, H. Variable force camera control, Oct. 4 2005. US Patent 6952528.","paperID":"None"},{"content":"Russell, L. 3d printed pneumatic gripper. http:// getitmade.com.au/3d-Printed-Pneumatic-Gripper. Last accessed on 08/27/14.","paperID":"None"},{"content":"Savage, V., Schmidt, R., Grossman, T., Fitzmaurice, G., and Hartmann, B. A series of tubes: Adding interactivity to 3d prints using internal pipes. In Proc. UIST'14 (2014).","paperID":"None"},{"content":"Shkolnikov, V., Ramunas, J., and Santiago, J. G. A self-priming, roller-free, miniature, peristaltic pump operable with a single, reciprocating actuator. Sensors and Actuators A: Physical 160, 1 (2010), 141--146.","paperID":"None"},{"content":"Skouras, M., Thomaszewski, B., Bickel, B., and Gross, M. Computational design of rubber balloons. Proc. Eurographics (2012).","paperID":"None"},{"content":"Slyper, R., and Hodgins, J. Prototyping robot appearance, movement, and interactions using flexible 3d printing and air pressure sensors. In Proc. RO-MAN'12 (2012).","paperID":"None"},{"content":"Slyper, R., Poupyrev, I., and Hodgins, J. Sensing through structure: Designing soft silicone sensors. In Proc. TEI'11, ACM (New York, NY, USA, 2011), 213--220.","paperID":"None"},{"content":"Stanley, A., Gwilliam, J., and Okamura, A. Haptic jamming: A deformable geometry, variable stiffness tactile display using pneumatics and particle jamming. In World Haptics Conference (WHC) (April 2013).","paperID":"None"},{"content":"Uribe, C. D. G. Multi-material Molding and Casting Mid-sole. Master's thesis, MIT Media Lab, 2014.","paperID":"None"},{"content":"Vertegaal, R., and Poupyrev, I. Organic user interfaces. Communications of the ACM 51, 6 (2008), 26--30.","paperID":"None"},{"content":"Walus, K. Thingiverse: Adjustable one way valve. http://www.thingiverse.com/thing:62728. Last accessed on 08/28/14.","paperID":"None"},{"content":"Willis, K., Brockmeyer, E., Hudson, S., and Poupyrev, I. Printed optics: 3d printing of embedded optical elements for interactive devices. In Proc. UIST'12 (2012).","paperID":"None"},{"content":"Yao, L., Niiyama, R., Ou, J., Follmer, S., Della Silva, C., and Ishii, H. Pneui: Pneumatically actuated soft composite materials for shape changing interfaces. In Proc. UIST'13 (2013), 13--22.","paperID":"None"}],"citation":[{"content":"Jifei Ou , Felix Heibeck , Hiroshi Ishii, TEI 2016 Studio: Inflated Curiosity, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2854119"},{"content":"Kristian Gohlke , Eva Hornecker , Wolfgang Sattler, Pneumatibles: Exploring Soft Robotic Actuators for the Design of User Interfaces with Pneumotactile Feedback, Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, February 14-17, 2016, Eindhoven, Netherlands","paperID":"2839489"}],"abstract":"We explore 3D printing physical controls whose tactile response can be manipulated programmatically through pneumatic actuation. In particular, by manipulating the internal air pressure of various pneumatic elements, we can create mechanisms that require different levels of actuation force and can also change their shape. We introduce and discuss a series of example 3D printed pneumatic controls, which demonstrate the feasibility of our approach. This includes conventional controls, such as buttons, knobs and sliders, but also extends to domains such as toys and deformable interfaces. We describe the challenges that we faced and the methods that we used to overcome some of the limitations of current 3D printing technology. We conclude with example applications and thoughts on future avenues of research.","video":"http://www.youtube.com/embed/-4gFYvhkz0Y?rel=0","title":"3D Printing Pneumatic Device Controls with Variable Activation Force Capabilities","filename":"CHI15/p1295","authors":["Marynel Vázquez","Eric Brockmeyer","Ruta Desai","Chris Harrison","Scott E. Hudson"],"conference":"CHI '15"}