{"paperId":2702582,"citation":[],"reference":[{"content":"Fallot-Burghardt, W., Fjeld, M., Speirs, C., Ziegenspeck, S., Krueger, H., and Lubli, T. Touch&type: a novel pointing device for notebook computers. In NordiCHI'06 (2006), 465--468.","paperID":"None"},{"content":"Habib, I., Berggren, N., Rehn, E., Josefsson, G., Kunz, A., and Fjeld, M. Dgts: Integrated typing and pointing. INTERACT '09, Springer-Verlag (Berlin, Heidelberg, 2009), 232--235.","paperID":"None"},{"content":"Rekimoto, J. Smartskin: An infrastructure for freehand manipulation on interactive surfaces. CHI '02, ACM (New York, NY, USA, 2002), 113--120.","paperID":"None"},{"content":"Rekimoto, J. Thumbsense: Automatic input mode sensing for touchpad-based interactions. CHI EA '03, ACM (New York, NY, USA, 2003), 852--853.","paperID":"None"},{"content":"Taylor, S., Keskin, C., Hilliges, O., Izadi, S., and Helmes, J. Type-hover-swipe in 96 bytes: A motion sensing mechanical keyboard. CHI '14, ACM (New York, NY, USA, 2014), 1695--1704.","paperID":"None"}],"abstract":"We present FlickBoard, which combines a touchpad and a keyboard into the same interaction area to reduce hand movement between a separate keyboard and touchpad. Our main contribution is automatic mode switching between typing and pointing, and the first system capable of combining a trackpad and a keyboard into an single interaction area without the need for external switches. We developed a prototype by embedding a 58x20 capacitive sensing grid into a soft keyboard cover, and used machine learning to distinguish between moving a cursor (touchpad mode) and entering text (keyboard mode). We conducted experimental studies that show automatic mode switching classification accuracies of 98% are achievable with our technology. Finally, our prototype has a thin profile and can be placed over existing keyboards.","video":"http://www.youtube.com/embed/kGpnxgDT2M4?rel=0","title":"FlickBoard: Enabling Trackpad Interaction with Automatic Mode Switching on a Capacitive-sensing Keyboard","filename":"CHI15/p1847","authors":["Ying-Chao Tung","Ta Yang Cheng","Neng-Hao Yu","Chiuan Wang","Mike Y. Chen"],"conference":"CHI '15"}