{"paperId":2702283,"abstract":"Come_IN computer clubs are an established approach to support inter-cultural and inter-generational learning in German neighborhoods. We explore the adaptation of the come_IN concept to the Palestinian context as a means to bridge the social and economic divide that has plagued West Bank society for a period of more than six decades. Social exclusion, political conflicts and prolonged military occupation have kept the refugee camps in a perpetual state of marginalization. In this paper we report on our work in Al Amari-- a Palestinian refugee camp adjacent to the city of Ramallah. We examine how the computer club enables the emergence of social ties among residents of the camp and university students acting as tutors. Even though the ties are small-scale and informal, they have the potential to generate new and wider opportunities for exchange that may eventually support more social integration between the camp's marginalized population and the wider Palestinian population.","reference":[{"content":"Aal, K., Yerousis, G., Schubert, K., Hornung, D., Stickel, O., and Wulf, V. Come_in@palestine: adapting a german computer club concept to a Palestinian refugee camp. In Proc. CABS 2014, ACM Press (2014), 111120.","paperID":"None"},{"content":"Al-Husseini, J. UNRWA and its needs. Position Paper by Ibrahim Abu-Lughod Institute of International Studies. Birzeit University, (April 2011).","paperID":"None"},{"content":"Asthana, S. and Havandjian, N.R. Youth Media Imaginiaries in Palestine: A Hermeneutic Exploration. European Scientific Journal 9, 10 (2014).","paperID":"None"},{"content":"Bar-On, D. and Kassem, F. Storytelling as a Way to Work Through Intractable Conflicts: The GermanJewish Experience and Its Relevance to the PalestinianIsraeli Context. Journal of Social Issues 60, 2 (2004), 289--306","paperID":"None"},{"content":"Baumer, E. and Silberman, M. 2011. When the implication is not to design (technology). Proceedings of CHI-2011. pp 2271--2274","paperID":"None"},{"content":"Chomsky, N. and Pappe,I. 2010. Gaza in Crisis: Reflections on Israel's War Against Palestinians. London: The Penguin Group","paperID":"None"},{"content":"Hart, J. Empowerment or Frustration? Participatory programming with young Palestinians. Children Youth and Environments 17, 3 (2007), pp. 1--23.","paperID":"None"},{"content":"Helsper, E. 2008. Digital Inclusion: An Analysis of Social Disadvantage and the Information Society. Department for Communities and Local Government. London, UK.","paperID":"None"},{"content":"Khalidi, R. 2007. The Iron Cage. Oxford: OneWorld Publications","paperID":"None"},{"content":"Light, J.S. 2001. Rethinking The Digital Divide. Harvard Educational Review, Vol. 71 (4), pp. 709--734","paperID":"None"},{"content":"McTaggart, R. and Kemmis, S. The action research planner. Deakin university, 1988.","paperID":"None"},{"content":"Mehra, B., Merkel, C., and Bishop, A.P. The internet for empowerment of minority and marginalized users. New Media & Society 6, 6 (2004), 781--802.","paperID":"None"},{"content":"Miessen, M. Die Gewalt der Partizipation: Räumliche Praktiken jenseits des Konsensmodells. Eurozine, 2007.","paperID":"None"},{"content":"Mouffe, C. Artistic activism and agonistic spaces. Art & Research 1, 2 (2007), 1--5.","paperID":"None"},{"content":"Palestinian Central Bureau of Statistics. Press Release on International Refugee Day. Ramallah, (20 June, 2013)","paperID":"None"},{"content":"PASSIA. Palestinian Refugees: Endless Injustice. Palestinian Academic Society for the Study of International Affairs (March 2014).","paperID":"None"},{"content":"Peace Now Settlement Watch team. Breaking the Law in the West Bank -- One Violation Leads to Another: Israeli Settlement Building on Private Palestinian Property (March 2007). Retrieved September 1, 2014 from http://peacenow.org.il/eng/sites/default/files/Breaking_T he_Law_formal%20data_March07Eng.pdf","paperID":"None"},{"content":"Resnick, M., Rusk, N., and Cooke, S. The Computer Clubhouse: Technological Fluency in the Inner City. In High Technology and Low-Income Communities 1998, MIT Press (1998), pp. 266--286.","paperID":"None"},{"content":"Sawhney, N. Voices beyond walls: the role of digital storytelling for empowering marginalized youth in refugee camps. ACM Press (2009), 302.","paperID":"None"},{"content":"Schubert, K., Weibert, A., and Wulf, V. Locating computer clubs in multicultural neighborhoods: How collaborative project work fosters integration processes. International Journal of Human-Computer Studies 69, 10 (2011), 669--678.","paperID":"None"},{"content":"Shabaneh, G. Education and Identity: The Role of UNRWA's Education Programmes in the Reconstruction of Palestinian Nationalism. Journal of Refugee Studies, 4,25 (2012), pp. 491--513.","paperID":"None"},{"content":"Stevens, G., Veith, M., Wulf, V. Bridging among Ethnic Communities by Cross-cultural Communities of Practice. In Communities and Technologies 2005. Springer, 2005, pp 377--396","paperID":"None"},{"content":"Tacchi, J., Slater, D. and Hearn, G. 2003. Ethnographic Action Research: A User's Handbook. UNESCO","paperID":"None"},{"content":"Wahbeh, N. ICT and Education in Palestine: Social and Educational Inequalities in Access to ICT","paperID":"None"},{"content":"Wulf, V., Aal, K., Abu Kteish, I., Atam, M., Schubert, K., Rohde, M., Yerousis, G. & Randall, D. (2013, April). Fighting against the wall: Social media use by political activists in a Palestinian village. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 1979--1988). ACM.","paperID":"None"},{"content":"Intel Computer Clubhouse Network. http://www.computerclubhouse.org/locations","paperID":"None"},{"content":"Electricity learning kits. Jumbo Trading. http://jumbotrading.com/","paperID":"None"},{"content":"Cubeteam. https://cubeteam.io/","paperID":"None"},{"content":"Anchor Institutions Tool. https://www.nettercenter.upenn.edu/anchortoolkit/whatanchor-institution","paperID":"None"}],"citation":[],"title":"Computer-Enabled Project Spaces: Connecting with Palestinian Refugees across Camp Boundaries","filename":"CHI15/p3749","authors":["George Yerousis","Konstantin Aal","Thomas von Rekowski","David W. Randall","Markus Rohde","Volker Wulf"],"conference":"CHI '15"}