{"paperId":2702595,"abstract":"Providing access to and training in ICTs is seen as key to bridging the digital divide between technology-rich communities and those with poor IT infrastructures. Several projects have focused on providing ICTs for education in developing countries, of which the best known is One Laptop Per Child (OLPC). Although, there has been significant criticism of some of these projects, in particular OLPC, due to its use of a top-down implementation strategy and the limited evidence for its educational benefits, there has been comparatively little analysis of what underlies successful approaches. We aimed to address this deficit by conducting an ethnographic study of community-based projects organised by Blue Sparrow, a small charity that donates refurbished desktop computers to schools in rural Peru, as this organisation has experienced both successes and failures when implementing its educational technology projects. The relative success of Blue Sparrow highlights the benefits of: understanding local contexts; using a bottom up approach; involving stakeholders in setting programme objectives; and empowering communities. We argue that the educational impact of such projects can be improved by: providing teacher training; integrating computers into the wider curriculum; and providing teaching materials and clear objectives for volunteers.","citation":[{"content":"Alessandro Soro , Margot Brereton , Anita Lee Hong , Paul Roe, Bi-Cultural Content Publication on a Digital Noticeboard: a Design and Cultural Differences Case Study, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838813"}],"reference":[{"content":"Mara Balestrini , Jon Bird , Paul Marshall , Alberto Zaro , Yvonne Rogers, Understanding sustained community engagement: a case study in heritage preservation in rural argentina, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557323"},{"content":"Blue Sparrow. (n.d.). Conectados. Retrieved July 19th 2013 from http://bluesparrow.org/projects/conectados/","paperID":"None"},{"content":"Camfield, J., Kobulsky, A., Paris, J., & Vonortas, N. 2007. A report card for One Laptop Per Child. Closing the Digital Divide via ICTs and Education: Successes and Failures.http://joncamfield.com/writing/Camfield_Rep ort_Card_for_OLPC. pdf.","paperID":"None"},{"content":"Ruy Cervantes , Mark Warschauer , Bonnie Nardi , Nithya Sambasivan, Infrastructures for low-cost laptop use in Mexican schools, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979082"},{"content":"Cristia, J., Ibarrarán, P., Cueto, S., Santiago, A., & Severín, E. 2012. Technology and child development: Evidence from the one laptop per child program. InterAmerican Development Bank","paperID":"None"},{"content":"Cuban, L., Kirkpatrick, H., & Peck, C. High access and low use of technologies in high school classrooms: Explaining an apparent paradox. American Educational Research Journal, 38, 4 (2001), 813--834.","paperID":"None"},{"content":"Dangwal, R., & Kapur, P. Children's learning processes using unsupervised \"hole in the wall\" computers in shared public spaces. Australasian Journal of Educational Technology, 24,3 (2008), 339--354.","paperID":"None"},{"content":"Susan M. Dray , David A. Siegel , Paula Kotzé, Indra's Net: HCI in the developing world, interactions, v.10 n.2, March + April 2003","paperID":"637860"},{"content":"Heath, S., Charles, V., Crow, G., & Wiles, R. Informed consent, gatekeepers and go betweens: negotiating consent in child and youth orientated institutions. British Educational Research Journal, 33, 3 (2007), 403--417.","paperID":"None"},{"content":"Heeks, R. Information systems and developing countries: Failure, success, and local improvisations. The information society, 18, 2 (2002), 101--112.","paperID":"None"},{"content":"Heeks, R. Do information and communication technologies (ICTs) contribute to development? Journal of International Development, 22, 5 (2010), 625--640.","paperID":"None"},{"content":"Juan Pablo Hourcade , Daiana Beitler , Fernando Cormenzana , Pablo Flores, Early olpc experiences in a rural uruguayan school, CHI '08 Extended Abstracts on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1358707"},{"content":"Kenneth L. Kraemer , Jason Dedrick , Prakul Sharma, One laptop per child: vision vs. reality, Communications of the ACM, v.52 n.6, June 2009","paperID":"1516063"},{"content":"Lei, J., & Zhao, Y. One-to-one computing: what does it bring to schools? Journal of Educational Computing Research, 39, 2 (2008), 97--122.","paperID":"None"},{"content":"Andrew Maunder , Gary Marsden , Richard Harper, Making the link-providing mobile media for novice communities in the developing world, International Journal of Human-Computer Studies, v.69 n.10, p.647-657, September, 2011","paperID":"2025617"},{"content":"David R. Millen, Rapid ethnography: time deepening strategies for HCI field research, Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques, p.280-286, August 17-19, 2000, New York City, New York, USA","paperID":"347763"},{"content":"Mitra, S. Self organising systems for mass computer literacy: Findings from the 'hole in the wall' experiments. Int. Journal of Development Issues, 4, 1(2005). 71--81.","paperID":"None"},{"content":"Mitra, S., & Dangwal, R. Limits to self-organising systems of learning-the Kalikuppam experiment. British Journal of Educational Technology, 41, 5 (2010), 672--688.","paperID":"None"},{"content":"Mitra, S., Dangwal, R., & Thadani, L. Effects of remoteness on the quality of education: A case study from North Indian schools. Australasian Journal of Educational Technology, 24, 2 (2008), 168--180.","paperID":"None"},{"content":"Negroponte, N. (2006). One Laptop per Child. Retrieved June 23rd 2013 from http://www.ted.com/talks/nicholas_negroponte_on_one _laptop_per_child.html","paperID":"None"},{"content":"OLPC. (2012) An Interview with Sandro Marcone About Peru's Una Laptop por Niño See more at: http://www.olpcnews.com/countries/peru/english_sum mary_at_the_end.html#sthash.jwWNkjUe.dpuf","paperID":"None"},{"content":"Patra, R., Pal, J., Nedevschi, S., Plauche, M., & Pawar, U. (2007). Usage models of classroom computing in developing regions. In Information and Communication Technologies and Development, International Conference on (pp. 1--10). IEEE.","paperID":"None"},{"content":"Papert, S. (2006). Seymour Papert on USINFO. Retrieved August 29th 2013 from http://www.olpctalks.com/seymour_papert/seymour_pa pert_usinfo.html","paperID":"None"},{"content":"Thomas Reitmaier , Nicola J. Bidwell , Gary Marsden, Field testing mobile digital storytelling software in rural Kenya, Proceedings of the 12th international conference on Human computer interaction with mobile devices and services, September 07-10, 2010, Lisbon, Portugal","paperID":"1851649"},{"content":"Santiago, A., Severín, E., Cristia, J., Ibarrarán, P., Thompson, J., & Cueto, S. (2010). Experimental assessment of the program 'One Laptop Per Child' in Peru. Inter-American Development Bank.","paperID":"None"},{"content":"Schafft, K. A., Alter, T. R., & Bridger, J. C. (2006). Bringing the community along: A case study of a school district's information technology rural development initiative. Journal of Research in Rural Education, 21(8), 1--10.","paperID":"None"},{"content":"Nick Taylor , Keith Cheverst , Peter Wright , Patrick Olivier, Leaving the wild: lessons from community technology handovers, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466206"},{"content":"Walton, M., & Heeks, R. (2011). Can a process approach improve ICT4D project success? Development Informatics Group.","paperID":"None"},{"content":"Warschauer, M. 2003. Dissecting the 'digital divide': A case study in Egypt. The Information Society, 19(4), 297--304.","paperID":"None"},{"content":"Mark Warschauer, Technology and Social Inclusion: Rethinking the Digital Divide, The MIT Press, 2004","paperID":"1036234"},{"content":"Warschauer, M., & Ames, M. (2010). Can One Laptop per Child save the world's poor? Journal of International Affairs, 64(1), 33--51.","paperID":"None"},{"content":"Warschauer, M., Cotten, S. R., & Ames, M. G. (2011). One laptop per child Birmingham: Case study of a radical experiment. International Journal of Learning, 3(2), 61--76.","paperID":"None"},{"content":"Warschauer, M., Knobel, M., & Stone, L. (2004). Technology and equity in schooling: Deconstructing the digital divide. Educational Policy, 18(4), 562--588.","paperID":"None"}],"title":"Más Tecnologia, Más Cambio?: Investigating an Educational Technology Project in Rural Peru","filename":"CHI15/p447","authors":["Emeline Therias","Jon Bird","Paul Marshall"],"conference":"CHI '15"}