{"paperId":2702475,"abstract":"We describe a multimodal method for the analysis of co-design outcomes in participatory design (PD) with children. The multimodal approach we take allows researchers to treat both verbal (notes, writings) and tangible material out-comes as complementary ways of communicating design ideas. We argue that an integrated approach in which both PD outcomes are compared and contrasted can result in a richer analysis, in which underlying values can be identified more clearly. To illustrate the method, we describe a PD process with primary school children.","citation":[{"content":"Gabriella Dodero , Rosella Gennari , Alessandra Melonio , Santina Torello, \"There Is No Rose Without A Thorn\": An Assessment of a Game Design Experience for Children, Proceedings of the 11th Biannual Conference on Italian SIGCHI Chapter, September 28-30, 2015, Rome, Italy","paperID":"2808436"},{"content":"Maarten Van Mechelen , Bieke Zaman , Ann Laenen , Vero Vanden Abeele, Challenging group dynamics in participatory design with children: lessons from social interdependence theory, Proceedings of the 14th International Conference on Interaction Design and Children, p.219-228, June 21-24, 2015, Boston, Massachusetts","paperID":"2771862"}],"reference":[{"content":"Jeffrey Bardzell, Interaction criticism: An introduction to the practice, Interacting with Computers, v.23 n.6, p.604-621, November, 2011","paperID":"2070200"},{"content":"Bjerknes, G. Ehn, P., and Kyng, M. (1987) . Computers and democracy: A Scandinavian challenge. Brookfield.","paperID":"None"},{"content":"Buckingham, D. (2009). 'Creative' visual methods in media research: possibilities, problems and proposals. Media, Culture and Society, 31, 633--652.","paperID":"None"},{"content":"Guha, M.L., Druin, A. & Fails, J.A. (2013). Cooperative Inquiry revisited: Reflections of the past and guidelines for the future of intergenerational co-design. Int. J. of Child-Computer Interaction, 1(1), 14--23.","paperID":"None"},{"content":"Halloran, J., Hornecker, E., & Stringer, M. (2009). The value of values: Resourcing co-design of ubiquitous computing. CoDesign 4 (5), 245--273.","paperID":"None"},{"content":"Ole Sejer Iversen , Kim Halskov , Tuck Wah Leong, Rekindling values in participatory design, Proceedings of the 11th Biennial Participatory Design Conference, November 29-December 03, 2010, Sydney, Australia","paperID":"1900455"},{"content":"Jewitt, C. (2013) Multimodal Methods for Researching Digital Technologies. In: Price, S., Jewitt, C., Brown, B. (Eds.) The SAGE Handbook of Digital Technology Research, pp. 250--265. Sage.","paperID":"None"},{"content":"Kress, G. (2010) Multimodality. A Social Semiotic Approach to Contemporary Communication. Routledge.","paperID":"None"},{"content":"Rokeach, M. (1973). The Nature of Human Values. Free Press.","paperID":"None"},{"content":"Mike Scaife , Yvonne Rogers, Kids as informants: telling us what we didn't know or confirming what we knew already?, The design of children's technology, Morgan Kaufmann Publishers Inc., San Francisco, CA, 1998","paperID":"303434"},{"content":"Schön, D. (1984). The Reflective Practitioner: How Professionals Think In Action. Basic Books.","paperID":"None"},{"content":"Douglas Schuler , Aki Namioka, Participatory Design: Principles and Practices, L. Erlbaum Associates Inc., Hillsdale, NJ, 1993","paperID":"563076"},{"content":"Sleeswijk Visser, F., Stappers, P.J., van der Lugt, R., Sanders, E.B.N. (2005). Contextmapping: Experiences from practice. CoDesign 1(2), 119--149.","paperID":"None"},{"content":"Spinuzzi C., 2005, The Methodology of Participatory Design. In: Technical Communication. 52 (2), 163--175.","paperID":"None"},{"content":"Maarten Van Mechelen , Mathieu Gielen , Vero vanden Abeele , Ann Laenen , Bieke Zaman, Exploring challenging group dynamics in participatory design with children, Proceedings of the 2014 conference on Interaction design and children, June 17-20, 2014, Aarhus, Denmark","paperID":"2610469"},{"content":"Greg Walsh , Alison Druin , Mona Leigh Guha , Elizabeth Foss , Evan Golub , Leshell Hatley , Elizabeth Bonsignore , Sonia Franckel, Layered elaboration: a new technique for co-design with children, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753512"}],"title":"Multimodal Analysis in Participatory Design with Children: A Primary School Case Study","filename":"CHI15/p2825","authors":["Jan Derboven","Maarten Van Mechelen","Karin Slegers"],"conference":"CHI '15"}