{"paperId":2702284,"abstract":"Issues of consumer food waste in industrialised countries are becoming an increasing concern and this is paralleled by a growing interest in HCI to support more sustainable consumption practices. In this paper we report on a mobile food waste diary application that was made available on app stores, with the aim of enabling motivated people to reflect on their moments of food waste and to explore rationales. Through analysis of the entries submitted by users of the diary application, we identify instances of reflection located on different levels. The intention of supporting reflection was visible in instances of submitted diary entries where deeper in- sights about the relationships between food waste, previous experiences, habits, knowledge, occurrences and intentions to change were offered.","reference":[{"content":"1. Baumer, E. P., Khovanskaya, V., Matthews, M., Reynolds, L., Schwanda Sosik, V., and Gay, G. Reviewing reflection: On the use of reflection in interactive system design. DIS '14, ACM (New York, NY, USA, 2014), 93--102.","paperID":"None"},{"content":"2. Bolger, N., Davis, A., and Rafaeli, E. Diary methods: Capturing life as it is lived. Annual review of psychology 54, 1 (2003), 579--616.","paperID":"None"},{"content":"3. Boll, S., Henze, N., Pielot, M., Poppinga, B., and Schinke, T. My app is an experiment: Experience from user studies in mobile app stores. Int. J. Mob. Hum. Comput. Interact. 3, 4 (Oct. 2011), 71--91.","paperID":"None"},{"content":"4. Braun, V., and Clarke, V. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.","paperID":"None"},{"content":"5. Cramer, H., Rost, M., Bentley, F., and Shamma, D. A. 2nd workshop on research in the large. using app stores, wide distribution channels and big data in ubicomp research. UbiComp '11, ACM (New York, NY, USA, 2011), 619--620.","paperID":"None"},{"content":"6. Cuellar, A. D., and Webber, M. E. Wasted food, wasted energy: The embedded energy in food waste in the USA. Environmental Science and Technology 44, 16 (July 2010), 6464--6469.","paperID":"None"},{"content":"7. Epstein, D., Cordeiro, F., Bales, E., Fogarty, J., and Munson, S. Taming data complexity in lifelogs: Exploring visual cuts of personal informatics data. In DIS '14, DIS '14, ACM (New York, NY, USA, 2014), 667--676.","paperID":"None"},{"content":"8. Erickson, T., Li, M., Kim, Y., Deshpande, A., Sahu, S., Chao, T., Sukaviriya, P., and Naphade, M. The dubuque electricity portal: Evaluation of a city-scale residential electricity consumption feedback system. CHI '13, ACM (New York, NY, USA, 2013), 1203--1212.","paperID":"None"},{"content":"9. Evans, D. Beyond the throwaway society: Ordinary domestic practice and a sociological approach to household food waste. Sociology 46, 1 (2011), 41--56.","paperID":"None"},{"content":"10. Fleck, R., and Fitzpatrick, G. Reflecting on reflection: framing a design landscape. OZCHI '10, ACM (New York, NY, USA, 2010), 216--223.","paperID":"None"},{"content":"11. Ganglbauer, E., Fitzpatrick, G., and Comber, R. Negotiating food waste: Using a practice lens to inform design. ACM Trans. Comput.-Hum. Interact. 20, 2 (May 2013), 11:1--11:25.","paperID":"None"},{"content":"12. Ganglbauer, E., Fitzpatrick, G., and Molzer, G. Creating visibility: Understanding the design space for food waste. MUM '12, ACM (New York, NY, USA, 2012), 1:1--1:10.","paperID":"None"},{"content":"13. Glanz, R. Causes of food waste generation in households -- an empirical analysis. Master's thesis, University of Natural Resources and Applied Life Sciences Vienna, 2008.","paperID":"None"},{"content":"14. Gustavsson, J., Cederberg, C., Sonesson, U., van Otterdijk, R., and Meybeck, A. Global food losses and food waste. Tech. rep., FAO, 2011.","paperID":"None"},{"content":"15. Khovanskaya, V., Baumer, E. P., Cosley, D., Voida, S., and Gay, G. \"everybody knows what you're doing\": A critical design approach to personal informatics. CHI '13, ACM (New York, NY, USA, 2013), 3403--3412.","paperID":"None"},{"content":"16. Li, I., Dey, A., and Forlizzi, J. A stage-based model of personal informatics systems. CHI '10, ACM (New York, NY, USA, 2010), 557--566.","paperID":"None"},{"content":"17. Pierce, J., Strengers, Y., Sengers, P., and Bødker, S. Introduction to the special issue on practice-oriented approaches to sustainable hci. ACM Trans. Comput.-Hum. Interact. 20, 4 (Sept. 2013), 20:1--20:8.","paperID":"None"},{"content":"18. Pirzadeh, A., He, L., and Stolterman, E. Personal informatics and reflection: A critical examination of the nature of reflection. CHI EA '13, ACM (New York, NY, USA, 2013), 1979--1988.","paperID":"None"},{"content":"19. Quested, T.E., M. E. S. D. P. A. Spaghetti soup: The complex world of food waste behaviours spaghetti soup: The complex world of food waste behaviours. Resources, Conservation and Recycling 79 (October 2013), 43--51.","paperID":"None"},{"content":"20. Quested, T., and Parry, A. New estimates for household food and drink waste in the uk, 2011.","paperID":"None"},{"content":"21. Quested, T. E., Parry, A. D., Easteal, S., and Swannell, R. Food and drink waste from households in the uk. Nutrition Bulletin 36, 4 (2011), 460--467.","paperID":"None"},{"content":"22. Schneider, F., and Lebersorger, S. Untersuchung der lebensmittel im restmüll in einer oberoesterreichischen region. Tech. rep., Institut fuer Abfallwirtschaft, 2009.","paperID":"None"},{"content":"23. Schön, D. Educating the Reflective Practitioner: Toward a New Design for Teaching and Learning in the Professions. Wiley, 1987.","paperID":"None"},{"content":"24. Sengers, P., and Gaver, B. Staying open to interpretation: engaging multiple meanings in design and evaluation. In Proceedings of the 6th conference on Designing Interactive systems, DIS '06, ACM (New York, NY, USA, 2006), 99--108.","paperID":"None"},{"content":"25. Strengers, Y. Smart energy in everyday life: Are you designing for resource man? Interactions 21, 4 (July 2014), 24--31.","paperID":"None"},{"content":"26. Williams, D. M., and Evans, D. R. Current emotion research in health behavior science. Emotion Review 6, 3 (2014), 277--287.","paperID":"None"}],"citation":[{"content":"Fredrik Ohlin , Carl Magnus Olsson, Beyond a utility view of personal informatics: a postphenomenological framework, Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers, September 07-11, 2015, Osaka, Japan","paperID":"2800965"}],"title":"Why and what did we throw out?: Probing on Reflection through the Food Waste Diary","filename":"CHI15/p1105","authors":["Eva Ganglbauer","Geraldine Fitzpatrick","Florian Güldenpfennig"],"conference":"CHI '15"}