{"paperId":2702415,"abstract":"People tend to anthropomorphize agents that look and/or act human, and further, they tend to evaluate such agents more positively. This, in turn, has motivated the development of robotic agents that are humanlike in appearance and/or behavior. Yet, some agents -- often those with highly humanlike appearances -- have been found to elicit the opposite, wherein they are evaluated more negatively than their less humanlike counterparts. These trends are captured by Masahiro Mori's uncanny valley hypothesis, which describes a (uncanny) valley in emotional responding - a switch from affinity to dislike - elicited by agents that are ``too humanlike'. However, while the valley phenomenon has been repeatedly observed via subjective measures, it remains unknown as to whether such evaluations reflect a potential impact to a person's behavior (i.e., aversion). We attempt to address this gap in the literature via a novel experimental paradigm employing both traditional subjective ratings, as well as measures of peoples' behavioral and phsyiological responding. The results show that not only do people rate highly humanlike robots as uncanny, but moreover, they exhibit greater avoidance of such encounters than encounters with less humanlike and human agents. Thus, the findings not only support Mori's hypothesis, but further, they indicate the valley should be taken as a serious consideration for peoples' interactions with humanlike agents.","citation":[],"reference":[{"content":"Sean Andrist , Tomislav Pejsa , Bilge Mutlu , Michael Gleicher, Designing effective gaze mechanisms for virtual agents, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207777"},{"content":"Sean Andrist , Xiang Zhi Tan , Michael Gleicher , Bilge Mutlu, Conversational gaze aversion for humanlike robots, Proceedings of the 2014 ACM/IEEE international conference on Human-robot interaction, March 03-06, 2014, Bielefeld, Germany","paperID":"2559666"},{"content":"Bartneck, C., Kanda, T., Ishiguro, H., and Hagita, N. Is the uncanny valley an uncanny cliff? In Proceedings of RO-MAN (2007), 368--373.","paperID":"None"},{"content":"Bartneck, C., Kanda, T., Ishiguro, H., and Hagita, N. My robotic doppelgänger -- a critical look at the uncanny valley. In Proceedings of RO-MAN (2009), 269--276.","paperID":"None"},{"content":"Christoph Bartneck , Tomohiro Suzuki , Takayuki Kanda , Tatsuya Nomura, The influence of people’s culture and prior experiences with Aibo on their attitude towards robots, AI & Society, v.21 n.1, p.217-230, November 2006","paperID":"1179192"},{"content":"Bebko, G., Franconeri, S., Ochsner, K., and Chiao, J. Look before you regulate: differential perceptual strategies underlying expressive suppression and cognitive reappraisal. Emotion 11 (2011), 732--742.","paperID":"None"},{"content":"Bradley, M. M., Codispoti, M., Cuthbert, B. N., and Lang, P. J. Emotion and motivation i: defensive and appetitive reactions in picture processing. Emotion 1, 3 (2001), 276.","paperID":"None"},{"content":"Brenton, H., Gillies, M., Ballin, D., and Chatting, D. The uncanny valley: does it exist. In Proceedings of HCII (2005).","paperID":"None"},{"content":"Broadbent, E., Kumar, V., Li, X., Sollers, J., Stafford, R. Q., MacDonald, B. A., and Wegner, D. M. Robots with display screens: a robot with a more humanlike face display is perceived to have more mind and a better personality. PloS one 8, 8 (2013), e72589.","paperID":"None"},{"content":"Tyler J. Burleigh , Jordan R. Schoenherr , Guy L. Lacroix, Does the uncanny valley exist? An empirical test of the relationship between eeriness and the human likeness of digitally created faces, Computers in Human Behavior, v.29 n.3, p.759-771, May, 2013","paperID":"2444330"},{"content":"Duffy, B. R. Anthropomorphism and the social robot. Rob. & Aut. Systems 42, 3 (2003), 177--190.","paperID":"None"},{"content":"Fridlund, A. J., and Cacioppo, J. T. Guidelines for human electromyographic research. Psychophysiology 23, 5 (1986), 567--589.","paperID":"None"},{"content":"Girden, E. R. ANOVA: Repeated measures. No. 84. 1992.","paperID":"None"},{"content":"Gray, K., and Wegner, D. M. Feeling robots and human zombies: mind perception and the uncanny valley. Cognition 125, 1 (2012), 125--130.","paperID":"None"},{"content":"Gross, J. J. The emerging field of emotion regulation: an integrative review. Rev. Gen. Psy. 2 (1998), 271--299.","paperID":"None"},{"content":"Gross, J. J., and Thompson, R. A. Emotion regulation: conceptual foundations. Handbook of Emotion Regulation 3 (2007), 24.","paperID":"None"},{"content":"David Hanson , Andrew Olney , Steve Prilliman , Eric Mathews , Marge Zielke , Derek Hammons , Raul Fernandez , Harry Stephanou, Upending the uncanny valley, Proceedings of the 20th national conference on Artificial intelligence, p.1728-1729, July 09-13, 2005, Pittsburgh, Pennsylvania","paperID":"1619636"},{"content":"Chin-Chang Ho , Karl F. MacDorman, Revisiting the uncanny valley theory: Developing and validating an alternative to the Godspeed indices, Computers in Human Behavior, v.26 n.6, p.1508-1518, November, 2010","paperID":"1853509"},{"content":"Kuo, I. H., Rabindran, J. M., Broadbent, E., Lee, Y. I., Kerse, N., Stafford, R., and MacDonald, B. A. Age and gender factors in user acceptance of healthcare robots. In Robot and Human Interactive Communication, 2009. RO-MAN 2009. The 18th IEEE International Symposium on, IEEE (2009), 214--219.","paperID":"None"},{"content":"Lang, P. J., Greenwald, M. K., Bradley, M. M., and Hamm, A. O. Looking at pictures: Affective, facial, visceral, and behavioral reactions. Psychophysiology 30, 3 (1993), 261--273.","paperID":"None"},{"content":"Lewkowicz, D. J., and Ghazanfar, A. A. The development of the uncanny valley in infants. Developmental Psychobiology 54, 2 (2012), 124--132.","paperID":"None"},{"content":"MacDorman, K. F. Subjective ratings of robot video clips for human likeness, familiarity, and eeriness: An exploration of the uncanny valley. In Proceedings of CogSci (2006), 26--29.","paperID":"None"},{"content":"MacDorman, K. F., and Entezari, S. O. Individual differences predict sensitivity to the uncanny valley. Interaction Studies (2015).","paperID":"None"},{"content":"Karl F. MacDorman , Robert D. Green , Chin-Chang Ho , Clinton T. Koch, Too real for comfort? Uncanny responses to computer generated faces, Computers in Human Behavior, v.25 n.3, p.695-710, May, 2009","paperID":"1534982"},{"content":"Karl F. MacDorman , Sandosh K. Vasudevan , Chin-Chang Ho, Does Japan really have robot mania? Comparing attitudes by implicit and explicit measures, AI & Society, v.23 n.4, p.485-510, October 2008","paperID":"1453017"},{"content":"Matsuda, Y.-T., Okamoto, Y., Ida, M., Okanoya, K., and Myowa-Yamakoshi, M. Infants prefer the faces of strangers or mothers to morphed faces: an uncanny valley between social novelty and familiarity. Biology Letters 8, 5 (2012), 725--728.","paperID":"None"},{"content":"Meltzoff, A. N. \"like me\": a foundation for social cognition. Dev. Sci. 10, 1 (2007), 126--134.","paperID":"None"},{"content":"Mitchell, W. J., Szerszen, K. A., Lu, A. S., Schermerhorn, P. W., Scheutz, M., and MacDorman, K. F. A mismatch in the human realism of face and voice produces an uncanny valley. i-Perception 2, 1 (2011), 10.","paperID":"None"},{"content":"Mori, M., MacDorman, K. F., and Kageki, N. The uncanny valley {from the field}. IEEE Robotics & Automation 19, 2 (2012), 98--100.","paperID":"None"},{"content":"Laurel D. Riek , Tal-Chen Rabinowitch , Bhismadev Chakrabarti , Peter Robinson, How anthropomorphism affects empathy toward robots, Proceedings of the 4th ACM/IEEE international conference on Human robot interaction, March 09-13, 2009, La Jolla, California, USA","paperID":"1514158"},{"content":"Rosenthal-von der Putten, A. M., and Kramer, N. C. How design characteristics of robots determine evaluation and uncanny valley related responses. Computers in Human Behavior 36, 0 (2014), 422--439.","paperID":"None"},{"content":"Paul Schermerhorn , Matthias Scheutz , Charles R. Crowell, Robot social presence and gender: do females view robots differently than males?, Proceedings of the 3rd ACM/IEEE international conference on Human robot interaction, March 12-15, 2008, Amsterdam, The Netherlands","paperID":"1349857"},{"content":"Jun'ichiro Seyama , Ruth S. Nagayama, The Uncanny Valley: Effect of Realism on the Impression of Artificial Human Faces, Presence: Teleoperators and Virtual Environments, v.16 n.4, p.337-351, August 2007","paperID":"1288807"},{"content":"Stafford, R. Q., MacDonald, B. A., Jayawardena, C., Wegner, D. M., and Broadbent, E. Mind perception and attitudes towards robots predict use of an eldercare robot. Int. J. Soc. Rob. 6, 1 (2014), 17--32.","paperID":"None"},{"content":"Steckenfinger, S. A., and Ghazanfar, A. A. Monkey visual behavior falls into the uncanny valley. PNAS 106, 43 (2009), 18362--18366.","paperID":"None"},{"content":"Megan Strait , Cody Canning , Matthias Scheutz, Let me tell you! investigating the effects of robot communication strategies in advice-giving situations based on robot appearance, interaction modality and distance, Proceedings of the 2014 ACM/IEEE international conference on Human-robot interaction, March 03-06, 2014, Bielefeld, Germany","paperID":"2559670"},{"content":"Strait, M., and Scheutz, M. Measuring users' responses to humans, robots, and human-like robots with functional near infrared spectroscopy. In Proceedings of RO-MAN (2014), 1128--1133.","paperID":"None"},{"content":"van Reekum, C., Johnstone, T., Urry, H., Thurow, M., and Schaefer, H. Gaze fixations predict brain activation during the voluntary regulation of picture-induced negative affect. Neuroimage 36 (2007), 1041--1055.","paperID":"None"},{"content":"Vujovic, L., Opitz, P. C., Birk, J. L., and Urry, H. L. Cut that's a wrap! Regulating negative emotion by ending emotion-eliciting situations. Frontiers in Psy. 5 (2014).","paperID":"None"},{"content":"Michael L. Walters , Dag S. Syrdal , Kerstin Dautenhahn , René Te Boekhorst , Kheng Lee Koay, Avoiding the uncanny valley: robot appearance, personality and consistency of behavior in an attention-seeking home scenario for a robot companion, Autonomous Robots, v.24 n.2, p.159-178, February  2008","paperID":"1340332"}],"title":"Too Much Humanness for Human-Robot Interaction: Exposure to Highly Humanlike Robots Elicits Aversive Responding in Observers","filename":"CHI15/p3593","authors":["Megan Strait","Lara Vujovic","Victoria Floerke","Matthias Scheutz","Heather Urry"],"conference":"CHI '15"}