{"paperId":2702530,"reference":[{"content":"Chen, H. Y., Santos, J., Graves, M., Kim, K., and Tan, H. Z. Tactor localization at the wrist. Proc. EuroHaptics 2008, Springer Berlin Heidelberg (2008), 209--218.","paperID":"None"},{"content":"Cholewiak, R. W., and Collins, A. A. The generation of vibrotactile patterns on a linear array: Influences of body site, time, and presentation mode. Perception & Psychophysics, 62, 6 (2000), 1220--1235.","paperID":"None"},{"content":"Cholewiak, R. W., and Collins, A. A. Vibrotactile localization on the arm: Effects of place, space, and age. Perception & psychophysics 65, 7 (2003), 1058--1077.","paperID":"None"},{"content":"Geldard, F. A. Sensory saltation: Metastability in the perceptual world. Lawrence Erlbaum, Hillsdale, NJ, USA, 1975.","paperID":"None"},{"content":"Jones, L. A., and Ray, K. Localization and pattern recognition with tactile displays. Proc. Haptics 2008, IEEE (2008), 33--39.","paperID":"None"},{"content":"Lee, S. C., and Starner, T. Mobile gesture interaction using wearable tactile displays. Ext. Abstracts CHI 2009, ACM Press (2009), 3437--3442.","paperID":"None"},{"content":"Lee, S. C., and Starner, T. BuzzWear: alert perception in wearable tactile displays on the wrist. Proc. CHI 2010, ACM Press (2010), 433--442.","paperID":"None"},{"content":"Lindeman, R. W., and Yanagida, Y. Empirical studies for effective near-field haptics in virtual environments. Proc. Virtual Reality 2003, IEEE (2003), 287--288.","paperID":"None"},{"content":"Matscheko, M., Ferscha, A., Riener, A., and Lehner, M. Tactor placement in wrist worn wearables. Proc. ISWC 2010, IEEE (2010), 1--8.","paperID":"None"},{"content":"Oakley, I., Kim, Y., Lee, J., and Ryu, J. Determining the feasibility of forearm mounted vibrotactile displays. In Proc. Haptics 2006, IEEE (2006), 27--34.","paperID":"None"},{"content":"Paneels, S., Anastassova, M., Strachan, S., Van, S. P., Sivacoumarane, S., and Bolzmacher, C. What's around me? Multi-actuator haptic feedback on the wrist. Proc. WHC 2013, IEEE (2013), 407--412.","paperID":"None"},{"content":"Pasquero, J., Stobbe, S. J., and Stonehouse, N. A haptic wristwatch for eyes-free interactions. Proc. CHI 2011, ACM Press (2011), 3257--3266.","paperID":"None"},{"content":"Sofia, K. O., and Jones, L. Mechanical and psychophysical studies of surface wave propagation during vibrotactile stimulation. IEEE Trans. Haptics 6, 3 (2013), 320--329.","paperID":"None"}],"citation":[],"abstract":"A watch-back tactile display (WBTD) is expected to be a viable supplement to the user interface limitations of a smartwatch. However, its design requires that many design parameters such as tactor types and stimulus patterns be determined. We conducted a series of experiments to explore the design space of a WBTD consisting of 3×3 tactors. We demonstrated that tactor types and the temporal patterns and locus of a stimulus produce statistically significant effects on the efficiency of a WBTD. The experimental results can act as a practical guideline for the design of an efficient WBTD.","video":"http://www.youtube.com/embed/BNt1xC9wwLs?rel=0","title":"Investigating the Information Transfer Efficiency of a 3x3 Watch-back Tactile Display","filename":"CHI15/p1229","authors":["Jaeyeon Lee","Jaehyun Han","Geehyuk Lee"],"conference":"CHI '15"}