{"paperId":2702354,"citation":[],"reference":[{"content":"1. Emerald Cloud Laboratory. http://emeraldcloudlab.com (last accessed: 19th Dec 2014).","paperID":"None"},{"content":"2. OSHWA: Open Source Hardware Association. http://www.oshwa.org (last accessed: 10th July 2014).","paperID":"None"},{"content":"3. Raspberry Pi. http://www.raspberrypi.org (last accessed: 10th July 2014).","paperID":"None"},{"content":"4. Synthego. http://www.synthego.com (last accessed: 19th Dec 2014).","paperID":"None"},{"content":"5. Transcriptic. https://www.transcriptic.com (last accessed: 19th Dec 2014).","paperID":"None"},{"content":"6. Adamatzky, A. Physarum machines: computers from slime mould, vol. 74. World Scientific, 2010.","paperID":"None"},{"content":"7. Alim, K., Amselem, G., Peaudecerf, F., Brenner, M. P., and Pringle, A. Random network peristalsis in physarum polycephalum organizes fluid flows across an individual. Proceedings of the National Academy of Sciences 110, 33 (2013), 13306--13311.","paperID":"None"},{"content":"8. Alparslan, E., and Fuatince, M. Image enhancement by local histogram stretching. IEEE Transactions on Systems Man and Cybernetics 11 (1981), pp. 376--385.","paperID":"None"},{"content":"9. Alves, G. R., Ferreira, J. M., Muler, D., Erbe, H., Hine, N., Alves, J. B. M., Pereira, C. E., Chiang, L., Herrera, O., and Sucar, E. 2005 IEEE Conference on Emerging Technologies and Factory Automation. In 2005 IEEE Conference on Emerging Technologies and Factory Automation, IEEE (2005), 1023--1030.","paperID":"None"},{"content":"10. Baker, R. S., and Yacef, K. The state of educational data mining in 2009: A review and future visions. JEDM-Journal of Educational Data Mining 1, 1 (2009), 3--17.","paperID":"None"},{"content":"11. Berland, Matthew and Baker, Rachel and Blikstein, Paulo. (in press) Learning Analytics in Constructivist, Inquiry-based learning environments. Technology, Knowledge, and Learning.","paperID":"None"},{"content":"12. Blikstein, P. Connecting the science classroom and tangible interfaces: the bifocal modeling framework. Proceedings of the 9th International Conference of the Learning Sciences, Chicago, IL. (2010).","paperID":"None"},{"content":"13. Blikstein, P. Gears of our childhood: Constructionist toolkits, robotics, and physical computing, past and future. In Proceedings of the 12th International Conference on Interaction Design and Children, IDC '13, ACM (New York, NY, USA, 2013), 173--182.","paperID":"None"},{"content":"14. Blikstein, P. Multimodal learning analytics. In Proceedings of the Third International Conference on Learning Analytics and Knowledge, ACM (2013), 102--106.","paperID":"None"},{"content":"15. Blikstein, Paulo. (in press) Bifocal Modeling: Comparing Physical and Computational Models Linked in Real Time. Playful Learning Interfaces, 317--352.","paperID":"None"},{"content":"16. Bose, J. C. On the determination of the wave-length of electric radiation by diffraction grating. Proceedings of the Royal Society of London 60, 359--367 (1896), 167--178.","paperID":"None"},{"content":"17. Bose, J. C. Comparative electro-physiology: a physico-physiological study. Longmans, Green, and Co., 1907.","paperID":"None"},{"content":"18. Cooper, S., Khatib, F., Treuille, A., Barbero, J., Lee, J., Beenen, M., Leaver-Fay, A., Baker, D., Popović, Z., and Players, F. Predicting protein structures with a multiplayer online game. Nature 466, 7307 (Aug. 2010), 756--760.","paperID":"None"},{"content":"19. Cooper, S., and Sahami, M. Reflections on stanford's moocs. Communications of the ACM 56, 2 (2013), 28--30.","paperID":"None"},{"content":"20. de Jong, T., Linn, M. C., and Zacharia, Z. C. Physical and Virtual Laboratories in Science and Engineering Education. Science 340, 6130 (Apr. 2013), 305--308.","paperID":"None"},{"content":"21. Emerson, D. The work of jagadis chandra bose: 100 years of millimeter-wave research. Microwave Theory and Techniques, IEEE Transactions on 45, 12 (Dec 1997), 2267--2273.","paperID":"None"},{"content":"22. Esche, S. K., Chassapis, C., Nazalewicz, J. W., and Hromin, D. J. 32nd Annual Frontiers in Education. In Conference on Frontiers in Education, IEEE (2002), T2E'1--T2E'6.","paperID":"None"},{"content":"23. Fessel, A., Oettmeier, C., Bernitt, E., Gauthier, N. C., and Döbereiner, H.-G. Physarum polycephalum percolation as a paradigm for topological phase transitions in transportation networks. Physical review letters 109, 7 (2012), 078103.","paperID":"None"},{"content":"24. Finkelstein, N., Adams, W., Keller, C., Kohl, P., Perkins, K., Podolefsky, N., Reid, S., and LeMaster, R. When learning about the real world is better done virtually: A study of substituting computer simulations for laboratory equipment. Physical Review Special Topics-Physics Education Research 1, 1 (2005), 010103.","paperID":"None"},{"content":"25. Fujita, J., Cassaniga, R., and Fernandez, F. Remote laboratory. In Industrial Electronics, 2003. ISIE'03. 2003 IEEE International Symposium on, vol. 2, IEEE (2003), 1104--1106.","paperID":"None"},{"content":"26. Gomes, L., and Bogosyan, S. Current Trends in Remote Laboratories. IEEE Transactions on Industrial Electronics 56, 12, 4744--4756.","paperID":"None"},{"content":"27. Gravier, C., Fayolle, J., Bayard, B., Ates, M., and Lardon, J. State of the art about remote laboratories paradigms-foundations of ongoing mutations. International Journal of Online Engineering 4, 1 (2008).","paperID":"None"},{"content":"28. Hesselink, L., Rizal, D., and Bjornson, E. Cyberlab: Remote access to laboratories through the world-wide-web. Retrieved September 26, 2005 (2000), 27--39.","paperID":"None"},{"content":"29. Kim, S.-H. Fractal dimensions of a green broccoli and a white cauliflower. arXiv preprint cond-mat/0411597 (2004).","paperID":"None"},{"content":"30. Klahr, D., Triona, L. M., and Williams, C. Hands on what the relative effectiveness of physical versus virtual materials in an engineering design project by middle school children. Journal of Research in Science Teaching 44, 1 (2007), 183--203.","paperID":"None"},{"content":"31. Kong, F., Yuan, L., Zheng, Y. F., and Chen, W. Automatic liquid handling for life science a critical review of the current state of the art. Journal of laboratory automation 17, 3 (2012), 169--185.","paperID":"None"},{"content":"32. Lee, J., Kladwang, W., Lee, M., Cantu, D., Azizyan, M., Kim, H., Limpaecher, A., Yoon, S., Treuille, A., and Das, R. Rna design rules from a massive open laboratory. Proceedings of the National Academy of Sciences (2014), 201313039.","paperID":"None"},{"content":"33. Lloyd, J. W. Practical Advantages of Declarative Programming. In Joint Conference on Declarative Programming, GULP-PRODE, vol. 94 (1994), 94.","paperID":"None"},{"content":"34. Macás, M. E., and Méndez, I. elab-remote electronics lab in real time. In Frontiers In Education Conference-Global Engineering: Knowledge Without Borders, Opportunities Without Passports, 2007. FIE'07. 37th Annual, IEEE (2007), S3G'12.","paperID":"None"},{"content":"35. Nakagaki, T., Yamada, H., and Hara, M. Smart network solutions in an amoeboid organism. Biophysical chemistry 107, 1 (2004), 1--5.","paperID":"None"},{"content":"36. Niizato, T., Shirakawa, T., and Gunji, Y.-P. A Model of Network Formation by Physarum Plasmodium: Interplay Between Cell Mobility and Morphogenesis. Biosystems 100, 2 (2010), 108--112.","paperID":"None"},{"content":"37. Pepperkok, R., and Ellenberg, J. High-throughput fluorescence microscopy for systems biology. Nature Reviews Molecular Cell Biology 7, 9 (2006), 690--696.","paperID":"None"},{"content":"38. Perkins, K., Adams, W., Dubson, M., Finkelstein, N., Reid, S., Wieman, C., and LeMaster, R. Phet: Interactive simulations for teaching and learning physics. The Physics Teacher 44, 1 (2006), 18--23.","paperID":"None"},{"content":"39. Riedel-Kruse, I. H., Chung, A. M., Dura, B., Hamilton, A. L., and Lee, B. C. Design, engineering and utility of biotic games. Lab on a Chip 11, 1 (2011), 14--22.","paperID":"None"},{"content":"40. Romero, C., and Ventura, S. Educational data mining: a review of the state of the art. Systems, Man, and Cybernetics, Part C: Applications and Reviews, IEEE Transactions on 40, 6 (2010), 601--618.","paperID":"None"},{"content":"41. Seung, S. EyeWire. https://eyewire.org, last accessed: 18th September, 2014.","paperID":"None"},{"content":"42. Tero, A., Takagi, S., Saigusa, T., Ito, K., Bebber, D. P., Fricker, M. D., Yumiki, K., Kobayashi, R., and Nakagaki, T. Rules for biologically inspired adaptive network design. Science 327, 5964 (2010), 439--442.","paperID":"None"},{"content":"43. Tero, A., Yumiki, K., Kobayashi, R., Saigusa, T., and Nakagaki, T. Flow-network adaptation in physarum amoebae. Theory in Biosciences 127, 2 (2008), 89--94.","paperID":"None"},{"content":"44. Trietsch, S., Hankemeier, T., and Van der Linden, H. Lab-on-a-chip technologies for massive parallel data generation in the life sciences: A review. Chemometrics and Intelligent Laboratory Systems 108, 1 (2011), 64--75.","paperID":"None"},{"content":"45. Triona, L. M., and Klahr, D. Point and click or grab and heft: Comparing the influence of physical and virtual instructional materials on elementary school students' ability to design experiments. Cognition and Instruction 21, 2 (2003), 149--173.","paperID":"None"},{"content":"46. Van Deursen, A., Klint, P., and Visser, J. Domain-specific languages: An annotated bibliography. Sigplan Notices 35, 6 (2000), 26--36.","paperID":"None"},{"content":"47. Vasilescu, B., Filkov, V., and Serebrenik, A. Stackoverflow and github: associations between software development and crowdsourced knowledge. In Social Computing (SocialCom), 2013 International Conference on, IEEE (2013), 188--195.","paperID":"None"},{"content":"48. Waldrop, M. M. Education online: The virtual lab. confronted with the explosive popularity of online learning, researchers are seeking new ways to teach the practical skills of science. Nature 499, 7458 (2013), 268--270.","paperID":"None"},{"content":"49. Whitesides, G. M. The origins and the future of microfluidics. Nature 442, 7101 (July 2006), 368--373.","paperID":"None"},{"content":"50. Wohlfarth-Bottermann, K. Oscillatory contraction activity in Physarum. Journal of Experimental Biology (1979).","paperID":"None"},{"content":"51. Wong, M. L., and Medrano, J. F. Real-time pcr for mrna quantitation. Biotechniques 39, 1 (2005), 75.","paperID":"None"},{"content":"52. Zacharia, Z. C., Olympiou, G., and Papaevripidou, M. Effects of experimenting with physical and virtual manipulatives on students' conceptual understanding in heat and temperature. Journal of Research in Science Teaching 45, 9 (2008), 1021--1035.","paperID":"None"}],"abstract":"Interacting with biological systems via experiments is important for academia, industry, and education, but access barriers exist due to training, costs, safety, logistics, and spatial separation. High-throughput equipment combined with web streaming could enable interactive biology experiments online, but no such platform currently exists. We present a cloud experimentation architecture (paralleling cloud computation), which is optimized for a class of domain-specific equipments (biotic processing units - BPU) to share and execute many experiments in parallel remotely and interactively at all time. We implemented an instance of this architecture that enables chemotactic experiments with a slime mold Physarum Polycephelum. A user study in the blended teaching and research setting of a graduate-level biophysics class demonstrated that this platform lowers the access barrier for non-biologists, enables discovery, and facilitates learning analytics. This architecture is flexible for integration with various biological specimens and equipments to facilitate scalable interactive online education, collaborations, research, and citizen science.","title":"Interactive Cloud Experimentation for Biology: An Online Education Case Study","filename":"CHI15/p3681","authors":["Zahid Hossain","Xiaofan Jin","Engin W. Bumbacher","Alice M. Chung","Stephen Koo","Jordan D. Shapiro","Cynthia Y. Truong","Sean Choi","Nathan D. Orloff","Paulo Blikstein","Ingmar H. Riedel-Kruse"],"conference":"CHI '15"}