{"paperId":2702200,"abstract":"The evolution of ubiquitous sensing technologies has led to intelligent environments that can monitor and react to our daily activities, such as adapting our heating and cooling systems, responding to our gestures, and monitoring our elderly. In this paper, we ask whether it is possible for smart environments to monitor our vital signs remotely, without instrumenting our bodies. We introduce Vital-Radio, a wireless sensing technology that monitors breathing and heart rate without body contact. Vital-Radio exploits the fact that wireless signals are affected by motion in the environment, including chest movements due to inhaling and exhaling and skin vibrations due to heartbeats. We describe the operation of Vital-Radio and demonstrate through a user study that it can track users' breathing and heart rates with a median accuracy of 99%, even when users are 8~meters away from the device, or in a different room. Furthermore, it can monitor the vital signs of multiple people simultaneously. We envision that Vital-Radio can enable smart homes that monitor people's vital signs without body instrumentation, and actively contribute to their inhabitants' well-being.","citation":[{"content":"Adiyan Mujibiya , Junji Torii, Walls Have Ears: Using Conductive Surfaces of Furniture and Everyday Objects for Room-Wide Power Usage and Crowd Activity Sensing, Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces, November 15-18, 2015, Madeira, Portugal","paperID":"2823487"},{"content":"Phuc Nguyen , Xinyu Zhang , Ann C. Halbower , Tam Vu, Poster: Continuous and Fine-grained Respiration Volume Monitoring Using Continuous Wave Radar, Proceedings of the 21st Annual International Conference on Mobile Computing and Networking, September 07-11, 2015, Paris, France","paperID":"2795177"},{"content":"Biying Fu , Jakob Karolus , Tobias Grosse-Puppendahl , Jonathan Hermann , Arjan Kuijper, Opportunities for activity recognition using ultrasound doppler sensing on unmodified mobile phones, Proceedings of the 2nd international Workshop on Sensor-based Activity Recognition and Interaction, p.1-10, June 25-26, 2015, Rostock, Germany","paperID":"2790046"}],"reference":[{"content":"Alice PDx. http://www.healthcare.philips.com/main/ homehealth/sleep/alicepdx/default.wpd. Phillips.","paperID":"None"},{"content":"FMCW Transceivers. http://www.siversima.com/. SiversIMA.","paperID":"None"},{"content":"iBabyGuard. http://www.ibabyguard.com/.","paperID":"None"},{"content":"Kai Medical. http://www.kaimedical.com/.","paperID":"None"},{"content":"Aardal, O., Paichard, Y., Brovoll, S., Berger, T., Lande, T. S., and Hamran, S.-E. Physical working principles of medical radar. Biomedical Engineering, IEEE Trans. on (2013).","paperID":"None"},{"content":"Fadel Adib , Zachary Kabelac , Dina Katabi , Robert C. Miller, 3D tracking via body radio reflections, Proceedings of the 11th USENIX Conference on Networked Systems Design and Implementation, April 02-04, 2014, Seattle, WA","paperID":"2616478"},{"content":"Anitori, L., de Jong, A., and Nennie, F. Fmcw radar for life-sign detection. In IEEE Radar Conference (2009).","paperID":"None"},{"content":"Guha Balakrishnan , Fredo Durand , John Guttag, Detecting Pulse from Head Motions in Video, Proceedings of the 2013 IEEE Conference on Computer Vision and Pattern Recognition, p.3430-3437, June 23-28, 2013","paperID":"2516035"},{"content":"Javier A. Bargas-Avila , Kasper Hornbæk, Old wine in new bottles or novel challenges: a critical analysis of empirical studies of user experience, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979336"},{"content":"Callahan, J., Cox, D., Hoffman, K., O'shea, D., Pollatsek, H., and Senechal, L. Calculus in context: the five college calculus project, Chapter 7 (Periodicity). WH Freeman, 1995.","paperID":"None"},{"content":"Chi, Y., Jung, T.-P., and Cauwenberghs, G. Dry-contact and noncontact biopotential electrodes: Methodological review. Biomedical Engineering, IEEE Reviews in (2010).","paperID":"None"},{"content":"CNET. Do wristband heart trackers actually work? A checkup. http://www.cnet.com/news/how-accurate-are-wristband-heart-ratemonitors/.","paperID":"None"},{"content":"Cole, C. R., Blackstone, E. H., Pashkow, F. J., Snader, C. E., and Lauer, M. S. Heart-rate recovery immediately after exercise as a predictor of mortality. New England Journal of Medicine (1999).","paperID":"None"},{"content":"de Chazal, P., O'Hare, E., Fox, N., and Heneghan, C. Assessment of sleep/wake patterns using a non-contact biomotion sensor. In IEEE EMBS (2008).","paperID":"None"},{"content":"Droitcour, A. D., Boric-Lubecke, O., and Kovacs, G. T. Signal-to-noise ratio in doppler radar system for heart and respiratory rate measurements. Microwave Theory and Techniques, IEEE Trans. (2009).","paperID":"None"},{"content":"Droitcour, Amy D et. al. Range correlation and i/q performance benefits in single-chip silicon doppler radars for noncontact cardiopulmonary monitoring. Microwave Theory and Techniques, IEEE Trans. (2004).","paperID":"None"},{"content":"Fletcher, R., and Han, J. Low-cost differential front-end for doppler radar vital sign monitoring. In IEEE MTT (2009).","paperID":"None"},{"content":"Garmin. Heart Rate Monitor. https://buy.garmin.com/en-US/US/shopby-accessories/fitness-sensors/heart-rate-monitor/prod10996.html.","paperID":"None"},{"content":"GigaOm. Could a breath-monitoring headset improve your health? http://gigaom.com/2013/09/20/could-a-breath-monitoring-headsetimprove-your-health/.","paperID":"None"},{"content":"Gokalp, H., and Clarke, M. Monitoring activities of daily living of the elderly and the potential for its use in telecare and telehealth: a review. TELEMEDICINE and e-HEALTH (2013).","paperID":"None"},{"content":"Guard, C. Wireless Wristband Pulse Oximeter CMS-50FW With Software For Sleep Study. http://www.clinicalguard.com/wirelesswristband-pulse-oximeter-cms50fw-with-softwarefor-sleep-study-p-455.html.","paperID":"None"},{"content":"Healthcare, F. M. Market for embedded health monitoring-gadgets to hit 170M devices by 2017. http://www.fiercemobilehealthcare.com/story/ market-embedded-health-monitoring-gadgets-hit170m-devices-2017/2012-08-03.","paperID":"None"},{"content":"Leanne M. Hirshfield , Erin Treacy Solovey , Audrey Girouard , James Kebinger , Robert J.K. Jacob , Angelo Sassaroli , Sergio Fantini, Brain measurement for usability testing and adaptive interfaces: an example of uncovering syntactic workload with functional near infrared spectroscopy, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1519035"},{"content":"Imai, K. et. Al. Vagally mediated heart rate recovery after exercise is accelerated in athletes but blunted in patients with chronic heart failure. Journal of the American College of Cardiology (1994).","paperID":"None"},{"content":"InformationWeek. Health-Monitoring Devices Market Outpaces Telehealth. http://www.informationweek.com/mobile/healthmonitoring-devices-market-outpacestelehealth/d/d-id/1104636.","paperID":"None"},{"content":"Jia, Y. et. Al. Through-wall-radar localization for stationary human based on life-sign detection. In IEEE RADAR (2013).","paperID":"None"},{"content":"Ossi Johannes Kaltiokallio , Hüseyin Yigitler , Riku Jäntti , Neal Patwari, Non-invasive respiration rate monitoring using a single COTS TX-RX pair, Proceedings of the 13th international symposium on Information processing in sensor networks, April 15-17, 2014, Berlin, Germany","paperID":"2602347"},{"content":"Lanata, A et. Al. Comparative evaluation of susceptibility to motion artifact in different wearable systems for monitoring respiratory rate.","paperID":"None"},{"content":"Lin, J. et. Al. Microwave apexcardiography. Microwave Theory and Techniques, IEEE Trans. (1979).","paperID":"None"},{"content":"Sascha Mahlke , Manfred Thüring, Studying antecedents of emotional experiences in interactive contexts, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240762"},{"content":"Mayo Clinic. What's a normal resting heart rate? http://www.mayoclinic.org/healthy-living/fitness/expert-answers/heartrate/faq-20057979.","paperID":"None"},{"content":"Jun-Ki Min , Afsaneh Doryab , Jason Wiese , Shahriyar Amini , John Zimmerman , Jason I. Hong, Toss 'n' turn: smartphone as sleep and sleep quality detector, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557220"},{"content":"Alan V. Oppenheim , Ronald W. Schafer, Discrete-time signal processing, Prentice-Hall, Inc., Upper Saddle River, NJ, 1989","paperID":"77000"},{"content":"Patwari, N. et. Al. Breathfinding: A wireless network that monitors and locates breathing in a home. Selected Topics in Signal Processing, IEEE Journal of (2014).","paperID":"None"},{"content":"Petterson, M. et. Al. The effect of motion on pulse oximetry and its clinical significance. Anesthesia & Analgesia (2007).","paperID":"None"},{"content":"Pinheiro, E., Postolache, O., and Girão, P. Theory and developments in an unobtrusive cardiovascular system representation: ballistocardiography. The open biomedical engineering journal (2010).","paperID":"None"},{"content":"Steele, R., Lo, A., Secombe, C., and Wong, Y. K. Elderly persons perception and acceptance of using wireless sensor networks to assist healthcare. International journal of medical informatics (2009).","paperID":"None"},{"content":"Chek Tien Tan , Tuck Wah Leong , Songjia Shen, Combining think-aloud and physiological data to understand video game experiences, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557326"},{"content":"David Tse , Pramod Viswanath, Fundamentals of wireless communication, Cambridge University Press, New York, NY, 2005","paperID":"1111206"},{"content":"U.S. National Library of Medicine MedLine Plus. Heart-respiratory monitor - infantsShare. http://www.nlm.nih.gov/ medlineplus/ency/article/007236.htm.","paperID":"None"},{"content":"U.S. National Library of Medicine MedLine Plus. Rapid Shallow Breathing. http://www.nlm.nih.gov/medlineplus/ency/ article/007198.htm.","paperID":"None"},{"content":"Venkatesh, S., Anderson, C., Rivera, N., and Buehrer, R. Implementation and analysis of respiration-rate estimation using impulse-based uwb. In IEEE MILCOMM (2005).","paperID":"None"},{"content":"Vivonoetics. Respiration: Single or Dual-Band. http://vivonoetics.com/products/vivosense/ analyzing/respiration-single-or-dual-band/.","paperID":"None"},{"content":"Hao-Yu Wu , Michael Rubinstein , Eugene Shih , John Guttag , Frédo Durand , William Freeman, Eulerian video magnification for revealing subtle changes in the world, ACM Transactions on Graphics (TOG), v.31 n.4, p.1-8, July 2012","paperID":"2185561"},{"content":"Xu, Y., Wu, S., Chen, C., Chen, J., and Fang, G. A novel method for automatic detection of trapped victims by ultrawideband radar. Geoscience and Remote Sensing, IEEE Trans. on (2012).","paperID":"None"},{"content":"Rayoung Yang , Mark W. Newman , Jodi Forlizzi, Making sustainability sustainable: challenges in the design of eco-interaction technologies, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557380"},{"content":"Yarovoy, A. et. Al. Uwb radar for human being detection. Aerospace and Electronic Systems Magazine, IEEE (2006).","paperID":"None"},{"content":"Zaffaroni, A., de Chazal, P., Heneghan, C., Boyle, P., Mppm, P. R., and McNicholas, W. T. Sleepminder: an innovative contact-free device for the estimation of the apnoea-hypopnoea index. In IEEE EMBS (2009).","paperID":"None"}],"title":"Smart Homes that Monitor Breathing and Heart Rate","filename":"CHI15/p837","authors":["Fadel Adib","Hongzi Mao","Zachary Kabelac","Dina Katabi","Robert C. Miller"],"conference":"CHI '15"}