{"paperId":2702274,"citation":[],"reference":[{"content":"Acquisti, A., Grossklags, J. Privacy attitudes and privacy behavior. In Economics of Info. Security. '04, 165--178.","paperID":"None"},{"content":"Barkhuus, L., Tashiro, J. Student Socialization in the Age of Facebook. Proc. CHI, ('10), 133--142.","paperID":"None"},{"content":"Barrick, M.R., Mount, M.K. The big five personality dimensions and job performance: A meta-analysis. Personnel Psychology 44, ('91), 26.","paperID":"None"},{"content":"Chen, J., et al. Understanding individuals' personal values from social media word use. Proc. CSCW, ('14), 405--414.","paperID":"None"},{"content":"Cialdini, R.B. Influence: The Psychology of Persuasion, Revised Edition. Harper Business, NY, '06.","paperID":"None"},{"content":"Connelly, K., Khalil, A., Liu, Y. Do I do what I say?: Observed versus stated privacy preferences. In Human Computer Interaction - INTERACT. Springer, '07, 620--623.","paperID":"None"},{"content":"Debatin, B., et al. Facebook and online privacy: Attitudes, behaviors, and unintended consequences. J. of CMC 15, ('09), 83--108.","paperID":"None"},{"content":"Donnellan, M.B., et al. The big five and enduring marriages. J. of Research in Personality 38, ('04), 481--504.","paperID":"None"},{"content":"Egelman, S., Felt, A., Wagner, D. Choice architecture and smartphone privacy: There's a price for that. In The Economics of Info. Security and Privacy. '13, 211--236.","paperID":"None"},{"content":"Ellison, N., Heino, R., Gibbs, J. Managing impressions online: Self-presentation processes in the online dating environment. J. of CMC 11, ('06), 415--441.","paperID":"None"},{"content":"Fraj, E., Martinez, E. Influence of personality on ecological consumer behaviour. J. of Consumer Beh. 5, ('06), 167--181.","paperID":"None"},{"content":"Gao, H., et al. Modeling user attitude toward controversial topics in online social media. Proc. ICWSM, ('14).","paperID":"None"},{"content":"Golbeck, J., et al. Predicting personality from Twitter. Proc. PASSAT & SOCIALCOM, ('11), 149--156.","paperID":"None"},{"content":"Goldberg, L.R. A broad-bandwidth, public-domain, personality inventory measuring the lower-level facets of several Five-Factor models. In Pers. Psych. in Europe. '99, 7.","paperID":"None"},{"content":"Gou, L., Zhou, M.X., Yang, H. KnowMe and ShareMe: Understanding automatically discovered personality traits from social media and user sharing preferences. Proc. CHI, ('14), 955--964.","paperID":"None"},{"content":"Gross, R., Acquisti, A. Information revelation and privacy in online social networks. Proc. WPSE, ('05), 71--80.","paperID":"None"},{"content":"Harbach, M., et al. Using personal examples to improve risk communication for security & privacy decisions. Proc. CHI, ('14), 2647.","paperID":"None"},{"content":"Hofstee, W.K., De Raad, B., Goldberg, L.R. Integration of the big five and circumplex approaches to trait structure. J. of Personality and Social Psychology 63, ('92), 146.","paperID":"None"},{"content":"Kosinski, M., Stillwell, D., Graepel, T. Private traits and attributes are predictable from digital records of human behavior. PNAS 110, ('13), 5802--5805.","paperID":"None"},{"content":"Kotov, R., et al. Linking \"big\" personality traits to anxiety, depressive, and substance use disorders: A meta-analysis. Psychological Bulletin 136, ('10), 768--821.","paperID":"None"},{"content":"Li, Y. Theories in online information privacy research: A critical review and an integrated framework. Decision Support Systems 54, ('12), 471--481.","paperID":"None"},{"content":"Marwick, A.E., Boyd, D. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, ('11), 114--133.","paperID":"None"},{"content":"McAndrew, F.T., Koehnke, S.S. Creepiness. Poster presented at SPSP, ('13).","paperID":"None"},{"content":"Mohammad, S.M., Turney, P.D. Emotions evoked by common words and phrases: Using mechanical turk to create an emotion lexicon. Proc. NAACL-HCT, ('10), 26--34.","paperID":"None"},{"content":"Palen, L., Dourish, P. Unpacking \"Privacy\" for a Networked World. Proc. CHI, ('03), 129--136.","paperID":"None"},{"content":"Pepper, M., Jackson, T., Uzzell, D. An examination of the values that motivate socially conscious and frugal consumer behaviours. Intl. J. of Consumer Studies 33, ('09), 126--136.","paperID":"None"},{"content":"Peppet, S.R. Unraveling privacy: The personal prospectus and the threat of a full-disclosure future. Nw. UL Rev. 105, ('11), 1153.","paperID":"None"},{"content":"Rader, E. Awareness of behavioral tracking and information privacy concern in Facebook and Google. Proc. SOUPS, '14.","paperID":"None"},{"content":"Rao, A., Schaub, F., Sadeh, N. What do they know about me? Contents and concerns of online behavioral profiles. Carnegie Mellon UniversityCyLab-14-011, '14.","paperID":"None"},{"content":"Schwaig, K.S., Segars, A.H., Grover, V., Fiedler, K.D. A model of consumers' perceptions of the invasion of information privacy. Information & Mgmt. 50, ('13), 1--12.","paperID":"None"},{"content":"Schwartz, S.H. Universals in the content and structure of values: Theoretical advances and empirical tests in 20 countries. Advances in Experimental Social Psych. 25, ('92).","paperID":"None"},{"content":"Seligman, M.E.P. Helplessness: On Depression, Development, and Death. W.H. Freeman & Co., NY, '92.","paperID":"None"},{"content":"Shah, R.C., Sandvig, C. Software defaults as de facto regulation: The case of the wireless internet. Information, Communication & Society 11, ('08), 25--46.","paperID":"None"},{"content":"Strano, M. User descriptions and interpretations of selfpresentation through Facebook profile images. Cyberpsychol.: J. of Psychosocial Res. on Cyberspace 2, '02.","paperID":"None"},{"content":"Tausczik, Y.R., Pennebaker, J.W. The Psychological Meaning of Words: LIWC and Computerized Text Analysis Methods. J. of Language and Social Psych. 29, ('10), 24--54.","paperID":"None"},{"content":"Taylor, S.E., Brown, J.D. Illusion and well-being: A social psychological perspective on mental health. Psychological Bulletin 103, ('88), 193--210.","paperID":"None"},{"content":"Ur, B., et al. Smart, useful, scary, creepy: Perceptions of online behavioral advertising. Proc. SOUPS, ('12), 4.","paperID":"None"},{"content":"Wang, Y., Kobsa, A. Privacy in online social networking at workplace. Proc. CSE, ('09), 975--978.","paperID":"None"},{"content":"Weber, K., Roehl, W.S. Profiling people searching for and purchasing travel products on the world wide web. J. of Travel Research 37, ('99), 291--298.","paperID":"None"},{"content":"Yarkoni, T. Personality in 100,000 Words: A large-scale analysis of personality and word use among bloggers. Journal of Research in Personality 44, ('10), 363--373.","paperID":"None"},{"content":"Youyou, W., Kosinski, M., Stillwell, D. Computer-based personality judgments are more accurate than those made by humans. PNAS, ('15), 1--5.","paperID":"None"}],"abstract":"Recent research has developed analytics that threaten online self-presentation and privacy by automatically generating profiles of individuals' most personal traits-their personality, values, motivations, and so on. But we know little about people's reactions to personal traits profiles of themselves, or what influences their decisions to share such profiles. We present an early qualitative study of people's reactions to a working hyper-personal analytics system. The system lets them see their personality and values profile derived from their own social media text. Our results reveal a paradox. Participants found their personal traits profiles creepily accurate and did not like sharing them in many situations. However, they felt pressured by the social risks of not sharing and showed signs of learned helplessness, leading them to share despite their misgivings. Further, they felt unqualified to significantly modify their profile contents due to a surprising trust in the \"expert\" algorithm. We explore design implications for hyper-personal analytics systems that consider the needs and preferences of the people being profiled, suggesting ways to enhance the control they feel and the benefits they reap.","title":"Can an Algorithm Know the \"Real You\"?: Understanding People's Reactions to Hyper-personal Analytics Systems","filename":"CHI15/p797","authors":["Jeffrey Warshaw","Tara Matthews","Steve Whittaker","Chris Kau","Mateo Bengualid","Barton A. Smith"],"conference":"CHI '15"}