{"paperId":2702511,"abstract":"In recent decades, great technological strides have been made toward enabling people who are blind to live independent, successful lives. However, there has been relatively little progress towards understanding the social, collaborative needs of this population, particularly in the domestic setting. We conducted semi-structured interviews in the homes of 10 pairs of close companions in which one partner was blind and one was not. We found that partners engaged in collaborative accessibility by taking active roles in co-creating an accessible environment. Due to their different visual abilities, however, partners sometimes encountered difficulties managing divergent needs and engaging in shared experiences. We describe outstanding challenges to creating accessible shared home spaces and outline new research and technology opportunities for supporting collaborative accessibility in the home.","reference":[{"content":"Atkinson, M.T., Gucukoglu, S., Machin, C.H.C., and Lawrence, A.E. (2006). Making the mainstream accessible: What's in a game? Proc. ICCHP '06, 380387.","paperID":"None"},{"content":"Bigham, J.P., Jayant, C., Ji, H., Little, G., Miller, A., Miller, R.C., Miller, R., Tatarowicz, A., White, B., White, S., and Yeh, T. VizWiz: Nearly Real-Time Answers to Visual Questions. Proc. UIST '10, 333--342.","paperID":"None"},{"content":"Borodin, Y., Bigham, J.P., Dausch, G., and Ramakrishnan, I.V. (2010). More than meets the eye: A survey of screen-reader browsing strategies. Proc. W4A '10, Article 13, 10 pages.","paperID":"None"},{"content":"Branham, S.M., Harrison, S., and Hirsch, T. (2012). Designing for collocated couples. In Connecting families: The impact of new communication technologies on domestic life. London: Springer.","paperID":"None"},{"content":"Brush, A.J.B., and Inkpen, K.M. (2007). Yours, mine and ours? Sharing and use of technology in domestic environments. Proc. UbiComp '07, 109--126.","paperID":"None"},{"content":"Charmaz, K. (2010). Constructing grounded theory: A practical guide through qualitative analysis. London: Sage Publications Ltd.","paperID":"None"},{"content":"Crabtree, R. and Rodden, T. (2004). Domestic Routines and Design for the Home. JCSCW 13(2), 191--220.","paperID":"None"},{"content":"Crabtree, A., Hemmings, T., Rodden, T., and Mariani, J. (2003). Informing the development of calendar systems for domestic use. Proc. ECSCW '03, 119--138.","paperID":"None"},{"content":"Erickson, W., Lee, C., von Schrader, S. (2013). Disability statistics from the 2011 American Community Survey (ACS). Ithaca, NY: Cornell University Employment and Disability Institute (EDI).","paperID":"None"},{"content":"Flatla, D.R. and Gutwin, C. (2012). \"So that's what you see\": Building understanding with personalized simulations of colour vision deficiency. Proc. ASSETS '12, 167--174.","paperID":"None"},{"content":"Grammenos, D., Savidis, A., Georgalis, Y., and Stephanidis, C. (2006). Access invaders: Developing a universally accessible action game. Proc. ICCHP '06, 388--395.","paperID":"None"},{"content":"Hassenzahl, M., Heidecker, S., Eckoldt, K., Diefenbach, S., and Hillmann, U. (2012). All you need is love: Current strategies of mediating intimate relationships through technology. ACM TOCHI. 19(4). Article 30.","paperID":"None"},{"content":"Hailpern, J., Danilevsky, M., Harris, A., Karahalios, K., Dell, G., and Hengst, J. (2011). ACES: Promoting empathy towards aphasia through language distortion emulation software. Proc. CHI '11, 609--618.","paperID":"None"},{"content":"Jacko, J.A., Leonard, V.K., and Scott, I.U. (2008). Perceptual impairments: new advancements promoting technological access. In The Human Computer Interaction Handbook. New York: Taylor and Francis.","paperID":"None"},{"content":"Kane, S.K., Jayant, C., Wobbrock, J.O., and Ladner, R.E. (2009). Freedom to roam: A study of mobile device adoption and accessibility for people with visual and motor disabilities. Proc. ASSETS '09, 115--122.","paperID":"None"},{"content":"Kaye, J. (2012). Love, Ritual & Videochat. in R. Harper, Ed. The Connected Home: The Future of Domestic Life, Springer.","paperID":"None"},{"content":"Massimi, M., Dimond, J.P., and Le Dantec, C.A. (2012). Finding a new normal: The role of technology in life disruptions. Proc. CWCW '12, 719--728.","paperID":"None"},{"content":"Mankoff, J., Hayes, G., Kasnitz, D. (2010). Disability studies as a source of critical inquiry for the field of assistive technology. Proc. ASSETS '10, 3--10.","paperID":"None"},{"content":"Mynatt, E.D., Rowan, J., Tran, Q., Abowd, G., Rogers, W., Siio, I. (2003). Designing home appliances for older adults. Cognitive Studies 10(3).","paperID":"None"},{"content":"Neustaedter, C., Harrison, S., Sellen, A., eds. (2012). Connecting families: The impact of new communication technologies on domestic life. London: Springer.","paperID":"None"},{"content":"Neustaedter, C., Brush, A.J.B., and Greenberg, S. (2009). The calendar is crucial: Coordination and awareness through the family calendar. ACM TOCHI. 16(1). Article 6.","paperID":"None"},{"content":"Newell, A.F., and Gregor, P. (2000). \"User sensitive inclusive design\" in search of a new paradigm. Proc. CUU '00, 39--44.","paperID":"None"},{"content":"Phillips, B., and Zhao, H. (1993). Predictors of assistive technology abandonment. Assistive Technology 5(1), 36--45.","paperID":"None"},{"content":"Piper, A.M., Hollan, J. (2008). Supporting medical conversations between deaf and hearing individuals with tabletop displays. Proc. CSCW '08, 147--156.","paperID":"None"},{"content":"Piper, A.M., Weibel, N., and Hollan, J. (2014). Designing audio-enhanced paper photos for older adult emotional wellbeing in communication therapy. IJHCS 72(8--9), 629--639.","paperID":"None"},{"content":"Plaisant, C., Clamage, A., Hutchinson, H.B., Bederson, B.B., and Druin, A. (2006). Shared family calendars: Promoting symmetry and accessibility. ACM TOCHI 13(3), 313--346.","paperID":"None"},{"content":"Plimmer, B., Crossan, A., Brewster, S.A., and Blagojevic, R. (2008). Multimodal collaborative handwriting training for visually-impaired people. Proc. CHI '08, 393--402.","paperID":"None"},{"content":"Rode, J.A. (2010). The roles that make the domestic work. Proc. CSCW '10, 381--390.","paperID":"None"},{"content":"Savidis, A. and Stephanidis, C. (2005). Developing dual user interfaces for integrating blind and sighted users: The HOMER UIMS. Proc. CHI '95, 106--113.","paperID":"None"},{"content":"Shneiderman, B. (2000). Universal usability. CACM. 43:5, May 2000, 84--91.","paperID":"None"},{"content":"Shinohara, K., and Tenenberg, J. (2007). Observing Sara: a case study of a blind person's interactions with technology. Proc. ASSETS '07, 171--178.","paperID":"None"},{"content":"Shinohara, K., and Wobbrock, J.O. (2011). In the shadow of misperception: Assistive technology use and social interactions. Proc. CHI '11, 705--714.","paperID":"None"},{"content":"Sohn, T., Lee, L., Zhang, S., Dearman, D., and Truong, K. (2012). An examination of how households share and coordinate the completion of errands. Proc. CSCW '12, 729--738.","paperID":"None"},{"content":"Thayer, A., Bietz, M.J., Derthick, K., and Lee, C.P. (2012). I love you, let's share calendars: calendar sharing as relationship work. Proc. CSCW '12, 749--758.","paperID":"None"},{"content":"Thayer, A., Sirjani, B., and Lee, C.P. (2013). Recalibrating the ratio: enacting accountability in intimate relationships using shared calendars. Proc. CSCW '13, 203--214.","paperID":"None"},{"content":"Thieme, A., Wallace, J., Thomas, J, Chen, K.L., Krämer, N., and Olivier, P. (2011). Lovers' box: Designing for reflection within romantic relationships. IJHS. 69(5), 283--297.","paperID":"None"},{"content":"Winberg, F. and Bowers, J. Assembling the senses: Towards the design of cooperative interfaces for visually impaired users. Proc. CSCW '04, 332--341.","paperID":"None"},{"content":"Wobbrock, J.O., Kane, S.K., Gajos, K.Z., Harada, S., and Froehlich, J. (2011). Ability-based design: Concept, principles and examples. ACM TACCESS 3(3), Article 9, 27 pages.","paperID":"None"},{"content":"World Health Organization. \"Visual impairment and blindness Fact Sheet N°282,\" October 2013. [Online]. http://www.who.int/mediacentre/factsheets/fs282/en/ind ex.html. [Accessed: Jun. 4, 2014].","paperID":"None"},{"content":"Yang, R., Park, S., Mishra, S.R., Hong, Z., Newsom, C., Joo, H., Hofer, E. and Newman, M.W. (2011). Supporting spatial awareness and independent wayfinding for pedestrians with visual impairments. Proc. ASSETS '11, 27--34.","paperID":"None"},{"content":"Zuckerman, D.M. (2004). Blind adults in America: Their lives and challenges. Washington, DC: National Research Center for Women & Families. [Online]. http://center4research.org/medical-care-foradults/disabilities/blind-adults-in-america-their-livesand-challenges/. [Accessed: Jun 4, 2014].","paperID":"None"}],"citation":[{"content":"Stacy M. Branham , Shaun K. Kane, The Invisible Work of Accessibility: How Blind Employees Manage Accessibility in Mixed-Ability Workplaces, Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, October 26-28, 2015, Lisbon, Portugal","paperID":"2809864"},{"content":"Peng Liu , Xianghua Ding , Ning Gu, “Helping Others Makes Me Happy”: Social Interaction and Integration of People with Disabilities, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819998"}],"title":"Collaborative Accessibility: How Blind and Sighted Companions Co-Create Accessible Home Spaces","filename":"CHI15/p2373","authors":["Stacy M. Branham","Shaun K. Kane"],"conference":"CHI '15"}