{"paperId":2702289,"citation":[],"abstract":"Alcohol dependence is a chronic disorder associated with severe harm in multiple areas, and relapsing is easy, despite treatment. This study proposes SoberDiary, a phone-based support system that enables alcohol-dependent patients to self-monitor and -manage their own alcohol behavior, and remain sober in their daily lives. We tested SoberDiary in a real-life 12-week user study involving 27 clinical patients. The quantitative and qualitative results revealed that SoberDiary helped patients self-monitor and -manage their alcohol-use behavior, and reduced their total alcohol consumption as well as the number of heavy drinking days. Compared with patients who received standard treatment alone, this study demonstrated SoberDiary successfully complemented current alcohol treatment in reducing patients' alcoholic cravings and dropout rate over 3-month study period. Follow-up interviews further revealed the sophisticated use practices and value of SoberDiary.","reference":[{"content":"Atmel 8-bit AVR RISC-based microcontroller. http://www.atmel.com/devices/atmega328.aspx.","paperID":"None"},{"content":"Bosch BMP085 Digital Barometer. https://www.sparkfun.com/products/11282.","paperID":"None"},{"content":"EGBT-045MS Bluetooth Module. http://www.e-gizmo.com/KIT/egbt-04.htm.","paperID":"None"},{"content":"MR 513 type alcohol sensor. http://www.futurlec.com/Alcohol_Sensor2.shtml.","paperID":"None"},{"content":"Guth Model 2100, Alcohol Breath Test Simulator. http://www.guthlabs.com/product.asp?item_id=184.","paperID":"None"},{"content":"Alessi, S.M., Petry, N.M. A Randomized Study of Cell-phone Technology to Reinforce Alcohol Abstinence in the Natural Environment. Addict. 108, 5 (2013), 900--909.","paperID":"None"},{"content":"Caddy, G.R., Sobell, M.B., and Sobell, L.C. Alcohol Breath Tests: Criterion Times for Avoiding Contamination by \"Mouth Alcohol\". newblock Behavior Research Methods & Instrumentation 10, 6 (1978), 814--818.","paperID":"None"},{"content":"Chiu, M.-C., Chang, S.-P., Chang, Y.-C., et al. Playful Bottle: A Mobile Social Persuasion System to Motivate Healthy Water Intake. In Proc. UbiComp 2009, ACM Press (2009), 185--194.","paperID":"None"},{"content":"Consolvo, S., McDonald, D.W., Toscos, T., et al. Activity Sensing in the Wild: A Field Trial of UbiFit Garden. In Proc. CHI 2008, ACM Press (2008), 1797--1806.","paperID":"None"},{"content":"Gustafson, D.H., Shaw, B.R., Isham, A., et al. Explicating an Evidence-based, Theoretically Informed, Mobile Technology-based System to Improve Outcomes for People in Recovery for Alcohol Dependence. Subst Use Misuse 46, 1 (2011), 96--111.","paperID":"None"},{"content":"Litten, R.Z., and Allen J.P. (Eds). Measuring Alcohol Consumption: Psychosocial and Biochemical Methods. Humana Press, 1992.","paperID":"None"},{"content":"McKay, J.R., Franklin, T.R., Patapis, N., et al. Conceptual, Methodological, and Analytical Issues in the Study of Relapse. Clin Psychol Rev 26, 2 (2006), 109--127.","paperID":"None"},{"content":"Moskowitz, D.S, and Young, S.N. Ecological Momentary Assessment: What It Is and Why It Is a Method of the Future in Clinical Psychopharmacology. J Psychiatry Neurosci 31, 1 (2006), 13--20.","paperID":"None"},{"content":"Obermayer, J.L., Riley, W.T., Asif, O., et al. College Smoking-cessation using Cell Phone Text Messaging. J Am Coll Health 53, 2 (2004), 71--78.","paperID":"None"},{"content":"Petrakis, I.L. A Rational Approach to the Pharmacotherapy of Alcohol Dependence. J Clin Psychopharmacol 26, (2006), Suppl 1:S3-S12.","paperID":"None"},{"content":"Donovan, D.M., and Marlatt, G.A. Relapse Prevention: Maintenance Strategies in the Treatment of Addictive Behaviors (Second Edition). The Guilford Press, 2007","paperID":"None"},{"content":"Natarajan, A., Parate, A., Gaiser, E., et al. Detecting Cocaine Use with Wearable Electrocardiogram Sensors. In Proc. UbiComp 2013, ACM Press (2013), 123--132.","paperID":"None"},{"content":"Higgins, S.T., and Petry, N.M. Contingency Management: Incentives for Sobriety. Alcohol Res Health 23, 2 (1999), 122--127.","paperID":"None"},{"content":"Volkow, N.D. Principles of Drug Addiction Treatment: A Research-Based Guide (2nd Ed.). DIANE Publishing Company, 2011.","paperID":"None"},{"content":"Gustafson, D.H., McTavish, F.M., Chih, M.A., et al. Smartphone Application to Support Recovery from Alcoholism: A Randomized Clinical Trial. JAMA Psychiatry 71, 5 (2014), 566--572","paperID":"None"},{"content":"Bandura, A. Self-efficacy. In Encyclopedia of human behavior Vol. 4. Academic Press (1994), 71--81.","paperID":"None"},{"content":"Corbin, J., and Strauss, A. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory 3e. SAGE Publications, 2008.","paperID":"None"}],"title":"SoberDiary: A Phone-based Support System for Assisting Recovery from Alcohol Dependence","filename":"CHI15/p3839","authors":["Chuang-wen You","Kuo-Cheng Wang","Ming-Chyi Huang","Yen-Chang Chen","Cheng-Lin Lin","Po-Shiun Ho","Hao-Chuan Wang","Polly Huang","Hao-Hua Chu"],"conference":"CHI '15"}