{"paperId":2702229,"citation":[],"reference":[{"content":"Panay, P. \"Rethinking music: The future of making money as a performing musician. Rethinking Music (2011), 57","paperID":"None"},{"content":"Palfrey, J., and Gasser, U. Born digital: Understanding the first generation of digital natives. (2013), 125","paperID":"None"},{"content":"Farber, J. 'Director's view: creativity and innovation harder to come by in '88; MTV, labels, music itself to blame', Billboard, 12 November (1988) pp. V3, V8","paperID":"None"},{"content":"Snoek, C. G., Worring, M., Smeulders, A. W., & Freiburg, B. The role of visual content and style for concert video indexing. In IEEE International Conference on Multimedia and Expo (2007) 252--255","paperID":"None"},{"content":"Spotify. Retrieved September 8th 2014. http://www.spotify.com","paperID":"None"},{"content":"iTunes. Retrieved September 8th 2014 http://itunes.com","paperID":"None"},{"content":"Reverbnation. Retrieved September 8th 2014. http://www.reverbnation.com","paperID":"None"},{"content":"Bandcamp. Retreived September 8th 2014 from. http://bandcamp.com","paperID":"None"},{"content":"Lingel, J., & Naaman, M. You should have been there, man: Live music, DIY content and online communities. New Media & Society, 14(2) (2012), 332--349.","paperID":"None"},{"content":"Guardian Online. Report on Kate Bush Concert. Retrieved September 20th 2014. http://www.theguardian.com/music/2014/aug/19/katebush-asks-fans-no-phones-tablets-london-gigs","paperID":"None"},{"content":"Generator (personal communication) (May 2014)","paperID":"None"},{"content":"Fanfootage. Retrieved September 20th 2014 from http://fanfootage.com.","paperID":"None"},{"content":"Vyvlone. Retrieved September 20th 2014. http://vyclone.com","paperID":"None"},{"content":"Beastie Boys Starring in Awesome: I Fuckin' Shot That!. Polyband, (2007).","paperID":"None"},{"content":"This One Is On Us. Retrieved September 20th 2014. http://toiou.org/","paperID":"None"},{"content":"Esbjörnsson, M., Brown, B., Juhlin, O., Normark, D., Östergren, M., & Laurier, E. Watching the cars go round and round: designing for active spectating. In Proc. CHI '06, ACM Press (2006), 1221--1224.","paperID":"None"},{"content":"Flintham, M., Reeves, S., & Durrant, A. Creating an Outside Broadcast of a Marathon.","paperID":"None"},{"content":"Lino, C., Christie, M., Lamarche, F., Schofield, G., & Olivier, P. A real-time cinematography system for interactive 3d environments. In Proc. SIGGRAPH '10 (2010), 139--148.","paperID":"None"},{"content":"Lino, C., Christie, M., Ranon, R., & Bares, W. The director's lens: an intelligent assistant for virtual cinematography. In Proc. ACMMM '11. ACM (2011), 323--332.","paperID":"None"},{"content":"Quitmeyer, A., & Nitsche, M. Documatic: participatory, mobile shooting assistant, pre-editor, and groundwork for semi-automatic filmmaking. In Proc. EuroITV '12 (2012), 135--138.","paperID":"None"},{"content":"Schofield, G., Green, D., Smith, T., Wright, P., & Olivier, P. Cinejack: using live music to control narrative visuals. In Proc. DIS '14 ACM (2014), 209-","paperID":"None"},{"content":"Engström, A., Esbjörnsson, M., & Juhlin, O. Mobile collaborative live video mixing. In Proc. MobileHCI '08. ACM (2008), 157--166.","paperID":"None"},{"content":"Arijon, D. Grammar of the film language (pp. 12--177). London: Focal Press. (1976).","paperID":"None"},{"content":"Bartindale, T., Schofield, G., Olivier, P., & Wright, P. Supporting Participatory Media Production through new Interaction Technologies. Digital Economy 2013, (2013).","paperID":"None"},{"content":"Broth, M. The Production of a live TV-interview through mediated interaction. Logic and Methodology. Retrieved from http://konference.fdvinfo.net/rc33/2004/Data/PDF/stream_02-07.pdf (2004).","paperID":"None"},{"content":"Orfanidis, S. J. Optimum signal processing: an introduction (1985).","paperID":"None"},{"content":"Rogers, Y., Connelly, K., Tedesco, L., Hazlewood, W., Kurtz, A., Hall, R. E., & Toscos, T. Why it's worth the hassle: The value of in-situ studies when designing UbiComp Springer (2007), 336--353.","paperID":"None"},{"content":"Taylor, R., Schofield, G., Shearer, J., Wallace, J., Wright, P., Boulanger, P., & Olivier, P. Designing from within: humanaquarium. In Proc. CHI '11 ACM (2011), 1855--1864.","paperID":"None"}],"abstract":"Bootlegger is a system for creating multi-camera films of live music events using mobile devices. Using readily available technology and a synthesis of film-making conventions, the system coordinates music fans at live shows into an improvised film crew, suggesting shots, collating footage and generating rich metadata in real time. Bootlegger is part of a research project exploring adapting professional media workflows to amateur contexts in order to lower the bar to entry for media production. By enabling concert-goers to contribute to high-quality concert films, the system leverages mobile phone 'bootlegging' practices to support emerging musicians.","title":"Bootlegger: Turning Fans into Film Crew","filename":"CHI15/p767","authors":["Guy Schofield","Tom Bartindale","Peter Wright"],"conference":"CHI '15"}