{"paperId":2702214,"citation":[],"reference":[{"content":"Aigner, R., Wigdor, D., Benko, H., Haller, M., Lindbauer, D., Ion, A., Zhao, S., and Koh, J. Understanding mid-air hand gestures: A study of human preferences in usage of gesture types for hci. Microsoft Research TechReport MSR-TR-2012--111 (2012).","paperID":"None"},{"content":"App Annie. http://www.appannie.com.","paperID":"None"},{"content":"Baba, T., Ushiama, T., Tsuruno, R., and Tomimatsu, K. Video game that uses skin contact as controller input. SIGGRAPH '07,","paperID":"None"},{"content":"Biskupski, A., Fender, A. R., Feuchtner, T. M., Karsten, M., and Willaredt, J. D. Drunken ed: A balance game for public large screen displays. CHI EA '14, 289--292.","paperID":"None"},{"content":"Christian, S., Alves, J., Ferreira, A., Jesus, D., Freitas, R., and Vieira, N. Volcano salvation: Interaction through gesture and head tracking. CHI EA '14, 297--300.","paperID":"None"},{"content":"Colacó, A., Kirmani, A., Yang, H. S., Gong, N.-W., Schmandt, C., and Goyal, V. K. Mime: Compact, low power 3d gesture sensing for interaction with head mounted displays. UIST '13, 227--236.","paperID":"None"},{"content":"Epps, J., Lichman, S., and Wu, M. A study of hand shape use in tabletop gesture interaction. CHI EA '06, 748--753.","paperID":"None"},{"content":"Epson BT-100 Specs. http://www.epson.com.au/products/ ProjectorAccessories/Moverio_BT-100_specs.asp.","paperID":"None"},{"content":"Essential Facts About The Computer And Video Game Industry. http: //www.theesa.com/facts/pdfs/esa_ef_2014.pdf.","paperID":"None"},{"content":"Findlater, L., Lee, B., and Wobbrock, J. Beyond qwerty: Augmenting touch screen keyboards with multi-touch gestures for non-alphanumeric input. CHI '12, pp. 2679--2682.","paperID":"None"},{"content":"GameStop. http://www.gamestop.com.","paperID":"None"},{"content":"Google Glass wiki. http: //en.wikipedia.org/wiki/Google_Glass#Features.","paperID":"None"},{"content":"Grijincu, D., Nacenta, M. A., and Kristensson, P. O. User-defined interface gestures: Dataset and analysis. ITS '14, 25--34.","paperID":"None"},{"content":"Gustafson, S., Holz, C., and Baudisch, P. Imaginary phone: Learning imaginary interfaces by transferring spatial memory from a familiar device. UIST '11, 283--292.","paperID":"None"},{"content":"Harada, S., Wobbrock, J. O., and Landay, J. A. Voice games: Investigation into the use of non-speech voice input for making computer games more accessible. INTERACT'11, pp. 11--29.","paperID":"None"},{"content":"Harrison, C., Benko, H., and Wilson, A. D. Omnitouch: Wearable multitouch interaction everywhere. UIST '11, 441--450.","paperID":"None"},{"content":"Harrison, C., Tan, D., and Morris, D. Skinput: Appropriating the body as an input surface. CHI '10, 453--462.","paperID":"None"},{"content":"Hsu, C.-Y., Tung, Y.-C., Wang, H.-Y., Chyou, S., Lin, J.-W., and Chen, M. Y. Glass shooter: Exploring first-person shooter game control with google glass. ICMI '14, 70--71.","paperID":"None"},{"content":"Jing, L., Cheng, Z., Zhou, Y., Wang, J., and Huang, T. Magic ring: A self-contained gesture input device on finger. MUM '13, 39:1--39:4.","paperID":"None"},{"content":"Jurgelionis, A., Nap, H. H., Gajadhar, B. J., Bellotti, F., Wang, A. I., and Berta, R. Player experience and technical performance prospects for distributed 3d gaming in private and public settings. Comput. Entertain., 16:1--16:19.","paperID":"None"},{"content":"Cohen's kappa - Wikipedia, the free encyclopedia. http://en.wikipedia.org/wiki/Cohen's_kappa.","paperID":"None"},{"content":"Karam, M., et al. A taxonomy of gestures in human computer interactions.","paperID":"None"},{"content":"Kim, D., Hilliges, O., Izadi, S., Butler, A. D., Chen, J., Oikonomidis, I., and Olivier, P. Digits: Freehand 3d interactions anywhere using a wrist-worn gloveless sensor. UIST '12, 167--176.","paperID":"None"},{"content":"Liang, H.-N., Williams, C., Semegen, M., Stuerzlinger, W., and Irani, P. User-defined surface+motion gestures for 3d manipulation of objects at a distance through a mobile device. APCHI '12, 299--308.","paperID":"None"},{"content":"Google Glass Mini Games. https://developers. google.com/glass/samples/mini-games.","paperID":"None"},{"content":"Montero, C. S., Alexander, J., Marshall, M. T., and Subramanian, S. Would you do that?: Understanding social acceptance of gestural interfaces. MobileHCI '10, 275--278.","paperID":"None"},{"content":"Morris, M. R. Web on the wall: Insights from a multimodal interaction elicitation study. ITS '12, 95--104.","paperID":"None"},{"content":"Nacke, L. E., Kalyn, M., Lough, C., and Mandryk, R. L. Biofeedback game design: Using direct and indirect physiological control to enhance game interaction. CHI '11, 103--112.","paperID":"None"},{"content":"Nielsen, M., Störring, M., Moeslund, T. B., and Granum, E. A procedure for developing intuitive and ergonomic gesture interfaces for hci. In Gesture-Based Communication in Human-Computer Interaction. Springer, 2004, 409--420.","paperID":"None"},{"content":"Piumsomboon, T., Clark, A., Billinghurst, M., and Cockburn, A. User-defined gestures for augmented reality. CHI'13, 955--960.","paperID":"None"},{"content":"Pyryeskin, D., Hancock, M., and Hoey, J. Comparing elicited gestures to designer-created gestures for selection above a multitouch surface. ITS '12, 1--10.","paperID":"None"},{"content":"Reis, S. Expanding the magic circle in pervasive casual play. ICEC'12, 486--489.","paperID":"None"},{"content":"Serrano, M., Ens, B. M., and Irani, P. P. Exploring the use of hand-to-face input for interacting with head-worn displays. CHI '14, 3181--3190.","paperID":"None"},{"content":"Sporka, A. J., Kurniawan, S. H., Mahmud, M., and Slavík, P. Non-speech input and speech recognition for real-time control of computer games. Assets '06, 213--220.","paperID":"None"},{"content":"Steam. http://store.steampowered.com.","paperID":"None"},{"content":"Top 90 Casual Games List. http://ppt.cc/hO2j, Analyzed at 2014-08--14.","paperID":"None"},{"content":"VGChartz. http://www.vgchartz.com.","paperID":"None"},{"content":"Vickers, S., Istance, H., and Hyrskykari, A. Performing locomotion tasks in immersive computer games with an adapted eye-tracking interface. ACM Trans. Access. Comput. 5, 1 (Sept. 2013), 2:1--2:33.","paperID":"None"},{"content":"Williamson, J. R., Brewster, S., and Vennelakanti, R. Mo!games: Evaluating mobile gestures in the wild. ICMI '13, 173--180.","paperID":"None"},{"content":"Wobbrock, J. O., Aung, H. H., Rothrock, B., and Myers, B. A. Maximizing the guessability of symbolic input. CHI EA '05, 1869--1872.","paperID":"None"},{"content":"Wobbrock, J. O., Morris, M. R., and Wilson, A. D. User-defined gestures for surface computing. CHI '09, pp. 1083--1092.","paperID":"None"}],"abstract":"Smart glasses, such as Google Glass, provide always-available displays not offered by console and mobile gaming devices, and could potentially offer a pervasive gaming experience. However, research on input for games on smart glasses has been constrained by the available sensors to date. To help inform design directions, this paper explores user-defined game input for smart glasses beyond the capabilities of current sensors, and focuses on the interaction in public settings. We conducted a user-defined input study with 24 participants, each performing 17 common game control tasks using 3 classes of interaction and 2 form factors of smart glasses, for a total of 2448 trials. Results show that users significantly preferred non-touch and non-handheld interaction over using handheld input devices, such as in-air gestures. Also, for touch input without handheld devices, users preferred interacting with their palms over wearable devices (51% vs 20%). In addition, users preferred interactions that are less noticeable due to concerns with social acceptance, and preferred in-air gestures in front of the torso rather than in front of the face (63% vs 37%).","title":"User-Defined Game Input for Smart Glasses in Public Space","filename":"CHI15/p3327","authors":["Ying-Chao Tung","Chun-Yen Hsu","Han-Yu Wang","Silvia Chyou","Jhe-Wei Lin","Pei-Jung Wu","Andries Valstar","Mike Y. Chen"],"conference":"CHI '15"}