{"paperId":2702548,"reference":[{"content":"Ackerman, M. S. (1998). Augmenting organizational memory: a field study of answer garden. TOIS, 16(3), 203--224.","paperID":"None"},{"content":"Barocas, S., Hood, S., & Ziewitz, M. (2013). Governing algorithms: A provocation piece. SSRN.","paperID":"None"},{"content":"Bellotti, V., & Edwards, K. (2001). Intelligibility and accountability: human considerations in context-aware systems. HCI, 16(2-4), 193--212.","paperID":"None"},{"content":"Braga, M., Paccagnella, M., & Pellizzari, M. (2014). Evaluating students' evaluations of professors. Economics of Education Review, 41, 71--88.","paperID":"None"},{"content":"Costanza, E., Fischer, J. E., Colley, J. A., & Jennings, N. R. (2014). Doing the laundry with agents: a field trial of a future smart energy system in the home. In Proc. of CHI, 813--822.","paperID":"None"},{"content":"Cramer, H., Evers, V., Ramlal, S., & Wielinga, B. (2008). The effects of transparency on trust in and acceptance of a content-based art recommender. UMUAI, 18(5), 455--496.","paperID":"None"},{"content":"Davidson, A. & Kestenbaum D. (2014). The Future of Work Looks Like a UPS Truck. NPR.","paperID":"None"},{"content":"Dourish, P. (2003). The appropriation of interactive technologies: Some lessons from placeless documents. CSCW 12(4), 465--490.","paperID":"None"},{"content":"Egido, C. (1988). Video conferencing as a technology to support group work: a review of its failures. In Proc. of CSCW, 13--24.","paperID":"None"},{"content":"Gillespie, T. (2014). The Relevance of Algorithms. Media Technologies: Essays on Communication, Materiality, and Society, 167--193.","paperID":"None"},{"content":"Girardin, F., & Blat, J. (2010). The co-evolution of taxi drivers and their in-car navigation systems. PMC, 6(4), 424--434.","paperID":"None"},{"content":"Grudin, J. (1988). Why CSCW applications fail: problems in the design and evaluation of organizational interfaces. In Proc. of CSCW, 85--93.","paperID":"None"},{"content":"Hassan, U., O'Riain, S., & Curry, E. (2013). Effects of expertise assessment on the quality of task routing in human computation. In Proc. of Workshop on Social Media for Crowdsourcing and Human Computation.","paperID":"None"},{"content":"Haws, K. L., & Bearden, W. O. (2006). Dynamic pricing and consumer fairness perceptions. Journal of Consumer Research, 33(3), 304--311.","paperID":"None"},{"content":"Hinds, P., & Kiesler, S. (1995). Communication across boundaries: work, structure, and use of communication technologies in a large organization. Org. Sci., 6(4), 373--393.","paperID":"None"},{"content":"Hodson, H (2014). The AI Boss that Deploys Hong Kong's Subway Engineers. New Scientist","paperID":"None"},{"content":"Irani, L., & Silberman, M. (2013). Turkopticon: Interrupting Worker Invisibility in Amazon Mechanical Turk. In Proc. of CHI, 611--620.","paperID":"None"},{"content":"Isaacs, E., Walendowski, A., Whittaker, S., & Kamm, C. (2002). The character, functions, and styles of instant messaging in the workplace. In Proc. of CSCW, 11--20.","paperID":"None"},{"content":"Kantor, J. (2014). Working Anything But 9 to 5. NYT","paperID":"None"},{"content":"Kay, J. & Kummerfeld, B. (2012). Creating personalized systems that people can scrutinize and control: Drivers, principles and experience. TiiS, 24--42.","paperID":"None"},{"content":"Kulesza, T., Stumpf, S., Burnett, M., & Kwan, I. (2012). Tell me more: the effects of mental model soundness on personalizing an intelligent agent. In Proc. of CHI, 1--10.","paperID":"None"},{"content":"Lee, M. K., Kiesler, S., Forlizzi, J., & Rybski, P. (2012). Ripple effects of an embedded social agent: a field study of a social robot in the workplace. In Proc. of CHI, 695--704.","paperID":"None"},{"content":"Lee, J., & Moray, N. (1992). Trust, control strategies and allocation of function in human-machine systems. Ergonomics, 35(10), 1243--1270.","paperID":"None"},{"content":"Lim, B. Y., Dey, A. K., & Avrahami, D. (2009). Why and why not explanations improve the intelligibility of context-aware intelligent systems. In Proc. of CHI, 2119--2128.","paperID":"None"},{"content":"Lyft (2014) Rating Your Driver. Retrieved from https://www.lyft.com/help/article/1453135","paperID":"None"},{"content":"Maitlis, S. (2005). The social processes of organizational sensemaking. Academy of Management Journal, 48(1), 21--49.","paperID":"None"},{"content":"Martin, D., Hanrahan, B. V., O'Neill, J., & Gupta, N. (2014). Being a turker. In Proc. of CSCW, 224--235.","paperID":"None"},{"content":"McClelland, M. (2012). I Was a Warehouse Wage Slave. Mothers Jones.","paperID":"None"},{"content":"Mintzberg, H. (1973). The Nature of Managerial Work. Harpercollins College Div.","paperID":"None"},{"content":"Mutlu, B. & Forlizzi, J. (2008). Robots in organizations: the role of workflow, social, and environmental factors in human-robot interaction. In Proc. of HRI, 287--294.","paperID":"None"},{"content":"Orlikowski, W. J. (1992). Learning from notes: Organizational issues in groupware implementation. In Proc. of CSCW, 362--369.","paperID":"None"},{"content":"Patton, M. Q. (1990). Qualitative evaluation and research methods. SAGE Publications, inc.","paperID":"None"},{"content":"Parise, S., Kiesler, S., Sproull, L., & Waters, K. (1999). Cooperating with life-like interface agents. Computers in Human Behavior, 15(2), 123--142.","paperID":"None"},{"content":"Pritchard, G., Vines, J., Briggs, P., & Olivier, P. (2014). Digitally driven: how location based services impact the work practices of London bus drivers. In Proc. of CHI, 3617--3626.","paperID":"None"},{"content":"Rodden, T. A., Fischer, J. E., Pantidi, N., & Moran, S. (2013). At home with agents: exploring attitudes towards future smart energy infrastructures. In Proc. of CHI, 1173--1182.","paperID":"None"},{"content":"Sheridan, T. B., & Parasuraman, R. (2005). Humanautomation interaction. Reviews of human factors and ergonomics, 1(1), 89--129.","paperID":"None"},{"content":"Steiner, C., & Dixon, W. (2012). Automate this: How algorithms came to rule our world. New York.","paperID":"None"},{"content":"Strauss, A., & Corbin, J. M. (1990). Basics of qualitative research: grounded theory procedures and techniques.","paperID":"None"},{"content":"Suchman, L. A. (1983). Office procedure as practical action: models of work and system design. TOIS, 1(4), 320--328.","paperID":"None"},{"content":"Tracy, S., Myers, K., Scott, C., (2007). Cracking jokes and crafting selves: Sensemaking and identity management among human service workers. Communication Monographs, 283--308.","paperID":"None"},{"content":"Uber (2014). a Deeper Look at Uber's Dynamic Pricing Model. http://blog.uber.com/dynamicpricing","paperID":"None"},{"content":"Uber (2014). How the Uber System Works [Video file] https://www.youtube.com/watch?v=makYbqd7mGA","paperID":"None"},{"content":"Yang, R., & Newman, M. W. (2013). Learning from a learning thermostat: lessons for intelligent systems for the home. In Proc. of PUC, 93--102.","paperID":"None"},{"content":"Walker, C. R. (1958). Life in the automatic factory. Harvard Business Review,36(1), 111--119.","paperID":"None"}],"citation":[{"content":"Tawanna Dillahunt , Airi Lampinen , Jacki O'Neill , Loren Terveen , Cory Kendrick, Does the Sharing Economy do any Good?, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2893362"},{"content":"Susann Wagenknecht , Min Lee , Caitlin Lustig , Jacki O'Neill , Himanshu Zade, Algorithms at Work: Empirical Diversity, Analytic Vocabularies, Design Implications, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2855519"},{"content":"Rayoung Yang , Eunice Shin , Mark W. Newman , Mark S. Ackerman, When fitness trackers don't 'fit': end-user difficulties in the assessment of personal tracking device accuracy, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2804269"},{"content":"Le Chen , Alan Mislove , Christo Wilson, Peeking Beneath the Hood of Uber, Proceedings of the 2015 ACM Conference on Internet Measurement Conference, October 28-30, 2015, Tokyo, Japan","paperID":"2815681"},{"content":"Noopur Raval , Paul Dourish, Standing Out from the Crowd: Emotional Labor, Body Labor, and Temporal Labor in Ridesharing, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820026"},{"content":"Min Kyung Lee , Junsung Kim , Jodi Forlizzi , Sara Kiesler, Personalization revisited: a reflective approach helps people better personalize health services and motivates them to increase physical activity, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2807552"},{"content":"David Martin , Jacki O'neill , Neha Gupta , Benjamin V. Hanrahan, Turking in a Global Labour Market, Computer Supported Cooperative Work, v.25 n.1, p.39-77, February  2016","paperID":"2907285"}],"abstract":"Software algorithms are changing how people work in an ever-growing number of fields, managing distributed human workers at a large scale. In these work settings, human jobs are assigned, optimized, and evaluated through algorithms and tracked data. We explore the impact of this algorithmic, data-driven management on human workers and work practices in the context of Uber and Lyft, new ridesharing services. Our findings from a qualitative study describe how drivers responded when algorithms assigned work, provided informational support, and evaluated their performance, and how drivers used online forums to socially make sense of the algorithm features. Implications and future work are discussed.","video":"http://www.youtube.com/embed/haCclIai86w?rel=0","title":"Working with Machines: The Impact of Algorithmic and Data-Driven Management on Human Workers","filename":"CHI15/p1603","authors":["Min Kyung Lee","Daniel Kusbit","Evan Metsky","Laura Dabbish"],"conference":"CHI '15"}