{"paperId":2702600,"abstract":"Researchers have recently been focusing on understanding online communities in social networks that offer easy access to new audiences. How do online communities function within these social networks? In this work, we conducted a mixed-method study of public Google+ Communities and found two major types evident in both how users talk about them and how they appear to use them: plazas to meet new people, and topic boards to discuss common interests. This reflects two common motivations users cite in describing Communities: \"meeting like minded people\" and \"finding great content\". We characterize these two types of Communities within Google+ using mixed methods including surveys, interviews, and quantitative analytics, and expose differences in user behaviors between them.","citation":[],"reference":[{"content":"Bender, J. L., Jimenez-Marroquin, M.-C., and Jadad, A. R. Seeking support on facebook: a content analysis of breast cancer groups. Journal of medical Internet research 13, 1 (2011).","paperID":"None"},{"content":"Burke, M., Kraut, R., and Joyce, E. Membership claims and requests: Conversation-level newcomer socialization strategies in online groups. Small group research 41, 1 (2010), 4--40.","paperID":"None"},{"content":"Dunbar, R. How Many Friends Does One Person Need?: Dunbar's Number and Other Evolutionary Quirks. Faber & Faber, 2010.","paperID":"None"},{"content":"Fang, L., Fabrikant, A., and LeFevre, K. Look who I found: Understanding the effects of sharing curated friend groups. In Proc. WebSci 2012, 137--146.","paperID":"None"},{"content":"Grabowicz, P. A., Aiello, L. M., Eguiluz, V. M., and Jaimes, A. Distinguishing topical and social groups based on common identity and bond theory. In Proc. WSDM 2013, 627--636.","paperID":"None"},{"content":"Gundotra, V. Google+: Communities and photos, 2012. googleblog.blogspot.com/2012/12/google-communities-andphotos.html.","paperID":"None"},{"content":"Gundotra, V. Google+ hangouts and photos: save some time, share your story, 2013. googleblog.blogspot.com/2013/10/google-hangouts-and-photossave-some.html.","paperID":"None"},{"content":"Hafner, K. The well: A story of love, death & real life in the seminal online community. Avalon Publishing Group, 2001.","paperID":"None"},{"content":"Kairam, S., Brzozowski, M., Huffaker, D., and Chi, E. Talking in circles: selective sharing in Google+. In Proc. CHI 2012, 1065--1074.","paperID":"None"},{"content":"Kraut, R. E., and Resnick, P. Building successful online communities. The MIT Press, 2012.","paperID":"None"},{"content":"Lazar, J., and Preece, J. Classification schema for online communities. In Proc. of the Association for Information Systems Americas Conference (1998), 84--86.","paperID":"None"},{"content":"Lazarsfeld, P. F., and Merton, R. K. Friendship as a social process: A substantive and methodological analysis. In Freedom and control in modern society, M. Berger and T. Abel, Eds. Van Nostrand, New York, 1954.","paperID":"None"},{"content":"Magno, G., Comarela, G., Saez-Trumper, D., Cha, M., and Almeida, V. New kid on the block: exploring the Google+ social graph. In Proc. IMC 2012, 159--170.","paperID":"None"},{"content":"Myers, S. A., Sharma, A., Gupta, P., and Lin, J. Information network or social network?: The structure of the twitter follow graph. In Proc. WWW Companion (2014), 493--498.","paperID":"None"},{"content":"Naaman, M., Boase, J., and Lai, C.-H. Is it really about me?: Message content in social awareness streams. In Proc. CSCW 2010, 189--192.","paperID":"None"},{"content":"Newman, M. E. The structure and function of complex networks. SIAM review 45, 2 (2003), 167--256.","paperID":"None"},{"content":"Oldenburg, R. The great good place: Cafes, coffee shops, bookstores, bars, hair salons, and other hangouts at the heart of a community. Da Capo Press, 1997.","paperID":"None"},{"content":"Pariser, E. The filter bubble: How the new personalized Web is changing what we read and how we think. Penguin, 2011.","paperID":"None"},{"content":"Park, N., Kee, K. F., and Valenzuela, S. Being immersed in social networking environment: Facebook groups, uses and gratifications, and social outcomes. CyberPsychology & Behavior 12, 6 (2009), 729--733.","paperID":"None"},{"content":"Prentice, D. A., Miller, D. T., and Lightdale, J. R. Asymmetries in attachments to groups and to their members: Distinguishing between common-identity and common-bond groups. Personality and Social Psychology Bulletin 20, 5 (1994), 484--493.","paperID":"None"},{"content":"Ren, Y., Kraut, R., and Kiesler, S. Applying common identity and bond theory to design of online communities. Organization studies 28, 3 (2007), 377--408.","paperID":"None"},{"content":"Ridings, C. M., and Gefen, D. Virtual community attraction: Why people hang out online. Journal of Computer-Mediated Communication 10, 1 (2004).","paperID":"None"},{"content":"Rood, V., and Bruckman, A. Member behavior in company online communities. In Proc. GROUP 2009, 209--218.","paperID":"None"},{"content":"Schiöberg, D., Schneider, F., Schiöberg, H., Schmid, S., Uhlig, S., and Feldmann, A. Tracing the birth of an OSN: social graph and profile analysis in Google+. In Proc. WebSci 2012, 265--274.","paperID":"None"},{"content":"Shirky, C. Here comes everybody: The power of organizing without organizations. Penguin, 2008.","paperID":"None"},{"content":"Soukup, C. Computer-mediated communication as a virtual third place: Building Oldenburg's great good places on the world wide web. New Media & Society 8, 3 (2006), 421--440.","paperID":"None"},{"content":"Wang, Y.-C., Kraut, R., and Levine, J. M. To stay or leave?: The relationship of emotional and informational support to commitment in online health support groups. In Proc. CSCW 2012, 833--842.","paperID":"None"},{"content":"Watson, J., Besmer, A., and Lipford, H. R. +Your circles: sharing behavior on Google+. In Proc. SOUPS 2012, 12:1--12:9.","paperID":"None"},{"content":"Wenger, E. Communities of practice: Learning, meaning, and identity. Cambridge University Press, 1998.","paperID":"None"},{"content":"Woolley, J. K., Limperos, A. M., and Oliver, M. B. The 2008 presidential election, 2.0: A content analysis of user-generated political facebook groups. Mass Communication and Society 13, 5 (2010), 631--652.","paperID":"None"},{"content":"Wu, F., and Huberman, B. A. Novelty and collective attention. PNAS 104, 45 (2007), 17599--17601.","paperID":"None"}],"title":"Google+ Communities as Plazas and Topic Boards","filename":"CHI15/p3779","authors":["Michael J. Brzozowski","Phil Adams","Ed H. Chi"],"conference":"CHI '15"}