{"paperId":2702435,"citation":[],"reference":[{"content":"Arjan, R., et al. Age differences in online social networking. Extended Abst. on CHI'08. ACM, (2008).","paperID":"None"},{"content":"Bae, J., et al. Ripening room: designing social media for self-reflection in self-expression. Proc. DIS 2014. ACM, (2014).","paperID":"None"},{"content":"Bagnara, S., and Pozzi, S. Design for reflection. Work: A Journal of Prevention, Assessment and Rehabilitation 41 (2012), 1108--1113.","paperID":"None"},{"content":"Boyd, D. Why youth (heart) social network sites: The role of networked publics in teenage social life. MacArthur foundation series on digital learning-Youth, identity, and digital media (2007), 119--142.","paperID":"None"},{"content":"Burgoon, J.K., Walther, J.B. Nonverbal expectancies and the evaluative consequences of violations. Human Communication Research 17, 2 (1990), 232--265.","paperID":"None"},{"content":"Danzico, L. Adding By Leaving Out: The Power of the Pause, Interactions 17, 4 (2010), 55--57.","paperID":"None"},{"content":"Forest, L., and Wood, J. When Social Networking Is Not Working Individuals With Low Self-Esteem Recognize but Do Not Reap the Benefits of Self-Disclosure on Facebook. Psychological Science (2012).","paperID":"None"},{"content":"Fullerton, B. Designing for Solitude. Interactions, 17, 6 (2010), 6--9.","paperID":"None"},{"content":"Grosse-Hering, B., et al. Slow design for meaningful interactions. Proc. CHI 2013. ACM (2013).","paperID":"None"},{"content":"Hallnäs, L., and Redström, J. Slow technology-designing for reflection. Personal and ubiquitous computing 5, 3 (2001), 201--212.","paperID":"None"},{"content":"Harper, R., Whitworth, E. and Page, R. Fixity: Identity, time and durée on Facebook. In Proc. IR 13, 0 (2012).","paperID":"None"},{"content":"Kaplan, A., and Haenlein, M. Users of the world, unite! The challenges and opportunities of Social Media. Business horizons 53, 1 (2010), 59--68.","paperID":"None"},{"content":"Keightley, E. Introduction: time, media, modernity. In Time, Media and Modernity. Basingstoke: Palgrave Macmillan, pp. 1--24.","paperID":"None"},{"content":"Manago, A., Taylor, T. and Greenfield, P. Me and my 400 friends: the anatomy of college students' Facebook networks, their communication patterns, and well-being. Developmental psychology 48, 2 (2012), 369.","paperID":"None"},{"content":"Page, R. Re-examining narrativity: Small stories in status updates, Text & Talk 30 (2010), 423--444.","paperID":"None"},{"content":"Pai, P., and Arnott, C. User adoption of social networking sites: Eliciting uses and gratifications through a meansend approach.ComputersinHumanBehavior29,3 (2013).","paperID":"None"},{"content":"Reis, H. T., and Shaver, P. Intimacy as an interpersonal process. In Handbook of personal relationships (1988).","paperID":"None"},{"content":"Sengers, P. What I learned on Change Islands: reflections on IT and pace of life. Interactions 18, 2 (2011).","paperID":"None"},{"content":"Sleeper, M., et al. i read my Twitter the next morning and was astonished: a conversational perspective on Twitter regrets. Proc. CHI 2013. ACM, (2013).","paperID":"None"},{"content":"Stutzman, F., and Hartzog, W. Boundary regulation in social media. Proc. CSCW 2012. ACM (2012).","paperID":"None"},{"content":"Walther, B. Computer-mediated communication: impersonal, interpersonal, & hyperpersonal interaction (1996).","paperID":"None"},{"content":"Wang, Qi, et al. Think twice before reposting it: Promoting accountable behavior on Sina Weibo. Proc. of CSCWD 18th. IEEE, (2014).","paperID":"None"},{"content":"Wang, Y., et al. I regretted the minute I pressed share: A qualitative study of regrets on Facebook. Proc. Sym. on Usable Privacy and Security. ACM, (2011).","paperID":"None"},{"content":"Wang, Y., et al. Privacy nudges for social media: an exploratory Facebook study. Proc. WWW 2013. (2013).","paperID":"None"},{"content":"Wisniewski, P., Lipford, H., and Wilson, D. Fighting for my space: Coping mechanisms for SNS boundary regulation. Proc. CHI 2012. ACM, (2012).","paperID":"None"}],"abstract":"The evolution of SNS applications has focused on the increasing pace of communication. Accordingly, adopting pause moment design for the SNS domain becomes significant, considering its worth for mental well-being and diversity of experience. Nonetheless, the vision is currently controversial, as it is lacking in attempts to examine the worth of pause moment design for SNS communication. Therefore, we discussed the benefits of pause moment design as an SNS application, based on the case of Ripening Room. From observation, we have identified three benefits of pause moment design; preserving room for solitude, expanding time experience, and providing additional indirect cues for communication. Nevertheless, the benefits also imply limitations of the current design, thus require following attempts to adopt a pause moment design for the SNS domain.","title":"Pause Moment Experience in SNS Communication","filename":"CHI15/p2113","authors":["Jae-eul Bae","Youn-kyung Lim","Jin-bae Bang","Myung-suk Kim"],"conference":"CHI '15"}