{"paperId":2702525,"citation":[{"content":"Erin Buehler, Supporting inclusive and collaborative postsecondary education for adults with intellectual disabilities, ACM SIGACCESS Accessibility and Computing","paperID":"2904096"},{"content":"Megan Kelly Hofmann, Making Connections: Modular 3D Printing for Designing Assistive Attachments to Prosthetic Devices, Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, October 26-28, 2015, Lisbon, Portugal","paperID":"2811323"},{"content":"Lei Shi, Talkabel: A Labeling Method for 3D Printed Models, Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, October 26-28, 2015, Lisbon, Portugal","paperID":"2811327"},{"content":"Abigale Stangl , Chia-Lo Hsu , Tom Yeh, Transcribing Across the Senses: Community Efforts to Create 3D Printable Accessible Tactile Pictures for Young Children with Visual Impairments, Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, October 26-28, 2015, Lisbon, Portugal","paperID":"2809854"}],"reference":[{"content":"Adelson, E. Best Foot Forward. Boston Magazine, 2009. http://www.bostonmagazine.com/2009/02/best-footforward-february/.","paperID":"None"},{"content":"Erin Buehler , Shaun K. Kane , Amy Hurst, ABC and 3D: opportunities and obstacles to 3D printing in special education environments, Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility, October 20-22, 2014, Rochester, New York, USA","paperID":"2661365"},{"content":"Melissa Dawe, Desperately seeking simplicity: how young adults with cognitive disabilities and their families adopt assistive technologies, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124943"},{"content":"Fox, M. Sam Farber, Creator of Oxo Utensils, Dies at 88. NYTimes.com, 2013. http://www.nytimes.com/2013/06/22/business/samfarber-creator-of-oxo-utensils-dies-at-88.html.","paperID":"None"},{"content":"Neil Gershenfeld, Fab: The Coming Revolution on Your Desktop--from Personal Computers to Personal Fabrication, Basic Books, Inc., New York, NY, 2007","paperID":"1211574"},{"content":"Jonathan Hook , Sanne Verbaan , Abigail Durrant , Patrick Olivier , Peter Wright, A study of the challenges related to DIY assistive technology in the context of children with disabilities, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598530"},{"content":"Hook, J., Verbaan, S., Wright, P., and Olivier, P. Exploring the Design of technologies and services that support do-it-yourself assistive technology practice. Proceedings of DE '2013, (2013).","paperID":"None"},{"content":"Amy Hurst , Shaun Kane, Making \"making\" accessible, Proceedings of the 12th International Conference on Interaction Design and Children, June 24-27, 2013, New York, New York, USA","paperID":"2485883"},{"content":"Amy Hurst , Jasmine Tobias, Empowering individuals with do-it-yourself assistive technology, The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility, October 24-26, 2011, Dundee, Scotland, UK","paperID":"2049541"},{"content":"IT Accessibility Workforce. Assistive Technology Act of 1998. 1998. http://www.section508.gov/assistivetechnology-act-1998.","paperID":"None"},{"content":"Kuznetsov, S. and Paulos, E. Rise of the expert amateur. Proceedings of NordiCHI '10, (2010), 295.","paperID":"None"},{"content":"Silvia Lindtner , Garnet D. Hertz , Paul Dourish, Emerging sites of HCI innovation: hackerspaces, hardware startups & incubators, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557132"},{"content":"OXO Consumer Services. About Us - XO Thoughtfully Yours. 2014. http://www.oxo.com/AboutOXO.aspx.","paperID":"None"},{"content":"Phillips, B. and Zhao, H. Predictors of Assistive Technology Abandonment. Assistive Technology 5, 1 (1993), 36--45.","paperID":"None"},{"content":"Rosner, D. and Bean, J. Learning from IKEA hacking. Proceedings of CHI '09, (2009), 419.","paperID":"None"},{"content":"Kristen Shinohara , Jacob O. Wobbrock, In the shadow of misperception: assistive technology use and social interactions, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979044"},{"content":"Tanenbaum, J.G., Williams, A.M., Desjardins, A., and Tanenbaum, K. Democratizing technology. Proceedings of CHI '13, (2013), 2603.","paperID":"None"},{"content":"The Braille Authority of North America. Guidelines and Standards for Tactile Graphics, 2010. 2014. http://www.brailleauthority.org/tg/webmanual/index.html.","paperID":"None"},{"content":"Tiffany Tseng , Mitchel Resnick, Product versus process: representing and appropriating DIY projects online, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598540"}],"abstract":"An increasing number of online communities support the open-source sharing of designs that can be built using rapid prototyping to construct physical objects. In this paper, we examine the designs and motivations for assistive technology found on Thingiverse.com, the largest of these communities at the time of this writing. We present results from a survey of all assistive technology that has been posted to Thingiverse since 2008 and a questionnaire distributed to the designers exploring their relationship with assistive technology and the motivation for creating these designs. The majority of these designs are intended to be manufactured on a 3D printer and include assistive devices and modifications for individuals with disabilities, older adults, and medication management. Many of these designs are created by the end-users themselves or on behalf of friends and loved ones. These designers frequently have no formal training or expertise in the creation of assistive technology. This paper discusses trends within this community as well as future opportunities and challenges.","video":"http://www.youtube.com/embed/oAOt33Q7Skk?rel=0","title":"Sharing is Caring: Assistive Technology Designs on Thingiverse","filename":"CHI15/p525","authors":["Erin Buehler","Stacy Branham","Abdullah Ali","Jeremy J. Chang","Megan Kelly Hofmann","Amy Hurst","Shaun K. Kane"],"conference":"CHI '15"}