{"paperId":2702476,"citation":[],"abstract":"Animated transition has been a popular design choice for smoothly switching between different visualization views or layouts, in which movement trajectories are created as cues for tracking objects during location shifting. Tracking moving objects, however, becomes difficult when their movement paths overlap or the number of tracking targets increases. We propose a novel design to facilitate tracking moving objects in animated transitions. Instead of simply animating an object along a straight line, we create \"bundled\" movement trajectories for a group of objects that have spatial proximity and share similar moving directions. To study the effect of bundled trajectories, we untangle variations due to different aspects of tracking complexity in a comprehensive controlled user study. The results indicate that using bundled trajectories is particularly effective when tracking more targets (six vs. three targets) or when the object movement involves a high degree of occlusion or deformation. Based on the study, we discuss the advantages and limitations of the new technique, as well as provide design implications.","video":"http://www.youtube.com/embed/cd7FN8ZuTbY?rel=0","reference":[{"content":"Alvarez, G. A., and Franconeri, S. L. How many objects can you track? evidence for a resource-limited attentive tracking mechanism. Journal of Vision 7, 13 (2007), 14.1--10.","paperID":"None"},{"content":"Bach, B., Pietriga, E., and Fekete, J.-D. Graphdiaries: Animated transitions and temporal navigation for dynamic networks. IEEE TVCG 20, 5 (2014), 740--754.","paperID":"None"},{"content":"Baecker, R., and Small, I. Animation at the interface, 1990.","paperID":"None"},{"content":"Cao, N., Gotz, D., Sun, J., and Qu, H. Dicon: Interactive visual analysis of multidimensional clusters. IEEE TVCG 17, 12 (2011), 2581--2590.","paperID":"None"},{"content":"Chevalier, F., Dragicevic, P., and Franconeri, S. The not-so-staggering effect of staggered animated transitions on visual tracking. IEEE TVCG 20, 12 (2014), 2241--2250.","paperID":"None"},{"content":"Dragicevic, P., Bezerianos, A., Javed, W., Elmqvist, N., and Fekete, J.-D. Temporal distortion for animated transitions. In Proc. of SIGCHI (2011), 2009--2018.","paperID":"None"},{"content":"Eades, P. A heuristics for graph drawing. Congr. Numer. 42 (1984), 146--160.","paperID":"None"},{"content":"Elmqvist, N., Dragicevic, P., and Fekete, J.-D. Rolling the dice: Multidimensional visual exploration using scatterplot matrix navigation. IEEE TVCG 14, 6 (2008), 1539--1148.","paperID":"None"},{"content":"Feria, C. S. Speed has an effect on multiple-object tracking independently of the number of close encounters between targets and distractors. Attention, Perception & Psychophysics 75, 1 (2013), 53--67.","paperID":"None"},{"content":"Franconeri, S. L., Jonathan, S. V., and Scimeca, J. M. Tracking multiple objects is limited only by object spacing, not by speed, time, or capacity. Psychological Science 21, 7 (2010), 920--925.","paperID":"None"},{"content":"Franconeri, S. L., Lin, J. Y., Pylyshyn, Z. W., Fisher, B., and Enns, J. T. Evidence against a speed limit in multiple-object tracking. Psychonomic Bulletin & Review 15, 4 (2008), 802--808.","paperID":"None"},{"content":"Franconeri, S. L., Pylyshyn, Z. W., and Scholl, B. J. A simple proximity heuristic allows tracking of multiple objects through occlusion. Attention, Perception & Psychophysics 74, 4 (2012), 691--702.","paperID":"None"},{"content":"Guilmaine, D., Viau, C., and McGuffin, M. J. Hierarchically animated transitions in visualizations of tree structures. In Proc. of AVI (2012), 514--521.","paperID":"None"},{"content":"Heer, J., and Robertson, G. Animated transitions in statistical data graphics. IEEE TVCG 13, 6 (2007), 1240--1247.","paperID":"None"},{"content":"Henry, N., Fekete, J.-D., and McGuffin, M. Nodetrix: a hybrid visualization of social networks. IEEE TVCG 13, 6 (2007), 1302--1309.","paperID":"None"},{"content":"Holten, D. Hierarchical edge bundles: Visualization of adjacency relations in hierarchical data. IEEE TVCG 12, 5 (2006), 741--748.","paperID":"None"},{"content":"Jardine, N. L., and Seiffert, A. E. Tracking objects that move where they are headed. Attention, Perception & Psychophysics 73, 7 (2011), 2168--2179.","paperID":"None"},{"content":"Jolicoeur, P., Ullman, S., and Mackay, M. Curve tracing: A possible basic operation in the perception of spatial relations. Memory & Cognition 14, 2 (1986), 129--140.","paperID":"None"},{"content":"Koflka, K. Principles of gestalt psychology. New York: Har (1935).","paperID":"None"},{"content":"Lasseter, J. Principles of traditional animation applied to 3d computer animation. ACM Siggraph Computer Graphics 21, 4 (1987), 35--44.","paperID":"None"},{"content":"Plaisant, C., Grosjean, J., and Bederson, B. B. Spacetree: Supporting exploration in large node link tree, design evolution and empirical evaluation. In IEEE InfoVis (2002), 57--64.","paperID":"None"},{"content":"Pylyshyn, Z. W. Some puzzling findings in multiple object tracking: I. tracking without keeping track of object identities. Visual Cognition 11, 7 (2004), 801--822.","paperID":"None"},{"content":"Pylyshyn, Z. W., and Storm, R. W. Tracking multiple independent targets: evidence for a parallel tracking mechanism. Spatial Vision 3, 3 (1988), 179--197.","paperID":"None"},{"content":"Robertson, G., Fernandez, R., Fisher, D., Lee, B., and Stasko, J. Effectiveness of animation in trend visualization. IEEE TVCG 14, 6 (2008), 1325--1332.","paperID":"None"},{"content":"Scholl, B. J., Pylyshyn, Z. W., and Feldman, J. What is a visual object? evidence from target merging in multiple object tracking. Cognition 80, 1--2 (2001), 159--177.","paperID":"None"},{"content":"Shim, W. M., Alvarez, G. A., and Jiang, Y. V. Spatial separation between targets constrains maintenance of attention on multiple objects. Psychonomic Bulletin & Review 15, 2 (2008), 390--397.","paperID":"None"},{"content":"Suganuma, M., and Yokosawa, K. Grouping and trajectory storage in multiple object tracking: impairments due to common item motions. Perception 35, 4 (2006), 483--495.","paperID":"None"},{"content":"Tversky, B., Morrison, J. B., and Betrancourt, M. Animation: Can it facilitate? International Journal of Human-Computer Studies 57, 4 (2002), 247--262.","paperID":"None"},{"content":"Wattenberg, M. Visual exploration of multivariate graphs. In Proc. of SIGCHI (2006), 811--819.","paperID":"None"},{"content":"Yantis, S. Multielement visual tracking: Attention and perceptual organization. Cognitive Psychology 24, 3 (1992), 295--340.","paperID":"None"}],"title":"Trajectory Bundling for Animated Transitions","filename":"CHI15/p289","authors":["Fan Du","Nan Cao","Jian Zhao","Yu-Ru Lin"],"conference":"CHI '15"}