{"paperId":2702549,"abstract":"Software development is usually a collaborative venture. Open Source Software (OSS) projects are no exception; indeed, by design, the OSS approach can accommodate teams that are more open, geographically distributed, and dynamic than commercial teams. This, we find, leads to OSS teams that are quite diverse. Team diversity, predominantly in offline groups, is known to correlate with team output, mostly with positive effects. How about in OSS? Using GitHub, the largest publicly available collection of OSS projects, we studied how gender and tenure diversity relate to team productivity and turnover. Using regression modeling of GitHub data and the results of a survey, we show that both gender and tenure diversity are positive and significant predictors of productivity, together explaining a sizable fraction of the data variability. These results can inform decision making on all levels, leading to better outcomes in recruiting and performance.","citation":[{"content":"Bogdan Vasilescu , Alexander Serebrenik , Vladimir Filkov, A data set for social diversity studies of GitHub teams, Proceedings of the 12th Working Conference on Mining Software Repositories, May 16-24, 2015, Florence, Italy","paperID":"2820601"},{"content":"Bogdan Vasilescu , Vladimir Filkov , Alexander Serebrenik, Perceptions of diversity on GitHub: a user survey, Proceedings of the Eighth International Workshop on Cooperative and Human Aspects of Software Engineering, May 16-24, 2015, Florence, Italy","paperID":"2819330"},{"content":"Yue Yu , Huaimin Wang , Vladimir Filkov , Premkumar Devanbu , Bogdan Vasilescu, Wait for it: determinants of pull request evaluation latency on GitHub, Proceedings of the 12th Working Conference on Mining Software Repositories, May 16-24, 2015, Florence, Italy","paperID":"2820564"},{"content":"Casey Casalnuovo , Bogdan Vasilescu , Premkumar Devanbu , Vladimir Filkov, Developer onboarding in GitHub: the role of prior social links and language experience, Proceedings of the 2015 10th Joint Meeting on Foundations of Software Engineering, August 30-September 04, 2015, Bergamo, Italy","paperID":"2786854"},{"content":"Anya Helene Bagge , Vadim Zaytsev, Open and Original Problems in Software Language Engineering 2015 Workshop Report, ACM SIGSOFT Software Engineering Notes, v.40 n.3, May 2015","paperID":"2757313"},{"content":"Bogdan Vasilescu , Yue Yu , Huaimin Wang , Premkumar Devanbu , Vladimir Filkov, Quality and productivity outcomes relating to continuous integration in GitHub, Proceedings of the 2015 10th Joint Meeting on Foundations of Software Engineering, August 30-September 04, 2015, Bergamo, Italy","paperID":"2786850"},{"content":"Alexander Serebrenik , Tom Mens, Challenges in Software Ecosystems Research, Proceedings of the 2015 European Conference on Software Architecture Workshops, September 07-11, 2015, Dubrovnik, Cavtat, Croatia","paperID":"2797475"}],"reference":[{"content":"Jose Apesteguia , Ghazala Azmat , Nagore Iriberri, The Impact of Gender Composition on Team Performance and Decision Making: Evidence from the Field, Management Science, v.58 n.1, p.78-93, 01 2012","paperID":"2108257"},{"content":"Aries, E. Interaction patterns and themes of male, female, and mixed groups. Small Group Behavior (1976).","paperID":"None"},{"content":"Bates, D. M. lme4: Mixed-effects modeling with R, 2010.","paperID":"None"},{"content":"Andrew Begel , Nachiappan Nagappan, Usage and Perceptions of Agile Software Development in an Industrial Context: An Exploratory Study, Proceedings of the First International Symposium on Empirical Software Engineering and Measurement, p.255-264, September 20-21, 2007","paperID":"1302944"},{"content":"Christian Bird , Alex Gourley , Prem Devanbu , Michael Gertz , Anand Swaminathan, Mining email social networks, Proceedings of the 2006 international workshop on Mining software repositories, May 22-23, 2006, Shanghai, China","paperID":"1138016"},{"content":"Christian Bird , Alex Gourley , Prem Devanbu , Anand Swaminathan , Greta Hsu, Open Borders? Immigration in Open Source Projects, Proceedings of the Fourth International Workshop on Mining Software Repositories, p.6, May 20-26, 2007","paperID":"1269016"},{"content":"Christian Bird , David Pattison , Raissa D'Souza , Vladimir Filkov , Premkumar Devanbu, Latent social structure in open source projects, Proceedings of the 16th ACM SIGSOFT International Symposium on Foundations of software engineering, November 09-14, 2008, Atlanta, Georgia","paperID":"1453107"},{"content":"Christian Bird , Nachiappan Nagappan , Premkumar Devanbu , Harald Gall , Brendan Murphy, Does distributed development affect software quality?: an empirical case study of Windows Vista, Communications of the ACM, v.52 n.8, August 2009","paperID":"1536639"},{"content":"Christian Bird , Peter C. Rigby , Earl T. Barr , David J. Hamilton , Daniel M. German , Prem Devanbu, The promises and perils of mining git, Proceedings of the 2009 6th IEEE International Working Conference on Mining Software Repositories, p.1-10, May 16-17, 2009","paperID":"1591132"},{"content":"Blau, P. M. Inequality and heterogeneity: A primitive theory of social structure, vol. 7. Free Press NY, 1977.","paperID":"None"},{"content":"Frederick P. Brooks, Jr., The mythical man-month (anniversary ed.), Addison-Wesley Longman Publishing Co., Inc., Boston, MA, 1995","paperID":"207583"},{"content":"Byrne, D. E. The attraction paradigm. Personality and psychopathology. Academic Press, 1971.","paperID":"None"},{"content":"Jilin Chen , Yuqing Ren , John Riedl, The effects of diversity on group productivity and member withdrawal in online volunteer groups, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753447"},{"content":"Cohen, J. Statistical Power Analysis for the Behavioral Sciences. Lawrence Erlbaum Associates, 1988.","paperID":"None"},{"content":"Croson, R., and Gneezy, U. Gender differences in preferences. J. Econ. Lit. (2009), 448--474.","paperID":"None"},{"content":"Laura Dabbish , Colleen Stuart , Jason Tsay , Jim Herbsleb, Social coding in GitHub: transparency and collaboration in an open software repository, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145396"},{"content":"Laura Dabbish , Colleen Stuart , Jason Tsay , James Herbsleb, Leveraging Transparency, IEEE Software, v.30 n.1, p.37-43, January 2013","paperID":"2478853"},{"content":"Daniel, S., et al. The effects of diversity in global, distributed collectives: A study of open source project success. Inform. Syst. Res. 24, 2 (2013), 312--333.","paperID":"None"},{"content":"David, P. A., and Shapiro, J. S. Community-based production of open-source software: What do we know about the developers who participate? Information Economics and Policy 20, 4 (2008), 364--398.","paperID":"None"},{"content":"de Gilder, D., and Wilke, H. A. M. Expectation states theory and the motivational determinants of social influence. Eur. Rev. Soc. Psychol. 5, 1 (1994), 243--269.","paperID":"None"},{"content":"Claudia De O. Melo , Daniela S. Cruzes , Fabio Kon , Reidar Conradi, Interpretative case studies on agile team productivity and management, Information and Software Technology, v.55 n.2, p.412-427, February, 2013","paperID":"2401010"},{"content":"Pedro Domingos, A few useful things to know about machine learning, Communications of the ACM, v.55 n.10, October 2012","paperID":"2347755"},{"content":"Nicolas Ducheneaut, Socialization in an Open Source Software Community: A Socio-Technical Analysis, Computer Supported Cooperative Work, v.14 n.4, p.323-368, August    2005","paperID":"1095338"},{"content":"Earley, C. P., and Mosakowski, E. Creating hybrid team cultures: An empirical test of transnational team functioning. Acad. Manag. J. 43, 1 (2000), 26--49.","paperID":"None"},{"content":"Easterbrook, S., et al. Selecting empirical methods for software engineering research. In Guide Adv. Empir. Softw. Eng. Springer, 2008, 285--311.","paperID":"None"},{"content":"Joseph Feller , Brian Fitzgerald, A framework analysis of the open source software development paradigm, Proceedings of the twenty first international conference on Information systems, p.58-69, December 2000, Brisbane, Queensland, Australia","paperID":"359723"},{"content":"Mathieu Goeminne , Tom Mens, A comparison of identity merge algorithms for software repositories, Science of Computer Programming, v.78 n.8, p.971-986, August, 2013","paperID":"2489675"},{"content":"Gould, R. V. The origins of status hierarchies: A formal theory and empirical test. Am. J. Sociol. 107, 5 (2002), 1143--1178.","paperID":"None"},{"content":"Georgios Gousios, The GHTorent dataset and tool suite, Proceedings of the 10th Working Conference on Mining Software Repositories, May 18-19, 2013, San Francisco, CA, USA","paperID":"2487132"},{"content":"Harrison, D. A., et al. Beyond relational demography: Time and the effects of surface-and deep-level diversity on work group cohesion. Acad. Manag. J. 41, 1 (1998), 96--107.","paperID":"None"},{"content":"Horwitz, S. K., and Horwitz, I. B. The effects of team diversity on team outcomes: A meta-analytic review of team demography. J. Manag. 33, 6 (2007), 987--1015.","paperID":"None"},{"content":"Howison, J., et al. Validity issues in the use of social network analysis with digital trace data. JAIS 12 (2011).","paperID":"None"},{"content":"Jackson, S. E., and Joshi, A. Diversity in social context: a multi-attribute, multilevel analysis of team diversity and sales performance. J. Organ. Behav. 25, 6 (2004), 675--702.","paperID":"None"},{"content":"Eirini Kalliamvakou , Georgios Gousios , Kelly Blincoe , Leif Singer , Daniel M. German , Daniela Damian, The promises and perils of mining GitHub, Proceedings of the 11th Working Conference on Mining Software Repositories, May 31-June 01, 2014, Hyderabad, India","paperID":"2597074"},{"content":"Erik Kouters , Bogdan Vasilescu , Mark G.  J. van den Brand , Alexander Serebrenik, Who's who in Gnome: Using LSA to merge software repository identities, Proceedings of the 2012 IEEE International Conference on Software Maintenance (ICSM), p.592-595, September 23-28, 2012","paperID":"2473615"},{"content":"Lakhani, K. R., and Von Hippel, E. How open source software works: \"free\" user-to-user assistance. Research Policy 32, 6 (2003), 923--943.","paperID":"None"},{"content":"Michael J. Lee , Bruce Ferwerda , Junghong Choi , Jungpil Hahn , Jae Yun Moon , Jinwoo Kim, GitHub developers use rockstars to overcome overflow of news, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468381"},{"content":"Lipsey, M., et al. Translating the statistical representation of the effects of education interventions into more readily interpretable forms. Tech. Rep. NCSER 2013--3000, U.S. Dept of Education, Institute of Education Sciences, 2012.","paperID":"None"},{"content":"Jennifer Marlow , Laura Dabbish , Jim Herbsleb, Impression formation in online peer production: activity traces and personal profiles in github, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441792"},{"content":"Martins, L. L., et al. Virtual teams: What do we know and where do we go from here? J. Manag. 30, 6 (2004), 805--835.","paperID":"None"},{"content":"Nora McDonald , Sean Goggins, Performance and participation in open source software on GitHub, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468382"},{"content":"Michailidou, A., and Economides, A. Gender and diversity in collaborative virtual teams. Computer Supported Collaborative Learning: Best practices and principles for instructors (2007), 199--224.","paperID":"None"},{"content":"Eric Molleman , Jannes Slomp, The impact of team and work characteristics on team functioning: Research Articles, Human Factors in Ergonomics & Manufacturing, v.16 n.1, p.1-15, January 2006","paperID":"1107420"},{"content":"Nafus, D. 'Patches don't have gender': What is not open in open source software. New Media & Society 14, 4 (2012), 669--683.","paperID":"None"},{"content":"Shaul Oreg , Oded Nov, Exploring motivations for contributing to open source initiatives: The roles of contribution context and personal values, Computers in Human Behavior, v.24 n.5, p.2055-2073, September 2008","paperID":"1385812"},{"content":"O'Reilly III, C. A., et al. Work group demography, social integration, and turnover. Admin. Sci. Quart. (1989), 21--37.","paperID":"None"},{"content":"Preece, J., and Shneiderman, B. The reader-to-leader framework: Motivating technology-mediated social participation. AIS Trans. Hum.-Comput. Interact. 1, 1 (2009), 13--32.","paperID":"None"},{"content":"Riordan, C. M., and Shore, L. M. Demographic diversity and employee attitudes: An empirical examination of relational demography within work units. J. Appl. Psychol. 82, 3 (1997), 342.","paperID":"None"},{"content":"Gregorio Robles , Laura Arjona Reina , Alexander Serebrenik , Bogdan Vasilescu , Jesús M. González-Barahona, FLOSS 2013: a survey dataset about free software contributors: challenges for curating, sharing, and combining, Proceedings of the 11th Working Conference on Mining Software Repositories, May 31-June 01, 2014, Hyderabad, India","paperID":"2597129"},{"content":"Robles, G., and Gonzalez-Barahona, J. M. Contributor turnover in libre software projects. In Open Source Systems. Springer, 2006, 273--286.","paperID":"None"},{"content":"Rogelberg, S. G., and Rumery, S. M. Gender diversity, team decision quality, time on task, and interpersonal cohesion. Small Group Research 27, 1 (1996), 79--90.","paperID":"None"},{"content":"Salancik, G. R., and Pfeffer, J. A social information processing approach to job attitudes and task design. Admin. Sci. Quart. 23, 2 (1978), 224--253.","paperID":"None"},{"content":"Simmons, J., et al. False-positive psychology undisclosed flexibility in data collection and analysis allows presenting anything as significant. Psychol. Sci. 22, 11 (2011).","paperID":"None"},{"content":"Stahl, G. K., et al. Unraveling the effects of cultural diversity in teams: A meta-analysis of research on multicultural work groups. J. Int. Bus. Stud. 41, 4 (2010), 690--709.","paperID":"None"},{"content":"Tajfel, H. Social psychology of intergroup relations. Annu. Rev. Psychol. 33, 1 (1982), 1--39.","paperID":"None"},{"content":"Takhteyev, Y., and Hilts, A. Investigating the geography of open source software through GitHub, 2010.","paperID":"None"},{"content":"Yida Tao , Yingnong Dang , Tao Xie , Dongmei Zhang , Sunghun Kim, How do software engineers understand code changes?: an exploratory study in industry, Proceedings of the ACM SIGSOFT 20th International Symposium on the Foundations of Software Engineering, November 11-16, 2012, Cary, North Carolina","paperID":"2393656"},{"content":"Sherry Turkle, The second self: computers and the human spirit, Simon & Schuster, Inc., New York, NY, 1984","paperID":"2773"},{"content":"Vasilescu, B., Capiluppi, A., and Serebrenik, A. Gender, representation and online participation: A quantitative study. Interacting with Computers (2013), 1--24.","paperID":"None"},{"content":"Bogdan Vasilescu , Vladimir Filkov , Alexander Serebrenik, StackOverflow and GitHub: Associations between Software Development and Crowdsourced Knowledge, Proceedings of the 2013 International Conference on Social Computing, p.188-195, September 08-14, 2013","paperID":"2573859"},{"content":"Bogdan Vasilescu , Alexander Serebrenik , Prem Devanbu , Vladimir Filkov, How social Q&A sites are changing knowledge sharing in open source software communities, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531659"},{"content":"Bogdan Vasilescu , Alexander Serebrenik , Mathieu Goeminne , Tom Mens, On the variation and specialisation of workload--A case study of the Gnome ecosystem community, Empirical Software Engineering, v.19 n.4, p.955-1008, August    2014","paperID":"2630468"},{"content":"Loxley Sijia Wang , Jilin Chen , Yuqing Ren , John Riedl, Searching for the goldilocks zone: trade-offs in managing online volunteer groups, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145351"},{"content":"Watson, W. E., et al. Cultural diversity's impact on interaction process and performance: Comparing homogeneous and diverse task groups. Acad. Manag. J. 36, 3 (1993), 590--602.","paperID":"None"},{"content":"Elaine J. Weyuker , Thomas J. Ostrand , Robert M. Bell, Do too many cooks spoil the broth? Using the number of developers to enhance defect prediction models, Empirical Software Engineering, v.13 n.5, p.539-559, October   2008","paperID":"1416837"},{"content":"Williams, K. Y., and O'Reilly, C. A. Demography and diversity in organizations: A review of 40 years of research. Res. Organ. Behav. 20 (1998), 77--140.","paperID":"None"},{"content":"Yunwen Ye , Kouichi Kishida, Toward an understanding of the motivation Open Source Software developers, Proceedings of the 25th International Conference on Software Engineering, May 03-10, 2003, Portland, Oregon","paperID":"776867"},{"content":"Zellmer-Bruhn, M. E., et al. When and how do differences matter? an exploration of perceived similarity in teams. Organ. Behav. Hum. Dec. 107, 1 (2008), 41--59.","paperID":"None"}],"title":"Gender and Tenure Diversity in GitHub Teams","filename":"CHI15/p3789","authors":["Bogdan Vasilescu","Daryl Posnett","Baishakhi Ray","Mark G.J. van den Brand","Alexander Serebrenik","Premkumar Devanbu","Vladimir Filkov"],"conference":"CHI '15"}