{"paperId":2702390,"citation":[],"reference":[{"content":"Recommendation ITU-T P.910 Subjective video quality assessment methods for multimedia applications. Telecommunication Standardization Sector of ITU (04 2008).","paperID":"None"},{"content":"Ball, R., and Hourcade, J. P. Rethinking reading for age from paper and computers. International Journal of Human-Computer Interaction 27, 11 (2011), 1066--1082.","paperID":"None"},{"content":"Chen, C.-H., and Chiang, S.-Y. Effects of screen resolution and column ratio on search performance and subjective preferences. Displays 33, 1 (2012), 28--35.","paperID":"None"},{"content":"Dillon, A. Reading from paper versus screens: A critical review of the empirical literature. Ergonomics 35, 10 (1992), 1297--1326.","paperID":"None"},{"content":"Huang, D.-L., Patrick Rau, P.-L., and Liu, Y. Effects of font size, display resolution and task type on reading chinese fonts from mobile devices. International Journal of Industrial Ergonomics 39, 1 (2009), 81--89.","paperID":"None"},{"content":"Menozzi, M., Lang, F., Naepflin, U., Zeller, C., and Krueger, H. Crt versus lcd: Effects of refresh rate, display technology and background luminance in visual performance. Displays 22, 3 (2001), 79--85.","paperID":"None"},{"content":"Müller, H., Gove, J., and Webb, J. Understanding tablet use. In Proceedings of the international conference on Human-computer interaction with mobile devices and services (2012).","paperID":"None"},{"content":"Jeff Sauro , Joseph S. Dumas, Comparison of three one-question, post-task usability questionnaires, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518946"},{"content":"Yang, S.-n., Tai, Y.-C., Hayes, J. R., and Sheedy, J. Superior smartphone display quality enhances viewing performance and comfort. Faculty Scholarship (2011).","paperID":"None"},{"content":"Ziefie, M. Effects of display resolution on visual performance. Human Factors: The Journal of the Human Factors and Ergonomics Society 40, 4 (1998), 554--568.","paperID":"None"},{"content":"Zijlstra, F., and Doorn, L. v. The construction of a scale to measure subjective effort. Tech. Rep. Delft University of Technology, Department of Philosophy and Social Sciences (1985).","paperID":"None"}],"abstract":"Pixel densities are increasing rapidly. We can observe this trend in particular for mobile devices like smartphones and tablets. Previous work revealed an effect of pixel density on subjective feedback and objective performance only for low resolution cathode ray tube screens. It is unclear if this effect persists for the four times higher pixel densities of current mobile devices. Therefore, we conducted a study to compare four pixel densities with 359, 180, 120, and 90 pixels per inch. While participants performed three tasks involving images, text and videos on a tablet, we measured perceived effort, perceived visual quality, task completion time, error rate, and body pose. Our results show that the effect of the pixel density highly depends on the content. We found that only for text, the four pixel densities have clearly different perceived media qualities. Pixel density seems to have a smaller effect on perceived media quality for images and videos and we found no effect on objective measures. Results show that text should be displayed in high resolution, while this is less important for images and videos.","title":"Subjective and Objective Effects of Tablet's Pixel Density","filename":"CHI15/p2769","authors":["Lars Lischke","Sven Mayer","Katrin Wolf","Alireza Sahami Shirazi","Niels Henze"],"conference":"CHI '15"}