{"paperId":2702154,"abstract":"Food choices are among the most frequent and important health decisions in everyday life, but remain notoriously difficult to capture. This work examines opportunities for lightweight photo-based capture in mobile food journals. We first report on a survey of 257 people, examining how they define healthy eating, their experiences and challenges with existing food journaling methods, and their ability to interpret nutritional information that can be captured in a food journal. We then report on interviews and a field study with 27 participants using a lightweight, photo-based food journal for between 4 to 8 weeks. We discuss mismatches between motivations and current designs, challenges of current approaches to food journaling, and opportunities for photos as an alternative to the pervasive but often inappropriate emphasis on quantitative tracking in mobile food journals.","citation":[{"content":"Tom Owen , Jennifer Pearson , Harold Thimbleby , George Buchanan, ConCap: Designing to Empower Individual Reflection on Chronic Conditions using Mobile Apps, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, August 24-27, 2015, Copenhagen, Denmark","paperID":"2785881"},{"content":"Farahnaz Yekeh , Judy Kay , Bob Kummerfeld , Lie Ming Tang , Margaret A. Allman-Farinelli, Can SAL Support Self Reflection for Health and Nutrition?, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838752"},{"content":"Longqi Yang , Yin Cui , Fan Zhang , John P. Pollak , Serge Belongie , Deborah Estrin, PlateClick: Bootstrapping Food Preferences Through an Adaptive Visual Interface, Proceedings of the 24th ACM International on Conference on Information and Knowledge Management, October 18-23, 2015, Melbourne, Australia","paperID":"2806544"},{"content":"Daniel A. Epstein , An Ping , James Fogarty , Sean A. Munson, A lived informatics model of personal informatics, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2804250"},{"content":"Tauhidur Rahman , Mary Czerwinski , Ran Gilad-Bachrach , Paul Johns, Predicting \"About-to-Eat\" Moments for Just-in-Time Eating Intervention, Proceedings of the 6th International Conference on Digital Health Conference, April 11-13, 2016, Montréal, Québec, Canada","paperID":"2896359"}],"reference":[{"content":"Amft, O., Stäger, M., Lukowicz, P., and Tröster, G. Analysis of Chewing Sounds for Dietary Monitoring. UbiComp 2005, 56--72.","paperID":"None"},{"content":"Andrew, A.H., Borriello, G., and Fogarty, J. Simplifying Mobile Phone Food Diaries: Design and Evaluation of a Food Index-Based Nutrition Diary. PervasiveHealth 2013, 260--263.","paperID":"None"},{"content":"Arab, L., Estrin, D., Kim, D.H., Burke, J., and Goldman, J. (2011). Feasibility Testing of an Automated Image-Capture Method to Aid Dietary Recall. Eur J Clin Nutr, 65(10), 1156--1162.","paperID":"None"},{"content":"Barrett-Connor, E. (1991). Nutrition Epidemiology: How Do We Know What They Ate? Am J Clin Nutr, 54(1 Suppl), 182S--187S.","paperID":"None"},{"content":"Baumer, E.P.S., Katz, S.J., Freeman, J.E., Adams, P., Gonzales, A.L., Pollak, J., Retelny, D., Niederdeppe, J., Olson, C.M., and Gay, G.K. Prescriptive Persuasion and Open-Ended Social Awareness. CSCW 2012, 475--484.","paperID":"None"},{"content":"Bird, G. and Elwood, P.C. (1983). The Dietary Intakes of Subjects Estimated from Photographs Compared with a Weighed Record. Hum Nutr Appl Nutr, 37(6), 470--473.","paperID":"None"},{"content":"Burke, B.S. (1947). The Dietary History as a Tool in Research. J Am Diet Assoc, 23(12), 1041--1046.","paperID":"None"},{"content":"Burke, L.E., Wang, J., and Sevick, M.A. (2011). Self-Monitoring in Weight Loss: A Systematic Review of the Literature. J Am Diet Assoc, 111(1), 92--102.","paperID":"None"},{"content":"Chahoud, G., Aude, Y.W., and Mehta, J.L. (2004). Dietary Recommendations in the Prevention and Treatment of Coronary Heart Disease: Do We Have the Ideal Diet Yet? Am J Cardiol, 94(10), 1260--1267.","paperID":"None"},{"content":"Choe, E.K., Lee, N.B., Lee, B., Pratt, W., and Kientz, J.A. Understanding Quantified-Selfers? Practices in Collecting and Exploring Personal Data. CHI 2014, 1143--1152.","paperID":"None"},{"content":"Cordeiro, F., Epstein, D.,Thomaz, E., Bales, E., Jagannathan, A.K., Abowd, G., and Fogarty, J. Barriers and Negative Nudges: Exploring Challenges in Food Journaling. CHI 2015, To Appear.","paperID":"None"},{"content":"Craig, M.R., Kristal, A.R., Cheney, C.L., and Shattuck, A.L. (2000). The Prevalence and Impact of 'Atypical' Days in 4-Day Food Records. J Am Diet Assoc, 100(4), 421--427.","paperID":"None"},{"content":"Frost, J. and Smith, B.K. Visualizing Health: Imagery in Diabetes Education. DUX 2003, 1--14.","paperID":"None"},{"content":"Grimes, A. and Harper, R. Celebratory Technology: New Directions for Food Research in HCI. CHI 2008, 467--476.","paperID":"None"},{"content":"Heizer, W.D., Southern, S., and McGovern, S. (2009). The Role of Diet in Symptoms of Irritable Bowel Syndrome in Adults: A Narrative Review. J Am Diet Assoc, 109(7), 1204--1214.","paperID":"None"},{"content":"Hollis, J.F., Gullion, C.M., Stevens, V.J., Brantley, P.J., Appel, L.J., Ard, J.D., Champagne, C.M., Dalcin, A., Erlinger, T.P., Funk, K., Laferriere, D., Lin, P.-H., Loria, C.M., Samuel-Hodge, C., Vollmer, W.M., and Svetkey, L.P. (2008). Weight Loss During the Intensive Intervention Phase of the Weight-Loss Maintenance Trial. Am J Prev Med, 35(2), 118--126.","paperID":"None"},{"content":"Kanfer, F.H. (1970). Self-Monitoring: Methodological Limitations and Clinical Applications. J Consult Clin Psych, 35(2), 148--152.","paperID":"None"},{"content":"Kong, F. and Tan, J. DietCam: Regular Shape Food Recognition with a Camera Phone. BSN 2011, 127--132.","paperID":"None"},{"content":"Lansky, D. and Brownell, K.D. (1982). Estimates of Food Quantity and Calories: Errors in Self-Report among Obese Patients. Am J Clin Nutr, 35(4), 727--732.","paperID":"None"},{"content":"Livingstone, M.B., Prentice, A.M., Strain, J.J., Coward, W.A., Black, A.E., Barker, M.E., McKenna, P.G., and Whitehead, R.G. (1990). Accuracy of Weighed Dietary Records in Studies of Diet and Health. BMJ, 300(6726), 708--712.","paperID":"None"},{"content":"Mamykina, L., Mynatt, E., Davidson, P., and Greenblatt, D. MAHI: Investigation of Social Scaffolding for Reflective Thinking in Diabetes Management. CHI 2008, 477--486.","paperID":"None"},{"content":"Mamykina, L., Mynatt, E.D., and Kaufman, D.R. Investigating Health Management Practices of Individuals with Diabetes. CHI 2006, 927--936.","paperID":"None"},{"content":"Mankoff, J., Hsieh, G., Hung, H.C., Lee, S., and Nitao, E. Using Low-Cost Sensing to Support Nutritional Awareness. UbiComp 2002, 371--376.","paperID":"None"},{"content":"Marr, J.W. (1971). Individual Dietary Surveys: Purposes and Methods. World Rev Nutr Diet, 13, 105--164.","paperID":"None"},{"content":"Mattila, E., Pärkkä, J., Hermersdorf, M., Kaasinen, J., Vainio, J., Samposalo, K., Merilahti, J., Kolari, J., Kulju, M., Lappalainen, R., and Korhonen, I. (2008). Mobile Diary for Wellness Management - Results on Usage and Usability in Two User Studies. IEEE Trans Inf Technol Biomed, 12(4), 501--512.","paperID":"None"},{"content":"Nelson, M., Atkinson, M., and Darbyshire, S. (1996). Food Photography II: Use of Food Photographs for Estimating Portion Size and the Nutrient Content of Meals. Br J Nutr, 76(1), 31--49.","paperID":"None"},{"content":"Noronha, J., Hysen, E., Zhang, H., and Gajos, K.Z. Platemate: Crowdsourcing Nutritional Analysis from Food Photographs. UIST 2011, 1--12.","paperID":"None"},{"content":"Purpura, S., Schwanda, V., Williams, K., Stubler, W., and Sengers, P. Fit4Life: The Design of a Persuasive Technology Promoting Healthy Behavior and Ideal. CHI 2011, 423--432.","paperID":"None"},{"content":"Rahman, T., Adams, A.T., Zhang, M., Cherry, E., Zhou, B., Peng, H., and Choudhury, T. BodyBeat: A Mobile System for Sensing Non-Speech Body Sounds. MobiSys 2014, 2--13.","paperID":"None"},{"content":"Sicherer, S.H. and Sampson, H.A. (2010). Food Allergy. J Allergy Clin Immunol, 125(2 Suppl 2), S116--S125.","paperID":"None"},{"content":"Stone, A.A., Shiffman, S., Schwartz, J.E., Broderick, J.E., and Hufford, M.R. (2003). Patient Compliance with Paper and Electronic Diaries. Control Clin Trials, 24(2), 182--199.","paperID":"None"},{"content":"Thomaz, E., Parnami, A., Essa, I., and Abowd, G.D. Feasibility of Identifying Eating Moments from First-Person Images Leveraging Human Computation. SenseCam 2013, 26--33.","paperID":"None"},{"content":"Tsai, C.C., Lee, G., Raab, F., Norman, G.J., Sohn, T., Griswold, W.G., and Patrick, K. (2007). Usability and Feasibility of PmEB: A Mobile Phone Application for Monitoring Real Time Caloric Balance. Mobile Netw Appl, 12(2-3), 173--184.","paperID":"None"},{"content":"Urist, J. My Fitness Band Is Making Me Fat: Users Complain of Weight Gain with Trackers. Today.com, July 16, 2014.","paperID":"None"},{"content":"Wansink, B. and van Ittersum, K. (2007). Portion Size Me: Downsizing Our Consumption Norms. J Am Diet Assoc, 107(7), 1103--1106.","paperID":"None"},{"content":"Wilde, M.H. and Garvin, S. (2007). A Concept Analysis of Self-Monitoring. J Adv Nurs, 57(3), 339--350.","paperID":"None"},{"content":"Zepeda, L. andDeal, D.(2008). Think BeforeYouEat: PhotographicFood DiariesasInterventionToolstoChange Dietary DecisionMakingand Attitudes.IntJ ConsumStud, 32(6), 692--698.","paperID":"None"},{"content":"Zhu, F., Bosch, M., Boushey, C.J., and Delp, E.J. (2010). An Image Analysis System for Dietary Assessment and Evaluation. ICIP 2010, 1853--1856.","paperID":"None"}],"title":"Rethinking the Mobile Food Journal: Exploring Opportunities for Lightweight Photo-Based Capture","filename":"CHI15/p3207","authors":["Felicia Cordeiro","Elizabeth Bales","Erin Cherry","James Fogarty"],"conference":"CHI '15"}