{"paperId":2702512,"citation":[{"content":"Alexander T. Adams , Jean Costa , Malte F. Jung , Tanzeem Choudhury, Mindless computing: designing technologies to subtly influence behavior, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2805843"}],"reference":[{"content":"4 Minute Abs. http://www.4minuteabs.com/","paperID":"None"},{"content":"Ajzen, I. From intentions to actions: A theory of planned behavior. Springer Berlin Heidelberg (1985), 11--39.","paperID":"None"},{"content":"Antony, M. M., Bieling, P. J., et al. Psychometric properties of the 42-item and 21-item versions of the Depression Anxiety Stress Scales. Psychol Assess, 10,2, (1998). 176--181.","paperID":"None"},{"content":"Astin, J. A. Stress reduction through mindfulness meditation. Psychother Psychosom 66,2 (1997), 97--106.","paperID":"None"},{"content":"Bandura, A. Self-efficacy: toward a unifying theory of behavioral change. Psychol Rev, 84,2 (1977), 191--215.","paperID":"None"},{"content":"Timothy W. Bickmore , Lisa Caruso , Kerri Clough-Gorr, Acceptance and usability of a relational agent interface by urban older adults, CHI '05 Extended Abstracts on Human Factors in Computing Systems, April 02-07, 2005, Portland, OR, USA","paperID":"1056879"},{"content":"Bodenheimer, T., Lorig, K., et al. Patient self-management of chronic disease in primary care. JAMA, 288,19 (2002), 2469--2475.","paperID":"None"},{"content":"Bower, J. L., & Christensen, C. M. Disruptive technologies: catching the wave. Harvard Bus Rev, (1995), Jan-Feb, 43--53.","paperID":"None"},{"content":"Brenner, M. H. Mortality and the national economy. The Lancet 314,8142 (1979), 568--573.","paperID":"None"},{"content":"Peter Brusilovsky , Christoph Peylo, Adaptive and Intelligent Web-based Educational Systems, International Journal of Artificial Intelligence in Education, v.13 n.2-4, p.159-172, April 2003","paperID":"1434847"},{"content":"Cole-Lewis, H., & Kershaw, T. Text messaging as a tool for behavior change in disease prevention and management. Epidemiol Rev, 32,1 (2010), 56--69.","paperID":"None"},{"content":"Sunny Consolvo , Katherine Everitt , Ian Smith , James A. Landay, Design requirements for technologies that encourage physical activity, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124840"},{"content":"Sunny Consolvo , Predrag Klasnja , David W. McDonald , James A. Landay, Goal-setting considerations for persuasive technologies that encourage physical activity, Proceedings of the 4th International Conference on Persuasive Technology, April 26-29, 2009, Claremont, California, USA","paperID":"1541960"},{"content":"Sunny Consolvo , David W. McDonald , James A. Landay, Theory-driven design strategies for technologies that support behavior change in everyday life, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518766"},{"content":"Cramer, S. R., Nieman, D. C., & Lee, J. W. The effects of moderate exercise training on psychological well-being and mood state in women. J Psychosom Res 35,4 (1991), 437--449.","paperID":"None"},{"content":"Gavin Doherty , David Coyle , John Sharry, Engagement with online mental health interventions: an exploratory clinical study of a treatment for depression, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208602"},{"content":"Roland Gasser , Dominique Brodbeck , Markus Degen , Jürg Luthiger , Remo Wyss , Serge Reichlin, Persuasiveness of a mobile lifestyle coaching application using social facilitation, Proceedings of the First international conference on Persuasive technology for human well-being, May 18-19, 2006, Eindhoven, The Netherlands","paperID":"1986828"},{"content":"Graham, C., Franses, A., et al. Psychotherapy by computer. Psychiatr Bull, 24,9 (2000), 331--332.","paperID":"None"},{"content":"Haug, S., Meyer, C., et al. Continuous individual support of smoking cessation using text messaging: a pilot experimental study. Nicotine Tob Res 11,8 (2009), 915--923.","paperID":"None"},{"content":"Hurling, R., Catt, M., et al. Using internet and mobile phone technology to deliver an automated physical activity program. J Med Internet Res, 9,2 (2007), e7.","paperID":"None"},{"content":"Ice, R. Long-term compliance. Phys Ther 65,12 (1985), 1832--1839.","paperID":"None"},{"content":"Insanity. http://www.beachbody.com/","paperID":"None"},{"content":"Ellen Isaacs , Artie Konrad , Alan Walendowski , Thomas Lennig , Victoria Hollis , Steve Whittaker, Echoes from the past: how technology mediated reflection improves well-being, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466137"},{"content":"Kaplan, L. M., & McGuckin, M. Increasing handwashing compliance with more accessible sinks. Infect Control 7,8 (1986), 408--410.","paperID":"None"},{"content":"Kim, S. I., & Kim, H. S. Effectiveness of mobile and internet intervention in patients with obese type 2 diabetes. Int J Med Inform 77,6 (2008), 399--404.","paperID":"None"},{"content":"Predrag Klasnja , Wanda Pratt, Methodological Review: Healthcare in the pocket: Mapping the space of mobile-phone health interventions, Journal of Biomedical Informatics, v.45 n.1, p.184-198, February, 2012","paperID":"2133998"},{"content":"Reeva Lederman , Greg Wadley , John Gleeson , Sarah Bendall , Mario Álvarez-Jiménez, Moderated online social therapy: Designing and evaluating technology for mental health, ACM Transactions on Computer-Human Interaction (TOCHI), v.21 n.1, p.1-26, February 2014","paperID":"2513179"},{"content":"James J. Lin , Lena Mamykina , Silvia Lindtner , Gregory Delajoux , Henry B. Strub, Fish'n'Steps: encouraging physical activity with an interactive computer game, Proceedings of the 8th international conference on Ubiquitous Computing, p.261-278, September 17-21, 2006, Orange County, CA","paperID":"2166299"},{"content":"Locke, E. A., & Latham, G. P. Building a practically useful theory of goal setting and task motivation. Am Psychol 57,9 (2002), 705--717.","paperID":"None"},{"content":"Hong Lu , Denise Frauendorfer , Mashfiqui Rabbi , Marianne Schmid Mast , Gokul T. Chittaranjan , Andrew T. Campbell , Daniel Gatica-Perez , Tanzeem Choudhury, StressSense: detecting stress in unconstrained acoustic environments using smartphones, Proceedings of the 2012 ACM Conference on Ubiquitous Computing, September 05-08, 2012, Pittsburgh, Pennsylvania","paperID":"2370270"},{"content":"Diana MacLean , Asta Roseway , Mary Czerwinski, MoodWings: a wearable biofeedback device for real-time stress intervention, Proceedings of the 6th International Conference on PErvasive Technologies Related to Assistive Environments, May 29-31, 2013, Rhodes, Greece","paperID":"2504406"},{"content":"Mark Matthews , Gavin Doherty, In the mood: engaging teenagers in psychotherapy using mobile phones, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979379"},{"content":"McFarlane, A. C., Atchison, M., et al. (1994). Physical symptoms in post-traumatic stress disorder. J Psychosom Res, 38,7 (1994), 715--726.","paperID":"None"},{"content":"McKee, G. H., Markham, S. E., & Scott, K. D. (1992). Job stress and employee withdrawal from work. In J. C. Quick (Eds.), Stress & Well-Being At Work. (pp. 153--163). Washington, D.C.: APA","paperID":"None"},{"content":"Mento, A. J., Steel, R. P., & Karren, R. J. A meta-analytic study of the effects of goal setting on task performance: 1966-1984. Organ Behav Hum Decis Process 39,1 (1987), 52--83.","paperID":"None"},{"content":"Margaret Morris , Farzin Guilak, Mobile Heart Health: Project Highlight, IEEE Pervasive Computing, v.8 n.2, p.57-61, April 2009","paperID":"1550532"},{"content":"Morris, M. E., Kathawala, Q., et al. Mobile therapy: case study evaluations of a cell phone application for emotional self-awareness. J Med Internet Res 12,2 (2010), e10.","paperID":"None"},{"content":"O'Leary, A. Stress, emotion, and human immune function. Psychol Bull 108,3 (1990), 363--382.","paperID":"None"},{"content":"Obermayer, J. L., Riley, W. T., et al. College smoking-cessation using cell phone text messaging. J Am Coll Health 53,2 (2004), 71--78.","paperID":"None"},{"content":"President's Council on Fitness, Sports & Nutrition. http://www.fitness.gov/about-pcfsn/our-history/","paperID":"None"},{"content":"Prochaska, J. O., & DiClemente, C. C. The transtheoretical approach. Handbook of Psychotherapy Integration, 2 (2005),147--171.","paperID":"None"},{"content":"Riley, W. T., Rivera, D. E., et al. Health behavior models in the age of mobile interventions: are our theories up to the task? Transl Behav Med 1,1 (2011), 53--71.","paperID":"None"},{"content":"Rosch, P. J. The quandary of job stress compensation. Health and Stress, 3 (2001), 1--4.","paperID":"None"},{"content":"Tammy Toscos , Anne Faber , Shunying An , Mona Praful Gandhi, Chick clique: persuasive technology to motivate teenage girls to exercise, CHI '06 Extended Abstracts on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1125805"},{"content":"US Surgeon General. http://www.surgeongeneral.gov/","paperID":"None"},{"content":"Vidyarthi, J., & Riecke, B. E. Interactively mediating experiences of mindfulness meditation. Int J Hum Comput Stud 72, 8--9 (2014), 674--688.","paperID":"None"},{"content":"Waller, R., & Gilbody, S. Barriers to the uptake of computerized cognitive behavioural therapy. Psychol.Med 39,5 (2009), 705--712.","paperID":"None"},{"content":"Walters, D. L., Sarela, A., et al. A mobile phone-based care model for outpatient cardiac rehabilitation. BMC Cardiovasc Disord 10,1 (2010), pp. 1--8.","paperID":"None"}],"abstract":"Automated coaching systems offer a convenient, cost-effective way to reduce stress, which can be a serious health issue. However, one concern with such systems is compliance; users fail to achieve daily stress reduction goals because goals are too easy or too difficult. To address this, we built DStress (Design for Stress), a theoretically grounded system that sets adaptive goals in three coaching dimensions: Exercise, Meditation and Accessibility. DStress modifies goal-difficulty based on the individual's immediately previous performance. In a 28-day deployment with 65 users, DStress reduced scores on one direct measure of stress almost in half, significantly more than two other non-adaptive coaching strategies. However, on a second direct stress measure, no improvement was found. There were also no improvements on other indirect stress measures. Analysis of 2842 user-generated reports suggests our findings were the result of DStress balancing compliance against the degree of challenge of the goals it would set.","video":"http://www.youtube.com/embed/pvcbsDp_jms?rel=0","title":"Finding the Adaptive Sweet Spot: Balancing Compliance and Achievement in Automated Stress Reduction","filename":"CHI15/p3829","authors":["Artie Konrad","Victoria Bellotti","Nicole Crenshaw","Simon Tucker","Les Nelson","Honglu Du","Peter Pirolli","Steve Whittaker"],"conference":"CHI '15"}