{"paperId":2702147,"citation":[],"abstract":"HCI has developed a powerful vocabulary for thinking about, and methods for engaging with, users. Similarly, recent work has advanced complementary understanding of technology non-use. However, other spaces of interaction with technology may occur that sit uncomfortably between these two poles. This paper presents two case studies highlighting individuals who neither are clearly users of a system nor are clearly non-users. Based on these cases, the paper develops the concept of usee to help account for such situations that lie between existing analytic categories.","reference":[{"content":"Abras, C., Maloney-Krichmar, D., and Preece, J. User-Centered Design. In W. Bainbridge, ed., Encyc. of Human-Comput. Interact. Sage, Thousand Oaks, 2004.","paperID":"None"},{"content":"Eric P.S. Baumer , Phil Adams , Vera D. Khovanskaya , Tony C. Liao , Madeline E. Smith , Victoria Schwanda Sosik , Kaiton Williams, Limiting, leaving, and (re)lapsing: an exploration of facebook non-use practices and experiences, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466446"},{"content":"Geoff Cooper , John Bowers, Representing the user: notes on the disciplinary rhetoric of human-computer interaction, The social and interactional dimensions of human-computer interfaces, Cambridge University Press, New York, NY, 1995","paperID":"214821"},{"content":"Dreyfus, H.L. Being and Power: Heidegger and Foucault. Int'l J of Philosophical Studies 4, 1 (1996), 1--16.","paperID":"None"},{"content":"Duhigg, C. How Companies Learn Your Secrets. The New York Times Magazine, 2012.","paperID":"None"},{"content":"Foucault, M. Discipline and Punish: The Birth of the Prison. Random House, New York, 1977.","paperID":"None"},{"content":"Gillespie, T. The Relevance of Algorithms. In T. Gillespie, P. Bockzkowski and K. Foot, eds., Media Technologies. MIT Press, Cambridge, MA, 2013.","paperID":"None"},{"content":"Heidegger, M. The Question Concerning Technology. Harper & Row, New York, 1977.","paperID":"None"},{"content":"ISO/IEC. 9126-1:2001 Software engineering -- Product quality -- Part 1: Quality model. 2001.","paperID":"None"},{"content":"ISO/IEC. 15939:2007 Systems and software engineering -- Measurement process. 2007.","paperID":"None"},{"content":"Steven J. Jackson , Tarleton Gillespie , Sandy Payette, The policy knot: re-integrating policy, practice and design in cscw studies of social computing, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531674"},{"content":"Latour, B. Where are the Missing Masses? The Sociology of a Few Mundane Artifacts. In W.E. Bijker and J. Law, eds., Shaping Technology / Building Society. MIT Press, Cambridge, MA, 1992, 225--258.","paperID":"None"},{"content":"Muller, M.J. and Druin, A. Participatory Design: The Third Space in HCI. In J. Jacko, ed., Human-Comput. Interact. Handbook. Erlbaum, Hillsdale, NJ, 2012, 1--70.","paperID":"None"},{"content":"Pickering, A. The Mangle of Practice: Agency and Emergence in the Sociology of Science. Amer J of Sociology 99, 3 (1993), 559--589.","paperID":"None"},{"content":"Redström, J. Towards user design? On the shift from object to user as the subject of design. Design Studies 27, 2 (2006), 123--139.","paperID":"None"},{"content":"Christine Satchell , Paul Dourish, Beyond the user: use and non-use in HCI, Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7, November 23-27, 2009, Melbourne, Australia","paperID":"1738829"},{"content":"Sarita Yardi Schoenebeck, Giving up Twitter for Lent: how and why we take breaks from social media, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2556983"},{"content":"Verbeek, P.-P. What Things Do. Penn State University Press, University Park, PA, 2005.","paperID":"None"},{"content":"Vertesi, J. My Experiment Opting Out of Big Data Made Me Look Like a Criminal. Time, 2014.","paperID":"None"},{"content":"Woolgar, S. Configuring the user: the case of usability trials. In J. Law, ed., A Sociology of Monsters. Routledge, London, 1991, 58--99.","paperID":"None"},{"content":"Wyatt, S. Non-Users Also Matter: The Construction of Users and Non-Users of the Internet. In N. Oudshoorn and T. Pinch, eds., How Users Matter. MIT Press, Cambridge, MA, 2003, 67--79.","paperID":"None"},{"content":"Susan P. Wyche , Sarita Yardi Schoenebeck , Andrea Forte, \"Facebook is a luxury\": an exploratory study of social media use in rural Kenya, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441783"},{"content":"-ee. Dictionary.com Unabridged.","paperID":"None"}],"title":"Usees","filename":"CHI15/p3295","authors":["Eric P.S. Baumer"],"conference":"CHI '15"}