{"paperId":2702532,"citation":[],"abstract":"Voice interaction with mobile devices has been focused on hands-free interaction or situations where visual interfaces are not applicable. In this paper we explore a subtler means of interaction -- speech recognition from continual, in the background, audio recording of conversations. We call this the 'continuous speech stream' and explore how it could be repurposed as user input. We analyse ten days of recorded audio from our participants, alongside corresponding interviews, to explore how systems might make use of extracts from this stream. Rather than containing directly actionable items, our data suggests that the continuous speech stream is a rich resource for identifying users' next actions, along with the interests and dispositions of those being recorded. Through design workshops we explored new interactions using the speech stream, and describe concepts for individual, shared and distributed use.","reference":[{"content":"Anjos, A., El-Shafey, L., et al. Bob: a free signal processing and machine learning toolbox for researchers. In Proc. of the 20th ACM international conference on Multimedia (2012),1449--1452 ACM.","paperID":"None"},{"content":"Anusuya, M. A. K., S. K. Speech Recognition by Machine, A Review. International Journal of Computer Science and Information Security, 6, 3 (2010), 25.","paperID":"None"},{"content":"Aylett, M. P., Kristensson, P. O., et al. None of a CHInd: Relationship Counselling for HCI and Speech Technology. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (2014),749--760 ACM.","paperID":"None"},{"content":"Boyce, S. and Gorin, A. User interface issues for natural spoken dialog systems. In Proc. of The International Symposium On Spoken Dialog, 96(1996), 65--68.","paperID":"None"},{"content":"Chalmers, M. A Historical View of Context. CSCW Journal, 13, 3 (2004), 223--247.","paperID":"None"},{"content":"Chon, Y., Lane, N. D., et al. Understanding the coverage and scalability of place-centric crowdsensing. In Proc. of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (2013),3--12 ACM.","paperID":"None"},{"content":"Hinton, G., Deng, L., et al. Deep Neural Networks for Acoustic Modeling in Speech Recognition: The Shared Views of Four Research Groups. IEEE Signal Processing Magazine, 29(2012), 82--97.","paperID":"None"},{"content":"Jurafsky, D. and Martin, J. H. Speech and Language Processing (2Nd Edition). Prentice-Hall, Inc., Upper Saddle River, NJ, USA, 2009.","paperID":"None"},{"content":"Kalnikaite, V., Sellen, A., et al. Now Let Me See Where I Was: Understanding How Lifelogs Mediate Memory. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems (2010), 2045--2054 ACM.","paperID":"None"},{"content":"Kilgour, J., Carletta, J., et al. The Ambient Spotlight: Queryless Desktop Search from Meeting Speech. In Proceedings of the 2010 International Workshop on Searching Spontaneous Conversational Speech (2010), 49--52 ACM.","paperID":"None"},{"content":"Kingsbury, B., Saon, G., et al. Robust speech recognition in Noisy Environments: The 2001 IBM spine evaluation system. In Proc. of 2002 IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP) (2002),I-53--I-56.","paperID":"None"},{"content":"Klasnja, P., Consolvo, S., et al. Exploring privacy concerns about personal sensing. In Proc. of Pervasive Computing, Springer (2009), 176--183.","paperID":"None"},{"content":"Kuhn, T., Jameel, A., et al. Hybrid in-car speech recognition for mobile multimedia applications. In Proc. of Vehicular Technology Conference, 1999 IEEE 49th (1999),2009--2013 vol.2003.","paperID":"None"},{"content":"Kumar, A., Paek, T., et al. Voice Typing: A New Speech Interaction Model for Dictation on Touchscreen Devices. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems (2012),2277--2286 ACM.","paperID":"None"},{"content":"Lloret, E. and Palomar, M. Text summarisation in progress: a literature review. Artificial Intelligence Review, 37, 1 (2012), 1--41.","paperID":"None"},{"content":"Morrison, A., McMillan, D., et al. Improving consent in large scale mobile HCI through personalised representations of data. In Proc. of the 8th Nordic Conference on Human-Computer Interaction (2014),471--480 ACM.","paperID":"None"},{"content":"Nouza, J. and Silovsky, J. Fast keyword spotting in telephone speech. Radioengineering, 18(2009), 665--670.","paperID":"None"},{"content":"Oulasvirta, A., Pihlajamaa, A., et al. Long-term effects of ubiquitous surveillance in the home. In Proc. of the 2012 ACM Conference on Ubiquitous Computing (2012),41--50 ACM.","paperID":"None"},{"content":"Povey, D., Burget, L., et al. The subspace Gaussian mixture model-A structured model for speech recognition. Computer Speech & Language, 25, 2 (2011), 404--439.","paperID":"None"},{"content":"Rabiner, L. and Juang, B.-H. An introduction to hidden Markov models. ASSP Magazine, IEEE, 3(1986), 4--16.","paperID":"None"},{"content":"Ritson, M. and Elliott, R. The social uses of advertising: an ethnographic study of adolescent advertising audiences. Journal of Consumer Research, 26, 3 (1999), 260--277.","paperID":"None"},{"content":"Starner, T. E., Snoeck, C. M., et al. Use of Mobile Appointment Scheduling Devices. In CHI'04 Extended Abstracts on Human Factors in Computing Systems (2004),1501--1504 ACM.","paperID":"None"},{"content":"Tur, G. and Mori, R. D. Spoken language Understanding: Systems for Extracting Semaintic Information. John Wiley, 2011.","paperID":"None"},{"content":"Waibel, A., Schultz, T., et al. SMaRT: the Smart Meeting Room Task at ISL. In Proc. of the IEEE International Conference on Acoustics, Speech, and Signal Processing (2003), vol.754.","paperID":"None"},{"content":"Whittaker, S., Hirschberg, J., et al. SCANMail: A Voicemail Interface That Makes Speech Browsable, Readable and Searchable. In Proc. of the SIGCHI conference on Human factors in computing systems (2002),275--282 ACM.","paperID":"None"},{"content":"Woodland, P. C. Speaker adaptation for continuous density HMMs: A review. In Proc. of the ISCA Tutorial and Research Workshop on Adaptation Methods for Speech Recognition (2001).","paperID":"None"},{"content":"Wyatt, D., Choudhury, T., et al. Inferring Colocation and Conversation Networks from Privacy-sensitive Audio with Implications for Computational Social Science. ACM Transactions on Intelligent Systems and Technology, 2(2011), 7:1--7:41.","paperID":"None"},{"content":"Yankelovich, N., Levow, G.-A., et al. Designing SpeechActs: Issues in Speech User Interfaces (1995), 369--376 ACM Press/Addison-Wesley Publishing Co.","paperID":"None"}],"title":"Repurposing Conversation: Experiments with the Continuous Speech Stream","filename":"CHI15/p3953","authors":["Donald McMillan","Antoine Loriette","Barry Brown"],"conference":"CHI '15"}