{"paperId":2702558,"abstract":"We present findings from a year-long engagement with a street and its community. The work explores how the production and use of data is bound up with place, both in terms of physical and social geography. We detail three strands of the project. First, we consider how residents have sought to curate existing data about the street in the form of an archive with physical and digital components. Second, we report endeavours to capture data about the street's environment, especially of vehicle traffic. Third, we draw on the possibilities afforded by technologies for polling opinion. We reflect on how these engagements have: materialised distinctive relations between the community and their data; surfaced flows and contours of data, and spatial, temporal and social boundaries; and enacted a multiplicity of 'small worlds'. We consider how such a conceptualisation of data-in-place is relevant to the design of technology.","citation":[{"content":"Tim Regan , David Sweeney , John Helmes , Vasillis Vlachokyriakos , Siân Lindley , Alex Taylor, Designing Engaging Data in Communities, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2725432"},{"content":"Karthikeya Acharya, An Electrome bound Body Form, Proceedings of the 7th International Conference on HCI, IndiaHCI 2015, p.19-26, December 17-19, 2015, Guwahati, India","paperID":"2835969"}],"reference":[{"content":"Air Quality Eggs. http://airqualityegg.com. Accessed September 9 2014.","paperID":"None"},{"content":"Anderson, C. The end of theory. Wired magazine. (2008), 16-07.","paperID":"None"},{"content":"Paul M. Aoki , R. J. Honicky , Alan Mainwaring , Chris Myers , Eric Paulos , Sushmita Subramanian , Allison Woodruff, A vehicle for research: using street sweepers to explore the landscape of environmental community action, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1518762"},{"content":"Victoria M.E. Bellotti , Sara Cambridge , Karen Hoy , Patrick C. Shih , Lisa Renery Handalian , Kyungsik Han , John M. Carroll, Towards community-centered support for peer-to-peer service exchange: rethinking the timebanking metaphor, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557061"},{"content":"Bird, J. and Rogers, Y. The pulse of Tidy Street: measuring and publicly displaying domestic electricity consumption. Pervasive 2010 Workshop on Energy Awareness and Conservation through Pervasive Applications.","paperID":"None"},{"content":"boyd, d. and Crawford, K. Critical questions for big data: provocations for a cultural, technological, and scholarly phenomenon. Info Com Soc 15, 5 (2012), 662--679.","paperID":"None"},{"content":"Bowker, G.C. The Theory/Data Thing. IJOC 8, (2014), 1795--1799.","paperID":"None"},{"content":"John M. Carroll , Mary Beth Rosson, Wild at Home: The Neighborhood as a Living Laboratory for HCI, ACM Transactions on Computer-Human Interaction (TOCHI), v.20 n.3, p.1-28, July 2013","paperID":"2491504"},{"content":"Crawford, K., Faleiros, G., Luers, A., Meier, P., Perlich, C. and Thorp, J. Big data, communities and ethical resilience, a framework for action.\" Bellagio/PopTech Fellows White paper (2013). http://www. rockefellerfoundation.org/blog/big-data-communities-ethical.","paperID":"None"},{"content":"Cross, J. Life off the grid. Presented at the Symposium on Producing Data: Practices, Materialities, Values. September 3 2014, Edinburgh, United Kingdom.","paperID":"None"},{"content":"Paul Dourish, Re-space-ing place: \"place\" and \"space\" ten years on, Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work, November 04-08, 2006, Banff, Alberta, Canada","paperID":"1180921"},{"content":"Dourish, P. and Bell, G. The infrastructure of experience and the experience of infrastructure: meaning and structure in everyday encounters with space. Environ Plann B 34, 3 (2007), 414--430.","paperID":"None"},{"content":"Gitelman, L, ed. Raw Data is an Oxymoron. MIT Press, 2013.","paperID":"None"},{"content":"Yuheng Hu , Shelly D. Farnham , Andrés Monroy-Hernández, Whoo.ly: facilitating information seeking for hyperlocal communities using social media, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466478"},{"content":"Kitchin, R. (2014). Big Data, new epistemologies and paradigm shifts. Big Data & Society 1, (1).","paperID":"None"},{"content":"Klein, E. Who owns our data? Presented at the Symposium on Producing Data: Practices, Materialities, Values. September 4 2014, Edinburgh, United Kingdom.","paperID":"None"},{"content":"Lisa Koeman , Vaiva Kalnikaitė , Yvonne Rogers , Jon Bird, What Chalk and Tape Can Tell Us: Lessons Learnt for Next Generation Urban Displays, Proceedings of The International Symposium on Pervasive Displays, June 03-04, 2014, Copenhagen, Denmark","paperID":"2611018"},{"content":"Viktor Mayer-Schnberger, Big Data: A Revolution That Will Transform How We Live, Work and Think. Viktor Mayer-Schnberger and Kenneth Cukier, John Murray Publishers, 2013","paperID":"2588165"},{"content":"David K. McGookin , Stephen A. Brewster , Georgi Christov, Studying digital graffiti as a location-based social network, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557266"},{"content":"Karen E. Pettigrew, Waiting for chiropody: contextual results from an ethnographic study of the information behaviour among attendees at community clinics, Information Processing and Management: an International Journal, v.35 n.6, p.801-817, 35","paperID":"339120"},{"content":"Prensky, M. H. sapiens digital: from digital immigrants and digital natives to digital wisdom. Innovate 5 (3, 2009).","paperID":"None"},{"content":"Savolainen, R. Small world and information grounds as contexts of information seeking and sharing. Libr Inform Sci Res 31, 1 (2009), 38--45.","paperID":"None"},{"content":"Sharma, S. In the Meantime: Temporality and Cultural Politics. Duke University Press, 2014.","paperID":"None"},{"content":"Yolande Strengers, Smart energy in everyday life: are you designing for resource man?, interactions, v.21 n.4, July + August 2014","paperID":"2621931"},{"content":"Nick Taylor , Keith Cheverst , Peter Wright , Patrick Olivier, Leaving the wild: lessons from community technology handovers, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466206"},{"content":"Thrift, N. (2014). The \"sentient\" city and what it may portend. Big Data & Society 1 (1).","paperID":"None"},{"content":"Urry, J. Small worlds and the new 'social physics'. Global networks 4, 2 (2004), 109--130.","paperID":"None"},{"content":"van Dijck, J. Datafication, dataism and dataveillance:. Surveillance and Society 12, (2014), 197--208.","paperID":"None"},{"content":"Janet Vertesi , Paul Dourish, The value of data: considering the context of production in data economies, Proceedings of the ACM 2011 conference on Computer supported cooperative work, March 19-23, 2011, Hangzhou, China","paperID":"1958906"},{"content":"Vasilis Vlachokyriakos , Rob Comber , Karim Ladha , Nick Taylor , Paul Dunphy , Patrick McCorry , Patrick Olivier, PosterVote: expanding the action repertoire for local political activism, Proceedings of the 2014 conference on Designing interactive systems, June 21-25, 2014, Vancouver, BC, Canada","paperID":"2598523"},{"content":"Wilson, M.W. Data matter(s): legitimacy, coding, and qualifications-of-life. Environ Plan D 29, 5 (2011), 857--872.","paperID":"None"}],"title":"Data-in-Place: Thinking through the Relations Between Data and Community","filename":"CHI15/p2863","authors":["Alex S. Taylor","Siân Lindley","Tim Regan","David Sweeney","Vasillis Vlachokyriakos","Lillie Grainger","Jessica Lingel"],"conference":"CHI '15"}