{"paperId":2702561,"abstract":"Despite the availability of computer-based alternatives both for desktop and touch screen systems, a number of cooperative work processes still commonly rely on simple paper sticky notes. In this paper, we present the first in-depth investigation of the real-world practices of people who use paper-based affinity diagrams and similar clustering processes in their work, in order to identify challenges and requirements for technology support. Findings from retrospective and artifact-based interviews with 13 participants suggest ways in which the rich interactions and material affordances offered by paper are key to the process. Instead of seeking to replicate interactions with paper on a screen, simpler transfer of information between the physical and digital worlds has the potential to address many of the most pressing problems experienced in practice. We describe different types of technology integration and augmentation, with preliminary recommendations for different situations.","citation":[{"content":"Pankaj Doke , Anirudha Joshi, Mobile Phone Usage by Low Literate Users, Proceedings of the 7th International Conference on HCI, IndiaHCI 2015, p.10-18, December 17-19, 2015, Guwahati, India","paperID":"2835968"}],"reference":[{"content":"Frank Bentley , Edward Barrett, Building Mobile Experiences, The MIT Press, 2012","paperID":"2385478"},{"content":"Hugh Beyer , Karen Holtzblatt, Contextual design: defining customer-centered systems, Morgan Kaufmann Publishers Inc., San Francisco, CA, 1998","paperID":"286067"},{"content":"Peter Brandl , Michael Haller , Juergen Oberngruber , Christian Schafleitner, Bridging the gap between real printouts and digital whiteboard, Proceedings of the working conference on Advanced visual interfaces, May 28-30, 2008, Napoli, Italy","paperID":"1385577"},{"content":"Brassard, M. The Memory Jogger Plus + Featuring the 7 Management and Planning Tools. Goal/QPC, 1996.","paperID":"None"},{"content":"Burtner, R., et al. Affinity+: Semi-Structured Brainstorming on Large Displays. CHI Adj. Proj. 2013.","paperID":"None"},{"content":"Florian Geyer , Ulrike Pfeil , Anita Höchtl , Jochen Budzinski , Harald Reiterer, Designing reality-based interfaces for creative group work, Proceedings of the 8th ACM conference on Creativity and cognition, November 03-06, 2011, Atlanta, Georgia, USA","paperID":"2069647"},{"content":"Jonathan Haber , Miguel A. Nacenta , Sheelagh Carpendale, Paper vs. tablets: the effect of document media in co-located collaborative work, Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces, May 27-29, 2014, Como, Italy","paperID":"2598170"},{"content":"Harboe, G. et al. Two Thousand Points of Interaction. Proc. DUI 2012.","paperID":"None"},{"content":"Gunnar Harboe , Jonas Minke , Ioana Ilea , Elaine M. Huang, Computer support for collaborative data analysis: augmenting paper affinity diagrams, Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, February 11-15, 2012, Seattle, Washington, USA","paperID":"2145379"},{"content":"Holtzblatt, K., Wendell, J.B., and Wood, S. Rapid contextual design. Morgan Kaufmann, 2005.","paperID":"None"},{"content":"Judge, T.K. and McCrickard, D.S. Collaborating on Affinity Diagrams Using Large Displays. TR-08-19, Virginia Tech 2008.","paperID":"None"},{"content":"Judge, T.K. et al. Studying Group Decision Making in Affinity Diagramming. TR-08-16, Virginia Tech 2008.","paperID":"None"},{"content":"Kawakita, J. The KJ method-a scientific approach to problem solving. Kawakita Res. Inst., Tokyo, 1975.","paperID":"None"},{"content":"Kawakita, J. The original KJ method. Kawakita Res. Inst., Tokyo, 1991.","paperID":"None"},{"content":"Klemmer, S.R et al. Integrating physical and digital interactions on walls for fluid design collaboration. Human-Computer Interaction 23, 2 (2008).","paperID":"None"},{"content":"Scott R. Klemmer , Mark W. Newman , Ryan Farrell , Mark Bilezikjian , James A. Landay, The designers' outpost: a tangible interface for collaborative web site, Proceedings of the 14th annual ACM symposium on User interface software and technology, November 11-14, 2001, Orlando, Florida","paperID":"502350"},{"content":"Paul Luff , Christian Heath , David Greatbatch, Tasks-in-interaction: paper and screen based documentation in collaborative activity, Proceedings of the 1992 ACM conference on Computer-supported cooperative work, p.163-170, November 01-04, 1992, Toronto, Ontario, Canada","paperID":"143475"},{"content":"Wendy E. MacKay, Is paper safer? The role of paper flight strips in air traffic control, ACM Transactions on Computer-Human Interaction (TOCHI), v.6 n.4, p.311-340, Dec. 1999","paperID":"331491"},{"content":"David R. McGee , Philip R. Cohen , R. Matthews Wesson , Sheilah Horman, Comparing paper and tangible, multimodal tools, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 20-25, 2002, Minneapolis, Minnesota, USA","paperID":"503449"},{"content":"Thomas P. Moran , Eric Saund , William Van Melle , Anuj U. Gujar , Kenneth P. Fishkin , Beverly L. Harrison, Design and technology for Collaborage: collaborative collages of information on physical walls, Proceedings of the 12th annual ACM symposium on User interface software and technology, p.197-206, November 07-10, 1999, Asheville, North Carolina, USA","paperID":"322602"},{"content":"Munemori, J. and Nagasawa, Y. GUNGEN: groupware for a new idea generation support system. Information and Software Technology 38, 3 (1996), 213--220.","paperID":"None"},{"content":"Scupin, R. The KJ method: A technique for analyzing data derived from Japanese ethnology. Human organization 56, 2 (1997), 233--237.","paperID":"None"},{"content":"Abigail J. Sellen , Richard H.R. Harper, The Myth of the Paperless Office, MIT Press, Cambridge, MA, 2003","paperID":"778158"},{"content":"Simonsen, J. and Friberg, K. Collective Analysis of Qualitative Data. In Simonsen et al. (ed.), Situated Design Methods, (2014).","paperID":"None"},{"content":"Spool, J.M. The KJ-Technique. http://www.uie.com/articles/kj_technique/.","paperID":"None"},{"content":"Strauss, A.L. and Corbin, J.M. Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage Publications, Inc, 1998.","paperID":"None"},{"content":"Edward Tse , Saul Greenberg , Chia Shen , Clifton Forlines , Ryo Kodama, Exploring true multi-user multimodal interaction over a digital table, Proceedings of the 7th ACM conference on Designing interactive systems, p.109-118, February 25-27, 2008, Cape Town, South Africa","paperID":"1394457"},{"content":"Vyas, D. et al. Collaborative practices that support creativity in design. Proc. ECSCW 2009.","paperID":"None"},{"content":"Widjaja, W. et al. Discusys: Multiple User Real-time Digital Sticky-note Affinity-diagram Brainstorming System. Procedia Computer Science 22, (2013).","paperID":"None"},{"content":"Woolrych, A. et al. Ingredients and Meals Rather Than Recipes. Int. Journal of HCI 27, 10 (2011).","paperID":"None"}],"title":"Real-World Affinity Diagramming Practices: Bridging the Paper-Digital Gap","filename":"CHI15/p95","authors":["Gunnar Harboe","Elaine M. Huang"],"conference":"CHI '15"}