{"paperId":2702292,"citation":[],"abstract":"Reduced vocal volume in Parkinson's is extremely common and can have significant social and emotional impact. We describe the development and evaluation of LApp--an application for Google Glass to help people with Parkinson's (PwP) monitor their speech volume and cue themselves to speak louder when necessary. Our findings highlight enthusiasm for using the application both at home as a volume training tool and in public social settings as a situated cueing device. We contribute insights to the literature on how eyewear technologies can provide assistance to people with health conditions and offer insights for the design of future self-monitoring and management applications on Google Glass.","reference":[{"content":"ASHA. Noise. Audiology Information Series 7976. (2011)","paperID":"None"},{"content":"Braun, V, & Clarke, V. Using thematic analysis in psychology. Qual res in psych, 3, 2(2006), 77--101.","paperID":"None"},{"content":"Hoehn M, & Yahr M. Parkinsonism: onset, progression and mortality. Neurology 17, 5 (1967), 427--42","paperID":"None"},{"content":"Jacobson, B. H. et al. The voice handicap index (VHI) development and validation. Am Jour Speech-Lang Path 6, 3 (1997), 66--70.","paperID":"None"},{"content":"Markus Krause , Jan Smeddinck , Ronald Meyer, A digital game to support voice treatment for parkinson's disease, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468435"},{"content":"MacKenzie, D., and Wajcman, J. (eds.). The social shaping of technology (2nd Ed.). Open University Press, Buckingham, 1999.","paperID":"None"},{"content":"Roisin McNaney , John Vines , Daniel Roggen , Madeline Balaam , Pengfei Zhang , Ivan Poliakov , Patrick Olivier, Exploring the acceptability of google glass as an everyday assistive device for people with parkinson's, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557092"},{"content":"Miller, N., et al.National survey of speech and language therapy provision for people with Parkinson's disease in the United Kingdom: Therapists' practices. Int Jour Lang Comm Disord, 46, 2 (2011), 189--201","paperID":"None"},{"content":"Olanow C. W. et al. The scientific and clinical basis for the treatment of Parkinson's disease. Neurology 72, 21 (2009), 1--136.","paperID":"None"},{"content":"Ramig, L. et al. Intensive voice treatment (LSVT®) for patients with Parkinson's disease. Jour Neurol, Neurosurg Psych, 71, 4 (2001), 493--4.","paperID":"None"}],"title":"LApp: A Speech Loudness Application for People with Parkinson's on Google Glass","filename":"CHI15/p497","authors":["Roisin McNaney","Ivan Poliakov","John Vines","Madeline Balaam","Pengfei Zhang","Patrick Olivier"],"conference":"CHI '15"}