{"paperId":2702456,"citation":[],"reference":[{"content":"D. G. Altman and J. M. Bland. Diagnostic tests 2: predictive values. BMJ: British Medical Journal, 309(6947):102, 1994.","paperID":"None"},{"content":"BBC3. BBC three survey reveals one in four young people first view porn at age 12 or under. http://www.bbc.co.United Kingdom/mediacentre/latestnews/ 2014/porn-whats-the-harm.html.","paperID":"None"},{"content":"T. J. Berndt. The features and effects of friendship in early adolescence. Child Development. Early Adolescence (Dec., 1982), 53(6):1447--1460, 1982.","paperID":"None"},{"content":"R. Brown and D. McNeill. The \"tip of the tongue\" phenomenon. Journal of verbal learning and verbal behavior, 5(4):325--337, 1966.","paperID":"None"},{"content":"D. M. Burke, J. K. Locantore, A. A. Austin, and B. Chae. Cherry pit primes brad pitt homophone priming effects on young and older adults' production of proper names. Psychological Science, 15(3):164--170, 2004.","paperID":"None"},{"content":"Marina Buzzi, Children and YouTube: access to safe content, Proceedings of the 9th ACM SIGCHI Italian Chapter International Conference on Computer-Human Interaction: Facing Complexity, September 13-16, 2011, Alghero, Italy","paperID":"2037328"},{"content":"Marina Buzzi, What are your children watching on youtube?, Proceedings of the Second international conference on Advances in New Technologies, Interactive Interfaces and Communicability, p.243-252, December 05-07, 2011, Huerta Grande, Argentina","paperID":"2435162"},{"content":"C. B. Cave. Very long-lasting priming in picture naming. Psychological Science, 8(4):322--325, 1997.","paperID":"None"},{"content":"David Chaum, Security without identification: transaction systems to make big brother obsolete, Communications of the ACM, v.28 n.10, p.1030-1044, Oct. 1985","paperID":"4373"},{"content":"V. Chirkova, R. M. Ryan, Y. Kimc, and U. Kapland. Differentiating autonomy from individualism and independence: A self-determination theory perspective on internalization of cultural orientations and well-being. Journal of Personality and Social Psychology, 84(1):97--110, 2003.","paperID":"None"},{"content":"J. Edgar and G. Rayner. Judge blames easy access to online pornography after boy, 12, rapes seven-year-old sister, 4 March 2014. The Telegraph.","paperID":"None"},{"content":"D. Finkelhor and L. Baron. High-risk children. In D. Finkelhor and Associates, editors, Sourcebook on child sexual abuse. Sage, Newbury Park CA, 1986.","paperID":"None"},{"content":"M. J. Fleming, S. Greentree, D. Cocotti-Muller, K. A. Elias, and S. Morrison. Safety in cyberspace adolescents' safety and exposure online. Youth & Society, 38(2):135--154, 2006.","paperID":"None"},{"content":"A. M. Froomkin. The death of privacy? Stanford Law Review, pages 1461--1543, 2000.","paperID":"None"},{"content":"F. Gilbert. Age verification as a shield for minors on the internet: A quixotic search? Shidler Journal of Law Commerce & Technology, 6, 2008.","paperID":"None"},{"content":"M. Gilleland. Levenshtein distance, in three flavors. Merriam Park Software: http://www. merriampark. com/ld.htm, 2009.","paperID":"None"},{"content":"P. D. Gluckman and M. A. Hanson. Evolution, development and timing of puberty. TRENDS in Endocrinology and Metabolism, 17(1):7--12, 2006.","paperID":"None"},{"content":"T. H. Gollan, R. I. Montoya, and M. P. Bonanni. Proper names get stuck on bilingual and monolingual speakers' tip of the tongue equally often. Neuropsychology, 19(3):278, 2005.","paperID":"None"},{"content":"M. Harbach, S. Fahl, M. Rieger, and M. Smith. On the acceptance of privacy-preserving authentication technology: The curious case of national identity cards. In E. De Cristofaro and M. Wright, editors, Privacy Enhancing Technologies, pages 245--264. Springer, 2013.","paperID":"None"},{"content":"D. F. Jacobs. Juvenile Gambling in North America: An Analysis of Long Term Trends and Future Prospects. Journal of Gambling Studies, 16(2--3):119--152, 2000.","paperID":"None"},{"content":"H. Kanda, Y. Osaki, T. Ohida, Y. Kaneita, and T. Munezawa. Age verification cards fail to fully prevent minors from accessing tobacco products. Tobacco control, 20(2):163--165, 2011.","paperID":"None"},{"content":"D. Kirby. Sex and HIV/AIDS education in schools. BMJ: British Medical Journal, 311(7002):403, 1995.","paperID":"None"},{"content":"R. Larson and M. H. Richards. Daily companionship in late childhood and early adolescence: Changing developmental contexts. Child Development, 62(2):284--300, 1991.","paperID":"None"},{"content":"P. W. Linville. The complexity-extremity effect and age-based stereotyping. Journal of personality and social psychology, 42(2):193, 1982.","paperID":"None"},{"content":"S. Livingstone, M. Bober, and E. Helsper. Internet literacy among children and young people: findings from the United Kingdom children, 2005. Go Online project http://eprints.lse.ac.United Kingdom/archive/ 00000297(Accessed04/06/2010).","paperID":"None"},{"content":"C. M. MacLeod. Forgotten but not gone: Savings for pictures and words in long-term memory. Journal of Experimental Psychology, 14(2):195--212, 1988.","paperID":"None"},{"content":"S. Madigan. Picture memory. In J. Yuille, editor, Imagery, memory, and cognition: essays in honor of Allan Paivio, pages 65--89. Lawrence Erlbaum Associates, Hillsdale, NJ, 1983.","paperID":"None"},{"content":"G. Mascheroni. Parenting the mobile internet in italian households: Parents' and children's discourses. Journal of Children and Media, (Published online: 02 Sep 2013):1--17, 2013.","paperID":"None"},{"content":"L. A. McFarlin, K. J. Buffardi, and R. M. Schumacher. Usability impact on effectiveness of parental controls. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, volume 51, pages 1039--1043. Sage Publications, 2007.","paperID":"None"},{"content":"F. Mishna, C. Cook, M. Saini, M.-J. Wu, and R. MacFadden. Interventions for children, youth, and parents to prevent and reduce cyber. Campbell Systematic Reviews, 2, 2009.","paperID":"None"},{"content":"K. J. Mitchell, D. Finkelhor, and J. Wolak. Protecting youth online: Family use of filtering and blocking software. Child abuse & neglect, 29(7):753--765, 2005.","paperID":"None"},{"content":"H. F. Odabaçsi. Parents views on internet use. Turkish Online Journal of Educational Technology, 4(1), 2005.","paperID":"None"},{"content":"Ofcom. Ofcom report on internet safety measures. strategies of parental protection for children online, 15 January 2014. http://stakeholders.ofcom.org.United Kingdom/ binaries/internet/internet-safety-measures.pdf.","paperID":"None"},{"content":"A. Paivio. Imagery and verbal processes. Holt, Rinheart & Winston, New York, 1971.","paperID":"None"},{"content":"A. Paivio, T. Rogers, and P. Smythe. Why are pictures easier to recall than words? Psychonomic Science, 11(4):137--138, 1968.","paperID":"None"},{"content":"J. Peter and P. M. Valkenburg. Adolescents' exposure to sexually explicit Internet material and sexual satisfaction: A longitudinal study. Human Communication Research, 35(2):171--194, 2009.","paperID":"None"},{"content":"M. I. Posner, M. J. Nissen, and R. M. Klein. Visual dominance: an information-processing account of its origins and significance. Psychological review, 83(2):157, 1976.","paperID":"None"},{"content":"C. J. Rathbone, C. J. Moulin, and M. A. Conway. Self-centered memories: The reminiscence bump and the self. Memory & Cognition, 36(8):1403--1414, 2008.","paperID":"None"},{"content":"B. Reznikov. \"Can I See Some ID?\" Age Verification Requirements for the Online Liquor Store. Shidler Journal of Law, Commerce & Technology., 4:5--13, 2007.","paperID":"None"},{"content":"Chris Roberts, Biometric attack vectors and defences, Computers and Security, v.26 n.1, p.14-25, February, 2007","paperID":"2639843"},{"content":"R. W. Roeser, C. Midgley, and R. C. Urdan. Perceptions of the school psychological environment and early adolescents' psychological and behavioral functioning in school: The mediating role of goals and belonging. Journal of Educational Pscychology, 88(3):408--422, 1996.","paperID":"None"},{"content":"D. C. Rubin. Autobiographical memory across the lifespan. MIT Press Cambridge, MA, 2002.","paperID":"None"},{"content":"Karen G. Schneider, A  Practical Guide to Internet Filters, Neal-Schuman Publishers, Inc., New York, NY, 1997","paperID":"522744"},{"content":"R. G. Simmons and D. A. Blyth. Moving into Adolescence: The Impact of Pubertal Change and School Context. AldineTransaction, 2009.","paperID":"None"},{"content":"R. G. Simmons, R. Burgeson, S. Carlton-Ford, and D. A. Blyth. The impact of cumulative change in early adolescence. Child Development, 58(5):1220--1234, 1987.","paperID":"None"},{"content":"S. N. Singh, M. L. Rothschild, and G. A. C. Jr. Recognition versus recall as measures of television commercial forgetting. Journal of Marketing Research, 25(1):72--80, 1988.","paperID":"None"},{"content":"A. Spence. 200,000 children are watching hardcore porn, 28 March 2014. The Times. http://www.thetimes.co.United Kingdom/tto/news/medianews/ article4047202.ece.","paperID":"None"},{"content":"B. Szoka. COPPA 2.0: The New Battle over Privacy, Age Verification, Online Safety & Free Speech, 24 May 2009. http://techliberation.com/2009/05/24/coppa20-the-new-battle-over-privacy-age-verification-onlinesafety-free-speech/.","paperID":"None"},{"content":"A. Thierer. Social networking and age verification: Many hard questions; no easy solutions. Progress on point, 14:1--33, 2007.","paperID":"None"},{"content":"U.S. National Archives and Records Administration. Richard Nixon. http://upload.wikimedia.org/ wikipedia/commons/3/39/Richard_M._Nixon,_ca. _1935_-_1982_-_NARA_-_530679.jpg.","paperID":"None"},{"content":"L. Wade. Facing the threat: Invading the body for national security. Knowledge, Technology & Policy, 17(1):74--80, 2004.","paperID":"None"},{"content":"L. G. Walters. Method of age verification for electronic media. US Patent 6959861, 2003.","paperID":"None"},{"content":"A. Wigfield, J. S. Eccles, D. MacIver, D. A. Reuman, and C. M. Midgley. Transitions during early adolescence: Changes in children's domain specific self-perceptions and general self-esteem across the transition to junior high school. Developmental Pscyhology, 27(4):552--565, 1991.","paperID":"None"},{"content":"John D. Woodward , Melinda Lytle , Nicholas M. Orlans, Biometrics, McGraw-Hill, Inc., New York, NY, 2002","paperID":"863452"},{"content":"World Economic Forum. Tony Blair. https://www.flickr.com/photos/ worldeconomicforum/3488873590/in/photostream/.","paperID":"None"}],"abstract":"In the physical world we have well-established mechanisms for keeping children out of adult-only areas. In the virtual world this is generally replaced by self declaration. Some service providers resort to using heavy-weight identification mechanisms, judging adulthood as a side effect thereof. Collection of identification data arguably constitutes an unwarranted privacy invasion in this context, if carried out merely to perform adulthood estimation. This paper presents a mechanism that exploits the adult's more extensive exposure to public media, relying on the likelihood that they will be able to recall details if cued by a carefully chosen picture. We conducted an online study to gauge the viability of this scheme. With our prototype we were able to predict that the user was a child 99% of the time. Unfortunately the scheme also misclassified too many adults. We discuss our results and suggest directions for future research.","title":"Regulating Access to Adult Content (with Privacy Preservation)","filename":"CHI15/p4019","authors":["Karen Renaud","Joseph Maguire"],"conference":"CHI '15"}