{"paperId":2702324,"abstract":"Theories of empowerment explain how people gain personal and political control to take action to improve their lives. However, empowerment theories were developed prior to the Internet and fail to account for the speed and scale that people can find one another online. One domain where empowerment is critical is caring for children with special needs, in which parents are required to navigate a complex maze of services and processes to access care for their child. We conducted 43 interviews with parents of children with special needs to investigate whether using social media sites helps them to perform this caregiving work. Critically, parents are able to do this through almost real-time access to other parents on Facebook. This work introduces the concept of networked empowerment, that describes how parents find other parents, access resources, and explore new ways for promoting health advocacy among caregivers at a local and national level. We conclude with design implications for facilitating faster and better access to information and support for caregivers.","citation":[{"content":"Alexis Hiniker , Sarita Y. Schoenebeck , Julie A. Kientz, Not at the Dinner Table: Parents' and Children's Perspectives on Family Technology Rules, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819940"},{"content":"Tawfiq Ammari , Sarita Schoenebeck, “Thanks for your interest in our Facebook group, but it's only for dads”: Social Roles of Stay-at-Home Dads, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819927"}],"reference":[{"content":"Abramson, L.Y., Seligman, M.E., and Teasdale, J.D. Learned helplessness in humans: critique and reformulation. J. of Abn. Psych.87, 1 (1978), 49.","paperID":"None"},{"content":"Ainbinder, J.G., Blanchard, L.W., Singer, G.H., et al. A qualitative study of parent to parent support for parents of children with special needs. Journal of Pediatric Psychology 23, 2 (1998), 99--109.","paperID":"None"},{"content":"Altshuler, S.J. and Kopels, S. Advocating in schools for children with disabilities: What's new with IDEA? Social Work 48, 3 (2003), 320--329.","paperID":"None"},{"content":"Ames, M., Bardzell, J., Bardzell, S., Lindtner, S., Mellis, D., and Rosner, D. Making Cultures: Empowerment, Participation, and Democracy -- or Not? In Ext Abst CHI 2014, 1087--1092.","paperID":"None"},{"content":"Ammari, T., Morris, M.R., and Schoenebeck, S.Y. Accessing Social Support and Overcoming Judgment on Social Media among Parents of Children with Special Needs. In Proc. ICWSM, (2014).","paperID":"None"},{"content":"Bandura, A. Social Learning Theory. General Learning Press, New York, 1977.","paperID":"None"},{"content":"Bennett, T., DeLuca, D.A., and Allen, R.W. Families of children with disabilities: Positive adaptation across the life cycle. Children & Schools 18, 1 (1996), 31--44.","paperID":"None"},{"content":"boyd, danah and Ellison, N. Social network sites: Definition, history, and scholarship. 13, 1 (2007), 11.","paperID":"None"},{"content":"Boyle, C.A., Boulet, S., Schieve, L.A., et al. Trends in the prevalence of developmental disabilities in US children, 1997--2008. Ped. 127, 6 (2011), 1034--1042.","paperID":"None"},{"content":"Centola, D. The spread of behavior in an online social network experiment. Science 329, 5996 (2010), 1194--1197.","paperID":"None"},{"content":"Chung, J.E. Social interaction in online support groups: Preference for online social interaction over offline social interaction. Computers in Human Behavior 29, 4 (2013), 1408--1414.","paperID":"None"},{"content":"Corbin, J. and Strauss, A. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. SAGE, 2008.","paperID":"None"},{"content":"Davis, T.S., Gavazzi, S.M., Scheer, S.D., and Uppal, R. Measuring individualized parent advocate services in children's mental health: A contextualized theoretical application. Journal of Child and Family Studies 20, 5 (2011), 669--684.","paperID":"None"},{"content":"Davison, K.P., Pennebaker, J.W., and Dickerson, S.S. Who talks? The social psychology of illness support groups. American Psychologist 55, 2 (2000), 205.","paperID":"None"},{"content":"Ellison, N.B. and boyd, D. Sociality through social network sites. The Oxford handbook of internet studies, (2013), 151.","paperID":"None"},{"content":"Fitzpatrick, G. and Ellingsen, G. A review of 25 years of CSCW research in healthcare: contributions, challenges and future agendas. Computer Supported Cooperative Work (CSCW) 22, 4--6 (2013), 609--665.","paperID":"None"},{"content":"Floyd, F.J. and Gallagher, E.M. Parental stress, care demands, and use of support services for school-age children with disabilities and behavior problems. Family Relations, (1997), 359--371.","paperID":"None"},{"content":"Gowen, J.W., Christy, D.S., and Sparling, J. Informational needs of parents of young children with special needs. J. of Early Int. 17, 2 (1993), 194--210.","paperID":"None"},{"content":"Hu, C., Kung, S., Rummans, T.A., Clark, M.M., and Lapid, M.I. Reducing caregiver stress with internetbased interventions: a systematic review of open-label and randomized controlled trials. JAMIA, (2014), amiajnl'2014.","paperID":"None"},{"content":"Huh, J. and Ackerman, M.S. Collaborative help in chronic disease management: supporting individualized problems. In Proc. CSCW '12, ACM (2012), 853--862.","paperID":"None"},{"content":"Huws, J., Jones, R., and Ingledew, D. Parents of Children with Autism using an Email Group: A Grounded Theory Study. Journal of Health Psychology 6, 5 (2001), 569--584.","paperID":"None"},{"content":"Ladner, R.E. Access and Empowerment: Commentary on \"Computers and People with Disabilities.\" ACM Trans. Access. Comput. 1, 2 (2008), 11:1--11:5.","paperID":"None"},{"content":"Lake, J. and Billingsley, B. An Analysis of Factors That Contribute to Parent-School Conflict in Special Education. Rem. & Spec. Ed. 21, 4 (2000), 240--251.","paperID":"None"},{"content":"Lindell, M.K. and Perry, R.W. Behavioral foundations of community emergency planning. Hemisphere Publishing Corp, 1992.","paperID":"None"},{"content":"Ludlow, A., Skelly, C., and Rohleder, P. (2011). Challenges faced by parents of children diagnosed with autism spectrum disorder. Journal of health psychology, 17(5), 702--711.","paperID":"None"},{"content":"Malinverni, L., MoraGuiard, J., Padillo, V., Mairena, M., Hervás, A., and Pares, N. Participatory Design Strategies to Enhance the Creative Contribution of Children with Special Needs. In Proc. IDC '14.","paperID":"None"},{"content":"Mandell, D.S. and Salzer, M.S. Who joins support groups among parents of children with autism? Autism 11, 2 (2007), 111--122.","paperID":"None"},{"content":"Mankoff, J., Kuksenok, K., Kiesler, S., Rode, J.A., and Waldman, K. Competing online viewpoints and models of chronic illness. In Proc. CHI '11, ACM (2011), 589--598.","paperID":"None"},{"content":"McCarthy, J.D. and Zald, M.N. The enduring vitality of the resource mobilization theory of social movements. In Handbook of sociological theory. Springer, 2001, 533--565.","paperID":"None"},{"content":"McPherson, M., Arango, P., Fox, H., et al. A new definition of children with special health care needs. Pediatrics 102, 1 Pt 1 (1998), 137--140.","paperID":"None"},{"content":"Meyer, J., Scott, W.R., and Strang, D. Centralization, fragmentation, and school district complexity. Administrative Science Quarterly, (1987), 186--201.","paperID":"None"},{"content":"Miller, K. Care Coordination Impacts on Access to Care for Children with Special Health Care Needs Enrolled in Medicaid and CHIP. Maternal and child health journal, (2013), 1--9.","paperID":"None"},{"content":"Newacheck, P.W., Strickland, B., Shonkoff, J.P., et al. An epidemiologic profile of children with special health care needs. Pediatrics 102, 1 (1998), 117--123.","paperID":"None"},{"content":"Newman, M.W., Lauterbach, D., Munson, S.A., Resnick, P., and Morris, M.E. It's not that I don't have problems, I'm just not putting them on Facebook: challenges and opportunities in using online social networks for health. In Proc. CSCW '11, ACM (2011), 341--350.","paperID":"None"},{"content":"Paul, S.A. and Reddy, M.C. Understanding together: sensemaking in collaborative information seeking. In Proc. CSCW '10, ACM (2010), 321--330.","paperID":"None"},{"content":"Rappaport, J. Empowerment meets narrative: Listening to stories and creating settings. American Journal of community psychology 23, 5 (1995), 795--807.","paperID":"None"},{"content":"Rich, R.C., Edelstein, M., Hallman, W.K., and Wandersman, A.H. Citizen participation and empowerment: The case of local environmental hazards. American Journal of Community Psychology 23, 5 (1995), 657--676.","paperID":"None"},{"content":"Shneiderman, B. Human Values and the Future of Technology: A Declaration of Empowerment. In Proc. of the Conference on Computers and the Quality of Life, ACM (1990), 1--6.","paperID":"None"},{"content":"Shroff, G. and Kam, M. Towards a Design Model for Women's Empowerment in the Developing World. In Proc. CHI 2011, ACM (2011), 2867--2876.","paperID":"None"},{"content":"Singer, G.H., Marquis, J., Powers, L.K., et al. A multisite evaluation of parent to parent programs for parents of children with disabilities. Journal of Early Intervention 22, 3 (1999), 217--229.","paperID":"None"},{"content":"Skeels, M.M., Unruh, K.T., Powell, C., and Pratt, W. Catalyzing social support for breast cancer patients. In Proc. CHI '10, ACM (2010), 173--182.","paperID":"None"},{"content":"Trainor, A.A. Reexamining the promise of parent participation in special education: An analysis of cultural and social capital. Anthropology & Education Quarterly 41, 3 (2010), 245--263.","paperID":"None"},{"content":"Van Uden-Kraan, C.F., Drossaert, C.H., Taal, E., Shaw, B.R., Seydel, E.R., and van de Laar, M.A. Empowering processes and outcomes of participation in online support groups for patients with breast cancer, arthritis, or fibromyalgia. Qualitative Health Research 18, 3 (2008), 405--417.","paperID":"None"},{"content":"Wallston, K.A. Perceived control and health behaviour. Cambridge handbook of psychology, health and medicine 1, (1997).","paperID":"None"},{"content":"Wang, M., Mannan, H., Poston, D., Turnbull, A.P., and Summers, J.A. Parents' perceptions of advocacy activities and their impact on family quality of life. Research & Practice for Persons with Severe Disabilities 29, 2 (2004).","paperID":"None"},{"content":"Wellman, B. and Rainie, L. Networked: The new social operating system. Cambridge, The MIT Press, 2012.","paperID":"None"},{"content":"White, M. and Dorman, S.M. Receiving social support online: implications for health education. Health education research 16, 6 (2001), 693--707","paperID":"None"},{"content":"White, R.W. and Horvitz, E. Cyberchondria: studies of the escalation of medical concerns in web search. ACM TOIS 27, 4 (2009), 23.","paperID":"None"},{"content":"Wise, M. and Kenworthy, L. Preventing industrial toxic hazards: A guide for communities. Inform, 1990.","paperID":"None"},{"content":"Wyngaarden Krauss, M., Wells, N., Gulley, S., and Anderson, B. Navigating systems of care: Results from a national survey of families of children with special health care needs. Children's Services: Social Policy, Research, and Practice 4, 4 (2001), 165--187.","paperID":"None"},{"content":"Zimmerman, M.A. Psychological empowerment: Issues and illustrations. American journal of community psychology 23, 5 (1995), 581--599.","paperID":"None"}],"title":"Networked Empowerment on Facebook Groups for Parents of Children with Special Needs","filename":"CHI15/p2805","authors":["Tawfiq Ammari","Sarita Schoenebeck"],"conference":"CHI '15"}