{"paperId":2702142,"citation":[],"reference":[{"content":"Ambrose, M., Ausloos, J. The Right to be Forgotten Across the Pond. J Inform Pol, 3, 1--23. (2013)","paperID":"None"},{"content":"Are you a Data Controller? At http://www.dataprotection.ie/docs/Are-you-a-DataController-/43.htm","paperID":"None"},{"content":"Attride-Stirling, J. Thematic networks: an analytic tool for qualitative research. Qual Res. 1, 3 (2001) 385--405","paperID":"None"},{"content":"Barnard-Wills, D. Privacy Game. http://surveillantidentity.blogspot.co.uk/p/privacy-cardgame.html","paperID":"None"},{"content":"Bernal, P. The EU, the US and the Right to be Forgotten In Gutwirth, S. Leenes, R. and De Hert, P. {Eds} Reloading Data Protection Multidisciplinary Insights and Contemporary Challenges' Springer, 2014","paperID":"None"},{"content":"Black J 'Decentring Regulation: Understanding the Role of Regulation and Self-regulation in a 'Post- Regulatory' World' (2001) 54 Current Legal Problems 103","paperID":"None"},{"content":"Brownsword, R., Yeung, K. (eds), Regulating Technologies: Legal Futures, Regulatory Frames and Technological Fixes. Hart Publishing, 2008","paperID":"None"},{"content":"Camp, J. and Connelly, K. Beyond Consent: Privacy in Ubicomp Systems in Digital Privacy: Theory, Technologies and Practices (2007)","paperID":"None"},{"content":"Cavoukian, A, Privacy by Design: The 7 Foundational Principles, IPCO, 2011","paperID":"None"},{"content":"Paul Dourish , Genevieve Bell, Divining a Digital Future: Mess and Mythology in Ubiquitous Computing, The MIT Press, 2011","paperID":"2018772"},{"content":"Druschel, P. The Right to Be Forgotten - Between Expectations and Promise, ENISA 2012","paperID":"None"},{"content":"Feick, R. & Werle, R. Regulation of Cyberspace. In Baldwin, R., Cave, M., & Lodge, M. {eds} The Oxford Handbook of Regulation. OUP, 2010, 523--547","paperID":"None"},{"content":"Batya Friedman , David Hendry, The envisioning cards: a toolkit for catalyzing humanistic and technical imaginations, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2208562"},{"content":"Friedman, B. Lin, P. Miller, J.K. Informed Consent by Design in Cranor, L.F. and Garfinkel, S. (Eds) Security and Usability. O'Reilly Media Inc (2005) 503--529","paperID":"None"},{"content":"Michael Golembewski , Mark Selby, Ideation decks: a card-based design ideation tool, Proceedings of the 8th ACM Conference on Designing Interactive Systems, August 16-20, 2010, Aarhus, Denmark","paperID":"1858189"},{"content":"IDEO. Method Cards for IDEO: 51 Card Deck to Inspire Design. At http://www.ideo.com/work/methodcards","paperID":"None"},{"content":"ICO on Privacy by Design, 2014 http://ico.org.uk/for_organisations/data_protection/topic_guides/privacy_by_design","paperID":"None"},{"content":"Marc Langheinrich, A Privacy Awareness System for Ubiquitous Computing Environments, Proceedings of the 4th international conference on Ubiquitous Computing, p.237-245, September 29-October 01, 2002, Göteborg, Sweden","paperID":"741491"},{"content":"Leenes, R \"Framing Techno-Regulation: An Exploration of State and Non-State Regulation By Technology\" Legisprudence, 2011, Vol. 5 No. 2, 143--169","paperID":"None"},{"content":"Lessig, L. Code V2.0. Basic Books, 2006","paperID":"None"},{"content":"Ewa Luger , Tom Rodden, An informed view on consent for UbiComp, Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing, September 08-12, 2013, Zurich, Switzerland","paperID":"2493446"},{"content":"Luger, E. Rodden, T. Terms of Agreement: Rethinking Consent for Pervasive Computing Interact Comput 25.2 (2013)","paperID":"None"},{"content":"Lynskey, O. Rising Like a Phoenix: The Right to Be Forgotten Before the ECJ European Law Blog (2014)","paperID":"None"},{"content":"Wendy E. Mackay, The interactive thread: exploring methods for multi-disciplinary design, Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques, August 01-04, 2004, Cambridge, MA, USA","paperID":"1013131"},{"content":"Manson, C G. and Gorniak, S. Recommendations for a methodology of the assessment of severity of personal data breaches, ENISA, 2013","paperID":"None"},{"content":"Mayntz, R. The Changing Governance of Large Technical Infrastructure Systems in: Mayntz, R. (ed.): Über Governance. In Stitutionen und Prozesse politischer Regelung, Schriften aus dem Max-PlanckInstitut für Gesellschaftsfor-schung, Campus (2009), 121--150","paperID":"None"},{"content":"OECD. The OECD Privacy Framework. OECD Publishing (2013)","paperID":"None"},{"content":"Stahl, B.C. Responsible research and innovation: The role of privacy in an emerging framework. Science and Public Policy, 2013, 40 (6), pp. 708--716","paperID":"None"},{"content":"Smith, D. One small step for EU Parliament could prove one giant leap for data protection. ICO. At. http://ico.org.uk/news/blog/2013/one-small-step-for-euparliament (accessed 13.03.14)","paperID":"None"},{"content":"The Security Cards. At http://securitycards.cs.washington.edu/index.html","paperID":"None"},{"content":"C-131/12 Google Spain v AEPD and Mario Costeja Gonzalez","paperID":"None"},{"content":"US Federal Trade Commission, Protecting Consumer Privacy in an Era of Rapid Change: Recommendations for Businesses and Policymakers, 2012 pp. 22--32","paperID":"None"},{"content":"Yeung K. Design for Regulation in J van Den Hoven et al (Eds) Handbook of Ethics, Values and Technological Design, Springer, 2014.","paperID":"None"}],"abstract":"The regulatory climate is in a process of change. Design, having been implicated for some time, is now explicitly linked to law. This paper recognises the heightened role of designers in the regulation of ambient interactive technologies. Taking account of incumbent legal requirements is difficult. Legal rules are convoluted, uncertain, and not geared towards operationalisable heuristics or development guidelines for system designers. Privacy and data protection are a particular moral, social and legal concern for technologies. This paper seeks to understand how to make emerging European data protection regulation more accessible to our community. Our approach develops and tests a series of data protection ideation cards with teams of designers. We find that, whilst wishing to protect users, regulation is viewed as a compliance issue. Subsequently we argue for the use of instruments, such as our cards, as a means to engage designers in leading a human-centered approach to regulation.","title":"Playing the Legal Card: Using Ideation Cards to Raise Data Protection Issues within the Design Process","filename":"CHI15/p457","authors":["Ewa Luger","Lachlan Urquhart","Tom Rodden","Michael Golembewski"],"conference":"CHI '15"}