{"paperId":2702477,"reference":[{"content":"Fluorouracil Incident Root Cause Analysis. Institute for Safe Medication Practices Canada, 2007.","paperID":"None"},{"content":"Aleccia, J. Nurse's suicide highlights twin tragedies of medical errors. http://www.nbcnews.com/id/43529641/ ns/health-health care/t/nurses-suicidehighlights-twin-tragedies-medical-errors/.","paperID":"None"},{"content":"Kimberly A. Barchard , Larry A. Pace, Preventing human error: The impact of data entry methods on data accuracy and statistical results, Computers in Human Behavior, v.27 n.5, p.1834-1839, September, 2011","paperID":"2007644"},{"content":"Barchard, K. A., and Verenikina, Y. Improving data accuracy: Selecting the best data checking technique. Computer in Human Behaviour (2013), 1917--1922.","paperID":"None"},{"content":"Bargh, J., Chen, M., and Burrows, L. Automaticity of social behavior: Direct effects of trait construct and stereotype activation on action. In Journal of Personality and Social Psychology, American Psychological Association (1996), 230--244.","paperID":"None"},{"content":"Bodner, G. E., and Dypvik, A. T. Masked priming of number judgement depends on prime validity and task. Memory and Cognition 33, 1 (2005), 29--47.","paperID":"None"},{"content":"Paul Cairns , Pratyush Pandab , Christopher Power, The influence of emotion on number entry errors, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557065"},{"content":"Abigail Cauchi , Andy Gimblett , Harold Thimbleby , Paul Curzon , Paolo Masci, Safer \"5-key\" number entry user interfaces using differential formal analysis, Proceedings of the 26th Annual BCS Interaction Specialist Group Conference on People and Computers, September 10-14, 2012, Birmingham, United Kingdom","paperID":"2377921"},{"content":"Collins, A. M., and Loftus, E. F. A spreading-activation theory of semantic processing. Psychological Review 82, 6 (1975), 407--428.","paperID":"None"},{"content":"Darragh, T. Two more patients overdosed at St. Luke's. http://articles.mcall.com/2012-04--25/health/mcallentown-stlukes-overdoses-again20120425 1 hospital-nurses-nursing-errorsinfusion-pumps.","paperID":"None"},{"content":"Dehaene, S., and Akhavein., R. Attention, automaticity, and levels of representation in number processing. Journal of Experimental Psychology: Learning, Memory, and Cognition 21 (1995), 314--326.","paperID":"None"},{"content":"den Heyer, K., and Briand, K. Priming single digit numbers: Automatic spreading activation dissipates as a function of semantic distance. The American Journal of Psychology 99, 3 (1986), 315--340.","paperID":"None"},{"content":"\"Smart\" Infusion Pumps are Selectively Intelligent. http://www.fda.gov/MedicalDevices/Safety/ AlertsandNotices/TipsandArticlesonDeviceSafety/ ucm245160.htm.","paperID":"None"},{"content":"Grissinger, M. The Five Rights: A Destination Without a Map . Journal of Pharmacy and Terapuetics 35, 10 (2010), 542.","paperID":"None"},{"content":"Hogan, H., Healey, F., Neale, G., Thomson, R., Vincent, C., and Black, N. Preventable deaths due to problems in care in english acute hospitals: a retrospective case record review study. In BMJ Qual Saf (2012).","paperID":"None"},{"content":"Nottingham University Hospitals NHS Trust: Medicines Code of Practice. https://www.nuh.nhs.uk/handlers/ downloads.ashx?id=13679.","paperID":"None"},{"content":"Princess Alexandra Hospital NHS Trust: Witnessing Medication Administration. https://www.medicinesresources.nhs.uk/ GetDocument.aspx?pageId=755928.","paperID":"None"},{"content":"Kahneman, D. A proposal to deal with questions about priming effects. http: //www.nature.com/polopoly fs/7.6716.1349271308!/ suppinfoFile/Kahneman%20Letter.pdf.","paperID":"None"},{"content":"Kohn, L., Corrigan, J., and Donaldson, M. To Err Is Human: Building a Safer Health System. The National Academies, 2000.","paperID":"None"},{"content":"Meyer, D., and Schvaneveldt, R. Facilitation in recognizing pairs of words: Evidence of a dependence between retrieval operations. Journal of Experimental Psychology 90 (1971), 227--234.","paperID":"None"},{"content":"Patrick Oladimeji , Harold Thimbleby , Anna Cox, Number entry interfaces and their effects on error detection, Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction, September 05-09, 2011, Lisbon, Portugal","paperID":"2042302"},{"content":"Oladimeji, P., Thimbleby, H., and Cox, A. L. A performance review of number entry interfaces. In Human-Computer Interaction-INTERACT 2013, Springer (2013), 365--382.","paperID":"None"},{"content":"Posner, M., and Snyder, C. Facilitationand inhibition in the processingof signals. In P. M. A. Rabbitt and S. Dornic (Eds.), Attention and performance V. New York: Academic Press. (1975).","paperID":"None"},{"content":"Schvaneveldt, R., and Meyer, D. Retrieval and comparison processes in semantic memory. In Attention and performance IV, New York: Academic Press (1973), 394--409.","paperID":"None"},{"content":"Shanks, D., Newell, B., Lee, E., Balakrishnan, D., Ekelund, L., Cenac, Z., Kavvadia, F., and C.Moore. Priming intelligent behavior: an elusive phenomenon. PLoS ONE 8, e56515 (2013).","paperID":"None"},{"content":"Soboczenski, F., Cairns, P., and Cox, A. Increasing accuracy by decreasing presentation quality in transcription tasks. In Interact, S. L. 8118, Ed. (2013), 380--394.","paperID":"None"},{"content":"Thimbleby, H., and Cairns, P. Reducing number entry errors: solving a widespread, serious problem. Journal of the Royal Society Interface 7, 51 (2010), 1429--1439.","paperID":"None"},{"content":"Tu, H., Oladimeji, P., Wiseman, S., Niezen, G., and Thimbleby, H. Employing Number-based Graphical Representations to Enhance the Effects of Visual Check on Entry Error Detection. In to appear in International Symposium on Interaction Design and Human Factors (IDHF) (2014).","paperID":"None"},{"content":"Tulving, E., Schacter, D., and Stark, H. Priming effects in word fragment completion are independent of recognition memory. Journal of Experimental Psychology: Learning, Memory and Cognition 8, 4 (1982).","paperID":"None"},{"content":"Sarah Wiseman , Paul Cairns , Anna Cox, A taxonomy of number entry error, Proceedings of the 25th BCS Conference on Human-Computer Interaction, July 04-08, 2011, Newcastle-upon-Tyne, United Kingdom","paperID":"2305352"},{"content":"Sarah Wiseman , Anna L. Cox , Duncan P. Brumby , Sandy J.J. Gould , Sarah O'Carroll, Using Checksums to Detect Number Entry Error, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2481332"},{"content":"Wryobeck, J., and Chen, Y. Using priming techniquesto facilitate health behaviours. Clinical Psychologist 7 (2003), 105--108.","paperID":"None"}],"abstract":"Managing and reducing error in number entry tasks is important, especially in safety critical contexts. Understanding factors that can affect number entry accuracy could help the design of more dependable systems. We present three interventions for number entry tasks, inspired by known priming effects (where exposure to prior stimuli can impact task performance). The interventions were questions for the operator to answer before entering each number. Questions related to the value/size of the number, its structure, and the context of the number entry task respectively. Results of a within-subject study show that although there was no significant difference amongst performance across interventions, all three interventions helped to improve the accuracy of number entry by reducing entry errors (by up to 40.8%) and unnoticed errors (by up to 60.7%). These are impressive gains and suggest the importance of more work in this area.","citation":[{"content":"Paul Curzon , Ann Blandford , Harold Thimbleby , Anna Cox, Safer Interactive Medical Device Design: Insights from the CHI+MED Project, Proceedings of the 5th EAI International Conference on Wireless Mobile Communication and Healthcare, p.34-37, October 14-16, 2015, London, Great Britain","paperID":"2897499"}],"title":"Exploring the Effect of Pre-operational Priming Intervention on Number Entry Errors","filename":"CHI15/p1335","authors":["Yunqiu Li","Patrick Oladimeji","Harold Thimbleby"],"conference":"CHI '15"}