{"paperId":2702539,"citation":[],"abstract":"Smartphones and tablets are often used in dynamic environments that force users to break focus and attend to their surroundings, creating a form of \"situational impairment.\" Current mobile devices have no ability to sense when users divert or restore their attention, let alone provide support for resuming tasks. We therefore introduce SwitchBack, a system that allows mobile device users to resume tasks more efficiently. SwitchBack is built upon Focus and Saccade Tracking (FAST), which uses the front-facing camera to determine when the user is looking and how their eyes are moving across the screen. In a controlled study, we found that FAST can identify how many lines the user has read in a body of text within a mean absolute percent error of just 3.9%. We then tested SwitchBack in a dual focus-of-attention task, finding that SwitchBack improved average reading speed by 7.7% in the presence of distractions.","reference":[{"content":"Aaltonen, A., Hyrskykari, A., and Räihä, K. 101 spots, or how do users read menus? Proc. CHI '98, (1998), 132--139.","paperID":"None"},{"content":"Baluja, S. and Pomerleau, D. Non-intrusive gaze tracking using artificial neural networks. 1994.","paperID":"None"},{"content":"Bartram, L. Can motion increase user interface bandwidth in complex systems? Proc. Systems, Man, and Cybernetics '97., (1997), 1686--1692.","paperID":"None"},{"content":"Baudisch, P., Tan, D., and Collomb, M. Phosphor: explaining transitions in the user interface using afterglow effects. Proc. UIST '06, (2006), 169--178.","paperID":"None"},{"content":"Brookings, J., Wilson, G., and Swain, C. Psychophysiological responses to changes in workload during simulated air traffic control. Biological psychology 42, 3 (1996), 361--377.","paperID":"None"},{"content":"Drewes, H., Luca, A. De, and Schmidt, A. Eye-gaze interaction for mobile phones. Proc. Mobility '07, (2007), 364--371.","paperID":"None"},{"content":"Frederick, B. Fixed-, Random-, and Mixed-Effects ANOVA Models: A User-Friendly Guide for Increasing the Generalizability of ANOVA Results. Advances in Social Science Methodology, (1999), 111--122.","paperID":"None"},{"content":"Games, P. Multiple comparisons of means. American Educational Research Journal 2, 8 (1971), 531--565.","paperID":"None"},{"content":"Goldberg, J. and Kotval, X. Computer interface evaluation using eye movements: methods and constructs. International Journal of Industrial Ergonomics 24, 6 (1999), 631--645.","paperID":"None"},{"content":"Goldberg, J. and Stimson, M. Eye tracking in web search tasks: design implications. Proc. Symposium on Eye Tracking Research and Applicaitons '02, (2002), 51--58.","paperID":"None"},{"content":"Goldberg, J. and Wichansky, A. Eye tracking in usability evaluation: A practitioner's guide. The mind's eye: cognitive and applied aspects of eye movement research, (2003), 537--605.","paperID":"None"},{"content":"Hansen, D. and Ji, Q. In the eye of the beholder: A survey of models for eyes and gaze. IEEE Transactions on Pattern Analysis and Machine Intelligence 32, 3 (2010), 478--500.","paperID":"None"},{"content":"Hart, S. and Staveland, L. Development of NASATLX (Task Load Index): Results of empirical and theoretical research. Advances in psychology 52, (1988), 139--183.","paperID":"None"},{"content":"Higgins, J. and Tastoush, S. An aligned rank transform test for interaction. Nonlinear World 1, 2 (1994), 201--211.","paperID":"None"},{"content":"Jacob, R. and Karn, K. Eye tracking in humancomputer interaction and usability research: Ready to deliver the promises. Mind, (2003).","paperID":"None"},{"content":"Just, M. and Carpenter, P. A theory of reading: From eye fixations to comprehension. Psychological review 87, 4 (1980), 329.","paperID":"None"},{"content":"Kang, D., Ryoo, S., Kim, J., Kim, C., and Seo, Y. Apparatus and method for detecting speaking person's eyes and face. US Patent 6,611,613, 2003. http://www.google.com/patents/US6611613.","paperID":"None"},{"content":"Kern, D., Marshall, P., and Schmidt, A. Gazemarks: gaze-based visual placeholders to ease attention switching. Proc. CHI '10, (2010), 2093--2102.","paperID":"None"},{"content":"Kincaid, J.P., Fishburne Jr, R.P., Rogers, R.L., and Chissom, B.S. Derivation of new readability formulas (automated readability index, fog count and flesch reading ease formula) for navy enlisted personnel. 1975.","paperID":"None"},{"content":"Kintsch, W. and Keenan, J. Reading rate and retention as a function of the number of propositions in the base structure of sentences. Cognitive Psychology 5, 3 (1973), 257--274.","paperID":"None"},{"content":"Littell, R.C., Henry, P.R., and Ammerman, C.B. Statistical analysis of repeated measures data using SAS procedures. Journal of Animal Science 4, 76 (1998), 1216--1231.","paperID":"None"},{"content":"Marshall, S.P. Method and apparatus for eye tracking and monitoring pupil dilation to evaluate cognitive activity. US Patent 6,090,051, 2000. http://www.google.com/patents/US6090051.","paperID":"None"},{"content":"McCrickard, D.S., Catrambone, R., and Stasko, J.T. Evaluating animation in the periphery as a mechanism for maintaining awareness. Proc. IFIP '01, (2001), 148--156.","paperID":"None"},{"content":"Miluzzo, E., Wang, T., and Campbell, A.T. EyePhone: activating mobile phones with your eyes. Proc. SIGCOMM '10, (2010), 15--20.","paperID":"None"},{"content":"Monsell, S. Task switching. Trends in Cognitive Sciences 7, 3 (2003), 134--140.","paperID":"None"},{"content":"Morimoto, C.H. and Mimica, M.R. Eye gaze tracking techniques for interactive applications. Computer Vision and Image Understanding 98, 1 (2005), 4--24.","paperID":"None"},{"content":"Nasar, J.L. and Troyer, D. Pedestrian injuries due to mobile phone use in public places. Accident Analysis & Prevention 57, (2013), 91--95.","paperID":"None"},{"content":"Newcomb, A. Texting While Walking Banned in New Jersey Town ABC News. 2012. http://abcnews.go.com/blogs/headlines/2012/05/textin g-while-walking-banned-in-new-jersey-town/.","paperID":"None"},{"content":"Pomplun, M. and Sunkara, S. Pupil dilation as an indicator of cognitive workload in human-computer interaction. Proc. International Conference on HCI '03, (2003).","paperID":"None"},{"content":"Salter, K. and Fawcett, R. The ART test of interaction: A robust and powerful rank test of interaction in factorial models. Communications in Statistics: Simulation and Computation 22, 1 (1993), 137--153.","paperID":"None"},{"content":"Sears, A., Lin, M., Jacko, J., and Xiao, Y. When computers fade: Pervasive computing and situationally-induced impairments and disabilities. Proc. HCI International '03, (2003), 1298--1302.","paperID":"None"},{"content":"Shapiro, S. and Wilk, M. An analysis of variance test for normality (complete samples). Biometrika 52, 3,4 (1965), 591--611.","paperID":"None"},{"content":"Stiefelhagen, R., Yang, J., and Waibel, A. Tracking eyes and monitoring eye gaze. Proc. Workshop on Perceptual User Interfaces, (1997), 98--100.","paperID":"None"},{"content":"Wobbrock, J.O., Findlater, L., Gergle, D., and Higgins, J.J. The Aligned Rank Transform for nonparametric factorial analyses using only ANOVA procedures. Proc. CHI '11, (2011), 143--146.","paperID":"None"},{"content":"Ye, Z., Li, Y., Fathi, A., et al. Detecting eye contact using wearable eye-tracking glasses. Proc. UbiComp '12, (2012), 699--704.","paperID":"None"},{"content":"Yokoyama, T., Sakai, H., Noguchi, Y., and Kita, S. Perception of direct gaze does not require focus of attention. Scientific reports 4, (2014), 3858.","paperID":"None"}],"title":"SwitchBack: Using Focus and Saccade Tracking to Guide Users' Attention for Mobile Task Resumption","filename":"CHI15/p2953","authors":["Alexander Mariakakis","Mayank Goel","Md Tanvir Islam Aumi","Shwetak N. Patel","Jacob O. Wobbrock"],"conference":"CHI '15"}