{"paperId":2702484,"abstract":"Symbol-based dictionaries of text, images and sound can help individuals with aphasia find the words they need, but are often seen as a last resort because they tend to replace rather than augment the user's natural speech. Through two design investigations, we explore head-worn displays as a means of providing unobtrusive, always-available, and glanceable vocabulary support. The first study used narrative storyboards as a design probe to explore the potential benefits and challenges of a head-worn approach over traditional augmented alternative communication (AAC) tools. The second study then evaluated a proof-of-concept prototype in both a lab setting with the researcher and in situ with unfamiliar conversation partners at a local market. Findings suggest that a head-worn approach could better allow wearers to maintain focus on the conversation, reduce reliance on the availability of external tools (e.g., paper and pen) or people, and minimize visibility of the support by others. These studies should motivate further investigation of head-worn conversational support.","citation":[{"content":"Marcin Wichrowski , Danijel Koržinek , Krzysztof Szklanny, Google Glass Development in Practice: UX Design Sprint Workshops, Proceedings of the Mulitimedia, Interaction, Design and Innnovation, June 29-30, 2015, Warsaw, Poland","paperID":"2814475"}],"reference":[{"content":"Allen, M., McGrenere, J., and Purves, B. The design and field evaluation of PhotoTalk: A digital image communication application for people. Proc. ASSETS'07, ACM (2007), 187--194.","paperID":"None"},{"content":"Al Mahmud, A., Gerits, R., and Martens, J. XTag: designing an experience capturing and sharing tool for persons with aphasia. Proc. NordiCHI'10, ACM (2010), 325--334.","paperID":"None"},{"content":"Ball, M.J., Muller, N., and Nelson, R.L., eds. Handbook of Qualitative Research in Communication Disorders. Psychology Press, 2014.","paperID":"None"},{"content":"Boyd-graber, J., Nikolova, S., Moffatt, K., et al. Participatory Design with Proxies: Developing a DesktopPDA System to Support People with Aphasia. Proc. CHI'06, ACM (2006), 151--160.","paperID":"None"},{"content":"Brandenburg, C., Worrall, L., Rodriguez, A.D., and Copland, D. Mobile computing technology and aphasia: An integrated review of accessibility and potential uses. Aphasiology 27, 4 (2013), 444--461.","paperID":"None"},{"content":"Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.","paperID":"None"},{"content":"Chapey, R. Language intervention strategies in aphasia and related neurogenic communication disorders. Lippincott Williams & Wilkins, Philadelphia, 2001.","paperID":"None"},{"content":"Demmans Epp, C., Djordjevic, J., Wu, S., Moffatt, K., and Baecker, R.M. Towards providing just-in-time vocabulary support for assistive and augmentative communication. Proc. IUI'12, ACM (2012), 333--36.","paperID":"None"},{"content":"Galliers, J., Wilson, S., Roper, A., et al. Words Are Not Enough: Empowering People With Aphasia In The Design Process. Proc. PDC'12, ACM (2012), 51--60.","paperID":"None"},{"content":"Galliers, O., Galliers, J., Wilson, S., et al. City Research Online Accessibility of 3D Game Environments for People with Aphasia: An Exploratory Study. Proc. ASSETS'11, ACM (2011), 24--26.","paperID":"None"},{"content":"Ha, K., Chen, Z., Hu, W., Richter, W., Pillai, P., and Satyanarayanan, M. Towards wearable cognitive assistance. Proc. MobiSys'14, ACM (2014), 68--81.","paperID":"None"},{"content":"Holland, A., Frattali, C., and Fromm, D. Communication Activities of Daily Living: CADL-2. (1999).","paperID":"None"},{"content":"Kagan, A. Supported conversation for adults with aphasia: Methods and resources for training conversation partners. Aphasiology 12, 9 (1998), 816--830.","paperID":"None"},{"content":"Kane, S.K., Linam-Church, B., Althoff, K., and McCall, D. What We Talk About: Designing a Context-aware Communication Tool for People with Aphasia. Proc. ASSETS'12, ACM (2012), 49--56.","paperID":"None"},{"content":"Kertesz, A. and Poole, E. The Aphasia Quotient: The Taxonomic Approach to Measurement of Aphasic Disability. Can. J. Neurol. Sci. 1, 1 (1974), 7--16.","paperID":"None"},{"content":"Kunze, K. Wearable Computing for Older Adults -- Initial Insights into Head-Mounted Display Usage. Adj. Proc. UbiComp'14, ACM (2014), 83--86.","paperID":"None"},{"content":"Lasker, J. and Bedrosian, J. Promoting acceptance of augmentative and alternative communication by adults with acquired communication disorders. Augmentative and Alternative Communication 17, 3 (2001), 141--153.","paperID":"None"},{"content":"Mcatamney, G., Street, S.V., and Uk, G. An Examination of the Effects of a Wearable Display on Informal Face-ToFace Communication. Proc. CHI'06, ACM (2006), 45--54.","paperID":"None"},{"content":"McNaney, R., Vines, J., Roggen, D., et al. Exploring the acceptability of google glass as an everyday assistive device for people with parkinson's. Proc. CHI'14, ACM (2014), 2551--2554.","paperID":"None"},{"content":"Moffatt, K., Mcgrenere, J., Purves, B., and Klawe, M. The Participatory Design of a Sound and Image Enhanced Daily Planner for People with Aphasia. Proc. CHI'04, ACM (2004), 407--414.","paperID":"None"},{"content":"Nikolova, S., Tremaine, M., and Cook, P. Click on Bake to Get Cookies: Guiding Word-Finding with Semantic Associations. Proc. ASSETS'10, ACM (2010), 155--162.","paperID":"None"},{"content":"Ofek, E., Iqbal, S.T., Strauss, K., and Way, O.M. Reducing Disruption from Subtle Information Delivery during a Conversation: Mode and Bandwidth Investigation. Proc. CHI'13, ACM (2013), 3111--3120.","paperID":"None"},{"content":"Patokallio, J. and Ward, N. A wearable cross-language communication aid. Proc. ISWC'01, IEEE Comput. Soc (2001), 176--177.","paperID":"None"},{"content":"Rhodes, B.J. Just-In-Time Information Retrieval. PhD Dissertation, MIT, 2000.","paperID":"None"},{"content":"Van de Sandt-Koenderman, M. High-tech AAC and aphasia: Widening horizons' Aphasiology 18, 3 (2004), 245--263.","paperID":"None"},{"content":"Tee, K., Moffatt, K., Findlater, L., et al. A Visual Recipe Book for Persons with Language Impairments. Proc. CHI'05, ACM (2005), 501--510.","paperID":"None"},{"content":"Waller, A., Denis, F., Brodie, J., and Cairns, A.Y. Evaluating the use of TalksBac, a predictive communciation device for nonfluent adults with aphasia. Int. J. Lang. Commun. Disord. 33, 1 (1998), 45--70.","paperID":"None"}],"title":"Designing Conversation Cues on a Head-Worn Display to Support Persons with Aphasia","filename":"CHI15/p231","authors":["Kristin Williams","Karyn Moffatt","Denise McCall","Leah Findlater"],"conference":"CHI '15"}