{"paperId":2702534,"abstract":"In this paper, we present the results of a multi-year study of the social computing practices of 179 adolescents (Mage=12.4 years, SD=1.3; range: 10-14) living in a majority-minority lower-income urban neighborhood in the Southeast U.S. We investigate shifting social media practices using annual surveys and focus groups. We describe participants' social media use and motivations and show how that use has shifted over time. We show how participants identify social pressures and influences as well as specific behaviors including computer-mediated risky behaviors and self-harm. We discuss the implications of our findings for the CHI research community, including methodological challenges and the need for further study of computer-mediated harmful behaviors in youth populations. By demonstrating how large-scale trends are enacted on the ground, we describe participants' uses, motivations and behaviors as they deal with the increasing influence of technology in their social lives.","citation":[{"content":"Jessica A. Pater , Oliver L. Haimson , Nazanin Andalibi , Elizabeth D. Mynatt, “Hunger Hurts but Starving Works”: Characterizing the Presentation of Eating Disorders Online, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820030"}],"reference":[{"content":"Bazelon, E. Sticks and Stones: Defeating the Culture of Bullying and Rediscovering the Power of Character adn Empathy. Random House, New York, New York, USA, 2013.","paperID":"None"},{"content":"Danah Boyd, It's Complicated: The Social Lives of Networked Teens, Yale University Press, New Haven, CT, 2014","paperID":"2584525"},{"content":"Brener, N.D., et al. Assessment of Factors Affecting the Validity of Self-Reported Health-Risk Behavior Among Adolescents: Evidence From the Scientific Literature. Jrl of Adol Health 33, (2003), 436--457.","paperID":"None"},{"content":"Tatiana Buhler , Carman Neustaedter , Serena Hillman, How and why teenagers use video chat, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441861"},{"content":"Caplan, S.E. Problematic Internet use and psychosocial well-being: development of a theory-based cognitive-behavioral measurement instrument. Computers in Human Behavior 18, 5 (2002), 553--575.","paperID":"None"},{"content":"Christodoulou, M. Pro-anorexia websites pose public health challenge. The Lancet 379, (2012), 110--112.","paperID":"None"},{"content":"Davis, R. a. A cognitive-behavioral model of pathological Internet use. Computers in Human Behavior 17, 2 (2001), 187--195.","paperID":"None"},{"content":"Erikson, E.H. Childhood and Society. WW Norton & Company, 1993.","paperID":"None"},{"content":"Rachel A. Fleming-May , Laura E. Miller, I'm scared to look but I'm dying to know: information seeking and sharing on Pro-Ana weblogs, Proceedings of the 73rd ASIS&T Annual Meeting on Navigating Streams in an Information Ecosystem, October 22-27, 2010, Pittsburgh, Pennsylvania","paperID":"1920419"},{"content":"Forman, A., Baker, P., Pater, J., and Smith, K. Beautiful to me: Identity, disability, and gender in virtual envioronments. IJEP 2, 2 (2011), 1--17.","paperID":"None"},{"content":"Gerbner, G., Morgan, M., and Signorielli, N. Living with Television: The Dynamics of the CuItivation Process. In Perspectives on media affects. 1986, 17--40.","paperID":"None"},{"content":"Rebecca E. Grinter , Leysia Palen, Instant messaging in teen life, Proceedings of the 2002 ACM conference on Computer supported cooperative work, November 16-20, 2002, New Orleans, Louisiana, USA","paperID":"587082"},{"content":"Mizuko Ito , Sonja Baumer , Matteo Bittanti , danah boyd , Rachel Cody , Becky Herr-Stephenson , Heather A. Horst , Patricia G. Lange , Dilan Mahendran , Katynka Z. Martinez , C. J. Pascoe , Dan Perkel , Laura Robinson , Christo Sims , Lisa Tripp, Hanging Out, Messing Around, and Geeking Out: Kids Living and Learning with New Media, The MIT Press, 2009","paperID":"1822783"},{"content":"Kaare, B., Brandtzaeg, P., Heim, J., and Endestad, T. In the borderland between family orientation and peer culture: the use of communication technologies among Norwegian tweens. New Media Society 9, (2007), 603--624.","paperID":"None"},{"content":"Lenhart, A., Purcell, K., Smith, A., and Zickuhr, K. Social Media & Mobile Internet Use among Teens and Young Adults. Millennials. Pew, 2010.","paperID":"None"},{"content":"Lenhart, A. Teens, smartphones & texting. Pew, 2012.","paperID":"None"},{"content":"Livingstone, S. Taking risky opportunities in youthful content creation. New Media Society 10, 3 (2008), 393--411.","paperID":"None"},{"content":"Madden, M., Lenhart, A., Duggan, M., Cortesi, S., and Gasser, U. Teens and Technology 2013. Pew, 2013.","paperID":"None"},{"content":"Madden, M. Teens Haven't Abandoned Facebook (Yet). Pew, 2013.","paperID":"None"},{"content":"McKie, R. Onset of puberity ingirls has fallen by five years since 1920. The Guardian, 2012. www.theguardian.com.","paperID":"None"},{"content":"Andrew D. Miller , Elizabeth D. Mynatt, StepStream: a school-based pervasive social fitness system for everyday adolescent health, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557190"},{"content":"Andrew D. Miller , Jessica Pater , Elizabeth D. Mynatt, Design strategies for youth-focused pervasive social health games, Proceedings of the 7th International Conference on Pervasive Computing Technologies for Healthcare, May 05-08, 2013, Venice, Italy","paperID":"2534507"},{"content":"Miller, D. Global Social Media Impact Study. 2013.","paperID":"None"},{"content":"Morgan, M. and Shanahan, J. The State of Cultivation. Journal of Broadcasting & Electronic Media 54, 2 (2010), 337--355.","paperID":"None"},{"content":"Morris, B. A Disturbing Growth Industry: Websites that Expose Anorexia. New York Times, 2002.","paperID":"None"},{"content":"O'Keeffe, G. and Clarke-Pearson, K. The impact of social media on children, adolescents, and families. Pediatrics 127, 4 (2011), 800--804.","paperID":"None"},{"content":"Olson, P. Here's Where Teens are Going Instead of Facebook. Forbes, 2013.","paperID":"None"},{"content":"John Palfrey , Urs Gasser, Born Digital: Understanding the First Generation of Digital Natives, Basic Books, Inc., New York, NY, 2008","paperID":"1481066"},{"content":"Rideout, V., Foehr, U., and Roberts, D. Generation M(2) Media in the LIves of 8--18 year-olds. 2010.","paperID":"None"},{"content":"Sacco, D. and Al., E. Sexting: Youth Practices and Legal Implications. 2010.","paperID":"None"},{"content":"Sandelowski, M., Docherty, S., and Emden, C. Focus on qualitative methods, Qualitative metasynthesis: issues and techniques. Research in Nursing and Health 20, (1997), 365--372.","paperID":"None"},{"content":"Schrock, A. Examining social media usage: Technology clusters and social network site membership. First Monday 14, 1 (2008).","paperID":"None"},{"content":"Shieber, J. Anonymous Social Messaging Discovers Location Matters. Tech Crunch, 2014.","paperID":"None"},{"content":"Simon, H. Report: Eating Disorders. 2013.","paperID":"None"},{"content":"Steinberg, L. and MOrris, A.S. Adolescent Development. Journal of Cog Ed and Psyc 2, 1 (2001), 55--87.","paperID":"None"},{"content":"Sherry Turkle, Alone Together: Why We Expect More from Technology and Less from Each Other, Basic Books, Inc., New York, NY, 2011","paperID":"1972496"},{"content":"Wellman, B., Haase, A.Q., Witte, J., and Hampton, K. Does the Internet increase, decrease, or supplement social capital? Social networks, participation, and community commitment. American behavioral scientist 45, 3 (2001), 436--455.","paperID":"None"},{"content":"Williams, D. Virtual Cultivation: Online worlds, offline perceptions. Journal of Comm. 56, 1 (2006), 69--87.","paperID":"None"},{"content":"Xu, Q., Wan, Y., Zhang, Y., Liu, Y., and Sun, Y. Internet usage and teens' psychological well-being in China. 2011 International Conference on E-Business and EGovernment (ICEE), Ieee (2011), 1--4.","paperID":"None"},{"content":"Student victimization in US Schools: Results from the 2009 School Crime Supplement to the Naitonal Crime Victimization Survey. NCES, 2011.","paperID":"None"},{"content":"Puberty. U.S. Office of Adolescent Health, 2015. http://www.hhs.gov/","paperID":"None"}],"title":"This Digital Life: A Neighborhood-Based Study of Adolescents' Lives Online","filename":"CHI15/p2305","authors":["Jessica A. Pater","Andrew D. Miller","Elizabeth D. Mynatt"],"conference":"CHI '15"}