{"paperId":2702501,"abstract":"In this paper we present our results on using electromyographic (EMG) sensor arrays for finger gesture recognition. Sensing muscle activity allows to capture finger motion without placing sensors directly at the hand or fingers and thus may be used to build unobtrusive body-worn interfaces. We use an electrode array with 192 electrodes to record a high-density EMG of the upper forearm muscles. We present in detail a baseline system for gesture recognition on our dataset, using a naive Bayes classifier to discriminate the 27 gestures. We recorded 25 sessions from 5 subjects. We report an average accuracy of 90% for the within-session scenario, showing the feasibility of the EMG approach to discriminate a large number of subtle gestures. We analyze the effect of the number of used electrodes on the recognition performance and show the benefit of using high numbers of electrodes. Cross-session recognition typically suffers from electrode position changes from session to session. We present two methods to estimate the electrode shift between sessions based on a small amount of calibration data and compare it to a baseline system with no shift compensation. The presented methods raise the accuracy from 59% baseline accuracy to 75% accuracy after shift compensation. The dataset is publicly available.","citation":[{"content":"Yang Zhang , Chris Harrison, Tomo: Wearable, Low-Cost Electrical Impedance Tomography for Hand Gesture Recognition, Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2807480"},{"content":"Kentaro Tsubaki , Tsutomu Terada , Masahiko Tsukamoto, An Activity Recognition Method by Measuring Circumference of Body Parts, Proceedings of the 7th Augmented Human International Conference 2016, p.1-7, February 25-27, 2016, Geneva, Switzerland","paperID":"2875220"}],"reference":[{"content":"Ang, K. K., Chin, Z. Y., Zhang, H., and Guan, C. Mutual information-based selection of optimal spatial-temporal patterns for single-trial eeg-based bcis. Pattern Recognition 45, 6 (2012), 2137--2144.","paperID":"None"},{"content":"Assad, C., Wolf, M., Theodoridis, T., Glette, K., and Stoica, A. Biosleeve: a natural emg-based interface forhri. In Proc. HRI 2013 (2013), 69--70.","paperID":"None"},{"content":"Atzori, M., Gijsberts, A., Kuzborskij, I., Heynen, S., Mittaz Hager, A., Deriaz, O., Castellini, C., Muller, H., and Caputo, B. Characterization of a benchmark database for myoelectric movement classification. Neural Systems and Rehabilitation Engineering, IEEE Transactions on PP, 99 (2014), 1--1.","paperID":"None"},{"content":"Castellini, C., Fiorilla, A. E., and Sandini, G. Multi-subject/daily-life activity EMG-based control of mechanical hands. Journal of neuroengineering and rehabilitation 6 (Jan. 2009), 41.","paperID":"None"},{"content":"Cormen, T. H., Leiserson, C. E., Rivest, R. L., Stein, C., et al. Introduction to algorithms, vol. 2. MIT press Cambridge, 2001.","paperID":"None"},{"content":"De Luca, C. J. The use of surface electromyography in biomechanics. Journal of applied biomechanics 13 (1997), 135--163.","paperID":"None"},{"content":"Heger, D., Putze, F., Amma, C., Wand, M., Plotkin, I., Wielatt, T., and Schultz, T. Biosignalsstudio: a flexible framework for biosignal capturing and processing. In Proc. KI 2010 (2010), 33--39.","paperID":"None"},{"content":"Hermens, H. J., Freriks, B., Merletti, R., Stegeman, D., Blok, J., Rau, G., Disselhorst-Klug, C., and Hägg, G. European recommendations for surface electromyography. Roessingh Research and Development Netherlands, 1999.","paperID":"None"},{"content":"Kim, D., Hilliges, O., Izadi, S., Butler, A. D., Chen, J., Oikonomidis, I., and Olivier, P. Digits: freehand 3d interactions anywhere using a wrist-worn gloveless sensor. In Proc. UIST 2012 (2012), 167--176.","paperID":"None"},{"content":"Kim, J., Mastnik, S., and André, E. Emg-based hand gesture recognition for realtime biosignal interfacing. In Proc. IUI 2008 (2008), 30--39.","paperID":"None"},{"content":"Merletti, R., Holobar, A., and Farina, D. Analysis of motor units with high-density surface electromyography. Journal of electromyography and kinesiology 18, 6 (2008), 879--890.","paperID":"None"},{"content":"Mistry, P., Maes, P., and Chang, L. Wuw-wear ur world: a wearable gestural interface. In CHI EA 2009, ACM (2009), 4111--4116.","paperID":"None"},{"content":"Muceli, S., and Farina, D. Simultaneous and proportional estimation of hand kinematics from emg during mirrored movements at multiple degrees-of-freedom. Neural Systems and Rehabilitation Engineering, IEEE Transactions on 20, 3 (2012), 371--378.","paperID":"None"},{"content":"Rekimoto, J. Gesturewrist and gesturepad: Unobtrusive wearable interaction devices. In Proc. ISWC 2001 (2001), 21--27.","paperID":"None"},{"content":"Rojas-Martínez, M., Mañanas, M. A., Alonso, J. F., et al. High-density surface emg maps from upper-arm and forearm muscles. J. Neuroeng. Rehabil 9, 85.10 (2012), 1186.","paperID":"None"},{"content":"Samadani, A.-A., and Kulić, D. Hand gesture recognition based on surface electromyography. In Proc. EMBC 2014, IEEE (2014), 4196--4199.","paperID":"None"},{"content":"Saponas, T. S., Tan, D. S., Morris, D., and Balakrishnan, R. Demonstrating the feasibility of using forearm electromyography for muscle-computer interfaces. In Proc. SIGCHI 2008 (2008), 515--524.","paperID":"None"},{"content":"Saponas, T. S., Tan, D. S., Morris, D., Turner, J., and Landay, J. A. Making muscle-computer interfaces more practical. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2010), 851--854.","paperID":"None"},{"content":"Starner, T., Auxier, J., Ashbrook, D., and Gandy, M. The gesture pendant: A self-illuminating, wearable, infrared computer vision system for home automation control and medical monitoring. In Wearable computers, the fourth international symposium on, IEEE (2000), 87--94.","paperID":"None"},{"content":"Vincent, L., and Soille, P. Watersheds in digital spaces: an efficient algorithm based on immersion simulations. IEEE transactions on pattern analysis and machine intelligence 13, 6 (1991), 583--598.","paperID":"None"},{"content":"Wand, M., Schulte, C., Janke, M., and Schultz, T. Compensation of recording position shifts for a myoelectric silent speech recognizer. In Proc. ICASSP 2014 (2014), 2094--2098.","paperID":"None"},{"content":"Wheeler, K. R., Chang, M. H., and Knuth, K. H. Gesture-based control and emg decomposition. Systems, Man, and Cybernetics, Part C: Applications and Reviews, IEEE Transactions on 36, 4 (2006), pp. 503--514.","paperID":"None"},{"content":"Zhang, H. The optimality of naive bayes. AA 1, 2 (2004), 3.","paperID":"None"}],"title":"Advancing Muscle-Computer Interfaces with High-Density Electromyography","filename":"CHI15/p929","authors":["Christoph Amma","Thomas Krings","Jonas Böer","Tanja Schultz"],"conference":"CHI '15"}