{"paperId":2702250,"citation":[],"reference":[{"content":"R. T. Azuma et al. A survey of augmented reality. Presence, 6(4):355--385, 1997.","paperID":"None"},{"content":"Z. Bai, A. F. Blackwell, and G. Coulouris. Through the looking glass: Pretend play for children with autism. In Mixed and Augmented Reality (ISMAR), 2013 IEEE International Symposium on, pages 49--58. IEEE, 2013.","paperID":"None"},{"content":"Connelly Barnes , David E. Jacobs , Jason Sanders , Dan B Goldman , Szymon Rusinkiewicz , Adam Finkelstein , Maneesh Agrawala, Video puppetry: a performative interface for cutout animation, ACM Transactions on Graphics (TOG), v.27 n.5, December 2008","paperID":"1409077"},{"content":"A. L. Brown and M. J. Kane. Preschool children can learn to transfer: Learning to learn and learning from example. Cognitive Psychology, 20(4):493--523, 1988.","paperID":"None"},{"content":"K. Coolahan, J. Fantuzzo, J. Mendez, and P. McDermott. Preschool peer interactions and readiness to learn: Relationships between classroom peer play and learning behaviors and conduct. Journal of Educational Psychology, 92(3):458, 2000.","paperID":"None"},{"content":"P. Dourish. Where the action is: the foundations of embodied interaction. MIT press, 2004.","paperID":"None"},{"content":"J. Dunn, J. Brown, C. Slomkowski, C. Tesla, and L. Youngblade. Young children's understanding of other people's feelings and beliefs: Individual differences and their antecedents. Child development, 62(6):1352--1366, 1991.","paperID":"None"},{"content":"D. Edge, A. Blackwell, and L. Dubuc. The physical world as an abstract interface. Contemporary Ergonomics, pages 224--228, 2006.","paperID":"None"},{"content":"P. Ekman. An argument for basic emotions. Cognition & Emotion, 6(3--4):169--200, 1992.","paperID":"None"},{"content":"W. Farr, N. Yuill, and S. Hinske. An augmented toy and social interaction in children with autism. International Journal of Arts and Technology, 5(2):104--125, 2012.","paperID":"None"},{"content":"G. G. Fein. Pretend play in childhood: An integrative review. Child development, pages 1095--1118, 1981.","paperID":"None"},{"content":"C. Garvey and R. Berndt. The organization of pretend play. 1975.","paperID":"None"},{"content":"Y. Guiard. Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. Journal of motor behavior, 19(4):486--517, 1987.","paperID":"None"},{"content":"N. K. Hayles. How we think: Digital media and contemporary technogenesis. University of Chicago Press, 2012.","paperID":"None"},{"content":"Seth E. Hunter , Pattie Maes , Anthony Tang , Kori M. Inkpen , Susan M. Hessey, WaaZam!: supporting creative play at a distance in customized video environments, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557382"},{"content":"A. M. Leslie. Pretense and representation: The origins of theory of mind. Psychological review, 94(4):412, 1987.","paperID":"None"},{"content":"A. Lillard. Pretend play as twin earth: A social-cognitive analysis. Developmental Review, 21(4):495--531, 2001.","paperID":"None"},{"content":"Fei Lu , Feng Tian , Yingying Jiang , Xiang Cao , Wencan Luo , Guang Li , Xiaolong Zhang , Guozhong Dai , Hongan Wang, ShadowStory: creative and collaborative digital storytelling inspired by cultural heritage, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979221"},{"content":"R. MacLaren and D. Olson. Trick or treat: Children's understanding of surprise. Cognitive development, 8(1):27--46, 1993.","paperID":"None"},{"content":"Pattie Maes , Trevor Darrell , Bruce Blumberg , Alex Pentland, The ALIVE system: wireless, full-body interaction with autonomous agents, Multimedia Systems, v.5 n.2, p.105-112, March 1997","paperID":"959153"},{"content":"P. Marshall, Y. Rogers, and M. Scaife. Puppet: a virtual environment for children to act and direct interactive narratives. In 2nd international workshop on narrative and interactive learning environments, pages 8--15, 2002.","paperID":"None"},{"content":"Michael Nitsche , Sanjeev Nayak, Cell phone puppets: turning mobile phones into performing objects, Proceedings of the 11th international conference on Entertainment Computing, September 26-29, 2012, Bremen, Germany","paperID":"2405619"},{"content":"J. Piaget. Play, dreams and imitation in childhood, volume 25. Routledge, 2013.","paperID":"None"},{"content":"D. Premack and G. Woodruff. Does the chimpanzee have a theory of mind? Behavioral and brain sciences, 1(04):515--526, 1978.","paperID":"None"},{"content":"Iulian Radu , Blair MacIntyre, Using children's developmental psychology to guide augmented-reality design and usability, Proceedings of the 2012 IEEE International Symposium on Mixed and Augmented Reality (ISMAR), p.227-236, November 05-08, 2012","paperID":"2474261"},{"content":"Azriel Rosenfeld , John L. Pfaltz, Sequential Operations in Digital Picture Processing, Journal of the ACM (JACM), v.13 n.4, p.471-494, Oct. 1966","paperID":"321357"},{"content":"T. Ruffman and T. R. Keenan. The belief-based emotion of suprise: The case for a lag in understanding relative to false belief. Developmental Psychology, 32(1):40, 1996.","paperID":"None"},{"content":"M. A. Runco. Divergent thinking. Ablex Publishing, 1991.","paperID":"None"},{"content":"M. A. Runco and R. S. Albert. The reliability and validity of ideational originality in the divergent thinking of academically gifted and nongifted children. Educational and Psychological Measurement, 45(3):483--501, 1985.","paperID":"None"},{"content":"S. W. Russ. Play, creativity, and adaptive functioning: Implications for play interventions. Journal of Clinical Child Psychology, 27(4):469--480, 1998.","paperID":"None"},{"content":"Kimiko Ryokai , Justine Cassell, Computer support for children's collaborative fantasy play and storytelling, Proceedings of the 1999 conference on Computer support for collaborative learning, p.63-es, December 12-15, 1999, Palo Alto, California","paperID":"1150303"},{"content":"Kimiko Ryokai , Hayes Raffle , Robert Kowalski, StoryFaces: pretend-play with ebooks to support social-emotional storytelling, Proceedings of the 11th International Conference on Interaction Design and Children, June 12-15, 2012, Bremen, Germany","paperID":"2307111"},{"content":"R. K. Sawyer. Levels of analysis in pretend play discourse: Metacommunication in conversational routines. PLAY AND CULTURE STUDIES, 5:137--158, 2003.","paperID":"None"},{"content":"B. Shneiderman. Direct manipulation: a step beyond programming languages. Sparks of Innovation in Human-Computer Interaction, 17, 1993.","paperID":"None"},{"content":"S. Smilansky. The effects of sociodramatic play on disadvantaged preschool children. Wiley New York, 1968.","paperID":"None"},{"content":"H. Tager-Flusberg and K. Sullivan. Attributing mental states to story characters: A comparison of narratives produced by autistic and mentally retarded individuals. Applied Psycholinguistics, 16(03):241--256, 1995.","paperID":"None"},{"content":"Feng Zhou , Henry Been-Lirn Duh , Mark Billinghurst, Trends in augmented reality tracking, interaction and display: A review of ten years of ISMAR, Proceedings of the 7th IEEE/ACM International Symposium on Mixed and Augmented Reality, p.193-202, September 15-18, 2008","paperID":"1605333"},{"content":"Z. Zhou, A. D. Cheok, J. Tedjokusumo, and G. S. Omer. wizqubestm--a novel tangible interface for interactive storytelling in mixed reality. Int J Virtual Real, 7(4):9--15, 2008.","paperID":"None"}],"abstract":"We present \"FingAR Puppet\", an Augmented Reality (AR) system enhancing social pretend play by young children. Unlike goal-oriented AR systems that augment reality with informative instructions, FingAR Puppet helps children associate expressive interpretations with immediate reality. Empirical results show that FingAR Puppet promotes reasoning about emotional states, communication and divergent thinking during social pretend play for children 4-6 years old. We suggest that this study opens an interesting space for future AR systems to support complex cognitive and social development in early childhood. We also identify broader implications from using theories of cognitive development to guide the design of tangible and augmented interactions.","title":"Exploring Expressive Augmented Reality: The FingAR Puppet System for Social Pretend Play","filename":"CHI15/p1035","authors":["Zhen Bai","Alan F. Blackwell","George Coulouris"],"conference":"CHI '15"}