{"paperId":2702368,"citation":[],"abstract":"The ubiquity of mobile devices has resulted in more opportunities to interact with more people than ever before. Given a finite capacity for interaction with others, people commonly manage their availability by limiting others' access to them. Prior work has demonstrated the importance of doing so in a relationally sensitive way and identified the butler lie, in which deception is used to manage availability, as a common linguistic strategy. Two key limitations of existing exploratory work, however, are limited samples of primarily students and a focus on media properties in understanding ambiguity that enables butler lies to be plausible. This paper aims to address these issues via a broad field study of deception and butler lies using a novel message-sampling method employed via a custom mobile app. Results show clear evidence of butler lies occurring in a broader population, with some gender differences; and urge adoption of a multi-level framework for understanding ambiguity that also includes private information and infrastructure-level attributes of interaction media.","reference":[{"content":"Aoki, P. & Woodruff, A. Making spaces for stories: Ambiguity in the design of personal communication. Proc. ACM CHI (2005), 181--190.","paperID":"None"},{"content":"Birnholtz, J., Reynolds, L., Smith, M. & Hancock, J. (2013). \"Everyone has to do it:\" A join action approach to managing social inattention. Computers in Human Behavior, 29, 2230--2238.","paperID":"None"},{"content":"Birnholtz, J., Guillory, J., Hancock, J., & Bazarova, N. \"on my way\": Deceptive texting and interpersonal awareness narratives. Proc. ACM CSCW (2010), 1--4.","paperID":"None"},{"content":"DePaulo, B., Kashy, D., Kirkendol, S., Wyer, & Epstein, J. (1996). Lying in everyday life. Journal of Personality and Social Psychology, 70, 979--995.","paperID":"None"},{"content":"Hancock, J., Thom-Santelli, J., & Ritchie, T. Deception and design: The impact of communication technology on lying behavior. Proc. ACM CHI (2004), 129--134.","paperID":"None"},{"content":"Harper, R. & Taylor, S. Glancephone -- an exploration of human expression. Proc. ACM MobileHCI (2009), 24--32.","paperID":"None"},{"content":"Ling, R. (2004). The Mobile Connection: The Cell Phone's Impact on Society. San Francisco: Morgan Kaufmann.","paperID":"None"},{"content":"Reynolds, L. Smith, M, Birnholtz, J., & Hancock, J. Butler lies from both sides: Actions and perception of unavailability management in texting. Proc. ACM CSCW (2013), 769--778.","paperID":"None"},{"content":"Zickuhr, K., & Smith, A. (2012). Digital differences. Pew Internet & American Life Project, 13.","paperID":"None"}],"title":"Is This How We (All) Do It?: Butler Lies and Ambiguity Through a Broader Lens","filename":"CHI15/p4079","authors":["Megan French","Madeline E. Smith","Jeremy Birnholtz","Jeff T. Hancock"],"conference":"CHI '15"}