{"paperId":"2702124","reference":[{"content":"Asiimwe, C., Gelvin, D., Lee, E., Amor, Y. B., Quinto, E., Katureebe, C., Sundaram, L., Bell, D., and Berg, M. Use of an Innovative, Affordable, and Open-Source Short Message ServiceBased Tool to Monitor Malaria in Remote Areas of Uganda. American Journal of Tropical Medicine and Hygiene 85 (2011), 26--33.","paperID":"None"},{"content":"Barrington, J., Wereko-Brobby, O., Ward, P., Mwafongo, W., and Kungulwe, S. SMS for Life: a pilot project to improve anti-malarial drug supply management in rural Tanzania using standard technology. Malaria Journal 9 (2010), 298.","paperID":"None"},{"content":"Carrington, V. Texting: the end of civilization (again)? Cambridge Journal of Education 35, 2 (2005), 161--175.","paperID":"None"},{"content":"Crandall, A. Kenyan Farmers Use of Cell Phones: Calling Preferred over SMS. In Mobile Communication for Development (M4D) (2012).","paperID":"None"},{"content":"Danis, C. M., Ellis, J. B., Kellogg, W. A., van Beijma, H., Hoefman, B., Daniels, S. D., and Loggers, J.-W. Mobile phones for health education in the developing world: SMS as a user interface. In ACM Symposium on Computing for Development (2010), 13:1--13:9.","paperID":"None"},{"content":"Densmore, M. Experiences with Bulk SMS for Health Financing in Uganda. In Extended Abstracts on Human Factors in Computing Systems (2012), 383--398.","paperID":"None"},{"content":"DeRenzi, B., Findlater, L., Payne, J., Birnbaum, B., Mangilima, J., Parikh, T., Borriello, G., and Lesh, N. Improving community health worker performance through automated SMS. In Information and Communication Technologies and Development (2012), 25--34.","paperID":"None"},{"content":"Frias-Martinez, V., and Virseda, J. On the relationship between socio-economic factors and cell phone usage. In Information and Communication Technologies and Development (2012), 76--84.","paperID":"None"},{"content":"Hellström, J., and Karefelt, A. Participation Through Mobile Phones: A Study of SMS Use During the Ugandan General Elections 2011. In Information and Communication Technologies and Development (2012), 249--258.","paperID":"None"},{"content":"Johnson, T., , and Parsons, J. Interviewer effects on self-reported substance use among homeless persons. Addict Behavior 19 (1994).","paperID":"None"},{"content":"Joshi, A. Mobile Phones and Economic Sustainability: Perspectives from India. In The First International Conference on Expressive Interactions for Sustainability and Empowerment (2009).","paperID":"None"},{"content":"Kechiche, B. Leveraging SMS to Attract the Low End of the Income Scale. Africa and Middle East Telecom Insider 1, 2 (2009).","paperID":"None"},{"content":"Kunutsor, S., Walley, J., Katabira, E., Muchuro, S., Balidawa, H., Namagala, E., and Ikoona, E. Using mobile phones to improve clinic attendance amongst an antiretroviral treatment cohort in rural Uganda. AIDS and behavior 14, 6 (2010), 1347--1352.","paperID":"None"},{"content":"Lester, P., Ritvo, P., Mills, E., Kariri, A., Karanja, S., Chung, M., Jack, W., Habyarimana, J., Sadatsafavi, M., Najafzadeh, M., Marra, C., Estambale, B., Ngugi, E., Ball, T., Thabane, L., Gelmon, L., Kimani, J., Ackers, M., and Plummer, F. Effects of a mobile phone short message service on antiretroviral treatment adherence in Kenya (WelTel Kenya1): a randomised trial. The Lancet 376 (2010), 1838--1845.","paperID":"None"},{"content":"Mbuagbaw, L., Thabane, L., Ongolo-Zogo, P., Lester, R., Mills, E., Volmink, J., Yondo, D., Essi, M., Bonono-Momnougui, R., Mba, R., Ndongo, J., N. F., and Ondoa, H. The cameroon mobile phone sms (CAMPS) trial. Trials 12, 1 (2011).","paperID":"None"},{"content":"Ngabo, F., Nguimfack, J., Nwaigwe, F., Mugeni, C., Muhoza, D., Wilson, D., Kalach, J., Gakuba, R., Karema, C., and Binagwaho, A. Designing and implementing an innovative SMS-based alert system to monitor pregnancy and reduce maternal and child deaths in Rwanda. Pan African Medical Journal 13, 31 (2012).","paperID":"None"},{"content":"Okolloh, O. Ushahidi or 'testimony': Web 2.0 tools for crowdsourcing crisis information. Participatory Learning and Action 59 (2009), 65--70.","paperID":"None"},{"content":"Ouma, P., van Eijk, A., Hamel, M., Sikuku, E., Odhiambo, F., Munguti, K., Ayisi, J., Crawford, S., Kager, P., and Slutsker, L. Research antenatal and delivery care in rural western kenya: the effect of training health care workers to provide focused antenatal care. Reproductive Health 7, 1 (2010).","paperID":"None"},{"content":"Patnaik, S., Brunskill, E., and Thies, W. Evaluating the accuracy of data collection on mobile phones: forms, SMS, and voice. In Information and Communication Technologies and Development (2009).","paperID":"None"},{"content":"Prahalad, C., and Fruehauf, H. The Fortune at the Bottom of the Pyramid. Wharton School Publishing, 2004.","paperID":"None"},{"content":"Ravallion, M. How long will it take to lift one billion people out of poverty? The World Bank Research Observer 28, 2 (2013), 139--158.","paperID":"None"},{"content":"van der Kop, M. L., Karanja, S., Thabane, L., Marra, C., Chung, M. H., Gelmon, L., Kimani, J., and Lester, R. T. In-Depth Analysis of Patient-Clinician Cell Phone Communication during the WelTel Kenya1 Antiretroviral Adherence Trial. PLoS ONE 7, 9, pp. 1932--6203.","paperID":"None"},{"content":"Veeraraghavan, R., Yasodhar, N., and Toyama, K. Warana Unwired. In Information and Communication Technologies and Development (2007), 1--10.","paperID":"None"}],"abstract":"A growing body of HCI4D research studies the use of SMS communication to deliver health and information services to underserved populations. This paper contributes a novel dimension to this field of study by examining if a hybrid computer-human SMS system can engage pregnant women in Kenya in health-related communication. Our approach leverages the different strengths of both the computer and the human. The computer automates the bulk-sending of personalized messages to patients, allowing the human to read patients' replies and respond to those in need of attention. Findings from a 12-month deployment with 100 women show that our approach is capable of engaging the majority of participants in health-related conversations. We show that receiving messages from the system triggers participant communication and the amount of communication increases as participants approach their expected due date. In addition, analysis of participants' messages shows that they often contain sensitive health information conveyed through a complex mixture of languages and 'txting' abbreviations, all of which highlight the benefits of including a human in the workflow. Our findings are relevant for HCI researchers and practitioners interested in understanding or engaging underserved populations.","citation":[{"content":"Trevor Perrier , Brian DeRenzi , Richard Anderson, USSD: The Third Universal App, Proceedings of the 2015 Annual Symposium on Computing for Development, December 01-02, 2015, London, United Kingdom","paperID":"2830645"},{"content":"Susan Wyche, Exploring mobile phone and social media use in a Nairobi slum: a case for alternative approaches to design in ICTD, Proceedings of the Seventh International Conference on Information and Communication Technologies and Development, May 15-18, 2015, Singapore, Singapore","paperID":"2738019"}],"title":"Engaging Pregnant Women in Kenya with a Hybrid Computer-Human SMS Communication System","filename":"CHI15/p1429","authors":["Trevor Perrier","Nicola Dell","Brian DeRenzi","Richard Anderson","John Kinuthia","Jennifer Unger","Grace John-Stewart"],"conference":"CHI '15"}