{"paperId":2702437,"abstract":"Blind people often seek answers to their visual questions from remote sources, however, the commonly adopted single-image, single-response model does not always guarantee enough bandwidth between users and sources. This is especially true when questions concern large sets of information, or spatial layout, e.g., where is there to sit in this area, what tools are on this work bench, or what do the buttons on this machine do? Our RegionSpeak system addresses this problem by providing an accessible way for blind users to (i) combine visual information across multiple photographs via image stitching, em (ii) quickly collect labels from the crowd for all relevant objects contained within the resulting large visual area in parallel, and (iii) then interactively explore the spatial layout of the objects that were labeled. The regions and descriptions are displayed on an accessible touchscreen interface, which allow blind users to interactively explore their spatial layout. We demonstrate that workers from Amazon Mechanical Turk are able to quickly and accurately identify relevant regions, and that asking them to describe only one region at a time results in more comprehensive descriptions of complex images. RegionSpeak can be used to explore the spatial layout of the regions identified. It also demonstrates broad potential for helping blind users to answer difficult spatial layout questions.","citation":[{"content":"Anhong Guo , Xiang 'Anthony' Chen , Jeffrey P. Bigham, ApplianceReader: A Wearable, Crowdsourced, Vision-based System to Make Appliances Accessible, Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, April 18-23, 2015, Seoul, Republic of Korea","paperID":"2732755"},{"content":"Giovanni Fusco , Valerie S. Morash, The Tactile Graphics Helper: Providing Audio Clarification for Tactile Graphics Using Machine Vision, Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, October 26-28, 2015, Lisbon, Portugal","paperID":"2809868"},{"content":"Violeta Voykinska , Shiri Azenkot , Shaomei Wu , Gilly Leshed, How Blind People Interact with Visual Content on Social Networking Services, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820013"}],"reference":[{"content":"Azenkot, S., Prasain, S., Borning, A., Fortuna, E., Ladner, R. E., and Wobbrock, J. O. Enhancing independence and safety for blind and deaf-blind public transit riders. CHI 2011.","paperID":"None"},{"content":"Bernstein, M. S., Little, G., Miller, R. C., Hartmann, B., Ackerman, M. S., Karger, D. R., Crowell D., and Panovich, K. Soylent: A word processor with a crowd inside. UIST 2010.","paperID":"None"},{"content":"Bigham, J. P., Jayant, C., Ji, H., Little, G., Miller, A., Miller, R. C., Miller, R., Tatarowicz, A., White, B., White, S., and Yeh, T. Vizwiz: Nearly real-time answers to visual questions. UIST 2010.","paperID":"None"},{"content":"Bigham, J. P., Jayant, C., Miller, A., White, B., and Yeh, T. Vizwiz:: Locateit-enabling blind people to locate objects in their environment. CVPR 2010.","paperID":"None"},{"content":"Bigham, J. P., Ladner, R. E., and Borodin, Y. The Design of Human-Powered Access Technology. ASSETS 2011.","paperID":"None"},{"content":"Brady, E., Morris, M. R., Zhong, Y., White, S., and Bigham, J. P. Visual challenges in the everyday lives of blind people. CHI 2013.","paperID":"None"},{"content":"Brown, M. and Lowe, D. G. Automatic panoramic image stitching using invariant features. In International Journal of Computer Vision, pages 59--73, 2007.","paperID":"None"},{"content":"Jayant, C., Ji, H., White, S., and Bigham, J. P. Supporting blind photography. ASSETS 2011.","paperID":"None"},{"content":"Kalal, Z., Mikolajczyk, K., and Matas, J. Tracking-learning-detection. In IEEE Trans. on Pattern Anal. & Machine Intelligence 34.7, p. 1409--1422, '12.","paperID":"None"},{"content":"Kane, S. K., Frey, B., and Wobbrock, J. O. Access lens: a gesture-based screen reader for real-world documents. CHI 2013.","paperID":"None"},{"content":"Kane, S. K., Bigham, J. P., and Wobbrock, J. O. Slide rule: Making mobile touch screens accessible to blind people using multi-touch interaction techniques. ASSETS 2008.","paperID":"None"},{"content":"Kane, S. K., Morris, M. R., Perkins, A. Z., Wigdor, D., Ladner, R. E., and Wobbrock, J. O. Access overlays: Improving non-visual access to large touch screens for blind users. UIST 2011.","paperID":"None"},{"content":"Kotaro, H., Le, V., and Froehlich, J. Combining crowdsourcing and google street view to identify street-level accessibility problems. CHI 2013.","paperID":"None"},{"content":"Lasecki, W.S., Gordon, M., Koutra, D., Jung, M.F., Dow, S.P., and Bigham, J. P. Glance: Rapidly coding behavioral video with the crowd. UIST 2014.","paperID":"None"},{"content":"Lasecki, W. S., Miller, C. D., Sadilek, A., Abumoussa, A., Kushalnagar, R. and Bigham, J. P. Real-time Captioning by Groups of Non-Experts. UIST 2012.","paperID":"None"},{"content":"Lasecki, W. S., Thiha, P., Zhong, Y., Brady, E., and Bigham, J. P. Answering visual questions with conversational crowd assistants. ASSETS 2013.","paperID":"None"},{"content":"Martin, D., Hanrahan, B. V., O'Neill, J., and Gupta, N.. Being a turker. CSCW 2014.","paperID":"None"},{"content":"Russell, B. C., Torralba, A., Murphy, K. P., and Freeman, W. T. Labelme: A database and web-based tool for image annotation. Int. J. Comput. Vision, 77(1-3):157--173, May 2008.","paperID":"None"},{"content":"Shum, H., Szeliski, R. Systems and experiment paper: Construction of panoramic image mosaics with global and local alignment. Int. J. of Comput. Vision 36.2, 2000.","paperID":"None"},{"content":"Song, D. and Goldberg, K. Sharecam part i: Interface, system architecture, and implementation of a collaboratively controlled robotic webcam, 2003.","paperID":"None"},{"content":"Uyttendaele, M., Eden, A., Szeliski, R. Eliminating ghosting and exposure artifacts in image mosaics. CVPR '01.","paperID":"None"},{"content":"Vázquez, M. and Steinfeld, A. Helping visually impaired users properly aim a camera. ASSETS 2012.","paperID":"None"},{"content":"Von Ahn, L. and Dabbish, L. Labeling images with a computer game. CHI 2004.","paperID":"None"},{"content":"Zhong, Y., Garrigues, P. J., and Bigham, J. P. Real time object scanning using a mobile phone and cloud-based visual search engine. ASSETS 2013.","paperID":"None"}],"title":"RegionSpeak: Quick Comprehensive Spatial Descriptions of Complex Images for Blind Users","filename":"CHI15/p2353","authors":["Yu Zhong","Walter S. Lasecki","Erin Brady","Jeffrey P. Bigham"],"conference":"CHI '15"}