{"paperId":2702404,"abstract":"The aim of this research was to understand what affects people's privacy preferences in smartphone apps. We ran a four-week study in the wild with 34 participants. Participants were asked to answer questions, which were used to gather their personal context and to measure their privacy preferences by varying app name and purpose of data collection. Our results show that participants shared the most when no information about data access or purpose was given, and shared the least when both of these details were specified. When just one of either purpose or the requesting app was shown, participants shared less when just the purpose was specified than when just the app name was given. We found that the purpose for data access was the predominant factor affecting users' choices. In our study the purpose condition vary from being not specified, to vague to be very specific. Participants were more willing to disclose data when no purpose was specified. When a vague purpose was shown, participants became more privacy-aware and were less willing to disclose their information. When specific purposes were shown participants were more willing to disclose when the purpose for requesting the information appeared to be beneficial to them, and shared the least when the purpose for data access was solely beneficial to developers.","citation":[{"content":"Amy X. Zhang , Joshua Blum , David R. Karger, Opportunities and Challenges Around a Tool for Social and Public Web Activity Tracking, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819949"},{"content":"Haoyu Wang , Jason Hong , Yao Guo, Using text mining to infer the purpose of permission use in mobile apps, Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, September 07-11, 2015, Osaka, Japan","paperID":"2805833"}],"reference":[{"content":"Abdesslem, F. B., Parris, I., and Henderson, T. Mobile experience sampling: Reaching the parts of facebook other methods cannot reach. In In Privacy and Usability Methods Powwow (2010).","paperID":"None"},{"content":"Acquisti, A., and Grossklags, J. Privacy and rationality in individual decision making. Security Privacy, IEEE (2005), 26--33.","paperID":"None"},{"content":"Acquisti, A., and Grossklags, J. When 25 cents is too much: An experiment on willingness-to-sell and willingness-to-protect personal information. In WEIS (2007), 12.","paperID":"None"},{"content":"Aharony, N., Pan, W., Ip, C., Khayal, I., and Pentland, A. Social fmri: Investigating and shaping social mechanisms in the real world. Pervasive and Mobile Computing 7, 6 (2011), 643--659.","paperID":"None"},{"content":"Ahern, S., Eckles, D., Good, N. S., King, S., Naaman, M., and Nair, R. Over-exposed: privacy patterns and considerations in online and mobile photo sharing. In Proc. ACM CHI (2007), 357--366.","paperID":"None"},{"content":"Balebako, R., Jung, J., Lu, W., Cranor, L. F., and Nguyen, C. \"Little Brothers Watching You\": Raising Awareness of Data Leaks on Smartphones. In Proc. of ACM SOUPS (2013), 12.","paperID":"None"},{"content":"Bansal, G., Zahedi, F., Gefen, D., et al. The impact of personal dispositions on information sensitivity, privacy concern and trust in disclosing health information online. Decision Support Systems 49, 2 (2010), 138--150.","paperID":"None"},{"content":"Cherubini, M., and Oliver, N. A refined experience sampling method to capture mobile user experience. Proc. of ACM CHI Workshop of Mobile User Experience Research (2009), 1--6.","paperID":"None"},{"content":"Consolvo, S., Smith, I. E., Matthews, T., LaMarca, A., Tabert, J., and Powledge, P. Location disclosure to social relations: why, when, & what people want to share. In Proc. ACM CHI (2005), 81--90.","paperID":"None"},{"content":"Enck, W., Gilbert, P., Chun, B.-G., Cox, L. P., Jung, J., McDaniel, P., and Sheth, A. N. Taintdroid: An information-flow tracking system for realtime privacy monitoring on smartphones. In Proc. OSDI'10 (2010), 99--106.","paperID":"None"},{"content":"Felt, A. P., Ha, E., Egelman, S., Haney, A., Chin, E., and Wagner, D. Android permissions: User attention, comprehension, and behavior. In Proc. ACM SOUP (2012), 3.","paperID":"None"},{"content":"Hann, I.-H., Hui, K.-L., Lee, T., and Png, I. Online information privacy: Measuring the cost-benefit trade-off. Proc. of ICIS (2002), 1.","paperID":"None"},{"content":"Hurwitz, J. User choice, privacy sensitivity, and acceptance of personal information collection. In European Data Protection: Coming of Age, S. Gutwirth, R. Leenes, P. de Hert, and Y. Poullet, Eds. Springer Netherlands, 2013, 295--312.","paperID":"None"},{"content":"Joinson, A. N., Reips, U.-D., Buchanan, T., and Schofield, C. B. P. Privacy, trust, and self-disclosure online. Human-Computer Interaction (2010), 1--24.","paperID":"None"},{"content":"Kelley, P. G., Cesca, L., Bresee, J., and Cranor, L. F. Standardizing privacy notices: an online study of the nutrition label approach. In Proc. of ACM CHI (2010), 1573--1582.","paperID":"None"},{"content":"Kelley, P. G., Cranor, L. F., and Sadeh, N. Privacy as part of the app decision-making process. In Proc. ACM CHI (2013), 3393--3402.","paperID":"None"},{"content":"Khalil, A., and Connelly, K. Context-aware telephony: privacy preferences and sharing patterns. In Proc. ACM CSCW (2006), 469--478.","paperID":"None"},{"content":"Knijnenburg, B. P., and Kobsa, A. Helping users with information disclosure decisions: Potential for adaptation. In Proc. ACM IUI (2013), 407--416.","paperID":"None"},{"content":"Knijnenburg, B. P., and Kobsa, A. Making decisions about privacy: information disclosure in context-aware recommender systems. ACM Transactions on Interactive Intelligent Systems (TiiS) 3, 3 (2013), 20.","paperID":"None"},{"content":"Langer, E. Minding matters. In L. Berkowitz (Ed.), Advances in experimental social psychology (Vol. 22). New York, Academic Press. (1989).","paperID":"None"},{"content":"Lathia, N., Rachuri, K. K., Mascolo, C., and Rentfrow, P. J. Contextual dissonance: Design bias in sensor-based experience sampling methods. In Proc. of ACM UBICOMP (2013), 183--192.","paperID":"None"},{"content":"Liccardi, I., Pato, J., and Weitzner, D. J. Improving Mobile App selection through Transparency and Better Permission Analysis. Journal of Privacy and Confidentiality: Vol. 5: Iss. 2, Article 1. (2014), 1--55.","paperID":"None"},{"content":"Liccardi, I., Pato, J., Weitzner, D. J., Abelson, H., and De Roure, D. No technical understanding required: Helping users make informed choices about access to their personal data. In Proc. ACM Mobiquitous (2014), 140--150.","paperID":"None"},{"content":"Lin, J., Amini, S., Hong, J. I., Sadeh, N., Lindqvist, J., and Zhang, J. Expectation and purpose: understanding users' mental models of mobile app privacy through crowdsourcing. In Proc. of ACM UBICOMP (2012), 501--510.","paperID":"None"},{"content":"Mancini, C., Thomas, K., Rogers, Y., Price, B. A., Jedrzejczyk, L., Bandara, A. K., Joinson, A. N., and Nuseibeh, B. From spaces to places: emerging contexts in mobile privacy. In Proc. ACM UBICOMP (2009), 1--10.","paperID":"None"},{"content":"Nissenbaum, H. Privacy as Contextual Integrity. Washington Law Review 79 (2004), 119.","paperID":"None"},{"content":"Park, Y. J., and Jang, S. M. Understanding privacy knowledge and skill in mobile communication. Computers in Human Behavior 38 (2014), 296--303.","paperID":"None"},{"content":"Shilton, K., and Martin, K. E. Mobile privacy expectations in context. In Proc. of Communication, Information and Internet Policy (2013).","paperID":"None"},{"content":"Shklovski, I., Mainwaring, S. D., Skúladóttir, H. H., and Borgthorsson, H. Leakiness and creepiness in app space: Perceptions of privacy and mobile app use. In Proc. ACM CHI (2014), 2347--2356.","paperID":"None"},{"content":"Tan, J., Nguyen, K., Theodorides, M., Negrón-Arroyo, H., Thompson, C., Egelman, S., and Wagner, D. The effect of developer-specified explanations for permission requests on smartphone user behavior. In Proc. ACM CHI (2014), 91--100.","paperID":"None"},{"content":"Toch, E. Crowdsourcing privacy preferences in context-aware applications. Personal and Ubiquitous Computing (2014), 129--141.","paperID":"None"},{"content":"Toch, E., Cranshaw, J., Drielsma, P. H., Tsai, J. Y., Kelley, P. G., Springfield, J., Cranor, L., Hong, J., and Sadeh, N. Empirical models of privacy in location sharing. In Proc. ACM UBICOMP (2010), 129--138.","paperID":"None"},{"content":"Urban, J., Hoofnagle, C., and Li, S. Mobile phones and privacy. In UC Berkeley Public Law Research Paper (2012).","paperID":"None"},{"content":"Venkatanathan, J., Ferreira, D., Benisch, M., Lin, J., Karapanos, E., Kostakos, V., Sadeh, N., and Toch, E. Improving users' consistency when recalling location sharing preferences. In Proc, of INTERACT (Springer). 2011, 380--387.","paperID":"None"},{"content":"White House. Consumer data privacy in a networked world: A framework for protecting privacy and promoting innovation in the global digital economy. 15--19.","paperID":"None"},{"content":"White House. Big data and privacy: A technological perspective. 40--41.","paperID":"None"},{"content":"World Economic Forum. Unlocking the value of personal data: From collection to usage.","paperID":"None"},{"content":"Xie, J., Knijnenburg, B. P., and Jin, H. Location sharing privacy preference: Analysis and personalized recommendation. In Proc. IUI '14, IUI '14 (2014), 189--198.","paperID":"None"}],"title":"Privacy Tipping Points in Smartphones Privacy Preferences","filename":"CHI15/p807","authors":["Fuming Shih","Ilaria Liccardi","Daniel Weitzner"],"conference":"CHI '15"}