{"paperId":2702226,"citation":[{"content":"Yoonsik Yang , Seungho Chae , Jinwook Shim , Tack-Don Han, EMG Sensor-based Two-Hand Smart Watch Interaction, Adjunct Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2815724"}],"reference":[{"content":"Ashbrook, D. Lyons, K. and Starner, T. 2008. An investigation into round touchscreen wristwatch interaction. In MobileHCI '08, 311--314.","paperID":"None"},{"content":"Blasko, G. and Feiner, S. 2004. An Interaction System for Watch Computers Using Tactile Guidance and Bidirectional Segmented Strokes. Proc. ISWC'04. IEEE.","paperID":"None"},{"content":"Brewster, S., Lumsden, J., Bell, M., Hall, M., and Tasker, S. 2003. Multimodal 'eyes-free' interaction techniques for wearable devices. In CHI '03. 473--480.","paperID":"None"},{"content":"Chen, X., Grossman, T., Wigdor, D.J., and Fitzmaurice, G. 2014. Duet: exploring joint interactions on a smart phone and a smart watch. In Proceedings of CHI '14.","paperID":"None"},{"content":"Ghomi, E., Faure G., Huot, S., Chapuis, O., and Beaudouin-Lafon, M. 2012. Using rhythmic patterns as an input method. In Procs of CHI '12. 1253--1262.","paperID":"None"},{"content":"Harrison, C. and Hudson, S.E. 2009. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In Proc. UIST '09. 121--124.","paperID":"None"},{"content":"Harrison C., Schwarz, J., and Hudson, S.E. 2011. TapSense: enhancing finger interaction on touch surfaces. In Proceedings of UIST '11, 627--636.","paperID":"None"},{"content":"Heo, S. and Lee, G. 2013. Indirect shear force estimation for multi-point shear force operations. In Proceedings of CHI '13. 281--284.","paperID":"None"},{"content":"Heo, S., Gu, J., and Lee, G. 2014. Expanding touch input vocabulary by using consecutive distant taps. In Proceedings CHI '14. 2597--2606.","paperID":"None"},{"content":"Hoggan, E., Nacenta, M., Kristensson, P.O., Williamson, J., Oulasvirta, A., and Lehtiö, A. 2013. Multi-touch pinch gestures. In Procs ITS '13. 219--222.","paperID":"None"},{"content":"Kratz, S. and Rohs, M. 2009. HoverFlow: expanding the design space of around-device interaction. In Proceedings of MobileHCI '09.","paperID":"None"},{"content":"Norman, D.A. 2010. Natural user interfaces are not natural. interactions 17, 3 (May 2010), 6--10.","paperID":"None"},{"content":"Oakley, I. and Lee, D. 2014. Interaction on the edge: offset sensing for small devices. In Proceedings CHI '14. ACM, New York, NY, USA, 169--178.","paperID":"None"},{"content":"Pedersen, E.W. and Hornbæk, K. 2014. Expressive touch: studying tapping force on tabletops. In Proceedings of CHI '14. 421--430.","paperID":"None"},{"content":"Perrault, S.T., Lecolinet, E., Eagan, J., and Guiard, Y. 2013. Watchit: simple gestures and eyes-free interaction for wristwatches and bracelets. In Procs. of CHI '13.","paperID":"None"},{"content":"Serrano, M., Lecolinet, E., and Guiard, Y. 2013. BezelTap gestures: quick activation of commands from sleep mode on tablets. In Proceedings of CHI '13. 3027--3036.","paperID":"None"},{"content":"Siek, K.A., Rogers, Y., and Connelly, K.H. Fat Finger Worries: How Older and Younger Users Physically Interact with PDAs. In Proc. INTERACT'05, 267--280.","paperID":"None"},{"content":"Vogel, D. & Baudisch, P. Shift: A Technique for Operating Pen-Based Interfaces Using Touch. In Proc. CHI'07, pp. 657--666.","paperID":"None"},{"content":"Xiao, R., Laput, G. and Harrison, C. 2014. Expanding the input expressivity of smartwatches with mechanical pan, twist, tilt and click. In Procs. of CHI '14. 193--196.","paperID":"None"}],"abstract":"Interacting with smartwatches poses new challenges. Although capable of displaying complex content, their extremely small screens poorly match many of the touchscreen interaction techniques dominant on larger mobile devices. Addressing this problem, this paper presents beating gestures, a novel form of input based on pairs of simultaneous or rapidly sequential and overlapping screen taps made by the index and middle finger of one hand. Distinguished simply by their temporal sequence and relative left/right position these gestures are designed explicitly for the very small screens (approx. 40mm square) of smartwatches and to operate without interfering with regular single touch input. This paper presents the design of beating gestures and a rigorous empirical study that characterizes how users perform them -- in a mean of 355ms and with an error rate of 5.5%. We also derive thresholds for reliably distinguishing between simultaneous (under 30ms) and sequential (under 400ms) pairs of screen touches or releases. We then present five interface designs and evaluate them in a qualitative study in which users report valuing the speed and ready availability of beating gestures.","title":"Beats: Tapping Gestures for Smart Watches","filename":"CHI15/p1237","authors":["Ian Oakley","DoYoung Lee","MD. Rasel Islam","Augusto Esteves"],"conference":"CHI '15"}