{"paperId":2702606,"citation":[],"abstract":"In this paper the role of game performance as an assessment tool is explored and an approach is presented for designing and assessing learning-centered game scores. In recent years, attention has shifted from focusing on games for learning to games for assessment. The research question this paper tries to address is how valid games are as an assessment tool, and more specifically, how valid the use of game scores are as a measure of assessment. To explore this use, we looked at the role of game performance in a game where the goals were designed based on its learning objectives. We hypothesized that because of this design the scores could be used as a measure of learning. The results of our mixed-methods study confirmed this hypothesis. However, the scores are influenced by factors such as computer skills and age. Further analysis revealed that the design of the game and the game-based training were also of influence. These insights will help in designing better predictive game scores in the future.","reference":[{"content":"Anguera, J., Boccanfuso, J., Rintoul, J., Al-Hashimi, O., Faraji, F., Janowich, J., Kong, E., Larraburo, Y., Rolle, C., Johnston, E., and others. Video game training enhances cognitive control in older adults. Nature 501, 7465 (2013), 97--101.","paperID":"None"},{"content":"Baron, R. M., and Kenny, D. A. The moderator-mediator variable distinction in social psychological research: Conceptual, strategic, and statistical considerations. Journal of Personality and Social Psychology 51 (1986), 1173--1182.","paperID":"None"},{"content":"Brennan, K., and Resnick, M. New frameworks for studying and assessing the development of computational thinking. In Proceedings of AERA (Vancouver, Canada, 2012).","paperID":"None"},{"content":"Brown, K. G., Sitzmann, T., and Bauer, K. N. Self-assessment one more time: With gratitude and an eye toward the future. Academy of Management Learning & Education 9, 2 (2010), 348--352.","paperID":"None"},{"content":"Cohen, J. Statistical Power Analysis for the Behavioral Sciences, 2 ed. Lawrence Erlbaum, Hillsdale, NJ, 1988.","paperID":"None"},{"content":"Fishman, B. J., and Deterding, S. C. Beyond badges & points: Gameful assessment systems for engagement in formal education. In Proceedings of Games+Learning+Society (Madison, WI, 2013).","paperID":"None"},{"content":"Harteveld, C. Triadic game design: Balancing reality, meaning and play. Springer, London, United Kingdom, 2011.","paperID":"None"},{"content":"Harteveld, C. Making sense of virtual risks: A quasi-experimental investigation into game-based training. IOS Press, Amsterdam, the Netherlands, 2012.","paperID":"None"},{"content":"IJsselsteijn, W., Nap, H. H., de Kort, Y., and Poels, K. Digital game design for elderly users. In Proceedings of the 2007 conference on Future Play, Future Play '07, ACM (New York, NY, USA, 2007), 17--22.","paperID":"None"},{"content":"Iten, N., and Petko, D. Learning with serious games: Is fun playing the game a predictor of learning success? British Journal of Educational Technology (2014).","paperID":"None"},{"content":"Kapp, K. M. The gamification of learning and instruction: game-based methods and strategies for training and education. John Wiley & Sons, 2012.","paperID":"None"},{"content":"Mayo, M. J. Games for science and engineering education. Communications of the ACM 50, 7 (2007), 30--35.","paperID":"None"},{"content":"Meister, J., Ed. Pillars of e-learning success. Corporate University Exchange, New York, NY, 2002.","paperID":"None"},{"content":"Mislevy, R., Oranje, A., Bauer, M., Davier, V., Hao, J., Corrigan, S., Hoffman, E., DiCerbo, K., and John, M. Psychometric considerations in game-based assessment. GlassLab Report (2014).","paperID":"None"},{"content":"Mislevy, R. J. Evidence and inference in educational assessment. Psychometrika 59, 4 (1994), 439--483.","paperID":"None"},{"content":"Nicholson, S. A user-centered theoretical framework for meaningful gamification. In Proceedings of Games+Learning+Society (Madison, WI, 2012).","paperID":"None"},{"content":"Prensky, M. Digital Game-Based Learning. McGraw-Hill, New York, NY, 2001.","paperID":"None"},{"content":"Ryan, R. M., and Deci, E. L. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American psychologist 55, 1 (2000), 68.","paperID":"None"},{"content":"Saldaña, J. The coding manual for qualitative researchers. No. 14. Sage, Thousand Oaks, CA, 2012.","paperID":"None"},{"content":"Seif El-Nasr, M., Drachen, A., and Canossa, A., Eds. Game analytics: Maximizing the Value of Player Data. Springer, London, United Kingdom, 2013.","paperID":"None"},{"content":"Shaffer, D. W., and Gee, J. P. The right kind of GATE: Computer games and the future of assessment. In Technology-based assessments for 21st century skills: Theoretical and practical implications from modern research. Information Age Publishing, Charlotte, NC, 2012.","paperID":"None"},{"content":"Shaffer, D. W., Hatfield, D., Svarovsky, G. N., Nash, P., Nulty, A., Bagley, E., Frank, K., Rupp, A. A., and Mislevy, R. Epistemic network analysis: A prototype for 21st-century assessment of learning. International Journal of Learning and Media 1, 2 (2009), 33--53.","paperID":"None"},{"content":"Shute, V., and Ventura, M. Stealth assessment: Measuring and supporting learning in video games. MIT Press, 2013.","paperID":"None"},{"content":"Shute, V. J. Stealth assessment in computer-based games to support learning. Computer games and instruction 55, 2 (2011), 503--524.","paperID":"None"},{"content":"Sitzmann, T., Ely, K., Brown, K. G., and Bauer, K. N. Self-assessment of knowledge: A cognitive learning or affective measure? Academy of Management Learning & Education 9, 2 (2010), 169--191.","paperID":"None"},{"content":"Takatalo, J., Häkkinen, J., Kaistinen, J., and Nyman, G. User experience in digital games: Differences between laboratory and home. Simulation & Gaming 42, 5 (2011), 656--673.","paperID":"None"},{"content":"Washbush, J., and Gosen, J. An exploration of game-derived learning in total enterprise simulations. Simulation & Gaming 32, 3 (2001), 281--296.","paperID":"None"},{"content":"Zimmerman, B. J. Self-efficacy: An essential motive to learn. Contemporary educational psychology 25, 1 (2000), 82--91.","paperID":"None"}],"title":"The Goal of Scoring: Exploring the Role of Game Performance in Educational Games","filename":"CHI15/p2235","authors":["Casper Harteveld","Steven C. Sutherland"],"conference":"CHI '15"}