{"paperId":2702545,"citation":[{"content":"Renira Rampazzo Gambarato , Sergei Andreevich Medvedev, Fish Fight: Transmedia Storytelling Strategies for Food Policy Change, International Journal of E-Politics, v.6 n.3, p.43-59, July 2015","paperID":"2807015"}],"reference":[{"content":"Bateman, S., Mandryk, R. L., Gutwin, C., Genest, A., McDine, D., and Brooks, C. Useful junk?: the effects of visual embellishment on comprehension and memorability of charts. In Proc. CHI'10 (2010), 2573--2582.","paperID":"None"},{"content":"Bates, D., Maechler, M., and Bolker, B. lme4: Linear mixed-effects models using S4 classes, 2013. R package version 0.999999-2.","paperID":"None"},{"content":"Borkin, M. A., Vo, A. A., Bylinskii, Z., Isola, P., Sunkavalli, S., Oliva, A., and Pfister, H. What makes a visualization memorable? Transactions on Visualization and Computer Graphics 19, 12 (2013), 2306--2315.","paperID":"None"},{"content":"Cawthon, N., and Moere, A. V. The effect of aesthetic on the usability of data visualization. In Proc. Information Visualization'07, IEEE (2007), 637--648.","paperID":"None"},{"content":"Lindgaard, G., Dudek, C., Sen, D., Sumegi, L., and Noonan, P. An Exploration of Relations Between Visual Appeal, Trustworthiness and Perceived Usability of Homepages. ACM ToCHI 18, 1 (2011).","paperID":"None"},{"content":"Lindgaard, G., Fernandes, G., Dudek, C., and Brown, J. Attention Web Designers: You Have 50 Milliseconds to Make a Good First Impression! Behaviour & Information Technology 25, 2 (2006), 115--126.","paperID":"None"},{"content":"Nakagawa, S., and Schielzeth, H. A general and simple method for obtaining R2 from generalized linear mixed-effects models. Methods in Ecology and Evolution 4 (2013), 133--142.","paperID":"None"},{"content":"Reinecke, K., and Gajos, K. Z. Quantifying Visual Preferences Around the World. In Proc. CHI'14 (2014).","paperID":"None"},{"content":"Reinecke, K., Yeh, T., Miratrix, L., Mardiko, R., Zhao, Y., Liu, J., and Gajos, K. Predicting Users' First Impressions of Website Aesthetics With a Quantification of Perceived Visual Complexity and Colorfulness. In Proc. CHI'13 (2013).","paperID":"None"},{"content":"Van Wijk, J. J. The value of visualization. In Visualization, 2005. VIS 05. IEEE, IEEE (2005), 79--86.","paperID":"None"}],"abstract":"Information graphics, or infographics, combine elements of data visualization with design and have become an increasingly popular means for disseminating data. While several studies have suggested that aesthetics in visualization and infographics relate to desirable outcomes like engagement and memorability, it remains unknown how quickly aesthetic impressions are formed, and what it is that makes an infographic appealing. We address these questions by analyzing 1,278 participants' ratings on appeal after seeing infographics for 500ms. Our results establish that: 1) people form a reliable first impression of the appeal of an infographic based on a mere exposure effect, 2) this first impression is largely based on colorfulness and visual complexity, and 3) age, gender, and education level influence the preferred level of colorfulness and complexity. More generally, these findings suggest that outcomes such as engagement and memorability might be determined much earlier than previously thought.","title":"Infographic Aesthetics: Designing for the First Impression","filename":"CHI15/p1187","authors":["Lane Harrison","Katharina Reinecke","Remco Chang"],"conference":"CHI '15"}