{"paperId":2702230,"abstract":"Habit formation is an important part of behavior change interventions: to ensure an intervention has long-term effects, the new behavior has to turn into a habit and become automatic. Smartphone apps could help with this process by supporting habit formation. To better understand how, we conducted a 4-week study exploring the influence of different types of cues and positive reinforcement on habit formation and reviewed the functionality of 115 habit formation apps. We discovered that relying on reminders supported repetition but hindered habit development, while the use of event-based cues led to increased automaticity; positive reinforcement was ineffective. The functionality review revealed that existing apps focus on self-tracking and reminders, and do not support event-based cues. We argue that apps, and technology-based interventions in general, have the potential to provide real habit support, and present design guidelines for interventions that could support habit formation through contextual cues and implementation intentions.","citation":[{"content":"Charlie Pinder, How Can Technology Best Disrupt Bad Health Habits?, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, August 24-27, 2015, Copenhagen, Denmark","paperID":"2786938"},{"content":"Niels van Berkel , Chu Luo , Denzil Ferreira , Jorge Goncalves , Vassilis Kostakos, The curse of quantified-self: an endless quest for answers, Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers, September 07-11, 2015, Osaka, Japan","paperID":"2800946"},{"content":"Charlie Pinder , Jo Vermeulen , Russell Beale , Robert Hendley, Exploring Nonconscious Behaviour Change Interventions on Mobile Devices, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, August 24-27, 2015, Copenhagen, Denmark","paperID":"2794319"}],"reference":[{"content":"Aarts, H., Paulussen, T., and Schaalma, H. Physical exercise habit: on the conceptualization and formation of habitual health behaviours. Health Education Research, 12, 3 (1997), 363--374.","paperID":"None"},{"content":"Bandura, A. Social cognitive theory of self-regulation. Organizational Behavior and Human Decision Processes 50, 2 (1991), 248--287.","paperID":"None"},{"content":"BCT Taxonomy. (2014). Behaviour Change Technique Taxonomy. http://www.bct-taxonomy.com/","paperID":"None"},{"content":"Consolvo, S., Klasnja, P., McDonald, D.W., Avrahami, D., Froehlich, J., LeGrand, L., Landay, J.A. Flowers or a robot army?: Encouraging awareness & activity with personal, mobile displays. In Proc. UbiComp 2008, ACM Press (2008), 54--63.","paperID":"None"},{"content":"Cowan, L.T., Van Wagenen, S.A., Brown, B.A., Hedin, R.J., Seino-Stephan, Y., Hall, P.C., and West, J.H. Apps of steel: are exercise apps providing consumers with realistic expectations? A content analysis of exercise apps for presence of behavior change theory. Health Education & Behavior, 40, 2 (2013), 133--139.","paperID":"None"},{"content":"Dayer, L., Heldenbrand, S., Anderson, P., Gubbins, P. O., & Martin, B. C. Smartphone medication adherence apps: Potential benefits to patients and providers. Journal of the American Pharmacists Association, 53, 2 (2013), 172--181.","paperID":"None"},{"content":"Deci, E.L., Koestner, R., and Ryan, R.M. A meta-analytic review of experiments examining the effects of extrinsic rewards on intrinsic motivation. Psychological Bulletin, 125, 6 (1999), 627--668.","paperID":"None"},{"content":"Dickinson, A. Actions and habits: the development of behavioural autonomy. Philosophical Transactions of the Royal Society of London. B, Biological Sciences, 308, 1135 (1985), 67--78.","paperID":"None"},{"content":"Free, C., Phillips, G., Watson, L., Galli, L., Felix, L., Edwards, P., Haines, A. The effectiveness of mobilehealth technologies to improve health care service delivery processes: a systematic review and meta-analysis. PLoS Medicine, 10, 1 (2013), 1--26.","paperID":"None"},{"content":"Fogg, B. Ways to celebrate tiny successes, retrieved 8/09/2014 from www.slideshare.net/tinyhabits/dr-bjfogg-ways-to-celebrate-tiny-successes","paperID":"None"},{"content":"Gardner, B., Abraham, C., Lally, P., & de Bruijn, G.-J. Towards parsimony in habit measurement: testing the convergent and predictive validity of an automaticity subscale of the Self-Report Habit Index. The International Journal of Behavioral Nutrition and Physical Activity, 9, 1 (2012), 102.","paperID":"None"},{"content":"Gollwitzer, P. Implementation Intentions: Strong Effects of Simple Plans. American Psychologist, 54, 7 (1999), 493--503.","paperID":"None"},{"content":"Guynn, M.J., McDaniel, M.A, & Einstein, G.O. Prospective memory: when reminders fail. Memory & Cognition, 26, 2 (1998), 287--298.","paperID":"None"},{"content":"Klasnja, P., Consolvo, S., and Pratt, W. How to evaluate technologies for health behavior change in HCI research In Proc. CHI 2011, ACM Press (2011), 3063--3072.","paperID":"None"},{"content":"Kopp, J. Self-monitoring: A literature review of research and practice. Social Work Research & Abstracts, 24, (1988), 8--20.","paperID":"None"},{"content":"Lally, P., and Gardner, B. Promoting habit formation. Health Psychology Review, 7, Sup. 1 (2011), 1--22.","paperID":"None"},{"content":"Lally, P., van Jaarsveld, C.H.M., Potts, H.W.W., and Wardle, J. How are habits formed: Modelling habit formation in the real world. European Journal of Social Psychology, 40, 6 (2010), 998--1009.","paperID":"None"},{"content":"Lally, P., Wardle, J., & Gardner, B. Experiences of habit formation: a qualitative study. Psychology, Health & Medicine, 16, 4 (2011), 484--9.","paperID":"None"},{"content":"McLean, VA, Motivating Patients to Use Smartphone Health Apps, PR Web, retrieved on 8/09/2014 from http://prweb.com/releases/2011/04/prweb5268884.htm","paperID":"None"},{"content":"Michie, S., Richardson, M., Johnston, M., Abraham, C., Francis, J., Hardeman, W., . . . Wood, C.E. The behavior change technique taxonomy (v1) of 93 hierarchically clustered techniques: building an international consensus for the reporting of behavior change interventions. Annals of Behavioral Medicine, 46, 1 (2012), 81--95.","paperID":"None"},{"content":"Neal, D.T., Wood, W., Labrecque, J.S., and Lally, P. How do habits guide behavior? Perceived and actual triggers of habits in daily life. Journal of Experimental Social Psychology, 48, 2 (2012), 492--498.","paperID":"None"},{"content":"Nelson, R.O. Assessment and therapeutic functions of self-monitoring. In M. Hersen, R.M. Eisler and P.M. Miller, eds., Progress in behavior modification. Academic Press, New York, 1977.","paperID":"None"},{"content":"Park, D.C., and Kidder, D.P. Prospective memory and medication adherence. In M. Brandimonte, G.O. Einstein, and M.A. McDaniel (Eds.), Prospective memory: Theory and applications. Lawrence Erlbaum Associates (1996), 369--390.","paperID":"None"},{"content":"Pew Internet Research, Mobile Technology Fact Sheet, retrieved on 08/20/2014 from: http://www.pewinternet. org/fact-sheets/mobile-technology-fact-sheet/","paperID":"None"},{"content":"Rooksby, J., Rost, M., Morrison, A., and Chalmers, M. Personal tracking as lived informatics. In Proc. CHI 2014, ACM Press (2014), 1163--1172.","paperID":"None"},{"content":"Rothman, A.J. Toward a theory-based analysis of behavioral maintenance. Health Psychology, 19, 1, Sup. 1 (2000), 64--69.","paperID":"None"},{"content":"Schæfer, E.G. and Laing, M.L. \"Please, remind me\"?: The role of others in prospective remembering. Applied Cognitive Psychology, 14, 7 (2000), S99--S114.","paperID":"None"},{"content":"Shevchik, L. Mobile APPeal: Exploring the Mobile Landscape, New Relic, retrieved on 8/09/2014 from http://blog.newrelic.com/2013/03/13/mobile-appe-alwhy-the-future-is-mobile/","paperID":"None"},{"content":"Stawarz, K., Cox, A., and Blandford, A. Don't forget your pill!: designing effective medication reminder apps that support users' daily routines. In Proc. CHI 2014, ACM Press (2014), 2269--2278.","paperID":"None"},{"content":"Tobias, R. Changing behavior by memory aids: a social psychological model of prospective memory and habit development tested with dynamic field data. Psychological Review, 116, 2 (2009), 408--38.","paperID":"None"},{"content":"Verplanken, B. Habits and implementation intentions. In J. P. D. Kerr, R. Weitkunat, and M. Moretti (Eds.), ABC of Behavior Change: A Guide to Successful Disease Prevention and Health Promotion. Elsevier Science Health Science Division, 2005.","paperID":"None"},{"content":"Verplanken, B., and Orbell, S. Reflections on Past Behavior: A Self-Report Index of Habit Strength. Journal of Applied Social Psychology, 33, 6 (2003), 1313--1330.","paperID":"None"},{"content":"Verplanken, B., and Wood, W. Interventions to Break and Create Consumer Habits. Journal of Public Policy & Marketing, 25, 1 (2006), 90--103.","paperID":"None"},{"content":"West, J.H., Hall, P.C., Hanson, C.L., Barnes, M.D., Giraud-Carrier, C., and Barrett, J. There's an app for that: content analysis of paid health and fitness apps. Journal of Medical Internet Research, 14, 3 (2012), e72.","paperID":"None"},{"content":"Wood, W., and Neal, D.T. A new look at habits and the habit-goal interface. Psychological Review, 114, 4 (2007), 843--63.","paperID":"None"},{"content":"Wood, W., and Neal, D.T. The habitual consumer. Journal of Consumer Psychology, 19, 4 (2009), 579--592.","paperID":"None"}],"title":"Beyond Self-Tracking and Reminders: Designing Smartphone Apps That Support Habit Formation","filename":"CHI15/p2653","authors":["Katarzyna Stawarz","Anna L. Cox","Ann Blandford"],"conference":"CHI '15"}