{"paperId":2702268,"abstract":"Whereas eco-feedback has been widely studied in HCI and environmental psychology, online manual control and automated control have been rarely studied with a focus on their long-term quantitative impact and usability. To address this, an intervention was tested with eighty office workers for twenty-seven weeks. Through the long-term field test, it was found that the addition of online controls in the feedback intervention led to more energy savings than feedback only and worked better for light and phone usage than computer and monitor usage. The addition of automated control led to the greatest savings but was less effective for efficient users than inefficient ones.","citation":[{"content":"Ben Bedwell , Enrico Costanza , Michael O. Jewell, Understanding Energy Consumption at Work: Learning from Arrow Hill, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819993"}],"reference":[{"content":"EIA, U. (2011). Annual energy review. Energy Information Administration, US Dept of Energy: Washington, DC, online at www.eia.doe.gov/emeu/aer.","paperID":"None"},{"content":"1E PC Energy Report (2009). PC Energy Report 2009, USA, United Kingdom, Germany","paperID":"None"},{"content":"Energy Star, (2009). Fast Facts on Energy Use.","paperID":"None"},{"content":"NBI (2012) \"Managing Your Office Equipment Plug Load\"","paperID":"None"},{"content":"Froehlich, J. et al. (2010). The design of eco-feedback technology. CHI '10 (pp. 99--2008). ACM.","paperID":"None"},{"content":"Brynjarsdottir et al. (2012). Sustainably unpersuaded: how persuasion narrows our vision of sustainability. CHI '12 (pp. 947--956). ACM.","paperID":"None"},{"content":"Kappel, K., & Grechenig, T. (2009, April). Show-me: water consumption at a glance to promote water conservation in the shower. In Proceedings of the 4th international conference on persuasive technology (p. 26). ACM.","paperID":"None"},{"content":"Metzger, I et al. (2012). Plug-Load Control and Behavioral Change Research in GSA Office Buildings. NREL/TP-7A40--55780. Golden, CO: National Renewable Energy Laboratory.","paperID":"None"},{"content":"Mercier, C., & Moorefield, L. (2011). Commercial office plug load savings and assessment: Final report. Produced by ECOVA and Supported Through the California Energy Commission's Public Interest Energy Research Program.","paperID":"None"},{"content":"Lasternas, B. et al. (2014). Behavior Oriented Metrics for Plug Load Energy Savings in Office Environment. In Proceedings of the 2014 ACEEE Summer Study on Energy Efficiency in Buildings.","paperID":"None"},{"content":"1Yun R. et al. (2014) The Design and Evaluation of Intelligent Energy Dashboard for Sustainability in the Workplace. In Proceedings, HCI International 2014, LNCS: Springer-Verlag.","paperID":"None"},{"content":"Fogg, B. J. (2009, April). A behavior model for persuasive design. InProceedings of the 4th international Conference on Persuasive Technology (p. 40). ACM.","paperID":"None"},{"content":"Foster, D., Lawson, S., Wardman, J., Blythe, M., & Linehan, C. (2012). \"Watts in it for me?\": design implications for implementing effective energy interventions in organisations. CHI '12 (pp. 2357--2366). ACM.","paperID":"None"},{"content":"Erickson, T. et al. (2013, April). The dubuque electricity portal: evaluation of a city-scale residential electricity consumption feedback system. CHI '13 (pp. 1203--1212). ACM.","paperID":"None"},{"content":"Froehlich, J et al. (2009, April). UbiGreen: investigating a mobile tool for tracking and supporting green transportation habits. CHI '09 (pp. 1043--1052). ACM.","paperID":"None"},{"content":"Yun R. et al. (2013). Toward the Design of a Dashboard to Promote Environmentally Sustainable Behavior among Office Workers. In Persuasive Technology (pp. 246--252). Springer Berlin Heidelberg.","paperID":"None"},{"content":"Yun, R. et al. (2013). Sustainability in the Workplace: Nine Intervention Techniques for Behavior Change. In Persuasive Technology (pp. 253--265). Springer Berlin Heidelberg.","paperID":"None"},{"content":"Ehrhardt-Martinez, K et al. J.A.S.: Advanced Metering Initiatives and Residential Feedback Programs: a meta-review for household electricity-saving opportunities. Washington, D.C. (2010)","paperID":"None"},{"content":"Carrico, A. R., & Riemer, M. (2011). Motivating energy conservation in the workplace: An evaluation of the use of group-level feedback and peer education. Journal of environmental psychology, 31(1), 1--13.","paperID":"None"}],"title":"Beyond Eco-Feedback: Adding Online Manual and Automated Controls to Promote Workplace Sustainability","filename":"CHI15/p1989","authors":["Ray Yun","Azizan Aziz","Peter Scupelli","Bertrand Lasternas","Chenlu Zhang","Vivian Loftness"],"conference":"CHI '15"}