{"paperId":2702172,"citation":[],"reference":[{"content":"Bernabé-Poveda, M. A., and Cöltekin, A. Prevalence of the terrain reversal effect in satellite imagery. International Journal of Digital Earth (2014). To appear.","paperID":"None"},{"content":"Doug A. Bowman , Ernst Kruijff , Joseph J. LaViola , Ivan Poupyrev, 3D User Interfaces: Theory and Practice, Addison Wesley Longman Publishing Co., Inc., Redwood City, CA, 2004","paperID":"993837"},{"content":"Buchroithner, M. F., and Knust, C. True-3D in cartography-Current hard-and softcopy developments. In Geospatial Visualisation. Springer, Heidelberg/Berlin, 2013, 41--65.","paperID":"None"},{"content":"Castner, H. W., and Wheate, R. Re-assessing the role played by shaded relief in topographic scale maps. The Cartographic Journal 16, 2 (Dec. 1979), 77--85.","paperID":"None"},{"content":"Cumming, G. The new statistics: Why and how. Psychological Science 25, 1 (Jan. 2014), 7--29.","paperID":"None"},{"content":"Patrick Degener , Reinhard Klein, A variational approach for automatic generation of panoramic maps, ACM Transactions on Graphics (TOG), v.28 n.1, p.1-14, January 2009","paperID":"1477928"},{"content":"Pierre Dragicevic , Fanny Chevalier , Stephane Huot, Running an HCI experiment in multiple parallel universes, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2578881"},{"content":"Jérémie Francone , Laurence Nigay, Using the user's point of view for interaction on mobile devices, 23rd French Speaking Conference on Human-Computer Interaction, October 24-27, 2011, Sophia Antipolis, France","paperID":"2044360"},{"content":"Tovi Grossman , Ravin Balakrishnan, An evaluation of depth perception on volumetric displays, Proceedings of the working conference on Advanced visual interfaces, May 23-26, 2006, Venezia, Italy","paperID":"1133305"},{"content":"Mark Hancock , Thomas ten Cate , Sheelagh Carpendale, Sticky tools: full 6DOF force-based interaction for multi-touch tables, Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces, November 23-25, 2009, Banff, Alberta, Canada","paperID":"1731930"},{"content":"Imhof, E. Cartographic Relief Presentation. Esri Press, Redlands, CA, USA, 2007.","paperID":"None"},{"content":"Jenny, B., and Patterson, T. Introducing plan oblique relief. Cartographic Perspectives, 57 (Spring 2007), 21--40.","paperID":"None"},{"content":"Jenny, H., Jenny, B., Cartwright, W. E., and Hurni, L. Interactive local terrain deformation inspired by handpainted panoramas. The Cartographic Journal 48, 1 (Feb. 2011), 11--20.","paperID":"None"},{"content":"Jenny, H., Jenny, B., and Hurni, L. Interactive design of 3D maps with progressive projection. The Cartographic Journal 47, 3 (Aug. 2010), 211--221.","paperID":"None"},{"content":"Kirby, K. N., and Gerlanc, D. BootES: An R package for bootstrap confidence intervals on effect sizes. Behavior Research Methods 45, 4 (Dec. 2013), 905--927.","paperID":"None"},{"content":"Knust, C., and Buchroithner, M. F. Principles and terminology of true-3D geovisualisation. The Cartographic Journal 51, 3 (Aug. 2014), 191--202.","paperID":"None"},{"content":"Langer, M. S., and Bülthoff, H. H. A prior for global convexity in local shape-from-shading. Perception 30, 4 (Jan. 2001), 403--410.","paperID":"None"},{"content":"Loomis, J. M., and Eby, D. W. Perceiving structure from motion: Failure of shape constancy. In Proc. ICCV, IEEE Computer Society (Los Alamitos, 1988), 383--391.","paperID":"None"},{"content":"Phillips, R. J., Lucia, A., and Skelton, N. Some objective tests of the legibility of relief maps. The Cartographic Journal 12, 1 (June 1975), 39--46.","paperID":"None"},{"content":"Potash, L. M., Farrell, J. P., and Jeffrey, T. S. A technique for assessing map relief legibility. The Cartographic Journal 15, 1 (June 1978), 28--35.","paperID":"None"},{"content":"Rapp, D. N., Culpepper, S. A., Kirkby, K., and Morin, P. Fostering students' comprehension of topographic maps. Journal of Geoscience Education 55, 1 (Jan. 2007), 5--16.","paperID":"None"},{"content":"Jason L. Reisman , Philip L. Davidson , Jefferson Y. Han, A screen-space formulation for 2D and 3D direct manipulation, Proceedings of the 22nd annual ACM symposium on User interface software and technology, October 04-07, 2009, Victoria, BC, Canada","paperID":"1622190"},{"content":"Ben Shneiderman, Why Not Make Interfaces Better than 3D Reality?, IEEE Computer Graphics and Applications, v.23 n.6, p.12-15, November 2003","paperID":"950723"},{"content":"Graham Smith , Tim Salzman , Wolfgang Stuerzlinger, 3D scene manipulation with 2D devices and constraints, Proceedings of Graphics Interface 2001, p.135-142, June 07-09, 2001, Ottawa, Ontario, Canada","paperID":"781003"},{"content":"Todd, J. T. The visual perception of 3D shape. Trends in Cognitive Sciences 8, 3 (Mar. 2004), 115--121.","paperID":"None"},{"content":"Todd, J. T., and Norman, J. F. The visual perception of 3-D shape from multiple cues: Are observers capable of perceiving metric structure? Perception & Psychophysics 65, 1 (Jan. 2003), 31--47.","paperID":"None"},{"content":"VandenBos, G. R., Ed. Publication Manual of the American Psychological Assn., 6th ed. APA, Washington, DC, 2009.","paperID":"None"},{"content":"Vezzani, S., Kramer, P., and Bressan, P. Stereokinetic effect, kinetic depth effect, and structure from motion. In The Oxford Handbook of Perceptual Organization. Oxford University Press, Oxford, United Kingdom, 2014. In press.","paperID":"None"}],"abstract":"We explore interactive relief shearing, a set of non-intrusive, direct manipulation interactions that expose depth and shape information in terrain maps using ephemeral animations. Reading and interpreting topography and relief on terrain maps is an important aspect of map use, but extracting depth information from 2D maps is notoriously difficult. Modern mapping software attempts to alleviate this limitation by presenting digital terrain using 3D views. However, 3D views introduce occlusion, complicate distance estimations, and typically require more complex interactions. In contrast, our approach reveals depth information via shearing animations on 2D maps, and can be paired with existing interactions such as pan and zoom. We examine explicit, integrated, and hybrid interactions for triggering relief shearing and present a version that uses device tilt to control depth effects. Our evaluation shows that these interactive techniques improve depth perception when compared to standard 2D and perspective views.","title":"Lightweight Relief Shearing for Enhanced Terrain Perception on Interactive Maps","filename":"CHI15/p3563","authors":["Wesley Willett","Bernhard Jenny","Tobias Isenberg","Pierre Dragicevic"],"conference":"CHI '15"}