{"paperId":2702570,"abstract":"Selective exposure, the preferential seeking of confirmatory information, can potentially exacerbate fragmentation of online opinions and lead to biased decisions. We tested whether features that allowed users to better distinguish information about different issue aspects would encourage them to take different perspectives, thereby moderating the negative influence of pre-existing beliefs on information seeking. Using an information aggregator that provided drug related comments, we conducted an experiment to study the impact of aspect indicators (indicating whether the comment was about effectiveness or side effects) on moderating selective exposure. We found that, when participants were asked to decide between medications for high-risk diseases, and had preexisting biased beliefs in their effectiveness (one medication was less effective than the other), without aspect indicators they exhibited selective exposure to both types of comments (effectiveness and side effects) and were biased to choose the medication in confirmation of their pre-existing beliefs. With aspect indicators, we found reduced selective exposure to information about side effects of the medications, and as a result their overall decision bias was mitigated. However, the effect of aspect indicators in reducing selective exposure was moderated by the decision contexts, including the perceived risk of the diseases and whether the aspect was perceived to be critical to the decision.","citation":[{"content":"Mingkun Gao, Intelligent Interface for Organizing Online Social Opinions on Reddit, Companion Publication of the 21st International Conference on Intelligent User Interfaces, March 07-10, 2016, Sonoma, California, USA","paperID":"2876464"}],"reference":[{"content":"Awadallah, R., Ramanath, M., & Weikum, G. Opinionetit: understanding the opinions-people network for politically controversial topics. In CIKM 2011, ACM Press (2011), 2481--2484.","paperID":"None"},{"content":"Bergus, G. R., Levin, I. P., & Elstein, A. S. Presenting risks and benefits to patients. Journal of General Internal Medicine, 17, 8 (2002), 612--617.","paperID":"None"},{"content":"Bornstein, B. H., & Emler, A. C. Rationality in medical decision making: a review of the literature on doctors' decision-making biases. Journal of Evaluation in Clinical Practice, 7, 2 (2001), 97--107.","paperID":"None"},{"content":"Brashers, D. E., Goldsmith, D. J., & Hsieh, E. Information seeking and avoiding in health contexts. Human Communication Research, 28, 2 (2002), 258--271.","paperID":"None"},{"content":"Evans, M., Shaw, A., Thompson, E. A., Falk, S., Turton, P., Thompson, T., & Sharp, D. Decisions to use complementary and alternative medicine (CAM) by male cancer patients: information-seeking roles and types of evidence used. BMC Complementary and Alternative Medicine, 7, 1(2007), 25.","paperID":"None"},{"content":"Festinger, L. (1962). A theory of cognitive dissonance (Vol. 2). Stanford University Press.","paperID":"None"},{"content":"Fischer, P., Kastenmüller, A., Greitemeyer, T., Fischer, J., Frey, D., & Crelley, D. Threat and selective exposure: The moderating role of threat and decision context on confirmatory information search after decisions. Journal of Experimental Psychology: General, 140(1), 51","paperID":"None"},{"content":"Frey, D. Recent Research on Selective Exposure to Information. Advances in Experimental Social Psychology 19 (1986), 41--80","paperID":"None"},{"content":"Garrett, R., Resnick, P. Resisting Political Fragmentation on the Internet. Daedalus 140, 4 (2011) 108--120.","paperID":"None"},{"content":"Grevet, C., Terveen, L. G., & Gilbert, E. Managing political differences in social media. In CSCW 2013, ACM Press (2014), 1400--1408.","paperID":"None"},{"content":"Hart, W., Albarracín, D., Eagly, A. H., Brechan, I., Lindberg, M. J., & Merrill, L. Feeling validated versus being correct: a meta-analysis of selective exposure to information. Psychological Bulletin, 135, 4 (2009), 555.","paperID":"None"},{"content":"Hibbard, J. H., & Peters, E. Supporting informed consumer health care decisions: data presentation approaches that facilitate the use of information in choice. Annual Review of Public Health, 24, 1(2003), 413--433.","paperID":"None"},{"content":"Jiang, Y., Liao, Q., Cheng, Q., Berlin, R., Schatz, B. Designing and Evaluating a Clustering System for Organizing and Integrating Patient Drug Outcomes in Personal Health Messages. In AMIA 2012, 417.","paperID":"None"},{"content":"Keselman, A., Browne, A. C., & Kaufman, D. R. Consumer health information seeking as hypothesis testing. Journal of the American Medical Informatics Association, 15, 4 (2008), 484--495.","paperID":"None"},{"content":"Klayman, J. Varieties of confirmation bias. Psychology of Learning and Motivation, 32(1995), 385--418.","paperID":"None"},{"content":"Kriplean, T., Morgan, J., Freelon, D., Borning, A., & Bennett, L. Supporting reflective public thought with considerit. In CSCW 2012, ACM Press (2012), 265--274.","paperID":"None"},{"content":"Lau, A., & Coiera, E. W. Can cognitive biases during consumer health information searches be reduced to improve decision making? Journal of the American Medical Informatics Association, 16, 1(2009), 54--65.","paperID":"None"},{"content":"Lauckner, C., & Hsieh, G. The presentation of healthrelated search results and its impact on negative emotional outcomes. In CHI 2013, ACM Press (2013), 333--342.","paperID":"None"},{"content":"Lee, B., Smith, G., Robertson, G. G., Czerwinski, M., & Tan, D. S. FacetLens: exposing trends and relationships to support sensemaking within faceted datasets. In CHI 2009, ACM Press (2009),1293--1302.","paperID":"None"},{"content":"Lewandowsky, S., Ecker, U. K., Seifert, C. M., Schwarz, N., & Cook, J. Misinformation and its correction continued influence and successful debiasing. Psychological Science in the Public Interest, 13, 3(2012), 106--131.","paperID":"None"},{"content":"Leydon, G. M., Boulton, M., Moynihan, C., Jones, A., Mossman, J., Boudioni, M., & McPherson, K. Cancer patients' information needs and information seeking behavior: in depth interview study. Bmj, 320 7239 (2000), 909--913.","paperID":"None"},{"content":"Liao, Q. V., & Fu, W. T. Beyond the filter bubble: interactive effects of perceived threat and topic involvement on selective exposure to information. In CHI 2013, ACM Press (2013), 2359--2368.","paperID":"None"},{"content":"Liao, Q. V., & Fu, W. T. Can you hear me now?: mitigating the echo chamber effect by source position indicators. In CSCW 2014, ACM Press (2014), 184--196","paperID":"None"},{"content":"Liao, Q. V., & Fu, W. T. Expert voices in echo chambers: effects of source expertise indicators on exposure to diverse opinions. In CHI 2014, ACM Press (2014), 2745--2754.","paperID":"None"},{"content":"Munson, S. & Resnick P. Presenting Diverse Political Opinions: How and How Much. In CHI 2010, ACM Press (2010), 1457--1466.","paperID":"None"},{"content":"Nickerson, R. S. Confirmation bias: A ubiquitous phenomenon in many guises. Review of General Psychology, 2, 2 (1998), 175.","paperID":"None"},{"content":"Park, S., Kang, S., Chung, S., Song, J. NewsCube: Delivering Multiple Aspects of News to Mitigate Media Bias. In CHI2009, ACM Press (2009), 443--452.","paperID":"None"},{"content":"Pariser, Eli. The Filter Bubble: What the Internet Is Hiding from You, Penguin Press, 2011","paperID":"None"},{"content":"Schweiger, S., Oeberst, A., & Cress, U. Confirmation Bias in Web-Based Search: A Randomized Online Study on the Effects of Expert Information and Social Tags on Information Search and Evaluation. Journal of Medical Internet Research, 16, 3(1998).","paperID":"None"},{"content":"Sunstein, C. R. (2009). Republic. com 2.0. Princeton University Press.","paperID":"None"},{"content":"White, R. W., Horvitz, E. \"Cyberchondria: studies of the escalation of medical concerns in web search.\" ACM TOIS, 27, 4 (2009), 23.","paperID":"None"},{"content":"White, R. W. Beliefs and Biases in Web Search. In SIGIR 2013. ACM Press (2013), 3--12.","paperID":"None"},{"content":"Yee, K. P., Swearingen, K., Li, K., & Hearst, M. Faceted metadata for image search and browsing. In CHI 2003, ACM Press (2003), 401--408.","paperID":"None"},{"content":"Zeleny, M. (1982). Multiple criteria decision making (Vol. 25). J. L. Cochrane (Ed.). New York: McGraw-Hil","paperID":"None"}],"title":"It Is All About Perspective: An Exploration of Mitigating Selective Exposure with Aspect Indicators","filename":"CHI15/p1439","authors":["Q. Vera Liao","Wai-Tat Fu","Sri Shilpa Mamidi"],"conference":"CHI '15"}