{"paperId":2702346,"citation":[],"abstract":"This article analyzes users who edit Wikipedia articles about Okinawa, Japan, in English and Japanese. It finds these users are among the most active and dedicated users in their primary languages, where they make many large, high-quality edits. However, when these users edit in their non-primary languages, they tend to make edits of a different type that are overall smaller in size and more often restricted to the narrow set of articles that exist in both languages. Design changes to motivate wider contributions from users in their non-primary languages and to encourage multilingual users to transfer more information across language divides are presented.","reference":[{"content":"Adler, B. T., Chatterjee, K., de Alfaro, L., Faella, M., Pye, I., and Raman, V. Assigning trust to Wikipedia content. In Proceedings of the 4th International Symposium on Wikis, WikiSym '08, ACM (New York, NY, USA, 2008), 26:1--26:12.","paperID":"None"},{"content":"Adler, B. T., and de Alfaro, L. A content-driven reputation system for the Wikipedia. In Proceedings of the 16th International Conference on World Wide Web, WWW '07, ACM (New York, NY, USA, 2007), 261--270.","paperID":"None"},{"content":"Adler, B. T., de Alfaro, L., Pye, I., and Raman, V. Measuring author contributions to the Wikipedia. In Proceedings of the 4th International Symposium on Wikis, WikiSym '08, ACM (New York, NY, USA, 2008), 15:1--15:10.","paperID":"None"},{"content":"Anthony, D., Smith, S. W., and Williamson, T. Reputation and reliability in collective goods: The case of the online encyclopedia Wikipedia. Rationality and Society 21, 3 (2009), 283--306.","paperID":"None"},{"content":"Bao, P., Hecht, B., Carton, S., Quaderi, M., Horn, M., and Gergle, D. Omnipedia: Bridging the Wikipedia language gap. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '12, ACM (New York, NY, USA, 2012), 1075--1084.","paperID":"None"},{"content":"Bilic, P., and Bulian, L. Lost in translation: Contexts, computing, disputing on Wikipedia. In iConference 2014 Proceedings, M. Kindling and E. Greifender, Eds. iSchools, 2014, 32--44.","paperID":"None"},{"content":"Burt, R. S. Structural holes and good ideas. The American Journal of Sociology 110, 2 (2004), 349--399.","paperID":"None"},{"content":"Callahan, E. S., and Herring, S. C. Cultural bias in Wikipedia content on famous persons. Journal of the American Society for Information Science and Technology 62, 10 (2011), 1899--1915.","paperID":"None"},{"content":"Cosley, D., Frankowski, D., Terveen, L., and Riedl, J. Suggestbot: Using intelligent task routing to help people find work in wikipedia. In Proceedings of the 12th International Conference on Intelligent User Interfaces, IUI '07, ACM (New York, NY, USA, 2007), 32--41.","paperID":"None"},{"content":"Eleta, I., and Golbeck, J. Bridging languages in social networks: How multilingual users of Twitter connect language communities. Proceedings of the American Society for Information Science and Technology 49, 1 (2012), 1--4.","paperID":"None"},{"content":"Eurobarometer. User language preferences online: Analytical report. Tech. rep., 2011. Survey conducted by The Gallup Organization, Hungary upon the request of Directorate-General Information Society and Media, European Commission.","paperID":"None"},{"content":"Grosjean, F. Bilingual: Life and Reality. Harvard University Press, 2010.","paperID":"None"},{"content":"Hale, S. A. Impact of platform design on cross-language information exchange. In Proceedings of the 2012 ACM Annual Conference on Human Factors in Computing Systems Extended Abstracts, CHI EA '12, ACM (New York, NY, USA, 2012), 1363--1368.","paperID":"None"},{"content":"Hale, S. A. Net increase? Cross-lingual linking in the blogosphere. Journal of Computer-Mediated Communication 17, 2 (2012), 135--151.","paperID":"None"},{"content":"Hale, S. A. Global connectivity and multilinguals in the Twitter network. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '14, ACM (New York, NY, USA, 2014), 833--842.","paperID":"None"},{"content":"Hale, S. A. Multilinguals and Wikipedia editing. In Proceedings of the 6th Annual ACM Web Science Conference, WebSci'14, ACM (New York, NY, USA, 2014).","paperID":"None"},{"content":"Haruechaiyasak, C., and Damrongrat, C. Article recommendation based on a topic model for Wikipedia selection for schools. In Digital Libraries: Universal and Ubiquitous Access to Information, G. Buchanan, M. Masoodian, and S. Cunningham, Eds., vol. 5362 of Lecture Notes in Computer Science. Springer Berlin Heidelberg, 2008, 339--342.","paperID":"None"},{"content":"Hecht, B., and Gergle, D. The Tower of Babel meets Web 2.0: User-generated content and its applications in a multilingual context. In Proceedings of the 28th International Conference on Human Factors in Computing Systems, CHI '10, ACM (New York, NY, USA, 2010), 291--300.","paperID":"None"},{"content":"Hong, L., Convertino, G., and Chi, E. Language matters in Twitter: A large scale study. In International AAAI Conference on Weblogs and Social Media (2011), 518--521.","paperID":"None"},{"content":"Kim, S., Weber, I., Wei, L., and Oh, A. Sociolinguistic analysis of Twitter in multilingual societies. In Proceedings of the 25th ACM Conference on Hypertext and Social Media, HT '14, ACM (New York, NY, USA, 2014), 243--248.","paperID":"None"},{"content":"Kittur, A., Chi, E., Pendleton, B. A., Suh, B., and Mytkowicz, T. Power of the few vs. wisdom of the crowd: Wikipedia and the rise of the bourgeoisie. Presented at alt.CHI, ACM SIGCHI Conference, San Jose, CA, USA, 2007.","paperID":"None"},{"content":"Kriplean, T., Beschastnikh, I., and McDonald, D. W. Articulations of wikiwork: Uncovering valued work in Wikipedia through barnstars. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work, CSCW '08, ACM (New York, NY, USA, 2008), 47--56.","paperID":"None"},{"content":"Milne, D., and Witten, I. H. An effective, low-cost measure of semantic relatedness obtained from Wikipedia links. In In Proceedings of the AAAI 2008 Workshop on Wikipedia and Artificial Intelligence, WIKIAI 2008, AAAI (Chicago, IL, USA, 2008).","paperID":"None"},{"content":"Ministry of Foreign Affairs of Japan. ( )( 20 3 31 ) (Information on the number of people living on and off US military related facilities [Nationwide][March 31, 2008]). http://www.mofa.go. jp/mofaj/press/release/h20/6/1181033_910.html, 2008.","paperID":"None"},{"content":"Nielsen, J. Usability Engineering. Academic Press, 1993.","paperID":"None"},{"content":"Okinawa Prefecture. (US military bases and Japan Self-Defense Force bases in Okinawa [Compiled statistics]). http://www.pref.okinawa.jp/site/ chijiko/kichitai/toukeisiryousyu2503.html, 2013.","paperID":"None"},{"content":"Page, L., Brin, S., Motwani, R., and Winograd, T. The pagerank citation ranking: Bringing order to the web. Technical Report 1999--66, Stanford InfoLab, Nov. 1999.","paperID":"None"},{"content":"Pfeil, U., Zaphiris, P., and Ang, C. S. Cultural differences in collaborative authoring of Wikipedia. Journal of Computer-Mediated Communication 12, 1 (2006), 88--113.","paperID":"None"},{"content":"Priedhorsky, R., Chen, J., Lam, S. T. K., Panciera, K., Terveen, L., and Riedl, J. Creating, destroying, and restoring value in Wikipedia. In Proceedings of the 2007 International ACM Conference on Supporting Group Work, GROUP '07, ACM (New York, NY, USA, 2007), 259--268.","paperID":"None"},{"content":"Welser, H. T., Cosley, D., Kossinets, G., Lin, A., Dokshin, F., Gay, G., and Smith, M. Finding social roles in Wikipedia. In Proceedings of the 2011 iConference, iConference '11, ACM (New York, NY, USA, 2011), pp. 122--129.","paperID":"None"},{"content":"Zuckerman, E. Rewire: Digital Cosmopolitans in the Age of Connection. W. W. Norton & Company, London, 2013.","paperID":"None"}],"title":"Cross-language Wikipedia Editing of Okinawa, Japan","filename":"CHI15/p183","authors":["Scott A. Hale"],"conference":"CHI '15"}