{"paperId":2702562,"citation":[],"abstract":"We report on participatory design research where interaction designers, and canine behavioral specialists, together with their cancer detection dogs, teamed up to better support the dogs' life-saving work. We discuss interspecies communication challenges in cancer detection training, requiring the dogs to use human signaling conventions that perturb their detection work. We describe our effort to develop a technology that could resolve those challenges, and how in the process our design focus gradually shifted from a human-centered to a canine-centered interaction model. The resulting interface, based on honest signaling, re-centers cancer detection practices on the dogs themselves, enabling them to better express their potential as cancer detection workers; it also provides a model for re-thinking human-computer interactions.","video":"http://www.youtube.com/embed/t12gXUzlCJU?rel=0","reference":[{"content":"Marije, B.K., van Agtmael M.A., Hotsche, L., van Veen M.C., Vandenbroucke-Grauls C.M., Yvo, S.M. (2012). Using a Dog's Superior Olfactory Sensitivity to Identify Clostridium Difficile in Stools and Patients: Proof of Principle Study. British Medical Journal, vol. 2012","paperID":"None"},{"content":"A. D. Cheok , R. T.K.C. Tan , R. L. Peiris , O. N.N. Fernando , J. T.K. Soon , I. J.P. Wijesena , J. Y.P. Sen, Metazoa Ludens: Mixed-Reality Interaction and Play for Small Pets and Humans, IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans, v.41 n.5, p.876-891, September 2011","paperID":"2334482"},{"content":"Concha, A., Mills, D.S., Feugier, A., Zulch, H., Guest, C., Harris, R., Pike, T.W. (2014). Using Sniffing Behavior to Differentiate True Negative from False Negative Responses in Trained Scent-Detection Dogs. Chemical Senses, Sept. 2014","paperID":"None"},{"content":"Cornu J-N et al. (2010). Olfactory Detection of Prostate Cancer by Dogs Sniffing Urine: A Step Forward in Early Diagnosis. Eur Urol 2010","paperID":"None"},{"content":"Dominguez-Escrig, J.L., McCracken, S.R.C., Greene, D. (2010). Beyond Diagnosis: Evolving Prostate Biopsy in the Era of Focal Therapy. Prostate Cancer, vol. 2011","paperID":"None"},{"content":"Ehmann, R., Boedeker, E., Friedrich, U., Dippon, J., Friedel, G., Walles, T. (2012). Canine Scent Detection in the Diagnosis of Lung cancer: Revisiting a Puzzling Phenomenon. European Respiratory Journal, 39 (3): 669--676","paperID":"None"},{"content":"Enquist. M. (1985). Communication During Aggressive Interactions with Particular Reference to Variation in Choice of Behaviour. Animal Behaviour, 33:1152--61","paperID":"None"},{"content":"Melody Moore Jackson , Clint Zeagler , Giancarlo Valentin , Alex Martin , Vincent Martin , Adil Delawalla , Wendy Blount , Sarah Eiring , Ryan Hollis , Yash Kshirsagar , Thad Starner, FIDO - facilitating interactions for dogs with occupations: wearable dog-activated interfaces, Proceedings of the 2013 International Symposium on Wearable Computers, September 08-12, 2013, Zurich, Switzerland","paperID":"2494334"},{"content":"Ping Lee , David Cheok , Soon James , Lyn Debra , Wen Jie , Wang Chuang , Farzam Farbiz, A mobile pet wearable computer and mixed reality system for human–poultry interaction through the internet, Personal and Ubiquitous Computing, v.10 n.5, p.301-317, August 2006","paperID":"1149823"},{"content":"Clara Mancini, Animal-computer interaction: a manifesto, interactions, v.18 n.4, July + August 2011","paperID":"1978836"},{"content":"Clara Mancini, Animal-computer interaction (ACI): changing perspective on HCI, participation and sustainability, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468744"},{"content":"Clara Mancini , Janet van der Linden , Jon Bryan , Andrew Stuart, Exploring interspecies sensemaking: dog tracking semiotics and multispecies ethnography, Proceedings of the 2012 ACM Conference on Ubiquitous Computing, September 05-08, 2012, Pittsburgh, Pennsylvania","paperID":"2370239"},{"content":"Marshall, D.A., Moulton, D.G. (1981). Olfactory sensitivity to α-ionone in humans and dogs. Chemical senses, Jan 1981","paperID":"None"},{"content":"Maynard Smith, J., Harper, D. (2003). Animal Signals, Oxford University Press","paperID":"None"},{"content":"McCulloch, M., Turner, K., Broffman, M. (2012). Lung cancer detection by canine scent: will there be a lab in the lab? European Respiratory Journal, 39(3)","paperID":"None"},{"content":"Medical Detection Dogs: www.medicaldetectiondogs.org.uk","paperID":"None"},{"content":"Moser, E., McCulloch, M. (2010). Canine Scent Detection of Human Cancers: A Review of Methods and Accuracy. Journal of Veterinary Behaviour, Clinical Applications and Research, 5(3):145--152","paperID":"None"},{"content":"Alex (Sandy) Pentland, Honest Signals: How They Shape Our World, The MIT Press, 2008","paperID":"1450928"},{"content":"Peirce, C.S. (1931-35). Collected Papers of Charles Sanders Peirce. Harvard Univ. Press, Cambridge, MA","paperID":"None"},{"content":"Pickel, D., Manucy, G.P., Walker, D.B., Hall, S.B., Walker, J.C. (2004). Evidence for Canine Olfactory Detection of Melanoma Applied Animal Behaviour Science, 89(1-2):107--116","paperID":"None"},{"content":"Pryor, K. (2002). Clicker training for dogs. Ringpress","paperID":"None"},{"content":"Reiss, D., McCowan, B. (1993). Spontaneous Vocal Mimicry and Production by Bottle Nose Dolphins (Tursiops Truncatus): Evidence for Vocal Learning. Journal of Comparative Psychology, 107(3): 301--312","paperID":"None"},{"content":"Resner, B.I. (2001). Rover@Home: Computer Mediated Remote Interaction for Dogs. Media Arts and Sciences MS, Cambridge, Massachusetts Institute of Technology.","paperID":"None"},{"content":"Charlotte L. Robinson , Clara Mancini , Janet van der Linden , Claire Guest , Robert Harris, Canine-centered interface design: supporting the work of diabetes alert dogs, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557396"},{"content":"Schweller, K. (2012). Apes with Apps: Using Tablets and Customised Keyboards, Bonobos Can Become Great Communicators. IEEE Spectrum, 49(7) (NA): 37--43","paperID":"None"},{"content":"Slatkoff, S., Gamboa, S., Zolotor, A.J., Mounsey, A.L., Jones, K. (2011). PSA testing: When It's Useful, When It's not. Journal of Family Practice, 60(6): 357--360","paperID":"None"},{"content":"Sonoda. H., Kohnoe, S., Yamazato. T., et al. (2011). Colorectal Cancer Screening with Odour Material by Canine Scent Detection. Gut 2011, Jan 31","paperID":"None"},{"content":"Weber, C.M., Cauchi, M., Patel, M., Bessant, C., Turner, C., Britton, L.E., Willis, C.M. (2011). Evaluation of a Gas Sensor Array and Pattern Recognition for the Identification of Bladder Cancer from Urine Headspace. Analyst, 136(2): 359--364","paperID":"None"},{"content":"Alexandra Weilenmann , Oskar Juhlin, Understanding people and animals: the use of a positioning system in ordinary human-canine interaction, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979328"},{"content":"Willis, C.M., Britton, L.E., Harris, R., Wallace, J., Guest, C.M. (2010--11). Volatile Organic Compounds as Biomarkers of Bladder Cancer: Sensitivity and Specificity Using trained Sniffer Dogs. Cancer Biomark, 8: 145--53","paperID":"None"},{"content":"Willis, C.M., Church, S.M., Guest, C.M., Cook, W.A., McCarthy, N., Bransbury, A.J., Church, M.R.T., Church, J.C.T. (2004). Olfactory Detection of Human Bladder Cancer by Dogs: Proof of Principle Study, British Medical Journal, 329: 712","paperID":"None"}],"title":"Re-Centering Multispecies Practices: A Canine Interface for Cancer Detection Dogs","filename":"CHI15/p2673","authors":["Clara Mancini","Rob Harris","Brendan Aengenheister","Claire Guest"],"conference":"CHI '15"}