{"paperId":2702531,"abstract":"In this paper we draw upon a number of explorations of social media activities, trying to capture and understand them as located, situated practices. This methodological endeavor spans over analyzing patterns in big data feeds (here Instagram) as well as small-scale video-based ethnographic studies of user activities. A situated social media perspective involves examining how social media production and consumption are intertwined. Drawing upon our studies of social media use in cultural institutions we show how visitors orient to their social media presence while attending to physical space during a visit, and how editing and sharing processes are formed by the trajectory through a space. We discuss the application and relevance of this approach for understanding social media and social photography in situ.","citation":[{"content":"Jaehyuk Park , Giovanni Luca Ciampaglia , Emilio Ferrara, Style in the Age of Instagram: Predicting Success within the Fashion Industry using Social Media, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820065"}],"reference":[{"content":"Bitgood, S. Museum fatigue: A critical review. Visitor Studies 12, 2 (2009), 93--111.","paperID":"None"},{"content":"Boyd, D. and Crawford, K. Critical Questions for Big Data. Information, Communication & Society 15, 5 (2012), 662--679.","paperID":"None"},{"content":"Barry Brown , Moira McGregor , Eric Laurier, iPhone in vivo: video analysis of mobile device use, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466132"},{"content":"Chalfen, R. Snapshot Versions of Life. Bowling Green State University Popular Press, 1987.","paperID":"None"},{"content":"Pei-Yu Chi , Henry Lieberman, Raconteur: integrating authored and real-time social media, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979411"},{"content":"Heath, C. and Vom Lehn, D. Interactivity and Collaboration: new forms of participation in museums, galleries and science centres. In R. Parry, ed., Museums in a Digital Age. Routledge, 2010, 266--280.","paperID":"None"},{"content":"Hine, C. Virtual ethnography. The Sage Handbook of Research Methods, (2000), 179.","paperID":"None"},{"content":"Jenkins, H. Convergence culture: Where old and new media collide. New York University Press, New York, 2006.","paperID":"None"},{"content":"Kanda, T., Shiomi, M., Perrin, L., et al. Analysis of people trajectories with ubiquitous sensors in a science museum. Proc. IEEE Int. Conference on Robotics and Automation, (2007), 4846--4853.","paperID":"None"},{"content":"Galena Kostoska , Denise Fezzi , Beatrice Valeri , Marcos Baez , Fabio Casati , Samuela Caliari , Stefania Tarter, Collecting memories of the museum experience, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2468401"},{"content":"Licoppe, C. and Figeac, J. Direct video observation of the uses of smartphones on the move: Reconceptualizing mobile multi-activity. In A. de Souza e Silva and M. Sheller, eds., Mobility and Locative Media: Mobile Communication in Hybrid Spaces. Routledge, New York, 2015, 48--64.","paperID":"None"},{"content":"Miles, R. and Tout, A. Impact of research on the approach to the visiting public at the Natural History Museum, London. International Journal of Science Education 13, 5 (1991), 543--549.","paperID":"None"},{"content":"Mattias Rost , Louise Barkhuus , Henriette Cramer , Barry Brown, Representation and communication: challenges in interpreting large social media datasets, Proceedings of the 2013 conference on Computer supported cooperative work, February 23-27, 2013, San Antonio, Texas, USA","paperID":"2441817"},{"content":"Stephansen, H. C. and Couldry, N. Understanding micro-processes of community building and mutual learning on Twitter: a 'small data' approach. Information, Comm. & Society, (2014), 1--16.","paperID":"None"},{"content":"Alexandra Weilenmann , Thomas Hillman , Beata Jungselius, Instagram at the museum: communicating the museum experience through social photo sharing, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466243"}],"title":"Situated Social Media Use: A Methodological Approach to Locating Social Media Practices and Trajectories","filename":"CHI15/p4057","authors":["Thomas Hillman","Alexandra Weilenmann"],"conference":"CHI '15"}