{"paperId":2702460,"citation":[{"content":"Evangelos Niforatos , Veranika Lim , Christian Vuerich , Marc Langheinrich , Agon Bexheti, PulseCam: Biophysically Driven Life Logging, Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, August 24-27, 2015, Copenhagen, Denmark","paperID":"2794320"}],"reference":[{"content":"Aipperspach, R., Hooker, B., and Woodruff, A. Data Souvenirs: Environmental psychology and reflective design. International Journal of Human-Computer Studies 69, 5 (2011), 338--349.","paperID":"None"},{"content":"Bakker, S., Hoven, E., van den, and Eggen, J.H. Peripheral interaction: characteristics and considerations. Personal and Ubiquitous Comp, (2014).","paperID":"None"},{"content":"Bannon, L.J. Forgetting as a feature, not a bug: the duality of memory and implications for ubiquitous computing. CoDesign 2, 1 (2006), 3--15.","paperID":"None"},{"content":"Berntsen, D. Involuntary Autobiographical Memories. Cambridge University Press, 2009.","paperID":"None"},{"content":"Braun, V. and Clarke, V. Using thematic analysis in psychology. Qual. Research in Psy 3, 2 (2006), 77--101.","paperID":"None"},{"content":"Bryant, F.B., Smart, C.M., and King, S.P. Using the Past to Enhance the Present: Boosting Happiness Through Positive Reminiscence. Happiness Studies 6, (2005), 227--260.","paperID":"None"},{"content":"Carter, S. and Mankoff, J. When participants do the capturing. In Proc. CHI '05, ACM Press (2005), 899--908.","paperID":"None"},{"content":"Conway, M.A. and Pleydell-Pearce, C.W. The construction of autobiographical memories in the selfmemory system. Psychological review 107, 2 (2000), 261--287.","paperID":"None"},{"content":"Cosley, D., Sosik, V.S., Schultz, J., et al. Experiences With Designing Tools for Everyday Reminiscing. Human-Computer Interaction 27, (2012), 175--198.","paperID":"None"},{"content":"Csikszentmihalyi, M. and Rochberg-Halton, E. The Meaning of Things. Cambridge University Press, 1981.","paperID":"None"},{"content":"Frohlich, D. and Murphy, R. The Memory Box. Personal and Ubiquitous Comp 4, 4 (2000), 238--240.","paperID":"None"},{"content":"Golsteijn, C. and Hoven, E., van den. Facilitating parent-teenager communication through interactive photo cubes. Personal and Ubiquitous Computing 17, 2 (2013), 273--286.","paperID":"None"},{"content":"Gulotta, R., Odom, W., Forlizzi, J., and Faste, H. Digital artifacts as legacy: exploring the lifespan and value of digital data. In Proc. CHI '13, ACM Press (2013), 1813--1822.","paperID":"None"},{"content":"Helmes, J., O'Hara, K., Vilar, N., and Taylor, A.S. Meerkat and tuba: design alternatives for randomness, surprise and serendipity in reminiscing. In Proc. INTERACT'11, Springer-Verlag (2011), 376--391.","paperID":"None"},{"content":"Hoven, E., van den and Eggen, B. The cue is key: Design for real-life remembering. Zeitschrift für Psychologie 222, 2 (2014), 110--117.","paperID":"None"},{"content":"Hoven, E., van den and Eggen, J.H. The effect of cue media on recollections. Human Technology 5, 1 (2009), 47--67.","paperID":"None"},{"content":"Hoven, E., van den, Sas, C., and Whittaker, S. Introduction to this Special Issue on Designing for Personal Memories: Past, Present, and Future. Human-Computer Interaction 27, 1--2 (2012), 1--12.","paperID":"None"},{"content":"Isaacs, E., Konrad, A., Walendowski, A., et al. Echoes from the past: how technology mediated reflection improves well-being. In Proc. CHI '13, ACM (2013), 1071--1080.","paperID":"None"},{"content":"Kalnikaite, V. and Whittaker, S. A saunter down memory lane: Digital reflection on personal mementos. International Journal of Human-Computer Studies 69, 5 (2011), 298--310.","paperID":"None"},{"content":"Kirk, D.S. and Sellen, A.J. On human remains: Values and practice in the home archiving of cherished objects. ACM TOCHI 17, 3, Article 10 (2010), 43 pages.","paperID":"None"},{"content":"Massimi, M. and Baecker, R.M. A death in the family: opportunities for designing technologies for the bereaved. In Proc. CHI '10, ACM (2010), 1821--1830.","paperID":"None"},{"content":"Moncur, W. and Kirk, D.S. An emergent framework for digital memorials. In Proc. DIS '14, ACM Press (2014), 965--974.","paperID":"None"},{"content":"O'Hara, K., Helmes, J., Sellen, A.J., et al. Food for Talk: Phototalk in the Context of Sharing a Meal. Human-Computer Interaction 27, 1 (2012).","paperID":"None"},{"content":"Obrist, M., Tuch, A.N., and Hornbaek, K. Opportunities for odor: experiences with smell and implications for technology. In Proc. CHI '14, ACM Press (2014), 2843--2852.","paperID":"None"},{"content":"Petrelli, D. and Whittaker, S. Family memories in the home: contrasting physical and digital mementos. Personal and Ubiquitous Comp 14, 2 (2010), 153--169.","paperID":"None"},{"content":"Petrelli, D., Hoven, E., van den, and Whittaker, S. Making history: intentional capture of future memories. In Proc. CHI '09, ACM Press (2009), 1723--1732.","paperID":"None"},{"content":"Petrelli, D., Whittaker, S., and Brockmeier, J. AutoTopography: what can physical mementos tell us about digital memories? In Proc. CHI '08, ACM (2008), 53--62.","paperID":"None"},{"content":"Schlagman, S., Kvavilashvili, L., and Schulz, J. Effects of age on involuntary autobiographical memories. In J.H. Mace, ed., Involuntary Memory. Blackwell, Malden, MA, 2007, 87--112.","paperID":"None"},{"content":"Schwarz, O. The past next door: Neighbourly relations with digital memory-artefacts. Memory Studies 7, 1 (2014), 7--21.","paperID":"None"},{"content":"Sellen, A.J. and Whittaker, S. Beyond Total Capture: A Constructive Critique of Lifelogging. Communications of the ACM 53, (2010), 70--77.","paperID":"None"},{"content":"van Dijck, J. Mediated Memories in the Digital Age. Stanford University Press, 2007.","paperID":"None"},{"content":"Whittaker, S., Kalnikaite, V., Petrelli, D., et al. SocioTechnical Lifelogging: Deriving Design Principles for a Future Proof Digital Past. Human-Computer Interaction 27, (2012), 37--62.","paperID":"None"}],"abstract":"Interactive devices can support personal remembering to benefit well-being. These designs require insight into what brings the past to mind, and how people relate to such cues. Prior work focused on mementos in the home; instead, this paper presents a diary and interview study of involuntary memory cueing in everyday life. Data was collected from fifteen adult individuals, using sentence completion diaries, combined with debriefing interviews. Qualitative analysis of the data showed that these participants were relying on everyday physical objects like food items for cueing memories during everyday life, locations and (repeated) activities, while digital items and photos were shown to be less frequent stimulants. Meaningful relations to memory cues can be partially explained from a memory cueing perspective. We discuss how design for remembering can benefit from our insights, through careful trade-offs in timing, exposure to cues, and supporting a process of personal attachment with items invoking memories.","title":"Things That Make Us Reminisce: Everyday Memory Cues as Opportunities for Interaction Design","filename":"CHI15/p3443","authors":["Doménique van Gennip","Elise van den Hoven","Panos Markopoulos"],"conference":"CHI '15"}