{"paperId":2702544,"abstract":"Recent research shows that fashion already exists in the HCI domain and influences and affects design and designers' thinking and practices throughout the design process. In this note, we draw our insights from fashion related research within HCI and interaction design, provide some observations about fashion-related design and research practices, raise questions about our field as moving forward towards fashion driven discipline.","citation":[],"reference":[{"content":"Barnard, M. 2002. Fashion as Communication. Psychology Press.","paperID":"None"},{"content":"Carroll, Barbara A., and Aaron C. Ahuvia. 2006. Some Antecedents and Outcomes of Brand Love. Marketing Letters 17(2): 79--89","paperID":"None"},{"content":"Fletcher, Kate. 2012. Durability, Fashion, Sustainability: The Processes and Practices of Use. Fashion Practice: The Journal of Design, Creative Process & the Fashion 4(2): 221--238.","paperID":"None"},{"content":"Fortunati, Leopoldina, (2005). Mobile Phones and Fashion in Post-modernity, Telektronikk 3.","paperID":"None"},{"content":"Goodman, E., Kuniavsky, M., and Moed A. 2012. Observing the User Experience: A Practitioner's Guide to User Research. Morgan Kaufmann; 2 edition (September 21, 2012)","paperID":"None"},{"content":"Hanington, B. and Martin, B. 2012. Universal Methods of Design: 100 Ways to Research Complex Problems, Develop Innovative Ideas, and Design Effective Solutions. Rockport Publishers; 1.2.2012 edition","paperID":"None"},{"content":"Howes, A., Cowan, B. R., Janssen, C. P., Cox, A. L., Cairns, P., Hornof, A. J., Payne, S. J., and Pirolli, P. 2014. Interaction science SIG: overcoming challenges. In CHI EA '14. ACM, New York, NY, USA, 1127--1130.","paperID":"None"},{"content":"Kawamura, Yuniya. 2005. Fashion-ology: An Introduction to Fashion Studies. Berg.","paperID":"None"},{"content":"Lamb, J. & Kallal, M.J. 1992. A Conceptual Framework for Apparel Design. Clothing and Textiles Research Journal January 1992 vol. 10 no. 2 42--47","paperID":"None"},{"content":"Pan, Y. and Blevis, E. 2014. Fashion thinking: lessons from fashion and sustainable interaction design, concepts and issues. In Proc. DIS '14. ACM, New York, NY, USA, 1005--1014.","paperID":"None"},{"content":"Pan, Y., Roedl, D., Blevis, E., and Thomas, J. 2012. Reconceptualizing fashion in sustainable HCI. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 813--815","paperID":"None"}],"title":"What if HCI Becomes a Fashion Driven Discipline?","filename":"CHI15/p2565","authors":["Yue Pan","Erik Stolterman"],"conference":"CHI '15"}