{"paperId":2702152,"citation":[],"abstract":"How are you related to Malawi? Do recent events on the Comoros effect you in any subtle way? Who in your extended social network is in Croatia? We seldom ask ourselves these questions, yet a \"long tail\" of content beyond our everyday knowledge is waiting to be explored. In this work we propose a recommendation task of creating interest in little-known content by building personalized \"bridges\" to users. We consider an example task of interesting users in little-known countries, and propose a system which aggregates a user's Twitter profile, network, and tweets to create an interest model, which is then matched to a library of knowledge about the countries. We perform a user study of 69 participants and conduct 11 in-depth interviews in order to evaluate the efficacy of the proposed approach and gather qualitative insight into the effect of multi-faceted use of Twitter on the perception of the bridges. We find the increase in interest concerning little-known content to greatly depend on the pre-existing disposition to it. Additionally, we discover a set of vital properties good bridges must possess, including recency, novelty, emotiveness, and a proper selection of language. Using the proposed approach we aim to harvest the \"invisible connections\" to make explicit the idea of a \"small world\" where even a faraway country is more closely connected to you than you might have imagined.","reference":[{"content":"Abel, F., Gao, Q., Houben, G.-J., and Tao, K. Analyzing user modeling on twitter for personalized news recommendations. In User Modeling, Adaption and Personalization. Springer, 2011, 1--12.","paperID":"None"},{"content":"Barnes, J. A. Network analysis: Orienting notion, rigorous technique, or substantive field of study. Perspectives on social network research (1979), 403--423.","paperID":"None"},{"content":"Blanco, R., Ceccarelli, D., Lucchese, C., Perego, R., and Silvestri, F. You should read this! let me explain you why: explaining news recommendations to users. In CIKM (2012).","paperID":"None"},{"content":"Borr'as, J., Moreno, A., and Valls, A. Intelligent tourism recommender systems: a survey. Expert Systems with Applications 41 (2014), 7370--7389.","paperID":"None"},{"content":"Cohen, R., and Havlin, S. Scale-free networks are ultrasmall. Physical Review Letters 90, 5 (2003), 058701.","paperID":"None"},{"content":"De Francisci Morales, G., Gionis, A., and Lucchese, C. From chatter to headlines: harnessing the real-time web for personalized news recommendation. In Proceedings of the fifth ACM international conference on Web search and data mining (2012).","paperID":"None"},{"content":"Graells-Garrido, E., Lalmas, M., and Quercia, D. Data portraits: Connecting people of opposing views. arXiv (2013).","paperID":"None"},{"content":"Granovetter, M. S. The strength of weak ties. American journal of sociology (1973), 1360--1380.","paperID":"None"},{"content":"Gross, R., and Acquisti, A. Information revelation and privacy in online social networks. In WPES (2005).","paperID":"None"},{"content":"Herlocker, J. L., Konstan, J. A., and Riedl, J. Explaining collaborative filtering recommendations. In Proceedings of the 2000 ACM conference on Computer supported cooperative work (2000).","paperID":"None"},{"content":"Konstas, I., Stathopoulos, V., and Jose, J. M. On social networks and collaborative recommendation. In SIRI (2009).","paperID":"None"},{"content":"Kwak, H., and An, J. A first look at global news coverage of disasters by using the gdelt dataset. In Social Informatics. Springer, 2014, 300--308.","paperID":"None"},{"content":"McPherson, M., Smith-Lovin, L., and Cook, J. M. Birds of a feather: Homophily in social networks. Annual review of sociology (2001), 415--444.","paperID":"None"},{"content":"Moens, M.-F., Jeuniaux, P., Angheluta, R., and Mitra, R. Measuring aboutness of an entity in a text. In TextGraphs (2006).","paperID":"None"},{"content":"Pariser, E. The filter bubble: What the Internet is hiding from you. London: Penguin, 2011.","paperID":"None"},{"content":"Ricci, F. Travel recommender systems. IEEE Intelligent Systems 17, 6 (2002), 55--57.","paperID":"None"},{"content":"Stutzman, F., Gross, R., and Acquisti, A. Silent listeners: The evolution of privacy and disclosure on facebook. Journal of Privacy and Confidentiality 4, 2 (2013), 2.","paperID":"None"},{"content":"Symeonidis, P., Krinis, A., and Manolopoulos, Y. Geosocialrec: Explaining recommendations in location-based social networks. In ADBIS (2013).","paperID":"None"},{"content":"Takhteyev, Y., Gruzd, A., and Wellman, B. Geography of Twitter networks. Social Networks 34, 1 (2012), 73--81.","paperID":"None"},{"content":"Travers, J., and Milgram, S. An experimental study of the small world problem. Sociometry 32, 4 (1969), 425--443.","paperID":"None"},{"content":"Vig, J., Sen, S., and Riedl, J. Tagsplanations: explaining recommendations using tags. In Proceedings of the 14th international conference on Intelligent user interfaces (2009).","paperID":"None"},{"content":"Walter, F. E., Battiston, S., and Schweitzer, F. A model of a trust-based recommendation system on a social network. Autonomous Agents and Multi-Agent Systems 16, 1 (2008), 57--74.","paperID":"None"},{"content":"Weng, L., Flammini, A., Vespignani, A., and Menczer, F. Competition among memes in a world with limited attention. Nature Scientific Reports 2 (2012).","paperID":"None"},{"content":"Wu, A., DiMicco, J. M., and Millen, D. R. Detecting professional versus personal closeness using an enterprise social network site. In CHI (2010).","paperID":"None"},{"content":"Xie, W., Li, C., Zhu, F., Lim, E.-P., and Gong, X. When a friend in twitter is a friend in life. In WebSci (2012).","paperID":"None"},{"content":"Zhang, Y. C., Séaghdha, D. O., Quercia, D., and Jambor, T. Auralist: introducing serendipity into music recommendation. In WSDM (2012).","paperID":"None"},{"content":"Zuckerman, E. Using the internet to examine patterns of foreign coverage. Nieman Reports Fall (2004). http://niemanreports.org/articles/using-the-internet-toexamine-patterns-of-foreign-coverage/.","paperID":"None"},{"content":"Zuckerman, E. Rewire: Digital Cosmopolitans in the Age of Connection. W. W. Norton & Company, 2013.","paperID":"None"}],"title":"Bridges into the Unknown: Personalizing Connections to Little-known Countries","filename":"CHI15/p2633","authors":["Yelena Mejova","Javier Borge-Holthoefer","Ingmar Weber"],"conference":"CHI '15"}