{"paperId":2702156,"citation":[{"content":"Minal Jain , Sarita Seshagiri , Aditya Ponnada, So You Think You Are a Multitasker?: A Qualitative Study to Understand Multitasking, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838800"}],"abstract":"In this paper we present a computational cognitive model of task interruption and resumption, focusing on the effects of the problem state bottleneck. Previous studies have shown that the disruptiveness of interruptions is for an important part determined by three factors: interruption duration, interrupting-task complexity, and moment of interruption. However, an integrated theory of these effects is still missing. Based on previous research into multitasking, we propose a first step towards such a theory in the form of a process model that attributes these effects to problem state requirements of both the interrupted and the interrupting task. Subsequently, we tested two predictions of this model in two experiments. The experiments confirmed that problem state requirements are an important predictor for the disruptiveness of interruptions. This suggests that interfaces should be designed to a) interrupt users at low-problem state moments and b) maintain the problem state for the user when interrupted.","reference":[{"content":"Adamczyk, P.D. and Bailey, B.P. If not now, when? In Proc. CHI. 2004, 271--278.","paperID":"None"},{"content":"Altmann, E.M. and Trafton, J.G. Memory for goals: An activation-based model. Cognitive Science 26, (2002), 39--83.","paperID":"None"},{"content":"Altmann, E.M. and Trafton, J.G. Timecourse of recovery from task interruption: data and a model. Psychonomic Bulletin & Review 14, 6 (2007), 1079--84.","paperID":"None"},{"content":"Altmann, E.M., Trafton, J.G., and Hambrick, D.Z. Momentary interruptions can derail the train of thought. Journal of Experimental Psychology: General 143, 1 (2014), 215--226.","paperID":"None"},{"content":"Anderson, J.R. Human symbol manipulation within an integrated cognitive architecture. Cognitive Science 29, (2005), 313--341.","paperID":"None"},{"content":"Anderson, J.R. How Can the Human Mind Occur in the Physical Universe? Oxford University Press, New York, 2007.","paperID":"None"},{"content":"Bogunovich, P. and Salvucci, D. The effects of time constraints on user behavior for deferrable interruptions. Proc. CHI, (2011), 3123--3126.","paperID":"None"},{"content":"Borst, J.P., Buwalda, T.A., Van Rijn, H., and Taatgen, N.A. Avoiding the Problem State Bottleneck by Strategic use of the Environment. Acta Psychologica 144, 2 (2013), 373--379.","paperID":"None"},{"content":"Borst, J.P. and Taatgen, N.A. The Costs of Multitasking in Threaded Cognition. In Proc. ICCM. 2007, 133--138.","paperID":"None"},{"content":"Borst, J.P., Taatgen, N.A., and Van Rijn, H. The Problem State: A Cognitive Bottleneck in Multitasking. Journal of Experimental Psychology: Learning, Memory, & Cognition 36, 2 (2010), 363--382.","paperID":"None"},{"content":"Borst, J.P., Taatgen, N.A., and Van Rijn, H. Using a Symbolic Process Model as input for Model-Based fMRI Analysis: Locating the Neural Correlates of Problem State Replacements. NeuroImage 58, 1 (2011), 137--147.","paperID":"None"},{"content":"Borst, J.P., Taatgen, N.A., Stocco, A., and Van Rijn, H. The Neural Correlates of Problem States: Testing fMRI Predictions of a Computational Model of Multitasking. PLoS ONE 5, 9 (2010), e12966.","paperID":"None"},{"content":"Cades, D.M., Davis, D.A.B., Trafton, J.G., and Monk, C.A. Does the Difficulty of an Interruption Affect our Ability to Resume? In Proc. HFES. 2007, 234--238.","paperID":"None"},{"content":"Cades, D.M., Werner, N., Boehm-Davis, D.A., Trafton, J.G., and Monk, C.A. Dealing with Interruptions can be Complex, but does Interruption Complexity Matter: A Mental Resources Approach to Quantifying Disruptions. In Proc. HFES. 2008, 398--402.","paperID":"None"},{"content":"Chisholm, C.D., Dornfeld, A.M., Nelson, D.R., and Cordell, W.H. Work interrupted: A comparison of workplace interruptions in emergency departments and primary care offices. Annals of Emergency Medicine 38, 2 (2001), 146--151.","paperID":"None"},{"content":"Cutrell, E., Czerwinski, M., and Horvitz, E. Notification, disruption, and memory: Effects of messaging interruptions on memory and performance. In Proc. INTERACT. 2001.","paperID":"None"},{"content":"Czerwinski, M., Horvitz, E., and Wilhite, S. A diary study of task switching and interruptions. In Proc. CHI. 2004, 175--182.","paperID":"None"},{"content":"Edwards, M.B. and Gronlund, S.D. Task Interruption and its Effects on Memory. Memory 6, 6 (1998), 665--687.","paperID":"None"},{"content":"Eyrolle, H. and Cellier, J.-M. The effects of interruptions in work activity: field and laboratory results. Applied Ergonomics 31, 5 (2000), 537--543.","paperID":"None"},{"content":"Gillie, T. and Broadbent, D.E. What makes interruptions disruptive? A study of length, similarity, and complexity. Psychological Research 50, (1989), 243--250.","paperID":"None"},{"content":"González, V. and Mark, G. Constant, constant, multitasking craziness: managing multiple working spheres. In Proc. CHI. 2004, 113--120.","paperID":"None"},{"content":"Gould, S., Brumby, D., and Cox, A.L. What does it mean for an interruption to be relevant? An investigation of relevance as a memory effect. In Proc. HFES. 2013, 149--153.","paperID":"None"},{"content":"Hodgetts, H.M. and Jones, D.M. Interruption of the Tower of London task: support for a goal-activation approach. Journal of Experimental Psychology: General 135, 1 (2006), 103--15.","paperID":"None"},{"content":"Iqbal, S.T., Adamczyk, P., Zheng, X., and Bailey, B.P. Towards an index of opportunity: understanding changes in mental workload during task execution. In Proc. SIGCHI. 2005, 311--320.","paperID":"None"},{"content":"Iqbal, S.T. and Bailey, B.P. Investigating the effectiveness of mental workload as a predictor of opportune moments for interruption. In Proc. CHI. 2005, 1489--1492.","paperID":"None"},{"content":"Iqbal, S.T. and Bailey, B.P. Leveraging characteristics of task structure to predict the cost of interruption. In Proc. CHI. 2006, pp. 741--750.","paperID":"None"},{"content":"Iqbal, S.T. and Horvitz, E. Disruption and recovery of computing tasks. In Proc. CHI. 2007, 677--686.","paperID":"None"},{"content":"Jin, J. and Dabbish, L.A. Self-interruption on the computer: A Typology of Discretionary Task Interleaving. In Proc. CHI. 2009, 1799--1808.","paperID":"None"},{"content":"Katidioti, I., Borst, J.P., and Taatgen, N.A. What Happens When We Switch Tasks: Pupil dilation in multitasking. Journal of Experimental Psychology: Applied, (in press).","paperID":"None"},{"content":"Katidioti, I. and Taatgen, N.A. Choice in Multitasking: How Delays in the Primary Task Turn a Rational Into an Irrational Multitasker. Human Factors 56, 4 (2014), pp. 728--736.","paperID":"None"},{"content":"Mark, G., González, V., and Harris, J. No task left behind?: examining the nature of fragmented work. In Proc. CHI. 2005, 321--330.","paperID":"None"},{"content":"McFarlane, D. Comparison of Four Primary Methods for Coordinating the Interruption of People in HumanComputer Interaction. Human-Computer Interaction 17, 1 (2002), 63--139.","paperID":"None"},{"content":"McFarlane, D.C. and Latorella, K.A. The scope and importance of human interruption in human-computer interaction design. Human-Computer Interaction 17, 1 (2002), pp. 1--61.","paperID":"None"},{"content":"Monk, C.A., Boehm-Davis, D.A., and Trafton, J.G. Recovering From Interruptions: Implications for Driver Distraction Research. Human Factors 46, 4 (2004), 650--663.","paperID":"None"},{"content":"Monk, C.A., Trafton, J.G., and Boehm-Davis, D.A. The effect of interruption duration and demand on resuming suspended goals. Journal of Experimental Psychology: Applied 14, 4 (2008), pp. 299--313.","paperID":"None"},{"content":"Monsell, S. Task switching. Trends in Cognitive Sciences 7, 3 (2003), 134--140.","paperID":"None"},{"content":"Nijboer, M., Borst, J.P., Van Rijn, H., and Taatgen, N.A. Single-task fMRI overlap predicts concurrent multitasking interference. NeuroImage 100, (2014), 60--74.","paperID":"None"},{"content":"Oberauer, K. Design for a working memory. In B.H. Ross, ed., Psychology of Learning and Motivation. Academic Press, 2009, 45--100.","paperID":"None"},{"content":"Renaud, K. Expediting Rapid Recovery from Interruptions by Providing a Visualisation of Application Activity. In Proc. OZCHI. 2000, 348--355.","paperID":"None"},{"content":"Van Rijn, H., Dalenberg, J.R., Borst, J.P., and Sprenger, S.A. Pupil Dilation Co-Varies with Memory Strength of Individual Traces in a Delayed Response PairedAssociate Task. PLoS ONE 7, 12 (2012), e51134.","paperID":"None"},{"content":"Rosen, L.D., Mark Carrier, L., and Cheever, N.A. Facebook and texting made me do it: Media-induced task-switching while studying. Computers in Human Behavior 29, 3 (2013), 948--958.","paperID":"None"},{"content":"Salvucci, D.D. and Bogunovich, P. Multitasking and monotasking: the effects of mental workload on deferred task interruptions. In Proc. CHI. ACM Press, 2010, 85--88.","paperID":"None"},{"content":"Salvucci, D.D., Monk, C.A., and Trafton, J.G. A Process-Model Account of Task Interruption and Resumption: When Does Encoding of the Problem State Occur? In Proc. HFES. Human Factors and Ergonomics Society, 2009, pp. 799--803.","paperID":"None"},{"content":"Salvucci, D.D. and Taatgen, N.A. The multitasking mind. Oxford University Press, New York, 2011.","paperID":"None"},{"content":"Trafton, J.G., Altmann, E.M., Brock, D.P., and Mintz, F.E. Preparing to resume an interrupted task: effects of prospective goal encoding and retrospective rehearsal. International Journal of Human-Computer Studies 58, 5 (2003), 583--603.","paperID":"None"},{"content":"Zijlstra, F.R.H., Roe, R.A., Leonora, A.B., and Krediet, I. Temporal factors in mental work: Effects of interrupted activities. Journal of Occupational and Organizational Psychology 72, (1999), pp. 163--185.","paperID":"None"}],"title":"What Makes Interruptions Disruptive?: A Process-Model Account of the Effects of the Problem State Bottleneck on Task Interruption and Resumption","filename":"CHI15/p2971","authors":["Jelmer P. Borst","Niels A. Taatgen","Hedderik van Rijn"],"conference":"CHI '15"}