{"paperId":2702383,"citation":[],"abstract":"Many teens struggle with school writing and particularly in identifying personally relevant topics, which motivate writing improvement. However, a wealth of potential topics is available through their social media data. We explore the design of Sparkfolio, a prewriting support tool that aims to help students successfully prepare meaningful writing topics from their own social media content. This web-delivered tool was evaluated with 46 teen users in the context of their high school English class. Findings demonstrate that the use of social media can enhance the quality of written outcomes, as Sparkfolio users had significantly greater gains than a control group.","reference":[{"content":"Anderman, E.M. and Maehr, M.L. Motivation and Schooling in the Middle Grades. Review of Educational Research 64, 2 (1994), 287--309.","paperID":"None"},{"content":"Atwell, N. Lessons That Change Writers. Firsthand, Portsmouth, NH, USA, 2002.","paperID":"None"},{"content":"Aydin, S. A review of research on Facebook as an educational environment. Educational Technology Research and Development 60, 6 (2012), 1093--1106.","paperID":"None"},{"content":"Berninger, V., Whitaker, D., Feng, Y., Swanson, H.L., and Abbott, R.D. Assessment of Planning, Translating, and Revising in junior High Writers. Journal of School Psychology 34, 1 (1996), 23--52.","paperID":"None"},{"content":"Brooke, J. SUS: A \"Quick and Dirty\" Usability Scale. In P.W. Jordan, B. Thomas, B.A. Weerdmeester and I.L. McClelland, eds., Usability Evaluation in Industry. Taylor & Francis, Bristol, PA, USA, 1996, 189--194.","paperID":"None"},{"content":"Burtis, P., Bereiter, C., Scardamalia, M., and Tetroe, J. The Development of Planning in Writing. Wiley, Chichester, England, 1983.","paperID":"None"},{"content":"Daragh Byrne , Aisling Kelliher , Gareth J.F. Jones, Life editing: third-party perspectives on lifelog content, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979162"},{"content":"Charmaz, K. Grounded Theory. In J.A. Smith, ed., Qualitative Psychology: A Practical Guide to Research Methods. Sage Publications, London, 2003, 81--110.","paperID":"None"},{"content":"Danoff, B., Harris, K., and Graham, S. Incorporating strategy instruction within the writing process in the regular classroom: Effects on the writing of students with and without learning disabilities. Journal of Literacy Research 25, 3 (1993), 295--322.","paperID":"None"},{"content":"Ellison, N.B., Steinfield, C., and Lampe, C. The Benefits of Facebook \"Friends:\" Social Capital and College Students' Use of Online Social Network Sites. Journal of Computer-Mediated Communication 12, 4 (2007), 1143--1168.","paperID":"None"},{"content":"Graham, S. and Perin, D. A meta-analysis of writing instruction for adolescent students. Journal of Educational Psychology 99, 3 (2007), 445--476.","paperID":"None"},{"content":"Hayes, J. A new framework for understanding cognition and affect in writing. In M. Levy and S. Ransdell, eds., The science of writing: Theories, methods, individual differences, and applications. Erlbaum, Mahwah, NJ, USA, 1996, 1--27.","paperID":"None"},{"content":"Kellogg, R.T. Effects of topic knowledge on the allocation of processing time and cognitive effort to writing processes. Memory & cognition 15, 3 (1987), 256--266.","paperID":"None"},{"content":"De La Paz, S. and Graham, S. Explicitly teaching strategies, skills, and knowledge: Writing instruction in middle school classrooms. Journal of Educational Psychology 94, 4 (2002), 687--698.","paperID":"None"},{"content":"Lenhart, A., Arafeh, S., Smith, A., and Macgill, A.R. Writing, Technology and Teens. Washington, DC, USA, 2008.","paperID":"None"},{"content":"Lenhart, A., Purcell, K., and Zickuhr, K. Social Media & Mobile Internet Use Among Teens and Young Adults. Washington, DC, USA, 2010.","paperID":"None"},{"content":"Madden, M., Lenhart, A., Duggan, M., Cortesi, S., and Gasser, U. Teens and Technology 2013. Washington, DC, USA, 2013.","paperID":"None"},{"content":"Moreau, C.P. and Dahl, D.W. Designing the Solution: The Impact of Constraints on Consumers' Creativity. Journal of Consumer Research 32, 1 (2005), 13--22.","paperID":"None"},{"content":"Pajares, F. Self-Efficacy Beliefs, Motivation, and Achievement in Writing: A Review of the Literature. Reading & Writing Quarterly 19, (2003), 139--159.","paperID":"None"},{"content":"Piazza, C.L. and Siebert, C.F. Development and Validation of a Writing Dispositions Scale for Elementary and Middle School Students. The Journal of Educational Research 101, 5 (2008), 275--286.","paperID":"None"},{"content":"Prensky, M. Digital Natives, Digital Immigrants Part 1. On the Horizon 9, 5 (2001), 1--6.","paperID":"None"},{"content":"John Sadauskas , Daragh Byrne , Robert K. Atkinson, Toward social media based writing, Proceedings of the Second international conference on Design, User Experience, and Usability: health, learning, playing, cultural, and cross-cultural user experience, July 21-26, 2013, Las Vegas, NV","paperID":"2530944"},{"content":"Valkenburg, P.M., Peter, J., and Schouten, A.P. Friend networking sites and their relationship to adolescents' well-being and social self-esteem. Cyberpsychology & behavior: The impact of the Internet, multimedia and virtual reality on behavior and society 9, 5 (2006), 584--590.","paperID":"None"},{"content":"Vojak, C., Kline, S., Cope, B., McCarthey, S., and Kalantzis, M. New Spaces and Old Places: An Analysis of Writing Assessment Software. Computers and Composition 28, 2 (2011), 97--111.","paperID":"None"},{"content":"Official Scoring Guide: Arizona's Instrument to Measure Standards - Holistic Rubric Based on 6 Traits of Writing. Arizona Department of Education, 2010.","paperID":"None"},{"content":"The Nation's Report Card: Writing. Washington, DC, USA, 2011.","paperID":"None"},{"content":"Assesssment: AIMS Writing. Arizona Department of Education, 2013. http://www.azed.gov/standardsdevelopment-assessment/aims/aims-writing/.","paperID":"None"}],"title":"Mining Memories: Designing a Platform to Support Social Media Based Writing","filename":"CHI15/p3691","authors":["John Sadauskas","Daragh Byrne","Robert K. Atkinson"],"conference":"CHI '15"}