{"paperId":2702176,"abstract":"We present a method for the situated discovery and articulation of issues at the intersection between the politics of place making and city planning. We describe the construction and use of designed tools, such as historical political archives; counterfactual maps; and cards to invite situated dialogue between the social and institutional practices and mechanisms that produce our cities. Grounded in an account of the political as vernacular and embodied, our analysis advance understandings on the politics of design, and on the complex interrelationship between places and political spaces. We outline how HCI can adopt methods and develop sensitivities to support democratic practices and publics envisioning their urban futures.","reference":[{"content":"Aoki, P.M., Honicky, R.J., Mainwaring, A., et al. A Vehicle for Research?: Using Street Sweepers to Explore the Landscape of Environmental Community Action. In Proc. of CHI '09, ACM (2009), 375--384.","paperID":"None"},{"content":"Bidwell, N., Syia, M., Marsden, G., et al. Walking and the social life of solar charging in rural africa. ACM TOCHI, (2008), 20, 4, 22.","paperID":"None"},{"content":"Björgvinsson, E., Ehn, P., and Hillgren, P.A. Participatory design and \"democratizing innovation\". In Proc. PDC 2010, ACM (2010), 41--50.","paperID":"None"},{"content":"Boyte, H.,C., Everyday Politics: Reconnecting Citizens and Public Life, University of Pennsylvania Press, 2005.","paperID":"None"},{"content":"Braun, V., Clarke, V., Using thematic analysis in reaserch, Qualitative Research in Psychology, 2006, 3(2), 77--101.","paperID":"None"},{"content":"Casey, E.,S., How to get from space to place in a farily short stretch of time, in Senses of Place, Santa FE:School of American Research Press, 1997.","paperID":"None"},{"content":"Crivellaro, C., Comber, R., Bowers, J., Wright,P., Olivier,P., A Pool of Dreams: Facebook, Politics and the Emergence of a Social Movement, In Proc.CHI'14, ACM Press (2014), 3573--3582.","paperID":"None"},{"content":"DiSalvo, C. Adversarial Design (Design Thinking, Design Theory). The MIT Press, 2012.","paperID":"None"},{"content":"Di Salvo, C., Nourbakhsh,I., Holstius, D., Neighborhood Network Project: A case Study of Critical Engagement and Creative Expression Through Participatory Design. In Proc. of CHI'10, ACM Press (2010), 41--50.","paperID":"None"},{"content":"Di Salvo, C, Lukens, J., Lodato, T., Jenkins, T., Kim, T., Making Public Things: How HCI Design Can Express Matters of Concern. In Proc. CHI'14, ACM Press (2014), 2397--2406.","paperID":"None"},{"content":"Dearden, A. and Light, A. Designing for e-Social Action An Application Taxonomy. In Proc. Design Reaserch Society Conference 2008, Sheffield Hallam University (2008).","paperID":"None"},{"content":"De Certeau, M., The practice of everyday life, Berkeley University of California Press, 2011.","paperID":"None"},{"content":"Dourish, P. HCI and environmental sustainability: the politics of design and the design of politics, In Proc. DIS 2010, ACM(2010), 1--10.","paperID":"None"},{"content":"Dourish, P., Mainwaring, D, S., Ubicomp's Colonial Impulse, In Proc.Ubicomp'12, ACM (2012), 133--144","paperID":"None"},{"content":"Farias, I., The Politics of Urban Assemblages, City, 2011, 15(3), 365--374","paperID":"None"},{"content":"Fowler, A. Biekart, K., (eds) Civic Driven Change: Civic Imagination in Action, The Hague Institute of Social Studies, 2008.","paperID":"None"},{"content":"Harrison, S., Dourish, P., Re-place-ing space: The Role of Place and Space in Collaborative Systems, In Proc. CSCW '96, ACM Press (1996), 67--76.","paperID":"None"},{"content":"Hauser, G., McClellan, E., D., Vernacular Rhetoric and Social Movements: performances of resistance in the rhetoric of the everyday, in McKenzie Stevens, S., Malesh, P., Active Voices: Composing a Rhetoric of Social Movements, Suny Press, 2009.","paperID":"None"},{"content":"Harvey, D., The Condition of Postmodernity, WileyBlackwell, 1999.","paperID":"None"},{"content":"Holland, R., Vail, J., The art of social movement: cultural opportunity, mobilisation and framing in the early formation of the Amber Collectives, Poetics, 2012, 40, 22--43.","paperID":"None"},{"content":"Lee, J., Ingold, T., Fieldwork on Foot: Perceiving, Perceiving, Routing, Socializing, in Collins, P., Coleman, S., (eds) Locating the Field, Space, Place and Context in Anthropology, Oxford: Berg, 2006.","paperID":"None"},{"content":"Lentini, L., Decortis, F., Space and Places: When Interacting with and in Physical Space Becomes a meaningful Experience, Personal Ubiquitous Comput, 2010, 14, 407--415.","paperID":"None"},{"content":"Light, A., Democratizing Technology: Making Transformations using designing, Performance and Props, In Proc. CHI'11, ACM Press, (2011), 2239--2242.","paperID":"None"},{"content":"Light, A., The Politics of Representing Culture in Ubiquitous Media: Challenging National Cultural Norms by Studying a Map with Indian and British Users, Personal Ubiquitous Comput, 2011, 15:585--596","paperID":"None"},{"content":"Le Dantec, C., Di Salvo, K., Infrastructing and the formation of publics in participatory Design, Social Studies of Science, 2013, 43(2), 241--264","paperID":"None"},{"content":"Le Dantec, C., Participation and Publics: Supporting Community Engagement. In Proc. CHI'12, ACM Press (2012), 1351--1360.","paperID":"None"},{"content":"Le Dantec, C., The Right Way to Make Smart City, http://goo.gl/Y9tNDr, retrieved on 05.22.14","paperID":"None"},{"content":"Lukens, J., Di Salvo, C., Speculative Design and Technological Fluency, MIT Press, 2012, 3(4), 23--40.","paperID":"None"},{"content":"Kuznetsov, S., Odom, W., Moulder, V., et al. HCI , Politics and the city?: engaging with urban grassroots movements for reflection and action. Ext. Abtracts CHI 2011, ACM (2011), 2409--2412.","paperID":"None"},{"content":"Kuznetsov, S., Paulos, E., and Gross, M. WallBots: interactive wall-crawling robots in the hands of public artists and political activists. In Proc. DIS 2010, ACM Press (2010), 208--217","paperID":"None"},{"content":"Markussen, T., The Disruptive Aesthetic of Design Activism: Enacting Design between Arts and Politics, DesignIssue, 2013, 29, 1.","paperID":"None"},{"content":"Olander, S., Lenskjold,T.,U., Yndigegn, Foverskov,M., Mobilising for Community Building and Everyday Innovation, Interactions, 2011, 18(4), 28--32.","paperID":"None"},{"content":"Paulos,E., Jenkins, T., Urban Probes: Encountering our Emergent Urban Athmosphere. In Proc. CHI'05, ACM Press (2005), 341--350.","paperID":"None"},{"content":"Paulos, E., Citizen Science: Enabling Participatory Urbanism, in Foth, M., Handbook of Research on Urban Informatics: The Practice and Promise of The Real Time City, IGI Global, 2009.","paperID":"None"},{"content":"Pink, S., Mackley, L.,K., Mitchell, V., et al. Applying the lens of sensory ethnography to sustainable HCI, ACM TOCHI, 2008, 20, 4, 25.","paperID":"None"},{"content":"Ratto, M., Boler, M., DIY Citizenship: Critical Making and Social Media, The MIT Press, 2014.","paperID":"None"},{"content":"Rodriguez-Amat, R.J., Brantner, C., Space and Place matters: a tool for the analysis of geolocated and mapped protests, New Media and Society, 2014, 1--20.","paperID":"None"},{"content":"Sadler S., The Situationist City, MIT Press, 1999.","paperID":"None"},{"content":"Sanders, E., B., N., Stappers, P.J., Probes, Toolkits and Prototypes: Three Approaches to Making in Co-Design, CoDesign, 2014, 10(1), 5--14.","paperID":"None"},{"content":"Self, W., Walking is Political, The Guardian, retrieved on 03.14, http://goo.gl/X44Fbb","paperID":"None"},{"content":"Suchman, L., Human Machine Reconfigurations Plans and Situated Actions, Cambridge University Press, 2000","paperID":"None"},{"content":"Wright, P., McCarthy, J., Experience-Centered Design: Designers, Users and Communities in Dialogue, Morgan and Claypool, 2010.","paperID":"None"}],"citation":[],"title":"Contesting the City: Enacting the Political Through Digitally Supported Urban Walks","filename":"CHI15/p2853","authors":["Clara Crivellaro","Rob Comber","Martyn Dade-Robertson","Simon J. Bowen","Peter C. Wright","Patrick Olivier"],"conference":"CHI '15"}