{"paperId":2702519,"citation":[],"abstract":"We describe a study of Monkey Tales, an educational game targeted at primary school children. Starting from the assumption that all meaning is socially constructed, we focus our attention on the way an educational game, and its balance between fun and serious aspects, is constructed in public texts (game manufacturer's communication and game reviews) and in individual use (the way players and their parents talk about the game). Through an analysis of public texts and individual use, we show how the balance between the fun and the serious in Monkey Tales is constructed in different ways.","reference":[{"content":"Avatargeneration (2014) Chimply Marvellous Monkey Tales Educational Games. http://www.avatargeneration.com/2014/01/chimplymarv ellous-monkey-tales-educational-games/ Accessed 0910--2014.","paperID":"None"},{"content":"Barker, C. (2000). Cultural Studies. Theory and Practice. The Alden Press.","paperID":"None"},{"content":"Pippin Barr , James Noble , Robert Biddle, Video game values: Human-computer interaction and games, Interacting with Computers, v.19 n.2, p.180-195, March, 2007","paperID":"1224833"},{"content":"Bellotti, F., Berta, R., De Gloria, A. (2010). Designing Effective Serious Games: Opportunities and Challenges for Research. iJET 5(SI3), 22--35.","paperID":"None"},{"content":"Brutalgamer.com (2011) Monkey Tales Games (PC) Review. brutalgamer.com, Accessed 12-09--2013.","paperID":"None"},{"content":"De Castell, S., Jenson, J. (2003). OP-ED. Serious Play. Journal of Curriculum Studies 35(6), 649--665.","paperID":"None"},{"content":"Fairclough, N. (2013) Critical Discourse Analysis. The Critical Study of Language. 2nd Edition. Routledge.","paperID":"None"},{"content":"James Paul Gee, What Video Games Have to Teach Us About Learning and Literacy, Palgrave Macmillan, 2004","paperID":"983348"},{"content":"Habgood, M.P.J. (2007). The Effective Integration of Digital Games and Learning Content. Unpublished doctoral dissertation, University of Nottingham.","paperID":"None"},{"content":"Ellie Harmon , Melissa Mazmanian, Stories of the Smartphone in everyday discourse: conflict, tension & instability, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2466134"},{"content":"Katherine Isbister , Mary Flanagan , Chelsea Hash, Designing games for learning: insights from conversations with designers, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753637"},{"content":"Larian Studios (2010). monkeytalesgames.com. Accessed 07--18--2013.","paperID":"None"},{"content":"Meyer, B. & Sorensen, B.H. (2009). Designing Serious Games for Computer Assisted Language Learning -- a Framework for Development and Analysis. In: Kankaanranta, M., & Neittaanmäki, P. (Eds.), Design and Use of Serious Games (pp. 69--82). Springer.","paperID":"None"},{"content":"Konstantin Mitgutsch , Narda Alvarado, Purposeful by design?: a serious game design assessment framework, Proceedings of the International Conference on the Foundations of Digital Games, May 29-June 01, 2012, Raleigh, North Carolina","paperID":"2282364"},{"content":"Jorick Vissers , Lode De Bot , Bieke Zaman, MemoLine: evaluating long-term UX with children, Proceedings of the 12th International Conference on Interaction Design and Children, p.285-288, June 24-27, 2013, New York, New York, USA","paperID":"2485836"},{"content":"Wakelin, N. (2011) Review: Monkey Tales PC Games Combine Math, Mazes and Fun! Wired Geekmom www.wired.com/geekmom/ Accessed 12-09-2013.","paperID":"None"}],"title":"The Fun and the Serious in an Educational Game: The Monkey Tales Case","filename":"CHI15/p2829","authors":["Jan Derboven","Bieke Zaman","Jorick Vissers","David Geerts","Dirk De Grooff"],"conference":"CHI '15"}