{"paperId":2702325,"abstract":"While extensive research has investigated the risks of children sharing their personal information online, little work has investigated the implications of parents sharing personal information about their children online. Drawing on 102 interviews with parents in the U.S., we investigate how parents decide what to disclose about their children on social network sites (SNSs). We find that mothers take on the responsibility of sharing content about their children more than fathers do. Fathers are more restrictive about sharing to broad and professional audiences and are concerned about sharing content that could be perceived as sexually suggestive. Both mothers and fathers work to leverage affordances of SNSs to limit oversharing. Building on prior work, we explore parental disclosure management, which describes how parents decide what to share about their children online. We also describe an emerging third shift of work that highlights the additional work parents take on to manage children's identities online. We conclude with theoretical and practical implications for designing SNSs to better support family life online.","citation":[{"content":"Lindsay Blackwell , Emma Gardiner , Sarita Schoenebeck, Managing Expectations: Technology Tensions among Parents and Teens, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819928"},{"content":"Alexis Hiniker , Sarita Y. Schoenebeck , Julie A. Kientz, Not at the Dinner Table: Parents' and Children's Perspectives on Family Technology Rules, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819940"},{"content":"Anicia N. Peters , Heike Winschiers-Theophilus , Brian E. Mennecke, Cultural influences on Facebook practices, Computers in Human Behavior, v.49 n.C, p.259-271, August 2015","paperID":"2778645"},{"content":"Raymundo Cornejo , Robin Brewer , Caroline Edasis , Anne Marie Piper, Vulnerability, Sharing, and Privacy: Analyzing Art Therapy for Older Adults with Dementia, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819960"},{"content":"Tawfiq Ammari , Sarita Schoenebeck, “Thanks for your interest in our Facebook group, but it's only for dads”: Social Roles of Stay-at-Home Dads, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819927"},{"content":"Svetlana Yarosh , Elizabeth Bonsignore , Sarah McRoberts , Tamara Peyton, YouthTube: Youth Video Authorship on YouTube and Vine, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819961"}],"reference":[{"content":"Morgan Ames , Dean Eckles , Mor Naaman , Mirjana Spasojevic , Nancy House, Requirements for mobile photoware, Personal and Ubiquitous Computing, v.14 n.2, p.95-109, February  2010","paperID":"1731501"},{"content":"Ammari, T., Schoenebeck, S.Y., and Morris, M.R. Accessing Social Support and Overcoming Judgment on Social Media among Parents of Children with Special Needs. In Proc. ICWSM, AAAI, (2014).","paperID":"None"},{"content":"Madeline Balaam , Judy Robertson , Geraldine Fitzpatrick , Rebecca Say , Gillian Hayes , Melissa Mazmanian , Belinda Parmar, Motherhood and HCI, CHI '13 Extended Abstracts on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2479650"},{"content":"Bartel Sheehan, K. An investigation of gender differences in on-line privacy concerns and resultant behaviors. J. of Int. Marketing 13, 4 (1999), 24--38.","paperID":"None"},{"content":"Bartholomew, M.K., Schoppe-Sullivan, S.J., Glassman, M., Kamp Dush, C.M., and Sullivan, J.M. New Parents' Facebook Use at the Transition to Parenthood. Family Relations 61, 3 (2012), 455--469.","paperID":"None"},{"content":"Andrew Besmer , Heather Richter Lipford, Moving beyond untagging: photo privacy in a tagged world, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753560"},{"content":"Boyd, D., Hargittai, E., Schultz, J., and Palfrey, J. Why parents help their children lie to Facebook about age: Unintended consequences of the 'Children's Online Privacy Protection Act'. First Monday 16, 11 (2011).","paperID":"None"},{"content":"A.J. Bernheim Brush , Kori M. Inkpen , Kimberly Tee, SPARCS: exploring sharing suggestions to enhance family connectedness, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460661"},{"content":"Cherlin, A. The Marriage-Go-Round: The State of Marriage and the Family in America Today. Knopf, 2009.","paperID":"None"},{"content":"Serge Egelman , A.J. Bernheim Brush , Kori M. Inkpen, Family accounts: a new paradigm for user accounts within the home environment, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460666"},{"content":"Ellison, N.B., Steinfield, C., and Lampe, C. Connection strategies: Social capital implications of Facebookenabled communication practices. New Media & Society 13, 6 (2011), 873--892.","paperID":"None"},{"content":"Eriksson, H. and Salzmann-Erikson, M. Supporting a caring fatherhood in cyberspace -- an analysis of communication about caring within an online forum for fathers. Scand. J. of Caring Sci. 27, 1 (2013), 63--69.","paperID":"None"},{"content":"Fletcher, R. and StGeorge, J. Heading Into FatherhoodNervously: Support for Fathering From Online Dads. Qual. Health Res. 21, 8 (2011), 1101--1114.","paperID":"None"},{"content":"Gibson, J. The theory of affordances. Hilldale, 1977.","paperID":"None"},{"content":"Lorna Gibson , Vicki L. Hanson, Digital motherhood: how does technology help new mothers?, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470700"},{"content":"Hochschild, A.R. and Machung, A. The Second Shift: Working Parents and the Revolution at Home. Viking, 1989.","paperID":"None"},{"content":"Hogan, B. The presentation of self in the age of social media: Distinguishing performances and exhibitions online. Bull. of Sci., Tech. & Soc. 30, 6 (2010), 377--386.","paperID":"None"},{"content":"Hoy, M.G. and Milne, G. Gender Differences in Privacy-Related Measures for Young Adult Facebook Users. J. of Interactive Advertising 10, 2 (2010), pp. 28--45.","paperID":"None"},{"content":"Hsieh, H.-F. and Shannon, S.E. Three approaches to qualitative content analysis. Qualitative Health Research 15, 9 (2005), 1277--1288.","paperID":"None"},{"content":"Kim Parker and Wendy Wang. Modern Parenthood. Pew Research, 2013.","paperID":"None"},{"content":"Airi Lampinen , Vilma Lehtinen , Asko Lehmuskallio , Sakari Tamminen, We're in it together: interpersonal management of disclosure in social network services, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979420"},{"content":"Lincoln, Y.S. and Guba, E.G. Designing a naturalistic inquiry. Naturalistic inquiry, (1985), 221--249.","paperID":"None"},{"content":"Litt, E. Knock, Knock. Who's There? The Imagined Audience. Journal of Broadcasting & Electronic Media 56, 3 (2012), 330--345.","paperID":"None"},{"content":"Livingstone, S. and Helsper, E. Parental Mediation of Children's Internet Use. Journal of Broadcasting & Electronic Media 52, 4 (2008), 581--599.","paperID":"None"},{"content":"Livingstone, S. and Helsper, E. Balancing opportunities and risks in teenagers' use of the internet: the role of online skills and internet self-efficacy. New Media & Society 12, 2 (2010), 309--329.","paperID":"None"},{"content":"Madden, M. Privacy management on social media sites. Pew Research Center, 2012.","paperID":"None"},{"content":"Melissa Mazmanian , Ingrid Erickson, The product of availability: understanding the economic underpinnings of constant connectivity, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557381"},{"content":"Mickelson, K.D. Seeking social support: parents in electronic support groups. In S. Kiesler, ed., Culture of the Internet. LEA, 1997, 157--178.","paperID":"None"},{"content":"Andrew D. Miller , W. Keith Edwards, Give and take: a study of consumer photo-sharing culture and practice, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 28-May 03, 2007, San Jose, California, USA","paperID":"1240682"},{"content":"Meredith Ringel Morris, Social networking site use by mothers of young children, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531603"},{"content":"Nelson, M.K. Parenting Out of Control: Anxious Parents in Uncertain Times. NYU Press, 2010.","paperID":"None"},{"content":"Carman Neustaedter , Svetlana Yarosh , A. J. Brush, Designing for families, CHI '09 Extended Abstracts on Human Factors in Computing Systems, April 04-09, 2009, Boston, MA, USA","paperID":"1520394"},{"content":"Donald A. Norman, The Design of Everyday Things, Basic Books, Inc., New York, NY, 2002","paperID":"2187809"},{"content":"Donald A. Norman, Affordance, conventions, and design, interactions, v.6 n.3, p.38-43, May/June 1999","paperID":"301168"},{"content":"Pauwels, L. A private visual practice going public? Social functions and sociological research opportunities of Web-based family photography. Visual Studies 23, 1 (2008), 34--49.","paperID":"None"},{"content":"Petronio, S. Boundaries of Privacy: Dialectics of Disclosure. SUNY Press, 2002.","paperID":"None"},{"content":"Petronio, S. Communication privacy management theory: What do we know about family privacy regulation? Journal of Family Theory & Review 2, 3 (2010), 175--196.","paperID":"None"},{"content":"Rose, G. Family photographs and domestic spacings: a case study. Trans. of the Institute of British Geographers 28, 1 (2003), 5--18.","paperID":"None"},{"content":"Sarkadi, A. and Bremberg, S. Socially unbiased parenting support on the Internet: a cross-sectional study of users of a large Swedish parenting website. Child care health and development 31, 1 (2005), 43--52.","paperID":"None"},{"content":"Sarvas, D. and Frohlich, P.. The Future of Domestic Photography. Springer London, 2011, 139--177.","paperID":"None"},{"content":"Schoenebeck, S.Y. The Secret Life of Online Moms: Anonymity and Disinhibition on YouBeMom.com. In Proc. ICWSM 2013, AAAI (2013).","paperID":"None"},{"content":"Sengupta, S. Sharing, With a Safety Net. The New York Times, 2013. http://www.nytimes.com/2013/09/20/technology/billprovides-reset-button-for-youngsters-online-posts.html.","paperID":"None"},{"content":"Smith, Aaron. 6 new facts about Facebook. Pew Research Center. http://www.pewresearch.org/facttank/2014/02/03/6-new-facts-about-facebook/.","paperID":"None"},{"content":"Streitfeld, D. European Court Lets Users Erase Records on Web. The New York Times, 2014. http://www.nytimes.com/2014/05/14/technology/google -should-erase-web-links-to-some-personal-data-europeshighest-court-says.html.","paperID":"None"},{"content":"Thomas, D.R. A General Inductive Approach for Analyzing Qualitative Evaluation Data. American Journal of Evaluation 27, 2 (2006), 237--246.","paperID":"None"},{"content":"Uski, S. and Lampinen, A. Social norms and selfpresentation on social network sites: Profile work in action. New Media & Soc., (2014), 1461444814543164.","paperID":"None"},{"content":"Vespa, J., Lewis, J.M., and Kreider, R.M. America's Families and Living Arrangements: 2012. U.S. Bureau of the Census, 2013.","paperID":"None"},{"content":"Jessica Vitak , Jinyoung Kim, \"You can't block people offline\": examining how facebook's affordances shape the disclosure process, Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, February 15-19, 2014, Baltimore, Maryland, USA","paperID":"2531672"},{"content":"Yang Wang , Gregory Norcie , Saranga Komanduri , Alessandro Acquisti , Pedro Giovanni Leon , Lorrie Faith Cranor, \"I regretted the minute I pressed share\": a qualitative study of regrets on Facebook, Proceedings of the Seventh Symposium on Usable Privacy and Security, July 20-22, 2011, Pittsburgh, Pennsylvania","paperID":"2078841"},{"content":"Sarita Yardi , Amy Bruckman, Social and technical challenges in parenting teens' social media use, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 07-12, 2011, Vancouver, BC, Canada","paperID":"1979422"},{"content":"Svetlana Yarosh , Yee Chieh Denise Chew , Gregory D. Abowd, Supporting parent-child communication in divorced families, International Journal of Human-Computer Studies, v.67 n.2, p.192-203, February, 2009","paperID":"1466161"},{"content":"Zhang, Y. and Wildemuth, B. Qualitative analysis of content. Applications of social research methods to questions in info. and library science, (2009), 308--319.","paperID":"None"},{"content":"Xuan Zhao , Victoria Schwanda Sosik , Dan Cosley, It's complicated: how romantic partners use facebook, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, May 05-10, 2012, Austin, Texas, USA","paperID":"2207788"},{"content":"Zhao, Y., Liu, J., Tang, J., and Zhu, Q. Conceptualizing perceived affordances in social media interaction design. Aslib Proceedings 65, 3 (2013), 289--303.","paperID":"None"}],"title":"Managing Children's Online Identities: How Parents Decide what to Disclose about their Children Online","filename":"CHI15/p1895","authors":["Tawfiq Ammari","Priya Kumar","Cliff Lampe","Sarita Schoenebeck"],"conference":"CHI '15"}