{"paperId":2702189,"abstract":"The digital-sharing economy presents opportunities for individuals to find temporary employment, generate extra income, increase reciprocity, enhance social interaction, and access resources not otherwise attainable. Although the sharing economy is profitable, little is known about its use among the unemployed or those struggling financially. This paper describes the results of a participatory-design based workshop to investigate the perception and feasibility of finding temporary employment and sharing spare resources using sharing-economy applications. Specifically, this study included 20 individuals seeking employment in a U.S. city suffering economic decline. We identify success factors of the digital-sharing economy to these populations, identify shortcomings and propose mitigation strategies based on prior research related to trust, social capital and theories of collective efficacy. Finally, we contribute new principles that may foster collaborative consumption within this population and identify new concepts for practical employment applications among these populations.","citation":[{"content":"Tawanna Dillahunt , Airi Lampinen , Jacki O'Neill , Loren Terveen , Cory Kendrick, Does the Sharing Economy do any Good?, Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, February 26-March 02, 2016, San Francisco, California, USA","paperID":"2893362"},{"content":"Dhaval Vyas , Stephen Snow , Miranda Mallett, More than just Food: Field Visits to an Emergency Relief Centre, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838787"},{"content":"Tawanna R. Dillahunt , Sandy Ng , Michelle Fiesta , Zengguang Wang, Do Massive Open Online Course Platforms Support Employability?, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819924"},{"content":"Peng Liu , Xianghua Ding , Ning Gu, “Helping Others Makes Me Happy”: Social Interaction and Integration of People with Disabilities, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2819998"}],"reference":[{"content":"All eyes on the shared economy. (2013, March 9). The Economist. Technology Quarterly: Q1 2013.","paperID":"None"},{"content":"Susanne Bødker , Christina Nielsen , Marianne Graves Petersen, Creativity, cooperation and interactive design, Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques, p.252-261, August 17-19, 2000, New York City, New York, USA","paperID":"347757"},{"content":"Botsman, R. and Rogers, R. (2011). What's mine is yours: How collaborative consumption is changing the way we live. New York, NY: HarperCollins Publishers.","paperID":"None"},{"content":"Civic Life in America Report (2012). Retrieved from: http://www.nationalservice.gov/.","paperID":"None"},{"content":"DeFilippis, J. 2001. \"The myth of social capital in community development.\" Housing Policy Debate 12:781--806.","paperID":"None"},{"content":"Dervojeda, K., Verzijil, D., Nagtegaal, F., Lengton, M., Rouwmatt, E. \"The sharing economy: accessibility based business models for peer-to-peer markets,\" European Commission Business Innovation Observatory, September 2013.","paperID":"None"},{"content":"Tawanna R. Dillahunt, Fostering social capital in economically distressed communities, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557123"},{"content":"Domínguez, S., Watkins, C. (2003). Creating networks for survival and mobility: social capital among African American and Latin American low-income mothers. Social Problems 50(1): 111--135.","paperID":"None"},{"content":"Edelman, B., Luca, M. (2014). Digital discrimination: the case of Airbnb.com. Harvard Business School working paper no. 14-054.","paperID":"None"},{"content":"Hal Eden , Eric Scharff , Eva Hornecker, Multilevel design and role play: experiences in assessing support for neighborhood participation in design, Proceedings of the 4th conference on Designing interactive systems: processes, practices, methods, and techniques, June 25-28, 2002, London, England","paperID":"778768"},{"content":"Sheena Lewis Erete, Empowerment through community crime-prevention technologies, interactions, v.20 n.6, November + December 2013","paperID":"2517444"},{"content":"Ervin, K., Gilmore, G. (1999). Traveling the superinformation highway. African Americans' perceptions and use of cyberspace technology. Journal of Black Studies 29(3): 398--407.","paperID":"None"},{"content":"Bill Gaver , Tony Dunne , Elena Pacenti, Design: Cultural probes, interactions, v.6 n.1, p.21-29, Jan./Feb. 1999","paperID":"291235"},{"content":"Green, T. (2013, January 23). Airbnb and the unstoppable rise of the share economy. Forbes. Retrieved from: httyp://tinyurl.com/9wajglw.","paperID":"None"},{"content":"Andrea Grimes , Martin Bednar , Jay David Bolter , Rebecca E. Grinter, EatWell: sharing nutrition-related memories in a low-income community, Proceedings of the 2008 ACM conference on Computer supported cooperative work, November 08-12, 2008, San Diego, CA, USA","paperID":"1460579"},{"content":"Lilly C. Irani , M. Six Silberman, Turkopticon: interrupting worker invisibility in amazon mechanical turk, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27-May 02, 2013, Paris, France","paperID":"2470742"},{"content":"Benjamin Jen , Jashanjit Kaur , Jonathan De Heus , Tawanna R. Dillahunt, Analyzing employment technologies for economically distressed individuals, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2581290"},{"content":"Karlan, D., Mobius, M., Rosenblat, T., Szeidl, A. Trust and social collateral. The Quarternly Journal of Economics, 2009, 124(3): p. 1307--1361.","paperID":"None"},{"content":"Knack, S., Keefer, P. (1996). \"Does social capital have an economic payoff\"? a cross-country investigation, The Quarterly Journal of Economics, 112(4):1251.","paperID":"None"},{"content":"Knowles, B., Lochrie, M., Coulton, P. & Whittle, J. (2014). \"Barter: a technology strategy for local wealth generation\". In IT Professional. 16, 3, pp. 28--34.","paperID":"None"},{"content":"Kvale, S., & Brinkmann, S. (2009). Interviews: Learning the craft of qualitative research interviewing (2nd ed.). Thousand Oaks, CA: Sage.","paperID":"None"},{"content":"Leadbeater, C. We-think: Mass innovation not mass production. (2008). Profile Books: London, UK.","paperID":"None"},{"content":"Ludwig, A. (2014, January 10). Brookings's Bradley: A sharing economy that serves all. Forbes. Retrieved from http://tinyurl.com/ntn75x3.","paperID":"None"},{"content":"McIntyre L, Officer S and Robinson LM (2003). Feeling poor: The felt experience of low-income lone mothers. Affilia. 18(3): 316--331.","paperID":"None"},{"content":"Mennis, J., Dayanim, S., Grunwald, H. 2013. Neighborhood collective efficacy and dimensions of diversity: a multilevel analysis. Environmental and Planning, 45(9), pp. 2176--2193.","paperID":"None"},{"content":"Offer, S. (2012). The burden of reciprocity: Processes of exclusion and withdrawal from personal networks among low-income families. Current Sociology, 60, 788--805.","paperID":"None"},{"content":"Joel Ross , Lilly Irani , M. Six Silberman , Andrew Zaldivar , Bill Tomlinson, Who are the crowdworkers?: shifting demographics in mechanical turk, CHI '10 Extended Abstracts on Human Factors in Computing Systems, April 10-15, 2010, Atlanta, Georgia, USA","paperID":"1753873"},{"content":"Sampson, R., Raudenbush, S., Earls, F. (1997). Neighborhoods and violent crime: a multilevel study of collective efficacy. Science 277, 918--924.","paperID":"None"},{"content":"Steuer, E., \"Robin Chase on the (financial) value of sharing\" (9, July 2009), www.good.is/post/robin-chaseon-the-financial-value-of-sharing/.","paperID":"None"},{"content":"Stone, B. (2012, September 12). My life as a TaskRabbit. BloombergBusinessweek. Retrieved from: http://tinyurl.com/9rmptpg.","paperID":"None"},{"content":"Sundararajan, A. (2014). Peer-to-peer businesses and the sharing (collaborative) economy: overview, economic effects and regulatory issues. Written testimony for the hearing title, The power of connection: peer-to-peer businesses, held by the committee on small businesses of the U.S. House of Representatives, 9/15/2014.","paperID":"None"},{"content":"Venkatesh, S.A. Off the books-the underground economy of the poor (Harvard University Press, 2006).","paperID":"None"},{"content":"Woolcock, M. 1998. \"Social capital and economic development: toward a theoretical synthesis and policy framework.\" Theory and Society. 27:51--208.","paperID":"None"}],"title":"The Promise of the Sharing Economy among Disadvantaged Communities","filename":"CHI15/p2285","authors":["Tawanna R. Dillahunt","Amelia R. Malone"],"conference":"CHI '15"}