{"paperId":2702434,"citation":[],"abstract":"This work presents WonderLens, a system of optical lenses and mirrors for enabling tangible interactions on printed paper. When users perform spatial operations on the optical components, they deform the visual content that is printed on paper, and thereby provide dynamic visual feedback on user interactions without any display devices. The magnetic unit that is embedded in each lens and mirror allows the unit to be identified and tracked using an analog Hall-sensor grid that is placed behind the paper, so the system provides additional auditory and visual feedback through different levels of embodiment, further enhancing the interactivity with the printed content on the physical paper.","reference":[{"content":"Back, M., Cohen, J., Gold, R., Harrison, S., and Minneman, S. Listen reader: An electronically augmented paper-based book. In Proc. CHI '01 (2001), 23--29.","paperID":"None"},{"content":"Billinghurst, M., Kato, H., and Poupyrev, I. The magicbook: Moving seamlessly between reality and virtuality. IEEE Comput. Graph. Appl. 21, 3 (May 2001), 6--8.","paperID":"None"},{"content":"Fishkin, K. P. A taxonomy for and analysis of tangible interfaces. Personal Ubiquitous Computing 8, 5 (Sept. 2004), 347--358.","paperID":"None"},{"content":"Hendrix, S. L., and Eisenberg, M. A. Computer-assisted pop-up design for children: Computationally enriched paper engineering. Advanced Technology for Learning 3, 2, 119--127.","paperID":"None"},{"content":"Huang, J., Takashima, K., Hashi, S., and Kitamura, Y. Im3d: Magnetic motion tracking system for dexterous 3d interactions. In ACM SIGGRAPH '14 Emerging Technologies (2014), 12:1--12:1.","paperID":"None"},{"content":"Ishii, H., and Ullmer, B. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proc. CHI '97 (1997), 234--241.","paperID":"None"},{"content":"Jacob, R. J., Girouard, A., Hirshfield, L. M., Horn, M. S., Shaer, O., Solovey, E. T., and Zigelbaum, J. Reality-based interaction: a framework for post-WIMP interfaces. In Proc. CHI'08 (2008), 201--210.","paperID":"None"},{"content":"Johnson, W., Jellinek, H., Klotz, Jr., L., Rao, R., and Card, S. K. Bridging the paper and electronic worlds: The paper user interface. In Proc. CHI '93 (1993), 507--512.","paperID":"None"},{"content":"Karagozler, M. E., Poupyrev, I., Fedder, G. K., and Suzuki, Y. Paper generators: Harvesting energy from touching, rubbing and sliding. In Proc. UIST '13 (2013), 23--30.","paperID":"None"},{"content":"Kawahara, Y., Hodges, S., Cook, B. S., Zhang, C., and Abowd, G. D. Instant inkjet circuits: Lab-based inkjet printing to support rapid prototyping of ubicomp devices. In Proc. Ubicomp '13 (2013), 363--372.","paperID":"None"},{"content":"Klemmer, S. R., Graham, J., Wolff, G. J., and Landay, J. A. Books with voices: Paper transcripts as a physical interface to oral histories. In Proc. CHI '03 (2003), 89--96.","paperID":"None"},{"content":"Liang, R.-H., Cheng, K.-Y., Chan, L., Peng, C.-X., Chen, M. Y., Liang, R.-H., Yang, D.-N., and Chen, B.-Y. GaussBits: Magnetic tangible bits for portable and occlusion-free near-surface tangible interactions. In Proc. CHI '13 (2013), 1391--1400.","paperID":"None"},{"content":"Liang, R.-H., Cheng, K.-Y., Su, C.-H., Weng, C.-T., Chen, B.-Y., and Yang, D.-N. GaussSense: Attachable stylus sensing using magnetic sensor grid. In Proc. UIST '12 (2012), 319--326.","paperID":"None"},{"content":"Papas, M., Houit, T., Nowrouzezahrai, D., Gross, M., and Jarosz, W. The magic lens: Refractive steganography. ACM Trans. Graph.","paperID":"None"},{"content":"Raffle, H., Vaucelle, C., Wang, R., and Ishii, H. Jabberstamp: Embedding sound and voice in traditional drawings. In Proc. IDC '07 (2007), 137--144.","paperID":"None"},{"content":"Song, H., Guimbretiere, F., Grossman, T., and Fitzmaurice, G. Mouselight: Bimanual interactions on digital paper using a pen and a spatially-aware mobile projector. In Proc. CHI '10 (2010), 2451--2460.","paperID":"None"},{"content":"Wellner, P. Interacting with paper on the digitaldesk. Communications of ACM 36, 7 (July 1993), 87--96.","paperID":"None"},{"content":"Willis, K., Brockmeyer, E., Hudson, S., and Poupyrev, I. Printed optics: 3d printing of embedded optical elements for interactive devices. In Proc. UIST '12 (2012), 589--598.","paperID":"None"},{"content":"Willis, K. D. D., Shiratori, T., and Mahler, M. Hideout: Mobile projector interaction with tangible objects and surfaces. In Proc. TEI '13 (2013), 331--338.","paperID":"None"},{"content":"Yu, N.-H., Chan, L.-W., Lau, S. Y., Tsai, S.-S., Hsiao, I.-C., Tsai, D.-J., Hsiao, F.-I., Cheng, L.-P., Chen, M., Huang, P., and Hung, Y.-P. TUIC: enabling tangible interaction on capacitive multi-touch displays. In Proc. CHI '11 (2011), 2995--3004.","paperID":"None"}],"title":"WonderLens: Optical Lenses and Mirrors for Tangible Interactions on Printed Paper","filename":"CHI15/p1281","authors":["Rong-Hao Liang","Chao Shen","Yu-Chien Chan","Guan-Ting Chou","Liwei Chan","De-Nian Yang","Mike Y. Chen","Bing-Yu Chen"],"conference":"CHI '15"}