{"paperId":2702336,"reference":[{"content":"Adar, E., Tan, D.S., & Teevan, J. (2013). Benevolent Deception in Human Computer Interaction. CHI, 1863--1872.","paperID":"None"},{"content":"Anderson, F., Grossman, T., Matejka, J., & Fitzmaurice, G. (2013). YouMove: Enhancing Movement Training with an Augmented Reality Mirror. UIST, 311--320.","paperID":"None"},{"content":"Ashbrook, D., Baudisch, P., & White, S. (2011). Nenya: Subtle and Eyes-free Mobile Input with a Magnetically-tracked Finger Ring. CHI, 2043--2046.","paperID":"None"},{"content":"Ashbrook, D.L., Clawson, J.R., Lyons, K., Starner, T.E., & Patel, N. (2008). Quickdraw: The Impact of Mobility and On-body Placement on Device Access Time. CHI, 219--222.","paperID":"None"},{"content":"Ashbrook, D.L. (2010). Enabling mobile microinteractions. https://smartech.gatech.edu/","paperID":"None"},{"content":"handle/1853/3398","paperID":"None"},{"content":"Bailly, G., Müller, J., Rohs, M., Wigdor, D., & Kratz, S. (2012) ShoeSense: A New Perspective on Gestural Interaction and Wearable Applications. CHI, 1239--1248.","paperID":"None"},{"content":"Busk, N.K., Forstholm, J.S., Lessél, L.S., & Sørensen, S.G. (2012). Introducing Magical Experiences in UX. SIDeR, 21--24.","paperID":"None"},{"content":"Clawson, J., Patel, N., & Starner, T. (2010). Digital kick in the shin: on-body communication tools for couples trapped in face-to-face group conversations. Workshop on Ensembles of On-Body Devices, MobileHCI.","paperID":"None"},{"content":"Costanza, E., Inverso, S.A., Allen, R., & Maes, P. (2007). Intimate Interfaces in Action: Assessing the Usability and Subtlety of Emg-based Motionless Gestures. CHI, 819--828.","paperID":"None"},{"content":"Costanza, E., Inverso, S.A., & Allen, R. (2005). Toward Subtle Intimate Interfaces for Mobile Devices Using an EMG Controller. CHI, 481--489.","paperID":"None"},{"content":"1Costanza, E., Inverso, S.A., Pavlov, E., Allen, R., & Maes, P. (2006). Eye-q: Eyeglass Peripheral Display for Subtle Intimate Notifications. MobileHCI, 211--218.","paperID":"None"},{"content":"Fitzkee, D. (1945). Magic by Misdirection. Saint Raphael House.","paperID":"None"},{"content":"Hansson, R. & Ljungstrand, P. (2000). The Reminder Bracelet: Subtle Notification Cues for Mobile Devices. CHI EA, 323--324.","paperID":"None"},{"content":"Holleis, P., Otto, F., Hussmann, H., & Schmidt, A. (2007). Keystroke-level model for advanced mobile phone interaction. CHI, 1505--1514.","paperID":"None"},{"content":"Lee, S. & Starner, T. (2010). BuzzWear: Alert Perception in Wearable Tactile Displays on the Wrist. CHI, 433--442.","paperID":"None"},{"content":"Macknik, S.L., King, M., Randi, J., Robbins, A., Teller, Thompson, J & Martinez-Conde S. (2008). Attention and awareness in stage magic: turning tricks into research. Nature Reviews Neuroscience 9, 11, 871--879.","paperID":"None"},{"content":"Macknik, S.L., Martinez-Conde, S., & Blakeslee, S. (2010). Sleights of mind. Macmillan.","paperID":"None"},{"content":"Marques, D., Carrico, L., & Guerreiro, T. (2014). Duress Unlock: Using Covert Signals to Restrict Access to Mobile Devices. CHI EA.","paperID":"None"},{"content":"Marshall, J., Benford, S., & Pridmore, T. (2010). Deception and Magic in Collaborative Interaction. CHI, 567--576.","paperID":"None"},{"content":"Matthies, D.J.C., Müller, F., Anthes, C., & Kranzlmüller, D. (2013). ShoeSoleSense: Proof of Concept for a Wearable Foot Interface for Virtual and Real Environments. VRST, 93--96.","paperID":"None"},{"content":"2Norman, D.A. (2002). The design of everyday things. Basic books.","paperID":"None"},{"content":"2Profita, H.P. (2011). Social acceptability of wearable technology use in public: an exploration of the societal perceptions of a gesture-based mobile textile interface. Thesis, Georgia Institute of Technology.","paperID":"None"},{"content":"Reeves, S., Benford, S. O'Malley, C., & Fraser, M. (2005). Designing the Spectator Experience. CHI, 741--750.","paperID":"None"},{"content":"Saponas, T.S., Tan, D.S., Morris, D., Balakrishnan, R., Turner, J., & Landay, J.A. (2009). Enabling Always-available Input with Muscle-computer Interfaces. UIST, 167--176.","paperID":"None"},{"content":"Sumitomo, H., Katayama, T., Terada, T., & Tsukamoto, M. (2014). Implementation and Evaluation on a Concealed Interface Using Abdominal Circumference. AH, 51:1--51:8.","paperID":"None"},{"content":"Tognazzini, B. (1993). Principles, Techniques, and Ethics of Stage Magic and Their Application to Human Interface Design. CHI, 355--362.","paperID":"None"},{"content":"Toney, A., Mulley, B., Thomas, B.H., & Piekarski, W. (2002). Minimal social weight user interactions for wearable computers in business suits. ISWC, 57--64.","paperID":"None"},{"content":"Wobbrock, J., Myers, B. & Kembel, J. (2003) EdgeWrite: a stylus-based text entry method designed for high accuracy and stability of motion. UIST, 61--70.","paperID":"None"},{"content":"Yi, B., Cao, X., Fjeld, M., & Zhao, S. (2012). Exploring User Motivations for Eyes-free Interaction on Mobile Devices. CHI, pp. 2789--2792.","paperID":"None"},{"content":"\"Dummy\" Thermostats Cool Down Tempers, Not Temperatures. http://news.thomasnet.com/IMT/2003/","paperID":"None"},{"content":"04/11/dummy_thermostat","paperID":"None"},{"content":"3Timesify. http://www.timesify.com/.","paperID":"None"},{"content":"3Worddit. http://pcottle.github.io/MSWorddit.","paperID":"None"}],"citation":[{"content":"Barrett Ens , Tovi Grossman , Fraser Anderson , Justin Matejka , George Fitzmaurice, Candid Interaction: Revealing Hidden Mobile and Wearable Computing Activities, Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, November 08-11, 2015, Daegu, Kyungpook, Republic of Korea","paperID":"2807449"}],"abstract":"Mobile devices offer constant connectivity to the world, which can negatively affect in-person interaction. Current approaches to minimizing the social disruption and improving the subtlety of interactions tend to focus on the development of inconspicuous devices that provide basic input or output. This paper presents a more general approach to subtle interaction and demonstrates how a number of principles from magic can be leveraged to improve subtlety. It also presents a framework that can be used to classify subtle interfaces along with a modular set of novel interfaces that fit within this framework. Lastly, the paper presents a new evaluation paradigm specifically designed to assess the subtlety of interactions. This paradigm is used to compare traditional approaches to our new subtle approaches. We find our new approaches are over five times more subtle than traditional interactions, even when participants are aware of the technologies being used.","title":"Supporting Subtlety with Deceptive Devices and Illusory Interactions","filename":"CHI15/p1489","authors":["Fraser Anderson","Tovi Grossman","Daniel Wigdor","George Fitzmaurice"],"conference":"CHI '15"}