{"paperId":2702349,"reference":[{"content":"Abrami, P. C., Bernard, R. M., Bures, E. M., Borokhovski, E., and Tamim, R. M. Interaction in distance education and online learning: Using evidence and theory to improve practice. Journal of Computing in Higher Education 23, 2--3 (2011), 82--103.","paperID":"None"},{"content":"Anderson, A., Huttenlocher, D., Kleinberg, J., and Leskovec, J. Engaging with massive online courses. In WWW'14 (2014), 687--698.","paperID":"None"},{"content":"Anderson, T., and Elloumi, F. The theory and practice of online learning. Athabasca University Press, 2008.","paperID":"None"},{"content":"Branon, R. F., and Essex, C. Synchronous and asynchronous communication tools in distance education. TechTrends 45, 1 (2001), 36--36.","paperID":"None"},{"content":"Bransford, J. D., Brown, A. L., and Cocking, R. R. How People Learn: Brain, Mind, Experience, and School. The National Academies Press, 2000.","paperID":"None"},{"content":"Burnett, C. Learning to chat: Tutor participation in synchronous online chat. Teaching in higher education 8, 2 (2003), 247--261.","paperID":"None"},{"content":"Coetzee, D., Fox, A., Hearst, M. A., and Hartmann, B. Chatrooms in MOOCs: All talk and no action. In L@S (2014).","paperID":"None"},{"content":"Coetzee, D., Fox, A., Hearst, M. A., and Hartmann, B. Should your MOOC forum use a reputation system? In CSCW (2014), 1176--1187.","paperID":"None"},{"content":"Cross, A., Bayyapunedi, M., Ravindran, D., Cutrell, E., and Thies, W. VidWiki: Enabling the crowd to improve the legibility of online educational videos. In CSCW (2014).","paperID":"None"},{"content":"Dixson, M. D. Creating effective student engagement in online courses: What do students find engaging? JoSoTL 10, 2 (2010).","paperID":"None"},{"content":"Duemer, L., Fontenot, D., Gumfory, K., Kallus, M., Larsen, J., Schafer, S., and Shaw, B. The use of online synchronous discussion groups to enhance community formation and professional identity development. Journal of Interactive Online Learning 1, 2 (2002), 1--12.","paperID":"None"},{"content":"Goldman, D. B., Gonterman, C., Curless, B., Salesin, D., and Seitz, S. M. Video object annotation, navigation, and composition. In UIST (2008), 3--12.","paperID":"None"},{"content":"Granovetter, M. The strength of weak ties: A network theory revisited. Sociological theory 1 (1983), 201--233.","paperID":"None"},{"content":"Guimarães, R. L., Cesar, P., and Bulterman, D. C. Let me comment on your video: Supporting personalized end-user comments within third-party online videos. In Proceedings of the 18th Brazilian symposium on Multimedia and the web (2012), 253--260.","paperID":"None"},{"content":"Guo, P. J., Kim, J., and Rubin, R. How video production affects student engagement: An empirical study of mooc videos. In L@S (2014), 41--50.","paperID":"None"},{"content":"Guzdial, M., and Turns, J. Effective discussion through a computer-mediated anchored forum. The journal of the learning sciences 9, 4 (2000), 437--469.","paperID":"None"},{"content":"Hamilton, W., Garretson, O., and Kerne, A. Streaming on twitch: Fostering participatory communities of play within live mixed media. In CHI (2014).","paperID":"None"},{"content":"Huang, J., Dasgupta, A., Ghosh, A., Manning, J., and Sanders, M. Superposter behavior in mooc forums. In L@S (2014), 117--126.","paperID":"None"},{"content":"Johnson, G., and Howell, A. Attitude toward instructional technology following required versus optional WebCT usage. Journal of Technology and Teacher Education 13, 4 (2005), 643--654.","paperID":"None"},{"content":"Johnson, G. M. Synchronous and asynchronous text-based CMC in educational contexts: A review of recent research. TechTrends 50, 4 (2006), 46--53.","paperID":"None"},{"content":"Kizilcec, R. F., Papadopoulos, K., and Sritanyaratana, L. Showing face in video instruction: effects on information retention, visual attention, and affect. In CHI (2014).","paperID":"None"},{"content":"Koory, M. A. Differences in learning outcomes for the online and F2F versions of \"an introduction to shakespeare\". Journal of Asynchronous Learning Networks 7, 2 (2003), 18--35.","paperID":"None"},{"content":"Martin, F. G. Will massive open online courses change how we teach? Commun. ACM 55, 8 (2012), 26--28.","paperID":"None"},{"content":"O'Brien, H. L., and Toms, E. G. The development and evaluation of a survey to measure user engagement. Journal of the American Society for Information Science and Technology 61, 1 (2010), 50--69.","paperID":"None"},{"content":"O'Brien, H. L., and Toms, E. G. Is there a universal instrument for measuring interactive information retrieval?: the case of the user engagement scale. In Proceedings of the third symposium on Information interaction in context (2010), 335--340.","paperID":"None"},{"content":"Oztok, M., Zingaro, D., Brett, C., and Hewitt, J. Exploring asynchronous and synchronous tool use in online courses. Computers & Education 60, 1 (2013), 87--94.","paperID":"None"},{"content":"Romiszowski, A., and Mason, R. Handbook of research for educational communications and technology, 2 ed. Taylor & Francis, 2004, ch. Computer mediated communication, 397--431.","paperID":"None"},{"content":"van der Pol, J., Admiraal, W., and Simons, P. R.-J. The affordance of anchored discussion for the collaborative processing of academic texts. International Journal of Computer-Supported Collaborative Learning 1, 3 (2006), 339--357.","paperID":"None"},{"content":"Vygotsky, L. S. Mind in society: The development of higher psychological processes. Harvard university press, 1980.","paperID":"None"},{"content":"Walker, R., and Arnold, I. Introducing group-based asynchronous learning to business education. reflections on effective course design and delivery. Educational media international 41, 3 (2004), 253--265.","paperID":"None"},{"content":"Weisz, J. D., Kiesler, S., Zhang, H., Ren, Y., Kraut, R. E., and Konstan, J. A. Watching together: integrating text chat with video. In CHI (2007), 877--886.","paperID":"None"},{"content":"Zhang, S., Jiang, H., and Carroll, J. M. Integrating online and offline community through facebook. In IEEE International Conference on Collaboration Technologies and Systems (2011), 569--578.","paperID":"None"}],"citation":[{"content":"Xiang Xiao , Jingtao Wang, Towards Attentive, Bi-directional MOOC Learning on Mobile Devices, Proceedings of the 2015 ACM on International Conference on Multimodal Interaction, November 09-13, 2015, Seattle, Washington, USA","paperID":"2820754"},{"content":"Minjung Kim , Jaeyoung Yun, Interaction-Enhancing Strategies for Educational Video, Proceedings of HCI Korea, p.356-363, January 27-29, 2016, Jeongseon, Republic of Korea","paperID":"2903681"}],"abstract":"Online learning is increasingly prevalent as an option for self-learning and as a resource for instructional design. Prerecorded video is currently the main medium of online education content delivery and instruction; this affords asynchronicity and flexibility, and enables the dissemination of lecture content in a distributed and scalable manner. However, the same properties may impede learners' engagement due to the lack of social interaction and peer support. In this paper, we propose a time-anchored commenting interface to allow online learners who watch the same video clips to exchange comments on them. Comments left by previous learners at specific time points of a video are displayed to new learners when they watch the same video and reach those time points. We investigated how the display of time-anchored comments (dynamic or static) and type of comments (content-related or social-oriented) influenced users' perceived engagement, perceived social interactivity, and learning outcomes. Our results show that dynamically displaying time-anchored comments can indeed enhance learners' perceived social interactivity. Moreover, the content of comments would further affect learners' intention of commenting. Based on our findings, we make various recommendations for the improvement of social interaction and learning experience in online education.","title":"Using Time-Anchored Peer Comments to Enhance Social Interaction in Online Educational Videos","filename":"CHI15/p689","authors":["Yi-Chieh Lee","Wen-Chieh Lin","Fu-Yin Cherng","Hao-Chuan Wang","Ching-Ying Sung","Jung-Tai King"],"conference":"CHI '15"}