{"paperId":2702182,"reference":[{"content":"Agathe Battestini, Vidya Setlur, and Timothy Sohn. 2010. A large scale study of text-messaging use. In Proceedings of MobileHCI 2010.","paperID":"None"},{"content":"Frank R. Bentley, JoEllen Kames, Rafiq Ahmed, Rhiannon Sterling Zivin, and Lauren Schwendimann. 2010. Contacts 3.0: bringing together research and design teams to reinvent the phonebook. In CHI '10 Extended Abstracts.","paperID":"None"},{"content":"Bentley, Frank, and Crysta J. Metcalf. \"The Use of Mobile Social Presence.\" IEEE Pervasive Computing 8.4 (2009): 35--41.","paperID":"None"},{"content":"Frank R. Bentley and Crysta J. Metcalf. 2007. Sharing motion information with close family and friends. In Proc. CHI '07. ACM, New York, NY, USA, 1361--1370.","paperID":"None"},{"content":"Böhmer, Matthias, Brent Hecht, Johannes Schöning, Antonio Krüger, and Gernot Bauer. \"Falling asleep with Angry Birds, Facebook and Kindle: a large scale study on mobile application usage.\" In Proc. Mobile HCI '11.","paperID":"None"},{"content":"Consolvo, Sunny, et al. \"Location disclosure to social relations: why, when, & what people want to share.\" In Proc. CHI 2005.","paperID":"None"},{"content":"Maeve Duggan and Aaron Smith Social Media Update 2013. 2013. http://www.pewinternet.org/factsheets/social-networking-fact-sheet/","paperID":"None"},{"content":"R.I.M Dunbar. 1998. The Social Brain Hypothesis. Evo. Anthro., 6:178.","paperID":"None"},{"content":"Eagle, Nathan. \"Mobile phones as sensors for social research.\" Emergent technologies in social research. Oxford University Press, New York (2011): 492--521.","paperID":"None"},{"content":"Furletti, Barbara, et al. 2014. \"Use of mobile phone data to estimate mobility flows. Measuring urban population and inter-city mobility using big data in an integrated approach.\" In Proceedings of the 47th Meeting of the Italian Statistical Society.","paperID":"None"},{"content":"Rebecca Grinter and Margery Eldridge. 2003. Wan2tlk?: everyday text messaging. In Proc. CHI 2003.","paperID":"None"},{"content":"Harboe, Gunnar, et al. \"Ambient social tv: drawing people into a shared experience.\" In Proc. CHI 2008.","paperID":"None"},{"content":"Hill, Russell A., and Robin IM Dunbar. \"Social network size in humans.\" Human nature 14.1 (2003): 53--72.","paperID":"None"},{"content":"Ito, M., Mobile Phones, Japanese Youth, and the RePlacement of Social Contact. In Proceedings of Annual Meeting for the Society for the Social Studies of Science, (Cambridge, MA, 2001).","paperID":"None"},{"content":"Lisa Lambert. More Americans move to cities in past decade-Census. Reuters. Mar 26, 2012. http://www.reuters.com/article/2012/03/26/usa-citiespopulation-idUSL2E8EQ5AJ20120326","paperID":"None"},{"content":"Ling, Rich, and Birgitte Yttri. \"Nobody sits at home and waits for the telephone to ring: Micro and hypercoordination through the use of the mobile telephone.\" Telenor Forskning og Utvikling, FoU Rapport 30 (1999): 99.","paperID":"None"},{"content":"Marsden PV. 1987. Core discussion networks of Americans. Am. Sociol. Rev. 52:122--313","paperID":"None"},{"content":"Natasha Lomas. 2014. Android Still Growing Market Share By Winning First Time Smartphone Users. Techcrunch. http://techcrunch.com/2014/05/06/androidstill-growing-market-share-by-winning-first-timesmartphone-users/","paperID":"None"},{"content":"Jun-Ki Min, Jason Wiese, Jason I. Hong, and John Zimmerman. 2013. Mining smartphone data to classify life-facets of social relationships. In Proc. CSCW '13. ACM, New York, NY, USA, 285--294.","paperID":"None"},{"content":"Raento, Mika, Antti Oulasvirta, Renaud Petit, and Hannu Toivonen. \"ContextPhone: A prototyping platform for context-aware mobile applications.\" Pervasive Computing, IEEE 4, no. 2 (2005): 51--59.","paperID":"None"},{"content":"Catherine Rampell, Data Reveal a Rise in College Degrees Among Americans. New York Times. June 13, 2013. http://www.nytimes.com/2013/06/13/education/asharp-rise-in-americans-with-college-degrees.html","paperID":"None"},{"content":"A. Schmidt, T, Stuhr, and H.W. Gellersen. 2001. Context-Phonebook - Extending Mobile Phone Applications with Context. In Proc. Mobile HCI 2001.","paperID":"None"},{"content":"Jennifer VanGrove. 2012. Your address book is mine: Many iPhone apps take your data. Venture Beat. http://venturebeat.com/2012/02/14/iphone-addressbook/","paperID":"None"},{"content":"Jason Wiese, Jun-Ki Min, Jason I. Hong, and John Zimmerman. 2015. \"You Never Call, You Never Write\": Call and SMS Logs Do Not Always Indicate Tie Strength. In Proc. CSCW '15.","paperID":"None"}],"citation":[],"abstract":"Over the past decade, the mobile phonebook has evolved from a relatively short list of people that one calls and texts to a many-hundred person list of aggregated contacts from around the web. This is happening at a time when an increasing number of mobile applications are relying on the mobile phonebook to create one's social network in their services. Through a large-scale study of the phonebooks of 200 diverse participants, containing 65,940 contacts, we set out to understand today's mobile contact lists. Our participants reported that they did not recognize the names of 29% of their contacts and we found that the most frequently contacted five contacts represent greater than 80% of all calls and text messages with phonebook contacts. We conclude with implications for the design of mobile applications that rely on phonebook data.","title":"The Composition and Use of Modern Mobile Phonebooks","filename":"CHI15/p2749","authors":["Frank R. Bentley","Ying-Yu Chen"],"conference":"CHI '15"}