{"paperId":2702481,"abstract":"Most Human-Computer Interaction (HCI) researchers are accustomed to the process of formal ethics review for their evaluation or field trial protocol. Although this process varies by country, the underlying principles are universal. While this process is often a formality, for field research or lab-based studies with vulnerable users, formal ethics requirements can be challenging to navigate -- a common occurrence in the social sciences; yet, in many cases, foreign to HCI researchers. Nevertheless, with the increase in new areas of research such as mobile technologies for marginalized populations or assistive technologies, this is a current reality. In this paper we present our experiences and challenges in conducting several studies that evaluate interactive systems in difficult settings, from the perspective of the ethics process. Based on these, we draft recommendations for mitigating the effect of such challenges to the ethical conduct of research. We then issue a call for interaction researchers, together with policy makers, to refine existing ethics guidelines and protocols in order to more accurately capture the particularities of such field-based evaluations, qualitative studies, challenging lab-based evaluations, and ethnographic observations.","reference":[{"content":"ABC Canada. Who Wants to Learn? ABC Canada Literacy Foundation Report. 2001","paperID":"None"},{"content":"Bos, N. et al.. Research ethics in the Facebook era: privacy, anonymity, and oversight. ACM CHI 2009.","paperID":"None"},{"content":"Buchanan, E.A. and Ess, C. Internet Research Ethics and the Institutional Review Board: Current Practices and Issues. SIGCAS Computers and Society (39:3), 2008","paperID":"None"},{"content":"Chalmers, M. Ethics, logs and videotape: ethics in large scale user trials and user generated content. CHI 2011.","paperID":"None"},{"content":"Detweiler, C. et al. Values in Design Building Bridges between RE, HCI and Ethics. INTERACT 2011","paperID":"None"},{"content":"Ess, C. and Jones, S. Ethical Decision-Making and Internet Research: Recommendations from the AoIR Ethics Working Committee. In Buchanan, E.A. (Ed.), Readings in Virtual Research. 2004.","paperID":"None"},{"content":"Ess, C. Internet Research Ethics. In Joinson, A. (Ed.), Oxford Handbook of Internet Psychology. 2007","paperID":"None"},{"content":"Ethics Rupture: An Invitational Summit about Alternatives to Research-Ethics Review. St. Thomas University & University of New Brunswick, 2012.","paperID":"None"},{"content":"Friedman, B. et al. Value Sensitive Design and Information Systems. Human-Computer Interaction and Management Information Systems, 2006.","paperID":"None"},{"content":"https://itunes.apple.com/app/brailletouch/id579725651 accessed on 2015/01/07.","paperID":"None"},{"content":"Fournier H. et al. A Multidisciplinary Approach to Enhancing Infantry Training through Immersive Technologies. I/ITSEC 2011.","paperID":"None"},{"content":"Glaser, B.G. and Strauss, A.L. The Discovery of Grounded Theory. Weidenfeld and Nicolson, 1968.","paperID":"None"},{"content":"Guta, A. et al. Resisting the seduction of \"ethics creep\": Using Foucault to surface complexity and contradiction in research ethics review. Journal Social Science & Medicine, 2012.","paperID":"None"},{"content":"van den Hoonaard, W. Is Research-Ethics Review a Moral Panic? Canadian Review of Sociology (38), 2001.","paperID":"None"},{"content":"Kahn, J.P. and Mastroianni A.C. Moving From Compliance to Conscience: Why We Can and Should Improve on the Ethics of Clinical Research. In Arch Intern Med. 161(7) 2001.","paperID":"None"},{"content":"Killshaw, S. Ethics in studying contested illness. In McClancy, J. (Ed). Ethics in the Field. 2013","paperID":"None"},{"content":"Kim, S.N. Whose voice is it anyway? Rethinking the oral history method in accounting research on race, ethnicity and gender. In Critical Perspectives on Accounting, 19(8), 2008","paperID":"None"},{"content":"Li, J. Ethical Challenges in Participant Observation: A Reflection on Ethnographic Fieldwork. The Qualitative Report (13:1), 2008.","paperID":"None"},{"content":"Lingel, J. Ethics and dilemmas of online ethnography. CHI 2012.","paperID":"None"},{"content":"Marsden, G. and Jones, M. Inspiring Mobile Interaction Design. ACM CHI 2011 Course.","paperID":"None"},{"content":"Mackay, W. Ethics, lies and videotape. ACM CHI 1995.","paperID":"None"},{"content":"Moncur, W., Masthoff, J., Reiter, E., Freer, Y., and Nguyen, H. Providing Adaptive Health Updates across the Personal Social Network. Human-Computer Interaction 29, 3 (2014), 256--309","paperID":"None"},{"content":"Moncur, W., Mahamood, S., Reiter, E., and Freer, Y. Involving healthcare consumers in knowledge acquisition for virtual healthcare. AAAI Fall Symposium Series, AAAI Press (2009), 43--51.","paperID":"None"},{"content":"Moncur, W. The Emotional Wellbeing of Researchers: Considerations for Practice. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI), 2013.","paperID":"None"},{"content":"Munteanu, C., Molyneaux, H., Maitland, J., McDonald, D., Leung, R., Fournier, H., and Lumsden, J. Hidden in plain sight: Low literacy adults in a developed country overcoming social and educational challenges through mobile learning support tools. In the Journal of Personal and Ubiquitous Computing, Springer-Verlag, November 2013","paperID":"None"},{"content":"Munteanu, C., Molyneaux, H., Maitland, J., McDonald, D., Leung, R., Lumsden, J., and Fournier, H. A Tale of Two Studies: Challenges in Field Research with Low-literacy Adult Learners in a Developed Country. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI). 2012.","paperID":"None"},{"content":"Munteanu C., Fournier, H., Lapointe, J.F., Emond, B., and Kondratova, I. We'll Take it from Here: Letting the Users Take Charge of the Evaluation and Why that Turned Out Well. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI). 2013.","paperID":"None"},{"content":"National Research Ethics Service. NRES guidance on information sheets and consent forms. 2007.","paperID":"None"},{"content":"Romero, M., Frey, B., Southern, C., and Abowd, G.D. BrailleTouch: designing a mobile eyes-free soft keyboard. In Proceedings of the ACM International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI) 2011.","paperID":"None"},{"content":"Southern, C., Clawson, J., Frey, B., Abowd, G.D., and Romero, M. An evaluation of BrailleTouch: mobile touchscreen text entry for the visually impaired. In Proceedings of the ACM International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI) 2012.","paperID":"None"},{"content":"Tri-Council Policy Statement: Ethical Conduct of Research Involving Humans, 2nd edition, 2010.","paperID":"None"},{"content":"Williams, A. et al. Anchored mobilities: mobile technology and transnational migration. ACM DIS 2008","paperID":"None"}],"citation":[{"content":"Hilary Davis , Jenny Waycott, Ethical Encounters: HCI Research in Sensitive and Complex Settings, Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838834"},{"content":"Luke Hutton , Tristan Henderson, Some Challenges for Ethics in Social Network Research, Proceedings of the 2015 ACM SIGCOMM Workshop on Ethics in Networked Systems Research, August 21-21, 2015, London, United Kingdom","paperID":"2793023"},{"content":"Jenny Waycott , Greg Wadley , Stefan Schutt , Arthur Stabolidis , Reeva Lederman, The Challenge of Technology Research in Sensitive Settings: Case Studies in 'ensitive HCI', Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, December 07-10, 2015, Parkville, VIC, Australia","paperID":"2838773"},{"content":"Jessica Vitak , Katie Shilton , Zahra Ashktorab, Beyond the Belmont Principles: Ethical Challenges, Practices, and Beliefs in the Online Data Research Community, Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, February 27-March 02, 2016, San Francisco, California, USA","paperID":"2820078"}],"title":"Situational Ethics: Re-thinking Approaches to Formal Ethics Requirements for Human-Computer Interaction","filename":"CHI15/p105","authors":["Cosmin Munteanu","Heather Molyneaux","Wendy Moncur","Mario Romero","Susan O'Donnell","John Vines"],"conference":"CHI '15"}