{"paperId":2702442,"abstract":"Browsers warn users when the privacy of an SSL/TLS connection might be at risk. An ideal SSL warning would empower users to make informed decisions and, failing that, guide confused users to safety. Unfortunately, users struggle to understand and often disregard real SSL warnings. We report on the task of designing a new SSL warning, with the goal of improving comprehension and adherence. We designed a new SSL warning based on recommendations from warning literature and tested our proposal with microsurveys and a field experiment. We ultimately failed at our goal of a well-understood warning. However, nearly 30% more total users chose to remain safe after seeing our warning. We attribute this success to opinionated design, which promotes safety with visual cues. Subsequently, our proposal was released as the new Google Chrome SSL warning. We raise questions about warning comprehension advice and recommend that other warning designers use opinionated design.","citation":[{"content":"Frank Li , Grant Ho , Eric Kuan , Yuan Niu , Lucas Ballard , Kurt Thomas , Elie Bursztein , Vern Paxson, Remedying Web Hijacking: Notification Effectiveness and Webmaster Comprehension, Proceedings of the 25th International Conference on World Wide Web, April 11-15, 2016, Montréal, Québec, Canada","paperID":"2883039"},{"content":"Lucky Onwuzurike , Emiliano De Cristofaro, Danger is my middle name: experimenting with SSL vulnerabilities in Android apps, Proceedings of the 8th ACM Conference on Security & Privacy in Wireless and Mobile Networks, June 22-26, 2015, New York, New York","paperID":"2766522"}],"reference":[{"content":"Devdatta Akhawe , Adrienne Porter Felt, Alice in warningland: a large-scale field study of browser security warning effectiveness, Proceedings of the 22nd USENIX conference on Security, August 14-16, 2013, Washington, D.C.","paperID":"2534789"},{"content":"Almuhimedi, H., Felt, A. P., Reeder, R. W., and Consolvo, S. Your Reputation Precedes You: History, Reputation, and the Chrome Malware Warning. In SOUPS (2014).","paperID":"None"},{"content":"Anderson, R. E., and Jolson, M. A. Technical wording in advertising: implications for market segmentation. Journal of Marketing 44 (1980).","paperID":"None"},{"content":"ANSI. Product safety signs and labels: Z535.4.","paperID":"None"},{"content":"Arron, J., Egans, R., and Mela, D. Paradoxical Effect of a Nutrition Labeling Scheme in a Student Cafeteria. Nutritional Research 15 (September 1995).","paperID":"None"},{"content":"Bauer, L., Bravo-Lillo, C., Cranor, L. F., and Fragkaki, E. Warning design guidelines (cmu-cylab-13-002).","paperID":"None"},{"content":"Robert Biddle , P. C. van Oorschot , Andrew S. Patrick , Jennifer Sobey , Tara Whalen, Browser interfaces and extended validation SSL certificates: an empirical study, Proceedings of the 2009 ACM workshop on Cloud computing security, November 13-13, 2009, Chicago, Illinois, USA","paperID":"1655012"},{"content":"Braun, C. C., Greeno, B., and Silter, N. C. Differences in behavioral compliance as a function of warning color. In Human Factors and Ergonomics Society Annual Meeting (1998).","paperID":"None"},{"content":"Bravo-Lillo, C., Cranor, L., Komanduri, S., Schechter, S., and Sleeper, M. Harder to ignore?: Revisiting pop-up fatigue and approaches to prevent it. In SOUPS (2014).","paperID":"None"},{"content":"Cristian Bravo-Lillo , Lorrie Faith Cranor , Julie Downs , Saranga Komanduri, Bridging the Gap in Computer Security Warnings: A Mental Model Approach, IEEE Security and Privacy, v.9 n.2, p.18-26, March 2011","paperID":"1978359"},{"content":"Cristian Bravo-Lillo , Saranga Komanduri , Lorrie Faith Cranor , Robert W. Reeder , Manya Sleeper , Julie Downs , Stuart Schechter, Your attention please: designing security-decision UIs to make genuine risks harder to ignore, Proceedings of the Ninth Symposium on Usable Privacy and Security, July 24-26, 2013, Newcastle, United Kingdom","paperID":"2501610"},{"content":"Breznitz, S. Cry Wolf: The Psychology of False Alarms.","paperID":"None"},{"content":"Bzostek, J. A., and Wogalter, M. S. Measuring visual search time for a product warning label as a function of icon, color, column, and vertical placement. In Human Factors and Ergonomics Society Annual Meeting (1999).","paperID":"None"},{"content":"Rachna Dhamija , J. D. Tygar , Marti Hearst, Why phishing works, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 22-27, 2006, Montréal, Québec, Canada","paperID":"1124861"},{"content":"Edworthy, J., and Adams, A. Warning design: a research perspective. Taylor and Francis, 1996.","paperID":"None"},{"content":"Serge Egelman , Lorrie Faith Cranor , Jason Hong, You've been warned: an empirical study of the effectiveness of web browser phishing warnings, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 05-10, 2008, Florence, Italy","paperID":"1357219"},{"content":"Egelman, S., and Schechter, S. The importance of being earnest {in security warnings}. In Financial Cryptography and Data Security, Lecture Notes in Computer Science. Springer Berlin Heidelberg, 2013.","paperID":"None"},{"content":"Adrienne Porter Felt , Robert W. Reeder , Hazim Almuhimedi , Sunny Consolvo, Experimenting at scale with google chrome's SSL warning, Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2557292"},{"content":"Fischhoff, B., Riley, D., Kovacs, D. C., and Small, M. What information belongs in a warning? Psychology Marketing 15, 7 (1998).","paperID":"None"},{"content":"Frantz, J. P. Effect of location and procedural explicitness on user process of and compliance with product warnings. Human Factors 36 (1994).","paperID":"None"},{"content":"Frutiger, A. Signs and symbols: their design and meaning. Von Nostrand Reinhold, 1989.","paperID":"None"},{"content":"Glover, B. L., and Wogalter, M. S. Using a computer simulated world to study behavior compliance with warnings: effect of salience and gender. In Human Factors Society Annual Meeting (1997).","paperID":"None"},{"content":"Hancock, H., Bowles, C. T., Rogers, W. A., and Fisk, A. D. Comprehension and retention of warning information. Handbook of warnings (2006).","paperID":"None"},{"content":"Hartley, J. Designing instructional text, 3 ed. Kagan Page and Nichols, 1994.","paperID":"None"},{"content":"Kalsher, M. J., Wogalter, M. S., and Racicot, B. M. Pharmaceutical container labels and warnings: preference and perceived readability of alternative designs and pictorials. International Journal of Industrial Ergonomics 18 (1996).","paperID":"None"},{"content":"Laughery, K. R., and Stanush, J. A. Effects of warning explicitness on product perceptions. In Human Factors Society (1989).","paperID":"None"},{"content":"Laughery, K. R., and Vaubel, K. P. Explicitness in consequence information in warnings. Safety Science 16 (1993).","paperID":"None"},{"content":"Laughery, K. R., Young, S. L., Vaubel, K. P., and Brelsford, J. W. The noticeability of warnings on alcoholic beverage containers. Journal of Public Policy and Marketing 12 (1993).","paperID":"None"},{"content":"McDonald, P., Mohebbi, M., and Slatkin, B. Comparing Google Consumer Surveys to Existing Probability and Non-Probability Based Internet Survey. In Google Whitepaper (2012).","paperID":"None"},{"content":"McLaughlin, G. H. Smog grading -- a new readability formula. Journal of Reading (1969).","paperID":"None"},{"content":"Morrow, D. G., Hier, C. M., Mendard, W. E., and Leirer, V. O. Icons improve older and younger adults' comprehension of medication information. Journal of Gerontology: Psychological Sciences 53B (1998).","paperID":"None"},{"content":"Reeder, R., Kowalczyk, E. C., and Shostack, A. Poster: Helping engineers design NEAT security warnings. In SOUPS (2011).","paperID":"None"},{"content":"Research, P. A Comparison of Results from Surveys by the Pew Research Center and Google Consumer Surveys.","paperID":"None"},{"content":"Stuart E. Schechter , Rachna Dhamija , Andy Ozment , Ian Fischer, The Emperor's New Security Indicators, Proceedings of the 2007 IEEE Symposium on Security and Privacy, p.51-65, May 20-23, 2007","paperID":"1264196"},{"content":"Victoria Schwanda-Sosik , Elie Bursztein , Sunny Consolvo , David A. Huffaker , Gueorgi Kossinets , Kerwell Liao , Paul McDonald , Aaron Sedley, Online microsurveys for user experience research, CHI '14 Extended Abstracts on Human Factors in Computing Systems, April 26-May 01, 2014, Toronto, Ontario, Canada","paperID":"2559975"},{"content":"Silver, N., Leonard, D. C., Ponsi, K. A., and Wogalter, M. S. Warnings and purchase intentions for pest-control products. Forensic Reports 4 (1991).","paperID":"None"},{"content":"Andreas Sotirakopoulos , Kirstie Hawkey , Konstantin Beznosov, On the challenges in usable security lab studies: lessons learned from replicating a study on SSL warnings, Proceedings of the Seventh Symposium on Usable Privacy and Security, July 20-22, 2011, Pittsburgh, Pennsylvania","paperID":"2078831"},{"content":"Joshua Sunshine , Serge Egelman , Hazim Almuhimedi , Neha Atri , Lorrie Faith Cranor, Crying wolf: an empirical study of SSL warning effectiveness, Proceedings of the 18th conference on USENIX security symposium, p.399-416, August 10-14, 2009, Montreal, Canada","paperID":"1855793"},{"content":"Thorley, P., Hellier, E., and Edworthy, J. Habituation effects in visual warnings. Contemporary ergonomics (2001).","paperID":"None"},{"content":"Trommelen, M. Effectiveness of explicit warnings. Safety Science 25 (1997).","paperID":"None"}],"title":"Improving SSL Warnings: Comprehension and Adherence","filename":"CHI15/p2893","authors":["Adrienne Porter Felt","Alex Ainslie","Robert W. Reeder","Sunny Consolvo","Somas Thyagaraja","Alan Bettes","Helen Harris","Jeff Grimes"],"conference":"CHI '15"}