{"paperId":2858319,"citation":[],"reference":[{"content":"Anne Bowser, Derek Hansen, Yurong He, Carol Boston, Matthew Reid, Logan Gunnell, and Jennifer Preece. 2013. Using Gamification to Inspire New Citizen Science Volunteers. In Proceedings of the First International Conference on Gameful Design, Research, and Applications (Gamification '13). ACM, New York, NY, USA, 18--25.","paperID":"None"},{"content":"Anne Bowser, Derek Hansen, Jennifer Preece, Yurong He, Carol Boston, and Jen Hammock. 2014. Gamifying Citizen Science: A Study of Two User Groups. In Proceedings of the Companion Publication of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW Companion '14). ACM, New York, NY, USA, 137--140.","paperID":"None"},{"content":"Justin Cheng, Jaime Teevan, Shamsi T. Iqbal, and Michael S. Bernstein. 2015. Break It Down: A Comparison of Macro- and Microtasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 4061--4064.","paperID":"None"},{"content":"Seth Cooper, Firas Khatib, Adrien Treuille, Janos Barbero, Jeehyung Lee, Michael Beenen, Andrew Leaver-Fay, David Baker, Zoran Popovic, and others. 2010. Predicting protein structures with a multiplayer online game. Nature 466, 7307 (2010), 756--760.","paperID":"None"},{"content":"Mark Cottman-Fields, Margot Brereton, and Paul Roe. 2013. Virtual Birding: Extending an Environmental Pastime into the Virtual World for Citizen Science. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2029--2032.","paperID":"None"},{"content":"Sara Drenner, Shilad Sen, and Loren Terveen. 2008. Crafting the Initial User Experience to Achieve Community Goals. In Proceedings of the 2008 ACM Conference on Recommender Systems (RecSys '08). ACM, New York, NY, USA, 187--194.","paperID":"None"},{"content":"John Duffy and Tatiana Kornienko. 2010. Does competition affect giving? Journal of Economic Behavior & Organization 74, 12 (2010), 82--103.","paperID":"None"},{"content":"David Easley and Arpita Ghosh. 2013. Incentives, Gamification, and Game Theory: An Economic Approach to Badge Design. In Proceedings of the Fourteenth ACM Conference on Electronic Commerce (EC '13). ACM, New York, NY, USA, 359--376.","paperID":"None"},{"content":"Alexandra Eveleigh, Charlene Jennett, Ann Blandford, Philip Brohan, and Anna L. Cox. 2014. Designing for Dabblers and Deterring Drop-outs in Citizen Science. In Proceedings of CHI '14. 2985--2994.","paperID":"None"},{"content":"Alexandra Eveleigh, Charlene Jennett, Stuart Lynn, and Anna L. Cox. 2013. \"I Want to Be a Captain! I Want to Be a Captain!\": Gamification in the Old Weather Citizen Science Project. In Proceedings of the First International Conference on Gameful Design, Research, and Applications (Gamification '13). ACM, New York, NY, USA, 79--82.","paperID":"None"},{"content":"Leon Festinger. 1957. A Theory of Cognitive Dissonance. Stanford University Press.","paperID":"None"},{"content":"Derek L. Hansen, Patrick J. Schone, Douglas Corey, Matthew Reid, and Jake Gehring. 2013. Quality Control Mechanisms for Crowdsourcing: Peer Review, Arbitration, & Expertise at Familysearch Indexing. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, New York, NY, USA, 649--660.","paperID":"None"},{"content":"Ioanna Iacovides, Charlene Jennett, Cassandra Cornish-Trestrail, and Anna L. Cox. 2013. Do Games Attract or Sustain Engagement in Citizen Science?: A Study of Volunteer Motivations. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 1101--1106.","paperID":"None"},{"content":"Nicole Immorlica, Greg Stoddard, and Vasilis Syrgkanis. 2015. Social Status and Badge Design. In Proceedings of the 24th International Conference on World Wide Web (WWW '15). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 473--483.","paperID":"None"},{"content":"Ron Kohavi, Roger Longbotham, Dan Sommerfield, and Randal Henne. 2009. Controlled experiments on the web: survey and practical guide. Data Mining and Knowledge Discovery 18, 1 (2009), 140--181.","paperID":"None"},{"content":"Ron Kohavi and Rajesh Parekh. 2003. Ten supplementary analyses to Improve E-commerce Web Sites. In In Proceedings of the Fifth WEBKDD Workshop.","paperID":"None"},{"content":"Robert Kraut and Paul Resnick. 2012. Building Successful Online Communities: Evidence-Based Social Design. MIT Press.","paperID":"None"},{"content":"Stacey Kuznetsov, Carrie Doonan, Nathan Wilson, Swarna Mohan, Scott E. Hudson, and Eric Paulos. 2015. DIYbio Things: Open Source Biology Tools As Platforms for Hybrid Knowledge Production and Scientific Participation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 4065--4068.","paperID":"None"},{"content":"Chris J Lintott, Kevin Schawinski, Anze Slosar, Kate Land, Steven Bamford, Daniel Thomas, M Jordan Raddick, Robert C Nichol, Alex Szalay, Dan Andreescu, et al. 2008. Galaxy Zoo: morphologies derived from visual inspection of galaxies from the Sloan Digital Sky Survey. Monthly Notices of the Royal Astronomical Society 389, 3 (2008), 1179--1189.","paperID":"None"},{"content":"Oded Nov, Ofer Arazy, and David Anderson. 2014. Scientists@Home: What Drives the Quantity and Quality of Online Citizen Science Participation? PLoS ONE 9, 4 (2014), e90375.","paperID":"None"},{"content":"Chris Preist, Elaine Massung, and David Coyle. 2014. Competing or Aiming to Be Average?: Normification As a Means of Engaging Digital Volunteers. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 1222--1233.","paperID":"None"},{"content":"Nathan Prestopnik and Kevin Crowston. 2012. Purposeful Gaming & Socio-computational Systems: A Citizen Science Design Case. In Proceedings of the 17th ACM International Conference on Supporting Group Work (GROUP '12). ACM, New York, NY, USA, 75--84.","paperID":"None"},{"content":"Christine Robson, Marti Hearst, Chris Kau, and Jeffrey Pierce. 2013. Comparing the Use of Social Networking and Traditional Media Channels for Promoting Citizen Science. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, New York, NY, USA, 1463--1468.","paperID":"None"},{"content":"Dana Rotman, Jen Hammock, Jenny J. Preece, Carol L. Boston, Derek L. Hansen, Anne Bowser, and Yurong He. 2014. Does Motivation in Citizen Science Change with Time and Culture?. In Proceedings of the Companion Publication of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW Companion '14). ACM, New York, NY, USA, 229--232.","paperID":"None"},{"content":"Dana Rotman, Jenny Preece, Jen Hammock, Kezee Procita, Derek Hansen, Cynthia Parr, Darcy Lewis, and David Jacobs. 2012. Dynamic Changes in Motivation in Collaborative Citizen-science Projects. In Proceedings of CSCW '12. 217--226.","paperID":"None"},{"content":"Avi Segal, Ya'akov (Kobi) Gal, Robert J. Simpson, Victoria Victoria Homsy, Mark Hartswood, Kevin R. Page, and Marina Jirotka. 2015. Improving Productivity in Citizen Science Through Controlled Intervention. In Proceedings of the 24th International Conference on World Wide Web (WWW '15 Companion). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 331--337.","paperID":"None"},{"content":"S. Andrew Sheppard and Loren Terveen. 2011. Quality is a Verb: The Operationalization of Data Quality in a Citizen Science Community. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym '11). ACM, New York, NY, USA, 29--38.","paperID":"None"},{"content":"S. Andrew Sheppard, Andrea Wiggins, and Loren Terveen. 2014. Capturing Quality: Retaining Provenance for Curated Volunteer Monitoring Data. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 1234--1245.","paperID":"None"},{"content":"Robert Simpson, Kevin R. Page, and David De Roure. 2014. Zooniverse: Observing the World's Largest Citizen Science Platform. In Proceedings of the 23rd International Conference on World Wide Web (WWW '14 Companion). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 1049--1054.","paperID":"None"},{"content":"Yla R. Tausczik and James W. Pennebaker. 2011. Predicting the Perceived Quality of Online Mathematics Contributions from Users' Reputations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1885--1888.","paperID":"None"},{"content":"Ramine Tinati, Max Van Kleek, Elena Simperl, Markus Luczak-Rosch, Robert Simpson, and Nigel Shadbolt. 2015. Designing for Citizen Data Analysis: A Cross-Sectional Case Study of a Multi-Domain Citizen Science Platform. In Proceedings of CHI '15. 4069--4078.","paperID":"None"},{"content":"Luis von Ahn and Laura Dabbish. 2004. Labeling Images with a Computer Game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 319--326.","paperID":"None"},{"content":"Jon Whittle. 2014. How Much Participation is Enough?: A Comparison of Six Participatory Design Projects in Terms of Outcomes. In Proceedings of the 13th Participatory Design Conference: Research Papers Volume 1 (PDC '14). ACM, New York, NY, USA, 121--130.","paperID":"None"},{"content":"Andrea Wiggins. 2013. Free As in Puppies: Compensating for ICT Constraints in Citizen Science. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, New York, NY, USA, 1469--1480.","paperID":"None"},{"content":"Andrea Wiggins and Kevin Crowston. 2011. From Conservation to Crowdsourcing: A Typology of Citizen Science. In Proceedings of HICSS '11. 1--10.","paperID":"None"}],"abstract":"Many citizen science projects ask people to create an account before they participate - some require it. What effect does the registration process have on the number and quality of contributions? We present a controlled study comparing the effects of mandatory registration with an interface that enables people to participate without registering, but allows them to sign up to 'claim' contributions. We demonstrate that removing the requirement to register increases the number of visitors to the site contributing to the project by 62%, without reducing data quality. We also discover that contribution rates are the same for people who choose to register, and those who remain anonymous, indicating that the interface should cater for differences in participant motivation. The study provides evidence that to maximize contribution rates, projects should offer the option to create an account, but the process should not be a barrier to immediate contribution, nor should it be required.","title":"To Sign Up, or not to Sign Up?: Maximizing Citizen Science Contribution Rates through Optional Registration","filename":"CHI16/p1827","authors":["Caroline Jay","Robert Dunne","David Gelsthorpe","Markel Vigo"],"conference":"CHI '16"}