{"paperId":2858175,"citation":[],"reference":[{"content":"Gregory D. Abowd, Anind K. Dey, Peter J. Brown, Nigel Davies, Mark Smith, and Pete Steggles. 1999. Towards a Better Understanding of Context and Context-Awareness. In Handheld and Ubiquitous Computing, Hans-W. Gellersen (ed.). Springer Berlin Heidelberg, 304--307.","paperID":"None"},{"content":"Rebecca G. Adams and Graham Allan. 1998. Placing Friendship in Context. Cambridge University Press.","paperID":"None"},{"content":"Louise Barkhuus and Anind Dey. 2003. Is ContextAware Computing Taking Control Away from the User? Three Levels of Interactivity Examined. In Proceedings of Ubicomp 2003, Springer, 149--156.","paperID":"None"},{"content":"Louise Barkhuus and Paul Dourish. 2004. Everyday Encounters with Context-Aware Computing in a Campus Environment. In UbiComp 2004: Ubiquitous Computing, Nigel Davies, Elizabeth D. Mynatt and Itiro Siio (eds.). Springer Berlin Heidelberg, 232--249.","paperID":"None"},{"content":"A. Beach, M. Gartrell, S. Akkala, et al. 2008. WhozThat? evolving an ecosystem for context-aware mobile social networks. IEEE Network 22, 4: 50--55. http://doi.org/10.1109/MNET.2008.4579771","paperID":"None"},{"content":"Donn Byrne and Don Nelson. 1965. Attraction as a linear function of proportion of positive reinforcements. Journal of Personality and Social Psychology 1, 6: 659--663. http://doi.org/10.1037/h0022073","paperID":"None"},{"content":"Guanling Chen and David Kotz. 2000. A Survey of Context-Aware Mobile Computing Research. Technical Report TR2000-381, Dartmouth Computer Science.","paperID":"None"},{"content":"Sunny Consolvo and Miriam Walker. 2003. Using the Experience Sampling Method to Evaluate Ubicomp Applications. IEEE Pervasive Computing 2, 2: 24--31. http://doi.org/10.1109/MPRV.2003.1203750","paperID":"None"},{"content":"Deborah Davis. 1981. Implications for interaction versus effectance as mediators of the similarityattraction relationship. Journal of Experimental Social Psychology 17, 1: 96--117.","paperID":"None"},{"content":"Anind K. Dey. 2001. Understanding and Using Context. Personal Ubiquitous Comput. 5, 1: 4--7. http://doi.org/10.1007/s007790170019","paperID":"None"},{"content":"Paul Dourish. 2004. What We Talk About when We Talk About Context. Personal Ubiquitous Comput. 8, 1: 19--30.","paperID":"None"},{"content":"Nathan Eagle and Alex Pentland. 2005. Social serendipity: mobilizing social software. IEEE Pervasive Computing 4, 2: 28--34. http://doi.org/10.1109/MPRV.2005.37","paperID":"None"},{"content":"J R Eiser, M Morgan, P Gammage, N Brooks, and R Kirby. 1991. Adolescent health behaviour and similarity-attraction: friends share smoking habits (really), but much else besides. The British journal of social psychology / the British Psychological Society 30 ( Pt 4): 339--348.","paperID":"None"},{"content":"Scott Feld and William C. Carter. 1998. Foci of Activity as Changing Contexts for Friendship. In Placing Friendship in Context. Cambridge Univsersity Press.","paperID":"None"},{"content":"Claude S. Fischer. 1977. Networks and places: social relations in the urban setting. Free Press.","paperID":"None"},{"content":"Steve Harrison and Paul Dourish. 1996. Re-place-ing space: the roles of place and space in collaborative systems. Proceedings of the 1996 ACM conference on Computer supported cooperative work, ACM, 67--76. http://doi.org/10.1145/240080.240193","paperID":"None"},{"content":"Quentin Jones, Sukeshini A. Grandhi, Samer Karam, Steve Whittaker, Changqing Zhou, and Loren Terveen. 2008. Geographic 'Place' and 'Community Information? Preferences. Journal Computer Supported Cooperative Work 17, 2--3: 137--167.","paperID":"None"},{"content":"Quentin Jones, Sukeshini A. Grandhi, Loren Terveen, and Steve Whittaker. 2004. People-to-People-toGeographical-Places: The P3 Framework for LocationBased Community Systems. Compututer Supported Cooperative Work: Journal of Collaborative Computing 13, 3--4: 249--282.","paperID":"None"},{"content":"Matthijs Kalmijn and Henk Flap. 2001. Assortative Meeting and Mating: Unintended Consequences of Organized Settings for Partner Choices. Social Forces 79, 4: 1289--1312.","paperID":"None"},{"content":"Reed Larson and Mihaly Csikszentmihalyi. 1983. The Experience Sampling Method. New Directions for Methodology of Social & Behavioral Science 15: 41--56.","paperID":"None"},{"content":"Natasha Lomas. 2013. Stop Trying To Make Proximity-Based Social Networking Happen. TechCrunch. Retrieved September 23, 2015 from http://social.techcrunch.com/2013/07/23/location-vscommunication/","paperID":"None"},{"content":"Peter V. Marsden. 1990. Network Diversity, Substructures, and Opportunities for Contact. In Structures of Power and Constraint. Cambridge University Press, 397--410.","paperID":"None"},{"content":"Julia M. Mayer, Starr Roxanne Hiltz, and Quentin Jones. 2015. Making Social Matching Context-Aware: Design Concepts and Open Challenges. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 545--554.","paperID":"None"},{"content":"Julia M. Mayer and Quentin Jones. 2016. Encount'r: Exploring Passive Context-Awareness for Opportunistic Social Matching. CSCW Companion 2016 Proceedings of the companion publication of the 19th ACM conference on Computer supported cooperative work & social computing, ACM. http://doi.org/http://dx.doi.org/10.1145/2818052.28690","paperID":"None"},{"content":"Julia M. Mayer, Quentin Jones, and Starr Roxanne Hiltz. 2015. Identifying Opportunities for Valuable Encounters: Toward Context-Aware Social Matching Systems. ACM Transaction of Information Systems 34, 1: 1:1--1:32.","paperID":"None"},{"content":"Julia M. Mayer, Sara Motahari, Richard P. Schuler, and Quentin Jones. 2010. Common attributes in an unusual context: predicting the desirability of a social match. Proceedings of the 4th ACM Conference on Recommender Systems, ACM, 337--340. Retrieved January 25, 2013 from http://doi.acm.org/10.1145/1864708.1864781","paperID":"None"},{"content":"Miller McPherson, Lynn Smith-Lovin, and James M. Cook. 2001. Birds of a Feather: Homophily in Social Networks. Annual Review of Sociology 27: 415--444. http://doi.org/10.2307/2678628","paperID":"None"},{"content":"Gerald Mollenhorst, Beate Volker, and Henk Flap. 2014. Changes in personal relationships: How social contexts affect the emergence and discontinuation of relationships. Social Networks 37: 65--80. http://doi.org/10.1016/j.socnet.2013.12.003","paperID":"None"},{"content":"Rebekah Nathan. 2006. My Freshman Year: What a Professor Learned by Becoming a Student. Penguin Books, NY, N.Y.","paperID":"None"},{"content":"Lisa M. Osbeck, Fathali M. Moghaddam, and Stephane Perreault. 1997. Similarity and attraction among majority and minority groups in a multicultural context. International Journal of Intercultural Relations 21, 1: 113--123.","paperID":"None"},{"content":"Per Persson and Younghee Jung. 2005. Nokia sensor: from research to product. Proceedings of the 2005 conference on Designing for User eXperience, AIGA: American Institute of Graphic Arts.","paperID":"None"},{"content":"Robert D. Putnam. 2000. Bowling Alone: The Collapse and Revival of American Community. Simon and Schuster.","paperID":"None"},{"content":"Thomas J. Scheff. 1994. Microsociology: Discourse, Emotion, and Social Structure. Bibliovault OAI Repository, the University of Chicago Press. http://doi.org/10.2307/2579932","paperID":"None"},{"content":"Bill N. Schilit and Marvin M. Theimer. 1994. Disseminating active map information to mobile hosts. IEEE Network 8, 5: 22--32. http://doi.org/10.1109/65.313011","paperID":"None"},{"content":"Michael Terry and Elizabeth D. Mynatt. 2002. Social Net: Using Patterns of Physical Proximity Over Time to Infer Shared Interests. In Proceedings of Human Factors in Computing Systems (CHI 2002, ACM Press, 816--817.","paperID":"None"},{"content":"Loren Terveen and David W. McDonald. 2005. Social matching: A framework and research agenda. ACM Transactions on Computer-Human Interactions 12, 3: 401--434. http://doi.org/10.1145/1096737.1096740","paperID":"None"},{"content":"Yi-Fu Tuan. 1977. Space and Place: the perspective of experience. University of MN press, Minneapolis.","paperID":"None"},{"content":"Sherry Turkle. 2011. Alone together why we expect more from technology and less from each other. Basic Books, NY.","paperID":"None"},{"content":"Paula Wilcox, Sandra Winn, and Marylynn Fyvieff Gauld. 2005. \"It was nothing to do with the university, it was just the people\": the role of social support in the first-year experience of higher education. Studies in Higher Education 30, 6: 707--722. http://doi.org/10.1080/03075070500340036","paperID":"None"},{"content":"Robert B. Zajonc. 1968. Attitudinal Effects of Mere Exposure. Journal of Personality and Social Psychology 9, 2, Pt.2: 1--27.","paperID":"None"}],"abstract":"Mobile social matching systems aim to bring people together in the physical world by recommending people nearby to each other. Going beyond simple similarity and proximity matching mechanisms, we explore a proposed framework of relational, social and personal context as predictors of match opportunities to map out the design space of opportunistic social matching systems. We contribute insights gained from a study combining Experience Sampling Method (ESM) with 85 students of a U.S. university and interviews with 15 of these participants. A generalized linear mixed model analysis (n=1704) showed that personal context (mood and busyness) as well as sociability of others nearby are the strongest predictors of contextual match interest. Participant interviews suggest operationalizing relational context using social network rarity and discoverable rarity, and incorporating skill level and learning/teaching needs for activity partnering. Based on these findings we propose passive context-awareness for opportunistic social matching.","title":"Supporting Opportunities for Context-Aware Social Matching: An Experience Sampling Study","filename":"CHI16/p2430","authors":["Julia M. Mayer","Starr Roxanne Hiltz","Louise Barkhuus","Kaisa Väänänen","Quentin Jones"],"conference":"CHI '16"}