{"paperId":2858486,"citation":[],"reference":[{"content":"Jeffrey Bardzell. 2009. Interaction Criticism and Aesthetics. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2357- 2366. http://doi.org/10.1145/1518701.1519063","paperID":"None"},{"content":"Steve Benford, Holger Schnädelbach, Boriana Koleva, et al. 2005. Expected, Sensed, and Desired: A Framework for Designing Sensing-based Interaction. ACM Trans. Comput.-Hum. Interact. 12, 1: 3-30. http://doi.org/10.1145/1057237.1057239","paperID":"None"},{"content":"Mark Blythe. 2014. The Hitchhiker's Guide to Ubicomp: Using Techniques from Literary and Critical Theory to Reframe Scientific Agendas. Personal Ubiquitous Comput. 18, 4: 795-808. http://doi.org/10.1007/s00779-013-0679--6","paperID":"None"},{"content":"Jacob Buur and Rosa Torguet. 2013. Ethnographic findings in the organizational theatre. Ethnographic Praxis in Industry Conference Proceedings 2013, 1: 143-160. http://doi.org/10.1111/j.15598918.2013.00013.x","paperID":"None"},{"content":"Bill Buxton. 2007. Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.","paperID":"None"},{"content":"Diane Carr, Gareth Schott, Andrew Burn, and David Buckingham. 2004. Doing game studies: A multimethod approach to the study of textuality, interactivity and narrative space. Media International Australia 110: 19-30.","paperID":"None"},{"content":"Yoram I. Chisik, Alissa N. Antle, Brian Birtles, Elena Márquez Segura, and Cristina Sylla. 2014. The Kathmandu Kids Entertainment Workshops. In Entertaining the Whole World, Adrian David Cheok, Anton Nijholt and Teresa Romão (eds.). Springer London, 5-21.","paperID":"None"},{"content":"Yvonne A. W. De Kort and Wijnand A. Ijsselsteijn. 2008. People, Places, and Play: Player Experience in a Socio-spatial Context. Comput. Entertain. 6, 2: 18:1- 18:11. http://doi.org/10.1145/1371216.1371221","paperID":"None"},{"content":"Bernard De Koven. Coliberation. DeepFUN. Retrieved September 25, 2015 from http://www.deepfun.com/coliberation/","paperID":"None"},{"content":"Sebastian Deterding. 2009. The Game Frame: Systemizing a Goffmanian Approach to Video Game Theory.","paperID":"None"},{"content":"Sebastian Deterding. 2011. Meaningful Play. Getting»Gamification«Right. Retrieved December 18, 2015 from http://www.slideshare.net/dings/meaningful-playgetting-gamification-right","paperID":"None"},{"content":"J. P. Djajadiningrat, W. W. Gaver, and J. W. Frens. 2000. Interaction Relabelling and Extreme Characters: Methods for Exploring Aesthetic Interactions. Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, ACM, 66-71. http://doi.org/10.1145/347642.347664","paperID":"None"},{"content":"Tom Djajadiningrat, Stephan Wensveen, Joep Frens, and Kees Overbeeke. 2004. Tangible Products: Redressing the Balance Between Appearance and Action. Personal Ubiquitous Comput. 8, 5: 294-309. http://doi.org/10.1007/s00779-004-0293--8","paperID":"None"},{"content":"Andrei Dobra. Great Games Are Needed to Make PlayStation Move Popular, Sony Admits. softpedia. Retrieved June 7, 2015 from http://news.softpedia.com/news/Great-Games-AreNeeded-to-Make-PlayStation-Move-Popular-SonyAdmits-257838.shtml","paperID":"None"},{"content":"Paul Dourish. 2001. Where the Action Is: The Foundations of Embodied Interaction. The MIT Press, Cambridge, Mass.","paperID":"None"},{"content":"Nicolas Ducheneaut, Nicholas Yee, Eric Nickell, and Robert J. Moore. 2006. \"Alone Together?\": Exploring the Social Dynamics of Massively Multiplayer Online Games. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 407- 416. http://doi.org/10.1145/1124772.1124834","paperID":"None"},{"content":"Daniel Fallman and Erik Stolterman. 2010. Establishing Criteria of Rigor and Relevance in Interaction Design Research. Proceedings of the 2010 International Conference on The Interaction Design, British Computer Society, 58-63. Retrieved September 25, 2015 from http://dl.acm.org/citation.cfm?id=2227001.2227012","paperID":"None"},{"content":"Greta G. Fein. 1981. Pretend Play in Childhood: An Integrative Review. Child Development 52, 4: 1095- 1118. http://doi.org/10.2307/1129497","paperID":"None"},{"content":"James Fogarty, Jodi Forlizzi, and Scott E. Hudson. 2001. Aesthetic Information Collages: Generating Decorative Displays That Contain Information. Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology, ACM, 141- 150. http://doi.org/10.1145/502348.502369","paperID":"None"},{"content":"Brian Gajadhar, Yvonne de Kort, and Wijnand IJsselsteijn. 2008. Influence of Social Setting on Player Experience of Digital Games. CHI '08 Extended Abstracts on Human Factors in Computing Systems, ACM, 3099-3104. http://doi.org/10.1145/1358628.1358814","paperID":"None"},{"content":"Bill Gaver. 2002. Designing for Homo Ludens. I3 Magazine 12. Retrieved from http://www.gold.ac.uk/media/27gaver.ludens.02.pdf","paperID":"None"},{"content":"Elizabeth Gerber. 2007. Improvisation Principles and Techniques for Design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1069-1072. http://doi.org/10.1145/1240624.1240786","paperID":"None"},{"content":"Elizabeth Gerber. 2009. Using Improvisation to Enhance the Effectiveness of Brainstorming. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 97-104. http://doi.org/10.1145/1518701.1518718","paperID":"None"},{"content":"Erving Goffman. 1961. Fun in Games. In Encounters: Two studies in the sociology of interaction. BobbsMerrill, Oxford, England, 15 - 81.","paperID":"None"},{"content":"Dave Gray, Sunni Brown, and James Macanufo. 2010. Gamestorming: A Playbook for Innovators, Rulebreakers, and Changemakers. O'Reilly Media, Sebastopol, Calif.","paperID":"None"},{"content":"Marc Hassenzahl. 2008. The Interplay of Beauty, Goodness, and Usability in Interactive Products. Hum.Comput. Interact. 19, 4: 319-349. http://doi.org/10.1207/s15327051hci1904_2","paperID":"None"},{"content":"Kristina Höök. 2010. Transferring Qualities from Horseback Riding to Design. Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, ACM, 226-235. http://doi.org/10.1145/1868914.1868943","paperID":"None"},{"content":"Kristina Höök, Anna St","paperID":"None"},{"content":"a ahl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, and Eva-Carin Banka Johnson. 2015. COVER STORY: Somaesthetic Design. interactions 22, 4: 26-33. http://doi.org/10.1145/2770888","paperID":"None"},{"content":"29. Johan Huizinga. 1971. Homo Ludens: A Study of the Play-Element in Culture. Beacon Press, Boston.","paperID":"None"},{"content":"30. Caroline Hummels, Kees C. Overbeeke, and Sietske Klooster. 2007. Move to Get Moved: A Search for Methods, Tools and Knowledge to Design for Expressive and Rich Movement-based Interaction. Personal Ubiquitous Comput. 11, 8: 677-690. http://doi.org/10.1007/s00779-006-0135-y","paperID":"None"},{"content":"31. Giulio Iacucci, Carlo Iacucci, and Kari Kuutti. 2002. Imagining and Experiencing in Design, the Role of Performances. Proceedings of the Second Nordic Conference on Human-computer Interaction, ACM, 167-176. http://doi.org/10.1145/572020.572040","paperID":"None"},{"content":"32. Giulio Iacucci and Kari Kuutti. 2002. Everyday Life as a Stage in Creating and Performing Scenarios for Wireless Devices. Personal and Ubiquitous Computing 6, 4: 299-306. http://doi.org/10.1007/s007790200031","paperID":"None"},{"content":"33. Katherine Isbister and Kaho Abe. 2015. Costumes As Game Controllers: An Exploration of Wearables to Suit Social Play. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 691-696. http://doi.org/10.1145/2677199.2688813","paperID":"None"},{"content":"34. Katherine Isbister, Rahul Rao, Ulf Schwekendiek, Elizabeth Hayward, and Jessamyn Lidasan. 2011. Is More Movement Better?: A Controlled Comparison of Movement-based Games. Proceedings of the 6th International Conference on Foundations of Digital Games, ACM, 331-333. http://doi.org/10.1145/2159365.2159429","paperID":"None"},{"content":"35. Esther Jakobs, Antony S. R. Manstead, and Agneta H. Fischer. 1996. Social context and the experience of emotion. Journal of Nonverbal Behavior 20, 2: 123- 142. http://doi.org/10.1007/BF02253073","paperID":"None"},{"content":"36. Wonjun Lee, Youn-kyung Lim, and Richard Shusterman. 2014. Practicing Somaesthetics: Exploring Its Impact on Interactive Product Design Ideation. Proceedings of the 2014 Conference on Designing Interactive Systems, ACM, 1055-1064. http://doi.org/10.1145/2598510.2598561","paperID":"None"},{"content":"37. Lian Loke and George Poonkhin Khut. 2011. Surging Verticality: An Experience of Balance. Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 237- 240. http://doi.org/10.1145/1935701.1935747","paperID":"None"},{"content":"38. Lian Loke, Astrid T. Larssen, Toni Robertson, and Jenny Edwards. 2007. Understanding Movement for Interaction Design: Frameworks and Approaches. Personal Ubiquitous Comput. 11, 8: 691-701. http://doi.org/10.1007/s00779-006-0132--1","paperID":"None"},{"content":"39. Lian Loke and Toni Robertson. 2011. The Lived Body in Design: Mapping the Terrain. Proceedings of the 23rd Australian Computer-Human Interaction Conference, ACM, 181-184. http://doi.org/10.1145/2071536.2071565","paperID":"None"},{"content":"40. Lian Loke and Toni Robertson. 2013. Moving and Making Strange: An Embodied Approach to Movement-based Interaction Design. ACM Trans. Comput.-Hum. Interact. 20, 1: 7:1-7:25. http://doi.org/10.1145/2442106.2442113","paperID":"None"},{"content":"41. Catriona Macaulay, Giulio Jacucci, Shaleph O'Neill, Tomi Kankaineen, and Morna Simpson. 2006. Editorial: The Emerging Roles of Performance Within HCI and Interaction Design. Interact. Comput. 18, 5: 942-955. http://doi.org/10.1016/j.intcom.2006.07.001","paperID":"None"},{"content":"42. Carsten Magerkurth, Timo Engelke, and Maral Memisoglu. 2004. Augmenting the Virtual Domain with Physical and Social Elements: Towards a Paradigm Shift in Computer Entertainment Technology. Comput. Entertain. 2, 4: 12-12. http://doi.org/10.1145/1037851.1037870","paperID":"None"},{"content":"43. Antony Stephen Reid Manstead. 2005. The social dimension of emotion. The Psychologist 18, 8: 484- 487.","paperID":"None"},{"content":"44. Elena Márquez Segura and Katherine Isbister. 2015. Enabling Co-Located Physical Social Play: A Framework for Design and Evaluation. In Game User Experience Evaluation, Regina Bernhaupt (ed.). Springer International Publishing, 209-238. Retrieved June 15, 2015 from http://link.springer.com/chapter/10.1007/978--3--31915985-0_10","paperID":"None"},{"content":"45. Elena Márquez Segura, Annika Waern, Jin Moen, and Carolina Johansson. 2013. The Design Space of Body Games: Technological, Physical, and Social Design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3365-3374. http://doi.org/10.1145/2470654.2466461","paperID":"None"},{"content":"46. Helena M. Mentis, Kristina Höök, Florian Mueller, Katherine Isbister, George Poonkhin Khut, and Toni Robertson. 2014. Designing for the Experiential Body. CHI '14 Extended Abstracts on Human Factors in Computing Systems, ACM, 1069-1074. http://doi.org/10.1145/2559206.2579402","paperID":"None"},{"content":"47. Angela Moscaritolo. Microsoft: Xbox One Sales Double After Dropping Kinect. PCMAG. Retrieved June 7, 2015 from http://www.pcmag.com/article2/0,2817,2461023,00.as p","paperID":"None"},{"content":"48. Florian Mueller, Stefan Agamanolis, and Rosalind Picard. 2003. Exertion Interfaces: Sports over a Distance for Social Bonding and Fun. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 561-568. http://doi.org/10.1145/642611.642709","paperID":"None"},{"content":"49. Florian Mueller, Cagdas Toprak, Eberhard Graether, Wouter Walmink, Bert Bongers, and Elise van den Hoven. 2012. Hanging off a Bar. CHI '12 Extended Abstracts on Human Factors in Computing Systems, ACM, 1055-1058. http://doi.org/10.1145/2212776.2212384","paperID":"None"},{"content":"50. A. F. Newell, M. E. Morgan, P. Gregor, and A. Carmichael. 2006. Theatre As an Intermediary Between Users and CHI Designers. CHI '06 Extended Abstracts on Human Factors in Computing Systems, ACM, 111-116. http://doi.org/10.1145/112541125479","paperID":"None"},{"content":"51. Lene Nielsen. 2002. From User to Character: An Investigation into User-descriptions in Scenarios. Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, ACM, 99-104. http://doi.org/10.1145/778712.778729","paperID":"None"},{"content":"52. Kenton O'hara, Richard Harper, Helena Mentis, Abigail Sellen, and Alex Taylor. 2013. On the Naturalness of Touchless: Putting the \"Interaction\" Back into NUI. ACM Trans. Comput.-Hum. Interact. 20, 1: 5:1-5:25. http://doi.org/10.1145/2442106.2442111","paperID":"None"},{"content":"53. Alex F. Osborn and Lee Hastings Bristol. 1979. Applied Imagination: Principles and Procedures of Creative Thinking. Charles Scribner's Sons, New York.","paperID":"None"},{"content":"54. Antti Oulasvirta, Esko Kurvinen, and Tomi Kankainen. 2003. Understanding Contexts by Being There: Case Studies in Bodystorming. Personal Ubiquitous Comput. 7, 2: 125-134. http://doi.org/10.1007/s00779003-0238--7","paperID":"None"},{"content":"55. Marianne Graves Petersen, Ole Sejer Iversen, Peter Gall Krogh, and Martin Ludvigsen. 2004. Aesthetic Interaction: A Pragmatist's Aesthetics of Interactive Systems. Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, ACM, 269-276. http://doi.org/10.1145/1013115.1013153","paperID":"None"},{"content":"56. Cindy Poremba. 2007. Critical Potential on the Brink of the Magic Circle. Retrieved from http://www.digra.org/wp-content/uploads/digitallibrary/07311.42117.pdf","paperID":"None"},{"content":"57. Jenny Preece, Helen Sharp, and Yvonne Rogers. Wiley: Interaction Design: Beyond Human-Computer Interaction, 4th Edition - Jenny Preece, Helen Sharp, Yvonne Rogers. Retrieved September 25, 2015 from http://eu.wiley.com/WileyCDA/WileyTitle/productCdEHEP003334.html","paperID":"None"},{"content":"58. Niklas Ravaja, Timo Saari, Marko Turpeinen, Jari Laarni, Mikko Salminen, and Matias Kivikangas. 2006. Spatial Presence and Emotions During Video Game Playing: Does It Matter with Whom You Play? Presence: Teleoper. Virtual Environ. 15, 4: 381-392. http://doi.org/10.1162/pres.15.4.381","paperID":"None"},{"content":"59. Katie Salen and Eric Zimmerman. 2003. Rules of Play: Game Design Fundamentals. The MIT Press, Cambridge, Mass.","paperID":"None"},{"content":"60. Thecla Schiphorst. 2007. Really, Really Small: The Palpability of the Invisible. Proceedings of the 6th ACM SIGCHI Conference on Creativity & Cognition, ACM, 7-16. http://doi.org/10.1145/1254960.1254962","paperID":"None"},{"content":"61. Thecla Schiphorst. 2009. Soft(N): Toward a Somaesthetics of Touch. CHI '09 Extended Abstracts on Human Factors in Computing Systems, ACM, 2427-2438. http://doi.org/10.1145/1520340.1520345","paperID":"None"},{"content":"62. Thecla Schiphorst. 2011. Self-evidence: applying somatic connoisseurship to experience design. 145- 160. http://doi.org/10.1145/1979742.1979640","paperID":"None"},{"content":"63. Dennis Schleicher, Peter Jones, and Oksana Kachur. 2010. Bodystorming As Embodied Designing. interactions 17, 6: 47-51. http://doi.org/10.1145/1865245.1865256","paperID":"None"},{"content":"64. Richard Shusterman. 2008. Body Consciousness: A Philosophy of Mindfulness and Somaesthetics. Cambridge University Press, Cambridge?; New York.","paperID":"None"},{"content":"65. Richard Shusterman. 2013. Somaesthetics. The Encyclopedia of Human-Computer Interaction, 2nd Ed. Retrieved September 25, 2015 from https://www.interaction-design.org/literature/book/theencyclopedia-of-human-computer-interaction-2nded/somaesthetics","paperID":"None"},{"content":"66. Bart Simon. 2009. Wii are Out of Control: Bodies, Game Screens and the Production of Gestural Excess. Social Science Research Network, Rochester, NY. Retrieved June 7, 2015 from http://papers.ssrn.com/abstract=1354043","paperID":"None"},{"content":"67. Dag Svanaes. 2013. Interaction Design for and with the Lived Body: Some Implications of Merleau-ponty's Phenomenology. ACM Trans. Comput.-Hum. Interact. 20, 1: 8:1-8:30. http://doi.org/10.1145/2442106.2442114","paperID":"None"},{"content":"68. Joe Svetlik. 2012. Sony admits selection of PS Move games \"not so great.\" CNET. Retrieved June 7, 2015 from http://www.cnet.com/news/sony-admitsselection-of-ps-move-games-not-so-great/","paperID":"None"},{"content":"69. Christine Szentgyorgyi, Michael Terry, and Edward Lank. 2008. Renegade Gaming: Practices Surrounding Social Use of the Nintendo DS Handheld Gaming System. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1463- 1472. http://doi.org/10.1145/1357054.1357283","paperID":"None"},{"content":"70. Joshua Tanenbaum and Karen Tanenbaum. 2015. Envisioning the Future of Wearable Play: Conceptual Models for Props and Costumes as Game Controllers.","paperID":"None"},{"content":"71. Jakob Tholander and Carolina Johansson. 2010. Design Qualities for Whole Body Interaction: Learning from Golf, Skateboarding and BodyBugging. Proceedings of the 6th Nordic Conference on HumanComputer Interaction: Extending Boundaries, ACM, 493-502. http://doi.org/10.1145/1868914.1868970","paperID":"None"},{"content":"72. Sherry Turkle. 2012. Alone Together: Why We Expect More from Technology and Less from Each Other. Basic Books, New York, NY.","paperID":"None"},{"content":"73. John Vines, Tess Denman-Cleaver, Paul Dunphy, Peter Wright, and Patrick Olivier. 2014. Experience Design Theatre: Exploring the Role of Live Theatre in Scaffolding Design Dialogues. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 683-692. http://doi.org/10.1145/2556288.2556960","paperID":"None"},{"content":"74. Amy Voida and Saul Greenberg. 2009. Wii All Play: The Console Game As a Computational Meeting Place. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1559- 1568. http://doi.org/10.1145/1518701.1518940","paperID":"None"},{"content":"75. Annika Waern. 2009. Information Technology in Pervasive Games. In Pervasive Games, Markus Montola, Jaakko Stenros and Annika Waern (eds.). Morgan Kaufmann, Boston, 163-174. Retrieved June 14, 2015 from http://www.sciencedirect.com/science/article/pii/B978 0123748539000088","paperID":"None"},{"content":"76. Danielle Wilde. 2008. The Hipdiskettes: Learning (Through) Wearables. Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat, ACM, 259-262. http://doi.org/10.1145/1517744.1517771","paperID":"None"},{"content":"77. Danielle Wilde, Thecla Schiphorst, and Sietske Klooster. 2011. Move to Design/Design to Move: A Conversation About Designing for the Body. interactions 18, 4: 22-27. http://doi.org/10.1145/1978822.1978828","paperID":"None"},{"content":"78. Douglas Wilson. 2011. Brutally Unfair Tactics Totally OK Now: On Self-Effacing Games and Unachievements. Game Studies 11, 1. Retrieved September 25, 2015 from http://gamestudies.org/1101/articles/wilson","paperID":"None"},{"content":"79. 2008. Game Design Workshop: A Playcentric Approach to Creating Innovative Games. Morgan Kaufmann, Amsterdam?; Boston.","paperID":"None"},{"content":"80. 2013. Phenomenology of Perception. Routledge.","paperID":"None"},{"content":"81. 2016. TRX. Retrieved from https://www.trxtraining.com/","paperID":"None"},{"content":"82. Design Fiction: A Short Essay on Design, Science, Fact and Fiction | Near Future Laboratory. Retrieved September 25, 2015 from http://blog.nearfuturelaboratory.com/2009/03/17/desig n-fiction-a-short-essay-on-design-science-fact-andfiction/","paperID":"None"}],"abstract":"Designing bodily experiences is challenging. In this paper, we propose embodied sketching as a way of practicing design that involves understanding and designing for bodily experiences early in the design process. Embodied sketching encompasses ideation methods that are grounded in, and inspired by, the lived experience and includes the social and spatial settings as design resources in the sketching. Embodied sketching is also based on harnessing play and playfulness as the principal way to elicit creative physical engagement. We present three different ways to implement and use embodied sketching in the application domain of co-located social play. These include bodystorming of ideas, co-designing with users, and sensitizing designers. The latter helps to uncover and articulate significant, as well as novel embodied experiences, whilst the first two are useful for developing a better understanding of possible design resources.","title":"Embodied Sketching","filename":"CHI16/p6014","authors":["Elena Márquez Segura","Laia Turmo Vidal","Asreen Rostami","Annika Waern"],"conference":"CHI '16"}