{"paperId":2858433,"citation":[],"reference":[{"content":"2015. Ausstellerinformationen. http://www.merzverlag.com/ausstellerinformationen.html.","paperID":"None"},{"content":"William Attia. 2005. Caylus. Boardgame. Ystari (Paris).","paperID":"None"},{"content":"Kirk Bauer. 2012, October 14. My Agricola Storage Solution. In Boardgamegeek.com. Retrieved from http://boardgamegeek.com/thread/869646/my-agricolastorage-solution","paperID":"None"},{"content":"Eric PS Baumer, Morgan G Ames, Jed R Brubaker, Jenna Burrell and Paul Dourish. 2014. Refusing, Limiting, Departing: Why We Should Study Technology Non-Use. In Proceedings of CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 65--68.","paperID":"None"},{"content":"Eric PS Baumer and M Silberman. 2011. When the Implication Is Not to Design (Technology). In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 22712274.","paperID":"None"},{"content":"Russell W. Belk. 1988. Possessions and the Extended Self. Journal of Consumer Research 15, 2, 139--168. http://dx.doi.org/10.2307/2489522","paperID":"None"},{"content":"Karl Bergström. 2010. The Implicit Rules of Board Games: On the Particulars of the Lusory Agreement. In Proceedings of Proceedings of the 14th International Academic MindTrek Conference: Envisioning Future Media Environments. ACM, 1930506, 86--93. http://dx.doi.org/10.1145/1930488.1930506","paperID":"None"},{"content":"Regina Bernhaupt, Katherine Isbister and Sara de Freitas. 2015. Introduction to This Special Issue on Hci and Games. Human-Computer Interaction 30, 3--4, 195--201.","paperID":"None"},{"content":"Staffan Björk. 2008. Games, Gamers, and Gaming: Understanding Game Research. In Proceedings of Proceedings of the 12th international conference on Entertainment and media in the ubiquitous era. ACM, 1457213, 64--68. http://dx.doi.org/10.1145/1457199.1457213","paperID":"None"},{"content":"Staffan Björk. 2012. Tisch-Digital Tools Supporting Board Games. Foundations of Digital Games 2012.","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2, 77--101. http://dx.doi.org/10.1191/1478088706qp063oa","paperID":"None"},{"content":"Ashley M. Brown. 2015. Awkward: The Importance of Reflexivity in Using Ethnographic Methods. In Game Research Methods: An Overview, Petri Lankoski and Staffan Björk Eds. ETC Press (Halifax), 77--92.","paperID":"None"},{"content":"J. Burgess. n.d. Play-by-Mail Diplomacy Vs Play-byEmail Diplomacy: Some Differences in Style and Feel. http://www.diplom.org/~diparch/resources/postal/pbmvs-pbem.htm.","paperID":"None"},{"content":"Allan B Callhamer. 1959. Diplomacy. Boardgame. [self-published].","paperID":"None"},{"content":"Marcus Carter, Martin Gibbs and Mitchell Harrop. 2014. Drafting an Army: The Playful Pastime of Warhammer 40,000. Games and Culture 9, 2, 122--147. http://dx.doi.org/10.1177/1555412013513349","paperID":"None"},{"content":"Marcus Carter, Mitchell Harrop and Martin Gibbs. 2014. The Roll of Dice in Warhammer 40,000. ToDIGRA: Physical and Digital in Games and Play 1, 3.","paperID":"None"},{"content":"Amanda Cote and Julia G. Raz. 2015. In-Depth Interviews for Game Research. In Game Research Methods: An Overview, Petri Lankoski and Staffan Björk Eds. ETC Press (Halifax), 93--116.","paperID":"None"},{"content":"Andy Crabtree, Steve Benford, Mauricio Capra, Martin Flintham, Adam Drozd, Nick Tandavanitj, Matt Adams and Ju Row-Farr. 2007. The Cooperative Work of Gaming: Orchestrating a Mobile Sms Game. Computer supported cooperative work (CSCW) 16, 167--198. http://dx.doi.org/10.1007/s10606-007--9048--1","paperID":"None"},{"content":"Dimitrios Paris Darzentas, Michael A. Brown, Martin Flintham and Steve Benford. 2015. The Data Driven Lives of Wargaming Miniatures. In Proceedings of CHI 2015. 2427--2436.","paperID":"None"},{"content":"Chris Deaker, Masood Masoodian and Bill Rogers. 2013. Providing Adaptive Visual Interface Feedback in Massively Multiplayer Online Games. In Advances in Computer Entertainment, Springer, 29--44.","paperID":"None"},{"content":"Heather Desurvire, Martin Caplan and Jozsef A Toth. 2004. Using Heuristics to Evaluate the Playability of Games. In Proceedings of CHI'04 extended abstracts on Human factors in computing systems. ACM, 15091512.","paperID":"None"},{"content":"Morgan Dontanville. 2004. Board Game: Monopoly. In SNACKTASTROPHE: When Games + Food = Big Fat Man-Tears. Retrieved from https://www.boardgamegeek.com/geeklist/2412/item/3 5175 Item35175","paperID":"None"},{"content":"Paul Dourish. 2006. Implications for Design. In Proceedings of Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 541550.","paperID":"None"},{"content":"Paul Dourish. 2014. Reading and Interpreting Ethnography. In Ways of Knowing in Hci, Judith S. Olson and Wendy A. Kellogg Eds. Springer (NY Heidelberg Dordrecht London), 1--23.","paperID":"None"},{"content":"Lina Eklund. 2012. The Sociality of Gaming. Stockholm University Library (Stockholm, Sweden).","paperID":"None"},{"content":"John Fiorillo and Justin Gary. 2010. Ascension: Chronicle of the Godslayer. Board Game. Stone Blade Entertainment.","paperID":"None"},{"content":"Friedemann Friese. 2004. Power Grid. Boardgame. Rio Grande Games (Placitas, NM).","paperID":"None"},{"content":"Verena Fuchsberger, Martin Murer and Manfred Tscheligi. 2013. Materials, Materiality, and Media. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2481395, 2853--2862. http://dx.doi.org/10.1145/2470654.2481395","paperID":"None"},{"content":"Verena Fuchsberger, Martin Murer and Manfred Tscheligi. 2014. Human-Computer Non-Interaction: The Activity of Non-Use. In Proceedings of Proceedings of the 2014 companion publication on Designing interactive systems. ACM, 57--60.","paperID":"None"},{"content":"William Gaver, John Bowers, Tobie Kerridge, Andy Boucher and Nadine Jarvis. 2009. Anatomy of a Failure: How We Knew When Our Design Went Wrong, and What We Learned from It. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2213--2222.","paperID":"None"},{"content":"GenCon. 2014. Gen Con Attributes Record-Breaking 2014 Numbers to Growing Partnership between Gamers and INpolis Community. GenCon (INpolis, USA).","paperID":"None"},{"content":"Susan A. Glyptis and Deborah A. Chambers. 1982. No Place Like Home. Leisure Studies 1, 3, 247--262. http://dx.doi.org/10.1080/02614368200390211","paperID":"None"},{"content":"Martin Grider. 2014. Usability Lessons from Mobile Board Game Conversions. In Proceedings of GDC 2014.","paperID":"None"},{"content":"Shad Gross, Jeffrey Bardzell and Shaowen Bardzell. 2014. Structures, Forms, and Stuff: The Materiality and Medium of Interaction. Personal and Ubiquitous Computing 18, 3, 637--649 %@ 1617--4909.","paperID":"None"},{"content":"Michael Heidt, Kalja Kanellopoulos, Linda Pfeiffer and Paul Rosenthal. 2015. Hci and the Community of NonUsers. In Design, User Experience, and Usability: Design Discourse, Aaron Marcus Ed. Springer International Publishing, 44--52. http://dx.doi.org/10.1007/978--3--319--20886--2_5","paperID":"None"},{"content":"Urs Hostettler. 1991. Tichu. Boardgame. Abacusspiele.","paperID":"None"},{"content":"Ioanna Iacovides and Anna L. Cox. 2015. Moving Beyond Fun: Evaluating Serious Experience in Digital Games. In Proceedings of CHI 2015. 2245--2254.","paperID":"None"},{"content":"Katherine Isbister and Florian \"Floyd\" Mueller. 2014. Guidelines for the Design of Movement-Based Games and Their Relevance to Hci. Human-Computer Interaction 30, 3--4, 366--399. http://dx.doi.org/10.1080/07370024.2014.996647","paperID":"None"},{"content":"Katherine Isbister and Noah Schaffer. 2008. Game Usability: Advice from the Experts for Advancing the Player Experience. CRC Press (Boca Raton, FL).","paperID":"None"},{"content":"Andruid Kerne, William A Hamilton and Zachary O Toups. 2012. Culturally Based Design: Embodying Trans-Surface Interaction in Rummy. In Proceedings of Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 509518.","paperID":"None"},{"content":"Philippe Keyaerts. 2009. Small World. Boardgame. Days of Wonder.","paperID":"None"},{"content":"Keunyeong Kim, Michael G Schmierbach, Mun-Young Chung, Julia Daisy Fraustino, Frank Dardis and Lee Ahern. 2015. Is It a Sense of Autonomy, Control, or Attachment? Exploring the Effects of in-Game Customization on Game Enjoyment. Computers in Human Behavior 48, 695--705.","paperID":"None"},{"content":"Reiner Knizia. 1999. Ra. Boardgame. Alea (Bernau am Chiemsee, Germany).","paperID":"None"},{"content":"William A. Koppe. 1955. The Psychological Meanings of Housing and Furnishings. Marriage and Family Living 17, 2, 129--132. http://dx.doi.org/10.2307/348308","paperID":"None"},{"content":"Matúš Kotry. 2015. Alchemists. Boardgame. Czech Games Edition (Kladno, Czech Republic).","paperID":"None"},{"content":"Wolfgang Kramer and Horst-Rainer Rösner. 2007. El Capitán. Boardgame. Quined White Goblin Games.","paperID":"None"},{"content":"Pierre-Nicolas Lapointe. 2003. Interview Reiner Knizia. http://jesweb.net/old/coin/knizia/kniziaen.html.","paperID":"None"},{"content":"Bruno Latour. 1997. The Trouble with Actor-Network Theory. In Om Aktor-Netvaerksteroi. Nogle Fa Afklaringer Og Mere End Nogle Fa Forvikinger, Finn Olsen Ed. Philsophia, 47--64.","paperID":"None"},{"content":"Sus Lundgren. 2008. Cover Story Designing Games: Why and How. interactions 15, 6, 6--12.","paperID":"None"},{"content":"Heather MacFadyen. 2011. The Reader's Devices: The Affordances of Ebook Readers.","paperID":"None"},{"content":"John McCarthy and Peter Wright. 2004. Technology as Experience. interactions 11, 5, 42--43. http://dx.doi.org/10.1145/1015530.1015549","paperID":"None"},{"content":"Marshall McLuhan and Quentin Fiore. 1967. The Medium Is the Massage.","paperID":"None"},{"content":"Alan R. Moon. 2004. Ticket to Ride. Boardgame. Days of Wonder.","paperID":"None"},{"content":"Dan John Moran, Carey Metcalfe and T.C. Nicholas Graham. 2014. Irc Quest: Using the Commons Dilemma to Support a Single-Screen Game for Hundreds of Players. In Proceedings of Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play. ACM, 2662991, 359--362. http://dx.doi.org/10.1145/2658537.2662991","paperID":"None"},{"content":"Lennart E Nacke. 2015. Games User Research and Physiological Game Evaluation. In Game User Experience Evaluation, Springer, 63--86.","paperID":"None"},{"content":"Nazhuret. 2004. Board Game: Carcassonne. Online List Item. (Boardgamegeek.com).","paperID":"None"},{"content":"Scott Nicholson. 2015. Board Game Shelves with Scott.","paperID":"None"},{"content":"Jakob Nielsen. 2009. Kindle Content Design. (nngroup.com).","paperID":"None"},{"content":"Dave Norris. 2014. Caverna the Cave Farmers Board Game Review. In Dicey Goblin. Retrieved 25 September 2015 from https://diceygoblin.com/blog/caverna-the-cavefarmers-board-game-review/","paperID":"None"},{"content":"Jacki O'Neill, Shourya Roy, Antonietta Grasso and David Martin. 2013. Form Digitization in Bpo: From Outsourcing to Crowdsourcing? In Proceedings of Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 197--206.","paperID":"None"},{"content":"K. OHannessian. 2012. Hasbro Is No Has-Been: Board Games Surve in the Digital Age. In. Retrieved from http://www.fastcompany.com/1810959/board-gamesrisk-factions-ticket-to-ride-reiner-knizia","paperID":"None"},{"content":"Rick Priestley. 1987. Warhammer 40,000. Miniatures game. Games Workshop (Nottingham, UK).","paperID":"None"},{"content":"Lewis Pulsipher. 2012. Game Design: How to Create Video and Tabletop Games, Start to Finish. McFarland & Company, Inc. (Jefferson, North Carolina, and London),","paperID":"None"},{"content":"Thorsten Quandt and Thilo von Pape. 2010. Living in the Mediatope: A Multimethod Study on the Evolution of Media Technologies in the Domestic Environment. The Information Society 26, 5, 330--345.","paperID":"None"},{"content":"Neil Randall. 2011. The Boardgame Online. In Gamers: The Social and Cultural Significance of Online Games, Garry Crawford et al. Eds. Routledge (Abingdon), 93--107.","paperID":"None"},{"content":"Adrienne Raphel. 2014. The Man Who Built Catan. (NY).","paperID":"None"},{"content":"Melissa J. Rogerson, Martin Gibbs and Wally Smith. 2015. Digitising Boardgames: Issues and Tensions. In Proceedings of DiGRA 2015; Diversity of Play. Digital Games Research Association.","paperID":"None"},{"content":"Uwe Rosenberg. 2009. At the Gates of Loyang. Boardgame. H@ll Games.","paperID":"None"},{"content":"Daniela Rosner and Jonathan Bean. 2009. Learning from Ikea Hacking: I'm Not One to Decoupage a Tabletop and Call It a Day. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 419--422.","paperID":"None"},{"content":"Daniela K Rosner. 2010. Mediated Crafts: Digital Practices around Creative Handwork. In Proceedings of CHI'10 Extended Abstracts on Human Factors in Computing Systems. ACM, 2955--2958.","paperID":"None"},{"content":"Jim Ross. 2013. Learning from Board Games. http://www.uxmatters.com/mt/archives/2013/09/learnin g-from-board-games.php.","paperID":"None"},{"content":"Jason Russ. 2005. Board Game: Dak2. (Boardgamegeek.com).","paperID":"None"},{"content":"Katie Salen and Eric Zimmermann. 2004. Rules of Play. Game Design Fundamentals. MIT Press (Massachusets),","paperID":"None"},{"content":"Christine Satchell and Paul Dourish. 2009. Beyond the User: Use and Non-Use in Hci. In Proceedings of Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7. ACM, 9--16.","paperID":"None"},{"content":"Jesse Schell. 2014. The Art of Game Design: A Book of Lenses. Wiley,","paperID":"None"},{"content":"Shellhead. 2009. Do You Sleeve All Your Games? In Fortress: Ameritrash. Retrieved 22 September 2015 from http://fortressat.com/forum/34-pimp-mygame/45992-do-you-sleeve-all-your-games","paperID":"None"},{"content":"Slev. 2012. In Unofficial Awesome October 12 Games for GeekGold- Waiting for the Great Leap Forwards. Retrieved from https://www.boardgamegeek.com/geeklist/147385?com mentid=3211192 - comment3211192","paperID":"None"},{"content":"Stephen Snow, Bronte McMahon, Sally McKenzie, Kenneth Radke, Ivy Verlaat and Laurie Buys. 2015. Designing for Collections: Building Histories, Sharing the Spectacle. In Proceedings of Annual Meeting of the Australian Special Interest Group for Computer Human Interaction. ACM, 2838798, 299--303. http://dx.doi.org/10.1145/2838739.2838798","paperID":"None"},{"content":"Robert A. Stebbins. 2012. The Idea of Leisure: First Principles. Transaction Publishers (New Brunswick, New Jersey),","paperID":"None"},{"content":"Andreas Steding. 2009. Hansa Teutonica. Boardgame. Argentum Verlag (Köln).","paperID":"None"},{"content":"Jaakko Stenros, Janne Paavilainen and Frans Mäyrä. 2009. The Many Faces of Sociability and Social Play in Games. In Proceedings of Proceedings of the 13th International MindTrek Conference: Everyday Life in the Ubiquitous Era. ACM, 82--89.","paperID":"None"},{"content":"Christine Szentgyorgyi, Michael Terry and Edward Lank. 2008. Renegade Gaming: Practices Surrounding Social Use of the Nintendo Ds Handheld Gaming System. In Proceedings of CHI '08. 1463--1472.","paperID":"None"},{"content":"Joshua G Tanenbaum, Amanda M Williams, Audrey Desjardins and Karen Tanenbaum. 2013. Democratizing Technology: Pleasure, Utility and Expressiveness in Diy and Maker Practice. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 26032612.","paperID":"None"},{"content":"Chris Tannhauser. 2004. Snacktastrophe: When Games + Food = Big Fat Man-Tears. Geek List. Boardgamegeek.","paperID":"None"},{"content":"Robert L. Underwood. 2003. The Communicative Power of Product Packaging: Creating Brand Identity Via Lived and Mediated Experience. Journal of Marketing Theory and Practice 11, 1, 62--76. http://dx.doi.org/10.2307/40470084","paperID":"None"},{"content":"Donald X. Vaccarino. 2008. Dominion. Boardgame. Rio Grande Games (Placitas, NM).","paperID":"None"},{"content":"Jan Van Looy, Cédric Courtois, Melanie De Vocht and Lieven De Marez. 2012. Player Identification in Online Games: Validation of a Scale for Measuring Identification in Mmogs. Media Psychology 15, 2, 197221. http://dx.doi.org/10.1080/15213269.2012.674917","paperID":"None"},{"content":"Eerko Vissering. 2015. Bgstats. eerko.nl.","paperID":"None"},{"content":"Amy Voida and Saul Greenberg. 2009. Wii All Play: The Console Game as a Computational Meeting Place. In Proceedings of CHI '09. 1559--1568.","paperID":"None"},{"content":"Bill Wall. 2007. Correspondence Chess - a History. http://www.chess.com/article/view/correspondencechess--a-histo.","paperID":"None"},{"content":"James R. Wallace, Joseph Pape, Yu-Ling Betty Chang, Phillip J. McClelland, T.C. Nicholas Graham, Stacey D. Scott and Mark Hancock. 2012. Exploring Automation in Digital Tabletop Board Game. In Proceedings of Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion. ACM, 2141585, 231--234. http://dx.doi.org/10.1145/2141512.2141585","paperID":"None"},{"content":"Martin Wallace. 2012. P.I. Boardgame. Treefrog Games.","paperID":"None"},{"content":"Tricia Wang and Joseph'Jofish' Kaye. 2011. Inventive Leisure Practices: Understanding Hacking Communities as Sites of Sharing and Innovation. In Proceedings of CHI'11 Extended Abstracts on Human Factors in Computing Systems. ACM, 263--272.","paperID":"None"},{"content":"Stewart Woods. 2012. Eurogames: The Design, Culture and Play of Modern European Board Games. McFarland & Company, Inc, Publishers (Jefferson, North Carolina, and London),","paperID":"None"},{"content":"William Douglas Woody, David B Daniel and Crystal A Baker. 2010. E-Books or Textbooks: Students Prefer Textbooks. Computers & Education 55, 3, 945--948.","paperID":"None"},{"content":"Steve Woolgar. 2002. Five Rules of Virtuality. In Virtual Society? Technology, Cyberbole, Reality, Steve Woolgar Ed. Oxford University Press (Oxford), 1--22.","paperID":"None"},{"content":"Shoshana Zuboff. 1988. In the Age of the Smart Machine: The Future of Work and Power. Basic Books (NY),","paperID":"None"}],"abstract":"This paper presents findings from a study of boardgamers which stress the importance of the materiality of modern boardgames. It demonstrates that materiality is one of four significant factors in the player experience of tabletop gaming and describes four domains of materiality in boardgaming settings. Further, building on understanding of non-use in HCI, it presents boardgames as a unique situation of parallel use, in which users simultaneously engage with a single game in both digital and material, non-digital environments.","title":"\"I Love All the Bits\": The Materiality of Boardgames","filename":"CHI16/p3956","authors":["Melissa J. Rogerson","Martin Gibbs","Wally Smith"],"conference":"CHI '16"}