{"paperId":2858074,"citation":[],"abstract":"User interfaces often attempt to assist users by automating elements of interaction, but these attempts will periodically fail -- impeding user performance. To understand the design implications of correct and incorrect assistance, we conducted an experiment in which subjects selected their preferred of two interfaces (neutral and snapping) for a series of 10 drag-and-drop tasks. With neutral the dragged object moved pixel-by-pixel, and with snapping the object snapped to a grid. Snapping trials were engineered to provide controlled levels of objective performance gains and losses with respect to neutral: gains were achieved when the target was aligned with the grid, and losses were achieved through misalignment -- which required subjects to drop the object, hold a key, and complete the task using a finer movement resolution. Results showed a significant preference for the snapping interface, even when losses impaired performance.","reference":[{"content":"Maurice Allais. 1953. Le Comportement de l'Homme Rationnel devant le Risque: Critique des Postulats et Axiomes de l'Ecole Americaine. Econometrica 21, 4 (1953), 503--546. DOI:http://dx.doi.org/10.2307/","paperID":"None"},{"content":"Rolph E. Anderson. 1973. Consumer Dissatisfaction: The Effect of Disconfirmed Expectancy on Perceived Product Performance. Journal of Marketing Research 10, 1 (1973), 38--44. DOI:http://dx.doi.org/10.2307/3149407","paperID":"None"},{"content":"Roy F. Baumeister, Ellen Bratslavsky, Catrin Finkenauer, and Kathleen D. Vohs. 2001. Bad is stronger than good. Review of General Psychology 5, 4 (2001), 323--370. DOI:http://dx.doi.org/10.1037/1089-2680.5.","paperID":"None"},{"content":"323 4. Daniel Bernoulli. 1954. Exposition of a new theory on the measurement of risk. Econometrica 22, 1 (1954), 23--36. DOI:http://dx.doi.org/10.2307/1909829","paperID":"None"},{"content":"Scott Brave and Clifford Nass. 2008. Emotion in Human-Computer Interaction. In The Human-Computer Interaction Handbook, Andrew Sears and Julie A. Jacko (Eds.). Lawrence Erlbaum Associates, New York, NY, Chapter 4, 77--92.","paperID":"None"},{"content":"Colin F. Camerer. 1995. Individual Decision Making. In The Handbook of Experimental Economics, John H. Kagel and Alvin E. Roth (Eds.). Princeton University Press, Princeton, New Jersey, Chapter 8, 587--703.","paperID":"None"},{"content":"Colin F. Camerer. 1998. Bounded Rationality in Individual Decision Making. Experimental Economics 1, 2 (1998), 163--183. DOI:http://dx.doi.org/10.1023/A:1009944326196","paperID":"None"},{"content":"Colin F. Camerer, George Loewenstein, and Matthew Rabin (Eds.). 2004. Advances in Behavioral Economics. Princeton University Press, Princeton, NJ.","paperID":"None"},{"content":"Irina Ceaparu, Jonathan Lazar, Katie Bessiere, John Robinson, and Ben Shneiderman. 2004. Determining Causes and Severity of End-User Frustration. International Journal of Human-Computer Interaction 17, 3 (2004), 333--356. DOI:http://dx.doi.org/10.1207/s15327590ijhc1703_3","paperID":"None"},{"content":"Andy Cockburn, Philip Quinn, and Carl Gutwin. 2015. Examining the Peak-End Effects of Subjective Experience. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 357--366. DOI: http://dx.doi.org/10.1145/2702123.2702139","paperID":"None"},{"content":"Ward Edwards. 1954. The theory of decision making. Psychological Bulletin 51, 4 (1954), 380--417. DOI: http://dx.doi.org/10.1037/h0053870","paperID":"None"},{"content":"Erik Frøkjær, Morten Hertzum, and Kasper Hornbæk. 2000. Measuring Usability: Are Effectiveness, Efficiency, and Satisfaction Really Correlated?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, New York, NY, 345--352. DOI: http://dx.doi.org/10.1145/332040.332455","paperID":"None"},{"content":"Faruk Gul. 1991. A Theory of Disappointment Aversion. Econometrica 59, 3 (1991), 667--686. DOI:http://dx.doi.org/10.2307/2938223","paperID":"None"},{"content":"Chris Harrison, Brian Amento, Stacey Kuznetsov, and Robert Bell. 2007. Rethinking the Progress Bar. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, New York, NY, 115--118. DOI:http://dx.doi.org/10.1145/1294211.1294231","paperID":"None"},{"content":"Marc Hassenzahl. 2004. The Interplay of Beauty, Goodness, and Usability in Interactive Products. HumanComputer Interaction 19, 4 (2004), 319--349. DOI:http://dx.doi.org/10.1207/s15327051hci1904_2","paperID":"None"},{"content":"Kasper Hornbæk. 2006. Current practice in measuring usability: Challenges to usability studies and research. International Journal of Human-Computer Studies 64, 2 (2006), 79--102. DOI:http://dx.doi.org/10.1016/j.ijhcs.2005.06.002","paperID":"None"},{"content":"Kasper Hornbæk and Effie Lai-Chong Law. 2007. Metaanalysis of Correlations Among Usability Measures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, 617--626. DOI:http://dx.doi.org/10.1145/1240624.1240722","paperID":"None"},{"content":"Daniel Kahneman, Barbara L. Fredrickson, Charles A. Schreiber, and Donald A. Redelmeier. 1993. When More Pain Is Preferred to Less: Adding a Better End. Psychological Science 4, 6 (1993), 401--405. DOI: http://dx.doi.org/10.1111/j.1467-9280.1993. tb00589.x","paperID":"None"},{"content":"Daniel Kahneman and Amos Tversky. 1979. Prospect Theory: An Analysis of Decision Under Risk. Econometrica 47, 2 (1979), 263--292. DOI: http://dx.doi.org/10.2307/1914185","paperID":"None"},{"content":"Daniel Kahneman and Amos Tversky (Eds.). 2000. Choices, Values, and Frames. Cambridge University Press, Cambridge, UK.","paperID":"None"},{"content":"Jonathan Lazar, Adam Jones, Mary Hackley, and Ben Shneiderman. 2006. Severity and impact of computer user frustration: A comparison of student and workplace users. Interacting with Computers 18, 2 (2006), 187--207. DOI: http://dx.doi.org/10.1016/j.intcom.2005.06. 001","paperID":"None"},{"content":"I. Scott MacKenzie. 1992. Fitts' law as a research and design tool in human-computer interaction. HumanComputer Interaction 7, 1 (1992), 91--139. DOI:http://dx.doi.org/10.1207/s15327051hci0701_3","paperID":"None"},{"content":"M. W. Matlin and D. J. Stang. 1978. The Pollyanna Principle: Selectivity in Language, Memory, and Thought. Schenkman, Cambridge, MA.","paperID":"None"},{"content":"Jonathan Mercer. 2005. Prospect Theory and Political Science. Annual Review of Political Science 8, 1 (2005), 1-21. DOI:http://dx.doi.org/10.1146/annurev.polisci.8.082103.104911","paperID":"None"},{"content":"Jakob Nielsen and Jonathan Levy. 1994. Measuring Usability: Preference vs. Performance. Commun. ACM 37, 4 (April 1994), 66--75. DOI:http://dx.doi.org/10.1145/175276.175282","paperID":"None"},{"content":"Richard L. Oliver. 1980. A Cognitive Model of the Antecedents and Consequences of Satisfaction Decisions. Journal of Marketing Research 17, 4 (1980), 460--469. DOI:http://dx.doi.org/10.2307/3150499","paperID":"None"},{"content":"Guido Peeters. 1971. The positive-negative asymmetry: On cognitive consistency and positivity bias. European Journal of Social Psychology 1, 4 (1971), 455--474. DOI: http://dx.doi.org/10.1002/ejsp.2420010405","paperID":"None"},{"content":"Guido Peeters and Janusz Czapinski. 1990. PositiveNegative Asymmetry in Evaluations: The Distinction Between Affective and Informational Negativity Effects. European Review of Social Psychology 1, 1 (1990), 33--60. DOI:http://dx.doi.org/10.1080/14792779108401856","paperID":"None"},{"content":"Gordon F. Pitz and Natalie J. Sachs. 1984. Judgment and Decision: Theory and Application. Annual Review of Psychology 35, 1 (1984), 139--164. DOI:http://dx.doi.org/10.1146/annurev.ps.35.020184.001035","paperID":"None"},{"content":"Philip Quinn and Shumin Zhai. 2016. A Cost-Benefit Study of Text Entry Suggestion Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY. DOI: http://dx.doi.org/10.1145/2858036.2858305","paperID":"None"},{"content":"Matthew Rabin. 1998. Psychology and Economics. Journal of Economic Literature 36, 1 (1998), 11--46.","paperID":"None"},{"content":"Paul Rozin and Edward B. Royzman. 2001. Negativity Bias, Negativity Dominance, and Contagion. Personality and Social Psychology Review 5, 4 (2001), 296--320. DOI:http://dx.doi.org/10.1207/S15327957PSPR0504_2","paperID":"None"},{"content":"Herbert A. Simon. 1959. Theories of Decision-Making in Economics and Behavioral Science. The American Economic Review 49, 3 (1959), 253--283. http://jstor.org/stable/1809901","paperID":"None"},{"content":"Shelley E. Taylor. 1991. Asymmetrical effects of positive and negative events: The mobilization-minimization hypothesis. Psychological Bulletin 110, 1 (1991), 67--85. DOI:http://dx.doi.org/10.1037/0033--2909.110.1.67","paperID":"None"},{"content":"Richard H. Thaler. 1980. Toward a positive theory of consumer choice. Journal of Economic Behavior & Organization 7, 1 (1980), 39--60. DOI:http://dx.doi.org/10.1016/0167-2681(80)90051-7","paperID":"None"},{"content":"Amos Tversky and Daniel Kahneman. 1981. The framing of decisions and the psychology of choice. Science 211, 4481 (1981), 453--458. DOI:http://dx.doi.org/10.1126/science.7455683","paperID":"None"},{"content":"Elke U. Weber and Eric J. Johnson. 2009. Mindful Judgment and Decision Making. Annual Review of Psychology 60, 1 (2009), 53--85. DOI:http://dx.doi. org/10.1146/annurev.psych.60.110707.163633","paperID":"None"},{"content":"George Wu, Chip Heath, and Richard Larrick. 2008. A prospect theory model of goal behavior. (2008).","paperID":"None"},{"content":"Youjae Yi. 1990. A Critical Review of Consumer Satisfaction. In Review of Marketing 1990, Valarie A. Zeithaml (Ed.). American Marketing Association, Chicago, IL, 68--123.","paperID":"None"}],"title":"When Bad Feels Good: Assistance Failures and Interface Preferences","filename":"CHI16/p4005","authors":["Philip Quinn","Andy Cockburn"],"conference":"CHI '16"}