{"paperId":2858530,"reference":[{"content":"Peter Bøgh Andersen and Kim Halskov Madsen. 1988. Design and professional languages. DAIMI PB-244","paperID":"None"},{"content":"Peter Bøgh Andersen and Tone Bratteteig (eds.) 1988. Computers and language at work, SYDPOL.","paperID":"None"},{"content":"Jakob E. Bardram and Olav W. Bertelsen.1995. Supporting the Development of Transparent Interaction. In Blumenthal, Gornostaev, & Unger (eds.). Human-Computer Interaction. 5th. International Conference, EWHCI '95 Moscow, Russia, July 1995. Selected Papers. Springer Verlag (LNCS 1015), 79--90.","paperID":"None"},{"content":"David Benyon and Manuel Imaz. 1999. Metaphors and models: conceptual foundations of representations in interactive systems development. Hum.-Comput. Interact. 14, 1 (March 1999), 159--189. DOI=10.1207/s15327051hci1401&2_5 http://dx.doi.org/10.1207/s15327051hci1401&2_5","paperID":"None"},{"content":"Olav W. Bertelsen and Susanne Bødker, S. 2003. Activity theory. In Carroll, J. M. (ed). HCI models, theories, and frameworks: Toward an interdisciplinary science. Morgan Kaufman, 291--324.","paperID":"None"},{"content":"Alan F. Blackwell. 2006. The reification of metaphor as a design tool. ACM Trans. Comput.-Hum. Interact. 13, 4 (December 2006): 490--530. DOI=10.1145/1188816.1188820 http://doi.acm.org/10.1145/1188816.1188820","paperID":"None"},{"content":"Susanne Bødker and Peter Bøgh Andersen. 2005. Complex Mediation, Journal of Human Computer Interaction, 20(4): 353--402.","paperID":"None"},{"content":"Susanne Bødker and Ellen Christiansen. 1997. Scenarios as springboards in design. In Bowker, G., Gasser, L., Star, S.L. & Turner, W. (eds.), Social science research, technical systems and cooperative work. Erlbaum, 217--234.","paperID":"None"},{"content":"Susanne Bødker, Ellen Christiansen. 2012. Poetry in motion: appropriation of the world of apps. In P. and S. Turner (eds.) Proceedings of the 30th European Conference on Cognitive Ergonomics, Edinburgh, UK, 78--84. [doi: 10.1145/2448136.2448152]","paperID":"None"},{"content":"Susanne Bødker, Clemens Nylandsted Klokmose, Matthias Korn, and Anna Maria Polli. 2014. Participatory IT in semi-public spaces. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, NY, NY, USA, 765--774. DOI=10.1145/2639189.2639212 http://doi.acm.org/10.1145/2639189.2639212","paperID":"None"},{"content":"Susanne Bødker and Clemens Nylandsted Klokmose. 2012. Dynamics in artifact ecologies. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, NY, NY, USA, 448--457. DOI=10.1145/2399016.2399085 http://doi.acm.org/10.1145/2399016.2399085","paperID":"None"},{"content":"Susanne Bødker and Clemens N. Klokmose. 2011. The Human-Artifact Model-An Activity Theoretical Approach to Artifact Ecologies. Human-Computer Interaction. 26, (4): 315--371.","paperID":"None"},{"content":"Susanne Bødker and Anna Maria Polli. 2014. Between initial familiarity and future use: A case of collocated collaborative writing. Proc. COOP 2014, Springer, 137--154.","paperID":"None"},{"content":"Ellen Christiansen. 1996. Tamed by a rose: computers as tools in human activity. In Bonnie Nardi (ed.). Context and Consciousness. Activity theory and human-computer interaction. MIT Press, 175--198.","paperID":"None"},{"content":"Pelle Ehn. 1990. Work-Oriented Design of Computer Artifacts, Lawrence Erlbaum Associates, Inc.","paperID":"None"},{"content":"Yrjö Engeström.1987. Learning by expansion. Orienta Konsultit.","paperID":"None"},{"content":"Gilles Fauconnier and Mark Turner. 2008. The way we think: Conceptual blending and the mind's hidden complexities, Basic Books.","paperID":"None"},{"content":"Frank Halasz and Thomas P. Moran. 1982. Analogy considered harmful. In Proceedings of the 1982 Conference on Human Factors in Computing Systems (CHI '82). ACM, NY, NY, USA, 383--386. DOI=10.1145/800049.801816 http://doi.acm.org/10.1145/800049.801816","paperID":"None"},{"content":"Kei Hoshi, Fredrik Öhberg, and Annakarin Nyberg. 2011. Designing blended reality space: conceptual foundations and applications. In Proceedings of the 25th BCS Conference on Human-Computer Interaction (BCS-HCI '11). British Computer Society, 217--226.","paperID":"None"},{"content":"Hutchins, Edwin. 2005. Material Anchors for Conceptual Blends, Journal of Pragmatics 37, 1555--1577.","paperID":"None"},{"content":"Manual Imaz and David Benyon. 2007. Designing with Blends: Conceptual Foundations of Human-Computer Interaction and Software Engineering. MIT Press.","paperID":"None"},{"content":"Robert J.K. Jacob, Audrey Girouard, Leanne M. Hirshfield, Michael S. Horn, Orit Shaer, Erin Treacy Solovey, and Jamie Zigelbaum. 2008. Reality-based interaction: a framework for post-WIMP interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 201--210. DOI=10.1145/1357054.1357089 http://doi.acm.org/10.1145/1357054.1357089","paperID":"None"},{"content":"Jetter, Hans-Christian, Harald Reiterer, and Florian Geyer. 2014. Blended Interaction: understanding natural human-computer interaction in post-WIMP interactive spaces. Personal and Ubiquitous Computing 18.5: 1139--1158.","paperID":"None"},{"content":"Victor Kaptelinin. 1996. Activity theory: Implications for human-computer interaction. In Bonnie Nardi (ed.). Context and Consciousness. Activity theory and human-computer interaction. MIT Press. 103--116.","paperID":"None"},{"content":"Lone Koefoed and Peter Dalsgaard. 2015. Note to Self: Stop Calling Interfaces \"Natural\". In Proc. of Critical Alternatives, the fifth decennial Aarhus conference. ACM.","paperID":"None"},{"content":"George Lakoff and Mark Johnson.1980. Metaphors We Live By. University of Chicago Press.","paperID":"None"},{"content":"Kim Halskov Madsen, A guide to metaphorical design, Communications of the ACM, 37(12): 57--62 [doi>10.1145/198366.198381]","paperID":"None"},{"content":"Thomas Markussen and Peter Krogh. 2008. Mapping Cultural Frame Shifting in Interaction Design with Blending Theory. International Journal of Design 2(2): 5--17.","paperID":"None"},{"content":"Stephen Mokey, Alexander Nalbandian, and Brian O'Keefe. 2013. Location as interaction: exploring blended spaces in the global village. In Proceedings of the 27th International BCS Human Computer Interaction Conference (BCS-HCI '13), Steve Love, Kate Hone, and Tom McEwan (Eds.). British Computer Society, Swinton, UK, UK, , Article 52 , 5 pages.","paperID":"None"},{"content":"Kenton O'hara, Richard Harper, Helena Mentis, Abigail Sellen, and Alex Taylor. 2013. On the naturalness of touchless: Putting the \"interaction\" back into NUI. ACM Trans. Comput.-Hum. Interact. 20, 1, Article 5 (April 2013), 25 pages. DOI=10.1145/2442106.2442111 http://doi.acm.org/10.1145/2442106.2442111","paperID":"None"},{"content":"Brian O'Keefe, David Benyon, Gaurav Chandwani, Madhav Menon, and Randy Duke, II. 2014. A Blended Space for Heritage Storytelling. In Proceedings of the 28th International BCS Human Computer Interaction Conference on HCI 2014 Sand, Sea and Sky - Holiday HCI (BCS-HCI '14). BCS, , UK, 90--99. DOI=http://dx.doi.org/10.14236/ewic/hci2014.10","paperID":"None"},{"content":"James V. Wertsch. 1998. Mind as action. Oxford University Press","paperID":"None"}],"citation":[],"abstract":"Discussions on what makes user interfaces \"natural\" or \"intuitive\" have led researchers to apply Fauconnier and Turner's theory of Conceptual Blends to explain how users rely on familiar and real-world concepts when they learn to use new digital technologies -- as a blend of experiences from the --physical and the \"digital\" world. This pursuit has multiple challenges of which we address four: The continuous dynamic development of experiences; the multiplicity and complexity involved; the distinction between \"real\" and \"virtual\" experiences, and finally applying descriptive concepts predictively. Based on our background in activity theoretical HCI we discuss two cases to nuance the discussion of conceptual blends and HCI. We provide an understanding of conceptual blends beyond one-to-one static blends, and immediately recognizable concepts. We focus on multiplicity, dynamics and learning, and in that we provide a more advanced methodological scaffolding of analyses of conceptual blends, hence we propose that designers need to seed blends in design.","title":"Dynamics, Multiplicity and Conceptual Blends in HCI","filename":"CHI16/p2538","authors":["Susanne Bødker","Clemens Nylandsted Klokmose"],"conference":"CHI '16"}