{"paperId":2858385,"citation":[],"reference":[{"content":"Hajar Ghadirian Najaf Abadi, Lim Yan Peng, and Ali Mohammad Hossein Zadeh. 2012. Guessability Study on Considering Cultural Values in Gesture Design for Different User Interfaces. International Proceedings of Economics Development & Research 37.","paperID":"None"},{"content":"Youngseok Ahn, Sungjae Hwang, HyunGook Yoon, Junghyeon Gim, and Jung-hee Ryu. 2015. BandSense: Pressure-sensitive Multi-touch Interaction on a Wristband. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 251-254. http://doi.org/10.1145/2702613.2725441","paperID":"None"},{"content":"Deepak Akkil, Jari Kangas, Jussi Rantala, Poika Isokoski, Oleg Spakov, and Roope Raisamo. 2015. Glance Awareness and Gaze Interaction in Smartwatches. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 1271-1276. http://doi.org/10.1145/2702613.2732816","paperID":"None"},{"content":"Wei-Hung Chen. 2015. Blowatch: Blowable and Hands-free Interaction for Smartwatches. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 103-108. http://doi.org/10.1145/2702613.2726961","paperID":"None"},{"content":"Xiang \"Anthony\" Chen, Julia Schwarz, Chris Harrison, Jennifer Mankoff, and Scott E. Hudson. 2014. Air+touch: interweaving touch & in-air gestures. ACM Press, 519-525. http://doi.org/10.1145/2642918.2647392","paperID":"None"},{"content":"Euan Freeman, Stephen Brewster, and Vuokko Lantz. 2014. Towards Usable and Acceptable Above-device Interactions. Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services, ACM, 459-464. http://doi.org/10.1145/2628363.2634215","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2009. Abracadabra: Wireless, High-precision, and Unpowered Finger Input for Very Small Mobile Devices. Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology, ACM, 121-124. http://doi.org/10.1145/1622176.1622199","paperID":"None"},{"content":"Chris Harrison, Desney Tan, and Dan Morris. 2010. Skinput: Appropriating the Body As an Input Surface. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 453-462. http://doi.org/10.1145/1753326.1753394","paperID":"None"},{"content":"Jungsoo Kim, Jiasheng He, Kent Lyons, and Thad Starner. 2007. The Gesture Watch: A Wireless Contact-free Gesture Based Wrist Interface. Proceedings of the 2007 11th IEEE International Symposium on Wearable Computers, IEEE Computer Society, 1-8. http://doi.org/10.1109/ISWC.2007.4373770","paperID":"None"},{"content":"Jarrod Knibbe, Diego Martinez Plasencia, Christopher Bainbridge, et al. 2014. Extending Interaction for Smart Watches: Enabling Bimanual Around Device Control. CHI '14 Extended Abstracts on Human Factors in Computing Systems, ACM, 1891-1896. http://doi.org/10.1145/2559206.2581315","paperID":"None"},{"content":"Anne Köpsel and Nikola Bubalo. 2015. Benefiting from Legacy Bias. interactions 22, 5: 44-47. http://doi.org/10.1145/2803169","paperID":"None"},{"content":"Sven Kratz and Michael Rohs. 2009. HoverFlow: Expanding the Design Space of Around-device Interaction. Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services, ACM, 4:1-4:8. http://doi.org/10.1145/1613858.1613864","paperID":"None"},{"content":"Dan Mauney, Jonathan Howarth, Andrew Wirtanen, and Miranda Capra. 2010. Cultural Similarities and Differences in User-defined Gestures for Touchscreen User Interfaces. CHI '10 Extended Abstracts on Human Factors in Computing Systems, ACM, 4015- 4020. http://doi.org/10.1145/1753846.1754095","paperID":"None"},{"content":"Calkin S. Montero, Jason Alexander, Mark T. Marshall, and Sriram Subramanian. 2010. Would you do that? Proceedings of the 12th international conference on Human computer interaction with mobile devices and services - MobileHCI '10, 275. http://doi.org/10.1145/1851600.1851647","paperID":"None"},{"content":"Elisa Morganti, Leonardo Angelini, Andrea Adami, Denis Lalanne, Leandro Lorenzelli, and Elena Mugellini. 2012. A smart watch with embedded sensors to recognize objects, grasps and forearm gestures. Procedia Engineering 41: 1169-1175.","paperID":"None"},{"content":"Meredith Ringel Morris, Andreea Danielescu, Steven Drucker, et al. 2014. Reducing Legacy Bias in Gesture Elicitation Studies. interactions 21, 3: 40-45. http://doi.org/10.1145/2591689","paperID":"None"},{"content":"Meredith Ringel Morris, Jacob O. Wobbrock, and Andrew D. Wilson. 2010. Understanding Users' Preferences for Surface Gestures. Proceedings of Graphics Interface 2010, Canadian Information Processing Society, 261-268. Retrieved from http://dl.acm.org/citation.cfm?id=1839214.1839260","paperID":"None"},{"content":"Michael J. Muller and Sandra Kogan. 2012. Grounded Theory Method in Human-Computer Interaction and Computer Supported Cooperative Work. In The Human-Computer Interaction Handboook. CRC Press, Boca Raton [u.a.], 1003-1023.","paperID":"None"},{"content":"Donald A. Norman and Stephen W. Draper. 1986. User Centered System Design; New Perspectives on Human-Computer Interaction. L. Erlbaum Associates Inc., Hillsdale, NJ, USA.","paperID":"None"},{"content":"Ian Oakley and Doyoung Lee. 2014. Interaction on the Edge: Offset Sensing for Small Devices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 169-178. http://doi.org/10.1145/2556288.2557138","paperID":"None"},{"content":"Masa Ogata and Michita Imai. 2015. SkinWatch: Skin Gesture Interaction for Smart Watch. Proceedings of the 6th Augmented Human International Conference, ACM, 21-24. http://doi.org/10.1145/2735711.2735830","paperID":"None"},{"content":"Thammathip Piumsomboon, Adrian Clark, Mark Billinghurst, and Andy Cockburn. 2013. User-defined Gestures for Augmented Reality. CHI '13 Extended Abstracts on Human Factors in Computing Systems, ACM, 955-960. http://doi.org/10.1145/2468356.2468527","paperID":"None"},{"content":"Reza Rawassizadeh, Blaine A. Price, and Marian Petre. 2014. Wearables: Has the Age of Smartwatches Finally Arrived? Commun. ACM 58, 1: 45-47. http://doi.org/10.1145/2629633","paperID":"None"},{"content":"Julie Rico and Stephen Brewster. 2010. Usable gestures for mobile interfaces: evaluating social acceptability. Proceedings of the 28th international conference on Human factors in computing systems, ACM, 887-896. http://doi.org/http://doi.acm.org/10.1145/1753326.175","paperID":"None"},{"content":"Jaime Ruiz, Yang Li, and Edward Lank. 2011. Userdefined Motion Gestures for Mobile Interaction. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 197-206. http://doi.org/10.1145/1978942.1978971","paperID":"None"},{"content":"Shaikh Shawon Arefin Shimon, Sarah Morrison-Smith, Noah John, Ghazal Fahimi, and Jaime Ruiz. 2015. Exploring User-Defined Back-Of-Device Gestures for Mobile Devices. Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, ACM, 227-232. http://doi.org/10.1145/2785830.2785890","paperID":"None"},{"content":"Jie Song, Gábor Sörös, Fabrizio Pece, et al. 2014. Inair Gestures Around Unmodified Mobile Devices. Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology, ACM, 319- 329. http://doi.org/10.1145/2642918.2647373","paperID":"None"},{"content":"Radu-Daniel Vatavu. 2012. User-defined Gestures for Free-hand TV Control. Proceedings of the 10th European Conference on Interactive Tv and Video, ACM, 45-48. http://doi.org/10.1145/2325616.2325626","paperID":"None"},{"content":"Radu-Daniel Vatavu. 2013. A Comparative Study of User-defined Handheld vs. Freehand Gestures for Home Entertainment Environments. J. Ambient Intell. Smart Environ. 5, 2: 187-211.","paperID":"None"},{"content":"Radu-Daniel Vatavu and Jacob O. Wobbrock. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Significance Test, and Toolkit. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1325-1334. http://doi.org/10.1145/2702123.2702223","paperID":"None"},{"content":"Radu-Daniel Vatavu and Ionut-Alexandru Zaiti. 2014. Leap Gestures for TV: Insights from an Elicitation Study. Proceedings of the 2014 ACM International Conference on Interactive Experiences for TV and Online Video, ACM, 131-138. http://doi.org/10.1145/2602299.2602316","paperID":"None"},{"content":"Wouter Van Vlaenderen, Jens Brulmans, Jo Vermeulen, and Johannes Schöning. 2015. WatchMe: A Novel Input Method Combining a Smartwatch and Bimanual Interaction. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 2091-2095. http://doi.org/10.1145/2702613.2732789","paperID":"None"},{"content":"Anusha Withana, Roshan Peiris, Nipuna Samarasekara, and Suranga Nanayakkara. 2015. zSense: Enabling Shallow Depth Gesture Recognition for Greater Input Expressivity on Smart Wearables. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3661- 3670. http://doi.org/10.1145/2702123.2702371","paperID":"None"},{"content":"Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defined Gestures for Surface Computing. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1083-1092. http://doi.org/10.1145/1518701.1518866","paperID":"None"},{"content":"Robert Xiao, Gierad Laput, and Chris Harrison. 2014. Expanding the Input Expressivity of Smartwatches with Mechanical Pan, Twist, Tilt and Click. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 193-196. http://doi.org/10.1145/2556288.2557017","paperID":"None"},{"content":"2015. Android Wear. Wikipedia, the free encyclopedia. Retrieved September 14, 2015 from https://en.wikipedia.org/w/index.php?title=Android_W ear&oldid=680738338","paperID":"None"}],"abstract":"Although smartwatches are gaining popularity among mainstream consumers, the input space is limited due to their small form factor. The goal of this work is to explore how to design non-touchscreen gestures to extend the input space of smartwatches. We conducted an elicitation study eliciting gestures for 31 smartwatch tasks. From this study, we demonstrate that a consensus exists among the participants on the mapping of gesture to command and use this consensus to specify a user-defined gesture set. Using gestures collected during our study, we define a taxonomy describing the mapping and physical characteristics of the gestures. Lastly, we provide insights to inform the design of non-touchscreen gestures for smartwatch interaction.","title":"Exploring Non-touchscreen Gestures for Smartwatches","filename":"CHI16/p3822","authors":["Shaikh Shawon Arefin Shimon","Courtney Lutton","Zichun Xu","Sarah Morrison-Smith","Christina Boucher","Jaime Ruiz"],"conference":"CHI '16"}