{"paperId":2858297,"citation":[],"reference":[{"content":"Janna Quitney Anderson and Lee Rainie. 2012. Big Data: Experts say new forms of information analysis will help people be more nimble and adaptive, but worry over humans? capacity to understand and use these new tools well. Washington, DC.","paperID":"None"},{"content":"Roland Barthes. 1977. The Death of the Author. Image, music, text. 145.","paperID":"None"},{"content":"Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by Making Strange: Defamiliarization and the Design of Domestic Technologies. ACM Transactions on Computer-Human Interaction 12, 2: 149--173.","paperID":"None"},{"content":"Walter Benjamin. 2008. The Work of Art in the Age of Mechanical Reproduction. Penguin, London, UK.","paperID":"None"},{"content":"Jed R. Brubaker, Gillian R. Hayes, and Paul Dourish. 2013. Beyond the Grave: Facebook as a Site for the Expansion of Death and Mourning. The Information Society 29, 3: 152--163. http://doi.org/10.1080/01972243.2013.777300","paperID":"None"},{"content":"Peter Bürger. 1984. Theory of the Avant-garde. Manchester University Press, Manchester, UK.","paperID":"None"},{"content":"Otto von Busch. 2008. Fashion-able. Hacktivism and engaged fashion design.","paperID":"None"},{"content":"John Cage. 2011. Silence: Lectures and Writings. Wesleyan University Press.","paperID":"None"},{"content":"Roger Caillois. 1961. Man, play, and games. University of Illinois Press.","paperID":"None"},{"content":"Erik Stolterman. 2008. The Nature of Design Practice and Implications for Interaction Design Research. International Journal of Design 2, 1: 55--65. Retrieved from http://www.ijdesign.org/ojs/index.php/IJDesign/article/view/240","paperID":"None"},{"content":"Ylva Fernaeus and Petra Sundström. 2012. The material move: how materials matter in interaction design research. In Proc. DIS'12, 486--495.","paperID":"None"},{"content":"Ylva Fernaeus and Anna Vallgårda. 2014. Ajna: negotiating forms in the making of a musical cabinet. DIS'14, 915--924.","paperID":"None"},{"content":"Pedro Ferreira, Pedro Sanches, and Alexandra Weilenmann. 2013. Awareness, Transience and Temporality: Design Opportunities from Rah Island. In Proc. INTERACT 2, Springer Berlin Heidelberg, 696--713.","paperID":"None"},{"content":"M. Frisch, J. Heydekorn, and R. Dachselt. 2009. Investigating multi-touch and pen gestures for diagram editing on interactive surfaces. In Proc. the ACM International Conference on Interactive Tabletops and Surfaces, ACM Press.","paperID":"None"},{"content":"Verena Fuchsberger, Martin Murer, and Manfred Tscheligi. 2013. Materials, materiality, and media. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM Press.","paperID":"None"},{"content":"William Gaver, Mark Blythe, Andy Boucher, Nadine Jarvis, John Bowers, and Peter Wright. 2010. The prayer companion: openness and specificity, materiality and spirituality. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, ACM Press, 2055--2064.","paperID":"None"},{"content":"William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proc. CHI'03, ACM Press, 233--240. http://doi.org/10.1145/642651.642653","paperID":"None"},{"content":"Elisa Giaccardi and Elvin Karana. 2015. Foundations of Materials Experience: An Approach for HCI. CHI'15, ACM Press, 2447--2456.","paperID":"None"},{"content":"Horatio Greenough and Harold Adams Small. 1957. Form and function: remarks on art, design and architecture. University of California Press.","paperID":"None"},{"content":"David J. Gunkel. 2015. Of Remixology: Ethics and Aesthetics after Remix. The MIT Press.","paperID":"None"},{"content":"Stephen A. Hedges. 1978. Dice music in the eighteenth century. Music & Letters 59, 2: 180--187.","paperID":"None"},{"content":"Ingi Helgason. 2012. Beat Haiku: Interactive Poetry Application. In Proc. NordiCHI'12, ACM Press, 777--778.","paperID":"None"},{"content":"Aceituno Jonathan and Ludovic Potier. 2014. The secret life of computers. CHI'14 Extended Abstracts on Human Factors in Computing Systems, ACM Press.","paperID":"None"},{"content":"Oskar Juhlin, Yanqing Zhang, Cristine Sundbom, and Ylva Fernaeus. 2013. Fashionable Shape Switching -- Explorations in Outfit-Centric Design. 1353--1362.","paperID":"None"},{"content":"Andruid Kerne. 1997. CollageMachine: temporality and indeterminacy in media browsing via interface ecology. In CHI '97 Extended Abstracts on Human Factors in Computing Systems, ACM Press, 273--274.","paperID":"None"},{"content":"Nelson Les, Elizabeth F. Churchill, Laurent Denoue, Jonathan Helfman, and Paul Murphy. 2004. Gooey interfaces: an approach for rapidly repurposing digital content. CHI'04 Extended Abstracts on Human Factors in Computing Systems, ACM Press.","paperID":"None"},{"content":"Benny Lin and Elaine M. Huang. 2010. Reuse: promoting repurposing through an online DIY community. CHI'10 Extended Abstracts on Human Factors in Computing Systems, ACM Press.","paperID":"None"},{"content":"Jonas Löwgren. 2006. Pliability as an experiential quality: exploring the aesthetics of interaction design. Artifact 1(12): 55--66.","paperID":"None"},{"content":"William McDonough and Michael Braungart. 2013. The Upcycle: Beyond Sustainability-designing for Abundance. Macmillan.","paperID":"None"},{"content":"Daniel Miller. 2005. Materiality (Politics, History, and Culture). Duke University Press.","paperID":"None"},{"content":"Martin Murer, Mattias Jacobsson, Siri Skillgate, and Petra Sundström. 2014. Taking things apart: reaching common ground and shared material understanding. In Proc. CHI'14, ACM Press, 469--472.","paperID":"None"},{"content":"Yael Netzer, David Gabay, Yoav Goldberg, and Michael Elhadad. 2009. Gaiku: Generating Haiku with Word Associations Norms. In Proc. NAACL HLT'09, Association for Computational Linguistics, 32--39.","paperID":"None"},{"content":"Anton Nijholt. 2014. Towards humor modelling and facilitation in smart environments. Advances in Affective and Pleasurable Design, 260--269.","paperID":"None"},{"content":"William Odom, John Zimmerman, and Jodi Forlizzi. 2011. Teenagers and T heir Virtual Possessions!: Design Opportunities and Issues. 1491--1500.","paperID":"None"},{"content":"James Pierce and Eric Paulos. 2014. Counter-functional Things!: Exploring Possibilities in Designing Digital Limitations. 1: 375--384.","paperID":"None"},{"content":"Reiner Pilz. 1994. Thinking about a green future. Salvo, 11--14. Retrieved from http://www.salvoweb.com/files/salvonews/sn99v3.p df","paperID":"None"},{"content":"Simon Robinson, Jennifer S. Pearson, and Matt Jones. 2014. A billion signposts: Repurposing barcodes for indoor navigation. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM Press.","paperID":"None"},{"content":"Nicolas Roussel, Helen Evans, and Heiko Hansen. 2004. Proximity as an Interface for Video Communication. IEEE Computer Society 11, 3: 12--16.","paperID":"None"},{"content":"Katie Salen and Eric Zimmerman. 2004. Rules of Play: Game Design Fundamentals. MIT Press.","paperID":"None"},{"content":"Katie Salen and Eric Zimmerman. 2005. The Game Design Reader: A Rules of Play Anthology. MIT Press.","paperID":"None"},{"content":"Joseph Sant. 2015. Code Repurposing as an Assessment Tool. Proceedings of the 37th International Conference on Software Engineering Volume 2, IEEE Press.","paperID":"None"},{"content":"Abigail J. Sellen and Steve Whittaker. 2010. Beyond Total Capture: A Constructive Critique of Lifelogging. Communications of the ACM: 70--77.","paperID":"None"},{"content":"Gilbert Silverman and Lila Silverman. 1981. FLUXUS etc. Cranbrook Academy of Art Museum.","paperID":"None"},{"content":"Gilbert Silverman and Lila Silverman. 1983. FLUXUS etc. / Addenda II. Baxter Art Gallery, California Institute of Technology.","paperID":"None"},{"content":"Jordi Solsona Belenguer, Marcus Lundén, Jarmo Laaksolahti, and Petra Sundström. 2012. Immaterial materials: designing with radio. In Proc. of the Sixth International Conference on Tangible, Embedded and Embodied Interaction, ACM Press.","paperID":"None"},{"content":"Nikos Stangos. 1981. Concepts of modern art. Thames and Hudson.","paperID":"None"},{"content":"Anne Stevens. Upcycling the Rotary Dial Phone in the Age of the Smartphone.","paperID":"None"},{"content":"Petra Sundström, Alex Taylor, Katja Grufberg, Niklas Wirström, Jordi Solsona Belenguer, and Marcus Lundén. 2011. Inspirational bits: towards a shared understanding of the digital material. CHI'11, 1561--1570.","paperID":"None"},{"content":"Vygandas Šimbelis, Anders Lundström, Kristina Höök, Jordi Solsona, and Vincent Lewandowski. 2014. Metaphone: Machine Aesthetics Meets Interaction Design. In Proc. CHI'14, ACM Press: 1--10.","paperID":"None"},{"content":"Naoko Tosa, Hideto Obara, and Michihiko Minoh. 2007. Hitch Haiku. In Proc. DIMEA'07, ACM Press, 6--7.","paperID":"None"},{"content":"Vasiliki Tsaknaki and Ylva Fernaeus. 2016. Expanding on Wabi-Sabi as a Design Resource in HCI. In Proc. CHI'16, ACM Press.","paperID":"None"},{"content":"Anna Vallgårda and Ylva Fernaeus. 2015. Interaction Design as a Bricolage Practice. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, ACM Press.","paperID":"None"},{"content":"Anna Vallgårda. 2013. Giving form to computational things: developing a practice of interaction design. Pers. and Ubiq. Comput., 18(3): 577--592.","paperID":"None"},{"content":"Ron Wakkary, Audrey Desjardins, Sabrina Hauser, and Leah Maestri. 2013. A Sustainable Design Fiction: Green Practices. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 4: 1--33.","paperID":"None"},{"content":"Eddie Wolfram. 1975. History of collage. Macmillan Publishing Company.","paperID":"None"},{"content":"Freitag. Retrieved from http://freitag.com","paperID":"None"},{"content":"Baldesigns. Retrieved from http://baldesigns.eu","paperID":"None"},{"content":"Haiku Society. Retrieved from http://www.haikushs.org/haikudef.htm","paperID":"None"},{"content":"HaikuLeaks. Retrieved from http://haikuleaks.com","paperID":"None"},{"content":"Times Haiku. Retrieved from http://haiku.nytimes.com","paperID":"None"},{"content":"Freecycle. Retrieved from https://www.freecycle.org","paperID":"None"},{"content":"Duchamp, Marcel (1887--1968): Fountain, 1950 (replica of 1917 original). Philadelphia, Philadelphia Museum of Art. Porcelain urinal, 12 x 15 x 18 inches (30.5 x 38.1 x 45.7 cm). Gift (by exchange) of Mrs. Herbert Cameron Morris, 1998-2016. Photo The Philadelphia Museum of Art/Art Resource/Scala, Florence.","paperID":"None"},{"content":"Picasso, Pablo (1881--1973): tete de taureau. Realisee a partir d'une selle et d'un guidon de bicyclette. 1942. Paris, Musee Picasso. Sculpture 2016. Photo Josse/Scala, Florence. !","paperID":"None"}],"abstract":"Repurposing refers to a broad set of practices, such as recycling or upcycling, all aiming to make better use of or give new life to physical materials and artifacts. While these practices have an obvious interest regarding sustainability issues, they also bring about unique aesthetics and values that may inspire design beyond sustainability concerns. What if we can harness these qualities in digital materials? We introduce Delete by Haiku, an application that transforms old mobile text messages into haiku poems. We elaborate on how the principles of repurposing -- working on a low budget, introducing chance and combining the original values with the new ones -- can inform interaction design in evoking some of these aesthetic values. This approach changes our views on what constitutes \"digital materials\" and the opportunities they offer. We also connect recent debates concerning ownership of data with discussions in the arts on the \"Death of the Author.\"","title":"Repurposing Bits and Pieces of the Digital","filename":"CHI16/p840","authors":["Vygandas 'Vegas Simbelis","Pedro Ferreira","Elsa Vaara","Jarmo Laaksolahti","Kristina Höök"],"conference":"CHI '16"}