{"paperId":2858473,"citation":[],"abstract":"Email is far from dead; in fact the volume of messages exchanged daily, the number of accounts per user, and the number of devices on which email is accessed have been constantly growing. Most previous studies on email have focused on management and retrieval behaviour within a single account and on a single device. In this paper, we examine how people find email in today's ecosystem through an in-depth qualitative diary study with 16 participants. We found that personal and work accounts are managed differently, resulting in diverse retrieval strategies: while work accounts are more structured and thus email is retrieved through folders, personal accounts have fewer folders and users rely primarily on the built-in search option. Moreover, retrieval occurs primarily on laptops and PCs compared to smartphones. We explore the reasons, and uncover barriers and workarounds related to managing multiple accounts and devices. Finally, we consider new design possibilities for email clients to better support how email is used today.","reference":[{"content":"Deborah Barreau and Bonnie A Nardi. 1995. Finding and reminding: file organization from the desktop. ACM SigChi Bulletin 27, 3 (1995), 39--43.","paperID":"None"},{"content":"Victoria Bellotti, Nicolas Ducheneaut, Mark Howard, and Ian Smith. 2003. Taking email to task: the design and evaluation of a task management centered email tool. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 345--352.","paperID":"None"},{"content":"Ofer Bergman, Maskit Tene-Rubinstein, and Jonathan Shalom. 2013. The use of attention resources in navigation versus search. Personal and ubiquitous computing 17, 3 (2013), 583--590.","paperID":"None"},{"content":"Richard Boardman and M Angela Sasse. 2004. Stuff goes into the computer and doesn't come out: a cross-tool study of personal information management. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 583--590.","paperID":"None"},{"content":"Olha Bondarenko and Ruud Janssen. 2005. Documents at hand: Learning from paper to improve digital technologies. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 121--130.","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.","paperID":"None"},{"content":"Robert Capra, Julia Khanova, and Sarah Ramdeen. 2013. Work and personal e-mail use by university employees: PIM practices across domain boundaries. Journal of the American Society for Information Science and Technology 64, 5 (2013), 1029--1044.","paperID":"None"},{"content":"Juan Pablo Carrascal and Karen Church. 2015. An in-situ study of mobile app & mobile search interactions. In Proceedings of CHI, Vol. 15. 2739--2748.","paperID":"None"},{"content":"Scott Carter and Jennifer Mankoff. 2005. When participants do the capturing: the role of media in diary studies. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 899--908.","paperID":"None"},{"content":"Marta E Cecchinato, Anna L Cox, and Jon Bird. 2015a. Smartwatches: the Good, the Bad and the Ugly?. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2133--2138.","paperID":"None"},{"content":"Marta E Cecchinato, Anna L Cox, and Jon Bird. 2015b. Working 9-5?: Professional Differences in Email and Boundary Management Practices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3989--3998.","paperID":"None"},{"content":"Edward Cutrell, Susan T Dumais, and Jaime Teevan. 2006a. Searching to eliminate personal information management. Commun. ACM 49, 1 (2006), 58--64.","paperID":"None"},{"content":"Edward Cutrell, Daniel Robbins, Susan Dumais, and Raman Sarin. 2006b. Fast, flexible filtering with phlat. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 261--270.","paperID":"None"},{"content":"David Dearman and Jeffery S Pierce. 2008. It's on my other computer!: computing with multiple devices. In Proceedings of the SIGCHI Conference on Human factors in Computing Systems. ACM, 767--776.","paperID":"None"},{"content":"Nicolas Ducheneaut and Victoria Bellotti. 2001. E-mail as habitat: an exploration of embedded personal information management. interactions 8, 5 (2001), 30--38.","paperID":"None"},{"content":"Susan Dumais, Edward Cutrell, Jonathan J Cadiz, Gavin Jancke, Raman Sarin, and Daniel C Robbins. 2003. Stuff I've seen: a system for personal information retrieval and re-use. In Proceedings of the 26th annual international ACM SIGIR conference on Research and development in informaion retrieval. ACM, 72--79.","paperID":"None"},{"content":"Danyel Fisher, AJ Brush, Eric Gleave, and Marc A Smith. 2006. Revisiting Whittaker & Sidner's email overload ten years later. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. ACM, 309--312.","paperID":"None"},{"content":"Catherine Grevet, David Choi, Debra Kumar, and Eric Gilbert. 2014. Overload is overloaded: email in the age of Gmail. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 793--802.","paperID":"None"},{"content":"Radicati Group. 2015. Email Statistics Report , 2015--2019. (2015).","paperID":"None"},{"content":"Jacek Gwizdka. 2002. Reinventing the inbox: supporting the management of pending tasks in email. In CHI'02 Extended Abstracts on Human Factors in Computing Systems. ACM, 550--551.","paperID":"None"},{"content":"Benjamin V Hanrahan, Manuel A Pérez-Quiñones, and David Martin. 2014. Attending to Email. Interacting with Computers (2014), iwu048.","paperID":"None"},{"content":"Daniel Harrison, Paul Marshall, Nadia Bianchi-Berthouze, and Jon Bird. 2015. Activity tracking: barriers, workarounds and customisation. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 617--621.","paperID":"None"},{"content":"Tero Jokela, Jarno Ojala, and Thomas Olsson. 2015. A Diary Study on Combining Multiple Information Devices in Everyday Activities and Tasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3903--3912.","paperID":"None"},{"content":"Amy K Karlson, Brian R Meyers, Andy Jacobs, Paul Johns, and Shaun K Kane. 2009. Working overtime: Patterns of smartphone and PC usage in the day of an information worker. In Pervasive computing. Springer, 398--405.","paperID":"None"},{"content":"Fahim Kawsar and AJ Brush. 2013. Home computing unplugged: why, where and when people use different connected devices at home. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. ACM, 627--636.","paperID":"None"},{"content":"Wendy E Mackay. 1988. Diversity in the use of electronic mail: A preliminary inquiry. ACM Transactions on Information Systems (TOIS) 6, 4 (1988), 380--397.","paperID":"None"},{"content":"Tara Matthews, Jeffrey Pierce, and John Tang. 2009. No smart phone is an island: The impact of places, situations, and other devices on smart phone use. IBM RJ10452 (2009).","paperID":"None"},{"content":"George D Montañez, Ryen W White, and Xiao Huang. 2014. Cross-device search. In Proceedings of the 23rd ACM International Conference on Conference on Information and Knowledge Management. ACM, 1669--1678.","paperID":"None"},{"content":"Antti Oulasvirta and Lauri Sumari. 2007. Mobile kits and laptop trays: managing multiple devices in mobile information work. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 1127--1136.","paperID":"None"},{"content":"Pew Research. 2014. Device Ownership. (2014).","paperID":"None"},{"content":"Stephanie Santosa and Daniel Wigdor. 2013. A field study of multi-device workflows in distributed workspaces. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. ACM, 63--72.","paperID":"None"},{"content":"Abigail J Sellen and Richard HR Harper. 2002. The myth of the paperless office. MIT press.","paperID":"None"},{"content":"Abigail J Sellen, Rachel Murphy, and Kate L Shaw. 2002. How knowledge workers use the web. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 227--234.","paperID":"None"},{"content":"Hilary Smith, Yvonne Rogers, and Mia Underwood. 2003. Managing personal and work email in the same box: overcoming the tensions through new metaphors. Proc. HOIT 2003 (2003).","paperID":"None"},{"content":"Juha Takkinen and Nahid Shahmehri. 1998. Delegation of tasks and dissemination of information in organizations: Restructuring internet e-mail for doing things. AMCIS 1998 Proceedings (1998), 166.","paperID":"None"},{"content":"Max G Van Kleek, Michael Bernstein, Katrina Panovich, Gregory G Vargas, David R Karger, and mc schraefel. 2009. Note to self: examining personal information keeping in a lightweight note-taking tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1477--1480.","paperID":"None"},{"content":"Steve Whittaker, Victoria Bellotti, and Jacek Gwizdka. 2006. Email in personal information management. Commun. ACM 49, 1 (2006), 68--73.","paperID":"None"},{"content":"Steve Whittaker, Tara Matthews, Julian Cerruti, Hernan Badenes, and John Tang. 2011. Am I wasting my time organizing email?: a study of email refinding. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3449--3458.","paperID":"None"},{"content":"Steve Whittaker and Candace Sidner. 1996. Email overload: exploring personal information management of email. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 276--283.","paperID":"None"}],"title":"Finding Email in a Multi-Account, Multi-Device World","filename":"CHI16/p1200","authors":["Marta E. Cecchinato","Abigail Sellen","Milad Shokouhi","Gavin Smyth"],"conference":"CHI '16"}