{"paperId":2858495,"citation":[],"reference":[{"content":"Jed R. Brubaker, Gina Venolia, and John C. Tang. 2012. Focusing on Shared Experiences: Moving Beyond the Camera in Video Communication. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 96--105. DOI: http://dx.doi.org/10.1145/2317956.2317973","paperID":"None"},{"content":"Susan R. Fussell, Leslie D. Setlock, and Robert E. Kraut. 2003. Effects of Head-mounted and Scene-oriented Video Systems on Remote Collaboration on Physical Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 513--520. DOI: http://dx.doi.org/10.1145/642611.642701","paperID":"None"},{"content":"Steffen Gauglitz, Benjamin Nuernberger, Matthew Turk, and Tobias Hollerer. 2014. In Touch with the Remote World: Remote Collaboration with Augmented Reality Drawings and Virtual Navigation. In Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology (VRST '14). ACM, NY, NY, USA, 197--205. DOI: http://dx.doi.org/10.1145/2671015.2671016","paperID":"None"},{"content":"William W. Gaver, Abigail Sellen, Christian Heath, and Paul Luff. 1993. One is Not Enough: Multiple Views in a Media Space. In Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems (CHI '93). ACM, NY, NY, USA, 335--341. DOI: http://dx.doi.org/10.1145/169059.169268","paperID":"None"},{"content":"K. Goldberg, Dezhen Song, and A. Levandowski. 2003. Collaborative teleoperation using networked spatial dynamic voting. Proc. IEEE 91, 3 (Mar 2003), 430--439. DOI: http://dx.doi.org/10.1109/JPROC.2003.809209","paperID":"None"},{"content":"Katsuhiko Hachiya. 1993. Inter Dis-communication Machine. Prix Ars Electronica 96 (1993), 138--139.","paperID":"None"},{"content":"Christian Heath and Paul Luff. 1991. Disembodied Conduct: Communication Through Video in a Multi-media Office Environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '91). ACM, NY, NY, USA, 99--103. DOI: http://dx.doi.org/10.1145/108844.108859","paperID":"None"},{"content":"Keita Higuchi and Jun Rekimoto. 2013. Flying Head: A Head Motion Synchronization Mechanism for Unmanned Aerial Vehicle Control. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 2029--2038. DOI: http://dx.doi.org/10.1145/2468356.2468721","paperID":"None"},{"content":"James Hollan, Edwin Hutchins, and David Kirsh. 2000. Distributed Cognition: Toward a New Foundation for Human-computer Interaction Research. ACM Trans. Comput.-Hum. Interact. 7, 2 (June 2000), 174--196. DOI: http://dx.doi.org/10.1145/353485.353487","paperID":"None"},{"content":"Jim Hollan and Scott Stornetta. 1992. Beyond Being There. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, NY, NY, USA, 119--125. DOI: http://dx.doi.org/10.1145/142750.142769","paperID":"None"},{"content":"Tobias Höllerer, Steven Feiner, Tachio Terauchi, Gus Rashid, and Drexel Hallaway. 1999. Exploring MARS: developing indoor and outdoor user interfaces to a mobile augmented reality system. Computers & Graphics 23, 6 (1999), 779--785.","paperID":"None"},{"content":"Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stephane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Bjorn Eiderback. 2003. Technology Probes: Inspiring Design for and with Families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 17--24. DOI: http://dx.doi.org/10.1145/642611.642616","paperID":"None"},{"content":"Hiroyuki Iizuka, Daisuke Kondo, Hiroki Kawasaki, Hideyuki Ando, and Taro Maeda. 2011. Coordinated Behavior Between Visually Coupled Dyads. In Proceedings of the 2Nd Augmented Human International Conference (AH '11). ACM, NY, NY, USA, Article 23, 4 pages. DOI: http://dx.doi.org/10.1145/1959826.1959849","paperID":"None"},{"content":"Kori Inkpen, Brett Taylor, Sasa Junuzovic, John Tang, and Gina Venolia. 2013. Experiences2Go: Sharing Kids' Activities Outside the Home with Remote Family Members. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, NY, NY, USA, 1329--1340. DOI: http://dx.doi.org/10.1145/2441776.2441926","paperID":"None"},{"content":"Ellen A. Isaacs and John C. Tang. 1993. What Video Can and Can't Do for Collaboration: A Case Study. In Proceedings of the First ACM International Conference on Multimedia (MULTIMEDIA '93). ACM, NY, NY, USA, 199--206. DOI: http://dx.doi.org/10.1145/166266.166289","paperID":"None"},{"content":"Shunichi Kasahara, Shohei Nagai, and Jun Rekimoto. 2015. First Person Omnidirectional Video: System Design and Implications for Immersive Experience. In Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video (TVX '15). ACM, NY, NY, USA, 33--42. DOI: http://dx.doi.org/10.1145/2745197.2745202","paperID":"None"},{"content":"Shunichi Kasahara and Jun Rekimoto. 2014. JackIn: Integrating First-person View with Out-of-body Vision Generation for Human-human Augmentation. In Proceedings of the 5th Augmented Human International Conference (AH '14). ACM, NY, NY, USA, Article 46, 8 pages. DOI: http://dx.doi.org/10.1145/2582051.2582097","paperID":"None"},{"content":"Shunichi Kasahara and Jun Rekimoto. 2015. JackIn Head: Immersive Visual Telepresence System with Omnidirectional Wearable Camera for Remote Collaboration. In Proceedings of the 21st ACM Symposium on Virtual Reality Software and Technology (VRST '15). ACM, NY, NY, USA, 217--225. DOI: http://dx.doi.org/10.1145/2821592.2821608","paperID":"None"},{"content":"H. Kawasaki, H. Iizuka, S. Okamoto, H. Ando, and T. Maeda. 2010. Collaboration and skill transmission by first-person perspective view sharing system. In RO-MAN, 2010 IEEE. 125--131. DOI: http://dx.doi.org/10.1109/ROMAN.2010.5598668","paperID":"None"},{"content":"Ivo Kohler. 1963. The formation and transformation of the perceptual world. Psychological issues (1963).","paperID":"None"},{"content":"Hideaki Kuzuoka. 1992. Spatial Workspace Collaboration: A SharedView Video Support System for Remote Collaboration Capability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, NY, NY, USA, 533--540. DOI: http://dx.doi.org/10.1145/142750.142980","paperID":"None"},{"content":"Paul K. Luff, Naomi Yamashita, Hideaki Kuzuoka, and Christian Heath. 2015. Flexible Ecologies And Incongruent Locations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 877--886. DOI: http://dx.doi.org/10.1145/2702123.2702286","paperID":"None"},{"content":"Suzanne P. Mckee and Ken Nakayama. 1984. The detection of motion in the peripheral visual field. Vision Research 24, 1 (1984), 25--32. DOI: http://dx.doi.org/10.1016/0042--6989(84)90140--8","paperID":"None"},{"content":"monobanda. 2014. 3RD, Transforming space through perspective. (An interactive installation). (2014).","paperID":"None"},{"content":"Florian 'Floyd' Mueller, Shannon O'Brien, and Alex Thorogood. 2007. Jogging over a Distance: Supporting a \"Jogging Together\" Experience Although Being Apart. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). ACM, NY, NY, USA, 2579--2584. DOI: http://dx.doi.org/10.1145/1240866.1241045","paperID":"None"},{"content":"Claire O'Malley, Steve Langton, Anne Anderson, Gwyneth Doherty-Sneddon, and Vicki Bruce. 1996. Comparison of face-to-face and video-mediated interaction. Interacting with Computers 8, 2 (1996), 177--192. DOI: http://dx.doi.org/10.1016/0953--5438(96)01027--2","paperID":"None"},{"content":"Bertrand Philippe, Daniel Gonzalez-Franco, Arthur Pointeau, and Christian Cherene. 2014. The Machine to be Another - Embodied Telepresence using human performers. Prix Ars Electronica 96 (2014), 1--6.","paperID":"None"},{"content":"Ronald Poelman, Oytun Akman, Stephan Lukosch, and Pieter Jonker. 2012. As if Being There: Mediated Reality for Crime Scene Investigation. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 1267--1276. DOI: http://dx.doi.org/10.1145/2145204.2145394","paperID":"None"},{"content":"Wolfgang Prinz. 1990. A common coding approach to perception and action. Springer.","paperID":"None"},{"content":"Jason Procyk, Carman Neustaedter, Carolyn Pang, Anthony Tang, and Tejinder K. Judge. 2014. Exploring Video Streaming in Public Settings: Shared Geocaching over Distance Using Mobile Video Chat. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2163--2172.","paperID":"None"},{"content":"Irene Rae, Gina Venolia, John C. Tang, and David Molnar. 2015. A Framework for Understanding and Designing Telepresence. In Proc. CSCW 2015. ACM Association for Computing Machinery.","paperID":"None"},{"content":"Stuart Reeves, Christian Greiffenhagen, Martin Flintham, Steve Benford, Matt Adams, Ju Row Farr, and Nicholas Tandavantij. 2015. I--D Hide You: Performing Live Broadcasting in Public. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2573--2582.","paperID":"None"},{"content":"Piatza Sebastian, Zollner Christian, and Adenauer Julian. 2013. EYEsect. (2013).","paperID":"None"},{"content":"Abigail Sellen, Bill Buxton, and John Arnott. 1992. Using Spatial Cues to Improve Videoconferencing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, NY, NY, USA, 651--652. DOI: http://dx.doi.org/10.1145/142750.143070","paperID":"None"},{"content":"Kay M Stanney, Robert S Kennedy, and Julie M Drexler. 1997. Cybersickness is not simulator sickness. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 41. SAGE Publications, 1138--1142.","paperID":"None"},{"content":"George M. Stratton. 1896. Some preliminary experiments on vision without inversion of the retinal image. Psychological Review 3, 6 (1896), 611--617. http://dx.doi.org/10.1037/h0072918","paperID":"None"}],"abstract":"Our research explores how humans can understand and develop viewing behaviors with mutual paralleled first person view sharing in which a person can see others' first person video perspectives as well as their own perspective in realtime. We developed a paralleled first person view sharing system which consists of multiple video see-through head mounted displays and an embedded eye tracking system. With this system, four persons can see four shared first person videos of each other. We then conducted workshop based research with two activities, drawing pictures and playing a simple chasing game with our view sharing system. Our results show that 1) people can complement each other's memory and decisions and 2) people can develop their viewing behaviors to understand their own physical embodiment and spatial relationship with others in complex situations. Our findings about patterns of viewing behavior and design implications will contribute to building design experience in paralleled view sharing applications.","title":"Parallel Eyes: Exploring Human Capability and Behaviors with Paralleled First Person View Sharing","filename":"CHI16/p1561","authors":["Shunichi Kasahara","Mitsuhito Ando","Kiyoshi Suganuma","Jun Rekimoto"],"conference":"CHI '16"}