{"paperId":2858368,"citation":[],"abstract":"While much social network data exists online, key network metrics for high-risk populations must still be captured through self-report. This practice has suffered from numerous limitations in workflow and response burden. However, advances in technology, network drawing libraries and databases are making interactive network drawing increasingly feasible. We describe the translation of an analog-based technique for capturing personal networks into a digital framework termed netCanvas that addresses many existing shortcomings such as: 1) complex data entry; 2) extensive interviewer intervention and field setup; 3) difficulties in data reuse; and 4) a lack of dynamic visualizations. We test this implementation within a health behavior study of a high-risk and difficult-to-reach population. We provide a within--subjects comparison between paper and touchscreens. We assert that touchscreen-based social network capture is now a viable alternative for highly sensitive data and social network data entry tasks.","reference":[{"content":"Eytan Adar. 2006. GUESS: A Language and Interface for Graph Exploration. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI 06) (2006), 791800.","paperID":"None"},{"content":"Centre for Disease Control and Prevention. 2015. Diagnoses of HIV Infection in the USA and Dependent Areas, 2011.HIV Surveillance Report, Volume 23. HIV Surveillance Report 25 (2015), 1-82. http://www.cdc.gov/hiv/library/reports/surveillance/2011/surveillance","paperID":"None"},{"content":"Toni Antonucci. 1986. Measuring Social Support Networks: Hierarchical Mapping Technique. Generations 10 (1986), 10-12.","paperID":"None"},{"content":"Colette L Auerswald, Eiko Sugano, Jonathan M Ellen, and Jeffrey D Klausner. 2006. Street-based STD testing and treatment of homeless youth are feasible, acceptable and effective. Journal of Adolescent Health 38, 3 (2006), 208-212.","paperID":"None"},{"content":"Michelle Birkett, L. Kuhns, C. Latkin, S. Muth, and Brian S Mustanski. 2015a. The sexual networks of racially diverse young men who have sex with men. Archives of Sexual Behavior Forthcoming (2015).","paperID":"None"},{"content":"Michelle Birkett, Lisa M Kuhns, Brian S Mustanski, and Stephen Q Muth. 2015b. The creation and analysis of a macro-network of young men who have sex with men. In 35th International Sunbelt Social Networks Conference [SUNBELT '16]. Brighton, UK.","paperID":"None"},{"content":"Stephen P Borgatti, Martin G Everett, and Jeffrey C Johnson. 2013. Analyzing social networks. SAGE Publications Limited, Thousand Oaks, CA.","paperID":"None"},{"content":"Stephen P Borgatti, Ajay Mehra, Daniel J Brass, and Giuseppe Labianca. 2009. Network analysis in the social sciences. Science (NY, N.Y.) 323, 5916 (2009), 892-895. DOI: http://dx.doi.org/10.1126/science.1165821","paperID":"None"},{"content":"John Brooke. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4-7.","paperID":"None"},{"content":"Ronald Burt. 1984. Network Items and the General Social Survey. Social Networks 6, 4 (1984), 293-339.","paperID":"None"},{"content":"William Buxton, Ralph Hill, and Peter Rowley. 1985. Issues and techniques in touch-sensitive tablet input. ACM SIGGRAPH Computer Graphics 19, 3 (1985), 215-224.","paperID":"None"},{"content":"Juan Carrasco, Bernie Hogan, Barry Wellman, and Eric Miller. 2008. Collecting social network data to study social activity-travel behavior: An egocentered approach. Environment and Planning B 35, 6 (2008), 961-980. DOI: http://dx.doi.org/10.1068/b3317t","paperID":"None"},{"content":"Andre Charland and Brian Leroux. 2011. Mobile application development: web vs. native. Commun. ACM 54, 5 (2011), 49-53.","paperID":"None"},{"content":"Jacob Cohen. 1992. Statistical power analysis. Current directions in psychological science 1, 3 (1992), 98-101.","paperID":"None"},{"content":"Nick Crossley, Elisa Bellotti, Gemma Edwards, Martin G Everett, Johan Koskinen, and Mark Tranmer. 2015. Social Network Analysis for Ego-Nets: Social Network Analysis for Actor-Centred Networks. Sage Publications, London, UK.","paperID":"None"},{"content":"Don A Dillman. 2011. Mail and Internet surveys: The tailored design method-2007 Update with new Internet, visual, and mixed-mode guide. John Wiley & Sons.","paperID":"None"},{"content":"Claude S Fischer. 1982. To Dwell among Friends: Personal Networks in Town and City (1 ed.). University Of Chicago Press. 459 pages.","paperID":"None"},{"content":"Clifton Forlines, Daniel Wigdor, Chia Shen, and Ravin Balakrishnan. 2007. Direct-touch vs. mouse input for tabletop displays. Proceedings of the SIGCHI conference on Human factors in computing systems CHI '07 (2007), 647-656. DOI: http://dx.doi.org/10.1145/1240624.1240726","paperID":"None"},{"content":"Linton C Freeman. 2000. Visualizing Social Networks. Journal of Social Structure 1, 1 (2000), 1-20.","paperID":"None"},{"content":"Linton C Freeman. 2004. The Development of Social Network Analysis: A Study in the Sociology of Science. Empirical Press, Vancouver, BC.","paperID":"None"},{"content":"Markus Gamper, Michael Schönhuth, and Michael Kronenwett. 2012. Social Networking and Community Behavior Modeling : Qualitative and Quantitative Measures. In Social Networking and Community Behavior Modeling : Qualitative and Quantitative Measures, Maytham Safar and Khaled A. Madhi (Eds.). IGI Global, Hershey, PA, 193-213.","paperID":"None"},{"content":"Jeffrey Heer, Stuart K Card, and James A Landay. 2005. Prefuse: a toolkit for interactive information visualization. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 421-430.","paperID":"None"},{"content":"Bernie Hogan, Juan Carrasco, and Barry Wellman. 2007. Visualizing Personal Networks: Working with Participant Aided Sociograms. Field Methods 19, 2 (2007), 116-144.","paperID":"None"},{"content":"Grace YoungJoo Jeon, Nicole B. Ellison, Bernie Hogan, and Christine Greenhow. 2016. First-Generation Students and College: The Role of Facebook Networks as Information Sources. In Proceedings of the 2016 ACM Conference on Computer-Supported Cooperative Work and Social Computing [CSCW '16]. San Francisco, CA.","paperID":"None"},{"content":"Blair T Johnson, Colleen A Redding, Ralph J DiClemente, Brian S Mustanski, Brian Dodge, Paschal Sheeran, Michelle R Warren, Rick S Zimmerman, William A Fisher, Mark T Conner, and Others. 2010. A network-individual-resource model for HIV prevention. AIDS and Behavior 14, 2 (2010), 204-221.","paperID":"None"},{"content":"Lisa M Kuhns, Michelle Birkett, Brian Mustanski, S. Q. Muth, C. Latkin, I. Ortiz-Estes, and R. Garofalo. 2015. Methods for Collection of Participant-aided Sociograms for the Study of Social , Sexual and Substance-using Networks Among Young Men Who Have Sex with Men. Connections 35, 1 (2015). DOI: http://dx.doi.org/10.17266/35.1.1","paperID":"None"},{"content":"Carl A Latkin, Danielle German, David Vlahov, and Sandro Galea. 2013. Neighborhoods and HIV: a social ecological approach to prevention and care. American Psychologist 68, 4 (2013), 210.","paperID":"None"},{"content":"C A Latkin and A R Knowlton. 2005. Micro-social structural approaches to HIV prevention: a social ecological perspective. AIDS Care 17, S1 (2005), 102-113.","paperID":"None"},{"content":"E.O. Laumann, J. Galaskiewicz, and P.V. Marsden. 1978. Community structure as interorganizational linkages. Annual Review of Sociology 4 (1978), 455-484. http://www.jstor.org/stable/2945978","paperID":"None"},{"content":"Christopher McCarty and Sama Govindaramanujam. 2005. A Modified Elicitation of Personal Networks Using Dynamic Visualization. Connections 26, 2 (2005), 61-69.","paperID":"None"},{"content":"Tyler H. McCormick, Matthew J. Salganik, and Tian Zheng. 2010. How Many People Do You Know?: Efficiently Estimating Personal Network Size. J. Amer. Statist. Assoc. 105, 489 (mar 2010), 59-70. DOI: http://dx.doi.org/10.1198/jasa.2009.ap08518","paperID":"None"},{"content":"Joanna Mcgrenere, Ronald M Baecker, and Kellogg S Booth. 2002. An evaluation of a multiple interface design solution for bloated software. Chi '02 (2002), 164-170. DOI:http://dx.doi.org/","paperID":"None"},{"content":"J Miller McPherson, Lynn Smith-Lovin, and Matthew Brashears. 2006. Changes in Core Discussion Networks over Two Decades. American Sociological Review 71, 3 (2006), 353-375.","paperID":"None"},{"content":"Brian Mustanski, Tyrel Starks, and Michael E Newcomb. 2014. Methods for the design and analysis of relationship and partner effects on sexual health. Archives of sexual behavior 43, 1 (2014), 21-33.","paperID":"None"},{"content":"Ray Pahl and Liz Spencer. 2004. Capturing Personal Communities. In Social Networks and Social Exclusion, Chris Phillipson, Graham Allan, and David Morgan (Eds.). Ashgate, Aldershot, UK, 72-96.","paperID":"None"},{"content":"John J Potterat, Richard B Rothenberg, and Steven Q Muth. 1999. Network structural dynamics and infectious disease propagation. International journal of STD & AIDS 10, 3 (1999), 182-185.","paperID":"None"},{"content":"J J Potterat, D E Woodhouse, S Q Muth, R Rothenberg, W W Darrow, A S Klovdahl, and J B Muth. 2004. Network dynamism: history and lessons of the CO Springs study. Network epidemiology: a handbook for survey design and data collection (2004), 87-114.","paperID":"None"},{"content":"Joseph Prejean, Ruiguang Song, Angela Hernandez, Rebecca Ziebell, Timothy Green, Frances Walker, Lillian S Lin, Qian An, Jonathan Mermin, Amy Lansky, H Irene Hall, and for the HIV Incidence Surveillance Group. 2011. Estimated HIV Incidence in the USA, 2006-2009. PLoS ONE 6, 8 (2011), e17502. DOI: http://dx.doi.org/10.1371/journal.pone.0017502","paperID":"None"},{"content":"Harmony Rhoades, Suzanne L. Wenzel, Daniela Golinelli, Joan S. Tucker, David P. Kennedy, Harold D. Green, and Annie Zhou. 2011. The social context of homeless men's substance use. Drug and Alcohol Dependence 118, 2--3 (2011), 320-325. DOI: http://dx.doi.org/10.1016/j.drugalcdep.2011.04.011","paperID":"None"},{"content":"Richard Rothenberg, Julie Baldwin, Robert Trotter, and Stephen Q Muth. 2001. The risk environment for HIV transmission: Results from the Atlanta and Flagstaff network studies. Journal of Urban Health 78, 3 (2001), 419-432.","paperID":"None"},{"content":"Ben Shneiderman and Catherine Plaisant. 2003. Designing the user interface (fifth ed.). Pearson Education, Boston.","paperID":"None"},{"content":"Charles D Stolper, Florian Foerster, Minsuk Kahng, Zhiyuan Lin, Aakash Goel, John Stasko, and Duen Horng Chau. 2014. GLOs: graph-level operations for exploratory network visualization. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 1375-1380.","paperID":"None"},{"content":"Paola Tubaro, Antonio. A. Casilli, and Lise Mounier. 2014. Eliciting Personal Network Data in Web Surveys through Participant-generated Sociograms. Field Methods 26, 2 (2014), 107-125. DOI: http://dx.doi.org/10.1177/1525822X13491861","paperID":"None"},{"content":"Edward R Tufte and P R Graves-Morris. 1983. The visual display of quantitative information. Vol. 2. Graphics press Cheshire, CT.","paperID":"None"},{"content":"Barry Wellman. 1979. The Community Question: The Intimate Networks of East Yorkers. Amer. J. Sociology 84, 5 (1979), 1201-1233.","paperID":"None"}],"title":"Evaluating the Paper-to-Screen Translation of Participant-Aided Sociograms with High-Risk Participants","filename":"CHI16/p5360","authors":["Bernie Hogan","Joshua R. Melville","Gregory Lee Phillips II","Patrick Janulis","Noshir Contractor","Brian S. Mustanski","Michelle Birkett"],"conference":"CHI '16"}