{"paperId":2858250,"citation":[],"reference":[{"content":"Patrick Baudisch, Edward Cutrell, Ken Hinckley, and Adam Eversole. 2005. Snap-and-go: helping users align objects without the modality of traditional snapping. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 301--310. http://doi.org/10.1145/1054972.1055014","paperID":"None"},{"content":"Blaine Bell, Steven Feiner, and Tobias Höllerer. 2001. View management for virtual and augmented reality. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01), 101--110. http://doi.org/10.1145/502348.502363","paperID":"None"},{"content":"Eric A. Bier and Maureen C. Stone. 1986. Snapdragging. In Proceedings of the 13th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '86), 233--240. http://dx.doi.org/10.1145/15922.15912","paperID":"None"},{"content":"Eric A. Bier. 1990. Snap-dragging in three dimensions. In Proceedings of the 1990 Symposium on Interactive 3D Graphics (I3D '90), 193--204. http://doi.org/10.1145/91385.91446","paperID":"None"},{"content":"Dorit Borrmann, Jan Elseberg, Kai Lingemann, and Andreas Nüchter. 2011. The 3D Hough Transform for plane detection in point clouds: A review and a new accumulator design. 3D Research. 2, 2, Article 32 (June 2011): 1--13. http://dx.doi.org/10.1007/3DRes.02(2011)3","paperID":"None"},{"content":"John Canny. 1986. A Computational Approach to Edge Detection. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI). 8, 6 (Nov. 1986): 679698. http://doi.org/10.1109/TPAMI.1986.4767851","paperID":"None"},{"content":"Changhyun Choi, Alexander J. B. Trevor, and Henrik I. Christensen. 2013. RGB-D Edge Detection and Edgebased Registration. In Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS '13), 1568--1575. http://doi.org/10.1109/IROS.2013.6696558","paperID":"None"},{"content":"Richard O. Duda and Peter E. Hart. 1972. Use of the Hough transformation to detect lines and curves in pictures. Communications of the ACM. 15, 1 (Jan. 1972): 11--15. http://doi.org/10.1145/361237.361242","paperID":"None"},{"content":"Leandro A. F. Fernandes and Manuel M. Oliveira. 2008. Real-time line detection through an improved Hough transform voting scheme. Pattern Recognition. 41, 1 (Jan. 2008): 299--314. http://dx.doi.org/10.1016/j.patcog.2007.04.003","paperID":"None"},{"content":"Jennifer Fernquist, Garth Shoemaker, and Kellogg S. Booth. 2011. \"Oh Snap\"--Helping Users Align Digital Objects on Touch Interfaces. In Proceedings of the 13th IFIP TC 13 International Conference on HumanComputer Interaction (INTERACT 2011), 338--355. http://dx.doi.org/10.1007/978--3--642--23765--2_24","paperID":"None"},{"content":"Martin A. Fischler and Robert C. Bolles. 1981. Random sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography. Communications of the ACM. 24, 6 (June 1981): 381--395. http://doi.org/10.1145/358669.358692","paperID":"None"},{"content":"Carlos H. Q. Forster and Clésio L. Tozzi. 2001. An architecture based on constraints for augmented shared workspaces. In Proceedings of the 14th Brazilian Symposium on Computer Graphics and Image Processing (SIBGRAPI '01), 328--335. http://doi.org/10.1109/SIBGRAPI.2001.963073","paperID":"None"},{"content":"Mathias Frisch, Ricardo Langner, and Raimund Dachselt. 2011. Neat: a set of flexible tools and gestures for layout tasks on interactive displays. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '11), 1--10. http://doi.org/10.1145/2076354.2076356","paperID":"None"},{"content":"Ran Gal, Lior Shapira, Eyal Ofek, and Pushmeet Kohli. 2014. FLARE: Fast layout for augmented reality applications. In Proceedings of the 13th IEEE International Symposium on Mixed and Augmented Reality (ISMAR '14), 207--212. http://doi.org/10.1109/ISMAR.2014.6948429","paperID":"None"},{"content":"Natasha Gelfand and Leonidas J. Guibas. 2004. Shape segmentation using local slippage analysis. In Proceedings of the 2004 Eurographics/ACM SIGGRAPH Symposium on Geometry Processing (SGP '04), 214--223. http://doi.org/10.1145/1057432.1057461","paperID":"None"},{"content":"Michael Gleicher. 1995. Image snapping. In Proceedings of the 22nd Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '95), 183--190. http://doi.org/10.1145/218380.218441","paperID":"None"},{"content":"Seongkook Heo, Yong-Ki Lee, Jiho Yeom, and Geehyuk Lee. 2012. Design of a shape dependent snapping algorithm. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12), 2207--2212. http://doi.org/10.1145/2212776.2223777","paperID":"None"},{"content":"Paul V. C. Hough. 1962. Method and means for recognizing complex patterns. (Dec. 1962). US Patent 3069654 A, Filed Mar. 25, 1960, Issued Dec. 18, 1962.","paperID":"None"},{"content":"Klaas Klasing, Daniel Althoff, Dirk Wollherr, and Martin Buss. 2009. Comparison of surface normal estimation methods for range sensing applications. In Proceedings of the 26th IEEE International Conference on Robotics and Automation (ICRA '09), 3206--3211. http://doi.org/10.1109/ROBOT.2009.5152493","paperID":"None"},{"content":"Gun A. Lee, Ungyeon Yang, Yongwan Kim, Dongsik Jo, and Ki-Hong Kim. Snap-to-feature interface for annotation in mobile augmented reality. In Augmented Reality Super Models Workshop at the 9th IEEE International Symposium on Mixed and Augmented Reality (ISMAR '10), Retrieved September 14, 2015 from http://www.icg.tugraz.at/Members/arth/arsupermodels/ 04_lee.pdf","paperID":"None"},{"content":"Gun A. Lee and Mark Billinghurst. 2012. Assistive techniques for precise touch interaction in handheld augmented reality environments. In Proceedings of the 11th ACM SIGGRAPH International Conference on Virtual-Reality Continuum and its Applications in Industry (VRCAI '12), 279--285. http://doi.org/10.1145/2407516.2407582","paperID":"None"},{"content":"Paul Merrell, Eric Schkufza, Zeyang Li, Maneesh Agrawala, and Vladlen Koltun. 2011. Interactive furniture layout using interior design guidelines. ACM Transactions on Graphics (TOG). 30, 4, Article 87 (July 2011): 1--10. http://dx.doi.org/10.1145/2010324.1964982","paperID":"None"},{"content":"Eric N. Mortensen and William A. Barrett. 1998. Interactive segmentation with intelligent scissors. Graphical Models and Image Processing. 60, 5 (Sept. 1998): 349--384. http://dx.doi.org/10.1006/gmip.1998.0480","paperID":"None"},{"content":"Richard A. Newcombe, Dieter Fox, and Steven M. Seitz. 2015. DynamicFusion: Reconstruction and tracking of non-rigid scenes in real-time. In Proceedings of the 28th IEEE Conference on Computer Vision and Pattern Recognition (CVPR '15), 343--352. http://dx.doi.org/10.1109/CVPR.2015.7298631","paperID":"None"},{"content":"Richard A. Newcombe, Shahram Izadi, Otmar Hilliges, David Molyneaux, David Kim, Andrew J. Davison, Pushmeet Kohli, Jamie Shotton, Steve Hodges, and Andrew Fitzgibbon. 2011. KinectFusion: Real-time dense surface mapping and tracking. In Proceedings of the 10th IEEE International Symposium on Mixed and Augmented Reality (ISMAR '11), 127--136. http://doi.org/10.1109/ISMAR.2011.6092378","paperID":"None"},{"content":"Rui Nóbrega and Nuno Correia. 2012. Magnetic augmented reality. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '12), 332--335. http://doi.org/10.1145/2254556.2254620","paperID":"None"},{"content":"Ji-Young Oh, Wolfgang Stuerzlinger, and John Danahy. 2006. SESAME: towards better 3D conceptual design systems. In Proceedings of the 6th Conference on Designing Interactive Systems (DIS '06), 80--89. http://doi.org/10.1145/1142405.1142419","paperID":"None"},{"content":"Nathan Silberman, Lior Shapira, Ran Gal, and Pushmeet Kohli. 2014. A contour completion model for augmenting surface reconstructions. In Proceedings of the 14th European Conference on Computer Vision (ECCV '14), 488--503. http://dx.doi.org/10.1007/978--3319--10578--9_32","paperID":"None"},{"content":"Mihran Tuceryan and Nassir Navab. 2000. Single point active alignment method (SPAAM) for optical seethrough HMD calibration for AR. In Proceedings of the IEEE and ACM International Symposium on Augmented Reality (ISAR '00), 149--158. http://doi.org/10.1109/ISAR.2000.880938","paperID":"None"},{"content":"Ken Xu, James Stewart, and Eugene Fiume. 2002. Constraint-based Automatic Placement for Scene Composition. In Proceedings of the Graphics Interface Conference (GI '02), 25--34. Retrieved September 14, 2015 from http://graphicsinterface.org/wpcontent/uploads/gi2002--4.pdf","paperID":"None"},{"content":"Pengfei Xu, Hongbo Fu, Chiew-Lan Tai, and Takeo Igarashi. 2015. GACA: Group-Aware Command-based Arrangement of Graphic Elements. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2787--2795. http://doi.org/10.1145/2702123.2702198","paperID":"None"}],"abstract":"Augmented Reality (AR) applications may require the precise alignment of virtual objects to the real world. We propose automatic alignment of virtual objects to physical constraints calculated from the real world in real time (\"snapping to reality\"). We demonstrate SnapToReality alignment techniques that allow users to position, rotate, and scale virtual content to dynamic, real world scenes. Our proof-of-concept prototype extracts 3D edge and planar surface constraints. We furthermore discuss the unique design challenges of snapping in AR, including the user's limited field of view, noise in constraint extraction, issues with changing the view in AR, visualizing constraints, and more. We also report the results of a user study evaluating SnapToReality, confirming that aligning objects to the real world is significantly faster when assisted by snapping to dynamically extracted constraints. Perhaps more importantly, we also found that snapping in AR enables a fresh and expressive form of AR content creation.","title":"SnapToReality: Aligning Augmented Reality to the Real World","filename":"CHI16/p1233","authors":["Benjamin Nuernberger","Eyal Ofek","Hrvoje Benko","Andrew D. Wilson"],"conference":"CHI '16"}