{"paperId":2858052,"citation":[],"reference":[{"content":"Oscar Kin-Chung Au and Chiew-Lan Tai. 2010. Multitouch finger registration and its applications. Proceedings of the 22nd Conference of the ComputerHuman Interaction Special Interest Group of Australia on Computer-Human Interaction - OZCHI '10, ACM Press, 41. http://doi.org/10.1145/1952222.1952233","paperID":"None"},{"content":"Hrvoje Benko, T. Scott Saponas, Dan Morris, and Desney Tan. 2009. Enhancing input on and above the interactive surface with muscle sensing. Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces ITS '09, ACM Press, 93. http://doi.org/10.1145/1731903.1731924","paperID":"None"},{"content":"Sebastian Boring, David Ledo, Xiang \"Anthony\" Chen, Nicolai Marquardt, Anthony Tang, and Saul Greenberg. 2012. The fat thumb. Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services MobileHCI '12, ACM Press, 39. http://doi.org/10.1145/2371574.2371582","paperID":"None"},{"content":"Xiang \"Anthony\" Chen, Tovi Grossman, and George Fitzmaurice. 2014. Swipeboard. Proceedings of the 27th annual ACM symposium on User interface software and technology - UIST '14, ACM Press, 615--620. http://doi.org/10.1145/2642918.2647354","paperID":"None"},{"content":"Hyeonjoong Cho, Miso Kim, and Kyeongeun Seo. 2014. A text entry technique for wrist-worn watches with tiny touchscreens. Proceedings of the adjunct publication of the 27th annual ACM symposium on User interface software and technology - UIST'14 Adjunct, ACM Press, 79--80. http://doi.org/10.1145/2658779.2658785","paperID":"None"},{"content":"Ashley Colley and Jonna Häkkilä. 2014. Exploring finger specific touch screen interaction for mobile phone user interfaces. Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures the Future of Design - OzCHI '14, ACM Press, 539--548. http://doi.org/10.1145/2686612.2686699","paperID":"None"},{"content":"Ashley Colley, Jani Väyrynen, and Jonna Häkkilä. 2015. In-Car Touch Screen Interaction: Comparing Standard, Finger-Specific and Multi-Finger Interaction. Proceedings of the 4th International Symposium on Pervasive Displays - PerDis '15: 131--137.","paperID":"None"},{"content":"Paul Dietz and Darren Leigh. 2001. DiamondTouch. Proceedings of the 14th annual ACM symposium on User interface software and technology - UIST '01, ACM Press, 219. http://doi.org/10.1145/502348.502389","paperID":"None"},{"content":"Mark D. Dunlop, Andreas Komninos, and Naveen Durga. 2014. Towards high quality text entry on smartwatches. Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems CHI EA '14, ACM Press, 2365--2370. http://doi.org/10.1145/2559206.2581319","paperID":"None"},{"content":"Philipp Ewerling, Alexander Kulik, and Bernd Froehlich. 2012. Finger and hand detection for multitouch interfaces based on maximally stable extremal regions. Proceedings of the 2012 ACM international conference on Interactive tabletops and surfaces ITS '12, ACM Press, 173. http://doi.org/10.1145/2396636.2396663","paperID":"None"},{"content":"Alix Goguey, Géry Casiez, Daniel Vogel, Fanny Chevalier, Thomas Pietrzak, and Nicolas Roussel. 2014. A three-step interaction pattern for improving discoverability in finger identification techniques. Proceedings of the adjunct publication of the 27th annual ACM symposium on User interface software and technology - UIST'14 Adjunct, ACM Press, 33--34. http://doi.org/10.1145/2658779.2659100","paperID":"None"},{"content":"Chris Harrison and Scott Hudson. 2012. Using shear as a supplemental two-dimensional input channel for rich touchscreen interaction. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, ACM Press, 3149. http://doi.org/10.1145/2207676.2208730","paperID":"None"},{"content":"Chris Harrison, Munehiko Sato, and Ivan Poupyrev. 2012. Capacitive fingerprinting. Proceedings of the 25th annual ACM symposium on User interface software and technology - UIST '12, ACM Press, 537. http://doi.org/10.1145/2380116.2380183","paperID":"None"},{"content":"Chris Harrison, Julia Schwarz, and Scott E. Hudson. 2011. TapSense. Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST '11, ACM Press, 627. http://doi.org/10.1145/2047196.2047279","paperID":"None"},{"content":"Christian Holz and Patrick Baudisch. 2013. Fiberio. Proceedings of the 26th annual ACM symposium on User interface software and technology - UIST '13, ACM Press, 41--50. http://doi.org/10.1145/2501988.2502021","paperID":"None"},{"content":"Jonggi Hong, Seongkook Heo, Poika Isokoski, and Geehyuk Lee. 2015. SplitBoard. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 1233--1236. http://doi.org/10.1145/2702123.2702273","paperID":"None"},{"content":"Da-Yuan Huang, Ming-Chang Tsai, Ying-Chao Tung, et al. 2014. TouchSense. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 189--192. http://doi.org/10.1145/2556288.2557258","paperID":"None"},{"content":"Luis A. Leiva, Alireza Sahami, Alejandro Catala, Niels Henze, and Albrecht Schmidt. 2015. Text Entry on Tiny QWERTY Soft Keyboards. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 669--678. http://doi.org/10.1145/2702123.2702388","paperID":"None"},{"content":"Frank Chun Yat Li, Richard T. Guy, Koji Yatani, and Khai N. Truong. 2011. The 1line keyboard. Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST '11, ACM Press, 461. http://doi.org/10.1145/2047196.2047257","paperID":"None"},{"content":"I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase sets for evaluating text entry techniques. CHI '03 extended abstracts on Human factors in computing systems CHI '03, ACM Press, 754. http://doi.org/10.1145/765891.765971","paperID":"None"},{"content":"Nicolai Marquardt, Johannes Kiemer, David Ledo, Sebastian Boring, and Saul Greenberg. 2011. Designing user-, hand-, and handpart-aware tabletop interactions with the TouchID toolkit. Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces ITS '11, ACM Press, 21. http://doi.org/10.1145/2076354.2076358","paperID":"None"},{"content":"Peter Norvig. 2013. English Letter Frequency Counts: Mayzner Revisited or ETAOIN SRHLDCU. norvig.com. Retrieved August 24, 2015 from http://norvig.com/mayzner.html","paperID":"None"},{"content":"Stephen Oney, Chris Harrison, Amy Ogan, and Jason Wiese. 2013. ZoomBoard. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13, ACM Press, 2799. http://doi.org/10.1145/2470654.2481387","paperID":"None"},{"content":"Graham Alasdair Wilson Phd Thesis. Using Pressure Input and Thermal Feedback to Broaden Haptic Interaction with Mobile Devices. Retrieved September 8, 2015 from http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1 .1.368.9401","paperID":"None"},{"content":"Quentin Roy, Yves Guiard, Gilles Bailly, Éric Lecolinet, and Olivier Rioul. 2015. Glass+Skin: An Empirical Evaluation of the Added Value of Finger Identification to Basic Single-Touch Interaction on Touch Screens. INTERACT: IFIP International Conference on Human-Computer Interaction, Springer.","paperID":"None"},{"content":"Atsushi Sugiura and Yoshiyuki Koseki. 1998. A user interface using fingerprint recognition. Proceedings of the 11th annual ACM symposium on User interface software and technology - UIST '98, ACM Press, 71--79. http://doi.org/10.1145/288392.288575","paperID":"None"},{"content":"Nate Swanner. 2015. Sonavation has bonded 3D fingerprint sensors to Gorilla Glass. thenextweb.com. Retrieved September 11, 2015 from http://thenextweb.com/insider/2015/07/21/sonovationhas-bonded-3d-fingerprint-sensors-to-gorilla-glasskiss-your-home-button-goodbye/","paperID":"None"},{"content":"Julie Wagner, Eric Lecolinet, and Ted Selker. 2014. Multi-finger chords for hand-held tablets. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 2883--2892. http://doi.org/10.1145/2556288.2556958","paperID":"None"},{"content":"M Yousefpor and JM Bussat. 2014. Fingerprint Sensor in an Electronic Device. US Patent App. 14/ .... Retrieved September 11, 2015 from https://www.google.com/patents/US20150036065","paperID":"None"},{"content":"Shumin Zhai, Per Ola Kristensson, Pengjun Gong, et al. 2009. Shapewriter on the iphone. Proceedings of the 27th international conference extended abstracts on Human factors in computing systems CHI EA '09, ACM Press, 2667. http://doi.org/10.1145/1520340.1520380","paperID":"None"}],"abstract":"Fast and accurate access to keys for text entry remains an open question for miniature screens. Existing works typically use a cumbersome two-step selection process, first to zero-in on a particular zone and second to make the key selection. We introduce DualKey, a miniature screen text entry technique with a single selection step that relies on finger identification. We report on the results of a 10 day longitudinal study with 10 participants that evaluated speed, accuracy, and learning. DualKey outperformed the existing techniques on long-term performance with a speed of 19.6 WPM. We then optimized the keyboard layout for reducing finger switching time based on the study data. A second 10 day study with eight participants showed that the new sweqty layout improved upon DualKey even further to 21.59 WPM for long-term speed, was comparable to existing techniques on novice speed and outperformed existing techniques on novice accuracy rate.","title":"DualKey: Miniature Screen Text Entry via Finger Identification","filename":"CHI16/p59","authors":["Aakar Gupta","Ravin Balakrishnan"],"conference":"CHI '16"}