{"paperId":2858222,"citation":[],"abstract":"Smart energy systems that leverage machine learning techniques are increasingly integrated in all aspects of our lives. To better understand how to design user interaction with such systems, we implemented three different smart thermostats that automate heating based on users' heating preferences and real-time price variations. We evaluated our designs through a field study, where 30 UK households used our thermostats to heat their homes over a month. Our findings through thematic analysis show that the participants formed different understandings and expectations of our smart thermostat, and used it in various ways to effectively respond to real-time prices while maintaining their thermal comfort. Based on the findings, we present a number of design and research implications, specifically for designing future smart thermostats that will assist us in controlling home heating with real-time pricing, and for future intelligent autonomous systems.","reference":[{"content":"Alper T. Alan, Enrico Costanza, Joel Fischer, Sarvapali D. Ramchurn, Tom Rodden, and Nicholas R. Jennings. 2014. A Field Study of Human-agent Interaction for Electricity Tariff Switching. In Proceedings of the 2014 International Conference on Autonomous Agents and Multi-agent Systems (AAMAS '14). International Foundation for Autonomous Agents and Multiagent Systems, Richland, SC, 965-972. http: //dl.acm.org/citation.cfm?id=2615731.2617400","paperID":"None"},{"content":"Alper T. Alan, Sarvapali D. Ramchurn, Tom Rodden, Enrico Costanza, Joel Fischer, and Nicholas R. Jennings. 2015. Managing Energy Tariffs with Agents: A Field Study of a Future Smart Energy System at Home. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, NY, NY, USA, 1551-1558. DOI: http://dx.doi.org/10.1145/2800835.2801626","paperID":"None"},{"content":"Galen L. Barbose, Charles A. Goldman, and Bernie Neenan. 2004. A Survey of Utility Experience with Real Time Pricing. (12 2004), 127.","paperID":"None"},{"content":"Jacky Bourgeois, Janet van der Linden, Gerd Kortuem, Blaine A. Price, and Christopher Rimmer. 2014. Conversations with My Washing Machine: An In-the-wild Study of Demand Shifting with Self-generated Energy. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, NY, NY, USA, 459-470. DOI: http://dx.doi.org/10.1145/2632048.2632106","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77-101.","paperID":"None"},{"content":"Adrian Clear, Adrian Friday, Mike Hazas, and Carolynne Lord. 2014. Catch My Drift?: Achieving Comfort More Sustainably in Conventionally Heated Buildings. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA, 1015-1024. DOI: http://dx.doi.org/10.1145/2598510.2598529","paperID":"None"},{"content":"Adrian K. Clear, Janine Morley, Mike Hazas, Adrian Friday, and Oliver Bates. 2013. Understanding Adaptive Thermal Comfort: New Directions for UbiComp. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 113-122. DOI:http://dx.doi.org/10.1145/2493432.2493451","paperID":"None"},{"content":"Enrico Costanza, Joel E. Fischer, James A. Colley, Tom Rodden, Sarvapali D. Ramchurn, and Nicholas R. Jennings. 2014. Doing the Laundry with Agents: A Field Trial of a Future Smart Energy System in the Home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 813-822. DOI: http://dx.doi.org/10.1145/2556288.2557167","paperID":"None"},{"content":"Nicholas R. Jennings, Luc Moreau, David Nicholson, Sarvapali Ramchurn, Stephen Roberts, Tom Rodden, and Alex Rogers. 2014. Human-agent Collectives. Commun. ACM 57, 12 (Nov. 2014), 80-88. DOI: http://dx.doi.org/10.1145/2629559","paperID":"None"},{"content":"Abraham Hang-yat Lam, Yi Yuan, and Dan Wang. 2014. An Occupant-participatory Approach for Thermal Comfort Enhancement and Energy Conservation in Buildings. In Proceedings of the 5th International Conference on Future Energy Systems (e-Energy '14). ACM, NY, NY, USA, 133-143. DOI: http://dx.doi.org/10.1145/2602044.2602067","paperID":"None"},{"content":"Jiakang Lu, Tamim Sookoor, Vijay Srinivasan, Ge Gao, Brian Holben, John Stankovic, Eric Field, and Kamin Whitehouse. 2010. The Smart Thermostat: Using Occupancy Sensors to Save Energy in Homes. In Proceedings of the 8th ACM Conference on Embedded Networked Sensor Systems (SenSys '10). ACM, NY, NY, USA, 211-224. DOI: http://dx.doi.org/10.1145/1869983.1870005","paperID":"None"},{"content":"Sarah Mennicken, Jo Vermeulen, and Elaine M. Huang. 2014. From Today's Augmented Houses to Tomorrow's Smart Homes: New Directions for Home Automation Research. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, NY, NY, USA, 105-115. DOI: http://dx.doi.org/10.1145/2632048.2636076","paperID":"None"},{"content":"Vassilis Moustakis. 1997. Do People in HCI Use Machine Learning?. In Design of Computing Systems: Social and Ergonomic Considerations, Proceedings of the Seventh International Conference on Human-Computer Interaction, (HCI International '97), San Francisco, California, USA, August 24--29, 1997, Volume 2. 95-98.","paperID":"None"},{"content":"F. Oldewurtel, A. Parisio, C. N. Jones, M. Morari, D. Gyalistras, M. Gwerder, V. Stauch, B. Lehmann, and K. Wirth. 2010. Energy Efficient Building Climate Control using Stochastic Model Predictive Control and Weather Predictions. In American Control Conference. Baltimore, USA. http://control.ee.ethz.ch/index.cgi?page=publications;action=details;id=3551","paperID":"None"},{"content":"Athanasios Aris Panagopoulos, Muddasser Alam, Alex Rogers, and Nicholas R. Jennings. 2015. AdaHeat: A General Adaptive Intelligent Agent for Domestic Heating Control. In Proceedings of the 2015 International Conference on Autonomous Agents and Multiagent Systems (AAMAS '15). International Foundation for Autonomous Agents and Multiagent Systems, Richland, SC, 1295-1303. http: //dl.acm.org/citation.cfm?id=2772879.2773317","paperID":"None"},{"content":"Therese Peffer, Marco Pritoni, Alan Meier, Cecilia Aragon, and Daniel Perry. 2011. How people use thermostats in homes: A review. Building and Environment 46, 12 (2011), 2529 - 2541. DOI:http: //dx.doi.org/10.1016/j.buildenv.2011.06.002","paperID":"None"},{"content":"Stuart Reeves. 2012. Envisioning Ubiquitous Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1573-1582. DOI: http://dx.doi.org/10.1145/2207676.2208278","paperID":"None"},{"content":"Kirsten M.A. Revell and Neville A. Stanton. 2014. Case studies of mental models in home heat control: Searching for feedback, valve, timer and switch theories. Applied Ergonomics 45, 3 (2014), 363 - 378. DOI: http://dx.doi.org/10.1016/j.apergo.2013.05.001","paperID":"None"},{"content":"Yvonne Rogers, Helen Sharp, and Jenny Preece. 2011. Interaction design: beyond human-computer interaction. Wiley.","paperID":"None"},{"content":"Allison Sauppé and Bilge Mutlu. 2015. The Social Impact of a Robot Co-Worker in Industrial Settings. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3613-3622. DOI: http://dx.doi.org/10.1145/2702123.2702181","paperID":"None"},{"content":"James Scott, A.J. Bernheim Brush, John Krumm, Brian Meyers, Michael Hazas, Stephen Hodges, and Nicolas Villar. 2011. PreHeat: Controlling Home Heating Using Occupancy Prediction. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11). ACM, NY, NY, USA, 281-290. DOI:http://dx.doi.org/10.1145/2030112.2030151","paperID":"None"},{"content":"Mike Shann and Sven Seuken. 2013. An Active Learning Approach to Home Heating in the Smart Grid. In Proceedings of the Twenty-Third International Joint Conference on Artificial Intelligence (IJCAI '13). AAAI Press, 2892-2899. http: //dl.acm.org/citation.cfm?id=2540128.2540545","paperID":"None"},{"content":"Will Simm, Maria Angela Ferrario, Adrian Friday, Peter Newman, Stephen Forshaw, Mike Hazas, and Alan Dix. 2015. Tiree Energy Pulse: Exploring Renewable Energy Forecasts on the Edge of the Grid. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1965-1974. DOI: http://dx.doi.org/10.1145/2702123.2702285","paperID":"None"},{"content":"Robert E. Slavin, John S. Wodarski, and Bernard L. Blackburn. 1981. A Group Contingency for Electricity Conservation in Master-Metered Apartments. Journal of Applied Behavior Analysis 14, 3 (1981), 357-97. DOI: http://dx.doi.org/10.1901/jaba.1981.14--357","paperID":"None"},{"content":"Simone Stumpf, Vidya Rajaram, Lida Li, Weng-Keen Wong, Margaret Burnett, Thomas Dietterich, Erin Sullivan, and Jonathan Herlocker. 2009. Interacting meaningfully with machine learning systems: Three experiments. International Journal of Human-Computer Studies 67, 8 (2009), 639 - 662. DOI: http://dx.doi.org/10.1016/j.ijhcs.2009.03.004","paperID":"None"},{"content":"Justin Talbot, Bongshin Lee, Ashish Kapoor, and Desney S. Tan. 2009. Ensemble Matrix: Interactive Visualization to Support Machine Learning with Multiple Classifiers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1283-1292. DOI:http://dx.doi.org/10.1145/1518701.1518895","paperID":"None"},{"content":"Joe Tullio, Anind K. Dey, Jason Chalecki, and James Fogarty. 2007. How It Works: A Field Study of Non-technical Users Interacting with an Intelligent System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 31-40. DOI: http://dx.doi.org/10.1145/1240624.1240630","paperID":"None"},{"content":"Rayoung Yang and Mark W. Newman. 2013. Learning from a Learning Thermostat: Lessons for Intelligent Systems for the Home. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 93-102. DOI: http://dx.doi.org/10.1145/2493432.2493489","paperID":"None"},{"content":"Rayoung Yang, Mark W. Newman, and Jodi Forlizzi. 2014. Making Sustainability Sustainable: Challenges in the Design of Eco-interaction Technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 823-832. DOI: http://dx.doi.org/10.1145/2556288.2557380","paperID":"None"},{"content":"Zhe Yu, Liyan Jia, Mary C. Murphy-Hoye, Annabelle Pratt, and Lang Tong. 2013. Modeling and Stochastic Control for Home Energy Management. IEEE Trans. Smart Grid 4, 4 (2013), 2244-2255. DOI: http://dx.doi.org/10.1109/TSG.2013.2279171","paperID":"None"}],"title":"It is too Hot: An In-Situ Study of Three Designs for Heating","filename":"CHI16/p5262","authors":["Alper T. Alan","Mike Shann","Enrico Costanza","Sarvapali D. Ramchurn","Sven Seuken"],"conference":"CHI '16"}