{"paperId":2858334,"citation":[],"abstract":"We present experimental work which explores the effect of touch indirectness on spatial memory and navigation performance in a 2D panning task. In this regard and based on the theory of embodied cognition, prior work has observed performance increases for direct touch input over indirect mouse input. As indirect touch systems gain in importance, we designed an experiment to systematically investigate the effect of spatial indirectness while maintaining the proprioceptive and kinesthetic cues provided by touch input. In an abstract search task, participants of our study navigated a 2D space and were asked to reproduce spatial item configurations in a recall task. Our results indicate that spatial memory performance is not decreased by a spatial separation of touch input gestures and visual display. Further, our results suggest that decreasing the size of the input surface in the indirect condition increases the navigation efficiency.","reference":[{"content":"Xiaojun Bi, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2011. Magic Desk: Bringing Multi-touch Surfaces into Desktop Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2511--2520. DOI: http://dx.doi.org/10.1145/1978942.1979309","paperID":"None"},{"content":"Tanja Döring, Dagmar Kern, Paul Marshall, Max Pfeiffer, Johannes Schöning, Volker Gruhn, and Albrecht Schmidt. 2011. Gestural Interaction on the Steering Wheel: Reducing the Visual Demand. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 483--492. DOI: http://dx.doi.org/10.1145/1978942.1979010","paperID":"None"},{"content":"Clifton Forlines, Daniel Wigdor, Chia Shen, and Ravin Balakrishnan. 2007. Direct-touch vs. Mouse Input for Tabletop Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 647--656. DOI: http://dx.doi.org/10.1145/1240624.1240726","paperID":"None"},{"content":"Jeremie Gilliot, Gery Casiez, and Nicolas Roussel. 2014a. Direct and Indirect Multi-touch Interaction on a Wall Display. In Proceedings of the 26th Conference on L'Interaction Homme-Machine (IHM '14). ACM, New York, NY, USA, 147--152. DOI: http://dx.doi.org/10.1145/2670444.2670445","paperID":"None"},{"content":"Jeremie Gilliot, Gery Casiez, and Nicolas Roussel. 2014b. Impact of Form Factors and Input Conditions on Absolute Indirect-touch Pointing Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 723--732. DOI: http://dx.doi.org/10.1145/2556288.2556997","paperID":"None"},{"content":"Hans-Christian Jetter, Svenja Leifert, Jens Gerken, Soren Schubert, and Harald Reiterer. 2012. Does (Multi-)Touch Aid Users' Spatial Memory and Navigation in 'Panning' and in 'Zooming & Panning' UIs. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '12). ACM, New York, NY, USA, 83--90. DOI: http://dx.doi.org/10.1145/2254556.2254575","paperID":"None"},{"content":"JA Scott Kelso. 1997. Dynamic patterns: The self-organization of brain and behavior. MIT press.","paperID":"None"},{"content":"Mathieu Nancel, Daniel Vogel, and Edward Lank. 2015. Clutching Is Not (Necessarily) the Enemy. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 4199--4202. DOI: http://dx.doi.org/10.1145/2702123.2702134","paperID":"None"},{"content":"Dominik Schmidt, Florian Block, and Hans Gellersen. 2009. A Comparison of Direct and Indirect Multi-touch Input for Large Surfaces. In Proceedings of the 12th IFIP TC 13 International Conference on Human-Computer Interaction: Part I (INTERACT '09). Springer-Verlag, Berlin, Heidelberg, 582--594. DOI: http://dx.doi.org/10.1007/978--3--642-03655--2_65","paperID":"None"},{"content":"Sophie Stellmach and Raimund Dachselt. 2012. Look & Touch: Gaze-supported Target Acquisition. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2981--2990. DOI: http://dx.doi.org/10.1145/2207676.2208709","paperID":"None"},{"content":"Desney S. Tan, Randy Pausch, Jeanine K. Stefanucci, and Dennis R. Proffitt. 2002. Kinesthetic Cues Aid Spatial Memory. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, New York, NY, USA, 806--807. DOI: http://dx.doi.org/10.1145/506443.506607","paperID":"None"},{"content":"Simon Voelker, Andrii Matviienko, Johannes Schoning, and Jan Borchers. 2015. Combining Direct and Indirect Touch Input for Interactive Workspaces Using Gaze Input. In Proceedings of the 3rd ACM Symposium on Spatial User Interaction (SUI '15). ACM, New York, NY, USA, 79--88. DOI: http://dx.doi.org/10.1145/2788940.2788949","paperID":"None"},{"content":"Simon Voelker, Chat Wacharamanotham, and Jan Borchers. 2013. An Evaluation of State Switching Methods for Indirect Touch Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 745--754. DOI: http://dx.doi.org/10.1145/2470654.2470759","paperID":"None"},{"content":"Malte Weiss, Simon Voelker, Christine Sutter, and Jan Borchers. 2010. BendDesk: dragging across the curve. In ACM International Conference on Interactive Tabletops and Surfaces. ACM, 1--10.","paperID":"None"},{"content":"Raphael Wimmer, Fabian Hennecke, Florian Schulz, Sebastian Boring, Andreas Butz, and Heinrich Hußmann. 2010. Curve: Revisiting the Digital Desk. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10). ACM, New York, NY, USA, 561--570. DOI:http://dx.doi.org/10.1145/1868914.1868977","paperID":"None"}],"title":"Indirect 2D Touch Panning: How Does It Affect Spatial Memory and Navigation Performance?","filename":"CHI16/p1947","authors":["Henri Palleis","Heinrich Hussmann"],"conference":"CHI '16"}