{"paperId":2858220,"citation":[],"reference":[{"content":"Jessalyn Alvina, Shengdong Zhao, Simon T. Perrault, Maryam Azh, Thijs Roumen, and Morten Fjeld. 2015. OmniVib: Towards Cross-body Spatiotemporal Vibrotactile Notifications for Mobile Phones. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 2487-2496. http://doi.org/10.1145/2702123.2702341","paperID":"None"},{"content":"LC Barry. 2004. The handicap of abnormal color vision. Clin Exp Optom 87, 4--5: 258-275.","paperID":"None"},{"content":"Xin Bei V Chan, Shi Min S Goh, and Ngiap Chuan Tan. 2014. Subjects with colour vision deficiency in the community: what do primary care physicians need to know? Asia Pacific Family Medicine 13, 1: 10.","paperID":"None"},{"content":"Soon Hau Chua, Haimo Zhang, Muhammad Hammad, Shengdong Zhao, Sahil Goyal, and Karan Singh. 2015. ColorBless?: Augmenting Visual Information for Colorblind People with Binocular Luster Effect. ACM Transactions on ComputerHuman Interaction 21, 6: 1-20. http://doi.org/10.1145/2687923","paperID":"None"},{"content":"Samir S Deeb. 2006. Genetics of variation in human color vision and the retinal cone mosaic. Current Opinion in Genetics and Development 16, 301-307. http://doi.org/10.1016/j.gde.2006.04.002","paperID":"None"},{"content":"Kees van Den Doel and others. 2003. Soundview: Sensing color images by kinesthetic audio. Proceedings of the International Conference on Auditory Display, 303-306.","paperID":"None"},{"content":"David R Flatla, Alan R Andrade, Ross D Teviotdale, Dylan L Knowles, and Craig Stewart. 2015. ColourID: Improving Colour Identification for People with Impaired Colour Vision. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 3543- 3552. http://dx.doi.org/10.1145/2702123.2702578","paperID":"None"},{"content":"Aakar Gupta, Thomas Pietrzak, Nicolas Roussel, and Ravin Balakrishnan. 2016. Direct Manipulation in Tactile Displays. Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems CHI' 16, 1-11. http://doi.org/http://dx.doi.org/10.1145/2858036.28","paperID":"None"},{"content":"G H Jacobs. 1976. Color vision. Annual review of psychology 27, 1: 63-89. http://doi.org/10.1146/annurev.ps.27.020176.00043","paperID":"None"},{"content":"Luke Jefferson and Richard Harvey. 2007. An interface to support color blind computer users. Proceedings of the SIGCHI conference on Human factors in computing systems CHI '07: 1535. http://doi.org/10.1145/1240624.1240855","paperID":"None"},{"content":"Kanav Kahol, Jamieson French, Laura Bratton, and Sethuraman Panchanathan. 2006. Learning and Perceiving Colors Haptically. Proceedings of the 8th International ACM SIGACCESS Conference on Computers and Accessibility, ACM, 173-180. http://doi.org/10.1145/1168987.1169017","paperID":"None"},{"content":"Timothy D King. 2005. Human color perception, cognition, and culture: why red is always red. Electronic Imaging 2005, 234-242.","paperID":"None"},{"content":"Jaeyeon Lee, Jaehyun Han, and Geehyuk Lee. 2015. Investigating the Information Transfer Efficiency of a 3x3 Watch-back Tactile Display. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 1229-1232. http://doi.org/10.1145/2702123.2702530","paperID":"None"},{"content":"Seungyon Claire Lee and Thad Starner. 2010. BuzzWear: alert perception in wearable tactile displays on the wrist. Proceedings of the SIGCHI conference on Human factors in computing systems, 433-442. http://dx.doi.org/10.1145/1978942.1979425","paperID":"None"},{"content":"Michael Matscheko, Alois Ferscha, Andreas Riener, and Manuel Lehner. 2010. Tactor Placement in Wrist Worn Wearables. 14th annual IEEE International Symposium on Wearable Computers (ISWC '10), October 10--13, Seoul, South Korea, IEEE Computer Society Press, 8.","paperID":"None"},{"content":"Jerome Pasquero, Scott J Stobbe, and Noel Stonehouse. 2011. A haptic wristwatch for eyesfree interactions. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3257-3266. http://dx.doi.org/10.1145/1978942.1979425","paperID":"None"},{"content":"Shanaka Ransiri and Suranga Nanayakkara. 2013. SmartFinger: : an augmented finger as a seamless 'channel' between digital and physical objects. Proceedings of the 4th Augmented Human International Conference on - AH '13, ACM Press, 5-8. http://doi.org/10.1145/2459236.2459238","paperID":"None"},{"content":"Behzad Sajadi, Aditi Majumder, Manuel M Oliveira, Rosalia G Schneider, and Ramesh Raskar. 2012. Using Patterns to Encode Color Information for Dichromats. IEEE transactions on visualization and computer graphics 19, 1: 118-129. http://doi.org/10.1109/TVCG.2012.93","paperID":"None"},{"content":"Bahador Saket, Chrisnawan Prasojo, Yongfeng Huang, and Shengdong Zhao. 2013. Designing an effective vibration-based notification interface for mobile phones. Proceedings of the 2013 conference on Computer supported cooperative work, 149-1504. http://dx.doi.org/10.1145/2441776.2441946","paperID":"None"},{"content":"Helen N. Schwerdt, Jonathan Tapson, and Ralph Etienne-Cummings. 2009. A color detection glove with haptic feedback for the visually disabled. 2009 43rd Annual Conference on Information Sciences and Systems, IEEE, 681-686. http://doi.org/10.1109/CISS.2009.5054804","paperID":"None"},{"content":"Enrico Tanuwidjaja, Derek Huynh, Kirsten Koa, et al. 2014. Chroma: A Wearable Augmented-Reality Solution for Color Blindness. Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 799-810. http://doi.org/10.1145/2632048.2632091","paperID":"None"},{"content":"Paweł Wozniak, Kristina Knaving, Mohammad Obaid, Marta Gonzalez Carcedo, Ayça Ünlüer, and Morten Fjeld. 2015. ChromaGlove: a wearable haptic feedback device for colour recognition. Proceedings of the 6th Augmented Human International Conference (AH '15), ACM, 219-220. http://dx.doi.org/10.1145/2735711.2735781","paperID":"None"},{"content":"Gi Hun Yang, Moon Sub Jin, Yeonsub Jin, and Sungchul Kang. 2010. T-mobile: Vibrotactile display pad with spatial and directional information for hand-held device. IEEE/RSJ 2010 International Conference on Intelligent Robots and Systems, IROS 2010 Conference Proceedings: 5245-5250. http://doi.org/10.1109/IROS.2010.5651759","paperID":"None"}],"abstract":"Most existing colorblind aids help their users to distinguish and recognize colors but not compare them. We present HaptiColor, an assistive wristband that encodes discrete color information into spatiotemporal vibrations to support colorblind users to recognize and compare colors. We ran three experiments: the first found the optimal number and placement of motors around the wrist-worn prototype, and the second tested the optimal way to represent discrete points between the vibration motors. Results suggested that using three vibration motors and pulses of varying duration to encode proximity information in spatiotemporal patterns is the optimal solution. Finally, we evaluated the HaptiColor prototype and encodings with six colorblind participants. Our results show that the participants were able to easily understand the encodings and perform color comparison tasks accurately (94.4% to 100%).","title":"HaptiColor: Interpolating Color Information as Haptic Feedback to Assist the Colorblind","filename":"CHI16/p3572","authors":["Marta G. Carcedo","Soon Hau Chua","Simon Perrault","Paweł Wozniak","Raj Joshi","Mohammad Obaid","Morten Fjeld","Shengdong Zhao"],"conference":"CHI '16"}