{"paperId":2858359,"citation":[],"reference":[{"content":"Pitor D. Adamczyk and Brian P. Bailey. 2004. If not now when?: The effects of interruption at different moments within task execution. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems 6, 1: 271--278. http://doi.org/10.1145/985692.985727","paperID":"None"},{"content":"Lenard A. Adler, L., Thomas Spencer, Stephen V. Faraone, Ronald C. Kessler, Mary J. Howes, Joseph Biederman, and Kristina Secnik. 2006. Validity of pilot adult ADHD Self-Report Scale (ASRS) to rate adult ADHD symptoms. Annals of Clinical Psychiatry. 18, 3: 145--148.","paperID":"None"},{"content":"Rachel F. Adler, and Raquel Benbunan-Fich. 2002. Juggling on a high wire: Multitasking effects on performance. International Journal of Human-Computer Studies. 70, 2: 156--168.","paperID":"None"},{"content":"American Psychiatric Association. 2013. Diagnostic and Statistical Manual of Mental Disorders (Fifth ed.). Arlington, VA: American Psychiatric Publishing.","paperID":"None"},{"content":"Anja Baethge and Thomas Rigotti. 2013. Interruptions to workflow: Their relationship with irritation and satisfaction with performance, and the mediating roles of time pressure and mental demands. Work & Stress. 27, 1: 43--63.","paperID":"None"},{"content":"Pierre Barrouillet, Sophie Bernardin, and Valérie Camos. 2004. Time constraints and resource sharing in adults' working memory spans. Journal of Experimental Psychology: General. 133, 1: 83--100.","paperID":"None"},{"content":"Christian Bjørnskov. 2008. How comparable are the Gallup World Poll life satisfaction data? Journal of Happiness Studies. 11, 1: 41--60.","paperID":"None"},{"content":"Yung-Ju Chang, John C Tang. 2015. Investigating mobile users' ringer mode usage and attentiveness and responsiveness to communication. In Proceedings of the SIGCHI Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15): 6--15. http://dx.doi.org/10.1145/2785830.2785852","paperID":"None"},{"content":"Jacob Cohen. 1992. A power primer. Psychological Bulletin. 112, 1: 155--15","paperID":"None"},{"content":"Edward Cutrell, Mary Czerwinski, and Eric Horvitz. 2001. Notification, disruption, and memory: Effects of messaging interruptions on memory and performance. In Proceedings of the SIGCHI Conference on Human Computer Interaction (Interact '01), 1999: 263--269.","paperID":"None"},{"content":"Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A diary study of task switching and interruptions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04) 6, 1: 175--182. http://doi.org/10.1145/985692.985715","paperID":"None"},{"content":"Tilman Dingler and Martin Pielot. 2015. I'll be there for you: Quantifying attentiveness towards mobile messaging. In Proceedings of the SIGCHI Conference on Human-Computer Interaction with Mobile Devices and Services: 1--5. Retrieved December 17th, 2015 from http://pielot.org/pubs/Dingler2015-MobileHCI-Attentiveness.pdf","paperID":"None"},{"content":"Colleen L. Dobie, W. Brooks Donald, M. Hanson, C. Heim, John Huxsahl, and et al. 2012. Diagnosis and management of attention deficit hyperactivity disorder in primary care for school-age children and adolescents. Institute for Clinical Systems Improvement.","paperID":"None"},{"content":"Denzil Ferreira, Jorge Gonçalves, Vassilis Kostakos, Louise Barkhuus, and Anind K. Dey. 20 Contextual experience sampling of mobile application micro-usage. In Proceedings of SIGCHI Conference on Human-computer interaction with Mobile Devices and Services (MobileHCI'14): 91--100. http://doi.org/10.1145/2628363.2628367","paperID":"None"},{"content":"Julie P. Gentile, Rafay Atiq, and Paulette M. Gillig. 2006. Adult ADHD: Diagnosis, differential diagnosis, and medication management. Psychiatry (Edgmont). 3, 8: 25--30.","paperID":"None"},{"content":"James M. Grohol. 2013. Attention Deficit Disorder (ADD/ADHD) Test. Retrieved September 09, 2015 from http://psychcentral.com/cgi-bin/addquiz.cgi#sthash.LxTPdK6V.dpuf","paperID":"None"},{"content":"Harris Interactive. 2013. Where do you take your phone? Retrieved September 10, 2015 from http://www.zdnet.com/article/phone-sex-using-our-smartphones-from-the-shower-to-the-sack/","paperID":"None"},{"content":"Andrew Hayes. 2013. Introduction to Mediation, Moderation, and Conditional Process Analysis: A Regression-Based Approach. Guilford Press.","paperID":"None"},{"content":"Shamsi T. Iqbal and Eric Horvitz. 2010. Notifications and awareness: A field study of alert usage and preferences. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10): 27--30. http://doi.org/10.1145/1718918.1718926","paperID":"None"},{"content":"Charles M. Judd, David A. Kenny, and Gary H. McClelland. 2001. Estimating and testing mediation and moderation in within-subject designs. Psychological Methods. 6, 2: 115--134.","paperID":"None"},{"content":"Daniel Kahneman, Alan B. Krueger, David A. Schkade, Norbert Schwarz, and Arthur A. Stone. 2004. A survey method for characterizing daily life experience: The day reconstruction method. Science. 306: 1776--1780.","paperID":"None"},{"content":"Sandra J. J. Kooij, Susanne Bejerot, Andrew Blackwell, and et al. 2010. European consensus statement on diagnosis and treatment of adult ADHD: The European Network Adult ADHD. BMC Psychiatry. 10, 1: 67.","paperID":"None"},{"content":"Kostadin Kushlev and Elizabeth W. Dunn. 2015. Checking email less frequently reduces stress. Computers in Human Behavior. 43: 220--228.","paperID":"None"},{"content":"Nilli Lavie. 2010. Attention, distraction, and cognitive control under load. Current Directions in Psychological Science. 19, 3: 143--148.","paperID":"None"},{"content":"Nilli Lavie, N. and Jan W. De Fockert. 2005. The role of working memory in attentional capture. Psychonomic Bulletin & Review. 12, 4: 669--674.","paperID":"None"},{"content":"Nilli Lavie, Aleksandra Hirst, Jan W. de Fockert, and Essi Viding. 2004. Load theory of selective attention and cognitive control. Journal of Experimental Psychology: General. 133, 3: 339--354.","paperID":"None"},{"content":"Richard M. Lee, Matthew Draper, and Sujin Lee. 2001. Social connectedness, dysfunctional interpersonal behaviors, and psychological distress: Testing a mediator model. Journal of Counseling Psychology. 48, 3: 310--318.","paperID":"None"},{"content":"Baptist Liefooghe, Pierre Barrouillet, André Vandierendonck, and Valérie Camos. 2008. Working memory costs of task switching. Journal of Experimental Psychology: Learning, Memory, and Cognition. 34, 3: 478--494.","paperID":"None"},{"content":"Gloria J. Mark, Stephen Voida, and Armand V. Cardello. 2012. A pace not dictated by electrons: An empirical study of work without email. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12): 555--564. http://dx.doi.org/10.1145/2207676.2207754","paperID":"None"},{"content":"Mary Meeker and Liang Wu. 2013. Internet trends. Retrieved September 10, 2015 from http://www.kpcb.com/blog/2013-internet-trends","paperID":"None"},{"content":"Pew Research Center. 2015. The Smartphone difference. Retrieved May 22, 2015 from http://www.pewinternet.org/2015/04/01/us-smartphone-use-in-2015/","paperID":"None"},{"content":"Martin Pielot, Karen Church, and Rodrigo de Oliveira. 2014. An in-situ study of mobile phone notifications. In Proceedings of the SIGCHI Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '14): 233--242. http://doi.org/10.1145/2628363.2628364","paperID":"None"},{"content":"Martin Pielot and Luz Rello. 2015. The Do Not Disturb challenge. In Proceedings of the ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15): 1761--1766. http://doi.org/10.1145/2702613.2732704","paperID":"None"},{"content":"Lee Rainie, and Kathryn Zickuhr. 2015. Americans' views on mobile etiquette. Retrieved on September 10, 2015 from http://www.pewinternet.org/2015/08/26/americans-views-on-mobile-etiquette/","paperID":"None"},{"content":"Carol D. Ryff. 1989. Happiness is everything, or is it? Explorations on the meaning of psychological well-being. Journal of Personality and Social Psychology. 57: 1069--1081","paperID":"None"},{"content":"Carol D. Ryff, and Corey Lee M. Keyes. 1995. The structure of psychological well-being revisited. Journal of Personality and Social Psychology. 69: 719--727.","paperID":"None"},{"content":"Alireza Sahami Shirazi, Niels Henze, Tilman Dingler, Martin Pielot, Dominik Weber, and Albrecht Schmidt. 2014. Large-scale assessment of mobile notifications. In Proceedings of the ACM Conference on Human factors in Computing Systems (CHI '14): 3055--3064. http://doi.org/10.1145/2556288.2557189","paperID":"None"},{"content":"Kennon M. Sheldon. 1995. Creativity and self-determination in personality. Creativity Research Journal. 8: 61--72.","paperID":"None"},{"content":"Kennon M. Sheldon, Richard Ryan, and Harry T. Reis. 1996. What makes for a good day? Competence and autonomy in the day and in the person. Personality and Social Psychology Bulletin. 22: 1270--1279.","paperID":"None"},{"content":"Michael F. Steger, Patricia Frazier, Shigehiro Oishi, and Matthew Kaler. 2006. The meaning in life questionnaire: Assessing the presence of and search for meaning in life. Journal of Counseling Psychology. 53, 1: 80--93. doi:10.1037/0022-0167.53.1.80","paperID":"None"},{"content":"Cary Stothart, Ainsley Mitchum, and Courtney Yehnert. 2015. The attentional cost of receiving a cell phone notification. Journal of Experimental Psychology: Human Perception and Performance. 41, 4: 893--897. doi:10.1037/xhp0000100","paperID":"None"},{"content":"WNYC. 2015. Bored and Brilliant by the numbers (29 Jan, 2015). Retrieved September 09, 2015 from http://www.wnyc.org/story/bored-and-brilliant-challenge-tracker/","paperID":"None"},{"content":"WNYC. 2015. Yes, you are distracted. Is it ADHD? (13 May, 2015). Retrieved September 09, 2015 from http://www.wnyc.org/story/you-will-be-distracted-while-you-listen-podcast/","paperID":"None"}],"abstract":"As smartphones increasingly pervade our daily lives, people are ever more interrupted by alerts and notifications. Using both correlational and experimental methods, we explored whether such interruptions might be causing inattention and hyperactivity-symptoms associated with Attention Deficit Hyperactivity Disorder (ADHD) even in people not clinically diagnosed with ADHD. We recruited a sample of 221 participants from the general population. For one week, participants were assigned to maximize phone interruptions by keeping notification alerts on and their phones within their reach/sight. During another week, participants were assigned to minimize phone interruptions by keeping alerts off and their phones away. Participants reported higher levels of inattention and hyperactivity when alerts were on than when alerts were off. Higher levels of inattention in turn predicted lower productivity and psychological well-being. These findings highlight some of the costs of ubiquitous connectivity and suggest how people can reduce these costs simply by adjusting existing phone settings.","title":"\"Silence Your Phones\": Smartphone Notifications Increase Inattention and Hyperactivity Symptoms","filename":"CHI16/p1011","authors":["Kostadin Kushlev","Jason Proulx","Elizabeth W. Dunn"],"conference":"CHI '16"}