{"paperId":2858481,"citation":[],"reference":[{"content":"Jason Alexander, Mark T. Marshall, and Sriram Subramanian. 2011. Adding haptic feedback to mobile TV. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11).","paperID":"None"},{"content":"Asukanet Co. Ltd: AI Plate http://aerialimaging.tv/.","paperID":"None"},{"content":"Hrvoje Benko, Ricardo Jota, and Andrew Wilson. 2012. MirageTable: freehand interaction on a projected augmented reality tabletop. CHI '12, 199--208.","paperID":"None"},{"content":"Alex Butler, Otmar Hilliges, Shahram Izadi, Steve Hodges, David Molyneaux, David Kim, and Danny Kong. 2011. Vermeer: direct interaction with a 360° viewable 3D display. UIST '11, 569--576.","paperID":"None"},{"content":"Maayan Cohen, Kody R. Dillman, Haley MacLeod, Seth Hunter, and Anthony Tang. 2014. OneSpace: shared visual scenes for active freeplay. CHI '14, 2177--2180.","paperID":"None"},{"content":"Charith L. Fernando, Masahiro Furukawa, Tadatoshi Kurogi, Sho Kamuro, Katsunari Sato, Kouta Minamizawa, and Susumu Tachi. 2012. Design of TELESAR V for transferring bodily consciousness in Telexistence. IROS2012, 5112--5118.","paperID":"None"},{"content":"Fogscreen: http://www.fogscreen.com/.","paperID":"None"},{"content":"George A. Gescheider, Stanley J. Bolanowski, and Kathleen R. Hardick. 2001. The frequency selectivity of information-processing channels in the tactile sensory system. Somatosensory & Motor Research, 18(3), 191--201.","paperID":"None"},{"content":"Nobuyuki Hashimoto, Shigeru Morokawa, and Kohei Kitamura. 1991. Real-time holography using the highresolution LCTV-SLM, Proc. SPIE 1461, Practical Holography V, 291.","paperID":"None"},{"content":"Heliodisplay: http://www.io2technology.com/.","paperID":"None"},{"content":"Otmar Hilliges, David Kim, Shahram Izadi, Malte Weiss, and Andrew Wilson. 2012. HoloDesk: direct 3D interactions with a situated see-through display. CHI '12, 2421--2430.","paperID":"None"},{"content":"Seki Inoue, Yasutoshi Makino, and Hiroyuki Shinoda. 2015. Active touch perception produced by airborne ultrasonic haptic hologram. IEEE World Haptics Conference, 362--367.","paperID":"None"},{"content":"Hiroshi Ishii and Minoru Kobayashi. 1992. ClearBoard: a seamless medium for shared drawing and conversation with eye contact. CHI '92, 525--532.","paperID":"None"},{"content":"Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical atoms: beyond tangible bits, toward transformable materials. Interactions 19, 1 (January 2012), 38--51.","paperID":"None"},{"content":"Takayuki Iwamoto, Mari Tatezono, and Hiroyuki Shinoda. 2008. Non-contact method for producing tactile sensation using airborne ultrasound. Eurohaptics 2008, 504--513.","paperID":"None"},{"content":"David G. Jansson, and Richard P. Kosowsky. 1984. Display of moving volumetric images. Proc. SPIE 0507, Processing and Display of Three-Dimensional Data II, 82.","paperID":"None"},{"content":"Andrew Jones, Ian McDowall, Hideshi Yamada, Mark Bolas, and Paul Debevec. 2007. Rendering for an interactive 360° light field display. SIGGRAPH '07, Article 40.","paperID":"None"},{"content":"Ken-ichi Kameyama, Koichi Ohtomi, and Yukio Fukui. 1993. Interactive 3-D volume scanning display with optical relay system and multi-dimensional input device. Proc. SPIE 1915, Stereoscopic Displays and Applications IV, 12","paperID":"None"},{"content":"Hyung-Sik Kim, Ji-Sun Kim, Gu-In Jung, Jae-Hoon Jun, Jong-Rak Park, Sung-Phil Kim, Seungmoon Choi, Sung-Jun Park, Mi-Hyun Choi, and Soon-Cheol Chung. 2015. Evaluation of the possibility and response characteristics of laser-induced tactile sensation, Neuroscience Letters. Vol. 602, pp. 68--72.","paperID":"None"},{"content":"Hideki Kimura, Taro Uchiyama, and Hiroyuki Yoshikawa. 2006. Laser produced 3D display in the air. In ACM SIGGRAPH 2006 Emerging Technologies.","paperID":"None"},{"content":"Katherine J. Kuchenbecker, Jonathan Fiene, and Gunter Niemeyer. 2006. Improving contact realism through event-based haptic feedback. IEEE Transactions on Visualization and Computer Graphics, 12 (2), 219--230.","paperID":"None"},{"content":"Yutaka Kunita, Naoko Ogawa, Atsushi Sakuma, Masahiko Inami, Taro Maeda, and Susumu Tachi. 2001. Immersive Autostereoscopic Display for Mutual Telexistence: TWISTER I (Telexistence Wide-angle Immersive STEReoscope model I). IEEE VR 2001, 31--36.","paperID":"None"},{"content":"Knut Langhans, Detlef Bahr, Daniel Bezecny, Dennis Homann, Klaas Oltmann, Krischan Oltmann, Christian Guill, Elisabeth Rieper, and Goets Ardey. 2002. FELIX 3D display: an interactive tool for volumetric imaging. Proc. SPIE 4660, Stereoscopic Displays and Virtual Reality Systems IX, 176.","paperID":"None"},{"content":"Daniel Leithinger, Sean Follmer, Alex Olwal, and Hiroshi Ishii. 2014. Physical telepresence: shape capture and display for embodied, computer-mediated remote collaboration. UIST '14 461--470.","paperID":"None"},{"content":"Benjamin Long, Sue Ann Seah, Tom Carter, and Sriram Subramanian. 2014. Rendering volumetric haptic shapes in mid-air using ultrasound. ACM Trans. Graph. 33, 6, Article 181 (November 2014), 10 pages.","paperID":"None"},{"content":"Satoshi Maekawa, Kouichi Nitta, and Osamu Matoba. 2006. Transmissive optical imaging device with micromirror array. Proc. SPIE 6392, 63920E.","paperID":"None"},{"content":"Yasuaki Monnai, Keisuke Hasegawa, Masahiro Fujiwara, Kazuma Yoshino, Seki Inoue, and Hiroyuki Shinoda. 2014. HaptoMime: mid-air haptic interaction with a floating virtual screen. UIST '14, 663--667.","paperID":"None"},{"content":"Koki Nagano, Andrew Jones, Jing Liu, Jay Busch, Xueming Yu, Mark Bolas, and Paul Debevec. 2013. An autostereoscopic projector array optimized for 3D facial display. In ACM SIGGRAPH 2013 Emerging Technologies.","paperID":"None"},{"content":"Hideyuki Nakanishi, Kazuaki Tanaka, and Yuya Wada. 2014. Remote handshaking: touch enhances video-mediated social telepresence. CHI '14, 2143--2152.","paperID":"None"},{"content":"Marianna Obrist, Sue Ann Seah, and Sriram Subramanian. 2013. Talking about tactile experiences. CHI '13, 1659--1668.","paperID":"None"},{"content":"Marianna Obrist, Sriram Subramanian, Elia Gatti, Benjamin Long, and Thomas Carter. 2015. Emotions mediated through mid-air haptics. CHI '15, 2053--2062.","paperID":"None"},{"content":"Yoichi Ochiai, Takayuki Hoshi, and Jun Rekimoto. 2014. Pixie dust: graphics generated by levitated and animated objects in computational acoustic-potential field. ACM Trans. Graph. 33, 4, Article 85 (July 2014), 13 pages.","paperID":"None"},{"content":"Yoichi Ochiai, Kota Kumagai, Takayuki Hoshi, Jun Rekimoto, Satoshi Hasegawa, and Yoshio Hayasaki. 2015. Fairy lights in femtoseconds: aerial and volumetric graphics rendered by focused femtosecond laser combined with computational holographic fields. In ACM SIGGRAPH 2015 Emerging Technologies.","paperID":"None"},{"content":"Rajinder Sodhi, Ivan Poupyrev, Matthew Glisson, and Ali Israr. 2013. AIREAL: interactive tactile experiences in free air. ACM Trans. Graph. 32, 4, Article 134 (July 2013).","paperID":"None"},{"content":"Pierre St-Hilaire, Stephen A. Benton, Mark Lucente, Mary L. Jepsen, Joel Kollin, Hiroshi Yoshikawa, and John Underkoffler. 1990. Electronic display system for computational holography. Proc. SPIE 1212, Practical Holography IV, 174.","paperID":"None"},{"content":"Yuta Ueda, Karin Iwazaki, Mina Shibasaki, Yusuke Mizushina, Masahiro Furukawa, Hideaki Nii, Kouta Minamizawa, and Susumu Tachi. 2014. HaptoMIRAGE: mid-air autostereoscopic display for seamless interaction with mixed reality environments. In ACM SIGGRAPH 2014 Emerging Technologies.","paperID":"None"},{"content":"Hirotsugu Yamamoto, and Shiro Suyama. 2013. Aerial Imaging by Retro-Reflection (AIRR). SID Symposium Digest of Technical Papers. Vol. 44, No. 1, 895--897.","paperID":"None"}],"abstract":"In this paper, we propose a novel interactive system that mutually copies adjacent 3D environments optically and physically. The system realizes mutual user interactions through haptics without wearing any devices. A realistic volumetric image is displayed using a pair of micro-mirror array plates (MMAPs). The MMAP transmissively reflects the rays from an object, and a pair of them reconstructs the floating aerial image of the object. Our system can optically copy adjacent environments based on this technology. Haptic feedback is also given by using an airborne ultrasound tactile display (AUTD). Converged ultrasound can give force feedback in midair. Based on the optical characteristics of the MMAPs, the cloned image and the user share an identical coordinate system. When a user touches the transferred clone image, the system gives force feedback so that the user can feel the mechanical contact and reality of the floating image.","title":"HaptoClone (Haptic-Optical Clone) for Mutual Tele-Environment by Real-time 3D Image Transfer with Midair Force Feedback","filename":"CHI16/p1980","authors":["Yasutoshi Makino","Yoshikazu Furuyama","Seki Inoue","Hiroyuki Shinoda"],"conference":"CHI '16"}