{"paperId":2858141,"citation":[],"reference":[{"content":"Ruth Aylett. 2000. Emergent Narrative, Social Immersion and 'Storification'. In Proceedings of the 1st International Workshop on Narrative and Interactive Learning Environments. 1-10.","paperID":"None"},{"content":"Bethesda Game Studios. 2013. The Elder Scrolls V: Skyrim. Bethesda Softworks.","paperID":"None"},{"content":"Stefan Blomkvist. 2002. Persona - an overview. In Theoretical perspectives in human-computer interaction.","paperID":"None"},{"content":"Jonathan Blow. 2004. Game Development: Harder Than You Think. Queue 1, 10 (2004), 28-37.","paperID":"None"},{"content":"Amy Bruckman. 1990. The Combinatorics of Storytelling: Mystery Train Interactive. Technical Report. MIT Media Lab.","paperID":"None"},{"content":"Rogelio E. Cardona-Rivera, Kiran Lakkaraju, Jonathan H. Whetzel, and Jeremy R. R. Bernstein. 2013. Large-Scale Conflicts in Massively Multiplayer Online Games. In Proceedings of the 2nd International Conference on Complex Sciences: Theory and Applications. 40-51.","paperID":"None"},{"content":"Rogelio E. Cardona-Rivera, Justus Robertson, Stephen G. Ware, Brent Harrison, David L. Roberts, and R. Michael Young. 2014. Foreseeing Meaningful Choices. In Proceedings of the 10th AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment. 9-15.","paperID":"None"},{"content":"Robert B. Cialdini. 2006. Influence: The Psychology of Persuasion (revised ed.). Harper Business.","paperID":"None"},{"content":"Jacob Cohen. 1992. A Power Primer. Psychological Bulletin 112, 1 (1992), 155.","paperID":"None"},{"content":"Jennifer G. Cover. 2010. The Creation of Narrative in Tabletop Role-Playing Games. McFarland & Company.","paperID":"None"},{"content":"Edward L. Deci and Richard M. Ryan. 1985. Intrinsic Motivation and Self-Determination in Human Behavior. Plenum Press.","paperID":"None"},{"content":"Ignacio X. Domínguez and David L. Roberts. 2014. Asymmetric Virtual Environments: Exploring the Effects of Avatar Colors on Performance. In Proceedings of the Workshop on Experimental AI In Games (EXAG) at the 10th Artificial Intelligence and Interactive Digital Entertainment Conference.","paperID":"None"},{"content":"Nicolas Ducheneaut, Ming-Hui Wen, Nicholas Yee, and Greg Wadley. 2009. Body and Mind: A Study of Avatar Personalization in Three Virtual Worlds. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). 1151-1160.","paperID":"None"},{"content":"Nicolas Ducheneaut, Nicholas Yee, Eric Nickell, and Robert J. Moore. 2006. \"Alone Together?\" Exploring the Social Dynamics of Massively Multiplayer Online Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 407-416.","paperID":"None"},{"content":"Richard Durstenfeld. 1964. Algorithm 235: Random Permutation. Commun. ACM 7, 7 (July 1964), 420-421.","paperID":"None"},{"content":"Matthew W. Fendt, Brent Harrison, Stephen G. Ware, Rogelio E. Cardona-Rivera, and David L. Roberts. 2012. Achieving the Illusion of Agency. In Proceedings of the 5th International Conference on Interactive Digital Storytelling. 114-125.","paperID":"None"},{"content":"Clara Fernández-Vara. 2009. The Tribulations of Adventure Games: Integrating Story into Simulation through Performance. Ph.D. Dissertation. Georgia Institute of Technology.","paperID":"None"},{"content":"Joseph L. Fleiss. 1971. Measuring nominal scale agreement among many raters. Psychological Bulletin 76 (1971), 378-382. Issue 5.","paperID":"None"},{"content":"Rob Heinsoo, Andy Collins, and James Wyatt. 2008. Dungeons & Dragons Player's Handbook: Arcane, Divine, and Martial Heroes (4th ed.). Wizards of the Coast, Inc.","paperID":"None"},{"content":"David Herman. 2009. Cognitive Approaches to Narrative Analysis. In Cognitive Poetics: Goals, Gains and Gaps, Geert Brône and Jeroen Vandaele (Eds.). Mouton de Gruyter, Berlin, Germany, 79-124.","paperID":"None"},{"content":"Michael Hitchens and Anders Drachen. 2008. The Many Faces of Role-Playing Games. International Journal of Role-Playing 1, 1 (2008), 3-21.","paperID":"None"},{"content":"Richard J. Landis and Gary G. Koch. 1977. The Measurement of Observer Agreement for Categorical Data. Biometrics 33, 1 (1977), 159-174.","paperID":"None"},{"content":"Andreas Lieberoth. 2015. Shallow Gamification: Testing Psychological Effects of Framing an Activity as a Game. Games and Culture 10, 3 (2015), 229-248.","paperID":"None"},{"content":"Michael Mateas. 2001. A preliminary poetics for interactive drama and games. Digital Creativity 12, 3 (2001), 140-152.","paperID":"None"},{"content":"Peter Mawhorter, Michael Mateas, Noah Wardrip-Fruin, and Arnav Jhala. 2014. Towards a Theory of Choice Poetics. In Proceedings of the 9th International Conference on the Foundations of Digital Games.","paperID":"None"},{"content":"Emerson R. Murphy-Hill, Tom Zimmermann, and Nachiappan Nagappan. 2014. Cowboys, Ankle Sprains, and Keepers of Quality: How Is Video Game Development Different from Software Development?. In Proceedings of the 36th International Conference on Software Engineering. 1-11.","paperID":"None"},{"content":"Janet H. Murray. 1997. Hamlet on the Holodeck: The Future of Narrative in Cyberspace. Simon and Schuster.","paperID":"None"},{"content":"Ken Perlin. 2002. Polly's World. http://mrl.nyu.edu/~perlin/experiments/polly/. (2002). Online; accessed 11-February-2013.","paperID":"None"},{"content":"Gerald Prince. 2003. A Dictionary of Narratology: Revised Edition. University of Nebraska Press.","paperID":"None"},{"content":"Vladimir Propp. 1968. Morphology of the Folktale. University of TX Press, Austin, TX, USA.","paperID":"None"},{"content":"Mark O. Riedl and Vadim Bulitko. 2013. Interactive Narrative: An Intelligent Systems Approach. AI Magazine 34, 1 (2013), 67-77.","paperID":"None"},{"content":"David L. Roberts and Charles L. Isbell. 2014. Lessons on Using Computationally Generated Influence for Shaping Narrative Experiences. IEEE Transactions on Computational Intelligence and AI in Games 6, 2 (2014), 188-202.","paperID":"None"},{"content":"David Thue, Vadim Bulitko, Marcia Spetch, and Eric Wasylishen. 2007. Interactive Storytelling: A Player Modelling Approach. In Proceedings of the 3rd AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment. 43-48.","paperID":"None"},{"content":"Amos Tversky and Daniel Kahneman. 1981. The Framing of Decisions and the Psychology of Choice. Science 4481, 211 (1981), 453-458.","paperID":"None"},{"content":"Anders Tychsen, Michael Hitchens, and Thea Brolund. 2008. Motivations for Play in Computer Role-Playing Games. In Proceedings of the 2008 Conference on Future Play: Research, Play, Share. ACM, 57-64.","paperID":"None"},{"content":"Dennis Waskul and Matt Lust. 2004. Role-Playing and Playing Roles: The Person, Player, and Persona in Fantasy Role-Playing. Symbolic Interaction 27, 3 (2004), 333-356.","paperID":"None"},{"content":"Nick Yee. 2006a. Motivations for Play in Online Games. Cyber Psychology & Behavior 9, 6 (2006), 772-775.","paperID":"None"},{"content":"Nick Yee. 2006b. The Psychology of Massively Multi-user Online Role-playing Games: Motivations, Emotional Investment, Relationships and Problematic Usage. In Avatars at Work and Play, Ralph Schroeder and Ann-Sofie Axelson (Eds.). Springer, 187-207.","paperID":"None"},{"content":"Nick Yee and Jeremy Bailenson. 2007. The Proteus Effect: The Effect of Transformed Self-Representation on Behavior. Human Communication Research 33 (2007), 271-290.","paperID":"None"},{"content":"Nick Yee, Nicolas Ducheneaut, Les Nelson, and Peter Likarish. 2011. Introverted Elves & Conscientious Gnomes: The Expression of Personality in World of Warcraft. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). 753-762.","paperID":"None"},{"content":"Nick Yee, Helen Harris, Maria Jabon, and Jeremy N Bailenson. 2010. The expression of personality in virtual worlds. Social Psychological and Personality Science (2010).","paperID":"None"},{"content":"Hong Yu and Mark O. Riedl. 2014. Personalized Interactive Narratives via Sequential Recommendation of Plot Points. IEEE Transactions on Computational Intelligence and AI in Games 6, 2 (2014), 174-187.","paperID":"None"}],"abstract":"We present a study that investigates the heretofore unexplored relationship between a player's sense of her narrative role in an interactive narrative role-playing game and the options she selects when faced with choice structures during gameplay. By manipulating a player's knowledge over her role, and examining in-game options she preferred in choice structures, we discovered what we term the Mimesis Effect: when players were explicitly given a role, we found a significant relationship between their role and their in-game actions; participants role-play even if not instructed to, exhibiting a preference for actions consistent with their role. Further, when players were not explicitly given a role, participants still role-played -- they were consistent with an implicit role -- but did not agree on which role to implicitly be consistent with. We discuss our findings and broader implications of our work to both game development and games research.","title":"The Mimesis Effect: The Effect of Roles on Player Choice in Interactive Narrative Role-Playing Games","filename":"CHI16/p3438","authors":["Ignacio X. Domínguez","Rogelio E. Cardona-Rivera","James K. Vance","David L. Roberts"],"conference":"CHI '16"}