{"paperId":2858208,"citation":[],"reference":[{"content":"Arai, T., Machii, K., Kuzunuki, S., and Shojima, H. Interactivedesk: A computer-augmented desk which responds to operations on real objects. In Conference Companion on Human Factors in Computing Systems, CHI '95, ACM (NY, NY, USA, 1995), 141--142.","paperID":"None"},{"content":"Bailly, G., Pietrzak, T., Deber, J., and Wigdor, D. J. Métamorphe: Augmenting hotkey usage with actuated keys. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (NY, NY, USA, 2013), 563--572.","paperID":"None"},{"content":"Bi, X., Grossman, T., Matejka, J., and Fitzmaurice, G. Magic desk: Bringing multi-touch surfaces into desktop work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '11, ACM (NY, NY, USA, 2011), 2511--2520.","paperID":"None"},{"content":"Block, F., Gellersen, H., and Villar, N. Touch-display keyboards: Transforming keyboards into interactive surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '10, ACM (NY, NY, USA, 2010), 1145--1154.","paperID":"None"},{"content":"Brave, S., Ishii, H., and Dahley, A. Tangible interfaces for remote collaboration and communication. In Proceedings of the 1998 ACM Conference on Computer Supported Cooperative Work, CSCW '98, ACM (NY, NY, USA, 1998), 169--178.","paperID":"None"},{"content":"Breazeal, C., Wang, A., and Picard, R. Experiments with a robotic computer: body, affect and cognition interactions. In Human-Robot Interaction (HRI), 2007 2nd ACM/IEEE International Conference on, IEEE (2007), 153--160.","paperID":"None"},{"content":"Chapuis, O., and Roussel, N. Metisse is not a 3d desktop! In Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology, UIST '05, ACM (NY, NY, USA, 2005), 13--22.","paperID":"None"},{"content":"Chua, Y., Tee, K. P., Yan, R., Li, L., and Huang, Z. Towards more engaging telepresence by face tracking. In Proceedings of the Workshop at SIGGRAPH Asia, WASA '12, ACM (NY, NY, USA, 2012), 137--141.","paperID":"None"},{"content":"Dietz, P. H., Eidelson, B., Westhues, J., and Bathiche, S. A practical pressure sensitive computer keyboard. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology, UIST '09, ACM (NY, NY, USA, 2009), 55--58.","paperID":"None"},{"content":"Dragicevic, P., Chevalier, F., and Huot, S. Running an hci experiment in multiple parallel universes. In CHI '14 Extended Abstracts on Human Factors in Computing Systems, CHI EA '14, ACM (NY, NY, USA, 2014), 607--618.","paperID":"None"},{"content":"Greenberg, S., Marquardt, N., Ballendat, T., Diaz-Marino, R., and Wang, M. Proxemic interactions: the new ubicomp? interactions 18, 1 (2011), 42--50.","paperID":"None"},{"content":"Hall, E. T. The hidden dimension.","paperID":"None"},{"content":"Healy, G., Lawler, S., Thorp, A., Neuhaus, M., Robson, E., Owen, N., and Dunstan, D. Reducing prolonged sitting in the workplace. Human Factors and Ergonomics Society (2012).","paperID":"None"},{"content":"Hinckley, K., Czerwinski, M., and Sinclair, M. Interaction and modeling techniques for desktop two-handed input. In Proceedings of the 11th Annual ACM Symposium on User Interface Software and Technology, UIST '98, ACM (NY, NY, USA, 1998), 49--58.","paperID":"None"},{"content":"Horvitz, E. Principles of mixed-initiative user interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '99, ACM (NY, NY, USA, 1999), 159--166.","paperID":"None"},{"content":"Ju, W., and Sirkin, D. Animate objects: How physical motion encourages public interaction. In Proceedings of the 5th International Conference on Persuasive Technology, PERSUASIVE'10, Springer-Verlag (Berlin, Heidelberg, 2010), 40--51.","paperID":"None"},{"content":"Kane, S. K., Avrahami, D., Wobbrock, J. O., Harrison, B., Rea, A. D., Philipose, M., and LaMarca, A. Bon?re: A nomadic system for hybrid laptop-tabletop interaction. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology, UIST '09, ACM (NY, NY, USA, 2009), 129--138.","paperID":"None"},{"content":"Kaptein, M. C., Nass, C., and Markopoulos, P. Powerful and consistent analysis of likert-type ratingscales. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2010), 2391--2394.","paperID":"None"},{"content":"Kaufmann, B., and Ahlström, D. Studying spatial memory and map navigation performance on projector phones with peephole interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (NY, NY, USA, 2013), 3173--3176.","paperID":"None"},{"content":"Kawaguchik, I., Kuzuoka, H., and Suzuki, Y. Study on gaze direction perception of face image displayed on rotatable flat display. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI '15, ACM (NY, NY, USA, 2015), 1729--1737.","paperID":"None"},{"content":"Kim, S., Kim, H., Lee, B., Nam, T.-J., and Lee, W. Inflatable mouse: Volume-adjustable mouse with air-pressure-sensitive input and haptic feedback. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '08, ACM (NY, NY, USA, 2008), 211--224.","paperID":"None"},{"content":"Kudo, H., Suzumori, K., and Kanda, T. Force feedback mouse with differential mechanism for omni-traveling. In Micro-NanoMechatronics and Human Science, 2007. MHS '07. International Symposium on (Nov 2007), 430--435.","paperID":"None"},{"content":"Luff, P., and Heath, C. Mobility in collaboration. In Proceedings of the 1998 ACM Conference on Computer Supported Cooperative Work, CSCW '98, ACM (NY, NY, USA, 1998), 305--314.","paperID":"None"},{"content":"MacKenzie, I. S., Soukoreff, R. W., and Pal, C. A two-ball mouse affords three degrees of freedom. In CHI '97 Extended Abstracts on Human Factors in Computing Systems, CHI EA '97, ACM (NY, NY, USA, 1997), 303--304.","paperID":"None"},{"content":"Marcus-Roberts, H. M., and Roberts, F. S. Meaningless statistics. Journal of Educational and Behavioral Statistics 12, 4 (1987), 383--394.","paperID":"None"},{"content":"Nowacka, D., Ladha, K., Hammerla, N. Y., Jackson, D., Ladha, C., Rukzio, E., and Olivier, P. Touchbugs: Actuated tangibles on multi-touch tables. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (NY, NY, USA, 2013), 759--762.","paperID":"None"},{"content":"Oakley, I., McGee, M. R., Brewster, S., and Gray, P. Putting the feel in 'look and feel'. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '00, ACM (NY, NY, USA, 2000), 415--422.","paperID":"None"},{"content":"Pangaro, G., Maynes-Aminzade, D., and Ishii, H. The actuated workbench: Computer-controlled actuation in tabletop tangible interfaces. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology, UIST '02, ACM (NY, NY, USA, 2002), 181--190.","paperID":"None"},{"content":"Park, W., Park, S., Kim, L., and Shin, S. Haptic mouse interface actuated by an electromagnet. In Proceedings of the 2011 International Conference on Complex, Intelligent, and Software Intensive Systems, CISIS '11, IEEE Computer Society (Washington, DC, USA, 2011), 643--646.","paperID":"None"},{"content":"Parkes, A., Poupyrev, I., and Ishii, H. Designing kinetic interactions for organic user interfaces. Commun. ACM 51, 6 (June 2008), 58--65.","paperID":"None"},{"content":"Patten, J., and Ishii, H. Mechanical constraints as computational constraints in tabletop tangible interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '07, ACM (NY, NY, USA, 2007), 809--818.","paperID":"None"},{"content":"Pedersen, E. W., and Hornbæk, K. Tangible bots: Interaction with active tangibles in tabletop interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '11, ACM (NY, NY, USA, 2011), 2975--2984.","paperID":"None"},{"content":"Perelman, G., Serrano, M., Raynal, M., Picard, C., Derras, M., and Dubois, E. The roly-poly mouse: Designing a rolling input device unifying 2d and 3d interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI '15, ACM (NY, NY, USA, 2015), 327--336.","paperID":"None"},{"content":"Poupyrev, I., Nashida, T., and Okabe, M. Actuation and tangible user interfaces: The vaucanson duck, robots, and shape displays. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction, TEI '07, ACM (NY, NY, USA, 2007), 205--212.","paperID":"None"},{"content":"Probst, K., Lindlbauer, D., Greindl, P., Trapp, M., Haller, M., Schwartz, B., and Schrempf, A. Rotating, tilting, bouncing: Using an interactive chair to promote activity in office environments. In CHI '13 Extended Abstracts on Human Factors in Computing Systems, CHI EA '13, ACM (NY, NY, USA, 2013), 79--84.","paperID":"None"},{"content":"Probst, K., Lindlbauer, D., Haller, M., Schwartz, B., and Schrempf, A. A chair as ubiquitous input device: Exploring semaphoric chair gestures for focused and peripheral interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '14, ACM (NY, NY, USA, 2014), 4097--4106.","paperID":"None"},{"content":"Ramstein, C., and Hayward, V. The pantograph: A large workspace haptic device for multimodal human computer interaction. In Conference Companion on Human Factors in Computing Systems, CHI '94, ACM (NY, NY, USA, 1994), 57--58.","paperID":"None"},{"content":"Rasmussen, M. K., Grönvall, E., Kinch, S., and Petersen, M. G. \"it's alive, it's magic, it's in love with you\": Opportunities, challenges and open questions for actuated interfaces. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration, OzCHI '13, ACM (NY, NY, USA, 2013), 63--72.","paperID":"None"},{"content":"Roudaut, A., Rau, A., Sterz, C., Plauth, M., Lopes, P., and Baudisch, P. Gesture output: Eyes-free output using a force feedback touch surface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (NY, NY, USA, 2013), 2547--2556.","paperID":"None"},{"content":"Savioz, G., Markovic, M., and Perriard, Y. Towards multi-finger haptic devices: A computer keyboard with adjustable force feedback. In Electrical Machines and Systems (ICEMS), 2011 International Conference on (Aug 2011), 1--6.","paperID":"None"},{"content":"Schmidt, D., Kovacs, R., Mehta, V., Umapathi, U., Köhler, S., Cheng, L.-P., and Baudisch, P. Level-ups: Motorized stilts that simulate stair steps in virtual reality. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI '15, ACM (NY, NY, USA, 2015), 2157--2160.","paperID":"None"},{"content":"Schneegass, S., Alt, F., Scheible, J., and Schmidt, A. Midair displays: Concept and first experiences with free-floating pervasive displays. In Proceedings of The International Symposium on Pervasive Displays, PerDis '14, ACM (NY, NY, USA, 2014), 27:27--27:31.","paperID":"None"},{"content":"Seifert, J., Boring, S., Winkler, C., Schaub, F., Schwab, F., Herrdum, S., Maier, F., Mayer, D., and Rukzio, E. Hover pad: Interacting with autonomous and self-actuated displays in space. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology, UIST '14, ACM (NY, NY, USA, 2014), 139--147.","paperID":"None"},{"content":"Sinclair, M., Pahud, M., and Benko, H. Touchmover: Actuated 3d touchscreen with haptic feedback. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces, ITS '13, ACM (NY, NY, USA, 2013), 287--296.","paperID":"None"},{"content":"Steimle, J., Weibel, N., Olberding, S., Mühlhäuser, M., and Hollan, J. D. Plink: Paper-based links for cross-media information spaces. In CHI '11 Extended Abstracts on Human Factors in Computing Systems, CHI EA '11, ACM (NY, NY, USA, 2011), 1969--1974.","paperID":"None"},{"content":"Taylor, S., Keskin, C., Hilliges, O., Izadi, S., and Helmes, J. Type-hover-swipe in 96 bytes: A motion sensing mechanical keyboard. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, CHI '14, ACM (NY, NY, USA, 2014), 1695--1704.","paperID":"None"},{"content":"Vonach, E., Gerstweiler, G., and Kaufmann, H. Acto: A modular actuated tangible user interface object. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces, ITS '14, ACM (NY, NY, USA, 2014), 259--268.","paperID":"None"},{"content":"Weiss, M., Schwarz, F., Jakubowski, S., and Borchers, J. Madgets: Actuating widgets on interactive tabletops. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology, UIST '10, ACM (NY, NY, USA, 2010), 293--302.","paperID":"None"},{"content":"Wellner, P. Interacting with paper on the digitaldesk. Commun. ACM 36, 7 (July 1993), 87--96.","paperID":"None"},{"content":"Yang, X.-D., Mak, E., McCallum, D., Irani, P., Cao, X., and Izadi, S. Lensmouse: Augmenting the mouse with an interactive touch display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '10, ACM (NY, NY, USA, 2010), 2431--2440.","paperID":"None"},{"content":"Yankelovich, N., Simpson, N., Kaplan, J., and Provino, J. Porta-person: Telepresence for the connected conference room. In CHI '07 Extended Abstracts on Human Factors in Computing Systems, CHI EA '07, ACM (NY, NY, USA, 2007), 2789--2794.","paperID":"None"},{"content":"Zhang, H., and Li, Y. Gestkeyboard: Enabling gesture-based interaction on ordinary physical keyboard. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, CHI '14, ACM (NY, NY, USA, 2014), 1675--1684.","paperID":"None"}],"abstract":"We investigate the potential benefits of actuated devices for the desktop workstation which remains the most used environment for daily office works. A formative study reveals that the desktop workstation is not a fixed environment because users manually change the position and the orientation of their devices. Based on these findings, we present the LivingDesktop, an augmented desktop workstation with devices (mouse, keyboard, monitor) capable of moving autonomously. We describe interaction techniques and applications illustrating how actuated desktop workstations can improve ergonomics, foster collaboration, leverage context and reinforce physicality. Finally, the findings of a scenario evaluation are (1) the perceived usefulness of ergonomics and collaboration applications; (2) how the LivingDesktop inspired our participants to elaborate novel accessibility and social applications; (3) the location and user practices should be considered when designed actuated desktop devices.","title":"LivingDesktop: Augmenting Desktop Workstation with Actuated Devices","filename":"CHI16/p5298","authors":["Gilles Bailly","Sidharth Sahdev","Sylvain Malacria","Thomas Pietrzak"],"conference":"CHI '16"}