{"paperId":2858166,"citation":[],"reference":[{"content":"Daniel L. Ashbrook. 2010. Enabling Mobile Microinteractions. PhD thesis, GA Institute of Technology.","paperID":"None"},{"content":"Daniel Ashbrook, Kent Lyons, and Thad Starner. 2008. An Investigation into Round Touchscreen Wristwatch Interaction. Proceedings of the 10th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '08), ACM, 311-314. http://doi.org/10.1145/1409240.1409276","paperID":"None"},{"content":"Gilles Bailly, Eric Lecolinet, and Yves Guiard. 2010. Finger-count & Radial-stroke Shortcuts: 2 Techniques for Augmenting Linear Menus on Multi-touch Surfaces. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), ACM, 591--594. http://doi.org/10.1145/1753326.1753414","paperID":"None"},{"content":"Patrick Baudisch and Gerry Chu. 2009. Back-of-device Interaction Allows Creating Very Small Touch Devices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), ACM, 1923--1932. http://doi.org/10.1145/1518701.1518995","paperID":"None"},{"content":"Xiang \"Anthony\" Chen, Tovi Grossman, and George Fitzmaurice. 2014. Swipeboard: A Text Entry Technique for Ultra-small Interfaces That Supports Novice to Expert Transitions. Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14), ACM, 615--620. http://doi.org/10.1145/2642918.2647354","paperID":"None"},{"content":"Andrew Crossan, John Williamson, Stephen Brewster, and Rod Murray-Smith. 2008. Wrist Rotation for Interaction in Mobile Contexts. Proceedings of the 10th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '08), ACM, 435--438. http://doi.org/10.1145/1409240.1409307","paperID":"None"},{"content":"Carl Gutwin, Andy Cockburn, Joey Scarr, Sylvain Malacria, and Scott C. Olson. 2014. Faster Command Selection on Tablets with FastTap. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), ACM, 2617--2626. http://doi.org/10.1145/2556288.2557136","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2009. Abracadabra: Wireless, High-precision, and Unpowered Finger Input for Very Small Mobile Devices. Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology (UIST '09), ACM, 121--124. http://doi.org/10.1145/1622176.1622199","paperID":"None"},{"content":"Da-Yuan Huang, Ming-Chang Tsai, Ying-Chao Tung, et al. 2014. TouchSense: Expanding Touchscreen Input Vocabulary Using Different Areas of Users' Finger Pads. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), ACM, 189--192. http://doi.org/10.1145/2556288.2557258","paperID":"None"},{"content":"Mohit Jain and Ravin Balakrishnan. 2012. User Learning and Performance with Bezel Menus. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), ACM, 2221--2230. http://doi.org/10.1145/2207676.2208376","paperID":"None"},{"content":"Jungsoo Kim, Jiasheng He, Kent Lyons, and Thad Starner. 2007. The Gesture Watch: A Wireless Contact-free Gesture Based Wrist Interface. Proceedings of the 2007 11th IEEE International Symposium on Wearable Computers (ISWC '07), IEEE Computer Society, 1--8. http://doi.org/10.1109/ISWC.2007.4373770","paperID":"None"},{"content":"Gordon Kurtenbach and William Buxton. 1994. User Learning and Performance with Marking Menus. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '94), ACM, 258--264. http://doi.org/10.1145/191666.191759","paperID":"None"},{"content":"Gordon Paul Kurtenbach. 1993. The Design and Evaluation of Marking Menus. PhD thesis, University of Toronto.","paperID":"None"},{"content":"Gordon P. Kurtenbach, Abigail J. Sellen, and William A. S. Buxton. 1993. An Empirical Evaluation of Some Articulatory and Cognitive Aspects of Marking Menus. Hum.-Comput. Interact. 8, 1: 1--23. http://doi.org/10.1207/s15327051hci0801_1","paperID":"None"},{"content":"Gierad Laput, Robert Xiao, Xiang \"Anthony\" Chen, Scott E. Hudson, and Chris Harrison. 2014. Skin Buttons: Cheap, Small, Low-powered and Clickable Fixed-icon Laser Projectors. Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14), ACM, 389--394. http://doi.org/10.1145/2642918.2647356","paperID":"None"},{"content":"G. Julian Lepinski, Tovi Grossman, and George Fitzmaurice. 2010. The Design and Evaluation of Multitouch Marking Menus. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), ACM, 2233--2242. http://doi.org/10.1145/1753326.1753663","paperID":"None"},{"content":"Stephen Oney, Chris Harrison, Amy Ogan, and Jason Wiese. 2013. ZoomBoard: A Diminutive Qwerty Soft Keyboard Using Iterative Zooming for Ultra-small Devices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), ACM, 2799--2802. http://doi.org/10.1145/2470654.2481387","paperID":"None"},{"content":"Simon T. Perrault, Eric Lecolinet, James Eagan, and Yves Guiard. 2013. Watchit: Simple Gestures and Eyes-free Interaction for Wristwatches and Bracelets. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), ACM, 1451--1460. http://doi.org/10.1145/2470654.2466192","paperID":"None"},{"content":"Gonzalo A. Ramos and Ravin Balakrishnan. 2007. Pressure Marks. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), ACM, 1375--1384. http://doi.org/10.1145/1240624.1240834","paperID":"None"},{"content":"Joey Scarr, Andy Cockburn, Carl Gutwin, and Andrea Bunt. 2012. Improving Command Selection with CommandMaps. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), ACM, 257--266. http://doi.org/10.1145/2207676.2207713","paperID":"None"},{"content":"Joey Scarr, Andy Cockburn, Carl Gutwin, and Sylvain Malacria. 2013. Testing the Robustness and Performance of Spatially Consistent Interfaces. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), ACM, 3139--3148. http://doi.org/10.1145/2470654.2466430","paperID":"None"},{"content":"Marcos Serrano, Eric Lecolinet, and Yves Guiard. 2013. Bezel-Tap Gestures: Quick Activation of Commands from Sleep Mode on Tablets. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), ACM, 3027--3036. http://doi.org/10.1145/2470654.2481421","paperID":"None"},{"content":"Katie A. Siek, Yvonne Rogers, and Kay H. Connelly. 2005. Fat Finger Worries: How Older and Younger Users Physically Interact with PDAs. Proceedings of the 2005 IFIP TC13 International Conference on Human-Computer Interaction (INTERACT'05), Springer-Verlag, 267--280. http://doi.org/10.1007/11555261_24","paperID":"None"},{"content":"Robert Xiao, Gierad Laput, and Chris Harrison. 2014. Expanding the Input Expressivity of Smartwatches with Mechanical Pan, Twist, Tilt and Click. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), ACM, 193--196. http://doi.org/10.1145/2556288.2557017","paperID":"None"}],"abstract":"Small touchscreens worn on the wrist are becoming increasingly common, but standard interaction techniques for these devices can be slow, requiring a series of coarse swipes and taps to perform an action. To support faster command selection on watches, we investigate two related interaction techniques that exploit spatial memory. WristTap uses multitouch to allow selection in a single action, and TwoTap uses a rapid combination of two sequential taps. In three quantitative studies, we investigate the design and performance of these techniques in comparison to standard methods. Results indicate that both techniques are feasible, able to accommodate large numbers of commands, and fast users are able to quickly learn the techniques and reach performance of ~1.0 seconds per selection, which is approximately one-third of the time of standard commercial techniques. We also provide insights into the types of applications for which these techniques are well-suited, and discuss how the techniques could be extended.","title":"Faster Command Selection on Touchscreen Watches","filename":"CHI16/p4663","authors":["Benjamin Lafreniere","Carl Gutwin","Andy Cockburn","Tovi Grossman"],"conference":"CHI '16"}