{"paperId":2858315,"citation":[],"abstract":"In this paper, we investigate how people with mobility impairments assess and evaluate accessibility in the built environment and the role of current and emerging location-based technologies therein. We conducted a three-part formative study with 20 mobility impaired participants: a semi-structured interview (Part 1), a participatory design activity (Part 2), and a design probe activity (Part 3). Part 2 and 3 actively engaged our participants in exploring and designing the future of what we call assistive location-based technologies (ALTs) location-based technologies that specifically incorporate accessibility features to support navigating, searching, and exploring the physical world. Our Part 1 findings highlight how existing mapping tools provide accessibility benefits even though often not explicitly designed for such uses. Findings in Part 2 and 3 help identify and uncover useful features of future ALTs. In particular, we synthesize 10 key features and 6 key data qualities. We conclude with ALT design recommendations.","reference":[{"content":"Dragan Ahmetovic, Roberto Manduchi, James M. Coughlan, and Sergio Mascetti. 2015. Zebra Crossing Spotter: Automatic Population of Spatial Databases for Increased Safety of Blind Travelers. The 17th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS 2015).","paperID":"None"},{"content":"Airbnb. ADA and FHA Compliance. https://www.airbnb.com/help/article/898/ada-and-fhacompliance","paperID":"None"},{"content":"Saeideh Bakhshi, Partha Kanuparthy, and David A Shamma. 2015. Understanding Online Reviews: Funny, Cool or Useful? Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1270--1276. http://doi.org/10.1145/2675133.2675275","paperID":"None"},{"content":"Michael Batty, Andrew Hudson-Smith, Richard Milton, and Andrew Crooks. 2010. Map mashups, Web 2.0 and the GIS revolution. Annals of GIS 16, 1: 1--13. http://doi.org/10.1080/19475681003700831","paperID":"None"},{"content":"Linda Beale, Kenneth Field, David Briggs, Phil Picton, and Hugh Matthews. 2006. Mapping for Wheelchair Users: Route Navigation in Urban Spaces. Cartographic Journal, The 43, 1: 68--81. http://doi.org/10.1179/000870406X93517","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101. http://doi.org/10.1191/1478088706qp063oa","paperID":"None"},{"content":"Rosemary D.F. Bromley, David L. Matthews, and Colin J. Thomas. 2007. City centre accessibility for wheelchair users: The consumer perspective and the planning implications. Cities 24, 3: 229--241. http://doi.org/10.1016/j.cities.2007.01.009","paperID":"None"},{"content":"Bradley J Cardinal and Marc D Spaziani. 2003. ADA Compliance and the Accessibility of Physical Activity Facilities in Western Oregon. American Journal of Health Promotion 17, 3: 197--201. http://doi.org/10.4278/08901171--17.3.197","paperID":"None"},{"content":"George Chin Jr., Mary Beth Rosson, and John M Carroll. 1997. Participatory Analysis: Shared Development of Requirements from Scenarios. Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, ACM, 162--169. http://doi.org/10.1145/258549.258654","paperID":"None"},{"content":"Richard L Church and James R Marston. 2003. Measuring Accessibility for People with a Disability. Geographical Analysis 35, 1: 83--96.","paperID":"None"},{"content":"Jacob Cohen. 1960. A Coefficient of Agreement for Nominal Scales. Educational and Psychological Measurement 20 , 1 : 37--46. http://epm.sagepub.com/content/20/1/37.short","paperID":"None"},{"content":"European Commission. 2014. Economic Impact and Travel Patterns of Accessible Tourism in Europe.","paperID":"None"},{"content":"Chaohai Ding, Mike Wald, and Gary Wills. 2014. A Survey of Open Accessibility Data. Proceedings of the 11th Web for All Conference, ACM, 37:1--37:4. http://doi.org/10.1145/2596695.2596708","paperID":"None"},{"content":"Sarah Elwood. 2011. Geographic Information Science: Visualization, visual methods, and the geoweb. Progress in Human Geography 35, 3: 401--408. http://doi.org/10.1177/0309132510374250","paperID":"None"},{"content":"Matt Flegenheimer. 2014. Suit Seeks to Make Sidewalks More Accessible for Disabled NYers (Viewed Nov 2014). NY Times. http://www.nytimes.com/2014/07/31/nyregion/groupsues-new-york-city-for-upgrades-to-sidewalks.html","paperID":"None"},{"content":"DionHoe-Lian Goh, LouisianaLiman Sepoetro, Ma Qi, et al. 2007. Mobile Tagging and Accessibility Information Sharing Using a Geospatial Digital Library. In Asian Digital Libraries. Looking Back 10 Years and Forging New Frontiers SE - 38. Springer Berlin Heidelberg, 287--296. http://doi.org/10.1007/978--3--540--77094--7_38","paperID":"None"},{"content":"David B Gray, Mary Gould, and Jerome E Bickenbach. 2003. Environmental barriers and disability. Journal of architectural and planning research 20, 1: 29--37.","paperID":"None"},{"content":"Richard Guy and Khai Truong. 2012. CrossingGuard: exploring information content in navigation aids for visually impaired pedestrians. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), ACM, 405--414. http://doi.org/10.1145/2207676.2207733","paperID":"None"},{"content":"Kotaro Hara, Shiri Azenkot, Megan Campbell, et al. 2013. Improving Public Transit Accessibility for Blind Riders by Crowdsourcing Bus Stop Landmark Locations with Google Street View. Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility Technology, 16:1--16:8.","paperID":"None"},{"content":"Kotaro Hara, Victoria Le, and Jon Froehlich. 2013. Combining Crowdsourcing and Google Street View to Identify Street-level Accessibility Problems. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 631--640.","paperID":"None"},{"content":"Kotaro Hara, Jin Sun, David W Jacobs, and Jon E Froehlich. 2014. Tohme: Detecting Curb Ramps in Google Street View Using Crowdsourcing, Computer Vision, and Machine Learning. Proceedings of the 27th annual ACM symposium on User interface software and technology.","paperID":"None"},{"content":"Harald Holone, Gunnar Misund, and Hakon Holmstedt. 2007. Users Are Doing It For Themselves: Pedestrian Navigation With User Generated Content. The 2007 International Conference on Next Generation Mobile Applications, Services and Technologies (NGMAST 2007): 91--99. http://doi.org/10.1109/NGMAST.2007.4343406","paperID":"None"},{"content":"Daniel J Hruschka, Deborah Schwartz, Daphne Cobb St.John, Erin Picone-Decaro, Richard A Jenkins, and James W Carey. 2004. Reliability in Coding Open-Ended Data: Lessons Learned from HIV Behavioral Research. Field Methods 16 , 3 : 307--331. http://doi.org/10.1177/1525822X04266540","paperID":"None"},{"content":"Rob Imrie and Marion Kumar. 1998. Focusing on Disability and Access in the Built Environment. Disability & Society 13, 3: 357--374. http://doi.org/10.1080/09687599826687","paperID":"None"},{"content":"J A Landay and B A Myers. 2001. Sketching interfaces: toward more human interface design. Computer 34, 3: 56--64. http://doi.org/10.1109/2.910894","paperID":"None"},{"content":"J Richard Landis and Gary G Koch. 1977. The Measurement of Observer Agreement for Categorical Data. Biometrics 33, 1: 159--174. http://doi.org/10.2307/2529310","paperID":"None"},{"content":"Hugh Matthews, Linda Beale, Phil Picton, and David Briggs. 2003. Modelling Access with GIS in Urban Systems (MAGUS): capturing the experiences of wheelchair users. Area 35, 1: 34--45. http://doi.org/10.1111/1475--4762.00108","paperID":"None"},{"content":"C Menkens, J Sussmann, M Al-Ali, et al. 2011. EasyWheel - A Mobile Social Navigation and Support System for Wheelchair Users. Eighth International Conference on Information Technology: New Generations (ITNG), 2011, 859--866. http://doi.org/10.1109/ITNG.2011.149","paperID":"None"},{"content":"Allan R Meyers, Jennifer J Anderson, Donald R Miller, Kathy Shipp, and Helen Hoenig. 2002. Barriers, facilitators, and access for wheelchair users: substantive and methodologic lessons from a pilot study of environmental effects. Social Science & Medicine 55, 8. http://doi.org/10.1016/S0277--9536(01)00269--6","paperID":"None"},{"content":"Andrea Nuernberger. 2008. Presenting Accessibility to Mobility-Impaired Travelers (Ph.D. Thesis).","paperID":"None"},{"content":"Jonathan Raper, Georg Gartner, Hassan Karimi, and Chris Rizos. 2007. Applications of Location-based Services: A Selected Review. J. Locat. Based Serv. 1, 2: 89--111. http://doi.org/10.1080/17489720701862184","paperID":"None"},{"content":"Marc Rettig. 1994. Prototyping for Tiny Fingers. Commun. ACM 37, 4: 21--27. http://doi.org/10.1145/175276.175288","paperID":"None"},{"content":"James H Rimmer, Barth Riley, Edward Wang, Amy Rauworth, and Janine Jurkowski. 2004. Physical activity participation among persons with disabilities: Barriers and facilitators. American Journal of Preventive Medicine 26, 5: 419--425. http://doi.org/10.1016/j.amepre.2004.02.002","paperID":"None"},{"content":"Mary Beth Rosson and John M Carroll. 2009. Scenario-Based Design. Human-computer interaction. Boca Raton","paperID":"None"},{"content":"Adam D Sobek and Harvey J Miller. 2006. U-Access: a web-based system for routing pedestrians of differing abilities. Journal of Geographical Systems 8, 3: 269--287.","paperID":"None"},{"content":"The GeoAccess Challenge Team. 2011. Data-Enabled Travel: How Geo-Data Can Support Inclusive Transportation, Tourism, and Navigation through Communities.","paperID":"None"},{"content":"Neela Thapar, Grace Warner, Mari-Lynn Drainoni, et al. 2004. A pilot study of functional access to public buildings and facilities for persons with impairments. Disability and Rehabilitation 26, 5: 280--289. http://doi.org/10.1080/09638280310001649543","paperID":"None"},{"content":"Maryam Tohidi, William Buxton, Ronald Baecker, and Abigail Sellen. 2006. User Sketches: A Quick, Inexpensive, and Effective Way to Elicit More Reflective User Feedback. Proceedings of the 4th Nordic Conference on Human-computer Interaction: Changing Roles, ACM, 105--114. http://doi.org/10.1145/1182475.1182487","paperID":"None"},{"content":"Japan Ministry of Land Infrastructure Transport and Tourism. 2014. The Guidelines for Installing Services to Support Pedestrian Mobility. http://www.mlit.go.jp/common/001042305.pdf","paperID":"None"},{"content":"Federal Highway Administration U.S. Department of Transportation. 2011. Technological Innovations in Transportation for People with Disabilities.","paperID":"None"},{"content":"Federal Highway Administration U.S. Department of Transportation. 2015. Request For Information DTFH6115RI00008.","paperID":"None"},{"content":"United States Access Board. 2011. Proposed Accessibility Guidelines for Pedestrian Facilities in the Public Right-of-Way. http://www.accessboard.gov/attachments/article/743/nprm.pdf","paperID":"None"},{"content":"Civil Rights Division United States Department of Justice. ADA Guide for Small Businesses.","paperID":"None"},{"content":"Civil Rights Division United States Department of Justice. Wheelchairs, Mobility Aids, and Other Power-Driven Mobility Devices.","paperID":"None"},{"content":"Civil Rights Division United States Department of Justice. 1990. Americans with Disabilities Act of 1990, Pub. L. No. 101--336, 104 Stat. 328.","paperID":"None"},{"content":"United States Department of Justice. 2010. 2010 ADA Standards for Accessible Design.","paperID":"None"},{"content":"John Vines, Peter C Wright, David Silver, Maggie Winchcombe, and Patrick Olivier. 2015. Authenticity, Relatability and Collaborative Approaches to Sharing Knowledge About Assistive Living Technology. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 82--94. http://doi.org/10.1145/2675133.2675222","paperID":"None"},{"content":"Thorsten Völkel and Gerhard Weber. 2008. RouteCheckr: Personalized Multicriteria Routing for Mobility Impaired Pedestrians. Proceedings of the 10th International ACM SIGACCESS Conference on Computers and Accessibility, ACM, 185--192. http://doi.org/10.1145/1414471.1414506","paperID":"None"},{"content":"Richard Y Wang and Diane M Strong. 1996. Beyond Accuracy: What Data Quality Means to Data Consumers. Journal of Management Information Systems 12, 4: 5--33. http://doi.org/10.2307/40398176","paperID":"None"},{"content":"Wheelmap (Viewed Sept 2015). http://wheelmap.org/en/","paperID":"None"},{"content":"AXSMAP (Viewed Sept 2015). http://www.axsmap.com/","paperID":"None"},{"content":"Handimap http://www.handimap.org/ (Viewed 2014).","paperID":"None"},{"content":"Yelp (Viewed Sept 2015). http://www.yelp.com/","paperID":"None"},{"content":"TripAdvisor (Viewed Sept 2015). http://www.tripadvisor.com/","paperID":"None"},{"content":"Walk Score. https://www.walkscore.com/methodology.shtml","paperID":"None"},{"content":"Planet Labs. https://www.planet.com/","paperID":"None"},{"content":"Placemeter. https://www.placemeter.com/","paperID":"None"},{"content":"2011. San Francisco Municipal Transportation -- Case Study. http://www.lytx.com/our-markets/fleet/case-studysan-francisco-municipal-transportation-agency","paperID":"None"}],"title":"The Design of Assistive Location-based Technologies for People with Ambulatory Disabilities: A Formative Study","filename":"CHI16/p1757","authors":["Kotaro Hara","Christine Chan","Jon E. Froehlich"],"conference":"CHI '16"}