{"paperId":2858084,"citation":[],"reference":[{"content":"Works with Google Cardboard Guidelines and Best Practices, http://static.googleusercontent.com/ media/www.google.com/en//get/cardboard/ downloads/wwgc_best_practices.pdf. (September 2015).","paperID":"None"},{"content":"2012. New York Times, \"Exergames\" Don't Make Children Fitter, http://parenting.blogs.nytimes.com/2012/06/25/ exergames-dont-make-children-more-fit/. (June 2012).","paperID":"None"},{"content":"2014. Oculus Best Practices: Health and Safety Warnings, https://developer.oculus.com/documentation/ intro-vr/latest/concepts/bp_app_health/. (January 2014).","paperID":"None"},{"content":"2015. Tuscany Demo, http://play.google.com/store/apps/details?id= com.FabulousPixel.TuscanyDive. (August 2015).","paperID":"None"},{"content":"Ilias Apostolopoulos, Daniel S. Coming, and Eelke Folmer. 2015. Accuracy of Pedometry on a Head-mounted Display. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2153--2156. DOI: http://dx.doi.org/10.1145/2702123.2702143","paperID":"None"},{"content":"Doug Bowman, David Koller, Larry F Hodges, and others. 1997. Travel in immersive virtual environments: An evaluation of viewpoint motion control techniques. In Virtual Reality Annual International Symposium, 1997., IEEE 1997. IEEE, 45--52.","paperID":"None"},{"content":"Doug A Bowman, Ernst Kruijff, Joseph J LaViola Jr, and Ivan Poupyrev. 2004. 3D user interfaces: theory and practice. Addison-Wesley.","paperID":"None"},{"content":"Agata Brajdic and Robert Harle. 2013. Walk Detection and Step Counting on Unconstrained Smartphones. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 225--234. DOI:http://dx.doi.org/10.1145/2493432.2493449","paperID":"None"},{"content":"Rudolph P Darken, William R Cockayne, and David Carmein. 1997. The omni-directional treadmill: a locomotion device for virtual worlds. In Proceedings of the 10th annual ACM symposium on User interface software and technology. ACM, 213--221.","paperID":"None"},{"content":"David Dobbelstein, Philipp Hock, and Enrico Rukzio. 2015. Belt: An Unobtrusive Touch Input Device for Head-worn Displays. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2135--2138.","paperID":"None"},{"content":"Jeff Feasel, Mary C. Whitton, and Jeremy D. Wendt. 2008. LLCM-WIP: Low-Latency, Continuous-Motion Walking-in-Place. In Proceedings of the 2008 IEEE Symposium on 3D User Interfaces (3DUI '08). IEEE Computer Society, Washington, DC, USA, 97--104. DOI:http://dx.doi.org/10.1109/3DUI.2008.4476598","paperID":"None"},{"content":"Randal C Foster, Lorraine M Lanningham-Foster, Chinmay Manohar, and et al. 2005. Precision and accuracy of an ankle-worn accelerometer-based pedometer in step counting and energy expenditure. Prev Med 41, 3-4 (2005), 778--83. DOI: http://dx.doi.org/10.1016/j.ypmed.2005.07.006","paperID":"None"},{"content":"Beverly K Jaeger and Ronald R Mourant. 2001. Comparison of simulator sickness using static and dynamic walking simulators. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 45. SAGE Publications, 1896--1900.","paperID":"None"},{"content":"Ji-Sun Kim, Denis Gračanin, and Francis Quek. 2012. Sensor-fusion walking-in-place interaction technique using mobile devices. In Virtual Reality Short Papers and Posters (VRW), 2012 IEEE. IEEE, 39--42.","paperID":"None"},{"content":"William B Lathrop and Mary K Kaiser. 2002. Perceived orientation in physical and virtual environments: changes in perceived orientation as a function of idiothetic information available. Presence 11, 1 (2002), 19--32.","paperID":"None"},{"content":"Catherine G Ling and Sheila O Smith. 2010. Alternative placements for women wearing pedometers. J Am Acad Nurse Pract 22, 5 (May 2010), 264--9. DOI: http://dx.doi.org/10.1111/j.1745-7599.2010.00502.x","paperID":"None"},{"content":"Michael Meehan, Sharif Razzaque, Mary C Whitton, and Frederick P Brooks Jr. 2003. Effect of latency on presence in stressful virtual environments. In Virtual Reality, 2003. Proceedings. IEEE. IEEE, 141--148.","paperID":"None"},{"content":"Florian 'Floyd' Mueller, Martin R. Gibbs, and Frank Vetere. 2008. Taxonomy of exertion games. In OZCHI '08: Proceedings of the 20th Australasian Conference on Computer-Human Interaction. ACM, New York, NY, USA, 263--266. DOI: http://dx.doi.org/10.1145/1517744.1517772","paperID":"None"},{"content":"Noah Nelson. 2015. NPR - All Tech Considered Virtual Reality's Next Hurdle: Overcoming 'Sim Sickness; http://www.npr.org/sections/alltechconsidered/2014/08/05/338015854/virtualrealitys-next-hurdle-overcoming-sim-sickness. (August 2015).","paperID":"None"},{"content":"Nicolaos Papazoglou, Panayotis Loussidis, Andreas Giannoulopoulos, and et al. 1991. Comparison of respiratory response of jogging in place and Bruce treadmill exercise test. Clinical cardiology 14, 11 (1991), 913--916.","paperID":"None"},{"content":"Patrick Péruch, Loïc Belingard, and Catherine Thinus-Blanc. 2000. Transfer of spatial knowledge from virtual to real environments. In Spatial Cognition II. Springer, 253--264.","paperID":"None"},{"content":"Sharif Razzaque, David Swapp, Mel Slater, and et al. 2002. Redirected walking in place. In ACM International Conference Proceeding Series, Vol. 23. 123--130.","paperID":"None"},{"content":"Bernhard E. Riecke, Bobby Bodenheimer, Timothy P. McNamara, andet al. 2010. Do We Need to Walk for Effective Virtual Reality Navigation? Physical Rotations Alone May Suffice. In Proceedings of the 7th International Conference on Spatial Cognition (SC'10). Springer-Verlag, Berlin, Heidelberg, 234--247. http://dl.acm.org/citation.cfm?id=1887093.1887121","paperID":"None"},{"content":"Mel Slater, Martin Usoh, and Anthony Steed. 1994. Steps and ladders in virtual reality. In Proceedings of the ACM Conference on Virtual Reality Software and Technology. World Scientific, 45--54.","paperID":"None"},{"content":"Mel Slater, Martin Usoh, and Anthony Steed. 1995. Taking steps: the influence of a walking technique on presence in virtual reality. ACM Transactions on Computer-Human Interaction (TOCHI) 2, 3 (1995), 201--219.","paperID":"None"},{"content":"James Templeman, Patricia S. Denbrook, and Linda E. Sibert. 1999. Virtual Locomotion: Walking in Place through Virtual Environments. Presence 8, 6 (Dec 1999), 598--617. DOI: http://dx.doi.org/10.1162/105474699566512","paperID":"None"},{"content":"Léo Terziman, Maud Marchal, Mathieu Emily, and et al. 2010. Shake-your-head: Revisiting walking-in-place for desktop virtual reality. In Proceedings of the 17th ACM Symposium on Virtual Reality Software and Technology. ACM, 27--34.","paperID":"None"},{"content":"Léo Terziman, Maud Marchal, Franck Multon, and Anatole Lécuyer. 2011. Comparing virtual trajectories made in slalom using walking-in-place and joystick techniques. In EuroVR/EGVE Joint Virtual Reality Conference. Eurographics.","paperID":"None"},{"content":"Michel Treisman. 1977. Motion sickness: an evolutionary hypothesis. Science 197, 4302 (1977), 493--495.","paperID":"None"},{"content":"Martin Usoh, Kevin Arthur, Mary C Whitton, andet al. 1999 Walking > walking-in-place > flying, in virtual environments. In Proceedings of the 26th annual conference on Computer graphics and interactive techniques. ACM Press/Addison-Wesley Publishing Co., 359--364.","paperID":"None"},{"content":"Mark Ward, Ronald Azuma, Robert Bennett, and et al. 1992. A demonstrated optical tracker with scalable work area for head-mounted display systems. In Proceedings of the 1992 symposium on Interactive 3D graphics. ACM, 43--52.","paperID":"None"},{"content":"Jeremy D Wendt, Mary C Whitton, and Frederick P Brooks Jr. 2010. Gud wip: Gait-understanding-driven walking-in-place. In Virtual Reality Conference (VR), 2010 IEEE. IEEE, 51--58.","paperID":"None"},{"content":"Betsy Williams, Stephen Bailey, Gayathri Narasimham, andet al. 2011. Evaluation of Walking in Place on a Wii Balance Board to Explore a Virtual Environment. ACM Trans. Appl. Percept. 8, 3, Article 19 (Aug. 2011), 14 pages. DOI: http://dx.doi.org/10.1145/2010325.2010329","paperID":"None"},{"content":"Preston Tunnell Wilson, Kevin Nguyen, Alyssa Harris, and Betsy Williams. 2014. Walking in place using the Microsoft Kinect to explore a large VE. In Proceedings of the 13th ACM SIGGRAPH International Conference on Virtual-Reality Continuum and its Applications in Industry. ACM, 27--33.","paperID":"None"},{"content":"Neil Zhao. 2010. Full-featured pedometer design realized with 3-Axis digital accelerometer. Analog Dialogue 44, 06 (2010).","paperID":"None"}],"abstract":"Low-cost smartphone adapters can bring virtual reality to the masses, but input is typically limited to using head tracking, which makes it difficult to perform complex tasks like navigation. Walking-in-place (WIP) offers a natural and immersive form of virtual locomotion that can reduce simulation sickness. WIP, however, is difficult to implement in mobile contexts as it typically relies on bulky controllers or an external camera. We present VR-STEP; a WIP implementation that uses real-time pedometry to implement virtual locomotion. VR-STEP requires no additional instrumentation outside of a smartphone's inertial sensors. A user study with 18 users compares VR-STEP with a commonly used auto-walk navigation method and finds no significant difference in performance or reliability, though VR-STEP was found to be more immersive and intuitive.","title":"VR-STEP: Walking-in-Place using Inertial Sensing for Hands Free Navigation in Mobile VR Environments","filename":"CHI16/p1250","authors":["Sam Tregillus","Eelke Folmer"],"conference":"CHI '16"}