{"paperId":2858424,"reference":[{"content":"Philip E. Agre. 1997. Computation and Human Experience. Cambridge University Press, NY, NY, USA.","paperID":"None"},{"content":"Catherine Bell (2010) Ritual: Perspectives and Dimensions. Oxford University Press","paperID":"None"},{"content":"Laurens Boer and Jared Donovan. 2012. Provotypes for participatory innovation. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 388--397. http://doi.acm.org/10.1145/2317956.2318014","paperID":"None"},{"content":"John Bowers. 2012. The logic of annotated portfolios: communicating the value of 'research through design'. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 6877. http://doi.acm.org/10.1145/2317956.2317968","paperID":"None"},{"content":"Case, D. 1996. Contributions of Journeys Away to the Definition of Home: An Empirical Study of a Dialectical Process. Journal of Environmental Psychology. 16, 1--15","paperID":"None"},{"content":"Manuel Castells. 2000. The Rise of the Network Society (2nd ed.). Blackwell Publishers, Inc., Cambridge, MA, USA.","paperID":"None"},{"content":"Deborah Chambers (2012) A Sociology of Family Life. Polity","paperID":"None"},{"content":"David Chatting, David S. Kirk, Paulina Yurman, and Jo-Anne Bichard. 2015. Designing for family phatic communication: a design critique approach. In Proceedings of the 2015 British HCI Conference (British HCI '15). ACM, NY, NY, USA, 175--183. http://dx.doi.org/10.1145/2783446.2783566","paperID":"None"},{"content":"Andy Crabtree, Richard Mortier, Tom Rodden, and Peter Tolmie. (2012). Unremarkable networking: the home network as a part of everyday life. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 554--563. http://doi.acm.org/10.1145/2317956.2318039","paperID":"None"},{"content":"John Durham Peters (1999) Speaking into the Air. University of Chicago Press","paperID":"None"},{"content":"Anthony Elliott and John Urry (2010) Mobile Lives. London: Routledge","paperID":"None"},{"content":"Kathleen E. Finn, Abigail J. Sellen and Sylvia B. Wilbur (Eds.). 1997. Video-Mediated Communication. A. L. Erlbaum Assoc. Inc., Hillsdale, NJ, USA.","paperID":"None"},{"content":"Rowanne Fleck, Anna L. Cox, and Rosalyn A.V. Robison. 2015. Balancing Boundaries: Using Multiple Devices to Manage Work-Life Balance. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3985--3988. http://doi.acm.org/10.1145/2702123.2702386","paperID":"None"},{"content":"Christopher Frayling (1993) Research in art and design. Royal College of Art Research Papers, Vol. 1, No. 1, 1993/4.","paperID":"None"},{"content":"William Gaver. 2011. Making spaces: how design workbooks work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1551--1560. http://doi.acm.org/10.1145/1978942.1979169","paperID":"None"},{"content":"William Gaver. 2012. What should we expect from research through design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 937946. http://doi.acm.org/10.1145/2207676.2208538","paperID":"None"},{"content":"William Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural probes. interactions 6, 1 (January 1999), 21--29. http://doi.acm.org/10.1145/291224.291235","paperID":"None"},{"content":"Martin R. Gibbs, Frank Vetere, Marcus Bunyan, and Steve Howard. 2005. SynchroMate: a phatic technology for mediating intimacy. In Proceedings of the 2005 conference on Designing for User eXperience (DUX '05). AIGA: American Institute of Graphic Arts, NY, NY, USA, Article 37","paperID":"None"},{"content":"Connor Graham, Mark Rouncefield, Martin Gibbs, Frank Vetere, and Keith Cheverst. 2007. How probes work. In Proceedings of the 19th Australasian conference on Computer-Human Interaction: Entertaining User Interfaces (OZCHI '07). ACM, NY, NY, USA, 29--37. http://doi.acm.org/10.1145/1324892.1324899","paperID":"None"},{"content":"Marianne Graves Petersen, Aviaja Borup Lynggaard, Peter Gall Krogh, and Ida Wentzel Winther. 2010. Tactics for homing in mobile life: a fieldwalk study of extremely mobile people. In Proceedings of the 12th international conference on Human computer interaction with mobile devices and services (MobileHCI '10). ACM, NY, NY, USA, 265--274. http://dx.doi.org/10.1145/1851600.1851646","paperID":"None"},{"content":"Rebecca E. Grinter, W. Keith Edwards, Mark W. Newman, and Nicolas Ducheneaut. 2005. The work to make a home network work. In Proceedings of the ninth conference on European Conference on Computer Supported Cooperative Work (ECSCW'05), Hans Gellersen, Kjeld Schmidt, Michel Beaudouin-Lafon, and Wendy Mackay (Eds.). Springer-Verlag NY, Inc., NY, NY, USA, 469--488.","paperID":"None"},{"content":"Lars Hallnäs and Johan Redström. 2001. Slow Technology -- Designing for Reflection. Personal Ubiquitous Comput. 5, 3 (January 2001), 201--212. http://dx.doi.org/10.1007/PL00000019","paperID":"None"},{"content":"Richard Harper. 2003. Inside the Smart House. Springer-Verlag NY, Inc., Secaucus, NJ, USA.","paperID":"None"},{"content":"Richard Harper. 2011. The Connected Home: The Future of Domestic Life. Springer Publishing Company, Incorporated.","paperID":"None"},{"content":"Marc Hassenzahl, Stephanie Heidecker, Kai Eckoldt, Sarah Diefenbach, and Uwe Hillmann. 2012. All You Need is Love: Current Strategies of Mediating Intimate Relationships through Technology. ACM Trans. Comput.-Hum. Interact. 19, 4, Article 30 (December 2012), 19 pages. http://doi.acm.org/10.1145/2395131.2395137","paperID":"None"},{"content":"Heather Hofmeister. 2005. Geographic mobility of couples in the USA: Relocation and commuting trends. Zetschrift fur Familienforschung. 2, 115128.","paperID":"None"},{"content":"Tejinder Judge, Carman Neustaedter (2015) Studying and Designing Technology for Domestic Life: Lessons from Home. Morgan Kaufmann","paperID":"None"},{"content":"Vincent Kaufmann and Gil Viry. (2015) High Mobility as Social Phenomenon. In Kaufmann and Viry (Eds) High Mobility in Europe. London: Palgrave Macmillan","paperID":"None"},{"content":"Konstantinos Kazakos. 2013. Understanding the role of technology in parent-child reunion. In Proceedings of the 2013 conference on Computer supported cooperative work companion (CSCW '13). ACM, NY, NY, USA, 61--64. http://doi.acm.org/10.1145/2441955.2441972","paperID":"None"},{"content":"David S. Kirk and Abigail Sellen. 2010. On human remains: Values and practice in the home archiving of cherished objects. ACM Trans. Comput.-Hum. Interact. 17, 3, Article 10 (July 2010), 43 pages. http://doi.acm.org/10.1145/1806923.1806924","paperID":"None"},{"content":"Mike Kuniavsky (2010) Smart Things: Ubiquitous Computing User Experience Design. Morgan Kaufmann","paperID":"None"},{"content":"Chia-Hsun Jackie Lee and Hyemin Chung. 2006. Lover's cups: connecting you and your love one. In ACM SIGGRAPH 2006 Research posters (SIGGRAPH '06). ACM, NY, NY, USA, , Article 137 . http://doi.acm.org/10.1145/1179622.1179781","paperID":"None"},{"content":"Nicholas Negroponte (1999). Being Digital. NY: Knopf","paperID":"None"},{"content":"Nippert-Eng, C. E. (1996) Home and Work: Negotiating Boundaries through Everyday Life. University of Chicago Press","paperID":"None"},{"content":"Jon O'Brien, Tom Rodden, Mark Rouncefield, and John Hughes. 1999. At home with the technology: an ethnographic study of a set-top-box trial. ACM Trans. Comput.-Hum. Interact. 6, 3 (September 1999), 282308. http://doi.acm.org/10.1145/329693.329698","paperID":"None"},{"content":"William T. Odom, Abigail J. Sellen, Richard Banks, David S. Kirk, Tim Regan, Mark Selby, Jodi L. Forlizzi, and John Zimmerman. 2014. Designing for slowness, anticipation and re-visitation: a long term field study of the photobox. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 1961--1970. http://doi.acm.org/10.1145/2556288.2557178","paperID":"None"},{"content":"Yasin Ozcelik. 2010. The rise of teleworking in the USA \\&\\58; key issues for managers in the information age. Int. J. Bus. Inf. Syst. 5, 3 (March 2010), 211--229. http://dx.doi.org/10.1504/IJBIS.2010.031927","paperID":"None"},{"content":"Daniela Petrelli, Simon Bowen, Nick Dulake, and Ann Light. 2012. Digital Christmas: an exploration of festive technology. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 348--357. DOI=10.1145/2317956.2318009 http://doi.acm.org/10.1145/2317956.2318009","paperID":"None"},{"content":"James Pierce, Phoebe Sengers, Tad Hirsch, Tom Jenkins, William Gaver, and Carl DiSalvo. 2015. Expanding and Refining Design and Criticality in HCI. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2083--2092. http://doi.acm.org/10.1145/2702123.2702438","paperID":"None"},{"content":"Matt Ratto. 2011. Critical Making: Conceptual and Material Studies in Technology and Social Life. The Information Society 27, 4 (July 2011), 252--260. http://dx.doi.org/10.1080/01972243.2011.583819","paperID":"None"},{"content":"Jennifer A. Rode. 2010. The roles that make the domestic work. In Proceedings of the 2010 ACM conference on Computer supported cooperative work (CSCW '10). ACM, NY, NY, USA, 381--390. http://doi.acm.org/10.1145/1718918.1718984","paperID":"None"},{"content":"Claire Rowland, Elizabeth Goodman, Martin Charlier, Ann Light, Alfred Lui (2015) Designing Connected Products: UX for the Consumer Internet of Things. O'Reilly.","paperID":"None"},{"content":"Christine Salazar. 2001. Building boundaries and negotiating work at home. In Proceedings of the 2001 International ACM SIGGROUP Conference on Supporting Group Work (GROUP '01), Clarence (Skip) Ellis and Ilze Zigurs (Eds.). ACM, NY, NY, USA, 162--170. http://doi.acm.org/10.1145/500286.500311","paperID":"None"},{"content":"Ruth Schwartz Cohen (1983) More Work For Mother: The Ironies Of Household Technology From The Open Hearth To The Microwave. Basic Books, NY, NY.","paperID":"None"},{"content":"Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility (CC '05), Olav W. Bertelsen, Niels Olof Bouvin, Peter G. Krogh, and Morten Kyng (Eds.). ACM, NY, NY, USA, 49--58. http://doi.acm.org/10.1145/1094562.1094569","paperID":"None"},{"content":"Alex S. Taylor and Laurel Swan. 2005. Artful systems in the home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 641--650. http://doi.acm.org/10.1145/1054972.1055060","paperID":"None"},{"content":"Peter Tolmie, Andy Crabtree, Stefan Egglestone, Jan Humble, Chris Greenhalgh, and Tom Rodden. 2010. Digital plumbing: the mundane work of deploying UbiComp in the home. Personal Ubiquitous Comput. 14, 3 (April 2010), 181--196. http://dx.doi.org/10.1007/s00779-009-0260--5","paperID":"None"},{"content":"48. Urry, J. (2007) Mobilities. Polity Press","paperID":"None"},{"content":"Frank Vetere, Hilary Davis, Martin Gibbs, and Steve Howard. 2009. The Magic Box and Collage: Responding to the challenge of distributed intergenerational play. Int. J. Hum.-Comput. Stud. 67, 2 (February 2009), 165--178. http://dx.doi.org/10.1016/j.ijhcs.2008.09.004","paperID":"None"},{"content":"Jayne Wallace, Joyce S.R. Yee, and Abigail Durrant. 2014. Reflections on a synergistic format for disseminating research through design. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 781--792. http://doi.acm.org/10.1145/2559206.2578865","paperID":"None"},{"content":"Allison Woodruff, Sally Augustin, and Brooke Foucault. 2007. Sabbath day home automation: \"it's like mixing technology and religion\". In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 527536. http://doi.acm.org/10.1145/1240624.1240710","paperID":"None"},{"content":"Steven Wolin and Linda Bennett (1984) Family Rituals. Family Process Journal, 23, 3","paperID":"None"}],"abstract":"Changing patterns of both work-related mobility and do-mestic arrangements mean that 'mobile workers' face chal-lenges to support and engage in family life whilst travelling for work. Phatic devices offer some potential to provide connection at a distance alongside existing communications infrastructure. Through a bespoke design process, incorpo-rating phases of design ethnography, critical technical prac-tice and provotyping we have developed Ritual Machines I and II as material explorations of mobile workers' lives and practices. In doing this we sought to reflect upon the prac-tices through which families accomplish mobile living, the values they place in technology for doing 'family' at a distance and to draw insights in to the potential roles of digital technology in supporting them. We frame the design of our phatic devices in discussion of processes of bespoke design, offer advice on supporting mobile workers when travelling and articulate the values of making a technology at home when designing for domestic and mobile settings.","citation":[],"title":"Ritual Machines I & II: Making Technology at Home","filename":"CHI16/p2474","authors":["David S. Kirk","David Chatting","Paulina Yurman","Jo-Anne Bichard"],"conference":"CHI '16"}