{"paperId":2858346,"citation":[],"abstract":"Nudging behaviors through user interface design is a practice that is well-studied in HCI research. Corporations often use this knowledge to modify online interfaces to influence user information disclosure. In this paper, we experimentally test the impact of a norm-shaping design patterns on information divulging behavior. We show that (1) a set of images, biased toward more revealing figures, change subjects' personal views of appropriate information to share; (2) that shifts in perceptions significantly increases the probability that a subject divulges personal information; and (3) that these shift also increases the probability that the subject advises others to do so. Our main contribution is empirically identifying a key mechanism by which norm-shaping designs can change beliefs and subsequent disclosure behaviors.","reference":[{"content":"Alessandro Acquisti. 2004. Privacy in Electronic Commerce and the Economics of Immediate Gratification. In Proceedings of the 5th ACM Conference on Electronic Commerce (EC '04). ACM, NY, NY, USA, 21--29. DOI: http://dx.doi.org/10.1145/988772.988777","paperID":"None"},{"content":"Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2015. Privacy and human behavior in the age of information. Science 347, 6221 (2015), 509--514. DOI: http://dx.doi.org/10.1126/science.aaa1465","paperID":"None"},{"content":"Alessandro Acquisti and Ralph Gross. 2006. Imagined communities: Awareness, information sharing, and privacy on the Facebook. In Privacy Enhancing Technologies. Springer, 36--58.","paperID":"None"},{"content":"Alessandro Acquisti and Ralph Gross. 2009. Predicting Social Security numbers from public data. Proceedings of the National Academy of Sciences 106, 27 (2009), 10975--10980.","paperID":"None"},{"content":"Alessandro Acquisti and Jens Grossklags. 2005. Privacy and rationality in individual decision making. IEEE Security & Privacy 1 (2005), 26--33.","paperID":"None"},{"content":"Alessandro Acquisti, Leslie K. John, and George Loewenstein. 2012. The impact of relative standards on the propensity to disclose. Journal of Marketing Research 49, 2 (2012), 160--174.","paperID":"None"},{"content":"Eytan Adar, Desney S. Tan, and Jaime Teevan. 2013. Benevolent Deception in Human Computer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1863--1872. DOI: http://dx.doi.org/10.1145/2470654.2466246","paperID":"None"},{"content":"Solomon E. Asch. 1956. Studies of independence and conformity: A minority of one against a unanimous majority. Psychological Monographs: General and Applied 70, 9 (1956), 1--70.","paperID":"None"},{"content":"Oriana Bandiera, Iwan Barankay, and Imran Rasul. 2005. Social Preferences and the Response to Incentives: Evidence from Personnel Data. The Quarterly Journal of Economics 120, 3 (2005), 917--962. DOI: http://dx.doi.org/10.1093/qje/120.3.917","paperID":"None"},{"content":"Nicholas Bardsley and Rupert Sausgruber. 2005. Conformity and reciprocity in public good provision. Journal of Economic Psychology 26, 5 (2005), 664--681.","paperID":"None"},{"content":"danah boyd and Eszter Hargittai. 2010. Facebook privacy settings: Who cares? First Monday 15, 8 (2010). http://firstmonday.org/ojs/index.php/fm/article/view/3086","paperID":"None"},{"content":"Robert B. Cialdini, Raymond R. Reno, and Carl A. Kallgren. 1990. A focus theory of normative conduct: recycling the concept of norms to reduce littering in public places. Journal of Personality and Social Psychology 58, 6 (1990), 1015.","paperID":"None"},{"content":"Gregory Conti and Edward Sobiesk. 2010. Malicious Interface Design: Exploiting the User. In Proceedings of the 19th International Conference on World Wide Web (WWW '10). ACM, NY, NY, USA, 271--280. DOI: http://dx.doi.org/10.1145/1772690.1772719","paperID":"None"},{"content":"Christian Crumlish and Erin Malone. 2009. Designing social interfaces: Principles, patterns, and practices for improving the user experience. \" O'Reilly Media, Inc.\".","paperID":"None"},{"content":"Bernhard Debatin, Jennette P. Lovejoy, Ann-Kathrin Horn, and Brittany N. Hughes. 2009. Facebook and Online Privacy: Attitudes, Behaviors, and Unintended Consequences. Journal of Computer-Mediated Communication 15, 1 (2009), 83--108. DOI: http://dx.doi.org/10.1111/j.1083--6101.2009.01494.x","paperID":"None"},{"content":"Morton Deutsch and Harold B. Gerard. 1955. A study of normative and informational social influences upon individual judgment. The Journal of Abnormal and Social Psychology 51, 3 (1955), 629.","paperID":"None"},{"content":"Simon Gächter and Elke Renner. 2003. Leading by example in the presence of free rider incentives. Technical Report. University of St. Gallen.","paperID":"None"},{"content":"F. Maxwell Harper, Yan Chen, Joseph Konstan, and Sherry Xin Li. 2010. Social comparisons and contributions to online communities: A field experiment on movielens. The American economic review (2010), 1358--1398.","paperID":"None"},{"content":"Bart P. Knijnenburg and Alfred Kobsa. 2013. Helping Users with Information Disclosure Decisions: Potential for Adaptation. In Proceedings of the 2013 International Conference on Intelligent User Interfaces (IUI '13). ACM, NY, NY, USA, 407--416. DOI: http://dx.doi.org/10.1145/2449396.2449448","paperID":"None"},{"content":"Bart Piet Knijnenburg, Alfred Kobsa, and Hongxia Jin. 2013. Counteracting the negative effect of form auto-completion on the privacy calculus. (2013).","paperID":"None"},{"content":"Robert E. Kraut, Paul Resnick, and Sara Kiesler. 2012. Evidence-based social design: Mining the social sciences to build online communities. MIT Press.","paperID":"None"},{"content":"Erin Krupka, Steve Leider, and Ming Jiang. 2015. A meeting of the minds: informal agreements and social norms. Working paper. University of Michigan.","paperID":"None"},{"content":"Erin Krupka and Roberto A. Weber. 2009. The focusing and informational effects of norms on pro-social behavior. Journal of Economic Psychology 30, 3 (2009), 307--320.","paperID":"None"},{"content":"Erin L. Krupka and Roberto A. Weber. 2013. Identifying social norms using coordination games: Why does dictator game sharing vary? Journal of the European Economic Association 11, 3 (2013), 495--524.","paperID":"None"},{"content":"James E. Reinmuth and Michael D. Geurts. 1975. The collection of sensitive information using a two-stage, randomized response model. Journal of Marketing Research (1975), 402--407.","paperID":"None"},{"content":"Jen Shang and Rachel Croson. 2009. A Field Experiment in Charitable Contribution: The Impact of Social Information on the Voluntary Provision of Public Goods. The Economic Journal 119, 540 (2009), 1422--1439. DOI: http://dx.doi.org/10.1111/j.1468-0297.2009.02267.x","paperID":"None"},{"content":"Sarah Spiekermann, Jens Grossklags, and Bettina Berendt. 2001. E-privacy in 2nd generation E-commerce: privacy preferences versus actual behavior. In Proceedings of the 3rd ACM Conference on Electronic Commerce (EC '01). ACM, NY, NY, USA, 38--47. DOI: http://dx.doi.org/10.1145/501158.501163","paperID":"None"},{"content":"Fred Stutzman and Jacob Kramer-Duffield. 2010. Friends Only: Examining a Privacy-enhancing Behavior in Facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1553--1562. DOI: http://dx.doi.org/10.1145/1753326.1753559","paperID":"None"},{"content":"Fred Stutzman, Jessica Vitak, Nicole Ellison, Rebecca Gray, and Cliff Lampe. 2012. Privacy in Interaction: Exploring Disclosure and Social Capital in Facebook. In Proceedings of the International AAAI Conference on Web and Social Media. AAAI. http://www.aaai.org/ocs/index.php/ICWSM/ICWSM12/paper/view/4666","paperID":"None"},{"content":"Abhay Sukumaran, Stephanie Vezich, Melanie McHugh, and Clifford Nass. 2011. Normative influences on thoughtful online participation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3401--3410.","paperID":"None"},{"content":"Bob Tedeschi. 2012. E-commerce report; everybody talks about online privacy, but few do anything about it. (June 3 2012).","paperID":"None"},{"content":"Richard H. Thaler and Cass R. Sunstein. 2008. Nudge. Yale University Press.","paperID":"None"},{"content":"Roger Tourangeau and Ting Yan. 2007. Sensitive questions in surveys. Psychological bulletin 133, 5 (2007), 859.","paperID":"None"},{"content":"Janice Y. Tsai, Serge Egelman, Lorrie Cranor, and Alessandro Acquisti. 2011. The effect of online privacy information on purchasing behavior: An experimental study. Information Systems Research 22, 2 (2011), 254--268.","paperID":"None"},{"content":"Yang Wang, Pedro Giovanni Leon, Alessandro Acquisti, Lorrie Faith Cranor, Alain Forget, and Norman Sadeh. 2014. A Field Trial of Privacy Nudges for Facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2367--2376. DOI: http://dx.doi.org/10.1145/2556288.2557413","paperID":"None"},{"content":"Yang Wang, Pedro Giovanni Leon, Kevin Scott, Xiaoxuan Chen, Alessandro Acquisti, and Lorrie Faith Cranor. 2013. Privacy Nudges for Social Media: An Exploratory Facebook Study. In Proceedings of the 22Nd International Conference on World Wide Web Companion (WWW '13 Companion). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 763--770. http://dl.acm.org/citation.cfm?id=2487788.2488038","paperID":"None"},{"content":"Rick Wash. 2010. Folk Models of Home Computer Security. In Proceedings of the Sixth Symposium on Usable Privacy and Security (SOUPS '10). ACM, NY, NY, USA, Article 11, 16 pages. DOI: http://dx.doi.org/10.1145/1837110.1837125","paperID":"None"},{"content":"David B. Wiseman and Irwin P. Levin. 1996. Comparing risky decision making under conditions of real and hypothetical consequences. Organizational Behavior and Human Decision Processes 66, 3 (1996), 241--250.","paperID":"None"},{"content":"Sean D. Young and Alexander H. Jordan. 2013. The influence of social networking photos on social norms and sexual health behaviors. Cyberpsychology, Behavior, and Social Networking 16, 4 (2013), 243--247.","paperID":"None"}],"title":"Engineering Information Disclosure: Norm Shaping Designs","filename":"CHI16/p587","authors":["Daphne Chang","Erin L. Krupka","Eytan Adar","Alessandro Acquisti"],"conference":"CHI '16"}