{"paperId":2858394,"citation":[],"reference":[{"content":"Glen Anderson, Rita Doherty, and Subhashini Ganapathy. 2011. User Perception of Touch Screen Latency. In Proceedings of Design, User Experience, and Usability (DUXU '11). 195--202.","paperID":"None"},{"content":"Michelle Annett, Albert Ng, Paul Dietz, Walter F. Bischof, and Anoop Gupta. 2014. How Low Should We Go?: Understanding the Perception of Latency While Inking. In Proceedings of Graphics Interface 2014 (GI '14). Canadian Information Processing Society, Toronto, ON, Canada, 167--174. http://dl.acm.org/citation.cfm?id= 2619648.2619677","paperID":"None"},{"content":"Arduino. 2015. Arduino Due microcontroller board. (24 April 2015). Retrieved September 24, 2015 from https://www.arduino.cc/en/uploads/Main/arduino-Dueschematic.pdf.","paperID":"None"},{"content":"François Bérard and Renaud Blanch. 2013. Two Touch System Latency Estimators: High Accuracy and Low Overhead. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, NY, NY, USA, 241--250. DOI: http://dx.doi.org/10.1145/2512349.2512796","paperID":"None"},{"content":"Géry Casiez, Stéphane Conversy, Matthieu Falce, Stéphane Huot, and Nicolas Roussel. 2015. Looking through the Eye of the Mouse: A Simple Method for Measuring End-to-end Latency using an Optical Mouse. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15). ACM, NY, NY, USA, 629--636. DOI: http://dx.doi.org/10.1145/2807442.2807454","paperID":"None"},{"content":"Elie Cattan and Francois Bérard. 2015. A Predictive Approach for an End-to-End Touch-Latency Measurement. In Proceedings of the 2015 ACM International Conference on Interactive Tabletops and Surfaces (ITS '15). ACM, NY, NY, USA, 215--218. DOI: http://dx.doi.org/10.1145/2817721.2817747","paperID":"None"},{"content":"Jonathan Deber, Ricardo Jota, Clifton Forlines, and Daniel Wigdor. 2015. How Much Faster is Fast Enough?: User Perception of Latency & Latency Improvements in Direct and Indirect Touch. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1827--1836. DOI: http://dx.doi.org/10.1145/2702123.2702300","paperID":"None"},{"content":"Ricardo Jota, Albert Ng, Paul Dietz, and Daniel Wigdor. 2013. How Fast is Fast Enough?: A Study of the Effects of Latency in Direct-touch Pointing Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2291--2300. DOI: http://dx.doi.org/10.1145/2470654.2481317","paperID":"None"},{"content":"Topi Kaaresoja and Stephen Brewster. 2010. Feedback is... Late: Measuring Multimodal Delays in Mobile Device Touchscreen Interaction. In International Conference on Multimodal Interfaces and the Workshop on Machine Learning for Multimodal Interaction (ICMI-MLMI '10). ACM, NY, NY, USA, Article 2, 8 pages. DOI: http://dx.doi.org/10.1145/1891903.1891907","paperID":"None"},{"content":"Joseph J. LaViola. 2003. Double Exponential Smoothing: An Alternative to Kalman Filter-based Predictive Tracking. In Proceedings of the Workshop on Virtual Environments 2003 (EGVE'03). ACM, NY, NY, USA, 199--206. DOI: http://dx.doi.org/10.1145/769953.769976","paperID":"None"},{"content":"Darren Leigh, Clifton Forlines, Ricardo Jota, Steven Sanders, and Daniel Wigdor. 2014. High Rate, Lowlatency Multi-touch Sensing with Simultaneous Orthogonal Multiplexing. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 355--364. DOI: http://dx.doi.org/10.1145/2642918.2647353","paperID":"None"},{"content":"Jiandong Liang, Chris Shaw, and Mark Green. 1991. On Temporal-spatial Realism in the Virtual Reality Environment. In Proceedings of the 4th Annual ACM Symposium on User Interface Software and Technology (UIST '91). ACM, NY, NY, USA, 19--25. DOI: http://dx.doi.org/10.1145/120782.120784","paperID":"None"},{"content":"Robert B. Miller. 1968. Response Time in Mancomputer Conversational Transactions. In Proceedings of the December 9--11, 1968, Fall Joint Computer Conference, Part I (AFIPS '68 (Fall, part I)). ACM, NY, NY, USA, 267--277. DOI: http://dx.doi.org/10.1145/1476589.1476628","paperID":"None"},{"content":"Albert Ng, Michelle Annett, Paul Dietz, Anoop Gupta, and Walter F. Bischof. 2014. In the Blink of an Eye: Investigating Latency Perception During Stylus Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1103--1112. DOI: http://dx.doi.org/10.1145/2556288.2557037","paperID":"None"},{"content":"Albert Ng, Julian Lepinski, Daniel Wigdor, Steven Sanders, and Paul Dietz. 2012. Designing for Lowlatency Direct-touch Input. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, NY, NY, USA, 453--464. DOI: http://dx.doi.org/10.1145/2380116.2380174","paperID":"None"},{"content":"Ohmite. 2015. R2V-CT6--38E Heatsink. (2015). Retrieved September 24, 2015 from http://www.ohmite.com/cat/sink_r2.pdf.","paperID":"None"},{"content":"Omron. 2009. G6J-2P-Y Ultra-small and slim DPDTSMD Relay. (16 March 2009). Retrieved September 24, 2015 from http://www.omron.com/ecb/products/pdf/en-g6j_y.pdf.","paperID":"None"},{"content":"OptoFidelity. 2015. OptoFidelity WatchDog. (2015). Retrieved September 24, 2015 from http://www.optofidelity.com.","paperID":"None"},{"content":"Andriy Pavlovych and Wolfgang Stuerzlinger. 2009. The Tradeoff Between Spatial Jitter and Latency in Pointing Tasks. In Proceedings of the 1st ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '09). ACM, NY, NY, USA, 187--196. DOI: http://dx.doi.org/10.1145/1570433.1570469","paperID":"None"},{"content":"Vishay Semiconductors. 2014. BPW46 Silicon PIN Photodiode. (03 June 2014). Retrieved September 24, 2015 from http://www.vishay.com/docs/81524/bpw46.pdf.","paperID":"None"},{"content":"Anthony Steed. 2008. A Simple Method for Estimating the Latency of Interactive, Real-time Graphics Simulations. In Proceedings of the 2008 ACM Symposium on Virtual Reality Software and Technology (VRST '08). ACM, NY, NY, USA, 123--129. DOI: http://dx.doi.org/10.1145/1450579.1450606","paperID":"None"},{"content":"Colin Swindells, John C. Dill, and Kellogg S. Booth. 2000. System Lag Tests for Augmented and Virtual Environments. In Proceedings of the 13th Annual ACM Symposium on User Interface Software and Technology (UIST '00). ACM, NY, NY, USA, 161--170. DOI: http://dx.doi.org/10.1145/354401.354444","paperID":"None"},{"content":"William Thomson 1st Baron Kelvin. 1891. Electrical Units of Measurement. In Popular Lectures and Addresses Vol 1: Constitution of Matter. MacMillan and Co, London, UK, 80--81.","paperID":"None"},{"content":"Colin Ware and Ravin Balakrishnan. 1994. Reaching for Objects in VR Displays: Lag and Frame Rate. ACM Transactions on Computer-Human Interaction (TOCHI) 1, 4 (Dec. 1994), 331--356. DOI: http://dx.doi.org/10.1145/198425.198426","paperID":"None"},{"content":"Neng-Hao Yu, Li-Wei Chan, Seng Yong Lau, SungSheng Tsai, I-Chun Hsiao, Dian-Je Tsai, Fang-I Hsiao, Lung-Pan Cheng, Mike Chen, Polly Huang, and YiPing Hung. 2011. TUIC: enabling tangible interaction on capacitive multi-touch displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2995--3004. DOI: http://dx.doi.org/10.1145/1978942.1979386","paperID":"None"}],"abstract":"We report on the Latency Hammer, a low-cost yet highaccuracy and high-precision automated tool that measures the interface latency of touchscreen devices. The Hammer directly measures latency by triggering a capacitive touch event on a device using an electrically actuated touch simulator, and a photo sensor to monitor the screen for a visual response. This allows us to measure the full end-toend latency of a touchscreen system exactly as it would be experienced by a user. The Hammer does not require human interaction to perform a measurement, enabling the acquisition of large datasets. We present the operating principles of the Hammer, and discuss its design and construction; full design documents are available online. We also present a series of tools and equipment that were built to assess and validate the performance of the Hammer, and demonstrate that it provides reliable latency measurements.","title":"Hammer Time!: A Low-Cost, High Precision, High Accuracy Tool to Measure the Latency of Touchscreen Devices","filename":"CHI16/p2857","authors":["Jonathan Deber","Bruno Araujo","Ricardo Jota","Clifton Forlines","Darren Leigh","Steven Sanders","Daniel Wigdor"],"conference":"CHI '16"}