{"paperId":2858229,"citation":[],"abstract":"Developing motivational technology to support long-term behavior change is a challenge. A solution is to incorporate insights from behavior change theory and design technology to tailor to individual users. We carried out two studies to investigate whether the processes of change, from the Transtheoretical Model, can be effectively represented by motivational text messages. We crowdsourced peer-designed text messages and coded them into categories based on the processes of change. We evaluated whether people perceived messages tailored to their stage of change as motivating. We found that crowdsourcing is an effective method to design motivational messages. Our results indicate that different messages are perceived as motivating depending on the stage of behavior change a person is in. However, while motivational messages related to later stages of change were perceived as motivational for those stages, the motivational messages related to earlier stages of change were not. This indicates that a person's stage of change may not be the (only) key factor that determines behavior change. More individual factors need to be considered to design effective motivational technology.","reference":[{"content":"Johannes Brug, Mark Conner, Niki Harre, Stef Kremers, Susan McKellar, and Sandy Whitelaw. 2005. The Transtheoretical Model and stages of change: a critique Observations by five Commentators on the paper by Adams, J. and White, M.(2004) Why don't stage-based activity promotion interventions work? Health education research 20, 2 (2005), 244--258.","paperID":"None"},{"content":"C. Callison-Burch and M. Dredze. 2010. Creating speech and language data with Amazon's Mechanical Turk. In Proceedings of the NAACL HLT 2010 Workshop on Creating Speech and Language Data with Amazon's Mechanical Turk. 1--12.","paperID":"None"},{"content":"Heather Cole-Lewis and Trace Kershaw. 2010. Text messaging as a tool for behavior change in disease prevention and management. Epidemiologic reviews 32, 1 (April 2010), 56--69. DOI: http://dx.doi.org/10.1093/epirev/mxq004","paperID":"None"},{"content":"Heather L Coley, Rajani S Sadasivam, Jessica H Williams, Julie E Volkman, Yu-Mei Schoenberger, Connie L Kohler, Heather Sobko, Midge N Ray, Jeroan J Allison, Daniel E Ford, Gregg H Gilbert, and Thomas K Houston. 2013. Crowdsourced peer- versus expert-written smoking-cessation messages. American journal of preventive medicine 45, 5 (Nov. 2013), 543--50. DOI: http://dx.doi.org/10.1016/j.amepre.2013.07.004","paperID":"None"},{"content":"Steven P Dow, Alana Glassco, Jonathan Kass, Melissa Schwarz, Daniel L Schwartz, and Scott R Klemmer. 2010. Parallel prototyping leads to better design results, more divergence, and increased self-efficacy. ACM Transactions on Computer-Human Interaction (TOCHI) 17, 4 (2010), 18.","paperID":"None"},{"content":"Andy Field. 2013. Discovering statistics using IBM SPSS statistics. Sage.","paperID":"None"},{"content":"B J Fogg. 2003. Persuasive technology: using computers to change what we think and do. San Francisco: Morgan Kaufmann Publishers.","paperID":"None"},{"content":"Greg Guest and Kathleen M MacQueen. 2007. Handbook for team-based qualitative research. Rowman Altamira.","paperID":"None"},{"content":"Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 203--212.","paperID":"None"},{"content":"Eric B Hekler, Predrag Klasnja, Jon E Froehlich, and Matthew P Buman. 2013. Mind the theoretical gap: interpreting, using, and developing behavioral theory in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3307--3316.","paperID":"None"},{"content":"Setia Hermawati and Glyn Lawson. 2014. Managing obesity through mobile phone applications: a state-of-the-art review from a user-centred design perspective. Personal and Ubiquitous Computing (2014), 1--21.","paperID":"None"},{"content":"Pei-Yun Hsueh, Prem Melville, and Vikas Sindhwani. 2009. Data Quality from Crowdsourcing: A Study of Annotation Selection Criteria. In Proceedings of the NAACL HLT 2009 Workshop on Active Learning for Natural Language Processing (HLT '09). 27--35.","paperID":"None"},{"content":"Andrew J Hutchison, Jeff D Breckon, and Lynne H Johnston. 2008. Physical activity behavior change interventions based on the transtheoretical model: a systematic review. Health Education & Behavior (2008).","paperID":"None"},{"content":"Maurits Kaptein, Boris De Ruyter, Panos Markopoulos, and Emile Aarts. 2012. Adaptive persuasive systems: a study of tailored persuasive text messages to reduce snacking. ACM Transactions on Interactive Intelligent Systems (TiiS) 2, 2 (2012), 10.","paperID":"None"},{"content":"Catriona M Kennedy, John Powell, Thomas H Payne, John Ainsworth, Alan Boyd, and Iain Buchan. 2012. Active assistance technology for health-related behavior change: an interdisciplinary review. Journal of medical Internet research 14, 3 (2012).","paperID":"None"},{"content":"Aniket Kittur, Ed H Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 453--456.","paperID":"None"},{"content":"Predrag Klasnja, Sunny Consolvo, and Wanda Pratt. 2011. How to evaluate technologies for health behavior change in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3063--3072.","paperID":"None"},{"content":"Predrag Klasnja and Wanda Pratt. 2012. Healthcare in the pocket: Mapping the space of mobile-phone health interventions. Journal of biomedical informatics 45, 1 (2012), 184--198.","paperID":"None"},{"content":"Santosh Krishna, Suzanne Austin Boren, and E Andrew Balas. 2009. Healthcare via cell phones: a systematic review. Telemedicine and e-Health 15, 3 (2009), 231--240.","paperID":"None"},{"content":"Jeffrey Kristan and Brian Suffoletto. 2015. Using online crowdsourcing to understand young adult attitudes toward expert-authored messages aimed at reducing hazardous alcohol consumption and to collect peer-authored messages. Translational behavioral medicine 5, 1 (2015), 45--52.","paperID":"None"},{"content":"J Richard Landis and Gary G Koch. 1977. The measurement of observer agreement for categorical data. biometrics (1977), 159--174.","paperID":"None"},{"content":"Amy E Latimer, Lawrence R Brawley, and Rebecca L Bassett. 2010. A systematic review of three approaches for constructing physical activity messages: What messages work and what improvements are needed' The international journal of behavioral nutrition and physical activity 7 (Jan. 2010), 36. DOI: http://dx.doi.org/10.1186/1479--5868--7--36","paperID":"None"},{"content":"Patrick WC Lau, Erica Y Lau, Del P Wong, and Lynda Ransdell. 2011. A systematic review of information and communication technology-based interventions for promoting physical activity behavior change in children and adolescents. Journal of medical Internet research 13, 3 (2011).","paperID":"None"},{"content":"Julia H Littell and Heather Girvin. 2002. Stages of Change A Critique. Behavior Modification 26, 2 (2002), 223--273.","paperID":"None"},{"content":"Kathleen M MacQueen, Eleanor McLellan, Kelly Kay, and Bobby Milstein. 1998. Codebook development for team-based qualitative analysis. Cultural anthropology methods 10, 2 (1998), 31--36.","paperID":"None"},{"content":"Bess H Marcus, Beth C Bock, Bernardine M Pinto, Leigh Ann H Forsyth, Mary B Roberts, and Regina M Traficante. 1998. Efficacy of an individualized, motivationally-tailored physical activity intervention. Annals of Behavioral Medicine 20, 3 (1998), 174--180.","paperID":"None"},{"content":"Bess H Marcus, Joseph S Rossi, Vanessa C Selby, Raymond S Niaura, and David B Abrams. 1992. The stages and processes of exercise adoption and maintenance in a worksite sample. Health Psychology 11, 6 (1992), 386.","paperID":"None"},{"content":"M. Marge, S. Banerjee, and A. I. Rudnicky. 2010. Using the Amazon Mechanical Turk for transcription of spoken language. In Proceedings of the International Conference on Acoustics, Speech and Signal Processing (ICASSP). 5270--5273.","paperID":"None"},{"content":"Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior research methods 44, 1 (2012), 1--23.","paperID":"None"},{"content":"Susan Michie, Marie Johnston, Jill Francis, Wendy Hardeman, and Martin Eccles. 2008. From Theory to Intervention: Mapping Theoretically Derived Behavioural Determinants to Behaviour Change Techniques. Applied Psychology 57, 4 (Oct. 2008), 660--680. DOI: http://dx.doi.org/10.1111/j.1464-0597.2008.00341.x","paperID":"None"},{"content":"Adity U Mutsuddi and Kay Connelly. 2012. Text messages for encouraging physical activity Are they effective after the novelty effect wears off?. In Pervasive Computing Technologies for Healthcare (PervasiveHealth), 2012 6th International Conference on. IEEE, 33--40.","paperID":"None"},{"content":"Claudio R Nigg, Karly S Geller, Rob W Motl, Caroline C Horwath, Kristin K Wertin, and Rodney K Dishman. 2011. A Research Agenda to Examine the Efficacy and Relevance of the Transtheoretical Model for Physical Activity Behavior. Psychology of sport and exercise 12, 1 (Jan. 2011), 7--12. DOI: http://dx.doi.org/10.1016/j.psychsport.2010.04.004","paperID":"None"},{"content":"Seth M Noar, Christina N Benac, and Melissa S Harris. 2007. Does tailoring matter? Meta-analytic review of tailored print health behavior change interventions. Psychological bulletin 133, 4 (2007), 673.","paperID":"None"},{"content":"GJ Norman, SV Benisovich, CR Nigg, and JS Rossi. 1998. Examining three exercise staging algorithms in two samples. In 19th annual meeting of the Society of Behavioral Medicine.","paperID":"None"},{"content":"Kevin Patrick, Fred Raab, Marc A Adams, Lindsay Dillon, Marian Zabinski, Cheryl L Rock, William G Griswold, and Gregory J Norman. 2009. A text message-based intervention for weight loss: randomized controlled trial. Journal of medical Internet research 11, 1 (2009).","paperID":"None"},{"content":"James O Prochaska and Carlo C DiClemente. 1983. Stages and processes of self-change of smoking: toward an integrative model of change. Journal of consulting and clinical psychology 51, 3 (1983), 390.","paperID":"None"},{"content":"James O Prochaska, Carlo C DiClemente, and John C Norcross. 1993. In search of how people change: Applications to addictive behaviors. Journal of Addictions Nursing 5, 1 (1993), 2--16.","paperID":"None"},{"content":"James O Prochaska and Wayne F Velicer. 1997. The transtheoretical model of health behavior change. American journal of health promotion 12, 1 (1997), 38--48.","paperID":"None"},{"content":"Craig S Rosen. 2000. Is the sequencing of change processes by stage consistent across health problems? A meta-analysis. Health Psychology 19, 6 (2000), 593.","paperID":"None"},{"content":"Leslie Spencer, Troy B Adams, Sarah Malone, Lindsey Roy, and Elizabeth Yost. 2006. Applying the transtheoretical model to exercise: a systematic and comprehensive review of the literature. Health promotion practice 7, 4 (Oct. 2006), 428--43. DOI: http://dx.doi.org/10.1177/1524839905278900","paperID":"None"},{"content":"Daniel Stokols. 1996. Translating social ecological theory into guidelines for community health promotion. American journal of health promotion 10, 4 (1996), 282--298.","paperID":"None"},{"content":"Michael Toomim, Travis Kriplean, Claus Pörtner, and James Landay. 2011. Utility of human-computer interactions: Toward a science of preference measurement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2275--2284.","paperID":"None"},{"content":"O. F. Zaidan and C. Callison-Burch. 2011. Crowdsourcing Translation: Professional Quality from Non-professionals. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies - Volume 1 (HLT '11). 1220--1229.","paperID":"None"}],"title":"Crowd-Designed Motivation: Motivational Messages for Exercise Adherence Based on Behavior Change Theory","filename":"CHI16/p297","authors":["Roelof A.J. de Vries","Khiet P. Truong","Sigrid Kwint","Constance H.C. Drossaert","Vanessa Evers"],"conference":"CHI '16"}