{"paperId":2858418,"citation":[],"reference":[{"content":"N Bianchi-Berthouze, Wk Whan, and D Patel. 2007. Does body movement engage you more in digital game play? And why? 31-32. http://doi.org/10.1007/978--3--540--74889--2_10","paperID":"None"},{"content":"Staffan Björk, Jennica Falk, Rebecca Hansson, and Peter Ljungstrand. 2001. Pirates'! Using the Physical World as a Game Board. Proceedings of Interact 2001.","paperID":"None"},{"content":"Blizzard Entertainment Inc. 2015. World of Warcraft. Retrieved from http://eu.battle.net/wow/en/","paperID":"None"},{"content":"Emily Brown and Paul Cairns. 2004. A grounded investigation of game immersion. Extended abstracts of the 2004 conference on Human factors and computing systems CHI '04, 1297. http://doi.org/10.1145/985921.986048","paperID":"None"},{"content":"Oğuz Turan Buruk and Oğuzhan Özcan. 2014. DubTouch: exploring human to human touch interaction for gaming in double sided displays. Proceedings of the 8th Nordic Conference on Human-Computer Interaction, 333-342.","paperID":"None"},{"content":"Gordon Calleja. 2011. In-game: From Immersion to Incorporation (Google eBook).","paperID":"None"},{"content":"Adrian David Cheok, Siew Wan Fong, Kok Hwee Goh, Xubo Yang, and Wei Liu. 2003. Human Pacman: A Mobile Entertainment System with Ubiquitous Computing and. Proceedings of the 2nd workshop on Network and system support for games NETGAMES 03 8, 209-224. http://doi.org/10.1007/s00779-004-0267-x","paperID":"None"},{"content":"Laura Ermi and Frans Mäyrä. 2005. Fundamental Components of the Gameplay Experience: Analysing Immersion. DiGRA 2005.","paperID":"None"},{"content":"Jan B. F. van Erp and Alexander Toet. 2015. Social Touch in Human-Computer Interaction. Frontiers in Digital Humanities 2, May, 1-14. http://doi.org/10.3389/fdigh.2015.00002","paperID":"None"},{"content":"Jayden Garner, Gavin Wood, Sandra Danilovic, Jessica Hammer, and Florian Floyd Mueller. intangle: Exploring Interpersonal Bodily Interactions through Sharing Controllers. 413-414.","paperID":"None"},{"content":"Jayden Garner, Gavin Wood, Sebastiaan Pijnappel, Martin Murer, and Florian Floyd Mueller. 2013. Combining moving bodies with digital elements. Proceedings of The 9th Australasian Conference on Interactive Entertainment Matters of Life and Death IE '13, 1-10. http://doi.org/10.1145/2513002.2513014","paperID":"None"},{"content":"Anneke De Graaf, Hans Hoeken, José Sanders, and Hans Beentjes. 2009. The role of dimensions of narrative engagement in narrative persuasion. Communications 34, 4, 385-405. http://doi.org/10.1515/COMM.2009.024","paperID":"None"},{"content":"Antal Haans and Wijnand IJsselsteijn. 2006. Mediated social touch: A review of current research and future directions. Virtual Reality 9, 149-159. http://doi.org/10.1007/s10055-005-0014--2","paperID":"None"},{"content":"Laura Herrewijn, Gordon Calleja, and Karolien Poels. 2013. The Relationship between Player Involvement and Immersion: an Experimental Investigation. Foundations of Digital Games, 3-6.","paperID":"None"},{"content":"Mads Hobye and Jonas Löwgren. 2011. Touching a stranger: Designing for engaging experience in embodied interaction. International Journal of Design 5, 3, 31-48.","paperID":"None"},{"content":"Amy Huggard, Anushka De Mel, Jayden Garner, Cagdas Chad Toprak, Alan Chatam, and Florian Floyd Mueller. 2013. Musical Embrace: Facilitating Engaging Play Experiences through Social Awkwardness. Proceedings of CHI'13, 3067-3070. http://doi.org/10.1145/2468356.2479612","paperID":"None"},{"content":"Gijs Huisman, Aduen Darriba Frederiks, Betsy Van Dijk, Dirk Heylen, and Ben Kröse. 2013. The TaSST: Tactile Sleeve for Social Touch. World Haptics Conference (WHC), 2013, 211-216.","paperID":"None"},{"content":"Kazuki Iida and Kenji Suzuki. 2011. Enhanced Touch: A Wearable Device for Social Playware. Proceedings of Advances in Computer Entertainment - ACE 2011, 4-5.","paperID":"None"},{"content":"Katherine Isbister, Rahul Rao, Ulf Schwekendiek, Elizabeth Hayward, and Jessamyn Lidasan. 2011. Is more movement better? A Controlled Comparison of Movement-based Games. Proceedings of the 6th International Conference on Foundations of Digital Games - FDG '11, 331-333. http://doi.org/10.1145/2159365.2159429","paperID":"None"},{"content":"Charlene Jennett, Anna L. Cox, Paul Cairns, et al. 2008. Measuring and defining the experience of immersion in games. International Journal of Human-Computer Studies 66, 9, 641-661. http://doi.org/10.1016/j.ijhcs.2008.04.004","paperID":"None"},{"content":"N. Jonassen. 1998. Human body capacitance: static or dynamic concept? [ESD]. Electrical Overstress/ Electrostatic Discharge Symposium Proceedings. 1998 (Cat. No.98TH8347), 1-7. http://doi.org/10.1109/EOSESD.1998.737028","paperID":"None"},{"content":"P. J. Lang. 1980. Behavioural Treatment And BioBehavioural Assessment: Computer Applications. Technology in Mental Health Care Delivery Systems.","paperID":"None"},{"content":"Paul Lemmens, Floris Crompvoets, Dirk Brokken, J. V D Eerenbeemd, and G. J D Vries. 2009. A body-conforming tactile jacket to enrich movie viewing. World Haptics 2009, 7-12. http://doi.org/10.1109/WHC.2009.4810832","paperID":"None"},{"content":"Regan L. Mandryk, Kori M. Inkpen, and Thomas W. Calvert. 2006. Using psychophysiological techniques to measure user experience with entertainment technologies. Behaviour & Information Technology 25, 2, 141-158. http://doi.org/10.1080/01449290500331156","paperID":"None"},{"content":"RL Mandryk and KM Inkpen. 2001. Supporting free play in ubiquitous computer games. UbiComp '01, 1-6. Retrieved January 29, 2014 from http://www.cse.chalmers.se/research/group/idc/ituni v/student/2002/reevolution/CoopGames/mandryk.p df","paperID":"None"},{"content":"Florian Mueller and Katherine Isbister. 2014. Movement-based game guidelines. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, 2191- 2200. http://doi.org/10.1145/2556288.2557163","paperID":"None"},{"content":"Janet H. Murray. 1997. Hamlet on the Holodeck.","paperID":"None"},{"content":"Bruno Nadeau and Amanda Williams. Tactful Interaction: Exploring Interactive Social Touch Through a Collaborative Tangible Installation.","paperID":"None"},{"content":"Kosuke Nakajima. 2013. Emoballoon: a Balloonshaped Interface Recognizing Social Touch Interactions. Virtual Reality (VR).","paperID":"None"},{"content":"Hideyuki Nakanishi, Kazuaki Tanaka, Yuya Wada, and Technology Agency. 2014. Remote Handshaking: Touch Enhances Video-Mediated Social Telepresence. Proceedings of CHI'14, 2143- 2152. http://doi.org/10.1145/2556288.2557169","paperID":"None"},{"content":"Avinash Nandwani, Paul Coulton, and Reuben Edwards. 2011. NFC Mobile Parlor Games Enabling Direct Player to Player Interaction. 2011 Third International Workshop on Near Field Communication, 21-25. http://doi.org/10.1109/NFC.2011.19","paperID":"None"},{"content":"NetherRealm Studios. 2015. Mortal Combat. Retrieved from http://www.mortalkombat.com/","paperID":"None"},{"content":"Marianna Obrist, Sriram Subramanian, Elia Gatti, Benjamin Long, and Thomas Carter. 2015. Emotions Mediated Through Mid-Air Haptics. 2053-2062.","paperID":"None"},{"content":"Karolien Poels, Yvonne De Kort, and Wijnand IJsselsteijn. 2007. \"It is always a lot of fun!\": Exploring dimensions of digital game experience using focus group methodology. Future Play 2007, 83-89. http://doi.org/10.1145/1328202.1328218","paperID":"None"},{"content":"Munehiko Sato, Ivan Poupyrev, and Chris Harrison. 2012. Touché. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, c, 483. http://doi.org/10.1145/2207676.2207743","paperID":"None"},{"content":"Douglas Edward Wilson. 2012. Designing for the Pleasures of Disputation-Or-how to Make Friends by Trying to Kick Them!. IT University of Copenhagen, Innovative Communication.","paperID":"None"},{"content":"Bob G Witmer and Michael J Singer. 1998. Measuring Presence in Virtual Environments: A Presence. Presence 7, 3, 225-240. http://doi.org/10.1026//1617--6383.15.2.69","paperID":"None"},{"content":"Yohei Yamaguchi, Hidekatsu Yanagi, and Yoshinari Takegawa. 2013. Touch-Shake: Design and Implementation of a Physical Contact Support Device for Face-to-Face Communication. IEEE Global Conference on Consumer Electronics (GCCE), 170-174.","paperID":"None"}],"abstract":"We observe an increasing interest on usage of full-body interaction in games. However, human-to-human social touch interaction has not been implemented as a sophisticated gaming apparatus. To address this, we designed the Sensation, a device for detecting touch patterns between players, and introduce the game, Shape Destroy, which is a collaborative game designed to be played with social touch. To understand if usage of social touch has a meaningful contribution to the overall player experience in collaborative games we conducted a user study with 30 participants. Participants played the same game using i) the Sensation and ii) a gamepad, and completed a set of questionnaires aimed at measuring the immersion levels. As a result, the collected data and our observations indicated an increase in general, shared, ludic and affective involvement with significant differences. Thus, human-to-human touch can be considered a promising control method for collaborative physical games.","title":"Sensation: Measuring the Effects of a Human-to-Human Social Touch Based Controller on the Player Experience","filename":"CHI16/p3944","authors":["Mert Canat","Mustafa Ozan Tezcan","Celalettin Yurdakul","Eran Tiza","Buğra Can Sefercik","Idil Bostan","Oğuz Turan Buruk","Tilbe Göksun","Oğuzhan Özcan"],"conference":"CHI '16"}