{"paperId":2858128,"citation":[],"abstract":"The widespread deployment of technology by professional health services will provide a substantial opportunity for studies that consider usage in naturalistic settings. Our study has documented experiences of engaging with technologies intended to support recovery from common mental health problems, often used as a part of a multi-year recovery process. In analyzing this material, we identify issues of broad interest to effective health technology design, and reflect on the challenge of studying engagement with health technologies over lengthy time periods. We also consider the importance of designing technologies that are sensitive to the needs of users experiencing chronic health problems, and discuss how the term sensitivity might be defined in a technology design context.","reference":[{"content":"Alhammad, M.M. and Gulliver, S.R. 2014. Persuasive Technology and Users Acceptance of E-commerce: Users Perceptions of Website Persuasiveness. Journal of Electronic Commerce in Organizations. 12, 2: 1--13. http://dx.doi.org/10.4018/jeco.2014040101","paperID":"None"},{"content":"Alonso J, Angermeyer MC, Bernert S, et al. (2004). Prevalence of mental disorders in Europe: results from the European Study of the Epidemiology of Mental Disorders (ESEMeD) project. Acta Psychiatra Scandinavica Supplementum. 109, 420: 21--7. http://dx.doi.org/10.1111/j.1600-0047.2004.00327.x","paperID":"None"},{"content":"Balaam, M., Rennick Egglestone, S., Fitzpatrick, G., Rodden, T., Hughes, A.M., Wilkinson, A., Nind, T., Axelrod, L., Harris, E., Ricketts, I., Mawson, S. and Burridge, J. 2011. Motivating Mobility: Designing for lived motivation in stroke rehabilitation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2011). http://dx.doi.org/10.1145/1978942.1979397","paperID":"None"},{"content":"Beating the Blues homepage. Retrieved 5th January 2016. http://www.beatingtheblues.co.uk/","paperID":"None"},{"content":"Beck, A.T. 1972. Depression; Causes and Treatment. University of Pennsylvania Press. ISBN 0812276523.","paperID":"None"},{"content":"Benford, S., Giannachi, G., Koleva, B., & Rodden, T. 2009. From interaction to trajectories: designing coherent journeys through user experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2009). http://dx.doi.org/10.1145/1518701.1518812","paperID":"None"},{"content":"Benford, S., Greenhalgh, C., Crabtree, A., Flintham, M., Walker, B., Marshall, J., Koleva, B., Rennick Egglestone, S., Giannachi, G., Adams, M., Tandavanitj, N. and Row Farr, J. 2013. Performance Led Research in the Wild. ACM Transactions on Computer-Human Interaction. 20, 3. http://dx.doi.org/10.1145/2491500.2491502","paperID":"None"},{"content":"Blandford, A., Berndt, E., Catchpole, K., Furniss, D., Mayer, A., Mentis, H., O'Kane, A.A., Owen, T., Rajkomar, A. and Randell, R. 2013. Experiencing Interactive Healthcare Technologies: embracing 'the wild' on its own terms. ACM Transactions on Computer-Human Interaction. 20, 3.","paperID":"None"},{"content":"Cacioppo, J.T. and Hawkley, L.C. Perceived Social Isolation and Cognition. 2009. Trends in Cognitive Science. 13, 10: 447--454. http://dx.doi.org/10.1016/j.tics.2009.06.005","paperID":"None"},{"content":"Cavanagh, K., Seccombe, N. and Lidbetter, N. 2011. The Implementation of Computerized Cognitive Behavioural Therapies in a Service User-Led, Third Sector Self Help Clinic. Behavioural Cognitive Psychology. 39, 4: 427--42. http://dx.doi.org/10.1017/S1352465810000858","paperID":"None"},{"content":"Consolvo, S., McDonald, D. W., & Landay, J. A. 2009. Theory-driven design strategies for technologies that support behavior change in everyday life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2009). http://dx.doi.org/10.1145/1518701.1518766","paperID":"None"},{"content":"Coyle, D, Doherty, G., Matthews, M. and Sharry, J. 2007. Computers in talk-based mental health interventions. Interacting with Computers. 19, 4: 545--562. http://dx.doi.org/10.1016/j.intcom.2007.02.001.","paperID":"None"},{"content":"Crabtree, A., Rouncefield. M. and Tolmie, P. 2012. Doing Design Ethnography. Springer-Verlag.","paperID":"None"},{"content":"Doherty, G., Coyle, D. and Sharry, J. 2012. Engagement with online mental health interventions: an exploratory clinical study of a treatment for depression. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2012). http://dx.doi.org/10.1145/2207676.2208602","paperID":"None"},{"content":"Durrant, A., Rowland, D., Kirk, D.S., Benford, S., Fischer, J.E. and McAuley, D. Automics: souvenir generating photoware for theme parks. 2011. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2011). http://doi.acm.org/10.1145/1978942.1979199","paperID":"None"},{"content":"FearFighter homepage. Retrieved 5th January 2016. http://www.fearfighter.com/","paperID":"None"},{"content":"Fitzpatrick, L. A Brief History of Anti-depressants. 2010. Time Magazine: Thursday Jan 7 2010. Retrieved 5th January 2016. http://content.time.com/time/health/article/0,8599,1952143,00.html","paperID":"None"},{"content":"Greenbaum, J. and Kyng, M. 1991. Design at work: Co-operative design of computer systems. CRC Press.","paperID":"None"},{"content":"Griffiths, K.M. and Christensen, H. 2007. Internet based mental health programs: A powerful tool in the rural medical kit. Australian Journal of Rural Health. 15, 2, 81--87. http://dx.doi.org/ 10.1111/j.14401584.2007.00859.x","paperID":"None"},{"content":"Griffiths, K.M., Farrer, L. and Christensen, H. 2007. Clickety-click: E-Mental Health Train on Track. Australasian Psychiatry. 15, 2. http://dx.doi.org/10.1080/10398560601123716","paperID":"None"},{"content":"Hirschfield, R.M., Lewis, L. and Vornik, L.A. 2003. Perceptions and impact of bipolar disorder: how far have we really come? Results of the national depressive and manic-depressive association 2000 survey of individuals with bipolar disorder. Journal of Clinical Psychiatry. 64, 2:161--174. http://dx.doi.org/10.1016/j.amp.2015.07.026","paperID":"None"},{"content":"Improving Access to Psychological Therapies homepage. Retrieved 5th January 2016. http://www.iapt.nhs.uk/","paperID":"None"},{"content":"Kaltenthaler, E., Sutcliffe, P., Parry, G., Beverley, C., Rees, A. and Ferriter, M. 2008. The acceptability to patients of computerized cognitive behaviour therapy for depression: a systematic review. Psychological Medicine. 38:1521--1530. http://doi:10.1017/S0033291707002607","paperID":"None"},{"content":"Knowles, S., Toms, G., Sanders, C., Bee, P., Lovell, K., Rennick-Egglestone, S., Coyle, D., Kennedy, C.M., Littlewood, E., Kessler, D., Gilbody, S. and Bower, P. 2014. Qualitative Meta-Synthesis of User Experience of Computerised Therapy for Depression and Anxiety. PlosOne. http://dx.doi.org/10.1371/journal.pone.0084323","paperID":"None"},{"content":"Lederman, R., Wadley, G., Gleeson, J., Bendall, S. and Alvarez-Jimenez, M. 2014. Moderated Online Social Therapy: Designing And Evaluating Technology For Mental Health. ACM Transactions on Computer-Human Interaction. 21, 1. http://dx.doi.org/10.1145/2513179","paperID":"None"},{"content":"Living Life to the Full home-page. Retrieved 5th January 2016. http://www.llttf.com/","paperID":"None"},{"content":"Melville, K.M., Casey, L.M. and Kavanagh, D.J. 2010. Dropout from Internet-based treatment for psychological disorders. British Journal of Clinical Psychology. 49, 4:455--71. http://dx.doi.org/10.1348/014466509X472138.","paperID":"None"},{"content":"MoodGym home-page. Retrieved 5th January 2016. https://moodgym.anu.edu.au/","paperID":"None"},{"content":"Moran, S., Luger, E., & Rodden, T. 2014. Literatin: beyond awareness of readability in terms and conditions. In Adjunct Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing. http://dx.doi.org/10.1145/2638728.2641684","paperID":"None"},{"content":"Moretti, R., Torre, P., Antonello, R.M., Cazzato, G. and Bava, A. 2002. Depression and Alzheimer's disease: Symptom or comorbidity? American Journal of Alzheimer's Disease and Other Dementias. 17, 6: 338--344.","paperID":"None"},{"content":"Morrison C. and Doherty G. 2014. Analyzing Engagement in a Web-Based Intervention Platform Through Visualizing Log-Data. Journal of Medical Internet Research. 16, 11, e252. http://dx.doi.org/10.2196/jmir.3575","paperID":"None"},{"content":"Morrison, C., Walker, G., Ruggeri, K. and Hacker Hughes, J. 2014. An implementation pilot of the Mind Balance web-based intervention for depression in three IAPT services. The Cognitive Behaviour Therapist.7: e15. http://dx.doi.org/10.1017/S1754470X14000221","paperID":"None"},{"content":"National Institute of Clinical Excellence. 2009. Depression in adults (update) NICE Clinical Guideline 90. Guidance/Clinical Guidelines. Retrieved 5th January 2016. http://publications.nice.org.uk/depression-cg90/personcentred-care. Accessed 26 January 2012.","paperID":"None"},{"content":"Rennick-Egglestone, S. 2014. Tailoring technologies to the rehabilitational needs of stroke survivors. Ph.D. dissertation. University of Nottingham, UK. http://eprints.nottingham.ac.uk/14153/","paperID":"None"},{"content":"Rennick-Egglestone, S., Roussou, M., Brundell, P., Chaffardon, C., Kourtis, V., Koleva, B. and Benford, S. 2013. Indoors and outdoors: designing mobile experiences for Cité de l'Espace. Proceedings of NODEM 2013. http://eprints.nottingham.ac.uk/2237/","paperID":"None"},{"content":"Richards DA, Bower P, Pagel C, Weaver A, Utley M, et al. 2012. Delivering stepped care: an analysis of implementation in routine practice. Implementation Science. 7:3. http://dx.doi.org/10.1186/1748--5908--7--3.","paperID":"None"},{"content":"Shaghaghi, A., Bhopal, R.S. and Sheikh, A. 2011. Approaches to Recruiting 'Hard-To-Reach' Populations into Re-search: A Review of the Literature. Health Promotion Perspectives. 1,2: 86--94. http://dx.doi.org/10.5681%2Fhpp.2011.009","paperID":"None"},{"content":"Titov, N., Andrews, G. and Sachdev, P. 2010. Computer-delivered cognitive behavioural therapy: effective and getting ready for dissemination. F1000 Medicine Reports. http://dx.doi.org/10.3410/M2--49","paperID":"None"},{"content":"Wadley, G., Smith, W., Ploderer, B., Pearce, J., Webber, S., & Whooley, M. 2014. What people talk about when they talk about quitting. In Proceedings of the Australian Computer-Human Interaction Conference (OzCHI 2014). http://dx.doi.org/10.1145/2686612.2686671","paperID":"None"},{"content":"Westbrook, D., Kennerley, H. and Kirk, J. 2011. An Introduction to Cognitive Behaviour Therapy: Skills and Applications (2nd edition). Sage Publications.","paperID":"None"}],"title":"Health Technologies 'In the Wild': Experiences of Engagement with Computerised CBT","filename":"CHI16/p2124","authors":["Stefan Rennick-Egglestone","Sarah Knowles","Gill Toms","Penny Bee","Karina Lovell","Peter Bower"],"conference":"CHI '16"}