{"paperId":2858484,"citation":[],"reference":[{"content":"Jeffrey Bardzell and Shaowen Bardzell. 2008. FEATURE: Intimate interactions: Online representation and software of the self. Interactions. 15, 5, 11--15.","paperID":"None"},{"content":"Jeffrey Bardzell. 2011. Interaction criticism: An introduction to the practice. Interacting with Computers. 23, 6, 604--621.","paperID":"None"},{"content":"Jeffrey Bardzell, Shaowen Bardzell, Guo Zhang, and Tyler Pace. 2014. The lonely raccoon at the ball: Designing for intimacy, sociability, and selfhood. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3943--3952. http://doi.acm.org/10.1145/2556288.2557127","paperID":"None"},{"content":"Philip Barnard. 1991. Bridging between basic theories and the artefacts of Human-Computer Interaction. In Designing Interaction: Psychology at the Human Computer Interface, John Milar Carroll (ed.). Cambridge University Press, Cambridge, 103-127.","paperID":"None"},{"content":"Genevieve Bell, Tim Brooke, Elizabeth Churchill, and Eric Paulos. 2003. Intimate ubiquitous computing. In Proceedings of the International Conference on Ubiquitous Computing (UbiComp'03), 3--6.","paperID":"None"},{"content":"Mark A. Blythe, Kees Overbeeke, Andrew F. Monk, and Peter C. Wright (Eds.). 2005. Funology: From usability to enjoyment. Kluwer Academic Publishers.","paperID":"None"},{"content":"Francesca Bray. 2008. Constructing intimacy: Technology, family and gender in East Asia. East Asian Science, Technology and Society. 2, 2, 151--165.","paperID":"None"},{"content":"Alvin Cooper and Leda Sportolari. 1997. Romance in cyberspace: Understanding online attraction. Journal of Sex Education and Therapy, 22, 1, 7--14.","paperID":"None"},{"content":"Robert Crosnoe. 2000. Friendships in childhood and adolescence: The life course and new directions. Social Psychology Quarterly. 63, 4, 377--391.","paperID":"None"},{"content":"Guo Freeman, Jeffrey Bardzell, Shaowen Bardzell, and Susan C. Herring. 2015. Simulating Marriage: Gender Roles and Emerging Intimacy in an Online Game. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1191--1200. DOI=http://dx.doi.org/10.1145/2675133.2675192","paperID":"None"},{"content":"Anthony Giddens. 1992. The transformation of intimacy: Love, sexuality and eroticism in modern societies. Cambridge, UK: Polity.","paperID":"None"},{"content":"Richard L. Gilbert, Monique A. Gonzalez, and Nora A. Murphy. 2011. Sexuality in the 3D Internet and its relationship to real-life sexuality. Psychology & Sexuality. 2, 2, 107--122.","paperID":"None"},{"content":"Richard L. Gilbert, Nora A. Murphy, and M Clementina Ávalos. 2011. Communication patterns and satisfaction levels in three dimensional versus real-life intimate relationships. Cyberpsychology, Behavior, and Social Networking. 14, 10, 585--589.","paperID":"None"},{"content":"Richard L. Gilbert, Nora A. Murphy, and M Clementina Ávalos. 2011. Realism, idealization, and potential negative impact of 3D virtual relationships. Computers in Human Behavior. 27, 5, 2039--2046.","paperID":"None"},{"content":"Peggy C. Giordano. 2003. Relationships in adolescence. Annual Review of Sociology. 29, 257--281.","paperID":"None"},{"content":"Christina Goulding. 2005. Grounded theory, ethnography and phenomenology: A comparative analysis of three qualitative strategies for marketing research. European journal of Marketing. 39, 3/4, 294--308.","paperID":"None"},{"content":"Marc Hassenzahl, Stephanie Heidecker, Kai Eckoldt, Sarah Diefenbach, and Uwe Hillmann. 2012. All you need is love: Current strategies of mediating intimate relationships through technology. ACM Trans. Comput.-Hum. Interact. 19, 4, Article 30.","paperID":"None"},{"content":"Fabian Hemmert, Ulrike Gollner, Matthias Löwe, Anne Wohlauf, and Gesche Joost. 2011. Intimate mobiles: grasping, kissing and whispering as a means of telecommunication in mobile phones. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11), 21--24. http://doi.acm.org/10.1145/2037373.2037377","paperID":"None"},{"content":"KimPhong Huynh, SiWei Lim, and Marko M. Skoric. 2013. Stepping out of the magic circle: Regulation of play/life boundary in MMOmediated romantic relationship. Journal of ComputerMediated Communication. 18, 3, 251--264.","paperID":"None"},{"content":"Lynn Jamieson. 1989. Intimacy: Personal relationships in modern societies. Polity Press.","paperID":"None"},{"content":"Joris H. Janssen, Wijnand A. Ijsselsteijn, and Joyce H. D. M. Westerink. 2014. How affective technologies can influence intimate interactions and improve social connectedness. Int. J. Hum.-Comput. Stud. 72, 1, 3343.","paperID":"None"},{"content":"Joseph 'Jofish' Kaye, Mariah K. Levitt, Jeffrey Nevins, Jessica Golden, and Vanessa Schmidt. 2005. Communicating intimacy one bit at a time. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05), 1529--1532. http://doi.acm.org/10.1145/1056808.1056958","paperID":"None"},{"content":"Vassilis Kostakos, Eamonn O'Neill, Linda Little, and Elizabeth Sillence. 2005. Editorial: The social implications of emerging technologies. Interact. Comput. 17, 5, 475--483.","paperID":"None"},{"content":"John McCarthy and Peter Wright. 2004. Technology as experience. The MIT Press.","paperID":"None"},{"content":"Tyler Pace, Shaowen Bardzell, and Jeffrey Bardzell. 2010. The rogue in the lovely black dress: intimacy in World of Warcraft. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, 233--242. http://doi.acm.org/10.1145/1753326.1753361","paperID":"None"},{"content":"Ethel Spector Person. 1980. Sexuality as the mainstay of identity: Psychoanalytic perspectives. Signs, 5, 4, 605--630.","paperID":"None"},{"content":"Michael W. Ross. 2005. Typing, doing, and being: Sexuality and the Internet. Journal of Sex Research, 42, 4, 342--352.","paperID":"None"},{"content":"Kenneth H. Rubin, William Bukowski and Jeffrey G. Parker. 1998. Peer interactions, relationships, and groups. In Handbook of Child Psychology, Hoboken, NJ: John Wiley & Sons Inc, 619--700.","paperID":"None"},{"content":"Thecla Schiphorst, Frank Nack, Michiel KauwATjoe, Simon de Bakker, Stock, Lora Aroyo, Angel Perez Rosillio, Hielke Schut, and Norm Jaffe. 2007. PillowTalk: can we afford intimacy?. In Proceedings of the 1st international conference on Tangible and embedded interaction (TEI '07), 23--30. http://doi.acm.org/10.1145/1226969.1226975","paperID":"None"},{"content":"Veronica M. Scott, Karen E. Mottarella, and Maria J. Lavooy. 2006. Does virtual intimacy exist? A brief exploration into reported levels of intimacy in online relationships. CyberPsychology & Behavior. 9, 6, 759--761.","paperID":"None"},{"content":"Rob Strong and Bill Gaver. 1996. Feather, scent and shaker: supporting simple intimacy. In Proceedings of the 1996 ACM Conference on Computer Supported Cooperative Work (CSCW '96), 29--30.","paperID":"None"},{"content":"Betsy E. Tolstedt and Joseph P. Stokes. 1983. Relation of verbal, affective, and physical intimacy to marital satisfaction. Journal of Counseling Psychology. 30, 4, 573--580.","paperID":"None"},{"content":"Frank Vetere, Martin R. Gibbs, Jesper Kjeldskov, Steve Howard, Florian 'Floyd' Mueller, Sonja Pedell, Karen Mecoles, and Marcus Bunyan. 2005. Mediating intimacy: designing technologies to support strong-tie relationships. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, 471--480. http://doi.acm.org/10.1145/1054972.1055038","paperID":"None"},{"content":"Joseph B Walther. 1996. Computer-mediated communication impersonal, interpersonal, and hyperpersonal interaction. Communication Research. 23, 1, 3--43.","paperID":"None"}],"abstract":"Existing studies in the field of HCI and CSCW have pointed to the significance to investigate computer-mediated intimacy and brought together concerns in ubiquitous computing, affective technologies, and experience design. However, existing conceptualizations of intimacy in collaborative online systems are largely based on empirical studies of systems that have similar social dynamics and user groups, which could lead to a bias in investigating intimacy. Using Audition, a dance battle Multiplayer Online Game with a popular marriage system, as our field site, we focus on dyadic intimacy in a non-violent online social space that has many young non-Caucasian and female users. We contribute to both confirming and further advancing existing theories of computer-mediated intimacy using this new dataset. We also suggest promising future directions for exploring the subjective intimate experiences in a scientifically defensible way.","title":"Revisiting Computer-Mediated Intimacy: In-Game Marriage and Dyadic Gameplay in Audition","filename":"CHI16/p4325","authors":["Guo Freeman","Jeffrey Bardzell","Shaowen Bardzell"],"conference":"CHI '16"}