{"paperId":2858277,"citation":[],"abstract":"Using game balancing techniques can provide the right level of challenge and hence enhance player engagement for sport players with different skill levels. Digital technology can support and enhance balancing techniques in sports, for example, by adjusting players' level of intensity based on their heart rate. However, there is limited knowledge on how to design such balancing and its impact on the user experience. To address this we created two novel balancing techniques enabled by digitally augmenting a table tennis table. We adjusted the more skilled player's performance by inducing two different styles of play and studied the effects on game balancing and player engagement. We showed that by altering the more skilled player's performance we can balance the game through: (i) encouraging game mistakes, and (ii) changing the style of play to one that is easier for the opponent to counteract. We outline the advantages and disadvantages of each approach, extending our understanding of game balancing design. We also show that digitally augmenting sports offers opportunities for novel balancing techniques while facilitating engaging experiences, guiding those interested in HCI and sports.","reference":[{"content":"Ernest Adams. 2010. Fundamentals of game design. New Riders, Berkeley, Calif.","paperID":"None"},{"content":"Charu C. Aggarwal. 2013. Outlier analysis. Springer, NY, NY.","paperID":"None"},{"content":"Richard B. Alderman. 1974. Psychological behavior in sport. Saunders, Philadelphia.","paperID":"None"},{"content":"David Altimira, Florian Mueller, Gun Lee, Jenny Clarke, and Mark Billinghurst. 2014. Towards Understanding Balancing in Exertion Games. In Proceedings of the 11th Conference on Advances in Computer Entertainment Technology (ACE '14). ACM, NY, NY, USA, Article 10, 8 pages. DOI: http://dx.doi.org/10.1145/2663806.2663838","paperID":"None"},{"content":"John W. Atkinson. 1957. Motivational determinants of risk-taking behavior. Psychological Review 64, 6, Pt.1 (1957), 359--372. http://ezproxy.canterbury.ac.nz/login?url=http: //search.ebscohost.com/login.aspx?direct=true&db=pdh&AN=1959-03029-001&site=ehost-live","paperID":"None"},{"content":"A Baca. 2008. Feedback systems. Computers in Sport (2008), 43--67.","paperID":"None"},{"content":"Scott Bateman, Regan L. Mandryk, Tadeusz Stach, and Carl Gutwin. 2011. Target assistance for subtly balancing competitive play. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2355--2364. DOI: http://dx.doi.org/10.1145/1978942.1979287","paperID":"None"},{"content":"Howard S. Becker. 1958. Problems of Inference and Proof in Participant Observation. American Sociological Review 23, 6 (1958), 652--660.","paperID":"None"},{"content":"Nadia Bianchi-Berthouze. 2013. Understanding the Role of Body Movement in Player Engagement. Human Computer Interaction 28, 1 (2013), 40--75. DOI: http://dx.doi.org/10.1080/07370024.2012.688468","paperID":"None"},{"content":"Jared E. Cechanowicz, Carl Gutwin, Scott Bateman, Regan Mandryk, and Ian Stavness. 2014. Improving Player Balancing in Racing Games. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 47--56. DOI: http://dx.doi.org/10.1145/2658537.2658701","paperID":"None"},{"content":"Jenova Chen. 2007. Flow in Games (and Everything else). Commun. ACM 50, 4 (2007), 31--34. DOI: http://dx.doi.org/10.1145/1232743.1232769","paperID":"None"},{"content":"Mihaly Csikszentmihalyi. 1990. Flow: the psychology of optimal experience. Harper & Row, NY.","paperID":"None"},{"content":"Stefan Engeser and Falko Rheinberg. 2008. Flow, performance and moderators of challenge-skill balance. Motivation and Emotion 32, 3 (2008), 158--172. DOI: http://dx.doi.org/10.1007/s11031-008--9102--4","paperID":"None"},{"content":"Kathrin Maria Gerling, Matthew Miller, Regan L. Mandryk, Max Valentin Birk, and Jan David Smeddinck. 2014. Effects of Balancing for Physical Abilities on Player Performance, Experience and Self-esteem in Exergames. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2201--2210. DOI: http://dx.doi.org/10.1145/2556288.2556963","paperID":"None"},{"content":"Hiroshi Ishii, Craig Wisneski, Julian Orbanes, Ben Chun, and Joe Paradiso. 1999. PingPongPlus: design of an athletic-tangible interface for computer-supported cooperative play. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 394--401. DOI: http://dx.doi.org/10.1145/302979.303115","paperID":"None"},{"content":"Jonathan Lazar, Jinjuan Feng, and Harry Hochheiser. 2010. Research methods in human-computer interaction. Wiley, Chichester, West Sussex, U.K.","paperID":"None"},{"content":"Florian Mueller, Martin R. Gibbs, and Frank Vetere. 2008. Taxonomy of exertion games. In Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat (OZCHI '08). ACM, NY, NY, USA, 263--266. DOI: http://dx.doi.org/10.1145/1517744.1517772","paperID":"None"},{"content":"Florian Mueller, Frank Vetere, Martin Gibbs, Darren Edge, Stefan Agamanolis, Jennifer Sheridan, and Jeffrey Heer. 2012. Balancing exertion experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1853--1862. DOI: http://dx.doi.org/10.1145/2207676.2208322","paperID":"None"},{"content":"Curtiss Murphy, Dustin Chertoff, Michael Guerrero, and Kerry Moffitt. 2015. Design Better Games: Flow, Motivation, and Fun. In Design and Development of Training Games: Practical Guidelines from a Multidisciplinary Perspective, Talib Hussain and Susan Coleman (Eds.). Cambridge University Press, Chapter 6, 146--178.","paperID":"None"},{"content":"Heather L. O'Brien and Elaine G. Toms. 2010. The development and evaluation of a survey to measure user engagement. J. Am. Soc. Inf. Sci. Technol. 61, 1 (2010), 50--69. DOI:http://dx.doi.org/10.1002/asi.v61:1","paperID":"None"},{"content":"Katie Salen and Eric Zimmerman. 2003. Rules of play: game design fundamentals. MIT Press, Cambridge, Mass.","paperID":"None"},{"content":"Tadeusz Stach, T. C. Nicholas Graham, Jeffrey Yim, and Ryan E. Rhodes. 2009. Heart rate control of exercise video games. In Proceedings of Graphics Interface 2009 (GI '09). Canadian Information Processing Society, Toronto, Ont., Canada, 125--132.","paperID":"None"},{"content":"Tim B Swartz. 2009. A new handicapping system for golf. Journal of Quantitative Analysis in Sports 5, 2 (2009).","paperID":"None"},{"content":"Peter Vorderer, Tilo Hartmann, and Christoph Klimmt. 2003. Explaining the enjoyment of playing video games: the role of competition. In Proceedings of the second international conference on Entertainment computing (ICEC '03). Carnegie Mellon University, Pittsburgh, PA, USA, 1--9. http://dl.acm.org/citation.cfm?id=958720.958735","paperID":"None"},{"content":"Goran Vuckovic, Brane Deman, Stanislav Kovacic, and Janez Perž. 2009. Quantitative analysis of playing efficiency in squash. Science and racket sports IV (2009), 220--226.","paperID":"None"}],"title":"Digitally Augmenting Sports: An Opportunity for Exploring and Understanding Novel Balancing Techniques","filename":"CHI16/p1681","authors":["David Altimira","Florian \"Floyd\" Mueller","Jenny Clarke","Gun Lee","Mark Billinghurst","Christoph Bartneck"],"conference":"CHI '16"}