{"paperId":2858589,"abstract":"Gestural interaction has become increasingly popular, as enabling technologies continue to transition from research to retail. The mobility of miniaturized (and invisible) technologies introduces new uses for gesture recognition. This paper investigates single-hand microgestures (SHMGs), detailed gestures in a small interaction space. SHMGs are suitable for the mobile and discrete nature of interactions for ubiquitous computing. However, there has been a lack of end-user input in the design of such gestures. We performed a user-elicitation study with 16 participants to determine their preferred gestures for a set of referents. We contribute an analysis of 1,632 gestures, the resulting gesture set, and prevalent conceptual themes amongst the elicited gestures. These themes provide a set of guidelines for gesture designers, while informing the designs of future studies. With the increase in hand-tracking and electronic devices in our surroundings, we see this as a starting point for designing gestures suitable to portable ubiquitous computing.","citation":[],"reference":[{"content":"Leonardo Angelini, Francesco Carrino, Stefano Carrino, Maurizio Caon, Omar Abou Khaled, Jürgen Baumgartner, Andreas Sonderegger, Denis Lalanne, and Elena Mugellini. 2014. Gesturing on the Steering Wheel: a User-elicited taxonomy. In Proceedings of the 6th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '14). ACM, New York, NY, USA, Article 31, 8 pages. http://doi.acm.org/10.1145/2667317.2667414","paperID":"None"},{"content":"William A. S. Buxton. 1995. Chunking and phrasing and the design of human-computer dialogues. In Human-Computer Interaction, Ronald M. Baecker, Jonathan Grudin, William A. S. Buxton, and Saul Greenberg (Eds.). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA 494--499.","paperID":"None"},{"content":"Liwei Chan, Yi-Ling Chen, Chi-Hao Hsieh, Rong-Hao Liang, and Bing-Yu Chen. 2015. CyclopsRing: Enabling Whole-Hand and Context-Aware Interactions Through a Fisheye Ring. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 549--556. http://dx.doi.org/10.1145/2807442.2807450","paperID":"None"},{"content":"L. Dipietro, A. M. Sabatini, and P. Dario. 2008. A Survey of Glove-Based Systems and Their Applications. Trans. Sys. Man Cyber Part C 38, 4 (July 2008), 461--482. http://dx.doi.org/10.1109/TSMCC.2008.923862","paperID":"None"},{"content":"Chris Harrison, Desney Tan, and Dan Morris. 2010. Skinput: appropriating the body as an input surface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 453--462. http://doi.acm.org/10.1145/1753326.1753394","paperID":"None"},{"content":"David Kim, Otmar Hilliges, Shahram Izadi, Alex D. Butler, Jiawen Chen, Iason Oikonomidis, and Patrick Olivier. 2012. Digits: freehand 3D interactions anywhere using a wrist-worn gloveless sensor. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 167--176. http://doi.acm.org/10.1145/2380116.2380139","paperID":"None"},{"content":"Rong-Hao Liang, Shu-Yang Lin, Chao-Huai Su, KaiYin Cheng, Bing-Yu Chen, and De-Nian Yang. 2011. SonarWatch: appropriating the forearm as a slider bar. In SIGGRAPH Asia 2011 Emerging Technologies (SA '11). ACM, New York, NY, USA, Article 5, 1 pages. http://doi.acm.org/10.1145/2073370.2073374","paperID":"None"},{"content":"Christian Loclair, Sean Gustafson, and Patrick Baudisch. PinchWatch: a wearable device for onehanded microinteractions. In Proceedings of MobileHCI, vol. 10. 2010.","paperID":"None"},{"content":"Pranav Mistry and Pattie Maes. 2009. SixthSense: a wearable gestural interface. In ACM SIGGRAPH ASIA 2009 Sketches (SIGGRAPH ASIA '09). ACM, New York, NY, USA, Article 11, 1 pages. http://doi.acm.org/10.1145/1667146.1667160","paperID":"None"},{"content":"Meredith Ringel Morris. 2012. Web on the wall: insights from a multimodal interaction elicitation study. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12). ACM, New York, NY, USA, 95--104. http://doi.acm.org/10.1145/2396636.2396651","paperID":"None"},{"content":"Meredith Ringel Morris, Andreea Danielescu, Steven Drucker, Danyel Fisher, Bongshin Lee, m. c. schraefel, and Jacob O. Wobbrock. 2014. Reducing legacy bias in gesture elicitation studies. interactions 21, 3 (May 2014), 40--45. http://doi.acm.org/10.1145/2591689","paperID":"None"},{"content":"Meredith Ringel Morris, Jacob O. Wobbrock, and Andrew D. Wilson. 2010. Understanding users' preferences for surface gestures. In Proceedings of Graphics Interface 2010 (GI '10). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 261--268.","paperID":"None"},{"content":"Miguel A. Nacenta, Yemliha Kamber, Yizhou Qiang, and Per Ola Kristensson. 2013. Memorability of predesigned and user-defined gesture sets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1099--1108. http://dx.doi.org/10.1145/2470654.2466142","paperID":"None"},{"content":"Michael Nebeling, Alexander Huber, David Ott, and Moira C. Norrie. 2014. Web on the Wall Reloaded: Implementation, Replication and Refinement of UserDefined Interaction Sets. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, New York, NY, USA, 15--24. http://dx.doi.org/10.1145/2669485.2669497","paperID":"None"},{"content":"Michael Nielsen, Moritz Störring, Thomas B. Moeslund, and Erik Granum. 2004. A procedure for developing intuitive and ergonomic gesture interfaces for HCI. In Gesture-Based Communication in HumanComputer Interaction. Springer Berlin Heidelberg, 409--420.","paperID":"None"},{"content":"Ryosuke Ono, Shunsuke Yoshimoto, and Kosuke Sato. 2013. Palm+Act: operation by visually captured 3D force on palm. In SIGGRAPH Asia 2013 Emerging Technologies (SA '13). ACM, New York, NY, USA, Article 14, 3 pages. http://doi.acm.org/10.1145/2542284.2542298","paperID":"None"},{"content":"Thammathip Piumsomboon, Adrian Clark, Mark Billinghurst, and Andy Cockburn. 2013. User-defined gestures for augmented reality. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 955--960. http://doi.acm.org/10.1145/2468356.2468527","paperID":"None"},{"content":"Jun Rekimoto. 2001. GestureWrist and GesturePad: Unobtrusive Wearable Interaction Devices. In Proceedings of the 5th IEEE International Symposium on Wearable Computers (ISWC '01). IEEE Computer Society, Washington, DC, USA, 21-.","paperID":"None"},{"content":"Julie Rico and Stephen Brewster. 2010. Usable gestures for mobile interfaces: evaluating social acceptability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 887--896. http://dx.doi.org/10.1145/1753326.1753458","paperID":"None"},{"content":"Gustavo Alberto Rovelo Ruiz, Davy Vanacken, Kris Luyten, Francisco Abad, and Emilio Camahort. 2014. Multi-viewer gesture-based interaction for omnidirectional video. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 40774086. http://dx.doi.org/10.1145/2556288.2557113","paperID":"None"},{"content":"T. Scott Saponas, Desney S. Tan, Dan Morris, Ravin Balakrishnan, Jim Turner, and James A. Landay. 2009. Enabling always-available input with muscle-computer interfaces. In Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, New York, NY, USA, 167--176. http://doi.acm.org/10.1145/1622176.1622208","paperID":"None"},{"content":"Richard A. Schmidt and Timothy D. Lee. 2011. Motor Control and Learning: A Behavioral Emphasis. (5th. ed.) Human Kinetics, Champaign, Illions, 2.","paperID":"None"},{"content":"Teddy Seyed, Chris Burns, Mario Costa Sousa, Frank Maurer, and Anthony Tang. 2012. Eliciting usable gestures for multi-display environments. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12). ACM, New York, NY, USA, 41--50. http://doi.acm.org/10.1145/2396636.2396643","paperID":"None"},{"content":"Kentaro Takemura, Akihiro Ito, Jun Takamatsu, and Tsukasa Ogasawara. 2011. Active bone-conducted sound sensing for wearable interfaces. In Proceedings of the 24th Annual ACM Symposium Adjunct on User Interface Software and Technology (UIST '11 Adjunct). ACM, New York, NY, USA, 53--54. http://doi.acm.org/10.1145/2046396.2046419","paperID":"None"},{"content":"Radu-Daniel Vatavu and Jacob O. Wobbrock. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Significance Test, and Toolkit. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1325--1334. http://doi.acm.org/10.1145/2702123.2702223","paperID":"None"},{"content":"Radu-Daniel Vatavu and Ionut-Alexandru Zaiti. 2014. Leap gestures for TV: insights from an elicitation study. In Proceedings of the 2014 ACM International Conference on Interactive Experiences for TV and Online Video (TVX '14). ACM, New York, NY, USA, 131--138. http://doi.acm.org/10.1145/2602299.2602316","paperID":"None"},{"content":"Martin Weigel, Vikram Mehta, and Jürgen Steimle. 2014. More than touch: understanding how people use skin as an input surface for mobile computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 179--188. http://doi.acm.org/10.1145/2556288.2557239","paperID":"None"},{"content":"Jacob O. Wobbrock, Htet Htet Aung, Brandon Rothrock, and Brad A. Myers. 2005. Maximizing the guessability of symbolic input. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, New York, NY, USA, 1869--1872. http://doi.acm.org/10.1145/1056808.1057043","paperID":"None"},{"content":"Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defined gestures for surface computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 10831092. http://doi.acm.org/10.1145/1518701.1518866","paperID":"None"},{"content":"Katrin Wolf, Anja Naumann, Michael Rohs, and Jörg Müller. 2011. Taxonomy of microinteractions: defining microgestures based on ergonomic and scenariodependent requirements. In Proceedings of the 13th IFIP TC 13 International Conference on HumanComputer Interaction - Volume Part I (INTERACT'11), Pedro Campos, Nuno Nunes, Nicholas Graham, Joaquim Jorge, and Philippe Palanque (Eds.), Vol. Part I. Springer-Verlag, Berlin, Heidelberg, 559--575.","paperID":"None"},{"content":"Katrin Wolf, Robert Schleicher, Sven Kratz, and Michael Rohs. 2013. Tickle: a surface-independent interaction technique for grasp interfaces. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13). ACM, New York, NY, USA, 185--192. http://doi.acm.org/10.1145/2460625.2460654","paperID":"None"},{"content":"Ying Wu and Thomas S. Huang. 1999. Vision-based gesture recognition: A review. In Gesture-based Communication in Human-Computer Interaction. Springer Berlin Heidelberg, 103--115.","paperID":"None"},{"content":"Xing-Dong Yang, Tovi Grossman, Daniel Wigdor, and George Fitzmaurice. 2012. Magic finger: alwaysavailable input through finger instrumentation. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 147--156. http://doi.acm.org/10.1145/2380116.2380137","paperID":"None"}],"title":"User Elicitation on Single-hand Microgestures","filename":"CHI16/p3403","authors":["Edwin Chan","Teddy Seyed","Wolfgang Stuerzlinger","Xing-Dong Yang","Frank Maurer"],"conference":"CHI '16"}