{"paperId":2858540,"citation":[],"abstract":"The 'like' button, introduced by Facebook several years ago, has become one of the most prominent icons of social media. Similarly to other popular social media features on the web, enterprises have also recently adopted it. In this paper, we present a first comprehensive study of liking activity in the enterprise. We studied the logs of an enterprise social media platform within a large global organization along a period of seven months, in which 393,720 'likes' were performed. In addition, we conducted a survey of 571 users of the platform's 'like' button. Our evaluation combines quantitative and qualitative analysis to inspect what employees like, why they use the 'like' button, and to whom they give their 'likes'.","reference":[{"content":"About the +1 button. Retrieved January 3, 2016 from http://support.google.com/plus/answer/1047397","paperID":"None"},{"content":"Deepak Agarwal, Bee-Chung Chen, Rupesh Gupta, Joshua Hartman, Qi He, Anand Iyer, Sumanth Kolar, Yiming Ma, Pannagadatta Shivaswamy, Ajit Singh, and Liang Zhang. 2014. Activity ranking in LinkedIn feed. In Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining (KDD '14). 1603--161 http://doi.acm.org/10.1145/2623330.2623362","paperID":"None"},{"content":"Eugene Agichtein, Carlos Castillo, Debora Donato, Aristides Gionis, and Gilad Mishne. 2008. Finding high-quality content in social media. In Proceedings of the 2008 International Conference on Web Search and Data Mining (WSDM '08), 183--194. http://doi.acm.org/10.1145/1341531.1341557","paperID":"None"},{"content":"Luca Maria Aiello, Alain Barrat, Rossano Schifanella, Ciro Cattuto, Benjamin Markines, and Filippo Menczer. 2012. Friendship prediction and homophily in social media. ACM Trans. Web 6, 2, Article 9 (June 2012), 33 pages. http://doi.acm.org/10.1145/2180861.2180866","paperID":"None"},{"content":"Morgan Ames and Mor Naaman. 2007. Why we tag: motivations for annotation in mobile and online media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 971--980. http://doi.acm.org/10.1145/1240624.1240772","paperID":"None"},{"content":"Kanghui Baek, Avery Holton, Dustin Harp, and Carolyn Yaschur. 2011. The links that bind: Uncovering novel motivations for linking on Facebook. Comput Hum Behav, 27(6), 2243--2248.","paperID":"None"},{"content":"Nancy Baym. 2013. Data not seen: The uses and shortcomings of social media metrics. First Monday, 18(10).","paperID":"None"},{"content":"Petter Bae Brandtzaeg and Ida Maria Haugstveit. 2014. Facebook likes: a study of liking practices for humanitarian causes. Int. J. Web Based Communities 10, 3 (June 2014), 258--27. http://dx.doi.org/1504/IJWBC.2014.062942","paperID":"None"},{"content":"Michael J. Brzozowski, Thomas Sandholm, and Tad Hogg. 2009. Effects of feedback and peer pressure on contributions to enterprise social media. In Proceedings of the ACM 2009 international conference on Supporting group work (GROUP '09), 61--70. http://doi.acm.org/10.1145/1531674.1531684","paperID":"None"},{"content":"Matthew P. Bunker, K.N. Rajendran, Steven B. Corbin, and Ciara Pearce. Understanding 'likers' on Facebook: differences between customer and non-customer situations. Int. J. of Business Information Systems, 12(2), 163--176.","paperID":"None"},{"content":"Moira Burke, Robert Kraut, and Cameron Marlow. 2011. Social capital on facebook: differentiating uses and users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 571--580. http://doi.acm.org/10.1145/1978942.1979023","paperID":"None"},{"content":"Jin Cao, Hongyu Gao, Li, L.E., and Friedman, B. 2013. Enterprise social network analysis and modeling: a tale of two graphs. In Proceedings of IEEE INFOCOM '13, 2382--2390. doi: 10.1109/INFCOM.2013.6567043","paperID":"None"},{"content":"Joan DiMicco, David R. Millen, Werner Geyer, Casey Dugan, Beth Brownholtz, and Michael Muller. 2008. Motivations for social networking at work. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08), 711--720. http://doi.acm.org/10.1145/1460563.1460674","paperID":"None"},{"content":"Chad Edwards, Patric R. Spence, Christina J. Gentile, America Edwards, and Autumn Edwards. 2013. How much Klout do you have? a test of system generated cues on source credibility. Comput Hum Behav, 29(5), A12-A16.","paperID":"None"},{"content":"Facebook growth since IPO in 12 big numbers. Retrieved January 3, 2016 from http://techcrunch.com/2013/05/17/facebook-growth/","paperID":"None"},{"content":"Robert J. Fisher. 1993. Social desirability bias and the validity of indirect questioning. Journal of Consumer Research, 20(2), 303--315.","paperID":"None"},{"content":"Carolin Gerlitz and Anne Helmond. 2013. The Like economy: social buttons and the data-intensive web. New Media & Society.","paperID":"None"},{"content":"Ido Guy, Michal Jacovi, Noga Meshulam, Inbal Ronen, and Elad Shahar. 2008. Public vs. private: comparing public social network information with email. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08), 393--402. http://doi.acm.org/10.1145/1460563.1460627","paperID":"None"},{"content":"Ido Guy, Tal Steier, Maya Barnea, Inbal Ronen, and Tal Daniel. 2013. Finger on the pulse: the value of the activity stream in the enterprise. In Proceedings of Human Computer Interaction INTERACT '13, 411--428. http://dx.doi.org/10.1007/978--3--642--40498--6_32","paperID":"None"},{"content":"Keith Hampton, K.N., Lauren Session Goulet, Cameron Marlow, and Lee Rainie. 2012. Why most Facebook users get more than they give. Pew Internet & American Life Project, 3.","paperID":"None"},{"content":"Kyungsik Han, Jin Yea Jang, and Dongwon Lee. 2015. Exploring tag-based like networks. In Proceedings of the 33rd ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15), 1941--1946. http://doi.acm.org/10.1145/2702613.2732908","paperID":"None"},{"content":"David Hawking. 2004. Challenges in enterprise search. In Proceedings of the 15th Australasian database conference - Volume 27 (ADC '04), 15--24.","paperID":"None"},{"content":"Fei-Hui Huang. 2013. Motivations of Facebook users for responding to posts on a community page. In Online Communities and Social Computing, 33--39.","paperID":"None"},{"content":"\"I like this\". Retrieved January 3, 2016 from: https://www.facebook.com/notes/facebook/i-like-this/53024537130","paperID":"None"},{"content":"IBM Connections -- social software for business. Retrieved January 3, 2016 from: http://www-03.ibm.com/software/products/us/en/conn/","paperID":"None"},{"content":"Jin Yea Jang, Kyungsik Han, and Dongwon Lee. 2015. No reciprocity in \"liking\" photos: analyzing like activities in Instagram. In Proceedings of the 26th ACM Conference on Hypertext & Social Media (HT '15), 273--282. http://doi.acm.org/10.1145/2700171.2791043","paperID":"None"},{"content":"Jin Yea Jang, Kyungsik Han, Patrick C. Shih, and Dongwon Lee. 2015. Generation like: comparative characteristics in Instagram. In Proceedings of the 33rd ACM Conference on Human Factors in Computing Systems (CHI '15), 4039--4042. http://doi.acm.org/10.1145/2702123.2702555","paperID":"None"},{"content":"Xin Jin, Chi Wang, Jiebo Luo, Xiao Yu, and Jiawei Han. 2011. LikeMiner: a system for mining the power of 'like' in social media networks. In Proceedings of the 17th ACM SIGKDD international conference on Knowledge discovery and data mining (KDD '11), 753--756. http://doi.acm.org/10.1145/2020408.2020528","paperID":"None"},{"content":"Adam N. Joinson. 2008. Looking at, looking up or keeping up with peoples' motives and use of Facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 1027--1036. http://doi.acm.org/10.1145/1357054.1357213","paperID":"None"},{"content":"Cliff Lampe, Rick Wash, Alcides Velasquez, and Elif Ozkaya. 2010. Motivations to participate in online communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1927--1936. http://doi.acm.org/10.1145/1753326.1753616","paperID":"None"},{"content":"Dongwon Lee and Huan Liu. 2015. LIKE and recommendation in social media. In Proceedings of the 24th International Conference on World Wide Web (WWW '15 Companion), 1539--1540. http://dx.doi.org/10.1145/2740908.2741981","paperID":"None"},{"content":"Paul M. Leonardi, MArleen Huysman, and Charles Steinfield. 2013. Enterprise social media: definition, history, and prospects for study of social technologies in organizations. J. Com-Med Comm, 19(1), 1--19.","paperID":"None"},{"content":"Kristina Lerman. 2007. Social networks and social information filtering on Digg. In Proceedings of the AAAI international conference on Weblog and social media (ICWSM '07).","paperID":"None"},{"content":"Kuan-Yu Lin and Hsi-Peng Lu. 2011. Why people use social networking sites: An empirical study integrating network externalities and motivation theory. Comput. Hum. Behav. 27, 3 (May 2011), 1152--1161. http://dx.doi.org/10.1016/j.chb.2010.12.009","paperID":"None"},{"content":"Gloria Mark, Ido Guy, Shiri Kremer-Davidson, and Michal Jacovi. 2014. Most liked, fewest friends: patterns of enterprise social media use. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14), 393--404. http://doi.acm.org/10.1145/2531602.2531662","paperID":"None"},{"content":"Florian Meier, David Carig Elsweiler, and Max L. Wilson. 2014. More than liking and bookmarking? towards understanding twitter favouriting behaviour. In Proceedings of the eighth international AAAI conference on Weblogs and social media (ICWSM '14).","paperID":"None"},{"content":"Michael Muller, Kate Ehrlich, Tara Matthews, Adam Perer, Inbal Ronen, and Ido Guy. 2012. Diversity among enterprise online communities: collaborating, teaming, and innovating through social media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI '12), 2815--2824. http://doi.acm.org/10.1145/2207676.2208685","paperID":"None"},{"content":"News Feed FYI: A Window Into News Feed. Retrieved January 3, 2016 from http://www.facebook.com/business/news/News-Feed-FYI-A-Window-Into-News-Feed","paperID":"None"},{"content":"Tim Paek, Michael Gamon, Scott Counts, David Maxwell Chickering, and Adam Dhesi. 2010. Predicting the Importance of Newsfeed Posts and Social Network Friends. In Proceedings of the AAAI conference on Artificial intelligence (AAAI '10), 1419--1424.","paperID":"None"},{"content":"Namsu Park, Kerk F. Kee, and Sebastián Valenzuela. 2009. Being immersed in social networking environment: Facebook groups, uses and gratifications, and social Outcomes. Cyber Psychology & Behavior, 12(6): 729--733.","paperID":"None"},{"content":"Kai Riemer, Paul Scifleet, and Ruwen Reddig. 2012. Powercrowd: enterprise social networking in professional service work: a case study of Yammer at Deloitte Australia. Business and Information Systems (May 2012), 1738--1744.","paperID":"None"},{"content":"N. Sadat Shami et al. 2014. Understanding employee social media chatter with enterprise social pulse. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14), 379--392. http://doi.acm.org/10.1145/2531602.2531650","paperID":"None"},{"content":"Andrew D. Smock, Nicole B. Ellison, Cliff Lampe, and Donghee Yvette Wohn. 2011. Facebook as a toolkit: A uses and gratification approach to unbundling feature use. Comput. Hum. Behav. 27, 6 (November 2011), 2322--2329. http://dx.doi.org/10.1016/j.chb.2011.07.011","paperID":"None"},{"content":"Charles Steinfield, Joan M. DiMicco, Nicole B. Ellison, and Cliff Lampe. 2009. Bowling online: social networking and social capital within the organization. In Proceedings of the fourth international conference on Communities and technologies (C&T '09), 245--254. http://doi.acm.org/10.1145/1556460.1556496","paperID":"None"},{"content":"Bongwon Suh, Lichan Hong, Peter Pirolli, and Ed H. Chi. 2010. Want to be Retweeted? Large Scale Analytics on Factors Impacting Retweet in Twitter Network. In Proceedings of the 2010 IEEE Second International Conference on Social Computing (SOCIALCOM '10), 177--184. http://dx.doi.org/10.1109/SocialCom.2010.33","paperID":"None"},{"content":"The Value of a Liker. Retrieved January 3, 2016 from: https://www.facebook.com/note.php?note_id=150630338305797","paperID":"None"},{"content":"Jeffrey W. Treem and Paul M. Leonardi. 2012. Social media use in organizations: exploring the affordances of visibility, editability, persistence, and association. Commun yearbook, 36, 143--189.","paperID":"None"},{"content":"Anna K. Zarkada and Christina Polydorou. 2013. You might be reputable but are you \"liked\"? Orchestrating corporate reputation co-creation on Facebook. Advanced Series in Management, 11, 87--113.","paperID":"None"},{"content":"Jun Zhang, Yan Qu, Jane Cody, and Yulingling Wu. 2010. A case study of micro-blogging in the enterprise: use, value, and related issues. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 123--132. http://doi.acm.org/10.1145/1753326.1753346","paperID":"None"}],"title":"What is Your Organization 'Like'?: A Study of Liking Activity in the Enterprise","filename":"CHI16/p3025","authors":["Ido Guy","Inbal Ronen","Naama Zwerdling","Irena Zuyev-Grabovitch","Michal Jacovi"],"conference":"CHI '16"}