{"paperId":2858402,"citation":[],"abstract":"The rising prevalence of algorithmic interfaces, such as curated feeds in online news, raises new questions for designers, scholars, and critics of media. This work focuses on how transparent design of algorithmic interfaces can promote awareness and foster trust. A two-stage process of how transparency affects trust was hypothesized drawing on theories of information processing and procedural justice. In an online field experiment, three levels of system transparency were tested in the high-stakes context of peer assessment. Individuals whose expectations were violated (by receiving a lower grade than expected) trusted the system less, unless the grading algorithm was made more transparent through explanation. However, providing too much information eroded this trust. Attitudes of individuals whose expectations were met did not vary with transparency. Results are discussed in terms of a dual process model of attitude change and the depth of justification of perceived inconsistency. Designing for trust requires balanced interface transparency - not too little and not too much.","reference":[{"content":"Frank Bannister and Regina Connolly. 2011. The Trouble with Transparency: A Critical Review of Openness in e-Government. Policy & Internet 3, 1 (2011), 1--30.","paperID":"None"},{"content":"Bruce G Buchanan, Edward Hance Shortliffe, and others. 1984. Rule-based expert systems. Vol. 3. Addison-Wesley Reading, MA.","paperID":"None"},{"content":"Judee K Burgoon and Jerold L Hale. 1988. Nonverbal expectancy violations: Model elaboration and application to immediacy behaviors. Communications Monographs 55, 1 (1988), 58--79.","paperID":"None"},{"content":"Karen S Cook, Chris Snijders, Vincent Buskens, and Coye Cheshire. 2009. eTrust: Forming relationships in the online world. Russell Sage Foundation.","paperID":"None"},{"content":"Cynthia L Corritore, Beverly Kracher, and Susan Wiedenbeck. 2003. On-line trust: concepts, evolving themes, a model. International Journal of Human-Computer Studies 58, 6 (2003), 737--758.","paperID":"None"},{"content":"Henriette Cramer, Vanessa Evers, Satyan Ramlal, Maarten Van Someren, Lloyd Rutledge, Natalia Stash, Lora Aroyo, and Bob Wielinga. 2008. The effects of transparency on trust in and acceptance of a content-based art recommender. User Modeling and User-Adapted Interaction 18, 5 (2008), 455--496.","paperID":"None"},{"content":"Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. \"I always assumed that I wasn't really that close to [her]\": Reasoning about invisible algorithms in the news feed. In Proceedings of the 33rd Annual SIGCHI Conference on Human Factors in Computing Systems. 153--162.","paperID":"None"},{"content":"Alyssa Glass, Deborah L McGuinness, and Michael Wolverton. 2008. Toward establishing trust in adaptive agents. In Proceedings of the 13th international conference on Intelligent user interfaces. ACM, 227--236.","paperID":"None"},{"content":"Kevin Hamilton, Karrie Karahalios, Christian Sandvig, and Motahhare Eslami. 2014. A path to understanding the effects of algorithm awareness. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 631--642.","paperID":"None"},{"content":"Jonathan L Herlocker, Joseph A Konstan, and John Riedl. 2000. Explaining collaborative filtering recommendations. In Proceedings of the 2000 ACM conference on Computer supported cooperative work. ACM, 241--250.","paperID":"None"},{"content":"Hilary Johnson and Peter Johnson. 1993. Explanation facilities and interactive systems. In Proceedings of the 1st international conference on Intelligent user interfaces. ACM, 159--166.","paperID":"None"},{"content":"Julia H Kaufman and Christian D Schunn. 2011. Students' perceptions about peer assessment for writing: their origin and impact on revision work. Instructional Science 39, 3 (2011), 387--406.","paperID":"None"},{"content":"Jurgen Koenemann and Nicholas J Belkin. 1996. A case for interaction: a study of interactive information retrieval behavior and effectiveness. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 205--212.","paperID":"None"},{"content":"Chinmay Kulkarni, Koh Pang Wei, Huy Le, Daniel Chia, Kathryn Papadopoulos, Justin Cheng, Daphne Koller, and Scott R Klemmer. 2013. Peer and self assessment in massive online classes. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 6 (2013), 33.","paperID":"None"},{"content":"E Allan Lind and Tom R Tyler. 1988. The Social Psychology of Procedural Justice. Springer Science & Business Media.","paperID":"None"},{"content":"Jack Muramatsu and Wanda Pratt. 2001. Transparent Queries: investigation users' mental models of search engines. In Proceedings of the 24th annual international ACM SIGIR conference on Research and development in information retrieval. ACM, 217--224.","paperID":"None"},{"content":"Stephen J Payne. 2003. Users' mental models: the very ideas. HCI models, theories, and frameworks: Toward a multidisciplinary science (2003), 135--156.","paperID":"None"},{"content":"Richard E Petty and John T Cacioppo. 1986. The elaboration likelihood model of persuasion. Springer.","paperID":"None"},{"content":"Chris Piech, Jon Huang, Zhenghao Chen, Chuong Do, Andrew Ng, and Daphne Koller. 2013. Tuned Models of Peer Assessment in MOOCs. In Proceedings of the 6th International Conference on Educational Data Mining.","paperID":"None"},{"content":"Wolter Pieters. 2011. Explanation and trust: what to tell the user in security and AI? Ethics and information technology 13, 1 (2011), 53--64.","paperID":"None"},{"content":"Pearl Pu and Li Chen. 2007. Trust-inspiring explanation interfaces for recommender systems. Knowledge-Based Systems 20, 6 (2007), 542--556.","paperID":"None"},{"content":"Emilee Rader and Rebecca Gray. 2015. Understanding User Beliefs About Algorithmic Curation in the Facebook News Feed. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 173--182.","paperID":"None"},{"content":"Byron Reeves and Clifford Nass. 1996. How people treat computers, television, and new media like real people and places. CSLI Publications and Cambridge university press.","paperID":"None"},{"content":"Jens Riegelsberger, M Angela Sasse, and John D McCarthy. 2005. The mechanics of trust: A framework for research and design. International Journal of Human-Computer Studies 62, 3 (2005), 381--422.","paperID":"None"},{"content":"Philip M Sadler and Eddie Good. 2006. The impact of self-and peer-grading on student learning. Educational assessment 11, 1 (2006), 1--31.","paperID":"None"},{"content":"Kay Sambell, Liz McDowell, and Sally Brown. 1997. \"But is it fair?\": an exploratory study of student perceptions of the consequential validity of assessment. Studies in Educational Evaluation 23, 4 (1997), 349--371.","paperID":"None"},{"content":"Mien Segers and Filip Dochy. 2001. New assessment forms in problem-based learning: the value-added of the students' perspective. Studies in higher education 26, 3 (2001), 327--343.","paperID":"None"},{"content":"David K Sherman and Geoffrey L Cohen. 2002. Accepting threatening information: Self-Affirmation and the reduction of defensive biases. Current Directions in Psychological Science 11, 4 (2002), 119--123.","paperID":"None"},{"content":"Rashmi Sinha and Kirsten Swearingen. 2002. The role of transparency in recommender systems. In CHI'02 extended abstracts on Human factors in computing systems. ACM, 830--831.","paperID":"None"},{"content":"Candace Thille, Emily Schneider, Rene F Kizilcec, Christopher Piech, Sherif A Halawa, and Daniel K Greene. 2014. The future of data-enriched assessment. Research & Practice in Assessment 9, 2 (2014), 5--16.","paperID":"None"},{"content":"Weiquan Wang and Izak Benbasat. 2007. Recommendation agents for electronic commerce: Effects of explanation facilities on trusting beliefs. Journal of Management Information Systems 23, 4 (2007), 217--246.","paperID":"None"},{"content":"Meichun Lydia Wen and Chin-Chung Tsai. 2006. University students' perceptions of and attitudes toward (online) peer assessment. Higher Education 51, 1 (2006), 27--44.","paperID":"None"}],"title":"How Much Information?: Effects of Transparency on Trust in an Algorithmic Interface","filename":"CHI16/p2390","authors":["René F. Kizilcec"],"conference":"CHI '16"}