{"paperId":2858192,"citation":[],"reference":[{"content":"Anne Balsamo. 2011. Designing Culture: The Technological Imagination at Work. Duke University Press Books, Durham NC.","paperID":"None"},{"content":"Karen Barad. 2007. Meeting the Universe Halfway: Quantum Physics and the Entanglement of Matter and Meaning. Duke University Press Books.","paperID":"None"},{"content":"J. Berzowska and M. Coelho. 2005. Kukkia and Vilkas: kinetic electronic garments. Ninth IEEE International Symposium on Wearable Computers, 2005. Proceedings, 82--85. http://doi.org/10.1109/ISWC.2005.29","paperID":"None"},{"content":"Joanna Berzowska. 2004. Very Slowly Animating Textiles: Shimmering Flower. ACM SIGGRAPH 2004 Sketches, ACM, 34--. http://doi.org/10.1145/1186223.1186266","paperID":"None"},{"content":"Joanna Berzowska and Maksim Skorobogatiy. 2010. Karma Chameleon: Bragg Fiber Jacquard-woven Photonic Textiles. Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 297--298. http://doi.org/10.1145/1709886.1709950","paperID":"None"},{"content":"Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. 2008. The LilyPad Arduino: Using Computational Textiles to Investigate Engagement, Aesthetics, and Diversity in Computer Science Education. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 423--432. http://doi.org/10.1145/1357054.1357123","paperID":"None"},{"content":"Kathy Charmaz. 2006. Constructing Grounded Theory: A Practical Guide Through Qualitative Analysis. Pine Forge Press.","paperID":"None"},{"content":"Felecia Davis. 2015. The Textility of Emotion: A Study Relating Computational Textile Textural Expression to Emotion. Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition, ACM, 23--32. http://doi.org/10.1145/2757226.2757231","paperID":"None"},{"content":"Ylva Fernaeus and Petra Sundström. 2012. The Material Move How Materials Matter in Interaction Design Research. Proceedings of the Designing Interactive Systems Conference, ACM, 486--495. http://doi.org/10.1145/2317956.2318029","paperID":"None"},{"content":"Amisha Gadani. 2010. Porcupine Dress. Retrieved from http://www.amishagadani.com/Work/porcupine/index. html","paperID":"None"},{"content":"William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity As a Resource for Design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 233--240. http://doi.org/10.1145/642611.642653","paperID":"None"},{"content":"Hans-W. Gellersen, Albrecht Schmidt, and Michael Beigl. 1999. Ambient media for peripheral information display. Personal Technologies 3, 4: 199--208. http://doi.org/10.1007/BF01540553","paperID":"None"},{"content":"Erving Goffman. 1959. The Presentation of Self in Everyday Life. Anchor, New York.","paperID":"None"},{"content":"Lars Hallnäs and Johan Redström. 2001. Slow Technology -- Designing for Reflection. Personal Ubiquitous Comput. 5, 3: 201--212. http://doi.org/10.1007/PL00000019","paperID":"None"},{"content":"Lars Hallnäs and Johan Redström. 2002. From Use to Presence: On the Expressions and Aesthetics of Everyday Computational Things. ACM Trans. Comput.-Hum. Interact. 9, 2: 106--124. http://doi.org/10.1145/513665.513668","paperID":"None"},{"content":"Kate Hartman, Jackson McConnell, Boris Kourtoukov, Hillary Predko, and Izzie Colpitts-Campbell. 2015. Monarch: Self-Expression Through Wearable Kinetic Textiles. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 413--414. http://doi.org/10.1145/2677199.2690875","paperID":"None"},{"content":"Dick Hebdige. 1979. Subculture: The Meaning of Style. Routledge, London ; New York.","paperID":"None"},{"content":"Hiroshi Ishii, Craig Wisneski, Scott Brave, et al. 1998. ambientROOM: Integrating Ambient Media with Architectural Space. CHI 98 Cconference Summary on Human Factors in Computing Systems, ACM, 173--174. http://doi.org/10.1145/286498.286652","paperID":"None"},{"content":"Ivan Poupyrev, M. Emre Karagozler, Shiho Fukuhara, Carsten Schwesig, and Nan-Wei Gong. 2016. Project Jacquard: Manufacturing Digital Textiles at Scale. Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems, ACM.","paperID":"None"},{"content":"Heekyoung Jung and Erik Stolterman. 2011. Material Probe: Exploring Materiality of Digital Artifacts. Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 153--156. http://doi.org/10.1145/1935701.1935731","paperID":"None"},{"content":"Heekyoung Jung and Erik Stolterman. 2012. Digital Form and Materiality: Propositions for a New Approach to Interaction Design Research. Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, ACM, 645--654. http://doi.org/10.1145/2399016.2399115","paperID":"None"},{"content":"Viirj Kan, Katsuya Fujii, Judith Amores, Chang Long Zhu Jin, Pattie Maes, and Hiroshi Ishii. 2015. Social Textiles: Social Affordances and Icebreaking Interactions Through Wearable Social Messaging. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 619--624. http://doi.org/10.1145/2677199.2688816","paperID":"None"},{"content":"Judit Eszter Karpati. Chromosonic. Retrieved from http://chromosonic.tumblr.com/","paperID":"None"},{"content":"Sunyoung Kim, Eric Paulos, and Mark D. Gross. 2010. WearAir: Expressive T-shirts for Air Quality Sensing. Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 295--296. http://doi.org/10.1145/1709886.1709949","paperID":"None"},{"content":"Matthew Mauriello, Michael Gubbels, and Jon E. Froehlich. 2014. Social Fabric Fitness: The Design and Evaluation of Wearable E-textile Displays to Support Group Running. Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2833--2842. http://doi.org/10.1145/2556288.2557299","paperID":"None"},{"content":"John McCarthy, Peter Wright, Jayne Wallace, and Andy Dearden. 2006. The Experience of Enchantment in Human-Computer Interaction. Personal Ubiquitous Comput. 10, 6: 369--378. http://doi.org/10.1007/s00779-005-0055--2","paperID":"None"},{"content":"Linnéa Nilsson, Mika Satomi, Anna Vallgårda, and Linda Worbin. 2011. Understanding the complexity of designing dynamic textile patterns.","paperID":"None"},{"content":"Maggie Orth. 2009. 100 Electronic Art Years. Retrieved from http://www.maggieorth.com/art_100EAYears.html","paperID":"None"},{"content":"Roshan Lalintha Peiris, Owen Noel Newton Fernando, Chua Su Bee, Adrian David Cheok, Arij Glycin Ganesan, and Prabhash Kumarasinghe. 2011. dMarkers: Ubiquitous Dynamic Makers for Augmented Reality. Proceedings of the 10th International Conference on Virtual Reality Continuum and Its Applications in Industry, ACM, 217--224. http://doi.org/10.1145/2087756.2087787","paperID":"None"},{"content":"Laura Perovich, Philippa Mothersill, and Jennifer Broutin Farah. 2014. Awakened Apparel: Embedded Soft Actuators for Expressive Fashion and Functional Garments. Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction, ACM, 77--80. http://doi.org/10.1145/2540930.2540958","paperID":"None"},{"content":"Marianne Graves Petersen, Ole Sejer Iversen, Peter Gall Krogh, and Martin Ludvigsen. 2004. Aesthetic interaction: a pragmatist's aesthetics of interactive systems. Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques, ACM, 269--276. http://doi.org/10.1145/1013115.1013153","paperID":"None"},{"content":"E. R. Post, M. Orth, P. R. Russo, and N. Gershenfeld. 2000. E-broidery: Design and Fabrication of Textilebased Computing. IBM Syst. J. 39, 3--4: 840--860. http://doi.org/10.1147/sj.393.0840","paperID":"None"},{"content":"Zachary Pousman and John Stasko. 2006. A Taxonomy of Ambient Information Systems: Four Patterns of Design. Proceedings of the Working Conference on Advanced Visual Interfaces, ACM, 67--74. http://doi.org/10.1145/1133265.1133277","paperID":"None"},{"content":"Lisa Stead, Petar Goulev, Caroline Evans, and Ebrahim Mamdani. 2004. The Emotional Wardrobe. Personal Ubiquitous Comput. 8, 3--4: 282--290. http://doi.org/10.1007/s00779-004-0289--4","paperID":"None"},{"content":"Anna Vallgårda and Johan Redström. 2007. Computational Composites. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 513--522. http://doi.org/10.1145/1240624.1240706","paperID":"None"},{"content":"Akira Wakita and Midori Shibutani. 2006. Mosaic Textile: Wearable Ambient Display with Non-emissive Color-changing Modules. Proceedings of the 2006 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology, ACM. http://doi.org/10.1145/1178823.1178880","paperID":"None"},{"content":"Mark Weiser and John Seely Brown. 1996. Designing Calm Technology. POWERGRID JOURNAL 1.","paperID":"None"},{"content":"Mikael Wiberg, Hiroshi Ishii, Paul Dourish, et al. 2013. Materiality Matters--experience Materials. interactions 20, 2: 54--57. http://doi.org/10.1145/2427076.2427087","paperID":"None"},{"content":"Anouk Wipprecht. 2013. Spider Dress. Retrieved from http://fashioningtech.com/profiles/blogs/roboticcouture","paperID":"None"},{"content":"Peter Wright, Jayne Wallace, and John McCarthy. 2008. Aesthetics and experience-centered design. ACM Trans. Comput.-Hum. Interact. 15, 4: 18:1--18:21. http://doi.org/10.1145/1460355.1460360","paperID":"None"},{"content":"Google Jacquard. Retrieved from https://www.google.com/atap/project-jacquard/","paperID":"None"}],"abstract":"This paper explores the role dynamic textile displays play in relation to personal style: What does it mean to wear computationally responsive clothing and why would one be motivated to do so? We developed a novel textile display technology, called Ebb, and created several woven and crochet fabric swatches that explored clothing-specific design possibilities. We engaged fashion designers and non-designers in imagining how Ebb would integrate into their design practice or personal style of dressing. Participants evaluated the appeal and utility of clothing-based displays according to a very different set of criteria than traditional screen-based computational displays. Specifically, the slowness, low-resolution, and volatility of Ebb tended to be seen as assets as opposed to technical limitations in the context of personal style. Additionally, participants envisioned various ways that ambiguous, ambient, and abstract displays of information could prompt new experiences in their everyday lives. Our paper details the complex relationships between display and personal style and offers a new design metaphor and extension of Gaver et al.'s original descriptions of ambiguity in order to guide the design of clothing-based displays for everyday life.","title":"\"I don't Want to Wear a Screen\": Probing Perceptions of and Possibilities for Dynamic Displays on Clothing","filename":"CHI16/p6028","authors":["Laura Devendorf","Joanne Lo","Noura Howell","Jung Lin Lee","Nan-Wei Gong","M. Emre Karagozler","Shiho Fukuhara","Ivan Poupyrev","Eric Paulos","Kimiko Ryokai"],"conference":"CHI '16"}