{"paperId":2858344,"reference":[{"content":"Louise Barkhuus, Arvid Engström, Goranka Zoric 2014. Watching the footwork: Second Screen Interaction at a Dance and Music Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, pp. 1305--1314. DOI=10.1145/2556288.2557369","paperID":"None"},{"content":"Louise Barkhuus and Tobias Jørgensen. 2008. Engaging the crowd: studies of audience-performer interaction. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, NY, NY, USA, 2925--2930. DOI=10.1145/1358628.1358785","paperID":"None"},{"content":"Ben Bedwell, Holger Schnädelbach, Steve Benford, Tom Rodden, and Boriana Koleva. 2009. In support of city exploration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM: NY, pp. 1171--1180. DOI=10.1145/1518701.1518879","paperID":"None"},{"content":"Marek Bell, Matthew Chalmers, Louise Barkhuus, Malcolm Hall, Scott Sherwood, Paul Tennent, Barry Brown, Duncan Rowland, Steve Benford, Mauricio Capra, and Alastair Hampshire. 2006. Interweaving mobile games with everyday life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), ACM, NY, NY, USA, 417--426. DOI=10.1145/1124772.1124835","paperID":"None"},{"content":"Steve Benford, Andy Crabtree, Stuart Reeves, Jennifer Sheridan, Alan Dix, Martin Flintham, and Adam Drozd. 2006. The Frame of the Game: Blurring the Boundary between Fiction and Reality in Mobile Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), ACM, NY, NY, USA, 427--436. DOI=10.1145/1124772.1124836","paperID":"None"},{"content":"Steve Benford, Andy Crabtree, Martin Flintham, Adam Drozd, Rob Anastasi, Mark Paxton, Nick Tandavanitj, Matt Adams, and Ju Row-Farr. 200 Can you see me now? In ACM Transaction on. Computer.-Human. Interaction. 13, 1, pp. 100--133. DOI=10.1145/1143518.1143522","paperID":"None"},{"content":"Johannes H. Birringer (1999). Contemporary performance/technology. Theatre Journal, 51(4), pp. 361--381. DOI=10.1353/tj.1999.0079","paperID":"None"},{"content":"Gaetano Borriello, Matthew Chalmers, Anthony LaMarca, and Paddy Nixon. 2005. Delivering real-world ubiquitous location systems. Communications of the ACM 48, 3 (March 2005), 36--41. DOI=10.1145/1047671.1047701","paperID":"None"},{"content":"Susan Broadhurst 2004. Interaction, Reaction and Performance: The Jeremiah Project. TDR the Drama Review 48(4), December, pp.47--57. http://www.digitalcultures.org/Library/Jeremiah.pdf","paperID":"None"},{"content":"Teresa Cerratto-Pargman, Chiara Rossitto, Louise Barkhuus L. 2014. Understanding Audience Participation in an Interactive Theater Performance. In Proceedings of NordiCHI, the Proceedings of the 8th Nordic Conference on Human-Computer Interaction. (NordiCHI '14). ACM: NY, pp. 608--617. DOI=1145/2639189.2641213","paperID":"None"},{"content":"1Matthew Chalmers and Areti Galani. 2004. Seamful interweaving: heterogeneity in the theory and design of interactive systems. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '04). ACM, NY, NY, USA, 243--252. DOI=10.1145/1013115.1013149","paperID":"None"},{"content":"Andy Crabtree, Steve Benford, Tom Rodden, Chris Greenhalgh, Martin Flintham, Rob Anastasi, Adam Drozd, Matt Adams, Ju Row-Farr, Nick Tandavanitj, and Anthony Steed. 2004. Orchestrating a mixed reality game 'on the ground'. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, pp. 391--398. DOI=10.1145/985692.985742","paperID":"None"},{"content":"Andy Crabtree, Steve Benford, S, Mauricio Capra, Martin Flintham, Adam Drozd, Nick Tandavanitj, Matt Adams, and Row Farr, J. 2007. The Cooperative Work of Gaming: Orchestrating a Mobile SMS Game. Computer. Supported Cooperative. Work 16, 1--2, 167-DOI=198. 10.1007/s10606-007--9048--1","paperID":"None"},{"content":"Martin Flintham, Rob Anastasi, Steve Benford, Adam Drozd, James Mathrick, Duncan Rowland, Amanda Oldroyd and Jon Sutton. 2003. Uncle Roy all around you: mixing games and theatre on the city streets. In DIGRA Conference 2003.","paperID":"None"},{"content":"Lesley Fosh, Steve Benford, Stuart Reeves, Boriana Koleva, and Patrick Brundell. 2013. see me, feel me, touch me, hear me: trajectories and interpretation in a sculpture garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 149--158. DOI=10.1145/2470654.2470675","paperID":"None"},{"content":"Gasa Friederichs-Büttner, Benjamin Walther-Franks, Rainer Malaka. 2012. An unfinished drama: designing participation for the theatrical dance performance Parcival XX-XI. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM NY, pp.770--778. DOI=10.1145/2317956.2318072","paperID":"None"},{"content":"Michaela Honauer and Eva Hornecker. 2015. Challenges for Creating and Staging Interactive Costumes for the Theatre Stage. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15). ACM, NY, NY, USA, 13--22. DOI=10.1145/2757226.2757242","paperID":"None"},{"content":"Jonathan Hook, John McCarthy, Peter Wright, Patrick Oliver P. 2013. Waves: Exploring Idiographic Design for Live Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, pp. 2969--2978. DOI=10.1145/2470654.2481412","paperID":"None"},{"content":"Carlo Jacucci, Giulio Jacucci, Ina Wagner, and Thomas Psik. 2005. A manifesto for the performative development of ubiquitous media. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility (CC '05), ACM, NY, NY, USA, 19--28. DOI=10.1145/1094562.1094566","paperID":"None"},{"content":"Boriana Koleva, Ian Taylor, Steve Benford, Mike Fraser, Chris Greenhalgh, Holger Schnädelbach, Dirk vom Lehn, Christian Heath, Ju Row-Farr, and Matt Adams. 2001. Orchestrating a mixed reality performance. In Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, NY, NY, USA, 38--45. DOI=10.1145/365024.365033","paperID":"None"},{"content":"2Tuck Wah Leong and Peter Wright. 2013. Understanding 'tingle' in opera performances. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (OzCHI '13). ACM, NY, 43--52. DOI=10.1145/2541016.2541026","paperID":"None"},{"content":"2John Lofland, John, John Snow, David Anderson and Lyn H. Lofland. Analyzing social settings: A guide to qualitative observation and analysis. 4th edition. Belmont, CA: Wadsworth Publishing Company, 2005.","paperID":"None"},{"content":"Dan Maynes-Aminzade, Randy Pausch, and Steve Seitz. 2002. Techniques for interactive audience participation. In Proceedings of the 4th IEEE International Conference on Multimodal Interfaces, p. 15. IEEE Computer Society.","paperID":"None"},{"content":"Gary M. Olson and Judith S. Olson. 2000. Distance matters. Hum.-Comput. Interact. 15, 2 (September 2000), 139--178. DOI=10.1207/S15327051HCI1523_4","paperID":"None"},{"content":"Leif Oppermann, Martin Flintham, Stuart Reeves, Steve Benford, Chris Greenhalgh, Joe Marshall, Matt Adams, Ju Row Farr, and Nick Tandavanitj. 2011. Lessons from touring a location-based experience. In Proceedings of the 9th international conference on Pervasive computing (Pervasive'11). Springer-Verlag, Berlin, Heidelberg, 232--249. DOI=10.1007/978--3--642--21726--5_15","paperID":"None"},{"content":"Ian J. Palmer, Nicholas Chilton, Adam Robinson and Carlton Reeve. 2001. The Creation of an Interactive Virtual Theatre: The Mad Hatter's Tea Party. In Digital Content Creation, R. Earnshaw and J. Vince (ed.), pp. 184--201. Springer. DOI=10.1007/978--1--4471-0293--9_14","paperID":"None"},{"content":"Carlton Reeve. 2000. Presence in Virtual Theater. Carlton Reeve 2000. Presence in Virtual Theater. In the journal of Presence: Teleoperators and Virtual Environments, MIT Press Cambridge, MA, USA, pp. 209--213. DOI=10.1162/105474600566727","paperID":"None"},{"content":"Carlton Reeve and Ian Palmer. 1999. Virtual rehearsal over networks. In Digital Convergence: The Information Revolution, pp. 101--115. Springer London, 1999.","paperID":"None"},{"content":"Chiara Rossitto, Louise Barkhuus and Arvid Engström. 2016. Interweaving Place and Story in a Location-Based Audio Drama. To appear in Personal and Ubiquitous Computing. Springer Publishing.","paperID":"None"},{"content":"Qiong Wu, Pierre Boulanger, Maryia Kazakevich, and Robyn Taylor. 2010. A real-time performance system for virtual theater. In Proceedings of the 2010 ACM workshop on Surreal media and virtual cloning (SMVC '10). ACM, NY, NY, USA, 3--8.","paperID":"None"},{"content":"3Peter Wright and John McCarthy. 2010. Experience-centred Design: Designers, users, and communities in dialogue. Morgan & Claypool Publishers.","paperID":"None"},{"content":"3Takuro Yonezawa and Hideyuki Tokuda. 2012. Enhancing communication and dramatic impact of online live performance with cooperative audience control. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, NY, NY, USA, 103--112. DOI=10.1145/2370216.2370234","paperID":"None"},{"content":"Garth Zeglin, Aaron Walsman, Laura Herlant, Zhaodong Zheng, Yuyang Guo, Michael C. Koval, Kevin Lenzo et al. 2014. HERB's Sure Thing: A rapid drama system for rehearsing and performing live robot theater. In Advanced Robotics and its Social Impacts (ARSO), 2014 IEEE Workshop on, pp. 129--136. IEEE, 2014.","paperID":"None"}],"abstract":"Digital technologies provide theater with new possibilities for combining traditional stage-based performances with interactive artifacts, for streaming remote parallel performances and for other device facilitated audience interaction. Compared to traditional theater, mixed-media performances require a different type of engagement from the actors and rehearsing is challenging, as it can be impossible to rehearse with all the functional technology and interaction. Here, we report experiences from a case study of two mixed-media performances; we studied the rehearsal practices of two actors who were performing in two different plays. We describe how the actors practiced presence during rehearsal in a play where they would be geographically remote, and we describe the challenges of rehearsing with several remote and interactive elements. Our study informs the broader aims of interactive and mixed media performances through addressing critical factors of implementing technology into rehearsal practices.","title":"Acting with Technology: Rehearsing for Mixed-Media Live Performances","filename":"CHI16/p864","authors":["Louise Barkhuus","Chiara Rossitto"],"conference":"CHI '16","citation":[]}