{"paperId":2858140,"citation":[],"reference":[{"content":"K. Akeley, S.J Watt, A.R Girshick, and M.S Banks. 2004. A Stereo Display Prototype with Multiple Focal Distances. ACM Trans. Graph. 23, 3 (2004), 804--813.","paperID":"None"},{"content":"A. Back. 1995. Factors Influencing Success and Failure in Monovision. Int. Contact Lens Clinic 22, 7 (1995), 165--72.","paperID":"None"},{"content":"R. Bakeman. 2005. Recommended effect size statistics for repeated measures designs. Behavior research methods 37, 3 (2005), 379--384.","paperID":"None"},{"content":"B. A. Barsky and T. J. Kosloff. 2008. Algorithms for Rendering Depth of Field Effects in Computer Graphics. In Proc. Int. Conf. on Computers. 999--1010.","paperID":"None"},{"content":"J. P. Brooker and P.M. Sharkey. 2001. Operator performance evaluation of controlled depth of field in a stereographically displayed virtual environment. Proc. SPIE 4297 (2001), 408--417.","paperID":"None"},{"content":"WN Charman and G. Heron. 1988. Fluctuations in accommodation: a review. Ophthalmic & physiological optics 8, 2 (1988), 153--164.","paperID":"None"},{"content":"E. Dolgoff. 1997. Real-Depth imaging: a new 3D imaging technology with inexpensive direct-view (no glasses) video and other applications. Proc. SPIE 3012 (1997), 282--288.","paperID":"None"},{"content":"A. T. Duchowski, D. H. House, J. Gestring, R. I. Wang, K. Krejtz, I. Krejtz, R. Mantiuk, and B. Bazyluk. 2014. Reducing Visual Discomfort of 3D Stereoscopic Displays with Gaze-contingent Depth-of-field. In ACM Symposium on Applied Perception. 39--46.","paperID":"None"},{"content":"B. J. Evans. 2007. Monovision: a review. Ophthalmic and Physiological Optics 27, 5 (2007), 417--439.","paperID":"None"},{"content":"G.E. Favalora. 2005. Volumetric 3D Displays and Application Infrastructure. IEEE Computer 38, 8 (2005), 37--44.","paperID":"None"},{"content":"R. Gil-Cazorla, S. Shah, and S. A. Naroo. 2015. A review of the surgical options for the correction of presbyopia. British Journal of Ophthalmology (2015).","paperID":"None"},{"content":"E. Harb, F. Thorn, and D. Troilo. 2006. Characteristics of accommodative behavior during sustained reading in emmetropes and myopes. Vision Research 46, 16 (2006), 2581--92.","paperID":"None"},{"content":"M. G. Harris, J. E. Sheedy, and C. M. Gan. 1992. Vision and Task Performance with Monovision and Diffractive Bifocal Contact Lenses. Optometry and Vision Science 69, 8 (1992), 609--14.","paperID":"None"},{"content":"R. T. Held, E. A. Cooper, and M. S. Banks. 2012. Blur and Disparity Are Complementary Cues to Depth. Current Biology 22, 5 (2012), 426--431.","paperID":"None"},{"content":"S. Hillaire, A. Lecuyer, R. Cozot, and G. Casiez. 2008. Using an Eye-Tracking System to Improve Camera Motions and Depth-of-Field Blur Effects in Virtual Environments. In Proc. IEEE VR. 47--50.","paperID":"None"},{"content":"D. M. Hoffman and M. S. Banks. 2010. Focus information is used to interpret binocular images. Journal of Vision 10, 5 (2010), 13.","paperID":"None"},{"content":"X. Hu and H. Hua. 2014. Design and Assessment of a Depth-Fused Multi-Focal-Plane Display Prototype. Journal of Display Technology 10, 4 (2014), 308--316.","paperID":"None"},{"content":"F.C. Huang, K. Chen, and G. Wetzstein. 2015. The Light Field Stereoscope: Immersive Computer Graphics via Factored Near-Eye Light Field Display with Focus Cues. ACM Trans. Graph. (SIGGRAPH) 34, 4 (2015).","paperID":"None"},{"content":"A. Jones, I. McDowall, H. Yamada, M. Bolas, and P. Debevec. 2007. Rendering for an interactive 360° light field display. ACM Trans. Graph. (SIGGRAPH) 26, 3 (2007).","paperID":"None"},{"content":"M. Lambooij, M. Fortuin, I. Heynderickx, and W. IJsselsteijn. 2009. Visual Discomfort and Visual Fatigue of Stereoscopic Displays: A Review. Journal of Imaging Science and Technology 53, 3 (2009).","paperID":"None"},{"content":"D. Lanman, M. Hirsch, Y. Kim, and R. Raskar. 2010. Content-Adaptive Parallax Barriers: Optimizing Dual-Layer 3D Displays using Low-Rank Light Field Factorization. ACM Trans. Graph. (SIGGRAPH Asia) 29, 6 (2010), 163:1--163:10.","paperID":"None"},{"content":"D. Lanman and D. Luebke. 2013. Near-eye Light Field Displays. ACM Trans. Graph. (SIGGRAPH Asia) 32, 6 (2013), 220:1--220:10.","paperID":"None"},{"content":"S. Liu, D. Cheng, and H. Hua. 2008. An optical see-through head mounted display with addressable focal planes. In Proc. ISMAR. 33--42.","paperID":"None"},{"content":"P. Llull, N. Bedard, W. Wu, I. Tosic, K. Berkner, and N. Balram. 2015. Design and optimization of a near-eye multifocal display system for augmented reality. In OSA Imaging and Applied Optics.","paperID":"None"},{"content":"G.D. Love and M.S. Banks. 2014. Stereoscopic Image Generation with Asymmetric Level of Sharpness, Patent Application WO2014199127A1. (2014).","paperID":"None"},{"content":"G. D. Love, D. M. Hoffman, P. J. Hands, J. Gao, A. K. Kirby, and M. S. Banks. 2009. High-speed switchable lens enables the development of a volumetric stereoscopic display. Optics Express 17, 18 (2009), 15716--25.","paperID":"None"},{"content":"G. Maiello, M. Chessa, F. Solari, and P. J. Bex. 2014. Simulated disparity and peripheral blur interact during binocular fusion. Journal of Vision 14, 8 (2014).","paperID":"None"},{"content":"A. Maimone, G. Wetzstein, M. Hirsch, D. Lanman, R. Raskar, and H. Fuchs. 2013. Focus 3D: Compressive Accommodation Display. ACM Trans. Graphics 32, 5 (2013), 153:1--153:13.","paperID":"None"},{"content":"L. Marran and C. Schor. 1997. Multiaccommodative stimuli in VR systems: problems and solutions. Human Factors 39, 3 (1997), 382--388.","paperID":"None"},{"content":"M. Mauderer, S. Conte, M. A. Nacenta, and D. Vishwanath. 2014. Depth Perception with Gaze-contingent Depth of Field. ACM SIGCHI (2014).","paperID":"None"},{"content":"R. Narain, R. Albert, A. Bulbul, G. J. Ward, M. S. Banks, and J. F. O'Brien. 2015. Optimal Presentation of Imagery with Focus Cues on Multi-Plane Displays. ACM Trans. Graph. (SIGGRAPH) 34, 4 (2015).","paperID":"None"},{"content":"E. Peli. 1999. Optometric and perceptual issues with head-mounted displays. In Visual Instrumentation: Optical Design & Engineering Principles. McGraw-Hill.","paperID":"None"},{"content":"J. Rolland, M. Krueger, and A. Goon. 2000. Multifocal planes head-mounted displays. Applied Optics 39, 19 (2000), 3209--3215.","paperID":"None"},{"content":"J. Rolland and L. Vaissie. 2002. Head mounted display with eyetracking capability. U.S. Patent 6,433,760B1. (2002).","paperID":"None"},{"content":"B. Schowengerdt and E. Seibel. 2006. True 3-D scanned voxel displays using single or multiple light sources. J. SID 14, 2 (2006), 135--143.","paperID":"None"},{"content":"T. Shibata, J. Kim, D.M. Hoffman, and M.S. Banks. 2011. The zone of comfort: Predicting visual discomfort with stereo displays. Journal of Vision 11, 8 (2011), 11.","paperID":"None"},{"content":"S. Siegel. 1956. Nonparametric statistics for the behavioral sciences. McGraw-Hill.","paperID":"None"},{"content":"T. Sugihara and T. Miyasato. 1998. 32.4: A Lightweight 3-D HMD with Accommodative Compensation. SID Digest 29, 1 (1998), 927--930.","paperID":"None"},{"content":"A. Sullivan. 2003. A solid-state multi-planar volumetric display. SID Digest 34, 1 (2003), 1531--1533.","paperID":"None"},{"content":"I. E. Sutherland. 1968. A Head-mounted Three Dimensional Display. In Proc. Fall Joint Computer Conference. 757--764.","paperID":"None"},{"content":"M. Waldkirch, P. Lukowicz, and G. Tröster. 2004. Multiple imaging technique for extending depth of focus in retinal displays. Optics Express 12, 25 (2004).","paperID":"None"},{"content":"S. J. Watt, K. Akeley, M. O. Ernst, and M. S. Banks. 2005. Focus cues affect perceived depth. Journal of Vision 5, 7 (2005), 834--862.","paperID":"None"},{"content":"G. Wetzstein, D. Lanman, M. Hirsch, and R. Raskar. 2012. Tensor Displays: Compressive Light Field Synthesis using Multilayer Displays with Directional Backlighting. ACM Trans. Graph. (SIGGRAPH) 31, 4 (2012), 1--11.","paperID":"None"},{"content":"T. Zhou, J. X. Chen, and M. Pullen. 2007. Accurate Depth of Field Simulation in Real Time. Computer Graphics Forum 26, 1 (2007), 15--23.","paperID":"None"}],"abstract":"Emerging virtual reality (VR) displays must overcome the prevalent issue of visual discomfort to provide high-quality and immersive user experiences. In particular, the mismatch between vergence and accommodation cues inherent to most stereoscopic displays has been a long standing challenge. In this paper, we evaluate several adaptive display modes afforded by focus-tunable optics or actuated displays that have the promise to mitigate visual discomfort caused by the vergence-accommodation conflict, and improve performance in VR environments. We also explore monovision as an unconventional mode that allows each eye of an observer to accommodate to a different distance. While this technique is common practice in ophthalmology, we are the first to report its effectiveness for VR applications with a custom built set up. We demonstrate that monovision and other focus-tunable display modes can provide better user experiences and improve user performance in terms of reaction times and accuracy, particularly for nearby simulated distances in VR.","title":"Novel Optical Configurations for Virtual Reality: Evaluating User Preference and Performance with Focus-tunable and Monovision Near-eye Displays","filename":"CHI16/p1211","authors":["Robert Konrad","Emily A. Cooper","Gordon Wetzstein"],"conference":"CHI '16"}