{"paperId":2858142,"citation":[],"abstract":"The negative effect of lapses during a behavior-change program has been shown to increase the risk of repeated lapses and, ultimately, program abandonment. In this paper, we examine the potential of system-driven lapse management -- supporting users through lapses as part of a behavior-change tool. We first review lessons from domains such as dieting and addiction research and discuss the design space of lapse management. We then explore the value of one approach to lapse management -- the use of \"cheat points\" -- as a way to encourage sustained participation. In an online study, we first examine interpretations of progress that was reached through using cheat points. We then present findings from a deployment of lapse management in a two-week field study with 30 participants. Our results demonstrate the potential of this approach to motivate and change users' behavior. We discuss important open questions for the design of future technology-mediated behavior change programs.","reference":[{"content":"Anja Achtziger, Ute C. Bayer, and Peter M. Gollwitzer. 2012. Committing to implementation intentions: Attention and memory effects for selected situational cues. Motivation and Emotion 36, 3: 287--300. http://dx.doi.org/10.1007/s11031-011--9261--6","paperID":"None"},{"content":"Austin S. Baldwin, Alexander J. Rothman, Andrew W. Hertel, Jennifer A. Linde, Robert W. Jeffery, Emily A. Finch, and Harry A. Lando. 2006. Specifying the determinants of the initiation and maintenance of behavior change: an examination of self-efficacy, satisfaction, and smoking cessation. Health Psychology 25, 5: 626. http://dx.doi.org/10.1037/0278--6133.25.5.626","paperID":"None"},{"content":"Albert Bandura. 1977. Self-efficacy: toward a unifying theory of behavioral change. Psychological review 84, 2: 191--215. http://dx.doi.org/10.1037/0033--295X.84.2.191","paperID":"None"},{"content":"Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding quantified-selfers' practices in collecting and exploring personal data. Proceedings of the 32nd annual ACM conference on Human factors in computing systems, ACM, 1143--1152. http://dx.doi.org/10.1145/2556288.2557372","paperID":"None"},{"content":"James Clawson, Jessica A. Pater, Andrew D. Miller, Elizabeth D. Mynatt, and Lena Mamykina. 2015. No longer wearing: investigating the abandonment of personal health-tracking technologies on craigslist. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 647--658. http://dx.doi.org/10.1145/2750858.2807554","paperID":"None"},{"content":"Sunny Consolvo, Predrag Klasnja, David W. McDonald, Daniel Avrahami, Jon Froehlich, Louis LeGrand, Ryan Libby, Keith Mosher, and James A. Landay. 2008. \"Flowers or a robot army?: encouraging awareness & activity with personal, mobile displays.\" In Proceedings of the 10th international conference on Ubiquitous computing, 54--63. http://dx.doi.org/10.1145/1409635.1409644","paperID":"None"},{"content":"Felicia Cordeiro, Daniel A. Epstein, Edison Thomaz, Elizabeth Bales, Arvind Jagannathan, Gregory Abowd, and James Fogarty. 2015. Barriers and Negative Nudges: Exploring Challenges in Food Journaling. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1159--1162. http://dx.doi.org/10.1145/2702123.2702155","paperID":"None"},{"content":"Duolingo: http://www.duolingo.com","paperID":"None"},{"content":"Daniel Epstein, Felicia Cordeiro, Elizabeth Bales, James Fogarty, and Sean Munson. 2014. Taming data complexity in lifelogs: exploring visual cuts of personal informatics data. Proceedings of the 2014 conference on Designing interactive systems, ACM, 667--676. http://dx.doi.org/10.1145/2598510.2598558","paperID":"None"},{"content":"Fitbit: http://www.fitbit.com","paperID":"None"},{"content":"InterviewBit: http://www.interviewbit.com","paperID":"None"},{"content":"Ira Flatow. \"Making Resolutions that Stick.\" National Public Radio. http://www.npr.org/2012/12/28/168203195/makingresolutions-that-stick (Accessed September 18, 2015).","paperID":"None"},{"content":"Benjamin Gardner, Kate Sheals, Jane Wardle, and Laura McGowan. 2014. Putting habit into practice, and practice into habit: a process evaluation and exploration of the acceptability of a habit-based dietary behaviour change intervention. International Journal of Behavioral Nutrition and Physical Activity 11, 1: 135. http://dx.doi.org/10.1186/s12966-014-0135--7","paperID":"None"},{"content":"Peter M. Gollwitzer. 2014. Weakness of the will: Is a quick fix possible? Motivation and Emotion 38, 3: 305--322. http://dx.doi.org/ 10.1007/s11031-014--9416--3","paperID":"None"},{"content":"Peter M. Gollwitzer and Bernd Schaal. 1998. Metacognition in action: The importance of implementation intentions. Personality and Social Psychology Review 2, 2: 124--136. http://dx.doi.org/10.1207/s15327957pspr0202_5","paperID":"None"},{"content":"Rúben Gouveia, Evangelos Karapanos, and Marc Hassenzahl. 2015. How do we engage with activity trackers?: a longitudinal study of Habito. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 1305--1316. http://dx.doi.org/10.1145/2750858.2804290","paperID":"None"},{"content":"Richard Koestner, Natasha Lekes, Theodore A. Powers, and Emanuel Chicoine. 2002. Attaining personal goals: self-concordance plus implementation intentions equals success. Journal of Personality and Social Psychology 83, 1: 231--244. http://dx.doi.org/10.1037/0022--3514.83.1.231","paperID":"None"},{"content":"Artie Konrad, Victoria Bellotti, Nicole Crenshaw, Simon Tucker, Les Nelson, Honglu Du, Peter Pirolli, and Steve Whittaker. 2015. Finding the Adaptive Sweet Spot: Balancing Compliance and Achievement in Automated Stress Reduction. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3829--3838. http://dx.doi.org/10.1145/2702123.2702512","paperID":"None"},{"content":"Amanda Lazar, Christian Koehler, Joshua Tanenbaum, and David H. Nguyen. 2015. Why we use and abandon smart devices. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 635--646. http://dx.doi.org/10.1145/2750858.2804288","paperID":"None"},{"content":"James J. Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B. Strub. 2006. \"Fish 'n' Steps: Encouraging physical activity with an interactive computer game.\" In UbiComp 2006: Ubiquitous Computing, 261--278. http://dx.doi.org/10.1007/11853565_16","paperID":"None"},{"content":"Yikun Liu, Yuan Jia, Wei Pan, and Mark S. Pfaff. 2014. Supporting task resumption using visual feedback. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, ACM, 767--777. http://dx.doi.org/10.1145/2531602.2531710","paperID":"None"},{"content":"G. Alan Marlatt. 1996. Taxonomy of high-risk situations for alcohol relapse: evolution and development of a cognitive-behavioral model. Addiction 91, Supplement 1 to Issue 12: 37--50. http://dx.doi.org/10.1111/j.1360-0443.1996.tb02326.x","paperID":"None"},{"content":"G. Alan Marlatt, John S. Baer, and Lori A. Quigley. 1997. 10. Self-efficacy and addictive behavior. Selfefficacy in changing societies: 289--315. http://dx.doi.org/10.1007/978--1--4419--6868--5_4","paperID":"None"},{"content":"G. Alan Marlatt and Dennis Michael Donovan. 2005. Relapse prevention: Maintenance strategies in the treatment of addictive behaviors. Guilford Press.","paperID":"None"},{"content":"Susan Michie, Michelle Richardson, Marie Johnston, Charles Abraham, Jill Francis, Wendy Hardeman, Martin Eccles, James Cane, Caroline E. Wood. 2013. The behavior change technique taxonomy (v1) of 93 hierarchically clustered techniques: building an international consensus for the reporting of behavior change interventions. Annals of behavioral medicine 46, 1: 81--95. http://dx.doi.org/10.1007/s12160-013--9486--6","paperID":"None"},{"content":"Sean A. Munson and Sunny Consolvo. 2012. Exploring goal-setting, rewards, self-monitoring, and sharing to motivate physical activity. Pervasive Computing Technologies for Healthcare (PervasiveHealth), 2012 6th International Conference on, IEEE, 25--32. http://dx.doi.org/10.4108/icst.pervasivehealth.2012.248","paperID":"None"},{"content":"Jeni Paay, Jesper Kjeldskov, Mikael B. Skov, Nirojan Srikandarajah, and Umachanger Brinthaparan. 2015. Personal Counseling on Smart Phones For Smoking Cessation. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 1427--1432. http://dx.doi.org/10.1145/2702613.2732847","paperID":"None"},{"content":"James O. Prochaska and Wayne F. Velicer. 1997. The transtheoretical model of health behavior change. American journal of health promotion 12, 1: 38--48. http://dx.doi.org/10.4278/0890--1171--12.1.38","paperID":"None"},{"content":"Manya Sleeper, Alessandro Acquisti, Lorrie Faith Cranor, Patrick Gage Kelley, Sean A. Munson, and Norman Sadeh. 2015. I Would Like To..., I Shouldn't..., I Wish I...: Exploring Behavior-Change Goals for Social Networking Sites. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1058--1069. http://dx.doi.org/10.1145/2675133.2675193","paperID":"None"},{"content":"Tammy Toscos, Sunny Consolvo, and David W. McDonald. 2011. Barriers to physical activity: A study of self-revelation in an online community. Journal of medical systems 35, 5: 1225--1242. http://dx.doi.org/10.1007/s10916-011--9721--2","paperID":"None"},{"content":"Greg Walsh and Jennifer Golbeck. 2014. Stepcity: a preliminary investigation of a personal informaticsbased social game on behavior change. CHI'14 Extended Abstracts on Human Factors in Computing Systems, ACM, 2371--2376. http://dx.doi.org/10.1145/2559206.2581326","paperID":"None"},{"content":"Weight Watchers message board. \"Cheat days?\" http://www.weightwatchers.com/community/mbd/post.aspx?page_size=25&rownum=15&threadpage_no=1&thread_id=169887989&board_id=1&forum_id=1 (Accessed September 18, 2015).","paperID":"None"},{"content":"Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 143--146. http://dx.doi.org/10.1145/1978942.1978963","paperID":"None"},{"content":"Rayoung Yang, Eunice Shin, Mark W. Newman, and Mark S. Ackerman. 2015. When fitness trackers don't 'fit': end-user difficulties in the assessment of personal tracking device accuracy. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 623--634. http://dx.doi.org/10.1145/2750858.2804269","paperID":"None"}],"title":"Staying the Course: System-Driven Lapse Management for Supporting Behavior Change","filename":"CHI16/p1072","authors":["Elena Agapie","Daniel Avrahami","Jennifer Marlow"],"conference":"CHI '16"}