{"paperId":2858048,"citation":[],"reference":[{"content":"Brian P. Bailey, Jacob T. Biehl, Damon J. Cook, and Heather Metcalf. 2008. Adapting paper prototyping for designing user interfaces for multiple display environments. PUC 12, 3 (2008), 269-277. DOI: http://dx.doi.org/10.1007/s00779-007-0147--2","paperID":"None"},{"content":"Nilton Bila, Troy Ronda, Iqbal Mohomed, Khai N. Truong, and Eyal de Lara. 2007. PageTailor: Reusable End-User Customization for the Mobile Web. In Proc. MobiSys. 16-29. DOI: http://dx.doi.org/10.1145/1247660.1247666","paperID":"None"},{"content":"Nicholas Chen, Francois Guimbreti'ere, and Abigail Sellen. 2013. Graduate Student Use of a Multi-Slate Reading System. In Proc. CHI. 1799-1808. DOI: http://dx.doi.org/10.1145/2470654.2466237","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Tovi Grossman, Daniel J. Wigdor, and George W. Fitzmaurice. 2014. Duet: Exploring Joint Interactions on a Smart Phone and a Smart Watch. In Proc. CHI. 159-168. DOI: http://dx.doi.org/10.1145/2556288.2556955","paperID":"None"},{"content":"Pei-Yu (Peggy) Chi and Yang Li. 2015. Weave: Scripting Cross-Device Wearable Interaction. In Proc. CHI. 3923-3932. DOI: http://dx.doi.org/10.1145/2702123.2702451","paperID":"None"},{"content":"David Dearman and Jeffrey S. Pierce. 2008. It's on my other computer!: computing with multiple devices. In Proc. CHI. 767-776. DOI: http://dx.doi.org/10.1145/1357054.1357177","paperID":"None"},{"content":"Eli Raymond Fisher, Sriram Karthik Badam, and Niklas Elmqvist. 2014. Designing peer-to-peer distributed user interfaces: Case studies on building distributed applications. IJHCS 72, 1 (2014), 100-110. DOI: http://dx.doi.org/10.1016/j.ijhcs.2013.08.011","paperID":"None"},{"content":"Luca Frosini and Fabio Patern'o. 2014. User Interface Distribution in Multi-Device and Multi-User Environments with Dynamically Migrating Engines. In Proc. EICS. 55-64. DOI: http://dx.doi.org/10.1145/2607023.2607032","paperID":"None"},{"content":"Giuseppe Ghiani, Fabio Patern'o, and Carmen Santoro. 2012. Push and Pull of Web User Interfaces in Multi-Device Environments. In Proc. AVI. 10-17. DOI: http://dx.doi.org/10.1145/2254556.2254563","paperID":"None"},{"content":"Giuseppe Ghiani, Fabio Patern'o, and Carmen Santoro. 2013. Interactive Customization of Ubiquitous Web Applications. VLC 24, 1 (2013), 37-52. DOI: http://dx.doi.org/10.1016/j.jvlc.2012.10.005","paperID":"None"},{"content":"Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: Enabling and Understanding Cross-Device Interaction. In Proc. CHI. 2773-2782. DOI: http://dx.doi.org/10.1145/2556288.2557170","paperID":"None"},{"content":"Tommi Heikkinen, Jorge Goncalves, Vassilis Kostakos, Ivan Elhart, and Timo Ojala. 2014. Tandem Browsing Toolkit: Distributed Multi-Display Interfaces with Web Technologies. In Proc. PerDis. 142-147. DOI: http://dx.doi.org/10.1145/2611009.2611026","paperID":"None"},{"content":"Steven Houben and Nicolai Marquardt. 2015. WatchConnect: A Toolkit for Prototyping Smartwatch-Centric Cross-Device Applications. In Proc. CHI. 1247-1256. DOI: http://dx.doi.org/10.1145/2702123.2702215","paperID":"None"},{"content":"Maria Husmann, Michael Nebeling, Stefano Pongelli, and Moira C. Norrie. 2014. MultiMasher: Providing Architectural Support and Visual Tools for Multi-Device Mashups. In Proc. WISE. 199-214. DOI: http://dx.doi.org/10.1007/978--3--319--11746--1_15","paperID":"None"},{"content":"Heather M. Hutchings and Jeffrey S. Pierce. 2006. Understanding the Whethers, Hows, and Whys of Divisible Interfaces. In Proc. AVI. 274-277. DOI: http://dx.doi.org/10.1145/1133265.1133320","paperID":"None"},{"content":"Brad Johanson, Shankar Ponnekanti, Caesar Sengupta, and Armando Fox. 2001. Multibrowsing: Moving Web Content across Multiple Displays. In Proc. Ubicomp. 346-353. DOI: http://dx.doi.org/10.1007/3--540--45427--6_29","paperID":"None"},{"content":"Tero Jokela, Jarno Ojala, and Thomas Olsson. 2015. A Diary Study on Combining Multiple Information Devices in Everyday Activities and Tasks. In Proc. CHI. 3903-3912. DOI: http://dx.doi.org/10.1145/2702123.2702211","paperID":"None"},{"content":"Shaun K. Kane, Amy K. Karlson, Brian Meyers, Paul Johns, Andy Jacobs, and Greg Smith. 2009. Exploring Cross-Device Web Use on PCs and Mobile Devices. In Proc. INTERACT. 722-735. DOI: http://dx.doi.org/10.1007/978--3--642-03655--2_79","paperID":"None"},{"content":"Amy K. Karlson, Shamsi T. Iqbal, Brian Meyers, Gonzalo Ramos, Kathy Lee, and John C. Tang. 2010. Mobile Taskflow in Context: A Screenshot Study of Smartphone Usage. In Proc. CHI. 2009-2018. DOI: http://dx.doi.org/10.1145/1753326.1753631","paperID":"None"},{"content":"Amy K. Karlson, Brian Meyers, Andy Jacobs, Paul Johns, and Shaun K. Kane. 2009. Working Overtime: Patterns of Smartphone and PC Usage in the Day of an Information Worker. In Proc. Pervasive. 398-405. DOI: http://dx.doi.org/10.1007/978--3--642-01516--8_27","paperID":"None"},{"content":"Gilly Leshed, Eben M. Haber, Tara Matthews, and Tessa A. Lau. 2008. CoScripter: Automating & Sharing How-To Knowledge in the Enterprise. In Proc. CHI. 1719-1728. DOI: http://dx.doi.org/10.1145/1357054.1357323","paperID":"None"},{"content":"James Lin and James A. Landay. 2008. Employing Patterns and Layers for Early-Stage Design and Prototyping of Cross-Device User Interfaces. In Proc. CHI. 1313-1322. DOI: http://dx.doi.org/10.1145/1357054.1357260","paperID":"None"},{"content":"Jan Meskens, Kris Luyten, and Karin Coninx. 2010. DMacs: Building Multi-Device User Interfaces by Demonstrating, Sharing and Replaying Design Actions. In Proc. UIST. 129-138. DOI: http://dx.doi.org/10.1145/1866029.1866051","paperID":"None"},{"content":"Jan Meskens, Jo Vermeulen, Kris Luyten, and Karin Coninx. 2008. Gummy for Multi-Platform User Interface Designs: Shape me, Multiply me, Fix me, Use me. In Proc. AVI. 233-240. DOI: http://dx.doi.org/10.1145/1385569.1385607","paperID":"None"},{"content":"Michael Nebeling, Theano Mintsi, Maria Husmann, and Moira C. Norrie. 2014. Interactive Development of Cross-Device User Interfaces. In Proc. CHI. 2793-2802. DOI:http://dx.doi.org/10.1145/2556288.2556980","paperID":"None"},{"content":"Michael Nebeling, Maximilian Speicher, and Moira C. Norrie. 2013. CrowdAdapt: Crowdsourced Web Page Adaptation for Individual Viewing Conditions and Preferences. In Proc. EICS. 23-32. DOI: http://dx.doi.org/10.1145/2480296.2480304","paperID":"None"},{"content":"Jeffrey Nichols, Zhigang Hua, and John Barton. 2008. Highlight: A System for Creating and Deploying Mobile Web Applications. In Proc. UIST. 249-258. DOI: http://dx.doi.org/10.1145/1449715.1449757","paperID":"None"},{"content":"Antti Oulasvirta and Lauri Sumari. 2007. Mobile Kits and Laptop Trays: Managing Multiple Devices in Mobile Information Work. In Proc. CHI. 1127-1136. DOI: http://dx.doi.org/10.1145/1240624.1240795","paperID":"None"},{"content":"Roman Rädle, Hans-Christian Jetter, Mario Schreiner, Zhihao Lu, Harald Reiterer, and Yvonne Rogers. 2015. Spatially-aware or Spatially-agnostic?: Elicitation and Evaluation of User-Defined Cross-Device Interactions. In Proc. CHI. 3913-3922. DOI: http://dx.doi.org/10.1145/2702123.2702287","paperID":"None"},{"content":"Stephanie Santosa and Daniel Wigdor. 2013. A Field Study of Multi-Device Workflows in Distributed Workspaces. In Proc. UbiComp. 63-72. DOI: http://dx.doi.org/10.1145/2493432.2493476","paperID":"None"},{"content":"Dominik Schmidt, Julian Seifert, Enrico Rukzio, and Hans Gellersen. 2012. A Cross-Device Interaction Style for Mobiles and Surfaces. In Proc. DIS. 318-327. DOI: http://dx.doi.org/10.1145/2317956.2318005","paperID":"None"},{"content":"Teddy Seyed, Chris Burns, Mario Costa Sousa, Frank Maurer, and Anthony Tang. 2012. Eliciting Usable Gestures for Multi-Display Environments. In Proc. ITS. 41-50. DOI: http://dx.doi.org/10.1145/2396636.2396643","paperID":"None"},{"content":"Desney S. Tan, Brian Meyers, and Mary Czerwinski. 2004. WinCuts: Manipulating Arbitrary Window Regions for More Effective Use of Screen Space. In Proc. CHI EA. 1525-1528. DOI: http://dx.doi.org/10.1145/985921.986106","paperID":"None"},{"content":"Minna Waljas, Katarina Segersthl, Kaisa Vaananen-Vainio-Mattila, and Harri Oinas-Kukkonen. 2010. Cross-Platform Service User Experience: A Field Study and an Initial Framework. In Proc. Mobile HCI. 219-228. DOI: http://dx.doi.org/10.1145/1851600.1851637","paperID":"None"},{"content":"Heather Wiltse and Jeffrey Nichols. 2009. PlayByPlay: Collaborative Web Browsing for Desktop and Mobile Devices. In Proc. CHI. 1781-1790. http://doi.acm.org/10.1145/1518701.1518975","paperID":"None"},{"content":"Jishuo Yang and Daniel Wigdor. 2014. Panelrama: Enabling Easy Specification of Cross-Device Web Applications. In Proc. CHI. 2783-2792. DOI: http://dx.doi.org/10.1145/2556288.2557199","paperID":"None"}],"abstract":"There is a significant gap in the body of research on cross-device interfaces. Research has largely focused on enabling them technically, but when and how users want to use cross-device interfaces is not well understood. This paper presents an exploratory user study with XDBrowser, a cross-device web browser we are developing to enable non-technical users to adapt existing single-device web interfaces for cross-device use while viewing them in the browser. We demonstrate that an end-user customization tool like XDBrowser is a powerful means to conduct user-driven elicitation studies useful for understanding user preferences and design requirements for cross-device interfaces. Our study with 15 participants elicited 144 desirable multi-device designs for five popular web interfaces when using two mobile devices in parallel. We describe the design space in this context, the usage scenarios targeted by users, the strategies used for designing cross-device interfaces, and seven concrete mobile multi-device design patterns that emerged. We discuss the method, compare the cross-device interfaces from our users and those defined by developers in prior work, and establish new requirements from observed user behavior. In particular, we identify the need to easily switch between different interface distributions depending on the task and to have more fine-grained control over synchronization.","title":"XDBrowser: User-Defined Cross-Device Web Page Designs","filename":"CHI16/p5494","authors":["Michael Nebeling","Anind K. Dey"],"conference":"CHI '16"}