{"paperId":2858511,"citation":[],"reference":[{"content":"John L. Andreassi. 2013. Psychophysiology: Human behavior & physiological response. Psychology Press.","paperID":"None"},{"content":"Terence S. Andre, Rex Hartson, Steven M. Belz, and Faith A. McCreary. 2001. The user action framework: a reliable foundation for usability engineering support tools. International Journal of Human-Computer Studies 54, 107--136","paperID":"None"},{"content":"Abram Amsel. 1992. Frustration theory: An analysis of dispositional learning and memory, No. 11. Cambridge University Press.","paperID":"None"},{"content":"Thomas Baekdal. Usability Severity Rating - Improved. Retrieved July 12, 2015 from http://www.baekdal.com/articles/Usability/usabilityseverity-rating/","paperID":"None"},{"content":"Tood Bentley Lorraine Johnston, and Karola von Baggo. 2005. Evaluation using cued-recall debrief to elicit information about a user's affective experiences.\" In Proceedings of the Australia Conference on Computer-Human Interaction (OzCHI'05), pp. 1--10.","paperID":"None"},{"content":"Katie Bessiere, John E. Newhagen, John P. Robinson, and Ben Shneiderman. 2006. A model for computer frustration: The role of instrumental and dispositional factors on incident, session, and post-session frustration and mood. Computers in Human Behavior, 22, 941--961.","paperID":"None"},{"content":"Wolfram Boucsein. 2012. Electrodermal activity. Springer.","paperID":"None"},{"content":"Kirsten Boehner, Rogério DePaula, Paul Dourish, and Phoebe Sengers. 2007. How emotion is made and measured.\" International Journal of Human-Computer Studies, 65, 275--291.","paperID":"None"},{"content":"Margaret M. Bradley and Peter J. Lang. 1994. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of behavior therapy and experimental psychiatry, 25(1), 49--59.","paperID":"None"},{"content":"Anders Bruun and Simon Ahm. 2015. Mind the Gap! Comparing Retrospective and Concurrent Ratings of Emotion in User Experience Evaluation. In Proceedings of INTERACT 2015.","paperID":"None"},{"content":"John T Cacioppo and Wendi L. Gardner. Emotion. 1999. Annual Review of Psychology, 50 (1), 191--214.","paperID":"None"},{"content":"John T Cacioppo, Louis G. Tassinary, and Gary Berntson (Eds.). 2007. Handbook of psychophysiology (3rd Edition). Cambridge University Press.","paperID":"None"},{"content":"Andy Cockburn, Philip Quinn, and Carl Gutwin. 2015. Examining the Peak-End Effects of Subjective Experience. In Proceedings of Conference on Human Factors in Computing Systems (CHI'15), 357--366","paperID":"None"},{"content":"Michael E. Dawson, Anne M. Schell, and Diane L. Filion. Chapter 7: The Electrodermal System, In Handbook of psychophysiology, pp. 159--181. Cambridge University Press.","paperID":"None"},{"content":"Amy M. Do, Alexander V. Rupert, and George Wolford. 2008. Evaluations of pleasurable experiences: The peak-end rule. Psychonomic Bulletin & Review,15, 96--98.","paperID":"None"},{"content":"Andrew Duchowski. 2007. Eye tracking methodology: Theory and practice. Springer.","paperID":"None"},{"content":"Joseph S. Dumas and Janice Redish. 1999. A Practical Guide to Usability Testing. Intellect Books.","paperID":"None"},{"content":"Panteleimon. Ekkekakis. 2013. The measurement of affect, mood, and emotion: A guide for health behavioral research. Cambridge University Press.","paperID":"None"},{"content":"Paul Ekman, Robert W. Levenson, and Wallace V. Friesen. 1983. Autonomic nervous system activity distinguishes among emotions. Science 221, 1208--1210.","paperID":"None"},{"content":"Stephen H. Fairclough and Louise Venables. 2006. Prediction of subjective states from psychophysiology: A multivariate approach. Biological Psychology, 71 (1), 100--110.","paperID":"None"},{"content":"Raul Fernandez. 1998. Stochastic modeling of physiological signals with hidden markov models: A step toward frustration detection in human-computer interfaces. Master's thesis, Massachusetts Institute of Technology, Dept. of Electrical Engineering and Computer Science.","paperID":"None"},{"content":"Pierfrancesco Foglia,, Cosimo Antonio Prete, and Michele Zanda. 2008. Relating GSR Signals to traditional Usability Metrics: Case Study with an anthropomorphic Web Assistant. In Proceedings of IEEE Instrumentation and Measurement Technology Conference, 1814--1818.","paperID":"None"},{"content":"Malin Forne. 2012. Physiology as a Tool for UX and Usability Testing. School of Computer Science and Communication, Master. Royal Institute of Technology, Stockholm.","paperID":"None"},{"content":"Barbara L Fredrickson and Daniel Kahneman. 1993. Duration neglect in retrospective evaluations of affective episodes. Journal of Personality and Social Psychology, 65.","paperID":"None"},{"content":"Yuan Gao, Nadia Bianchi-Berthouze, and Hongying Meng. 2012. What does touch tell us about emotions in touchscreen-based gameplay? ACM Transactions on Computer-Human Interaction (TOCHI) 19, 31:131:30","paperID":"None"},{"content":"Lewis R. Goldberg. 1992. The development of markers for the Big-Five factor structure. Psychological assessment 4.","paperID":"None"},{"content":"Marc Hassenzahl. 2000. Prioritizing usability problems: Data-driven and judgement-driven severity estimates. Behaviour & Information Technology 19, 29--42.","paperID":"None"},{"content":"Marc Hassenzahl and Nina Sandweg. 2004. From mental effort to perceived usability: transforming experiences into summary assessments. In CHI'04 Extended Abstracts on Human Factors in Computing Systems, 1283--1286.","paperID":"None"},{"content":"Morten Hertzum. 2006. Problem prioritization in usability evaluation: From severity assessments toward impact on design. International Journal of Human-Computer Interaction 21, 125--146.","paperID":"None"},{"content":"Morten Hertzum, Rolf Molich and Jacobsen Niels Ebbe 2014. What you get is what you see: Revisiting the evaluator effect in usability tests. Behaviour & Information Technology, 33, 2, 143--161.","paperID":"None"},{"content":"Don H. Hockenbury and Sandra E. Hockenbury. 2010. Discovering psychology. Macmillan.","paperID":"None"},{"content":"Kasper Hornbæk and Erik Frøkjær. 2008. A study of the evaluator effect in usability testing. Human- Computer Interaction, 23 (3), 251--277.","paperID":"None"},{"content":"Niels Ebbe Jacobsen, Morten Hertzum, and Bonnie E. John. 1998. The evaluator effect in usability tests. In Proceedings of CHI 98 Conference Summary on Human Factors in Computing Systems, pp. 255--256. ACM.","paperID":"None"},{"content":"Robin Jeffries. 1994. Usability problem reports: helping evaluators communicate effectively with developers. In Usability Inspection Methods, Jakob Nielsen and Robert L. Mack (eds.), NY, Wiley 25--62.","paperID":"None"},{"content":"Bonnie E. John and Steven J. Marks. 1997. Tracking the effectiveness of usability evaluation methods. Behaviour & Information Technology, 16 (4--5), 188202.","paperID":"None"},{"content":"Christian Martyn Jones and Tommy Troen. 2007. Biometric valence and arousal recognition. In Proceedings of Australasian Conference on Computer-Human Interaction (OzCHI'07), 191--194.","paperID":"None"},{"content":"Daniel Kahneman 2003. A perspective on judgment and choice: mapping bounded rationality. American Psychologist, 58.","paperID":"None"},{"content":"Daniel Kahneman. 2011. Thinking, fast and slow. Macmillan.","paperID":"None"},{"content":"Daniel Kahneman, Barbara L. Fredrickson, Charles A. Schreiber, and Donald A. Redelmeier. 1993. When more pain is preferred to less: Adding a better end. Psychological Science, 4(6), 401--405.","paperID":"None"},{"content":"Simon Kemp, Christopher DB Burt, and Laura Furneaux. A test of the peak-end rule with extended autobiographical events. Memory & Cognition, 36, 132--138.","paperID":"None"},{"content":"Jonathan Klein, Youngme Moon and Rosalind W. Picard.2002. This computer responds to user frustration: Theory, design, and results. Interacting with computers, 14 (2), 119--140.","paperID":"None"},{"content":"Sari Kujala and Talya Miron-Shatz. 2013. Emotions, experiences and usability in real-life mobile phone use. In Proceedings of Conference on Human Factors in Computing Systems, 1061--1070.","paperID":"None"},{"content":"Peter J. Lang. 1980. Behavioral treatment and biobehavioral assessment: computer applications. In Technology in mental health care delivery systems, Joseph B. Sidowski, James Harding Johnson, Thomas Arthur Williams (eds.), 119--137","paperID":"None"},{"content":"Peter J. Lang, Mark K. Greenwald, Margaret M. Bradley, and Alfons O. Hamm. 1993. Looking at pictures: Affective, facial, visceral, and behavioral reactions. Psychophysiology, 30, 261--261.","paperID":"None"},{"content":"Effie L-C Law, Paul van Schaik, and Virpi Roto. 2014. Attitudes towards user experience (UX) measurement. International Journal of Human-Computer Studies, 72, 526--541.","paperID":"None"},{"content":"Jonathan Lazar, Adam Jones, Mary Hackley, and Ben Shneiderman. 2006. Severity and impact of computer user frustration: A comparison of student and workplace users. Interacting with Computers 18, 187207.","paperID":"None"},{"content":"Richard S. Lazarus. 1991. Progress on a cognitive motivational-relational theory of emotion. American Psychologist, 46.","paperID":"None"},{"content":"Reed Lawson. 1965. Frustration; the development of a scientific concept. Macmillan.","paperID":"None"},{"content":"James R. Lewis. 2001. Introduction: Current issues in usability evaluation. International Journal of Human-Computer Interaction, 14 (3&4), 489--502.","paperID":"None"},{"content":"James. R. Lewis. 2012. Usability testing. In Handbook of Human Factors and Ergonomics (4th ed.), Gavriel Salvendy (Ed.), NY, Wiley, 1267--1312.","paperID":"None"},{"content":"Tao Lin, Masaki Omata, Wanhua Hu and Atsumi Imamiya. 2005. Do physiological data relate to traditional usability indexes? In Proceedings of the Australia Conference on Computer-Human Interaction (OzCHI'05).","paperID":"None"},{"content":"Martina Manhartsberger and Norbert Zellhofer. 2005. Eye tracking in usability research: What users really see? In Usability Symposium, 198, 141--152..","paperID":"None"},{"content":"Regan L. Mandryk. 2005. Modeling user emotion in interactive play environments: A fuzzy physiological approach. Ph.D. Thesis. Simon Fraser University, Burnaby.","paperID":"None"},{"content":"Regan L. Mandryk and Stella Atkins. 2007. A fuzzy physiological approach for continuously modeling emotion during interaction with play technologies. Int. J. Human-Computer Studies, 65, 329--347.","paperID":"None"},{"content":"Gerald Matthews, Sian E. Campbell, Shona Falconer, Lucy A. Joyner, Jane Huggins, Kirby Gilliland, Rebecca Grier, and Joel S. Warm. Fundamental dimensions of subjective state in performance settings: task engagement, distress, and worry. Emotion, 2 (4), 315 - 340.","paperID":"None"},{"content":"Albert Mehrabian 1996. Pleasure-arousal-dominance: A general framework for describing and measuring individual differences in temperament. Current Psychology, 14 (4): 261--292.","paperID":"None"},{"content":"Talya Miron-Shatz, Arthur Stone, and Daniel Kahneman. 2009. Memories of yesterday's emotions: Does the valence of experience affect the memory experience gap? Emotion, 9","paperID":"None"},{"content":"Rolf Molich and Joseph S. Dumas. 2008. Comparative usability evaluation (CUE-4). Behaviour & Information Technology, 23(1), 65--74.","paperID":"None"},{"content":"Rolf Molich, Meghan Ede, Klaus Kaasgaard, and Barbara Karyukin. 2004. Comparative usability evaluation. Behaviour & Information Technology 23 (1), 65--74.","paperID":"None"},{"content":"Jakob Nielsen. 1994. Heuristic evaluation. In Usability Inspection Methods, Jakob Nielsen and Robert L. Mack (eds.), NY, Wiley.","paperID":"None"},{"content":"Mary M. Omodei and J. I. M. McLennan. 1994. Studying complex decision making in natural settings: using a head-mounted video camera to study competitive orienteering. Perceptual and Motor Skills, 79, 1411--1425.","paperID":"None"},{"content":"Rosalind W. Picard. 1997. Affective Computing. Cambridge: MIT press.","paperID":"None"},{"content":"Alex Poole and Linden J. Ball. 2006. Eye tracking in HCI and usability research. Encyclopedia of Human Computer Interaction, 211--219.","paperID":"None"},{"content":"Donald A. Redelmeier and Daniel Kahneman. 1996. Patients' memories of painful medical treatments: realtime and retrospective evaluations of two minimally invasive procedures. Pain, 66, 3--8.","paperID":"None"},{"content":"Wendy D. Roth and Jal D. Mehta. 2002. The Rashomon effect combining positivist and interpretivist approaches in the analysis of contested events. Sociological Methods & Research 31, 131173.","paperID":"None"},{"content":"Virpi Roto, Effie L-C. Law, A. P. O. S. Vermeeren, and Jettie Hoonhout. 2010. User experience white paper: Bringing clarity to the concept of user experience. Retrieved July 12, 2015 from http://www.allaboutux.org/","paperID":"None"},{"content":"David Rubin. 1996. Autobiographical memory. Wiley.","paperID":"None"},{"content":"James A. Russell. 1980. A circumplex model of affect. Journal of Personality and Social Psychology, 39.","paperID":"None"},{"content":"Jeff Sauro. 2014. The relationship between problem frequency and problem severity in usability evaluations. Journal of Usability Studies, 10 (1), 1725.","paperID":"None"},{"content":"Jeff Sauro. 2013. Rating the severity of usability problems. Measuring Usability. Retrieved July 10, 2015 from http://www.measuringu.com/blog/ratingseverity.php.","paperID":"None"},{"content":"Jocelyn Scheirer, Raul Fernandez, Jonathan Klein, and Rosalind W. Picard. 2002. Frustrating the user on purpose: a step toward building an affective computer. Interacting with Computers, 14, 93--118.","paperID":"None"},{"content":"Yu Shi, Natalie Ruiz, Ronnie Taib, Eric Choi, and Fang Chen. 2007. Galvanic skin response (GSR) as an index of cognitive load. In CHI'07 Extended Abstracts on Human factors in Computing Systems, 2651--2656.","paperID":"None"},{"content":"Mikael B. Skov and Jan Stage. 2007. Supporting problem identification in usability evaluations. In Proceedings of the Australia conference on Computer-Human Interaction (OzCHI'07).","paperID":"None"},{"content":"Craig A. Smith and Richard S. Lazarus. 1990. Emotion and Adaptation. In Handbook of Personality: Theory and Research, L.A. Pervin (Ed.), 609--637.","paperID":"None"},{"content":"Kim J. Vicente, D. Craig Thornton, and Neville Moray. 1987. Spectral analysis of sinus arrhythmia: A measure of mental effort. Human Factors, 29, 171--182.","paperID":"None"},{"content":"Robert D. Ward and Philip H. Marsden. 2003. Physiological responses to different web page designs. International Journal of Human-Computer Studies, 59 (1), 199--212.","paperID":"None"},{"content":"Chauncey Wilson. 1999. Reader's questions: Severity scales. Usability Interface, 5. Retrieved July 12, 2015 from http://ww2.stcsig.org/usability/newsletter/9904severity-scale.html","paperID":"None"},{"content":"Lin Yao, Yanfang Liu, Wen Li, Lei Zhou, Yan Ge, Jing Chai, and Xianghong Sun. 2014. Using Physiological Measures to Evaluate User Experience of Mobile Applications. In Engineering Psychology and Cognitive Ergonomics, 301--310. Springer.","paperID":"None"},{"content":"Marc Hassenzahl, Effie L-C. Law, and Ebba Thora Hvannberg. 2006. User Experience: Towards a unified view. In Proceedings of NordiCHI'06 Workshop on Towards a Unified View of User Experience, 1--3.","paperID":"None"}],"abstract":"Frustration is used as a criterion for identifying usability problems (UPs) and for rating their severity in a few of the existing severity scales, but it is not operationalized. No research has systematically examined how frustration varies with the severity of UPs. We aimed to address these issues with a hybrid approach, using Self-Assessment Manikin, comments elicited with Cued-Recall Debrief, galvanic skin responses (GSR) and gaze data. Two empirical studies involving a search task with a website known to have UPs were conducted to substantiate findings and improve on the methodological framework, which could facilitate usability evaluation practice. Results showed no correlation between GSR peaks and severity ratings, but GSR peaks were correlated with frustration scores -- a metric we developed. The Peak-End rule was partially verified. The problematic evaluator effect was the limitation as it confounded the severity ratings of UPs. Future work is aimed to control this effect and to develop a multifaceted severity scale.","title":"Understanding the Relationship between Frustration and the Severity of Usability Problems: What can Psychophysiological Data (Not) Tell Us?","filename":"CHI16/p3975","authors":["Anders Bruun","Effie Lai-Chong Law","Matthias Heintz","Lana H.A. Alkly"],"conference":"CHI '16"}