{"paperId":2858547,"citation":[],"reference":[{"content":"Andriotis, P., Tryfonas, T., Oikonomou, G., and Yildiz, C. A pilot study on the security of pattern screen-lock methods and soft side channel attacks. In Proc. of WiSec'13, ACM, New York, NY, USA (2013) 1--6.","paperID":"None"},{"content":"Andriotis, P., Tryfonas, T., and Oikonomou, G. Complexity metrics and user strength perceptions of the pattern-lock graphical authentication method. In Proc. of HAS'14, Springer International Publishing (2014) 115--126.","paperID":"None"},{"content":"Aviv, A.J., Gibson, K., Mossop, E., Blaze, M., and Smith, J.M. Smudge attacks on smartphone touch screens. In Proc. WOOT'10, USENIX Association Berkeley, CA (2010), 1--7.","paperID":"None"},{"content":"Biddle, R., Chiasson, S., and Van Oorschot, P.C. Graphical passwords: Learning from the first twelve years. ACM Computing Surveys, vol. 44, no. 4 (2012) 1-41.","paperID":"None"},{"content":"Brown, A.S., Bracken, E., Zoccoli, S., and Douglas, K. Generating and remembering passwords. Applied Cognitive Psychology, vol. 18, no. 6 (2004) 641-651.","paperID":"None"},{"content":"Chiasson, S., Forget, A., Stobert, E., van Oorschot, P. C., and Biddle, R. 2009. Multiple Password Interference in Text Passwords and Click-based Graphical Passwords. In Proc. of CCS'09. ACM, New York, NY, USA (2009) 500-511.","paperID":"None"},{"content":"Davis, D., Monrose, F., and Reiter, M. K. On User Choice in Graphical Password Schemes. In Proc. of the 13th Conference on USENIX Security Symposium. USENIX Association, Berkeley, CA, USA (2004) 1--11.","paperID":"None"},{"content":"Everitt, K. M., Bragin, T., Fogarty, J., and Kohno, T. A Comprehensive Study of Frequency, Interference, and Training of Multiple Graphical Passwords. In Proc. CHI'09. ACM, New York, NY, USA (2009) 889--898.","paperID":"None"},{"content":"Uellenbeck, S., Durmuth, M., Wolf, C., and Holz, T. Quantifying the security of graphical passwords: The case of android unlock patterns. In Proc. CCS '13, ACM New York, NY, USA (2013) 161--172.","paperID":"None"},{"content":"Tao, H. and Adams, C. Pass-Go: A Proposal to Improve the Usability of Graphical Passwords. International Journal of Network Security, vol. 7, no. 2 (2008) 273--292.","paperID":"None"},{"content":"Vu, K.P.L., Proctor, R.W., Bhargav-Spantzel, A., Tai, B.-L., Cook, J., and Schultz, E.E. Improving Password Security and Memorability to Protect Personal and Organizational Information. International Journal of Human-Computer Studies, vol. 65, no. 8 (2007) 744--757.","paperID":"None"},{"content":"von Zezschwitz, E., Dunphy, P., and De Luca, A. Patterns in the wild: a field study of the usability of pattern and pin-based authentication on mobile devices. In Proc. MobileHCI'13, ACM, New York, NY, USA (2013) 261--270.","paperID":"None"},{"content":"von Zezschwitz, E., De Luca, A., Janssen, P., and Hussmann, H. Easy to Draw, but Hard to Trace?: On the Observability of Grid-based (Un)lock Patterns. In Proc. of CHI '15, ACM, New York, NY, USA (2015) 2339-2342.","paperID":"None"}],"abstract":"The memorability of multiple passwords is an important topic for user authentication systems. With the advent of Android unlock pattern mechanism, research studies started investigating its usability and security features. This paper presents a study of recalling multiple passwords between text passwords and touch screen unlock patterns, as well as exploring whether users have difficulty in remembering those patterns after a period of time. In our study, participants create unlock patterns for various account scenarios. Our results reveal that participants in the unlock pattern condition with three accounts can outperform those in the text password condition (i.e., achieve higher success rates), not only in a one-hour session (short-term), but also after two weeks (long-term). However, there was no statistically significant difference between participants in the text password and unlock pattern condition in the long-term, when dealing with six accounts.","title":"On Multiple Password Interference of Touch Screen Patterns and Text Passwords","filename":"CHI16/p4818","authors":["Weizhi Meng","Wenjuan Li","Lijun Jiang","Liying Meng"],"conference":"CHI '16"}