{"paperId":2858353,"citation":[],"reference":[{"content":"Javier Alonso-Mora, Tobias Naegeli, Roland Siegwart, and Paul Beardsley. 2015. Collision avoidance for aerial vehicles in multi-agent scenarios. Autonomous Robots 39, 1 (2015), 101--121. DOI: http://dx.doi.org/10.1007/s10514-015--9429-0","paperID":"None"},{"content":"ArsElectronica. 2012. Spaxels. (2012). http://www.aec.at/spaxels/.","paperID":"None"},{"content":"Cannes Festival. 2012. New Directors? Showcase. Video. (2012). https://youtu.be/cseTX_rW3uM","paperID":"None"},{"content":"Marc Christie, Rumesh Machap, Jean-Marie Normand, Patrick Olivier, and Jonathan Pickering. 2005. Virtual camera planning: A survey. In Smart Graphics. Springer, 40--52.","paperID":"None"},{"content":"T.J. Diaz. 2015. Lights, drone... action. Spectrum, IEEE 52, 7 (July 2015), 36--41. DOI: http://dx.doi.org/10.1109/MSPEC.2015.7131693","paperID":"None"},{"content":"Nadeem Faiz, Sunil K Agrawal, and Richard M Murray. 2001. Trajectory planning of differentially flat systems with dynamics and inequalities. Journal of Guidance, Control, and Dynamics 24, 2 (2001), 219--227.","paperID":"None"},{"content":"Tamar Flash and Neville Hogan. 1985. The coordination of arm movements: an experimentally confirmed mathematical model. The journal of Neuroscience 5, 7 (1985), 1688--1703.","paperID":"None"},{"content":"Michael L. Gleicher and Feng Liu. 2008. Re-cinematography: Improving the Camerawork of Casual Video. ACM Trans. Multimedia Comput. Commun. Appl. 5, 1, Article 2 (Oct. 2008), 28 pages. DOI: http://dx.doi.org/10.1145/1404880.1404882","paperID":"None"},{"content":"M. Grundmann, V. Kwatra, and I. Essa. 2011. Auto-directed video stabilization with robust L1 optimal camera paths. In Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on. 225--232. DOI: http://dx.doi.org/10.1109/CVPR.2011.5995525","paperID":"None"},{"content":"Keita Higuchi and Jun Rekimoto. 2012. Flying Head: Head-synchronized Unmanned Aerial Vehicle Control for Flying Telepresence. In SIGGRAPH Asia 2012 E-Tech (SA '12). ACM, NY, NY, USA, 12:1--12:2. DOI: http://dx.doi.org/10.1145/2407707.2407719","paperID":"None"},{"content":"Keita Higuchi, Tetsuro Shimada, and Jun Rekimoto. 2011. Flying Sports Assistant: External Visual Imagery Representation for Sports Training. In Augmented Human International Conference (AH '11). ACM, 7:1--7:4. DOI: http://dx.doi.org/10.1145/1959826.1959833","paperID":"None"},{"content":"Niels Joubert, Mike Roberts, Anh Truong, Floraine Berthouzoz, and Pat Hanrahan. 2015. An Interactive Tool for Designing Quadrotor Camera Shots. ACM Trans. Graph. 34, 6, Article 238 (Oct. 2015), Article 238, 11 pages. DOI: http://dx.doi.org/10.1145/2816795.2818106","paperID":"None"},{"content":"Jun Kato, Daisuke Sakamoto, and Takeo Igarashi. 2012. Phybots: A Toolkit for Making Robotic Things. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 248--257. DOI: http://dx.doi.org/10.1145/2317956.2317996","paperID":"None"},{"content":"Johannes Kopf, Michael F. Cohen, and Richard Szeliski. 2014. First-person Hyper-lapse Videos. ACM Trans. Graph. 33, 4, Article 78 (July 2014), 10 pages. DOI: http://dx.doi.org/10.1145/2601097.2601195","paperID":"None"},{"content":"Taeyoung Lee, Melvin Leok, and N Harris McClamroch. 2013. Nonlinear robust tracking control of a quadrotor UAV on SE (3). Asian Journal of Control 15, 2 (2013), 391--408.","paperID":"None"},{"content":"Tsai-Yen Li and Chung-Chiang Cheng. 2008. Real-Time Camera Planning for Navigation in Virtual Environments. In Smart Graphics, Andreas Butz, Brian Fisher, Antonio Krger, Patrick Olivier, and Marc Christie (Eds.). Lecture Notes in Computer Science, Vol. 5166. Springer Berlin Heidelberg, 118--129. DOI: http://dx.doi.org/10.1007/978--3--540--85412--8_11","paperID":"None"},{"content":"Kexi Liu, Daisuke Sakamoto, Masahiko Inami, and Takeo Igarashi. 2011. Roboshop: Multi-layered Sketching Interface for Robot Housework Assignment and Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 647--656. DOI: http://dx.doi.org/10.1145/1978942.1979035","paperID":"None"},{"content":"Shuaicheng Liu, Lu Yuan, Ping Tan, and Jian Sun. 2013. Bundled Camera Paths for Video Stabilization. ACM Trans. Graph. 32, 4, Article 78 (July 2013), 10 pages. DOI: http://dx.doi.org/10.1145/2461912.2461995","paperID":"None"},{"content":"Sergei Lupashin and Raffaello DAndrea. 2012. Adaptive fast open-loop maneuvers for quadrocopters. Autonomous Robots 33, 1--2 (April 2012), 89--102. http://link.springer.com/10.1007/s10514-012--9289--9","paperID":"None"},{"content":"Robert Mahony, Vijay Kumar, and Peter Corke. 2012. Multirotor Aerial Vehicles: Modeling, Estimation, and Control of Quadrotor. IEEE Robotics & Automation Magazine 19, 3 (Sept. 2012), 20--32. http://ieeexplore.ieee.org/lpdocs/epic03/wrapper.htm?arnumber=6289431","paperID":"None"},{"content":"Tobias Martin, Nobuyuki Umetani, and Bernd Bickel. 2015. OmniAD: Data-driven Omni-directional Aerodynamics. ACM Trans. Graph. 34, 4, Article 113 (July 2015), 12 pages. DOI: http://dx.doi.org/10.1145/2766919","paperID":"None"},{"content":"Joseph V Mascelli. 1998. The five C's of cinematography: motion picture filming techniques. Silman-James Press.","paperID":"None"},{"content":"Lorenz Meier, Petri Tanskanen, Lionel Heng, Gim Hee Lee, Friedrich Fraundorfer, and Marc Pollefeys. 2012. PIXHAWK: A micro aerial vehicle design for autonomous flight using onboard computer vision. Autonomous Robots 33, 1--2 (Feb. 2012), 21--39. http://link.springer.com/10.1007/s10514-012--9281--4","paperID":"None"},{"content":"Daniel Mellinger and Vijay Kumar. 2011. Minimum snap trajectory generation and control for quadrotors. In Robotics and Automation (ICRA), 2011 IEEE International Conference on. IEEE, 2520--2525.","paperID":"None"},{"content":"Florian 'Floyd' Mueller and Matthew Muirhead. 2015. Jogging with a Quadcopter. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2023--2032. DOI: http://dx.doi.org/10.1145/2702123.2702472","paperID":"None"},{"content":"Tobias Nägeli, Christian Conte, Alexander Domahidi, Manfred Morari, and Otmar Hilliges. 2014. Environment-independent formation flight for micro aerial vehicles. In Intelligent Robots and Systems (IROS 2014), 2014 IEEE/RSJ International Conference on. 1141--1146. DOI: http://dx.doi.org/10.1109/IROS.2014.6942701","paperID":"None"},{"content":"Tayyab Naseer, J Sturm, and D Cremers. 2013. Followme: Person following and gesture recognition with a quadrocopter. Proc. IROS (2013). https://vision.in.tum.de/_media/spezial/bib/naseer2013iros.pdf","paperID":"None"},{"content":"Kei Nitta, Keita Higuchi, and Jun Rekimoto. 2014. HoverBall: Augmented Sports with a Flying Ball. In Augmented Human International Conference (AH '14) (AH '14). ACM, NY, NY, USA, 13:1--13:4. DOI: http://dx.doi.org/10.1145/2582051.2582064","paperID":"None"},{"content":"Daisuke Sakamoto, Koichiro Honda, Masahiko Inami, and Takeo Igarashi. 2009. Sketch and run. In ACM SIGCHI. ACM Press, NY, NY, USA, 197. http://dl.acm.org/citation.cfm?id=1518701.1518733","paperID":"None"},{"content":"Jurgen Scheible, Achim Hoth, Julian Saal, and Haifeng Su. 2013. Displaydrone: a flying robot based interactive display. In ACM International Symposium on Pervasive Displays (PerDis '13). ACM Press, NY, NY, USA, 49. http://dl.acm.org/citation.cfm?id=2491568.2491580","paperID":"None"},{"content":"Yuta Sugiura, Diasuke Sakamoto, Anusha Withana, Masahiko Inami, and Takeo Igarashi. 2010. Cooking with robots. In ACM SIGCHI. ACM Press, NY, NY, USA, 2427. http://dl.acm.org/citation.cfm?id=1753326.1753693","paperID":"None"},{"content":"Nobuyuki Umetani, Yuki Koyama, Ryan Schmidt, and Takeo Igarashi. 2014. Pteromys: Interactive Design and Optimization of Free-formed Free-flight Model Airplanes. ACM Trans. Graph. 33, 4, Article 65 (July 2014), 10 pages. DOI: http://dx.doi.org/10.1145/2601097.2601129","paperID":"None"},{"content":"I-Cheng Yeh, Chao-Hung Lin, Hung-Jen Chien, and Tong-Yee Lee. 2011. Efficient camera path planning algorithm for human motion overview. Computer Animation and Virtual Worlds 22, 2--3 (2011), 239--250. DOI: http://dx.doi.org/10.1002/cav.398","paperID":"None"},{"content":"Shigeo Yoshida, Takumi Shirokura, Yuta Sugiura, Daisuke Sakamoto, Tetsuo Ono, Masahiko Inami, and Takeo Igarashi. 2015. RoboJockey: Designing an Entertainment Experience with Robots. IEEE computer graphics and applications 1 (Jan. 2015), 1. http://www.computer.org/csdl/mags/cg/preprint/07005367-abs.html","paperID":"None"},{"content":"Shengdong Zhao, Koichi Nakamura, Kentaro Ishii, and Takeo Igarashi. 2009. Magic Cards: A Paper Tag Interface for Implicit Robot Control. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 173--182. DOI: http://dx.doi.org/10.1145/1518701.1518730","paperID":"None"}],"abstract":"In this paper we propose a computational design tool that allows end-users to create advanced quadrotor trajectories with a variety of application scenarios in mind. Our algorithm allows novice users to create quadrotor based use-cases without requiring deep knowledge in either quadrotor control or the underlying constraints of the target domain. To achieve this goal we propose an optimization-based method that generates feasible trajectories which can be flown in the real world. Furthermore, the method incorporates high-level human objectives into the planning of flight trajectories. An easy to use 3D design tool allows for quick specification and editing of trajectories as well as for intuitive exploration of the resulting solution space. We demonstrate the utility of our approach in several real-world application scenarios, including aerial-videography, robotic light-painting and drone racing.","title":"Airways: Optimization-Based Planning of Quadrotor Trajectories according to High-Level User Goals","filename":"CHI16/p2508","authors":["Christoph Gebhardt","Benjamin Hepp","Tobias Nägeli","Stefan Stevšić","Otmar Hilliges"],"conference":"CHI '16"}