{"paperId":2858159,"citation":[],"reference":[{"content":"Saeema Ahmed, Ken Wallace, and Lucienne T. Blessing. 2003. Understanding the differences between how novice and experienced designers approach design tasks. Research in Engineering Design 14, 1 (February 2003). DOI: http://dx.doi.org/10.1007/s00163-002-0023-z","paperID":"None"},{"content":"Margot Brereton and Ben McGarry. 2000. An Observational Study of How Objects Support Engineering Design Thinking and Communication: Implications for the Design of Tangible Media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, NY, NY, USA, 217--224. DOI: http://dx.doi.org/10.1145/332040.332434","paperID":"None"},{"content":"Nigel Cross. 2004. Expertise in design: an overview. Design Studies 25, 5 (2004), 427--441. DOI: http://dx.doi.org/10.1016/j.destud.2004.06.002","paperID":"None"},{"content":"Nigel Cross, Henri Christiaans, and Kees Dorst. 1996. Analysing design activity. Wiley.","paperID":"None"},{"content":"Steven Dow, Julie Fortuna, Dan Schwartz, Beth Altringer, Daniel Schwartz, and Scott Klemmer. 2011. Prototyping Dynamics: Sharing Multiple Designs Improves Exploration, Group Rapport, and Results. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2807--2816. DOI: http://dx.doi.org/10.1145/1978942.1979359","paperID":"None"},{"content":"Steven P. Dow, Kate Heddleston, and Scott R. Klemmer. 2009. The Efficacy of Prototyping Under Time Constraints. In Proceedings of the Seventh ACM Conference on Creativity and Cognition (C&C '09). ACM, NY, NY, USA, 165--174. DOI: http://dx.doi.org/10.1145/1640233.1640260","paperID":"None"},{"content":"Claudia Eckert, Alan Blackwell, Martin Stacey, Christopher Earl, and Luke Church. 2012. Sketching across design domains: Roles and formalities. Artificial Intelligence for Engineering Design, Analysis and Manufacturing 26 (8 2012), 245--266. Issue Special Issue 03. DOI: http://dx.doi.org/10.1017/S0890060412000133","paperID":"None"},{"content":"Koos Eissen and Roselien Steur. 2011. Sketching: The Basics. Bis Publishers.","paperID":"None"},{"content":"Steven D Eppinger. 1991. Model-based Approaches to Managing Concurrent Engineering. Journal of Engineering Design 2, 4 (1991), 283--290. DOI: http://dx.doi.org/10.1080/09544829108901686","paperID":"None"},{"content":"Ozgur Eris, Nikolas Martelaro, and Petra Badke-Schaub. 2014. A comparative analysis of multimodal communication during design sketching in co-located and distributed environments. Design Studies 35, 6 (2014), 559--592. DOI: http://dx.doi.org/10.1016/j.destud.2014.04.002","paperID":"None"},{"content":"Daniela Faas, Qifang Bao, and Maria C. Yang. 2014. Preliminary Sketching and Prototyping: Comparisons in Exploratory Design-and-Build Activities. In ASME Design Engineering Technical Conferences. DOI: http://dx.doi.org/10.1115/DETC2014-34928","paperID":"None"},{"content":"Adam Fouse, Nadir Weibel, Edwin Hutchins, and James D. Hollan. 2011. ChronoViz: A System for Supporting Navigation of Time-coded Data. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 299--304. DOI: http://dx.doi.org/10.1145/1979742.1979706","paperID":"None"},{"content":"Nancy Frishberg. 2006. Prototyping with Junk. interactions 13, 1 (Jan. 2006), 21--23. DOI: http://dx.doi.org/10.1145/1109069.1109086","paperID":"None"},{"content":"Vinod Goel. 1995. Sketches of Thought. MIT Press.","paperID":"None"},{"content":"Gabriela Goldschmidt. 1991. The Dialectics of Sketching. Creativity Research Journal 4, 2 (1991), 123--143. DOI: http://dx.doi.org/10.1080/10400419109534381","paperID":"None"},{"content":"Tovi Grossman, Ravin Balakrishnan, and Karan Singh. 2003. An Interface for Creating and Manipulating Curves Using a High Degree-of-freedom Curve Input Device. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 185--192. DOI: http://dx.doi.org/10.1145/642611.642645","paperID":"None"},{"content":"Kilem L. Gwet. 2014. Handbook of Inter-Rater Reliability, 4th Edition: The Definitive Guide to Measuring The Extent of Agreement Among Raters. Advanced Analytics, LLC.","paperID":"None"},{"content":"Bjarki Hallgrimsson. 2012. Prototyping and Modelmaking for Product Design. Laurence King Publishers.","paperID":"None"},{"content":"Kathryn Henderson. 1998. On Line and on Paper: Visual Representations, Visual Culture, and Computer Graphics in Design Engineering. MIT Press, Cambridge, MA, USA.","paperID":"None"},{"content":"Emmanuel Iarussi, Adrien Bousseau, and Theophanis Tsandilas. 2013. The Drawing Assistant: Automated Drawing Guidance and Feedback from Photographs. In ACM Symposium on User Interface Software and Technology (UIST). ACM, 183--192. DOI: http://dx.doi.org/10.1145/2501988.2501997","paperID":"None"},{"content":"Paul Jackson. 2011. Folding techniques for designers, from sheet to form. Laurence King Publishing LTD.","paperID":"None"},{"content":"David Kirk and Danae Stanton Fraser. 2006. Comparing Remote Gesture Technologies for Supporting Collaborative Physical Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 1191--1200. DOI: http://dx.doi.org/10.1145/1124772.1124951","paperID":"None"},{"content":"James McCrae, Nobuyuki Umetani, and Karan Singh. 2014. FlatFitFab: Interactive Modeling with Planar Sections. In ACM Symposium on User Interface Software and Technology (UIST). ACM, 13--22. DOI: http://dx.doi.org/10.1145/2642918.2647388","paperID":"None"},{"content":"Felicia L. McKoy, No Vargas-Hernández, Joshua D. Summers, and Jami J. Shah. 2001. Influence of design representation on effectiveness of idea generation. In Proceedings of the ASME Design Engineering Technical Conference, Vol. 4. 39--48.","paperID":"None"},{"content":"Andrew Miller, Brandyn White, Emiko Charbonneau, Zach Kanzler, and Joseph J. LaViola Jr. 2012. Interactive 3D Model Acquisition and Tracking of Building Block Structures. IEEE Transactions on Visualization and Computer Graphics 18, 4 (2012), 651--659. DOI: http://dx.doi.org/10.1109/TVCG.2012.48","paperID":"None"},{"content":"Catarina Mota. 2011. The Rise of Personal Fabrication. In Proceedings of the 8th ACM Conference on Creativity and Cognition (C&C '11). ACM, NY, NY, USA, 279--288. DOI: http://dx.doi.org/10.1145/2069618.2069665","paperID":"None"},{"content":"Charles Perin, Pierre Dragicevic, and Jean-Daniel Fekete. 2014. Revisiting Bertin matrices: New Interactions for Crafting Tabular Visualizations. IEEE Transactions on Visualization and Computer Graphics (Nov. 2014). DOI: http://dx.doi.org/10.1109/TVCG.2014.2346279","paperID":"None"},{"content":"Terry Purcell and John S. Gero. 1998. Drawings and the design process: A review of protocol studies in design and other disciplines and related research in cognitive psychology. Design Studies 19, 4 (1998), 389--430. DOI: http://dx.doi.org/10.1016/S0142--694X(98)00015--5","paperID":"None"},{"content":"Daniela Rosner and Jonathan Bean. 2009. Learning from IKEA Hacking: I'm Not One to Decoupage a Tabletop and Call It a Day.. In Proc. SIGCHI Conference on Human Factors in Computing Systems (CHI). ACM, NY, NY, USA, 419--422. DOI: http://dx.doi.org/10.1145/1518701.1518768","paperID":"None"},{"content":"Allison Sauppé and Bilge Mutlu. 2014. How Social Cues Shape Task Coordination and Communication. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, NY, NY, USA, 97--108. DOI:http://dx.doi.org/10.1145/2531602.2531610","paperID":"None"},{"content":"Shuang Song and Alice M. Agogino. 2004. Insights on Designers Sketching Activities in New Product Design Teams. In International Conference on Design Theory and Methodology. ASME, 351--360. DOI: http://dx.doi.org/10.1115/DETC2004--57474","paperID":"None"},{"content":"Lingyun Sun, Wei Xiang, Chunlei Chai, Changlu Wang, and Zheng Liu. 2013. Impact of text on idea generation: an electroencephalography study. International Journal of Technology and Design Education 23, 4 (2013), 1047--1062. DOI: http://dx.doi.org/10.1007/s10798-013-9237-9","paperID":"None"},{"content":"Masaki Suwa and Barbara Tversky. 1997. What do architects and students perceive in their design sketches? A protocol analysis. Design Studies 18, 4 (1997), 385--403. DOI: http://dx.doi.org/10.1016/S0142-694X(97)00008-2 Descriptive models of design.","paperID":"None"},{"content":"Joshua G. Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing Technology: Pleasure, Utility and Expressiveness in DIY and Maker Practice. In Proc. SIGCHI Conference on Human Factors in Computing Systems (CHI). ACM, NY, NY, USA, 2603--2612. DOI:http://dx.doi.org/10.1145/2470654.2481360","paperID":"None"},{"content":"John C. Tang and Larry J. Leifer. 1988. A Framework for Understanding the Workspace Activity of Design Teams. In Proceedings of the 1988 ACM Conference on Computer-supported Cooperative Work (CSCW '88). ACM, NY, NY, USA, 244--249. DOI: http://dx.doi.org/10.1145/62266.62285","paperID":"None"},{"content":"Peter Törlind, Neeraj Sonalkar, Mattias Bergström, Eric Blanco, Ben Hicks, Hamish McAlpine, and others. 2009. Lessons Learned and Future Challenges for Design Observatory Research. In DS 58--2: Proceedings of ICED 09, the 17th International Conference on Engineering Design, Vol. 2, Design Theory and Research Methodology, Palo Alto, CA, USA, 24.-27.08. 2009.","paperID":"None"},{"content":"Robert E. Wendrich. 2010. Raw shaping form finding: Tacit tangible CAD. Computer-Aided Design and Applications 7, 4 (2010), 505--531. DOI: http://dx.doi.org/10.3722/cadaps.2010.505--531","paperID":"None"},{"content":"Maria C. Yang. 2009. Observations on concept generation and sketching in engineering design. Research in Engineering Design 20, 1 (1 March 2009), 1--11. DOI: http://dx.doi.org/10.1007/s00163-008-0055-0","paperID":"None"},{"content":"Maria C. Yang and Jorge G. Cham. 2006. An Analysis of Sketching Skill and Its Role in Early Stage Engineering Design. Journal of Mechanical Design 129, 5 (2006), 476--482. DOI: http://dx.doi.org/10.1115/1.2712214","paperID":"None"}],"abstract":"We are interested in how to create digital tools to support informal sketching and prototyping of physical objects by novices. Achieving this goal first requires a deeper understanding of how non-professional designers generate, explore, and communicate design ideas with traditional tools, i.e., sketches on paper and hands-on prototyping materials. We describe a study framed around two all-day design charrettes where participants perform a complete design process: ideation sketching, concept development and presentation, fabrication planning documentation and collaborative fabrication of hand-crafted prototypes. This structure allows us to control key aspects of the design process while collecting rich data about creative tasks, including sketches on paper, physical models, and videos of collaboration discussions. Participants used a variety of drawing techniques to convey 3D concepts. They also extensively manipulated physical materials, such as paper, foam, and cardboard, both to support concept exploration and communication with design partners. Based on these observations, we propose design guidelines for CAD tools targeted at novice crafters.","title":"How Novices Sketch and Prototype Hand-Fabricated Objects","filename":"CHI16/p397","authors":["Adrien Bousseau","Theophanis Tsandilas","Lora Oehlberg","Wendy E. Mackay"],"conference":"CHI '16"}