{"paperId":2858468,"citation":[],"abstract":"The use of practices as a unit of analysis has been suggested in order to scale up efforts within sustainable HCI and to shift the focus from changing individual behaviours to supporting transitions at a societal level. In this paper, we take a practice approach to the case of sustainable transportation, and more specifically to car-free transportation. Car use is intertwined in many practices and managing life without a car is difficult, particularly for people in contexts where owning at least one car per family is the norm. We studied three families in Stockholm who replaced their cars with different combinations of light electric vehicles during one year. From the families' experiences, we identified a number of opportunities for designers of interactive technologies to support environmental pioneers in the particular case of car-free living, as well as to support transitions towards sustainable practices in general.","reference":[{"content":"Caroline Bartle, Erel Avineri, and Kiron Chatterjee. 2013. Online information-sharing: A qualitative analysis of community, trust and social influence amongst commuter cyclists in the UK. Transportation Research Part F: Traffic Psychology and Behaviour 16: 60--72. http://doi.org/10.1016/j.trf.2012.08.013","paperID":"None"},{"content":"Maria Börjesson, Jonas Eliasson, Muriel B. Hugosson, and Karin Brundell-Freij. 2012. The Stockholm congestion charges-5 years on. Effects, acceptability and lessons learnt. Transport Policy 20: 1--12. http://doi.org/10.1016/j.tranpol.2011.11.001","paperID":"None"},{"content":"Efthimios Bothos, Dimitris Apostolou, and Gregoris Mentzas. 2013. Choice Architecture for Environmentally Sustainable Urban Mobility. CHI 2013, 1503--1508.","paperID":"None"},{"content":"Barry Brown, Stuart Reeves, and Scott Sherwood. 2011. Into the Wild: Challenges and Opportunities for Field Trial Methods. CHI 2011, 1657--1666.","paperID":"None"},{"content":"Hrönn Brynjarsdottir, Maria Håkansson, James Pierce, Eric Baumer, Carl Disalvo, and Phoebe Sengers. 2012. Sustainably Unpersuaded: How Persuasion Narrows Our Vision of Sustainability. CHI 2012, ACM, 947--956.","paperID":"None"},{"content":"Caspar G. Chorus, Eric J. E. Molin, and Bert Van Wee. 2006. Use and Effects of Advanced Traveller Information Services (ATIS): A Review of the Literature. Transport Reviews 26, 2: 127--149. http://doi.org/10.1080/01441640500333677","paperID":"None"},{"content":"Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. CHI 2010, ACM, 1975--1984. http://doi.org/10.1145/1753326.1753625","paperID":"None"},{"content":"Paul Dourish. 2010. HCI and environmental sustainability: the politics of design and the design of politics. DIS 2010. http://doi.org/10.1145/1858171.1858173","paperID":"None"},{"content":"Federal Highway Administration. 2010. 2009 National Household Travel Survey.","paperID":"None"},{"content":"Jon Froehlich, Tawanna Dillahunt, Predrag Klasnja, et al. 2009. UbiGreen: Investigating a Mobile Tool for Tracking and Supporting Green Transportation Habits. CHI 2009: 1043--1052. http://doi.org/10.1145/1518701.1518861","paperID":"None"},{"content":"Maria Håkansson and Phoebe Sengers. 2013. Beyond Being Green: Simple Living Families and ICT. CHI 2013, 2725--2734. http://doi.org/10.1145/2470654.2481378","paperID":"None"},{"content":"Tuillia Jack. 2013. Nobody was dirty: Intervening in inconspicuous consumption of laundry routines. Journal of Consumer Culture 13, 3: 406--421. http://doi.org/10.1177/1469540513485272","paperID":"None"},{"content":"Anna Kramers. 2014. Designing next generation multimodal traveler information systems to support sustainability-oriented decisions. Environmental Modelling and Software 56: 83--93. http://doi.org/10.1016/j.envsoft.2014.01.017","paperID":"None"},{"content":"Lenneke Kuijer and Annelise De Jong. 2009. A practice oriented approach to user centered sustainable design. Ecodesign 2009 Conference, Saporo, Japan: 1--6.","paperID":"None"},{"content":"Lenneke Kuijer and Annelise De Jong. 2012. Identifying design opportunities for reduced household resource consumption: exploring practices of thermal comfort. J. of Design Research 10, 1/2: 67. http://doi.org/10.1504/JDR.2012.046140","paperID":"None"},{"content":"Lenneke Kuijer. 2014. Implications of Social Practice Theory for Sustainable Design.","paperID":"None"},{"content":"Kari Kuutti and Lj Bannon. 2014. The turn to practice in HCI: towards a research agenda. CHI 2014, 3543--3552. http://doi.org/10.1145/2556288.2557111","paperID":"None"},{"content":"Johanne Mose Entwistle, Mia Kruse Rasmussen, Nervo Verdezoto, Robert S Brewer, and Mads Schaarup Andersen. 2015. Beyond the Individual: The Contextual Wheel of Practice as a Research Framework for Sustainable HCI. CHI 2015.","paperID":"None"},{"content":"Åsa Nyblom. 2014. Making plans or \"just thinking about the trip\"? Understanding people's travel planning in practice. Journal of Transport Geography 35: 30--39. http://doi.org/10.1016/j.jtrangeo.2014.01.003","paperID":"None"},{"content":"Sebastian Prost, Johann Schrammel, and Manfred Tscheligi. 2014. \"Sometimes it's the weather's fault\": sustainable HCI & political activism. CHI 2014, 2005--2010. http://doi.org/10.1145/2559206.2581358","paperID":"None"},{"content":"Kakee Scott, Conny Bakker, and Jaco Quist. 2012. Designing change by living change. Design Studies 33, 3: 279--297. http://doi.org/10.1016/j.destud.2011.08.002","paperID":"None"},{"content":"Elizabeth Shove, Mika Pantzar, and Matt Watson. 2012. The Dynamics of Social Practice: Everyday Life and how it Changes. SAGE Publications.","paperID":"None"},{"content":"Elizabeth Shove and Gordon Walker. 2010. Governing transitions in the sustainability of everyday life. Research Policy 39, 4: 471--476. http://doi.org/10.1016/j.respol.2010.01.019","paperID":"None"},{"content":"Jana Sochor, Helena Strömberg, and Marianne Karlsson. 2014. Travelers' motives for adopting a new, innovative travel service: Insights from the UBIGO field operational test in Gothenburg, Sweden. World Congress on Intelligent Transportation Systems.","paperID":"None"},{"content":"Yolande Strengers. 2011. Designing eco-feedback systems for everyday life. CHI 2011, ACM Press, 2135--2144. http://doi.org/10.1145/1978942.1979252","paperID":"None"},{"content":"Irina Tal, Aida Olaru, and Gabriel Miro Muntean. 2013. eWARPE - Energy-efficient weather-aware route planner for electric bicycles. International Conference on Network Protocols, ICNP. http://doi.org/10.1109/ICNP.2013.6733680","paperID":"None"},{"content":"Trafikanalys. 2015. Resvanor. RVU Sverige 20112014 Den nationella resvaneundersökningen. Retrieved August 12, 2015 from http://www.trafa.se/statistik/resvanor/","paperID":"None"},{"content":"John. Urry. 2004. The \"System\" of Automobility. Theory, Culture & Society 21, 4: 25--39. http://doi.org/10.1177/0263276404046059","paperID":"None"},{"content":"Bas Verplanken, Henk Aarts, and Ad Van Knippenberg. 1997. Habit, information acquisition, and the process of making travel mode choices. European Journal of Social Psychology 27, 5: 539--560. http://doi.org/10.1002/(sici)10990992(199709/10)27:5<539::aid-ejsp831>3.0.co;2-a","paperID":"None"}],"title":"Challenging the Car Norm: Opportunities for ICT to Support Sustainable Transportation Practices","filename":"CHI16/p1300","authors":["Hanna Hasselqvist","Mia Hesselgren","Cristian Bogdan"],"conference":"CHI '16"}