{"paperId":2858326,"abstract":"Civic technology, or civic tech, encompasses a rich body of work, inside and outside HCI, around how we shape technology for, and in turn how technology shapes, how we govern, organize, serve, and identify matters of concern for communities. This study builds on previous work by investigating how civic leaders in a large US city conceptualize civic tech, in particular, how they approach the intersection of data, design and civics. We encountered a range of overlapping voices, from providers, to connectors, to volunteers of civic services and resources. Through this account, we identified different conceptions and expectation of data, design and civics, as well as several shared issues around pressing problems and strategic aspirations. Reflecting on this set of issues produced guiding questions, in particular about the current and possible roles for design, to advance civic tech.","reference":[{"content":"Asad, M. and Le Dantec, C.A. 2015. Illegitimate Civic Participation: Supporting Community Activists on the Ground. In Proc. of CSCW 2015. ACM, NY, NY, USA, 1694--1703.","paperID":"None"},{"content":"Bardzell, J., Bardzell, S. and Stolterman, E. 2014. Reading critical designs: supporting reasoned interpretations of critical design. In Proc. of CHI 2014, ACM Press, NY, NY, USA, 1951--1960.","paperID":"None"},{"content":"Bardzell, S., Bardzell, J.,, Forlizzi, J., Zimmerman, J. and Antanitis. J. 2012. Critical design and critical theory: the challenge of designing for provocation. In Proc. Of DIS 2012, ACM Press, NY, NY, USA, 288--297.","paperID":"None"},{"content":"Bohøj, M., Borchorst, N.G., Bødker, S., Korn, M., and Zander, P. 2011. Public deliberation in municipal planning: supporting action and reflection with mobile technology. In Proceedings of the 5th International Conference on Communities and Technologies (C&T '11). ACM, NY, NY, USA, 88--97.","paperID":"None"},{"content":"Busse, D., Borning, A., Mann, S., Hirsch, T., Nathan, L., Grimes Parker, A., Shneiderman, S., and Nunez, B. 2013. CHI at the barricades: an activist agenda?. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 2407--2412.","paperID":"None"},{"content":"Chau, C., Mathur, A., and Bers. M. 2006. Active citizenship through technology: collaboration, connection, and civic participation. In Proceedings of the 7th international conference on Learning sciences (ICLS '06). International Society of the Learning Sciences, 902--903.","paperID":"None"},{"content":"Crivellaro, C., Comber, R., Bowers, J., Wright, P., and Olivier, P. 2014. A pool of dreams: facebook, politics and the emergence of a social movement. In Proc. of CHI 2014, ACM, NY, NY, USA, 3573--3582.","paperID":"None"},{"content":"Crivellaro, C., Comber, R., Dade-Robertson, M., Bowen, S., Wright, P., and Olivier, P. 2015. Contesting the City: Enacting the Political Through Digitally Supported Urban Walks. In Proc. of CHI 2015, ACM, NY, NY, USA, 2853--2862.","paperID":"None"},{"content":"Department of Making and Doing. http://dmdphilly.org","paperID":"None"},{"content":"DiSalvo, C., Gregg, M., and Lodato, T. 2014. Building belonging. interactions 21, 4 (July 2014), 58--61.","paperID":"None"},{"content":"DiSalvo, C., Lodato, T., Jenkins, T., Lukens, J., Kim, T. (2014). Making Public Things: How HCI Design Can Express Matters of Concern. In Proc. of CHI 2014, ACM, NY, NY, USA, 2397--2406.","paperID":"None"},{"content":"Dourish, P. and Bell, G. (2011). Divining a Digital Future: Mess and Mythology in Ubiquitous Computing. Cambridge: MIT Press.","paperID":"None"},{"content":"Farnham, S., Keyes, D., Yuki, V., and Tugwell C. 2012. Puget sound off: fostering youth civic engagement through citizen journalism. In Proc. Of CSCW, ACM Press, NY, NY, USA, 285--294.","paperID":"None"},{"content":"Foth, M. 2011. From social butterfly to engaged citizen: Urban informatics, social media, ubiquitous computing, and mobile technology to support citizen engagement. Cambridge: MIT Press.","paperID":"None"},{"content":"Foth, M., Parra Agudelo, L., and Palleis, R. 2013. Digital soapboxes: towards an interaction design agenda for situated civic innovation. In Proc. UbiComp '13 Adjunct. ACM Press, NY, NY, USA, 725--728.","paperID":"None"},{"content":"Friedman Hewitt, J. 2009. COVER STORY: Citizencentered design (slowly) revolutionizes the media and experience of U.S. elections. interactions 16, 5 (September 2009), 18--25.","paperID":"None"},{"content":"Gaver. W. 2012. What should we expect from research through design?. In Proc. of CHI 2012, ACM Press, NY, NY, USA, 937--946.","paperID":"None"},{"content":"Gaver, W., Michael, M., Kerridge, T., Wilkie, A., Boucher, A., Ovalle, L., and Plummer-Fernandez, M. 2015. Energy Babble: Mixing Environmentally-Oriented Internet Content to Engage Community Groups. In Proc. of CHI 2015, ACM, NY, NY, USA, 1115--1124.","paperID":"None"},{"content":"Gerber, E. 2014. Design for America: organizing for civic innovation. interactions 21, 2 (March 2014), 42--47.","paperID":"None"},{"content":"Greenfield, A. (2013) Against the Smart City. NYC: Do projects.","paperID":"None"},{"content":"Harding, M., Knowles, B., Davies, N., and Rouncefield, M. 2015. HCI, Civic Engagement & Trust. In Proc. of CHI 2015, ACM, NY, NY, USA, 2833--2842.","paperID":"None"},{"content":"Helsinki Design Lab. http://helsinkidesignlab.org","paperID":"None"},{"content":"Hirsch, T. 2010. Water wars: designing a civic game about water scarcity. In Proc. of DIS 2010, ACM, NY, NY, USA, 340--343.","paperID":"None"},{"content":"Hirsch, T. and Liu, J. 2004. Speakeasy: overcoming barriers and promoting community development in an immigrant neighborhood. In Proc. Of DIS 2014, ACM Press, NY, NY, USA, 345--348.","paperID":"None"},{"content":"Irani, L. \"Hackathons and the Making of Entrepreneurial Citizenship.\" Science, Technology & Human Values (2015): 0162243915578486.","paperID":"None"},{"content":"Kim, J., Ko, E., Jung, J., Won Lee, C., Wook Kim, N., and Kim, J. 2015. Factful: Engaging Taxpayers in the Public Discussion of a Government Budget. In Proc. of CHI 2015, ACM, NY, NY, USA, 2843--2852.","paperID":"None"},{"content":"Knight Foundation. Emergence of Civic Tech: Investments in a Growing Field, KF report, 2013. http://knightfoundation.org/features/civictech/","paperID":"None"},{"content":"Lawson, S., Kirman, B., Linehan, C., Feltwell, T. and Hopkins, L. 2015. Problematising Upstream Technology through Speculative Design: The Case of Quantified Cats and Dogs. In Proc. CHI 2015, ACM Press, (2015), 2663--2672.","paperID":"None"},{"content":"Lou, Y. 2015. Opening Keynote -- Crossing: HCI, Design and Sustainability. In Proc. of CHI 2015, ACM, NY, NY, USA, 805--806.","paperID":"None"},{"content":"Pierce, J., Sengers, P., Hirsch, T., Jenkins, T., Gaver, W. and DiSalvo, C. 2015. Expanding and Refining Design and Criticality in HCI. In Proc. of CHI 2015, ACM Press, (2105), 2083--2092.","paperID":"None"},{"content":"Public Design Workshop @ Georgia Tech. http://publicdesignworkshop.net","paperID":"None"},{"content":"Robertson, S., Buie, E., and Murray, D. 2011. Interaction design for citizen engagement and digital government. In Proceedings of the 12th Annual International Digital Government Research Conference: Digital Government Innovation in Challenging Times (dg.o '11). ACM Press, NY, NY, USA, 376--377.","paperID":"None"},{"content":"Saporta, M. CITY's legacy damaged with lack of key voices in public decisions. Saporta Report, Aug 10, 2015. http://saportareport.com/CITY-legacy-damagedwith-lack-of-public-voices-in-key-decisions/","paperID":"None"},{"content":"Schuler, D. 2009. Communities, technology, and civic intelligence. In Proceedings of the fourth international conference on Communities and technologies (C&T '09). ACM Press, NY, NY, USA, 61--70.","paperID":"None"},{"content":"Semaan, B., Faucett, H., Robertson, S., Maruyama, M. and Douglas, S. 2015. Designing Political Deliberation Environments to Support Interactions in the Public Sphere. In Proc. of CHI 2015, ACM, NY, NY, USA, 3167--3176.","paperID":"None"},{"content":"Simon, H. The Sciences of the Artificial. MIT Press, Cambridge, MA., 1969.","paperID":"None"},{"content":"Stoll, J., Edwards, W.K., and Foot, K. 2012. Between us and them: building connectedness within civic networks. In Proc. of CSCW 2012. ACM, NY, NY, USA, 237--240.","paperID":"None"},{"content":"Strauss, A., and Corbin, J. (1994). Grounded Theory Methodology: An Overview. In N. Denzin & Y. Lincoln Handbook of Qualitative Research. 1st ed. (pp. 273--284).","paperID":"None"},{"content":"Taylor, A., Lindley, S., Regan, T., Sweeney, D., Vlachokyriakos, V., Grainger, L., and Lingel, J. 2015. Data-in-Place: Thinking through the Relations Between Data and Community. In Proc. of CHI 2015, ACM, NY, NY, USA, 2863--2872.","paperID":"None"},{"content":"Taylor, N., Marshall, J., Blum-Ross, A., Mills, J., Rogers, J., Egglestone, P., Frohlich, D., Wright, P., and Olivier, P. 2012. Viewpoint: empowering communities with situated voting devices. In Proc. of CHI 2012, ACM Press, NY, NY, USA, 1361--1370.","paperID":"None"},{"content":"Tonkinwise, C. (2015). Just Design: Being Dogmatic About Defining Speculative Critical Design Future Fiction. A Medium Corporation. https://medium.com/@camerontw/just-designb1f97cb3996f#.j31k5ajer","paperID":"None"},{"content":"Vlachokyriakos, V., Comber, R., Crivellaro, C., Taylor, N., Kuznetsov, S., Kavanaugh, A., Le Dantec, C. and Joon Kim, B. 2015. Designing Alternative Systems for Local Communities. In Proc. of CHI 2015, ACM Press, NY, NY, USA, 2333--2336.","paperID":"None"},{"content":"Vlachokyriakos, V., Comber, R., Ladha, K., Taylor, N., Dunphy, P., McCorry, P., and Olivier, P. 2014. PosterVote: expanding the action repertoire for local political activism. In Proc. of DIS 2014, ACM Press, NY, NY, USA, 795--804.","paperID":"None"},{"content":"Voida, A., Dombrowski, L., Hayes, G., and Mazmanian, M. 2014. Shared values/conflicting logics: working around e-government systems. In Proc. of CHI 2014, ACM, NY, NY, USA, 3583--3592.","paperID":"None"}],"citation":[],"title":"Data, Design and Civics: An Exploratory Study of Civic Tech","filename":"CHI16/p2970","authors":["Kirsten Boehner","Carl DiSalvo"],"conference":"CHI '16"}