{"paperId":2858421,"citation":[],"reference":[{"content":"Shiri Azenkot and Shumin Zhai. 2012. Touch behavior with different postures on soft smartphone keyboards. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services (MobileHCI '12), 251--260.","paperID":"None"},{"content":"Xiaojun Bi, Shiri Azenkot, Kurt Partridge, and Shumin Zhai. 2013. Octopus: evaluating touchscreen keyboard correction and recognition algorithms via. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 543--552.","paperID":"None"},{"content":"Xiaojun Bi, Ciprian Chelba, Tom Ouyang, Kurt Partridge, and Shumin Zhai. 2012. Bimanual gesture keyboard. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12), 137--146.","paperID":"None"},{"content":"Xiaojun Bi, Tom Ouyang, and Shumin Zhai. 2014. Both complete and correct?: multi-objective optimization of touchscreen keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 2297--2306.","paperID":"None"},{"content":"Xiaojun Bi, Barton A. Smith, and Shumin Zhai. 2010. Quasi-qwerty soft keyboard optimization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 283--286.","paperID":"None"},{"content":"Xiaojun Bi, Barton A. Smith, Shumin Zhai. (2012) \"Multilingual Touchscreen Keyboard Design and Optimization\", Human-Computer Interaction, Volume 27, Issue 4, 352--382.","paperID":"None"},{"content":"Xiang Cao and Shumin Zhai. 2007. Modeling human performance of pen stroke gestures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 1495--1504.","paperID":"None"},{"content":"Paul A. David. 1995. Clio and the Economics of QWERTY. The American Economic Review. Vol. 75, No.2 332 - 337","paperID":"None"},{"content":"Mark Dunlop and John Levine. 2012. Multidimensional pareto optimization of touchscreen keyboards for speed, familiarity and improved spell checking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2669--2678.","paperID":"None"},{"content":"Paul M. Fitts. (1954). The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, 47, 381--391.","paperID":"None"},{"content":"Getschow, C.O., Rosen, M.J., and Goodenough Trepagnier, C. A systematic approach to design a minimum distance alphabetical keyboard. In Proc. RESNA 1986, RESNA (1986), 396--398.","paperID":"None"},{"content":"Hastings, W.K. Monte Carlo sampling methods using Markov chains and their applications. In Biometrika 57, 1 (1970), 97--109.","paperID":"None"},{"content":"Per-Ola Kristensson and Shumin Zhai. 2004. SHARK2 : a large vocabulary shorthand writing system for pen-based computers. In Proceedings of the 17th annual ACM symposium on User interface software and technology (UIST '04), 43--52.","paperID":"None"},{"content":"James R. Lewis, Peter J. Kennedy, Mary J. LaLomia (1999). Development of a Digram-Based Typing Key Layout for Single-Finger/Stylus Input. Proceedings of The Human Factors and Ergonomics Society 43rd Annual Meeting.","paperID":"None"},{"content":"Liebowitz, Stan J., and Stephen E. Margolis. \"The fable of the keys.\" Journal of Law and Economics (1990): 1--25","paperID":"None"},{"content":"I. Scott MacKenzie and Shawn X. Zhang. 1999. The design and evaluation of a high-performance soft keyboard. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems(CHI '99), 2531.","paperID":"None"},{"content":"I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase sets for evaluating text entry techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, NY, NY, USA, 754--755.","paperID":"None"},{"content":"Antti Oulasvirta, Anna Reichel, Wenbin Li, Yan Zhang, Myroslav Bachynskyi, Keith Vertanen, and Per Ola Kristensson. 2013. Improving two-thumb text entry on touchscreen devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2765--2774.","paperID":"None"},{"content":"Shyam Reyal, Shumin Zhai, and Per Ola Kristensson. 2015. Performance and User Experience of Touchscreen and Gesture Keyboards in a Lab Setting and in the Wild. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 679688.","paperID":"None"},{"content":"Jochen Rick. 2010. Performance optimizations of virtual keyboards for stroke-based text entry on a touch-based tabletop. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10), 77--86.","paperID":"None"},{"content":"Brian A. Smith, Xiaojun Bi, and Shumin Zhai. 2015. Optimizing Touchscreen Keyboards for Gesture Typing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 33653374.","paperID":"None"},{"content":"Hisao Yamada. A historical study of typewriters and typing methods: from the position of planning Japanese parallels. Information Processing 2, 4 (1980), 175--202.","paperID":"None"},{"content":"Shumin Zhai, Michael Hunter, and Barton A. Smith. 2000. The metropolis keyboard - an exploration of quantitative techniques for virtual keyboard design. In Proceedings of the 13th annual ACM symposium on User interface software and technology (UIST '00), 119--128.","paperID":"None"},{"content":"Shumin Zhai, Michael Hunter, and Barton A. Smith (2002). Performance optimization of virtual keyboards. Human-Computer Interaction, 17(2,3), 89--129.","paperID":"None"},{"content":"Shumin Zhai and Per Ola Kristensson. 2008. Interlaced QWERTY: accommodating ease of visual search and input flexibility in shape writing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 593--596.","paperID":"None"},{"content":"Shumin Zhai and Per Ola Kristensson. 2012. The word-gesture keyboard: reimagining keyboard interaction. Commun. ACM 55, 9 (September 2012), 91--101.","paperID":"None"}],"abstract":"Despite of a significant body of research in optimizing the virtual keyboard layout, none of them has gained large adoption, primarily due to the steep learning curve. To address this learning problem, we introduced three types of Qwerty constraints, Qwerty1, QwertyH1, and One-Swap bounds in layout optimization, and investigated their effects on layout learnability and performance. This bounded optimization process leads to IJQwerty, which has only one pair of keys different from Qwerty. Our theoretical analysis and user study show that IJQwerty improves the accuracy and input speed of gesture typing over Qwerty once a user reaches the expert mode. IJQwerty is also extremely easy to learn. The initial upon-use text entry speed is the same with Qwerty. Given the high performance and learnability, such a layout will more likely gain large adoption than any of previously obtained layouts. Our research also shows the disparity from Qwerty substantially affects layout learning. To minimize the learning effort, a new layout needs to hold a strong resemblance to Qwerty.","title":"IJQwerty: What Difference Does One Key Change Make? Gesture Typing Keyboard Optimization Bounded by One Key Position Change from Qwerty","filename":"CHI16/p49","authors":["Xiaojun Bi","Shumin Zhai"],"conference":"CHI '16"}