{"paperId":2858056,"citation":[],"reference":[{"content":"Agathe Battestini, Vidya Setlur, and Timothy Sohn. 2010. A large scale study of text-messaging use. In Proceedings of the 12th international conference on Human computer interaction with mobile devices and services (MobileHCI '10). ACM, NY, NY, USA, 229--238. DOI=http://dx.doi.org/10.1145/1851600.1851638","paperID":"None"},{"content":"Frank R. Bentley and Ying-Yu Chen. 2015. The Composition and Use of Modern Mobile Phonebooks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2749--2758. DOI=http://dx.doi.org/10.1145/2702123.2702182","paperID":"None"},{"content":"Barry Brown, Moira McGregor, and Eric Laurier. 2013. iPhone in vivo: video analysis of mobile device use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1031--1040. DOI=http://dx.doi.org/10.1145/2470654.2466132","paperID":"None"},{"content":"Michael Buhrmester, Tracy Kwang, and Samuel D. Gosling (2011). Amazon's Mechanical Turk a new source of inexpensive, yet high-quality, data?. Perspectives on psychological science, 6(1), 3--5.","paperID":"None"},{"content":"Juan Pablo Carrascal and Karen Church. 2015. An InSitu Study of Mobile App & Mobile Search Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2739--2748. DOI=http://dx.doi.org/10.1145/2702123.2702486","paperID":"None"},{"content":"Ying-Yu Chen, Frank Bentley, Christian Holz, and Cheng Xu. 2015. Sharing (and Discussing) the Moment: The Conversations that Occur Around Shared Mobile Media. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, NY, NY, USA, 264--273. DOI=http://dx.doi.org/10.1145/2785830.2785868","paperID":"None"},{"content":"Karen Church and Rodrigo de Oliveira. 2013. What's up with whatsapp?: comparing mobile instant messaging behaviors with traditional SMS. In Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services (MobileHCI '13). ACM, NY, NY, USA, 352--361. DOI=http://dx.doi.org/10.1145/2493190.2493225","paperID":"None"},{"content":"Karen Church and Nuria Oliver. 2011. Understanding mobile web and mobile search use in today's dynamic mobile landscape. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, NY, NY, USA, 67--76. DOI=http://dx.doi.org/10.1145/2037373.2037385","paperID":"None"},{"content":"Karen Church, Barry Smyth, Paul Cotter, and Keith Bradley. 2007. Mobile information access: A study of emerging search behavior on the mobile Internet. ACM Trans. Web 1, 1, Article 4 (May 2007). DOI=http://dx.doi.org/10.1145/1232722.1232726","paperID":"None"},{"content":"Yanqing Cui and Virpi Roto. 2008. How people use the web on mobile devices. In Proceedings of the 17th international conference on World Wide Web (WWW '08). ACM, NY, NY, USA, 905--914. DOI=http://dx.doi.org/10.1145/1367497.1367619","paperID":"None"},{"content":"Rebecca E. Grinter, Margery A. Eldridge.. y do tngrs luv 2 txt msg? In Proceedings of ECSCW'01, Kluwer Academic Publishers (2001), 219--238.","paperID":"None"},{"content":"Mizuko Ito. Mobile phones, Japanese youth, and the replacement of social contact. Mobile Communications (2005), 131--148.","paperID":"None"},{"content":"Maryam Kamvar, Melanie Kellar, Rajan Patel, and Ya Xu. 2009. Computers and iphones and mobile phones, oh my!: a logs-based comparison of search users on different devices. In Proceedings of the 18th international conference on World wide web (WWW '09). ACM, NY, NY, USA, 801--810. DOI= http://dx.doi.org/10.1145/1526709.1526817","paperID":"None"},{"content":"Simon Khalaf,. 2014. Apps Solidify Leadership Six Years into the Mobile Revolution http://flurrymobile.tumblr.com/post/115191864580/app s-solidify-leadership-six-years-into-the-mobile","paperID":"None"},{"content":"Inseong Lee, Jaesoo Kim, and Jinwoo Kim (2005). Use contexts for the mobile internet: a longitudinal study monitoring actual use of mobile internet services. International Journal of Human-Computer Interaction, 18(3), 269--292.","paperID":"None"},{"content":"Bonnie A. Nardi, Steve Whittaker, and Erin Bradner. 2000. Interaction and outeraction: instant messaging in action. In Proceedings of the 2000 ACM conference on Computer supported cooperative work (CSCW '00). ACM, NY, NY, USA, 79--88. DOI=http://dx.doi.org/10.1145/358916.358975","paperID":"None"},{"content":"Stina Nylander, Terés Lundquist, and Andreas Brännström. 2009. At home and with computer access: why and where people use cell phones to access the internet. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1639--1642. DOI= http://dx.doi.org/10.1145/1518701.1518951","paperID":"None"},{"content":"Hartmut Obendorf, Harald Weinreich, Eelco Herder, and Matthias Mayer. 2007. Web page revisitation revisited: implications of a long-term click-stream study of browser usage. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 597--606. DOI= http://dx.doi.org/10.1145/1240624.1240719","paperID":"None"},{"content":"Kenton P. O'Hara, Michael Massimi, Richard Harper, Simon Rubens, and Jessica Morris. 2014. Everyday dwelling with WhatsApp. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 1131--1143. DOI=http://dx.doi.org/10.1145/2531602.2531679","paperID":"None"},{"content":"David A. Shamma, and Yiming Liu. (2009). Zync with me: Synchronized sharing of video through instant messaging. Social Interactive Television: Immersive Shared Experiences and Perspectives, 273--288.","paperID":"None"},{"content":"Yang Song, Hao Ma, Hongning Wang, and Kuansan Wang. 2013. Exploring and exploiting user search behavior on mobile and tablet devices to improve search relevance. In Proceedings of the 22nd international conference on World Wide Web (WWW '13). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 1201--1212.","paperID":"None"},{"content":"Carol A. Taylor, Ona Anicello, Scott Somohano, Nancy Samuels, Lori Whitaker, and Judith A. Ramey. 2008. A framework for understanding mobile internet motivations and behaviors. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, NY, NY, USA, 26792684. DOI=http://dx.doi.org/10.1145/1358628.1358744","paperID":"None"},{"content":"Chad Tossell, Philip Kortum, Ahmad Rahmati, Clayton Shepard, and Lin Zhong. 2012. Characterizing web use on smartphones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2769--2778. DOI= http://dx.doi.org/10.1145/2207676.2208676","paperID":"None"},{"content":"Alexandra Weilenmann, and Catrin Larsson. (2000, October). Collaborative use of mobile telephones: A field study of Swedish teenagers. In Proceedings of NordiCHI 2000.","paperID":"None"},{"content":"Alexandra Weilenmann. 2010. Learning to Text: An Interaction Analytic Study of How Seniors Learn to Enter Text on Mobile Phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 11351144. DOI=http://dx.doi.org/10.1145/1753326.1753496","paperID":"None"},{"content":"Milan Vojnović. (2008, March). On mobile user behaviour patterns. In Communications, 2008 IEEE International Zurich Seminar on (pp. 26--29). IEEE. 26. Jeonghee Yi, Farzin Maghoul, and Jan Pedersen. 2008. Deciphering mobile search patterns: a study of Yahoo! mobile search queries. In Proceedings of the 17th international conference on World Wide Web (WWW '08). ACM, NY, NY, USA, 257--266. DOI=http://dx.doi.org/10.1145/1367497.1367533","paperID":"None"}],"abstract":"The use of applications on mobile devices has changed dramatically over the past few years. While web browsing was once a common activity, it's now reported that 86% of time on mobile phones is in apps other than the browser. We set out to understand how the mobile web was currently fitting into people's lives and what web sessions looked like. Finding a dramatic reduction in mobile web revisi-tation rates compared to previous work and that a large number of sessions comprised single page views, we then studied how web content was shared with others in mobile messaging, the source of many single page sessions. The HCI community has not heavily studied this sharing activity that many people perform daily. We conclude with design implications for new mobile applications from our two studies with a combined 287 participants where we studied actual logs of mobile web use and link sharing behavior.","title":"\"I thought she would like to read it\": Exploring Sharing Behaviors in the Context of Declining Mobile Web Use","filename":"CHI16/p1893","authors":["Frank R. Bentley","S. Tejaswi Peesapati","Karen Church"],"conference":"CHI '16"}