{"paperId":2858588,"citation":[],"abstract":"With an increasing reliance on crowdsourcing games as data-gathering tools, it is imperative to understand how to motivate and sustain high levels of voluntary contribution. To this end, the present work directly compared the impact of various \"emphasis frames,\" highlighting distinct intrinsic motivational factors, used to describe an online game in which players provide descriptive metadata \"tags\" for digitized images. An initial study showed that, compared to frames emphasizing personal enjoyment or altruistic motivations, a frame emphasizing a \"growing community of players\" solicited significantly fewer contributions. A second study tested the hypothesis that this lower level of contribution resulted from social loafing (the tendency to exert less effort in collective tasks in which contributions are anonymous and pooled). Results revealed that, compared to a no-frame control condition, a frame emphasizing the preponderance of other players reduced contribution levels and game replay likelihood, whereas a frame emphasizing the scarcity of fellow players increased contribution and replay levels. Various strategies for counteracting social loafing in crowdsourcing contexts are discussed.","reference":[{"content":"Janna Anderson and Lee Rainie. 2012. Millennials will benefit and suffer due to their hyperconnected lives. Pew Internet and American Life Project. Retrieved October 16, 2014 from http://www.pewinternet.org/Reports/2012/Hyperconne cted-lives/Overview.aspx","paperID":"None"},{"content":"Kirk D. Borne and Zooniverse Team. 2011. The Zooniverse: A framework for knowledge discovery from citizen science data. In AGU Fall Meeting Abstracts, 1: 650.","paperID":"None"},{"content":"Daren C. Brabham. 2008. Moving the crowd at iStockphoto: The composition of the crowd and motivations for participation in a crowdsourcing application. First Monday, 13, 6. Available from http://www.uic.edu/htbin/cgiwrap/bin/ojs/index.php/fm/article/view/2159/1969","paperID":"None"},{"content":"Mary A. Brickner, Stephen G. Harkins, and Thomas M. Ostrom. 1986. Effects of personal involvement: Thought-provoking implications for social loafing. Journal of Personality and Social Psychology, 51, 4: 763--769.","paperID":"None"},{"content":"Otto Chrons and Sami Sundell. 2011. Digitalkoot: Making old archives accessible using crowdsourcing. In HCOMP 2011: 3rd Human Computation Workshop. Available from http://cdn.microtask.com/research/DigitalkootHCOMP2011-Chrons-Sundell.pdf","paperID":"None"},{"content":"Robert B. Cialdini, Raymond R. Reno, and Carl A. Kallgren. 1990. A focus theory of normative conduct: recycling the concept of norms to reduce littering in public places. Journal of Personality and Social Psychology, 58, 6: 1015--1026.","paperID":"None"},{"content":"Seth Cooper, Firas Khatib, Adrien Treuille, Janos Barbero, Jeehyung Lee, Michael Beenen, ..., and Foldit Players. 2010. Predicting protein structures with a multiplayer online game. Nature, 466, 7307: 756760.","paperID":"None"},{"content":"Enrique Estellés-Arolas and Fernando GonzálezLadrón-de-Guevara. 2012. Towards an integrated crowdsourcing definition. Journal of Information Science, 38, 2: 189--200.","paperID":"None"},{"content":"Mary Flanagan and Peter Carini. 2012. How games can help us access and understand archival images. The American Archivist, 75, 2: 514--537.","paperID":"None"},{"content":"Mary Flanagan, Sukdith Punjasthitkul, Max Seidman, Geoff Kaufman, and Peter Carini. 2013 Citizen Archivists at Play: Game Design for Gathering Metadata for Cultural Heritage Institutions. In Proceedings of DiGRA. 2013. Available from http://www.digra.org/wp-content/uploads/digitallibrary/paper_418.compressed.pdf","paperID":"None"},{"content":"David Geiger, Stefan Seedorf, Thimo Schulze, Robert Nickerson, and Martin Schader. 2011. Managing the Crowd: Towards a Taxonomy of Crowdsourcing Processes. In Proceedings of the Seventeenth Americas Conference on Information Systems (AMCIS '11), 111.","paperID":"None"},{"content":"April Grey and Christine R. Hurko. 2012. So you think you're an expert: Keyword searching vs. controlled subject headings. Codex: The Journal of the Louisiana Chapter of the ACRL, 1, 4: 15--26.","paperID":"None"},{"content":"Derek Hansen, Patrick Schone, Douglas Corey, Matthew Reid, and Jay Gehring. 2013. Quality control mechanisms for crowdsourcing: peer review, arbitration, and expertise at familysearch indexing. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13), 649--660. http://dx.doi.org/10.1145/2441776.2441848","paperID":"None"},{"content":"Heather Hedden, 2008. How semantic tagging increases findability. EContent, 31, 8: 38--43.","paperID":"None"},{"content":"Michael A. Hogg, Dominic Abrams, Sabine Otten, and Steve Hinkle. 2004. The social identity perspective intergroup relations, self-conception, and small groups. Small Group Research, 35, 3: 246--276.","paperID":"None"},{"content":"Stephen G. Harkins and Richard E. Petty. 1982. Effects of task difficulty and task uniqueness on social loafing. Journal of Personality and Social Psychology, 43, 6: 1214--1229.","paperID":"None"},{"content":"Steven J. Karau and Kipling D. Williams. 1993. Social loafing: A meta-analytic review and theoretical integration. Journal of Personality and Social Psychology, 65, 4: 681--706.","paperID":"None"},{"content":"Steven J. Karau and Kipling D. Williams. 1997. The effects of group cohesiveness on social loafing and social compensation. Group Dynamics: Theory, Research, and Practice, 1, 2: 156--168.","paperID":"None"},{"content":"Nicolas Kaufmann, Thimo Schulze, and Daniel Velt. 2011. More than fun and money. Worker motivation in crowdsourcing - A study on Mechanical Turk. In Proceedings of the Seventeenth Americas Conference on Information Systems (AMCIS '511), 1--11.","paperID":"None"},{"content":"Firas Khatib, Seth Cooper, Michael D. Tyka, Kefan Xu, Ilya Makedon, Zoran Popović, David Baker, and Foldit Players. 2011. Algorithm discovery by protein folding game players. Proceedings of the National Academy of Sciences, 108, 47: 18949--18953","paperID":"None"},{"content":"Chinmay Kulkarni, Richard Socher, Michael S. Bernstein, and Scott R. Klemmer. 2014. Scaling shortanswer grading by combining peer assessment with algorithmic scoring. In Proceedings of the First ACM Conference on Learning @ Scale Conference (L@S '14), 99--108. http://dx.doi.org/10.1145/2556325.2566238","paperID":"None"},{"content":"Bibb Latane, Kipling Williams, and Stephen Harkins. 1979. Many hands make light the work: The causes and consequences of social loafing. Journal of Personality and Social Psychology, 37, 6: 822--832.","paperID":"None"},{"content":"Edith Law and Luis von Ahn, 2011. Human computation. Synthesis Lectures on Artificial Intelligence and Machine Learning, 5, 3: 1--121.","paperID":"None"},{"content":"Jan Marco Leimeister, Michael Huber, Ulrich Bretschneider, and Helmut Krcmar. 2009. Leveraging crowdsourcing: activation-supporting components for IT-based ideas competition. Journal of Management Information Systems, 26, 1: 197--224.","paperID":"None"},{"content":"Kimberly Ling, Gerald Beenen, Pamela Ludford, Xioqing Wang, Klarissa Chang, Xin Li, ... and Robert Kraut. 2005. Using social psychology to motivate contributions to online communities. Journal of Computer-Mediated Communication, 10:4: 00-00.","paperID":"None"},{"content":"Chris J. Lintott, Kevin Schawinski, Anze Slosar, Kate Land, Steven Bamford, Daniel Thomas, ... and Jan Vandenberg. 2008. Galaxy Zoo: Morphologies derived from visual inspection of galaxies from the Sloan Digital Sky Survey. Monthly Notices of the Royal Astronomical Society, 389, 3: 1179--1189.","paperID":"None"},{"content":"Adam Mathes. 2004. Folksonomies-cooperative classification and communication through shared metadata. Computer Mediated Communication 47: 113.","paperID":"None"},{"content":"Sam Mavandadi, Stoyan Dimitrov, Steve Feng, Frank Yu, Uzair Sikora, Oguzhan Yaglidere, ..., and Aydogan Ozcan. 2012. Distributed medical image analysis and diagnosis through crowd-sourced games: A malaria case study. PloS One, 7, 5: e37245.","paperID":"None"},{"content":"Casey Newton. 2012. Survey: iPhone, iPad ownership surging among teenagers. Retrieved October 15, 2014 from http://news.cnet.com/8301-13579_3-5752910837/survey-iphone-ipad-ownership-surging-amongteenagers/","paperID":"None"},{"content":"Oded Nov, Ofer Arazy, and David Anderson. 2011. Dusting for science: Motivation and participation of digital citizen science volunteers. In Proceedings of the 2011 iConference (iConference '11), 68--74. http://dx.doi.org/10.1145/1940761.1940771","paperID":"None"},{"content":"Johan Oomen and Lora Aroyo. 2011. Crowdsourcing in the cultural heritage domain: opportunities and challenges. In Proceedings of the 5th International Conference on Communities and Technologies (C&T '11), 138--149. http://dx.doi.org/10.1145/2103354.2103373","paperID":"None"},{"content":"Nathan R. Prestopnik and Kevin Crowston. 2012. Citizen science system assemblages: Understanding the technologies that support crowdsourced science. In Proceedings of the 2012 iConference (iConference 2012), 168--176. http://dx.doi.org/10.1145/2132176.2132198","paperID":"None"},{"content":"Yolanda Rankin, McKenzie McNeal, Marcus W. Shute, and Bruce Gooch. 2008. User centered game design: Evaluating massive multiplayer online role playing games for second language acquisition. In Proceedings of the 2008 ACM SIGGRAPH Symposium on Video Games, 43--49. http://dx.doi.org/10.1145/1401843.1401851","paperID":"None"},{"content":"Mia Ridge. 2011. Museum crowdsourcing games: Improving collections through play. Retrieved October 15, 2014 from: http://www.miaridge.com/projects/Stockholm_museum crowdsourcinggames_MiaRidge.pdf","paperID":"None"},{"content":"Jack Rogstadius, Vassilis Kostakos, Aniket Kittur, Boris Smus, Jim Laredo, and Maja Vukovic. 2011. An assessment of intrinsic and extrinsic motivation on task quality in crowdsourcing markets. In Proceedings of the 5th International AAAI Conference on Weblogs and Social Media, 321--238.","paperID":"None"},{"content":"Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and Emotion, 30, 4: 344--360.","paperID":"None"},{"content":"P. Wesley Schultz, Jessica M. Nolan, Robert B. Cialdini, Noah Goldstein, and Vladas Griskevicius. 2007. The constructive, destructive, and reconstructive power of social norms. Psychological Science, 18, 5: 429--434.","paperID":"None"},{"content":"Shilad Sen, F. Maxwell Harper, Adam LaPitz, and John Riedl. 2007. The quest for quality tags. In Proceedings of the 2007 International ACM Conference on Supporting Group Work (GROUP '07), 361--370. http://dx.doi.org/10.1145/1316624.1316678","paperID":"None"},{"content":"Kurt Squire and Seann Dikkers. 2012. Amplifications of learning use of mobile media devices among youth. Convergence: The International Journal of Research into New Media Technologies, 18, 4: 445--464.","paperID":"None"},{"content":"Steven J. J. Tedjamulia, Douglas L. Dean, David R. Olsen, and Conan C. Albrecht. 2005. Motivating content contributions to online communities: Toward a more comprehensive theory. In Proceedings of the 38th Annual Hawaii International Conference on System Sciences (HICSS'05), 193b. http://dx.doi.org/10.1109/HICSS.2005.444","paperID":"None"},{"content":"Steven L. Thorne, Rebecca W. Black, and Julie M. Sykes. 2009. Second language use, socialization, and learning in Internet interest communities and online gaming. The Modern Language Journal, 93, s1: 802821.","paperID":"None"},{"content":"Jennifer Trant. 2006a. Exploring the potential for social tagging and folksonomy in art museums: Proof of concept. New Review of Hypermedia and Multimedia, 12, 1: 83--105.","paperID":"None"},{"content":"Jennifer Trant. 2006b. Social classification and folksonomy in art museums: Early data from the Steve. Museum tagger prototype. Advances in Classification Research Online, 17, 1: 1--30.","paperID":"None"},{"content":"Ben Vershbow. 2011. Bringing in the crowd: Effects, affects and a few (minor) defects. Paper presented at Make It Work: Improvisations on the Stewardship of Digital Information, Conference of the National Digital Stewardship Alliance.","paperID":"None"},{"content":"Luis von Ahn and Laura Dabbish. 2004. Labeling images with a computer game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04), 319--326. http://dx.doi.org/10.1145/985692.985733","paperID":"None"},{"content":"Luis von Ahn, Mihir Kedia, and Manuel Blum. 2006. Verbosity: A game for collecting common-sense facts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 75--78. http://dx.doi.org/10.1145/1124772.1124784","paperID":"None"},{"content":"Andrea Wiggins and Kevin Crowston. 2011. From conservation to crowdsourcing: A typology of citizen science. In Proceedings of the 44th Annual Hawaii International Conference on Systems Sciences, 1--10.","paperID":"None"},{"content":"Lixiu Yu, Paul André, Aniket Kittur, and Robert Kraut. 2014. A comparison of social, learning, and financial strategies on crowd engagement and output quality. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, 967--978. http://dx.doi.org/10.1145/2531602.2531729","paperID":"None"},{"content":"Man-Ching Yuen, Irwin King, and Kwong-Sak Leung. 2011. A survey of crowdsourcing systems. In Proceedings of the 3rd IEEE International Conference on Social Computing, 766--773. http://dx.doi.org/10.1109/PASSAT/SocialCom.2011.20","paperID":"None"}],"title":"Investigating the Impact of 'Emphasis Frames' and Social Loafing on Player Motivation and Performance in a Crowdsourcing Game","filename":"CHI16/p4122","authors":["Geoff Kaufman","Mary Flanagan","Sukdith Punjasthitkul"],"conference":"CHI '16"}