{"paperId":2858280,"citation":[],"reference":[{"content":"Richard I Anderson, Jeremy Ashley, Tobias Herrmann, Justin Miller, Jim Nieters, Shauna Sampson Eves, and Secil Tabli Watson. 2007. Moving UX into a position of corporate influence: whose advice really works?. In CHI'07 Extended Abstracts on Human Factors in Computing Systems. ACM, 1905--1908.","paperID":"None"},{"content":"Jacques Bertin. 1983. Semiology of graphics: diagrams, networks, maps. University of Wisconsin press.","paperID":"None"},{"content":"Alberto Cairo. 2012. The Functional Art: An introduction to information graphics and visualization. New Riders.","paperID":"None"},{"content":"Sheelagh Carpendale. 2008. Evaluating information visualizations. In Information Visualization. Springer, 19--45.","paperID":"None"},{"content":"William S Cleveland and Robert McGill. 1984. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American statistical association 79, 387 (1984), 531--554.","paperID":"None"},{"content":"Heather Desurvire, Jim Kondziela, and Michael E Atwood. 1992. What is gained and lost when using methods other than empirical testing. In Posters and short talks of the 1992 SIGCHI conference on Human factors in computing systems. ACM, 125--126.","paperID":"None"},{"content":"Stephen Few. 2006. Visual Communication: Design Principles for Displaying Quantitative Information. Cognos Innovation Center (September 2006). http://www.perceptualedge.com/articles/Whitepapers/ Visual_Communication.pdf.","paperID":"None"},{"content":"Stephen Few. 2009. Now you see it: simple visualization techniques for quantitative analysis. Analytics Press.","paperID":"None"},{"content":"Yoav Freund and Robert E Schapire. 1996. Experiments with a new boosting algorithm. In ICML, Vol. 96. 148--156.","paperID":"None"},{"content":"Marti A Hearst, Eytan Adar, Robert Kosara, Tamara Munzner, Jon Schwabish, and Ben Shneiderman. 2015. Vis, The Next Generation: Teaching Across the Researcher-Practitioner Gap. In IEEE Conference on Information Visualization [Panel].","paperID":"None"},{"content":"Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In CHI. ACM, 203--212.","paperID":"None"},{"content":"Tasha Hollingsed and David G Novick. 2007. Usability inspection methods after 15 years of research and practice. In Proceedings of the 25th Annual ACM international conference on Design of communication. ACM, 249--255.","paperID":"None"},{"content":"Tobias Isenberg, Petra Isenberg, Jian Chen, Michael Sedlmair, and Torsten Moller. 2013. A systematic review on the practice of evaluating visualization. Visualization and Computer Graphics, IEEE Transactions on 19, 12 (2013), 2818--2827.","paperID":"None"},{"content":"Robin Jeffries and Heather Desurvire. 1992. Usability testing vs. heuristic evaluation: was there a contest? ACM SIGCHI Bulletin 24, 4 (1992), 39--41.","paperID":"None"},{"content":"Robin Jeffries, James R Miller, Cathleen Wharton, and Kathy Uyeda. 1991. User interface evaluation in the real world: a comparison of four techniques. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 119--124.","paperID":"None"},{"content":"Ron Kohavi, Roger Longbotham, Dan Sommerfield, and Randal M. Henne. 2009. Controlled experiments on the web: survey and practical guide. Data Min. Knowl. Discov. 18 (2009), 140--181.","paperID":"None"},{"content":"Robert Kosara and Caroline Ziemkiewicz. 2010. Do Mechanical Turks dream of square pie charts?. In Proceedings of the 3rd BELIV'10 Workshop: BEyond time and errors: novel evaLuation methods for Information Visualization. ACM, 63--70.","paperID":"None"},{"content":"Chinmay Kulkarni, Koh Pang Wei, Huy Le, Daniel Chia, Kathryn Papadopoulos, Justin Cheng, Daphne Koller, and Scott R Klemmer. 2013. Peer and self assessment in massive online classes. In ACM Transactions on Computer Human Interaction (TOCHI). Vol. 20. ACM.","paperID":"None"},{"content":"Heidi Lam, Enrico Bertini, Petra Isenberg, Catherine Plaisant, and Sheelagh Carpendale. 2012. Empirical studies in information visualization: Seven scenarios. Visualization and Computer Graphics, IEEE Transactions on 18, 9 (2012), 1520--1536.","paperID":"None"},{"content":"Gitte Lindgaard and Jarinee Chattratichart. 2007. Usability testing: what have we overlooked?. In Proceedings of the SIGCHI Conference on Human factors in Computing Systems. ACM, 1415--1424.","paperID":"None"},{"content":"Kurt Luther, J Tolentino, Wei Wu, Amy Pavel, B Bailey, Maneesh Agrawala, Björn Hartmann, and Steven P Dow. 2015. Structuring, Aggregating, and Evaluating Crowdsourced Design Critique. CSCW.","paperID":"None"},{"content":"Jock Mackinlay. 1988. Applying a theory of graphical presentation to the graphic design of user interfaces. In UIST. ACM, 179--189.","paperID":"None"},{"content":"Jakob Nielsen. 1992. Finding usability problems through heuristic evaluation. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 373--380.","paperID":"None"},{"content":"Jakob Nielsen and Thomas K Landauer. 1993. A mathematical model of the finding of usability problems. In Proceedings of the INTERACT'93 and CHI'93 conference on Human factors in computing systems. ACM, 206--213.","paperID":"None"},{"content":"Jakob Nielsen and Rolf Molich. 1990. Heuristic evaluation of user interfaces. In CHI. ACM, 249--256.","paperID":"None"},{"content":"Chris North. 2006. Toward measuring visualization insight. Computer Graphics and Applications, IEEE 26, 3 (2006), 6--9.","paperID":"None"},{"content":"Lucy Nowell, Robert Schulman, and Deborah Hix. 2002. Graphical encoding for information visualization: an empirical study. In Information Visualization, 2002. INFOVIS 2002. IEEE Symposium on. IEEE, 43--50.","paperID":"None"},{"content":"David A Robb, Stefano Padilla, Britta Kalkreuter, and Mike J Chantler. 2015. Crowdsourced Feedback With Imagery Rather Than Text: Would Designers Use It?. In CHI. ACM, 1355--1364.","paperID":"None"},{"content":"James H Steiger. 2004. Beyond the F test: Effect size confidence intervals and tests of close fit in the analysis of variance and contrast analysis. Psychological methods 9, 2 (2004), 164.","paperID":"None"},{"content":"David Tinapple, Loren Olson, and John Sadauskas. 2013. CritViz: Web-based software supporting peer critique in large creative classrooms. Bulletin of the IEEE Technical Committee on Learning Technology 15, 1 (2013), 29.","paperID":"None"},{"content":"Colin Ware. 2012. Information visualization: perception for design. Elsevier.","paperID":"None"},{"content":"Huahai Yang, Yunyao Li, and Michelle X Zhou. 2014. Understand users' comprehension and preferences for composing information visualizations. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 1 (2014), 6.","paperID":"None"},{"content":"Alvin Yuan, Kurt Luther, Markus Krause, Sophie Vennix, Stephen P. Dow, and Björn Hartmann. 2016. Almost an Expert: The Effects of Rubrics and Expertise on Perceived Value of Crowdsourced Design Critiques. CSCW. to appear.","paperID":"None"},{"content":"Ying Zhu. 2007. Measuring effective data visualization. Advances in Visual Computing, Lecture Notes in Computer Science (LNCS) 4842 (2007), 652--661.","paperID":"None"}],"abstract":"In an instructional setting it can be difficult to accurately assess the quality of information visualizations of several variables. Instead of a standard design critique, an alternative is to ask potential readers of the chart to answer questions about it. A controlled study with 47 participants shows a good correlation between aggregated novice heuristic evaluation scores and results of answering questions about the data, suggesting that the two forms of assessment can be complementary. Using both metrics in parallel can yield further benefits; discrepancies between them may reveal incorrect application of heuristics or other issues.","title":"Evaluating Information Visualization via the Interplay of Heuristic Evaluation and Question-Based Scoring","filename":"CHI16/p5028","authors":["Marti A. Hearst","Paul Laskowski","Luis Silva"],"conference":"CHI '16"}