{"paperId":2858410,"abstract":"There has been increasing interest in the work practices of user experience (UX) designers, particularly in relation to approaches that support adoption of human-centered principles in corporate environments. This paper addresses the ways in which UX designers conceive of methods that support their practice, and the methods they consider necessary as a baseline competency for beginning user experience designers. Interviews were conducted with practitioners in a range of companies, with differing levels of expertise and educational backgrounds represented. Interviewees were asked about their use of design methods in practice, and the methods they considered to be core of their practice; in addition, they were asked what set of methods would be vital for beginning designers joining their company. Based on these interviews, I evaluate practitioner conceptions of design methods, proposing an appropriation-oriented mindset that drives the use of tool knowledge, supporting designers' practice in a variety of corporate contexts. Opportunities are considered for future research in the study of UX practice and training of students in human-computer interaction programs.","citation":[],"reference":[{"content":"Tim Brown. 2008. Design thinking. Harvard Business Review. Retrieved August 1, 2015 from https://hbr.org/2008/06/design-thinking","paperID":"None"},{"content":"Yen-ning Chang, Youn-kyung Lim, and Erik Stolterman. 2008. Personas: From theory to practices. In Proceedings of the 5th Nordic Conference on Human-computer Interaction: Building Bridges, 439--442. http://doi.acm.org/10.1145/1463160.1463214","paperID":"None"},{"content":"Gilbert Cockton and Alan Woolrych. 2002. Sale must end: should discount methods be cleared off HCI's shelves? Interactions, 9, 5: 13--18.","paperID":"None"},{"content":"Marisa L. Cohn, Susan E., Sim and Paul Dourish. 2010. Design methods as discourse on practice. In Proceedings of the 16th ACM International Conference on Supporting Group Work (GROUP'10), 45--54. http://doi.acm.org/10.1145/1880071.1880079","paperID":"None"},{"content":"Robert Curedale. 2012. Design methods 1: 200 ways to apply design thinking. Design Community College, Topanga, CA.","paperID":"None"},{"content":"Daniel Fallman. 2003. Design-oriented human-computer interaction. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems, 225--232. http://doi.acm.org/10.1145/642611.642652","paperID":"None"},{"content":"Anthony Faiola. 2007. The design enterprise: Rethinking the HCI education paradigm. Design Issues, 23, 3: 30--45.","paperID":"None"},{"content":"Alain Findeli. 2001. Rethinking design education for the 21st century: Theoretical, methodological, and ethical discussion. Design Issues, 17, 1, 1: 5--17. http://dx.doi.org/10.1162/07479360152103796","paperID":"None"},{"content":"Erin Friess. 2012. Personas and decision making in the design process: an ethnographic case study. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12), 1209--1218. http://doi.acm.org/10.1145/2207676.2208572","paperID":"None"},{"content":"Per Galle. 2002. Philosophy of design: An editorial introduction. Design Studies, 23, 3: 211--218. http://dx.doi.org/10.1016/S0142--694X(01)00034--5","paperID":"None"},{"content":"Barney G. Glaser and Anselm L. Strauss. 1967. The discovery of grounded theory: Strategies for qualitative research. Alpine de Gruyter, NY.","paperID":"None"},{"content":"Gabriela Goldschmidt. 2003. The backtalk of selfgenerated sketches. Design Issues, 19, 1: 72--88.","paperID":"None"},{"content":"Elizabeth S. Goodman. 2013. Delivering design: Performance and materiality in professional interaction design. Doctoral dissertation, University of California.","paperID":"None"},{"content":"Elizabeth Goodman, Erik Stolterman, and Ron Wakkary. 2011. Understanding interaction design practices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11), 1061--1070. http://doi.acm.org/10.1145/1978942.1979100","paperID":"None"},{"content":"Colin M. Gray. 2014. Evolution of design competence in UX practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'14), 1645--2654. http://doi.acm.org/10.1145/2556288.2557264","paperID":"None"},{"content":"Colin M. Gray, Erik Stolterman, and Martin A. Siegel. 2014. Reprioritizing the relationship Between HCI research and practice: Bubble-up and trickle-down effects. In Proceedings of the 2014 conference on Designing Interactive Systems (DIS'14), 725--734. http://doi.acm.org/10.1145/2598510.2598595","paperID":"None"},{"content":"Colin M. Gray, Austin Toombs, and Shad Gross. 2015. Flow of competence in UX design practice. In Proceedings of the SIGCHI conference on human factors in computing systems (CHI'15), 3285--3294. http://doi.acm.org/10.1145/2702123.2702579","paperID":"None"},{"content":"Bruce Hanington. 2003. Methods in the making: A perspective on the state of human research in design. Design Issues, 19, 4: 9--18. http://dx.doi.org/10.1162%2f074793603322545019","paperID":"None"},{"content":"Bruce Hanington and Bella Martin. 2012. Universal methods of design: 100 ways to research complex problems, develop innovative ideas, and design effective solutions. Rockport Publishers, Beverly, MA.","paperID":"None"},{"content":"Steven Harrison, Maribeth Back, and Deborah Tatar. 2006. \"It's just a method!\": A pedagogical experiment in interdisciplinary design. In Proceedings of the 6th conference on Designing Interactive Systems (DIS'06), 261--270. http://doi.acm.org/10.1145/1142405.1142445","paperID":"None"},{"content":"Kristina Höök, Peter Dalsgaard, Stuart Reeves, Jeffrey Bardzell, Jonas Löwgren, and Erik Stolterman, Yvonne Rogers. Knowledge Production in Interaction Design. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA'15), 2429--2432. http://doi.acm.org/10.1145/2702613.2702653","paperID":"None"},{"content":"John C. Jones. 1970. Design Methods. Wiley Interscience, London, UK.","paperID":"None"},{"content":"Vijay Kumar. 2013. 101 design methods: A structured approach for driving innovation in your organization. Wiley, Hoboken, NJ.","paperID":"None"},{"content":"Carine E. Lallemand. 2015. Towards consolidated methods for the design and evaluation of user experience. Doctoral dissertation, University of Luxembourg.","paperID":"None"},{"content":"Bryan Lawson. 2004. Schemata, gambits and precedent: Some factors in design expertise. Design Studies, 25, 5: 443--457. http://dx.doi.org/10.1016/j.destud.2004.05.001","paperID":"None"},{"content":"Bryan Lawson. 2006. How designers think: the design process demystified. Architectural Press, Oxford, UK.","paperID":"None"},{"content":"Bryan Lawson and Kees Dorst. 2009. Design expertise. Architectural Press, Oxford, UK.","paperID":"None"},{"content":"Jung-Joo Lee, Kirsikka Vaajakallio, and Tuuli Mattelmäki. 2011. Tracing situated effects of innovative design methods: Inexperienced designers' practices. In Proceedings of the Second Conference on Creativity and Innovation in Design (DESIRE'11), 103--113. http://doi.acm.org/10.1145/2079216.2079231","paperID":"None"},{"content":"Jonas Löwgren and Erik Stolterman. 1999. Methods & tools: Design methodology and design practice. interactions, 6, 1: 13--20.","paperID":"None"},{"content":"Tara Matthews, Tejinder Judge, and Steve Whittaker. 2012. How do designers and user experience professionals actually perceive and use personas? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12), 1219--1228. http://doi.acm.org/10.1145/2207676.2208573","paperID":"None"},{"content":"Tara Mullaney and Erik Stolterman. 2014. Why 'design research practice' is not design as we know it. In Proceedings of the Design Research Society Conference (DRS'14). Retrieved from http://www.drs2014.org/media/654248/0266-file1.pdf","paperID":"None"},{"content":"Harold G. Nelson and Erik Stolterman. 2012. The design way: Intentional change in an unpredictable world. MIT Press, Cambridge, UK.","paperID":"None"},{"content":"Donald A. Norman. 2010. The research-practice gap. interactions, 17, 4: 9--12. http://doi.acm.org/10.1145/1806491.1806494","paperID":"None"},{"content":"Liza Potts and Gerianna Bartocci. 2009. \"Experience Design\". In Proceedings of the 27th ACM International Conference on Design of Communication (SIGDOC'09), 17--22. http://doi.acm.org/10.1145/1621995.1621999","paperID":"None"},{"content":"Michael Polanyi. 1966. The tacit dimension. Anchor Books, Garden City, NY.","paperID":"None"},{"content":"Horst Rittel. 1984. Second-generation design methods. In Developments in Design Methodology, Nigel Cross (ed.). Chichester, NY, NY, 317--327.","paperID":"None"},{"content":"Oliver C. Robinson. 2014. Sampling in interview-based qualitative research: A theoretical and practical guide. Qualitative Research in Psychology, 11, 1: 25--41. http://dx.doi.org/10.1080/14780887.2013.801543","paperID":"None"},{"content":"David J. Roedl and Erik Stolterman. 2013. Design research at CHI and its applicability to design practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'13), 1951--1954. http://doi.acm.org/10.1145/2470654.2466257","paperID":"None"},{"content":"Yvonne Rogers. 2004. New theoretical approaches for HCI. Annual review of information science and technology, 38, 1: 87--143.","paperID":"None"},{"content":"James Self, Seong-geun Lee, and Hyeonseok Bang. 2015. Perceptions of complexity in design representation: Implications for an understanding of design practice. The International Journal of Design Management and Professional Practice, 9, 4: 33--46.","paperID":"None"},{"content":"Paula A. Silva and Janet C. Read. 2010. A methodology to evaluate creative design methods: A study with the BadIdeas method. In Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction, 264--271. http://doi.acm.org/10.1145/1952222.1952279","paperID":"None"},{"content":"Erik Stolterman. 2008. The nature of design practice and implications for interaction design research. International Journal of Design, 2, 1: 55--65.","paperID":"None"},{"content":"Erik Stolterman, Jamie McAtee, David Royer, and Selvan Thandapani. 2008. Designerly tools. In Proceedings of Undisciplined! Design Research Society Conference 2008, Sheffield Hallam University, 116: 114. Retrieved from http://shura.shu.ac.uk/491/","paperID":"None"},{"content":"Erik Stolterman and James Pierce. 2012. Design tools in practice: studying the designer-tool relationship in interaction design. In Proceedings of the Designing Interactive Systems Conference (DIS'12), 25--28. http://doi.acm.org/10.1145/2317956.2317961","paperID":"None"},{"content":"Hogeschool Technische. 2013. Delft Design Guide: Design Strategies and Methods. Uitgeverij Bis, Amsterdam, NL.","paperID":"None"},{"content":"Nicholas True, Jeroen Peeters, and Daniel Fallman. 2013. Confabulation in the time of transdisciplinarity: Reflection on HCI education and a call for conversation.\" In Human-Computer Interaction. Human-Centred Design Approaches, Methods, Tools, and Environments. Berlin, DE, Springer, 128--136. http://dx.doi.org/10.1007/978--3--642--39232-0_15","paperID":"None"},{"content":"I. M. Verstijnen, J. M. Hennessey, C. van Leeuwen, R. Hamel, and G. Goldschmidt. 1998. Sketching and creative discovery. Design Studies, 19, 4: 519--546.","paperID":"None"},{"content":"Alan Woolrych, Kasper Hornbæk, Erik Frøkjær, and Gilbert Cockton. 2011. Ingredients and meals rather than recipes: A proposal for research that does not treat usability evaluation methods as indivisible wholes. International Journal of Human-Computer Interaction, 27, 10: 940--970.","paperID":"None"},{"content":"Indi Young. 2008. Mental models: aligning design strategy with human behavior. Rosenfeld Media, Brooklyn, NY.","paperID":"None"},{"content":"Xiao Zhang, and Ron Wakkary. 2014. Understanding the role of designers' personal experiences in interaction design practice. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS'14), 895--904. http://doi.acm.org/10.1145/2598510.2598556","paperID":"None"}],"title":"\"It's More of a Mindset Than a Method\": UX Practitioners' Conception of Design Methods","filename":"CHI16/p4044","authors":["Colin M. Gray"],"conference":"CHI '16"}