{"paperId":2858502,"abstract":"People often try to impress their friends online, but we don't know how well they do it or what they talk about to try to make themselves look good. In the face of known egocentric biases, which cause communicators to overestimate the extent that audiences will understand the intent of their messages, and self-enhancement biases, that cause people to overvalue their own behavior, it is likely that many self-presentation attempts will often fail. However, we don't know which topics cause such failure. In an empirical study, 1300 Facebook users evaluated their most recent status update in terms of how good it make them look. In addition external judges also evaluated the same update. Posters and outsiders agreed only modestly about how good an update made the poster appear (r=.36, p<.001). Posters generally thought that their posts make them look better than did the outsider judges. They also disagreed on which topics made them look good. Posters were especially likely to overestimate their self-presentation when they wrote about the mundane details of their daily life (e.g., Clothing, Sleep, or Religious imagery), but underestimated it when they wrote about family and relationships (e.g., Birthday, Father's Day, Love).","citation":[],"reference":[{"content":"Mark D. Alicke. 1985. Global self-evaluation as determined by the desirability and controllability of trait adjectives. Journal of Personality and Social Psychology, 49(6), 1621--1630.","paperID":"None"},{"content":"Mark D. Alicke, & Olesya Govorun. 2005. The betterthan-average effect. In M. D. Alicke, D. A. Dunning, & J. Krueger (Eds.), The Self in Social Judgment (pp. 85106). New York, NY, US: Psychology Press.","paperID":"None"},{"content":"Nalini Ambady, & Robert Rosenthal. 1992. Thin slices of expressive behavior as predictors of interpersonal consequences: A meta-analysis. Psychol Bull, 111(2), 256--274.","paperID":"None"},{"content":"Nalini Ambady, & Robert Rosenthal. 1993. Half a minute: Predicting teacher evaluations from thin slices of nonverbal behavior and physical attractiveness. Journal of Personality and Social Psychology, 64(3), 431--441.","paperID":"None"},{"content":"Nalini Ambady, Mary Anne Krabbenhoft, & Daniel Hogan. 2006. The 30-Sec Sale: Using Thin-Slice Judgments to Evaluate Sales Effectiveness. Journal of Consumer Psychology, 16(1), 4--13.","paperID":"None"},{"content":"Vladimir Barash, Nicolas Ducheneaut, Ellen Isaacs, & Victoria Bellotti. 2010. Faceplant: Impression (Mis)management in Facebook Status Updates. In ICWSM.","paperID":"None"},{"content":"David M. Blei, Andrew Y. Ng, & Michael I. Jordan. 2003. Latent dirichlet allocation. J. Mach. Learn. Res., 3, 993--1022.","paperID":"None"},{"content":"Jonathon D Brown. 1986. Evaluations of self and others: Self-enhancement biases in social judgments. Social Cognition, 4(4), 353--376.","paperID":"None"},{"content":"Nicholas Epley, & Justin Kruger. 2005. When what you type isn't what they read: The perseverance of stereotypes and expectancies over e-mail. Journal of Experimental Social Psychology, 41(4), 414--422.","paperID":"None"},{"content":"Erving Goffman. 1959. The Presentation of Self in Everyday Life: Doubleday.","paperID":"None"},{"content":"Timothy R. Hinkin. 1995. A review of scale development practices in the study of organizations. Journal of Management, 21(5), 967--988.","paperID":"None"},{"content":"Peter Kennedy. 2003. A Guide to Econometrics (5th ed.): MIT Press.","paperID":"None"},{"content":"Nicole C. Krämer, & Stephan Winter. 2008. Impression Management 2.0. Journal of media psychology, 20(3), 106--116.","paperID":"None"},{"content":"J. Kruger, N. Epley, J. Parker, & Z. W. Ng. 2005. Egocentrism over e-mail: can we communicate as well as we think? J Pers Soc Psychol, 89(6), 925--936.","paperID":"None"},{"content":"Cliff A.C. Lampe, Nicole Ellison, & Charles Steinfield. 2007. A familiar face(book): profile elements as signals in an online social network. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, San Jose, California, USA.","paperID":"None"},{"content":"Soraya Mehdizadeh. 2010. Self-presentation 2.0: narcissism and self-esteem on Facebook. Cyberpsychol Behav Soc Netw, 13(4), 357--364.","paperID":"None"},{"content":"Delroy L. Paulhus. 1991. Measurement and control of response bias. In J. P. Robinson, P. R. Shaver, & L. S. Wrightsman (Eds.), Measures of personality and social psychological attitudes (pp. 17--59). San Diego, CA, US: Academic Press.","paperID":"None"},{"content":"Robert N. Raskin, & Calvin S. Hall. 1979. A NARCISSISTIC PERSONALITY INVENTORY. Psychological Reports, 45(2), 590--590.","paperID":"None"},{"content":"Jenny Rosenberg, & Nichole Egbert. 2011. Online Impression Management: Personality Traits and Concerns for Secondary Goals as Predictors of Self Presentation Tactics on Facebook. Journal of Computer-Mediated Communication, 17(1), 1--18.","paperID":"None"},{"content":"Barry R. Schlenker. 1980. Impression Management: The Self-concept, Social Identity, and Interpersonal Relations: Brooks/Cole Publishing Company.","paperID":"None"},{"content":"C. Sedikides, L. Gaertner, & J. L. Vevea. 2005. Pancultural self-enhancement reloaded: a meta-analytic reply to Heine (2005). J Pers Soc Psychol, 89(4), 539551.","paperID":"None"},{"content":"Semiocast. 2012. Twitter reaches half a billion accounts more than 140 millions in the U.S. Retrieved May 1, 2015, from http://semiocast.com/publications/2012_07_30_Twitter _reaches_half_a_billion_accounts_140m_in_the_US","paperID":"None"},{"content":"Aaron Smith. 2014. 6 new facts about Facebook. Retrieved 05/22, 2015, from http://www.pewresearch.org/fact-tank/2014/02/03/6new-facts-about-facebook/","paperID":"None"},{"content":"Mark Snyder. 1974. Self-monitoring of expressive behavior. Journal of Personality and Social Psychology, 30(4), 526--537.","paperID":"None"},{"content":"Kristin Stecher, & Scott Counts. 2008. Thin Slices of Online Profile Attributes. In Proceedings of the 2nd International Conference on Weblogs and Social Media, Seattle, Washington, U.S.","paperID":"None"},{"content":"Yi-Chia Wang, Moira Burke, & Robert E. Kraut. 2013. Gender, topic, and audience response: an analysis of user-generated content on facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Paris, France.","paperID":"None"},{"content":"Mark Zuckerberg. 2012. One billion people on Facebook. Retrieved May 1, 2015, from http://newsroom.fb.com/news/2012/10/one-billionpeople-on-facebook/","paperID":"None"}],"title":"Does Saying This Make Me Look Good?: How Posters and Outsiders Evaluate Facebook Updates","filename":"CHI16/p125","authors":["Yi-Chia Wang","Hayley Hinsberger","Robert E. Kraut"],"conference":"CHI '16"}