{"paperId":2858189,"citation":[],"reference":[{"content":"Gregory D. Abowd, Christopher G. Atkeson, Jason Hong, Sue Long, Rob Kooper, and Mike Pinkerton. 1997. Cyberguide: A mobile context-aware tour guide. Wireless networks 3, 5 (1997), 421--433.","paperID":"None"},{"content":"American Association of Museums. 2011. AAM: 2011 Mobile Technology Survey. Technical Report. Retrieved September 25, 2015 from http://www.aam-us.org/docs/center-for-the-future-of-museums/aam_mobile_technology_survey.pdf.","paperID":"None"},{"content":"Liliana Ardissono, Tsvi Kuflik, and Daniela Petrelli. 2012. Personalization in cultural heritage: the road travelled and the one ahead. User modeling and user-adapted interaction 22, 1--2 (2012), 73--99.","paperID":"None"},{"content":"Jörg Baus, Keith Cheverst, and Christian Kray. 2005. A survey of map-based mobile guides. In Map-based mobile services. Springer, 193--209.","paperID":"None"},{"content":"Benjamin B. Bederson. 1995. Audio Augmented Reality: A Prototype Automated Tour Guide. In Proc. CHI '95 EA. ACM, New York, NY, USA, 210--211. DOI: http://dx.doi.org/10.1145/223355.223526","paperID":"None"},{"content":"Giuliano Benelli, Alberto Bianchi, Patrizia Marti, Elena Not, and David Sennati. 1999. HIPS: Hyper-interaction within physical space. In Proc. ICMCS '99, Vol. 2. IEEE, 1075--1078.","paperID":"None"},{"content":"John Brooke. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.","paperID":"None"},{"content":"Ed H. Chi, Peter Pirolli, Kim Chen, and James Pitkow. 2001. Using Information Scent to Model User Information Needs and Actions and the Web. In Proc. CHI '01. ACM, New York, NY, USA, 490--497. DOI: http://dx.doi.org/10.1145/365024.365325","paperID":"None"},{"content":"Maria Economou and Elpiniki Meintani. 2011. Promising Beginning? Evaluating Museum Mobile Phone Apps. Rethinking Technology in Museums 2011: Emerging experiences (2011).","paperID":"None"},{"content":"Michael Kenteris, Damianos Gavalas, and Daphne Economou. 2011. Electronic mobile guides: a survey. Personal and ubiquitous computing 15, 1 (2011), 97--111.","paperID":"None"},{"content":"Joel Lanir, Tsvi Kuflik, Alan J. Wecker, Oliviero Stock, and Massimo Zancanaro. 2011. Examining proactiveness and choice in a location-aware mobile museum guide. Interacting with Computers 23, 5 (Sept. 2011), 513--524. DOI: http://dx.doi.org/10.1016/j.intcom.2011.05.007","paperID":"None"},{"content":"Nancy Proctor and Chris Tellis. 2003. The State of the Art in Museum Handhelds in 2003. In Museums and the Web 2003. Charlotte, NC, USA.","paperID":"None"},{"content":"Oliviero Stock and Massimo Zancanaro. 2007. PEACH Intelligent Interfaces for Museum Visits. Springer Science & Business Media.","paperID":"None"},{"content":"Ron Wakkary and Marek Hatala. 2006. Ec(H)O: Situated Play in a Tangible and Audio Museum Guide. In Proc. DIS '06. ACM, New York, NY, USA, 281--290. DOI: http://dx.doi.org/10.1145/1142405.1142448","paperID":"None"},{"content":"Leonard Wein. 2014. Visual Recognition in Museum Guide Apps: Do Visitors Want It?. In Proc. CHI '14. ACM, New York, NY, USA, 635--638. DOI: http://dx.doi.org/10.1145/2556288.2557270","paperID":"None"}],"abstract":"Traditional audio guides in museums and similar spaces typically require the visitor to locate a track number at each exhibit and enter it on a keypad. These guides, however, provide no information on the amount of content available. Current mobile devices provide rich output capabilities, and indoor location tracking technology can simplify the selection of content in modern audio guides. In this paper, we compare the keypad-based interface to a map-based interface with and without automatic localization. Through a field study in a local museum with 84 participants, we found that the usability of all versions is rated high, with the keypad interface coming out ahead. Nevertheless, visitors favored the overview of the map and thumbnails to find the right exhibit, while numbers were considered helpful indicators in the real world. Those who used the self-localizing guide preferred it over manually adjusting the map.","title":"Maps and Location: Acceptance of Modern Interaction Techniques for Audio Guides","filename":"CHI16/p1067","authors":["Philipp Wacker","Kerstin Kreutz","Florian Heller","Jan Borchers"],"conference":"CHI '16"}