{"paperId":2858224,"citation":[],"reference":[{"content":"Christopher Andrews, Alex Endert, and Chris North. 2010. Space to Think: Large High-resolution Displays for Sensemaking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 55-64.","paperID":"None"},{"content":"M. Beaudouin-Lafon, S. Huot, M. Nancel, W. Mackay, E. Pietriga, R. Primet, J. Wagner, O. Chapuis, C. Pillias, J.R. Eagan, T. Gjerlufsen, and C. Klokmose. 2012. Multisurface Interaction in the WILD Room. Computer 45, 4 (April 2012), 48-56.","paperID":"None"},{"content":"Carl Gutwin and Saul Greenberg. 1998. Design for Individuals, Design for Groups: Tradeoffs Between Power and Workspace Awareness. In Proceedings of the 1998 ACM Conference on Computer Supported Cooperative Work (CSCW '98). ACM, NY, NY, USA, 207-216.","paperID":"None"},{"content":"Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: Enabling and Understanding Cross-device Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2773-2782.","paperID":"None"},{"content":"Eva Hornecker, Paul Marshall, Nick Sheep Dalton, and Yvonne Rogers. 2008. Collaboration and Interference: Awareness with Mice or Touch Input. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, NY, NY, USA, 167-176.","paperID":"None"},{"content":"Petra Isenberg, Danyel Fisher, Sharoda A. Paul, Meredith Ringel Morris, Kori Inkpen, and Mary Czerwinski. 2012. Co-Located Collaborative Visual Analytics around a Tabletop Display. IEEE Trans. Vis. Comput. Graph. 18, 5 (2012), 689-702.","paperID":"None"},{"content":"Robert J.K. Jacob, Audrey Girouard, Leanne M. Hirshfield, Michael S. Horn, Orit Shaer, Erin Treacy Solovey, and Jamie Zigelbaum. 2008. Reality-based Interaction: A Framework for post-WIMP Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 201-210.","paperID":"None"},{"content":"Mikkel R. Jakobsen and Kasper Hornbæk. 2014. Up Close and Personal: Collaborative Work on a High-resolution Multitouch Wall Display. ACM Trans. Comput.-Hum. Interact. 21, 2, Article 11 (Feb. 2014), 34 pages.","paperID":"None"},{"content":"Hans-Christian Jetter, Jens Gerken, Michael Zöllner, Harald Reiterer, and Natasa Milic-Frayling. 2011. Materializing the Query with Facet-streams: A Hybrid Surface for Collaborative Search on Tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 3013-3022.","paperID":"None"},{"content":"Andrés Lucero, Jussi Holopainen, and Tero Jokela. 2011. Pass-them-around: Collaborative Use of Mobile Phones for Photo Sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1787-1796.","paperID":"None"},{"content":"Will McGrath, Brian Bowman, David McCallum, Juan David Hincapié-Ramos, Niklas Elmqvist, and Pourang Irani. 2012. Branch-explore-merge: Facilitating Real-time Revision Control in Collaborative Visual Exploration. In Proc. of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12). ACM, NY, NY, USA, 235-244.","paperID":"None"},{"content":"Meredith Ringel Morris, Danyel Fisher, and Daniel Wigdor. 2010a. Search on Surfaces: Exploring the Potential of Interactive Tabletops for Collaborative Search Tasks. Inf. Process. Manage. 46, 6 (Nov. 2010), 703-717.","paperID":"None"},{"content":"Meredith Ringel Morris, Jarrod Lombardo, and Daniel Wigdor. 2010b. WeSearch: Supporting Collaborative Search and Sensemaking on a Tabletop Display. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, NY, NY, USA, 401-410.","paperID":"None"},{"content":"Gerard Oleksik, Hans-Christian Jetter, Jens Gerken, Natasa Milic-Frayling, and Rachel Jones. 2013. Towards an Information Architecture for Flexible Reuse of Digital Media. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia (MUM '13). ACM, NY, NY, USA, Article 12, 10 pages.","paperID":"None"},{"content":"Jose Pinheiro, Douglas Bates, Saikat DebRoy, Deepayan Sarkar, and R Core Team. 2015. nlme: Linear and Nonlinear Mixed Effects Models. http://CRAN.R-project.org/package=nlme R package version 3.1--122.","paperID":"None"},{"content":"Catherine Plaisant, Georges Grinstein, Jean Scholtz, Mark Whiting, and et al. 2008. Evaluating Visual Analytics at the 2007 VAST Symposium Contest. IEEE Comput. Graph. Appl. 28, 2 (March 2008), 12-21.","paperID":"None"},{"content":"Roman Rädle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer, and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, NY, NY, USA, 45-54.","paperID":"None"},{"content":"Roman Rädle, Hans-Christian Jetter, and Harald Reiterer. 2013. TwisterSearch: A Distributed User Interface for Collaborative Web Search. In Distributed User Interfaces: Usability and Collaboration, Mara D. Lozano, Jose A. Gallud, Ricardo Tesoriero, and Victor M.R. Penichet (Eds.). Springer London, 53-67.","paperID":"None"},{"content":"Yvonne Rogers and Sian Lindley. 2004. Collaborating around vertical and horizontal large interactive displays: which way is best? Interacting with Computers 16, 6 (Dec. 2004), 1133-1152.","paperID":"None"},{"content":"Kathy Ryall, Clifton Forlines, Chia Shen, and Meredith Ringel Morris. 2004. Exploring the Effects of Group Size and Table Size on Interactions with Tabletop Shared-display Groupware. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, NY, NY, USA, 284-293.","paperID":"None"},{"content":"Stacey D. Scott, M. Sheelagh T. Carpendale, and Kori M. Inkpen. 2004. Territoriality in Collaborative Tabletop Workspaces. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, NY, NY, USA, 294-303.","paperID":"None"},{"content":"Anthony Tang, Melanie Tory, Barry Po, Petra Neumann, and Sheelagh Carpendale. 2006. Collaborative Coupling over Tabletop Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 1181-1190.","paperID":"None"},{"content":"James R. Wallace, Stacey D. Scott, and Carolyn G. MacGregor. 2013. Collaborative Sensemaking on a Digital Tabletop and Personal Tablets: Prioritization, Comparisons, and Tableaux. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3345-3354.","paperID":"None"}],"abstract":"Cross-device collaboration with tablets is an increasingly popular topic in HCI. Previous work has shown that tablet-only collaboration can be improved by an additional shared workspace on an interactive tabletop. However, large tabletops are costly and need space, raising the question to what extent the physical size of shared horizontal surfaces really pays off. In order to analyse the suitability of smaller-than-tabletop devices (e.g. tablets) as a low-cost alternative, we studied the effect of the size of a shared horizontal interactive workspace on users' attention, awareness, and efficiency during cross-device collaboration. In our study, 15 groups of two users executed a sensemaking task with two personal tablets (9.7\") and a horizontal shared display of varying sizes (10.6\", 27\", and 55\"). Our findings show that different sizes lead to differences in participants' interaction with the tabletop and in the groups' communication styles. To our own surprise we found that larger tabletops do not necessarily improve collaboration or sensemaking results, because they can divert users' attention away from their collaborators and towards the shared display.","title":"When Tablets meet Tabletops: The Effect of Tabletop Size on Around-the-Table Collaboration with Personal Tablets","filename":"CHI16/p5470","authors":["Johannes Zagermann","Ulrike Pfeil","Roman Rädle","Hans-Christian Jetter","Clemens Klokmose","Harald Reiterer"],"conference":"CHI '16"}