{"paperId":2858182,"reference":[{"content":"Gerhard Andersson and Pim Cuijpers. 2009. Internetbased and other computerized psychological treatments for adult depression: A meta-analysis. Cognitive Behaviour Therapy 38(4), 196--205. http://dx.doi.org/10.1080/16506070903318960","paperID":"None"},{"content":"Laura Helena Andrade, et al. 2014. Barriers to mental health treatment: results from the WHO World Mental Health surveys. Psychological Medicine 44(6), 1303--1317. http://dx.doi.org/10.1017/S0033291713001943","paperID":"None"},{"content":"Jakob E. Bardram, Mads Frost, Károly Szántó, Maria Faurholt-Jepsen, Maj Vinberg, and Lars Vedel Kessing. 2013. Designing mobile health technology for bipolar disorder: a field trial of the monarca system. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2627--2636. http://doi.acm.org/10.1145/2470654.2481364","paperID":"None"},{"content":"Dror Ben-Zeev, Susan M. Kaiser, Christopher J. Brenner, Mark Begale, Jennifer Duffecy, David C. Mohr. 2013. Development and usability testing of FOCUS: A smartphone system for self-management of schizophrenia. Psychiatric Rehabilitation Journal 36, 289--296. http://dx.doi.org/10.1037/prj0000019","paperID":"None"},{"content":"Ann Blandford, Erik Berndt, Ken Catchpole, Dominic Furniss, Astrid Mayer, Helena Mentis, Aisling Ann O'Kane, Tom Owen, Atish Rajkomar, and Rebecca Randell. 2014. Strategies for conducting situated studies of technology use in hospitals. Cognition, Technology & Work, 1--14. http://dx.doi.org/10.1007/s10111-014-0318--7","paperID":"None"},{"content":"Virginia Braun, and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 77--101. http://dx.doi.org/10.1191/1478088706qp063oa","paperID":"None"},{"content":"Barry Brown, Stuart Reeves, and Scott Sherwood. 2011. Into the wild: challenges and opportunities for field trial methods. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, 1657--1666. http://dx.doi.org/10.1145/1978942.1979185","paperID":"None"},{"content":"Rafael A. Calvo, and Dorian Peters. 2013. Promoting Psychological Wellbeing: Loftier Goals for New Technologies. IEEE Technology and Society Magazine 32(4), 19--21. http://dx.doi.org/10.1109/MTS.2013.2286429","paperID":"None"},{"content":"Alan Chamberlain, Andy Crabtree, Tom Rodden, Matt Jones, and Yvonne Rogers. 2012. Research in the wild: understanding 'in the wild' approaches to design and development. In Proceedings of the Designing Interactive Systems Conference (DIS '12), 795--796. http://dx.doi.org/10.1145/2317956.2318078","paperID":"None"},{"content":"Kimberly Christensen. 2009. Dialectical Behavior Therapy Skills, 101 Mindfulness Exercises and Other Fun Activities for Children and Adolescents: A Learning Supplement. Bloomington: AuthorHouse.","paperID":"None"},{"content":"David Coyle and Gavin Doherty. 2009. Clinical evaluations and collaborative design: Developing new technologies for mental healthcare interventions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 2051--2060. http://doi.acm.org/10.1145/1518701.1519013","paperID":"None"},{"content":"David Coyle, Nicola McGlade, Gavin Doherty, and Gary O'Reilly. 2011. Exploratory evaluations of a computer game supporting cognitive behavioural therapy for adolescents. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2937--2946. http://doi.acm.org/10.1145/1978942.1979378","paperID":"None"},{"content":"David Coyle, Anja Thieme, Conor Linehan, Madeline Balaam, Jayne Wallace, and Siân Lindley. 2014. Emotional wellbeing. International Journal of HumanComputer Studies 8(72), 627--628. http://dx.doi.org/10.1016/j.ijhcs.2014.05.008","paperID":"None"},{"content":"Ara Darzi. 2008. High quality care for all: NHS next stage review final report. London: Dept. of Health.","paperID":"None"},{"content":"Dept. of Health. 2011. Working with personality disordered offenders: A practitioners guide. Ministry of Justice, National Offender Management Service, London. https://www.justice.gov.uk/downloads/offenders/menta lly-disordered-offenders/working-with-personalitydisordered-offenders.pdf","paperID":"None"},{"content":"Colin A. Depp, Brent Mausbach, Eric Granholm, Veronica Cardenas, Dror Ben-Zeev, Thomas L. Patterson, Barry D Lebowitz and Dilip V. Jeste. 2010. Mobile interventions for severe mental illness: design and preliminary data from three approaches. The Journal of Nervous and Mental Disease 198(10), 715--721. http://dx.doi.org/10.1097/NMD.0b013e3181f49ea3","paperID":"None"},{"content":"Pieter M. Desmet, and Anne E. Pohlmeyer. 2013. Positive design: An introduction to design for subjective well-being. International Journal of Design 7, 5--19.","paperID":"None"},{"content":"Gavin Doherty, David Coyle, and Mark Matthews. 2010. Design and evaluation guidelines for mental health technologies. Interacting with Computers 22(4), 243--242. http://doi.acm.org/10.1016/j.intcom.2010.02.006","paperID":"None"},{"content":"Gavin Doherty, David Coyle, and John Sharry. 2012. Engagement with online mental health interventions: an exploratory clinical study of a treatment for depression. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1421--1430. http://doi.acm.org/10.1145/2207676.2208602","paperID":"None"},{"content":"Sara Donetto, Paola Pierri, Vicki Ysianakas, and Glenn Robert. 2015. Experience-based Co-design and Healthcare Improvement: Realizing Participatory Design in the Public Sector. The Design Journal 18(2), 227--248. http://dx.doi.org/10.2752/175630615X1421249896431","paperID":"None"},{"content":"Hugh Dubberly, Rajiv Mehta, Shelley Evenson, and Paul Pangaro. 2010. Reframing health to embrace design of our own well-being. interactions 17(3), 56--63. http://doi.acm.org/10.1145/1744161.1744175","paperID":"None"},{"content":"Rebecca Fish. 2013. Women who use secure services: applying the literature to women with learning disabilities. The Journal of Forensic Practice 15(3), 192--205. http://dx.doi.org/10.1108/JFP-09--2012-0016","paperID":"None"},{"content":"Mads Frost, and Steven Houben. 2014. Deploying healthcare technology \"in the wild\": experiences from deploying a mobile health technology for bipolar disorder treatment. Fieldwork for Healthcare: Case Studies Investigating Human Factors in Computing Systems 2, 57--64. http://dx.doi.org/10.2200/S00606ED1V02Y201410AR H007","paperID":"None"},{"content":"Dominic Furniss, Rebecca Randell, Aisling Ann O'Kane, Svetlena Taneva, Helena Mentis, and Ann Blandford. 2014 (eds). Fieldwork for healthcare: guidance for investigating human factors in computing systems. Synthesis Lectures on Assistive, Rehabilitative, and Health-Preserving Technologies 3(2), 1--146. http://dx.doi.org/10.2200/S00606ED1V02Y201410AR H007","paperID":"None"},{"content":"Franz Gravenhorst, Amir Muaremi, Jakob Bardram, Agnes Grünerbl, Oscar Mayora, Gabriel Wurzer, Mads Frost, Venet Osmani, Bert Arnrich, Paul Lukowicz, and Gerhard Tröster. 2015. Mobile phones as medical devices in mental disorder treatment: an overview. Personal and Ubiquitous Computer 19(2), 335--353. http://dx.doi.org/10.1007/s00779-014-0829--5","paperID":"None"},{"content":"Samantha Hall and Helen Duperouzel. 2011. \"We know about our risks, so we should be asked.\" A tool to support service user involvement in the risk assessment process in forensic services for people with intellectual disabilities. Journal of Learning Disabilities and Offending Behaviour 2(3), 122--126. http://dx.doi.org/10.1108/20420921111186598","paperID":"None"},{"content":"Thomas Riisgaard Hansen, Jakob E. Bardram, and Mads Soegaard. 2006. Moving out of the lab: Deploying pervasive technologies in a hospital. IEEE Pervasive Computing 5(3), 24--31. http://doi.ieeecomputersociety.org/10.1109/MPRV.200 6.53","paperID":"None"},{"content":"Virginia Harrison, Judith Proudfoot, Pang Ping Wee, Gordon Parker, Dusan Hadzi Pavlovic and Vijaya Manicavasagar. 2011. Mobile mental health: Review of the emerging field and proof of concept study. Journal of Mental Health 20(6), 509--524. http://dx.doi.org/10.3109/09638237.2011.608746","paperID":"None"},{"content":"Marc Hassenzahl, Kai Eckoldt, Sarah Diefenbach, Matthias Laschke, Eva Len, and Joonhwan Kim. 2013. Designing moments of meaning and pleasure. Experience design and happiness. International Journal of Design 7(3), 21--31. http://ijdesign.org/ojs/index.php/IJDesign/article/view/","paperID":"None"},{"content":"Christopher J. James, John Crowe, Evan H. Magill, et al. 2009. Personalised Ambient Monitoring (PAM) of the mentally ill. In Proceedings of ECIFMBE 22, 1010--1013. http://dx.doi.org/10.1007/978--3--54089208--3_240","paperID":"None"},{"content":"Ronald C. Kessler, et al. 2007. Lifetime prevalence and age-of-onset distributions of mental disorders in the World Health Organization's World Mental Health Survey Initiative. World Psychiatry 6(3), 168--176. http://www.ncbi.nlm.nih.gov/pmc/articles/PMC217458 8/","paperID":"None"},{"content":"Corey L. M. Keyes. 2010. The next steps in the promotion and protection of positive mental health. Canadian Journal of Nursing Research 42(3), 17--28.","paperID":"None"},{"content":"Corey L. M. Keyes. 2014. Mental health as a complete state: How the salutogenic perspective completes the picture. In G.F. Bauer and O. Hämmig (eds.), Bridging Occupational, Organiztional and Public Health: A Transdisciplinary Approach. Springer, 179--192. http://dx.doi.org/10.1007/978--94-007--5640--3_1","paperID":"None"},{"content":"Reeva Lederman, Greg Wadley, John Gleeson, Sarah Bendall, and Mario Álvarez-Jiménez. 2014. Moderated online social therapy: Designing and evaluating technology for mental health. ACM Transactions on Computer-Human Interaction 21(1), 1--26. http://doi.acm.org/10.1145/2513179","paperID":"None"},{"content":"Marvin Lew, Cristy Matta, Carol Tripp-Tebo and Doug Watts. 2006. DBT for individuals with intellectual disabilities: A programme description. Mental Health Aspects of Developmental Disabilities 9, 1--12.","paperID":"None"},{"content":"Klaus Lieb, Mary C. Zanarini, Christian Schmahl, Marsha M. Linehan and Martin Bohus. 2004. Borderline personality disorder. Lancet 364, 53--461. http://dx.doi.org/10.1016/S0140--6736(04)16770--6","paperID":"None"},{"content":"William R. Lindsay, et al. 2004. Women with intellectual disability who have offended: Characteristics and outcome. Journal of Intellectual Disability Research 48(6), 580--590. http://dx.doi.org/10.1111/j.1365--2788.2004.00627.x","paperID":"None"},{"content":"Marsha M. Linehan. 1993. Cognitive-Behavioral Treatment of Borderline Personality Disorder. New York: The Guilford Press.","paperID":"None"},{"content":"Marsha M. Linehan. 1993. Skills Training Manual for Treating Borderline Personality Disorder. New York: The Guilford Press.","paperID":"None"},{"content":"Gabriela Marcu, Jakob E. Bardram, and Silvia Gabrielli. 2011. A framework for overcoming challenges in designing persuasive monitoring and feedback systems for mental illness. In IEEE Pervasive Computing Technologies for Healthcare (PervasiveHealth' 11), 1--8. http://dx.doi.org/10.4108/icst.pervasivehealth.2011.246 097","paperID":"None"},{"content":"Mark Matthews and Gavin Doherty. 2011. In the mood: engaging teenagers in psychotherapy using mobile phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2947--2956. http://doi.acm.org/10.1145/1978942.1979379","paperID":"None"},{"content":"Mark Matthews, Geri Gay, and Gavin Doherty. 2014. Taking part: role-play in the design of therapeutic systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 643--652. http://doi.acm.org/10.1145/2556288.2557103","paperID":"None"},{"content":"Mental health care. 2013. Forensic mental health services. http://www.mentalhealthcare.org.uk/forensic_mental_h ealth_services","paperID":"None"},{"content":"Catrin Morrissey, and Bridget Ingamells. 2011. Adapted dialectical behaviour therapy for male offenders with learning disabilities in a high secure environment: six years on. Journal of Learning Disabilities and Offending Behaviour 2(1), 8--15. http://dx.doi.org/10.5042/jldob.2011.0024","paperID":"None"},{"content":"Robert L. Palmer. 2002. Dialectic behaviour therapy for borderline personality disorder. Advances in Psychiatric Treatment 8(1), 10--16. http://dx.doi.org/10.1192/apt.8.1.10","paperID":"None"},{"content":"Olga Pykhtina, Madeline Balaam, Gavin Wood, Sue Pattison, Ahmed Kharrufa, and Patrick Olivier. 2012. Magic land: the design and evaluation of an interactive tabletop supporting therapeutic play with children. In Proceedings of the Designing Interactive Systems Conference (DIS '12), 136--145. http://doi.acm.org/10.1145/2317956.2317978","paperID":"None"},{"content":"Bronwyn Robertson. 2011. The adaption and application of mindfulness-based psychotherapeutic practices for individuals with intellectual disabilities. Advances in Mental Health and Intellectual Disabilities 5(5), 46--52. http://dx.doi.org/10.1108/20441281111180664","paperID":"None"},{"content":"Marco de Sá, Luís Carriço and Pedro Antunes. 2007. Ubiquitous psychotherapy. IEEE Pervasive Computing 6(1), 20--27. http://doi.ieeecomputersociety.org/10.1109/MPRV.200 7.23","paperID":"None"},{"content":"Marco de Sá and Luís Carriço. 2012. Fear therapy for children: a mobile approach. In Proceedings of the 4th ACM SIGCHI symposium on Engineering interactive computing systems (EICS '12), 237--246. http://doi.acm.org/10.1145/2305484.2305524","paperID":"None"},{"content":"Katie A. Siek, Gillian R. Hayes, Mark W. Newman and John C. Tang. 2014. Field deployments: Knowing from using in context. In J.S. Olson and W.A. Kellogg (eds.), Ways of Knowing in HCI, 119--142. Springer Science+Business. http://dx.doi.org/10.1007/978--14939-0378--8_6","paperID":"None"},{"content":"Joaquim Soler, Juan Carlos Pascual, Thaïs Tiana, Anabel Cebrià, Judith Barrachina, M. Josefa Campins, Ignasi Gich, Enrique Alvarez, Víctor Pérez. 2009. Dialectical behaviour therapy skills training compared to standard group therapy in borderline personality disorder: A 3-month randomised controlled clinical trial. Behaviour Research and Therapy 47(5), 353--358. http://dx.doi.org/10.1016/j.brat.2009.01.013","paperID":"None"},{"content":"Svetlena Taneva, Aisling Ann O--Kane, Raj Ratwani, Brian Hilligoss, Anja Thieme, and Kristina Groth 2014. Establishing and maintaining relationships in healthcare fields. Synthesis Lectures on Assistive, Rehabilitative, and Health-Preserving Technologies 3(2), 39--56. http://dx.doi.org/10.2200/S00606ED1V02Y201410AR H007","paperID":"None"},{"content":"Nick Taylor, Keith Cheverst, Peter Wright, and Patrick Olivier. 2013. Leaving the wild: lessons from community technology handovers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1549--1558. http://doi.acm.org/10.1145/2470654.2466206","paperID":"None"},{"content":"Anja Thieme. 2015. Designing Technology to Promote Mental Health and Wellbeing. Doctoral Thesis, Newcastle University, UK. http://designandwellbeing.com/papers/phd_thesis_Anja Thieme.pdf","paperID":"None"},{"content":"Anja Thieme, Jayne Wallace, Paula Johnson, John McCarthy, Siân Lindley, Peter Wright, Patrick Olivier, and Thomas D. Meyer. 2013. Design to promote mindfulness practice and sense of self for vulnerable women in secure hospital services. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2647--2656. http://doi.acm.org/10.1145/2470654.2481366","paperID":"None"},{"content":"Anja Thieme, Jayne Wallace, James Thomas, Ko Le Chen, Nicole Krämer, and Patrick Olivier. 2011. Lovers' box: Designing for reflection within romantic relationships. Int. J. Hum.-Comput. Stud. 69, 5 (May 2011), 283--297. http://dx.doi.org/10.1016/j.ijhcs.2010.12.006","paperID":"None"},{"content":"Anja Thieme, Jayne Wallace, Thomas D. Meyer, and Patrick Olivier. 2015. Designing for mental wellbeing: towards a more holistic approach in the treatment and prevention of mental illness. In Proceedings of the 2015 British HCI Conference (British HCI '15), 1--10. http://doi.acm.org/10.1145/2783446.2783586","paperID":"None"},{"content":"Carol Vivyan. 2009. An Introductory Self-Help Course in Cognitive Behaviour Therapy. Last retrieved 17th Sept. 2015 from: http://www.dbtselfhelp.com/SelfHelpCourse.pdf","paperID":"None"},{"content":"Jayne Wallace, Anja Thieme, Gavin Wood, Guy Schofield, and Patrick Olivier. 2012. Enabling self, intimacy and a sense of home in dementia: an enquiry into design in a hospital setting. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2629--2638. http://doi.acm.org/10.1145/2207676.2208654","paperID":"None"},{"content":"Alex M. Wood, and Nicholas Tarrier. 2010. Positive Clinical Psychology: A new vision and strategy for integrated research and practice. Clinical Psychology Review 30(7), 819--829. http://dx.doi.org/10.1016/j.cpr.2010.06.003","paperID":"None"},{"content":"World Health Organization. (2014). Mental Disorders: 2014 fact sheet. Last retrieved 6th Sept. 2015 from: http://www.who.int/mediacentre/factsheets/fs396/en/","paperID":"None"},{"content":"Maja Wrzesien, Jean-Marie Burkhardt, Mariano Alcañiz Raya, and Cristina Botella. 2011. Mixing psychology and HCI in evaluation of augmented reality mental health technology. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, 2119--2124. http://dx.doi.org/10.1145/1979742.1979898","paperID":"None"},{"content":"Maja Wrzesien, Cristina Botella, Juana Bretón-López, Eva del Río González, Jean-Marie Burkhardt, Mariano Alcañiz, and María Ángeles Pérez-Ara. 2015. Treating small animal phobias using a projective-augmented reality system. Computers in Human Behavior 49(C), 343--353. http://dx.doi.org/10.1016/j.chb.2015.01.065","paperID":"None"},{"content":"Shirley Yen, Caron Zlotnick and Ellen Costello. 2002. Affect regulation in women with borderline personality disorder traits. The Journal of Nervous and Mental Disease 100(10), 693--696. http://dx.doi.org/10.1097/01.NMD.0000034744.11140.","paperID":"None"}],"citation":[],"abstract":"This paper describes the challenges and lessons learned in the experience-centered design (ECD) of the Spheres of Wellbeing, a technology to promote the mental health and wellbeing of a group of women, suffering from significant mental health problems and living in a medium secure hospital unit. First, we describe how our relationship with mental health professionals at the hospital and the aspirations for person-centric care that we shared with them enabled us, in the design of the Spheres, to innovate outside traditional healthcare procedures. We then provide insights into the challenges presented by the particular care culture and existing services and practices in the secure hospital unit that were revealed through our technology deployment. In discussing these challenges, our design enquiry opens up a space to make sense of experience living with complex mental health conditions in highly constrained contexts within which the deployment of the Spheres becomes an opportunity to think about wellbeing in similar contexts.","title":"Challenges for Designing new Technology for Health and Wellbeing in a Complex Mental Healthcare Context","filename":"CHI16/p2136","authors":["Anja Thieme","John McCarthy","Paula Johnson","Stephanie Phillips","Jayne Wallace","Siân Lindley","Karim Ladha","Daniel Jackson","Diana Nowacka","Ashur Rafiev","Cassim Ladha","Thomas Nappey","Mathew Kipling","Peter Wright","Thomas D. Meyer","Patrick Olivier"],"conference":"CHI '16"}