{"paperId":2858352,"citation":[],"abstract":"Personal health technologies are increasingly introduced in workplace settings. Yet little is known about workplace implementations of activity tracker use and the kind of experiences and concerns employees might have when engaging with these technologies in practice. We report on an observational study of a Danish workplace participating in a step counting campaign. We find that concerns of employees who choose to participate and those who choose not to differ. Moreover, privacy concerns of participants develop and change over time. Our findings challenge the assumption that consumers are becoming more comfortable with perceived risks associated with wearable technologies, instead showing how users can be initially influenced by the strong positive rhetoric surrounding these devices, only to be surprised by the necessity to renegotiate boundaries of disclosure in practice.","reference":[{"content":"Eytan Bakshy, Itamar Rosenn, Cameron Marlow, and Lada Adamic. 2012. The Role of Social Networks in Information Diffusion. WWW 2012.","paperID":"None"},{"content":"Louise Barkhuus. 2012. The mismeasurement of privacy: using contextual integrity to reconsider privacy in HCI. CHI '12, 367-376.","paperID":"None"},{"content":"Jenny Dearborn. 2014. Big Data Gets Personal?: Wearable Tech In Your Workplace. Forbes.","paperID":"None"},{"content":"Stuart Dredge. 2015. Why the workplace of 2016 could echo Orwell's 1984. The Guardian.","paperID":"None"},{"content":"Robert Emerson, Rachel Fretz, and Lina Shaw. 2011. Writing Ethnographic Fieldnotes. The University of Chicago Press.","paperID":"None"},{"content":"Samuel Gibbs. 2014. Court sets legal precedent with evidence from Fitbit health tracker. The Guardian.","paperID":"None"},{"content":"Nanna Gorm and Irina Shklovski. 2016. Steps, Choices, and Moral Accounting: Observations from a Step-Counting Campaign in the Workplace. CSCW '16.","paperID":"None"},{"content":"Richard H.R. Harper. 1996. Why People Do and Don't Wear Active Badges?: A Case Study. CSCW 4, 297-318.","paperID":"None"},{"content":"Predrag Klasnja, Sunny Consolvo, and Tanzeem Choudhury. 2009. Exploring Privacy Concerns about Personal Sensing. Pervasive'09, 176-183.","paperID":"None"},{"content":"Bart P. Knijnenburg, Alfred Kobsa, and Hongxia Jin. 2013. Dimensionality of information disclosure behavior. International Journal of Human Computer Studies 71, 12, 1144-1162.","paperID":"None"},{"content":"Michal Kosinski, David Stillwell, and Thore Graepel. 2013. Private traits and attributes are predictable from digital records of human behavior. Proceedings of the National Academy of Sciences of the USA of America 110, 15, 5802-5.","paperID":"None"},{"content":"Fengjun Li, Xukai Zou, Peng Liu, and Jake Y Chen. 2011. New threats to health data privacy. BMC bioinformatics 12 Suppl 1, Suppl 12, S7.","paperID":"None"},{"content":"Elizabeth Lingg, Garrett Leone, Kent Spaulding, and Reza B'Far. 2014. Cardea: Cloud based employee health and wellness integrated wellness application with a wearable device and the HCM data store. WF-IoT 2014, 265-270.","paperID":"None"},{"content":"Deborah Lupton (Ed.). 2014. Beyond TechnoUtopia: Critical Approaches to Digital Health Technologies. Shu-Kun Lin.","paperID":"None"},{"content":"David Mills. 2015. Consumers Like Wearable Technology but Worry About Data Security. Healthline.com.","paperID":"None"},{"content":"Scott Peppet. 2011. Unraveling Privacy: The Personal Prospectus and the Threat of a Full Disclosure Future. Nw. UL Rev. 105, 3, 1153-1204.","paperID":"None"},{"content":"Pricewaterhouse Coopers. 2014. The Wearable Future.","paperID":"None"},{"content":"John Rooksby, Mattias Rost, and Matthew Chalmers. 2014. Personal tracking as lived informatics. CHI '14, 1163-1172.","paperID":"None"},{"content":"Irina Shklovski and Scott Mainwaring. 2014. Leakiness and creepiness in app space: perceptions of privacy and mobile app use. CHI 2014.","paperID":"None"},{"content":"Fred Stutzman and Jacob Kramer-Duffield. 2010. Friends Only?: Examining a Privacy-Enhancing Behavior in Facebook. CHI 2010, April 10-15, 2010, 1553-1562.","paperID":"None"}],"title":"Sharing Steps in the Workplace: Changing Privacy Concerns Over Time","filename":"CHI16/p4315","authors":["Nanna Gorm","Irina Shklovski"],"conference":"CHI '16"}