{"paperId":2858226,"citation":[],"reference":[{"content":"Merwan Achibet, Adrien Girard, Anthony Talvas, Maud Marchal, and Anatole Lecuyer. 2015. ElasticArm: Human-scale passive haptic feedback for augmenting interaction and perception in virtual environments. Virtual Reality (VR), 2015 IEEE, 63--68.","paperID":"None"},{"content":"Yuki Ban, Takashi Kajinami, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2012. Modifying an identified angle of edged shapes using pseudo-haptic effects. Haptics: Perception, Devices, Mobility, and Communication. Springer Berlin Heidelberg, 2012. 25--36.. http://doi.org/10.1007/978--3642--31401--8_3","paperID":"None"},{"content":"Patrick Baudisch, Edward Cutrell, Dan Robbins, et al. 2003. Drag-and-pop and drag-and-pick: Techniques for accessing remote screen content on touch-and penoperated systems. Proceedings of INTERACT, 57--64.","paperID":"None"},{"content":"Kristopher J. Blom, Jorge Arroyo-Palacios, and Mel Slater. 2014. The effects of rotating the self out of the body in the full virtual body ownership illusion. Perception 43, 4: 275--294. http://doi.org/10.1068/p7618","paperID":"None"},{"content":"Eric Burns, Sharif Razzaque, Mary C. Whitton, and Frederick P. Brooks. 2007. MACBETH: The avatar which I see before me and its movement toward my hand. Proceedings IEEE Virtual Reality: 295--296. http://doi.org/10.1109/VR.2007.352509","paperID":"None"},{"content":"François Conti and Oussama Khatib. 2005. Spanning large workspaces using small haptic devices. Eurohaptics Conference, 2005 and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2005. World Haptics 2005. First Joint: 183--188. http://doi.org/10.1109/WHC.2005.118","paperID":"None"},{"content":"Christian Corsten, Ignacio Avellino, Max Möllers, and Jan Borchers. 2013. Instant User Interfaces: Repurposing Everyday Objects as Input Devices. Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces ITS '13, 71--80. http://doi.org/10.1145/2512349.2512799","paperID":"None"},{"content":"George W. Fitzmaurice, Hiroshi Ishii, and William A.S. Buxton. 1995. Bricks: laying the foundations for graspable user interfaces. Proceedings of the SIGCHI conference on Human factors in computing systems: 442--449. http://doi.org/10.1145/223904.223964","paperID":"None"},{"content":"Bernd Frohlich and John Plate. 2000. The cubic mouse: a new device for three-dimensional input. Conference on Human Factors in Computing Systems: Proceedings of the SIGCHI conference on Human factors in computing systems 1, 06: 526--531. http://doi.org/10.1145/332040.332491","paperID":"None"},{"content":"James J. Gibson. 1933. Adaptation, after-effect and contrast in the perception of curved lines. Journal of Experimental Psychology 16, 1: 1--31. http://doi.org/10.1037/h0074626","paperID":"None"},{"content":"John C. Goble, Ken Hinckley, Randy Pausch, John W. Snell, and Neal P. Kassell. 1995. Two-handed spatial interface tools for neurosurgical planning. Computer 28, 7: 20--26. http://doi.org/10.1109/2.391037","paperID":"None"},{"content":"Roland Guay. 1977. Purdue Spatial Visualization Test Visualization of Views. Purdue Research Foundation, West Lafayette, IN.","paperID":"None"},{"content":"Hannah B. Helbig and Marc O. Ernst. 2007. Optimal integration of shape information from vision and touch. Experimental Brain Research 179, 4: 595--606. http://doi.org/10.1007/s00221-006-0814-y","paperID":"None"},{"content":"Steven J Henderson and Steven Feiner. 2008. Opportunistic Controls: Leveraging Natural Affordances as Tangible User Interfaces for Augmented Reality. Proceedings of the 2008 ACM symposium on Virtual reality software and technology VRST '08, 211--218. http://doi.org/10.1145/1450579.1450625","paperID":"None"},{"content":"Ken Hinckley, Randy Pausch, John C Goble, and Neal F Kassell. 1994. Passive Real-world Interface Props for Neurosurgical Visualization. Proceedings of the SIGCHI conference on Human factors in computing systems celebrating interdependence CHI '94, 452--458. http://doi.org/10.1145/191666.191821","paperID":"None"},{"content":"Ralph L. Hollis, Septimiu E. Salcudean, and A. Peter Allan. 1991. A six-degree-of-freedom magnetically levitated variable compliance fine-motion wrist: Design, modeling, and control. IEEE Transactions on Robotics and Automation 7, 3: 320--332. http://doi.org/10.1109/70.88141","paperID":"None"},{"content":"Brent E. Insko. 2001. Passive haptics significantly enhances virtual environments. Computer: 100.","paperID":"None"},{"content":"Konstantina Kilteni, Jean Marie Normand, Maria V. Sanchez-Vives, and Mel Slater. 2012. Extending body space in immersive virtual reality: A very long arm illusion. PLoS ONE 7, 7. http://doi.org/10.1371/journal.pone.0040867","paperID":"None"},{"content":"Konstantina Kilteni. 2015. Over my fake body: body ownership illusions for studying the multisensory basis of own-body perception. Frontiers in Human Neuroscience 9, March. http://doi.org/10.3389/fnhum.2015.00141","paperID":"None"},{"content":"Itaru Kitahara, Morio Nakahara, and Yuichi Ohta. 2010. Sensory Properties in Fusion of Visual / Haptic Stimuli Using Mixed Reality. In Advances in Haptics. InTech. 565--583.","paperID":"None"},{"content":"Roberta L. Klatzky, Jack M. Loomis, Andrew C. Beall, Sarah S. Chance, and Reginald G. Golledge. 1998. Spatial Updating of Self-Position and Orientation During Real, Imagined, and Virtual Locomotion. Psychological Science 9, 4: 293--298. http://doi.org/10.1111/1467--9280.00058","paperID":"None"},{"content":"Luv Kohli, Eric Burns, Dorian Miller, and Henry Fuchs. 2005. Combining passive haptics with redirected walking. Proceedings of the 2005 International Conference on Augmented Teleexistence 57, 4: 253--254. http://doi.org/10.1145/1152399.1152451","paperID":"None"},{"content":"Luv Kohli, Mary C. Whitton, and Frederick P. Brooks. 2012. Redirected touching: The effect of warping space on task performance. IEEE Symposium on 3D User Interfaces 2012, 3DUI 2012 - Proceedings: 105--112. http://doi.org/10.1109/3DUI.2012.6184193","paperID":"None"},{"content":"Luv Kohli, Mary C. Whitton, and Frederick P. Brooks. 2013. Redirected Touching: Training and adaptation in warped virtual spaces. IEEE Symposium on 3D User Interface 2013, 3DUI 2013 - Proceedings: 79--86. http://doi.org/10.1109/3DUI.2013.6550201","paperID":"None"},{"content":"Luv Kohli. 2010. Redirected touching: Warping space to remap passive haptics. 3DUI 2010 IEEE Symposium on 3D User Interfaces 2010, Proceedings: 129--130. http://doi.org/10.1109/3DUI.2010.5444703","paperID":"None"},{"content":"Anatole Lécuyer, Sabine Coquillart, Aberrahmane Kheddar, Paul Richard, and Phillipe Coiffet. 2000. Pseudo-haptic feedback: can isometric input devices simulate force feedback? Proceedings IEEE Virtual Reality 2000 (Cat. No.00CB37048). http://doi.org/10.1109/VR.2000.840369","paperID":"None"},{"content":"Rensis Likert. 1932. A technique for the measurement of attitudes. Archives of Psychology 22 140: 55. http://doi.org/2731047","paperID":"None"},{"content":"William A. McNeely. 1993. Robotic graphics: a new approach to force feedback for virtual reality. Proceedings of IEEE Virtual Reality Annual International Symposium. http://doi.org/10.1109/VRAIS.1993.380761","paperID":"None"},{"content":"Walter R Miles. 1930. Ocular dominance in human adults. Journal of General Psychology 3: 412--430.","paperID":"None"},{"content":"Sharif Razzaque, Zachariah Kohn, and Mary C Whitton. 2001. Redirected Walking. Proceedings of EUROGRAPHICS: 289--294.","paperID":"None"},{"content":"Irvin Rock and Jack Victor. 1964. Vision and Touch: An Experimentally Created Conflict Between The Two Senses. Science (NY, N.Y.) 143: 594--596. http://doi.org/10.1126/science.143.3606.594","paperID":"None"},{"content":"Adalberto L Simeone, Eduardo Velloso, and Hans Gellersen. 2015. Substitutional Reality. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, 3307--3316. http://doi.org/10.1145/2702123.2702389","paperID":"None"},{"content":"Bernhard Spanlang, Jean-Marie Normand, David Borland, et al. 2014. How to Build an Embodiment Lab: Achieving Body Representation Illusions in Virtual Reality. Frontiers in Robotics and AI 1: 1--22. http://doi.org/10.3389/frobt.2014.00009","paperID":"None"},{"content":"Frank Steinicke, Gerd Bruder, Jason Jerald, Harald Frenz, and Markus Lappe. 2010. Estimation of Detection Thresholds for Redirected Walking Techniques. IEEE Transactions on Visualization and Computer Graphics 16, 1: 17--27. http://doi.org/10.1109/TVCG.2009.62","paperID":"None"},{"content":"Susumu Tachi, Taro Maeda, Ryokichi Hirata, and Hiroshi Hoshino. 1994. A Construction Method of Virtual Haptic Space. Proceedings of the 4th International Conference on Artificial Reality and Tele-Existence (ICAT'94).","paperID":"None"},{"content":"Colin Ware and Jeff Rose. 1999. Rotating virtual objects with real handles. ACM Transactions on Computer-Human Interaction 6, 162--180. http://doi.org/10.1145/319091.319102","paperID":"None"},{"content":"Bob G. Witmer and Michael J. Singer. 1998. Measuring Presence in Virtual Environments: A Presence Questionnaire. Presence: Teleoperators and Virtual Environments 7, 3: 225--240. http://doi.org/10.1162/105474698565686","paperID":"None"}],"abstract":"Manipulating a virtual object with appropriate passive haptic cues provides a satisfying sense of presence in virtual reality. However, scaling such experiences to support multiple virtual objects is a challenge as each one needs to be accompanied with a precisely-located haptic proxy object. We propose a solution that overcomes this limitation by hacking human perception. We have created a framework for repurposing passive haptics, called haptic retargeting, that leverages the dominance of vision when our senses conflict. With haptic retargeting, a single physical prop can provide passive haptics for multiple virtual objects. We introduce three approaches for dynamically aligning physical and virtual objects: world manipulation, body manipulation and a hybrid technique which combines both world and body manipulation. Our study results indicate that all our haptic retargeting techniques improve the sense of presence when compared to typical wand-based 3D control of virtual objects. Furthermore, our hybrid haptic retargeting achieved the highest satisfaction and presence scores while limiting the visible side-effects during interaction.","title":"Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences","filename":"CHI16/p1968","authors":["Mahdi Azmandian","Mark Hancock","Hrvoje Benko","Eyal Ofek","Andrew D. Wilson"],"conference":"CHI '16"}