{"paperId":2858443,"abstract":"Break activities -- deliberate and unexpected -- are common throughout the working day, playing an important role in the wellbeing of workers. This paper investigates the role of increasingly pervasive ICT in creating new opportunities for breaks at work, what impact the technology has on management of boundaries at work, and the effects these changes have on personal wellbeing. We present a study of the routines of office-workers, where we used images from participants' work-days to prompt and contextualize interviews with them. Analysis of coded photographs and interview data makes three contributions: an account of ubiquitous ICT creating new forms of micro-breaks, including the opportunity to employ previously wasted time; a description of the ways in which staff increasingly bring \"home to work\"; and a discussion of the emergence of \"screen guilt\". We evaluate our findings in relation to previous studies, and leave three research implications and questions for future work in this domain.","citation":[],"reference":[{"content":"Blake E. Ashforth, Glen E. Kreiner, and Mel Fugate. 2000. All in a day's work: Boundaries and micro role transitions. Academy of Management Review, 25, 3: 472--491.","paperID":"None"},{"content":"Larissa K. Barber, and Jade S. Jenkins. 2014. Creating technological boundaries to protect bedtime: Examining work-home boundary management, psychological detachment and sleep. Stress and Health, 30, 3: 259--264.","paperID":"None"},{"content":"Virginia Braun, and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology, 3, 2: 77--101.","paperID":"None"},{"content":"BUPA. 2015. Take a break. Retrieved September 25, 2015 from http://www.bupa.com/media-centre/pressreleases/uk/take-a-break/","paperID":"None"},{"content":"Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A diary study of task switching and interruptions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 175--182.","paperID":"None"},{"content":"David Dearman and Jeffery S. Pierce. 2008. It's on my other computer!: computing with multiple devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 767--776.","paperID":"None"},{"content":"Daantje Derks, Lieke L. ten Brummelhuis, Dino Zecic, and Arnold B. Bakker. 2014. Switching on and off...: Does smartphone use obstruct the possibility to engage in recovery activities? European Journal of Work and Organizational Psychology, 23, 1: 80--90.","paperID":"None"},{"content":"Rowanne Fleck, Anna L. Cox, and Rosalyn A.V. Robison. 2015. Balancing Boundaries: Using Multiple Devices to Manage Work-Life Balance. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3985--3988.","paperID":"None"},{"content":"Charlotte Fritz, Chak Fu Lam, and Gretchen M. Spreitzer. 2001. It's the little things that matter: An examination of knowledge workers' energy management. The Academy of Management Perspectives, 25, 3: 28--39.","paperID":"None"},{"content":"Charlotte Fritz, Allison M. Ellis, Caitlin A. Demsky, Bing C. Lin, and Frankie Guros. 2013. Embracing work breaks: Recovering from work stress. Organizational Dynamics 42, 4: 274--280.","paperID":"None"},{"content":"Victor M. González and Gloria Mark. 2004. \"Constant, constant, multi-tasking craziness\": managing multiple working spheres. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 113--120.","paperID":"None"},{"content":"Amy L. Gonzales, Jeffrey T. Hancock. 2011. Mirror, Mirror on my Facebook Wall: Effects of Exposure to Facebook on Self-Esteem. Cyberpsychology, Behavior, and Social Networking 14, 1--2: 79--83.","paperID":"None"},{"content":"Keith Hampton, and Barry Wellman. 2003. Neighboring in Netville: How the Internet supports community and social capital in a wired suburb. City and Community, 2, 4: 277--311.","paperID":"None"},{"content":"E. Jeffrey Hill, Maria Ferris, and Vjollca Märtinson. 2003. Does it matter where you work? A comparison of how three work venues (traditional office, virtual office, and home office) influence aspects of work and personal/family life. Journal of Vocational Behavior 63, 2: 220--241.","paperID":"None"},{"content":"HSE. 2013. Working with display screen equipment (DSE). Retrieved September 25, 2015 from http://www.hse.gov.uk/pubns/indg36.pdf","paperID":"None"},{"content":"Michael Inzlicht, and Brandon J. Schmeichel. 2012. What is ego depletion? Toward a mechanistic revision of the resource model of self-control. Perspectives on Psychological Science, 7, 5: 450--463.","paperID":"None"},{"content":"Shamsi T. Iqbal and Eric Horvitz. 2007. Disruption and recovery of computing tasks: field study, analysis, and directions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 677--686.","paperID":"None"},{"content":"Jing Jin and Laura A. Dabbish. 2009. Self-interruption on the computer: a typology of discretionary task interleaving. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1799--1808.","paperID":"None"},{"content":"Tero Jokela, Jarno Ojala, and Thomas Olsson. 2015. A Diary Study on Combining Multiple Information Devices in Everyday Activities and Tasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3903--3912.","paperID":"None"},{"content":"Stephen Kaplan. 1995. The restorative benefits of nature: Toward an integrative framework. Journal of Environmental Psychology 15, 3: 169--182.","paperID":"None"},{"content":"Sung Doo Kim, Daniele A. Bologna, Stacie Furst Holloway, Elaine C. Hollensbe, Suzanne S. Masterson, and Therese Sprinkle. 2014. Taking a Break via Technology? Triggers, Nature, and Effects of \"Online\" Work Breaks. Academy of Management, 2014, 1: 11891.","paperID":"None"},{"content":"Ellen Ernst Kossek, Marian N. Ruderman, Phillip W. Braddly, and Kelly M. Hannum. 2012. Work-nonwork boundary management profiles: A person-centered approach. Journal of Vocational Behavior, 81, 1: 112128.","paperID":"None"},{"content":"Glen E. Kreiner, Elaine C. Hollensbe, and Mathew L. Sheep. 2009. Balancing borders and bridges: Negotiating the work-home interface via boundary work tactics. Academy of Management Journal, 52, 4: 704--730.","paperID":"None"},{"content":"Matthew L. Lee and Anind K. Dey. 2008. Lifelogging memory appliance for people with episodic memory impairment. In Proceedings of the 10th international conference on Ubiquitous computing (UbiComp '08). ACM, NY, NY, USA, 44--53.","paperID":"None"},{"content":"Siân E. Lindley, Sam Meek, Abigail Sellen, and Richard Harper. 2012. \"It's simply integral to what I do\": enquiries into how the web is weaved into everyday life. In Proceedings of the 21st international conference on World Wide Web (WWW '12). ACM, NY, NY, USA, 1067--1076.","paperID":"None"},{"content":"Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The cost of interrupted work: more speed and stress. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 107--110.","paperID":"None"},{"content":"Gloria Mark, Stephen Voida, and Armand Cardello. 2012. \"A pace not dictated by electrons\": an empirical study of work without email. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 555--564.","paperID":"None"},{"content":"Gloria Mark, Shamsi T. Iqbal, Mary Czerwinski, and Paul Johns. 2014. Bored mondays and focused afternoons: the rhythm of attention and online activity in the workplace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3025--3034.","paperID":"None"},{"content":"Gloria Mark, Shamsi Iqbal, Mary Czerwinski, and Paul Johns. 2014. Capturing the mood: facebook and faceto-face encounters in the workplace. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 1082--1094.","paperID":"None"},{"content":"Gloria Mark, Shamsi Iqbal, Mary Czerwinski, and Paul Johns. 2015. Focused, Aroused, but so Distractible: Temporal Perspectives on Multitasking and Communications. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 903--916.","paperID":"None"},{"content":"Moira McGregor, Barry Brown, and Donald McMillan. 2014. 100 days of iPhone use: mobile recording in the wild. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 2335--2340.","paperID":"None"},{"content":"Linda McLean, Maureen A. Tingley, Robert N. Scott, and Jeremy Rickards. 2001. Computer terminal work and the benefit of microbreaks. Applied Ergonomics, 32, 3: 225--237.","paperID":"None"},{"content":"Taewoo Nam. 2014. Technology use and work-life balance. Applied Research in Quality of Life 9, 4: 1017--1040.","paperID":"None"},{"content":"Brid O'Conaill and David Frohlich. 1995. Timespace in the workplace: dealing with interruptions. In Conference Companion on Human Factors in Computing Systems (CHI '95), I. Katz, R. Mack, and L. Marks (Eds.). ACM, NY, NY, USA, 262--263.","paperID":"None"},{"content":"YoungAh Park, and Steve M. Jex. 2011. Work-home boundary management using communication and information technology. International Journal of Stress Management 18, 2: 133--152.","paperID":"None"},{"content":"Tye Rattenbury, Dawn Nafus, and Ken Anderson. 2008. Plastic: a metaphor for integrated technologies. In Proceedings of the 10th international conference on Ubiquitous computing (UbiComp '08). ACM, NY, NY, USA, 232--241.","paperID":"None"},{"content":"Mark Rouncefield, John A. Hughes, Tom Rodden, and Stephen Viller. 1994. Working with \"constant interruption\": CSCW and the small office. In Proceedings of the 1994 ACM conference on Computer supported cooperative work (CSCW '94). ACM, NY, NY, USA, 275--286.","paperID":"None"},{"content":"N. Sadat Shami, Michael Muller, Aditya Pal, Mikhil Masli, and Werner Geyer. 2015. Inferring Employee Engagement from Social Media. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3999--4008.","paperID":"None"},{"content":"Anya Skatova, Victoria E Shipp, Lee Spacagna, Ben Bedwell, Ahmad Beltagui, and Tom Rodden. 2015. Datawear: Self-reflection on the Go or How to Ethically Use Wearable Cameras for Research. In CHI '15 Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 323--326.","paperID":"None"},{"content":"Sabine Sonnentag. 2001. Work, recovery activities, and individual well-being: a diary study. Journal of Occupational Health Psychology 6, 3: 196--210.","paperID":"None"},{"content":"Norman Makoto Su and Gloria Mark. 2008. Communication chains and multitasking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 83--92.","paperID":"None"},{"content":"John P. Trougakos, Daniel J. Beal, Stephen G. Green, and Howard M. Weiss. 2008. Making the break count: An episodic examination of recovery activities, emotional experiences, and positive affective displays. Academy of Management Journal 51, 1: 131--146.","paperID":"None"}],"title":"The Role of ICT in Office Work Breaks","filename":"CHI16/p3049","authors":["Anya Skatova","Ben Bedwell","Victoria Shipp","Yitong Huang","Alexandra Young","Tom Rodden","Emma Bertenshaw"],"conference":"CHI '16"}