{"paperId":2858592,"citation":[],"abstract":"This paper argues that designers committed to advancing justice and other non-market values must attend not only to the design of objects, processes, and situations, but also to the wider economic and cultural imaginaries of design as a social role. The paper illustrates the argument through the case of Turkopticon, originally an activist tool for workers in Amazon Mechanical Turk (AMT), built by the authors and maintained since 2009. The paper analyzes public depictions of Turkopticon which cast designers as creative innovators and AMT workers as without agency or capacity to change their situation. We argue that designers' elevated status as workers in knowledge economies can have practical consequences for the politics of their design work. We explain the consequences of this status for Turkopticon and how we adapted our approach in response over the long term. We argue for analyses of power in design work that account for and develop counters to hegemonic beliefs and practices about design as high-status labor.","reference":[{"content":"Philip Agre. 1997. Toward a Critical Technical Practice: Lessons Learned in Trying to Reform Al. Social Science, Technical Systems, and Cooperative Work: The Great Divide, 131.","paperID":"None"},{"content":"Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1301-1310. http://dl.acm.org/citation.cfm?id=1753521 [was 1]","paperID":"None"},{"content":"Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 675-684. http://dl.acm.org/citation.cfm?id=1979041 [was 2]","paperID":"None"},{"content":"Shaowen Bardzell, Jeffrey Bardzell, Jodi Forlizzi, John Zimmerman, & John Antanitis. 2012. Critical Design and Critical Theory: The Challenge of Designing for Provocation. Proceedings of the Designing Interactive Systems Conference, 288-297. http://doi.org/10.1145/2317956.2318001","paperID":"None"},{"content":"Yochai Benkler. 2006. The Wealth of Networks. Yale University Press. [was 5]","paperID":"None"},{"content":"John L. Bennet and John Karat. 1994. Facilitating effective HCI design meetings. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 198-204. http://doi.acm.org/10.1145/191666.191743","paperID":"None"},{"content":"Hugh Beyer and Karen Holtzblatt, K. 1997. Contextual Design : A Customer-Centered Approach to Systems Designs. Morgan Kaufmann, San Francisco.","paperID":"None"},{"content":"Gro Bjerknes and Tone Bratteteig. 1995. User participation and democracy: A discussion of Scandinavian research on system development. Scandinavian Journal of Information Systems 7, 1:73- 98.","paperID":"None"},{"content":"Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2010. Participatory Design and \"Democratizing Innovation.\" Proceedings of the 11th Biennial Participatory Design Conference, 41-50. http://doi.org/10.1145/1900441.1900448","paperID":"None"},{"content":"Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2012. Agonistic participatory design: working with marginalised social movements. CoDesign 8, 2--3: 127-144.","paperID":"None"},{"content":"Alan Borning and Michael Muller. 2012. Next steps for value sensitive design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1125-1134. Retrieved September 25, 2015 from http://dl.acm.org/citation.cfm?id=2208560 [was 3]","paperID":"None"},{"content":"Erik Brynjolfsson and Andrew McAfee. 2014. The second machine age: work, progress, and prosperity in a time of brilliant technologies. WW Norton & Company, New York.","paperID":"None"},{"content":"Judith Butler. 2001. Doing justice to someone: Sex reassignment and allegories of transsexuality. GLQ: A Journal of Lesbian and Gay Studies 7, 4: 621-636.","paperID":"None"},{"content":"John M. Carroll, George Chin, Mary Beth Rosson, and Dennis C. Neale. 2000. The development of cooperation: Five years of participatory design in the virtual school. Proceedings of the 3rd Conference on Designing interactive Systems, 239-251. http://doi.acm.org/10.1145/347642.347731","paperID":"None"},{"content":"Manuel Castells. 2010. End of Millennium: The Information Age: Economy, Society, and Culture. John Wiley & Sons.","paperID":"None"},{"content":"Derek H. C. Chen and Carl J. Dahlman. 2005. The Knowledge Economy, the KAM Methodology and World Bank Operations. Social Science Research Network, Rochester, NY. http://papers.ssrn.com/abstract=841625","paperID":"None"},{"content":"Andrew Clement and Peter Van den Besselaar. 1993. A retrospective look at PD projects. Communications of the ACM 36, 6: 29-37.","paperID":"None"},{"content":"Clickhappier, \"Demographics of Mechanical Turk,\" post 20, Mturkgrind.com, July 28, 2014.","paperID":"None"},{"content":"Geoff Cooper and John Bowers. 1995. Representing the user: Notes on the disciplinary rhetoric of human-computer interaction. The Social and Interactional Dimensions of Human-computer Interfaces, Cambridge University Press, 48-66.","paperID":"None"},{"content":"Beatriz da Costa and Kavita Philip, eds. 2008. Tactical Biopolitics: Art, Activism, Technoscience. MIT Press","paperID":"None"},{"content":"Design Council. 2011. Design for innovation. London: Design Council. Retrieved April, 27, 2012.","paperID":"None"},{"content":"Carl DiSalvo. 2012. Adversarial Design. MIT Press, Cambridge, MA.","paperID":"None"},{"content":"Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making public things: how HCI design can express matters of concern. Proceedings of the SIGCHI Conference on Human factors in Computing Systems, 2397-2406. http://dx.doi.org/10.1145/2556288.2557359","paperID":"None"},{"content":"Paul Dourish and Scott D. Mainwaring. 2012. Ubicomp's colonial impulse. Proceedings of the ACM Conference on Ubiquitous Computing, 133-142. http://doi.acm.org/10.1145/2370216.2370238","paperID":"None"},{"content":"Anthony Dunne and Fiona Raby. 2013. Speculative Everything: Design, Fiction, and Social Dreaming. MIT Press, Cambridge, MA.","paperID":"None"},{"content":"Arindam Dutta. 2007. The Bureaucracy of Beauty: Design in the Age of its Global Reproducibility. Routledge, New York. [was 12]","paperID":"None"},{"content":"Daniel Fallman. 2003. Design-oriented human-computer interaction. Proceedings of the SIGCHI Conference on Human factors in computing systems, 225-232. http://dx.doi.org/10.1145/642611.642652","paperID":"None"},{"content":"Richard FL. 2002. The Rise of the Creative Class: And How It's Transforming Work, Leisure, Community and Everyday Life. Perseus Books Group.","paperID":"None"},{"content":"Adrian Forty. 1986. Objects of Desire: Design and Society from Wedgewood to IBM. Pantheon Books, New York.","paperID":"None"},{"content":"Michel Foucault. 1979. The History of Sexuality: Volume 1. Pantheon Books, New York.","paperID":"None"},{"content":"Batya Friedman, Peter Kahn, and Alan Borning. e2006. Value centered design in information systems. In Human-Computer Interaction in Management Information Systems: Foundations, Ping Zhang and Dennis Galletta (eds.). M.E. Sharpe, Inc: New York, 348--372.","paperID":"None"},{"content":"Garcia, D. and Lovink, G. 1997. The ABC of tactical media. nettime listserv. Accessed: http://www.nettime.org/Lists-Archives/nettime-l9705/msg00096.html","paperID":"None"},{"content":"Antonio Gramsci, Quintin Hoare, and Geoffrey Nowell-Smith. 1971. Selections from the Prison Notebooks of Antonio Gramsci. International Publishers, New York.","paperID":"None"},{"content":"Jonathan Grudin. 2005. Three faces of human-computer interaction. IEEE Annals of the History of Computing, 4: 46-62.","paperID":"None"},{"content":"Stuart Hall. 2001. Gramsci and Us. In Antonio Gramsci: Contemporary applications. Routledge, London, 227-309.","paperID":"None"},{"content":"Donna Jeanne Haraway. 1997. Modest--Witness@Second--Millennium.FemaleMan--Meets--OncoMouse: Feminism and Technoscience. Psychology Press.","paperID":"None"},{"content":"Ellie Harmon and Melissa Mazmanian. 2013. Stories of the Smartphone in everyday discourse: conflict, tension & instability. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1051-1060. Retrieved September 10, 2015 from http://dl.acm.org/citation.cfm?id=2466134","paperID":"None"},{"content":"Tad Hirsch. 2009. Learning from activists. Interactions, 16(3), 31-33.","paperID":"None"},{"content":"Jeff Howe. 2008. Mechanical Turk Targets Small Business. Crowdsourcing.com. Available at http://www.crowdsourcing.com/cs/2008/08/index.html","paperID":"None"},{"content":"Tim Ingold. 2013. Making: Anthropology, Archaeology, Art and Architecture. Routledge, London.","paperID":"None"},{"content":"Panos Ipeirotis. 2008. Why People Participate in Mechanical Turk? Retrieved from http://www.behindthe-enemy-lines.com/2008/03/why-people-participateon-mechanical.html","paperID":"None"},{"content":"Lilly Irani. 2013. The cultural work of microwork. New Media & Society: 1461444813511926. http://doi.org/10.1177/1461444813511926","paperID":"None"},{"content":"Lilly Irani. 2015. Difference and Dependence among Digital Workers: The Case of Amazon Mechanical Turk. South Atlantic Quarterly 114, 1: 225-234.","paperID":"None"},{"content":"Lilly Irani. 2015. Hackathons and the Making of Entrepreneurial Citizenship. Science, Technology & Human Values 40, 5:799--824.","paperID":"None"},{"content":"Lilly Irani and M. Six Silberman. 2013. Turkopticon: Interrupting Worker Invisibility on Amazon Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2013), 611--620.","paperID":"None"},{"content":"Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial computing: a lens on design and development. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1311-1320. http://doi.acm.org/10.1145/1753326.1753522","paperID":"None"},{"content":"Steven J. Jackson, Alex Pompe, and Gabriel Krieshok. 2011. Things fall apart: maintenance, repair, and technology for education initiatives in rural Namibia. Proceedings of the 2011 iConference, 83-90. http://dl.acm.org/citation.cfm?id=1940773","paperID":"None"},{"content":"Steven J. Jackson, Alex Pompe, and Gabriel Krieshok. 2012. Repair worlds: maintenance, repair, and ICT for development in rural Namibia. Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work, 107-116. http://dl.acm.org/citation.cfm?id=2145224","paperID":"None"},{"content":"Michael Keane. 2013. Creative Industries in China: Art, Design and Media. Polity Press, Cambridge, UK.","paperID":"None"},{"content":"Kevin Kelly. 2009. The New Socialism: Global Collectivist Society Is Coming Online. WIRED 17. Retrieved September 25, 2015 from http://archive.wired.com/culture/culturereviews/magazine/17-06/nep_newsocialism","paperID":"None"},{"content":"Finn Kensing and Jeanette Blomberg. 1998. Participatory design: Issues and concerns. Computer Supported Cooperative Work (CSCW) 7, 3--4: 167- 185.","paperID":"None"},{"content":"Lucy Kimbell. 2011. Rethinking Design Thinking: Part I. Design and Culture 3, 3: 285-306. http://doi.org/10.2752/175470811X13071166525216","paperID":"None"},{"content":"Scott Klemmer. Social Computing. Retrieved from January 1, 2015 from https://www.coursera.org/learn/social-computing/","paperID":"None"},{"content":"Anthony Kosner. 2015. Google Cabs And Uber Bots Will Challenge Jobs \"Below The API.\" Forbes. Retrieved September 22, 2015 from http://www.forbes.com/sites/anthonykosner/2015/02/04/google-cabs-and-uber-bots-will-challenge-jobsbelow-the-api/print/","paperID":"None"},{"content":"Rochelle LaPlante and Six Silberman. 2015. Design notes for a future crowdwork market. Retrieved on January 1, 2016 from https://medium.com/@silberman/design-notes-for-afuture-crowd-work-market-2d7557105805#.l0g9gaicf","paperID":"None"},{"content":"Bruno Latour. 2005. \"From Realpolitik to Dingpolitik.\" In Making Things Public: Atmospheres of Democracy, Bruno Latour and Peter Weibel (eds.). MIT Press: Cambridge MA, 14--44.","paperID":"None"},{"content":"Christopher A. Le Dantec and Carl DiSalvo. 2013. Infrastructuring and the formation of publics in participatory design. Social Studies of Science 43, 2: 241-264.","paperID":"None"},{"content":"Christopher Le Dantec, Erika Sheehan Poole, and Susan Wyche. 2009. Values as Lived Experience: Evolving Design in Support of Value Discovery. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1141--1150.","paperID":"None"},{"content":"Silvia Lindtner, Anna Greenspan, and David Li. 2015. Designed in Shenzhen: Shanzhai Manufacturing and Maker Entrepreneurs. Aarhus Series on Human Centered Computing 1, 1: 12.","paperID":"None"},{"content":"MacArthur Foundation. Luis von Ahn -- MacArthur Foundation. Retrieved September 18, 2015 from https://www.macfound.org/fellows/793/","paperID":"None"},{"content":"Karl Marx. 1906. Capital Volume 1. Charles H. Kerr and Company, New York, 784--787","paperID":"None"},{"content":"David Martin, Benjamin V. Hanrahan, Jacki O'Neill, and Neha Gupta. 2014. Being a Turker. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, 224-235. http://doi.org/10.1145/2531602.2531663","paperID":"None"},{"content":"Mariana Mazzucato. 2014. The entrepreneurial state: debunking public vs. private sector myths. Anthem Press, New York.","paperID":"None"},{"content":"David F. Noble. 1979. America by design: Science, technology, and the rise of corporate capitalism. Oxford University Press, USA.","paperID":"None"},{"content":"Nelly Oudshoorn and Trevor Pinch. 2003. How Users Matter: The Co-Construction of Users and Technology. MIT Press, Cambridge.","paperID":"None"},{"content":"Kavita Philip, Lilly Irani, and Paul Dourish. 2012. Postcolonial Computing: A Tactical Survey. Science, Technology & Human Values 37, 1: 3-29.","paperID":"None"},{"content":"Daniel Pink. 2006. A Whole New Mind: Why RightBrainers Will Rule the Future. Penguin, New York.","paperID":"None"},{"content":"Rajasthan to soon have premier National Institute of Design. (2015, November 20). The Economic Times. Retrieved from http://economictimes.indiatimes.com/industry/services/education/Rajasthan-to-soon-have-premier-NationalInstitute-of-Design/articleshow/49858669.cms","paperID":"None"},{"content":"Niloufar Salehi, Lilly C. Irani, and Michael S. Bernstein. 2015. We Are Dynamo: Overcoming Stalling and Friction in Collective Action for Crowd Workers. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1621-1630.","paperID":"None"},{"content":"Elizabeth B.-N. Sanders. 2002. From user-centered to participatory design approaches. In Design and the social sciences: Making connections, J Frascara (ed.). Taylor and Francis, 1-8.","paperID":"None"},{"content":"Kjeld Schmidt and Liam Bannon. 1992. Taking CSCW Seriously: Supporting Articulation Work. Computer Supported Cooperative Work 1: 7-40. http://doi.org/10.1.1.11.4244","paperID":"None"},{"content":"Joseph Alois Schumpeter. 1934. The theory of economic development: An inquiry into profits, capital, credit, interest, and the business cycle. Transaction publishers.","paperID":"None"},{"content":"Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective design. Proceedings of the Conference on Critical Computing: between sense and sensibility, 49-58. http://dx.doi.org/10.1145/1094562.1094569","paperID":"None"},{"content":"Clay Shirky. 2010 Cognitive Surplus: Creativity and Generosity in a Connected Age. Penguin.","paperID":"None"},{"content":"Michael Six Silberman. 2015. Human-Centered Computing and the Future of Work: Lessons from Mechanical Turk and Turkopticon, 2008-2015. Doctoral dissertation, University of California, Irvine.","paperID":"None"},{"content":"Steve Silberman. Inside the High Tech Hunt for a Missing Silicon Valley Legend. WIRED 15. Retrieved September 18, 2015 from http://archive.wired.com/techbiz/people/magazine/1508/ff_jimgray?currentPage=all","paperID":"None"},{"content":"Herbert Simon. 1996. The Sciences of the Artificial. MIT Press, Cambridge, MA.","paperID":"None"},{"content":"Susan Leigh Star and Karen Ruhleder. 2001. Steps Toward an Ecology of Infrastructure. In Information Technology and Organizational Transformation: History, Rhetoric, and Practice, JoAnne Yates and John Van Maanen (eds.).","paperID":"None"},{"content":"Susan Leigh Star and Anselm Strauss. 1999. Layers of Silence, Arenas of Voice: The Ecology of Visible and Invisible Work. Computer Supported Cooperative Work (CSCW) 8, 1: 9-30. http://doi.org/10.1023/A:1008651105359","paperID":"None"},{"content":"Lucy Suchman. 1994. Working relations of technology production and use. Computer Supported Cooperative Work (CSCW) 2, 1: 21-39. http://doi.org/10.1007/BF00749282","paperID":"None"},{"content":"Lucy Suchman and L. Bishop. 2000. Problematizing \"Innovation\" as a Critical Project. Technology Analysis and Strategic Management 12, 3: 327-333.","paperID":"None"},{"content":"Lucy Suchman. 2002. Located accountabilities in technology production. Scandinavian Journal of Information Systems 14, 2: 7.","paperID":"None"},{"content":"Lucy A. Suchman. 2002. Practice-Based Design of Information Systems: Notes from the Hyper-developed World. The Information Society 18, 2: 139. http://doi.org/10.1080/01972240290075066","paperID":"None"},{"content":"Lucy Suchman. 2007. Human-Machine Reconfigurations. Cambridge University Press.","paperID":"None"},{"content":"Lucy Suchman. 2011. Anthropological Relocations and the Limits of Design. Annual Review of Anthropology 40, 1: 1-18. http://doi.org/10.1146/annurev.anthro.041608.105640","paperID":"None"},{"content":"Lucy Suchman, Randall Trigg, and Jeanette Blomberg. 2002. Working Artefacts: Ethnomethods of the Prototype. The British Journal of Sociology 53, 2: 163- 179. http://doi.org/10.1080/00071310220133287","paperID":"None"},{"content":"David Stark. 2009. The Sense of Dissonance: Accounts of Worth in Economic Life. Princeton University Press, Princeton, NJ.","paperID":"None"},{"content":"Alex S. Taylor. 2011. Out there. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 685-694. Retrieved September 10, 2015 from http://dl.acm.org/citation.cfm?id=1979042","paperID":"None"},{"content":"Anna Tsing. 2015. The Mushroom at the End of the World: On the Possibility of Life in Capitalist Ruins. Princeton University Press, Princeton, NJ.","paperID":"None"},{"content":"Ron Wakkary and Leah Maestri. 2007. The Resourcefulness of Everyday Design. Proceedings of the 6th ACM SIGCHI Conference on Creativity & Cognition, 163-172. http://doi.org/10.1145/1254960.1254984","paperID":"None"},{"content":"Uncertain Commons. 2013. Speculate This. Duke University Press, Durham, NC.","paperID":"None"},{"content":"KPCB Launches Design Council and Design Fellows Program. 2012. Retrieved from http://www.kpcb.com:443/news/kpcb-launches-designcouncil-and-design-fellows-program","paperID":"None"},{"content":"Steve Woolgar. 1990. Configuring the user: the case of usability trials. The Sociological Review 38, S1: 58-99.","paperID":"None"},{"content":"Tjololo. 2015. MTurk GreatHIT Export. Retrieved January 1, 2015 from https://greasyfork.org/en/scripts/911-mturk-great-hitexport","paperID":"None"},{"content":"John Vines, Anja Thieme, Rob Comber, Mark Blythe, Peter C. Wright, and Patrick Olivier. 2013. HCI in the press: online public reactions to mass media portrayals of HCI research. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1873-1882. http://dx.doi.org/10.1145/2470654.2466247","paperID":"None"}],"title":"Stories We Tell About Labor: Turkopticon and the Trouble with \"Design\"","filename":"CHI16/p4573","authors":["Lilly C. Irani","M. Six Silberman"],"conference":"CHI '16"}