{"paperId":2858427,"citation":[],"reference":[{"content":"Christopher Ackad, Andrew Clayphan, Martin Tomitsch, and Judy Kay. 2015. An In-the-wild Study of Learning Mid-air Gestures to Browse Hierarchical Information at a Large Interactive Public Display. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 1227--1238. DOI: http://dx.doi.org/10.1145/2750858.2807532","paperID":"None"},{"content":"Christopher Ackad, Rainer Wasinger, Richard Gluga, Judy Kay, and Martin Tomitsch. 2013. Measuring Interactivity at an Interactive Public Information Display. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (OzCHI '13). ACM, New York, NY, USA, 329--332. DOI: http://dx.doi.org/10.1145/2541016.2541091","paperID":"None"},{"content":"Ville Makela, Tomi Heimonen, Matti Luhtala, and Markku Turunen. 2014b. Information wall: evaluation of a gesture-controlled public display. In Proceedings of the 13th International Conference on Mobile and Ubiquitous Multimedia (MUM '14). ACM, ACM, New York, NY, USA, 228--231. DOI: http://dx.doi.org/10.1145/2677972.2677998","paperID":"None"},{"content":"Ville Makela, Tomi Heimonen, and Markku Turunen. 2014a. Magnetic Cursor: Improving Target Selection in Freehand Pointing Interfaces. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14). ACM, New York, NY, USA, 112:112--112:117. DOI:http://dx.doi.org/10.1145/2611009.2611025","paperID":"None"},{"content":"Robert W Mitchell. 1993. Mental models of mirror-self-recognition: Two theories. New Ideas in Psychology 11, 3 (1993), 295--325. DOI: http://dx.doi.org/10.1016/0732--118X(93)90002-U","paperID":"None"},{"content":"Jorg Muller, Dieter Eberle, and Konrad Tollmar. 2014. Communiplay: a field study of a public display mediaspace. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14. ACM, 1415--1424. DOI: http://dx.doi.org/10.1145/2556288.2557001","paperID":"None"},{"content":"Jorg Muller, Robert Walter, Gilles Bailly, Michael Nischt, and Florian Alt. 2012. Looking Glass: A Field Study on Noticing Interactivity of a Shop Window. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 297--306. DOI: http://dx.doi.org/10.1145/2207676.2207718","paperID":"None"},{"content":"Gonzalo Parra, Robin De Croon, Joris Klerkx, and Erik Duval. 2014. Quantifying the Interaction Stages of a Public Display Campaign in the Wild. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, New York, NY, USA, 757--760. DOI: http://dx.doi.org/10.1145/2639189.2639216","paperID":"None"},{"content":"Garth Shoemaker, Anthony Tang, and Kellogg S Booth. 2007. Shadow Reaching: A New Perspective on Interaction for Large Displays. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, New York, NY, USA, 53--56. DOI: http://dx.doi.org/10.1145/1294211.1294221","paperID":"None"},{"content":"Maurice Ten Koppel, Gilles Bailly, Jorg Muller, and Robert Walter. 2012. Chained displays: Configurations of Public Displays Can Be Used to Influence Actor-, Audience-, and Passer-By Behavior. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12 (CHI '12). ACM Press, New York, New York, USA, 317. DOI: http://dx.doi.org/10.1145/2207676.2207720","paperID":"None"},{"content":"Martin Tomitsch, Christopher Ackad, Oliver Dawson, Luke Hespanhol, and Judy Kay. 2014. Who Cares About the Content? An Analysis of Playful Behaviour at a Public Display. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14). ACM, ACM, New York, NY, USA, 160--165. DOI: http://dx.doi.org/10.1145/2611009.2611016","paperID":"None"},{"content":"Nina Valkanova, Robert Walter, Andrew Vande Moere, and Jorg Muller. 2014. MyPosition: sparking civic discourse by a public interactive poll visualization. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14. ACM, 1323--1332. DOI: http://dx.doi.org/10.1145/2531602.2531639","paperID":"None"},{"content":"Robert Walter, Gilles Bailly, and Jorg Muller. 2013. StrikeAPose: Revealing Mid-air Gestures on Public Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 841--850. DOI: http://dx.doi.org/10.1145/2470654.2470774","paperID":"None"},{"content":"Robert Walter, Gilles Bailly, Nina Valkanova, and Jorg Muller. 2014. Cuenesics: using mid-air gestures to select items on interactive public displays. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services - MobileHCI '14. ACM, 299--308. DOI: http://dx.doi.org/10.1145/2628363.2628368","paperID":"None"},{"content":"Robert Walter, Andreas Bulling, David Lindlbauer, Martin Schuessler, and Jorg Muller. 2015. Analyzing Visual Attention During Whole Body Interaction with Public Displays. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 1263--1267. DOI: http://dx.doi.org/10.1145/2750858.2804255","paperID":"None"}],"abstract":"Mid-air gestures offer a promising way to interact with large public displays. User representations are important to attract people to such displays, convey interactivity and provide meaningful gesture feedback. We evaluated two forms of user representation, an abstract skeleton and a silhouette, at a large public information display. Results from 56 days, with 190 sessions involving 483 detected people, indicate the silhouette attracted more passers-by to interact and, of these, more engaged in serious browsing interactions. By contrast, the skeleton representation had more playful interactions. Our work contributes to the understanding of the implications of these choices of user representation.","title":"Skeletons and Silhouettes: Comparing User Representations at a Gesture-based Large Display","filename":"CHI16/p2343","authors":["Christopher Ackad","Martin Tomitsch","Judy Kay"],"conference":"CHI '16"}