{"paperId":2858472,"citation":[],"reference":[{"content":"Steve Benford, Andy Crabtree, Stuart Reeves, Jennifer Sheridan, Alan Dix, Martin Flintham, and Adam Drozd. 2006. The Frame of the Game: Blurring the Boundary between Fiction and Reality in Mobile Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (Eds.). ACM, NY, NY, USA, 427--436.","paperID":"None"},{"content":"Andrew Boucher and William Gaver. 2006. Developing the Drift Table. interactions 13, 1 (January 2006), 24--27.","paperID":"None"},{"content":"Lawrence Busch. \"Big Data, Big Questions| A Dozen Ways to Get Lost in Translation: Inherent Challenges in Large Scale Data Sets.\" International Journal of Communication 8 (2014): 18.","paperID":"None"},{"content":"John M. Carroll and Mary Beth Rosson. 2013. Wild at Home: The Neighborhood as a Living Laboratory for HCI. ACM Trans. Comput.-Hum. Interact. 20, 3, Article 16 (July 2013), 28 pages.","paperID":"None"},{"content":"Carl DiSalvo. 2009. Design and the Construction of Publics. Design Issues, 25(1), 48--63.","paperID":"None"},{"content":"Carl DiSalvo 2012. Adversarial design. Cambridge, Mass.: MIT Press.","paperID":"None"},{"content":"William Gaver. 2007. Cultural commentators: Nonnative interpretations as resources for polyphonic assessment. International journal of human-computer studies 65.4, 292--305.","paperID":"None"},{"content":"William Gaver, John Bowers, Kirsten Boehner, Andy Boucher, David W.T. Cameron, Mark Hauenstein, Nadine Jarvis, and Sarah Pennington. 2013. Indoor weather stations: investigating a ludic approach to environmental HCI through batch prototyping. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3451--3460.","paperID":"None"},{"content":"William Gaver, Mike Michael, Tobie Kerridge, Alex Wilkie, Andy Boucher, Liliana Ovalle, and Matthew Plummer-Fernandez. 2015. Energy Babble: Mixing Environmentally-Oriented Internet Content to Engage Community Groups. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 11151124.","paperID":"None"},{"content":"Clifford Geertz. 1973. Thick Description: Toward an Interpretive Theory of Culture. In The Interpretation of Cultures: Selected Essays, 3--30.","paperID":"None"},{"content":"Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007. The three paradigms of HCI. Alt. Chi. Session at the SIGCHI Conference on Human Factors in Computing Systems San Jose, California, USA.","paperID":"None"},{"content":"Interaction Research Studio. 2015. Datacatcher video collection. Retrieved 7 January 2016 from http://vimeo.com/channels/datacatcher.","paperID":"None"},{"content":"Sarah Ljungblad. 2008. Beyond Users: Grounding Technology in Experience. PhD Thesis, Stockholm University.","paperID":"None"},{"content":"James Pierce and Eric Paulos. 2015. Making Multiple Uses of the Obscura 1C Digital Camera: Reflecting on the Design, Production, Packaging and Distribution of a Counter-functional Device. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2103--2112.","paperID":"None"},{"content":"Bas Raijmakers, William W. Gaver, and Jon Bishay. 2006. Design documentaries: inspiring design research through documentary film. In Proceedings of the 6th conference on Designing Interactive systems (DIS '06). ACM, NY, NY, USA, 229--238.","paperID":"None"},{"content":"Tim Regan, David Sweeney, John Helmes, Vasillis Vlachokyriakos, Siân Lindley, and Alex Taylor. 2015. Designing Engaging Data in Communities. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 271--274.","paperID":"None"},{"content":"Schön DA. The reflective practitioner: How professionals think in action. Basic books; 1983.","paperID":"None"},{"content":"Phoebe Sengers and Bill Gaver. 2006. Staying open to interpretation: engaging multiple meanings in design and evaluation. In Proceedings of the 6th conference on Designing Interactive systems (DIS '06). ACM, NY, NY, USA, 99--108.","paperID":"None"},{"content":"Nick Taylor, Keith Cheverst, Peter Wright, and Patrick Olivier. 2013. Leaving the wild: lessons from community technology handovers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1549--1558.","paperID":"None"},{"content":"Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-Place: Thinking through the Relations Between Data and Community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2863--2872.","paperID":"None"},{"content":"Ken Wood, Rowanne Fleck, and Lyndsay Williams. Playing with SenseCam. Proc. Playing with Sensors (W3) at UbiComp 2004 (2004).","paperID":"None"}],"abstract":"This paper reports the results of a field trial of 130 bespoke devices as well as our methodological approach to the undertaking. Datacatchers are custom-built, location-aware devices that stream messages about the area they are in. Derived from a large number of 'big data' sources, the messages simultaneously draw attention to the socio-political topology of the lived environment and to the nature of big data itself. We used a service design consultancy to deploy the devices, and two teams of documentary filmmakers to capture participants' experiences. Here we discuss the development of this approach and how people responded to the Datacatchers as products, as revealing sociopolitical issues, and as purveyors of big data that might be open to question.","title":"The Datacatcher: Batch Deployment and Documentation of 130 Location-Aware, Mobile Devices That Put Sociopolitically-Relevant Big Data in People's Hands: Polyphonic Interpretation at Scale","filename":"CHI16/p1597","authors":["William Gaver","Andy Boucher","Nadine Jarvis","David Cameron","Mark Hauenstein","Sarah Pennington","John Bowers","James Pike","Robin Beitra","Liliana Ovalle"],"conference":"CHI '16"}