{"paperId":2858083,"citation":[],"reference":[{"content":"Robert Ball, Chris North, and Doug A. Bowman. 2007. Move to Improve: Promoting Physical Navigation to Increase User Performance with Large Displays. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 191-200. http://doi.org/10.1145/1240624.1240656","paperID":"None"},{"content":"Amartya Banerjee, Jesse Burstyn, Audrey Girouard, and Roel Vertegaal. 2012. MultiPoint: Comparing laser and manual pointing as remote input in large display interactions. International Journal of HumanComputer Studies 70, 10: 690-702. http://doi.org/10.1016/j.ijhcs.2012.05.009","paperID":"None"},{"content":"Patrick Baudisch and Ruth Rosenholtz. 2003. Halo: A Technique for Visualizing Off-screen Objects. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 481-488. http://doi.org/10.1145/642611.642695","paperID":"None"},{"content":"Sebastian Boring, Dominikus Baur, Andreas Butz, Sean Gustafson, and Patrick Baudisch. 2010. Touch Projector: Mobile Interaction Through Video. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2287-2296. http://doi.org/10.1145/1753326.1753671","paperID":"None"},{"content":"Florian van de Camp, Alexander Schick, and Rainer Stiefelhagen. 2013. How to Click in Mid-Air. In Distributed, Ambient, and Pervasive Interactions, Norbert Streitz and Constantine Stephanidis (eds.). Springer Berlin Heidelberg, 78-86. http://link.springer.com/chapter/10.1007/978-3-64239351-8_9","paperID":"None"},{"content":"Andy Cockburn, Amy Karlson, and Benjamin B. Bederson. 2009. A Review of Overview+Detail, Zooming, and Focus+Context Interfaces. ACM Comput. Surv. 41, 1: 2:1-2:31. http://doi.org/10.1145/1456650.1456652","paperID":"None"},{"content":"Andy Cockburn, Philip Quinn, Carl Gutwin, Gonzalo Ramos, and Julian Looser. 2011. Air pointing: Design and evaluation of spatial target acquisition with and without visual feedback. Int. J. Hum.-Comput. Stud. 69, 6: 401-414. http://doi.org/10.1016/j.ijhcs.2011.02.005","paperID":"None"},{"content":"Maxime Collomb, Mountaz Hascoët, Patrick Baudisch, and Brian Lee. 2005. Improving Drag-and-drop on Wall-size Displays. Proceedings of Graphics Interface 2005, Canadian Human-Computer Communications Society, 25-32. http://dl.acm.org/citation.cfm?id=1089508.1089514","paperID":"None"},{"content":"Barrett Ens, David Ahlström, Andy Cockburn, and Pourang Irani. 2011. Characterizing User Performance with Assisted Direct Off-screen Pointing. Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services, ACM, 485-494. http://doi.org/10.1145/2037373.2037445","paperID":"None"},{"content":"Clifton Forlines, Daniel Vogel, and Ravin Balakrishnan. 2006. HybridPointing: Fluid Switching Between Absolute and Relative Pointing with a Direct Input Device. Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology, ACM, 211-220. http://doi.org/10.1145/1166253.1166286","paperID":"None"},{"content":"George A. Gescheider. Psychophysics: The Fundamentals. Lawrence Erlbaum Associates, Publishers.","paperID":"None"},{"content":"Sean Gustafson, Patrick Baudisch, Carl Gutwin, and Pourang Irani. 2008. Wedge: Clutter-free Visualization of Off-screen Locations. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 787-796. http://doi.org/10.1145/1357054.1357179","paperID":"None"},{"content":"Khalad Hasan, David Ahlström, and Pourang Irani. 2013. Ad-binning: Leveraging Around Device Space for Storing, Browsing and Retrieving Mobile Device Content. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 899- 908. http://doi.org/10.1145/2470654.2466115","paperID":"None"},{"content":"Khalad Hasan, David Ahlström, and Pourang P. Irani. 2015. Comparing Direct Off-Screen Pointing, Peephole, and Flick & Pinch Interaction for Map Navigation. Proceedings of the 3rd ACM Symposium on Spatial User Interaction, ACM, 99-102. http://doi.org/10.1145/2788940.2788957","paperID":"None"},{"content":"Pourang Irani, Carl Gutwin, Grant Partridge, and Mahtab Nezhadasl. 2007. Techniques for Interacting with Off-Screen Content. In Human-Computer Interaction - INTERACT 2007, Cécilia Baranauskas, Philippe Palanque, Julio Abascal and Simone Diniz Junqueira Barbosa (eds.). Springer Berlin Heidelberg, 234-249. http://link.springer.com/chapter/10.1007/978-3-54074800-7_19","paperID":"None"},{"content":"Pourang Irani, Carl Gutwin, and Xing Dong Yang. 2006. Improving Selection of Off-screen Targets with Hopping. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 299- 308. http://doi.org/10.1145/1124772.1124818","paperID":"None"},{"content":"Mikkel R. Jakobsen and Kasper Hornb","paperID":"None"},{"content":"a ek. 2015. Is Moving Improving?: Some Effects of Locomotion in Wall-Display Interaction. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 4169-4178. http://doi.org/10.1145/2702123.2702312","paperID":"None"},{"content":"18. Yvonne Jansen, Pierre Dragicevic, and Jean-Daniel Fekete. 2012. Tangible Remote Controllers for Wallsize Displays. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2865-2874. http://doi.org/10.1145/2207676.2208691","paperID":"None"},{"content":"19. Brett Jones, Rajinder Sodhi, David Forsyth, Brian Bailey, and Giuliano Maciocci. 2012. Around Device Interaction for Multiscale Navigation. Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services, ACM, 83- 92. http://doi.org/10.1145/2371574.2371589","paperID":"None"},{"content":"20. Ricardo Jota, Miguel A. Nacenta, Joaquim A. Jorge, Sheelagh Carpendale, and Saul Greenberg. 2010. A comparison of ray pointing techniques for very large displays. Proceedings of Graphics Interface 2010, Canadian Information Processing Society, 269-276. http://dl.acm.org/citation.cfm?id=1839214.1839261","paperID":"None"},{"content":"21. Azam Khan, George Fitzmaurice, Don Almeida, Nicolas Burtnyk, and Gordon Kurtenbach. 2004. A Remote Control Interface for Large Displays. Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology, ACM, 127-136. http://doi.org/10.1145/1029632.1029655","paperID":"None"},{"content":"22. Regis Kopper, Doug A. Bowman, Mara G. Silva, and Ryan P. McMahan. 2010. A Human Motor Behavior Model for Distal Pointing Tasks. Int. J. Hum.-Comput. Stud. 68, 10: 603-615. http://doi.org/10.1016/j.ijhcs.2010.05.001","paperID":"None"},{"content":"23. Frank Chun Yat Li, David Dearman, and Khai N. Truong. 2009. Virtual Shelves: Interactions with Orientation Aware Devices. Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology, ACM, 125-128. http://doi.org/10.1145/1622176.1622200","paperID":"None"},{"content":"24. Sven Mayer, Katrin Wolf, Stefan Schneegass, and Niels Henze. 2015. Modeling Distant Pointing for Compensating Systematic Displacements. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 4165-4168. http://doi.org/10.1145/2702123.2702332","paperID":"None"},{"content":"25. David C. McCallum and Pourang Irani. 2009. ARCPad: Absolute+Relative Cursor Positioning for Large Displays with a Mobile Touchscreen. Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology, ACM, 153-156. http://doi.org/10.1145/1622176.1622205","paperID":"None"},{"content":"26. Miguel A. Nacenta, Dzmitry Aliakseyeu, Sriram Subramanian, and Carl Gutwin. 2005. A Comparison of Techniques for Multi-display Reaching. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 371-380. http://doi.org/10.1145/1054972.1055024","paperID":"None"},{"content":"27. Mathieu Nancel, Olivier Chapuis, Emmanuel Pietriga, Xing-Dong Yang, Pourang P. Irani, and Michel Beaudouin-Lafon. 2013. High-precision Pointing on Large Wall Displays Using Small Handheld Devices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 831-840. http://doi.org/10.1145/2470654.2470773","paperID":"None"},{"content":"28. Mathieu Nancel, Emmanuel Pietriga, Olivier Chapuis, and Michel Beaudouin-Lafon. 2015. Mid-Air Pointing on Ultra-Walls. ACM Trans. Comput.-Hum. Interact. 22, 5: 21:1-21:62. http://doi.org/10.1145/2766448","paperID":"None"},{"content":"29. Mathieu Nancel, Julie Wagner, Emmanuel Pietriga, Olivier Chapuis, and Wendy Mackay. 2011. Mid-air Pan-and-zoom on Wall-sized Displays. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 177-186. http://doi.org/10.1145/1978942.1978969","paperID":"None"},{"content":"30. J. W. French R. B. Ekstrom. 1976. Kit of FactorReferenced Cognitive Tests.","paperID":"None"},{"content":"31. George Robertson, Mary Czerwinski, Patrick Baudisch, et al. 2005. The Large-Display User Experience. IEEE Comput. Graph. Appl. 25, 4: 44-51. http://doi.org/10.1109/MCG.2005.88","paperID":"None"},{"content":"32. Richard Stoakley, Matthew J. Conway, and Randy Pausch. 1995. Virtual Reality on a WIM: Interactive Worlds in Miniature. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM Press/Addison-Wesley Publishing Co., 265-272. http://doi.org/10.1145/223904.223938","paperID":"None"},{"content":"33. Kazuki Takashima, Nana Shinshi, and Yoshifumi Kitamura. 2015. Exploring Boundless Scroll by Extending Motor Space. Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, ACM, 557-566. http://doi.org/10.1145/2785830.2785884","paperID":"None"},{"content":"34. Daniel Vogel and Ravin Balakrishnan. 2005. Distant freehand pointing and clicking on very large, high resolution displays. Proceedings of the 18th annual ACM symposium on User interface software and technology, ACM, 33-42. http://doi.org/10.1145/1095034.1095041","paperID":"None"},{"content":"35. Ka-Ping Yee. 2003. Peephole Displays: Pen Interaction on Spatially Aware Handheld Computers. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1-8. http://doi.org/10.1145/642611.642613","paperID":"None"},{"content":"36. Polle T. Zellweger, Jock D. Mackinlay, Lance Good, Mark Stefik, and Patrick Baudisch. 2003. City Lights: Contextual Views in Minimal Space. CHI '03 Extended Abstracts on Human Factors in Computing Systems, ACM, 838-839. http://doi.org/10.1145/765891.766022","paperID":"None"}],"abstract":"The size of information spaces often exceeds the limits of even the largest displays. This makes navigating such spaces through on-screen interactions demanding. However, if users imagine the information space extending in a plane beyond the display's boundaries, they might be able to use the space beyond the display for input. This paper investigates Off-Limits, an interaction concept extending the input space of a large display into the space beyond the screen through the use of mid-air pointing. We develop and evaluate the concept through three empirical studies in one-dimensional space: First, we explore benefits and limitations of off-screen pointing compared to touch interaction and mid-air on-screen pointing; next, we assess users' accuracy in off-screen pointing to model the distance-to-screen vs. accuracy trade-off; and finally, we show how Off-Limits is further improved by applying that model to the naïve approach. Overall, we found that the final Off-Limits concept provides significant performance benefits over on-screen and touch pointing conditions.","title":"Off-Limits: Interacting Beyond the Boundaries of Large Displays","filename":"CHI16/p5862","authors":["Anders Markussen","Sebastian Boring","Mikkel R. Jakobsen","Kasper Hornbæk"],"conference":"CHI '16"}