{"paperId":2858105,"abstract":"ThoughtCloud is a lightweight, situated, digital feedback system designed to allow voluntary and community sector care organisations to gather feedback and opinions from those who use their services. In this paper we describe the design and development of ThoughtCloud and its evaluation through a series of deployments with two organisations. Using the system, organisations were able to pose questions about the activities that they provide and gather data in the form of ratings, video or audio messages. We conducted observations of ThoughtCloud in use, analysed feedback received, and conducted interviews with those who 'commissioned' feedback around the value of comments received about their organisation. Our findings highlight how simple, easily deployable digital systems can support new feedback processes within care organisations and provide opportunities for understanding the personal journeys and experiences of vulnerable individuals who use these care services.","citation":[],"reference":[{"content":"Carmelo Ardito, Paolo Buono, Maria Francesca Costabile, and Aldo Moro. 2015. Interaction with Large Displays : A Survey. ACM Computing Surveys 47, 3: 1- 38. http://doi.org/10.1145/2682623","paperID":"None"},{"content":"Marian Barnes and Phil Cotterell. 2011. Critical perspectives on user involvement. The Policy Press.","paperID":"None"},{"content":"Chris Bell, John Nash, and Lindsey Thomas. 2010. Social care in England - a brief history. Retrieved September 11, 2015 from http://southwest.skillsforcare.org.uk/+nCaring","paperID":"None"},{"content":"Tim Booth and Wendy Booth. 1996. Sounds of Silence: Narrative research with inarticulate subjects. Disability & Society 11, 1: 55-70. http://doi.org/10.1080/09687599650023326","paperID":"None"},{"content":"Alan Branthwaite and Simon Patterson. 2011. The power of qualitative research in the era of social media. Qualitative Market Research: An International Journal 14, 4: 430-440. http://doi.org/10.1108/13522751111163245","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77-101. http://doi.org/10.1191/1478088706qp063oa","paperID":"None"},{"content":"Paul Breckell, Kate Harrison, and Nicola Robert. Impact Reporting in the UK Charity Sector. Retrieved August 24, 2015 from http://www.cfg.org.uk/resources/~/media/Files/Resources/ImpactReportingintheUKCharitySector.ashx","paperID":"None"},{"content":"Harry Brignull and Yvonne Rogers. 2003. Enticing people to interact with large public displays in public spaces. In Proceedings of INTERACT, 17-24. http://doi.org/10.1.1.12603","paperID":"None"},{"content":"Phil Brooker, John Vines, Selina Sutton, Julie Barnett, Tom Feltwell, and Shaun Lawson. 2015. Debating Poverty Porn on Twitter : Social Media as a Place for Everyday Socio - Political Talk. Proceedings of CHI '15, 3177-3186. http://doi.org/1145/2702123.2702291","paperID":"None"},{"content":"Barry Brown. 2012. Beyond Recommendations. ACM Transactions on Computer-Human Interaction 19, 4: 1- 24. http://doi.org/10.1145/2395131.2395134","paperID":"None"},{"content":"Care Quality Commission. 2013. RAISE building partnerships between CQC and voluntary & community sector organisations in the South East Summary of key points : Retrieved September 20, 2015 from http://www.regionalvoices.org/sites/default/files/library/FinalReportonCQCFocusGroupSummaryversionRAISE.pdf","paperID":"None"},{"content":"Yngve Dahl and Kristine Holbø. 2012. \"There are no secrets here!\": professional stakeholders' views on the use of GPS for tracking dementia patients. Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services MobileHCI '12, 7465: 133-142. http://doi.org/10.1145/2371574.2371595","paperID":"None"},{"content":"Phil Edwards. 2002. Increasing response rates to postal questionnaires: systematic review. BMJ 324, 7347: 1183-1183. http://doi.org/10.1136/bmj.324.7347.1183","paperID":"None"},{"content":"Jo Fischl and Joe Saxton. 2014. Getting the Message Across Practical strategies to tackle public concerns about donating to charity. Retrieved August 24, 2015 from http://nfpsynergy.net/free-report/getting-messageacross-practical-strategies-tackle-public-concernsabout-donating","paperID":"None"},{"content":"Tony Gilbert. 2004. Involving people with learning disabilities in research: Issues and possibilities. Health and Social Care in the Community 12, 4: 298-308. http://doi.org/10.1111/j.1365--2524.2004.00499.x","paperID":"None"},{"content":"Connie Golsteijn, Sarah Gallacher, Lisa Koeman, et al. 2015. VoxBox : a Tangible Machine that Gathers Opinions from the Public at Events. Proceedings of TEI '15, 201-208. http://doi.org/10.1145/2677199.2680588","paperID":"None"},{"content":"Jorge Goncalves, Richard Harper, and Kenton O Hara. 2015. Life through the Lens : A Qualitative Investigation of Human Behaviour with an Urban Photography Service. In Proceedings of British HCI 2015, 157-164. http://doi.org/10.1145/2783446.2783577","paperID":"None"},{"content":"Jorge Goncalves, Simo Hosio, Yong Liu, and Vassilis Kostakos. 2014. Eliciting situated feedback: A comparison of paper, web forms and public displays. Displays 35, 1: 27-37. http://doi.org/10.1016/j.displa.2013.12.002","paperID":"None"},{"content":"Ian Greener. 2008. Choice and Voice - A Review. Social Policy and Society 7, 02: 255-265. http://doi.org/10.1017/S1474746407004204","paperID":"None"},{"content":"Mike Harding, Bran Knowles, Nigel Davies, and Mark Rouncefield. 2015. HCI, Civic Engagement & Trust. Proceedings of CHI '15, 2833-2842. http://doi.org/10.1145/2702123.2702255","paperID":"None"},{"content":"Department of Health. 2014. Children and Families Act 2014. Queen's Printer of Acts of Parliament. Retrieved July 18, 2015 from http://www.legislation.gov.uk/ukpga/2014/6/contents/enacted","paperID":"None"},{"content":"Department of Health. 2014. Care Act 2014. Queen's Printer of Acts of Parliament. Retrieved September 15, 2015 from http://www.legislation.gov.uk/ukpga/2014/23/enacted","paperID":"None"},{"content":"Jonathan Hook, Rachel Clarke, John Mccarthy, Kate Anderson, Jane Dudman, and Peter Wright. 2015. Making the Invisible Visible : Design to Support the Documentation of Participatory Arts Experiences. Proceedings of CHI 2015, 2583-2592. http://doi.org/10.1145/2702123.2702187","paperID":"None"},{"content":"Hilary Kennedy, Miriam Landor, and Liz Todd. 2011. Video Interaction Guidance: A Relationship-based Intervention to Promote Attunement, Empathy, and Wellbeing. Jessica Kingsley Publishers.","paperID":"None"},{"content":"Lisa Koeman, Vaiva Kalnikaité, and Yvonne Rogers. 2015. \"Everyone Is Talking about It!\": A Distibuted Approach to Urban Voting Technology and Visualisations. Proceedings of CHI '15, 3127-3136. http://doi.org/10.1145/2702123.2702263","paperID":"None"},{"content":"Biza Stenfert Kroese, Alinda Gillott, and Vicky Atkinson. 1998. Consumers with intellectual disabilities as service evaluators. Journal of Applied Research in Intellectual Disabilities 11, 2: 116-128.","paperID":"None"},{"content":"Ann Lewis and Jill Porter. 2004. Interviewing children and young people with learning disabilities: Guidelines for researchers and multi-professional practice. British Journal of Learning Disabilities 32, 4: 191-197. http://doi.org/10.1111/j.1468--3156.2004.00313.x","paperID":"None"},{"content":"Kristen Lovejoy and Gregory D. Saxton. 2012. Information, Community, and Action: How Nonprofit Organizations Use Social Media. Journal of ComputerMediated Communication 17, 3: 337-353. http://doi.org/10.1111/j.1083--6101.2012.01576.x","paperID":"None"},{"content":"Linda Milbourne. 2010. Remodelling the third sector: advancing collaboration or competition in community based initiatives? Journal of Social Policy: 277-297. http://doi.org/10.1017/S0047279408002845","paperID":"None"},{"content":"Timothy Milewa. 2004. Innovation or Fragmentation of a Universal Citizenship? Social Policy and Administration 38, 3: 240-252.","paperID":"None"},{"content":"The National Audit Office. 2014. Adult social care in England : overview. Retrieved September 15, 2015 from http://www.nao.org.uk/wpcontent/uploads/2015/03/Adult-social-care-in-Englandoverview.pdf","paperID":"None"},{"content":"The Children's Partnership. 2015. Social Value and Commissioning Toolkit. Retrieved August 24, 2015 from http://thechildrenspartnershipknowledge.org.uk/media/1089/social-value-andcommissioning-toolkit-final-with-ncb-logos.pdf","paperID":"None"},{"content":"Anthony Patino, Dennis a. Pitta, and Ralph Quinones. 2012. Social media's emerging importance in market research. Journal of Consumer Marketing 29, 3: 233- 237. http://doi.org/10.1108/07363761211221800","paperID":"None"},{"content":"Donna Ambler Peters. 1993. Improving quality requires consumer input: Using focus groups. Journal of Nursing Care Quality. 7, 2: 34-41.","paperID":"None"},{"content":"Tongqing Qiu, J Feng, Z Ge, Jia Wang, J Xu, and J Yates. 2010. Listen to me if you can: tracking user experience of mobile network on social media. Proceedings of IMC '10, 288-293. http://doi.org/10.1145/1879141.1879178","paperID":"None"},{"content":"Nirvi Shah. 2011. Special Education Pupils Find Learning Tool in iPad Applications. Education Week v30, n22, 16--17 Mar 2011.","paperID":"None"},{"content":"Richard Simmons, Martin Powell, and Ian Greener. 2009. The consumer in public services. The Policy Press.","paperID":"None"},{"content":"Alzheimer Society. 2010. My name is not dementia. Retrieved September 20, 2015 from http://www.alzheimers.org.uk/site/scripts/documents_info.php?documentID=1339","paperID":"None"},{"content":"Nick Taylor, Justin Marshall, and Alicia Blum-Ross. 2012. Viewpoint: empowering communities with situated voting devices. Proceedings of CHI '12, 1361- 1370. http://doi.org/10.1145/2207676.2208594","paperID":"None"},{"content":"John Vines, Stephen Lindsay, and Gary W. Pritchard. 2013. Making family care work: dependence, privacy and remote home monitoring telecare systems. Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing, 607 - 616. http://doi.org/10.1145/2493432.2493469","paperID":"None"},{"content":"John Vines, Peter Wright, David Silver, Maggie Winchcombe, and Patrick Olivier. 2015. Authenticity, Relatability and Collaborative Approaches to Sharing Knowledge about Assistive Living Technology. CSCW '15. http://doi.org/10.1145/2675133.2675222","paperID":"None"},{"content":"Vasilis Vlachokyriakos, Rob Comber, Karim Ladha, Nick Taylor, Paul Dunphy, Patrick McCorry, and Patrick Olivier 2014. Poster Vote : Expanding the Action Repertoire for Local Political Activism. Proceedings of DIS '14: 795-804. http://dx.doi.org/10.1145/2598510.2598523","paperID":"None"}],"title":"ThoughtCloud: Exploring the Role of Feedback Technologies in Care Organisations","filename":"CHI16/p3625","authors":["Andy Dow","John Vines","Rob Comber","Rob Wilson"],"conference":"CHI '16"}