{"paperId":2858516,"citation":[],"abstract":"In human-computer interaction research and practice, policy concerns can sometimes fall to the margins, orbiting at the periphery of the traditionally core interests of design and practice. This perspective ignores the important ways that policy is bound up with the technical and behavioral elements of the HCI universe. Policy concerns are triggered as a matter of course in social computing, CSCW, systems engineering, UX, and related contexts because technological design, social practice and policy are dynamically entangled and mutually constitutive. Through this research, we demonstrate the value of a stronger emphasis on policy in HCI by exploring a recent controversy on Reddit: \"AMAgeddon.\" Applying Hirschman's exit, voice and loyalty framework, we argue that the sustainability of online communities like Reddit will require successful navigation of the complex and often murky intersections among technical design and human interaction through a distributed participatory policymaking process that promotes user loyalty.","reference":[{"content":"Paul A. Baran and Robert B. Sutcliffe. The political economy of growth. NY: Monthly Review Press, 1957.","paperID":"None"},{"content":"Benjamin B. Bederson, et al. 2006. Workshop on SIGCHI public policy. CHI'06 Extended Abstracts on Human Factors in Computing Systems. ACM Press, NY, NY,1655--1657. DOI: 10.1145/1125451.1125755.","paperID":"None"},{"content":"Harold Whittle Blakely. 1957. 32d Infantry Division, World War II. Thirty Second Infantry Division History Commission.","paperID":"None"},{"content":"Nathan Bos, Karrie Karahalios, Marcela MusgroveChávez, Erika Shehan Poole, John Charles Thomas, and Sarita Yardi. 2009. Research ethics in the facebook era: privacy, anonymity, and oversight. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, NY, NY. DOI=10.1145/1520340.1520402","paperID":"None"},{"content":"Brian Butler, Elisabeth Joyce, and Jacqueline Pike. 2008. Don't look now, but we've created a bureaucracy: the nature and roles of policies and rules in wikipedia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1101--1110. DOI=10.1145/1357054.1357227.","paperID":"None"},{"content":"Cbc.ca. (2015). Reddit Bans 'Fat People Hate,' Other Subforums Under New Anti-Harassment Policy. (June 2015). Retrieved September 25th from http://www.cbc.ca/news/trending/reddit-bans-fatpeople-hate-other-subforums-under-new-antiharassment-policy-1.3108425.","paperID":"None"},{"content":"Alissa Centivany, \"Policy as Embedded Generativity: A Case Study of HathiTrust,\" forthcoming in Proceedings of Computer-Supported Cooperative Work and Social Computing, 2016 (CSCW '16), San Francisco, CA, Feb. 27-Mar. 2, 2016.","paperID":"None"},{"content":"Alissa Centivany and Bobby Glushko, \"(Shifting) Lines in the Sand: Values, Ethics and Participatory Policymaking in Online Communities,\" manuscript on file with authors.","paperID":"None"},{"content":"Kathi Fisler and Shriram Krishnamurthi. \"A model of triangulating environments for policy authoring.\" Proceedings of the 15th ACM symposium on Access control models and technologies. ACM, 2010.","paperID":"None"},{"content":"David Fitzpatrick and Drew Griffin (2012). Man Behind 'Jailbait' Posts Exposed, Loses Job. (October 2012) Retrieved September 24, 2015 from http://www.cnn.com/2012/10/18/us/internet-trollapology/.","paperID":"None"},{"content":"Forbes.com,. 'Reddit Co-Founder Alexis Ohanian's Rosy Outlook on the Future of Politics., 2012. Web. 24 Sept. 2015.","paperID":"None"},{"content":"Albert Hirschman. 1970. \"Exit, voice and loyalty.\" Cambridge/Mass (1982).","paperID":"None"},{"content":"Harry Hochheiser and Jonathan Lazar. \"HCI and societal issues: A framework for engagement.\" International Journal of Human [# x02013] Computer Interaction 23.3 (2007): 339--374.","paperID":"None"},{"content":"Giovanni Iachello and Jason Hong. \"End-user privacy in human-computer interaction.\" Foundations and Trends in Human-Computer Interaction 1.1 (2007): 1137.","paperID":"None"},{"content":"IAmAMods., 2015. Welcome Back!. Comment. July 3, 2015. Retrieved September 24, 2015 from https://np.reddit.com/r/IAmA/comments/3c0hcz/welco me_back/","paperID":"None"},{"content":"Philip Inglesant and M. Angela Sasse. \"The true cost of unusable password policies: password use in the wild.\" Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2010.","paperID":"None"},{"content":"Steven J. Jackson, Tarleton Gillespie, and Sandy Payette. \"The policy knot: Re-integrating policy, practice and design in CSCW studies of social computing.\" Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 2014.","paperID":"None"},{"content":"Carlos Jensen and Colin Potts. \"Privacy policies as decision-making tools: an evaluation of online privacy notices.\" Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 2004.","paperID":"None"},{"content":"Jeff Johnson. \"CHI 99 SIG: SIGCHI's role in influencing technology policy.\" SIGCHI Bulletin 31.4 (1999): 43.","paperID":"None"},{"content":"Maurits Kaptein, Dean Eckles, and Janet Davis. \"Envisioning persuasion profiles: challenges for public policy and ethical practice.\" interactions 18.5 (2011): 66--69.","paperID":"None"},{"content":"Aniket Kittur, E.H. Chi, B.A. Pendleton, B. Suh, and T. Mytkowicz. \"Power of the few vs. wisdom of the crowd: Wikipedia and the rise of the bourgeoisie.\" World wide web 1.2 (2007): 19.","paperID":"None"},{"content":"Aniket Kittur, B. Suh, B.A. Pendleton, and E.H. Chi. \"He says, she says: conflict and coordination in Wikipedia.\" Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 2007.","paperID":"None"},{"content":"Aniket Kittur, and Robert E. Kraut. \"Harnessing the wisdom of crowds in wikipedia: quality through coordination.\" Proceedings of the 2008 ACM conference on Computer supported cooperative work. ACM, 2008.","paperID":"None"},{"content":"Aniket Kittur, and Robert E. Kraut. \"Beyond Wikipedia: coordination and conflict in online production groups.\" Proceedings of the 2010 ACM conference on Computer supported cooperative work. ACM, 2010.","paperID":"None"},{"content":"Saranga Komanduri, et al. \"Of passwords and people: measuring the effect of password-composition policies.\" Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2011.","paperID":"None"},{"content":"Carl Lagoze, et al. \"Should I Stay or Should I Go? Alternative Infrastructures in Scholarly Publishing.\" International Journal of Communication 9 (2015): 20.","paperID":"None"},{"content":"Jonathan Lazar, Jeff Johnson, and Harry Hochheiser. \"Policy at the interface: HCI and public policy.\" interactions 12.6 (2005): 13--14.","paperID":"None"},{"content":"Wendy E. Mackay. \"Ethics, lies and videotape...\" Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press/Addison-Wesley Publishing Co., 1995.","paperID":"None"},{"content":"Adrienne Massanari. \"# Gamergate and The Fappening: How Reddit's algorithm, governance, and culture support toxic technocultures.\" New Media & Society (2015): 1461444815608807.","paperID":"None"},{"content":"Reddit.com. 2015. Reddit.Com: Content Policy. Retrieved September 24, 2015 from https://www.reddit.com/help/contentpolicy","paperID":"None"},{"content":"Robert W. Reeder, et al. \"Usability challenges in security and privacy policy-authoring interfaces.\" Human-Computer Interaction-INTERACT 2007. Springer Berlin Heidelberg, 2007. 141--155.","paperID":"None"},{"content":"Robert W. Reeder, et al. \"Expandable grids for visualizing and authoring computer security policies.\" Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2008.","paperID":"None"},{"content":"Robert W. Reeder, et al. \"A user study of the expandable grid applied to P3P privacy policy visualization.\" Proceedings of the 7th ACM workshop on Privacy in the electronic society. ACM, 2008.","paperID":"None"},{"content":"Robert W. Reeder, et al. \"More than skin deep: measuring effects of the underlying model on accesscontrol system usability.\" Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2011.","paperID":"None"},{"content":"Aaron Sarkin. (2014). Is Reddit Broken Beyond Repair? (November 2014) Retrieved September 24, 2015 from http://kernelmag.dailydot.com/issuesections/staff-editorials/10749/reddit-broken-beyondrepair/.","paperID":"None"},{"content":"The NY Times. Reddit Removes 5 Groups After Creating Harassment Policy. 2015. Retrieved on September 24, 2015 from http://www.nytimes.com/aponline/2015/06/10/business/ap-us-reddit-subreddit-bans.html?_r=0","paperID":"None"},{"content":"Eran Toch, Norman M. Sadeh, and Jason Hong. \"Generating default privacy policies for online social networks.\" CHI'10 Extended Abstracts on Human Factors in Computing Systems. ACM, 2010.","paperID":"None"},{"content":"/u/annwilsonmusic. 2015. IamA Ann Wilson, lead singer of \"Heart\" AMA!. September 24, 2015. Retrieved September 24th , so15 from https://www.reddit.com/r/IAmA/comments/3m559j/ia ma_ann_wilson_lead_singer_of_heart_ama/","paperID":"None"},{"content":"/u/BadCompSciMod. 2015. AMA REQUEST: /u/spez . Comment. August 3, 2015. Retrieved September 24, 2015 from https://np.reddit.com/r/circlebroke/comments/3fntzu/a ma_request_uspez/ctqdxdu","paperID":"None"},{"content":"/u/bluepinkblack. 2015. Ask an Admin, Vol 6\" On AMAgeddon, Blackout 2015, etc. Comment. September 5, 2015. Retrieved September 24, 2015 from https://www.reddit.com/r/Upvoted/comments/3jn7e9/ask_an_admin_vol_6_on_amageddon_blackout_2015_etc/cuqnfvo","paperID":"None"},{"content":"/u/GamerGateFan. 2015. Ask an Admin, Vol 6\" On AMAgeddon, Blackout 2015, etc. Comment. September 5, 2015. Retrieved September 24, 2015 from https://www.reddit.com/r/Upvoted/comments/3jn7e9/ask_an_admin_vol_6_on_amageddon_blackout_2015_etc/cuqnfvo","paperID":"None"},{"content":"/u/HistoryOfGamerHatred. June 14, 2015. Retrieved September 24, 2015 from https://np.reddit.com/r/KotakuInAction/comments/39sdy3/do_you_know_why_reddit_banned_you_from/","paperID":"None"},{"content":"/u/ipissoffthesystem. 2015. I need to get off reddit. Original comment. June 18, 2014. Retrieved September 24, 2015, from https://www.reddit.com/r/teenagers/comments/28h62s/i_need_to_get_off_reddit_other/","paperID":"None"},{"content":"/u/Isanion. 2015. /r/modclub AMAgeddon discussion thread. Comment. July 2 2015. Retrieved September 24, 2015 from https://www.reddit.com/r/modclub/comments/3bypwq/rmodclub_amageddon_discussion_thread/csqupsf","paperID":"None"},{"content":"/u/karmanaut. 2015. Why has R/Iama been set to private?. Comment. July 2, 2015. Retrieved September 24, 2015 from https://np.reddit.com/r/OutOfTheLoop/comments/3bw39q/why_has_riama_been_set_to_private/csq204d","paperID":"None"},{"content":"/u/kentnasty. 2015. The frogs in my neighborhood help to fight against the spider population. Apparently, the spiders are fighting back. September 24, 2015. Retrieved September 24, 2015 from https://www.reddit.com/r/WTF/comments/3m5i2y/the_frogs_in_my_neighborhood_help_to_fight/","paperID":"None"},{"content":"/u/kn0thing,. 2015. IAmA set to private over mod firing. Comment. July 2, 2015. Retrieved September 24, 2015 from https://np.reddit.com/r/SubredditDrama/comments/3bw gjf/riama_set_to_private_over_mod_firing/csqg24d?context=3","paperID":"None"},{"content":"/u/mada447. 2015. TIL that George Hotz, then 17 years old, was the first to unlock a first generation iPhone and sold the iPhone for a Nissan 350z and 3 locked iPhones. September 24, 2015. Retrieved September 24, 2015 from https://www.reddit.com/r/todayilearned/comments/3m5 81q/","paperID":"None"},{"content":"/u/Mercury. 2015. Content Policy update. AMA Thursday, July 16th, 1pm pst. Comment. July 14, 2015 Retrieved September 24, 2015 from https://www.reddit.com/r/announcements/comments/3dautm/content_policy_update_ama_thursday_july_16th_1pm/ct3pvim","paperID":"None"},{"content":"/u/MiddlemanOMT. 2015. The Great Migration to Voat begins!. Comment. August 5, 2015. Retrieved September 24, 2015 from https://np.reddit.com/r/Voat/comments/3fx7zc/the_great_migration_to_voat_begins/","paperID":"None"},{"content":"/u/mrmojorisingi. 2015. Why has R/Iama been set to private?. Comment. July 2, 2015. Retrieved September 24, 2015 from https://np.reddit.com/r/OutOfTheLoop/comments/3bw 39q/why_has_riama_been_set_to_private/csq730w?context=1","paperID":"None"},{"content":"/u/nallen. 2015. Why has R/Iama been set to private. Comment. July 2, 2015. Retrieved September 24, 2015 from https://www.reddit.com/r/OutOfTheLoop/comments/3bw39q/why_has_riama_been_set_to_private/csq3hdm","paperID":"None"},{"content":"/u/Oxus007. 2015. Admin Chooter, aka \"Victoria\" has been let go from Reddit, IAMA goes private as a result. Comment. July 2, 2015. Retrieved September 24, 2015, from https://www.reddit.com/r/Drama/comments/3bw66c/admin_chooter_aka_victoria_has_been_let_go_from/.","paperID":"None"},{"content":"/u/STEAM_0--1--203796. 2015. So long, farewell, auf Wiedersehen, good night!. Comment. July 30, 2015. Retrieved September 24, 2015 from https://www.reddit.com/r/announcements/comments/3f6kqy/so_long_farewell_auf_wiedersehen_good_night/c tlt547","paperID":"None"},{"content":"/u/whynotanon., 2015. Why has R/Iama been set to private?. Comment. July 2, 2015. Retrieved September 24, 2015 from https://np.reddit.com/r/OutOfTheLoop/comments/3bw39q/why_has_riama_been_set_to_private/csq4tl3","paperID":"None"},{"content":"/u/yishan. 2015. Kn0thing says he was responsible for the change in AMAs (i.e. he got Victoria fired). Is there any evidence that Ellen Pao caused the alleged firing of Victoria?. Comment. July 12, 2015. Retrieved September 24, 2015 from https://np.reddit.com/r/TheoryOfReddit/comments/3d2hv3/kn0thing_says_he_was_responsible_for_the_change/ct1fsoi?context=3","paperID":"None"},{"content":"Thorstein Veblen. 1914. The Instinct of Workmanship: And the State of Industrial Arts. Macmillan.","paperID":"None"},{"content":"Fernanda B. Viégas, Martin Wattenberg, and Kushal Dave. \"Studying cooperation and conflict between authors with history flow visualizations.\"Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 2004.","paperID":"None"},{"content":"Eric von Hippel. 1986. \"Lead Users: A Source of Novel Product Concepts,\" Management Science 32, no. 7 (July):791--805.","paperID":"None"},{"content":"Jason Watson, Michael Whitney, and Heather Richter Lipford. \"Configuring audience-oriented privacy policies.\" Proceedings of the 2nd ACM workshop on Assurable and usable security configuration. ACM, 2009.","paperID":"None"}],"title":"\"Popcorn Tastes Good\": Participatory Policymaking and Reddit's","filename":"CHI16/p1126","authors":["Alissa Centivany","Bobby Glushko"],"conference":"CHI '16"}