{"paperId":2858357,"citation":[],"abstract":"Mealtimes are a cherished part of everyday life around the world. Often centered on family, friends, or special occasions, sharing meals is a practice embedded with traditions and values. However, as mobile phone adoption becomes increasingly pervasive, tensions emerge about how appropriate it is to use personal devices while sharing a meal with others. Furthermore, while personal devices have been designed to support awareness for the individual user (e.g., notifications), little is known about how to support shared awareness in acceptability in social settings such as meals. In order to understand attitudes about mobile phone use during shared mealtimes, we conducted an online survey with 1,163 English-speaking participants. We find that attitudes about mobile phone use at meals differ depending on the particular phone activity and on who at the meal is engaged in that activity, children versus adults. We also show that three major factors impact participants' attitudes: 1) their own mobile phone use; 2) their age; and 3) whether a child is present at the meal. We discuss the potential for incorporating social awareness features into mobile phone systems to ease tensions around conflicting mealtime behaviors and attitudes.","reference":[{"content":"Mark S. Ackerman and Brian Starr. 1995. Social Activity Indicators: Interface Components for CSCW Systems. Proc. UIST 1995, ACM Press (1995), 159--168.","paperID":"None"},{"content":"Amanda Lenhart. 2012. Teens, Smartphones & Texting. Pew Research Center's Internet & American Life Project. Retrieved May 19, 2015 from http://www.pewinternet.org/2012/03/19/teenssmartphones-texting/","paperID":"None"},{"content":"Lenhart Amanda. 2015. Teens, Social Media & Technology Overview 2015. Pew Research Center's Internet & American Life Project. Retrieved May 19, 2015 from http://www.pewinternet.org/2015/04/09/teens-socialmedia-technology-2015/","paperID":"None"},{"content":"Paul M. Aoki and Allison Woodruff. 2005. Making Space for Stories: Ambiguity in the Design of Personal Communication Systems. Proc. CHI 2005, ACM Press (2005), 181--190.","paperID":"None"},{"content":"Michael Bittman, Judith E. Brown, and Judy Wajcman. 2009. The mobile phone, perpetual contact and time pressure. Work, Employment & Society 23, 4: 673--691.","paperID":"None"},{"content":"Shoshana Blum-Kulka. 2012. Dinner Talk: Cultural Patterns of Sociability and Socialization in Family Discourse. Routledge.","paperID":"None"},{"content":"Brandon Brown, Marshini Chetty, Andrea Grimes, and Ellie Harmon. 2006. Reflecting on Health: A System for Students to Monitor Diet and Exercise. Ext. Abstracts CHI 2006, ACM Press (2006), 1807--1812.","paperID":"None"},{"content":"Jeffrey M. Brunstrom and Gemma L. Mitchell. 2006. Effects of distraction on the development of satiety. The British Journal of Nutrition 96, 4: 761--769.","paperID":"None"},{"content":"Scott Campbell. 2008. Perceptions of Mobile Phone Use in Public: The Roles of Individualism, Collectivism, and Focus of the Setting. Communication Reports 21, 2: 70--81.","paperID":"None"},{"content":"Scott W. Campbell. 2006. Perceptions of Mobile Phones in College Classrooms: Ringing, Cheating, and Classroom Policies. Communication Education 55, 3: 280--294.","paperID":"None"},{"content":"Scott W. Campbell. 2007. A cross-cultural comparison of perceptions and uses of mobile telephony. New Media & Society 9, 2: 343--363.","paperID":"None"},{"content":"Scott W. Campbell and Yong Jin Park. 2008. Social Implications of Mobile Telephony: The Rise of Personal Communication Society. Sociology Compass 2, 2: 371--387.","paperID":"None"},{"content":"Pei-yu Chi, Jen-hao Chen, Hao-hua Chu, and Bing-Yu Chen. 2007. Enabling Nutrition-aware Cooking in a Smart Kitchen. Ext. Abstracts CHI 2007, ACM Press (2007), 2333--2338.","paperID":"None"},{"content":"K. A. Coon, J. Goldberg, B. L. Rogers, and K. L. Tucker. 2001. Relationships between use of television during meals and children's food consumption patterns. Pediatrics 107, 1: E7.","paperID":"None"},{"content":"Tao Dong, Mark W. Newman, Mark S. Ackerman, and Sarita Schoenebeck. 2015. Supporting Reflection Through Play: Field Testing the Home Trivia System. Proc. UbiComp 2015, ACM Press (2015), 251--262.","paperID":"None"},{"content":"Paul Dourish and Victoria Bellotti. 1992. Awareness and Coordination in Shared Workspaces. Proc. CSCW 1992, ACM Press (1992), 107--114.","paperID":"None"},{"content":"Maeve Duggan. 2013. Cell Phone Activities 2013. Pew Research Center's Internet & American Life Project. Retrieved from http://www.pewinternet.org/2013/09/19/cell-phoneactivities-2013/","paperID":"None"},{"content":"Bruce Feiler. 2010. Should You Google at Dinner?: This Life. The NY Times. Retrieved April 1, 2014 from http://www.nytimes.com/2010/12/12/fashion/12THISLIFE.html","paperID":"None"},{"content":"Hasan Shahid Ferdous. 2015. Technology at Mealtime: Beyond the \"Ordinary.\" Ext. Abstracts CHI 2015, ACM Press (2015), 195--198.","paperID":"None"},{"content":"Barbara H. Fiese and Marlene Schwartz. 2008. Reclaiming the Family Table: Mealtimes and Child Health and Wellbeing. Social Policy Report. Volume 22, Number 4. Society for Research in Child Development. Retrieved May 1, 2015 from http://eric.ed.gov/?id=ED521697","paperID":"None"},{"content":"Barbara H. Fiese, Marcia A. Winter, and Joanna C. Botti. 2011. The ABC's of Family Mealtimes: Observational Lessons for Promoting Healthy Outcomes for Children with Persistent Asthma. Child development 82, 1: 133--145.","paperID":"None"},{"content":"Claude S Fischer. 1994. America Calling: A Social History of the Telephone to 1940. University of California Press, Berkeley, CA.","paperID":"None"},{"content":"Gerhard Fischer. 2001. User Modeling in Human-Computer Interaction. User Modeling and User Adapted Interaction 11, 1--2: 65--86.","paperID":"None"},{"content":"Eileen FitzPatrick, Lynn S. Edmunds, and Barbara A. Dennison. 2007. Positive Effects of Family Dinner Are Undone by Television Viewing. Journal of the American Dietetic Association 107, 4: 666--671.","paperID":"None"},{"content":"Deborah Kirby Forgays, Ira Hyman, and Jessie Schreiber. 2014. Texting everywhere for everything: Gender and age differences in cell phone etiquette and use. Computers in Human Behavior 31: 314--321.","paperID":"None"},{"content":"Jayne A. Fulkerson, Dianne Neumark-Sztainer, and Mary Story. 2006. Adolescent and Parent Views of Family Meals. Journal of the American Dietetic Association 106, 4: 526--532.","paperID":"None"},{"content":"Catherine Grevet, Anthony Tang, and Elizabeth Mynatt. 2012. Eating Alone, Together: New Forms of Commensality. Proc. Group 2012, ACM Press (2012), 103--106.","paperID":"None"},{"content":"Andrea Grimes and Richard Harper. 2008. Celebratory Technology: New Directions for Food Research in HCI. Proc. CHI 2008, ACM Press (2008), 467--476.","paperID":"None"},{"content":"Rebecca E Grinter, Leysia Palen, and Margery Eldridge. 2006. Chatting with teenagers: Considering the place of chat technologies in teen life. 13, 4: 423--447.","paperID":"None"},{"content":"R. E. Grinter and M. Eldridge. 2001. y do tngrs luv 2 txt msg? Proc. ECSCW 2001, ACM Press (2001), 219--238.","paperID":"None"},{"content":"Reiko Hamada, Jun Okabe, Ichiro Ide, Shin'ichi Satoh, Shuichi Sakai, and Hidehiko Tanaka. 2005. Cooking Navi: Assistant for Daily Cooking in Kitchen. Proc. ACM MM 2005, ACM Press (2005), 371--374.","paperID":"None"},{"content":"Alexis Hiniker, Kiley Sobel, Hyewon Suh, Yi-Chen Sung, Charlotte P. Lee, and Julie A. Kientz. 2015. Texting While Parenting: How Adults Use Mobile Phones While Caring for Children at the Playground. Proc. CHI 2015, ACM Press (2015), 727--736.","paperID":"None"},{"content":"Lee Humphreys. 2005. Cellphones in public: social interactions in a wireless era. New Media & Society 7, 6: 810--833.","paperID":"None"},{"content":"Annika Hupfeld and Tom Rodden. 2012. Laying the Table for HCI: Uncovering Ecologies of Domestic Food Consumption. Proc. CHI 2012, ACM Press (2012), 119--128.","paperID":"None"},{"content":"Mizuko Ito. 2005. Mobile Phones, Japanese Youth, and the Re-placement of Social Contact. In Mobile Communications. Springer London, 131--148.","paperID":"None"},{"content":"Kat Keogh. 2014. Shift work and vending machines to blame for poor workplace diet. Nursing Standard 29, 8: 14--15.","paperID":"None"},{"content":"Rich Ling. 2004. The Mobile Connection: The Cell Phone's Impact on Society. Morgan Kauffman.","paperID":"None"},{"content":"Thomas J. Lipscomb, Jeff W. Totten, Roy A. Cook, and William Lesch. 2007. Cellular phone etiquette among college students. International Journal of Consumer Studies 31, 1: 46--56.","paperID":"None"},{"content":"Jennifer Mankoff, Gary Hsieh, Ho Chak Hung, Sharon Lee, and Elizabeth Nitao. 2002. Using Low-Cost Sensing to Support Nutritional Awareness. Proc. UbiComp 2002, ACM Press (2002).","paperID":"None"},{"content":"Margaret E. Morris, Sunny Consolvo, Sean Munson, Kevin Patrick, Janice Tsai, and Adam D.I. Kramer. 2011. Facebook for Health: Opportunities and Challenges for Driving Behavior Change. Ext. Abstracts CHI 2011, ACM Press (2011), 443--446.","paperID":"None"},{"content":"Jessamyn Neuhaus. 2003. Manly Meals and Mom's Home Cooking: Cookbooks and Gender in Modern America. JHU Press.","paperID":"None"},{"content":"Robert C. Nickerson, Henri Isaac, and Brenda Mak. 2008. A multi-national study of attitudes about mobile phone use in social settings. International Journal of Mobile Communications 6, 5: 541--563.","paperID":"None"},{"content":"Elinor Ochs and Merav Shohet. 2006. The cultural structuring of mealtime socialization. New Directions for Child and Adolescent Development 2006, 111: 35--49.","paperID":"None"},{"content":"Kenton O'Hara, John Helmes, Abigail Sellen, Richard Harper, Martijn ten Bhömer, and Elise van den Hoven. 2012. Food for Talk: Phototalk in the Context of Sharing a Meal. Human-Computer Interaction 27, 1--2: 124--150.","paperID":"None"},{"content":"Leysia Palen, Marilyn Salzman, and Ed Youngs. 2000. Going Wireless: Behavior & Practice of New Mobile Phone Users. Proc. CSCW 2000, ACM Press (2000), 201--210.","paperID":"None"},{"content":"Leysia Palen, Marilyn Salzman, and Ed Youngs. 2001. Discovery and Integration of Mobile Communications in Everyday Life. Personal and Ubiquitous Computing 5, 2: 109--122.","paperID":"None"},{"content":"Andrew K. Przybylski and Netta Weinstein. 2013. Can you connect with me now? How the presence of mobile communication technology influences face-to-face conversation quality. Journal of Social and Personal Relationships 30, 3: 237--246.","paperID":"None"},{"content":"Lee Rainie, Aaron Smith, and Maeve Duggan. 2013. Coming and Going on Facebook. Pew Internet & American Life Project. Retrieved from http://www.pewinternet.org/Reports/2013/Comingand-going-on-facebook.aspx","paperID":"None"},{"content":"L Rainie and K Zickuhr. 2015. Americans' Views on Mobile Etiquette. Pew Research Center. Retrieved from http://www.pewinternet.org/2015/08/26/americansviews-on-mobile-etiquette/","paperID":"None"},{"content":"Fraser J. M. Reid and Donna J. Reid. 2010. The expressive and conversational affordances of mobile messaging. Behaviour & Information Technology 29, 1: 3--22.","paperID":"None"},{"content":"Sara Rimer. 2009. Play With Your Food, Just Don't Text! The NY Times. Retrieved April 1, 2014 from www.nytimes.com/2009/05/27/dining/27text.html","paperID":"None"},{"content":"Sarita Schoenebeck. Giving up Twitter for Lent: How and Why we Take Breaks from Social Media. Proc. CHI 2014, ACM Press (2014), 773--782.","paperID":"None"},{"content":"Aaron Smith. 2015. U.S. Smartphone Use in 2015. Retrieved from http://www.pewinternet.org/2015/04/01/ussmartphone-use-in-2015/","paperID":"None"},{"content":"Martin Svensson, Kristina Höök, Jarmo Laaksolahti, and Annika Waern. 2001. Social Navigation of Food Recipes. Proc. CHI 2001, ACM Press (2001), 341--348.","paperID":"None"},{"content":"Quan T. Tran, Gina Calcaterra, and Elizabeth D. Mynatt. 2005. COOK'S COLLAGE. In Home Oriented Informatics and Telematics, Andy Sloane (ed.). Springer US, 15--32.","paperID":"None"},{"content":"Sherry Turkle. 2011. Alone Together: Why We Expect More from Technology and Less from Each Other. Basic Books.","paperID":"None"},{"content":"Mark Turner, Steve Love, and Mark Howell. 2008. Understanding emotions experienced when using a mobile phone in public: The social usability of mobile (cellular) telephones. Telematics and Informatics 25, 3: 201--215.","paperID":"None"},{"content":"Srdjan Vucetic. 2011. The Anglosphere: A Genealogy of a Racialized Identity in International Relations. Stanford University Press.","paperID":"None"},{"content":"Judy Wajcman, Michael Bittman, and Judith E. Brown. 2008. Families without Borders: Mobile Phones, Connectedness and Work-Home Divisions. Sociology 42, 4: 635--652.","paperID":"None"},{"content":"E Wartella, V Rideout, A Lauricella, and S Connell. 2013. Parenting in the age of digital technology. Report for the Center on Media and Human Development School of Communication Northwestern University.","paperID":"None"},{"content":"Walter Willett. 2011. Eat, Drink, and Be Healthy: The Harvard Medical School Guide to Healthy Eating. Simon and Schuster.","paperID":"None"},{"content":"Media and Children. American Academy of Pediatrics. Retrieved September 25, 2015 from https://www.aap.org/en-us/advocacy-and-policy/aaphealth-initiatives/pages/media-and-children.aspx","paperID":"None"}],"title":"Technology at the Table: Attitudes about Mobile Phone Use at Mealtimes","filename":"CHI16/p1881","authors":["Carol Moser","Sarita Y. Schoenebeck","Katharina Reinecke"],"conference":"CHI '16"}