{"paperId":2858162,"citation":[],"reference":[{"content":"Alan D. Baddeley. 2004. The psychology of memory. In The Essential Handbook of Memory Disorders for Clinicians, Alan D. Baddeley, Michael Kopelman, and Barbara A. Wilson (eds.). John Wiley & Sons, UK, 1--13.","paperID":"None"},{"content":"Liam J. Bannon. 2006. Forgetting as a feature, not a bug: the duality of memory and implications for ubiquitous computing. CoDesign 2, 01: 3--15.","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101.","paperID":"None"},{"content":"James Allan Cheyne, Jonathan S. A. Carriere, and Daniel Smilek. 2006. Absent-mindedness: Lapses of conscious awareness and everyday cognitive failures. Consciousness and cognition, 15, 3: 578--592.","paperID":"None"},{"content":"Martin A. Conway, M.A., 2005. Memory and the self. Journal of memory and language, 53(4), pp.594--628.","paperID":"None"},{"content":"Dan Cosley, Victoria Schwanda Sosik, S. Tejaswi Peesapati, Johnathon Schultz, and Soyoung Lee. 2012. Experiences with designing tools for everyday reminiscing. Human-Computer Interaction 27, 1--2: 175--198.","paperID":"None"},{"content":"Roger A. Dixon, Brent J. Small, Stuart W.S. MacDonald, and John J. McArdle. 2012. Yes, memory declines with aging--but when, how, and why? In Memory and Aging, Moshe NavehBenjamin and Nabuo Ohta (eds.). Psychology Press, NY, NY, 326--347.","paperID":"None"},{"content":"Judi Ellis. 1996. Prospective memory or the realization of delayed intentions: A conceptual framework for research. In Prospective memory: Theory and applications, Maria A. Brandimonte, Gilles O. Einstein and Mark A. McDaniel (eds.). Lawrence Erlbaum Associates, Mahwah, NJ, 1--22.","paperID":"None"},{"content":"Arthur D. Fisk, Wendy A. Rogers, Neil Charness, Sara J. Czaja, Joseph Sharit. 2009. Designing for Older Adults: Principles and Creative Human Factors Approaches. CRC press.","paperID":"None"},{"content":"Joseph L. Fleiss. 2004. The measurement of interrater agreement. In Statistical Methods for Rates and Proportions, Joseph L. Fleiss, Bruce Levin, and Myunghee Cho Paik (eds.). John Wiley & Sons, Inc., Hoboken, NJ, 598--626.","paperID":"None"},{"content":"Christopher Frayling. 1993. Research in art and design. Royal College of Art, London, UK.","paperID":"None"},{"content":"William Gaver. 2012. What should we expect from research through design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 937--946. DOI=http://dx.doi.org/10.1145/2207676.2208538","paperID":"None"},{"content":"Peter Gregor, Alan F. Newell, and Mary Zajicek. 2002. Designing for dynamic diversity: interfaces for older people. In Proceedings of the fifth international ACM conference on Assistive technologies (Assets '02). ACM, NY, NY, USA, 151--156. DOI=http://dx.doi.org/10.1145/638249.638277","paperID":"None"},{"content":"Celia B. Harris, John Sutton, and Amanda J. Barnier. 2010. Autobiographical forgetting, social forgetting and situated forgetting, In Forgetting, Sergio Della Sala (ed.). Psychology Press, 271--284.","paperID":"None"},{"content":"Adriana Ispas, Sarah Schöni, and Moira C. Norrie. 2012. ARENO: ambient reminder notes. In Proceedings of the 24th Australian ComputerHuman Interaction Conference (OzCHI '12), Vivienne Farrell, Graham Farrell, Caslon Chua, Weidong Huang, Raj Vasa, and Clinton Woodward (Eds.). ACM, NY, NY, USA, 253--262. DOI=http://dx.doi.org/10.1145/2414536.2414580","paperID":"None"},{"content":"Karen A. Kit and Holly A. Tuokko and Catherine A. Mateer. 2008. A review of the stereotype threat literature and its application in a neurological population. Neuropsychology review 18, 2: 132148.","paperID":"None"},{"content":"Arthur F. Kramer and David J. Madden. 2011. Attention In The handbook of aging and cognition, Fergus I.M. Craik and Timothy A. Salthouse (eds.), Psychology Press, NY, 189--249.","paperID":"None"},{"content":"Mik Lamming, Peter Brown, Kathleen Carter, Margery Eldridge, Mike Flynn, Gifford Louie, Peter Robinson and Abigail Sellen. 1994. The design of a human memory prosthesis. The Computer Journal 37, 3: 153--163.","paperID":"None"},{"content":"J. Richard Landis and Gary G. Koch. 1977. The measurement of observer agreement for categorical data. Biometrics 33: 159--74.","paperID":"None"},{"content":"Stephen Lindsay, Katie Brittain, Daniel Jackson, Cassim Ladha, Karim Ladha, and Patrick Olivier. 2012. Empathy, participatory design and people with dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 521--530. DOI=http://dx.doi.org/10.1145/2207676.2207749","paperID":"None"},{"content":"Sophie Martin, Clémence Mazzocco, Pascale Maury, Anne Grosselin, Wim Van der Elst, Roger A. Dixon, Yannick Stephan, and Denis Brouillet. 2015. Compensating for memory losses throughout adulthood: Validation and normalization of the Memory Compensation Questionnaire for nonclinical French populations. Archives of Gerontology and Geriatrics 60, 28--38.","paperID":"None"},{"content":"Viktor Mayer-Schönberger. 2011. Delete: the virtue of forgetting in the digital age. Princeton University Press.","paperID":"None"},{"content":"Marilyn Rose McGee-Lennon, Maria Klara Wolters, and Stephen Brewster. 2011. User-centred multimodal reminders for assistive living. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2105--2114. DOI=http://dx.doi.org/10.1145/1978942.1979248","paperID":"None"},{"content":"Anne-Sophie Melenhorst, Wendy A. Rogers and Don G. Bouwhuis. 2006. Older adults' motivated choice for technological innovation: evidence for benefit-driven selectivity. Psychology and aging 21, 1: 190--195.","paperID":"None"},{"content":"Sarah Mennicken, Jo Vermeulen, and Elaine M. Huang. 2014. From today's augmented houses to tomorrow's smart homes: new directions for home automation research. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, NY, NY, USA, 105--115. DOI=http://dx.doi.org/10.1145/2632048.2636076","paperID":"None"},{"content":"Tracy L. Mitzner and Katinka Dijkstra. 2010. EHealth for Older Adults: Assessing and Evaluating User Centered Design with Subjective Methods. In Human-Centered Design of E-Health Technologies: Concepts, Methods and Applications, Martina Ziefle and Carsten Röcker (eds.). IGI Global, Pennsylvania, 1--21.","paperID":"None"},{"content":"Wolfgang Nejdl and Claudia Niederee. 2015. Photos to Remember, Photos to Forget. IEEE MultiMedia, 22, 1: 6--11.","paperID":"None"},{"content":"Donald A. Norman and Tim Shallice. 1986. Attention to action. In Consciousness and SelfRegulation: Advances in Research and Theory Vol. 4, Richard J. Davidson, Gary E. Schwartz, David Shapiro (eds.). (pp. 1--18). Springer US.","paperID":"None"},{"content":"James T. Reason. 1984. Lapses of attention in everyday life. In Varieties of attention, Raja Parasuraman and D.R. Davies (eds.). Academic Press, Orlando, FL, 515--549.","paperID":"None"},{"content":"James T. Reason. 1990. Human error. Cambridge University Press, Cambridge.","paperID":"None"},{"content":"Peter G. Rendell, and Fergus IM Craik. 2000. Virtual week and actual week: Age-related differences in prospective memory. Applied Cognitive Psychology 14,7: S43--S62.","paperID":"None"},{"content":"Bradley J. Rhodes. 1997. The wearable remembrance agent: A system for augmented memory. Personal Technologies 1, 4: 218--224.","paperID":"None"},{"content":"Henry L. Roediger III, Yana Weinstein, and Pooja K. Agarwal. 2010. Forgetting: Preliminary considerations, In Forgetting, Sergio Della Sala (ed.). Psychology Press, 1--22.","paperID":"None"},{"content":"Yvonne Rogers, Jeni Paay, Margot Brereton, Kate L. Vaisutis, Gary Marsden, and Frank Vetere. 2014. Never too old: engaging retired people inventing the future with MaKey MaKey. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3913--3922. DOI=http://dx.doi.org/10.1145/2556288.2557184","paperID":"None"},{"content":"Corina Sas and Steve Whittaker. 2013, April. Design for forgetting: disposing of digital possessions after a breakup. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13) 1823--1832.","paperID":"None"},{"content":"Daniel L. Schacter. 2002. The Seven Sins of Memory: How the Mind Forgets and Remembers. Houghton Mifflin Harcourt.","paperID":"None"},{"content":"Lael J. Schooler and Ralph Hertwig. 2005. How forgetting aids heuristic inference. Psychological Review 112, 3: 610.","paperID":"None"},{"content":"Abigail J. Sellen, Andrew Fogg, Mike Aitken, Steve Hodges, Carsten Rother, and Ken Wood. 2007. Do life-logging technologies support memory for the past?: an experimental study using sensecam. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 8190. DOI=http://dx.doi.org/10.1145/1240624.1240636","paperID":"None"},{"content":"Larry R. Squire. 2004. Memory systems of the brain: a brief history and current perspective. Neurobiology of Learning and Memory 82, 3: 171--177.","paperID":"None"},{"content":"Katarzyna Stawarz, Anna L. Cox, and Ann Blandford. 2014. Don't forget your pill!: designing effective medication reminder apps that support users' daily routines. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2269--2278. DOI=http://dx.doi.org/10.1145/2556288.2557079","paperID":"None"},{"content":"W. Scott Terry. 1988. Everyday forgetting: Data from a diary study. Psychological Reports 62, 1: 299--303.","paperID":"None"},{"content":"Wenn-Chieh Tsai, Po-Hao Wang, Hung-Chi Lee, Rung-Huei Liang, and Jane Hsu. 2014. The reflexive printer: toward making sense of perceived drawbacks in technology-mediated reminiscence. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 995--1004. DOI=http://dx.doi.org/10.1145/2598510.2598589","paperID":"None"},{"content":"Endel Tulving. 1972. Episodic and semantic memory. In Organization of Memory. Academic Press, London and NY, 381--402.","paperID":"None"},{"content":"Endel Tulving. 1985. Memory and consciousness. Canadian Psychology/Psychologie canadienne 26, 1 (Jan 1985), 1--12.","paperID":"None"},{"content":"Nash Unsworth, Gene A. Brewer, and Gregory J. Spillers. 2012. Variation in cognitive failures: An individual differences investigation of everyday attention and memory failures. Journal of Memory and Language 67, 1: 1--16","paperID":"None"},{"content":"Elise van den Hoven. 2014. A future-proof past: Designing for remembering experiences. Memory Studies 7, 3: 370--384.","paperID":"None"},{"content":"Elise van den Hoven and Berry Eggen. 2008. Informing augmented memory system design through autobiographical memory theory. Personal and Ubiquitous Computing 12, 6: 433--443.","paperID":"None"},{"content":"Elise van den Hoven and Berry Eggen. 2014. The cue is key: Design for real-life remembering. Zeitschrift für Psychologie 222, 2: 110.","paperID":"None"},{"content":"Elise van den Hoven, Corina Sas and Steve Whittaker. 2012. Introduction to this special issue on designing for personal memories: past, present, and future. Human-Computer Interaction 27,1--2: 1--12.","paperID":"None"},{"content":"Sunil Vemuri. 2005. Personal Long-Term Memory Aids. Ph.D Dissertation. Massachusetts Institute of Technology, Cambridge, MA.","paperID":"None"},{"content":"Julie R. Williamson, Marilyn McGee-Lennon, Euan Freeman, and Stephen Brewster. 2013. Designing a smartpen reminder system for older adults. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 73--78. DOI=http://dx.doi.org/10.1145/2468356.2468371","paperID":"None"},{"content":"Mary Zajicek. 2006. Aspects of HCI research for older people. Universal Access in the Information Society 5,3: 279--286.","paperID":"None"},{"content":"John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 493--502. DOI=http://dx.doi.org/10.1145/1240624.1240704","paperID":"None"}],"abstract":"Designing to support memory for older individuals is a complex challenge in human-computer interaction (HCI) research. Past literature on human memory has mapped processes for recalling past experiences, learning new things, remembering to carry out future intentions and the importance of attention. However, the understanding of how older adults perceive forgetting in daily life remains limited. This paper narrows this gap through a study with older persons (n=18) living independently using self-reporting and semi-structured focus groups to explore what they forget, how they react, and what mechanisms they put in place to recover from and avoid forgetting. Findings include occurrences of prospective and retrospective memory lapses, conflicting negative and neutral perceptions, and techniques to manage forgetting. Participant responses indicate that an awareness of forgetting fosters internal tensions among older adults, thereby creating opportunities for further design research, e.g., to defuse and normalise these reactions.","title":"Designing for the Other 'Hereafter': When Older Adults Remember about Forgetting","filename":"CHI16/p721","authors":["Laura Ramos","Elise van den Hoven","Laurie Miller"],"conference":"CHI '16"}