{"paperId":2858565,"abstract":"Social computing-or computing in a social context-has largely concerned itself with understanding social interaction among and between people. This paper asserts that ignoring material components-including computing itself-as social actors is a mistake. Computing has its own agenda and agencies, and including it as a member of the social milieu provides a means of producing design objects that attend to how technology use can extend beyond merely amplifying or augmenting human actions. In this paper, we offer examples of projects that utilize the capacity of object-oriented publics to both analyze the conditions and consequences around existing publics and engage with matters of concern inherent to emerging publics. Considering how computing as an actor contributes to the construction of publics provides insight into the design of computational systems that address issues. We end by introducing the idea of the object ecology as a way to coordinate design approaches to computational publics.","citation":[],"reference":[{"content":"Philip E. Agre. 1997. Computation and Human Experience (Learning in Doing: Social, Cognitive and Computational Perspectives). Cambridge University Press.","paperID":"None"},{"content":"Mariam Asad and Christopher A Le Dantec. 2015. Illegitimate Civic Participation: Supporting Community Activists on the Ground. CSCW '15: Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM Request Permissions, 1694--1703.","paperID":"None"},{"content":"Mariam Asad, Sarah Fox, and Christopher A Le Dantec. 2014. Speculative Activist Technologies. iConference 2014 Proceedings: Breaking Down Walls. Culture Context Computing, iSchools.","paperID":"None"},{"content":"Robert Asen. 2003. The Multiple Mr. Dewey: Multiple Publics and Permeable Borders in John Dewey's Theory of the Public Sphere. Argumentation and Advocacy 39, 3: 174--188.","paperID":"None"},{"content":"Jane Bennett. 2005. The agency of assemblages and the North American blackout. Public Culture 17, 3: 445--465.","paperID":"None"},{"content":"Jane Bennett. 2010. Vibrant Matter: A Political Ecology of Things. Duke University Press Books.","paperID":"None"},{"content":"Thomas Binder, Giorgio de De Michelis, Pelle Ehn, Giulio Jacucci, Per Linde, and Ina Wagner. 2011. Design Things. MIT Press.","paperID":"None"},{"content":"Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2010. Participatory design and \"democratizing innovation.\" PDC '10: Proceedings of the 11th Biennial Participatory Design Conference, ACM, 41--50.","paperID":"None"},{"content":"Pernille Bjørn and Carsten Østerlund. 2014. Sociomaterial-Design. Springer.","paperID":"None"},{"content":"Eli Blevis, Susanne Bødker, John Flach, et al. 2015. Ecological Perspectives in HCI: Promise, Problems, and Potential. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 2401--2404. http://doi.org/10.1145/2702613.2702634","paperID":"None"},{"content":"Susanne Bødker and Clemens Nylandsted Klokmose. 2012. Dynamics in Artifact Ecologies. Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, ACM, 448--457. http://doi.org/10.1145/2399016.2399085","paperID":"None"},{"content":"Ian Bogost. 2012. Alien Phenomenology or, What it's Like to Be a Thing. University of Minnesota Press, Minneapolis.","paperID":"None"},{"content":"Andrew Boucher and William Gaver. 2006. Developing the Drift Table. interactions 13, 1: 24--27. http://doi.org/10.1145/1109069.1109087","paperID":"None"},{"content":"M Brown. 2011. \"Street Bump\" Android app detects and reports potholes (Wired UK). Wired.co.uk.","paperID":"None"},{"content":"Christopher A Le Dantec, Caroline Appleton, Mariam Asad, Robert Rosenberger, and Kari E Watkins. 2016. Advocating Through Data: Community Visibilities in Crowdsourced Cycling Data. In Bicycle Justice and Urban Tranformation: Biking For All, Aaron Golub, Melody Hoffmann, Adonia Lugo and Gerardo Sandoval (eds.). Routledge.","paperID":"None"},{"content":"Christopher A Le Dantec, Mariam Asad, Aditi Misra, and Kari E Watkins. 2015. Planning with Crowdsourced Data: Rhetoric and Representation in Transportation Planning. CSCW '15: Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM Request Permissions, 1717--1727.","paperID":"None"},{"content":"Christopher A Le Dantec, Jim E. Christensen, Mark Bailey, et al. 2010. A Tale of Two Publics: Democratizing Design at the Margins. DIS '10: Proceedings of the conference on Designing interactive systems, 11--20.","paperID":"None"},{"content":"Christopher A Le Dantec and Carl Francis DiSalvo. 2013. Infrastructuring and the Formation of Publics in Participatory Design. Social Studies of Science 43, 2: 241--264.","paperID":"None"},{"content":"Christopher A Le Dantec and W Keith Edwards. 2010. Across Boundaries of Influence and Accountability: The Multiple Scales of Public Sector Information Systems. CHI '10: Proceeding of the twenty-eighth annual SIGCHI conference on Human factors in computing systems, ACM, 113--122.","paperID":"None"},{"content":"Christopher A Le Dantec, Robert G. Farrell, Jim E. Christensen, et al. 2011. Publics in practice: ubiquitous computing at a shelter for homeless mothers. CHI '11: Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems, ACM Request Permissions, 1687--1696.","paperID":"None"},{"content":"Audrey Desjardins, Ron Wakkary, and William Odom. 2015. Investigating Genres and Perspectives in HCI Research on the Home. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3073--3082. http://doi.org/10.1145/2702123.2702540","paperID":"None"},{"content":"John Dewey. 1954. The public and its problems. Swallow Press, Chicago.","paperID":"None"},{"content":"Carl Francis DiSalvo. 2009. Design and the Construction of Publics. Design Issues 25, 1: 48--63.","paperID":"None"},{"content":"Derek Doran, Swapna Gokhale, and Aldo Dagnino. 2013. Human Sensing for Smart Cities. Proceedings of the 2013 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining, ACM, 1323--1330.","paperID":"None"},{"content":"Paul Dourish and Genevieve Bell. 2011. Divining a Digital Future: Mess and Mythology in Ubiquitous Computing. The MIT Press, Cambridge, Mass.","paperID":"None"},{"content":"Anthony Dunne and Fiona Raby. 2014. Speculative Everything: Design, Fiction, and Social Dreaming. MIT Press, Cambridge, Massachusetts; London.","paperID":"None"},{"content":"Pelle Ehn. 2008. Participation in design things. Proceedings of the Tenth Anniversary Conference on Participatory Design 2008, Indiana University, 92--101. Retrieved February 12, 2013 from http://dl.acm.org/citation.cfm?id=1795234.1795248","paperID":"None"},{"content":"Thomas Erickson, Mark Podlaseck, Sambit Sahu, Jing D Dai, Tian Chao, and Milind Naphade. 2012. The Dubuque Water Portal: Evaluation of the Uptake, Use and Impact of Residential Water Consumption Feedback. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 675--684.","paperID":"None"},{"content":"Jodi Forlizzi. 2008. The Product Ecology: Understanding Social Product Use and Supporting Design Culture. International Journal of Design 2, 1. Retrieved March 10, 2015 from http://www.ijdesign.org/ojs/index.php/IJDesign/article/view/220","paperID":"None"},{"content":"William Gaver, Andy Boucher, Andy Law, et al. 2008. Threshold Devices: Looking out from the Home. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1429--1438. http://doi.org/10.1145/1357054.1357278","paperID":"None"},{"content":"William W. Gaver, Mark Blythe, Andy Boucher, Jarvis Nadine, John Bowers, and Peter Wright. 2010. The Prayer Companion: Openness and Specificity, Materiality and Spirituality. Proceedings of the SIGCHI conference on Human factors in computing systems.","paperID":"None"},{"content":"Neil Gershenfeld. 1999. When Things Start to Think. Henry Holt and Co., New York.","paperID":"None"},{"content":"T Gillespie. 2010. The politics of \"platforms.\" new media & society 12, 3: 347--364.","paperID":"None"},{"content":"Kenneth L Hacker and Jan van Dijk (eds.). 2001. Digital Democracy: Issues of Theory and Practice. Sage Publications, Inc.","paperID":"None"},{"content":"Graham Harman. 2002. Tool-Being: Heidegger and the Metaphysics of Objects. Open Court.","paperID":"None"},{"content":"Edwin Hutchins. 1995. Cognition in the Wild. MIT Press.","paperID":"None"},{"content":"Edwin Hutchins. 2000. Distributed Cognition.","paperID":"None"},{"content":"Steven J Jackson and Laewoo Kang. 2014. Breakdown, obsolescence and reuse: HCI and the art of repair. CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM Request Permissions, 449--458.","paperID":"None"},{"content":"Tom Jenkins and Ian Bogost. 2014. Designing for the Internet of Things: Prototyping Material Interactions. CHI '14 Extended Abstracts on Human Factors in Computing Systems, ACM, 731--740. http://doi.org/10.1145/2559206.2578879","paperID":"None"},{"content":"Tom Jenkins and Ian Bogost. 2015. Escaping the Sandbox: Making and Its Future. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 29--32. http://doi.org/10.1145/2677199.2680558","paperID":"None"},{"content":"Bernward Joerges. 1999. Do Politics Have Artifacts? Social Studies of Science 29, 3: 411--431.","paperID":"None"},{"content":"Heekyoung Jung, Erik Stolterman, Will Ryan, Tonya Thompson, and Marty Siegel. 2008. Toward a Framework for Ecologies of Artifacts: How Are Digital Artifacts Interconnected Within a Personal Life? Proceedings of the 5th Nordic Conference on Human-computer Interaction: Building Bridges, ACM, 201--210. http://doi.org/10.1145/1463160.1463182","paperID":"None"},{"content":"Victor Kaptelinin and Bonnie A. Nardi. 2009. Acting with Technology: Activity Theory and Interaction Design. The MIT Press.","paperID":"None"},{"content":"Carl Knappett and Lambros Malafouris (eds.). 2007. Material Agency: Towards a non-anthropocentric approach. Springer, New York.","paperID":"None"},{"content":"Bruno Latour. 1993. We have never been modern. Harvard University Press, Cambridge, Mass.","paperID":"None"},{"content":"Bruno Latour. 2004. Which Politics for Which Artifacts? Domus.","paperID":"None"},{"content":"Bruno Latour. 2007. Reassembling the Social: An Introduction to Actor-Network-Theory. Oxford University Press, Oxford.","paperID":"None"},{"content":"Bruno Latour. 2008. What is the style of Matters of Concern? Vav Gorcum.","paperID":"None"},{"content":"Bruno Latour, Graham Harman, and Peter Erdélyi. 2011. The prince and the wolf: Latour and Harman at the LSE. ZERO Books, Winchester, UK; Washington.","paperID":"None"},{"content":"John Law. 1992. Notes on the theory of the actornetwork: Ordering, strategy, and heterogeneity. Systems practice 5, 4: 379--393. http://doi.org/10.1007/BF01059830","paperID":"None"},{"content":"John Law. 2002. Aircraft Stories: Decentering the Object in Technoscience. Duke University Press Books.","paperID":"None"},{"content":"Kristina Lindström and Åsa Ståhl. 2014. Patchworking publics-in-the-making: design, media and public engagement.","paperID":"None"},{"content":"Silvia Lindtner, Judy Chen, Gillian R. Hayes, and P Dourish. 2011. Towards a framework of publics: Reencountering media sharing and its user. ACM Transactions on Computer-Human Interaction 18: 5:1--5:23.","paperID":"None"},{"content":"Dr Lambros Malafouris. 2007. At the Potter's Wheel: An Argument for Material Agency. In Knappett C. & L. Malafouris, (eds) (2008). Material Agency: Towards a non- anthropocentric approach. New York: Springer., Carl Knappett and Lambros Malafouris (eds.). Springer. Retrieved February 13, 2015 from http://cogprints.org/6402/","paperID":"None"},{"content":"Victor Margolin. 2002. The Politics of the Artificial: Essays on Design and Design Studies. University Of Chicago Press, Chicago.","paperID":"None"},{"content":"Noortje Marres. 2007. The Issues Deserve More Credit: Pragmatist Contributions to the Study of Public Involvement in Controversy. Social Studies of Science 37, 5: 759--780.","paperID":"None"},{"content":"Noortje Marres. 2012. Material Participation: Technology, the Environment and Everyday Publics.","paperID":"None"},{"content":"Mike Michael. 2012. \"What are we busy doing?\" Engaging the idiot. Science, Technology & Human Values 37, 5: 528--554.","paperID":"None"},{"content":"Nicolas Montfort and Ian Bogost. 2009. Racing the Beam.","paperID":"None"},{"content":"Teresa Olivares, Fernando Royo, and Antonio M Ortiz. 2013. An Experimental Testbed for Smart Cities Applications. Proceedings of the 11th ACM International Symposium on Mobility Management and Wireless Access, ACM, 115--118.","paperID":"None"},{"content":"C Perera, A Zaslavsky, P Christen, and Dimitrios Georgakopoulos. 2014. Sensing as a service model for smart cities supported by Internet of Things. Transactions on Emerging Telecommunications Technologies 25, 1: 81--93.","paperID":"None"},{"content":"James Pierce, Phoebe Sengers, Tad Hirsch, Tom Jenkins, William Gaver, and Carl DiSalvo. 2015. Expanding and Refining Design and Criticality in HCI. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2083--2092. http://doi.org/10.1145/2702123.2702438","paperID":"None"},{"content":"Haggai Roitman, Jonathan Mamou, Sameep Mehta, Aharon Satt, and L V Subramaniam. 2012. Harnessing the Crowds for Smart City Sensing. Proceedings of the 1st International Workshop on Multimodal Crowd Sensing, ACM, 17--18.","paperID":"None"},{"content":"Daniela K Rosner. 2012. Craft, computing & culture. CSCW '12: Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, 319.","paperID":"None"},{"content":"Daniela K Rosner, Silvia Lindtner, Ingrid Erickson, Laura Forlano, Steven J Jackson, and Beth Kolko. 2014. Making cultures: building things & building communities. ACM, New York, New York, USA.","paperID":"None"},{"content":"Lucy Suchman. 2011. Anthropological Relocations and the Limits of Design. Annual Review of Anthropology 40, 1: 1--18. http://doi.org/10.1146/annurev.anthro.041608.105640","paperID":"None"},{"content":"Athena Vakali, Leonidas Anthopoulos, and Srdjan Krco. 2014. Smart Cities Data Streams Integration: Experimenting with Internet of Things and Social Data Flows. Proceedings of the 4th International Conference on Web Intelligence, Mining and Semantics (WIMS14), ACM, 60:1--60:5.","paperID":"None"},{"content":"A Voida, Ellie Harmon, and Ban Al-Ani. 2012. Bridging between organizations and the public: volunteer coordinators' uneasy relationship with social computing. CHI '12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1967--1976.","paperID":"None"},{"content":"Peter Weibel and Bruno Latour. 2005. Making things public: atmospheres of democracy?: [exhibition], ZKM, Center for art and media Karlsruhe, 20.03.-03-10.2005. (Mass.): MIT press, Cambridge.","paperID":"None"},{"content":"Alex Wilkie and Mike Michael. 2009. Expectation and Mobilisation: Enacting Future Users. Science, Technology & Human Values 34, 4: 502--522.","paperID":"None"},{"content":"Langdon Winner. 1980. Do Artifacts Have Politics? Daedalus 109, 1: 121--136.","paperID":"None"},{"content":"S Woolgar and G Cooper. 1999. Do Artifacts Have Ambivalence: Moses' Bridges, Winner's Bridges and other Urban Legends in S&TS. Social Studies of Science 29, 3: 433--449.","paperID":"None"},{"content":"Albena Yaneva. 2013. Mapping controversies in architecture. Ashgate Publishing, Ltd.","paperID":"None"}],"title":"Object-Oriented Publics","filename":"CHI16/p827","authors":["Tom Jenkins","Christopher A. Le Dantec","Carl DiSalvo","Thomas Lodato","Mariam Asad"],"conference":"CHI '16"}