{"paperId":2858555,"citation":[],"reference":[{"content":"Rehab Alnemr and Christoph Meinel. 2011. Why rating is not enough: A study on online reputation systems. In Collaborative Computing: Networking, Applications and Worksharing (CollaborateCom), 2011 7th International Conference on. IEEE, 415-421.","paperID":"None"},{"content":"Donovan Artz and Yolanda Gil. 2007. A survey of trust in computer science and the Semantic Web. Web Semantics 5, 2 (2007), 58-71. DOI: http://dx.doi.org/10.1016/j.websem.2007.03.002","paperID":"None"},{"content":"S.B. Azhar and M.J. Rissanen. 2011. Evaluation of Parallel Coordinates for Interactive Alarm Filtering. In Information Visualisation (IV), 2011 15th International Conference on. 102-109. DOI: http://dx.doi.org/10.1109/IV.2011.30","paperID":"None"},{"content":"Sulin Ba and Paul A Pavlou. 2002. Evidence of the effect of trust building technology in electronic markets: Price premiums and buyer behavior. MIS quarterly (2002), 243-268.","paperID":"None"},{"content":"Aaron Bangor, Philip T Kortum, and James T Miller. 2008. An empirical evaluation of the system usability scale. Intl. Journal of Human-Computer Interaction 24, 6 (2008), 574-594.","paperID":"None"},{"content":"Zinaida Benenson, Anna Girard, and Ioannis Krontiris. 2015. User Acceptance Factors for Anonymous Credentials: An Empirical Investigation. In Workshop on the Economics of Information Security (WEIS).","paperID":"None"},{"content":"Gary Bente, Odile Baptist, and Haug Leuschner. 2012. To buy or not to buy: Influence of seller photos and reputation on buyer trust and purchase behavior. International Journal of Human-Computer Studies 70, 1 (2012), 1-13.","paperID":"None"},{"content":"Gregory S Black. 2005. Is eBay for everyone? An assessment of consumer demographics. SAM Advanced Management Journal 70, 1 (2005), 50.","paperID":"None"},{"content":"Gary E Bolton, Elena Katok, and Axel Ockenfels. 2004. How effective are electronic reputation mechanisms? An experimental investigation. Management science 50, 11 (2004), 1587-1602.","paperID":"None"},{"content":"Philip Bonhard, Clare Harries, John McCarthy, and M Angela Sasse. 2006. Accounting for taste: using profile similarity to improve recommender systems. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 1057-1066.","paperID":"None"},{"content":"Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 data-driven documents. Visualization and Computer Graphics, IEEE Transactions on 17, 12 (2011), 2301-2309.","paperID":"None"},{"content":"John Brooke. 1996. SUS - A quick and dirty usability scale. Usability evaluation in industry 189 (1996), 194.","paperID":"None"},{"content":"SAP User Experience Community. 2015. System Usability Scale - jetzt auch auf Deutsch. https://experience.sap.com/skillup/system-usability-scale-jetzt-auch-auf-deutsch. (2015). [Online; last access on September 15th, 2015].","paperID":"None"},{"content":"Fred D. Davis, Richard P. Bagozzi, and Paul R. Warshaw. 1989. User acceptance of computer technology: a comparison of two theoretical models. Management science 35, 8 (1989), 982-1003.","paperID":"None"},{"content":"Chrysanthos Dellarocas. 2000. Immunizing online reputation reporting systems against unfair ratings and discriminatory behavior. In Proceedings of the 2nd ACM Conference on Electronic Commerce. ACM, NY, 150-157. DOI: http://dx.doi.org/10.1145/352871.352889","paperID":"None"},{"content":"Andreas Diekmann, Ben Jann, Wojtek Przepiorka, and Stefan Wehrli. 2013. Reputation Formation and the Evolution of Cooperation in Anonymous Online Markets. American Sociological Review (2013). DOI: http://dx.doi.org/10.1177/0003122413512316","paperID":"None"},{"content":"Liran Einav, Chiara Farronato, Jonathan D Levin, and Neel Sundaresan. 2013. Sales Mechanisms in Online Markets: What Happened to Internet Auctions? Technical Report. National Bureau of Economic Research.","paperID":"None"},{"content":"Diego Gambetta. 1988. Can We Trust Trust? In Trust: Making and Breaking Cooperative Relations, Diego Gambetta (Ed.). Basil Blackwell, Oxford, 213-237.","paperID":"None"},{"content":"Anindya Ghose, Panagiotis G Ipeirotis, and Arun Sundararajan. 2009. The dimensions of reputation in electronic markets. NYU Center for Digital Economy Research Working Paper No. CeDER-06-02 (2009).","paperID":"None"},{"content":"Nathan Griffiths. 2005. Task delegation using experience-based multi-dimensional trust. In Proceedings of the fourth international joint conference on Autonomous agents and multiagent systems. ACM, 489-496.","paperID":"None"},{"content":"Stephan Hammer, Rolf Kiefhaber, Matthias Redlin, Elisabeth Andre, and Theo Ungerer. 2013. A User-Centric Study Of Reputation Metrics in Online Communities. In Proceedings of the 3rd Workshop on Trust, Reputation and User Modeling (TRUM'13). Rome Italy.","paperID":"None"},{"content":"Jeffrey Heer and Maneesh Agrawala. 2008. Design considerations for collaborative visual analytics. Information visualization 7, 1 (2008), 49-62.","paperID":"None"},{"content":"Julian Heinrich and Daniel Weiskopf. 2013. State of the Art of Parallel Coordinates. In STAR Proceedings of Eurographics 2013. Eurographics Association, 95-116.","paperID":"None"},{"content":"Kevin Hoffman, David Zage, and Cristina Nita-Rotaru. 2009. A Survey of Attack and Defense Techniques for Reputation Systems. ACM Comput. Surv. 42, 1, Article 1 (Dec. 2009), 31 pages. DOI: http://dx.doi.org/10.1145/1592451.1592452","paperID":"None"},{"content":"Daniel Houser and John Wooders. 2006. Reputation in auctions: Theory, and evidence from eBay. Journal of Economics & Management Strategy 15, 2 (2006), 353-369.","paperID":"None"},{"content":"Alfred Inselberg. 1985. The plane with parallel coordinates. The Visual Computer 1, 2 (1985), 69-91. DOI: http://dx.doi.org/10.1007/BF01898350","paperID":"None"},{"content":"Alfred Inselberg. 2009. Parallel Coordinates: Visual Multidimensional Geometry and Its Applications. Springer.","paperID":"None"},{"content":"Jimmy Johansson and Camilla Forsell. 2016. Evaluation of Parallel Coordinates: Overview, Categorization and Guidelines for Future Research. IEEE Trans. Vis. Comput. Graph. 22, 1 (2016), 579-588. DOI: http://dx.doi.org/10.1109/TVCG.2015.2466992","paperID":"None"},{"content":"Audun Jøsang and Jennifer Golbeck. 2009. Challenges for robust trust and reputation systems. In Proceedings of the 5th International Workshop on Security and Trust Management. Saint Malo France.","paperID":"None"},{"content":"Audun Jøsang, Roslan Ismail, and Colin Boyd. 2007. A survey of trust and reputation systems for online service provision. Decision Support Systems 43, 2 (2007), 618-644. DOI: http://dx.doi.org/10.1016/j.dss.2005.05.019","paperID":"None"},{"content":"Audun Jsang. 2012. Robustness of Trust and Reputation Systems: Does It Matter? In Trust Management VI, Theo Dimitrakos, Rajat Moona, Dhiren Patel, and D.Harrison McKnight (Eds.). IFIP Advances in Information and Communication Technology, Vol. 374. Springer Berlin Heidelberg, 253-262. DOI: http://dx.doi.org/10.1007/978--3--642--29852--3_21","paperID":"None"},{"content":"Daniel Keim, Gennady Andrienko, Jean-Daniel Fekete, Carsten Görg, Jörn Kohlhammer, and Guy Melancçon. 2008. Visual Analytics: Definition, Process, and Challenges. In Information Visualization, Andreas Kerren, JohnT. Stasko, Jean-Daniel Fekete, and Chris North (Eds.). Lecture Notes in Computer Science, Vol. 4950. Springer Berlin Heidelberg, 154-175.","paperID":"None"},{"content":"Daniel A. Keim. 2001. Visual Exploration of Large Data Sets. Commun. ACM 44, 8 (Aug. 2001), 38-44. DOI: http://dx.doi.org/10.1145/381641.381656","paperID":"None"},{"content":"Reid Kerr and Robin Cohen. 2009. Smart Cheaters Do Prosper: Defeating Trust and Reputation Systems. In Proceedings of The 8th International Conference on Autonomous Agents and Multiagent Systems - Volume 2 (AAMAS '09). International Foundation for Autonomous Agents and Multiagent Systems, Richland SC, 993-1000.","paperID":"None"},{"content":"Eleni Koutrouli and Aphrodite Tsalgatidou. 2012. Taxonomy of attacks and defense mechanisms in P2P reputation systems - Lessons for reputation system designers. Computer Science Review 6, 2--3 (2012), 47-70. DOI: http://dx.doi.org/10.1016/j.cosrev.2012.01.002","paperID":"None"},{"content":"J Richard Landis and Gary G Koch. 1977. The measurement of observer agreement for categorical data. biometrics (1977), 159-174.","paperID":"None"},{"content":"James R Lewis and Jeff Sauro. 2009. The factor structure of the system usability scale. In Human Centered Design. Springer, 94-103.","paperID":"None"},{"content":"Benedikt Loepp, Katja Herrmanny, and Jürgen Ziegler. 2015. Blended Recommending: Integrating Interactive Information Filtering and Algorithmic Recommender Techniques. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 975-984.","paperID":"None"},{"content":"Zaki Malik and Athman Bouguettaya. 2009. Rateweb: Reputation assessment for trust establishment among web services. The VLDB Journal The International Journal on Very Large Data Bases 18, 4 (2009), 885-911.","paperID":"None"},{"content":"Stephen Marsh. 1994. Formalising Trust as a Computational Concept. Ph.D. Dissertation. University of Stirling, Stirling. http://homepage.mac.com/smarsh2003/SteveMarsh/Publications_files/Trust-thesis.pdf","paperID":"None"},{"content":"Stephen Marsh, Anirban Basu, and Natasha Dwyer. 2012. Rendering unto cæsar the things that are cæsars: Complex trust models and human understanding. In Trust Management VI. Springer, 191-200.","paperID":"None"},{"content":"David Masclet and Thierry Penard. 2012. Do reputation feedback systems really improve trust among anonymous traders? An experimental study. Applied Economics 44, 35 (2012), 4553-4573.","paperID":"None"},{"content":"D. Harrison McKnight and Normal L. Chervany. 1996. The meanings of trust. Technical Report MISRC Working Paper Series 96-04, University of Minnesota, Management Information Systems Research Center (1996).","paperID":"None"},{"content":"Mikhail I Melnik and James Alm. 2002. Does a seller's ecommerce reputation matter? Evidence from eBay auctions. Journal of Industrial Economics (2002), 337-349.","paperID":"None"},{"content":"Jakob Nielsen. 1994. Usability engineering. Elsevier.","paperID":"None"},{"content":"Paul A Pavlou and Angelika Dimoka. 2006. The nature and role of feedback text comments in online marketplaces: Implications for trust building, price premiums, and seller differentiation. Information Systems Research 17, 4 (2006), 392-414.","paperID":"None"},{"content":"Martin Rehak, Milos Gregor, Michal Pechoucek, and Jeffrey Bradshaw. 2006. Representing Context for Multiagent Trust Modeling. In Proceedings of the IEEE/WIC/ACM International Conference on Intelligent Agent Technology. Hongkong China, 737-746. DOI: http://dx.doi.org/10.1109/IAT.2006.107","paperID":"None"},{"content":"Paul Resnick, Ko Kuwabara, Richard Zeckhauser, and Eric Friedman. 2000. Reputation systems. Commun. ACM 43, 12 (2000), 45-48. DOI: http://dx.doi.org/10.1145/355112.355122","paperID":"None"},{"content":"Paul Resnick and Hal R Varian. 1997. Recommender systems. Commun. ACM 40, 3 (1997), 56-58.","paperID":"None"},{"content":"Paul Resnick and Richard Zeckhauser. 2002. Trust among strangers in internet transactions: Empirical analysis of ebays reputation system. The Economics of the Internet and E-commerce 11, 2 (2002), 23-25.","paperID":"None"},{"content":"Paul Resnick, Richard Zeckhauser, John Swanson, and Kate Lockwood. 2006. The value of reputation on eBay: A controlled experiment. Experimental Economics 9, 2 (2006), 79-101.","paperID":"None"},{"content":"Jens Riegelsberger, Martina Angela Sasse, and John D. McCarthy. 2005. The mechanics of trust: A framework for research and design. Int. J. Hum.-Comput. Stud. 62, 3 (2005), 381-422. DOI: http://dx.doi.org/10.1016/j.ijhcs.2005.01.001","paperID":"None"},{"content":"Bob Rietjens. 2006. Trust and reputation on eBay: Towards a legal framework for feedback intermediaries. Information & Communications Technology Law 15, 1 (2006), 55-78.","paperID":"None"},{"content":"Denise M Rousseau, Sim B Sitkin, Ronald S Burt, and Colin Camerer. 1998. Not so different after all: A cross-discipline view of trust. Academy of management review 23, 3 (1998), 393-404.","paperID":"None"},{"content":"Daniel M Russell, Mark J Stefik, Peter Pirolli, and Stuart K Card. 1993. The cost structure of sensemaking. In Proceedings of the INTERACT'93 and CHI'93 conference on Human factors in computing systems. ACM, 269-276.","paperID":"None"},{"content":"Johannes Sänger and Günther Pernul. 2014. Visualizing Transaction Context in Trust and Reputation Systems. In Ninth International Conference on Availability, Reliability and Security, ARES 2014, Fribourg, Switzerland, September 8--12, 2014. 94-103. DOI: http://dx.doi.org/10.1109/ARES.2014.19","paperID":"None"},{"content":"Christine Satchell and Paul Dourish. 2009. Beyond the user. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group on Design: Open 24/7 - OZCHI '09. ACM Press, NY, NY, USA, 9. DOI: http://dx.doi.org/10.1145/1738826.1738829","paperID":"None"},{"content":"Galit Shmueli, Wolfgang Jank, Aleks Aris, Catherine Plaisant, and Ben Shneiderman. 2006. Exploring auction databases through interactive visualization. Decision Support Systems 42, 3 (2006), 1521-1538.","paperID":"None"},{"content":"Mohammad Gias Uddin, Mohammad Zulkernine, and Sheikh Iqbal Ahamed. 2008. CAT: a context-aware trust model for open and dynamic systems. In Proceedings of the 2008 ACM symposium on Applied computing. ACM, 2024-2029.","paperID":"None"},{"content":"Viswanath Venkatesh, Michael G. Morris, Gordon B. Davis, and Fred D. Davis. 2003. User acceptance of information technology: Toward a unified view. MIS quarterly (2003), 425-478.","paperID":"None"},{"content":"Edward J. Wegman. 1987. Hyperdimensional data analysis using parallel coordinates. Fairfax and Va.","paperID":"None"},{"content":"Yuan Yao, Sini Ruohomaa, and Feng Xu. 2012. Addressing Common Vulnerabilities of Reputation Systems for Electronic Commerce. JTAER 7, 1 (2012), 1-20. http://www.jtaer.com/apr2012/Yao_Ruohomaa_Xu_p1.pdf","paperID":"None"},{"content":"Koji Yatani, Michael Novati, Andrew Trusty, and Khai N. Truong. 2011. Review spotlight. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11. ACM Press, NY, NY, USA, 1541. DOI: http://dx.doi.org/10.1145/1978942.1979167","paperID":"None"},{"content":"Haibin Zhang, Yan Wang, and Xiuzhen Zhang. 2012. A trust vector approach to transaction context-aware trust evaluation in e-commerce and e-service environments. In Proceedings of the 5th IEEE International Conference on Service-Oriented Computing and Applications. Vol. SOCA. Taipei Taiwan, 1-8. DOI: http://dx.doi.org/10.1109/SOCA.2012.6449461","paperID":"None"}],"abstract":"Reputation systems in current electronic marketplaces can easily be manipulated by malicious sellers in order to appear more reputable than appropriate. We conducted a controlled experiment with 40 UK and 41 German participants on their ability to detect malicious behavior by means of an eBay-like feedback profile versus a novel interface involving an interactive visualization of reputation data. The results show that participants using the new interface could better detect and understand malicious behavior in three out of four attacks (the overall detection accuracy 77% in the new vs. 56% in the old interface). Moreover, with the new interface, only 7% of the users decided to buy from the malicious seller (the options being to buy from one of the available sellers or to abstain from buying), as opposed to 30% in the old interface condition.","title":"Look Before You Leap: Improving the Users' Ability to Detect Fraud in Electronic Marketplaces","filename":"CHI16/p3870","authors":["Johannes Sänger","Norman Hänsch","Brian Glass","Zinaida Benenson","Robert Landwirth","M. Angela Sasse"],"conference":"CHI '16"}