{"paperId":2858377,"citation":[],"reference":[{"content":"Anne Adams and Martina Angela Sasse. 1999. Users are not the enemy. Commun. ACM 42, 12 (1999), 40--46. DOI: http://dx.doi.org/10.1145/322796.322806","paperID":"None"},{"content":"Dirk Balfanz, Diana K Smetters, Paul Stewart, and H Chi Wong. 2002. Talking to Strangers: Authentication in Ad-Hoc Wireless Networks. In NDSS.","paperID":"None"},{"content":"Julia Barret and Helmut Krueger. 1994. Performance effects of reduced proprioceptive feedback on touch typists and casual users in a typing task. Behaviour & Information Technology 13, 6 (1994). DOI: http://dx.doi.org/10.1080/01449299408914618","paperID":"None"},{"content":"Berg Cloud Limited. 2014. Cloud Wash. (2014). http://bergcloud.com/case-studies/cloudwash/","paperID":"None"},{"content":"Roy Brener. 1940. An experimental investigation of memory span. Journal of Experimental Psychology 26, 5 (1940), 467--482. DOI: http://dx.doi.org/10.1037/h0061096","paperID":"None"},{"content":"Duncan P. Brumby, Anna L. Cox, Jonathan Back, and Sandy J. J. Gould. 2013. Recovering from an interruption: Investigating speed-accuracy trade-offs in task resumption behavior. Journal of Experimental Psychology: Applied 19, 2 (2013), 95--107. DOI: http://dx.doi.org/10.1037/a0032696","paperID":"None"},{"content":"Abigail Cauchi, Andy Gimblett, Harold Thimbleby, Paul Curzon, and Paolo Masci. 2012. Safer \"5-key\" number entry user interfaces using Differential Formal Analysis. In Proceedings of the 2012 BCS Conference on Human-Computer Interaction. 29--38.","paperID":"None"},{"content":"Easy Bulb. 2015. Easy Bulb. (2015). http://easybulb.com/","paperID":"None"},{"content":"EMC Corporation. 2015. RSA. (2015). http://www.emc.com/domains/rsa/index.htm","paperID":"None"},{"content":"Melissa A Gallagher and Michael D Byrne. 2015. Modeling Password Entry on a Mobile Device Modeling. In Proceedings of the International Conference on Cognitive Modeling. 45--50.","paperID":"None"},{"content":"Richard H Guski, Raymond C Larson, Syephen M Matyas Jr, Donald B Johnson, and Don Coppersmith. 1997. Authentication system using one-time passwords. (1997). https://www.google.com/patents/US5592553","paperID":"None"},{"content":"Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. Advances in psychology 52 (1988), 139--183. DOI: http://dx.doi.org/10.1016/S0166--4115(08)62386--9","paperID":"None"},{"content":"Eve Hoggan, Stephen A Brewster, and Jody Johnston. 2008. Investigating the Effectiveness of Tactile Feedback for Mobile Touchscreens. In Proceedings of the SIGCHI conference on Human factors in computing systems. 1573--1582. DOI: http://dx.doi.org/10.1145/1357054.1357300","paperID":"None"},{"content":"Phillip Inglesant and M. Angela Sasse. 2010. The true cost of unusable password policies: password use in the wild. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 383--392. DOI: http://dx.doi.org/10.1145/1753326.1753384","paperID":"None"},{"content":"Ronald Kainda, Ivan Flechais, and A.W. Roscoe. 2009. Usability and Security of Out-Of-Band Channels in Secure Device Pairing Protocols. In Symposium on Usable Privacy and Security. DOI: http://dx.doi.org/10.1145/1572532.1572547","paperID":"None"},{"content":"Ronald Kainda, Ivan Flechais, and A. W. Roscoe. 2010. Secure and Usable Out-Of-Band Channels for Ad Hoc Mobile Device Interactions. Information Security Theory and Practices. Security and Privacy of Pervasive Systems and Smart Devices 6033 (2010), 308--315. DOI: http://dx.doi.org/10.1007/978--3--642--12368--9","paperID":"None"},{"content":"Alfred Kobsa, Gene Tsudik, and Yang Wang. 2009. Serial Hook-ups : A Comparative Usability Study of Secure Device Pairing Methods. In Proceedings of the 5th Symposium on Usable Privacy and Security. DOI: http://dx.doi.org/10.1145/1572532.1572546","paperID":"None"},{"content":"Nest Labs. 2015. Nest. (2015). https://nest.com/","paperID":"None"},{"content":"Sean O'Haplin, Chris Needham, and Michael Barroco. 2014. The Cross Platform Authentication Protocol. Technical Report September. EBU Operating Eurovision And Euroradio, Geneva. 1--39 pages.","paperID":"None"},{"content":"Adrian Perrig and Dawn Song. 1999. Hash Visualization : a New Technique to improve Real-World Security. International Workshop on Cryptographic Techniques and E-Commerce (1999), 1--8.","paperID":"None"},{"content":"Ramnath Prasad and Nitesh Saxena. 2008. Efficient device pairing using \"human-comparable\" synchronized audiovisual patterns. In Applied Cryptography and Network Security. 328--345. DOI: http://dx.doi.org/10.1007/978--3--540--68914-0{_}20","paperID":"None"},{"content":"Timothy A. Salthouse. 1986. Perceptual, cognitive, and motoric aspects of transcription typing. Psychological bulletin 99, 3 (1986), 303--319. DOI: http://dx.doi.org/10.1037/0033--2909.99.3.303","paperID":"None"},{"content":"Jan Maarten Schraagen and Kees van Dongen. 2005. Designing a licence plate for memorability. Ergonomics 48, 7 (2005), 796--806. DOI: http://dx.doi.org/10.1080/00140130500123720","paperID":"None"},{"content":"Reginald Smith. 2012. Distinct word length frequencies: distributions and symbol entropies. Glottometrics 23 (2012), 7--22.","paperID":"None"},{"content":"Ersin Uzun, Kristiina Karvonen, and N. Asokan. 2007. Usability Analysis of Secure Pairing Methods. Financial Cryptography and Data Security (2007), 307--324. DOI: http://dx.doi.org/10.1007/978--3--540--77366--5_29","paperID":"None"},{"content":"Sarah Wiseman, Anna L. Cox, Duncan P. Brumby, Sandy J. J. Gould, and Sarah O'Carroll. 2013a. Using Checksums to Detect Number Entry Error. In Proceedings of the SIGCHI Conference on Human Factors in Computing. 2403--2406. DOI: http://dx.doi.org/10.1145/2470654.2481332","paperID":"None"},{"content":"Sarah Wiseman, Orla Hennessy, Anna L. Cox, and Duncan P. Brumby. 2013b. Tailoring Number Entry Interfaces To The Task of Programming Medical Infusion Pumps. In International Annual Meeting of the Human Factors and Ergonomics Society. 683--687. DOI: http://dx.doi.org/10.1177/1541931213571148","paperID":"None"}],"abstract":"The Internet of Things is connecting an ever-increasing number of devices. These devices often require access to personal information, but their meagre user interfaces usually do not permit traditional modes of authentication. On such devices, one-time pairing codes are often used instead. This pairing process can involve transcribing randomly generated alphanumeric codes, which can be frustrating, slow and error-prone. In this paper, we present an improved pairing method that uses sets of English words instead of random strings. The word method, although longer in terms of character length, allows users to pair devices more quickly, whilst still maintaining the complexity necessary for secure interactions.","title":"Use Your Words: Designing One-time Pairing Codes to Improve User Experience","filename":"CHI16/p1385","authors":["Sarah Wiseman","Gustavo Soto Mino","Anna L. Cox","Sandy J.J. Gould","Joanne Moore","Chris Needham"],"conference":"CHI '16"}