{"paperId":2858464,"citation":[],"abstract":"Multiplayer online battle arena games provide an excellent opportunity to study team performance. When designing a team, players must negotiate a proficiency-congruency dilemma between selecting roles that best match their experience and roles that best complement the existing roles on the team. We adopt a mixed-methods approach to explore how players negotiate this dilemma. Using data from League of Legends, we define a similarity space to operationalize team design constructs about role proficiency, generality, and congruency. We collect publicly available data from 3.36 million players to test the influence of these constructs on team performance. We also conduct focus groups with novice and elite players to understand how players' team design practices vary with expertise. We find that the two factors, player proficiency and team congruency, both increase team performance, with the former having a stronger impact. We also find that elite players are better at balancing the two factors than the novice players. These findings have implications for players, designers, and theorists about how to recommend team designs that jointly prioritize individuals' expertise and teams' compatibility.","reference":[{"content":"Albert Bandura. 1977. Self-efficacy: Toward a unifying theory of behavioral change. Psychological Review 84, 2 (1977), 191-215. DOI: http://dx.doi.org/10.1037/0033295X.84.2.191","paperID":"None"},{"content":"Shaowen Bardzell, Jeffrey Bardzell, Tyler Pace, and Kayce Reed. 2008. Blissfully Productive: Grouping and Cooperation in World of Warcraft Instance Runs. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, NY, NY, USA, 357-360. DOI: http://dx.doi.org/10.1145/1460563.1460621","paperID":"None"},{"content":"Beth A. Bechky. 2006. Gaffers, Gofers, and Grips: Role-Based Coordination in Temporary Organizations. Organization Science 17, 1 (2006), 3-21. DOI: http://dx.doi.org/10.1287/orsc.1050.0149","paperID":"None"},{"content":"Jeremy Blackburn and Haewoon Kwak. 2014. STFU NOOB!: Predicting Crowdsourced Decisions on Toxic Behavior in Online Games. In Proceedings of the 23rd International Conference on World Wide Web (WWW '14). ACM, NY, NY, USA, 877-888. DOI: http://dx.doi.org/10.1145/2566486.2567987","paperID":"None"},{"content":"Bret H. Bradley, John E. Baur, Christopher G. Banford, and Bennett E. Postlethwaite. 2013. Team Players and Collective Performance How Agreeableness Affects Team Performance Over Time. Small Group Research 44, 6 (2013), 680-711. DOI: http://dx.doi.org/10.1177/1046496413507609","paperID":"None"},{"content":"J. Stuart Bunderson and Kathleen M. Sutcliffe. 2002. Comparing Alternative Conceptualizations of Functional Diversity in Management Teams: Process and Performance Effects. Academy of Management Journal 45, 5 (2002), 875-893. DOI: http://dx.doi.org/10.2307/3069319","paperID":"None"},{"content":"Janis A. Cannon-Bowers, SI Tannenbaum, Eduardo Salas, and C.E. Volpe. Defining team competencies and establishing team training requirements. In Team Effectiveness and Decision Making in Organizations.","paperID":"None"},{"content":"Susan G Cohen and Diane E Bailey. 1997. What makes teams work: Group effectiveness research from the shop floor to the executive suite. Journal of management 23, 3 (1997), 239-290.","paperID":"None"},{"content":"David V. Day, Sandy Gordon, and Corinna Fink. 2012. The Sporting Life: Exploring Organizations through the Lens of Sport. The Academy of Management Annals 6, 1 (2012), 397-433. DOI: http://dx.doi.org/10.1080/19416520.2012.678697","paperID":"None"},{"content":"Rajeev H. Dehejia and Sadek Wahba. 2002. Propensity Score-Matching Methods for Nonexperimental Causal Studies. Review of Economics and Statistics 84, 1 (2002), 151-161. DOI: http://dx.doi.org/10. 1162/003465302317331982","paperID":"None"},{"content":"D. Scott DeRue and John R. Hollenbeck. 2007. The search for internal and external fit in teams. In Perspectives on organizational fit, Cheri Ostroff and Timothy A. Judge (Eds.). 259-285.","paperID":"None"},{"content":"Richard P. DeShon, Steve W. J. Kozlowski, Aaron M. Schmidt, Karen R. Milner, and Darin Wiechmann. 2004. A Multiple-Goal, Multilevel Model of Feedback Effects on the Regulation of Individual and Team Performance. Journal of Applied Psychology 89, 6 (2004), 1035-1056. DOI: http://dx.doi.org/10.1037/00219010.89.6.1035","paperID":"None"},{"content":"Scott Donaldson. 2015. Mechanics and Metagame: Exploring Binary Expertise in League of Legends. Games and Culture (June 2015), 1555412015590063. DOI: http://dx.doi.org/10.1177/1555412015590063","paperID":"None"},{"content":"A. Drachen, M. Yancey, J. Maguire, D. Chu, I.Y. Wang, T. Mahlmann, M. Schubert, and D. Klabajan. 2014. Skill-based differences in spatio-temporal team behaviour in defence of the Ancients 2 (DotA 2). In Proceedings of Games Media Entertainment (GEM '14). 1-8. DOI: http://dx.doi.org/10.1109/GEM.2014.7048109","paperID":"None"},{"content":"Jeffrey R. Edwards. 2008. Person Environment Fit in Organizations: An Assessment of Theoretical Progress. The Academy of Management Annals 2, 1 (2008), 167-230. DOI: http://dx.doi.org/10.1080/19416520802211503","paperID":"None"},{"content":"Christoph Eggert, Marc Herrlich, Jan Smeddinck, and Rainer Malaka. 2015. Classification of Player Roles in the Team-Based Multi-player Game Dota 2. In Proceedings of the 2015 International Conference on Entertainment Computing (ICEC'15). Springer International Publishing, 112-125. DOI: http://dx.doi.org/10.1007/978--3--31924589--8_9","paperID":"None"},{"content":"Magy Seif El-Nasr, Anders Drachen, and Alessandro Canossa. 2013. Game analytics: Maximizing the value of player data. Springer Science & Business Media.","paperID":"None"},{"content":"Satu Elo and Helvi Kyngäs. 2008. The qualitative content analysis process. Journal of advanced nursing 62, 1 (2008), 107-115.","paperID":"None"},{"content":"K. A. Ericsson and A. C. Lehmann. 1996. Expert and Exceptional Performance: Evidence of Maximal Adaptation to Task Constraints. Annual Review of Psychology 47, 1 (1996), 273-305. DOI: http://dx.doi.org/10.1146/annurev.psych.47.1.273","paperID":"None"},{"content":"James H. Frey and D. Stanley Eitzen. 1991. Sport and Society. Annual Review of Sociology 17 (1991), 503-522. DOI: http://dx.doi.org/10.1146/annurev.soc.17.1.503","paperID":"None"},{"content":"Riot Games. 2014. League Players Reach New Heights in 2014. (2014). http://www.riotgames.com/articles/20140711/1322/leagueplayers-reach-new-heights-2014.","paperID":"None"},{"content":"Riot Games. 2015a. Game Information -- Champions. (2015). http://gameinfo.na.leagueoflegends.com/en/game-info/champions/.","paperID":"None"},{"content":"Riot Games. 2015b. Matchmaking Guide. (2015). https://support.riotgames.com/hc/enus/articles/201752954-MatchmakingGuide.","paperID":"None"},{"content":"Riot Games. 2015c. Ranked Play FAQ. (2015). https://support.riotgames.com/hc/enus/articles/204010760-Ranked-Play-FAQ.","paperID":"None"},{"content":"Riot Games. 2015d. Riot Games API. (2015). https://developer.riotgames.com/.","paperID":"None"},{"content":"Riot Games. 2015e. Riot Games Support -- Separate Servers. (2015). https://support.riotgames.com/hc/enus/articles/201751684-SeparateServers.","paperID":"None"},{"content":"Riot Games. 2015f. Static Data API -- Champions. (2015). http://ddragon.leagueoflegends.com/cdn/5.22.3/data/en_US/champion.json.","paperID":"None"},{"content":"Michele J. Gelfand, Miriam Erez, and Zeynep Aycan. 2007. Cross-Cultural Organizational Behavior. Annual Review of Psychology 58, 1 (2007), 479-514. DOI: http://dx.doi.org/10.1146/annurev. psych.58.110405.085559","paperID":"None"},{"content":"Robert Glaser and Michelene T. H. Chi. 1988. Overview. In The Nature of Expertise, Michelene T. H. Chi, Robert Glaser, and Marshall J. Farr (Eds.). Lawrence Erlbaum, xv - xxviii.","paperID":"None"},{"content":"Paul Goodman and Samir Shah. 1992. Familiarity and Work Group Outcomes. In Group Process and Productivity, Stephen Worchel, Wendy Wood, and Jeffry Simpson (Eds.). 276-298.","paperID":"None"},{"content":"Richard A. Guzzo and Marcus W. Dickson. 1996. Teams in Organizations: Recent Research on Performance and Effectiveness. Annual Review of Psychology 47, 1 (1996), 307-338. DOI: http://dx.doi.org/10.1146/annurev.psych.47.1.307","paperID":"None"},{"content":"Harold. 2015. Match duration analysis. (2015). http://www.leaguemath.com/matchduration-analysis/.","paperID":"None"},{"content":"David A. Harrison, Susan Mohammed, Joseph E. McGrath, Anna T. Florey, and Scott W. Vanderstoep. 2003. Time matters in team performance: Effects of member familiarity, entrainment, and task discontinuity on speed and quality. Personnel Psychology 56, 3 (2003), 633-669.","paperID":"None"},{"content":"HawatLoL. 2013. How likely will a Pro Team win after getting first blood? (2013). https://www.reddit.com/r/leagueoflegends/comments/1bb19p/how_likely_will_a_pro_team_win_after_getting/.","paperID":"None"},{"content":"Sujin K. Horwitz and Irwin B. Horwitz. 2007. The Effects of Team Diversity on Team Outcomes: A Meta-Analytic Review of Team Demography. Journal of Management 33, 6 (2007), 987-1015. DOI: http://dx.doi.org/10.1177/0149206307308587","paperID":"None"},{"content":"Jeff Huang, Thomas Zimmermann, Nachiappan Nagapan, Charles Harrison, and Bruce C. Phillips. 2013b. Mastering the Art of War: How Patterns of Gameplay Influence Skill in Halo. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 695-704. DOI: http://dx.doi.org/10.1145/2470654.2470753","paperID":"None"},{"content":"Yun Huang, Wenyue Ye, Nicholas Bennett, and Noshir Contractor. 2013a. Functional or Social?: Exploring Teams in Online Games. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, NY, NY, USA, 399-408. DOI: http://dx.doi.org/10.1145/2441776.2441822","paperID":"None"},{"content":"Robert S. Huckman and Bradley R. Staats. 2011. Fluid Tasks and Fluid Teams: The Impact of Diversity in Experience and Team Familiarity on Team Performance. Manufacturing & Service Operations Management 13, 3 (2011), 310-328. DOI: http://dx.doi.org/10.1287/msom.1100.0321","paperID":"None"},{"content":"Robert S. Huckman, Bradley R. Staats, and David M. Upton. 2008. Team Familiarity, Role Experience, and Performance: Evidence from Indian Software Services. Management Science 55, 1 (2008), 85-100. DOI: http://dx.doi.org/10.1287/mnsc.1080.0921","paperID":"None"},{"content":"David Huffaker, Jing Wang, J. Treem, M.A. Ahmad, L. Fullerton, D. Williams, M.S. Poole, and N. Contractor. The Social Behaviors of Experts in Massive Multiplayer Online Role-Playing Games. In IEEE International Conference on Computational Science and Engineering, Vol. 4. DOI: http://dx.doi.org/10.1109/CSE.2009.13","paperID":"None"},{"content":"Alexandru Iosup, Ruud Van De Bovenkamp, Siqi Shen, Adele Lu Jia, and Fernando Kuipers. 2014. An Analysis of Implicit Social Networks in Multiplayer Online Games. IEEE Internet Computing 18 (2014). Issue 3.","paperID":"None"},{"content":"Daniel Johnson, Lennart E. Nacke, and Peta Wyeth. 2015. All About That Base: Differing Player Experiences in Video Game Genres and the Unique Case of MOBA Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2265-2274. DOI: http://dx.doi.org/10.1145/2702123.2702447","paperID":"None"},{"content":"Stefanie K. Johnson, Kenneth Bettenhausen, and Ellie Gibbons. 2009. Realities of Working in Virtual Teams: Affective and Attitudinal Outcomes of Using Computer-Mediated Communication. Small Group Research 40, 6 (2009), 623-649. DOI: http://dx.doi.org/10.1177/1046496409346448","paperID":"None"},{"content":"Brian C. Keegan, Shakked Lev, and Ofer Arazy. 2016. Analyzing Organizational Routines in Online Knowledge Collaborations: A Case for Sequence Analysis in CSCW. In Proceedings of the 2016 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '16). ACM, NY, NY, USA, 257-266.","paperID":"None"},{"content":"Norbert L. Kerr and R. Scott Tindale. 2004. Group Performance and Decision Making. Annual Review of Psychology 55, 1 (2004), 623-655. DOI: http://dx.doi.org/10.1146/annurev. psych.55.090902.142009","paperID":"None"},{"content":"Richard Klimoski and Susan Mohammed. 1994. Team mental model: construct or metaphor? Journal of Management 20, 2 (1994). DOI: http://dx.doi.org/10.1016/01492063(94)90021--3","paperID":"None"},{"content":"Peter Kollock. 1998. Social Dilemmas: The Anatomy of Cooperation. Annual Review of Sociology 24, 1 (1998), 183-214. DOI: http://dx.doi.org/10.1146/annurev.soc.24.1.183","paperID":"None"},{"content":"Yubo Kou and Xinning Gui. 2014. Playing with Strangers: Understanding Temporary Teams in League of Legends. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 161-169. DOI: http://dx.doi.org/10.1145/2658537.2658538","paperID":"None"},{"content":"Steve W. J. Kozlowski and Bradford S. Bell. 2003. Work Groups and Teams in Organizations. In Handbook of Psychology. John Wiley & Sons, Inc.","paperID":"None"},{"content":"Steve W. J. Kozlowski and Daniel R. Ilgen. 2006. Enhancing the Effectiveness of Work Groups and Teams. Psychological Science in the Public Interest 7, 3 (2006), 77-124. DOI: http://dx.doi.org/10.1111/j.15291006.2006.00030.x","paperID":"None"},{"content":"Amy L. Kristof. 1996. Person-Organization Fit: An Integrative Review of Its Conceptualizations, Measurement, and Implications. Personnel Psychology 49, 1 (1996), 1-49. DOI: http://dx.doi.org/10.1111/j.17446570.1996.tb01790.x","paperID":"None"},{"content":"Amy L. Kristof-Brown, Ryan D. Zimmerman, and Erin C. Johnson. 2005. Consequences of Individuals' Fit at Work: A Meta-Analysis of Person-Job, Person-Organization, Person-Group, and Person-Supervisor Fit. Personnel Psychology 58, 2 (2005), 281-342. DOI: http://dx.doi.org/10.1111/j.17446570.2005.00672.x","paperID":"None"},{"content":"Haewoon Kwak, Jeremy Blackburn, and Seungyeop Han. 2015. Exploring Cyberbullying and Other Toxic Behavior in Team Competition Online Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3739-3748. DOI: http://dx.doi.org/10.1145/2702123.2702529","paperID":"None"},{"content":"Yannick LaJacq. 2014. Yes, The Blue Team Has An Advantage In League of Legends. Kotaku (2014). http://kotaku.com/yes-the-blue-teamhas-an-advantage-in-league-of-legend1578533860.","paperID":"None"},{"content":"Andrew James Latham, Lucy L. M. Patston, and Lynette J. Tippett. 2013. Just how expert are \"expert\" video-game players? Assessing the experience and expertise of video-game players across \"action\" video-game genres. Cognition 4 (2013), 941. DOI: http://dx.doi.org/10.3389/fpsyg.2013.00941","paperID":"None"},{"content":"Leaguepedia. 2013. Snowballing in Competitive Play: A look at the data. (2013). http://lol.gamepedia.com/Articles:Snowballing_in_Competitive_Play:_A_look_at_the_data.","paperID":"None"},{"content":"James G. March. 1991. Exploration and Exploitation in Organizational Learning. Organization Science 2, 1 (1991), 71-87.","paperID":"None"},{"content":"Michelle A. Marks, John E. Mathieu, and Stephen J. Zaccaro. 2001. A Temporally Based Framework and Taxonomy of Team Processes. The Academy of Management Review 26, 3 (2001), 356-376. DOI: http://dx.doi.org/10.2307/259182","paperID":"None"},{"content":"Winter Mason and Aaron Clauset. 2013. Friends FTW! Friendship and Competition in Halo: Reach. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, NY, NY, USA, 375-386. DOI: http://dx.doi.org/10.1145/2441776.2441820","paperID":"None"},{"content":"John Mathieu, M. Travis Maynard, Tammy Rapp, and Lucy Gilson. 2008. Team Effectiveness 1997--2007: A Review of Recent Advancements and a Glimpse Into the Future. Journal of Management 34, 3 (2008), 410-476. DOI: http://dx.doi.org/10.1177/0149206308316061","paperID":"None"},{"content":"Joseph E. Mcgrath, Holly Arrow, Deborah H. Gruenfeld, Andrea B. Hollingshead, and Kathleen M. O'Connor. 1993. Groups, Tasks, and Technology The Effects of Experience and Change. Small Group Research 24, 3 (1993), 406-420. DOI: http://dx.doi.org/10.1177/1046496493243007","paperID":"None"},{"content":"Paul M Muchinsky and Carlyn J Monahan. 1987. What is person-environment congruence? Supplementary versus complementary models of fit. Journal of Vocational Behavior 31, 3 (1987), 268-277. DOI: http://dx.doi.org/10.1016/00018791(87)90043--1","paperID":"None"},{"content":"Peter E. Mudrack. 1989. Defining Group Cohesiveness A Legacy of Confusion? Small Group Research 20, 1 (1989), 37-49. DOI: http://dx.doi.org/10. 1177/104649648902000103","paperID":"None"},{"content":"Bonnie Nardi and Justin Harris. 2006. Strangers and Friends: Collaborative Play in World of Warcraft. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (CSCW '06). ACM, NY, NY, USA. DOI: http://dx.doi.org/10.1145/1180875.1180898","paperID":"None"},{"content":"League of Graphs. 2015. Win Stats -- Blue Team vs. Red Team. (2015). http://www.leagueofgraphs.com/rankings/win-stats.","paperID":"None"},{"content":"Hao Yi Ong, Sunil Deolalikar, and Mark Peng. 2015. Player Behavior and Optimal Team Composition for Online Multiplayer Games. arXiv preprint arXiv:1503.02230 (2015).","paperID":"None"},{"content":"Rabindra A. Ratan, Nicholas Taylor, Jameson Hogan, Tracy Kennedy, and Dmitri Williams. 2015. Stand by Your Man An Examination of Gender Disparity in League of Legends. Games and Culture 10, 5 (2015), 438-462. DOI: http://dx.doi.org/10.1177/1555412014567228","paperID":"None"},{"content":"Stuart Reeves, Barry Brown, and Eric Laurier. 2009. Experts at Play Understanding Skilled Expertise. Games and Culture 4, 3 (2009), 205-227. DOI: http://dx.doi.org/10.1177/1555412009339730","paperID":"None"},{"content":"Michael Rutter. 2007. Proceeding From Observed Correlation to Causal Inference: The Use of Natural Experiments. Perspectives on Psychological Science 2, 4 (2007), 377-395. DOI: http://dx.doi.org/10.1111/j.17456916.2007.00050.x","paperID":"None"},{"content":"E. Salas. 2005. Is there a \"Big Five\" in Teamwork? Small Group Research 36, 5 (2005), 555-599. DOI: http://dx.doi.org/10.1177/1046496405277134","paperID":"None"},{"content":"Magy Seif El-Nasr, Bardia Aghabeigi, David Milam, Mona Erfani, Beth Lameman, Hamid Maygoli, and Sang Mah. 2010. Understanding and Evaluating Cooperative Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 253-262. DOI: http://dx.doi.org/10.1145/1753326.1753363","paperID":"None"},{"content":"Jee Young Seong, Amy L. Kristof-Brown, Won-Woo Park, Doo-Seung Hong, and Yuhyung Shin. 2012. Person-Group Fit Diversity Antecedents, Proximal Outcomes, and Performance at the Group Level. Journal of Management (2012), 0149206312453738. DOI: http://dx.doi.org/10.1177/0149206312453738","paperID":"None"},{"content":"Kenneth B. Shores, Yilin He, Kristina L. Swanenburg, Robert Kraut, and John Riedl. 2014. The Identification of Deviance and Its Impact on Retention in a Multiplayer Game. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, NY, NY, USA, 1356-1365. DOI: http://dx.doi.org/10.1145/2531602.2531724","paperID":"None"},{"content":"D. Sandy Staples and Jane Webster. 2007. Exploring Traditional and Virtual Team Members' \"Best Practices\": A Social Cognitive Theory Perspective. Small Group Research 38, 1 (2007), 60-97. DOI: http://dx.doi.org/10.1177/1046496406296961","paperID":"None"},{"content":"Michael J. Stevens and Michael A. Campion. 1994. The knowledge, skill, and ability requirements for teamwork: Implications for human resource management. Journal of Management 20, 2 (1994), 503-530. DOI: http://dx.doi.org/10.1016/01492063(94)90025--6","paperID":"None"},{"content":"Greg L. Stewart. 2006. A Meta-Analytic Review of Relationships Between Team Design Features and Team Performance. Journal of Management 32, 1 (2006), 29-55. DOI: http://dx.doi.org/10.1177/0149206305277792","paperID":"None"},{"content":"Andy Stirling. 2007. A general framework for analysing diversity in science, technology and society. Journal of The Royal Society Interface 4, 15 (2007), 707-719. DOI: http://dx.doi.org/10.1098/rsif.2007.0213","paperID":"None"},{"content":"David R Thomas. 2006. A general inductive approach for analyzing qualitative evaluation data. American journal of evaluation 27, 2 (2006), 237-246.","paperID":"None"},{"content":"Bruce W. Tuckman and Mary Ann C. Jensen. Stages of Small-Group Development Revisited. Group & Organization Management 2, 4 (????). DOI: http://dx.doi.org/10.1177/105960117700200404","paperID":"None"},{"content":"Melissa A. Valentine and Amy C. Edmondson. 2014. Team Scaffolds: How Mesolevel Structures Enable Role-Based Coordination in Temporary Groups. Organization Science 26, 2 (2014), 405-422. DOI: http://dx.doi.org/10.1287/orsc.2014.0947","paperID":"None"},{"content":"Rodrigo Vicencio-Moreira, Regan L. Mandryk, and Carl Gutwin. 2015. Now You Can Compete With Anyone: Balancing Players of Different Skill Levels in a First-Person Shooter Game. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2255-2264. DOI:http: //dx.doi.org/10.1145/2702123.2702242","paperID":"None"},{"content":"Ruth Wageman, J. Richard Hackman, and Erin Lehman. 2005. Team Diagnostic Survey Development of an Instrument. The Journal of Applied Behavioral Science 41, 4 (2005), 373-398.","paperID":"None"},{"content":"Wikia. 2015. League system. (2015). http://leagueoflegends.wikia.com/wiki/League_system.","paperID":"None"},{"content":"Dmitri Williams. 2010. The Mapping Principle, and a Research Framework for Virtual Worlds. Communication Theory 20, 4 (2010), 451-470. DOI: http://dx.doi.org/10.1111/j.14682885.2010.01371.x","paperID":"None"},{"content":"J. Patrick Williams and David Kirschner. 2012. Coordinated Action in the Massively Multiplayer Online Game World of Warcraft. Symbolic Interaction 35, 3 (2012), 340-367. DOI: http://dx.doi.org/10.1002/symb.22","paperID":"None"},{"content":"Richard A. Wolfe, Karl E. Weick, John M. Usher, James R. Terborg, Laura Poppo, Audrey J. Murrell, Janet M. Dukerich, Deborah Crown Core, Kevin E. Dickson, and Jessica Simmons Jourdan. 2005. Sport and Organizational Studies Exploring Synergy. Journal of Management Inquiry 14, 2 (2005), 182-210. DOI: http://dx.doi.org/10.1177/1056492605275245","paperID":"None"},{"content":"Yan Xu, Xiang Cao, Abigail Sellen, Ralf Herbrich, and Thore Graepel. 2011. Sociable Killers: Understanding Social Relationships in an Online First-person Shooter Game. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, NY, NY, USA, 197-206. DOI: http://dx.doi.org/10.1145/1958824.1958854","paperID":"None"},{"content":"Nick Yee. 2006. The Labor of Fun How Video Games Blur the Boundaries of Work and Play. Games and Culture 1, 1 (2006), 68-71. DOI: http://dx.doi.org/10.1177/1555412005281819","paperID":"None"},{"content":"Mary E. Zellmer-Bruhn, Mary M. Maloney, Anita D. Bhappu, and Rommel (Bombie) Salvador. 2008. When and how do differences matter? An exploration of perceived similarity in teams. Organizational Behavior and Human Decision Processes 107, 1 (2008), 41-59. DOI: http://dx.doi.org/10.1016/j.obhdp.2008.01.004","paperID":"None"}],"title":"The Proficiency-Congruency Dilemma: Virtual Team Design and Performance in Multiplayer Online Games","filename":"CHI16/p4351","authors":["Jooyeon Kim","Brian C. Keegan","Sungjoon Park","Alice Oh"],"conference":"CHI '16"}