{"paperId":2858176,"citation":[],"abstract":"Project Jacquard presents manufacturing technologies that enable deploying invisible ubiquitous interactivity at scale. We propose novel interactive textile materials that can be manufactured inexpensively using existing textile weaving technology and equipment.The development of touch-sensitive textiles begins with the design and engineering of a new highly conductive yarn. The yarns and textiles can be produced by standard textile manufacturing processes and can be dyed to any color, made with a number of materials, and designed to a variety of thicknesses and textures to be consistent with garment designers' needs.We describe the development of yarn, textiles, garments, and user interactivity; we present the opportunities and challenges of creating a manufacturable interactive textile for wearable computing.","reference":[{"content":"Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. 2008. The LilyPad Arduino: Using computational textiles to investigate engagement, aesthetics, and diversity in computer science education. In CHI '08, 423--432.","paperID":"None"},{"content":"Leah Buechley, Kanjun Qui, and Sonja De Boer. 2013. Sew Electric:A collection of projects that combine fabric, electronics, and programming, HLT Press.","paperID":"None"},{"content":"Diana Marculescu, et al.(2003). Electronic textiles: A platform for pervasive computing. Proceedings of the IEEE, 91(12), 1995--2018.","paperID":"None"},{"content":"Lina M. Castano and Alison B. Flatau. 2014. Smart fabric sensors and e-textile technologies: a review. Smart Mater. Struct. 23, 5 (May 2014), 053001.","paperID":"None"},{"content":"D. Congalton. 1999. Shape memory alloys for use in thermally activated clothing, protection against flame and heat. Fire Mater. 23, 5","paperID":"None"},{"content":"Priya Ganapati. 2010. Smart Textiles Blend LEDs, Circuits and Sensors . (2010). Retrieved September 18, 2015 from http://www.wired.com/2010/06/gallery-smart-textiles/","paperID":"None"},{"content":"F. Gemperle, C. Kasabach, J. Stivoric, M. Bauer, and R. Martin. 1998. Design for wearability. Dig. Pap. Second Int. Symp. Wearable Comput. (Cat. No.98EX215) (1998).","paperID":"None"},{"content":"Google. 2015a. Google Glass. (2015). Retrieved September 18, 2015 from https://www.google.com/glass/start/","paperID":"None"},{"content":"Google. 2015b. Welcome to Project Soli. (2015). Retrieved September 18, 2015 from https://www.youtube.com/watch?v=0QNiZfSsPc0","paperID":"None"},{"content":"Paul Holleis, Albrecht Schmidt, Susanna Paasovaara, Arto Puikkonen, and Jonna Häkkilä. 2008. Evaluating capacitive touch input on clothes. In MobileHCI '08. ACM Press, 81--90.","paperID":"None"},{"content":"Thorsten Karrer, Moritz Wittenhagen, Leonhard Lichtschlag, Florian Heller, and Jan Borchers. 2011. Pinstripe: Eyes-free Continuous Input on Interactive Clothing. In Proceedings of the 2011 annual conference on Human factors in computing systems CHI '11. ACM Press, 1313--1322.","paperID":"None"},{"content":"James F. Knight et al. 2007. Assessing the wearability of wearable computers. In Proceedings International Symposium on Wearable Computers, ISWC. 75--82.","paperID":"None"},{"content":"Seulki Lee, Binhee Kim, and Hoi-Jun Yoo. 2009. Planar Fashionable Circuit Board Technology and Its Applications. 2009. Sixth International Workshop on Wearable and Implantable Body Sensor Networks, 2009. BSN 2009, pp 282--285.","paperID":"None"},{"content":"Julian Lepinski and Roel Vertegaal. 2011. Cloth displays: interacting with drapable textile screens. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction. TEI '11. ACM, 285--288.","paperID":"None"},{"content":"Harrison, C. and Faste, H. 2014. Implications of Location and Touch for On-Body Projected Interfaces. In Proceedings of the 10th Biennial ACM Conference on Designing Interactive Systems (Vancouver, Canada, June 21-25, 2014). DIS '14. ACM, NY, NY. 543--552.","paperID":"None"},{"content":"Ernest Rehmi Post, Maggie Orth, P.R. Russo, and Neil Gershenfeld. 2000. E-broidery: Design and fabrication of textile-based computing. IBM Syst. J. 39, 3.4 (2000), 840--860.","paperID":"None"},{"content":"Halley Profita et al. 2013. Don't Mind Me Touching My Wrist: A Case Study of Interacting with On-Body Technology in Public. In ISWC 2013. 89--96.","paperID":"None"},{"content":"Thad Starner. 2001. The challenges of wearable computing: Part 2. IEEE Micro 21, 4 (2001), 54--67.","paperID":"None"},{"content":"Aaron Toney, Barrie Mulley, Bruce H. Thomas, and Wayne Piekarski. 2003. Social weight: Designing to minimise the social consequences arising from technology use by the mobile professional. Pers. Ubiquitous Comput. 7, 5 (2003), 309--320.","paperID":"None"},{"content":"Mark Weiser. 1991. The Computer for the 21st Century. Sci. Am. 265, 3 (1991), 94--104.","paperID":"None"},{"content":"Jeff Wilson, Bruce N. Walker, Jeffrey Lindsay, Craig Cambias, and Frank Dellaert. 2007. SWAN: System for wearable audio navigation. In Proceedings International Symposium on Wearable Computers, ISWC. 91--98.","paperID":"None"},{"content":"Leah Buechley, Kylie A. Peppler , Michael Eisenberg., and Yasmin B. Kafai 2013. Textile Messages: Dispatches From the World of E-Textiles and Education, Peter Lang, NY, NY, USA 2013.","paperID":"None"},{"content":"www.r-stat.fr/","paperID":"None"},{"content":"www.swicofil.com","paperID":"None"},{"content":"http://www.dupont.com/products-and-services/fabricsfibers-nonwovens/fibers/brands/kevlar.html"},{"content":"Berzowska, J. and Cohelo, M. 2005. 9th IEEE International Symposium on Wearable Computers, pp. 18--21.","paperID":"None"},{"content":"http://ww1.microchip.com/downloads/en/AppNotes/01 298A.pdf"},{"content":"http://ww1.microchip.com/downloads/en/DeviceDoc/4 1412F.pdf"},{"content":"Gloy YS, Renkens W, Herty M and Gries T. 2015. \"Simulation and optimisation of warp tension in the weaving process\" ISSN: 2165--8064 JTESE","paperID":"None"},{"content":"www.maggieorth.com","paperID":"None"},{"content":"Zenga spart and Interactive wear http://www.interactive-wear.de/cms/","paperID":"None"},{"content":"Addidas wearable sports electronics and Textronics, http://www.textronicsinc.com/,","paperID":"None"},{"content":"Sonsoria. http://www.sensoriafitness.com/","paperID":"None"},{"content":"Ogata, M., & Fukumoto, M., 2015. Flux Paper: Reinvent-ing Paper with Dynamic Actuation Powered by Magnetic Flux. In CHI 2015. ACM.","paperID":"None"},{"content":"Ergonomic Interaction for Touch Floors CHI 2015","paperID":"None"},{"content":"Togler, J., Hemmert, F., & Wettach, R. (2009). Living interfaces: The thrifty faucet. In TEI'09 (pp. 43--44). ACM. doi:10.1145/1517664.1517680","paperID":"None"},{"content":"Weigel, M., Lu, T., Bailly, G., Oulasvirta, A., Majidi, C., & Steimle, J. 2015. iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing. In CHI'2015 (pp. 1--10). ACM.","paperID":"None"},{"content":"Willis, K., Brockmeyer, E., Hudson, S., & Poupyrev, I. 2012. Printed optics: 3D printing of embedded opti-cal elements for interactive devices. In UIST '12 (pp. 589--598). ACM.","paperID":"None"},{"content":"Poupyrev, Nashida, & Okabe. (2007). Actuation and tangible user interfaces: the Vaucanson duck, robots, and shape displays. In Proceedings of TEI 2007 (pp. 205--212).","paperID":"None"},{"content":"Barber, Elizabeth Wayland, 1992. Prehistoric Tex-tiles: The Development of Cloth in the Neolithic and Bronze Ages with Special Reference to the Aegean, Princeton University Press ISBN 0-691-00224-X","paperID":"None"},{"content":"Alex \"Sandy\" Pentland 1998. Wearable Intelligence. Scientific American, 90--95.","paperID":"None"},{"content":"Barrett, G. and Omote, R. Projected-Capacitive Touch Technology. Information Display. (26) 3, 2010. 16--21","paperID":"None"},{"content":"Grace Ngai, Stephen C.F. Chan, Vincent T.Y. Ng, Joey C.Y. Cheung, Sam S.S. Choy, Winnie W.Y. Lau, and Jason T.P. Tse. 2010. i*CATch: a scalable plug-n-play wearable computing framework for novices and children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 443--452.","paperID":"None"},{"content":"Gregory D. Abowd and Elizabeth D. Mynatt. 2000. Charting past, present, and future research in ubiquitous computing. ACM Trans. Comput.-Hum. Interact. 7, 1 (March 2000), 29--58.","paperID":"None"},{"content":"Luigi Atzori, Antonio Iera, Giacomo Morabito, 2010. The Internet of Things: A survey, Computer Networks, Volume 54, Issue 15, 28 October 2010, Pages 2787--2805","paperID":"None"},{"content":"Daniele Miorandi, Sabrina Sicari, Francesco De Pellegrini, Imrich Chlamtac, 2012. Internet of things: Vision, applications and research challenges, Ad Hoc Networks, Volume 10, Issue 7, September 2012, Pages 1497--1516, ISSN 1570-8705,","paperID":"None"},{"content":"Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems (CHI '97)","paperID":"None"},{"content":"Mark Billinghurst, Hirokazu Kato, and Ivan Poupyrev. 2001. \"The magicbook-moving seamlessly between reality and virtuality.\" Computer Graphics and Applications, IEEE 21.3 (2001): 6--8.","paperID":"None"},{"content":"Azuma, Ronald T. \"A survey of augmented reality.\" Presence 6.4 (1997): 355--385.","paperID":"None"},{"content":"Skikos, C. http://cameliaskikos.com/","paperID":"None"},{"content":"Joanna Berzowska. and Maksim Skorobogatiy. 2010. Karma chameleon: bragg fiber jacquard-woven photonic textiles. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction (TEI '10). ACM, NY, NY, USA, 297--298.","paperID":"None"},{"content":"Sergio, M.; Manaresi, N.; Tartagni, M.; Guerrieri, R.; Canegallo, R., \"A textile based capacitive pressure sensor,\" in Sensors, 2002. Proceedings of IEEE, vol.2, no., pp.1625--1630 vol.2, 2002","paperID":"None"}],"title":"Project Jacquard: Interactive Digital Textiles at Scale","filename":"CHI16/p4216","authors":["Ivan Poupyrev","Nan-Wei Gong","Shiho Fukuhara","Mustafa Emre Karagozler","Carsten Schwesig","Karen E. Robinson"],"conference":"CHI '16"}