{"paperId":2858191,"citation":[],"reference":[{"content":"Paul Badger. Capacitive Sensing Library. Retrieved September 20, 2015 from http://playground.arduino.cc/Main/CapacitiveSensor.","paperID":"None"},{"content":"Dustin Beyer, Serafima Gurevich, Stefanie Mueller, Hsiang-Ting Chen, and Patrick Baudisch. 2015. Platener: Low-Fidelity Fabrication of 3D Objects by Substituting 3D Print with Laser-Cut Plates. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1799--806. DOI: http://dx.doi.org/10.1145/2702123.2702225","paperID":"None"},{"content":"Bernd Bickel, Moritz Bächer, Miguel A. Otaduy, Hyunho Richard Lee, Hanspeter Pfister, Markus Gross, and Wojciech Matusik. 2010. Design and Fabrication of Materials with Desired Deformation Behavior. In ACM SIGGRAPH 2010 Papers (SIGGRAPH '10). ACM, New York, NY, USA, Article 63, 10 pages. DOI: http://dx.doi.org/10.1145/1833349.1778800","paperID":"None"},{"content":"Eric Brockmeyer, Ivan Poupyrev, and Scott Hudson. 2013. PAPILLON: Designing Curved Display Surfaces with Printed Optics. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 457--462. DOI: http://dx.doi.org/10.1145/2501988.2502027","paperID":"None"},{"content":"Jesse Burstyn, Nicholas Fellion, Paul Strohmeier, and Roel Vertegaal. 2015. PrintPut: Resistive and Capacitive Input Widgets for Interactive 3D Prints. In Human-Computer Interaction INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Lecture Notes in Computer Science, Vol. 9296. Springer International Publishing, 332--339. DOI: http://dx.doi.org/10.1007/978--3--319--22701--6_25","paperID":"None"},{"content":"Desai Chen, David I. W. Levin, Piotr Didyk, Pitchaya Sitthi-Amorn, and Wojciech Matusik. 2013. Spec2Fab: A Reducer-tuner Model for Translating Specifications to 3D Prints. ACM Trans. Graph. 32, 4, Article 135 (July 2013), 10 pages. DOI: http://dx.doi.org/10.1145/2461912.2461994","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Stelian Coros, Jennifer Mankoff, and Scott E. Hudson. 2015. Encore: 3D Printed Augmentation of Everyday Objects with Printed-Over, Affixed and Interlocked Attachments. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 73--82. DOI: http://dx.doi.org/10.1145/2807442.2807498","paperID":"None"},{"content":"Marcelo Coelho and Pattie Maes. 2009. Shutters: A Permeable Surface for Environmental Control and Communication. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (TEI '09). ACM, New York, NY, USA, 13--18. DOI: http://dx.doi.org/10.1145/1517664.1517671","paperID":"None"},{"content":"Stelian Coros, Bernhard Thomaszewski, Gioacchino Noris, Shinjiro Sueda, Moira Forberg, Robert W. Sumner, Wojciech Matusik, and Bernd Bickel. 2013. Computational Design of Mechanical Characters. ACM Trans. Graph. 32, 4, Article 83 (July 2013), 12 pages. DOI:http://dx.doi.org/10.1145/2461912.2461953","paperID":"None"},{"content":"S.M. Felton, M.T. Tolley, C.D. Onal, D. Rus, and R.J. Wood. 2013. Robot Self-assembly by Folding: A printed inchworm robot. In Robotics and Automation (ICRA), 2013 IEEE International Conference on. 277--282. DOI: http://dx.doi.org/10.1109/ICRA.2013.6630588","paperID":"None"},{"content":"Sean Follmer and Hiroshi Ishii. 2012. KidCAD: Digitally Remixing Toys Through Tangible Tools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2401--2410. DOI: http://dx.doi.org/10.1145/2207676.2208403","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Nadia Cheng, and Hiroshi Ishii. 2012. Jamming User Interfaces: Programmable Particle Stiffness and Sensing for Malleable and Shape-changing Devices. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 519--528. DOI: http://dx.doi.org/10.1145/2380116.2380181","paperID":"None"},{"content":"Madeline Gannon, Tovi Grossman, and George Fitzmaurice. 2015. Tactum: A Skin-Centric Approach to Digital Design and Fabrication. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1779--1788. DOI: http://dx.doi.org/10.1145/2702123.2702581","paperID":"None"},{"content":"Nan-Wei Gong, Jürgen Steimle, Simon Olberding, Steve Hodges, Nicholas Edward Gillian, Yoshihiro Kawahara, and Joseph A. Paradiso. 2014. PrintSense: A Versatile Sensing Technique to Support Multimodal Flexible Surface Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1407--1410. DOI:http://dx.doi.org/10.1145/2556288.2557173","paperID":"None"},{"content":"LLC Happy Wire Dog. Instamorph - Moldable Plasitc. Retrieved September 23, 2015 from https://www.instamorph.com/.","paperID":"None"},{"content":"Felix Heibeck, Basheer Tome, Clark David, Della Silva, and Hiroshi Ishii. 2015. uniMorph - Fabricating Thin Film Composites for Shape-Changing Interfaces. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15). New York, NY, USA, to appear.","paperID":"None"},{"content":"3D 2.0 Inc. Retouch3D: Finish the job properly. Retrieved September 21, 2015 from http://retouch3d.com/.","paperID":"None"},{"content":"Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. 2013. Instant Inkjet Circuits: Lab-based Inkjet Printing to Support Rapid Prototyping of UbiComp Devices. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 363--372. DOI: http://dx.doi.org/10.1145/2493432.2493486","paperID":"None"},{"content":"Yoshihiro Kawahara, Steve Hodges, Nan-Wei Gong, Simon Olberding, and Jürgen Steimle. 2014. Building Functional Prototypes Using Conductive Inkjet Printing. Pervasive Computing, IEEE 13, 3 (July 2014), 30--38. DOI:http://dx.doi.org/10.1109/MPRV.2014.41","paperID":"None"},{"content":"Gierad Laput, Eric Brockmeyer, Scott E. Hudson, and Chris Harrison. 2015. Acoustruments: Passive, Acoustically-Driven, Interactive Controls for Handheld Devices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2161--2170. DOI:http://dx.doi.org/10.1145/2702123.2702414","paperID":"None"},{"content":"Yasushi Matoba, Toshiki Sato, Nobuhiro Takahashi, and Hideki Koike. 2012. ClaytricSurface: An Interactive Surface with Dynamic Softness Control Capability. In ACM SIGGRAPH 2012 Emerging Technologies (SIGGRAPH '12). ACM, New York, NY, USA, Article 6, 1 pages. DOI: http://dx.doi.org/10.1145/2343456.2343462","paperID":"None"},{"content":"Andrea Mazzone, Christian Spagno, and Andreas Kunz. 2004. The HoverMesh: A Deformable Structure Based on Vacuum Cells: New Advances in the Research of Tangible User Interfaces. In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology (ACE '04). ACM, New York, NY, USA, 187--193. DOI: http://dx.doi.org/10.1145/1067343.1067366","paperID":"None"},{"content":"Malcolm McCullough. 1996. Abstracting Craft: The Practiced Digital Hand. MIT Press, Cambridge, MA, USA.","paperID":"None"},{"content":"Stefanie Mueller, Sangha Im, Serafima Gurevich, Alexander Teibrich, Lisa Pfisterer, Francçois Guimbreti'ere, and Patrick Baudisch. 2014a. WirePrint: 3D Printed Previews for Fast Prototyping. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 273--280. DOI: http://dx.doi.org/10.1145/2642918.2647359","paperID":"None"},{"content":"Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, and Patrick Baudisch. 2014b. faBrickation: Fast 3D Printing of Functional Objects by Integrating Construction Kit Building Blocks. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3827--3834. DOI: http://dx.doi.org/10.1145/2556288.2557005","paperID":"None"},{"content":"Simon Olberding, Nan-Wei Gong, John Tiab, Joseph A. Paradiso, and Jürgen Steimle. 2013. A Cuttable Multi-touch Sensor. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 245--254. DOI: http://dx.doi.org/10.1145/2501988.2502048","paperID":"None"},{"content":"Simon Olberding, Sergio Soto Ortega, Klaus Hildebrandt, and Jürgen Steimle. 2015. Foldio: Digital Fabrication of Interactive and Shape-Changing Objects With Foldable Printed Electronics. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15). New York, NY, USA, to appear.","paperID":"None"},{"content":"Simon Olberding, Michael Wessely, and Jürgen Steimle. 2014. PrintScreen: Fabricating Highly Customizable Thin-film Touch-displays. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 281--290. DOI: http://dx.doi.org/10.1145/2642918.2647413","paperID":"None"},{"content":"Jifei Ou, Lining Yao, Daniel Tauber, Jürgen Steimle, Ryuma Niiyama, and Hiroshi Ishii. 2013. jamSheets: Thin Interfaces with Tunable Stiffness Enabled by Layer Jamming. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). ACM, New York, NY, USA, 65--72. DOI: http://dx.doi.org/10.1145/2540930.2540971","paperID":"None"},{"content":"Huaishu Peng, Amit Zoran, and Francçois V. Guimbreti'ere. 2015. D-Coil: A Hands-on Approach to Digital 3D Models Design. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1807--1815. DOI: http://dx.doi.org/10.1145/2702123.2702381","paperID":"None"},{"content":"ProtoPlant. High Temp PLA v2.0 -- ProtoPlant, Makers of Proto-pasta. Retrieved September 23, 2015 from http://www.proto-pasta.com/collections/retail/ products/high-temp-pla-v2-0.","paperID":"None"},{"content":"Raf Ramakers, Kashyap Todi, and Kris Luyten. 2015. PaperPulse: An Integrated Approach for Embedding Electronics in Paper Designs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2457--2466. DOI: http://dx.doi.org/10.1145/2702123.2702487","paperID":"None"},{"content":"Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shape-changing Interfaces: A Review of the Design Space and Open Research Questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 735--744. DOI: http://dx.doi.org/10.1145/2207676.2207781","paperID":"None"},{"content":"Christian Rendl, David Kim, Sean Fanello, Patrick Parzer, Christoph Rhemann, Jonathan Taylor, Martin Zirkl, Gregor Scheipl, Thomas Rothländer, Michael Haller, and Shahram Izadi. 2014. FlexSense: A Transparent Self-sensing Deformable Surface. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 129--138. DOI: http://dx.doi.org/10.1145/2642918.2647405","paperID":"None"},{"content":"Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice, and Björn Hartmann. 2014. A Series of Tubes: Adding Interactivity to 3D Prints Using Internal Pipes. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 3--12. DOI: http://dx.doi.org/10.1145/2642918.2647374","paperID":"None"},{"content":"Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: Fabricating Custom Capacitive Touch Sensors to Prototype Interactive Objects. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 579--588. DOI: http://dx.doi.org/10.1145/2380116.2380189","paperID":"None"},{"content":"Martin Schmitz, Mohammadreza Khalilbeigi, Matthias Balwierz, Roman Lissermann, Max Mühlhäuser, and Jürgen Steimle. 2015. Capricate: A Fabrication Pipeline to Design and 3D Print Capacitive Touch Sensors for Interactive Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15). ACM, New York, NY, USA.","paperID":"None"},{"content":"Christian Schumacher, Bernd Bickel, Jan Rys, Steve Marschner, Chiara Daraio, and Markus Gross. 2015. Microstructures to Control Elasticity in 3D Printing. ACM Trans. Graph. 34, 4, Article 136 (July 2015), 13 pages. DOI:http://dx.doi.org/10.1145/2766926","paperID":"None"},{"content":"Pitchaya Sitthi-Amorn, Javier E. Ramos, Yuwang Wangy, Joyce Kwan, Justin Lan, Wenshou Wang, and Wojciech Matusik. 2015. MultiFab: A Machine Vision Assisted Platform for Multi-material 3D Printing. ACM Trans. Graph. 34, 4, Article 129 (July 2015), 11 pages. DOI:http://dx.doi.org/10.1145/2766962","paperID":"None"},{"content":"Jürgen Steimle. 2015. Printed Electronics for Human-computer Interaction. interactions 22, 3 (April 2015), 72--75. DOI: http://dx.doi.org/10.1145/2754304","paperID":"None"},{"content":"John S. Steinhart and Stanley R. Hart. 1968. Calibration Curves for Thermistors. Deep Sea Research and Oceanographic Abstracts 15, 4 (1968), 497--503. DOI: http://dx.doi.org/10.1016/0011--7471(68)90057-0","paperID":"None"},{"content":"Alexander Teibrich, Stefanie Mueller, Francçois Guimbreti'ere, Robert Kovacs, Stefan Neubert, and Patrick Baudisch. 2015. Patching Physical Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 83--91. DOI: http://dx.doi.org/10.1145/2807442.2807467","paperID":"None"},{"content":"Cesar Torres, Tim Campbell, Neil Kumar, and Eric Paulos. 2015. HapticPrint: Designing Feel Aesthetics for Digital Fabrication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 583--591. DOI: http://dx.doi.org/10.1145/2807442.2807492","paperID":"None"},{"content":"Marynel Vázquez, Eric Brockmeyer, Ruta Desai, Chris Harrison, and Scott E. Hudson. 2015. 3D Printing Pneumatic Device Controls with Variable Activation Force Capabilities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1295--1304. DOI: http://dx.doi.org/10.1145/2702123.2702569","paperID":"None"},{"content":"Voxel8. Voxel8 - 3D Printed Electronics. Retrieved September 11, 2015 from http://www.voxel8.co/.","paperID":"None"},{"content":"Christian Weichel, Jason Alexander, Abhijit Karnik, and Hans Gellersen. 2015a. SPATA: Spatio-Tangible Tools for Fabrication-Aware Design. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 189--196. DOI: http://dx.doi.org/10.1145/2677199.2680576","paperID":"None"},{"content":"Christian Weichel, John Hardy, Jason Alexander, and Hans Gellersen. 2015b. ReForm: Integrating Physical and Digital Design Through Bidirectional Fabrication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 93--102. DOI: http://dx.doi.org/10.1145/2807442.2807451","paperID":"None"},{"content":"Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: A Mixed-reality Environment for Personal Fabrication. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3855--3864. DOI: http://dx.doi.org/10.1145/2556288.2557090","paperID":"None"},{"content":"John F. Whitfield. 2012. The Electrician's Guide to the 17th Edition of the IEE Wiring Regulations BS 7671:2011 and Part P of the Building Regulations. Environmental Protection Agency.","paperID":"None"},{"content":"Karl Willis, Eric Brockmeyer, Scott Hudson, and Ivan Poupyrev. 2012. Printed Optics: 3D Printing of Embedded Optical Elements for Interactive Devices. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 589--598. DOI: http://dx.doi.org/10.1145/2380116.2380190","paperID":"None"},{"content":"Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically Actuated Soft Composite Materials for Shape Changing Interfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 13--22. DOI: http://dx.doi.org/10.1145/2501988.2502037","paperID":"None"}],"abstract":"While 3D printing offers great design flexibility before the object is printed, it is very hard for end-users to customize a 3D-printed object to their specific needs after it is printed. We propose HotFlex: a new approach allowing precisely located parts of a 3D object to transition on demand from a solid into a deformable state and back. This approach enables intuitive hands-on remodeling, personalization, and customization of a 3D object after it is printed. We introduce the approach and present an implementation based on computer-controlled printed heating elements that are embedded within the 3D object. We present a set of functional patterns that act as building blocks and enable various forms of hands-on customization. Furthermore, we demonstrate how to integrate sensing of user input and visual output. A series of technical experiments and various application examples demonstrate the practical feasibility of the approach.","title":"HotFlex: Post-print Customization of 3D Prints Using Embedded State Change","filename":"CHI16/p420","authors":["Daniel Groeger","Elena Chong Loo","Jürgen Steimle"],"conference":"CHI '16"}