{"paperId":2858215,"citation":[],"abstract":"During face-to-face conversations, adults with autism frequently use atypical rhythms and sounds in their speech (prosody), which can result in misunderstandings and miscommunication. SayWAT is a Wearable Assistive Technology that provides feedback to wearers about their prosody during face-to-face conversations. In this paper, we describe the design process that led to five design guidelines that governed the development of SayWAT and present results from two studies involving our prototype solution. Our results indicate that wearable assistive technologies can automatically detect atypical prosody and deliver feedback in real time without disrupting the wearer or the conversation partner. Additionally, we provide suggestions for wearable assistive technologies for social support.","reference":[{"content":"Gregory D. Abowd, Gillian R. Hayes, Giovanni Iachello, Julie A. Kientz, Shwetak N. Patel, Molly M. Stevens, and Khai N. Truong. 2005. Prototypes and Paratypes: Designing Mobile and Ubiquitous Computing Applications. IEEE Pervasive Computing 4, 4: 67--73.","paperID":"None"},{"content":"Gregory D. Abowd and Elizabeth D. Mynatt. 2000. Charting past, present, and future research in ubiquitous computing. In Proceedings of the ACM Transactions on Computer-Human Interaction 7, 1: 29--58.","paperID":"None"},{"content":"Jon Baio. 2015. Prevalence of Autism Spectrum Disorder Among Children Aged 8 Years -- Autism and Developmental Disabilities Monitoring Network, 11 Sites, USA, 2010. Retrieved from cdc.gov","paperID":"None"},{"content":"Jérémy Bauchet, Hélène Pigot, Sylvain Giroux, Dany Lussier-Desrochers, Yves Lachapelle, and Mounir Mokhtari. 2009. Designing judicious interactions for cognitive assistance. In Proceedings of the eleventh international ACM SIGACCESS conference on Computers and accessibility - ASSETS '09, 11.","paperID":"None"},{"content":"Alain de Cheveigné and Hideki Kawahara. 2002. YIN, a fundamental frequency estimator for speech and music. The Journal of the Acoustical Society of America 111, 4: 1917.","paperID":"None"},{"content":"P. Crissey. 2009. Teaching Communicaiton Skills to Chidlren with Autism. Attainment.","paperID":"None"},{"content":"Ionut Damian, Chiew Seng Tan, Tobias Baur, Johannes Schöning, Kris Luyten, and Elisabeth André. 2015. Augmenting Social Interactions: Realtime Behavioural Feedback using Social Signal Processing Techniques. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 565--574.","paperID":"None"},{"content":"Joshua J. Diehl and Rhea Paul. 2009. The assessment and treatment of prosodic disorders and neurological theories of prosody. International Journal of SpeechLanguage Pathology 11, 4: 287--292.","paperID":"None"},{"content":"Lizbeth Escobedo, David H Nguyen, LouAnne Boyd, Sen Hirano, Alejandro Rangel, Daniel Garcia-Rosas, Monica Tentori, and Gillian Hayes. 2012. MOSOCO : A Mobile Assistive Tool to Support Children with Autism Practicing Social Skills in Real-Life Situations. In Proceedings of the Conference on Human Factors in Computing Systems: 2589--2598.","paperID":"None"},{"content":"Peter F. Gerhardt and Ilene Lainer. 2011. Addressing the Needs of Adolescents and Adults with Autism: A Crisis on the Horizon. Journal of Contemporary Psychotherapy 41, 1: 37--45.","paperID":"None"},{"content":"Mohammad Ghaziuddin, Neera Ghaziuddin, and John Greden. 2002. Depression in persons with autism: Implications for research and clinical care. Journal of autism and developmental disorders 32, 4: 299--306.","paperID":"None"},{"content":"Gillian R. Hayes, V. Erick Custodio, Oliver L. Haimson, Kathy Nguyen, Kathryn E. Ringland, Rachel Rose Ulgado, Aaron Waterhouse, and Rachel Weiner. 2015. Mobile video modeling for employment interviews for individuals with autism. Journal of Vocational Rehabilitation 43, 3: 275--287.","paperID":"None"},{"content":"Gillian R. Hayes, Shwetak Patel, Khai N. Truong, Giovanni Iachello, Julie A. Kientz, Rob Farmer, Gregory D. Abowd. 2004. The Personal Audio Loop Designing a Ubiquitous Audio-Based Memory Aid Springer. Mobile Human-Computer Interaction, 168174.","paperID":"None"},{"content":"Eric Horvitz. 1999. Principles of mixed-initiative user interfaces. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems, 159--166.","paperID":"None"},{"content":"Leo Kanner. 1943. Autisitc Disturbances of Affective Contact. 217--250. Retrieved from http://neurodiversity.com/library_kanner_1943.pdf","paperID":"None"},{"content":"Mark Knapp, Judith Hall, and Terrence Horgan. 2013. Nonverbal Communication in Human Interaction. Cengage Learning.","paperID":"None"},{"content":"Scott Lindgren and Alissa Doobay. 2011. EvidenceBased Interventions for Autism Spectrum Disorders.","paperID":"None"},{"content":"Miriam Madsen, Rana El Kaliouby, Matthew Goodwin, and Rosalind Picard. 2008. Technology for just-in-time in-situ learning of facial affect for persons diagnosed with an autism spectrum disorder. Proceedings of the 10th international ACM SIGACCESS Conference on Computers and Accessibility, 19--26.","paperID":"None"},{"content":"Susan Dickerson Mayes, Angela A. Gorman, Jolene Hillwig-Garcia, and Ehsan Syed. 2013. Suicide ideation and attempts in children with autism. Research in Autism Spectrum Disorders 7, 1: 109--119.","paperID":"None"},{"content":"Carla a Mazefsky and Donald P Oswald. 2007. Emotion perception in Asperger's syndrome and highfunctioning autism: the importance of diagnostic criteria and cue intensity. Journal of autism and developmental disorders 37, 6: 1086--95. http://doi.org/10.1007/s10803-006-0251--6","paperID":"None"},{"content":"David H. Nguyen, Gabriella Marcu, Gillian R. Hayes, Khai N. Truong, James Scott, Marc Langheinrich, & Christof Roduner. 2009. Encountering SenseCam: Personal recording technologies in everyday life. Proceedings of the 11th International Conference on Ubiquitous Computing: 165--174.","paperID":"None"},{"content":"Rhea Paul, Amy Augustyn, Ami Klin, and Fred R. Volkmar. 2005. Perception and Production of Prosody by Speakers with Autism Spectrum Disorders. Journal of Autism and Developmental Disorders 35, 2: 205--220.","paperID":"None"},{"content":"Ronald J. Seiler. 2007. Assistive Technology for Individuals with Cognitive Impairments. The Idaho Assistive Technology Project, Center on Disabilities and Human Development, University of Idaho, Moscow.","paperID":"None"},{"content":"M D Rutherford, Simon Baron-Cohen, and Sally Wheelwright. 2002. Reading the Mind in the Voice : A Study with Normal Adults and Adults with Asperger Syndrome and High Functioning Autism. Journal of autism and developmental disorders. 32, 3: 189--194.","paperID":"None"},{"content":"M. Satyanarayanan. 2004. Augmenting cognition. IEEE Pervasive Computing 3, 4--5.","paperID":"None"},{"content":"P. T. Shattuck, S. C. Narendorf, B. Cooper, P. R. Sterzing, M. Wagner, and J. L. Taylor. 2012. Postsecondary Education and Employment Among Youth With an Autism Spectrum Disorder. PEDIATRICS 129, 6: 1042--1049. http://doi.org/10.1542/peds.2011--2864","paperID":"None"},{"content":"Lawrence D Shriberg, Rhea Paul, Lois M Black, and Jan P van Santen. 2011. The hypothesis of apraxia of speech in children with autism spectrum disorder. Journal of autism and developmental disorders 41, 4: 405--26.","paperID":"None"},{"content":"Lawrence D. Shriberg, Rhea Paul, Jane L. McSweeny, Ami Klin, Donald J. Cohen, and Fred R. Volkmar. 2001. Speech and prosody characteristics of adolescents and adults with high-functioning autism and Asperger syndrome. Journal of Speech, Language, and Hearing Research 44, 5: 1097--1115.","paperID":"None"},{"content":"Elizabeth Schoen Simmons, Rhea Paul, and Frederick Shic. 2014. The Use of Mobile Technology in the Treatment of Prosodic Deficits in Autism Spectrum Disorders. Retrieved September 22, 2015 from http://digitalcommons.sacredheart.edu/speech_fac/114/","paperID":"None"},{"content":"Monica Tentori and Gillian R. Hayes. 2010. Designing for interaction immediacy to enhance social skills of children with autism. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1--8, 51.","paperID":"None"},{"content":"Khai N. Truong and Gillian R. Hayes. 2007. Ubiquitous Computing for Capture and Access. Foundations and Trends® in Human-Computer Interaction 2, 2: 95--171.","paperID":"None"},{"content":"S. W. White, A. Scarpa, C. M. Conner, B. B. Maddox, and S. Bonete. 2014. Evaluating Change in Social Skills in High-Functioning Adults With Autism Spectrum Disorder Using a Laboratory-Based Observational Measure. Focus on Autism and Other Developmental Disabilities.","paperID":"None"},{"content":"Qianli Xu, Michal Mukawa, Liyuan Li, Joo Hwee Lim, Cheston Tan, Shue Ching Chia, Tian Gan, and Bappaditya Mandal. 2015. Exploring users' attitudes towards social interaction assistance on Google Glass. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 9--12.","paperID":"None"}],"title":"SayWAT: Augmenting Face-to-Face Conversations for Adults with Autism","filename":"CHI16/p4872","authors":["LouAnne E. Boyd","Alejandro Rangel","Helen Tomimbang","Andrea Conejo-Toledo","Kanika Patel","Monica Tentori","Gillian R. Hayes"],"conference":"CHI '16"}