{"paperId":2858466,"citation":[],"reference":[{"content":"Ahmad Akl, Chen Feng, and Shahrokh Valaee. 2011. A Novel Accelerometer-Based Gesture Recognition System. IEEE Transactions on Signal Processing 59, 12: 6197--6205.","paperID":"None"},{"content":"Yannick Bernaerts, Matthias Druwé, Sebastiaan Steensels, Jo Vermeulen, and Johannes Schöning. 2014. The office smartwatch: development and design of a smartwatch app to digitally augment interactions in an office environment. In Proceedings of the 2014 companion publication on Designing interactive systems (DIS Companion '14), 41--44. http://doi.acm.org/10.1145/2598784.2602777","paperID":"None"},{"content":"Artem Dementyev and Joseph A. Paradiso. 2014. WristFlex: low-power gesture input with wrist-worn pressure sensors. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14), 161--166. http://doi.acm.org/10.1145/2642918.2647396","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2009. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09), 121--124. http://doi.acm.org/10.1145/1622176.1622199","paperID":"None"},{"content":"Bruce Howard and Susie Howard. 2001. Lightglove: Wrist-Worn Virtual Typing and Pointing. In Proceedings of the 5th IEEE International Symposium on Wearable Computers (ISWC '01), 172--173.","paperID":"None"},{"content":"David Kim, Otmar Hilliges, Shahram Izadi, Alex D. Butler, Jiawen Chen, Iason Oikonomidis, and Patrick Olivier. 2012. Digits: freehand 3D interactions anywhere using a wrist-worn gloveless sensor. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12), 167--176. http://dx.doi.org/10.1145/2380116.2380139","paperID":"None"},{"content":"Jiayang Liu, Lin Zhong, Jehan Wickramasuriya, and Venu Vasudevan. 2009. uWave: Accelerometer-based personalized gesture recognition and its applications. Pervasive Mob Comput 5, 6: 657--675.","paperID":"None"},{"content":"Zhiyuan Lu, Xiang Chen, Qiang Li, Xu Zhang, and Ping Zhou. 2014. A Hand Gesture Recognition Framework and Wearable Gesture-Based Interaction Prototype for Mobile Devices. IEEE Transactions on Human-Machine Systems 44, 2: 293--299.","paperID":"None"},{"content":"Masa Ogata and Michita Imai. 2015. SkinWatch: skin gesture interaction for smart watch. In Proceedings of the 6th Augmented Human International Conference (AH '15), 21--24. http://doi.acm.org/10.1145/2735711.2735830","paperID":"None"},{"content":"Lorenzo Porzi, Stefano Messelodi, Carla Mara Modena, and Elisa Ricci. 2013. A smart watch-based gesture recognition system for assisting people with visual impairments. In Proceedings of the 3rd ACM international workshop on Interactive multimedia on mobile & portable devices (IMMPD '13), 19--24. http://dx.doi.org/10.1145/2505483.2505487","paperID":"None"},{"content":"T. Scott Saponas, Desney S. Tan, Dan Morris, Jim Turner, and James A. Landay. 2010. Making musclecomputer interfaces more practical. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 851--854. http://doi.acm.org/10.1145/1753326.1753451","paperID":"None"},{"content":"Thomas Schlömer, Benjamin Poppinga, Niels Henze, and Susanne Boll. 2008. Gesture recognition with a Wii controller. In Proceedings of the 2nd international conference on Tangible and embedded interaction (TEI '08), 11--14. http://doi.acm.org/10.1145/1347390.1347395","paperID":"None"},{"content":"Jaime Ruiz and Daniel Vogel. 2015. Soft-Constraints to Reduce Legacy and Performance Bias to Elicit Whole-body Gestures with Low Arm Fatigue. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 3347--3350. http://doi.acm.org/10.1145/2702123.2702583","paperID":"None"},{"content":"Chao Xu, Parth H. Pathak, and Prasant Mohapatra. 2015. Finger-writing with Smartwatch: A Case for Finger and Hand Gesture Recognition using Smartwatch. In Proceedings of the 16th International Workshop on Mobile Computing Systems and Applications (HotMobile '15), 9--14. http://doi.acm.org/10.1145/2699343.2699350","paperID":"None"},{"content":"Wendy Yee. 2009. Potential Limitations of MultiTouch Gesture Vocabulary: Differentiation, Adption Fatigue. In Proceedings of the 13th Annual Conference on Human-Computer Interaction International: Novel Interaction Methods and Techniques (HCI International 2009). 291--300.","paperID":"None"},{"content":"Thalmic Labs. Myo Gesture Control Arm Band: https://www.myo.com/","paperID":"None"}],"abstract":"Previous work on muscle activity sensing has leveraged specialized sensors such as electromyography and force sensitive resistors. While these sensors show great potential for detecting finger/hand gestures, they require additional hardware that adds to the cost and user discomfort. Past research has utilized sensors on commercial devices, focusing on recognizing gross hand gestures. In this work we present Serendipity, a new technique for recognizing unremarkable and fine-motor finger gestures using integrated motion sensors (accelerometer and gyroscope) in off-the-shelf smartwatches. Our system demonstrates the potential to distinguish 5 fine-motor gestures like pinching, tapping and rubbing fingers with an average f1-score of 87%. Our work is the first to explore the feasibility of using solely motion sensors on everyday wearable devices to detect fine-grained gestures. This promising technology can be deployed today on current smartwatches and has the potential to be applied to cross-device interactions, or as a tool for research in fields involving finger and hand motion.","title":"Serendipity: Finger Gesture Recognition using an Off-the-Shelf Smartwatch","filename":"CHI16/p3847","authors":["Hongyi Wen","Julian Ramos Rojas","Anind K. Dey"],"conference":"CHI '16"}