{"paperId":2858549,"reference":[{"content":"Marcia J. Bates. 1989. The design of browsing and berrypicking techniques for the online search interface. Online Information Review 13, 5 (1989), 407-431. http://comminfo.rutgers.edu/~tefko/Courses/e530/Readings/Bates_Berrypicking.pdf","paperID":"None"},{"content":"Christine L. Borgman. 1996. Why Are Online Catalogs Still Hard to Use. Journal of American Society for Information Science 47, 7 (1996), 493-503. DOI: http://dx.doi.org/10.1002/(SICI) 1097--4571(199607)47:7<493::AID-ASI3>3.3.CO;2-Y","paperID":"None"},{"content":"Christine L. Borgman. 2003. The invisible library: paradox of the global information infrastructure. Library Trends 51, 4 (2003), 652-674. DOI: http://dx.doi.org/10.1.1.224.6721","paperID":"None"},{"content":"Christine L. Borgman, Ra G. Hirsh, Virginia A. Walter, and Andrea L. Gallagher. 1995. Children's searching behavior on browsing and keyword online catalogs: the science library catalog project. Journal of the American Society for Information Science 46 (1995), 663-684. DOI: http://dx.doi.org/10.1002/(SICI) 1097--4571(199510)46:9<663::AID-ASI4>3.0.CO;2--2","paperID":"None"},{"content":"Richard. E. Boyatzis. 1998. Transforming Qualitative Information: Thematic Analysis and Code Development. Sage Publications.","paperID":"None"},{"content":"Britt Marie Haggstrom (editor). 2012. The Role of Libraries in Lifelong Learning. Technical Report. International Federation of Library Associations and Institutions (IFLA). http://archive.ifla.org/VII/s8/proj/Lifelong-LearningReport.pdf","paperID":"None"},{"content":"George Buchanan and Dana Mckay. 2011. In the Bookshop : Examining Popular Search Strategies, In Proceedings of the ACM/IEEE Joint Conference on Digital Libraries (JCDL 2011). Proceedings of the ACM/IEEE Joint Conference on Digital Libraries (JCDL 2011) (2011), 269-278. DOI: http://dx.doi.org/10.1145/1998076.1998127","paperID":"None"},{"content":"George Buchanan and Jennifer Pearson. 2010. An Archtecture for Supporting RFID-Enhanced Interactions in Digital Libraries. In Proceedings of European Conference on Digital Libraries (ECDL), M. Lalmas et al. (Ed.). 92-103. DOI: http://dx.doi.org/10.1007/978--3--642--15464--5_11","paperID":"None"},{"content":"Christian Cherek, Simon Voelker, Jan Thar, Rene Linden, Florian Busch, and Jan Borchers. 2015. PERCs Demo: Persistently Trackable Tangibles on Capacitive Multi-Touch Displays. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS'15). 389-392. DOI: http://dx.doi.org/10.1145/2817721.2823474","paperID":"None"},{"content":"Shirley Anne Cousins. 1992. In their own words: an examination of catalogue users' subject queries. Journal of Information Science 18, 5 (1992), 329-341. DOI: http://dx.doi.org/10.1177/016555159201800503","paperID":"None"},{"content":"Karen Detken, Carlos Martinez, and Andreas Schrader. 2009. The Search Wall: Tangible Information Searching for Children in Public Libraries. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (TEI '09). ACM, NY, NY, USA, 289-296. DOI: http://dx.doi.org/10.1145/1517664.1517724","paperID":"None"},{"content":"Allison Druin. 2005. What Children can Teach Us: Developing Digital Libraries for Young Children. Library Quarterly 75, 1 (2005), 20-41. DOI: http://dx.doi.org/10.1.1.590.5340","paperID":"None"},{"content":"David Ellis. 1989. A behavioural approach to information retrieval design. Journal of Documentation 45, 3 (1989), 171-212. DOI: http://dx.doi.org/10.1108/eb026843","paperID":"None"},{"content":"Eva Eriksson and Andreas Lykke-Olesen. 2007. StorySurfer: A Playful Book Browsing Installation for Children's Libraries. In Proceedings of the 6th International Conference on Interaction Design and Children (IDC '07). ACM, NY, NY, USA, 57-64. DOI: http://dx.doi.org/10.1145/1297277.1297289","paperID":"None"},{"content":"Kaj Grønbæk, Anne Rohde, and Sidsel Bech-Petersen. 2006. InfoGallery: Interactive Art Services for Physical Library Spaces. In Proceedings of Joint Conference on Digital Library (JCDL'06). 21-30. DOI: http://dx.doi.org/10.1145/1141753.1141757","paperID":"None"},{"content":"Marti A. Hearst. 2009. Search User Interfaces. Cambridge University Press.","paperID":"None"},{"content":"17. Christian Heath, Jon Hindmarsh, and Paul Luff. 2010. Video in Qualitative Research. Sage.","paperID":"None"},{"content":"Annika Hinze, Dana McKay, Nicholas Vanderschantz, Claire Timpany, and Sally Jo Cunningham. 2012. Book Selection Behavior in the Physical Library: Implications for Ebook Collections. In Proceedings of the 12th ACM/IEEE-CS Joint Conference on Digital Libraries (JCDL '12). ACM, NY, NY, USA, 305-314. DOI: http://dx.doi.org/10.1145/2232817.2232874","paperID":"None"},{"content":"Hillary Browne Hutchinson, Allison Druin, and Benjamin B. Bederson. 2007. Supporting Elementary-Age Children's Searching and Browsing: Design and Evaluation Using the International Children's Digital Library. Journal of the American Society for Information Science and Technology 58, 1 (2007), 1618-1630. DOI: http://dx.doi.org/10.1002/asi.v58:11","paperID":"None"},{"content":"Hans-Christian Jetter, Jens Gerken, Werner Knig, Christian Grn, and Harald Reiterer. 2006. HyperGrid Accessing Complex Information Spaces. In People and Computers XIX The Bigger Picture, Tom McEwan, Jan Gulliksen, and David Benyon (Eds.). Springer London, 349-364. DOI: http://dx.doi.org/10.1007/1--84628--249--7_22","paperID":"None"},{"content":"Hans-Christian Jetter, Jens Gerken, Michael Zollner, Harald Reiterer, and Natasa Milic-Frayling. 2011. Materializing the Query with Facet-streams: A Hybrid Surface for Collaborative Search on Tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 3013-3022. DOI: http://dx.doi.org/10.1145/1978942.1979390","paperID":"None"},{"content":"Hans-Christian Jetter, Harald Reiterer, and Florian Geyer. 2014. Blended Interaction: Understanding Natural Human-Computer Interaction in Post-WIMP Interactive Spaces. Personal and Ubiquitous Computing 18, 5 (2014), 1139-1158. DOI: http://dx.doi.org/10.1007/s00779-013-0725--4","paperID":"None"},{"content":"Elahe Kani-Zabihi, Gheorghita Ghinea, and Sherry Y. Chen. 2008. User Perceptions of Online Public Library Catalogues. International Journal of Information Management 28 (2008), 492-502. DOI: http://dx.doi.org/10.1016/j.ijinfomgt.2008.01.007","paperID":"None"},{"content":"Eike Kleiner, Roman Radle, and Hara. 2013. Blended Shelf: Reality-based Presentation and Exploration of Library Collections. In CHI EA '13: CHI '13 Extended Abstracts on Human Factors in Computing Systems. 577-582. DOI: http://dx.doi.org/10.1145/2468356.2468458","paperID":"None"},{"content":"Carol C. Kuhlthau. 1991. Inside the search process: Information seeking from the user's perspective. Journal of the American Society for Information Science 42, 5 (June 1991), 361-371. DOI: http://dx.doi.org/10.1002/(SICI) 1097--4571(199106)42:5<361::AID-ASI6>3.0.CO;2-#","paperID":"None"},{"content":"Andrew Lange and Jamshid Beheshti. 1997. OPACs: A Research Review. LISR 19 (1997), 111-133. DOI: http://dx.doi.org/10.1016/S0740--8188(97)90039--6","paperID":"None"},{"content":"Eng Pwey Lau and Dion Hoe-Lian Goh. 2006. In search of query patterns: A case study of a university {OPAC}. Information Processing & Management 42, 5 (2006), 1316 - 1329. DOI: http://dx.doi.org/10.1016/j.ipm.2006.02.003","paperID":"None"},{"content":"Bongshin Lee, Greg Smith, George G. Robertson, Mary Czerwinski, and Desney S. Tan. 2009. FacetLens: Exposing Trends and Relationships to Support Sensemaking Within Faceted Datasets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1293-1302. DOI: http://dx.doi.org/10.1145/1518701.1518896","paperID":"None"},{"content":"Gary Marchionini. 2006. Exploratory Search: From finding to understanding. Commun. ACM 49, 4 (2006), 41-46. DOI: http://dx.doi.org/10.1145/1121949.1121979","paperID":"None"},{"content":"Anna Mikkonen and Pertti Vakkari. 2012. Readers' Search Strategies for Accessing Books in Public Libraries. In Proceedings of the 4th Information Interaction in Context Symposium (IIIX'12). 214-223. DOI:http://dx.doi.org/10.1145/2362724.2362760","paperID":"None"},{"content":"Meredith Ringel Morris, Andreas Paepcke, and Terry Winograd. 2006. TeamSearch: Comparing Techniques for Co-Present Collaborative Search of Digital Media. In Proceedings of the First IEEE International Workshop on Horizontal Interactive Human-Computer Systems (TABLETOP '06). IEEE Computer Society, Washington, DC, USA, 97-104. DOI: http://dx.doi.org/10.1109/TABLETOP.2006.32","paperID":"None"},{"content":"Roman Radle, Hans-Christian Jetter, and Harald Reiterer. 2013. Distributed User Interfaces: Usablity and Collaboration. Springer London, Chapter TwisterSearch: A Distributed User Interface for Collaborative Web Search, 53-67. DOI: http://dx.doi.org/10.1007/978--1--4471--5499-0_5","paperID":"None"},{"content":"Radle, Roman and Weiler, Andreas and Huber, Stephan and Jetter, Hans-Christian and Mansmann, Svetlana and Reiterer, Harald and Scholl, Marc H. 2012. eBook meets Tabletop: Using Collaborative Visualization for Search and Serendipity in On-line Book Repositories. In Proc. of BooksOnline'12. DOI: http://dx.doi.org/10.1145/2390116.2390120","paperID":"None"},{"content":"Jeffrey M. Rzeszotarski and Aniket Kittur. 2014. Kinetica: Naturalistic Multi-touch Data Visualization. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 897-906. DOI: http://dx.doi.org/10.1145/2556288.2557231","paperID":"None"},{"content":"Stacey D. Scott, Karen D. Grant, and Regan L. Mandryk. 2003. System Guidelines for Co-located, Collaborative Work on a Tabletop Display. In Proceedings of the Eighth Conference on European Conference on Computer Supported Cooperative Work (ECSCW'03). Kluwer Academic Publishers, Norwell, MA, USA, 159-178. http://dl.acm.org/citation.cfm?id=1241889.1241898","paperID":"None"},{"content":"Catherine Sheldrick Ross. 1999. Finding without seeking: the information encounter in the context of reading for pleasure. Information Processing & Management 35, 6 (Nov. 1999), 783-799. DOI: http://dx.doi.org/10.1016/S0306--4573(99)00026--6","paperID":"None"},{"content":"Catherine Sheldrick Ross. 2000. Making Choices: What Readers Say About Choosing Books to Read for Pleasure. The Acquisitions Librarian 13, 25 (2000), 5-21. DOI: http://dx.doi.org/10.1300/J101v13n25_02","paperID":"None"},{"content":"David Spiller. 1980. The provision of fiction for public libraries. Journal of Librarianship and Information Science 12, 4 (1980), 238-266. DOI: http://dx.doi.org/10.1177/096100068001200404","paperID":"None"},{"content":"Alice Thudt, Uta Hinrichs, and Sheelagh Carpendale. 2012. The Bohemian Bookshelf: Supporting Serendipitous Discoveries through Information Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12). 1461-1470. DOI: http://dx.doi.org/10.1145/2207676.2208607","paperID":"None"},{"content":"Alice Thudt, Uta Hinrichs, and Sheelagh Carpendale. 2015. A Modular Approach to Promote Creativity and Inspiration in Search. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition. 245-254. DOI: http://dx.doi.org/10.1145/2757226.2757253","paperID":"None"},{"content":"Brygg Ullmer, Hiroshi Ishii, and Robert J. K. Jacob. 2003. Tangible Query Interfaces: Physically Constrained Tokens for Manipulating Database Queries. In Proceedings of Interact03. 279-286. DOI: http://dx.doi.org/10.1.1.13.1780","paperID":"None"},{"content":"Patricia M. Wallace. 1993. How Do Patrons Search the Online Catalog When No One's Looking? Transaction Log Analysis and Implications for Bibliographic Instruction and System Design. RQ 33, 2 (1993), pp. 239-252. http://www.jstor.org/stable/20862411","paperID":"None"},{"content":"Ryen W. White and Resa A. Roth. 2009. Exploratory Search: Beyond the Query-Response Paradigm. Synthesis Lectures on Information Concepts, Retrieval, and Services 1, 1 (Jan. 2009), 1-98. DOI: http://dx.doi.org/10.2200/S00174ED1V01Y200901ICR003","paperID":"None"},{"content":"Mitchell Whitelaw. 2015. Towards Generous Interfaces for Archival Collections. Digital Humanties Quarterly 9, 1 (2015). http://www.digitalhumanities.org/dhq/vol/9/1/000205/000205.html","paperID":"None"},{"content":"Barbara M. Wildemuth and Ann L. O'Neill. 1995. The \"Known\" in Known-Item Searches: Empirical Support for User-Centered Design. College & Research Libraries 56 (1995), 265-281. DOI: http://dx.doi.org/10.5860/crl_56_03_265","paperID":"None"},{"content":"Max L. Wilson. 2011. Search-User Interface Design. Morgan & Claypool Publishers. DOI: http://dx.doi.org/10.1.1.29.2605","paperID":"None"},{"content":"Degi Young and Ben Shneiderman. 1993. A Graphical Filter/Flow Representation of Boolean Queries: A Prototype Implementation and Evaluation. Journal of the American Society for Information Science 44 (1993), 327-339. DOI: http://dx.doi.org/10.1.1.29.2605","paperID":"None"}],"citation":[],"abstract":"OPAC interfaces, still the dominant access point to library catalogs, support systematic search but are problematic for open-ended exploration and generally unpopular with visitors. As a result, libraries start subscribing to simplified search paradigms as exemplified by web-search systems. This is a problem considering that systematic search is a crucial skill in the light of today's abundance of digital information. Inspired by novel approaches to facilitating search, we designed CollectionDiver, an installation for supporting systematic search in public libraries. The CollectionDiver combines tangible and large display direct-touch interaction with a visual representation of search criteria and filters. We conducted an in-situ qualitative study to compare participants' search approaches on the CollectionDiver with those on the OPAC interface. Our findings show that while both systems support a similar search process, the CollectionDiver (1) makes systematic search more accessible, (2) motivates proactive search approaches by (3) adding transparency to the search process, and (4) facilitates shared search experiences. We discuss the CollectionDiver's design concepts to stimulate new ideas toward supporting engaging approaches to systematic search in the library context and beyond.","title":"Diving in at the Deep End: The Value of Alternative In-Situ Approaches for Systematic Library Search","filename":"CHI16/p4634","authors":["Uta Hinrichs","Simon Butscher","Jens Müller","Harald Reiterer"],"conference":"CHI '16"}