{"paperId":2858572,"citation":[],"abstract":"It is well established that delays in system response time negatively impact productivity, error rates and user satisfaction. What is less clear is the degree to which these effects deter users from engaging with a system. Usability guidelines provide rough response time targets for minimizing these effects across various types of interactions. However, developers faced with technical limitations or cost constraints that prevent them from meeting such targets are given no data with which to estimate the impact that system response delays will have on user engagement. In this work, we demonstrate a methodology for using crowd sourcing platforms to examine (1) the relative impacts of different delay types and (2) the effects of marginal changes in system response times. We compare two common network delay types, those caused by limited bandwidth (increased download times) and those caused by network latency (lag in responsiveness), and present how these delays reduce engagement in the context of a crowd sourced image classification task. Furthermore, we model how financial incentives interact with system response delays to impact user engagement. Finally, we show how such models can be used to optimize the cost of system design choices.","reference":[{"content":"Yoshihisa Abe, Roxana Geambasu, Kaustubh Joshi, H. Andres Lagar-Cavilla, and Mahadev Satyanarayanan. 2013. vTube: efficient streaming of virtual appliances over last-mile networks. In Proceedings of the 4th Annual Symposium on Cloud Computing (SOCC '13). http://dx.doi.org/10.1145/2523616.2523636","paperID":"None"},{"content":"Akamai. 2015. State of the Internet, Second Quarter. 8, 2 (2015). Retreived August 11, 2015 from https://www.stateoftheinternet.com/downloads/pdfs/2015-q2-state-of-the-internet-report.pdf","paperID":"None"},{"content":"Amazon. 2015. AWS Total Cost of Ownership (TCO) Calculator. Retrieved September 10, 2015 from https://aws.amazon.com/tco-caclulator","paperID":"None"},{"content":"Rajesh Krishna Balan, Darren Gergle, Mahadev Satyanarayanan, and James Herbsleb. 2007. Simplifying cyber foraging for mobile devices. In Proceedings of the 5th international conference on Mobile systems, applications, and services (MobiSys '07), 272--285. http://dx.doi.org/10.1145/1247660.1247692","paperID":"None"},{"content":"Raymond E. Barber and Henry C. Lucas, Jr.. 1983. System response time, operator productivity and job satisfaction. Commun. ACM 26, 11 (November 1983), 972--986. http://dx.doi.org/10.1145/182.358464","paperID":"None"},{"content":"T. W. Butler. 1983. Computer response time and user performance. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '83), 58-62. http://dx.doi.org/10.1145/800045.801581","paperID":"None"},{"content":"CloudPing. 2012. CloudPing. Retrieved September 10, 2015 from http://www.cloudping.info","paperID":"None"},{"content":"Gary L. Dannenbring. 1983. The effect of computer response time on user performance and satisfaction: A preliminary investigation. Behavior Research Methods & Instrumentation 15, 2 (March 1983), 213- 216. http://dx.doi.org/10.3758/BF03203551","paperID":"None"},{"content":"Mitchell Grossberg, Raymond A. Wiesen, and Douwe B. Yntema. 1976. An experiment on problem solving with delayed computer responses. In IEEE Transactions on Systems, Man and Cybernetics, Vol. SMC-6. 219-222. http://dx.doi.org/10.1109/TSMC.1976.5409241","paperID":"None"},{"content":"Jan L. Guynes. 1988. Impact of system response time on state anxiety. Commun. ACM 31, 3 (1988), 342- 347. http://dx.doi.org/10.1145/42392.42402","paperID":"None"},{"content":"John A. Hoxmeier and C DiCesare. 2000. System response time and user satisfaction: an experimental study of browser-based applications. In Proceedings of the Association of Information Systems Americas Conference 2, 1-26. http://dx.doi.org/10.1.1.99.2770","paperID":"None"},{"content":"Junxian Huang, Feng Quian, Alexandre Gerber, Z Morley Mao, Subhabrata Sen, and Oliver Spatscheck. 2012. A close examination of performance and power characteristics of 4G LTE networks. In Proceedings of the 10th international conference on Mobile systems, applications, and services (MobiSys '12), 225-238. http://dx.doi.org/10.1145/2307636.2307658","paperID":"None"},{"content":"Panos Ipeirotis. 2010. Demographics of Mechanical Turk. New York University Working Paper.","paperID":"None"},{"content":"Julie A. Jacko, Andrew Sears, and Michael S. Borella. 2000. The effect of network delay and media on user perceptions of web resources. Behavior & Information Technology 19, 6: 427-439. http://dx.doi.org/10.1080/014492900750052688","paperID":"None"},{"content":"Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 453--456. http://dx.doi.org/10.1145/1357054.1357127","paperID":"None"},{"content":"Werner Kuhmann. 1989. Experimental investigation of stress-inducing properties of system response times. Ergonomics 32, 3 (March 1989), 271-280. http://dx.doi.org/10.1080/00140138908966087","paperID":"None"},{"content":"John P. Klein and Melvin L. Moeschberger. 2003. Survival Analysis: Techniques for Censored and Truncated Data, Second Edition. Springer, New York, NY, USA.","paperID":"None"},{"content":"Albert Lai and Jason Nieh. 2006. On the performance of wide-area thin-client computing. ACM Trans of Com Sys. 175--209.","paperID":"None"},{"content":"Walter S. Lasecki, Jeffery M. Rzeszotarski, Adam Marcus, and Jeffrey P. Bigham. 2015. The effects of sequence and delay on crowd work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1375--1378. http://dx.doi.org/10.1145/2702123.2702594","paperID":"None"},{"content":"Ang Li, Xiaowei Yang, Srikanth Kandula, and Ming Zhang. 2010. CloudCmp: comparing public cloud providers. In Proceedings of the 10th annual conference on Internet measurement (IMC '10), 1-14. http://dx.doi.org/10.1145/1879141.1879143","paperID":"None"},{"content":"Robert B. Miller. 1968. Response time in mancomputer conversational transactions. In Proceedings of the December 9--11, 1968, fall joint computer conference, part I (AFIPS '68), 267--277. http://dx.doi.org/10.1145/1476589.1476628","paperID":"None"},{"content":"Brad A. Myers. 1985. The importance of percent-done indicators for computer-human interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '85), 11--17. http://dx.doi.org/10.1145/317456.317459","paperID":"None"},{"content":"Fiona Fui-Hoon Nah. 2004. A study on tolerable waiting time: how long are web users willing to wait? Behavior & Information Technology 23, 3: 153--167. http://dx.doi.org/10.1080/01449290410001669914","paperID":"None"},{"content":"Jakob Nielsen. 1993. Usability Engineering. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.","paperID":"None"},{"content":"Gabriele Paolacci, Jesse Chandler, and Pg Ipeirotis. 2010. Running experiments on amazon mechanical turk. Judgment and Decision Making 5, 5: 411-419. http://dx.doi.org/10.2139/ssrn.1626226","paperID":"None"},{"content":"Judith Ramsay, Alessandro Barbesi, and Jenny Preece. 1998. A psychological investigation of long retrieval times on the World Wide Web. Interacting with Computers 10, 1: 77-86. http://dx.doi.org/10.1016/S0953-5438(97)00019-2","paperID":"None"},{"content":"Tristan Richardson, Quentin Stafford-Fraser, Kenneth R. Wood, and Andy Hopper. 1998. Virtual network computing. IEEE Internet Computing 2, 1 (1998), 33-38. http://dx.doi.org/10.1109/4236.656066","paperID":"None"},{"content":"Joel Ross, Lilly Irani, M. Six Silberman, Andrew Zaldivar, and Bill Tomlinson. 2010. Who are the crowdworkers?: shifting demographics in mechanical turk. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10), 2863--2872. http://dx.doi.org/10.1145/1753846.1753873","paperID":"None"},{"content":"Avi Rushinek and Sara F. Rushinek. 1986. What makes users happy? Commun. ACM 29, 7: 594--598. http://dx.doi.org/10.1145/6138.6140","paperID":"None"},{"content":"Mehadev Satyanarayanan, Paramvir Bahl, Ramon Caceres, and Nigel Davies. 2009. The case for VMbased cloudlets in mobile computing. Pervasive Computing 8, 4 (2009), 14-23. http://dx.doi.org/10.1109/MPRV.2009.82","paperID":"None"},{"content":"Ben Shneiderman. 2005. Designing the User Interface: Strategies for Effective Human-Computer Interaction. Vol. 3. Addison-Wesley.","paperID":"None"},{"content":"Steven L. Teal and Alexander I. Rudnicky. 1992. A performance model of system delay and user strategy selection. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '92), 295-305. http://dx.doi.org/10.1145/142750.142818","paperID":"None"},{"content":"M. Thum, W. Boucsein, W. Kuhmann, and W. J. Ray. 1995. Standardized task strain and system response times in human-computer interaction. Ergonomics 38, 7: 1342-1351. http://dx.doi.org/10.1080/00140139508925192","paperID":"None"},{"content":"Niraj Tolia, David G. Andersen, and Mahadev Satyanarayanan. 2006. Quantifying interactive user experience on thin clients. Computer 39, 3: 46-52. http://dx.doi.org/10.1109/MC.2006.101","paperID":"None"},{"content":"Michael Toomim, Travis Kriplean, Claus Portner, and James Landay. 2011. Utility of human-computer interactions: toward a science of preference measurement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2275-2284. http://dx.doi.org/10.1145/1978942.1979277","paperID":"None"}],"title":"Using Crowd Sourcing to Measure the Effects of System Response Delays on User Engagement","filename":"CHI16/p4413","authors":["Brandon Taylor","Anind K. Dey","Daniel Siewiorek","Asim Smailagic"],"conference":"CHI '16"}