{"paperId":2858118,"citation":[],"abstract":"We describe an empirical study that explores how users establish and use personal space around large public displays (LPDs). Our study complements field studies in this space by more fully characterizing interpersonal distances based on coupling and confirms the use of on-screen territories on vertical displays. Finally, we discuss implications for future research: limitations of proxemics and territoriality, how user range can augment existing theory, and the influence of dis- play size on personal space.","reference":[{"content":"Alec Azad, Jaime Ruiz, Daniel Vogel, Mark Hancock, and Edward Lank. 2012. Territoriality and behaviour on and around large vertical publicly-shared displays. In Proc DIS 2012. ACM, New York, NY, USA, 468--477. DOI:http://dx.doi.org/10.1145/2317956.2318025","paperID":"None"},{"content":"Till Ballendat, Nicolai Marquardt, and Saul Greenberg. 2010. Proxemic Interaction: Designing for a Proximity and Orientation-aware Environment. In Proc. ITS 2010. ACM, New York, NY, USA, 121--130. DOI: http://dx.doi.org/10.1145/1936652.1936676","paperID":"None"},{"content":"Gilbert Beyer, Vincent Binder, Nina Jäger, and Andreas Butz. 2014. The Puppeteer Display: Attracting and Actively Shaping the Audience with an Interactive Public Banner Display. In Proc DIS. ACM, New York, NY, USA, 935--944. DOI: http://dx.doi.org/10.1145/2598510.2598575","paperID":"None"},{"content":"Zachary Cook. 2013. The Simple Multi-Touch Toolkit. In University of Ontario Institute of Technology Student Research Showcase. http://vialab.science.uoit.ca/wordpress/ wp-content/papercite-data/pdf/coo2013a.pdf","paperID":"None"},{"content":"Peter Dalsgaard and Kim Halskov. 2010. Designing Urban Media Façades: Cases and Challenges. In Proc CHI. ACM, New York, NY, USA, 2277--2286. DOI: http://dx.doi.org/10.1145/1753326.1753670","paperID":"None"},{"content":"Saul Greenberg, Sebastian Boring, Jo Vermeulen, and Jakub Dostal. 2014. Dark Patterns in Proxemic Interactions: A Critical Perspective. In Proc DIS 2014. ACM, 523--532. DOI: http://dx.doi.org/10.1145/2598510.2598541","paperID":"None"},{"content":"Saul Greenberg, Nicolai Marquardt, Till Ballendat, Rob Diaz-Marino, and Miaosen Wang. 2011. Proxemic Interactions: The New Ubicomp? Interactions 18, 1 (2011), 42--50. DOI: http://dx.doi.org/10.1145/1897239.1897250","paperID":"None"},{"content":"Saul Greenberg and Michael Rounding. 2001. The Notification Collage: Posting Information to Public and Personal Displays. In Proc CHI 2001. ACM, 514--521. DOI:http://dx.doi.org/10.1145/365024.365339","paperID":"None"},{"content":"C. Gutwin and S. Greenberg. 2000. The mechanics of collaboration: developing low cost usability evaluation methods for shared workspaces. In Proc WET ICE 2000. IEEE, 98--103. DOI: http://dx.doi.org/10.1109/ENABL.2000.883711","paperID":"None"},{"content":"Edward T. Hall. 1966. The Hidden Dimension. Anchor Books.","paperID":"None"},{"content":"Eva Hornecker. 2008. \"I don't understand it either, but it is cool\"? Visitor interactions with a multi-touch table in a museum. In Proc TABLETOP. IEEE, 113--120.","paperID":"None"},{"content":"Elaine M. Huang and Elizabeth D. Mynatt. 2003. Semi-public Displays for Small, Co-located Groups. In Proc. CHI 2003. ACM, New York, NY, USA, 49--56. DOI:http://dx.doi.org/10.1145/642611.642622","paperID":"None"},{"content":"Petra Isenberg, Danyel Fisher, Meredith Ringel Morris, Kori Inkpen, and Mary Czerwinski. 2010. An exploratory study of co-located collaborative visual analytics around a tabletop display. In Proc VAST 2010. IEEE, 179--186.","paperID":"None"},{"content":"Mikkel Jakobsen and Kasper Hornbaek. 2014. Up Close and Personal: Collaborative Work on a High-resolution Multitouch Wall Display. ACM Trans. Comput.-Hum. Interact. 21, 2, Article 11 (2014), 34 pages. DOI: http://dx.doi.org/10.1145/2576099","paperID":"None"},{"content":"Wendy G. Ju, Brian A. Lee, and Scott R. Klemmer. 2007. Range: Exploring Proxemics in Collaborative Whiteboard Interaction. In Proc CHI EA. ACM, New York, NY, USA, 2483--2488. DOI: http://dx.doi.org/10.1145/1240866.1241028","paperID":"None"},{"content":"Russell Kruger, Sheelagh Carpendale, Stacey D Scott, and Anthony Tang. 2005. Fluid integration of rotation and translation. In Proc CHI 2005. ACM, 601--610.","paperID":"None"},{"content":"Nicolai Marquardt, Robert Diaz-Marino, Sebastian Boring, and Saul Greenberg. 2011. The proximity toolkit: prototyping proxemic interactions in ubiquitous computing ecologies. In Proc UIST '11. ACM, 315--326. DOI:http://dx.doi.org/10.1145/2047196.2047238","paperID":"None"},{"content":"Paul Marshall, Yvonne Rogers, and Nadia Pantidi. 2011. Using F-formations to analyse spatial patterns of interaction in physical environments. In Proc CSCW. ACM, 445--454.","paperID":"None"},{"content":"Erik Paluka. 2011. Simple Multi-Touch: A framework for teaching multi-touch computing. In University of Ontario Institute of Technology Student Research Showcase. http://vialab.science.uoit.ca/wordpress/ wp-content/papercite-data/pdf/pal2011a.pdf","paperID":"None"},{"content":"Peter Peltonen, Esko Kurvinen, Antti Salovaara, Giulio Jacucci, Tommi Ilmonen, John Evans, Antti Oulasvirta, and Petri Saarikko. 2008. It's Mine, Don't Touch!: interactions at a large multi-touch display in a city centre. In Proc CHI. ACM, New York, NY, USA, 1285--1294. DOI: http://dx.doi.org/10.1145/1357054.1357255","paperID":"None"},{"content":"Jun Rekimoto. 1997. Pick-and-drop: A Direct Manipulation Technique for Multiple Computer Environments. In Proc UIST 1997. ACM, New York, NY, USA, 31--39. DOI: http://dx.doi.org/10.1145/263407.263505","paperID":"None"},{"content":"Markus Rittenbruch, Andrew Sorensen, Jared Donovan, Debra Polson, Michael Docherty, and Jeff Jones. 2013. The Cube: A Very Large-scale Interactive Engagement Space. In Proc ITS. ACM, New York, NY, USA, 1--10. DOI:http://dx.doi.org/10.1145/2512349.2512814","paperID":"None"},{"content":"Timothy A. Sandstrom, Chris Henze, and Creon Levit. 2003. The Hyperwall. In Proc. CMV '03. IEEE Computer Society, Washington, DC, USA, 124--134. http://dl.acm.org/citation.cfm?id=937938.937953","paperID":"None"},{"content":"Constantin Schmidt, Jörg Müller, and Gilles Bailly. 2013. Screenfinity: Extending the Perception Area of Content on Very Large Public Displays. In Proc. CHI. ACM, 1719--1728. DOI: http://dx.doi.org/10.1145/2470654.2466227","paperID":"None"},{"content":"Stacey D. Scott, Sheelagh M.T. Carpendale, and Kori M. Inkpen. 2004. Territoriality in collaborative tabletop workspaces. In Proc. CSCW '04. ACM, 294--303. DOI: http://dx.doi.org/10.1145/1031607.1031655","paperID":"None"},{"content":"Anthony Tang, Melanie Tory, Barry Po, Petra Neumann, and Sheelagh Carpendale. 2006. Collaborative coupling over tabletop displays. In Proc CHI 2006. ACM, 1181--1190. DOI: http://dx.doi.org/10.1145/1124772.1124950","paperID":"None"},{"content":"Daniel Vogel and Ravin Balakrishnan. 2004. Interactive public ambient displays: transitioning from implicit to explicit, public to personal, interaction with multiple users. In Proc UIST '04. ACM, 137--146. DOI: http://dx.doi.org/10.1145/1029632.1029656","paperID":"None"},{"content":"Katherine Vogt, Lauren Bradel, Christopher Andrews, Chris North, Alex Endert, and Duke Hutchings. 2011. Co-located Collaborative Sensemaking on a Large High-resolution Display with Multiple Input Devices. In Proc INTERACT '11. 589--604. http: //dl.acm.org/citation.cfm?id=2042118.2042175","paperID":"None"},{"content":"James R. Wallace, Stacey D. Scott, and Carolyn G. MacGregor. 2013. Collaborative Sensemaking on a Digital Tabletop and Personal Tablets: Prioritization, Comparisons, and Tableaux. In Proc CHI 2013. ACM, 3345--3354. DOI: http://dx.doi.org/10.1145/2470654.2466458","paperID":"None"},{"content":"Julie R. Williamson and John Williamson. 2014. Analysing Pedestrian Traffic Around Public Displays. In Proc PerDis. ACM, New York, NY, USA, Article 13, 6 pages. DOI: http://dx.doi.org/10.1145/2611009.2611022","paperID":"None"}],"title":"Creating Your Bubble: Personal Space On and Around Large Public Displays","filename":"CHI16/p2087","authors":["James R. Wallace","Nancy Iskander","Edward Lank"],"conference":"CHI '16"}