{"paperId":2858559,"citation":[],"reference":[{"content":"Daniel Avrahami, Jacob O. Wobbrock, and Shahram Izadi. 2011. Portico: Tangible Interaction on and Around a Tablet. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 347--356. DOI:http://dx.doi.org/10.1145/2047196.2047241","paperID":"None"},{"content":"Liwei Chan, Stefanie Müller, Anne Roudaut, and Patrick Baudisch. 2012. CapStones and ZebraWidgets: Sensing Stacks of Building Blocks, Dials and Sliders on Capacitive Touch Screens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2189--2192. DOI: http://dx.doi.org/10.1145/2207676.2208371","paperID":"None"},{"content":"Kenneth P. Fishkin. 2004. A Taxonomy for and Analysis of Tangible Interfaces. Personal Ubiquitous Comput. 8, 5 (Sept. 2004), 347--358. DOI: http://dx.doi.org/10.1007/s00779- 004- 0297- 4","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic Physical Affordances and Constraints Through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 417--426. DOI: http://dx.doi.org/10.1145/2501988.2502032","paperID":"None"},{"content":"Osamu Izuta, Toshiki Sato, Sachiko Kodama, and Hideki Koike. 2010. Bouncing Star Project: Design and Development of Augmented Sports Application Using a Ball Including Electronic and Wireless Modules. In Proceedings of the 1st Augmented Human International Conference (AH '10). ACM, New York, NY, USA, Article 22, 7 pages. DOI: http://dx.doi.org/10.1145/1785455.1785477","paperID":"None"},{"content":"Rong-Hao Liang, Liwei Chan, Hung-Yu Tseng, Han-Chih Kuo, Da-Yuan Huang, De-Nian Yang, and Bing-Yu Chen. 2014. GaussBricks: Magnetic Building Blocks for Constructive Tangible Interactions on Portable Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3153--3162. DOI:http://dx.doi.org/10.1145/2556288.2557105","paperID":"None"},{"content":"Rong-Hao Liang, Kai-Yin Cheng, Liwei Chan, Chuan-Xhyuan Peng, Mike Y. Chen, Rung-Huei Liang, De-Nian Yang, and Bing-Yu Chen. 2013. GaussBits: Magnetic Tangible Bits for Portable and Occlusion-free Near-surface Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1391--1400. DOI:http://dx.doi.org/10.1145/2470654.2466185","paperID":"None"},{"content":"Rong-Hao Liang, Kai-Yin Cheng, Chao-Huai Su, Chien-Ting Weng, Bing-Yu Chen, and De-Nian Yang. 2012. GaussSense: Attachable Stylus Sensing Using Magnetic Sensor Grid. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 319--326. DOI: http://dx.doi.org/10.1145/2380116.2380157","paperID":"None"},{"content":"James Patten and Hiroshi Ishii. 2007. Mechanical Constraints As Computational Constraints in Tabletop Tangible Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 809--818. DOI: http://dx.doi.org/10.1145/1240624.1240746","paperID":"None"},{"content":"Dominik Schmidt, Raf Ramakers, Esben W. Pedersen, Johannes Jasper, Sven Köhler, Aileen Pohl, Hannes Rantzsch, Andreas Rau, Patrick Schmidt, Christoph Sterz, Yanina Yurchenko, and Patrick Baudisch. 2014. Kickables: Tangibles for Feet. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3143--3152. DOI: http://dx.doi.org/10.1145/2556288.2557016","paperID":"None"},{"content":"J.T. Sherman, J.K. Lubkert, R.S. Popovic, and M.R. DiSilvestro. 2007. Characterization of a Novel Magnetic Tracking System. IEEE Transactions on Magnetics 43, 6 (June 2007), 2725--2727. DOI: http://dx.doi.org/10.1109/TMAG.2007.893314","paperID":"None"},{"content":"Brygg Ullmer, Hiroshi Ishii, and Robert J. K. Jacob. 2005. Token+Constraint Systems for Tangible Interaction with Digital Information. ACM Trans. Comput.-Hum. Interact. 12, 1 (March 2005), 81--118. DOI:http://dx.doi.org/10.1145/1057237.1057242","paperID":"None"}],"abstract":"This work develops a system of spherical magnetic tangibles, GaussMarbles, that exploits the unique affordances of spherical tangibles for interacting with portable physical constraints. The proposed design of each magnetic sphere includes a magnetic polyhedron in the center. The magnetic polyhedron provides bi-polar magnetic fields, which are expanded in equal dihedral angles as robust features for tracking, allowing an analog Hall-sensor grid to resolve the near-surface 3D position accurately in real-time. Possible interactions between the magnetic spheres and portable physical constraints in various levels of embodiment were explored using several example applications.","title":"GaussMarbles: Spherical Magnetic Tangibles for Interacting with Portable Physical Constraints","filename":"CHI16/p4228","authors":["Han-Chih Kuo","Rong-Hao Liang","Long-Fei Lin","Bing-Yu Chen"],"conference":"CHI '16"}