{"paperId":2858538,"citation":[],"reference":[{"content":"Gesture Recognition Toolkit: http://www.nickgillian.com/software/grt","paperID":"None"},{"content":"MYO Armband: http://www.myo.com","paperID":"None"},{"content":"Third Hand: http://stelarc.org/?catID=20265","paperID":"None"},{"content":"Brown, C., Asada, H. Inter-finger coordination and posture synergies in robot hands via mechanical implementation of Principal Component Analysis. In Proc. IROS '07. http://dx.doi.org/10.1109/IROS.2007.4399547","paperID":"None"},{"content":"Brummett, B. Rhetoric of Machine Aesthetics. Praeger. 1999.","paperID":"None"},{"content":"Bundhoo, V. and Park, E. J. Design of an artificial muscle actuated finger towards biomimetic prosthetic hands. In Proc. ICAR '05. http://dx.doi.org/10.1109/ICAR.2005.1507437","paperID":"None"},{"content":"Carrozza, M. C., Massa, B., Micera, S., Lazzarini, R., Zecca, M., and Dario, P. The development of a novel prosthetic hand-ongoing research and preliminary results. IEEE/ASME Trans. Mechatronics. Aug 2002. http://dx.doi.org/10.1109/TMECH.2002.1011247","paperID":"None"},{"content":"Clawson, J., Pater, J. A., Miller, A. D., Mynatt, E. D., Mamykina, L. No Longer Wearing: Investigating the Abandonment of Personal Health-Tracking Technologies on Craigslist. In Proc. UbiComp '15. http://dx.doi.org/10.1145/2750858.2807554","paperID":"None"},{"content":"Dourish, P. Where the Action Is: The Foundations of Embodied Interaction. MIT Press. 2001.","paperID":"None"},{"content":"Gaver, W. Technology affordances. In Proc. CHI 91. ACM Press: NY (1991), 79--84. http://dx.doi.org/10.1145/108844.108856","paperID":"None"},{"content":"Gioio, G., Salvietti, G., Malvezi, M., Prattichizzo, D. Mapping synergies from human to robotic hands with dissimilar kinematics: an approach in the object domain. IEEE Trans. Robotics. Aug 2013. http://dx.doi.org/10.1109/TRO.2013.2252251","paperID":"None"},{"content":"Hammond III, F. L., Weisz, J., de la Llera Kurth, A. A., Allen, P. K., Howe, R. D. Towards a Design Optimization Method for Reducing the Mechanical Complexity of Underactuated Robotic Hands. In Proc. ICRA '12. http://dx.doi.org/10.1109/ICRA.2012.6225010","paperID":"None"},{"content":"Heidegger, M. Being and Time. New York: Harper & Row. 1962.","paperID":"None"},{"content":"Ison, M., Artemiadis, P. Proportional Myoelectric Control of Robots: Muscle Synergy Development Drives Performance Enhancement, Retainment, and Generalization. IEEE Trans. Robotics '15. http://dx.doi.org/10.1109/TRO.2015.2395731","paperID":"None"},{"content":"Jacobsen, S. C., Iversen, E. K., Knutti, D., Johnson, R., Biggers, K. Design of the Utah/MIT Dextrous Hand. In Proc. ICRA '86. http://dx.doi.org/10.1109/ROBOT.1986.1087395","paperID":"None"},{"content":"Lazar, A., Koehler, C., Tanenbaum, J., Nguyen, D. H. Why We Use and Abandon Smart Devices. In Proc. UbiComp '15. http://dx.doi.org/10.1145/2750858.2804288","paperID":"None"},{"content":"Leithinger, D., Follmer, S., Olwal, A., Ishii, H. Physical telepresence: shape capture and display for embodied, computer-mediated remote collaboration. In Proc. UIST '14. http://dx.doi.org/10.1145/2642918.2647377","paperID":"None"},{"content":"Lemley, B. Really Special Forces. Discover 25-26. 2002.","paperID":"None"},{"content":"Lopes, P., Jonell, P., Baudisch, P. Affordance++: Allowing Objects to Communicate Dynamic Use. In Proc. CHI '15. http://dx.doi.org/10.1145/2702123.2702128","paperID":"None"},{"content":"MacLean, D., Roseway, A., Czerwinski, M. MoodWings: A Wearable Biofeedback Device for Real- Time Stress Intervention. In Proc. PETRA '13. http://dx.doi.org/10.1145/2504335.2504406","paperID":"None"},{"content":"Parietti, F., Asada, H., Chan, K., Bracing the Human Body with Supernumerary Robotic Limbs for Physical Assistance and Load Reduction. In Proc. ICRA '14. http://dx.doi.org/10.1109/ICRA.2014.6906601","paperID":"None"},{"content":"Popovic, M. B., Popovic, D. B., Tomovic, R. Control of Arm Movement: Reaching Synergies for Neuroprosthesis with Life-Like Control. Journal of Automatic Control. Jan 2002. http://dx.doi.org/10.2298%2fJAC0201009P","paperID":"None"},{"content":"Pratt, J.E., Krupp, B.T., Morse, C.J., Collins, S.H. The RoboKnee: an exoskeleton for enhancing strength and endurance during walking. In Proc. ICRA '04. http://dx.doi.org/10.1109/ROBOT.2004.1307425","paperID":"None"},{"content":"Saga, T., Munekata, N., Ono, T. Daily Support Robots that Move on Me. SIGRRAPH ASIA '14 Emerging Technologies. http://dx.doi.org/10.1145/2658861.2658882","paperID":"None"},{"content":"Tamaki, E., Miyaki, T., Rekimoto, J. Possessed Hand: techniques for controlling human hands using electrical muscles stimuli. In Proc. CHI '11. http://dx.doi.org/10.1145/1978942.1979018","paperID":"None"},{"content":"Williams, M. A., Roseway, A., O'Dowd, C. SWARM: An Actuated Wearable for Mediating Affect. In Proc. TEI '15. http://dx.doi.org/10.1145/2677199.2680565","paperID":"None"},{"content":"Wilson, F. The Hand: How Its Use Shapes the Brain, Language, and Human Culture. Pantheon books. 1998.","paperID":"None"},{"content":"Wu, F. Y. and Asada, H. Bio-Artificial Synergies for Grasp Posture Control of Supernumerary Robotic Fingers. In Robotics: Science and Systems. 2014. http://hdl.handle.net/1721.1/88457","paperID":"None"}],"abstract":"Physical interfaces with actuation capability enable the design of wearable devices that augment human physical capabilities. Extra machine joints integrated to our biological body may allow us to achieve additional skills through programmatic reconfiguration of the joints. To that end, we present a wearable multi-joint interface that offers \"synergistic interactions\" by providing additional fingers, structural supports, and physical user interfaces. Motions of the machine joints can be controlled via interfacing with our muscle signals, as a direct extension of our body. On the basis of implemented applications, we demonstrate our design guidelines for creating a desirable human-machine synergy -- that enhances our innate capabilities, not replacing or obstructing, and also without enforcing the augmentation. Finally we describe technical details of our muscle-based control method and implementations of the presented applications.","title":"Body Integrated Programmable Joints Interface","filename":"CHI16/p6053","authors":["Sang-won Leigh","Pattie Maes"],"conference":"CHI '16"}