{"paperId":2858562,"citation":[],"abstract":"Wearable sports devices like GPS watches and heart rate monitors are ubiquitous in sports like running or road cycling and enable the users to receive real-time performance feedback. Although rock climbing is a trending sport, there are little to no consumer electronics available to support rock climbing training during exercise. In this paper, we investigated the acceptance and appropriateness of wearables in climbing on different body parts. Based on an online survey with 54 climbers, we designed a wearable device and conducted a perception study with 12 participants in a climbing gym. Using vibro-tactile, audible, and visual cues while climbing an easy route and a hard route, requiring high physical and cognitive load, we found that the most suited notification channel is sound, directly followed by vibro-tactile output. Light has been found to be inappropriate for the use in the sport of climbing.","reference":[{"content":"1. Rami Aladdin and Paul Kry. 2012. Static Pose Reconstruction with an Instrumented Bouldering Wall. In Proc. VRST. 177--184. DOI: http://dx.doi.org/10.1145/2407336.2407369","paperID":"None"},{"content":"2. Joanna Bergstrom-Lehtovirta, Antti Oulasvirta, and Stephen Brewster. 2011. The Effects of Walking Speed on Target Acquisition on a Touchscreen Interface. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 143--146. DOI: http://dx.doi.org/10.1145/2037373.2037396","paperID":"None"},{"content":"3. Florian Daiber, Felix Kosmalla, and Antonio Krüger. 2013. BouldAR: Using Augmented Reality to Support Collaborative Boulder Training. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 949--954. DOI:http://dx.doi.org/10.1145/2468356.2468526","paperID":"None"},{"content":"4. Franz Konstantin Fuss and Gnther Niegl. 2006. Instrumented Climbing Holds and Dynamics of Sport Climbing. In The Engineering of Sport 6, Eckehard Fozzy Moritz and Steve Haake (Eds.). Springer New York, 57--62. DOI: http://dx.doi.org/10.1007/978-0--387--46050--5_11","paperID":"None"},{"content":"5. Alexander L Green and William S Helton. 2011. Dual-task performance during a climbing traverse. Experimental brain research 215, 3--4 (2011), 307--313.","paperID":"None"},{"content":"6. Rebecca Hansson and Peter Ljungstrand. 2000. The Reminder Bracelet: Subtle Notification Cues for Mobile Devices. In CHI '00 Extended Abstracts on Human Factors in Computing Systems (CHI EA '00). ACM, New York, NY, USA, 323--324. DOI: http://dx.doi.org/10.1145/633292.633488","paperID":"None"},{"content":"7. Chris Harrison, Brian Y. Lim, Aubrey Shick, and Scott E. Hudson. 2009a. Where to Locate Wearable Displays?: Reaction Time Performance of Visual Alerts from Tip to Toe. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 941--944. DOI: http://dx.doi.org/10.1145/1518701.1518845","paperID":"None"},{"content":"8. Chris Harrison, Brian Y. Lim, Aubrey Shick, and Scott E. Hudson. 2009b. Where to Locate Wearable Displays?: Reaction Time Performance of Visual Alerts from Tip to Toe. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 941--944. DOI: http://dx.doi.org/10.1145/1518701.1518845","paperID":"None"},{"content":"9. Mike Helt. 2014. 2014 Climbing Gyms & Trends. (2014). http://www.climbingbusinessjournal.com/ 2014-climbing-gyms-trends/","paperID":"None"},{"content":"10. William S. Helton, Alex L. Green, and Neil R. de Joux. 2013. Cognitive Resource Demands During Climbing: Considerations for Communication Technologies. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 57, 1 (2013), 1382--1386. DOI: http://dx.doi.org/10.1177/1541931213571306","paperID":"None"},{"content":"11. Raine Kajastila and Perttu Hämäläinen. 2014. Augmented Climbing: Interacting with Projected Graphics on a Climbing Wall. In Proc. CHI EA. 1279--1284. DOI: http://dx.doi.org/10.1145/2559206.2581139","paperID":"None"},{"content":"12. Felix Kosmalla, Florian Daiber, and Antonio Krüger. 2015. ClimbSense: Automatic Climbing Route Recognition Using Wrist-worn Inertia Measurement Units. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2033--2042. DOI:http://dx.doi.org/10.1145/2702123.2702311","paperID":"None"},{"content":"13. Cassim Ladha, Nils Y. Hammerla, Patrick Olivier, and Thomas Plötz. 2013. ClimbAX: Skill Assessment for Climbing Enthusiasts. In Proc. UbiComp. 235--244. DOI:http://dx.doi.org/10.1145/2493432.2493492","paperID":"None"},{"content":"14. Mats Liljedahl, Stefan Lindberg, and Jan Berg. 2005. Digiwall: An Interactive Climbing Wall. In Proc. ACE. 225--228. DOI: http://dx.doi.org/10.1145/1178477.1178513","paperID":"None"},{"content":"15. Kent Lyons, David Nguyen, Daniel Ashbrook, and Sean White. 2012. Facet: A Multi-segment Wrist Worn System. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 123--130. DOI:http://dx.doi.org/10.1145/2380116.2380134","paperID":"None"},{"content":"16. C. M. Mermier, J. M. Janot, D. L. Parker, and J. G. Swan. 2000. Physiological and anthropometric determinants of sport climbing performance. Br J Sports Med 34, 5 (Oct 2000), 359--65; discussion 366.","paperID":"None"},{"content":"17. Alexander Ng, Stephen A. Brewster, and John H. Williamson. 2014. Investigating the Effects of Encumbrance on One- and Two- Handed Interactions with Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1981--1990. DOI:http://dx.doi.org/10.1145/2556288.2557312","paperID":"None"},{"content":"18. Arne Nieuwenhuys, J Rob Pijpers, Raoul R D. Oudejans, and Frank C. Bakker. 2008. The influence of anxiety on visual attention in climbing. J Sport Exerc Psychol 30, 2 (Apr 2008), 171--185.","paperID":"None"},{"content":"19. Hisakazu Ouchi, Yoshifumi Nishida, Ilwoong Kim, Yoichi Motomura, and Hiroshi Mizoguchi. 2010. Detecting and Modeling Play Behavior Using Sensor-embedded Rock-climbing Equipment. In Proc. IDC. 118--127. DOI: http://dx.doi.org/10.1145/1810543.1810557","paperID":"None"},{"content":"20. Jerome Pasquero, Scott J. Stobbe, and Noel Stonehouse. 2011. A Haptic Wristwatch for Eyes-free Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 3257--3266. DOI: http://dx.doi.org/10.1145/1978942.1979425","paperID":"None"},{"content":"21. Halley P Profita, James Clawson, Scott Gilliland, Clint Zeagler, Thad Starner, Jim Budd, and Ellen Yi-Luen Do. 2013. Don't Mind Me Touching My Wrist: A Case Study of Interacting with On-Body Technology in Public. In Proc. ISWC '13. ACM, 89--96.","paperID":"None"},{"content":"22. Thijs Roumen, Simon T. Perrault, and Shengdong Zhao. 2015. NotiRing: A Comparative Study of Notification Channels for Wearable Interactive Rings. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2497--2500. DOI: http://dx.doi.org/10.1145/2702123.2702350","paperID":"None"},{"content":"23. UIAA. 2015. Rock Climbing Safety Standards. (2015). http://www.theuiaa.org/safety-standards.html","paperID":"None"},{"content":"24. Amanda Williams, Shelly Farnham, and Scott Counts. 2006. Exploring Wearable Ambient Displays for Social Awareness. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, New York, NY, USA, 1529--1534. DOI: http://dx.doi.org/10.1145/1125451.1125731","paperID":"None"}],"title":"ClimbAware: Investigating Perception and Acceptance of Wearables in Rock Climbing","filename":"CHI16/p1097","authors":["Felix Kosmalla","Frederik Wiehr","Florian Daiber","Antonio Krüger","Markus Löchtefeld"],"conference":"CHI '16"}