{"paperId":2858557,"citation":[],"reference":[{"content":"Pieter Abbeel and Andrew Y. Ng. 2004. Apprenticeship learning via inverse reinforcement learning. In Proceedings of the twenty-first international conference on Machine learning (ICML '04). ACM, NY, NY, USA, 1. http://doi.acm.org/10.1145/1015330.1015430","paperID":"None"},{"content":"Wolfgang Aigner, Silvia Miksch, Bettina Thurnher, and Stefan Biffl. 2005. PlanningLines: Novel Glyphs for Representing Temporal Uncertainties and Their Evaluation. In Proceedings of the Ninth International Conference on Information Visualisation (IV '05). IEEE Computer Society, Washington, DC, USA, 457463. http://dx.doi.org/10.1109/IV.2005.97","paperID":"None"},{"content":"American Automobile Association. 2009. Aggressive driving: Research update. American Automobile Association Foundation for Traffic Safety.","paperID":"None"},{"content":"John R. Anderson, Daniel Bothell, Michael D. Byrne, Scott Douglass, Christian Lebiere, and Yulin Qin. 2004. An integrated theory of the mind. Psychological review, 111(4), 1036--1060. http://dx.doi.org/10.1037/0033--295X.111.4.1036","paperID":"None"},{"content":"Mitra Baratchi, Nirvana Meratnia, Paul J. M. Havinga, Andrew K. Skidmore, and Bert A. K. G. Toxopeus. 2014. A hierarchical hidden semi-Markov model for modeling mobility data. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, NY, NY, USA, 401--412. http://doi.acm.org/10.1145/2632048.2636068","paperID":"None"},{"content":"Richard Bellman. 1957. A Markovian decision process. Journal of Mathematics and Mechanics, 6, 679--684.","paperID":"None"},{"content":"Oliver Brdiczka, Norman Makoto Su, and James Bo Begole. 2010. Temporal task footprinting: identifying routine tasks by their temporal patterns. In Proceedings of the 15th international conference on Intelligent user interfaces (IUI '10). ACM, NY, NY, USA, 281284. http://doi.acm.org/10.1145/1719970.1720011","paperID":"None"},{"content":"Andreas Bulling, Ulf Blanke, and Bernt Schiele. 2014. A tutorial on human activity recognition using bodyworn inertial sensors. ACM Comput. Surv. 46, 3, Article 33 (January 2014), 33 pages. http://doi.acm.org/10.1145/2499621","paperID":"None"},{"content":"Paolo Buono, Aleks Aris, Catherine Plaisant, Amir Khella, and Ben Shneiderman. 2005. Interactive pattern search in time series. In Electronic Imaging 2005, 175186. http://dx.doi.org/10.1117/12.587537","paperID":"None"},{"content":"Christopher Collins, Sheelagh Carpendale, and Gerald Penn. 2007. Visualization of uncertainty in lattices to support decision-making. In Proceedings of the 9th Joint Eurographics / IEEE VGTC conference on Visualization (EUROVIS'07), Ken Museth, Torsten Möller, and Anders Ynnerman (Eds.). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 51--58. http://dx.doi.org/10.2312/VisSym/EuroVis07/051-058","paperID":"None"},{"content":"Scott Davidoff, John Zimmerman, and Anind K. Dey. 2010. How routine learners can support family coordination. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 24612470. http://doi.acm.org/10.1145/1753326.1753699","paperID":"None"},{"content":"Scott Davidoff, Brian D. Ziebart, John Zimmerman, and Anind K. Dey. 2011. Learning patterns of pick-ups and drop-offs to support busy family coordination. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1175--1184. http://doi.acm.org/10.1145/1978942.1979119","paperID":"None"},{"content":"Anind K. Dey. 2001. Understanding and Using Context. Personal Ubiquitous Comput. 5, 1 (January 2001), 4--7. http://dx.doi.org/10.1007/s007790170019","paperID":"None"},{"content":"Nathan Eagle and Alex S. Pentland. 2009. Eigenbehaviors: identifying structure in routine. Behav. Ecol. Sociobiol., vol. 63, no. 7, 1057--1066. http://dx.doi.org/10.1007/s00265-009-0739-0","paperID":"None"},{"content":"Katayoun Farrahi and Daniel Gatica-Perez. 2012. Extracting Mobile Behavioral Patterns with the Distant N-Gram Topic Model. In Proceedings of the 2012 16th Annual International Symposium on Wearable Computers (ISWC) (ISWC '12). IEEE Computer Society, Washington, DC, USA, 1--8. http://dx.doi.org/10.1109/ISWC.2012.20","paperID":"None"},{"content":"Martha S. Feldman and Brian T. Pentland. 2003. Reconceptualizing organizational routines as a source of flexibility and change. Administrative Science Quarterly, 48 (1), 94--118. http://dx.doi.org/10.2307/3556620","paperID":"None"},{"content":"Geoffrey M. Hodgson. 1997. The ubiquity of habits and rules. Cambridge Journal of Economics, 21(6), 663--684.","paperID":"None"},{"content":"Jin-Hyuk Hong, Ben Margines, and Anind K. Dey. 2014. A smartphone-based sensing platform to model aggressive driving behaviors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 40474056. http://doi.acm.org/10.1145/2556288.2557321","paperID":"None"},{"content":"Edwin T. Jaynes. 1957. Information theory and statistical mechanics. Physical review, 106(4), 620. http://dx.doi.org/10.1103/PhysRev.106.620","paperID":"None"},{"content":"Jin Jing and Pedro Szekely. 2010. Interactive querying of temporal data using a comic strip metaphor. In 2010 IEEE Symposium on Visual Analytics Science and Technology (VAST), 163--170. http://dx.doi.org/10.1109/VAST.2010.5652890","paperID":"None"},{"content":"Daniel A. Keim, Florian Mansmann, Jorn Schneidewind, and Hartmut Ziegler. 2006. Challenges in Visual Data Analysis. In Proceedings of the conference on Information Visualization (IV '06). IEEE Computer Society, Washington, DC, USA, 9--16. http://dx.doi.org/10.1109/IV.2006.31","paperID":"None"},{"content":"John Krumm and Eric Horvitz. 2006. Predestination: inferring destinations from partial trajectories. In Proceedings of the 8th international conference on Ubiquitous Computing (UbiComp'06), Paul Dourish and Adrian Friday (Eds.). Springer-Verlag, Berlin, Heidelberg, 243--260. http://dx.doi.org/10.1007/11853565_15","paperID":"None"},{"content":"Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stagebased model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 557--566. http://doi.acm.org/10.1145/1753326.1753409","paperID":"None"},{"content":"Nan Li, William Cushing, Subbarao Kambhampati, and Sungwook Yoon. 2014. Learning Probabilistic Hierarchical Task Networks as Probabilistic ContextFree Grammars to Capture User Preferences. ACM Trans. Intell. Syst. Technol. 5, 2, Article 29 (April 2014), 32 pages. http://doi.acm.org/10.1145/2589481","paperID":"None"},{"content":"Brian Y. Lim and Anind K. Dey. 2011. Investigating intelligibility for uncertain context-aware applications. In Proceedings of the 13th international conference on Ubiquitous computing(UbiComp '11). ACM, NY, NY, USA, 415--424. http://doi.acm.org/10.1145/2030112.2030168","paperID":"None"},{"content":"Magnus S. Magnusson. 2000. Discovering hidden time patterns in behavior: T-patterns and their detection. Behavior Research Methods, Instruments, & Computers, 32(1), 93--110. http://dx.doi.org/10.3758/BF03200792","paperID":"None"},{"content":"Neal Martin. 2008. Habit: the 95% of behavior marketers ignore. First edition. FT Press: NJ.","paperID":"None"},{"content":"Megan Monroe, Rongjian Lan, Hanseung Lee, Catherine Plaisant, and Ben Shneiderman. 2013. Temporal Event Sequence Simplification. IEEE Transactions on Visualization and Computer Graphics 19, 12 (December 2013), 2227--2236. http://dx.doi.org/10.1109/TVCG.2013.200","paperID":"None"},{"content":"Andrew Y. Ng and Stuart J. Russell. 2000. Algorithms for Inverse Reinforcement Learning. InProceedings of the Seventeenth International Conference on Machine Learning (ICML '00), Pat Langley (Ed.). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 663--670.","paperID":"None"},{"content":"Wanda J. Orlikowski and JoAnne Yates. 2002. It's About Time: Temporal Structuring in Organizations. Organization Science 13, 6 (November 2002), 684--700. http://dx.doi.org/10.1287/orsc.13.6.684.501","paperID":"None"},{"content":"Catherine Plaisant, Brett Milash, Anne Rose, Seth Widoff, and Ben Shneiderman. 1996. LifeLines: visualizing personal histories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '96), Michael J. Tauber (Ed.). ACM, NY, NY, USA, 221--227. http://doi.acm.org/10.1145/238386.238493","paperID":"None"},{"content":"Martin L. Puterman. 2014. Markov decision processes: discrete stochastic dynamic programming. John Wiley & Sons, Inc., NY, NY, USA.","paperID":"None"},{"content":"Jonathan C. Roberts. 2007. State of the Art: Coordinated & Multiple Views in Exploratory Visualization. In Proceedings of the Fifth International Conference on Coordinated and Multiple Views in Exploratory Visualization (CMV '07). IEEE Computer Society, Washington, DC, USA, 61--71. http://dx.doi.org/10.1109/CMV.2007.20","paperID":"None"},{"content":"David L. Ronis, J. Frank Yates, and John P. Kirscht, 1989. Attitudes, decisions, and habits as determinants of repeated behavior. A.R. Pratkanis, S.J. Breckler, & A.G. Greenwald, Eds., Attitude structure and function, Lawrence Erlbaum: NJ, 213--239.","paperID":"None"},{"content":"Adam Sadilek and John Krumm. 2012. Far Out: Predicting Long-Term Human Mobility. In Proceedings of the Twenty-Sixth AAAI Conference on Artificial Intelligence (AAAI '12), 814--820.","paperID":"None"},{"content":"David Shinar and Richard Compton. 2004. Aggressive driving: an observational study of driver, vehicle, and situational variables, Accident Analysis & Prevention, Volume 36, Issue 3, May 2004, 429--437. http://dx.doi.org/10.1016/S0001--4575(03)00037-X","paperID":"None"},{"content":"Richard Taylor. 1950. Purposeful and non-purposeful behavior: A rejoinder. Philosophy of Science, 17, 4. The University of Chicago Press on behalf of the Philosophy of Science Association, 327--332.","paperID":"None"},{"content":"Martin Wattenberg. 2002. Arc diagrams: Visualizing structure in strings. In Proceedings of IEEE Symposium on Information Visualization (INFOVIS 2002). IEEE, 110--116. http://dx.doi.org/10.1109/INFVIS.2002.1173155","paperID":"None"},{"content":"Marc Weber, Marc Alexa, and Wolfgang Müller. 2001. Visualizing time-series on spirals. In Proceedings of IEEE Symposium on Information Visualization (INFOVIS 2001). IEEE, 7--14. http://doi.ieeecomputersociety.org/10.1109/INFVIS.20 01.963273","paperID":"None"},{"content":"Krist Wongsuphasawat, John Alexis Guerra Gómez, Catherine Plaisant, Taowei David Wang, Meirav Taieb-Maimon, and Ben Shneiderman. 2011. LifeFlow: visualizing an overview of event sequences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1747--1756. http://doi.acm.org/10.1145/1978942.1979196","paperID":"None"},{"content":"Jian Zhao, Fanny Chevalier, and Ravin Balakrishnan. 2011. KronoMiner: using multi-foci navigation for the visual exploration of time-series data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1737--1746. http://doi.acm.org/10.1145/1978942.1979195","paperID":"None"},{"content":"Jian Zhao, Fanny Chevalier, Emmanuel Pietriga, and Ravin Balakrishnan. 2011. Exploratory analysis of time-series with chronolenses. In IEEE Transactions on Visualization and Computer Graphics, 17, 12. IEEE, 2422--2431. http://dx.doi.org/10.1109/TVCG.2011.195","paperID":"None"},{"content":"Brian D. Ziebart, Andrew L. Maas, Anind K. Dey, and J. Andrew Bagnell. 2008. Navigate like a cabbie: probabilistic reasoning from observed context-aware behavior. In Proceedings of the 10th international conference on Ubiquitous computing (UbiComp '08). ACM, NY, NY, USA, 322--331. http://doi.acm.org/10.1145/1409635.1409678","paperID":"None"},{"content":"Brian D. Ziebart, Nathan Ratliff, Garratt Gallagher, Christoph Mertz, Kevin Peterson, J. Andrew Bagnell, Martial Hebert, Anind K. Dey, and Siddhartha Srinivasa. 2009. Planning-based prediction for pedestrians. In IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2009), 39313936. http://dx.doi.org/10.1109/IROS.2009.5354147","paperID":"None"},{"content":"Brian D. Ziebart, J. Andrew Bagnell, and Anind K. Dey. 2010. Modeling interaction via the principle of maximum causal entropy. In Proceedings of the 27th international conference on Machine learning (ICML '10). ACM, NY, NY, USA., 1247--1254.","paperID":"None"},{"content":"Brian D. Ziebart. 2010. Modeling purposeful adaptive behavior with the principle of maximum causal entropy. (Doctoral dissertation, Carnegie Mellon University).","paperID":"None"}],"abstract":"Human routines are blueprints of behavior, which allow people to accomplish purposeful repetitive tasks at many levels, ranging from the structure of their day to how they drive through an intersection. People express their routines through actions that they perform in the particular situations that triggered those actions. An ability to model routines and understand the situations in which they are likely to occur could allow technology to help people improve their bad habits, inexpert behavior, and other suboptimal routines. However, existing routine models do not capture the causal relationships between situations and actions that describe routines. Our main contribution is the insight that byproducts of an existing activity prediction algorithm can be used to model those causal relationships in routines. We apply this algorithm on two example datasets, and show that the modeled routines are meaningful-that they are predictive of people's actions and that the modeled causal relationships provide insights about the routines that match findings from previous research. Our approach offers a generalizable solution to model and reason about routines.","title":"Modeling and Understanding Human Routine Behavior","filename":"CHI16/p248","authors":["Nikola Banovic","Tofi Buzali","Fanny Chevalier","Jennifer Mankoff","Anind K. Dey"],"conference":"CHI '16"}