{"paperId":2858054,"citation":[],"reference":[{"content":"Rachel Clarke, Peter Wright, Madeline Balaam, and John McCarthy. 2013. Digital Portraits: Photo-sharing After Domestic Violence. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2517--2526. http://doi.org/10.1145/2470654.2481348","paperID":"None"},{"content":"James Clifford and George E. Marcus. 1986. Writing Culture: The Poetics and Politics of Ethnography?: a School of American Research Advanced Seminar. University of California Press.","paperID":"None"},{"content":"Jill P. Dimond, Michaelanne Dye, Daphne Larose, and Amy S. Bruckman. 2013. Hollaback!: The Role of Storytelling Online in a Social Movement Organization. Proceedings of the 2013 Conference on Computer Supported Cooperative Work, ACM, 477--490. http://doi.org/10.1145/2441776.2441831","paperID":"None"},{"content":"Carl DiSalvo, Illah Nourbakhsh, David Holstius, Ayça Akin, and Marti Louw. 2008. The Neighborhood Networks Project: A Case Study of Critical Engagement and Creative Expression Through Participatory Design. Proceedings of the Tenth Anniversary Conference on Participatory Design 2008, Indiana University, 41--50. Retrieved August 28, 2015 from http://dl.acm.org/citation.cfm?id=1795234.1795241","paperID":"None"},{"content":"Christina Dunbar-Hester. 2014. Low Power to the People: Pirates, Protest, and Politics in FM Radio Activism. The MIT Press, Cambridge, Massachusetts.","paperID":"None"},{"content":"Ron Eglash. 2002. Race, Sex, and Nerds: From Black Geeks to Asian American Hipsters. Social Text 20, 2: 49--64.","paperID":"None"},{"content":"Sarah Fox and Christopher Le Dantec. 2014. Community Historians: Scaffolding Community Engagement Through Culture and Heritage. Proceedings of the 2014 Conference on Designing Interactive Systems, ACM, 785--794. http://doi.org/10.1145/2598510.2598563","paperID":"None"},{"content":"Sarah Fox, Rachel Rose Ulgado, and Daniela Rosner. 2015. Hacking Culture, Not Devices: Access and Recognition in Feminist Hackerspaces. Proceedings of the ACM 2015 conference on Computer Supported Cooperative Work.","paperID":"None"},{"content":"Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural Probes. interactions 6, 1: 21--29. http://doi.org/10.1145/291224.291235","paperID":"None"},{"content":"Kathleen Hanna and Johanna Fateman. 2014. The Riot Grrrl Collection. The Feminist Press at CUNY, New York.","paperID":"None"},{"content":"Gillian R. Hayes. 2011. The Relationship of Action Research to Human-computer Interaction. ACM Trans. Comput.-Hum. Interact. 18, 3: 15:1--15:20. http://doi.org/10.1145/1993060.1993065","paperID":"None"},{"content":"Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial Computing: A Lens on Design and Development. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1311--1320. http://doi.org/10.1145/1753326.1753522","paperID":"None"},{"content":"Kat Jungnickel. In Press. Making things up: Design perspectives from a study of Victorian women's convertible cycle. interactions.","paperID":"None"},{"content":"Katrina Jungnickel and Larissa Hjorth. 2014. Methodological entanglements in the field: methods, transitions and transmissions. Visual Studies 29, 2: 136--145. http://doi.org/10.1080/1472586X.2014.887263","paperID":"None"},{"content":"John Law. 2004. After Method: Mess in Social Science Research. Routledge, London?; New York.","paperID":"None"},{"content":"Celia Lury and Nina Wakeford (eds.). 2013. Inventive Methods: The Happening of the Social. Routledge, Place of publication not identified.","paperID":"None"},{"content":"Paul Rabinow, George E. Marcus, James D. Faubion, and Tobias Rees. 2008. Designs for an Anthropology of the Contemporary. Duke University Press.","paperID":"None"},{"content":"Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. CoDesign 4, 1: 5--18. http://doi.org/10.1080/15710880701875068","paperID":"None"},{"content":"Nick Taylor, David M. Frohlich, Paul Egglestone, et al. 2014. Utilising Insight Journalism for Community Technology Design. Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2995--3004. http://doi.org/10.1145/2556288.2557054","paperID":"None"},{"content":"Nina Wakeford. 2006. Power Point and the Crafting of Social Data. Ethnographic Praxis in Industry Conference Proceedings 2006, 1: 94--108. http://doi.org/10.1111/j.1559--8918.2006.tb00039.x","paperID":"None"},{"content":"Jayne Wallace, John McCarthy, Peter C. Wright, and Patrick Olivier. 2013. Making Design Probes Work. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3441--3450. http://doi.org/10.1145/2470654.2466473","paperID":"None"},{"content":"Amanda Williams, Johanna Brewer, Alicia Gibb, Wilhelm Eric, and Hugh Forrest. 2012. Indy R&D: doing HCI research off the beaten path. CHI'12 Extended Abstracts on Human Factors in Computing Systems, ACM, 1131--1134.","paperID":"None"},{"content":"Margery Wolf. 1992. A Thrice-Told Tale: Feminism, Postmodernism, and Ethnographic Responsibility. Stanford University Press, Stanford, Calif.","paperID":"None"},{"content":"NYC Feminist Zine Fest: A Showcase. Barnard College. Retrieved from http://barnard.edu/events/nycfeminist-zine-fest","paperID":"None"}],"abstract":"This paper examines the work to bring HCI research back to the people and sites under study. We draw on our ongoing collaboration with members of feminist hackerspaces in Northern California where we conducted fieldwork over eighteen months in 2014 and 2015. Together we created and distributed a zine -- a self-published magazine produced with a photocopier -- that knit together content of a published paper with local histories of feminist print production. By tracing the efforts involved in this collaboration and its effects on our research project, our research community, and ourselves, we extend HCI's efforts to foster continued dialogue with our sites of study. We end by outlining strategies for bolstering this mission both within and beyond HCI.","title":"Continuing the Dialogue: Bringing Research Accounts Back into the Field","filename":"CHI16/p1426","authors":["Sarah Fox","Daniela K. Rosner"],"conference":"CHI '16"}