{"paperId":2858379,"citation":[],"abstract":"While the majority of older adults are now active online, they are often perceived as passive consumers of online information rather than active creators of content. As a counter to this view, we examine the practices of older adult bloggers (N=20) through in-depth interviews. We study this group of older adults as a unique case of content creation and sharing. We find that the practice of creating and sharing through blogging meets several important psychological and social needs for older adults. Specifically, blogging supports the development of identity in older adulthood; fosters self-expression that supports older adults' values; provides meaningful engagement during retirement; and enables a sense of community and social interaction that is important for wellbeing in late-life. We argue for a focus on designing for late-life development and detail opportunities for online systems to better support the dynamic experience of growing older through online content creation and sharing.","reference":[{"content":"Robin N. Brewer and Jasmine Jones. 2015. Pinteresce: Exploring Reminiscence as an Incentive to Digital Reciprocity for Older Adults. Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing CSCW'15 Companion, ACM Press, 243-246. http://doi.org/10.1145/2685553.2699017","paperID":"None"},{"content":"A.J. Bernheim Brush, Kori M Inkpen, and Kimberly Tee. 2008. SPARCS: exploring sharing suggestions to enhance family connectedness. Proceedings of the ACM 2008 conference on Computer supported cooperative work CSCW '08, ACM Press, 629. http://doi.org/10.1145/1460563.1460661","paperID":"None"},{"content":"John M. Carroll, Gregorio Convertino, Umer Farooq, and Mary Beth Rosson. 2012. The firekeepers: Aging considered as a resource. Universal Access in the Information Society 11, 1, 7-15. http://doi.org/10.1007/s10209-011-0229--9","paperID":"None"},{"content":"Laura L. Carstensen and Susan Turk Charles. 1998. Emotion in the Second Half of Life. Current Directions in Psychological Science 7, 144-149. http://doi.org/10.1111/1467--8721.ep10836825","paperID":"None"},{"content":"K Charmaz. 2006. Constructing grounded theory: a practical guide through qualitative analysis. http://doi.org/10.1016/j.lisr.2007.11.003","paperID":"None"},{"content":"Gina Masullo Chen. 2012. Why do women write personal blogs? Satisfying needs for self-disclosure and affiliation tell part of the story. Computers in Human Behavior 28, 1, 171-180. http://doi.org/10.1016/j.chb.2011.08.024","paperID":"None"},{"content":"Deborah S. Chung and Sujin Kim. Blogging activity among cancer patients and their companions: Uses, gratifications, and predictors of outcomes. Journal of the American Society for Information Science and Technology 59, 2. http://doi.org/10.1002/asi.v59:2","paperID":"None"},{"content":"Gene D Cohen. 2006. Research on Creativity and Aging?: The Positive Impact of the Arts on Health and Illness. Generations 30, 1, 7-15.","paperID":"None"},{"content":"Graeme W Coleman, Lorna Gibson, Vicki L Hanson, Ania Bobrowicz, and Alison McKay. 2010. Engaging the disengaged. Proceedings of the 8th ACM Conference on Designing Interactive Systems 2010, ACM Press, 175-178. http://doi.org/10.1145/1858171.1858202","paperID":"None"},{"content":"Raymundo Cornejo, Jesús Favela, and Mónica Tentori. 2010. Ambient displays for integrating older adults into social networking sites. Collaboration and Technology, 321-336. Retrieved from http://link.springer.com/chapter/10.1007/978--3--64215714--1_24","paperID":"None"},{"content":"Raymundo Cornejo, Mónica Tentori, and Jesús Favela. 2013. Enriching in-person encounters through social media: A study on family connectedness for the elderly. International Journal of Human-Computer Studies 71, 9. http://doi.org/10.1016/j.ijhcs.2013.04.001","paperID":"None"},{"content":"Erin York Cornwell and Linda J Waite. 2009. Social Disconnectedness, Perceived Isolation, and Health among Older Adults. Journal of Health and Social Behavior 50, 1, 31-48. http://doi.org/10.1177/002214650905000103","paperID":"None"},{"content":"Shelia R Cotten, George Ford, Sherry Ford, and Timothy M Hale. 2012. Internet use and depression among older adults. Computers in Human Behavior 28, 2, 496-499. http://doi.org/10.1016/j.chb.2011.10.021","paperID":"None"},{"content":"Masashi Crete-Nishihata, Ronald M Baecker, Michael Massimi, et al. 2012. Reconstructing the past: Personal memory technologies are not just personal and not just for memory. Human-Computer Interaction 27, May, 92-123. http://doi.org/10.1080/07370024.2012.656062","paperID":"None"},{"content":"Jessica M. David, Alison Benjamin, Ronald M. Baecker, Diane Gromala, and Jeremy Birnholtz. 2011. Living with pain, staying in touch: exploring the communication needs of older adults with chronic pain. in Proc. CHI EA '11, 1219-1224. http://doi.org/10.1145/1979742.1979751","paperID":"None"},{"content":"Maeve Duggan, Nicole B. Ellison, Cliff Lampe, Amanda Lenhart, and Mary Madden. 2014. Social Media Update 2014. Retrieved from http://www.pewinternet.org/2015/01/09/social-mediaupdate-2014/","paperID":"None"},{"content":"Maeve Duggan and Andrew Perrin. 2015. Americans' Internet Access: 2000--2015. Retrieved from http://www.pewinternet.org/2015/06/26/americansinternet-access-2000--2015/","paperID":"None"},{"content":"Maeve Duggan. 2015. Mobile Messaging and Social Media 2015. Retrieved from http://www.pewinternet.org/2015/08/19/mobilemessaging-and-social-media-2015/","paperID":"None"},{"content":"Aaron M. Eakman, Mike E. Carlson, and Florence A. Clark. 2010. The Meaningful Activity Participation Assessment: A Measure of Engagement in Personally Valued Activities. The International Journal of Aging and Human Development 70, 4, 299-317. http://doi.org/10.2190/AG.70.4.b","paperID":"None"},{"content":"Kathrin M. Gerling, Regan L. Mandryk, Matthew Miller, Michael R. Kalyn, Max Birk, and Jan D. Smeddinck. 2015. Designing Wheelchair-Based Movement Games. ACM Transactions on Accessible Computing 6, 2, 1-23. http://doi.org/10.1145/2724729","paperID":"None"},{"content":"Lorna Gibson, Wendy Moncur, Paula Forbes, John Arnott, Christopher Martin, and Amritpal S Bhachu. 2010. Designing Social Networking Sites for Older Adults. BCS '10 Proceedings of the 24th BCS Interaction Specialist Group Conference, BCS, 186- 194. Retrieved from http://dl.acm.org/citation.cfm?id=2146303.2146331","paperID":"None"},{"content":"Erving Goffman. 1982. The presentation of self in everyday life. In The Presentation of Self in Everyday Life. 1-10.","paperID":"None"},{"content":"Rebecca Gulotta, William Odom, Haakon Faste, and Jodi Forlizzi. 2014. Legacy in the age of the internet: reflections on how interactive systems shape how we are remembered. Proceedings of the 2014 conference on Designing interactive systems DIS '14, ACM Press, 975-984. http://doi.org/10.1145/2598510.2598579","paperID":"None"},{"content":"Keith N Hampton, Lauren Sessions Goulet, Lee Rainie, and Kristen Purcell. 2011. Social networking sites and our lives. Pew Internet American Life Project 47, 9, 85. Retrieved from http://pewinternet.org/Reports/2011/Technology-andsocial-networks.aspx","paperID":"None"},{"content":"Dave Harley and Geraldine Fitzpatrick. 2008. YouTube and intergenerational communication: the case of Geriatric1927. Universal Access in the Information Society 8, 1, 5-20. http://doi.org/10.1007/s10209-008-0127-y","paperID":"None"},{"content":"Alexis Hope, Ted Schwaba, and Anne Marie Piper. 2014. Understanding digital and material social communications for older adults. Proceedings of the 32nd annual ACM conference on Human factors in computing systems, ACM Press, 3903-3912. http://doi.org/10.1145/2556288.2557133","paperID":"None"},{"content":"Azmina Karimi and Carman Neustaedter. 2012. From high connectivity to social isolation: communication practices of older adults in the digital age. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion. Retrieved from http://dl.acm.org/citation.cfm?id=2141559","paperID":"None"},{"content":"Verne C. Kopytoff. 2011. Blogs Wane as the Young Drift to Sites Like Twitter. The NY Times. Retrieved from http://www.nytimes.com/2011/02/21/technology/intern et/21blog.html","paperID":"None"},{"content":"Vilma Lehtinen, J Nasanen, and Risto Sarvas. 2009. \"A little silly and empty-headed\": older adults' understandings of social networking sites. BCS-HCI, British Computer Society, 45-54. Retrieved from http://portal.acm.org/citation.cfm?id=1671011.167101","paperID":"None"},{"content":"Amanda Lenhart, Deborah Fallows, and John Horrigan. 2004. Content Creation Online. Retrieved from http://www.pewinternet.org/2004/02/29/contentcreation-online-2/","paperID":"None"},{"content":"Amanda Lenhart and Susannah Fox. 2006. Bloggers: A portrait of the internet's new storytellers. Retrieved from http://www.pewinternet.org/2006/07/19/bloggers/","paperID":"None"},{"content":"Amanda Lenhart. 2015. Teens, Social Media & Technology Overview 2015. Retrieved from http://www.pewinternet.org/2015/04/09/teens-socialmedia-technology-2015/","paperID":"None"},{"content":"Siân E Lindley, Richard Harper, and Abigail Sellen. 2008. Designing for Elders': Exploring the Complexity of Relationships in Later Life. BCS-HCi, 77-86.","paperID":"None"},{"content":"Siân E Lindley, Richard Harper, and Abigail Sellen. 2009. Desiring to be in touch in a changing communications landscape. Proceedings of the 27th international conference on Human factors in computing systems CHI 09, ACM Press, 1693. http://doi.org/10.1145/1518701.1518962","paperID":"None"},{"content":"Siân E. Lindley. 2011. Shades of lightweight: supporting cross-generational communication through home messaging. Universal Access in the Information Society 11, 1, 31-43. http://doi.org/10.1007/s10209011-0231--2","paperID":"None"},{"content":"Siân Lindley and Jayne Wallace. 2015. Placing in Age. ACM Transactions on Computer-Human Interaction 22, 4, 1-39. http://doi.org/10.1145/2755562","paperID":"None"},{"content":"Stephen Lindsay, Katie Brittain, Daniel Jackson, Cassim Ladha, Karim Ladha, and Patrick Olivier. 2012. Empathy, participatory design and people with dementia. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, ACM Press, 521. http://doi.org/10.1145/2207676.2207749","paperID":"None"},{"content":"Mary Madden. 2010. Older Adults and Social Media. Retrieved from http://www.pewinternet.org/2010/08/27/older-adultsand-social-media/","paperID":"None"},{"content":"Aqueasha Martin-Hammond, Abdullah Ali, Catherine Hornback, and Amy K. Hurst. 2015. Understanding design considerations for adaptive user interfaces for accessible pointing with older and younger adults. Proceedings of the 12th Web for All Conference on W4A '15, ACM Press, 1-10. http://doi.org/10.1145/2745555.2746645","paperID":"None"},{"content":"Alice E. Marwick and Danah Boyd. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1, 114-133. http://doi.org/10.1177/1461444810365313","paperID":"None"},{"content":"Susan H. McFadden and Anne D. Basting. 2010. Healthy Aging Persons and Their Brains: Promoting Resilience Through Creative Engagement. Clinics in Geriatric Medicine 26, 149-161. http://doi.org/10.1016/j.cger.2009.11.004","paperID":"None"},{"content":"Miller McPherson, Lynn Smith-Lovin, and Matthew E. Brashears. 2006. Social Isolation in America: Changes in Core Discussion Networks over Two Decades. American Sociological Review 71, 3, 353-375. http://doi.org/10.1177/000312240807300610","paperID":"None"},{"content":"Robinson Meyer. 2015. What Blogging Has Become. The Atlantic. Retrieved from http://www.theatlantic.com/technology/archive/2015/0 2/what-blogging-has-become/386201/","paperID":"None"},{"content":"Alex Mihailidis, Scott Blunsden, Jennifer Boger, et al. 2010. Towards the development of a technology for art therapy and dementia: Definition of needs and design constraints. The Arts in Psychotherapy 37, 4, 293-300. http://doi.org/10.1016/j.aip.2010.05.004","paperID":"None"},{"content":"Luca Morganti, Giuseppe Riva, Silvio Bonfiglio, and Andrea Gaggioli. 2013. Building collective memories on the web: the Nostalgia Bits project. International Journal of Web Based Communities 9, 1, 83-104. http://doi.org/10.1504/IJWBC.2013.051373","paperID":"None"},{"content":"Bonnie A Nardi, Diane J Schiano, Michelle Gumbrecht, and Luke Swartz. 2004. Why we blog. Communications of the ACM 47, 12, 41. http://doi.org/10.1145/1035134.1035163","paperID":"None"},{"content":"Bonnie A. Nardi, Diane J. Schiano, and Michelle Gumbrecht. 2004. Blogging as social activity, or, would you let 900 million people read your diary? Proceedings of the 2004 ACM conference on Computer supported cooperative work CSCW '04, ACM Press, 222. http://doi.org/10.1145/1031607.1031643","paperID":"None"},{"content":"Chris Norval, John L. Arnott, and Vicki L Hanson. 2014. What's on your mind?: investigating recommendations for inclusive social networking and older adults. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 3923-3932. http://doi.org/10.1145/2556288.2556992","paperID":"None"},{"content":"William Odom, Richard Banks, David Kirk, Richard Harper, Siân Lindley, and Abigail Sellen. 2012. Technology Heirlooms?: Considerations for Passing Down and Inheriting Digital Materials. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 337-346. http://doi.org/10.1145/2207676.2207723","paperID":"None"},{"content":"Anne-Marie Oostveen. 2011. The internet as an empowering technology for stigmatized groups: a case study of weight loss bloggers. Proceeding BCS-HCI '11 Proceedings of the 25th BCS Conference on Human-Computer Interaction, 114-119. Retrieved from http://dl.acm.org/citation.cfm?id=2305316.2305337","paperID":"None"},{"content":"John W Osborne. 2012. Psychological effects of the transition to retirement. Canadian Journal of Counselling and Psychotherapy 46, 45-58. http://doi.org/10.1080/13642537.2012.734472","paperID":"None"},{"content":"S Tejaswi Peesapati, Victoria Schwanda, Johnathon Schultz, Matt Lepage, So-yae Jeong, and Dan Cosley. 2010. Pensieve: Supporting Everyday Reminiscence. Proceedings of the 28th international conference on Human factors in computing systems CHI '10, ACM Press, 2027. http://doi.org/10.1145/1753326.1753635","paperID":"None"},{"content":"Anne Marie Piper, Nadir Weibel, and James D. Hollan. 2010. Introducing multimodal paper-digital interfaces for speech-language therapy. Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility - ASSETS '10, 203. http://doi.org/10.1145/1878803.1878840","paperID":"None"},{"content":"Yvonne Rogers, Jeni Paay, and Margot Brereton. 2014. Never Too Old: Engaging Retired People Inventing the Future with MaKey MaKey. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '14, 3913-3922. http://doi.org/10.1145/2556288.2557184","paperID":"None"},{"content":"Carol D. Ryff. 1995. Psychological Well-Being in Adult Life. Current Directions in Psychological Science 4, 99-104. http://doi.org/10.1111/14678721.ep10772395","paperID":"None"},{"content":"Na'ama Shapira, Azy Barak, and Iddo Gal. 2007. Promoting older adults' well-being through Internet training and use. Aging & mental health 11, 5, 477- 484. http://doi.org/10.1080/13607860601086546","paperID":"None"},{"content":"Aaron Smith. 2011. Why Americans use social media. Retrieved from http://www.pewinternet.org/2011/11/15/whyamericans-use-social-media/","paperID":"None"},{"content":"Hanna van Solinge and Kène Henkens. 2008. Adjustment to and satisfaction with retirement: Two of a kind? Psychology and Aging 23, 2, 422-434. http://doi.org/10.1037/0882--7974.23.2.422","paperID":"None"},{"content":"Molly M. Stevens, Gregory D. Abowd, Khai N. Truong, and Florian Vollmer. 2003. Getting into the Living Memory Box: Family archives & holistic design. Personal and Ubiquitous Computing 7, 3--4, 210-216. http://doi.org/10.1007/s00779-003-0220--4","paperID":"None"},{"content":"S Shyam Sundar and Anne Oeldorf-Hirsch. 2011. Retirees on Facebook: can online social networking enhance their health and wellness? CHI'11 Extended, 2287-2292. http://doi.org/10.1145/1979742.1979931","paperID":"None"},{"content":"Ursina Teuscher. 2010. Change and persistence of personal identities after the transition to retirement. International journal of aging & human development 70, 1, 89-106. http://doi.org/10.2190/AG.70.1.d","paperID":"None"},{"content":"Elizabeth Thiry, Siân Lindley, Richard Banks, and Tim Regan. 2013. Authoring personal histories: Exploring the timeline as a framework for meaning making. Proceedings of the 2013 SIGCHI conference on Human Factors in computing systems (CHI 2013), 1619-1628. http://doi.org/10.1145/2470654.2466215","paperID":"None"},{"content":"John Vines, Gary Pritchard, Peter Wright, Patrick Olivier, and Katie Brittain. 2015. An Age-Old Problem: Examining the Discourses of Ageing in HCI and Strategies for Future Research. ACM Transactions on Computer-Human Interaction 22, 1, 1-27. http://doi.org/10.1145/2696867","paperID":"None"},{"content":"Kerryellen G. Vroman, Sajay Arthanat, and Catherine Lysack. 2015. \"Who over 65 is online?\" Older adults' dispositions toward information communication technology. Computers in Human Behavior 43, 156- 166. http://doi.org/10.1016/j.chb.2014.10.018","paperID":"None"},{"content":"Jenny Waycott, Frank Vetere, Sonja Pedell, et al. 2013. Older adults as digital content producers. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13, ACM Press, 39. http://doi.org/10.1145/2470654.2470662","paperID":"None"},{"content":"Susan Wendell. 1996. The rejected body : feminist philosophical reflections on disability. In Routledge. 57-68.","paperID":"None"},{"content":"Bo Xie, Ivan Watkins, Jen Golbeck, and Man Huang. 2012. Understanding and Changing Older Adults' Perceptions and Learning of Social Media. Educational Gerontology 38, September 2014, 282-296. http://doi.org/10.1080/03601277.2010.544580","paperID":"None"}],"title":"\"Tell It Like It Really Is\": A Case of Online Content Creation and Sharing Among Older Adult Bloggers","filename":"CHI16/p5529","authors":["Robin Brewer","Anne Marie Piper"],"conference":"CHI '16"}