{"paperId":2858193,"abstract":"Maintaining work focus when on a computer is a major challenge, and people often feel that they use their time ineffectively. To improve focus we designed meTime, a real-time awareness application that shows users how they allocate their time across applications. In two real-world deployments involving 118 participants, we examined whether greater awareness of time use improves focus. In our first deployment, we provided awareness information using meTime, to both office workers and students. Exposure to meTime reduced use of social media, email, browsing and total time online. However increased awareness didn't affect time spent in productivity applications. A second educational deployment largely replicated these results and showed that meTime also reduced users' perceptions of their ability to focus effectively. Changed perceptions were associated with higher class grades. We discuss practical and theoretical implications as well as design principles for use of time applications.","citation":[],"reference":[{"content":"Rachel Adler and Raquel Benbunan-Fich. 2013. Self-interruptions in discretionary multitasking. Computers in Human Behavior 29, 2: 1441--1449.","paperID":"None"},{"content":"Anti-Social. 2015. Retrieved Dec 30th 2015 from https://anti-social.cc/","paperID":"None"},{"content":"Peter Bogunovich and David Salvucci. 2010. Inferring multitasking breakpoints from single-task data. In Proc of Cognitive Science Society, 1732--1737. Austin, TX: Cognitive Science Society.","paperID":"None"},{"content":"Lora Burke et al. 2011. Self-monitoring in weight loss: a systematic review of the literature. Journal of the American Dietetic Association 111, 1: 92--102.","paperID":"None"},{"content":"Mark Carrier et al. 201 Causes, effects, and practicalities of everyday multitasking, Developmental Review, 35, 64--78.","paperID":"None"},{"content":"Dennis Clayson and Debra Haley. 2012. An introduction to multitasking and texting. Journal of Marketing Education 35, 1: 26--40.","paperID":"None"},{"content":"Emily Collins et al. 2014. Social networking use and RescueTime: the issue of engagement. In Proceedings of the 2014 ACM Conference on Pervasive and Ubiquitous Computing 687--690. http://dx.doi.org/10.1145/2638728.2641322","paperID":"None"},{"content":"Ed Cutrell et al. 2001. Notification, disruption, and memory. In Proc. of INTERACT 2001, 263--269. Springer, New York.","paperID":"None"},{"content":"Laura Dabbish, and Robert Kraut. 2006. Email overload at work. Proceedings of the ACM Conference on Computer Supported Cooperative Work (CSCW '06), 431--440. http://dx.doi.org/10.1145/1180875.1180941","paperID":"None"},{"content":"Yvonne Ellis et al. 20 The effect of multitasking on the grade performance of business students. Research in Higher Education Journal, 8.","paperID":"None"},{"content":"Focus. 2015. Retrieved Dec 30th 2015 from http://www.focusapp.io/","paperID":"None"},{"content":"FocusBooster. 2015. Retrieved Dec 30th 2015 from https://www.focusboosterapp.com/","paperID":"None"},{"content":"Victor M. González and Gloria Mark. 2004. Constant, constant, multi-tasking craziness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'04), 113--120. http://dx.doi.org/10.1145/985692.985707","paperID":"None"},{"content":"Victoria Hollis et al. 2015. Change of Heart: Emotion Tracking to Promote Behavior Change. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'15), 2643--2652. http://dx.doi.org/10.1145/2702123.2702196","paperID":"None"},{"content":"Amanda Ie et al. 2012. Mindful multitasking. Computers in Human Behavior 28, 4: 1526--1532.","paperID":"None"},{"content":"Ellen Isaacs et al. 2013. Echoes from the past. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1071--1080. http://dx.doi.org/10.1145/2470654.2466137","paperID":"None"},{"content":"Jing Jin and Laura Dabbish. 2009. Self-interruption on the computer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1799--1808. http://dx.doi.org/10.1145/1518701.1518979","paperID":"None"},{"content":"Jennifer Lee et al. 2012. The impact of media multitasking on learning. Learning, Media and Technology 37, 1: 94--104.","paperID":"None"},{"content":"Gloria Mark et al. 2012. A pace not dictated by electrons. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 555--564. http://dx.doi.org/10.1145/2207676.2207754","paperID":"None"},{"content":"Gloria Mark et al. 2015. Stress and multitasking in everyday college life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 41--50. http://dx.doi.org/10.1145/2556288.2557361","paperID":"None"},{"content":"Eyal Ophir et al. 2009. Cognitive control in media multitaskers. PANAS 106, 35: 15583--15587.","paperID":"None"},{"content":"RescueTime. 2015. Retrieved Dec 30th 2015 from https://www.rescuetime.com/","paperID":"None"},{"content":"Victoria Rideout et al. 2010. Generation M2. Menlo Park, CA: The Henry J. Kaiser Family Foundation.","paperID":"None"},{"content":"Larry Rosen et al. 2011. An examination of the educational impact of text message-induced task switching in the classroom. Psicologia Educative 17, 2: 163--177.","paperID":"None"},{"content":"Larry Rosen, L., et al. 2013. Facebook and texting made me do it. Computers and Human Behavior 29, 3: 948--958.","paperID":"None"},{"content":"Kristin Sanderson et al. 2013. Multitasking: Do preference and ability interact to predict performance at work?. Journal of Occupational and Organizational Psychology 86, 2: 556--563.","paperID":"None"},{"content":"StayFocused. 2015. Retrieved Dec 30th 2015 from http://www.stayfocusedapp.me/","paperID":"None"},{"content":"Timestats. 2015. Retrieved. Dec 30th 2015 from https://chrome.google.com/webstore/detail/timestats","paperID":"None"},{"content":"Tracktime. 2015. Retrieved Dec 30th 2015 from https://www.fabbricabinaria.it/solutions/tracktime","paperID":"None"},{"content":"Monique Valcour. 2007. Work-based resources as moderators of the relationship between work hours and satisfaction with work-family balance. Journal of Applied Psychology 92, 6:1512--1523.","paperID":"None"},{"content":"Yiran Wang et al. 2015. Coming of age digitally. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 571--582. http://dx.doi.org/10.1145/2675133.2675271","paperID":"None"},{"content":"Zheng Wang and John Tchernev 2012. The myth of media multitasking. Journal of Communication, 62, 493--513.","paperID":"None"},{"content":"Eileen Wood et al. 2012. Examining the impact of off-task multi-tasking with technology on real-time classroom learning. Computers & Education, 58, 1: 365--374.","paperID":"None"}],"title":"'Don't Waste My Time': Use of Time Information Improves Focus","filename":"CHI16/p1729","authors":["Steve Whittaker","Vaiva Kalnikaite","Victoria Hollis","Andrew Guydish"],"conference":"CHI '16"}