{"paperId":2858488,"citation":[],"reference":[{"content":"A. Al-Awami, J. Beyer, H. Strobelt, N. Kasthuri, J. Lichtman, H. Pfister, and M. Hadwiger. 2014. NeuroLines: A Subway Map Metaphor for Visualizing Nanoscale Neuronal Connectivity. IEEE Transactions on Visualization and Computer Graphics 20, 12, 2369-2378. DOI: http://dx.doi.org/10.1109/TVCG.2014.2346312","paperID":"None"},{"content":"B. Alper, B. Bach, N. Henry Riche, T. Isenberg, and J.-D. Fekete. 2013. Weighted Graph Comparison Techniques for Brain Connectivity Analysis. In Proc. SIGCHI Conference on Human Factors in Computing Systems. 483-492. DOI: http://dx.doi.org/10.1145/2470654.2470724","paperID":"None"},{"content":"D. Archambault, H. C. Purchase, and B. Pinaud. 2011. Animation, small multiples, and the effect of mental map preservation in dynamic graphs. IEEE Transactions on Visualization and Computer Graphics 17, 4, 539-552. DOI: http://dx.doi.org/10.1109/TVCG.2010.78","paperID":"None"},{"content":"B. Bach, N. Henry-Riche, T. Dwyer, T. Madhyastha, J.-D. Fekete, and T. Grabowski. 2015. Small MultiPiles: Piling Time to Explore Temporal Patterns in Dynamic Networks. Computer Graphics Forum 34, 3, 31-40. DOI: http://dx.doi.org/10.1111/cgf.12615","paperID":"None"},{"content":"B. Bach, E. Pietriga, and J.-D. Fekete. 2014a. GraphDiaries: Animated transitions and temporal navigation for dynamic networks. IEEE Transactions on Visualization and Computer Graphics 20, 5, 740-754. DOI: http://dx.doi.org/10.1109/TVCG.2013.254","paperID":"None"},{"content":"B. Bach, E. Pietriga, and J.-D. Fekete. 2014b. Visualizing Dynamic Networks with Matrix Cubes. In Proc. SIGCHI Conference on Human Factors in Computing Systems. 877-886. DOI: http://dx.doi.org/10.1145/2556288.2557010","paperID":"None"},{"content":"F. Beck, M. Burch, S. Diehl, and D. Weiskopf. 2014. The state art in visualizing dynamic graphs. In EuroVis State-of-the-Art Reports (STARS).","paperID":"None"},{"content":"P. Bellavista, A. Corradi, M. Fanelli, and L. Foschini. 2012. A Survey of Context Data Distribution for Mobile Ubiquitous Systems. Comput. Surveys 44, 4, 45 pages. DOI: http://dx.doi.org/10.1145/2333112.2333119","paperID":"None"},{"content":"U. Brandes and B. Nick. 2011. Asymmetric relations in longitudinal social networks. IEEE Transactions on Visualization and Computer Graphics 17, 12, 2283-2290. DOI: http://dx.doi.org/10.1109/TVCG.2011.169","paperID":"None"},{"content":"M. Burch, C. Vehlow, F. Beck, S. Diehl, and D. Weiskopf. 2011. Parallel edge splatting for scalable dynamic graph visualization. IEEE Transactions on Visualization and Computer Graphics 17, 12, 2344-2353. DOI: http://dx.doi.org/10.1109/TVCG.2011.226","paperID":"None"},{"content":"L. Byron and M. Wattenberg. 2008. Stacked Graphs Geometry & Aesthetics. IEEE Transactions on Visualization and Computer Graphics 14, 6, 1245-1252. DOI: http://dx.doi.org/10.1109/TVCG.2008.166","paperID":"None"},{"content":"N. Elmqvist, T.-N. Do, H. Goodell, N. Henry, and J.-D. Fekete. 2008. ZAME: Interactive Large-Scale Graph Visualization. In Proc. IEEE Pacific Symposium on Visualization. 215-222. DOI: http://dx.doi.org/10.1109/PACIFICVIS.2008.4475479","paperID":"None"},{"content":"Enron Data. accessed in 2015. http://enrondata.org.","paperID":"None"},{"content":"M. Farrugia, N. Hurley, and A. Quigley. 2011. Exploring temporal ego networks using small multiples and tree-ring layouts. In Proc. International Conference on Advances in Computer-Human Interactions. 79-88. http://www.thinkmind.org/download.php?articleid=achi_2011_4_20_20100","paperID":"None"},{"content":"D. Fisher. 2005. Using egocentric networks to understand communication. IEEE Internet Computing 9, 5, 20-28. DOI: http://dx.doi.org/10.1109/MIC.2005.114","paperID":"None"},{"content":"M. Freire, C. Plaisant, B. Shneiderman, and J. Golbeck. 2010. ManyNets: an interface for multiple network analysis and visualization. In Proc. SIGCHI Conference on Human Factors in Computing Systems. 213-222. DOI: http://dx.doi.org/10.1145/1753326.1753358","paperID":"None"},{"content":"C. Friedrich and P. Eades. 2001. The Marey Graph Animation Tool Demo. In Graph Drawing, Joe Marks (Ed.). Vol. 1984. Springer, 396-406. DOI: http://dx.doi.org/10.1007/3--540--44541--2_37","paperID":"None"},{"content":"M. Ghoniem, J.-D. Fekete, and P. Castagliola. 2005. On the Readability of Graphs Using Node-link and Matrix-based Representations: A Controlled Experiment and Statistical Analysis. Information Visualization 4, 2, 114-135. DOI: http://dx.doi.org/10.1057/palgrave.ivs.9500092","paperID":"None"},{"content":"M. Greilich, M. Burch, and S. Diehl. 2009. Visualizing the evolution of compound digraphs with TimeArcTrees. Computer Graphics Forum 28, 3, 975-982. DOI: http://dx.doi.org/10.1111/j.1467--8659.2009.01451.x","paperID":"None"},{"content":"M. Grossetti. 2005. Where do social relations come from?: A study of personal networks in the Toulouse area of France. Social Networks 27, 4, 289-300. DOI: http://dx.doi.org/10.1016/j.socnet.2004.11.004","paperID":"None"},{"content":"S. Hadlak, H. Schulz, and H. Schumann. 2011. In Situ Exploration of Large Dynamic Networks. IEEE Transactions on Visualization and Computer Graphics 17, 12, 2334-2343. DOI: http://dx.doi.org/10.1109/TVCG.2011.213","paperID":"None"},{"content":"P. Isenberg, F. Heimerl, S. Koch, T. Isenberg, P. Xu, C. Stolper, M. Sedlmair, J. Chen, T. Moller, and J. Stasko. 2015. Visualization Publication Dataset. http://vispubdata.org.","paperID":"None"},{"content":"R. Keller, C. M. Eckert, and P. J. Clarkson. 2006. Matrices or Node-link Diagrams: Which Visual Representation is Better for Visualising Connectivity Models? Information Visualization 5, 1, 62-76. DOI: http://dx.doi.org/10.1057/palgrave.ivs.9500116","paperID":"None"},{"content":"N. W. Kim, S. K. Card, and J. Heer. 2010. Tracing Genealogical Data with TimeNets. In Proc. International Conference on Advanced Visual Interfaces. 241-248. DOI: http://dx.doi.org/10.1145/1842993.1843035","paperID":"None"},{"content":"B. Lee, C. Plaisant, C. S. Parr, J.-D. Fekete, and N. Henry. 2006. Task Taxonomy for Graph Visualization. In Proc. AVI workshop on BEyond time and errors (BELIEVE). 1-5. DOI: http://dx.doi.org/10.1145/1168149.1168168","paperID":"None"},{"content":"S. Liu, Y. Wu, E. Wei, M. Liu, and Y. Liu. 2013. StoryFlow: Tracking the Evolution of Stories. IEEE Transactions on Visualization and Computer Graphics 19, 12, 2436-2445. DOI: http://dx.doi.org/10.1109/TVCG.2013.196","paperID":"None"},{"content":"A. J. Omalley, S. Arbesman, D. M. Steiger, J. H. Fowler, and N. A. Christakis. 2012. Egocentric social network structure, health, and pro-social behaviors in a national panel study of Americans. PLoS One 7, 5, e36250. DOI: http://dx.doi.org/10.1371/journal.pone.0036250","paperID":"None"},{"content":"M. Papagelis, F. Bonchi, and A. Gionis. 2011. Suggesting Ghost Edges for a Smaller World. In Proc. International Conference on Information and Knowledge Management. 2305-2308. DOI: http://dx.doi.org/10.1145/2063576.2063952","paperID":"None"},{"content":"C. Prell. 2011. Social Network Analysis: History, Theory and Methodology. SAGE. https://us.sagepub.com/ en-us/nam/social-network-analysis/book231856","paperID":"None"},{"content":"F. Reitz. 2010. A Framework for an Ego-centered and Time-aware Visualization of Relations in Arbitrary Data Repositories. CoRR Computing Research Repository abs/1009.5183. http://arxiv.org/abs/1009.5183","paperID":"None"},{"content":"S. Rufiange and M. J. McGuffin. 2013. DiffAni: Visualizing dynamic graphs with a hybrid of difference maps and animation. IEEE Transactions on Visualization and Computer Graphics 19, 12, 2556-2565. DOI: http://dx.doi.org/10.1109/TVCG.2013.149","paperID":"None"},{"content":"Z. Sheny and K.-L. Maz. 2007. Path Visualization for Adjacency Matrices. In Proc. Joint Eurographics / IEEE VGTC Conference on Visualization. 83-90. DOI: http://dx.doi.org/10.2312/VisSym/EuroVis07/083-090","paperID":"None"},{"content":"L. Shi, C. Wang, and Z. Wen. 2011. Dynamic network visualization in 1.5 D. In Proc. IEEE Pacific Visualization Symposium. 179-186. DOI: http://dx.doi.org/10.1109/PACIFICVIS.2011.5742388","paperID":"None"},{"content":"Y. Tanahashi, C.-H. Hsueh, and K.-L. Ma. 2015. An Efficient Framework for Generating Storyline Visualizations from Streaming Data. IEEE Transactions on Visualization and Computer Graphics 21, 6, 730-742. DOI: http://dx.doi.org/10.1109/TVCG.2015.2392771","paperID":"None"},{"content":"S. van den Elzen, D. Holten, J. Blaas, and J. J. van Wijk. 2014. Dynamic Network Visualization with Extended Massive Sequence Views. IEEE Transactions on Visualization and Computer Graphics 20, 8, 1087-1099. DOI: http://dx.doi.org/10.1109/TVCG.2013.263","paperID":"None"},{"content":"M. Wattenberg. 2006. Visual Exploration of Multivariate Graphs. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). 811-819. DOI: http://dx.doi.org/10.1145/1124772.1124891","paperID":"None"},{"content":"M. Wood. 2005. Bootstrapped Confidence Intervals as an Approach to Statistical Inference. Organizational Research Methods 8, 4, 454-470. DOI: http://dx.doi.org/10.1177/1094428105280059","paperID":"None"},{"content":"J. wook Ahn, C. Plaisant, and B. Shneiderman. 2014. A Task Taxonomy for Network Evolution Analysis. IEEE Transactions on Visualization and Computer Graphics 20, 3, 365-376. DOI: http://dx.doi.org/10.1109/TVCG.2013.238","paperID":"None"},{"content":"Y. Wu, N. Pitipornvivat, J. Zhao, S. Yang, G. Huang, and H. Qu. 2016. egoSlider: Visual Analysis of Egocentric Network Evolution. IEEE Transactions on Visualization and Computer Graphics 22, 1, 260-269. DOI: http://dx.doi.org/10.1109/TVCG.2015.2468151","paperID":"None"},{"content":"J. Zhao, C. Collins, F. Chevalier, and R. Balakrishnan. 2013. Interactive Exploration of Implicit and Explicit Relations in Faceted Datasets. IEEE Transactions on Visualization and Computer Graphics 19, 12, 2080-2089. DOI: http://dx.doi.org/10.1109/TVCG.2013.167","paperID":"None"},{"content":"J. Zhao, Z. Liu, M. Dontcheva, A. Hertzmann, and A. Wilson. 2015. MatrixWave: Visual Comparison of Event Sequence Data. In Proc. SIGCHI Conference on Human Factors in Computing Systems. 259-268. DOI: http://dx.doi.org/10.1145/2702123.2702419","paperID":"None"}],"abstract":"The egocentric analysis of dynamic networks focuses on discovering the temporal patterns of a subnetwork around a specific central actor (i.e., an ego-network). These types of analyses are useful in many application domains, such as social science and business intelligence, providing insights about how the central actor interacts with the outside world. We present EgoLines, an interactive visualization to support the egocentric analysis of dynamic networks. Using a \"subway map\" metaphor, a user can trace an individual actor over the evolution of the ego-network. The design of EgoLines is grounded in a set of key analytical questions pertinent to egocentric analysis, derived from our interviews with three domain experts and general network analysis tasks. We demonstrate the effectiveness of EgoLines in egocentric analysis tasks through a controlled experiment with 18 participants and a use-case developed with a domain expert.","title":"Egocentric Analysis of Dynamic Networks with EgoLines","filename":"CHI16/p5003","authors":["Jian Zhao","Michael Glueck","Fanny Chevalier","Yanhong Wu","Azam Khan"],"conference":"CHI '16"}