{"paperId":2858348,"citation":[],"abstract":"Researchers who analyse smartphone usage logs often make the assumption that users who lock and unlock their phone for brief periods of time (e.g., less than a minute) are continuing the same \"session\" of interaction. However, this assumption is not empirically validated, and in fact different studies apply different arbitrary thresholds in their analysis. To validate this assumption, we conducted a field study where we collected user-labelled activity data through ESM and sensor logging. Our results indicate that for the majority of instances where users return to their smartphone, i.e., unlock their device, they in fact begin a new session as opposed to continuing a previous one. Our findings suggest that the commonly used approach of ignoring brief standby periods is not reliable, but optimisation is possible. We therefore propose various metrics related to usage sessions and evaluate various machine learning approaches to classify gaps in usage.","reference":[{"content":"Eytan Adar, Jaime Teevan and Susan T. Dumais. 2008. Large Scale Analysis of Web Revisitation Patterns. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1197--1206. http://dx.doi.org/10.1145/1357054.1357241","paperID":"None"},{"content":"Eirik Årsand, Miroslav Muzny, Meghan Bradway, Jan Muzik and Gunnar Hartvigsen. 2015. Performance of the First Combined Smartwatch and Smartphone Diabetes Diary Application Study. Journal of Diabetes Science and Technology 9, 3: 556--563. http://dx.doi.org/10.1177/1932296814567708","paperID":"None"},{"content":"Nikola Banovic, Christina Brant, Jennifer Mankoff and Anind Dey. 2014. ProactiveTasks: The Short of Mobile Device Use Sessions. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services, ACM, 243--252. http://dx.doi.org/10.1145/2628363.2628380","paperID":"None"},{"content":"Matthias Böhmer, Brent Hecht, Johannes Schöning, Antonio Krüger and Gernot Bauer. 2011. Falling Asleep with Angry Birds, Facebook and Kindle: A Large Scale Study on Mobile Application Usage. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services, ACM, 47--56. http://dx.doi.org/10.1145/2037373.2037383","paperID":"None"},{"content":"Juan P. Carrascal and Karen Church. 2015. An In-Situ Study of Mobile App & Mobile Search Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 27392748. http://dx.doi.org/10.1145/2702123.2702486","paperID":"None"},{"content":"Karen Church, Denzil Ferreira, Nikola Banovic and Kent Lyons. 2015. Understanding the Challenges of Mobile Phone Usage Data. In International Conference on Human-Computer Interaction with Mobile Devices and Services, 505 - 514. http://dx.doi.org/10.1145/2785830.2785891","paperID":"None"},{"content":"Andy Cockburn and Bruce McKenzi. 2001. What Do Web Users Do? An Empirical Analysis of Web Use. International Journal of Human-Computer Studies 54, 6: 903--922. http://dx.doi.org/10.1006/ijhc.2001.0459","paperID":"None"},{"content":"Sunny Consolvo and Miriam Walker. 2003. Using the Experience Sampling Method to Evaluate Ubicomp Applications. IEEE Pervasive Computing 2, 2: 24--31. http://dx.doi.org/10.1109/MPRV.2003.1203750","paperID":"None"},{"content":"Tilman Dingler and Martin Pielot. 2015. I'll Be There for You: Quantifying Attentiveness Towards Mobile Messaging. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, ACM, 1--5. http://dx.doi.org/10.1145/2785830.2785840","paperID":"None"},{"content":"Hossein Falaki, Ratul Mahajan, Srikanth Kandula, Dimitrios Lymberopoulos, Ramesh Govindan and Deborah Estrin. 2010. Diversity in Smartphone Usage. In Proceedings of the 8th International Conference on Mobile Systems, Applications, and Services, ACM, 179--194. http://dx.doi.org/10.1145/1814433.1814453","paperID":"None"},{"content":"Denzil Ferreira, Eija Ferreira, Jorge Goncalves, Vassilis Kostakos and Anind K. Dey. 2013. Revisiting HumanBattery Interaction with an Interactive Battery Interface. In International Joint Conference on Pervasive and Ubiquitous Computing , ACM, 563--572. http://dx.doi.org/10.1145/2493432.2493465","paperID":"None"},{"content":"Denzil Ferreira, Jorge Goncalves, Vassilis Kostakos, Louise Barkhuus and Anind K. Dey. 2014. Contextual Experience Sampling of Mobile Application MicroUsage. In International Conference on Human-Computer Interaction with Mobile Devices and Services, ACM, 91--100. http://dx.doi.org/10.1145/2628363.2628367","paperID":"None"},{"content":"Denzil Ferreira, Vassilis Kostakos and Anind K. Dey. 2015. AWARE: mobile context instrumentation framework. Frontiers in ICT 2, 6: 1--9. http://dx.doi.org/10.3389/fict.2015.00006","paperID":"None"},{"content":"Mark Hall, Eibe Frank, Geoffrey Holmes, Bernhard Pfahringer, Peter Reutemann and Ian I. H. Witten. 2009. The WEKA Data Mining Software: An Update. SIGKDD Explor. Newsl. 11, 1: 10--18. http://dx.doi.org/10.1145/1656274.1656278","paperID":"None"},{"content":"Joel M. Hektner, Jennifer A. Schmidt and Mihaly Csikszentmihalyi. 2007. Experience Sampling Method: Measuring the Quality of Everyday Life. Sage.","paperID":"None"},{"content":"Daniel Hintze, Rainhard D. Findling, Muhammad Muaaz, Sebastian Scholz and René Mayrhofer. 2014. Diversity in Locked and Unlocked Mobile Device Usage. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication, ACM, 379--384. http://dx.doi.org/10.1145/2638728.2641697","paperID":"None"},{"content":"Robert C. Holte. 1993. Very Simple Classification Rules Perform Well on Most Commonly Used Datasets. Machine Learning 11, 1: 63--90. http://dx.doi.org/10.1023/A:1022631118932","paperID":"None"},{"content":"Bernard J. Jansen, Amanda Spink, Chris Blakely and Sherry Koshman. 2007. Defining a session on Web search engines. Journal of the American Society for Information Science and Technology 58, 6: 862--871. http://dx.doi.org/10.1002/asi.20564","paperID":"None"},{"content":"Simon L. Jones, Denzil Ferreira, Simo Hosio, Jorge Goncalves and Vassilis Kostakos. 2015. Revisitation analysis of smartphone app use. In International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 1197--1208. http://dx.doi.org/10.1145/2750858.2807542","paperID":"None"},{"content":"Rosie Jones and Kristina L. Klinkner. 2008. Beyond the Session Timeout: Automatic Hierarchical Segmentation of Search Topics in Query Logs. In Proceedings of the 17th ACM Conference on Information and Knowledge Management, ACM, 699--708. http://dx.doi.org/10.1145/1458082.1458176","paperID":"None"},{"content":"Reed Larson and Mihaly Csikszentmihalyi. 1983. The Experience Sampling Method. In Flow and the Foundations of Positive Psychology (eds.). Wiley Jossey-Bass, San Francisco, 15, 41--56.","paperID":"None"},{"content":"Luis A. Leiva, Matthias Böhmer, Sven Gehring and Antonio Krüger. 2012. Back to the app: the costs of mobile application interruptions. In MobileHCI'12, 291--294. http://dx.doi.org/10.1145/2371574.2371617","paperID":"None"},{"content":"Terence R. Mitchell, Leigh Thompson, Erika Peterson and Randy Cronk. 1997. Temporal Adjustments in the Evaluation of Events: The \"Rosy View\". Journal of Experimental Social Psychology 33, 4: 421--448. http://dx.doi.org/10.1006/jesp.1997.1333","paperID":"None"},{"content":"Earl Oliver. 2010. The challenges in large-scale smartphone user studies. In Proceedings of the 2nd ACM International Workshop on Hot Topics in Planetscale Measurement - HotPlanet '10, Art. 5. http://dx.doi.org/10.1145/1834616.1834623","paperID":"None"},{"content":"Antti Oulasvirta, Tye Rattenbury, Lingyi Ma and Eeva Raita. 2012. Habits make smartphone use more pervasive. Personal and Ubiquitous Computing 16, 1: 105--114. http://dx.doi.org/10.1007/s00779-011-0412--2","paperID":"None"},{"content":"Martin Pielot, Karen Church and Rodrigo de Oliveira. 2014. An In-situ Study of Mobile Phone Notifications. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services, ACM, 233--242. http://dx.doi.org/10.1145/2628363.2628364","paperID":"None"},{"content":"Martin Pielot, Tilman Dingler, Jose S. Pedro and Nuria Oliver. 2015. When Attention is Not Scarce Detecting Boredom from Mobile Phone Usage. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 825--836. http://dx.doi.org/10.1145/2750858.2804252","paperID":"None"},{"content":"Philipp Pushnyakov and Gleb Gusev. 2014. User Profiles Based on Revisitation Times. In Proceedings of the Companion Publication of the 23rd International Conference on World Wide Web Companion, International World Wide Web Conferences Steering Committee, 359--360. http://dx.doi.org/10.1145/2567948.2577380","paperID":"None"},{"content":"Ahmad Rahmati and Lin Zhong. 2010. A Longitudinal Study of Non-Voice Mobile Phone Usage by Teens from an Underserved Urban Community. Computing Research Repository.","paperID":"None"},{"content":"Alireza Sahami Shirazi, Niels Henze, Tilman Dingler, Martin Pielot, Dominik Weber and Albrecht Schmidt. 2014. Large-scale Assessment of Mobile Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3055--3064. http://dx.doi.org/10.1145/2556288.2557189","paperID":"None"},{"content":"Tapio Soikkeli, Juuso Karikoski and Heikki Hämmäinen. 2011. Diversity and End User Context in Smartphone Usage Sessions. In International Conference on Next Generation Mobile Applications, Services and Technologies, IEEE, 7--12. http://dx.doi.org/10.1109/NGMAST.2011.12","paperID":"None"},{"content":"Chad Tossell, Philip Kortum, Ahmad Rahmati, Clayton Shepard and Lin Zhong. 2012. Characterizing Web Use on Smartphones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2769--2778. http://dx.doi.org/10.1145/2207676.2208676","paperID":"None"},{"content":"Niels van Berkel, Chu Luo, Denzil Ferreira, Jorge Goncalves and Vassilis Kostakos. 2015. The Curse of Quantified-Self: An Endless Quest for Answers. In Adjunct Proceedings of International Joint Conference on Pervasive and Ubiquitous Computing Adjunct, 973--978. http://dx.doi.org/10.1145/2800835.2800946","paperID":"None"},{"content":"Robert Xiao, Gierad Laput and Chris Harrison. 2014. Expanding the Input Expressivity of Smartwatches with Mechanical Pan, Twist, Tilt and Click. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 193--196. http://dx.doi.org/10.1145/2556288.2557017","paperID":"None"},{"content":"Tingxin Yan, David Chu, Deepak Ganesan, Aman Kansal and Jie Liu. 2012. Fast app launching for mobile devices using predictive user context. In MobiSys, 113--126. http://dx.doi.org/10.1145/2307636.2307648","paperID":"None"}],"title":"A Systematic Assessment of Smartphone Usage Gaps","filename":"CHI16/p4711","authors":["Niels van Berkel","Chu Luo","Theodoros Anagnostopoulos","Denzil Ferreira","Jorge Goncalves","Simo Hosio","Vassilis Kostakos"],"conference":"CHI '16"}