{"paperId":2858257,"citation":[],"abstract":"This work presents a method for 3D printing hair-like structures on both flat and curved surfaces. It allows a user to design and fabricate hair geometries that are smaller than 100 micron. We built a software platform to let users quickly define the hair angle, thickness, density, and height. The ability to fabricate customized hair-like structures not only expands the library of 3D-printable shapes, but also enables us to design passive actuators and swipe sensors. We also present several applications that show how the 3D-printed hair can be used for designing everyday interactive objects.","reference":[{"content":"A DeSimone and A Tatone, \"Crawling motility through the analysis of model locomotors: two case studies.,\" Eur. Phys. J. E. Soft Matter, vol. 35, no. 9, p. 85, Sep. 2012.","paperID":"None"},{"content":"A. Filippov and S. N. Gorb, \"Frictional-anisotropybased systems in biology: structural diversity and numerical model.,\" Sci. Rep., vol. 3, p. 1240, Jan. 2013.","paperID":"None"},{"content":"A. Selle, M. Lentine, and R. Fedkiw. 2008. A mass spring model for hair simulation. ACM Trans. Graph. 27, 3, Article 64 (August 2008),","paperID":"None"},{"content":"C. Harrison, R. Xiao, and S. Hudson. 2012. Acoustic barcodes: passive, durable and inexpensive notched identification tags. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, NY, NY, USA, 563--568.","paperID":"None"},{"content":"C. Harrison and S. Hudson. 2008. Scratch input: creating large, inexpensive, unpowered and mobile finger input surfaces. In Proceedings of the 21st annual ACM symposium on User interface software and technology (UIST '08). ACM, NY, NY, USA, 205--208.","paperID":"None"},{"content":"D. K. Rosner and K. Ryokai. 2009. Reflections on craft: probing the creative process of everyday knitters. In Proceedings of the seventh ACM conference on Creativity and cognition (C&C '09). ACM, NY, NY, USA.","paperID":"None"},{"content":"D. Nowacka, K. Ladha, N. Y. Hammerla, D. Jackson, C. Ladha, E. Rukzio, and P. Olivier. 2013. Touchbugs: actuated tangibles on multi-touch tables. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 759--762.","paperID":"None"},{"content":"G. Laput, X. Chen, and C. Harrison. 2015. 3D Printed Hair: Fused Deposition Modeling of Soft Strands, Fibers, and Bristles. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 593--597.","paperID":"None"},{"content":"G. Pangaro, D. Maynes-Aminzade, and H. Ishii. 2002. The actuated workbench: computer-controlled actuation in tabletop tangible interfaces. In Proceedings of the 15th annual ACM symposium on User interface software and technology (UIST '02). ACM, NY, NY, USA, 181--190.","paperID":"None"},{"content":"H. Perner-Wilson and L. Buechley. 2010. Making textile sensors from scratch. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction (TEI '10). ACM, NY, NY, USA, 349--352.","paperID":"None"},{"content":"H. Devaraj, J. Travas-Sejdic, R. Sharma, N. Aydemir, D. Williams, E. Haemmerle, Bio-inspired flow sensor from printed PEDOT:PSS micro-hairs 2015 Bioinspir. Biomim. 10 016017","paperID":"None"},{"content":"H. Ishii, D. Lakatos, L. Bonanni, and JB. Labrune. 2012. Radical atoms: beyond tangible bits, toward transformable materials. interactions 19, 1 (January 2012), 38--51.","paperID":"None"},{"content":"I. Poupyrev, C. Harrison, and M. Sato. 2012. Touché: touch and gesture sensing for the real world. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, NY, NY, USA, 536--536.","paperID":"None"},{"content":"J. Ou, L. Yao, D. Tauber, J. Steimle, R. Niiyama, and H. Ishii. 2014. jamSheets: thin interfaces with tunable stiffness enabled by layer jamming. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). ACM, NY, NY, USA, 65--72.","paperID":"None"},{"content":"J. Tautz and H. Markl, Caterpillars Detect Flying Wasps by Hairs Sensitive to Airborne Vibration, Behavioral Ecology and Sociobiology. Vol. 4, No. 1 (1978), pp. 101--110, Springer","paperID":"None"},{"content":"K. Willis, E. Brockmeyer, S. Hudson, and I. Poupyrev. 2012. Printed optics: 3D printing of embedded optical elements for interactive devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, NY, NY, USA, 589--598.","paperID":"None"},{"content":"L. Amato, S. S. Keller, A. Heiskanen, M. Dimaki, J. Emnéus, A. Boisen, M. Tenje, Fabrication of highaspect ratio SU-8 micropillar arrays, Microelectronic Engineering, Volume 98, October 2012, Pages 483487, ISSN 0167--9317,","paperID":"None"},{"content":"L. Yao, R. Niiyama, J. Ou, S. Follmer, C. D. Silva, and H. Ishii. 2013. PneUI: pneumatically actuated soft composite materials for shape changing interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, NY, NY, USA, 13--22.","paperID":"None"},{"content":"M. Weiss, F. Schwarz, S. Jakubowski, and J. Borchers. 2010. Madgets: actuating widgets on interactive tabletops. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10). ACM, NY, NY, USA, 293--302.","paperID":"None"},{"content":"N. Hopkinson, R.J.M. Hague, P.M. Dickens. Rapid Manufacturing, An Industrial Revolution For The Digital Age. Chichester, Wiley Publication, 2006, pp. 43 -- 45.","paperID":"None"},{"content":"J. Paek, and J. Kim Microsphere-assisted fabrication of high aspect-ratio elastomeric micropillars and waveguides. Nature Communication, 5. 2014.","paperID":"None"},{"content":"R. Slyper, I. Poupyrev, and J. Hodgins. 2010. Sensing through structure: designing soft silicone sensors. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction (TEI '11). ACM, NY, NY, USA, 213--220.","paperID":"None"},{"content":"S. Hudson. 2014. Printing teddy bears: a technique for 3D printing of soft interactive objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 459--468.","paperID":"None"},{"content":"S. Follmer, D. Leithinger, A. Olwal, A. Hogge, and H. Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, NY, NY, USA, 417--426.","paperID":"None"},{"content":"S. Gueron, K. Levit-Gurevich, N. Liron, and J. J. Blum, \"Cilia internal mechanism and metachronal coordination as the result of hydrodynamical coupling,\" Appl. Math., vol. 94, no. June, pp. 6001- 6006, 1997.","paperID":"None"}],"title":"Cilllia: 3D Printed Micro-Pillar Structures for Surface Texture, Actuation and Sensing","filename":"CHI16/p5753","authors":["Jifei Ou","Gershon Dublon","Chin-Yi Cheng","Felix Heibeck","Karl Willis","Hiroshi Ishii"],"conference":"CHI '16"}