{"paperId":2858260,"citation":[],"abstract":"With much of the population now online, the field of HCI faces new and pressing issues of how to help people sustain online activity throughout their lives, including through periods of disability. The onset of cognitive impairment later in life affects whether and how individuals are able to stay connected online and manage their digital information. While caregivers play a critical role in the offline lives of adults with cognitive impairments, less is known about how they support and enable online interaction. Using a constructivist grounded theory approach, data from focus groups with caregivers of adults with cognitive impairments reveal four forms of cooperative work caregivers perform in the context of supporting online activity. We find that staying active online is a way of empowering and engaging adults with cognitive impairments, yet this introduces new forms of risk, surrogacy, and cooperative technology use to the already demanding work of caregiving.","reference":[{"content":"Alzheimer's Association and National Alliance for Caregiving. 2004. Families care?: Alzheimer's caregiving in the USA. Retrieved September 1, 2015 from https://www.alz.org/national/documents/report_familie scare.pdf","paperID":"None"},{"content":"Tawfiq Ammari, Priya Kumar, Cliff Lampe, and Sarita Schoenebeck. 2015. Managing Children's Online Identities: How Parents Decide What to Disclose About Their Children Online. Proc. of CHI '15, ACM, 1895-1904. http://doi.org/10.1145/2702123.2702325","paperID":"None"},{"content":"Rachel Batchelor, Ania Bobrowicz, Robin Mackenzie, and Alisoun Milne. 2012. Challenges of ethical and legal responsibilities when technologies' uses and users change: social networking sites, decision-making capacity and dementia. Ethics and Information Technology 14, 2: 99-108. http://doi.org/10.1007/s10676-012--9286-x","paperID":"None"},{"content":"Jed R. Brubaker, Lynn S. Dombrowski, Anita M. Gilbert, Nafiri Kusumakaulika, and Gillian R. Hayes. 2014. Stewarding a legacy: responsibilities and relationships in the management of post-mortem data. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM Press, 4157- 4166. http://doi.org/10.1145/2556288.2557059","paperID":"None"},{"content":"Jed R. Brubaker, Gillian R. Hayes, and Paul Dourish. 2013. Beyond the Grave: Facebook as a Site for the Expansion of Death and Mourning. The Information Society 29, 3: 152-163. http://doi.org/10.1080/01972243.2013.777300","paperID":"None"},{"content":"Jed R. Brubaker and Gillian R. Hayes. 2011. \"We will never forget you [ online ]\": An Empirical Investigation of Post-mortem MySpace Comments. Proceedings of the ACM 2011 conference on Computer supported cooperative work, 123-132. http://doi.org/10.1145/1958824.1958843","paperID":"None"},{"content":"Kathy Charmaz. 2006. Constructing grounded theory: a practical guide through qualitative analysis. SAGE Publications. http://doi.org/10.1016/j.lisr.2007.11.003","paperID":"None"},{"content":"Kathy Charmaz. 2013. Constructionism and the Grounded Theory Method. In Handbook of Constructionist Research, James A. Holstein and Jaber F. Gubrium (eds.). Guilford Publications, 832.","paperID":"None"},{"content":"Yunan Chen, Victor Ngo, and Sun Young Park. 2013. Caring for caregivers: Designing for integrality. Proceedings of the 2013 conference on Computer supported cooperative work, 91-102. http://doi.org/10.1145/2441776.2441789","paperID":"None"},{"content":"Teresa Chiu and Michael Massimi. 2006. A digital support device designed to help family caregivers coordinate, communicate and plan the care of people with brain injury. AMIA Annu Symp Proc: 884.","paperID":"None"},{"content":"Elizabeth C. Clipp, Michael J. Moore, and Linda K. George. 1996. The content and properties of the Caregiver Activities Time Survey (CATS): An outcome measure for use in clinical trial research on Alzheimer's disease. American Journal of Alzheimer's Disease and Other Dementias 11, 6: 3-9. http://doi.org/10.1177/153331759601100602","paperID":"None"},{"content":"Raymundo Cornejo, Daniel Hernández, Jesús Favela, Mónica Tentori, and Sergio Ochoa. 2012. Persuading older adults to socialize and exercise through ambient games. 6th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth), 2012, 215-218.","paperID":"None"},{"content":"Shelia R. Cotten, George Ford, Sherry Ford, and Timothy M. Hale. 2012. Internet use and depression among older adults. Computers in Human Behavior 28, 2: 496-499. http://doi.org/10.1016/j.chb.2011.10.021","paperID":"None"},{"content":"Kenneth E. Covinsky, Robert Newcomer, Patrick Fox, et al. 2003. Patient and caregiver characteristics associated with depression in caregivers of patients with dementia. Journal of General Internal Medicine 18, 12: 1006-1014. http://doi.org/10.1111/j.15251497.2003.30103.x","paperID":"None"},{"content":"Serge Egelman, A.J. Bernheim Brush, and Kori M. Inkpen. 2008. Family accounts: a new paradigm for user accounts within the home environment. Proceedings of the 2008 ACM conference on Computer supported cooperative work, ACM Press, 669-678. http://doi.org/10.1145/1460563.1460666","paperID":"None"},{"content":"Elizabeth H. Ehleringer and Si Jung Kim. 2013. The wearable lullaby: improving sleep quality of caregivers of dementia patients. CHI '13 Extended Abstracts on Human Factors in Computing Systems, ACM Press, 409-414. http://doi.org/10.1145/2468356.2468429","paperID":"None"},{"content":"Family Caregiver Alliance. 2012. Selected Caregiver Statistics. Retrieved September 10, 2015 from https://caregiver.org/selected-caregiver-statistics","paperID":"None"},{"content":"Robert Douglas Ferguson, Michael Massimi, Emily Anne Crist, and Karyn Anne Moffatt. 2014. Craving, Creating, and Constructing Comfort: Insights and Opportunities for Technology in Hospice. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1479- 1490. http://doi.org/10.1145/2531602.2531631","paperID":"None"},{"content":"Georgetown University. 2005. How Do Family Caregivers Fare? A Closer Look at Their Experiences. Washington, D.C. Retrieved September 1, 2015 from http://hpi.georgetown.edu/agingsociety/pubhtml/caregi ver3/caregiver3.html","paperID":"None"},{"content":"Mary Jo Gibson and Ari Houser. 2007. Valuing the invaluable: a new look at the economic value of family caregiving. Issue Brief (Public Policy Institute (American Association of Retired Persons)), IB82: 1- 12.","paperID":"None"},{"content":"Muriel R Gillick. Medical decision-making for the unbefriended nursing home resident. Journal of ethics, law, and aging 1, 2: 87-92.","paperID":"None"},{"content":"Jacqueline J. Hinckley, Amy Hasselkus, and Ellayne Ganzfried. 2013. What People Living With Aphasia Think About the Availability of Aphasia Resources. American Journal of Speech-Language Pathology 22, 2: S310. http://doi.org/10.1044/1058-0360(2013/120090)","paperID":"None"},{"content":"Kristine Holbø, Silje Bøthun, and Yngve Dahl. 2013. Safe Walking Technology for People with Dementia: What Do They Want? Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility, 1-8. http://doi.org/10.1145/2513383.2513434","paperID":"None"},{"content":"Yoram M Kalman, Kathleen Geraghty, Cynthia K Thompson, and Darren Gergle. 2012. Detecting Linguistic HCI Markers in an Online Aphasia Support Group. Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility, ACM, 65-70. http://doi.org/10.1145/2384916.2384928","paperID":"None"},{"content":"Janice K Kiecolt-Glaser, Kristopher J Preacher, Robert C MacCallum, Cathie Atkinson, William B Malarkey, and Ronald Glaser. 2003. Chronic stress and agerelated increases in the proinflammatory cytokine IL-6. Proceedings of the National Academy of Sciences of the USA of America 100, 15: 9090-9095. http://doi.org/10.1073/pnas.1531903100","paperID":"None"},{"content":"Yoshinori Kobayashi, Yuki Kinpara, Erii Takano, Yoshinori Kuno, Keiichi Yamazaki, and Akiko Yamazaki. 2011. A wheelchair which can automatically move alongside a caregiver. Proceedings of the 6th international conference on Human-robot interaction - HRI '11, ACM Press, 407-408. http://doi.org/10.1145/1957656.1957805","paperID":"None"},{"content":"Richard A. Krueger. 1994. Focus groups: A practical guide for applied research. SAGE Publications.","paperID":"None"},{"content":"Airi Lampinen, Vilma Lehtinen, Asko Lehmuskallio, and Sakari Tamminen. 2011. We're in it together: interpersonal management of disclosure in social network services. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM Press, 3217-3226. http://doi.org/10.1145/1978942.1979420","paperID":"None"},{"content":"Steve Lauriks, Annika Reinersmann, Henriëtte Gerald Van der Roest, et al. 2007. Review of ICT-based services for identified unmet needs in people with dementia. Ageing Research Reviews 6, 3: 223-246. http://doi.org/10.1016/j.arr.2007.07.002","paperID":"None"},{"content":"Leslie S. Liu, Sen H. Hirano, Monica Tentori, et al. 2011. Improving communication and social support for caregivers of high-risk infants through mobile technologies. Proceedings of the ACM 2011 conference on Computer supported cooperative work: 475-484. http://doi.org/10.1145/1958824.1958897","paperID":"None"},{"content":"Michael Massimi and Ronald M. Baecker. 2010. A Death in the Family: Opportunities for Designing Technologies for the Bereaved. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1821-1830. http://doi.org/10.1145/1753326.1753600","paperID":"None"},{"content":"Rhonda J. V. Montgomery, Judith G. Gonyea, and Nancy R. Hooyman. 1985. Caregiving and the experience of subjective and objective burden. Family Relations 34, 1: 19-26.","paperID":"None"},{"content":"National Alliance for Caregiving and American Association of Retired Persons. 2009. Caregiving in the U.S. 2009. assets.aarp.org. Retrieved from http://assets.aarp.org/rgcenter/il/caregiving_09_fr.pdf","paperID":"None"},{"content":"n papers2://publication/uuid/F95CD001-E1F8--4FDB87B3--41477D77C8B5","paperID":"None"},{"content":"René F. Navarro and Jesús Favela. 2011. Usability assessment of a pervasive system to assist caregivers in dealing with repetitive behaviors of patients with dementia. Proceedings of the 4th International Conference on PErvasive Technologies Related to Assistive Environments, ACM Press, 1-8. http://doi.org/10.1145/2141622.2141656","paperID":"None"},{"content":"Jarred Pennington and Tess Knight. 2008. Staying Connected: The Lived Experiences of Volunteers and Older Adults. Ageing International 32, 4: 298-311. http://doi.org/10.1007/s12126-008--9020--5","paperID":"None"},{"content":"Sandra Petronio and Irwin Altman. 2002. Boundaries of Privacy: Dialectics of Disclosure. SUNY Press.","paperID":"None"},{"content":"D K Publishing. 2013. Caregiver's Handbook. Penguin.","paperID":"None"},{"content":"Robin Pugsley. 1988. Guidelines on the Termination of Life Sustaining Treatment and Care of the Dying. Journal of Medical Ethics 14, 4: 212. Retrieved from http://www.ncbi.nlm.nih.gov/pmc/articles/PMC137558 7/","paperID":"None"},{"content":"Richard Schulz and Scott R. Beach. 1999. Caregiving as a Risk Factor for Mortality. JAMA 282, 23: 2215. http://doi.org/10.1001/jama.282.23.2215","paperID":"None"},{"content":"Richard Schulz, Alison T. O'Brien, Jamila Bookwala, and Kathy Fleissner. 1995. Psychiatric and Physical Morbidity Effects of Dementia Caregiving: Prevalence, Correlates, and Causes. The Gerontologist 35, 6: 771--791. http://doi.org/10.1093/geront/35.6.771","paperID":"None"},{"content":"Masahiro Shiomi, Takamasa Iio, Koji Kamei, Chandraprakash Sharma, and Norihiro Hagita. 2014. User-friendly autonomous wheelchair for elderly care using ubiquitous network robot platform. Proceedings of the second international conference on Humanagent interaction, ACM Press, 17-22. http://doi.org/10.1145/2658861.2658873","paperID":"None"},{"content":"Katie A. Siek, Danish U. Khan, Stephen E. Ross, Leah M. Haverhals, Jane Meyers, and Steven R. Cali. 2011. Designing a personal health application for older adults to manage medications: A comprehensive case study. Journal of Medical Systems, 1099-1121. http://doi.org/10.1007/s10916-011--9719--9","paperID":"None"},{"content":"Meredith M. Skeels, Kenton T. Unruh, Christopher Powell, and Wanda Pratt. 2010. Catalyzing social support for breast cancer patients. Proceedings of the 28th international conference on Human factors in computing systems - CHI '10, ACM Press, 173. http://doi.org/10.1145/1753326.1753353","paperID":"None"},{"content":"Aaron Smith. 2014. Older Adults and Technology Use: Adoption is increasing but many seniors remain isolated from digital life. Pew Research Center.","paperID":"None"},{"content":"Anselm L. Strauss. 1985. Social Organization of Medical Work. University of Chicago Press.","paperID":"None"},{"content":"Sharon Tennstedt. 1999. Family Caregiving in an Aging Society. Aging Symposium Longevity in the New American Century: 14-25.","paperID":"None"},{"content":"Lin Wan, Claudia Müller, Volker Wulf, and David William Randall. 2014. Addressing the subtleties in dementia care: pre-study & evaluation of a GPS monitoring system. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM Press, 3987-3996. http://doi.org/10.1145/2556288.2557307","paperID":"None"}],"title":"Technological Caregiving: Supporting Online Activity for Adults with Cognitive Impairments","filename":"CHI16/p5311","authors":["Anne Marie Piper","Raymundo Cornejo","Lisa Hurwitz","Caitlin Unumb"],"conference":"CHI '16"}