{"paperId":2858568,"citation":[],"reference":[{"content":"Rachel F. Adler and Raquel Bendunan-Fich. 2013. Self-Interruptions in Discretionary Multitasking. Computers in Human Behavior 29, 4 (2013), 1441--1449. DOI:http://dx.doi.org/10.1016/j.chb.2013.01.040","paperID":"None"},{"content":"Morgan G. Ames. 2013. Managing Mobile Multitasking: The Culture of iPhones on Stanford Campus. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, New York, NY, USA, 1487--1498. DOI: http://dx.doi.org/10.1145/2441776.2441945","paperID":"None"},{"content":"Omotayo Banjo, Yifeng Hu, and Shyam Sundar. 2006. Cell Phone Usage and Social Interaction with Proximate Others:Ringing in a Theoretical Model. In ICA.","paperID":"None"},{"content":"Eric P.S. Baumer, Phil Adams, Vera D. Khovanskaya, Tony C. Liao, Madeline E. Smith, Victoria Schwanda Sosik, and Kaiton Williams. 2013. Limiting, Leaving, and (Re)Lapsing: An Exploration of Facebook Non-use Practices and Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3257--3266. DOI: http://dx.doi.org/10.1145/2470654.2466446","paperID":"None"},{"content":"Eric P.S. Baumer, Morgan G. Ames, Jed R. Brubaker, Jenna Burrell, and Paul Dourish. 2014. Refusing, Limiting, Departing: Why We Should Study Technology Non-use. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 65--68. DOI: http://dx.doi.org/10.1145/2559206.2559224","paperID":"None"},{"content":"Raquel Benbunan-Fich, Rachel F. Adler, and Tamilla Mavlanova. 2011. Measuring Multitasking Behavior with Activity-based Metrics. ACM Trans. Comput.-Hum. Interact. 18, 2, Article 7 (July 2011), 22 pages. DOI: http://dx.doi.org/10.1145/1970378.1970381","paperID":"None"},{"content":"Matthias Böhmer, Brent Hecht, Johannes Schöning, Antonio Krüger, and Gernot Bauer. 2011. Falling Asleep with Angry Birds, Facebook and Kindle: A Large Scale Study on Mobile Application Usage. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 47--56. DOI:http://dx.doi.org/10.1145/2037373.2037383","paperID":"None"},{"content":"Sheldon Cohen. 1980. Aftereffects of Stress on Human Performance and Social Behavior: A Review of Research and Theory. Psychological Bulletin 88, 1 (1980), 82--108.","paperID":"None"},{"content":"Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A Diary Study of Task Switching and Interruptions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 175--182. DOI: http://dx.doi.org/10.1145/985692.985715","paperID":"None"},{"content":"Laura Dabbish, Gloria Mark, and Víctor M. González. 2011. Why Do I Keep Interrupting Myself?: Environment, Habit and Self-interruption. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 3127--3130. DOI: http://dx.doi.org/10.1145/1978942.1979405","paperID":"None"},{"content":"Kenneth J. Gergen. 2002. Perpetual Contact. Cambridge University Press, New York, NY, USA, Chapter The Challenge of Absent Presence, 227--241. http://dl.acm.org/citation.cfm?id=644547.644562","paperID":"None"},{"content":"Hans Geser. 2004. Towards a Sociology of the Mobile Phone. http://socio.ch/mobile/t_geser1.pdf, Sociology in Switzerland: Sociology of the Mobile Phone (2004), 1--47.","paperID":"None"},{"content":"Hans Geser. 2006. Is the cell phone undermining the social order?: Understanding mobile technology from a sociological perspective. Knowledge, Technology & Policy 19, 1 (2006), 8--18.","paperID":"None"},{"content":"Erving Goffman. 1963. Behavior in Public Places: Notes on the Social Organization of Gatherings. Free Press of Glencoe.","paperID":"None"},{"content":"Joseph F. Hair Jr., William C. Black, Barry J. Badin, and Rolph E. Anderson. 2009. Multivariate Data Analysis (7 ed.). Prentice Hall.","paperID":"None"},{"content":"Ellie Harmon and Melissa Mazmanian. 2013. Stories of the Smartphone in Everyday Discourse: Conflict, Tension & Instability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1051--1060. DOI: http://dx.doi.org/10.1145/2470654.2466134","paperID":"None"},{"content":"Ellen J. Helsper and Bianca C. Reisdorf. 2013. A Quantitative Examination of Explanations for Reasons for Internet Nonuse. Cyberpsychology, Behavior, and Social Networking 16, 2 (2013), 94--99.","paperID":"None"},{"content":"Geert Hofstede. 1984. The Cultural Relativity of the Quality of Life Concept. The Academy of Management Review 9, 3 (1984), 389--398.","paperID":"None"},{"content":"Lee Humphreys. 2005. Cellphones in Public: Social Interactions in a Wireless Era. New Media and Society 7 (2005), 810--833. Issue 6.","paperID":"None"},{"content":"Mary H. Immordino-Yanga, Andrea McColla, Hanna Damasioa, and Antonio Damasioa. 2009. Neural Correlates of Admiration and Compassion. National Academy of Sciences of the USA of America 106 (2009), 1--6. Issue 19.","paperID":"None"},{"content":"Shamsi T. Iqbal and Eric Horvitz. 2007. Disruption and Recovery of Computing Tasks: Field Study, Analysis, and Directions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 677--686. DOI: http://dx.doi.org/10.1145/1240624.1240730","paperID":"None"},{"content":"Jing Jin and Laura A. Dabbish. 2009. Self-interruption on the Computer: A Typology of Discretionary Task Interleaving. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1799--1808. DOI: http://dx.doi.org/10.1145/1518701.1518979","paperID":"None"},{"content":"Adam N. Joinson. 2008. Looking at, Looking Up or Keeping Up with People?: Motives and Use of Facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1027--1036. DOI: http://dx.doi.org/10.1145/1357054.1357213","paperID":"None"},{"content":"Dongil Kim, Yunhee Lee, Juyoung Lee, JeeEun K. Nam, and Yeoju Chung. 2014. Development of Korean Smartphone Addiction Proneness Scale for Youth. PLoS ONE 9, 5 (2014).","paperID":"None"},{"content":"Minsam Ko, Seungwoo Choi, Subin Yang, Joonwon Lee, and Uichin Lee. 2015a. FamiLync: Facilitating Participatory Parental Mediation of Adolescents' Smartphone Use. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 867--878. DOI: http://dx.doi.org/10.1145/2750858.2804283","paperID":"None"},{"content":"Minsam Ko, Subin Yang, Joonwon Lee, Christian Heizmann, Jinyoung Jeong, Uichin Lee, Daehee Shin, Koji Yatani, Junehwa Song, and Kyong-Mee Chung. 2015b. NUGU: A Group-based Intervention App for Improving Self-Regulation of Limiting Smartphone Use. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '15). ACM, New York, NY, USA, 1235--1245. DOI:http://dx.doi.org/10.1145/2675133.2675244","paperID":"None"},{"content":"John Krumm and Ken Hinckley. 2004. Proceedings of the Sixth International Conference on Ubiquitous Computing. In UbiComp '04.","paperID":"None"},{"content":"Michael Kutner, Christopher Nachtsheim, John Neter, and William Li. 1989. Applied Linear Regression Models. Irwin, Homewood.","paperID":"None"},{"content":"Kara A. Latorella. 1996. Investigating Interruptions: An Example from the Flightdeck. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 40. 249--253.","paperID":"None"},{"content":"Heyoung Lee, Heejune Ahn, Samwook Choi, and Wanbok Choi. 2014a. The SAMS: Smartphone Addiction Management System and Verification. Journal of Medical Systems 38, 1 (2014).","paperID":"None"},{"content":"Uichin Lee, Joonwon Lee, Minsam Ko, Changhun Lee, Yuhwan Kim, Subin Yang, Koji Yatani, Gahgene Gweon, Kyong-Mee Chung, and Junehwa Song. 2014b. Hooked on Smartphones: An Exploratory Study on Smartphone Overuse Among College Students. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2327--2336. DOI: http://dx.doi.org/10.1145/2556288.2557366","paperID":"None"},{"content":"Uichin Lee, Subin Yang, Minsam Ko, and Joonwon Lee. 2014c. Supporting Temporary Non-Use of Smartphones. In Refusing, Limitng, Departing: Why We Should Study Technology Non-Use (CHI '14 Workshop).","paperID":"None"},{"content":"Luis Leiva, Matthias Böhmer, Sven Gehring, and Antonio Krüger. 2012. Back to the App: The Costs of Mobile Application Interruptions. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 291--294. DOI:http://dx.doi.org/10.1145/2371574.2371617","paperID":"None"},{"content":"Laura E. Levine, Bradley M. Waite, and Laura L. Bowman. 2012. Mobile Media Use, Multitasking and Distractibility. International Journal of Cyber Behavior, Psychology and Learning 2, 3 (2012), 15--29.","paperID":"None"},{"content":"Brian Lickel, David L. Hamilton, Grazyna Wieczorkowska, Amy Lewis, Steven J. Sherman, and A. Neville Uhles. 2000. Varieties of Groups and the Perception of Group Entitativity. Journal of Personality and Social Psychology 78, 2 (2000), 223--246.","paperID":"None"},{"content":"Markus Löchtefeld, Matthias Böhmer, and Lyubomir Ganev. 2013. AppDetox: Helping Users with Mobile App Addiction. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia (MUM '13). ACM, New York, NY, USA, Article 43, 2 pages. DOI: http://dx.doi.org/10.1145/2541831.2541870","paperID":"None"},{"content":"Arlene R. Lundquist, Emily J. Lefebvre, and Sara J. Garramone. 2014. Smartphones: Fulfilling the Need for Immediacy in Everyday Life, but at What Cost?. International Journal of Humanities and Social Science 4, 2 (2014).","paperID":"None"},{"content":"Gloria Mark, Victor M. Gonzalez, and Justin Harris. 2005. No Task Left Behind?: Examining the Nature of Fragmented Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 321--330. DOI: http://dx.doi.org/10.1145/1054972.1055017","paperID":"None"},{"content":"Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The Cost of Interrupted Work: More Speed and Stress. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 107--110. DOI: http://dx.doi.org/10.1145/1357054.1357072","paperID":"None"},{"content":"Gloria Mark, Shamsi Iqbal, Mary Czerwinski, and Paul Johns. 2015. Focused, Aroused, but So Distractible: Temporal Perspectives on Multitasking and Communications. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '15). ACM, New York, NY, USA, 903--916. DOI: http://dx.doi.org/10.1145/2675133.2675221","paperID":"None"},{"content":"Gloria Mark, Yiran Wang, and Melissa Niiya. 2014. Stress and Multitasking in Everyday College Life: An Empirical Study of Online Activity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 41--50. DOI: http://dx.doi.org/10.1145/2556288.2557361","paperID":"None"},{"content":"Abhinav Mehrotra, Mirco Musolesi, Robert Hendley, and Veljko Pejovic. 2015. Designing Content-driven Intelligent Notification Mechanisms for Mobile Applications. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 813--824. DOI: http://dx.doi.org/10.1145/2750858.2807544","paperID":"None"},{"content":"Shalini Misra, Lulu Cheng, Jamie Genevie, and Miao Yuan. 2014. The iPhone Effect: The Quality of In-Person Social Interactions in the Presence of Mobiel Devices. Environment and Behavior (2014), 1--24.","paperID":"None"},{"content":"Shalini Misra and Jamie Genevie. 2013. The Experience of Place: How Digital Technologies are Restructuring Public Places. In Environmental Design Research Association.","paperID":"None"},{"content":"New York Times 2013. Step Away from the Phone. (2013). http://www.nytimes.com/2013/09/22/fashion/step-away-from-the-phone.html?_r=0.","paperID":"None"},{"content":"Brid O'Conaill and David Frohlich. 1995. Timespace in the Workplace: Dealing with Interruptions. In Conference Companion on Human Factors in Computing Systems (CHI '95). ACM, New York, NY, USA, 262--263. DOI: http://dx.doi.org/10.1145/223355.223665","paperID":"None"},{"content":"Antti Oulasvirta, Tye Rattenbury, Lingyi Ma, and Eeva Raita. 2012. Habits Make Smartphone Use More Pervasive. Personal Ubiquitous Comput. 16, 1 (Jan. 2012), 105--114. DOI: http://dx.doi.org/10.1007/s00779-011-0412--2","paperID":"None"},{"content":"Antti Oulasvirta, Sakari Tamminen, Virpi Roto, and Jaana Kuorelahti. 2005. Interaction in 4-second Bursts: The Fragmented Nature of Attentional Resources in Mobile HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 919--928. DOI: http://dx.doi.org/10.1145/1054972.1055101","paperID":"None"},{"content":"Andrew K. Przybylski and Netta Weinstein. 2013. Can You Connect with Me Now? How the Presence of Mobile Communication Technology Influences Face-to-Face Conversation Quality. Journal of Social and Personal Relationships 30 (2013), 237--246.","paperID":"None"},{"content":"Antti Salovaara, Antti Lindqvist, Tero Hasu, and Jonna Häkkilä. 2011. The Phone Rings but the User Doesn't Answer: Unavailability in Mobile Communication. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 503--512. DOI: http://dx.doi.org/10.1145/2037373.2037448","paperID":"None"},{"content":"Shin, Choonsung and Dey, Anind K. 2013. Automatically Detecting Problematic Use of Smartphones. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 335--344. DOI: http://dx.doi.org/10.1145/2493432.2493443","paperID":"None"},{"content":"Tasos Spiliotopoulos and Ian Oakley. 2013. Understanding Motivations for Facebook Use: Usage Metrics, Network Structure, and Privacy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3287--3296. DOI: http://dx.doi.org/10.1145/2470654.2466449","paperID":"None"},{"content":"Hermann Stern, Viktoria Pammer, and Stefanie N. Lindstaedt. 2011. A Preliminary Study on Interruptibility Detection Based on Location and Calendar Information. In Context-Systems Design, Evaluation and Optimisation.","paperID":"None"},{"content":"Linda Tickle-Degnen and Robert Rosenthal. 1990. The Nature of Rapport and Its Nonverbal Correlates. Psychological Inquiry 1, 4 (1990), 285--293.","paperID":"None"},{"content":"Sherry Turkle. 2012. Alone Together: Why We Expect More from Technology and Less from Each Other. Basic Books, New York.","paperID":"None"},{"content":"Liam D. Turner, Stuart M. Allen, and Roger M. Whitaker. 2015. Interruptibility Prediction for Ubiquitous Systems: Conventions and New Directions from a Growing Field. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 801--812. DOI:http://dx.doi.org/10.1145/2750858.2807514","paperID":"None"}],"abstract":"Prior studies have addressed many negative aspects of mobile distractions in group activities. In this paper, we present Lock n' LoL. This is an application designed to help users focus on their group activities by allowing group members to limit their smartphone usage together. In particular, it provides synchronous social awareness of each other's limiting behavior. This synchronous social awareness can arouse feelings of connectedness among group members and can mitigate social vulnerability due to smartphone distraction (e.g., social exclusion) that often results in poor social experiences. After following an iterative prototyping process, we conducted a large-scale user study (n = 976) via real field deployment. The study results revealed how the participants used Lock n' LoL in their diverse contexts and how Lock n' LoL helped them to mitigate smartphone distractions.","title":"Lock n' LoL: Group-based Limiting Assistance App to Mitigate Smartphone Distractions in Group Activities","filename":"CHI16/p998","authors":["Minsam Ko","Seungwoo Choi","Koji Yatani","Uichin Lee"],"conference":"CHI '16"}