{"paperId":2858261,"citation":[],"abstract":"In this paper, we present a twenty-three months autobiographical design project of converting a Mercedes Sprinter van into a camper van. This project allows us to investigate the complexities and nuances of a case where people engage in a process of making, transforming and adapting a space they live in. This example opens a radically different and productive context for revisiting concepts that are currently at the center of human-computer interaction (HCI) research: ubiquitous computing, home automation, smart homes, and the Internet of Things. We offer six qualities characterizing the evolving relationship between the makers and the lived-in environment: the van. We conclude with a discussion on the two themes of living in a reconfigured home and prototype qualities in a reconfigured space, and a critical reflection around the theme of the invariably unfinished home.","reference":[{"content":"Gregory D. Abowd. 2012. What Next, Ubicomp?: Celebrating an Intellectual Disappearing Act. Proceedings of the 2012 ACM Conference on Ubiquitous Computing, ACM, 31-40. http://doi.org/10.1145/2370216.2370222","paperID":"None"},{"content":"Binaebi Akah and Shaowen Bardzell. 2010. Empowering Products: Personal Identity Through the Act of Appropriation. CHI '10 Extended Abstracts on Human Factors in Computing Systems, ACM, 4021- 4026. http://doi.org/10.1145/1753846.1754096","paperID":"None"},{"content":"Christopher Alexander. 1964. Notes on the Synthesis of Form. Harvard University Press.","paperID":"None"},{"content":"Morgan G. Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David A. Mellis, and Daniela K. Rosner. 2014. Making Cultures: Empowerment, Participation, and Democracy - or Not? CHI '14 Extended Abstracts on Human Factors in Computing Systems, ACM, 1087-1092. http://doi.org/10.1145/2559206.2579405","paperID":"None"},{"content":"Luigi Atzori, Antonio Iera, and Giacomo Morabito. 2010. The Internet of Things: A survey. Computer Networks 54, 15: 2787-2805. http://doi.org/10.1016/j.comnet.2010.05.010","paperID":"None"},{"content":"Matthew P. Aylett and Aaron J. Quigley. 2015. The Broken Dream of Pervasive Sentient Ambient Calm Invisible Ubiquitous Computing. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 425--435. http://doi.org/10.1145/2702613.2732508","paperID":"None"},{"content":"Genevieve Bell and Paul Dourish. 2007. Yesterday's Tomorrows: Notes on Ubiquitous Computing's Dominant Vision. Personal Ubiquitous Comput. 11, 2: 133-143. http://doi.org/10.1007/s00779-006-0071-x","paperID":"None"},{"content":"Marion Buchenau and Jane Fulton Suri. 2000. Experience Prototyping. Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, ACM, 424-433. http://doi.org/10.1145/347642.347802","paperID":"None"},{"content":"Andy Crabtree and Tom Rodden. 2004. Domestic Routines and Design for the Home. Computer Supported Cooperative Work (CSCW) 13, 2: 191-220. http://doi.org/10.1023/B:COSU.0000045712.26840.a4","paperID":"None"},{"content":"Andy Crabtree, Tom Rodden, Terry Hemmings, and Steve Benford. 2003. Finding a Place for UbiComp in the Home. In UbiComp 2003: Ubiquitous Computing, Anind K. Dey, Albrecht Schmidt and Joseph F. McCarthy (eds.). Springer Berlin Heidelberg, 208-226. Retrieved February 14, 2014 from http://link.springer.com.proxy.lib.sfu.ca/chapter/10.100 7/978--3--540--39653--6_17","paperID":"None"},{"content":"Rémy Dautriche, Camille Lenoir, Alexandre Demeure, Cédric Gérard, Joëlle Coutaz, and Patrick Reignier. 2013. End-User-Development for Smart Homes: Relevance and Challenges. 6. Retrieved September 4, 2015 from https://hal.inria.fr/hal-00953369/document","paperID":"None"},{"content":"Audrey Desjardins, Ron Wakkary, and William Odom. 2015. Investigating Genres and Perspectives in HCI Research on the Home. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3073-3082. http://doi.org/10.1145/2702123.2702540","paperID":"None"},{"content":"W. Gaver. 2006. The Video Window: My Life with a Ludic System. Personal Ubiquitous Comput. 10, 2--3: 60-65. http://doi.org/10.1007/s00779-005-0002--2","paperID":"None"},{"content":"Richard Harper (ed.). 2003. Inside the smart home. Springer, London; NY.","paperID":"None"},{"content":"Stacey Kuznetsov and Eric Paulos. 2010. Rise of the expert amateur: DIY projects, communities, and cultures. Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, ACM, 295-304. http://doi.org/10.1145/1868914.1868950","paperID":"None"},{"content":"Youn-Kyung Lim, Erik Stolterman, and Josh Tenenberg. 2008. The anatomy of prototypes: Prototypes as filters, prototypes as manifestations of design ideas. ACM Trans. Comput.-Hum. Interact. 15, 2: 7:1-7:27. http://doi.org/10.1145/1375761.1375762","paperID":"None"},{"content":"Silvia Lindtner, Garnet D. Hertz, and Paul Dourish. 2014. Emerging Sites of HCI Innovation: Hackerspaces, Hardware Startups & Incubators. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 439-448. http://doi.org/10.1145/2556288.2557132","paperID":"None"},{"content":"Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical Design in HCI Research: Designing and Learning Through Use-it-yourself. Proceedings of the Designing Interactive Systems Conference, ACM, 514-523. http://doi.org/10.1145/2317956.2318034","paperID":"None"},{"content":"Jon O'Brien and Tom Rodden. 1997. Interactive Systems in Domestic Environments. Proceedings of the 2Nd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, ACM, 247-259. http://doi.org/10.1145/263552.263617","paperID":"None"},{"content":"Dries De Roeck, Karin Slegers, Johan Criel, et al. 2012. I Would DiYSE for It!: A Manifesto for Do-it-yourself Internet-of-things Creation. Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, ACM, 170-179. http://doi.org/10.1145/2399016.2399044","paperID":"None"},{"content":"Daniela Rosner and Jonathan Bean. 2009. Learning from IKEA hacking: I'm not one to decoupage a tabletop and call it a day. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 419-422. http://doi.org/10.1145/1518701.1518768","paperID":"None"},{"content":"Donald A Schön. 1983. The reflective practitioner: how professionals think in action. Basic Books, NY.","paperID":"None"},{"content":"Jin-min Seok, Jong-bum Woo, and Youn-kyung Lim. 2014. Non-finito Products: A New Design Space of User Creativity for Personal User Experience. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 693-702. http://doi.org/10.1145/2556288.2557222","paperID":"None"},{"content":"Elizabeth Shove, Matthew Watson, Martin Hand, and Jack Ingram. 2007. The design of everyday life. Berg, Oxford; NY.","paperID":"None"},{"content":"Laurel Swan, Alex S. Taylor, and Richard Harper. 2008. Making Place for Clutter and Other Ideas of Home. ACM Trans. Comput.-Hum. Interact. 15, 2: 9:1-9:24. http://doi.org/10.1145/1375761.1375764","paperID":"None"},{"content":"Joshua G. Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing Technology: Pleasure, Utility and Expressiveness in DIY and Maker Practice. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2603-2612. http://doi.org/10.1145/2470654.2481360","paperID":"None"},{"content":"Alex S. Taylor and Laurel Swan. 2005. Artful systems in the home. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 641--650. http://doi.org/10.1145/1054972.1055060","paperID":"None"},{"content":"Daniel Tetteroo, Panos Markopoulos, Stefano Valtolina, Fabio Paternò, Volkmar Pipek, and Margaret Burnett. 2015. End-User Development in the Internet of Things Era. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 2405-2408. http://doi.org/10.1145/2702613.2702643","paperID":"None"},{"content":"Peter Tolmie, James Pycock, Tim Diggins, Allan MacLean, and Alain Karsenty. 2002. Unremarkable computing. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 399--406. http://doi.org/10.1145/503376.503448","paperID":"None"},{"content":"Austin L. Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 629--638. http://doi.org/10.1145/2702123.2702522","paperID":"None"},{"content":"Peter-Paul Verbeek. 2005. What Things Do: Philosophical Reflections on Technology, Agency, and Design. Penn State Press.","paperID":"None"},{"content":"Ron Wakkary, Audrey Desjardins, and Sabrina Hauser. 2015. Unselfconscious Interaction: A Conceptual Construct. Interacting with Computers: iwv018. http://doi.org/10.1093/iwc/iwv018","paperID":"None"},{"content":"Ron Wakkary, Audrey Desjardins, Sabrina Hauser, and Leah Maestri. 2013. A sustainable design fiction: Green practices. ACM Trans. Comput.-Hum. Interact. 20, 4: 23:1-23:34. http://doi.org/10.1145/2494265","paperID":"None"},{"content":"Ron Wakkary and Leah Maestri. 2007. The resourcefulness of everyday design. Proceedings of the 6th ACM SIGCHI conference on Creativity & Cognition, ACM, 163-172. http://doi.org/10.1145/1254960.1254984","paperID":"None"},{"content":"Ron Wakkary and Karen Tanenbaum. 2009. A sustainable identity: the creativity of an everyday designer. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 365--374. http://doi.org/10.1145/1518701.1518761","paperID":"None"},{"content":"Tricia Wang and Joseph \"Jofish\" Kaye. 2011. Inventive leisure practices: understanding hacking communities as sites of sharing and innovation. CHI '11 Extended Abstracts on Human Factors in Computing Systems, ACM, 263-272. http://doi.org/10.1145/1979742.1979615","paperID":"None"},{"content":"Jong-bum Woo and Youn-kyung Lim. 2015. User Experience in Do-it-yourself-style Smart Homes. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 779-790. http://doi.org/10.1145/2750858.2806063","paperID":"None"},{"content":"Twine. Retrieved from http://supermechanical.com/twine/","paperID":"None"},{"content":"NinjaBlocks. Retrieved from https://ninjablocks.com/","paperID":"None"},{"content":"http://casajasmina.arduino.cc/. Retrieved September 2, 2015 from http://casajasmina.arduino.cc/"}],"title":"Living In A Prototype: A Reconfigured Space","filename":"CHI16/p5274","authors":["Audrey Desjardins","Ron Wakkary"],"conference":"CHI '16"}