{"paperId":2858300,"abstract":"Research on graphical perception of time series visualisations has focused on visual representation, and not on interaction. Even for visual representation, there has been limited study of the impact on users of visual encodings and the strengths and weaknesses of Cartesian and Polar coordinate systems. In order to address this research gap, we performed a comprehensive graphical perception study that measured the effectiveness of time series visualisations with different interactions, visual encodings and coordinate systems for several tasks. Our results show that, while positional and colour visual encodings were better for most tasks, area visual encoding performed better for data comparison. Most importantly, we identified that introducing interactivity within time series visualisations considerably enhances the user experience, without any loss of efficiency or accuracy. We believe that our findings can greatly improve the development of visual analytics tools using time series visualisations in a variety of domains.","citation":[],"reference":[{"content":"Muhammad Adnan, Mike Just, Lynne Baillie, and Hilmi G. Kayacik. 2015. Investigating the work practices of network security professionals. Information & Computer Security 23, 3: 347--367.","paperID":"None"},{"content":"Wolfgang Aigner. 2011. Understanding the role and value of interaction: First steps. In Proceedings of the International Workshop on Visual Analytics (EuroVA '11), 17--20. http://dx.doi.org/10.2312/PE/EuroVAST/EuroVA11/01 7-020","paperID":"None"},{"content":"Wolfgang Aigner, Silvia Miksch, Heidrun Schumann, and Christian Tominski. 2011. Visualization of timeoriented data. Springer Science & Business Media.","paperID":"None"},{"content":"Danielle Albers, Michael Correll, and Michael Gleicher. 2014. Task-driven evaluation of aggregation in time series visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 551--560. http://dx.doi.org/10.1145/2556288.2557200","paperID":"None"},{"content":"Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 data-driven documents. IEEE Trans Vis Comput Graph 17, 12: 2301--2309.","paperID":"None"},{"content":"Cynthia A. Brewer, Mark Harrower, and Pennsylvania State University. 2015. ColorBrewer 2.0 - color advice for cartography. Retrieved July 10, 2015 from http://colorbrewer2.org/","paperID":"None"},{"content":"Michael Burch, Felix Bott, Fabian Beck, and Stephan Diehl. 2008. Cartesian vs. radial - a comparative evaluation of two visualization tools. In Proceedings of 4th International Symposium on Visual Computing (ISVC '08), 151--160. http://dx.doi.org/10.1007/978--3540--89639--5_15","paperID":"None"},{"content":"William S. Cleveland and Robert McGill. 1984. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American statistical association 79, 387: 531--554.","paperID":"None"},{"content":"William S. Cleveland and Robert McGill. 1986. An experiment in graphical perception. International Journal of Man-Machine Studies 25, 5: 491--500.","paperID":"None"},{"content":"Michael Correll, Danielle Albers, Steven Franconeri, and Michael Gleicher. 2012. Comparing averages in time series data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1095--1104. http://dx.doi.org/10.1145/2207676.2208556","paperID":"None"},{"content":"Stephan Diehl, Fabian Beck, and Michael Burch. 2010. Uncovering strengths and weaknesses of radial visualizations--an empirical approach. IEEE Trans Vis Comput Graph 16, 6: 935--942.","paperID":"None"},{"content":"Alan Dix and Geoffrey Ellis. 1998. Starting simple: adding value to static visualisation through simple interaction. In Proceedings of the working conference on Advanced visual interfaces (AVI '98), 124--134. http://dx.doi.org/10.1145/948496.948514","paperID":"None"},{"content":"Niklas Elmqvist, Andrew V. Moere, Hans-Christian Jetter, Daniel Cernea, Harald Reiterer, and T. J. Jankun-Kelly. 2011. Fluid interaction for information visualization. Information Visualization 10, 4: 327--340.","paperID":"None"},{"content":"Johannes Fuchs, Fabian Fischer, Florian Mansmann, Enrico Bertini, and Petra Isenberg. 2013. Evaluation of alternative glyph designs for time series data in a small multiple setting. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 3237--3246. http://dx.doi.org/10.1145/2470654.2466443","paperID":"None"},{"content":"John R. Harger, and Patricia J. Crossno. 2012. Comparison of open-source visual analytics toolkits. In Proceedings of the SPIE 8294, Visualization and Data Analysis, 82940E. http://dx.doi.org/10.1117/12.911901","paperID":"None"},{"content":"Jeffrey Heer, Nicholas Kong, and Maneesh Agrawala. 2009. Sizing the horizon: the effects of chart size and layering on the graphical perception of time series visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1303--1312. http://dx.doi.org/10.1145/1518701.1518897","paperID":"None"},{"content":"Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 203--212. http://dx.doi.org/10.1145/1753326.1753357","paperID":"None"},{"content":"Jeffrey Heer and Ben Shneiderman. 2012. Interactive dynamics for visual analysis. Communications of the ACM 55, 4: 45--54.","paperID":"None"},{"content":"Intel IT Center. 2013. Big Data Visualization: Turning Big Data Into Big Insights. Retrieved July 5, 2015 from http://www.intel.co.uk/content/dam/www/public/us/en/documents/white-papers/big-data-visualization-turningbig-data-into-big-insights.pdf","paperID":"None"},{"content":"Yvonne Jansen and Pierre Dragicevic. 2013. An interaction model for visualizations beyond the desktop. IEEE Trans Vis Comput Graph 19, 12: 23962405.","paperID":"None"},{"content":"Waqas Javed, Bryan McDonnel, and Niklas Elmqvist. 2010. Graphical perception of multiple time series. IEEE Trans Vis Comput Graph 16, 6: 927--934.","paperID":"None"},{"content":"Brian Johnson and Ben Shneiderman. 1991. Treemaps: A space-filling approach to the visualization of hierarchical information structures. In Proceedings of the IEEE Conference on Visualization (Visualization '91), 284--291. http://dx.doi.org/10.1109/VISUAL.1991.175815","paperID":"None"},{"content":"Heidi Lam, Tamara Munzner, and Robert Kincaid. 2007. Overview use in multiple visual information resolution interfaces. IEEE Trans Vis Comput Graph 13, 6: 1278--1285.","paperID":"None"},{"content":"Heidi Lam. 2008. A framework of interaction costs in information visualization. IEEE Trans Vis Comput Graph 14, 6: 1149--1156.","paperID":"None"},{"content":"Hai-Ning Liang, Paul Parsons, Hsien-Chi Wu, and Kamran Sedig. 2010. An exploratory study of interactivity in visualization tools: 'Flow' of interaction. Journal of Interactive Learning Research 21, 1: 5--45.","paperID":"None"},{"content":"Jie Liang and Mao L. Huang. 2010. Highlighting in information visualization: A survey. In Proceedings of the 14th International Conference on Information Visualization (IV '10), 79--85. http://dx.doi.org/10.1109/IV.2010.21","paperID":"None"},{"content":"Jock D. Mackinlay. 1986. Automating the design of graphical presentations of relational information. Acm Transactions On Graphics 5, 2: 110--141.","paperID":"None"},{"content":"Andrew McAfee and Erik Brynjolfsson. 2012. Big data: The management revolution. Harvard Bus Rev 90, 10: 61--67.","paperID":"None"},{"content":"Charles Perin, Frédéric Vernier, and Jean-Daniel Fekete. 2013. Interactive horizon graphs: improving the compact visualization of multiple time series. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 3217--3226. http://dx.doi.org/10.1145/2470654.2466441","paperID":"None"},{"content":"William A. Pike, John Stasko, Remco Chang, and Theresa A. O'Connell. 2009. The science of interaction. Information Visualization 8, 4: 263--274.","paperID":"None"},{"content":"Margit Pohl, Sylvia Wiltner, Silvia Miksch, Wolfgang Aigner, and Alexander Rind. 2012. Analysing interactivity in information visualisation. KI-Künstliche Intelligenz 26, 2: 151--159.","paperID":"None"},{"content":"Jibonananda Sanyal, Song Zhang, Gargi Bhattacharya, Phil Amburn, and Robert J. Moorhead. 2009. A user study to compare four uncertainty visualization methods for 1d and 2d datasets. IEEE Trans Vis Comput Graph 15, 6: 1209--1218.","paperID":"None"},{"content":"Matthias Schonlau and Ellen Peters. 2008. Graph comprehension: An experiment in displaying data as bar charts, pie charts and tables with and without the gratuitous 3rd dimension. Social Science Research Network Working Paper Series.","paperID":"None"},{"content":"Kamran Sedig, Paul Parsons, and Alex Babanski. 2012. Towards a Characterization of Interactivity in Visual Analytics. Journal of Multimedia Processing and Technologies 3, 1: 12--28.","paperID":"None"},{"content":"Kamran Sedig, Paul Parsons, Mark Dittmer, and Robert Haworth. 2014. Human-centered interactivity of visualization tools: Micro-and macro-level considerations. In Handbook of Human Centric Visualization, Weidong Huang (eds). Springer, NY, 717--743.","paperID":"None"},{"content":"John Stasko, Richard Catrambone, Mark Guzdial, and Kevin McDonald. 2000. An evaluation of space-filling information visualizations for depicting hierarchical structures. International Journal of Human-Computer Studies 53, 5: 663--694.","paperID":"None"},{"content":"James J. Thomas and Kristin A. Cook (eds.). 2005. Illuminating the path: The research and development agenda for visual analytics. IEEE Computer Society Press.","paperID":"None"},{"content":"Christian Tominski, Camilla Forsell, and Jimmy Johansson. 2012. Interaction support for visual comparison inspired by natural behavior. IEEE Trans Vis Comput Graph 18, 12: 2719--2728.","paperID":"None"},{"content":"Soo J. Yi, Youn ah Kang, John T. Stasko, and Julie A. Jacko. 2007. Toward a deeper understanding of the role of interaction in information visualization. IEEE Trans Vis Comput Graph 13, 6: 1224--1231.","paperID":"None"},{"content":"Leishi Zhang, Andreas Stoffel, Michael Behrisch, Sebastian Mittelstadt, Tobias Schreck, René Pompl, Simon Weber, Holger Last, and Daniel Keim. 2012. Visual analytics for the big data era - A comparative review of state-of-the-art commercial systems. In Proceedings of IEEE Conference on Visual Analytics Science and Technology (VAST '12), 173--182. http://dx.doi.org/10.1109/VAST.2012.6400554","paperID":"None"}],"title":"Investigating Time Series Visualisations to Improve the User Experience","filename":"CHI16/p5444","authors":["Muhammad Adnan","Mike Just","Lynne Baillie"],"conference":"CHI '16"}