{"paperId":2858460,"citation":[],"reference":[{"content":"Bureau of Labor Statistics Data. (2014). http://data.bls.gov/cgi-bin/surveymost","paperID":"None"},{"content":"Exclusive pumping's growing popularity. By Kate Tuttle for Babble.com. (2007). http://www.babble.com/baby/breast-free-breastfeeding-pumping-vs-bottle-feeding/","paperID":"None"},{"content":"Premature birth report card | March of Dimes. (2015). www.marchofdimes.org/mission/prematurity-reportcard.aspx","paperID":"None"},{"content":"Routledge International Handbook of Participatory Design. (2012).","paperID":"None"},{"content":"WHO | MDG 4: reduce child mortality. (2015). http://www.who.int/topics/millennium_development_goals/child_mortality/en/","paperID":"None"},{"content":"Why breastfeed? - Pregnancy and baby guide - NHS Choices. http://www.nhs.uk/conditions/pregnancy-and-baby/pages/why-breastfeed.aspx#close","paperID":"None"},{"content":"kanarinka/Breast-Pump-User-Data. (2014). https: //github.com/kanarinka/Breast-Pump-User-Data","paperID":"None"},{"content":"2015. American Academy of Pediatrics-What the AAP Is Doing To Support Families. (2015). https://www2.aap.org/breastfeeding/policyOnBreastfeedingAndUseOfHumanMilk.html","paperID":"None"},{"content":"Lisa Anthony, YooJin Kim, and Leah Findlater. 2013. Analyzing User-Generated YouTube Videos to Understand Touchscreen Use by People with Motor Impairments. In Proceedings of ACM SIGCHI Conference on Human Factors in Computing Systems. Paris, France., 1223--1232.","paperID":"None"},{"content":"Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. FeedFinder: A Location-Mapping Mobile Application for Breastfeeding Women. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (2015) (CHI '15). ACM, 1709--1718. DOI: http://dx.doi.org/10.1145/2702123.2702328","paperID":"None"},{"content":"Madeline Balaam, Judy Robertson, Geraldine Fitzpatrick, Rebecca Say, Gillian Hayes, Melissa Mazmanian, and Belinda Parmar. Motherhood and HCI. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (2013) (CHI EA '13). ACM, 3215--3218. DOI: http://dx.doi.org/10.1145/2468356.2479650","paperID":"None"},{"content":"Shaowen Bardzell. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2010) (CHI '10). ACM, 1301--1310. DOI: http://dx.doi.org/10.1145/1753326.1753521","paperID":"None"},{"content":"Emily Bazelon. Milk Me. (2006). http://www.slate.com/articles/life/family/2006/03/milk_me.html?nav=navoa.","paperID":"None"},{"content":"Linda M. Blum. At the breast: Ideologies of breastfeeding and motherhood in the contemporary USA. Beacon Press. (2000). http://books.google.com/books?hl=en&lr=&id=7YYGuVeSdaMC&oi=fnd&pg=PA1&dq=info:YfszT7UWm5gJ:scholar.google.com&ots=KTYOfhmCT9&sig=RbQ4ly7e_5kR4PGo-V-SUrQHFno","paperID":"None"},{"content":"Kate Boyer and Maia Boswell-Penc. A feminist technology, or (yet) \"More Work for Mother\"? In Feminist Technology. University of Illinois Press. (2010).","paperID":"None"},{"content":"Obesity Division of Nutrition Centers for Disease Control {and} Prevention, Physical Activity. Breastfeeding Report Card 2014. (2014). http://www.cdc.gov/breastfeeding/pdf/2014breastfeedingreportcard.pdf","paperID":"None"},{"content":"Joel Chan, Steven Dang, and Steven P. Dow. 2016. Improving crowd innovation with expert facilitation. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work.","paperID":"None"},{"content":"Rohit Chaudhri, Darivanh Vlachos, Gaetano Borriello, Kiersten Israel-Ballard, Anna Coutsoudis, Penny Reimers, and Noah Perin. Decentralized Human Milk Banking with ODK Sensors. In Proceedings of the 3rd ACM Symposium on Computing for Development (2013) (ACM DEV '13). ACM, 4:1--4:10. DOI: http://dx.doi.org/10.1145/2442882.2442887","paperID":"None"},{"content":"Jill Cohen. The fourth trimester. 61 (2002), 26--27.","paperID":"None"},{"content":"Clara Crivellaro, Rob Comber, John Bowers, Peter Wright, and Patrick Olivier. 2014. A Pool of Dreams: Facebook, Politics and the Emergence of a Social Movement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, Toronto, ON, Canada.","paperID":"None"},{"content":"E. Declercq, Carol Sakala, Maureen P. Corry, and Sandra Applebaum. New mothers speak out. (2008). http://childbirthconnection.org/pdfs/new-mothers-speak-out.pdf","paperID":"None"},{"content":"Eugene R. Declercq, Carol Sakala, Maureen P. Corry, Sandra Applebaum, and Ariel Herrlich. Listening to Mothers III: Pregnancy and Birth; Report of the Third National US Survey of Womens Childbearing Experiences. (2013). http://scholar.google.com/scholar?cluster=3052768560955248876&hl=en&oi=scholarr","paperID":"None"},{"content":"Christine M. Dieterich, Julia P. Felice, Elizabeth OSullivan, and Kathleen M. Rasmussen. Breastfeeding and Health Outcomes for the Mother-Infant Dyad. 60, 1 (2013), 31--48. DOI: http://dx.doi.org/10.1016/j.pcl.2012.09.010","paperID":"None"},{"content":"Carl DiSalvo, Illah Nourbakhsh, David Holstius, Aya Akin, and Marti Louw. 2008. The neighborhood networks project: a case study of critical engagement and creative expression through participatory design. In In proceedings of Participatory Design Conference. 41--50.","paperID":"None"},{"content":"Sheela R. Geraghty, Jane C. Khoury, and Heidi J. Kalkwarf. Human milk pumping rates of mothers of singletons and mothers of multiples. 21, 4 (2005), 413--420. http://jhl.sagepub.com/content/21/4/413.short","paperID":"None"},{"content":"Lorna Gibson and Vicki L. Hanson. Digital Motherhood: How Does Technology Help New Mothers?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2013) (CHI '13). ACM, 313--322. DOI: http://dx.doi.org/10.1145/2470654.2470700","paperID":"None"},{"content":"Barney G. Glaser and Anselm L. Strauss. The discovery of grounded theory: Strategies for qualitative research. Transaction Publishers. (2009). http://books.google.com/books?hl=en&lr=&id=rtiNK68Xt08C&oi=fnd&pg=PP1&dq=info:MDPDpCn0F7MJ:scholar.google.com&ots=UVxUSh2EYL&sig=N3A1tcNDvQKCreSzDFJDcYZb8Zw","paperID":"None"},{"content":"Leith Greenslade. The Biggest Missed Opportunity in Child Survival...Breastfeeding. (2014).","paperID":"None"},{"content":"Hall, Katy and Spurlock, Chris. Why Working Families Could Be Better Off In Sweden. (2013). http://www.huffingtonpost.com/2013/02/04/maternity-leave-paid-parental-leave-_n_2617284.html","paperID":"None"},{"content":"Bernardo L. Horta, World Health Organization, and others. Evidence on the long-term effects of breastfeeding. WHO Geneva. (2007). http://www.quenoosseparen.info/documentos/LMlargoplazo.pdf","paperID":"None"},{"content":"Mary Hui, Christine Ly, and Carman Neustaedter. MammiBelli: Sharing Baby Activity Levels Between Expectant Mothers and Their Intimate Social Groups. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (2012) (CHI EA '12). ACM, 1649--1654. DOI: http://dx.doi.org/10.1145/2212776.2223687","paperID":"None"},{"content":"S. Mitra Kalita. How come there's an iPhone 6 but breast pumps are stuck in 1.0? Quartz. (2014).","paperID":"None"},{"content":"Sarah Kliff. The breast pump industry is booming, thanks to Obamacare. (2013). http://www.washingtonpost.com/news/wonkblog/wp/2013/01/04/","paperID":"None"},{"content":"MIT Media Lab. The Media Lab Make the Breast Pump the-media-lab-make-the-breast-pump-not-suckhackathon-513fad8bc451","paperID":"None"},{"content":"Jill Lapore. Baby Food. (2009). http://www.newyorker.com/magazine/2009/01/19/baby-food","paperID":"None"},{"content":"Christopher A. Le Dantec, Robert G. Farrell, Jim E. Christensen, Mark Bailey, Jason B. Ellis, Wendy A. Kellogg, and W. Keith Edwards. Publics in Practice: Ubiquitous Computing at a Shelter for Homeless Mothers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2011) (CHI '11). ACM, 1687--1696. DOI: http://dx.doi.org/10.1145/1978942.1979189","paperID":"None"},{"content":"Joyce A. Martin. USA vital statistics and the measurement of gestational age. 21 (2007), 13--21. DOI: http://dx.doi.org/10.1111/j.1365--3016.2007.00857.x","paperID":"None"},{"content":"Martin, Courtney E. and Cary, John. Shouldn't the Breast Pump Be as Elegant as an iPhone and as Quiet as a Prius by Now? (2014). http://parenting.blogs.nytimes.com/2014/03/16/shouldnt-the-breast-pump-be-as-elegant-as-an-iphone-and-as","paperID":"None"},{"content":"Saru M. Matambanadzo. Fourth Trimester, The. 48 (2014), 117. http://heinonline.org/HOL/Page?handle=hein.journals/umijlr48&id=125&div=&collection=","paperID":"None"},{"content":"Aditi Misra, Aaron Gooze, Kari Watkins, Mariam Asad, and Christopher A. Le Dantec. 2014. Crowdsourcing and Its Application to Transportation Data Collection and Management. Transportation Research Record: Journal of the Transportation Research Board No. 2414 (2014), 1--8.","paperID":"None"},{"content":"Orwell H. Needham. 1854. Breas. (1854). http://www.google.com/patents/US11135 Cooperative Classification A61M1/06.","paperID":"None"},{"content":"Noelle Crombie. The Oregonian/OregonLive. Market for used breast pumps booms but how safe are second-hand pumps? (2008). http://blog.oregonlive.com/themombeat/2008/12/_medela_one_of_the.html","paperID":"None"},{"content":"Sharon Oviatt. Human-centered design meets cognitive load theory: designing interfaces that help people think. (2006), 871--880.","paperID":"None"},{"content":"Kathleen M. Rasmussen and Sheela R. Geraghty. The Quiet Revolution: Breastfeeding Transformed With the Use of Breast Pumps. 101, 8 (2011), 1356--1359. DOI: http://dx.doi.org/10.2105/AJPH.2011.300136","paperID":"None"},{"content":"Jan Riordan and Karen Wambach. Breastfeeding and human lactation. Jones & Bartlett Learning. (2010) http://books.google.com/books?hl=en&lr=&id=eNHQA7VZLvcC&oi=fnd&pg=PP2&dq=info:8dHzFx1LSMEJ:scholar.google.com&ots=gIL7Z8SwEn& sig=5jSSNC6WAASdNCfUPWb2DZcPpb4","paperID":"None"},{"content":"Mark A. Underwood. Human Milk for the Premature Infant. 60, 1 (2013), 189--207. DOI: http://dx.doi.org/10.1016/j.pcl.2012.09.008Not Suck Hackathon: by Catherine DIgnazio, Center for","paperID":"None"},{"content":"Civic Media. (2014). https://medium.com/@medialab/ UNICEF. Nutrition. (2015). http://www.unicef.org/nutrition/index_24824.html","paperID":"None"},{"content":"Office of the Surgeon General (US and others. The Surgeon General's Call to Action to Support Breastfeeding. (2011). http://www.ncbi.nlm.nih.gov/pubmed/21452448","paperID":"None"}],"abstract":"In recent years, the CHI community has begun to discuss how HCI research could improve the experience of motherhood. In this paper, we take up the challenge of designing for this complex life phase and present an analysis of data collected from a design process that included over 1,000 mother-submitted ideas to improve the breast pump, a technology that allows mothers around the world to collect and store their breast milk. In addition to presenting a range of ideas to improve this specific technology, we discuss environmental, legal, social, and emotional dimensions of the postpartum period that suggest opportunities for a range of additional supportive technologies. We close with insights linking our findings to ongoing discussions related to Feminist HCI theory, crowdsourcing, and participatory design.","title":"A Feminist HCI Approach to Designing Postpartum Technologies: \"When I first saw a breast pump I was wondering if it was a joke\"","filename":"CHI16/p2612","authors":["Catherine D'Ignazio","Alexis Hope","Becky Michelson","Robyn Churchill","Ethan Zuckerman"],"conference":"CHI '16"}