{"paperId":2858290,"citation":[],"reference":[{"content":"Alexander T. Adams, Jean Costa, Malte F. Jung, and Tanzeem Choudhury. 2015. Mindless Computing: Designing Technologies to Subtly Influence Behavior. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). 719--730.","paperID":"None"},{"content":"Icek Ajzen. 1991. Theories of Cognitive Self-Regulation The theory of planned behavior. Organizational Behavior and Human Decision Processes 50, 2 (1991), 179--211.","paperID":"None"},{"content":"Icek Ajzen. 2006. Constructing a theory of planned behavior questionnaire. (2006). http://people.umass.edu/aizen/pdf/tpb.measurement.pdf accessed on 2015-07-05.","paperID":"None"},{"content":"Icek Ajzen and B. L. Driver. 1991. Prediction of leisure participation from behavioral, normative, and control beliefs: An application of the theory of planned behavior. Leisure Sciences 13, 3 (1991), 185--204.","paperID":"None"},{"content":"Sonia M. Arteaga, Mo Kudeki, Adrienne Woodworth, and Sri Kurniawan. 2010. Mobile System to Motivate Teenagers? Physical Activity. In Proceedings of the 9th International Conference on Interaction Design and Children (IDC '10). 1--10.","paperID":"None"},{"content":"Albert Bandura. Social Foundations of Thought and Action: A Social Cognitive Theory (1 ed.). Prentice Hall.","paperID":"None"},{"content":"Richard Bartle. 1996. Hearts, clubs, diamonds, spades: Players who suit MUDs. Journal of MUD research 1, 1 (1996), 19.","paperID":"None"},{"content":"Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. 2013. Health Mashups: Presenting Statistical Patterns Between Wellbeing Data and Context in Natural Language to Promote Behavior Change. ACM Trans. Comput.-Hum. Interact. 20, 5, Article 30 (Nov. 2013), 27 pages.","paperID":"None"},{"content":"Wynne W. Chin. 2010. How to Write Up and Report PLS Analyses. In Handbook of Partial Least Squares. Springer Berlin Heidelberg, 655--690.","paperID":"None"},{"content":"Tom Chiu, Dong Ping Fang, John Chen, Yao Wang, and Christopher Jeris. 2001. A Robust and Scalable Clustering Algorithm for Mixed Type Attributes in Large Database Environment. In Proceedings of the Seventh ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '01). 263--268.","paperID":"None"},{"content":"Gilbert A. Churchill. 1979. A Paradigm for Developing Better Measures of Marketing Constructs. Journal of Marketing Research 16, 1 (1979), 64--73.","paperID":"None"},{"content":"Jan Cieciuch, Eldad Davidov, Michele Vecchione, Constanze Beierlein, and Shalom H. Schwartz. 2014. The Cross-National Invariance Properties of a New Scale to Measure 19 Basic Human Values: A Test Across Eight Countries. Journal of Cross-Cultural Psychology 45, 5 (2014), 764--776.","paperID":"None"},{"content":"Sunny Consolvo, Katherine Everitt, Ian Smith, and James A. Landay. 2006. Design Requirements for Technologies That Encourage Physical Activity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 457--466.","paperID":"None"},{"content":"Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, and James A. Landay. 2008. Activity Sensing in the Wild: A Field Trial of Ubifit Garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1797--1806.","paperID":"None"},{"content":"Eldad Davidov, Peter Schmidt, and Shalom H. Schwartz. 2008. Bringing Values Back In: The Adequacy of the European Social Survey to Measure Values in 20 Countries. Public Opinion Quarterly 72, 3 (2008), 420--445.","paperID":"None"},{"content":"H.J. Eysenck. 1992. Four ways five factors are not basic. Personality and Individual Differences 13, 6 (1992), 667--673.","paperID":"None"},{"content":"B. J. Fogg. 2002. Persuasive Technology: Using Computers to Change What We Think and Do. Ubiquity 2002, December, Article 5 (Dec. 2002).","paperID":"None"},{"content":"Caroline Free, Gemma Phillips, Leandro Galli, Louise Watson, Lambert Felix, Phil Edwards, Vikram Patel, and Andy Haines. 2013. The Effectiveness of Mobile-Health Technology-Based Health Behaviour Change or Disease Management Interventions for Health Care Consumers: A Systematic Review. PLoS Med 10, 1 (01 2013), e1001362.","paperID":"None"},{"content":"Roland Gasser, Dominique Brodbeck, Markus Degen, Jrg Luthiger, Remo Wyss, and Serge Reichlin. 2006. Persuasiveness of a Mobile Lifestyle Coaching Application Using Social Facilitation. In Persuasive Technology. Lecture Notes in Computer Science, Vol. 3962. Springer Berlin Heidelberg, 27--38.","paperID":"None"},{"content":"Joseph F. Hair Jr, G. Tomas M. Hult, Christian Ringle, and Marko Sarstedt. 2013. A primer on partial least squares structural equation modeling (PLS-SEM). Sage Publications.","paperID":"None"},{"content":"Sajanee Halko and Julie A. Kientz. 2010. Personality and Persuasive Technology: An Exploratory Study on Health-promoting Mobile Applications. In Proceedings of the 5th International Conference on Persuasive Technology (PERSUASIVE'10). Springer-Verlag, Berlin, Heidelberg, 150--161.","paperID":"None"},{"content":"Juho Hamari, Jonna Koivisto, and Tuomas Pakkanen. 2014. Do Persuasive Technologies Persuade? - A Review of Empirical Studies. In Persuasive Technology. Lecture Notes in Computer Science, Vol. 8462. Springer International Publishing, 118--136.","paperID":"None"},{"content":"Eric B. Hekler, Predrag Klasnja, Jon E. Froehlich, and Matthew P. Buman. 2013. Mind the Theoretical Gap: Interpreting, Using, and Developing Behavioral Theory in HCI Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3307--3316.","paperID":"None"},{"content":"Joerg Henseler, Christian M. Ringle, and Marko Sarstedt. 2015. A new criterion for assessing discriminant validity in variance-based structural equation modeling. Journal of the Academy of Marketing Science 43, 1 (2015), 115--135.","paperID":"None"},{"content":"Yamini Karanam, Leslie Filko, Lindsay Kaser, Hanan Alotaibi, Elham Makhsoom, and Stephen Voida. 2014. Motivational Affordances and Personality Types in Personal Informatics. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, NY, NY, USA, 79--82.","paperID":"None"},{"content":"Saskia M Kelders, Robin N Kok, Hans C Ossebaard, and Julia EWC Van Gemert-Pijnen. 2012. Persuasive System Design Does Matter: a Systematic Review of Adherence to Web-based Interventions. Journal of Medical Internet Research 14, 6 (nov 2012), e152.","paperID":"None"},{"content":"Jesper Kjeldskov and Connor Graham. 2003. A Review of Mobile HCI Research Methods. In Human-Computer Interaction with Mobile Devices and Services. Lecture Notes in Computer Science, Vol. 2795. Springer Berlin Heidelberg, 317--335.","paperID":"None"},{"content":"Predrag Klasnja and Wanda Pratt. 2012. Healthcare in the pocket: Mapping the space of mobile-phone health interventions. Journal of Biomedical Informatics 45, 1 (2012), 184--198.","paperID":"None"},{"content":"Kari Kuutti and Liam J. Bannon. 2014. The Turn to Practice in HCI: Towards a Research Agenda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3543--3552.","paperID":"None"},{"content":"Julie Anne Lee, Geoffrey Soutar, and Jordan Louviere. 2008. The BestWorst Scaling Approach: An Alternative to Schwartz's Values Survey. Journal of Personality Assessment 90, 4 (2008), 335--347.","paperID":"None"},{"content":"Joanne MacLean and Shannon Hamm. 2008. Values and Sport Participation: Comparing Participant Groups, Age, and Gender. Journal of Sport Behavior 31, 4 (2008), 352--367.","paperID":"None"},{"content":"Theresa M. Marteau, Gareth J. Hollands, and Paul C. Fletcher. 2012. Changing Human Behavior to Prevent Disease: The Importance of Targeting Automatic Processes. Science 337, 6101 (2012), 1492--1495.","paperID":"None"},{"content":"Susan Michie and Marie Johnston. 2012. Theories and techniques of behaviour change: Developing a cumulative science of behaviour change. Health Psychology Review 6, 1 (2012), 1--6.","paperID":"None"},{"content":"Oded Nov and Ofer Arazy. 2013. Personality-targeted Design: Theory, Experimental Procedure, and Preliminary Results. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, NY, NY, USA, 977--984.","paperID":"None"},{"content":"Gabriele Oettingen. 2012. Future thought and behaviour change. European Review of Social Psychology 23, 1 (2012), 1--63.","paperID":"None"},{"content":"Harri Oinas-Kukkonen and Marja Harjumaa. 2008. A Systematic Framework for Designing and Evaluating Persuasive Systems. In Persuasive Technology. Lecture Notes in Computer Science, Vol. 5033. Springer Berlin Heidelberg, 164--176.","paperID":"None"},{"content":"James M. Olver and Todd A. Mooradian. 2003. Personality traits and personal values: a conceptual and empirical integration. Personality and Individual Differences 35, 1 (2003), 109--125.","paperID":"None"},{"content":"Alina Pommeranz, Christian Detweiler, Pascal Wiggers, and Catholijn M. Jonker. 2011. Self-reflection on Personal Values to Support Value-sensitive Design. In Proceedings of the 25th BCS Conference on Human-Computer Interaction (BCS-HCI '11). British Computer Society, Swinton, UK, UK, 491--496.","paperID":"None"},{"content":"WilliamT Riley, DanielE Rivera, AudieA Atienza, Wendy Nilsen, SusannahM Allison, and Robin Mermelstein. 2011. Health behavior models in the age of mobile interventions: are our theories up to the task? Translational Behavioral Medicine 1, 1 (2011), 53--71.","paperID":"None"},{"content":"Shalom H. Schwartz. 1994. Are There Universal Aspects in the Structure and Contents of Human Values? Journal of Social Issues 50, 4 (Jan. 1994), 19--45.","paperID":"None"},{"content":"Shalom H. Schwartz, G. Melech, A. Lehmann, S. Burgess, M. Harris, and V. Owens. 2001. Extending the cross-cultural validity of the theory of basic human values with a different method of measurement. Journal of Cross-Cultural Psych. 32, 5 (Sept. 2001), 519--542.","paperID":"None"},{"content":"Natalie Taylor, Mark Conner, and Rebecca Lawton. 2012. The impact of theory on the effectiveness of worksite physical activity interventions: a meta-analysis and meta-regression. Health Psychology Review 6, 1 (2012), 33--73.","paperID":"None"},{"content":"Tammy Toscos, Anne Faber, Shunying An, and Mona Praful Gandhi. 2006. Chick Clique: Persuasive Technology to Motivate Teenage Girls to Exercise. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, NY, NY, USA, 1873--1878.","paperID":"None"},{"content":"Rolf Weiber and Daniel Muhlhaus. 2014. Strukturgleichungsmodellierung: Eine anwendungsorientierte Einführung in die Kausalanalyse mit Hilfe von AMOS, SmartPLS und SPSS. Springer-Verlag, Heidelberg.","paperID":"None"},{"content":"Rebecca Weston and Paul A Gore. 2006. A brief guide to structural equation modeling. The Counseling Psychologist 34, 5 (2006), 719--751.","paperID":"None"},{"content":"Yan Xu, Erika Shehan Poole, Andrew D. Miller, Elsa Eiriksdottir, Dan Kestranek, Richard Catrambone, and Elizabeth D. Mynatt. 2012. This is Not a One-horse Race: Understanding Player Types in Multiplayer Pervasive Health Games for Youth. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 843--852.","paperID":"None"},{"content":"Nick Yee. 2006. Motivations for play in online games. Cyber Psychology & Behavior 9, 6 (2006), 772--775.","paperID":"None"}],"abstract":"While we know that persuasive system design matters, we barely understand when persuasive strategies work and why they only work in some cases. We propose an approach to systematically understand and design for motivation, by studying the fundamental building blocks of motivation, according to the theory of planned behavior (TPB): attitude, subjective norm, and perceived control. We quantitatively analyzed (N=643) the attitudes, beliefs, and values of mobile fitness coach users with TPB. Capacity (i.e., perceived ability to exercise) had the biggest effect on users' motivation. Using individual differences theory, we identified three distinct user groups, namely followers, hedonists, and achievers. With insights from semi-structured interviews (N=5) we derive design implications finding that transformation videos that feature other users' success stories as well as suggesting an appropriate workout can have positive effects on perceived capacity. Practitioners and researchers can use our theory-based mixed-method research design to better understand user behavior in persuasive applications.","title":"Understanding the Mechanics of Persuasive System Design: A Mixed-Method Theory-driven Analysis of Freeletics","filename":"CHI16/p309","authors":["Hanna Schneider","Kilian Moser","Andreas Butz","Florian Alt"],"conference":"CHI '16"}