{"paperId":2858550,"citation":[],"reference":[{"content":"Nicholas Carr. 2010. The Shallows: What the Internet is Doing to Our Brains. WW Norton & Company, New York.","paperID":"None"},{"content":"Andrew Dillon. 1992. Reading from paper versus screens: A critical review of the empirical literature. Ergonomics, 35, 10: 1297--1326.","paperID":"None"},{"content":"Andrew Dillon, John Richardson, Cliff McKnight. 1990. The effect of display size and paragraph splitting on reading lengthy text from screen. Behaviour and Information Technology, 9, 3: 215--227.","paperID":"None"},{"content":"Geoffrey B. Duggan, Stephen J. Payne. 2011. Skim reading by satisficing: Evidence from eye tracking. In Proceedings of the 2011 Annual Conference on Human Factors in Computing Systems (CHI '11) Vancouver, BC, Canada. http://dx.doi.org/10.1145/1978942.1979114","paperID":"None"},{"content":"Yoram Eshet-Alkalai, Eran Chajut. 2010. You can teach old dogs new tricks: The factors that affect changes over time in digital literacy. Journal of Information Technology Education: Research 9, 1: 173--181.","paperID":"None"},{"content":"Jens Förster, Ronald S. Friedman, Nira Liberman. 2004. Temporal construal effects on abstract and concrete thinking: consequences for insight and creative cognition. Journal of Personality and Social Psychology 87, 2: 177--189.","paperID":"None"},{"content":"Antonio L. Freitas, Peter Gollwitzer, Yaacov Trope. 2004. The influence of abstract and concrete mindsets on anticipating and guiding others' self-regulatory efforts. Journal of Experimental Social Psychology 40, 6: 739--752.","paperID":"None"},{"content":"Kentaro Fujita. 2008. Seeing the forest beyond the trees: A construal-level approach to self-control. Social and Personality Psychology Compass. 2, 3: 1475--1496.","paperID":"None"},{"content":"Jun Fukukura, Melissa J. Ferguson, Kentaro Fujita. 2013. Psychological distance can improve decision making under information overload via gist memory. Journal of Experimental Psychology: General 142, 3: 658--665.","paperID":"None"},{"content":"Geoff Kaufman, Mary Flanagan. 2013. Lost in translation: Comparing the impact of an analog and digital version of a public health game on players' perceptions, attitudes, and cognitions. International Journal of Gaming and Computer-Mediated Simulations, 5, 3: 1--9.","paperID":"None"},{"content":"Eva Lermer, Bernhard Streicher, Rainer Sachs, Martina Raue, Dieter Frey. 2015. The effect of construal level on risk-taking. European Journal of Social Psychology 45, 1: 99--109.","paperID":"None"},{"content":"Anne Mangen. 2008. Hypertext fiction reading: haptics and immersion. Journal of Research in Reading 31, 4: 404--419.","paperID":"None"},{"content":"Cliff McKnight, Andrew Dillon, John Richardson, J. 1990. A comparison of linear and hypertext formats in information retrieval. In Hypertext: State of the Art, Ray McAleese and Catherine Green (eds.). Intellect, Oxford, UK, 10--19.","paperID":"None"},{"content":"Thierry Morineau, Caroline Blanche, Laurence Tobin, Laurence Guéguen. 2005. The emergence of the contextual role of the e-book in cognitive processes through an ecological and functional analysis. International Journal of Human-Computer Studies 62, 3: 329--348.","paperID":"None"},{"content":"John Naughton. 2010. The Internet: Is it changing the way we think? The Guardian. Retrieved September 15, 2015 from www.guardian.co.uk/","paperID":"None"},{"content":"Jan M. Noyes, Kate J. Garland. 2008. Computer vs. paper based tasks: Are they equivalent? Ergonomics 51, 9: 1352--1375.","paperID":"None"},{"content":"Gary W. Small, Teena D. Moody, Prabha Siddarth, Susan Y. Bookheimer. 2009. Your brain on Google: Patterns of cerebral activation during Internet searching. American Journal of Geriatric Psychiatry 17, 2: 116--126.","paperID":"None"},{"content":"Betsy Sparrow, Jenny Liu, Daniel M. Wegner. 2011. Google effects on memory: Cognitive consequences of having information at our fingertips. Science 333, 6043: 776--778.","paperID":"None"},{"content":"Don Tapscott. 2009. Grown up digital. McGraw-Hill: New York.","paperID":"None"},{"content":"Yaacov Trope, Nira Liberman. 2010. Construal-level theory of psychological distance. Psychological Review 117, 2: 440--463.","paperID":"None"},{"content":"Robin R. Vallacher, Daniel M. Wegner. 1987. What do people think they're doing? Action identification and human behavior. Psychological Review 94, 1: 3--15.","paperID":"None"},{"content":"Erik Wästlund, Torsten Norlander, Trevor Archer. 2008. The effect of page layout on mental workload: A dual-task experiment. Computers in Human Behavior 24, 3: 1229--1245.","paperID":"None"},{"content":"Maryanne Wolf. 2008. Proust and the squid: The story and science of the reading brain. Harper Perennial: New York.","paperID":"None"},{"content":"Maryanne Wolf. 2010. Our 'deep reading' brain: Its digital evolution poses questions. Nieman Reports 64, 2: 7--8.","paperID":"None"}],"abstract":"The present research investigated whether digital and non-digital platforms activate differing default levels of cognitive construal. Two initial randomized experiments revealed that individuals who completed the same information processing task on a digital mobile device (a tablet or laptop computer) versus a non-digital platform (a physical print-out) exhibited a lower level of construal, one prioritizing immediate, concrete details over abstract, decontextualized interpretations. This pattern emerged both in digital platform participants' greater preference for concrete versus abstract descriptions of behaviors as well as superior performance on detail-focused items (and inferior performance on inference-focused items) on a reading comprehension assessment. A pair of final studies found that the likelihood of correctly solving a problem-solving task requiring higher-level \"gist\" processing was: (1) higher for participants who processed the information for task on a non-digital versus digital platform and (2) heightened for digital platform participants who had first completed an activity activating an abstract mindset, compared to (equivalent) performance levels exhibited by participants who had either completed no prior activity or completed an activity activating a concrete mindset.","title":"High-Low Split: Divergent Cognitive Construal Levels Triggered by Digital and Non-digital Platforms","filename":"CHI16/p2773","authors":["Geoff Kaufman","Mary Flanagan"],"conference":"CHI '16"}