{"paperId":2858497,"citation":[],"reference":[{"content":"Adam L. Alter and Daniel M. Oppenheimer. 2008. Effects of fluency on psychological distance and mental construal (or why New York is a large city, but New York is a civilized jungle). Psychological Science. 19, 2: 161--167.","paperID":"None"},{"content":"Yi-Fen Chen. 2008. Herd behavior in purchasing books online. Computers in Human Behavior. 24, 5: 1977--1992.","paperID":"None"},{"content":"Yi-Fen Chen and Ya-Ju Wang. 2010. Effect of herd cues and product involvement on bidder online choices. Cyberpsychology, Behavior, and Social Networking. 13(4): 423--428.","paperID":"None"},{"content":"Terry L. Childers, Christopher L. Carr, Joann Peck, and Stephen Carson. 2002. Hedonic and utilitarian motivations for online retail shopping behavior. Journal of retailing. 77, 4: 511--535.","paperID":"None"},{"content":"Jacob Cohen. 1977. Statistical power analysis for the behavioral sciences. Lawrence Erlbaum Associates, Inc.","paperID":"None"},{"content":"Liqiong Deng and Poole, M. S. 2010. Affect in Web Interfaces: A Study of the Impacts of Webpage Visual Complexity and Order. MIS Quarterly. 34(4): 711--730","paperID":"None"},{"content":"Eric Gilbert, Saeideh Bakhshi, Shuo Chang, and Loren Terveen. 2013. \"I need to try this\"?: a statistical overview of pinterest. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2427--2436.","paperID":"None"},{"content":"Joseph H. Goldberg, Mark J. Stimson, Marion Lewenstein, Neil Scott, and Anna M. Wichansky. 2002. Eye tracking in web search tasks: design implications. In Proceedings of the 2002 symposium on Eye tracking research & applications. 51--58. ACM.","paperID":"None"},{"content":"Marc Hassenzahl and Daniel Ullrich. 2007. To do or not to do: Differences in user experience and retrospective judgments depending on the presence or absence of instrumental goals. Interacting with Computers. 19, 4: 429--437.","paperID":"None"},{"content":"E. Tory Higgins. 1998. Promotion and prevention: Regulatory focus as a motivational principle. Advances in experimental social psychology. 30: 1--46.","paperID":"None"},{"content":"Xin Li, Lei Guo, and Yihong Eric Zhao. 2008. Tagbased social interest discovery. In Proceedings of the 17th international conference on World Wide Web. 675--684. ACM.","paperID":"None"},{"content":"Emmanouela E. Manganari, George J. Siomkos, Irini D. Rigopoulou, and Adam P. Vrechopoulos. 2011. Virtual store layout effects on consumer behaviour: applying an environmental psychology approach in the online travel industry. Internet Research. 21, 3: 3--346.","paperID":"None"},{"content":"Daniel R. Montello. The contribution of space syntax to a comprehensive theory of environmental psychology. 2007. In Proceedings of the 6th International Space Syntax Symposium. 1--12.","paperID":"None"},{"content":"Michel Tuan Pham and Tamar Avnet. 2004. Ideals and oughts and the reliance on affect versus substance in persuasion. Journal of Consumer Research. 30, 4: 503--518.","paperID":"None"},{"content":"Anuj K.Shah and Daniel M. Oppenheimer. 2007. Easy does it: The role of fluency in cue weighting. Judgment and Decision Making. 2, 6: 371--379.","paperID":"None"},{"content":"Sav Shrestha and Kelsi Lenz. 2007. Eye gaze patterns while searching vs. browsing a website. Usability News 9, 1: 17.","paperID":"None"},{"content":"Uri Simonsohn and Dan Ariely. 2008. When rational sellers face nonrational buyers: evidence from herding on eBay. Management science. 54(9): 1624--1637.","paperID":"None"},{"content":"Heshan Sun. 2013. A longitudinal study of herd behavior in the adoption and continued use of technology. Mis Quarterly. 37(4): 1013--1041.","paperID":"None"},{"content":"Adam P.Vrechopoulos, Robert M. O'Keefe, Georgios I. Doukidis, and George J. Siomkos. 2004. Virtual store layout: an experimental comparison in the context of grocery retail. Journal of Retailing. 80, 1: 13--22.","paperID":"None"},{"content":"Eric A. Walden and Glenn J. Browne. 2009. Sequential adoption theory: a theory for understanding herding behavior in early adoption of novel technologies. Journal of the Association for Information Systems. 10(1): 1.","paperID":"None"},{"content":"Ping Zhang, Lina Zhou, and Hans-Dieter Zimmermann. 2013. Advances in Social Commerce Research: Guest Editors' Introduction. Electronic Commerce Research and Applications. 12: 221--223.","paperID":"None"}],"abstract":"Social product discovery is an emerging paradigm that enables users to seek information and inspiration from peer-contributed contents. Researchers have observed herd behaviors in social discovery, i.e., basing beliefs and decisions on what similarly situated others have done. In this paper, we explore the effects of content layout and motivation on users' herd behaviors in social discovery. We conduct an eye-tracking study with 120 participants to compare goal- and action-oriented users' behaviors on a grid versus waterfall style social discovery site. The results show that users have a higher tendency to herd on a grid-style website, more so for goal-oriented users.","title":"Influence of Content Layout and Motivation on Users' Herd Behavior in Social Discovery","filename":"CHI16/p5715","authors":["Yanzhen Yue","Xiaojuan Ma","Zhenhui Jiang"],"conference":"CHI '16"}