{"paperId":2858289,"citation":[],"reference":[{"content":"Tim Althoff and Jure Leskovec. 2015. Donor Retention in Online Crowdfunding Communities?: A Case Study of DonorsChoose.org. Proc. WWW 2015, ACM Press, 34-44. http://doi.org/10.1145/2736277.2741120","paperID":"None"},{"content":"Lisa Anthony, Yoojin Kim, and Leah Findlater. 2013. Analyzing user-generated youtube videos to understand touchscreen use by people with motor impairments. Proc. CHI 2013, ACM Press, 1223-1232. http://doi.org/10.1145/2470654.2466158","paperID":"None"},{"content":"Andre Bourque. Is Crowdfunding Your Medical Expenses Risky or Reasonable? Retrieved from http://www.huffingtonpost.com/andre-bourque/iscrowdfunding-your-medi_b_7088486.html","paperID":"None"},{"content":"Gordon Burtch and Jason Chan. 2014. Reducing Medical Bankruptcy Through Crowdfunding : Evidence from GiveForward. Proc. ICIS 2014, 1-19.","paperID":"None"},{"content":"Gordon Burtch, Anindya Ghose, and Sunhil Wattal. 2014. Cultural Differences and Geography As Determinants of Online Pro-Social Lending. MIS Quarterly 1: 1-44. http://doi.org/10.2139/ssrn.1692661","paperID":"None"},{"content":"Quianzhou Du, Zhilei Qiao, Weiguo Fan, Mi Zhou, Xuan Zhang, and Alan G. Wang. 2015. Money Talks : A Predictive Model on Crowdfunding Success Using Project Description. Proc. ACIS 2015, 1-8.","paperID":"None"},{"content":"B J Fogg, Jonathan Marshall, Othman Laraki, et al. 2001. What Makes Web Sites Credible? A Report on a Large Quantitative Study. Proc. CHI 2001, 61-68. http://doi.org/10.1145/365024.365037","paperID":"None"},{"content":"B. J. Fogg, Cathy Soohoo, David R. Danielson, Leslie Marable, Julianne Stanford, and Ellen R. Tauber. 2003. How do users evaluate the credibility of Web sites? Proc. DUX 2003, ACM Press, 1-15. http://doi.org/10.1145/997078.997097","paperID":"None"},{"content":"Jeff Galak, Deborah Small, and Andrew T Stephen. 2011. Microfinance Decision Making: A Field Study of Prosocial Lending. Journal of Marketing Research 48: S130-S137. http://doi.org/10.1509/jmkr.48.SPL.S130","paperID":"None"},{"content":"Elizabeth M Gerber and Julie Hui. 2013. Crowdfunding : Motivations and Deterrents for Participation. ACM Transactions on Computer-Human Interaction 20, 6: 32. http://doi.org/10.1145/2530540","paperID":"None"},{"content":"Margaret Gibelman and Sheldon R. Gelman. 2004. A loss of credibility: Patterns of wrongdoing among nongovernmental organizations. International Journal of Voluntary and Nonprofit Organizations 15, 4: 355- 381. http://doi.org/10.1007/s11266-004--1237--7","paperID":"None"},{"content":"Michael D. Greenberg and Elizabeth M. Gerber. 2014. Learning to Fail: Experiencing Public Failure Online Through Crowdfunding. Proc. CHI 2014, ACM Press, 581-590. http://doi.org/10.1145/2556288.2557110","paperID":"None"},{"content":"David U. Himmelstein, Deborah Thorne, Elizabeth Warren, and Steffie Woolhandler. 2009. Medical Bankruptcy in the USA, 2007: Results of a National Study. American Journal of Medicine 122, 8: 741-746. http://doi.org/10.1016/j.amjmed.2009.04.012","paperID":"None"},{"content":"Julie S. Hui, Elizabeth M. Gerber, and Darren Gergle. 2014. Understanding and Leveraging Social Networks for Crowdfunding: Opportunities and Challenges. Proc. DIS 2014, ACM Press, 2083-2088. http://doi.org/10.1145/2559206.2581289","paperID":"None"},{"content":"Julie S. Hui, Michael D. Greenberg, and Elizabeth M. Gerber. 2014. Understanding the role of community in crowdfunding work. Proc. CSCW 2014: 62-74. http://doi.org/10.1145/2531602.2531715","paperID":"None"},{"content":"Sungwook Hwang. 2010. The effect of charitable giving by celebrities on the personal public relations. Public Relations Review 36, 3: 313-315. http://doi.org/10.1016/j.pubrev.2010.04.010","paperID":"None"},{"content":"Dieter W. Joenssen, Anne Michaelis, and Thomas Müllerleile. 2014. A Link to New Product Preannouncement: Success Factors in Crowdfunding. SSRN 2014 49, 0: 0-22. Retrieved from http://ssrn.com/abstract=2476841","paperID":"None"},{"content":"Aniket Kittur, Bongwon Suh, Ed H Chi, and Palo Alto. 2008. Can You Ever Trust a Wiki? Impacting Perceived Trustworthiness in Wikipedia. Proc. CSCW 2008, ACM Press, 7-10. http://doi.org/10.1145/1460563.1460639","paperID":"None"},{"content":"Miriam J. Metzger. 2007. Making sense of credibility on the Web: Models for evaluating online information and recommendations for future research. Journal of the American Society for Information Science and Technology 58, 13: 2078-2091. http://doi.org/10.1002/asi.v58:13","paperID":"None"},{"content":"Tanushree Mitra and E Gilbert. 2014. The Language that Gets People to Give: Phrases that Predict Success on Kickstarter. Proc. CSCW 2014: 49-61. http://doi.org/10.1145/2531602.2531656","paperID":"None"},{"content":"Ethan Mollick. 2014. The dynamics of crowdfunding: An exploratory study. Journal of Business Venturing 29: 1-16. http://doi.org/10.1016/j.jbusvent.2013.06.005","paperID":"None"},{"content":"Meredith Ringel Morris, Scott Counts, Asta Roseway, Aaron Hoff, and Julia Schwarz. 2012. Tweeting is believing? Proc. CSCW 2012, ACM Press, 441-450. http://doi.org/10.1145/2145204.2145274","paperID":"None"},{"content":"Peter Pirolli, Evelin Wollny, and Bongwon Suh. 2009. So You Know You're Getting the Best Possible Information: A Tool that Increases Wikipedia Credibility. Proc. CHI 2009, ACM Press, 1505-1508. http://doi.org/10.1145/1518701.1518929","paperID":"None"},{"content":"Vineeth Rakesh, Jaegul Choo, and Chandan Reddy. 2015. Project Recommendation Using Heterogeneous Traits in Crowdfunding. Proc. ICSWM 2015.","paperID":"None"},{"content":"Soo Young Rieh. 2002. Judgment of information quality and cognitive authority in the Web. Journal of the American Society for Information Science and Technology 53, 2: 145-161. http://doi.org/10.1002/asi.10017","paperID":"None"},{"content":"Rhianna Schmunk. Kyle McConkey, B.C. Teen, Passes Away After Battle With Leukemia. Huffpost British Columbia. Retrieved from http://www.huffingtonpost.ca/2015/03/20/kylemcconkey-passes-away_n_6910980.html","paperID":"None"},{"content":"Julia Sisler. 2012. Crowdfunding for medical expenses. CMAJ : Canadian Medical Association journal 184, 2: 123-124. http://doi.org/10.1503/cmaj.109--4084","paperID":"None"},{"content":"Krystine Therriault. 2014. Scammers in the spotlight after exploiting story of of 18 year old with leukemia. Crowdfundingpr. Retrieved from http://www.crowdfundingpr.org/scammers-spotlightexploiting-story-18-year-old-leukemia/","paperID":"None"},{"content":"David Thomas. 2006. A General Inductive Approach for Analyzing Qualitative Evaluation Data. American Journal of Evaluation 27, 2: 237-246.","paperID":"None"},{"content":"Ilya Tirdatov. 2014. Web-Based Crowd Funding : Rhetoric of Success. Technical Communication 61, 1.","paperID":"None"},{"content":"Darcy Warkentin, Michael Woodworth, Jeffrey T. Hancock, and Nicole Cormier. 2010. Warrants and deception in computer mediated communication. Proc. CSCW 2010, ACM Press, 9-12. http://doi.org/10.1145/1718918.1718922","paperID":"None"},{"content":"Anbang Xu, Xiao Yang, Huaming Rao, Wai-tat Fu, Shih-wen Huang, and Brian P Bailey. 2014. Show Me the Money! An Analysis of Project Updates during Crowdfunding Campaigns. Proc. CHI 2014, ACM Press, 591-600. http://doi.org/10.1145/2556288.2557045","paperID":"None"},{"content":"Compassion. Retrieved from http://www.compassion.com/","paperID":"None"},{"content":"Impact of DonorsChoose.com. Retrieved from http://www.donorschoose.org/about/impact.html","paperID":"None"},{"content":"Impact of Kiva.org. Retrieved from http://www.kiva.org/team/fsm/impact","paperID":"None"},{"content":"Better Business Wise Giving Alliance. Retrieved from www.give.org","paperID":"None"},{"content":"Nvivo Tool. Retrieved from http://www.qsrinternational.com","paperID":"None"}],"abstract":"Traditional medical fundraising charities have been relying on third-party watchdogs and carefully crafting their reputation over time to signal their credibility to potential donors. As medical fundraising campaigns migrate to online platforms in the form of crowdfunding, potential donors can no longer rely on the organization's traditional methods for achieving credibility. Individual fundraisers must establish credibility on their own. Potential donors, therefore, seek new factors to assess the credibility of crowdfunding campaigns. In this paper, we investigate current practices in assessing the credibility of online medical crowdfunding campaigns. We report results from a mixed-methods study that analyzed data from social media and semi-structured interviews. We discovered eleven factors associated with the perceived credibility of medical crowdfunding. Of these, three communicative/emotional factors were unique to medical crowdfunding. We also found a distinctive validation practice, the collective endorsement. Close-connections' online presence and external online communities come together to form this collective endorsement in online medical fundraising campaigns. We conclude by describing how fundraisers can leverage collective endorsements to improve their campaigns' perceived credibility.","title":"The Power of Collective Endorsements: Credibility Factors in Medical Crowdfunding Campaigns","filename":"CHI16/p4538","authors":["Jennifer G. Kim","Ha Kyung Kong","Karrie Karahalios","Wai-Tat Fu","Hwajung Hong"],"conference":"CHI '16"}