{"paperId":2858306,"citation":[],"reference":[{"content":"Luigi Atzori, Antonio Iera, and Giacomo Morabito. 2010. The Internet of Things: A survey. Computer Networks 54, 15: 2787--2805. http://doi.org/10.1016/j.comnet.2010.05.010","paperID":"None"},{"content":"Luigi Atzori, Antonio Iera, and Giacomo Morabito. 2014. From \"smart objects\" to \"social objects\": The next evolutionary step of the internet of Luigi Atzori, Antonio Iera, and Giacomo Morabito. 2010. The Internet of Things: A survey. Computer Networks 54, 15: 2787--2805. http://doi.org/10.1016/j.comnet.2010.05.010","paperID":"None"},{"content":"Mark S. Ackerman. 2000. The intellectual challenge of CSCW: the gap between social requirements and technical feasibility. Hum.-Comput. Interact. 15, 2 (September 2000), 179--203. DOI=10.1207/S15327051HCI1523_5 http://dx.doi.org/10.1207/S15327051HCI1523_5","paperID":"None"},{"content":"Glenn Bowen, (2006) Grounded Theory and Sensitizing Concepts, International Journal of Qualitative Methods, (3), September 2006","paperID":"None"},{"content":"Khaled Bachour, Richard Wetzel, Martin Flintham, Trung Dong Huynh, Tom Rodden, and Luc Moreau. 2015. Provenance for the People: An HCI Perspective on the W3C PROV Standard through an Online Game. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2437--2446. DOI=10.1145/2702123.2702455 http://doi.acm.org/10.1145/2702123.2702455","paperID":"None"},{"content":"Michael Bieber, Fabio Vitali, Helen Ashman, V. Balasubramanian, And Harri Oinas-Kukkonen. 1997. Fourth generation hypermedia. Int. J. Hum.-Comput. Stud. 47, 1 (July 1997), 31--65. DOI=10.1006/ijhc.1997.0130 http://dx.doi.org/10.1006/ijhc.1997.0130","paperID":"None"},{"content":"Ralph Barthel, Kerstin Leder Mackley, Andrew Hudson-Smith, Angelina Karpovich, Martin de Jode, and Chris Speed. 2013. An internet of old things as an augmented memory system. Personal and Ubiquitous Computing 17, 2: 321--333. http://doi.org/10.1007/s00779-011-0496--8","paperID":"None"},{"content":"Jeffrey Bardzell and Shaowen Bardzell. 2013. What is \"critical\" about critical design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 32973306. DOI=10.1145/2470654.2466451 http://doi.acm.org/10.1145/2470654.2466451","paperID":"None"},{"content":"Steve Benford, Adrian Hazzard, Alan Chamberlain, Liming Xu, Augmenting a Guitar with its Digital Footprint, Proceedings of NIME 2015, Proceedings of the International Conference on New Interfaces for Musical Expression, Baton Rouge, LA, USA, May 31June 3, 2015, https://nime2015.lsu.edu/proceedings/264/0264paper.pdf","paperID":"None"},{"content":"Steve Benford and Gabriella Giannachi, Performing Mixed Reality, MIT Press, 2011","paperID":"None"},{"content":"Steve Benford, Peter Tolmie, Ahmed Ahmed, Andy Crabtree, Tom Rodden, 2012. Supporting traditional music-making: designing for situated discretion. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 127--136.","paperID":"None"},{"content":"Jennie Carroll, Steve Howard, Frank Vetere, Jane Peck, Jane, John Murphy, Identity, Power And Fragmentation in Cyberspace: Technology Appropriation by Young People (2001). ACIS 2001 Proceedings. Paper 6. http://aisel.aisnet.org/acis2001/6","paperID":"None"},{"content":"Enrico Costanza and Jeffrey Huang. 2009. Designable visual markers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1879--1888. DOI=10.1145/1518701.1518990 http://doi.acm.org/10.1145/1518701.1518990","paperID":"None"},{"content":"Abigail Durrant, Alex S. Taylor, David Frohlich, Abigail Sellen, and David Uzzell. 2009. Photo displays and intergenerational relationships in the family home. In Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology (BCS-HCI '09). British Computer Society, Swinton, UK, UK, 10--19.","paperID":"None"},{"content":"Alan Dix. 2007. Designing for appropriation. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI...but not as we know it - Volume 2 (BCS-HCI '07), Vol. 2. British Computer Society, Swinton, UK, UK, 27--30","paperID":"None"},{"content":"Anthony Dunne, Hertzian Tales: Electronic Products, Aesthetic Experience, and Critical Design Paperback -- Oct 2008 17.","paperID":"None"},{"content":"Martin De Jode, Ralph Barthel, Andrew Hudson-Smith, Tales of Things: The Story So Far. Proc. NOMe-IoT, ACM (2011), 19--20.","paperID":"None"},{"content":"Dimitrios Paris Darzentas, Michael A. Brown, Martin Flintham, and Steve Benford. 2015. The Data Driven Lives of Wargaming Miniatures. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2427--2436","paperID":"None"},{"content":"Nicholas Del Rio and Paulo Pinheiro Da Silva. 2007. Probe-it!: visualization support for provenance. In Proceedings of the 3rd international conference on Advances in visual computing - Volume Part II (ISVC'07), Vol. Part II. Springer-Verlag, Berlin, Heidelberg, 732--741.","paperID":"None"},{"content":"Paul Dourish, Where the Action Is, MIT Press, 2004","paperID":"None"},{"content":"Anthony Dunne, Hertzian Tales: Electronic Products, Aesthetic Experience, and Critical Design, The MIT Press, 2006","paperID":"None"},{"content":"Raphael Eidenbenz, Li Yu, and Roger Wattenhofer. 2013. Reading Up on Bookcrossing. The International Journal of the Book 10, 2: 11--26.","paperID":"None"},{"content":"Dan Fitton, Keith Cheverst, Mark Rouncefield, Alan Dix, Andy Crabtree, Probing Technology With technology Probes, Equator Workshop on Record and Replay Technologies, February 12--13 2004, London: EPSRC http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.209.664&rep=rep1&type=pdf","paperID":"None"},{"content":"Daniel Giusto, Antonio Iera, Giacomo Morabito, Luigi Atzori (Eds.), The Internet of Things, 1661 Springer, 2010. ISBN: 978--1--4419--1673-0.","paperID":"None"},{"content":"Etienne Gilson, The Philosophy of the Middle Ages, 1955, London: Sheed and Ward","paperID":"None"},{"content":"Joshua Glenn and Rob Walker. 2012. Significant Objects. FANTAGRAPHICS, Seattle, WA.","paperID":"None"},{"content":"Bill Gaver, Cultural commentators: Non-native interpretations as resources for polyphonic assessment, International Journal of Human-Computer Studies, Volume 65, Issue 4, April 2007, Pages 292--305","paperID":"None"},{"content":"Bill Gaver, What Should we Expect from Research Through Design, In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12), May 5--10, 2012, Austin, TX, USA.","paperID":"None"},{"content":"Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural probes. interactions 6, 1 (January 1999), 21--29. DOI=10.1145/291224.291235 http://doi.acm.org/10.1145/291224.291235","paperID":"None"},{"content":"Kristina Höök and Jonas Löwgren. 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Trans. Comput.-Hum. Interact. 19, 3, Article 23 (October 2012), 18 pages. DOI=10.1145/2362364.2362371 http://doi.acm.org/10.1145/2362364.2362371","paperID":"None"},{"content":"Wendy Hall, Hugh Davies, Gerard Hutchings, Rethinking Hypermedia: The Microscosm Approach, Klumer Academic Publishers, 1996","paperID":"None"},{"content":"Michaela Hoare, Steve Benford, Rachel Jones, and Natasa Milic-Frayling. 2014. Coming in from the margins: amateur musicians in the online age. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1295--1304. DOI=10.1145/2556288.2557298 http://doi.acm.org/10.1145/2556288.2557298.","paperID":"None"},{"content":"Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 17--24. DOI=10.1145/642611.642616 http://doi.acm.org/10.1145/642611.642616","paperID":"None"},{"content":"Gerd Kortuem, F. Kawsar, Dan Fitton, V. Sundramoorthy, Smart objects as building blocks for the Internet of things. IEEE Internet Computing 14, 1 (2010), 44--5.","paperID":"None"},{"content":"Lawrence Lessig, Remix: making art and commerce thrive in the hybrid economy, 2008, Penguin Pres","paperID":"None"},{"content":"Siân E. Lindley, Catherine C. Marshall, Richard Banks, Abigail Sellen, and Tim Regan. 2013. Rethinking the web as a personal archive. In Proceedings of the 22nd international conference on World Wide Web (WWW '13). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 749--760.","paperID":"None"},{"content":"Luc Moreau, The Foundations for Provenance on the Web, Foundations and Trends in Web Science, v.2 n.2-3, p.99--241, February 2010 doi>10.1561/1800000010","paperID":"None"},{"content":"Wendy Mackay, (1990). Users and Customizable Software: A Co-Adaptive Phenomenon. Ph.D. Thesis. Massachusetts Institute of Technology.","paperID":"None"},{"content":"Rupert Meese, Shakir Ali, Emily-Clare Thorne, Steve D. Benford, Anthony Quinn, Richard Mortier, Boriana N. Koleva, Tony Pridmore, and Sharon L. Baurley. 2013. From codes to patterns: designing interactive decoration for tableware. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 931--940. DOI=10.1145/2470654.2466119 http://doi.acm.org/10.1145/2470654.2466119","paperID":"None"},{"content":"Don Norman, The Design of Everyday Things: Revised and Expanded Edition, MIT Press, 2013","paperID":"None"},{"content":"Ted Nelson. (1995). The heart of connection: hypermedia unified by transclusion. Communications of the ACM, 38(8), 31--33.","paperID":"None"},{"content":"William Odom, John Zimmerman, and Jodi Forlizzi. 2011. Teenagers and their virtual possessions: design opportunities and issues. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1491--1500. DOI=10.1145/1978942.1979161 http://doi.acm.org/10.1145/1978942.1979161","paperID":"None"},{"content":"Daniela Petrelli, Steve Whittaker, and Jens Brockmeier. 2008. AutoTopography: what can physical mementos tell us about digital memories?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 53--62. DOI=10.1145/1357054.1357065 http://doi.acm.org/10.1145/1357054.1357065.","paperID":"None"},{"content":"Daniela K. Rosner. 2011. Tracing Provenance. interactions 18, 5: 32--37. http://doi.org/10.1145/2008176.2008186","paperID":"None"},{"content":"Yvonne Rogers, (2012) HCI Theory: Classical, Modern and Contemporary, Morgan & Claypool.","paperID":"None"},{"content":"Yvonne Rogers, Interaction design gone wild: Striving for wild theory. Interactions 18(4), 58--62.","paperID":"None"},{"content":"Abigail Sellen, Yvonne Rogers, Richard Harper, and Tom Rodden. 2009. Reflecting human values in the digital age. Commun. ACM 52, 3 (March 2009), 58--66. DOI=10.1145/1467247.1467265 http://doi.acm.org/10.1145/1467247.1467265","paperID":"None"},{"content":"Chris Speed and Simone O'Callaghan. 2011. The Hidden Histories of Objects; Provenance, Storytelling and Tagging Technologies. International Symposium for Electronic Art. Retrieved July 14, 2014 from http://www.research.ed.ac.uk/portal/en/publications/thehidden-histories-of-objects-provenance-storytellingand-tagging-technologies(e1755569--1ad6--4078-a0e184c08ccd1c51).html","paperID":"None"},{"content":"Douglas Schuler, Aki Namioka, (1993). Participatory Design: Principles and Practice. New Jersey: Lawrence Erlbaum.","paperID":"None"},{"content":"Elise van den Hoven and Berry Eggen B (2008) Informing augmented memory system design through autobiographical memory theory. Personal and Ubiquitous Computing, 12(6), 433--443.","paperID":"None"},{"content":"Claire Waterton, Experimenting with the Archive: STSers as Analysts and Co-constructors of Databases and Other Archival Forms, Science, Technology & Human Values, 35 (5), 645--676, 2010, SAGE","paperID":"None"},{"content":"World Wide Web Consortium, PROV-Overview: An Overview of the PROV Family of Documents, W3C Working Group Note, Moreau, L. and Groth, P., eds, 30th April 2013. http://hdl.handle.net/10421/7487","paperID":"None"},{"content":"World Wide Web Consortium, W3C Provenance Working Group. PROV Graph Layout Conventions. 2012. Accessed 2014-09--22. http://www.w3.org/2011/prov/wiki/Diagrams","paperID":"None"},{"content":"Xuan Zhao, Niloufar Salehi, Sasha Naranjit, Sara Alwaalan, Stephen Voida, and Dan Cosley. 2013. The many faces of facebook: experiencing social media as performance, exhibition, and personal archive. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1--10. DOI=10.1145/2470654.2470656 http://doi.acm.org/10.1145/2470654.2470656","paperID":"None"},{"content":"Zimmerman, J., Forlizzi, J., Evenson. S. (2007) Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 493--502","paperID":"None"}],"abstract":"We explore how physical artefacts can be connected to digital records of where they have been, who they have encountered and what has happened to them, and how this can enhance their meaning and utility. We describe how a travelling technology probe in the form of an augmented acoustic guitar engaged users in a design conversation as it visited homes, studios, gigs, workshops and lessons, and how this revealed the diversity and utility of its digital record. We describe how this record was captured and flexibly mapped to the physical guitar and proxy artefacts. We contribute a conceptual framework for accountable artefacts that articulates how multiple and complex mappings between physical artefacts and their digital records may be created, appropriated, shared and interrogated to deliver accounts of provenance and use as well as methodological reflections on technology probes.","title":"Accountable Artefacts: The Case of the Carolan Guitar","filename":"CHI16/p1163","authors":["Steve Benford","Adrian Hazzard","Alan Chamberlain","Kevin Glover","Chris Greenhalgh","Liming Xu","Michaela Hoare","Dimitrios Darzentas"],"conference":"CHI '16"}