{"paperId":2858112,"citation":[],"reference":[{"content":"Companion Principals: Examples. Online: http://companion.prototype0.net/examples. (2014). Accessed: 14/09/15.","paperID":"None"},{"content":"BBC Gory Games App. Online: http://www.bbc.co. uk/cbbc/findoutmore/hh-gory-games-app-faq. (2015). Accessed: 14/09/15.","paperID":"None"},{"content":"Heroes Reborn Companion App. http://www.nbc.com/heroes-reborn/app. (2015). Accessed: 14/09/15.","paperID":"None"},{"content":"Edward Anstead, Steve Benford, and Robert J. Houghton. 2014. Many-screen Viewing: Evaluating an Olympics Companion Application. In Proceedings of the 2014 ACM International Conference on Interactive Experiences for TV and Online Video (TVX '14). ACM, NY, NY, USA, 103--110. DOI: http://dx.doi.org/10.1145/2602299.2602304","paperID":"None"},{"content":"Santosh Basapur, Gunnar Harboe, Hiren Mandalia, Ashley Novak, Van Vuong, and Crysta Metcalf. 2011. Field Trial of a Dual Device User Experience for iTV. In Proceddings of the 9th International Interactive Conference on Interactive Television (EuroITV '11). ACM, NY, NY, USA, 127--136. DOI: http://dx.doi.org/10.1145/2000119.2000145","paperID":"None"},{"content":"Santosh Basapur, Hiren Mandalia, Shirley Chaysinh, Young Lee, Narayanan Venkitaraman, and Crysta Metcalf. 2012. FANFEEDS: Evaluation of Socially Generated Information Feed on Second Screen As a TV Show Companion. In Proceedings of the 10th European Conference on Interactive Tv and Video (EuroiTV '12). ACM, NY, NY, USA, 87--96. DOI: http://dx.doi.org/10.1145/2325616.2325636","paperID":"None"},{"content":"Andy Brown, Michael Evans, Caroline Jay, Maxine Glancy, Rhianne Jones, and Simon Harper. 2014a. HCI over Multiple Screens. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 665--674. DOI: http://dx.doi.org/10.1145/2559206.2578869","paperID":"None"},{"content":"Andy Brown, Caroline Jay, and Simon Harper. 2014b. Eye-tracking the dual-screen experience. Technical Report 1. Manchester University. DOI: http://dx.doi.org/10.6084/m9.figshare.993993","paperID":"None"},{"content":"Konstantinos Chorianopoulos, Francisco Javier Burón Fernández, Enrique Garcíá Salcines, and Carlos de Castro Lozano. 2010. Delegating the Visual Interface Between a Tablet and a TV. In Proceedings of the International Conference on Advanced Visual Interfaces (AVI '10). ACM, NY, NY, USA, 418--418. DOI: http://dx.doi.org/10.1145/1842993.1843096","paperID":"None"},{"content":"Leon Cruickshank, Emmanuel Tsekleves, Roger Whitham, Annette Hill, and Kaoruko Kondo. 2007. Making Interactive TV Easier to Use: Interface Design for a Second Screen Approach. The Design Journal 20 (2007).","paperID":"None"},{"content":"Evelien D'heer, Cédric Courtois, and Steve Paulussen. 2012. Everyday Life in (Front of) the Screen: The Consumption of Multiple Screen Technologies in the Living Room Context. In Proceedings of the 10th European Conference on Interactive Tv and Video (EuroiTV '12). ACM, NY, NY, USA, 195--198. DOI:http://dx.doi.org/10.1145/2325616.2325654","paperID":"None"},{"content":"Dillon Eversman, Timothy Major, Mithila Tople, Lauren Schaffer, and Janet Murray. 2015. United Universe: A Second Screen Transmedia Experience. In Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video (TVX '15). ACM, NY, NY, USA, 173--178. DOI: http://dx.doi.org/10.1145/2745197.2755520","paperID":"None"},{"content":"William J. Friedman and Frank Laycock. 1989. Children's Analog and Digital Clock Knowledge. Child Development 60, 2 (1989), pp. 357--371. http://www.jstor.org/stable/1130982","paperID":"None"},{"content":"David Geerts, Pablo Cesar, and Dick Bulterman. 2008. The Implications of Program Genres for the Design of Social Television Systems. In Proceedings of the 1st International Conference on Designing Interactive User Experiences for TV and Video (UXTV '08). ACM, NY, NY, USA, 71--80. DOI: http://dx.doi.org/10.1145/1453805.1453822","paperID":"None"},{"content":"David Geerts, Rinze Leenheer, Dirk De Grooff, Joost Negenman, and Susanne Heijstraten. 2014. In Front of and Behind the Second Screen: Viewer and Producer Perspectives on a Companion App. In Proceedings of the 2014 ACM International Conference on Interactive Experiences for TV and Online Video (TVX '14). ACM, NY, NY, USA, 95--102. DOI: http://dx.doi.org/10.1145/2602299.2602312","paperID":"None"},{"content":"Google. 2012. The New Multi-screen World:Understanding Cross-platorm Consumer Behavior. Google. http://goo.gl/xdbOe1","paperID":"None"},{"content":"Simon Harper, Eleni Michailidou, and Robert Stevens. 2009. Toward a Definition of Visual Complexity As an Implicit Measure of Cognitive Load. ACM Transactions on Applied Perception 6, 2, Article 10 (March 2009), 18 pages. DOI: http://dx.doi.org/10.1145/1498700.1498704","paperID":"None"},{"content":"Christopher Heaps and Stephen Handel. 1999. Similarity and features of natural textures. Journal of Experimental Psychology: Human Perception and Performance 25 (April 1999), 299--320.","paperID":"None"},{"content":"Michael E. Holmes, Sheree Josephson, and Ryan E. Carney. 2012. Visual Attention to Television Programs with a Second-screen Application. In Proceedings of the Symposium on Eye Tracking Research and Applications (ETRA '12). ACM, NY, NY, USA, 397--400. DOI:http://dx.doi.org/10.1145/2168556.2168646","paperID":"None"},{"content":"Caroline Jay, Simon Harper, Andy Brown, Maxine Glancy, and Mike Armstrong. 2013. Attention approximation: from the Web to multi-screen television. TVUX-2013 (2013).","paperID":"None"},{"content":"Jan Kallenbach, Silja Narhi, and Pirkko Oittinen. 2007. Effects of Extra Information on TV Viewers' Visual Attention, Message Processing Ability, and Cognitive Workload. Comput. Entertain. 5, 2, Article 8 (April 2007). DOI: http://dx.doi.org/10.1145/1279540.1279548","paperID":"None"},{"content":"Peter Kincaid, Robert Fishburne, Richard Rogers, and Brad Chissom. 1975. Derivation of new readability formulas (Automated Readability Index, Fog Count and Flesch Reading Ease Formula) for Navy enlisted personnel. Technical Report 8--75. USA Naval Education and Training Support Command.","paperID":"None"},{"content":"Jeremy Klein, Jonathan Freeman, David Harding, and Ali Teffahi. 2014. Assessing the Impact of Second Screen. Technical Report MC/168. Technologia. http://goo.gl/ZEPDbU","paperID":"None"},{"content":"Gavin Mann, Francesco Venturini, Robin Murdoch, Bikash Mishra, Gemma Moorby, and Bouchra Carlier. 2015. Digital Video and the Connected Consumer. Technical Report. Accenture.","paperID":"None"},{"content":"Mark McGill, JohnH. Williamson, and StephenA. Brewster. 2015. A review of collocated multi-user TV. Personal and Ubiquitous Computing 19, 5--6 (2015), 743--759. DOI: http://dx.doi.org/10.1007/s00779-015-0860--1","paperID":"None"},{"content":"Eleni Michailidou, Simon Harper, and Sean Bechhofer. 2008. Visual Complexity and Aesthetic Perception of Web Pages. In Proceedings of the 26th Annual ACM International Conference on Design of Communication (SIGDOC '08). ACM, NY, NY, USA, 215--224. DOI:http://dx.doi.org/10.1145/1456536.1456581","paperID":"None"},{"content":"Janet Murray, Sergio Goldenberg, Kartik Agarwal, Tarun Chakravorty, Jonathan Cutrell, Abraham Doris-Down, and Harish Kothandaraman. 2012. Story-map: IPad Companion for Long Form TV Narratives. In Proceedings of the 10th European Conference on Interactive Tv and Video (EuroiTV '12). ACM, NY, NY, USA, 223--226. DOI: http://dx.doi.org/10.1145/2325616.2325659","paperID":"None"},{"content":"Timothy Neate, Matt Jones, and Michael Evans. 2015a. Designing Attention for Multi-screen TV Experiences. In Proceedings of the 2015 British HCI Conference (British HCI '15). ACM, NY, NY, USA, 285--286. DOI:http://dx.doi.org/10.1145/2783446.2783613","paperID":"None"},{"content":"Timothy Neate, Matt Jones, and Michael Evans. 2015b. Mediating Attention for Second Screen Companion Content. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3103--3106. DOI:http://dx.doi.org/10.1145/2702123.2702278","paperID":"None"},{"content":"Aude Oliva, Michael L. Mack, Mochan Shrestha, and Angela Peeper. 2004. Identifying the Perceptual Dimensions of Visual Complexity of Scenes. In Proceedings of the Annual Meeting of the Cognitive Science Society.","paperID":"None"},{"content":"Henning Pohl and Roderick Murray-Smith. 2013. Focused and Casual Interactions: Allowing Users to Vary Their Level of Engagement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2223--2232. DOI: http://dx.doi.org/10.1145/2470654.2481307","paperID":"None"},{"content":"Katharina Reinecke, Tom Yeh, Luke Miratrix, Rahmatri Mardiko, Yuechen Zhao, Jenny Liu, and Krzysztof Z. Gajos. 2013. Predicting Users' First Impressions of Website Aesthetics with a Quantification of Perceived Visual Complexity and Colorfulness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2049--2058. DOI: http://dx.doi.org/10.1145/2470654.2481281","paperID":"None"},{"content":"Scott Robertson, Cathleen Wharton, Catherine Ashworth, and Marita Franzke. 1996. Dual Device User Interface Design: PDAs and Interactive Television. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '96). ACM, NY, NY, USA, 79--86. DOI: http://dx.doi.org/10.1145/238386.238408","paperID":"None"},{"content":"John Rooksby, Mattias Rost, Alistair Morrison, Marek Bell, Mathew Chalmers, and Timothy Smith. 2014. Practices of Parallel Media: Using Mobile Devices When Watching Television. In CSCW -- Designing with Users for Domestic Environments: Methods, Challenges and Lessons Learned. ACM.","paperID":"None"},{"content":"Jacqueline Sachs. 1974. Memory in reading and listening to discourse. Memory and Cognition 2, 1 (1974), 95--100. DOI: http://dx.doi.org/10.3758/BF03197498","paperID":"None"},{"content":"Han Sloetjes and Peter Wittenburg. 2008. Annotation by Category: ELAN and ISO DCR.. In LREC.","paperID":"None"},{"content":"Emmanuel Tsekleves, Roger Whitham, Koko Kondo, and Annette Hill. 2009. Bringing the Television Experience to Other Media in the Home: An Ethnographic Study. In Proceedings of the Seventh European Conference on European Interactive Television Conference (EuroITV '09). ACM, NY, NY, USA, 201--210. DOI: http://dx.doi.org/10.1145/1542084.1542125","paperID":"None"},{"content":"Christian Valuch, Ulrich Ansorge, Shelley Buchinger, Aniello Raffaele Patrone, and Otmar Scherzer. 2014. The Effect of Cinematic Cuts on Human Attention. In Proceedings of the 2014 ACM International Conference on Interactive Experiences for TV and Online Video (TVX '14). ACM, NY, NY, USA, 119--122. DOI: http://dx.doi.org/10.1145/2602299.2602307","paperID":"None"},{"content":"Anna Van Cauwenberge, Gabi Schaap, and Rob Van Roy. 2014. \"TV No Longer Commands Our Full Attention\": Effects of Second-screen Viewing and Task Relevance on Cognitive Load and Learning from News. Computers in Human Behavior 38 (Sept. 2014), 100--109. DOI: http://dx.doi.org/10.1016/j.chb.2014.05.021","paperID":"None"}],"abstract":"So many people are now using handheld second screens whilst watching TV that application developers and broadcasters are designing companion applications Second screen content that accompanies a TV programme. The nature of such dual-screen use cases inherently causes attention to be split, somewhat unpredictably. Dual-screen complexity, a clear factor in this attention split, is largely unexplored by the literature and will have an unknown (and likely negative) impact on user experience (UX). Therefore, we use empirical techniques to investigate the objective and subjective effect of dual-screen visual complexity on attention distribution in a companion content scenario. Our sequence of studies culminates in the deployment of a companion application prototype that supports adjustment of complexity (by either content curator or viewer) to allow convergence on optimum experience. Our findings assist the effective design of dual-screen content, informing content providers how to manage dual second screen complexity for enhanced UX through a more blended, complementary dual-screen experience.","title":"Designing Visual Complexity for Dual-screen Media","filename":"CHI16/p475","authors":["Timothy Neate","Michael Evans","Matt Jones"],"conference":"CHI '16"}