{"paperId":2858432,"citation":[],"reference":[{"content":"Alessandro Acquisti. 2006. Price Discrimination, Privacy Technologies, and User Acceptance. CHI Workshop on Personalization and Privacy (2006).","paperID":"None"},{"content":"A. Acquisti, I. Adjerid, and L. Brandimarte. 2013. Gone in 15 Seconds: The Limits of Privacy Transparency and Control. IEEE Security Privacy 11, 4 (July 2013), 72-74.","paperID":"None"},{"content":"Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2015. Privacy and human behavior in the age of information. Science 347, 6221 (2015), 509-514.","paperID":"None"},{"content":"Anne Adams and Martina Angela Sasse. 2001. Privacy in multimedia communications: Protecting users, not just data. In People and Computers XV Interaction without Frontiers. Springer, 49-64.","paperID":"None"},{"content":"Lalit Agarwal, Nisheeth Shrivastava, Sharad Jaiswal, and Saurabh Panjwani. 2013. Do not embarrass: re-examining user concerns for online tracking and advertising. In Proceedings of the Ninth Symposium on Usable Privacy and Security. ACM, 8.","paperID":"None"},{"content":"Naveen Farag Awad and M. S. Krishnan. 2006. The personalization privacy paradox: an empirical evaluation of information transparency and the willingness to be profiled online for personalization. MIS quarterly (2006), 13-28.","paperID":"None"},{"content":"Michael Barbaro, Tom Zeller, and Saul Hansell. 2006. A face is exposed for AOL searcher no. 4417749. NY Times 9, 2008 (2006).","paperID":"None"},{"content":"Louise Barkhuus. 2012. The mismeasurement of privacy: using contextual integrity to reconsider privacy in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 367-376.","paperID":"None"},{"content":"Alastair R Beresford, Dorothea Kubler, and Soren Preibusch. 2012. Unwillingness to pay for privacy: A field experiment. Economics Letters 117, 1 (2012), 25-27.","paperID":"None"},{"content":"Alastair R Beresford and Frank Stajano. 2003. Location privacy in pervasive computing. IEEE Pervasive computing 1 (2003), 46-55.","paperID":"None"},{"content":"Igor Bilogrevic, Kevin Huguenin, Berker Agir, Murtuza Jadliwala, Maria Gazaki, and Jean-Pierre Hubaux. 2015a. A machine-learning based approach to privacy-aware information-sharing in mobile social networks. Pervasive and Mobile Computing (2015).","paperID":"None"},{"content":"Igor Bilogrevic, Kevin Huguenin, Stefan Mihaila, Reza Shokri, and Jean-Pierre Hubaux. 2015b. Predicting Users' Motivations behind Location Check-Ins and Utility Implications of Privacy Protection Mechanisms. In 22nd Network and Distributed System Security Symposium (NDSS '15).","paperID":"None"},{"content":"Joseph Bonneau and Sren Preibusch. 2010. The privacy jungle: On the market for data protection in social networks. In Economics of information security and privacy. Springer, 121-167.","paperID":"None"},{"content":"Ramnath K. Chellappa and Raymond G. Sin. 2005. Personalization versus privacy: An empirical examination of the online consumers dilemma. Information Technology and Management 6, 2--3 (2005), 181-202.","paperID":"None"},{"content":"Yves-Alexandre de Montjoye, Cesar A Hidalgo, Michel Verleysen, and Vincent D Blondel. 2013. Unique in the Crowd: The privacy bounds of human mobility. Scientific reports 3 (2013).","paperID":"None"},{"content":"Cynthia Dwork. 2011. Differential privacy. In Encyclopedia of Cryptography and Security. Springer, 338-340.","paperID":"None"},{"content":"Facebook. 2015. Updating Our Terms and Policies: Helping You Understand How Facebook Works and How to Control Your Information. (2015).","paperID":"None"},{"content":"Adrienne Porter Felt, Serge Egelman, and David Wagner. 2012. I've got 99 problems, but vibration ain't one: a survey of smartphone users' concerns. In Proceedings of the second ACM workshop on Security and privacy in smartphones and mobile devices. ACM, 33-44.","paperID":"None"},{"content":"Oded Goldreich. 1998. Secure multi-party computation. Manuscript. Preliminary version (1998).","paperID":"None"},{"content":"Google. 2012. Updating our privacy policies and terms of service. (2012).","paperID":"None"},{"content":"Serge Gutwirth, Ronald Leenes, Paul de Hert, and Yves Poullet. 2012. European data protection: coming of age. Springer Science & Business Media.","paperID":"None"},{"content":"Mark Halper. 2015. Isabelle Falque-Pierrotin: Privacy Needs to Be the Default, Not an Option. (June 2015).","paperID":"None"},{"content":"Mathias Humbert, Erman Ayday, Jean-Pierre Hubaux, and Amalio Telenti. 2013. Addressing the concerns of the lacks family: quantification of kin genomic privacy. In Proceedings of the 2013 ACM SIGSAC conference on Computer & communications security (CCS '13). ACM, NY, NY, USA, 1141-1152.","paperID":"None"},{"content":"Mathias Humbert, Erman Ayday, Jean-Pierre Hubaux, and Amalio Telenti. 2014. Reconciling Utility with Privacy in Genomics. In Proceedings of the 13th Workshop on Privacy in the Electronic Society (WPES '14). ACM, NY, NY, USA, 11-20.","paperID":"None"},{"content":"Carlos Jensen and Colin Potts. 2004. Privacy Policies As Decision-making Tools: An Evaluation of Online Privacy Notices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 471-478.","paperID":"None"},{"content":"Aniket Kittur, Jeffrey V. Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease, and John Horton. 2013. The future of crowd work. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 1301-1318.","paperID":"None"},{"content":"John Krumm. 2009. A survey of computational location privacy. Personal and Ubiquitous Computing 13, 6 (2009), 391-399.","paperID":"None"},{"content":"Ponnurangam Kumaraguru and Lorrie Cranor. 2006. Privacy in India: Attitudes and awareness. In Privacy Enhancing Technologies. Springer, 243-258.","paperID":"None"},{"content":"David Lazer, Alex (Sandy) Pentland, Lada Adamic, Sinan Aral, Albert Laszlo Barabasi, Devon Brewer, Nicholas Christakis, Noshir Contractor, James Fowler, Myron Gutmann, Tony Jebara, Gary King, Michael Macy, Deb Roy, and Marshall Van Alstyne. 2009. Life in the network: the coming age of computational social science. Science 323, 5915 (Feb. 2009), 721-723.","paperID":"None"},{"content":"Pedro Giovanni Leon, Blase Ur, Yang Wang, Manya Sleeper, Rebecca Balebako, Richard Shay, Lujo Bauer, Mihai Christodorescu, and Lorrie Faith Cranor. 2013. What matters to users?: factors that affect users' willingness to share information with online advertisers. In Proceedings of the Ninth Symposium on Usable Privacy and Security. ACM, 7.","paperID":"None"},{"content":"Linkedin. 2015. Updating LinkedIns Privacy Policy. (2015).","paperID":"None"},{"content":"Jen-Yu Liu and Yi-Hsuan Yang. 2012. Inferring Personal Traits from Music Listening History. In Proceedings of the Second International ACM Workshop on Music Information Retrieval with User-centered and Multimodal Strategies (MIRUM '12). ACM, NY, NY, USA, 31-36.","paperID":"None"},{"content":"Mary Madden. 2014. Americans Consider Certain Kinds of Data to be More Sensitive than Others. (2014).","paperID":"None"},{"content":"Miguel Malheiros, Sren Preibusch, and M. Angela Sasse. 2013. \"Fairly truthful\": The impact of perceived effort, fairness, relevance, and sensitivity on personal data disclosure. In Trust and Trustworthy Computing. Springer, 250-266.","paperID":"None"},{"content":"Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazons Mechanical Turk. Behavior research methods 44, 1 (2012), 1-23.","paperID":"None"},{"content":"Aleecia M Mcdonald, Robert W Reeder, Patrick Gage Kelley, and Lorrie Faith Cranor. 2009. A comparative study of online privacy policies and formats. In Privacy enhancing technologies. Springer, 37-55.","paperID":"None"},{"content":"William J. McGuire. 1974. Psychological motives and communication gratification. The uses of mass communications: Current perspectives on gratifications research 3 (1974), 167-196.","paperID":"None"},{"content":"Yan Michalevsky, Gabi Nakibly, Aaron Schulman, and Dan Boneh. 2015. PowerSpy: Location Tracking using Mobile Device Power Analysis. USENIX Security (2015).","paperID":"None"},{"content":"Kate Moody. 2012. Internet usage amongst British consumers. (2012).","paperID":"None"},{"content":"James Moor. 1989. How to invade and protect privacy with computers. The information web: Ethical and social implications of computer networking (1989), 57-70.","paperID":"None"},{"content":"Anthony Morton. 2015. Age shall not wither them: But It Will Change Their Priorities About Protecting Their Information Privacy. Working Paper. Academy of Science and Engineering,USA.","paperID":"None"},{"content":"Arvind Narayanan and Vitaly Shmatikov. 2009. De-anonymizing social networks. In Security and Privacy, 2009 30th IEEE Symposium on. IEEE, 173-187.","paperID":"None"},{"content":"Helen Nissenbaum. 2004. Privacy as contextual integrity. Washington law review 79, 1 (2004).","paperID":"None"},{"content":"Lukasz Olejnik, Claude Castelluccia, and Artur Janc. 2012. Why johnny can't browse in peace: On the uniqueness of web browsing history patterns. In 5th Workshop on Hot Topics in Privacy Enhancing Technologies (HotPETs 2012).","paperID":"None"},{"content":"Alexandra-Mihaela Olteanu, Kevin Huguenin, Reza Shokri, and Jean-Pierre Hubaux. 2014. Quantifying the effect of co-location information on location privacy. In Privacy Enhancing Technologies. Springer, 184-203.","paperID":"None"},{"content":"Matthew Panzarino. 2011. Its not just the iPhone, Android stores your location data too. (Aug. 2011).","paperID":"None"},{"content":"S. Pearson and A. Benameur. 2010. Privacy, Security and Trust Issues Arising from Cloud Computing. In 2010 IEEE Second International Conference on Cloud Computing Technology and Science (CloudCom). 693-702.","paperID":"None"},{"content":"Vasile Claudiu Perta, Marco Valerio Barbera, and Alessandro Mei. 2014. Exploiting Delay Patterns for User IPs Identification in Cellular Networks. In Privacy Enhancing Technologies. Springer, 224-243.","paperID":"None"},{"content":"Alan M. Rubin. 1985. Uses and gratifications: Quasi-functional analysis. Broadcasting research methods (1985), 202-220.","paperID":"None"},{"content":"Sebastian Schnorf, Aaron Sedley, M Ortlieb, and A Woodruff. 2014. A comparison of six sample providers regarding online privacy benchmarks. In SOUPS Workshop on Privacy Personas and Segmentation.","paperID":"None"},{"content":"Reza Shokri, George Theodorakopoulos, Jean-Yves Le Boudec, and Jean-Pierre Hubaux. 2011. Quantifying location privacy. In Security and Privacy (SP), 2011 IEEE Symposium on. IEEE, 247-262.","paperID":"None"},{"content":"Reza Shokri, Carmela Troncoso, Claudia Diaz, Julien Freudiger, and Jean-Pierre Hubaux. 2010. Unraveling an old cloak: k-anonymity for location privacy. In Proceedings of the 9th annual ACM workshop on Privacy in the electronic society. ACM, 115-118.","paperID":"None"},{"content":"Internet Society. 2012. Global Internet User Survey. (2012).","paperID":"None"},{"content":"Chaoming Song, Zehui Qu, Nicholas Blumm, and Albert-Laszlo Barabasi. 2010. Limits of predictability in human mobility. Science 327, 5968 (2010), 1018-1021.","paperID":"None"},{"content":"Hamed Soroush, Keen Sung, Erik Learned-Miller, Brian Neil Levine, and Marc Liberatore. 2013. Turning Off GPS is Not Enough: Cellular location leaks over the Internet. In Privacy Enhancing Technologies. Springer, 103-122.","paperID":"None"},{"content":"Juliana Sutanto, Elia Palme, Chuan-Hoo Tan, and Chee Wei Phang. 2013. Addressing the personalization-privacy paradox: an empirical assessment from a field experiment on smartphone users. Mis Quarterly 37, 4 (2013), 1141-1164.","paperID":"None"},{"content":"Latanya Sweeney. 2000. Simple demographics often identify people uniquely. Health (San Francisco) 671 (2000), 1-34.","paperID":"None"},{"content":"Teradata. 2015. Balancing the Personalisation and Privacy Equation The Consumer View. (2015).","paperID":"None"},{"content":"NY Times. 2014. How your iPhone is tracking your every move. (Aug. 2014).","paperID":"None"},{"content":"Eran Toch, Yang Wang, and Lorrie Faith Cranor. 2012. Personalization and privacy: a survey of privacy risks and remedies in personalization-based systems. User Modeling and User-Adapted Interaction 22, 1--2 (2012), 203-220.","paperID":"None"},{"content":"Kristene Unsworth. 2014. Questioning trust in the era of big (and small) data. Bul. Am. Soc. Info. Sci. Tech. 41, 1 (Oct. 2014), 12-14.","paperID":"None"},{"content":"Yang Wang, Gregory Norice, and Lorrie Faith Cranor. 2011. Who is concerned about what? A study of American, Chinese and Indian users privacy concerns on social network sites. In Trust and trustworthy computing. Springer, 146-153.","paperID":"None"},{"content":"Samuel D Warren and Louis D Brandeis. 1890. The right to privacy. Harvard law review (1890), 193-220.","paperID":"None"},{"content":"Edgar A. Whitley. 2009. Informational privacy, consent and the control of personal data. Information security technical report 14, 3 (2009), 154-159.","paperID":"None"},{"content":"Sergey Yekhanin. 2010. Private Information Retrieval. Commun. ACM 53, 4 (April 2010), 68-73.","paperID":"None"},{"content":"Hui Zang and Jean Bolot. 2011. Anonymization of location data does not work: A large-scale measurement study. In Proceedings of the 17th annual international conference on Mobile computing and networking. ACM, 145-156.","paperID":"None"}],"abstract":"Online services often rely on processing users' data, which can be either provided directly by the users or combined from other services. Although users are aware of the latter, it is unclear whether they are comfortable with such data combination, whether they view it as beneficial for them, or the extent to which they believe that their privacy is exposed. Through an online survey (N=918) and follow-up interviews (N=14), we show that (1) comfort is highly dependent on the type of data, type of service and on the existence of a direct relationship with a company, (2) users have a highly different opinion about the presence of benefits for them, irrespectively of the context, and (3) users perceive the combination of online data as more identifying than data related to offline and physical behavior (such as location). Finally, we discuss several strategies for companies to improve upon these issues.","title":"\"If You Put All The Pieces Together...\": Attitudes Towards Data Combination and Sharing Across Services and Companies","filename":"CHI16/p5215","authors":["Igor Bilogrevic","Martin Ortlieb"],"conference":"CHI '16"}