{"paperId":2858513,"abstract":"Recommender systems must find items that match the heterogeneous preferences of its users. Customizable recommenders allow users to directly manipulate the system's algorithm in order to help it match those preferences. However, customizing may demand a certain degree of skill and new users particularly may struggle to effectively customize the system. In user studies of two different systems, I show that there is considerable heterogeneity in the way that new users will try to customize a recommender, even within groups of users with similar underlying preferences. Furthermore, I show that this heterogeneity persists beyond the first few interactions with the recommender. System designs should consider this heterogeneity so that new users can both receive good recommendations in their early interactions as well as learn how to effectively customize the system for their preferences.","citation":[],"reference":[{"content":"Jan Blom. 2000. Personalization: a taxonomy. In CHI'00 extended abstracts on Human factors in computing systems. ACM, 313-314. DOI: http://dx.doi.org/10.1145/633292.633483","paperID":"None"},{"content":"Svetlin Bostandjiev, John O'Donovan, and Tobias Hollerer. 2012. Tasteweights: a visual interactive hybrid recommender system. In Proceedings of the sixth ACM conference on Recommender systems. ACM, 35-42. DOI: http://dx.doi.org/10.1145/2365952.2365964","paperID":"None"},{"content":"Robin Burke. 2002. Hybrid recommender systems: Survey and experiments. User modeling and user-adapted interaction 12, 4 (2002), 331-370. DOI: http://dx.doi.org/10.1023/A:1021240730564","paperID":"None"},{"content":"Dina Burkolter, Benjamin Weyers, Annette Kluge, and Wolfram Luther. 2014. Customization of user interfaces to reduce errors and enhance user acceptance. Applied ergonomics 45, 2 (2014), 346-353. DOI: http://dx.doi.org/10.1016/j.apergo.2013.04.017","paperID":"None"},{"content":"Li Chen and Pearl Pu. 2012. Critiquing-based recommenders: survey and emerging trends. User Modeling and User-Adapted Interaction 22, 1--2 (2012), 125-150. DOI: http://dx.doi.org/10.1007/s11257-011--9108--6","paperID":"None"},{"content":"Yoshinori Hijikata, Yuki Kai, and Shogo Nishida. 2012. The relation between user intervention and user satisfaction for information recommendation. In SAC '12 Proceedings of the 27th Annual ACM Symposium on Applied Computing. 2002-2007. DOI: http://dx.doi.org/10.1145/2231936.2232109","paperID":"None"},{"content":"Bart P Knijnenburg, Svetlin Bostandjiev, John O'Donovan, and Alfred Kobsa. 2012. Inspectability and control in social recommenders. In Proceedings of the sixth ACM conference on Recommender systems. ACM, 43-50. DOI: http://dx.doi.org/10.1145/2365952.2365966","paperID":"None"},{"content":"Bart P Knijnenburg, Niels JM Reijmer, and Martijn C Willemsen. 2011. Each to his own: how different users call for different interaction methods in recommender systems. In Proceedings of the fifth ACM conference on Recommender systems. ACM, 141-148. DOI: http://dx.doi.org/10.1145/2043932.2043960","paperID":"None"},{"content":"Todd Kulesza, Simone Stumpf, Margaret Burnett, and Irwin Kwan. 2012. Tell me more?: The effects of mental model soundness on personalizing an intelligent agent. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1-10. DOI: http://dx.doi.org/10.1145/2207676.2207678","paperID":"None"},{"content":"Benedikt Loepp, Katja Herrmanny, and Jurgen Ziegler. 2015. Blended Recommending: Integrating Interactive Information Filtering and Algorithmic Recommender Techniques. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 975-984. DOI: http://dx.doi.org/10.1145/2702123.2702496","paperID":"None"},{"content":"Denis Parra. 2013. User controllability in a hybrid recommender system. Ph.D. Dissertation. University of Pittsburgh.","paperID":"None"},{"content":"Denis Parra and Peter Brusilovsky. 2015. User-controllable personalization: A case study with SetFusion. International Journal of Human-Computer Studies 78 (2015), 43-67. DOI: http://dx.doi.org/10.1016/j.ijhcs.2015.01.007","paperID":"None"},{"content":"J Ben Schafer, Joseph A Konstan, and John Riedl. 2002. Meta-recommendation systems: user-controlled integration of diverse recommendations. In Proceedings of the eleventh international conference on Information and knowledge management. ACM, 43-51. DOI: http://dx.doi.org/10.1145/584792.584803","paperID":"None"},{"content":"J Ben Schafer, Joseph A Konstan, and John Riedl. 2004. View through MetaLens: usage patterns for a meta-recommendation system. IEEE Proceedings-Software 151, 6 (2004), 267-279. DOI: http://dx.doi.org/10.1049/ip-sen:20041166","paperID":"None"},{"content":"Andrew I Schein, Alexandrin Popescul, Lyle H Ungar, and David M Pennock. 2002. Methods and metrics for cold-start recommendations. In Proceedings of the 25th annual international ACM SIGIR conference on Research and development in information retrieval. ACM, 253-260. DOI: http://dx.doi.org/10.1145/564376.564421","paperID":"None"},{"content":"Jacob Solomon. 2014. Customization bias in decision support systems. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 3065-3074. DOI: http://dx.doi.org/10.1145/2556288.2557211","paperID":"None"},{"content":"Xiaoyuan Su and Taghi M Khoshgoftaar. 2009. A survey of collaborative filtering techniques. Advances in artificial intelligence 2009 (2009), 4. DOI: http://dx.doi.org/10.1155/2009/421425","paperID":"None"},{"content":"S Shyam Sundar and Sampada S Marathe. 2010. Personalization versus customization: The importance of agency, privacy, and power usage. Human Communication Research 36, 3 (2010), 298-322. DOI: http://dx.doi.org/10.1111/j.1468--2958.2010.01377.x","paperID":"None"},{"content":"Katrien Verbert, Denis Parra, Peter Brusilovsky, and Erik Duval. 2013. Visualizing recommendations to support exploration, transparency and controllability. In Proceedings of the 2013 international conference on Intelligent user interfaces. ACM, 351-362. DOI: http://dx.doi.org/10.1145/2449396.2449442","paperID":"None"},{"content":"Vernon L. Smith. 1976. Experimental Economics: Induced Value Theory. The American Economic Review 66, 2 (May 1976), 274-279. http://www.jstor.org/stable/1817233","paperID":"None"}],"title":"Heterogeneity in Customization of Recommender Systems By Users with Homogenous Preferences","filename":"CHI16/p4166","authors":["Jacob Solomon"],"conference":"CHI '16"}