{"paperId":2858450,"citation":[],"reference":[{"content":"About reasons to be a mover: 2012. http://vimeo.com/ 48276698.","paperID":"None"},{"content":"Barnett, A., Cerin, E. and Baranowski, T. 2011. Active video games for youth: a systematic review. Journal of Physical Activity and Health. (2011).","paperID":"None"},{"content":"Black, D. and Loviscach, J. 2010. Locating Sounds Around the Screen. Proceedings of the 129th Audio Engineering Society Convention (2010).","paperID":"None"},{"content":"Chang, B.-W. and Ungar, D. 1993. Animation: From Cartoons to the User Interface. Proceedings of the 6th Annual ACM Symposium on User Interface Software and Technology (NY, NY, USA, 1993), 45--55.","paperID":"None"},{"content":"Cheong, C., Cheong, F. and Filippou, J. 2013. Using Design Science Research to Incorporate Gamification into Learning Activities. PACIS (2013), 156.","paperID":"None"},{"content":"Climbing Gets Second Chance at 2020 Olympics: http://www.climbing.com/news/climbing-gets-secondchance-at-2020-olympics/. Accessed: 2015-09--24.","paperID":"None"},{"content":"Coldwell, W. 2012. Indoor climbing: the rise of bouldering-only centres. The Guardian, http://www.theguardian.com/lifeandstyle/2012/jun/28/indoor-climbing-bouldering-only-centres.","paperID":"None"},{"content":"Daiber, F., Kosmalla, F. and Krüger, A. 2013. BouldAR: using augmented reality to support collaborative boulder training. CHI '13 Extended Abstracts on Human Factors in Computing Systems (NY, NY, USA, 2013), 949--954.","paperID":"None"},{"content":"Fanchini, M., Violette, F., Impellizzeri, F.M. and Maffiuletti, N.A. 2013. Differences in Climbing Specific Strength Between Boulder and Lead Rock Climbers: Journal of Strength and Conditioning Research. 27, 2 (Feb. 2013), 310--314.","paperID":"None"},{"content":"Glas, R. 2015. Breaking reality: Exploring pervasive cheating in Foursquare. Playful identities: the ludification of digital media cultures. V. Frissen, S. Lammes, M. De Lange, J. De Mul, and J. Raessens, eds. Amsterdam University Prress.","paperID":"None"},{"content":"Green, A.L. and Helton, W.S. 2011. Dual-task performance during a climbing traverse. Experimental Brain Research. 215, 3--4 (Oct. 2011), 307--313.","paperID":"None"},{"content":"Hämäläinen, P., Ilmonen, T., Höysniemi, J., Lindholm, M. and Nykänen, A. 2005. Martial arts in artificial reality. Proceedings of the SIGCHI conference on Human factors in computing systems (2005), 781--790.","paperID":"None"},{"content":"Hendrikx, M., Meijer, S., Van Der Velden, J. and Iosup, A. 2013. Procedural Content Generation for Games: A Survey. ACM Trans. Multimedia Comput. Commun. Appl.. 9, 1 (Feb. 2013), 1:1--1:22.","paperID":"None"},{"content":"Holsti, L., Takala, T., Martikainen, A., Kajastila, R. and Hämäläinen, P. 2013. Body-controlled trampoline training games based on computer vision. CHI '13 Extended Abstracts on Human Factors in Computing Systems (NY, NY, USA, 2013), 1143--1148.","paperID":"None"},{"content":"HRT LED climbing holds: 2013. http://seanmccoll.com/2013/03/new-hrt-systems/.","paperID":"None"},{"content":"Ishii, H., Wisneski, C., Orbanes, J., Chun, B. and Paradiso, J. 1999. PingPongPlus: design of an athletic-tangible interface for computer-supported cooperative play. Proceedings of the SIGCHI conference on Human Factors in Computing Systems (NY, NY, USA, 1999), 394--401.","paperID":"None"},{"content":"Jensen, M.M., Rasmussen, M.K., Mueller, F. \"Floyd\" and Grønbaek, K. 2015. Keepin' It Real: Challenges when Designing Sports-Training Games. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (NY, NY, USA, 2015), 2003--2012.","paperID":"None"},{"content":"Jones, B. et al. 2014. RoomAlive: Magical Experiences Enabled by Scalable, Adaptive Projector-camera Units. Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (NY, NY, USA, 2014), 637--644.","paperID":"None"},{"content":"Kajastila, R. and Hämäläinen, P. 2014. Augmented Climbing: Interacting With Projected Graphics on a Climbing Wall. CHI '14 Extended Abstracts on Human Factors in Computing Systems (2014).","paperID":"None"},{"content":"Khan, A., Matejka, J., Fitzmaurice, G. and Kurtenbach, G. 2005. Spotlight: Directing Users' Attention on Large Displays. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (NY, NY, USA, 2005), 791--798.","paperID":"None"},{"content":"Kosmalla, F., Daiber, F. and Krüger, A. 2015. ClimbSense: Automatic Climbing Route Recognition Using Wrist-worn Inertia Measurement Units. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (NY, NY, USA, 2015), 2033--2042.","paperID":"None"},{"content":"Ladha, C., Hammerla, N.Y., Olivier, P. and Plötz, T. 2013. ClimbAX: Skill Assessment for Climbing Enthusiasts. Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (NY, NY, USA, 2013), 235--244.","paperID":"None"},{"content":"Liebermann, D.G., Katz, L., Hughes, M.D., Bartlett, R.M., McClements, J. and Franks, I.M. 2002. Advances in the application of information technology to sport performance. Journal of sports sciences. 20, 10 (Oct. 2002), 755--769.","paperID":"None"},{"content":"Liljedahl, M., Lindberg, S. and Berg, J. 2005. Digiwall: an interactive climbing wall. Proceedings of the 2005 ACM SIGCHI International Conference on Advances in computer entertainment technology (NY, NY, USA, 2005), 225--228.","paperID":"None"},{"content":"Llewellyn, D.J. and Sanchez, X. 2008. Individual differences and risk taking in rock climbing. Psychology of Sport and Exercise. 9, 4 (Jul. 2008), 413--4","paperID":"None"},{"content":"Magill, R.A. and Anderson, D.I. 2012. The roles and uses of augmented feedback in motor skill acquisition. Skill Acquisition in Sport: Research, Theory and Practice. N. Hodges and A.M. Williams, eds. Routledge.","paperID":"None"},{"content":"Malone, T.W. 1981. Toward a theory of intrinsically motivating instruction. Cognitive Science. 5, 4 (Oct. 1981), 333--369.","paperID":"None"},{"content":"Malone, T.W. and Lepper, M.R. 1987. Making learning fun: A taxonomy of intrinsic motivations for learning. Aptitude, learning, and instruction. 3, (1987), 223--253.","paperID":"None"},{"content":"Mermier, C.M., Robergs, R.A., McMinn, S.M. and Heyward, V.H. 1997. Energy expenditure and physiological responses during indoor rock climbing. British Journal of Sports Medicine. 31, 3 (Sep. 1997), 224--228.","paperID":"None"},{"content":"Mueller, F., Agamanolis, S. and Picard, R. 2003. Exertion interfaces: sports over a distance for social bonding and fun. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (NY, NY, USA, 2003), 561--568.","paperID":"None"},{"content":"Mueller, F. \"Floyd\" and Muirhead, M. 2015. Jogging with a Quadcopter. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (NY, NY, USA, 2015), 2023--20","paperID":"None"},{"content":"Mueller, F. and Isbister, K. 2014. Movement-based Game Guidelines. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (NY, NY, USA, 2014), 2191--2200.","paperID":"None"},{"content":"Pasch, M., Bianchi-Berthouze, N., van Dijk, B. and Nijholt, A. 2009. Movement-based sports video games: Investigating motivation and gaming experience. Entertainment Computing. 1, 2 (Apr. 2009), 49--61.","paperID":"None"},{"content":"Phillips, C., Becker, L. and Bradley, E. 2012. Strange Beta: An assistance system for indoor rock climbing route setting. Chaos: An Interdisciplinary Journal of Nonlinear Science. 22, 1 (Mar. 2012), 013130.","paperID":"None"},{"content":"Rogers, Y. 2011. Interaction Design Gone Wild: Striving for Wild Theory. interactions. 18, 4 (Jul. 2011), 58--62.","paperID":"None"},{"content":"Shotton, J., Sharp, T., Kipman, A., Fitzgibbon, A., Finocchio, M., Blake, A., Cook, M. and Moore, R. 2013. Real-time human pose recognition in parts from single depth images. Commun. ACM. 56, 1 (Jan. 2013), 116--124.","paperID":"None"},{"content":"Sigrist, R., Rauter, G., Riener, R. and Wolf, P. 2013. Augmented visual, auditory, haptic, and multimodal feedback in motor learning: A review. Psychonomic Bulletin & Review. 20, 1 (Feb. 2013), 21--53.","paperID":"None"},{"content":"The Next Urban Sports Craze: http://www.outsideonline.com/1869981/next-urbansports-craze.","paperID":"None"},{"content":"Vansteenkiste, M., Lens, W. and Deci, E.L. 2006. Intrinsic Versus Extrinsic Goal Contents in Self-Determination Theory: Another Look at the Quality of Academic Motivation. Educational Psychologist. 41, 1 (Mar. 2006), 19--31.","paperID":"None"},{"content":"Waterfall climber: http://exertiongameslab.org/projects/waterfallclimber.","paperID":"None"},{"content":"Watts, P.B. 2004. Physiology of difficult rock climbing. European Journal of Applied Physiology. 91, 4 (Apr. 2004), 361--372.","paperID":"None"},{"content":"Wulf, G., Shea, C. and Lewthwaite, R. 2010. Motor skill learning and performance: a review of influential factors. Medical Education. 44, 1 (2010), 75--84.","paperID":"None"},{"content":"Yim, J. and Graham, T.C.N. 2007. Using games to increase exercise motivation. Proceedings of the 2007 conference on Future Play (NY, NY, USA, 2007), 166--173.","paperID":"None"},{"content":"2015. Cities: Skylines. Paradox Interactive.","paperID":"None"},{"content":"Interactive Climbing wall: https://www.youtube.com/watch?v=kg2uRGf_04g.","paperID":"None"},{"content":"Level12 - Get the new climbing experience: https://www.youtube.com/watch?v=saKMcnE-BEg.","paperID":"None"},{"content":"2008. Little Big Planet. Sony Computer Entertainment.","paperID":"None"},{"content":"2012. Trials Evolution. Ubisoft.","paperID":"None"}],"abstract":"We present the design and evaluation of the Augmented Climbing Wall (ACW). The system combines computer vision and interactive projected graphics for motivating and instructing indoor wall climbing. We have installed the system in a commercial climbing center, where it has been successfully used by hundreds of climbers, including both children and adults. Our primary contribution is a novel movement-based game system that can inform the design of future games and augmented sports. We evaluate ACW based on three user studies (N=50, N=10, N=10) and further observations and interviews. We highlight three central themes of how digital augmentation can contribute to a sport: increasing diversity of movement and challenges, enabling user-created content in an otherwise risky environment, and enabling procedurally generated content. We further discuss how ACW represents an underexplored class of interactive systems, i.e., proximity interaction on wall-sized interactive surfaces, which presents novel human-computer interaction challenges.","title":"The Augmented Climbing Wall: High-Exertion Proximity Interaction on a Wall-Sized Interactive Surface","filename":"CHI16/p758","authors":["Raine Kajastila","Leo Holsti","Perttu Hämäläinen"],"conference":"CHI '16"}