{"paperId":2858236,"citation":[],"reference":[{"content":"2008. The effect of page layout on mental workload: A dual-task experiment. Computers in Human Behavior 24, 3 (2008), 1229--1245.","paperID":"None"},{"content":"Daniel Afergan, Evan M Peck, Erin T Solovey, Andrew Jenkins, Samuel W Hincks, Eli T Brown, Remco Chang, and Robert JK Jacob. 2014. Dynamic difficulty using brain metrics of workload. In CHI '14 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3797--3806. DOI: http://dx.doi.org/10.1145/2556288.2557230","paperID":"None"},{"content":"Hasan Ayaz. 2010. Functional Near Infrared Spectroscopy based Brain Computer Interface. PhD Thesis, Drexel University, Philadelphia, PA (2010).","paperID":"None"},{"content":"Hasan Ayaz, Meltem Izzetoglu, Scott Bunce, Terry Heiman-Patterson, and Banu Onaral. Detecting cognitive activity related hemodynamic signal for brain computer interface using functional near infrared spectroscopy. In Neural Engineering, 2007. CNE'07. 3rd International IEEE/EMBS Conference on. DOI: http://dx.doi.org/10.1109/CNE.2007.369680","paperID":"None"},{"content":"Richard W Backs and Kimberle A Seljos. 1994. Metabolic and cardiorespiratory measures of mental effort: the effects of level of difficulty in a working memory task. International Journal of psychophysiology 16, 1 (1994), 57--68. DOI: http://dx.doi.org/doi/10.1016/0167--8760(94)90042--6","paperID":"None"},{"content":"Michela Balconi, Elisabetta Grippa, and Maria Elide Vanutelli. 2015. What hemodynamic (fNIRS), electrophysiological (EEG) and autonomic integrated measures can tell us about emotional processing. Brain and cognition 95 (2015), 67--76.","paperID":"None"},{"content":"Jackson Beatty. 1982. Task-evoked pupillary responses, processing load, and the structure of processing resources. Psychological bulletin 91, 2 (1982), 276. DOI: http://dx.doi.org/doi/10.1037/0033--2909.91.2.276","paperID":"None"},{"content":"Katie Bessiere, Irina Ceaparu, Jonathan Lazar, John Robinson, and Ben Shneiderman. 2004. Social and psychological influences on computer user frustration. Media access: Social and psychological dimensions of new technology use (2004), 169--192.","paperID":"None"},{"content":"Nigel Bevan. 2001. International standards for HCI and usability. International journal of human-computer studies 55, 4 (2001), 533--552. DOI: http://dx.doi.org/10.1006/ijhc.2001.0483","paperID":"None"},{"content":"Nigel Bevan and Ian Curson. 1997. Methods for measuring usability. In Human-Computer Interaction INTERACT'97. Springer, 672--673.","paperID":"None"},{"content":"Margaret M Bradley and Peter J Lang. 1994. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of behavior therapy and experimental psychiatry 25, 1 (1994), 49--59. DOI: http://dx.doi.org/10.1016/0005--7916(94)90063--9","paperID":"None"},{"content":"Todd S Braver, Jonathan D Cohen, Leigh E Nystrom, John Jonides, Edward E Smith, and Douglas C Noll. 1997. A parametric study of prefrontal cortex involvement in human working memory. Neuroimage 5, 1 (1997), 49--62.","paperID":"None"},{"content":"Brad Cain. 2007. A review of the mental workload literature. Technical Report. DTIC Document. http://www.dtic.mil/dtic/tr/fulltext/u2/a474193.pdf","paperID":"None"},{"content":"Ann Chadwick-Dias, Michelle McNulty, and Tom Tullis. 2003. Web usability and age: how design changes can improve performance. In ACM SIGCAPH Computers and the Physically Handicapped. ACM, 30--37. DOI: http://dx.doi.org/10.1145/960201.957212","paperID":"None"},{"content":"C Collet, E Salvia, and C Petit-Boulanger. 2014. Measuring workload with electrodermal activity during common braking actions. Ergonomics 57, 6 (2014), 886--896. DOI: http://dx.doi.org/10.1080/00140139.2014.899627","paperID":"None"},{"content":"M Cope and David T Delpy. 1988. System for long-term measurement of cerebral blood and tissue oxygenation on newborn infants by near infra-red transillumination. Medical and Biological Engineering and Computing 26, 3 (1988), 289--294. DOI: http://dx.doi.org/10.1007/BF02447083","paperID":"None"},{"content":"Xu Cui, Signe Bray, and Allan L Reiss. 2010. Functional near infrared spectroscopy (NIRS) signal improvement based on negative correlation between oxygenated and deoxygenated hemoglobin dynamics. Neuroimage 49, 4 (2010), 3039--3046.","paperID":"None"},{"content":"Antonio R Damasio, BJ Everitt, and D Bishop. 1996. The somatic marker hypothesis and the possible functions of the prefrontal cortex [and discussion]. Philosophical Transactions of the Royal Society B: Biological Sciences 351, 1346 (1996), 1413--1420. DOI: http://dx.doi.org/10.1098/rstb.1996.0125","paperID":"None"},{"content":"Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. Advances in psychology 52 (1988), 139--183. DOI: http://dx.doi.org/10.1016/S0166--4115(08)62386--9","paperID":"None"},{"content":"Christian Herff, Dominic Heger, Ole Fortmann, Johannes Hennrich, Felix Putze, and Tanja Schultz. 2013. Mental workload during n-back task - quantified in the prefrontal cortex using fNIRS. Frontiers in human neuroscience 7 (2013). DOI: http://dx.doi.org/10.3389%2Ffnhum.2013.00935","paperID":"None"},{"content":"Leanne M Hirshfield, Erin Treacy Solovey, Audrey Girouard, James Kebinger, Robert JK Jacob, Angelo Sassaroli, and Sergio Fantini. 2009. Brain measurement for usability testing and adaptive interfaces: an example of uncovering syntactic workload with functional near infrared spectroscopy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2185--2194. DOI: http://dx.doi.org/10.1145/1518701.1519035","paperID":"None"},{"content":"Caroline Jarrett and Gerry Gaffney. 2009. Forms that work: Designing Web forms for usability. Morgan Kaufmann.","paperID":"None"},{"content":"Lorna Lines, Oluchi Ikechi, K Hone, and Tony Elliman. 2006. Online form design for older adults: Introducing web-automated personalisation. In Proceedings of HCI, the Web and the Older Population, workshop at HCI 2006.","paperID":"None"},{"content":"Luca Longo, Fabio Rusconi, Lucia Noce, and Stephen Barrett. 2012. The Importance of Human Mental Workload in Web Design. In WEBIST. 403--409.","paperID":"None"},{"content":"Horia A Maior, Matthew Pike, Sarah Sharples, and Max L Wilson. 2015. Examining the reliability of using fNIRS in realistic hci settings for spatial and verbal tasks. CHI '15 Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing 15 (2015), 3807--3816. DOI: http://dx.doi.org/10.1145/2702123.2702315","paperID":"None"},{"content":"Horia A Maior, Matthew Pike, Max L Wilson, and Sarah Sharples. 2014. Continuous detection of workload overload: An fnirs approach. Contemporary Ergonomics and Human Factors 2014: Proceedings of the international conference on Ergonomics & Human Factors 2014, Southampton, UK, 7--10 April 2014 (2014), 450. DOI:http://dx.doi.org/10.1201/b16742--79","paperID":"None"},{"content":"Valerie Mendoza and David G Novick. 2005. Usability over time. In Proceedings of the 23rd annual international conference on Design of communication: documenting & designing for pervasive information. ACM, 151--158. DOI: http://dx.doi.org/10.1145/1085313.1085348","paperID":"None"},{"content":"Erika Molteni, Michele Butti, Anna M Bianchi, and Gianluigi Reni. 2008. Activation of the prefrontal cortex during a visual n-back working memory task with varying memory load: a near infrared spectroscopy study. In Engineering in Medicine and Biology Society, 2008. EMBS 2008. 30th Annual International Conference of the IEEE. IEEE, 4024--4027. DOI: http://dx.doi.org/10.1109/IEMBS.2008.4650092","paperID":"None"},{"content":"Jakob Nielsen and Jonathan Levy. 1994. Measuring usability: preference vs. performance. Commun. ACM 37, 4 (1994), 66--75. DOI: http://dx.doi.org/10.1145/175276.175282","paperID":"None"},{"content":"Jakob Nielsen and Rolf Molich. 1990. Heuristic evaluation of user interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 249--256. DOI: http://dx.doi.org/10.1145/97243.97281","paperID":"None"},{"content":"Evan M M Peck, Beste F Yuksel, Alvitta Ottley, Robert JK Jacob, and Remco Chang. 2013. Using fNIRS brain sensing to evaluate information visualization interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 473--482. DOI:http://dx.doi.org/10.1145/2470654.2470723","paperID":"None"},{"content":"Reinhard Pekrun, Thomas Goetz, Lia M Daniels, Robert H Stupnisky, and Raymond P Perry. 2010. Boredom in achievement settings: Exploring control-value antecedents and performance outcomes of a neglected emotion. Journal of Educational Psychology 102, 3 (2010), 531. DOI: http://dx.doi.org/doi/10.1037/a0019243","paperID":"None"},{"content":"Matthew Pike, Horia A Maior, Martin Porcheron, Sarah Sharples, and Max L Wilson. 2014. Measuring the Effect of Think Aloud Protocols on Workload using fNIRS. In CHI '14 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. DOI: http://dx.doi.org/10.1145/2556288.2556974","paperID":"None"},{"content":"Gary B Reid and Thomas E Nygren. 1988. The subjective workload assessment technique: A scaling procedure for measuring mental workload. Advances in psychology 52 (1988), 185--218.","paperID":"None"},{"content":"Sergio Sayago and Josep Blat. 2007. Some Aspects of Designing Accessible Online Forms for the Young Elderly.. In WEBIST (2). 13--17.","paperID":"None"},{"content":"Sergio Sayago, José-María Guijarro, and Josep Blat. 2012. Selective attention in web forms: an exploratory case study with older people. Behaviour & Information Technology 31, 2 (2012), 171--184. DOI: http://dx.doi.org/10.1080/01449291003767920","paperID":"None"},{"content":"M.C. Schraefel, Maria Karam, and Shengdong Zhao. 2003. Listen to the Music: Audio Preview Cues for Exploration of Online Music.. In Interact 2003 - Bringing the Bits Together. http://eprints.soton.ac.uk/258800/ Event Dates: Sept 1--5.","paperID":"None"},{"content":"Yu Shi, Natalie Ruiz, Ronnie Taib, Eric Choi, and Fang Chen. 2007. Galvanic skin response (GSR) as an index of cognitive load. In CHI'07 extended abstracts on Human factors in computing systems. ACM, 2651--2656. DOI: http://dx.doi.org/10.1145/1240866.1241057","paperID":"None"},{"content":"Ben Shneiderman. 1992. Designing the user interface: strategies for effective human-computer interaction. Vol. 3. Addison-Wesley Reading, MA. 60--63 pages.","paperID":"None"},{"content":"Erin Treacy Solovey, Audrey Girouard, Krysta Chauncey, Leanne M Hirshfield, Angelo Sassaroli, Feng Zheng, Sergio Fantini, and Robert JK Jacob. 2009. Using fNIRS brain sensing in realistic HCI settings: experiments and guidelines. In Proceedings of the 22nd annual ACM symposium on User interface software and technology. ACM, 157--166. DOI: http://dx.doi.org/10.1145/1622176.1622207","paperID":"None"},{"content":"John Stemberger, Robert S Allison, and Thomas Schnell. 2010. Thermal imaging as a way to classify cognitive workload. In Computer and Robot Vision (CRV), 2010 Canadian Conference On. IEEE, 231--238. DOI: http://dx.doi.org/10.1109/CRV.2010.37","paperID":"None"},{"content":"John Sweller. 1988. Cognitive load during problem solving: Effects on learning. Cognitive science 12, 2 (1988), 257--285. DOI: http://dx.doi.org/10.1016/0364-0213(88)90023--7","paperID":"None"},{"content":"Pamela S Tsang and Velma L Velazquez. 1996. Diagnosticity and multidimensional subjective workload ratings. Ergonomics 39, 3 (1996), 358--381.","paperID":"None"},{"content":"John R Wilson and Sarah Sharples. 2015. Evaluation of human work. CRC Press. 521--522 pages.","paperID":"None"},{"content":"Luke Wroblewski. 2008. Web form design: filling in the blanks. Rosenfeld Media.","paperID":"None"}],"abstract":"Amongst the many tasks in our lives, we encounter web forms on a regular basis, whether they are mundane like registering for a website, or complex and important like tax returns. There are many aspects of Usability, but one concern for user interfaces is to reduce mental workload and error rates. Whilst most assessment of mental workload is subjective and retrospective reporting by users, we examine the potential of functional Near Infrared Spectroscopy (fNIRS) as a tool for objectively and concurrently measuring mental workload during usability testing. We use this technology to evaluate the design of three different form layouts for a car insurance claim process, and show that a form divided into subforms increases mental workload, contrary to our expectations. We conclude that fNIRS is highly suitable for objectively examining mental workload during usability testing, and will therefore be able to provide more detailed insight than summative retrospective assessments. Further, for the fNIRS community, we show that the technology can easily move beyond typical psychology tasks, and be used for more natural study tasks.","title":"Using fNIRS in Usability Testing: Understanding the Effect of Web Form Layout on Mental Workload","filename":"CHI16/p4011","authors":["Kristiyan Lukanov","Horia A. Maior","Max L. Wilson"],"conference":"CHI '16"}