{"paperId":2858302,"citation":[],"reference":[{"content":"Emmanuel Bigand. 1997. Perceiving musical stability: The effect of tonal structure, rhythm, and musical expertise. Journal of Experimental Psychology: Human Perception and Performance. (1997). http://psycnet.apa.org/journals/xhp/23/3/808/","paperID":"None"},{"content":"Daniel Cesarini, Thomas Hermann, and Bodo E Ungerechts. 2014. An Interactive Sonification System for Swimming Evaluated by Users. In SoniHED- Conference on Sonification of Health and Enviromental Data.","paperID":"None"},{"content":"Tobias Großhauser, Bettina Blasing, Corinna Spieth, and Thomas Hermann. 2012. Wearable Sensor-Based Real-Time Sonification of Motion and Foot Pressure in Dance Teaching and Training. Journal of the Audio Engineering Society 60, 7/8 (2012), 589. http://pub.uni-bielefeld.de/publication/2528002","paperID":"None"},{"content":"IASP. 2014. Unrelieved pain is a major global healthcare problem. (2014). http://www.efic.org/userfiles/PainGlobalHealthcareProblem.pdf","paperID":"None"},{"content":"Katherine Finlay, 2014. Music-induced analgesia in chronic pain: Efficacy and assessment through a primary-task paradigm. Psychology of Music,","paperID":"None"},{"content":"Gunther Knoblich and Bruno H. Repp. 2009. Inferring agency from sound. Cognition 111, 2 (May 2009), 248- 262. DOI http://dx.doi.org/10.1016/j.cognition.2009.02.007","paperID":"None"},{"content":"Amir Lahav, Elliot Saltzman and Gottfried Schlaug. 2007. Action representation of sound: audiomotor recognition network while listening to newly acquired actions. The Journal of Neuroscience: The Official Journal of the Society for Neuroscience, 27(2), 308-14.","paperID":"None"},{"content":"Fumiko Maeda, Ryota Kanai, and Shinsuke Shimojo. 2004. Changing pitch induced visual motion illusion. Current biology 14, 23 (Dec. 2004), R990-1. DOI: http://dx.doi.org/10.1016/j.cub.2004.11.018","paperID":"None"},{"content":"Yoky Matsuoka, Sonya Allin, & Roberta Klatzky. 2002. \"The tolerance for visual feedback distortions in a virtual environment\". Physiology & Behavior.","paperID":"None"},{"content":"Daniel Mullensiefen, Bruno Gingras, Jason Musil, and Lauren Stewart. 2014. The musicality of non-musicians: an index for assessing musical sophistication in the general population. PloS one 9, 2 (Jan. 2014), e89642. DOI: http://dx.doi.org/10.1371/journal.pone.0089642","paperID":"None"},{"content":"Mark Nazemi, Maryam Mobini, Tyler Kinnear, Diane Gromala, 2013, \"Soundscapes: A prescription for managing anxiety in a clinical setting,\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, Paris, France","paperID":"None"},{"content":"Joseph W. Newbold, Nadia Bianchi-Berthouze, Nicolas E. Gold, and Amanda Williams. 2015. Musically Informed Sonification for Self-Directed Chronic Pain Physical Rehabilitation. In Sound and Music Computing.","paperID":"None"},{"content":"Nina Schaffert, Klaus Mattes, and Alfred Oliver Effenberg. 2011. The sound of rowing stroke cycles as acoustic feedback. In Proceedings of the 17th International Conference on Auditory Display (ICAD 2011).","paperID":"None"},{"content":"David Sears, William E Caplin, and Stephen McAdams. 2014. Perceiving the Classical Cadence. Music Perception: An Interdisciplinary Journal 31, 5 (2014), 397-417.","paperID":"None"},{"content":"Aneesha Singh, Annina Klapper, Jinni Jia, Antonio Fidalgo, Ana Tajadura-Jimenez, Natalie Kanakam, Nadia Bianchi-Berthouze, and Amanda Williams. 2014. Motivating People with Chronic Pain to Do Physical Activity: Opportunities for Technology Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2803-2812. DOI: http://dx.doi.org/10.1145/2556288.2557268","paperID":"None"},{"content":"Aneesha Singh, Davide Pollarolo, Stefano Piana, Gualtiero Volpe, Ana Tajadura-Jiménez, Giovanna Varni, Hane Aung, Isaac Pouw, Amanda Williams, Antonio Camurri, and Nadia Berthouze. 2015. Go with the flow: Tracking, Analysis and Sonification of Movement and Breathing to Build Confidence in Activity Despite Chronic Pain. HCI 30 (2015).","paperID":"None"},{"content":"Kevin M Smith and David Claveau. 2014. The Sonification and Learning of Human Motion. 20th International Conference on Auditory Display (ICAD 2014) (2014). http://smartech.gatech.edu/handle/1853/52049","paperID":"None"},{"content":"Ana Tajadura-Jiménez, Maria Basia, Ophelia Deroy, Merle Fairhurst, Nicolai Marquardt, and Nadia Bianchi-Berthouze. 2015. As light as your footsteps: altering walking sounds to change perceived body weight, emotional state and gait. (2015), 2943-2952.","paperID":"None"},{"content":"Ana Tajadura-Jiménez, Nadia Berthouze, Enrico Furfaro, and Frederic Bevilacqua. 2015. Sonification of virtual and real surface tapping: evaluation of behavior changes, surface perception and emotional indices. IEEE MultiMedia (2015), 1-1. DOI: http://dx.doi.org/10.1109/MMUL.2015.30","paperID":"None"},{"content":"Ana Tajadura-Jiménez, Manos Tsakiris, Torsten Marquardt, and Nadia Bianchi-Berthouze. 2015. Action sounds update the mental representation of arm dimension: contributions of kinaesthesia and agency. Frontiers in psychology 6 (Jan. 2015), 689. DOI: http://dx.doi.org/10.3389/fpsyg.2015.00689","paperID":"None"},{"content":"Barbara Tillmann, Emmanuel Bigand, and Francois Madurell. 1998. Local versus global processing of harmonic cadences in the solution of musical puzzles. (1998). DOI: http://dx.doi.org/10.1007/s004260050022","paperID":"None"},{"content":"Dennis C. Turk and Thomas E. Rudy. 1987. IASP taxonomy of chronic pain syndromes: preliminary assessment of reliability. Pain 30, 2 (Aug. 1987), 177-189. DOI: http://dx.doi.org/10.1016/0304--3959(87)91073--6","paperID":"None"},{"content":"Michel Vallieres, Daphne Tan, William E Caplin, and Stephen McAdams. 2009. Perception of intrinsic formal functionality: An empirical investigation of Mozarts materials. Journal of Interdisciplinary Music Studies 3, 1--2 (2009), 17-43.","paperID":"None"},{"content":"Katharina Vogt, D Pirro, and Ingo Kobenz. 2009. Physiosonic-movement sonification as auditory feedback. In Proceedings of the 15th International Conference on Auditory Display, Copenhagen, Denmark. 1-7. http://iem.kug.ac.at/fileadmin/media/iem/projects/2009/physio.pdf","paperID":"None"},{"content":"Richard Isaac Wallis, Todd Ingalls, Thanassis Rikakis, Loren Olsen, Yinpeng Chen, Weiwei Xu, and Hari Sundaram. 2007. Real-time sonification movement for an immersive stroke rehabilitation environment. In Proceedings of the 13th International Conference on Auditory Display (ICAD 2007). 497-503. http://www.icad.org/node/2460","paperID":"None"},{"content":"Steve R Woby, Martin Urmston, and Paul J Watson. 2007. Self-efficacy mediates the relation between painrelated fear and outcome in chronic low back pain patients. European journal of pain (London, England) 11, 7 (Oct. 2007), 711-8. DOI: http://dx.doi.org/10.1016/j.ejpain.2006.10.009","paperID":"None"},{"content":"Daniel M. Wolpert and Zoubin Ghahramani. 2000. Computational principles of movement neuroscience. Nature neuroscience 3 Suppl (Nov. 2000), 1212-7. DOI: http://dx.doi.org/10.1038/81497","paperID":"None"}],"abstract":"In self-directed chronic pain physical rehabilitation it is important that the individual can progress as physical capabilities and confidence grow. However, people with chronic pain often struggle to pass what they have identified as safe boundaries. At the same time, over-activity due to the desire to progress fast or function more normally, may lead to setbacks. We investigate how musically-informed movement sonification can be used as an implicit mechanism to both avoid overdoing and facilitate progress during stretching exercises. We sonify an end target-point in a stretch exercise, using a stable sound (i.e., where the sonification is musically resolved) to encourage movements ending and an unstable sound (i.e., musically unresolved) to encourage continuation. Results on healthy participants show that instability leads to progression further beyond the target-point while stability leads to a smoother stop beyond this point. We conclude discussing how these findings should generalize to the CP population.","title":"Musically Informed Sonification for Chronic Pain Rehabilitation: Facilitating Progress & Avoiding Over-Doing","filename":"CHI16/p5698","authors":["Joseph W. Newbold","Nadia Bianchi-Berthouze","Nicolas E. Gold","Ana Tajadura-Jiménez","Amanda CdC Williams"],"conference":"CHI '16"}