{"paperId":2858492,"reference":[{"content":"W. Lance Bennett (ed.). 2008. Civic life online: learning how digital media can engage youth. MIT Press, Cambridge, Mass.","paperID":"None"},{"content":"Marlene Berg, Emil Coman, and Jean J. Schensul. 2009. Youth Action Research for Prevention: A Multi-level Intervention Designed to Increase Efficacy and Empowerment Among Urban Youth. American Journal of Community Psychology 43, 3--4: 345-359. http://doi.org/10.1007/s10464-009--9231--2","paperID":"None"},{"content":"Hugh Beyer and Karen Holtzblatt. 1998. Contextual design: defining customer-centered systems. Morgan Kaufmann, San Francisco, Calif.","paperID":"None"},{"content":"Leticia Bode. 2012. Facebooking It to the Polls: A Study in Online Social Networking and Political Behavior. Journal of Information Technology & Politics 9, 4: 352-369. http://doi.org/10.1080/19331681.2012.709045","paperID":"None"},{"content":"Petter B. Brandtzæg and Henry Mainsah. 2012. Designing for youth civic engagement in social media. Proceedings of IADIS 2012, IADIS Press, 65-73.","paperID":"None"},{"content":"Juliet M. Corbin and Anselm L. Strauss. 2008. Basics of qualitative research: techniques and procedures for developing grounded theory. Sage Publications, Inc, Los Angeles, Calif.","paperID":"None"},{"content":"Shelly D. Farnham, David Keyes, Vicky Yuki, and Chris Tugwell. 2013. Modeling Youth Civic Engagement in a New World of Networked Publics. AAAI Conference on Weblogs and Social Media, 165-174.","paperID":"None"},{"content":"Vindu Goel. 2015. Facebook to Test Emoji as Reaction Icons - The New York Times. Retrieved January 8, 2016 from http://www.nytimes.com/2015/10/09/technology/facebook-to-test-emoji-as-reaction-icons.html?_r=1","paperID":"None"},{"content":"Robert S. Gold and Kathleen R. Miner. 2002. Report of the 2000 Joint Committee on Health Education and Promotion Terminology. Journal of School Health 72, 1: 3-7. http://doi.org/10.1111/j.1746--1561.2002.tb06501.x","paperID":"None"},{"content":"B. A. Israel, B. Checkoway, A. Schulz, and M. Zimmerman. 1994. Health education and community empowerment: conceptualizing and measuring perceptions of individual, organizational, and community control. Health Education Quarterly 21, 2: 149-170.","paperID":"None"},{"content":"1Shiriki Kumanyika and Sonya Grier. 2006. Targeting Interventions for Ethnic Minority and Low-Income Populations. The Future of Children 16, 1: 187-207. http://doi.org/10.1353/foc.2006.0005","paperID":"None"},{"content":"Timothy Macafee and J.J. De Simone. 20 Killing the Bill Online? Pathways to Young People's Protest Engagement via Social Media. Cyberpsychology, Behavior, and Social Networking 15, 11: 579-584. http://doi.org/10.1089/cyber.2012.0153","paperID":"None"},{"content":"Christopher M. Mascaro and Sean P. Goggins. 2011. Brewing up citizen engagement: the coffee party on facebook. Proceedings of the 5th International Conference on Communities and Technologies, ACM Press, 11. http://doi.org/10.1145/2103354.2103357","paperID":"None"},{"content":"Matthew H. Morton and Paul Montgomery. 2011. Youth empowerment programs for improving self-efficacy and self-esteem of adolescents. The Campbell Collaboration. Retrieved September 25, 2015 from http://campbellcollaboration.org/lib/project/114/","paperID":"None"},{"content":"Pew Research Center. 20 Teens, Social Media & Technology Overview 2015. Retrieved from http://www.pewinternet.org/files/2015/04/PI_TeensandTech_Update2015_0409151.pdf","paperID":"None"},{"content":"Evelyn M. Rusli. 2014. New Apps Whisper and Secret Cater to a Craving to Dish Freely. Retrieved from http://www.wsj.com/news/articles/SB10001424052702304703804579379142655049348","paperID":"None"},{"content":"Malin Sveningsson. 2014. \"I don't like it and I think it's useless, people discussing politics on Facebook\": Young Swedes' understandings of social media use for political discussion. Cyberpsychology: Journal of Psychosocial Research on Cyberspace 8, 3. http://doi.org/10.5817/CP2014--3--8","paperID":"None"},{"content":"Rosemary Thackeray and MaryAnne Hunter. 2010. Empowering Youth: Use of Technology in Advocacy to Affect Social Change. Journal of Computer-Mediated Communication 15, 4: 575-591. http://doi.org/10.1111/j.1083--6101.2009.01503.x","paperID":"None"},{"content":"David R. Williams and Pamela B. Jackson. 2005. Social Sources of Racial Disparities in Health. Health Affairs 24, 2: 325-334. http://doi.org/10.1377/hlthaff.24.2.325","paperID":"None"},{"content":"World Health Organization. 2008. Closing the gap in a generation. Retrieved from http://apps.who.int/iris/bitstream/10665/43943/1/9789241563703_eng.pdf","paperID":"None"},{"content":"2Michael Xenos, Ariadne Vromen, and Brian D. Loader. 2014. The great equalizer? Patterns of social media use and youth political engagement in three advanced democracies. Information, Communication & Society 17, 2: 151-167. http://doi.org/10.1080/1369118X.2013.871318","paperID":"None"}],"citation":[],"abstract":"Social networking applications (SNAs) have been touted as promising platforms for activism: they provide a platform by which voices can be heard and collective action mobilized. Yet, little work has studied the suitability of existing SNAs for enabling youth advocacy efforts. We conducted an intensive 5-week qualitative study with 10th graders to understand how existing SNAs support and inhibit youth advocacy. We contribute to the field of Human-Computer Interaction (HCI) by explicating several themes regarding the barriers youth face when using SNAs for advocacy, features in existing SNAs that are not suitable for youth advocacy, and the peer pressure youth perceive when advocating for serious issues in these environments. We conclude with recommendations for how existing SNA features could be reformed to better support youth advocacy.","title":"Youth Advocacy in SNAs: Challenges for Addressing Health Disparities","filename":"CHI16/p3620","authors":["Farnaz Irannejad Bisafar","Herman Saksono","Priscilla Baquerizo","Dana Moore","Andrea G. Parker"],"conference":"CHI '16"}