{"paperId":2858439,"citation":[],"reference":[{"content":"Tetsuaki Baba, Taketoshi Ushiama, and Kiyoshi Tomimatsu. 2008. Freqtric drums: a musical instrument that uses skin contact as an interface. In Proceedings of the 7th International Conference on New Interfaces for Musical Expression (NIME '07), 386--387.","paperID":"None"},{"content":"Shen Hsing A. Chen and Vera Bernard-Opitz. 1993. Comparison of personal and computer-assisted instruction for children with autism. Mental Retardation 31, 6: 368--376.","paperID":"None"},{"content":"Kenneth Mark Colby. 1973. The rationale for computer-based treatment of language difficulties in nonspeaking autistic children. J Autism and Childhood Schizophrenia 3, 3: 254--260.","paperID":"None"},{"content":"Lesley Cullen and Julie Barlow. 2002. \"Kiss, cuddle, squeeze\": the experiences and meaning of touch among parents of children with autism attending a touch therapy programme. J Child Health Care 6, 3: 171181.","paperID":"None"},{"content":"Paul Dietz and Darren Leigh. 2001. Diamondtouch: a multi-user touch technology. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01), 219--226.","paperID":"None"},{"content":"Kenji Doi and Tokuhisa Nishimura. 2005. Highreliability communication technology using human body as transmission medium. Matsushita Electric Works, Ltd. Technical Rep 53, 3: 72--76. (Japanese)","paperID":"None"},{"content":"Angelica Escalona, Tiffany Field, Jacqueline Nadel, and Brenda Lundy. 2002. Brief report: imitation effects on children with autism. J Autism and Developmental Disorders 32, 2: 141--144.","paperID":"None"},{"content":"Lizbeth Escobedo, David H. Nguyen, LouAnne Boyd, Sen H. Hirano, Alejandro Rangel, Daniel GarciaRosas, Monica Tentori, and Gillian R. Hayes. 2012. Mosoco: a mobile assistive tool to support children with autism practicing social skills in real-life situations. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '12), 2589--2598.","paperID":"None"},{"content":"Tiffany Field. 2002. Infants' need for touch. Human Development 45, 2: 100--103.","paperID":"None"},{"content":"Tiffany Field, Tory Field, Chris Sanders, and Jacqueline Nadel. 2001. Children with autism display more social behavior after repeated imitation sessions. Autistic Soc 5, 3: 317--323.","paperID":"None"},{"content":"Eynat Gal, Nirit Bauminger, Dina Goren-Bar, Fabio Pianesi, Oliviero Stock, Massimo Zancanaro, and Patrice L. (Tamar) Weiss.2009. Enhancing social communication of children with high-functioning autism through a co-located interface. J HumanCentered Sys 24, 1: 75--84.","paperID":"None"},{"content":"Leonardo Giusti, Massimo Zancanaro, Eynat Gal, and Patrice L. (Tamar) Weiss. 2011. Dimensions of collaboration on a tabletop interface for children with autism spectrum disorder. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '11), 3295--3304.","paperID":"None"},{"content":"Tobias Grosse-Puppendahl, Sebastian Herber, Raphael Wimmer, Frank Englert, Sebastian Beck, Julian von Wilmsdorff, Reiner Wichert, and Arjan Kuijper. 2014. Capacitive near-field communication for ubiquitous interaction and perception. In Proceedings of the 2014 ACM International Conference on Pervasive and Ubiquitous Computing (UbiComp '14), 231--242.","paperID":"None"},{"content":"Keisuke Hachisuka, Yusuke Terauchi, Yoshinori Kishi, Ken Sasaki, Terunao Hirota, Hiroshi Hosaka, Katsuyuki Fujii, Masaharu Takahashi, and Koichi Ito. 2006. Simplified circuit modeling and fabrication of intrabody communication devices. Sensors and Actuators A: Physical 130--131: 322--330.","paperID":"None"},{"content":"Chris Harrison, Hrvoje Benko, and Andrew D. Wilson. 2011. Omnitouch: wearable multitouch interaction everywhere. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11) 441--450.","paperID":"None"},{"content":"Chris Harrison, Desney Tan, and Dan Morris. 2010. Skinput: appropriating the body as an input surface. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '10), 453--462.","paperID":"None"},{"content":"Mikael Heimann, Keith E. Nelson, Tomas Tjus, and Christopher Gillberg. 1995. Increasing reading and communication skills in children with autism through an interactive multimedia computer program. J Autism and Developmental Disorders 25, 5: 459--480.","paperID":"None"},{"content":"Steve Hodges, Shahram Izadi, Alex Butler, Alban Rrustemi, and Bill Buxton. 2007. Thinsight: versatile multi-touch sensing for thin form-factor display. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07), 259--268.","paperID":"None"},{"content":"Juan Pablo Hourcade, Stacy R. Williams, Ellen A. Miller, Kelsey E. Huebner, and Lucas J. Liang. 2013. Evaluation of tablet apps to encourage social interaction in children with autism spectrum disorders. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '13), 3197--3206.","paperID":"None"},{"content":"Bibi Huskens, Annemiek Palmen, Marije Van der Werff, Tino Lourens, and Emilia Barakova. 2015. Improving collaborative play between children with autism spectrum disorders and their siblings: the effectiveness of a robot-mediated intervention based on lego therapy. J Autism and Developmental Disorders 45, 11: 3746--3755.","paperID":"None"},{"content":"International Commission on Non-Ionizing Radiation Protection. 1998. Guidelines for limiting exposure to time-varying electric, magnetic, and electromagnetic fields (up to 300 GHz). Health Physics 74, 4: 494--522.","paperID":"None"},{"content":"Ryo Kodama, and Hiroyuki Kajimoto. 2014. EM Package: augmenting robotic intimate space interaction using EM field fluctuation sensing. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '14), 2061--2066.","paperID":"None"},{"content":"Henrik Hautop Lund, Thomas Klitbo, and Carsten Jessen. 2005. Playware technology for physically activating play. Artificial Life and Robotics 9, 4: 165174.","paperID":"None"},{"content":"Nobuyuki Matsushita, Shigeru Tajima, Yuji Ayatsuka, and Jun Rekimoto. 2000. Wearable key: device for personalizing nearby environment. In Proceedings of the 4th International Symposium on Wearable Computers (ISWC '00), 119--126.","paperID":"None"},{"content":"Monique Moore and Sandra Calvert. 2000. Brief report: vocabulary acquisition for children with autism: teacher or computer instruction. J Autism and Developmental Disorders 30, 4, 359--362.","paperID":"None"},{"content":"Dairoku Muramatsu, Takahiko Yamamoto, Kohji Koshiji, and Ken Sasaki. 2012. Study on structural design of transmitter electrodes and surrounding electric field for human body communication based on impedance matching. J Life Support Engineering 24, 7: 70--78. (Japanese)","paperID":"None"},{"content":"Albert Ng, Julian Lepinski, Daniel Wigdor, Steven Sanders, and Paul Dietz. 2012. Designing for lowlatency direct-touch input. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12), 453--464.","paperID":"None"},{"content":"Marion V. Panyan. 1984. Computer technology for autistic students. J Autism and Disorders 14, 4: 375382.","paperID":"None"},{"content":"E. Michelle Pardew and Carol Bunse. 2005. Enhancing interaction through positive touch. Young Exceptional Children 8, 2: 21--29.","paperID":"None"},{"content":"Duck Gun Park, Jin Kyung Kim, Jin Bong Sung, Jung Hwan Hwang, Chang Hee Hyung, and Sung Weon Kang. 2006. Tap: touch-and-play. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '06), 677--680.","paperID":"None"},{"content":"Esben Warming Pedersen and Kasper Hornbæk. 2014. Expressive touch: studying tapping force on tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '14), 421--430.","paperID":"None"},{"content":"Sally J. Rogers, Susan Hepburn, and Elizabeth Wehner. 2003. Parent reports of sensory symptoms in toddlers with autism and those with other developmental disorder. J Autism and Developmental Disorders 33, 6: 631--642.","paperID":"None"},{"content":"Ilya Rosenberg and Ken Perlin. 2009. The unmousepad: an interpolating multi-touch forcesensing input pad. ACM Transactions on Graphics 28, 3, 65.","paperID":"None"},{"content":"Munehiko Sato, Ivan Poupyrev, and Chris Harrison. 2012. Touché: enhancing touch interaction on humans, screens, liquids, and everyday objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '12), 483--492.","paperID":"None"},{"content":"Miriam Silver, and Peter Oakes. 2001. Evaluation of a new computer intervention to teach people with autism or asperger syndrome to recognize and predict emotions in others. Autism 5, 3: 299--316.","paperID":"None"},{"content":"James Keng Soon Teh, Adrian David Cheok, Roshan L. Peiris, Yongsoon Choi, Vuong Thuong, and Sha Lai. 2008. Huggy pajama: a mobile parent and child hugging communication system. In Proceedings of the 7th international conference on Interaction design and children (IDC '08), 250--257.","paperID":"None"},{"content":"Scott D. Tomchek, and Winnie Dunn. 2007. Sensory processing in children with and without autism: a comparative study using the short sensory profile. American J. Occupational Therapy 61, 2: 190--200.","paperID":"None"},{"content":"Lorna Wing. 1996. The Autistic Spectrum: A Guide for Parents and Professionals. Constable and Robinson.","paperID":"None"},{"content":"Thomas Guthrie Zimmerman. 1995. Personal area networks (PAN): near-field intra-body communication. Master's thesis. Massachusetts Institute of Technology, Cambridge, MA.","paperID":"None"},{"content":"Thomas Guthrie Zimmerman. 1996. Personal-area networks: near-field intrabody communication. IBM Systems J 35, 3.4: 609--614.","paperID":"None"}],"abstract":"We present EnhancedTouch, a novel bracelet-type wearable device for facilitating human-human physical touch. In particular, we aim to support children with autism spectrum disorder (ASD), who often exhibit particular communication patterns, such as lack of physical touch. EnhancedTouch is a unique device that can measure human-human touch events and provide visual feedback to augment touch interaction. We employ personal area network (PAN) technology for communication with partner devices via modulated electrical current flowing through the users' hands. Our user study show that the visual feedback provided by the developed bracelet motivates children with ASD to touch one another. Moreover, EnhancedTouch offers a function to record the time and duration of a touch event as well as the identity of the touched person. This allows us to identify and evaluate intervention based on physical touch in a quantitative manner.","title":"EnhancedTouch: A Smart Bracelet for Enhancing Human-Human Physical Touch","filename":"CHI16/p1282","authors":["Kenji Suzuki","Taku Hachisu","Kazuki Iida"],"conference":"CHI '16"}