{"paperId":2858408,"citation":[],"reference":[{"content":"Abadi, D., et al. The Design of the Borealis Stream Processing Engine. In Proc. CIDR 2005, 277--289.","paperID":"None"},{"content":"Aigner, W., Miksch, S., Schumann, H., & Tominski, C. Visualization of time-oriented data. Springer Science & Business Media (2011).","paperID":"None"},{"content":"Amsterdamer, Y., Davidson, S.B., Deutch, D., Milo, T., Stoyanovich, J., Tannen, V. Putting Lipstick on Pig: Enabling Database-style Workflow Provenance. In Proc. VLDB Endow. 5, 4 (2011), 346-357.","paperID":"None"},{"content":"Babcock, B., Babu, S., Datar, M., Motwani, R., and Widom, J. Models and issues in data stream systems. In Proc. PODS 2002, ACM Press (2002), 1--16.","paperID":"None"},{"content":"Babu, S., and Widom, J. Continuous Queries over Data Streams. SIGMOD Record 30, 3 (2001), 109--120.","paperID":"None"},{"content":"Cao, J., Rector, K., Park, T.H., Fleming, S. D., Burnett, M., and Wiedenbeck, S. A Debugging Perspective on End-User Mashup Programming. In Proc. IEEE Symp. on VL/HCC 2010, ACM (2010), .","paperID":"None"},{"content":"Carney, D., et. al. Monitoring streams: a new class of data management applications. In Proc. VLDB 2002, VLDB Endowment (2002), 215--226.","paperID":"None"},{"content":"Chandramouli, B., et al. Trill: A High-performance Incremental Query Processor for Diverse Analytics. In Proc VLDB Endow 8 (2014), 401-412.","paperID":"None"},{"content":"DeLine, R., Fisher, D., Chandramouli, B., Goldstein, J., Barnett, M., Terwilliger, J. F. and Wernsing, J. Tempe: Live Scripting for Live Data, In Proc. of IEEE Symp. on VL/HCC 2015, ACM (2015).","paperID":"None"},{"content":"De Pauw, W., Leţia, M., Gedik, B., Andrade, H., Frenkiel, A., Pfeifer, M., and Sow, D. Visual Debugging for Stream Processing Applications. In Proc. RV, Springer-Verlag (2010), 18--35.","paperID":"None"},{"content":"Fails, J. A., Karlson, A., Shahamat, L. & Shneiderman, B. A Visual Interface for Multivariate Temporal Data: Finding Patterns of Events across Multiple Histories. in Visual Analytics Science And Technology, 2006 IEEE Symposium On 167-174 (2006).","paperID":"None"},{"content":"Fisher, D., DeLine, R., Czerwinski, M., and Drucker, S. 2012. Interactions with big data analytics. interactions 19, 3 (May 2012), 50--59.","paperID":"None"},{"content":"Glavic, B., Esmaili, K.S., Fischer, P.M., Tatbul, N. The Case for Fine-Grained Stream Provenance. In Proc. BTW Workshops 2011.","paperID":"None"},{"content":"Glavic, B., Esmaili, K.S., Fischer, P.M., Tatbul, N. Ariadne: managing fine-grained provenance on data streams. In Proc. DEBS 2013, ACM (2013), 39--50.","paperID":"None"},{"content":"Gschwandtner, T., Aigner, W., Kaiser, K., Miksch, S., Seyfang, A. CareCruiser: exploring and visualizing plans, events, and effects interactively.\" Pacific Visualization Symposium (PacificVis), IEEE Computer Society (2011), 43--50.","paperID":"None"},{"content":"Huq, M.R., Wombacher, A., and Apers, P.M. Inferring fine-grained data provenance in stream data processing: reduced storage cost, high accuracy. In Proc. DEXA 2011, Springer Berlin Heidelberg (2011), 118--127.","paperID":"None"},{"content":"Ikeda, R., Park, H., and Widom, J. Provenance for Generalized Map and Reduce Workflows. In Proc. CIDR 2011.","paperID":"None"},{"content":"Jin, J. & Szekely, P. Interactive querying of temporal data using a comic strip metaphor. in 2010 IEEE Symposium on Visual Analytics Science and Technology (VAST) 163-170 (2010).","paperID":"None"},{"content":"Kandel, S., Paepcke, A., Hellerstein, J. M., and Heer, J. (2012). Enterprise data analysis and visualization: An interview study. Visualization and Computer Graphics, IEEE Transactions on, 18, 12 (2012), 2917--2926.","paperID":"None"},{"content":"Ko, A.J. and Myers, B.A. Finding Causes of Program Output with the Java Whyline. In Proc. CHI 2009, ACM (2009), 1569--1578.","paperID":"None"},{"content":"Kosara, R., and Miksch, S. Metaphors of movement: a visualization and user interface for time-oriented, skeletal plans. Artificial Intelligence in Medicine 22 (2001), 111--131.","paperID":"None"},{"content":"Krause, J., Perer, A. & Stavropoulos, H. Supporting Iterative Cohort Construction with Visual Temporal Queries. IEEE Transactions on Visualization and Computer Graphics 22, 91-100 (2016).","paperID":"None"},{"content":"Lessa, D., Jayaraman, B., and Chomicki, J. A Temporal Data Model for Program Debugging. In Proc. DBPL 2011.","paperID":"None"},{"content":"Madden, S. and Franklin, M.J. Fjording the Stream: An Architecture for Queries over Streaming Sensor Data. In Proc. ICDE 2002, IEEE Computer Society (2002), 555.","paperID":"None"},{"content":"Meijer, E. The world according to LINQ. Comm. ACM 54, 10 (October 2011), 45--51.","paperID":"None"},{"content":"Monroe, M. et al. The Challenges of Specifying Intervals and Absences in Temporal Queries: A Graphical Language Approach. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems 2349-2358 (ACM, 2013).","paperID":"None"},{"content":"Moritz, D., Halperin, D., Howe, B. & Heer, J. Perfopticon: Visual Query Analysis for Distributed Databases. Comput. Graph. Forum 34 (2015), 71-80.","paperID":"None"},{"content":"Parnin, C. and Orso, A. Are Automated Debugging Techniques Actually Helping Programmers? In Proc. ISSTA 2011, ACM (2011), 199--209.","paperID":"None"},{"content":"Scheidegger, C., Koop, D., Santos, E., Vo, H., Callahan, S., Freire, J., and Silva, C. Tackling the provenance challenge one layer at a time. Concurrency and Computation: Practice and Experience 20, 5 (2008), 473--483.","paperID":"None"},{"content":"Subrahmaniyan, N., Beckwith, L., Grigoreanu, V., Burnett, M., Wiedenbeck, S., Narayanan, V, Bucht, K., Drummond, R., and Fern, X. Testing vs. Code Inspection vs. What Else?: Male and Female End Users' Debugging Strategies. In Proc. CHI 2008, ACM (2008), 617--626.","paperID":"None"},{"content":"Vijayakumar, N., and Plale, B. Tracking Stream Provenance in Complex Event Processing Systems for Workflow-Driven Computing. In VLDB EDA-PS Workshop 2007.","paperID":"None"}],"abstract":"As real-time monitoring and analysis become increasingly important, researchers and developers turn to data stream management systems (DSMS's) for fast, efficient ways to pose temporal queries over their datasets. However, these systems are inherently complex, and even database experts find it difficult to understand the behavior of DSMS queries. To help analysts better understand these temporal queries, we developed StreamTrace, an interactive visualization tool that breaks down how a temporal query processes a given dataset, step-by-step. The design of StreamTrace is based on input from expert DSMS users; we evaluated the system with a lab study of programmers who were new to streaming queries. Results from the study demonstrate that StreamTrace can help users to verify that queries behave as expected and to isolate the regions of a query that may be causing unexpected results.","title":"Making Sense of Temporal Queries with Interactive Visualization","filename":"CHI16/p5433","authors":["Leilani Battle","Danyel Fisher","Robert DeLine","Mike Barnett","Badrish Chandramouli","Jonathan Goldstein"],"conference":"CHI '16"}