{"paperId":2858216,"citation":[],"reference":[{"content":"Daniel Ashbrook, Kent Lyons, and Thad Starner. 2008. An Investigation into Round Touchscreen Wristwatch Interaction. In Proceedings of the 10th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '08). ACM, 311--314. ISBNx978-1-59593-952-4","paperID":"None"},{"content":"Chen Chen, Simon T. Perrault, Shengdong Zhao, and Wei Tsang Ooi. 2014b. BezelCopy: An Efficient Cross-application Copy-paste Technique for Touchscreen Smartphones. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, 185--192. ISBNx978-1-4503-2775-6","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Tovi Grossman, and George Fitzmaurice. 2014a. Swipeboard: A Text Entry Technique for Ultra-small Interfaces That Supports Novice to Expert Transitions. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, 615--620 ISBNx978-1-4503-3069-5","paperID":"None"},{"content":"Blaskó Gábor and Steven Feiner. 2004. An interaction system for watch computers using tactile guidance and bidirectional segmented strokes. In Proceedings of the 8th IEEE International Symposium on Wearable Computers (ISWC '04). IEEE, 120--123.","paperID":"None"},{"content":"Jaehyun Han, Sunggeun Ahn, and Geehyuk Lee. 2015. Transture: Continuing a Touch Gesture on a Small Screen into the Air. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, 1295--1300. ISBNx978-1-4503-3146-3","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2009. Abracadabra: Wireless, High-precision, and Unpowered Finger Input for Very Small Mobile Devices. In Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, 121--124. ISBNx978-1-60558-745-5","paperID":"None"},{"content":"Ken Hinckley, Jeff Pierce, Mike Sinclair, and Eric Horvitz. 2000. Sensing Techniques for Mobile Interaction. In Proceedings of the 13th Annual ACM Symposium on User Interface Software and Technology (UIST '00). ACM, 91--100. ISBNx1-58113-212-3","paperID":"None"},{"content":"Mohit Jain and Ravin Balakrishnan. 2012. User Learning and Performance with Bezel Menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, 2221--2230. ISBNx978-1-4503-1015-4","paperID":"None"},{"content":"Jungsoo Kim, Jiasheng He, Kent Lyons, and Thad Starner. 2007. The Gesture Watch: A Wireless Contact-free Gesture Based Wrist Interface. In Proceedings of the 11th IEEE International Symposium on Wearable Computers (ISWC '07). IEEE, 1--8. ISBNx978-1-4244-1452-9","paperID":"None"},{"content":"Toshifumi Kurosawa, Buntarou Shizuki, and Jiro Tanaka. 2015. Spatial Arrangement of Data and Commands at Bezels of Mobile Touchscreen Devices. In Proceedings of the 17th International Conference on Human-Computer Interaction (HCI International 2015), Vol. 2. Springer, 227--237. ISBNx978-3-319-20916-6","paperID":"None"},{"content":"Gierad Laput, Robert Xiao, Xiang 'Anthony' Chen, Scott E. Hudson, and Chris Harrison. 2014. Skin Buttons: Cheap, Small, Low-powered and Clickable Fixed-icon Laser Projectors. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, 389--394. ISBNx978-1-4503-3069-5","paperID":"None"},{"content":"Takashi Nakamura, Shin Takahashi, and Jiro Tanaka. 2013. An object selection tecnique using hand gesture in large display -proposing double-crossing and comparing with other techniques. IEICE Transactions J96-D, 4 (2013), 978--988. ISSN18804535 (In Japanese).","paperID":"None"},{"content":"Ian Oakley, DoYoung Lee, MD. Rasel Islam, and Augusto Esteves. 2015. Beats: Tapping Gestures for Smart Watches. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 1237--1246. ISBNx978-1-4503-3145-6","paperID":"None"},{"content":"Masa Ogata and Michita Imai. 2015. SkinWatch: Skin Gesture Interaction for Smart Watch. In Proceedings of the 6th Augmented Human International Conference (AH '15). ACM, 21--24. ISBNx978-1-4503-3349-8","paperID":"None"},{"content":"Jerome Pasquero, Scott J. Stobbe, and Noel Stonehouse. 2011. A Haptic Wristwatch for Eyes-free Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, 3257--3266. ISBNx978-1-4503-0228-9","paperID":"None"},{"content":"Simon T. Perrault, Eric Lecolinet, James Eagan, and Yves Guiard. 2013. WatchIt: Simple Gestures and Eyes-free Interaction for Wristwatches and Bracelets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 1451--1460. ISBNx978-1-4503-1899-0","paperID":"None"},{"content":"Volker Roth and Thea Turner. 2009. Bezel Swipe: Conflict-free Scrolling and Multiple Selection on Mobile Touch Screen Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, 1523--1526. ISBNx978-1-60558-246-7","paperID":"None"},{"content":"Marcos Serrano, Eric Lecolinet, and Yves Guiard. 2013. Bezel-Tap Gestures: Quick Activation of Commands from Sleep Mode on Tablets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 3027--3036. ISBNx978-1-4503-1899-0","paperID":"None"},{"content":"Martin Weigel, Tong Lu, Gilles Bailly, Antti Oulasvirta, Carmel Majidi, and Jürgen Steimle. 2015. iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 2991--3000. ISBNx978-1-4503-3145-6","paperID":"None"},{"content":"Robert Xiao, Gierad Laput, and Chris Harrison. 2014. Expanding the Input Expressivity of Smartwatches with Mechanical Pan, Twist, Tilt and Click. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 193--196. ISBNx978-1-4503-2473-1","paperID":"None"}],"abstract":"We present B2B-Swipe, a single-finger swipe gesture for a rectangular smartwatch that starts at a bezel and ends at a bezel to enrich input vocabulary. There are 16 possible B2B-Swipes because a rectangular smartwatch has four bezels. Moreover, B2B-Swipe can be implemented with a single-touch screen with no additional hardware. Our study shows that B2B-Swipe can co-exist with Bezel Swipe and Flick, with an error rate of 3.7% under the sighted condition and 8.0% under the eyes-free condition. Furthermore, B2B-Swipe is potentially accurate (i.e., the error rates were 0% and 0.6% under the sighted and eyes-free conditions) if the system uses only B2B-Swipes for touch gestures.","title":"B2B-Swipe: Swipe Gesture for Rectangular Smartwatches from a Bezel to a Bezel","filename":"CHI16/p3852","authors":["Yuki Kubo","Buntarou Shizuki","Jiro Tanaka"],"conference":"CHI '16"}