{"paperId":2858132,"citation":[],"abstract":"Non-verbal communication plays a large role in online competitive multiplayer games, as team members attempt to coordinate with each other without distraction to achieve victory. Some games enable this communication through \"pings,\" alerts that are easy to activate and provide auditory and visual cues for teammates. In this paper, we review the literature on gestures and non-verbal communication and, through an empirical analysis of 84,489 players across 10,293 matches in the popular game, League of Legends, illustrate ping use in multiplayer games and test the impact of ping actions on performance in teams. We show that the amount of pings depends on player role and in-game activity and that pings by players have a positive but concave relationship with player performance. These findings demonstrate the importance of non-verbal communication and interruption on the performance of virtual team members. We conclude by discussing the implications of these results for theorizing and designing sociotechnical systems that rely on users to engage in synchronous, collaborative work in shared visual spaces.","reference":[{"content":"Piotr D. Adamczyk and Brian P. Bailey. 2004. If Not Now, when?: The Effects of Interruption at Different Moments Within Task Execution. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 271--278. DOI: http://dx.doi.org/10.1145/985692.985727","paperID":"None"},{"content":"Smiljana Antonijevic. 2008. From Text to Gesture Online: A microethnographic analysis of nonverbal communication in the Second Life virtual environment. Information, Communication & Society 11, 2 (2008), 221--238. DOI: http://dx.doi.org/10.1080/13691180801937290","paperID":"None"},{"content":"Smiljana Antonijevic. 2013. The Immersive Hand: Non-verbal Communication in Virtual Environments. The Immersive Internet: Reflections on the Entangling of the Virtual with Society, Politics and the Economy (2013), 92--105.","paperID":"None"},{"content":"Ramakrishna Ayyagari, Varun Grover, and Russell Purvis. 2011. Technostress: Technological Antecedents and Implications. MIS Quarterly 35, 4 (2011), 831--858.","paperID":"None"},{"content":"Tom Batsford. 2014. Calculating optimal jungling routes in dota2 using neural networks and genetic algorithms. Game Behaviour 1 (2014).","paperID":"None"},{"content":"Beth A. Bechky. 2006. Gaffers, Gofers, and Grips: Role-Based Coordination in Temporary Organizations. Organization Science 17, 1 (2006), 3--21. DOI: http://dx.doi.org/10.1287/orsc.1050.0149","paperID":"None"},{"content":"Grace Benefield, Cuihua Shen, and Alex Leavitt. 2016. Virtual Team Networks: How Group Social Capital Affects Team Success in a Massively Multiplayer Online Game. In Proceedings of the 2016 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '16). ACM, NY, NY, USA.","paperID":"None"},{"content":"Steve Benford, John Bowers, Lennart E. Fahln, Chris Greenhalgh, and Dave Snowdon. 1995. User Embodiment in Collaborative Virtual Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM Press/Addison-Wesley Publishing Co., NY, NY, USA, 242--249. DOI: http://dx.doi.org/10.1145/223904.223935","paperID":"None"},{"content":"Victor Cheung, Y.-L. Betty Chang, and Stacey D. Scott. 2012. Communication Channels and Awareness Cues in Collocated Collaborative Time-critical Gaming. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 569--578. DOI: http://dx.doi.org/10.1145/2145204.2145291","paperID":"None"},{"content":"Herbert H Clark and Susan E Brennan. 1991. Grounding in communication. Perspectives on socially shared cognition 13, 1991 (1991), 127--149.","paperID":"None"},{"content":"Ben Cowley, Darryl Charles, Michaela Black, and Ray Hickey. 2008. Toward an Understanding of Flow in Video Games. Computers in Entertainment 6, 2 (2008), 20:1--20:27. DOI: http://dx.doi.org/10.1145/1371216.1371223","paperID":"None"},{"content":"Mihaly Csikszentmihalyi. 1991. Flow: The psychology of optimal experience. Vol. 41. HarperPerennial NY.","paperID":"None"},{"content":"Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A Diary Study of Task Switching and Interruptions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 175--182. DOI: http://dx.doi.org/10.1145/985692.985715","paperID":"None"},{"content":"Laura Dabbish, Robert Kraut, and Jordan Patton. 2012. Communication and Commitment in an Online Game Team. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 879--888. DOI: http://dx.doi.org/10.1145/2207676.2208529","paperID":"None"},{"content":"Laura Dabbish and Robert E. Kraut. 2004. Controlling Interruptions: Awareness Displays and Social Motivation for Coordination. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, NY, NY, USA, 182--191. DOI: http://dx.doi.org/10.1145/1031607.1031638","paperID":"None"},{"content":"David V. Day, Sandy Gordon, and Corinna Fink. 2012. The Sporting Life: Exploring Organizations through the Lens of Sport. The Academy of Management Annals 6, 1 (2012), 397--433. DOI: http://dx.doi.org/10.1080/19416520.2012.678697","paperID":"None"},{"content":"Scott Donaldson. 2015. Mechanics and Metagame Exploring Binary Expertise in League of Legends. Games and Culture (June 2015), 1555412015590063. DOI:http://dx.doi.org/10.1177/1555412015590063","paperID":"None"},{"content":"Paul Dourish and Victoria Bellotti. 1992. Awareness and Coordination in Shared Workspaces. In Proceedings of the 1992 ACM Conference on Computer-supported Cooperative Work (CSCW '92). ACM, NY, NY, USA, 107--114. DOI: http://dx.doi.org/10.1145/143457.143468","paperID":"None"},{"content":"Anders Drachen, Matthew Yancey, John Maguire, Derrek Chu, Iris Yuhui Wang, Tobias Mahlmann, Matthias Schubert, and Diego Klabajan. 2014. Skill-Based Differences in Spatio-Temporal Team Behaviour in Defence of The Ancients 2 (DotA 2). (2014). http://www.lighti.de/wp-content/uploads/ 2014/09/GEM2014_V21.pdf","paperID":"None"},{"content":"Magy Seif El-Nasr, Anders Drachen, and Alessandro Canossa. 2013. Game analytics: Maximizing the value of player data. Springer Science & Business Media.","paperID":"None"},{"content":"Martin J. Eppler and Jeanne Mengis. 2004. The Concept of Information Overload: A Review of Literature from Organization Science, Accounting, Marketing, MIS, and Related Disciplines. The Information Society 20, 5 (2004), 325--344. DOI: http://dx.doi.org/10.1080/01972240490507974","paperID":"None"},{"content":"Thomas Erickson and Wendy A. Kellogg. 2000. Social Translucence: An Approach to Designing Systems That Support Social Processes. ACM Transactions on Computer-Human Interaction 7, 1 (2000), 59--83. DOI: http://dx.doi.org/10.1145/344949.345004","paperID":"None"},{"content":"Simon Ferrari. 2013. From generative to conventional play: MOBA and League of Legends. Proceedings of DiGRA 2013: DeFragging Game Studies 1, 1 (2013), 1--17.","paperID":"None"},{"content":"James H. Frey and D. Stanley Eitzen. 1991. Sport and Society. Annual Review of Sociology 17 (1991), 503--522. DOI: http://dx.doi.org/10.1146/annurev.soc.17.1.503","paperID":"None"},{"content":"Susan R. Fussell, Robert E. Kraut, and Jane Siegel. 2000. Coordination of Communication: Effects of Shared Visual Context on Collaborative Work. In Proceedings of the 2000 ACM Conference on Computer Supported Cooperative Work (CSCW '00). ACM, NY, NY, USA, 21--30. DOI: http://dx.doi.org/10.1145/358916.358947","paperID":"None"},{"content":"William W. Gaver. 1992. The Affordances of Media Spaces for Collaboration. In Proceedings of the 1992 ACM Conference on Computer-supported Cooperative Work (CSCW '92). ACM, NY, NY, USA, 17--24. DOI:http://dx.doi.org/10.1145/143457.371596","paperID":"None"},{"content":"Darren Gergle, Robert E. Kraut, and Susan R. Fussell. 2004. Action As Language in a Shared Visual Space. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, NY, NY, USA, 487--496. DOI: http://dx.doi.org/10.1145/1031607.1031687","paperID":"None"},{"content":"Darren Gergle, Carolyn P. Rose, and Robert E. Kraut. 2007. Modeling the Impact of Shared Visual Information on Collaborative Reference. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 1543--1552. DOI: http://dx.doi.org/10.1145/1240624.1240858","paperID":"None"},{"content":"Victor M. González and Gloria Mark. 2004. \"Constant, Constant, Multi-tasking Craziness\": Managing Multiple Working Spheres. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 113--120. DOI: http://dx.doi.org/10.1145/985692.985707","paperID":"None"},{"content":"Charles Goodwin. 2007. Environmentally coupled gestures. In Gesture and the dynamic dimensions of language. John Benjamins, Amsterdam, Netherlands, 195--212.","paperID":"None"},{"content":"Yong Guo, Siqi Shen, O. Visser, and A. Iosup. 2012. An analysis of online match-based games. In 2012 IEEE International Workshop on Haptic Audio Visual Environments and Games. 134--139. DOI: http://dx.doi.org/10.1109/HAVE.2012.6374452","paperID":"None"},{"content":"John Halloran, Geraldine Fitzpatrick, Yvonne Rogers, and Paul Marshall. 2004. Does it matter if you don't know who's talking?: multiplayer gaming with voiceover IP. In CHI'04 extended abstracts on Human factors in computing systems. ACM, 1215--1218.","paperID":"None"},{"content":"Jeffrey T Hancock and Philip J Dunham. 2001. Language use in computer-mediated communication: The role of coordination devices. Discourse Processes 31, 1 (2001), 91--110.","paperID":"None"},{"content":"David A. Harrison, Susan Mohammed, Joseph E. Mcgrath, Anna T. Florey, and Scott W. Vanderstoep. 2003. Time Matters in Team Performance: Effects of Member Familiarity, Entrainment, and Task Discontinuity on Speed and Quality. Personnel Psychology 56, 3 (2003), 633--669. DOI:http: //dx.doi.org/10.1111/j.1744--6570.2003.tb00753.x","paperID":"None"},{"content":"David Huffaker, Jing Wang, Jeffrey Treem, Muhammad Aurganzeb Ahmad, Lindsay Fullerton, Dmitri Williams, Marshall Scott Poole, and Noshir Contractor. 2009. The Social Behaviors of Experts in Massive Multiplayer Online Role-Playing Games, Vol. 4. 326--331. DOI: http://dx.doi.org/10.1109/CSE.2009.13","paperID":"None"},{"content":"Troy Innocent and Stewart Haines. 2007. Nonverbal communication in multiplayer game worlds. In Proceedings of the 4th Australasian conference on Interactive entertainment. RMIT University, 11.","paperID":"None"},{"content":"Shamsi T. Iqbal and Brian P. Bailey. 2006. Leveraging Characteristics of Task Structure to Predict the Cost of Interruption. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 741--750. DOI: http://dx.doi.org/10.1145/1124772.1124882","paperID":"None"},{"content":"Shamsi T. Iqbal and Eric Horvitz. 2007. Disruption and Recovery of Computing Tasks: Field Study, Analysis, and Directions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 677--686. DOI: http://dx.doi.org/10.1145/1240624.1240730","paperID":"None"},{"content":"Lilly C. Irani, Gillian R. Hayes, and Paul Dourish. 2008. Situated Practices of Looking: Visual Practice in an Online World. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, NY, NY, USA, 187--196. DOI:http://dx.doi.org/10.1145/1460563.1460592","paperID":"None"},{"content":"Daniel Johnson, Lennart E. Nacke, and Peta Wyeth. 2015. All About That Base: Differing Player Experiences in Video Game Genres and the Unique Case of MOBA Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2265--2274. DOI: http://dx.doi.org/10.1145/2702123.2702447","paperID":"None"},{"content":"Kristine Jørgensen. 2008. Audio and Gameplay: An Analysis of PvP Battlegrounds in World of Warcraft. Game Studies 8, 2 (2008).","paperID":"None"},{"content":"Adam S. Kahn, Cuihua Shen, Li Lu, Rabindra A. Ratan, Sean Coary, Jinghui Hou, Jingbo Meng, Joseph Osborn, and Dmitri Williams. 2015. The Trojan Player Typology: A cross-genre, cross-cultural, behaviorally validated scale of video game play motivations. Computers in Human Behavior 49 (2015), 354--361. DOI: http://dx.doi.org/10.1016/j.chb.2015.03.018","paperID":"None"},{"content":"Adam Kendon. 1997. Gesture. Annual Review of Anthropology 26, 1 (1997), 109--128. DOI:http: //dx.doi.org/10.1146/annurev.anthro.26.1.109","paperID":"None"},{"content":"Adam Kendon. 2004. Gesture: Visible action as utterance. Cambridge University Press, Cambridge, UK. DOI:http://dx.doi.org/10.1017/cbo9780511807572","paperID":"None"},{"content":"Christoph Klimmt and Tilo Hartmann. 2008. Mediated interpersonal communication in multiplayer video games: implications for entertainment and relationship management. In Mediated interpersonal communication. Routledge, NY, NY, 309--330.","paperID":"None"},{"content":"Richard Klimoski and Susan Mohammed. 1994. Team mental model: construct or metaphor? Journal of Management 20, 2 (1994). DOI: http://dx.doi.org/10.1016/0149-2063(94)90021-3","paperID":"None"},{"content":"Raph Koster. 2013. Theory of fun for game design. O'Reilly Media, Inc.","paperID":"None"},{"content":"Yubo Kou and Xinning Gui. 2014. Playing with Strangers: Understanding Temporary Teams in League of Legends. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 161--169. DOI: http://dx.doi.org/10.1145/2658537.2658538","paperID":"None"},{"content":"Steve W. J. Kozlowski and Bradford S. Bell. 2003. Work Groups and Teams in Organizations. In Handbook of Psychology. John Wiley & Sons, Inc.","paperID":"None"},{"content":"Robert E. Kraut, Darren Gergle, and Susan R. Fussell. 2002. The Use of Visual Information in Shared Visual Spaces: Informing the Development of Virtual Co-presence. In Proceedings of the 2002 ACM Conference on Computer Supported Cooperative Work (CSCW '02). ACM, NY, NY, USA, 31--40. DOI: http://dx.doi.org/10.1145/587078.587084","paperID":"None"},{"content":"Gloria Mark, Victor M. Gonzalez, and Justin Harris. 2005. No Task Left Behind?: Examining the Nature of Fragmented Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 321--330. DOI: http://dx.doi.org/10.1145/1054972.1055017","paperID":"None"},{"content":"Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The Cost of Interrupted Work: More Speed and Stress. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 107--110. DOI: http://dx.doi.org/10.1145/1357054.1357072","paperID":"None"},{"content":"Michelle A. Marks, John E. Mathieu, and Stephen J. Zaccaro. 2001. A Temporally Based Framework and Taxonomy of Team Processes. The Academy of Management Review 26, 3 (2001), 356--376. DOI: http://dx.doi.org/10.2307/259182","paperID":"None"},{"content":"John Mathieu, M. Travis Maynard, Tammy Rapp, and Lucy Gilson. 2008. Team Effectiveness 1997--2007: A Review of Recent Advancements and a Glimpse Into the Future. Journal of Management 34, 3 (2008), 410-476. DOI:http://dx.doi.org/10.1177/0149206308316061","paperID":"None"},{"content":"Daniel McFarlane. 2002. Comparison of Four Primary Methods for Coordinating the Interruption of People in Human-computer Interaction. Human-Computer Interaction 17, 1 (2002), 63--139. DOI: http://dx.doi.org/10.1207/S15327051HCI1701_2","paperID":"None"},{"content":"Robert J. Moore, Nicolas Ducheneaut, and Eric Nickell. 2006. Doing Virtually Nothing: Awareness and Accountability in Massively Multiplayer Online Worlds. Computer Supported Cooperative Work (CSCW) 16, 3 (2006), 265--305. DOI: http://dx.doi.org/10.1007/s10606-006-9021-4","paperID":"None"},{"content":"57. Robert J. Moore, E. Cabell Hankinson Gathman, Nicolas Ducheneaut, and Eric Nickell. 2007. Coordinating Joint Activity in Avatar-mediated Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 21-30. DOI: http://dx.doi.org/10.1145/1240624.1240628","paperID":"None"},{"content":"Ben B. Morgan Jr., Eduardo Salas, and Albert S. Glickman. 1993. An analysis of Team Evolution And Maturation. Journal of General Psychology 120, 3 (1993), 277.","paperID":"None"},{"content":"Patrick Ng, Keith Nesbitt, and Karen Blackmore. 2015. Sound Improves Player Performance in a Multiplayer Online Battle Arena Game. In Artificial Life and Computational Intelligence, Stephan K. Chalup, Alan D. Blair, and Marcus Randall (Eds.). Number 8955 in Lecture Notes in Computer Science. Springer International Publishing, 166--174.","paperID":"None"},{"content":"Hyunsoo Park and Kyung-Joong Kim. 2015. Social Network Analysis of High-Level Players in Multiplayer Online Battle Arena Game. In Social Informatics, Luca Maria Aiello and Daniel McFarland (Eds.). Vol. 8852. Springer International Publishing, 223--226.","paperID":"None"},{"content":"Jorge Peña and Jeffrey T Hancock. 2006. An Analysis of Socioemotional and Task Communication in Online Multiplayer Video Games. Communication Research 33, 1 (2006), 92--109. DOI: http://dx.doi.org/10.1177/0093650205283103","paperID":"None"},{"content":"David Pinelle, Nelson Wong, Tadeusz Stach, and Carl Gutwin. 2009. Usability Heuristics for Networked Multiplayer Games. In Proceedings of the ACM 2009 International Conference on Supporting Group Work (GROUP '09). ACM, NY, NY, USA, 169-178. DOI:http://dx.doi.org/10.1145/1531674.1531700","paperID":"None"},{"content":"Nataliia Pobiedina, Julia Neidhardt, Maria del Carmen Calatrava Moreno, Laszlo Grad-Gyenge, and Hannes Werthner. 2013b. On Successful Team Formation: Statistical Analysis of a Multiplayer Online Game. In 2013 IEEE 15th Conference on Business Informatics (CBI '13). 55--62. DOI: http://dx.doi.org/10.1109/CBI.2013.17","paperID":"None"},{"content":"Nataliia Pobiedina, Julia Neidhardt, Maria del Carmen Calatrava Moreno, and Hannes Werthner. 2013a. Ranking Factors of Team Success. In Proceedings of the 22Nd International Conference on World Wide Web (WWW '13 Companion). International World Wide Web Conferences Steering Committee, Geneva, Switzerland, 1185--1194.","paperID":"None"},{"content":"Rabindra A. Ratan, Jae Eun Chung, Cuihua Shen, Dmitri Williams, and Marshall Scott Poole. 2010. Schmoozing and smiting: Trust, social institutions, and communication patterns in an MMOG. Journal of Computer-Mediated Communication 16, 1 (2010), 93--114.","paperID":"None"},{"content":"Rabindra A. Ratan, Tracy Kennedy, and Dmitri Williams. 2012. League of Gendered Game Play Behaviors: Examining Instrumental vs Identity-Relevant Avatar Choices. Meaningful Play 13 (2012).","paperID":"None"},{"content":"Riot Games. 2013. Smart Ping Is Here. (2013). http://forums.na.leagueoflegends.com/board/ showthread.php?t=3178421","paperID":"None"},{"content":"William B. Rouse and Nancy M. Morris. 1986. On looking into the black box: Prospects and limits in the search for mental models. Psychological Bulletin 100, 3 (1986), 349-363. DOI: http://dx.doi.org/10.1037/0033-2909.100.3.349","paperID":"None"},{"content":"Eduardo Salas, Carolyn Prince, David P Baker, and Lisa Shrestha. 1995. Situation awareness in team performance: Implications for measurement and training. Human Factors: The Journal of the Human Factors and Ergonomics Society 37, 1 (1995), 123--136.","paperID":"None"},{"content":"Dario D. Salvucci, Niels A. Taatgen, and Jelmer P. Borst. 2009. Toward a Unified Theory of the Multitasking Continuum: From Concurrent Performance to Task Switching, Interruption, and Resumption. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1819--1828. DOI: http://dx.doi.org/10.1145/1518701.1518981","paperID":"None"},{"content":"Cheri Speier, Iris Vessey, and Joseph S. Valacich. 2003. The Effects of Interruptions, Task Complexity, and Information Presentation on Computer-Supported Decision-Making Performance. Decision Sciences 34, 4 (2003), 771-797. DOI:http: //dx.doi.org/10.1111/j.1540--5414.2003.02292.x","paperID":"None"},{"content":"Zachary O. Toups, Jessica Hammer, William A. Hamilton, Ahmad Jarrah, William Graves, and Oliver Garretson. 2014. A Framework for Cooperative Communication Game Mechanics from Grounded Theory. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, NY, NY, USA, 257--266. DOI: http://dx.doi.org/10.1145/2658537.2658681","paperID":"None"},{"content":"Dmitri Williams, Scott Caplan, and Li Xiong. 2007. Can You Hear Me Now? The Impact of Voice in an Online Gaming Community. Human Communication Research 33, 4 (2007), 427-449. DOI:http: //dx.doi.org/10.1111/j.1468--2958.2007.00306.x","paperID":"None"},{"content":"Dmitri Williams, Nicolas Ducheneaut, Li Xiong, Yuanyuan Zhang, Nick Yee, and Eric Nickell. 2006. From tree house to barracks the social life of guilds in World of Warcraft. Games and culture 1, 4 (2006), 338--361.","paperID":"None"},{"content":"J. Patrick Williams and David Kirschner. 2012. Coordinated Action in the Massively Multiplayer Online Game World of Warcraft: Coordinated Action in the Massively Multiplayer Online Game World of Warcraft. Symbolic Interaction 35, 3 (2012), 340--367. DOI: http://dx.doi.org/10.1002/symb.22","paperID":"None"},{"content":"A. W. Woolley, C. F. Chabris, A. Pentland, N. Hashmi, and T. W. Malone. 2010. Evidence for a Collective Intelligence Factor in the Performance of Human Groups. Science 330, 6004 (2010), 686--688. DOI: http://dx.doi.org/10.1126/science.1193147","paperID":"None"},{"content":"Pu Yang, Brent Harrison, and David L. Roberts. 2014. Identifying patterns in combat that are predictive of success in MOBA games. In Proceedings of Foundations of Digital Games (FDG '14). http: //www.fdg2014.org/papers/fdg2014_paper_36.pdf","paperID":"None"},{"content":"Fred R. H. Zijlstra, Robert A. Roe, Anna B. Leonora, and Irene Krediet. 1999. Temporal factors in mental work: Effects of interrupted activities. Journal of Occupational & Organizational Psychology 72, 2 (June 1999), 163--185.","paperID":"None"}],"title":"Ping to Win?: Non-Verbal Communication and Team Performance in Competitive Online Multiplayer Games","filename":"CHI16/p4337","authors":["Alex Leavitt","Brian C. Keegan","Joshua Clark"],"conference":"CHI '16"}