{"paperId":2858279,"citation":[],"reference":[{"content":"Md. Abdur Rahman, Abdulmajeed Alkhaldi, Jongeun Cha, and Abdulmotaleb El Saddik. 2010. Adding haptic feature to YouTube. In Proceedings of the international conference on Multimedia - MM '10. ACM Press, NY, NY, USA, 1643--1646. DOI: http://dx.doi.org/10.1145/1873951.1874310","paperID":"None"},{"content":"M. Allen, J. Gluck, K. E. MacLean, and E. Tang. 2005. An Initial Usability Assessment for Symbolic Haptic Rendering of Music Parameters. In 7th Int'l Conf on Multimodal Interfaces (ICMI '05). Trento, Italy, 244--251.","paperID":"None"},{"content":"Amazon.com Inc. 2015. Amazon Mechanical Turk Requester Best Practices Guide. (2015).","paperID":"None"},{"content":"Farah Arab, Sabrina Paneels, Margarita Anastassova, Stephanie Coeugnet, Fanny Le Morellec, Aurelie Dommes, and Aline Chevalier. 2015. Haptic patterns and older adults: To repeat or not to repeat--. In 2015 IEEE World Haptics Conference (WHC). IEEE, 248--253. DOI: http://dx.doi.org/10.1109/WHC.2015.7177721","paperID":"None"},{"content":"Stephen Brewster and Lorna M. Brown. 2004. Tactons: structured tactile messages for non-visual information display. In AUIC '04. 15--23. http://dl.acm.org/citation.cfm--id=976310.976313","paperID":"None"},{"content":"Lorna M. Brown, Stephen A. Brewster, and Helen C. Purchase. 2006. Multidimensional tactons for non-visual information presentation in mobile devices. In Proceedings of the 8th conference on Human-computer interaction with mobile devices and services (MobileHCI '06). ACM Press, NY, USA, 231--238. DOI: http://dx.doi.org/10.1145/1152215.1152265","paperID":"None"},{"content":"Lorna M. Brown and Topi Kaaresoja. 2006. Feel who's talking: Using Tactons for Mobile Phone Alerts. In CHI --06 extended abstracts on Human factors in computing systems CHI EA '06. ACM Press, NY, NY, USA, 604. DOI: http://dx.doi.org/10.1145/1125451.1125577","paperID":"None"},{"content":"L. Brunet, C. Megard, S. Paneels, G. Changeon, J. Lozada, M. P. Daniel, and F. Darses. 2013. \"Invitation to the voyage\": The design of tactile metaphors to ful--ll occasional travelers-- needs in transportation networks. In 2013 World Haptics Conference (WHC). IEEE, 259--264. DOI: http://dx.doi.org/10.1109/WHC.2013.6548418","paperID":"None"},{"content":"Mark Cartwright and Bryan Pardo. 2015. VocalSketch: Vocally Imitating Audio Concepts. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15. ACM Press, NY, NY, USA, 43--46. DOI: http://dx.doi.org/10.1145/2702123.2702387","paperID":"None"},{"content":"A Chan, K MacLean, and J McGrenere. 2008. Designing haptic icons to support collaborative turn-taking. International Journal of Human-Computer Studies 66, 6 (2008), 333--355. http://www.sciencedirect.com/science/article/pii/S1071581907001565","paperID":"None"},{"content":"Lydia B. Chilton, Greg Little, Darren Edge, Daniel S. Weld, and James A. Landay. 2013. Cascade: Crowdsourcing Taxonomy Creation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1999--2008. DOI: http://dx.doi.org/10.1145/2470654.2466265","paperID":"None"},{"content":"Julie S. Downs, Mandy B. Holbrook, Steve Sheng, and Lorrie Faith Cranor. 2010. Are your participants gaming the system--. In Proceedings of the 28th international conference on Human factors in computing systems CHI '10. ACM Press, NY, NY, USA, 2399. DOI:http://dx.doi.org/10.1145/1753326.1753688","paperID":"None"},{"content":"Mohamad Eid, Atif Alamri, and Abdulmotaleb Saddik. 2006. MPEG-7 Description of Haptic Applications Using HAML. In 2006 IEEE International Workshop on Haptic Audio Visual Environments and their Applications (HAVE 2006). IEEE, 134--139. DOI: http://dx.doi.org/10.1109/HAVE.2006.283780","paperID":"None"},{"content":"Mohamad Eid, Sheldon Andrews, Atif Alamri, and Abdulmotaleb El Saddik. 2008. HAMLAT: A HAML-Based Authoring Tool for Haptic Application Development. In LNCS 5024 - Haptics: Perception, Devices and Scenarios. Vol. 5024. 857--866. DOI: http://dx.doi.org/10.1007/978--3--540--69057--3","paperID":"None"},{"content":"Adrienne Porter Felt, Serge Egelman, and David Wagner. 2012. I've got 99 problems, but vibration ain't one: A survey of smartphone User--s concerns. In Proceedings of the second ACM workshop on Security and privacy in smartphones and mobile devices SPSM '12. ACM Press, NY, NY, USA, 33. DOI: http://dx.doi.org/10.1145/2381934.2381943","paperID":"None"},{"content":"Steve Guest, JeanMarc Dessirier, Anahit Mehrabyan, Francis McGlone, Greg Essick, George Gescheider, Anne Fontana, Rui Xiong, Rochelle Ackerley, and Kevin Blot. 2011. The development and validation of sensory and emotional scales of touch perception. Attention, Perception, & Psychophysics 73, 2 (2011), 531--550. DOI: http://dx.doi.org/10.3758/s13414-010-0037-y","paperID":"None"},{"content":"Vincent Hayward. 2008. A brief taxonomy of tactile illusions and demonstrations that can be done in a hardware store. Brain research bulletin 75, 6 (April 2008), 742--52. DOI: http://dx.doi.org/10.1016/j.brainresbull.2008.01.008","paperID":"None"},{"content":"Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing Graphical Perception: Using Mechanical Turk to Assess Visualization Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 203--212. DOI: http://dx.doi.org/10.1145/1753326.1753357","paperID":"None"},{"content":"Eve Hoggan, Craig Stewart, Laura Haverinen, Giulio Jacucci, and Vuokko Lantz. 2012. Pressages: augmenting phone calls with non-verbal messages. (Oct. 2012), 555--562. DOI: http://dx.doi.org/10.1145/2380116.2380185","paperID":"None"},{"content":"M. Hollins, R. Faldowski, S. Rao, and F Young. 1993. Perceptual dimensions of tactile surface texture: A multidimensional scaling analysis. Perception & Psychophysics 54 (1993), 697--705.","paperID":"None"},{"content":"Inwook Hwang, K E MacLean, Matthew Brehmer, Jeff Hendy, Andreas Sotirakopoulos, and Seungmoon Choi. 2011. The Haptic Crayola Effect: Exploring the Role of Naming in Learning Haptic Stimuli. In WorldHaptics '11. IEEE, Istanbul, 385--390.","paperID":"None"},{"content":"Inwook Hwang, Jongman Seo, Myongchan Kim, and Seungmoon Choi. 2013. Vibrotactile Perceived Intensity for Mobile Devices as a Function of Direction, Amplitude, and Frequency. IEEE Transactions on Haptics 6, 3 (July 2013), 352--362. DOI: http://dx.doi.org/10.1109/TOH.2013.2","paperID":"None"},{"content":"Ali Israr and Ivan Poupyrev. 2011. Tactile brush: drawing on skin with a tactile grid display. In CHI '11. ACM Press, Vancouver, BC, 2019--2028. DOI: http://dx.doi.org/10.1145/1978942.1979235","paperID":"None"},{"content":"Ali Israr, Siyan Zhao, and Oliver Schneider. 2015. Exploring Embedded Haptics for Social Networking and Interactions. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems CHI EA '15. ACM Press, NY, NY, USA, 1899--1904. DOI: http://dx.doi.org/10.1145/2702613.2732814","paperID":"None"},{"content":"Ali Israr, Siyan Zhao, Kaitlyn Schwalje, Roberta Klatzky, and Jill Lehman. 2014. Feel Effects: Enriching Storytelling with Haptic Feedback. Transactions on Applied Perception (TAP) 11, 3 (2014).","paperID":"None"},{"content":"Cathrine V. Jansson-Boyd. 2011. Touch matters: exploring the relationship between consumption and tactile interaction. Social Semiotics 21, 4 (Sept. 2011), 531--546. DOI: http://dx.doi.org/10.1080/10350330.2011.591996","paperID":"None"},{"content":"T. Kaaresoja and J. Linjama. 2005. Perception of Short Tactile Pulses Generated by a Vibration Motor in a Mobile Phone. In First Joint Eurohaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, 471--472. DOI:http://dx.doi.org/10.1109/WHC.2005.103","paperID":"None"},{"content":"Yeongmi Kim, Jongeun Cha, Ian Oakley, and Jeha Ryu. 2009. Exploring Tactile Movies: An Initial Tactile Glove Design and Concept Evaluation. IEEE Multimedia PP, 99 (2009), 1. DOI: http://dx.doi.org/10.1109/MMUL.2009.63","paperID":"None"},{"content":"Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing User Studies with Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI --08). ACM, NY, NY, USA, 453--456. DOI: http://dx.doi.org/10.1145/1357054.1357127","paperID":"None"},{"content":"Emilia Koskinen, Topi Kaaresoja, and Pauli Laitinen. 2008. Feel-good Touch: Finding the Most Pleasant Tactile Feedback for a Mobile Touch Screen Button. In Proceedings of the 10th International Conference on Multimodal Interfaces (ICMI '08). ACM, NY, NY, USA, 297--304. DOI: http://dx.doi.org/10.1145/1452392.1452453","paperID":"None"},{"content":"Karon E MacLean. 2008. Foundations of Transparency in Tactile Information Design. IEEE Transactions on Haptics 1, 2 (July 2008), 84--95. DOI: http://dx.doi.org/10.1109/TOH.2008.20","paperID":"None"},{"content":"Karon E MacLean and Mario Enriquez. 2003. Perceptual design of haptic icons. In Proceedings of Eurohaptics Conference. 351--363.","paperID":"None"},{"content":"Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon--s Mechanical Turk. Behavior Research Methods 44, 1 (2012), 1--23. DOI: http://dx.doi.org/10.3758/s13428-011-0124--6","paperID":"None"},{"content":"Sile O Modhrain and Ian Oakley. 2001. Touch TV : Adding Feeling to Broadcast Media. (2001).","paperID":"None"},{"content":"Marianna Obrist, Sue Ann Seah, and Sriram Subramanian. 2013. Talking about tactile experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI --13). ACM Press, NY, USA, 1659--1668. DOI: http://dx.doi.org/10.1145/2470654.2466220","paperID":"None"},{"content":"Shogo Okamoto, Hikaru Nagano, and Yoji Yamada. 2013. Psychophysical Dimensions of Tactile Perception of Textures. IEEE Transactions on Haptics 6, 1 (Jan. 2013), 81--93. DOI: http://dx.doi.org/10.1109/TOH.2012.32","paperID":"None"},{"content":"Jerome Pasquero, Joseph Luk, Shannon Little, and Karon Maclean. 2006. Perceptual Analysis of Haptic Icons: An Investigation into the Validity of Cluster Sorted MDS. In 14th IEEE Haptic Symposium (HAPTICS '06). IEEE, Alexandria, Virginia, 437--444.","paperID":"None"},{"content":"Helena Pongrac. 2008. Vibrotactile perception: examining the coding of vibrations and the just noticeable difference under various conditions. Multimedia Systems 13, 4 (2008), 297--307. DOI: http://dx.doi.org/10.1007/s00530-007-0105-x","paperID":"None"},{"content":"J. Raisamo, R. Raisamo, and V. Surakka. 2013. Comparison of Saltation, Amplitude Modulation, and a Hybrid Method of Vibrotactile Stimulation. Haptics, IEEE Transactions on 6, 4 (Oct 2013), 517--521. DOI: http://dx.doi.org/10.1109/TOH.2013.25","paperID":"None"},{"content":"Oliver S. Schneider and Karon E. MacLean. 2014. Improvising Design with a Haptic Instrument. In HAPTICS '14. Houston, USA.","paperID":"None"},{"content":"D.J. Schuirmann. 1981. On hypothesis testing to determine if the mean of a normal distribution is contained in a known interval. Biometrics 37, 3 (1981), 617--617.","paperID":"None"},{"content":"Hasti Sei--, Chamila Anthonypillai, and Karon E. MacLean. 2014. End-user customization of affective tactile messages: A qualitative examination of tool parameters. In HAPTICS '14. IEEE, 251--256. DOI: http://dx.doi.org/10.1109/HAPTICS.2014.6775463","paperID":"None"},{"content":"Hasti Sei--, Kailun Zhang, and Karon MacLean. 2015. VibViz: Organizing, visualizing and navigating vibration libraries. In World Haptics '15.","paperID":"None"},{"content":"Jongman Seo and Seungmoon Choi. 2013. Perceptual analysis of vibrotactile --ows on a mobile device. IEEE transactions on haptics 6, 4 (Jan. 2013), 522--7. DOI: http://dx.doi.org/10.1109/TOH.2013.24","paperID":"None"},{"content":"Pao Siangliulue, Kenneth C. Arnold, Krzysztof Z. Gajos, and Steven P. Dow. 2015. Toward Collaborative Ideation at Scale - Leveraging Ideas from Others to Generate More Creative and Diverse Ideas Pao. In CSCW --15. ACM Press, NY, NY, USA, 937--945. DOI:http://dx.doi.org/10.1145/2675133.2675239","paperID":"None"},{"content":"Diane Tam, Karon E. MacLean, Joanna McGrenere, and Katherine J. Kuchenbecker. 2013. The Design and Field Observation of a Haptic Noti--cation System for Timing Awareness During Oral Presentations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1689--1698. DOI: http://dx.doi.org/10.1145/2470654.2466223","paperID":"None"},{"content":"David Ternes and Karon E. MacLean. 2008. Designing Large Sets of Haptic Icons with Rhythm. In Haptics: Perception, Devices and Scenarios, Manuel Ferre (Ed.). Lecture Notes in Computer Science, Vol. 5024. Springer Berlin Heidelberg, 199--208. DOI: http://dx.doi.org/10.1007/978--3--540--69057--3_24","paperID":"None"},{"content":"Jan BF van Erp and Michiel MA Spape. 2003. Distilling the underlying dimensions of tactile melodies. In Proceedings of Eurohaptics, Vol. 2003. 111--120.","paperID":"None"},{"content":"Anbang Xu, Shih-Wen Huang, and Brian Bailey. 2014. Voyant: Generating Structured Feedback on Visual Designs Using a Crowd of Non-Experts. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14. ACM Press, NY, NY, USA, 1433--1444. DOI:http://dx.doi.org/10.1145/2531602.2531604","paperID":"None"},{"content":"Yongjae Yoo, Taekbeom Yoo, Jihyun Kong, and Seungmoon Choi. 2015. Emotional responses of tactile icons: Effects of amplitude, frequency, duration, and envelope. In IEEEWorld Haptics Conference (WHC'15). 235--240. DOI: http://dx.doi.org/10.1109/WHC.2015.7177719","paperID":"None"},{"content":"Siyan Zhao, Oliver Schneider, Roberta Klatzky, Jill Lehman, and Ali Israr. 2014. FeelCraft: Crafting Tactile Experiences for Media Using a Feel Effect Library. In Proceedings of the Adjunct Publication of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST'14 Adjunct). ACM, NY, NY, USA, 51--52. DOI: http://dx.doi.org/10.1145/2658779.2659109","paperID":"None"}],"abstract":"Vibrotactile (VT) display is becoming a standard component of informative user experience, where notifications and feedback must convey information eyes-free. However, effective design is hindered by incomplete understanding of relevant perceptual qualities, together with the need for user feedback to be accessed in-situ. To access evaluation streamlining now common in visual design, we introduce proxy modalities as a way to crowdsource VT sensations by reliably communicating high-level features through a crowd-accessible channel. We investigate two proxy modalities to represent a high-fidelity tactor: a new VT visualization, and low-fidelity vibratory translations playable on commodity smartphones. We translated 10 high-fidelity vibrations into both modalities, and in two user studies found that both proxy modalities can communicate affective features, and are consistent when deployed remotely over Mechanical Turk. We analyze fit of features to modalities, and suggest future improvements.","title":"HapTurk: Crowdsourcing Affective Ratings of Vibrotactile Icons","filename":"CHI16/p3248","authors":["Oliver S. Schneider","Hasti Seifi","Salma Kashani","Matthew Chun","Karon E. MacLean"],"conference":"CHI '16"}