{"paperId":2858361,"citation":[],"abstract":"The Internet has enabled learning at scale, from Massive Open Online Courses (MOOCs) to Wikipedia. But online learners may become passive, instead of actively constructing knowledge and revising their beliefs in light of new facts. Instructors cannot directly diagnose thousands of learners' misconceptions and provide remedial tutoring. This paper investigates how instructors can prompt learners to reflect on facts that are anomalies with respect to their existing misconceptions, and how to choose these anomalies and prompts to guide learners to revise incorrect beliefs without any feedback. We conducted two randomized experiments with online crowd workers learning statistics. Results show that prompts to explain why these anomalies are true drive revision towards correct beliefs. But prompts to simply articulate thoughts about anomalies have no effect on learning. Furthermore, we find that explaining multiple anomalies is more effective than explaining only one, but the anomalies should rule out multiple misconceptions simultaneously.","reference":[{"content":"Vincent Aleven, Amy Ogan, Octav Popescu, Cristen Torrey, and Kenneth Koedinger. 2004. Evaluating the effectiveness of a tutorial dialogue system for self-explanation. In Intelligent tutoring systems. Springer, 443--454.","paperID":"None"},{"content":"Vincent AWMM Aleven and Kenneth R Koedinger. 2002. An effective metacognitive strategy: Learning by doing and explaining with a computer-based Cognitive Tutor. Cognitive science 26, 2 (2002), 147--179.","paperID":"None"},{"content":"Michael E Beeth. 1998. Facilitating conceptual change learning: The need for teachers to support metacognition. Journal of Science Teacher Education 9, 1 (1998), 49--61.","paperID":"None"},{"content":"Michelene TH Chi, Nicholas Leeuw, Mei-Hung Chiu, and Christian LaVancher. 1994. Eliciting self-explanations improves understanding. Cognitive science 18, 3 (1994), 439--477.","paperID":"None"},{"content":"Clark A Chinn and William F Brewer. 1993. The role of anomalous data in knowledge acquisition: A theoretical framework and implications for science instruction. Review of educational research 63, 1 (1993), 1--49.","paperID":"None"},{"content":"Cristina Conati and Kurt Vanlehn. 2000. Toward computer-based support of meta-cognitive skills: A computational framework to coach self-explanation. International Journal of Artificial Intelligence in Education (IJAIED) 11 (2000), 389--415.","paperID":"None"},{"content":"Sidney D'Mello, Blair Lehman, Reinhard Pekrun, and Art Graesser. 2014. Confusion can be beneficial for learning. Learning and Instruction 29 (2014), 153--170.","paperID":"None"},{"content":"Dedre Gentner. 2010. Bootstrapping the mind: Analogical processes and symbol systems. Cognitive Science 34, 5 (2010), 752--775.","paperID":"None"},{"content":"Samad Kardan and Cristina Conati. 2015. Providing Adaptive Support in an Interactive Simulation for Learning: An Experimental Evaluation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3671--3680.","paperID":"None"},{"content":"Chinmay Kulkarni, Koh Pang Wei, Huy Le, Daniel Chia, Kathryn Papadopoulos, Justin Cheng, Daphne Koller, and Scott R Klemmer. 2015. Peer and self assessment in massive online classes. In Design Thinking Research. Springer, 131--168.","paperID":"None"},{"content":"Tania Lombrozo. 2006. The structure and function of explanations. Trends in cognitive sciences 10, 10 (2006), 464--470.","paperID":"None"},{"content":"Tania Lombrozo. 2012. Explanation and abductive inference. Oxford handbook of thinking and reasoning (2012), 260--276.","paperID":"None"},{"content":"Amy Ogan, Erin Walker, Ryan SJd Baker, Genaro Rebolledo Mendez, Maynor Jimenez Castro, Tania Laurentino, and Adriana de Carvalho. 2012. Collaboration in cognitive tutor use in Latin America: Field study and design recommendations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1381--1390.","paperID":"None"},{"content":"Daniel L Schwartz and Taylor Martin. 2004. Inventing to prepare for future learning: The hidden efficiency of encouraging original student production in statistics instruction. Cognition and Instruction 22, 2 (2004), 129--184.","paperID":"None"},{"content":"Amos Tversky and Daniel Kahneman. 1981. The framing of decisions and the psychology of choice. Science 211, 4481 (1981), 453--458.","paperID":"None"},{"content":"Rummel Nikol Koedinger Kenneth R. Walker, Erin. 2011. Designing automated adaptive support to improve student helping behaviors in a peer tutoring activity. International Journal of Computer-Supported Collaborative Learning 6, 2 (2011), 279--306.","paperID":"None"},{"content":"Joseph J Williams and Thomas L Griffiths. 2013. Why are people bad at detecting randomness? A statistical argument. Journal of experimental psychology: learning, memory, and cognition 39, 5 (2013), 1473.","paperID":"None"},{"content":"Joseph Jay Williams, Geza Kovacs, Caren Walker, Samuel Maldonado, and Tania Lombrozo. 2014. Learning online via prompts to explain. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 2269--2274.","paperID":"None"},{"content":"Joseph J Williams and Tania Lombrozo. 2010. The role of explanation in discovery and generalization: evidence from category learning. Cognitive Science 34, 5 (2010), 776--806.","paperID":"None"},{"content":"Joseph J Williams and Tania Lombrozo. 2013. Explanation and prior knowledge interact to guide learning. Cognitive psychology 66, 1 (2013), 55--84.","paperID":"None"},{"content":"Joseph Jay Williams, Tania Lombrozo, and Bob Rehder. 2013. The hazards of explanation: Overgeneralization in the face of exceptions. Journal of Experimental Psychology: General 142, 4 (2013), 1006.","paperID":"None"},{"content":"Joseph Jay Williams, Caren M Walker, and Tania Lombrozo. 2012. Explaining increases belief revision in the face of (many) anomalies. In Proceedings of the 34th Annual Conference of the Cognitive Science Society. Citeseer, 1149--1154.","paperID":"None"}],"title":"Revising Learner Misconceptions Without Feedback: Prompting for Reflection on Anomalies","filename":"CHI16/p470","authors":["Joseph Jay Williams","Tania Lombrozo","Anne Hsu","Bernd Huber","Juho Kim"],"conference":"CHI '16"}