{"paperId":2858298,"citation":[],"reference":[{"content":"Hugh Beyer and Karen Holtzblatt. 1998. Contextual design: defining customer-centered systems. Retrieved from http://dl.acm.org/citation.cfm?id=286067","paperID":"None"},{"content":"Staffan Björk and Jussi Holopainen. 2004. Patterns in game design (game development series).","paperID":"None"},{"content":"Richard Borovoy, Fred Martin, Mitchei Resnick, Brian Sflverman, and Chris Hancock. 1998. Meme Tags and Community Mirrors?: Moving from Conferences to Collaboration. Proceedings of the 1998 ACM conference on Computer supported cooperative work, ACM Press, 159-168. http://doi.org/10.1145/289444.289490","paperID":"None"},{"content":"Roger Caillois and Mayer Barash. 1961. Man, play, and games. University of Illinois Press.","paperID":"None"},{"content":"Dominique T. Chlup. Breaking the Ice: Using Icebreakers and Re-energizers with Adult Learners.","paperID":"None"},{"content":"Reg Dennick and Kate Exley. 2004. Small group teaching: Tutorials, seminars and beyond. Routledge.","paperID":"None"},{"content":"Julie Dixon, Heather Crooks, and Karen Henry. 2006. Breaking the ice: Supporting collaboration and the development of community online. Canadian Journal of Learning and Technology / La revue canadienne de l'apprentissage et de la technologie 32.","paperID":"None"},{"content":"Pradthana Jarusriboonchai, Thomas Olsson, and Kaisa Väänänen-Vainio-Mattila. 2014. User experience of proactive audio-based social devices: a wizard-of-oz study. Proceedings of the 13th International Conference on Mobile and Ubiquitous Multimedia MUM '14, ACM Press, 98-106. http://doi.org/10.1145/2677972.2677995","paperID":"None"},{"content":"Viirj Kan, Katsuya Fujii, Judith Amores, Chang Long Zhu Jin, Pattie Maes, and Hiroshi Ishii. 2015. Social Textiles: Social Affordances and Icebreaking Interactions Through Wearable Social Messaging. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '14, ACM Press, 619-624. http://doi.org/10.1145/2677199.2688816","paperID":"None"},{"content":"Marie Kavanagh, Marilyn Clark-Murphy, and Leigh N Wood. 2011. The First Class: Using Icebreakers to Facilitate Transition in a Tertiary Environment. Asian Social Science 7, 4, 84. http://doi.org/10.5539/ass.v7n4p84","paperID":"None"},{"content":"Scott R. Klemmer, Björn Hartmann, and Leila Takayama. 2006. How bodies matter: five themes for interaction design. Proceedings of the 6th ACM conference on Designing Interactive systems DIS '06, ACM Press, 140. http://doi.org/10.1145/1142405.1142429","paperID":"None"},{"content":"Stefan Kreitmayer, Yvonne Rogers, Robin Laney, and Stephen Peake. 2013. UniPad: orchestrating collaborative activities through shared tablets and an integrated wall display. Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing - UbiComp '13, ACM Press, 801-810. http://doi.org/10.1145/2493432.2493506","paperID":"None"},{"content":"Peter Gall Krogh and Marianne Graves Petersen. 2010. Designing for Collective Interaction: Toward Desirable Spaces in Homes and Libraries. From CSCW to Web 2.0: European Developments in Collaborative Design, 97-113. http://doi.org/10.1007/978--1--84882--965--7","paperID":"None"},{"content":"Peter Krogh, Martin Ludvigsen, and Andreas LykkeOlesen. 2004. \"Help Me Pull That Cursor\" A Collaborative Interactive Floor Enhancing Community Interaction. Australasian Journal of Information Systems 11, 2. http://doi.org/10.3127/ajis.v11i2.126","paperID":"None"},{"content":"David W. McDonald, Joseph F. McCarthy, Suzanne Soroczak, David H. Nguyen, and Al M. Rashid. 2008. Proactive displays: Supporting Awareness in Fluid Social Environment. ACM Transactions on ComputerHuman Interaction 14, 4, 1-31. http://doi.org/10.1145/1314683.1314684","paperID":"None"},{"content":"Stanley Milgram, John Sabini, and Maury Silver. 1992. The individual in a social world: Essays and experiments. Mcgraw-Hill Book Company.","paperID":"None"},{"content":"Maaz Nasir, Kelly Lyons, Rock Leung, and Ali Moradian. 2013. Cooperative Games and Their Effect on Group Collaboration. Design Science at the Intersection of Physical and Virtual Design 7939, 502- 510.","paperID":"None"},{"content":"Glennys Parsell. 1998. Educational principles underpinning successful shared learning. Medical Teacher.","paperID":"None"},{"content":"Anne Marie Piper, Eileen O'Brien, Meredith Ringel Morris, and Terry Winograd. 2006. SIDES: a cooperative tabletop computer game for social skills development. Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work CSCW '06, ACM Press, 1. http://doi.org/10.1145/1180875.1180877","paperID":"None"},{"content":"Evie Powell, Rachel Brinkman, Tiffany Barnes, and Veronica Catete. 2012. Table tilt: making friends fast. Proceedings of the International Conference on the Foundations of Digital Games - FDG '12, ACM Press, 242. http://doi.org/10.1145/2282338.2282386","paperID":"None"},{"content":"Yvonne Rogers and Harry Brignull. Subtle icebreaking?: encouraging socializing and interaction around a large public display.","paperID":"None"},{"content":"Katie Salen and Eric Zimmerman. 2004. Rules of play: Game design fundamentals. MIT press.","paperID":"None"},{"content":"Johan Sanneblad and Lars Erik Holmquist. 2004. \"Why Is Everyone Inside Me?!\" Using Shared Displays in Mobile Computer Games. Springer Berlin Heidelberg, Berlin, Heidelberg. http://doi.org/10.1007/b99837","paperID":"None"},{"content":"Edward Scannell and John Newstorm. 1980. Games trainers play. In What Works at Work, G Dixon (ed.). 160-167.","paperID":"None"},{"content":"Jason Stewart, Benjamin B. Bederson, and Allison Druin. 1999. Single display groupware: A Model for Co-present Collaboration. Proceedings of the SIGCHI conference on Human factors in computing systems the CHI is the limit CHI '99, ACM Press, 286-293. http://doi.org/10.1145/302979.303064","paperID":"None"},{"content":"Christine Szentgyorgyi, Michael Terry, and Edward Lank. 2008. Renegade gaming: practices surrounding social use of the Nintendo DS handheld gaming system. Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems CHI '08, ACM Press, 1463. http://doi.org/10.1145/1357054.1357283","paperID":"None"},{"content":"Edie West. 1999. The big book of icebreakers: quick, fun activities for energizing meetings and workshops. McGraw Hill Professional.","paperID":"None"},{"content":"Jennifer Yoon, Jun Oishi, Jason Nawyn, Kazue Kobayashi, and Neeti Gupta. 2004. FishPong?: Encouraging Human-to-Human Interaction in Informal Social Environments. 374-377.","paperID":"None"},{"content":"J. P. Zagal. 2006. Collaborative games: Lessons learned from board games. Simulation & Gaming 37, 1, 24-40. http://doi.org/10.1177/1046878105282279","paperID":"None"},{"content":"Yan Zhang and Barbara M Wildemuth. 2005. Qualitative Analysis of Content Application of social research methods to questions in information and library science. 1-12.","paperID":"None"},{"content":"Jun Zheng, Elizabeth Veinott, Nathan Bos, Judith S. Olson, and Gary M. Olson. 2002. Trust without touch: jump-starting long-distance trust with initial social activities. Proceedings of the SIGCHI conference on Human factors in computing systems Changing our world, changing ourselves CHI '02, ACM Press, 141. http://doi.org/10.1145/503376.503402","paperID":"None"}],"abstract":"In collaboration between strangers, group formation and familiarization often take a lot of time. To facilitate this, icebreaking activities are commonly utilized, aiming at a positive and relaxing social atmosphere. To explore how interactive technology could serve as a tool in such social activity, we developed Who's Next, a multiplayer quiz-based mobile game intended to break the ice in a group of strangers. The design utilizes the information asymmetry between people, aiming to encourage joint activity between them. We conducted six evaluation sessions where four to six participants in each played the game together and were interviewed. Who's Next was found to be a promising support for icebreaking. It was considered to offer a comfortable way of sharing information about oneself and getting to know newly-met strangers. We conclude that interactive technology could successfully support the facilitator role in encouraging interaction and creating a relaxed atmosphere between strangers.","title":"Design and Evaluation of a Multi-Player Mobile Game for Icebreaking Activity","filename":"CHI16/p4366","authors":["Pradthana Jarusriboonchai","Aris Malapaschas","Thomas Olsson"],"conference":"CHI '16"}