{"paperId":2858179,"citation":[],"reference":[{"content":"Sebastian Boring, David Ledo, Xiang 'Anthony' Chen, Nicolai Marquardt, Anthony Tang, and Saul Greenberg. 2012. The fat thumb: using the thumb's contact size for single-handed mobile interaction. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services (MobileHCI '12). ACM, NY, NY, USA, 39--48. http://doi.acm.org/10.1145/2371574.2371582","paperID":"None"},{"content":"Stephen Brewster, Joanna Lumsden, Marek Bell, Malcolm Hall, and Stuart Tasker. 2003. Multimodal 'eyes-free' interaction techniques for wearable devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 473--480. http://doi.acm.org/10.1145/642611.642694","paperID":"None"},{"content":"Business Insider. 2015. \"The Wearables Report: Growth Trends, Consumer Attitudes, and Why Smartwatches Will Dominate.\" Business report. Business Insider (21 May 2015). Retrieved 03 Sept. 2015 from http://www.businessinsider.com/thewearable-computing-market-report-2014-10","paperID":"None"},{"content":"Xiang Cao, A.D. Wilson, R. Balakrishnan, K. Hinckley, K and S.E. Hudson. 2008. ShapeTouch: Leveraging contact shape on interactive surfaces. In Proceedings of the 3rd IEEE International Workshop on Horizontal Interactive Human Computer Systems (TABLETOP 2008). IEEE Computer Society, Washington, DC, USA, 129--136 doi:10.1109/TABLETOP.2008.4660195","paperID":"None"},{"content":"Marta E. Cecchinato, Anna L. Cox, and Jon Bird. 2015. Smartwatches: the Good, the Bad and the Ugly?. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 2133--2138. http://doi.acm.org/10.1145/2702613.2732837","paperID":"None"},{"content":"Youli Chang, Sehi L'Yi, Kyle Koh, and Jinwook Seo. 2015. Understanding Users' Touch Behavior on Large Mobile Touch-Screens and Assisted Targeting by Tilting Gesture. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 14991508. http://doi.acm.org/10.1145/2702123.2702425","paperID":"None"},{"content":"The Economist. 2013. A Heart to My Key. News Report. The Economist Newspaper (09 May 2013). Retrieved 03 Sept. 2015 from http://www.economist. com/blogs/babbage/2013/05/biometrics","paperID":"None"},{"content":"Augusto Esteves, Eduardo Velloso, Andreas Bulling, Hans Gellersen. 2015. Orbits: Enabling Gaze Interaction in Smart Watches using Moving Targets. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 617--621. 419--422. http://dl.acm.org/citation.cfm?doid=2800835.2800942.","paperID":"None"},{"content":"Andrew Fitzgibbon, Maurizio Pilu, and Robert B. Fisher. 1999. Direct least square fitting of ellipses. IEEE Transactions on Pattern Analysis and Machine Intelligence, 21, 5: 476--480.","paperID":"None"},{"content":"Mayank Goel, Jacob Wobbrock, and Shwetak Patel. 2012. GripSense: using built-in sensors to detect hand posture and pressure on commodity mobile phones. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, NY, NY, USA, 545--554. http://doi.acm.org/10.1145/2380116.2380184","paperID":"None"},{"content":"Christian Holz, Senaka Buthpitiya, and Marius Knaust. 2015. Bodyprint: Biometric User Identification on Mobile Devices Using the Capacitive Touchscreen to Scan Body Parts. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 30113014. http://dx.doi.org/10.1145/2702123.2702518","paperID":"None"},{"content":"Hara, Kiyotaka, Takeshi Umezawa, and Noritaka Osawa. 2015. Effect of Button Size and Location When Pointing with Index Finger on Smartwatch. Human-Computer Interaction: Interaction Technologies. Springer Intl. Publishing, 2015. 165174. http://dx.doi.org/10.1007/978-3-319-20916-6_16","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2009. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09). ACM, NY, NY, USA, 121--124. http://doi.acm.org/10.1145/1622176.1622199","paperID":"None"},{"content":"Daniel Harrison, Paul Marshall, Nadia BianchiBerthouze, and Jon Bird. 2015. Activity tracking: barriers, workarounds and customisation. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 617--621. http://doi.acm.org/10.1145/2750858.2805832","paperID":"None"},{"content":"Jonggi Hong, Seongkook Heo, Poika Isokoski, and Geehyuk Lee. 2015. SplitBoard: A Simple Split Soft Keyboard for Wristwatch-sized Touch Screens. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1233--1236. http://doi.acm.org/10.1145/2702123.2702273","paperID":"None"},{"content":"Da-Yuan Huang, Ming-Chang Tsai, Ying-Chao Tung, Min-Lun Tsai, Yen-Ting Yeh, Liwei Chan, Yi-Ping Hung, and Mike Y. Chen. 2014. TouchSense: expanding touchscreen input vocabulary using different areas of users' finger pads. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 189192. http://doi.acm.org/10.1145/2556288.2557258","paperID":"None"},{"content":"Gierad Laput, Robert Xiao, Xiang 'Anthony' Chen, Scott E. Hudson, and Chris Harrison. 2014. Skin buttons: cheap, small, low-powered and clickable fixed-icon laser projectors. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, NY, NY, USA, 389--394. http://doi.acm.org/10.1145/2642918.2647356","paperID":"None"},{"content":"Luis A. Leiva, Alireza Sahami, Alejandro Catala, Niels Henze, and Albrecht Schmidt. 2015. Text Entry on Tiny QWERTY Soft Keyboards. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 669--678. http://doi.acm.org/10.1145/2702123.2702388","paperID":"None"},{"content":"Ian Oakley and Doyoung Lee. 2014. Interaction on the edge: offset sensing for small devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 169--178. http://doi.acm.org/10.1145/2556288.2557138","paperID":"None"},{"content":"Ian Oakley, DoYoung Lee, MD. Rasel Islam, and Augusto Esteves. 2015. Beats: Tapping Gestures for Smart Watches. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1237--1246. http://doi.acm.org/10.1145/2702123.2702226","paperID":"None"},{"content":"Simon T. Perrault, Eric Lecolinet, James Eagan, and Yves Guiard. 2013. Watchit: simple gestures and eyesfree interaction for wristwatches and bracelets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1451--1460. http://doi.acm.org/10.1145/2470654.2466192","paperID":"None"},{"content":"Simon Rogers, John Williamson, Craig Stewart, and Roderick Murray-Smith. 2011. AnglePose: robust, precise capacitive touch tracking via 3d orientation estimation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2575--2584. http://doi.acm.org/10.1145/1978942.1979318","paperID":"None"},{"content":"Anne Roudaut, Eric Lecolinet, and Yves Guiard. 2009. MicroRolls: expanding touch-screen input vocabulary by distinguishing rolls vs. slides of the thumb. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 927--936. http://doi.acm.org/10.1145/1518701.1518843","paperID":"None"},{"content":"Ted Selker. 2008. Touching the future. Commun. ACM 51, 12 (December 2008), 14--16. http://doi.acm.org/10.1145/1409360.1409366","paperID":"None"},{"content":"Katie A. Siek, Yvonne Rogers, and Kay H. Connelly. 2005. Fat finger worries: how older and younger users physically interact with PDAs. In Proceedings of the 2005 IFIP TC13 international conference on HumanComputer Interaction (INTERACT'05), SpringerVerlag, Berlin, Heidelberg, 267--280. http://dx.doi.org/10.1007/11555261_24","paperID":"None"},{"content":"Feng Wang, Xiang Cao, Xiangshi Ren, and Pourang Irani. 2009. Detecting and leveraging finger orientation for interaction with direct-touch surfaces. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09). ACM, NY, NY, USA, 23--32. http://doi.acm.org/10.1145/1622176.1622182","paperID":"None"},{"content":"Daniel Wigdor, Hrvoje Benko, John Pella, Jarrod Lombardo, and Sarah Williams. 2011. Rock & rails: extending multi-touch interactions with shape gestures to enable precise spatial manipulations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI '11). ACM, NY, USA, 1581--1590. http://doi.acm.org/10.1145/1978942.1979173","paperID":"None"},{"content":"Ying Yin, Tom Yu Ouyang, Kurt Partridge, and Shumin Zhai. 2013. Making touchscreen keyboards adaptive to keys, hand postures, and individuals: a hierarchical spatial backoff model approach. InProceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2775--2784. http://doi.acm.org/10.1145/2470654.2481384","paperID":"None"},{"content":"Robert Xiao, Gierad Laput, and Chris Harrison. 2014. Expanding the input expressivity of smartwatches with mechanical pan, twist, tilt and click. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, USA, 193--196. http://doi.acm.org/10.1145/2556288.2557017","paperID":"None"},{"content":"Jia Zhou, Jie Zhang, Bingjun Xie, Ning Liu, Ming Jiang, Huilin Wang, and Qiqing Gan. 2014. First-Time User Experience with Smart Phone New Gesture Control Features. In Cross-Cultural Design. Springer International Publishing, 2014, 262--271. http://dx.doi.org:8080/10.1007/978-3-319-07308-8_26","paperID":"None"}],"abstract":"Smartwatches are emerging device category that feature highly limited input and display surfaces. We explore how touch contact areas, such as lines generated by flat fingers, can be used to increase input expressivity in these diminutive systems in three ways. Firstly, we present four design themes that emerged from an ideation workshop in which five designers proposed concepts for smartwatch touch area interaction. Secondly, we describe a sensor unit and study that captured user performance with 31 area touches and contrasted this against standard targeting performance. Finally, we describe three demonstration applications that instantiate ideas from the workshop and deploy the most reliably and rapidly produced area touches. We report generally positive user reactions to these demonstrators: the area touch interactions were perceived as quick, convenient and easy to learn and remember. Together this work characterizes how designers can use area touches in watch UIs, which area touches are most appropriate and how users respond to this interaction style.","title":"The Flat Finger: Exploring Area Touches on Smartwatches","filename":"CHI16/p4238","authors":["Ian Oakley","Carina Lindahl","Khanh Le","DoYoung Lee","MD. Rasel Islam"],"conference":"CHI '16"}