{"paperId":2858447,"citation":[],"abstract":"Prototypes and prototyping have had a long and important history in the HCI community and have played a highly significant role in creating technology that is easier and more fulfilling to use. Yet, as focus in HCI is expanding to investigate complex matters of human relationships with technology over time in the intimate and contested contexts of everyday life, the notion of a 'prototype' may not be fully sufficient to support these kinds of inquiries. We propose the research product as an extension and evolution of the research prototype to support generative inquiries in this emerging research area. We articulate four interrelated qualities of research products inquiry-driven, finish, fit, and independent and draw on these qualities to describe and analyze five different yet related design research cases we have collectively conducted over the past six years. We conclude with a discussion of challenges and opportunities for crafting research products and the implications they suggest for future design-oriented HCI research.","reference":[{"content":"Sara Backlund, Magnus Gyllenswärd, Anton Gustafsson, Sara Ilstedt Hjelm, Ramia Mazé, and Johan Redström. 2007. STATIC! The Aesthetics of Energy in Everyday Things. Proceedings of Design Research Society Wonderground International Conference 2006.","paperID":"None"},{"content":"Susanne Bødker. 2006. When Second Wave HCI Meets Third Wave Challenges. Proceedings of the 4th Nordic Conference on Human-computer Interaction: Changing Roles, ACM, 1--8. http://doi.org/10.1145/1182475.1182476","paperID":"None"},{"content":"Laurens Boer and Jared Donovan. 2012. Provotypes for Participatory Innovation. Proceedings of the Designing Interactive Systems Conference, ACM, 388--397. http://doi.org/10.1145/2317956.2318014","paperID":"None"},{"content":"Albert Borgmann. 2009. Technology and the Character of Contemporary Life: A Philosophical Inquiry. University of Chicago Press.","paperID":"None"},{"content":"Michael Boyle and Saul Greenberg. 200 Rapidly Prototyping Multimedia Groupware. Proceedings of the 11th International Conference on Distributed Multimedia Systems.","paperID":"None"},{"content":"Marion Buchenau and Jane Fulton Suri. 2000. Experience Prototyping. Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, ACM, 424--433. http://doi.org/10.1145/347642.347802","paperID":"None"},{"content":"Bill Buxton. 200 Sketching User Experiences: Getting the Design Right and the Right Design: Getting the Design Right and the Right Design. Morgan Kaufmann.","paperID":"None"},{"content":"Daisuke Uriu and William Odom. 2016, in press. Designing for Domestic Memorialization and Remembrance: A Field Study of Fenestra in Japan. In Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems (CHI '16), ACM Press.","paperID":"None"},{"content":"Christopher A. Le Dantec, Erika Shehan Poole, and Susan P. Wyche. 200 Values As Lived Experience: Evolving Value Sensitive Design in Support of Value Discovery. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1141--1150. http://doi.org/10.1145/1518701.1518875","paperID":"None"},{"content":"Caitlin DeSilvey. 2006. Observed Decay: Telling Stories with Mutable Things. Journal of Material Culture 11, 3: 318--338. http://doi.org/1177/1359183506068808","paperID":"None"},{"content":"Audrey Desjardins and Ron Wakkary. 2013. Manifestations of everyday design: guiding goals and motivations. Proceedings of the 9th ACM Conference on Creativity & Cognition, ACM, 253--262. http://doi.org/10.1145/2466627.2466643","paperID":"None"},{"content":"Daniel Fallman. 2011. The New Good: Exploring the Potential of Philosophy of Technology to Contribute to Human-computer Interaction. ACM, 1051--1060. http://doi.org/10.1145/1978942.1979099","paperID":"None"},{"content":"Batya Friedman, Peter H. Kahn Jr, Alan Borning, and Alina Huldtgren. 20 Value Sensitive Design and Information Systems. In Early engagement and new technologies: Opening up the laboratory, Neelke Doorn, Daan Schuurbiers, Ibo van de Poel and Michael E. Gorman (eds.). Springer Netherlands, 55--95.","paperID":"None"},{"content":"Batya Friedman and Lisa P. Nathan. 2010. Multi-lifespan Information System Design: A Research Initiative for the Hci Community. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2243--2246. http://doi.org/10.1145/1753326.1753665","paperID":"None"},{"content":"Alan Galey and Stan Ruecker. 2010. How a prototype argues. Literary and Linguistic Computing 25, 4: 405--424. http://doi.org/10.1093/llc/fqq021","paperID":"None"},{"content":"William Gaver, Mike Michael, Tobie Kerridge, et al. 2015. Energy Babble: Mixing Environmentally-Oriented Internet Content to Engage Community Groups. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1115--1124. http://doi.org/10.1145/2702123.2702546","paperID":"None"},{"content":"William W. Gaver, John Bowers, Andrew Boucher, et al. 2004. The Drift Table: Designing for Ludic Engagement. CHI '04 Extended Abstracts on Human Factors in Computing Systems, ACM, 885--900. http://doi.org/10.1145/985921.985947","paperID":"None"},{"content":"Silke Gegenbauer and Elaine M. Huang. 2012. Inspiring the Design of Longer-lived Electronics Through an Understanding of Personal Attachment. Proceedings of the Designing Interactive Systems Conference, ACM, 635--644. http://doi.org/10.1145/2317956.2318052","paperID":"None"},{"content":"Barbara Grosse-Hering, Jon Mason, Dzmitry Aliakseyeu, Conny Bakker, and Pieter Desmet. 2013. Slow Design for Meaningful Interactions. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3431--3440. http://doi.org/10.1145/2470654.2466472","paperID":"None"},{"content":"Lars Hallnäs and Johan Redström. 2001. Slow Technology & Designing for Reflection. Personal Ubiquitous Comput. 5, 3: 201--212. http://doi.org/10.1007/PL00000019","paperID":"None"},{"content":"Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007. The three paradigms of HCI. Alt.chi. Proceedings of CHI '07, ACM Press.","paperID":"None"},{"content":"John Helmes, Alex S. Taylor, Xiang Cao, Kristina Höök, Peter Schmitt, and Nicolas Villar. 2011. Rudiments 1, 2 & 3: Design Speculations on Autonomy. Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 145--152. http://doi.org/10.1145/1935701.1935730","paperID":"None"},{"content":"Julia A. Hendon. 2000. Having and Holding: Storage, Memory, Knowledge, and Social Relations. American Anthropologist 102, 1: 42--53.","paperID":"None"},{"content":"Kristina Höök and Jonas Löwgren. 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Trans. Comput.-Hum. Interact. 19, 3: 23:1--23:18. http://doi.org/10.1145/2362364.2362371","paperID":"None"},{"content":"Stephanie Houde and Charles Hill. 1997. What do prototypes prototype. In Handbook of Human-Computer Interaction. Elsevier, 367--381.","paperID":"None"},{"content":"Elaine M. Huang and Khai N. Truong. 2008. Breaking the Disposable Technology Paradigm: Opportunities for Sustainable Interaction Design for Mobile Phones. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 323--332. http://doi.org/10.1145/1357054.1357110","paperID":"None"},{"content":"Don Ihde. 1990. Technology and the Lifeworld: From Garden to Earth. IN University Press.","paperID":"None"},{"content":"David S. Kirk and Abigail Sellen. 2010. On Human Remains: Values and Practice in the Home Archiving of Cherished Objects. ACM Trans. Comput.-Hum. Interact. 17, 3: 10:1--10:43. http://doi.org/10.1145/1806923.1806924","paperID":"None"},{"content":"Katina T. Lillios. 1999. Objects of Memory: The Ethnography and Archaeology of Heirlooms. Journal of Archaeological Method and Theory 6, 3: 235--262. http://doi.org/10.1023/A:1021999319447","paperID":"None"},{"content":"Youn-kyung Lim, Daesung Kim, Jaesung Jo, and Jong-bum Woo. 2013. Discovery-Driven Prototyping for User-Driven Creativity. IEEE Pervasive Computing 12, 3: 74--80. http://doi.org/10.1109/MPRV.2012.57","paperID":"None"},{"content":"Youn-Kyung Lim, Erik Stolterman, and Josh Tenenberg. 2008. The anatomy of prototypes: Prototypes as filters, prototypes as manifestations of design ideas. ACM Trans. Comput.-Hum. Interact. 15, 2: 7:1--7:27. http://doi.org/10.1145/1375761.1375762","paperID":"None"},{"content":"Ramia Mazé and Johan Redström. 2005. Form and the computational object. Digital Creativity 16, 1: 7--18. http://doi.org/10.1080/14626260500147736","paperID":"None"},{"content":"H Nissenbaum. 1998. Values in the design of computer systems. Computers and Society 28: 38--39.","paperID":"None"},{"content":"William Odom, Richard Banks, David Kirk, Richard Harper, Siân Lindley, and Abigail Sellen. 2012. Technology Heirlooms?: Considerations for Passing Down and Inheriting Digital Materials. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 337--346. http://doi.org/10.1145/2207676.2207723","paperID":"None"},{"content":"William Odom, Richard Harper, Abigail Sellen, David Kirk, and Richard Banks. 2010. Passing on & Putting to Rest: Understanding Bereavement in the Context of Interactive Technologies. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1831--1840. http://doi.org/10.1145/1753326.1753601","paperID":"None"},{"content":"William Odom, James Pierce, Erik Stolterman, and Eli Blevis. 2009. Understanding Why We Preserve Some Things and Discard Others in the Context of Interaction Design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1053--1062. http://doi.org/10.1145/1518701.1518862","paperID":"None"},{"content":"William Odom, Abigail Sellen, Richard Banks, et al. 2014. Designing for Slowness, Anticipation and Re-visitation: A Long Term Field Study of the Photobox. Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1961--1970. http://doi.org/10.1145/2556288.2557178","paperID":"None"},{"content":"Eric Paulos, Tom Jenkins, August Joki, and Parul Vora. 2008. Objects of wonderment. Proceedings of the 7th ACM conference on Designing interactive systems, ACM, 350--359. http://doi.org/10.1145/1394445.1394483","paperID":"None"},{"content":"Larissa Pschetz and Richard Banks. 2013. Long Living Chair. CHI '13 Extended Abstracts on Human Factors in Computing Systems, ACM, 2983--2986. http://doi.org/10.1145/2468356.2479590","paperID":"None"},{"content":"Elizabeth B. N. Sanders and Pieter Jan Stappers. 2014. Probes, toolkits and prototypes: three approaches to making in codesigning. CoDesign 10, 1: 5--14. http://doi.org/10.1080/15710882.2014.888183","paperID":"None"},{"content":"Donald A Schön. 1983. The reflective practitioner: how professionals think in action. Basic Books, New York.","paperID":"None"},{"content":"Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph \"Jofish\" Kaye. 2005. Reflective Design. Proceedings of the 4th Decennial Conference on Critical Computing: Between Sense and Sensibility, ACM, 49--58. http://doi.org/10.1145/1094562.1094569","paperID":"None"},{"content":"Pieter Jan Stappers. 2013. Prototypes as Central Vein for Knowledge Development. In Prototype: Design and Craft in the 21st Century. A&C Black, 185.","paperID":"None"},{"content":"Erik Stolterman and Mikael Wiberg. 2010. Concept-Driven Interaction Design Research. Human-Computer Interaction 25, 2: 95--118. http://doi.org/10.1080/07370020903586696","paperID":"None"},{"content":"Alex S. Taylor and Laurel Swan. 2005. Artful systems in the home. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 641--650. http://doi.org/10.1145/1054972.1055060","paperID":"None"},{"content":"Peter Tolmie, James Pycock, Tim Diggins, Allan MacLean, and Alain Karsenty. 2002. Unremarkable computing. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 399--406. http://doi.org/10.1145/503376.503448","paperID":"None"},{"content":"Peter-Paul Verbeek. 2010. What Things Do: Philosophical Reflections on Technology, Agency, and Design. Penn State Press.","paperID":"None"},{"content":"Peter-Paul Verbeek. 2015. COVER STORY: Beyond Interaction: A Short Introduction to Mediation Theory. interactions 22, 3: 26--31. http://doi.org/10.1145/2751314","paperID":"None"},{"content":"Ron Wakkary, Audrey Desjardins, and Sabrina Hauser. 2015. Unselfconscious Interaction: A Conceptual Construct. Interacting with Computers: iwv018. http://doi.org/10.1093/iwc/iwv018","paperID":"None"},{"content":"Ron Wakkary, Audrey Desjardins, Sabrina Hauser, and Leah Maestri. 2013. A sustainable design fiction: Green practices. ACM Trans. Comput.-Hum. Interact. 20, 4: 23:1--23:34. http://doi.org/10.1145/2494265","paperID":"None"},{"content":"Ron Wakkary and Leah Maestri. 2007. The resourcefulness of everyday design. Proceedings of the 6th ACM SIGCHI conference on Creativity & Cognition, ACM, 163--172. http://doi.org/10.1145/1254960.1254984","paperID":"None"},{"content":"Stephan Wensveen and Ben Matthews. 2015. Prototypes and prototyping in design research. Routledge.","paperID":"None"},{"content":"Xiao Zhang, Ron Wakkary, Leah Maestri, and Audrey Desjardins. 2012. Memory-storming: externalizing and sharing designers' personal experiences. Proceedings of the Designing Interactive Systems Conference, ACM, 524--533. http://doi.org/10.1145/2317956.2318035","paperID":"None"}],"title":"From Research Prototype to Research Product","filename":"CHI16/p2549","authors":["William Odom","Ron Wakkary","Youn-kyung Lim","Audrey Desjardins","Bart Hengeveld","Richard Banks"],"conference":"CHI '16"}