{"paperId":2858170,"citation":[],"reference":[{"content":"Ofer Bergman, Steve Whittaker, and Noa Falk. 2014. Shared files: The retrieval perspective. Journal of the Association for Information Science and Technology 65, 10 (2014), 1949--1963.","paperID":"None"},{"content":"Michael S Bernstein, Eytan Bakshy, Moira Burke, and Brian Karrer. 2013. Quantifying the invisible audience in social networks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 21--30.","paperID":"None"},{"content":"Jeffrey Boase. 2008. Personal networks and the personal communication system: Using multiple media to connect. Information, Communication & Society 11, 4 (2008), 490--508.","paperID":"None"},{"content":"Robert Capra, Emily Vardell, and Kathy Brennan. 2014. File synchronization and sharing: User practices and challenges. Proceedings of the American Society for Information Science and Technology 51, 1 (2014), 1--10.","paperID":"None"},{"content":"Sauvik Das and Adam Kramer. 2013. Self-Censorship on Facebook. In Seventh International AAAI Conference on Weblogs and Social Media.","paperID":"None"},{"content":"Shelly D Farnham and Elizabeth F Churchill. 2011. Faceted identity, faceted lives: Social and technical issues with being yourself online. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work. ACM, 359--368.","paperID":"None"},{"content":"Benjamin M Gross and Elizabeth F. Churchill. 2007. Addressing constraints: Multiple usernames, task spillage and notions of identity. In CHI'07 Extended Abstracts on Human Factors in Computing Systems. ACM, 2393--2398.","paperID":"None"},{"content":"Caroline Haythornthwaite. 2001. Exploring multiplexity: Social network structures in a computer-supported distance learning class. The Information Society 17, 3 (2001), 211--226.","paperID":"None"},{"content":"Yuli Patrick Hsieh. 2012. Online social networking skills: The social affordances approach to digital inequality. First Monday 17, 4 (2012).","paperID":"None"},{"content":"Ellen Isaacs, Alan Walendowski, Steve Whittaker, Diane J. Schiano, and Candace Kamm. 2002. The character, functions, and styles of instant messaging in the workplace. In Proceedings of the 2002 ACM Conference on Computer Supported Cooperative Work. ACM, 11--20.","paperID":"None"},{"content":"Sanjay Kairam, Mike Brzozowski, David Huffaker, and Ed Chi. 2012. Talking in circles: Selective sharing in Google+. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1065--1074.","paperID":"None"},{"content":"Ruogu Kang, Laura Dabbish, Nathaniel Fruchter, and Sara Kiesler. 2015. \"My data just goes everywhere:\" User mental models of the internet and implications for privacy and security. In Eleventh Symposium On Usable Privacy and Security. 39--52.","paperID":"None"},{"content":"Airi Lampinen, Vilma Lehtinen, Asko Lehmuskallio, and Sakari Tamminen. 2011. We're in it together: Interpersonal management of disclosure in social network services. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3217--3226.","paperID":"None"},{"content":"Airi Lampinen, Sakari Tamminen, and Antti Oulasvirta. 2009. All my people right here, right now: Management of group co-presence on a social networking site. In Proceedings of the ACM 2009 International Conference on Supporting Group Work. ACM, 281--290.","paperID":"None"},{"content":"Michelle L Mazurek, JP Arsenault, Joanna Bresee, Nitin Gupta, Iulia Ion, Christina Johns, Daniel Lee, Yuan Liang, Jenny Olsen, Brandon Salmon, and others. 2010. Access control for home data sharing: Attitudes, needs and practices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 645--654.","paperID":"None"},{"content":"Andrew Perrin. 2015. Social Media Usage: 2005--2015. Pew Internet & American Life Project (2015).","paperID":"None"},{"content":"Emilee Rader. 2007. Just email it to me!: Why things get lost in shared file repositories. In GROUP'07 Doctoral Consortium Papers. ACM, 9.","paperID":"None"},{"content":"Emilee Rader. 2010. The effect of audience design on labeling, organizing, and finding shared files. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 777--786.","paperID":"None"},{"content":"Lauren E. Scissors and Darren Gergle. 2013. Back and forth, back and forth: Channel switching in romantic couple conflict. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work. ACM, 237--248.","paperID":"None"},{"content":"Manya Sleeper, Rebecca Balebako, Sauvik Das, Amber Lynn McConahy, Jason Wiese, and Lorrie Faith Cranor. 2013. The post that wasn't: Exploring self-censorship on Facebook. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work. ACM, 793--802.","paperID":"None"},{"content":"Aaron Smith. 2010. Americans and their gadgets. Pew Internet Research (2010).","paperID":"None"},{"content":"Aaron Smith. 2015. US Smartphone Use in 2015. Pew Research Center (2015).","paperID":"None"},{"content":"Frederic Stutzman and Woodrow Hartzog. 2012. Boundary regulation in social media. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work. ACM, 769--778.","paperID":"None"},{"content":"Norman Makoto Su and Gloria Mark. 2008. Communication chains and multitasking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 83--92.","paperID":"None"},{"content":"John C Tang, Jed R Brubaker, and Catherine C Marshall. 2013. What do you see in the cloud? Understanding the cloud-based user experience through practices. In Human-Computer Interaction-INTERACT 2013. Springer, 678--695.","paperID":"None"},{"content":"Pauline EW Van den Berg, Theo A. Arentze, and Harry JP Timmermans. 2012. New ICTs and social interaction: Modelling communication frequency and communication mode choice. New Media & Society 14, 6 (2012), 987--1003.","paperID":"None"},{"content":"Anthony J Viera, Joanne M Garrett, and others. 2005. Understanding interobserver agreement: The Kappa statistic. Fam Med 37, 5 (2005), 360--363.","paperID":"None"},{"content":"Jessica Vitak. 2012. The impact of context collapse and privacy on social network site disclosures. Journal of Broadcasting & Electronic Media 56, 4 (2012), 451--470.","paperID":"None"},{"content":"Jessica Vitak and Jinyoung Kim. 2014. You can't block people offline: Examining how Facebook's affordances shape the disclosure process. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative work & Social computing. ACM, 461--474.","paperID":"None"},{"content":"Amy Voida, Judith S Olson, and Gary M Olson. 2013. Turbulence in the clouds: Challenges of cloud-based information work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2273--2282.","paperID":"None"},{"content":"Stephen Voida, W. Keith Edwards, Mark W. Newman, Rebecca E. Grinter, and Nicolas Ducheneaut. 2006. Share and share alike: Exploring the user interface affordances of file sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 221--230.","paperID":"None"},{"content":"Tara Whalen, Elaine Toms, and James Blustein. 2008. File sharing and group information management. Personal Information Management: PIM 2008 (2008).","paperID":"None"},{"content":"Pamela Wisniewski, Heather Lipford, and David Wilson. 2012. Fighting for my space: Coping mechanisms for SNS boundary regulation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 609--618.","paperID":"None"}],"abstract":"People share personal content online with varied audiences, as part of tasks ranging from conversational-style content sharing to collaborative activities. We use an interview- and diary-based study to explore: 1) what factors impact channel choice for sharing with particular audiences; and 2) what behavioral patterns emerge from the ability to combine or switch between channels. We find that in the context of different tasks, participants match channel features to selective-sharing and other task-based needs, shaped by recipient attributes and communication dynamics. Participants also combine multiple channels to create composite sharing features or reach broader audiences when one channel is insufficient. We discuss design implications of these channel dynamics.","title":"Sharing Personal Content Online: Exploring Channel Choice and Multi-Channel Behaviors","filename":"CHI16/p101","authors":["Manya Sleeper","William Melicher","Hana Habib","Lujo Bauer","Lorrie Faith Cranor","Michelle L. Mazurek"],"conference":"CHI '16"}