{"paperId":2858338,"abstract":"Participatory Design (PD) gives users a voice in the design of technologies they are meant to use. When PD methods are adapted for research with children, design teams need to address additional issues of ethical accountability (e.g., adult-child power relations). While researchers have taken measures to ensure ethical accountability in PD research with children, to our knowledge there has been no work examining how former child design partners view ethical issues surrounding their participation. In this work we ask: How do children view ethical issues around their role on Participatory Design teams? We present findings from surveys and interviews with 12 former child design partners. Findings, identified by the former participants themselves, outline: (i) balancing attribution and anonymity, (ii) promoting ongoing consent and dissent, and (iii) cultivating a balanced design partnership. From these findings we recommend practices for researchers and designers of children's technologies that align with participant views.","citation":[],"reference":[{"content":"Bankert, E. A. and Amdur, R. J. Institutional Review Board: management and function. Jones & Bartlett Learning, 2006.","paperID":"None"},{"content":"Bjerknes, G., Ehn, P. and Kyng, M. Computers and democracy-a Scandinavian challenge. Gower Publishing Ltd, 1987.","paperID":"None"},{"content":"Borning, A. and Muller, M. Next steps for value sensitive design. In Proc. Conference on Human Factors in Computing Systems (2012), 1125--1134.","paperID":"None"},{"content":"Bossen, C., Dindler, C. and Iversen, O. S. Impediments to user gains: experiences from a critical participatory design project. In Proc. Proceedings of the 12th Participatory Design Conference: Research Papers Volume 1 (2012), 31--40.","paperID":"None"},{"content":"Bossen, C., Dindler, C. and Iversen, O. S. User gains and PD aims: assessment from a participatory design project. In Proc. Proceedings of the 11th Biennial Participatory Design Conference (2010), 141--150.","paperID":"None"},{"content":"Bourke, R. and Loveridge, J. Exploring informed consent and dissent through children's participation in educational research. International Journal of Research & Method in Education, 37, 2 (2014), 151165.","paperID":"None"},{"content":"Clegg, T., Bonsignore, E., Yip, J., Gelderblom, H., Kuhn, A., Valenstein, T., Lewittes, B. and Druin, A. Technology for promoting scientific practice and personal meaning in life-relevant learning. In Proc. Proceedings of the 11th International Conference on Interaction Design and Children (2012), 152--161.","paperID":"None"},{"content":"Dockett, S., Perry, B. and Kearney, E. Promoting children's informed assent in research participation. International Journal of Qualitative Studies in Education, 26, 7 (2013), 802--828.","paperID":"None"},{"content":"Druin, A. Cooperative inquiry: developing new technologies for children with children. In Proc. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (1999), 592--599.","paperID":"None"},{"content":"Druin, A. The role of children in the design of new technology. Behaviour and Information Technology, 21, 1 (2002), 1--25.","paperID":"None"},{"content":"Druin, A. and Fast, C. The child as learner, critic, inventor, and technology design partner: An analysis of three years of Swedish student journals. International Journal of Technology and Design Education, 12, 3 (2002), 189--213.","paperID":"None"},{"content":"Fails, J., Guha, M. and Druin, A. Methods and Techniques for Involving Children in the Design of New Technology for Children. Human-Computer Interaction, 6, 2 (2012), 85--166.","paperID":"None"},{"content":"Fails, J., Guha, M. L. and McNally, B. The Ethics of Working with Children in Participatory Design. Interacting with Computers, In Submission.2015).","paperID":"None"},{"content":"Friedman, B. Value-sensitive design. Interactions, 3, 6 (1996), 16--23.","paperID":"None"},{"content":"Garzotto, F. Broadening children's involvement as design partners: from technology to. In Proc. Proceedings of the 7th International Conference on Interaction Design and Children (2008), 186--193.","paperID":"None"},{"content":"Gregory, J. Scandinavian approaches to participatory design. International Journal of Engineering Education, 19, 1 (2003), 62--74.","paperID":"None"},{"content":"Guha, M. L. Understanding the Social and Cognitive Experiences of Children Involved in Technology Design Processes. University of MD, College Park, 2010.","paperID":"None"},{"content":"Guha, M. L., Druin, A., Chipman, G., Fails, J. A., Simms, S. and Farber, A. Mixing ideas: a new technique for working with young children as design partners. In Proc. Proceedings of the 2004 International Conference on Interaction Design and Children (2004), 35--42.","paperID":"None"},{"content":"Guha, M. L., Druin, A. and Fails, J. A. Cooperative Inquiry revisited: Reflections of the past and guidelines for the future of intergenerational co-design. International Journal of Child-Computer Interaction, 1, 1 (2013), 14--23.","paperID":"None"},{"content":"Guha, M. L., Druin, A. and Fails, J. A. Investigating the impact of design processes on children. In Proceedings of the 2010 International Conference on Interaction Design and Children (2010), 198--201.","paperID":"None"},{"content":"Hourcade, J. P. Interaction design and children. Foundations and Trends in Human-Computer Interaction, 1, 4 (2008), 277--392.","paperID":"None"},{"content":"Hutchinson, H. B., Bederson, B. B. and Druin, A. The evolution of the international children's digital library searching and browsing interface. In Proc. Proceedings of the 2006 International Conference on Interaction Design and Children (2006), 105--112.","paperID":"None"},{"content":"Hutchinson, H. B., Druin, A. and Bederson, B. B. Supporting elementary-age children's searching and browsing: Design and evaluation using the international children's digital library. Journal of the American Society for Information Science and Technology, 58, 11 (2007), 1618--1630.","paperID":"None"},{"content":"Iversen, O. S. and Smith, R. C. Scandinavian participatory design: dialogic curation with teenagers. In Proc. Proceedings of the 11th International Conference on Interaction Design and Children (2012), 106--115.","paperID":"None"},{"content":"Large, A., Nesset, V., Beheshti, J. and Bowler, L. \"Bonded design\": A novel approach to intergenerational information technology design. Library & Information Science Research, 28, 1 (2006), 64--82.","paperID":"None"},{"content":"Lee, T. Y., Mauriello, M. L., Ahn, J. and Bederson, B. B. CTArcade: Computational thinking with games in school age children. International Journal of ChildComputer Interaction, 2, 1 (2014), 26--33.","paperID":"None"},{"content":"Martin, D. G. Bureacratizing ethics: Institutional review boards and participatory research. ACME: An International E-Journal for Critical Geographies, 6, 3 (2007), 319--328.","paperID":"None"},{"content":"Morrow, V. and Richards, M. The ethics of social research with children: An overview. Children & Society, 10, 2 (1996), 90--105.","paperID":"None"},{"content":"Muller, M. J. and Kuhn, S. Participatory design. Communications of the ACM, 36, 6 (1993), 24--28.","paperID":"None"},{"content":"Office of the Secretary of The National Commission for the Protection of Human Subjects of Biomedical and Behavioral Research. The Belmont report: Ethical principles and guidelines for the protection of human subjects of research. Department of Health, Education, and Welfare, 1979.","paperID":"None"},{"content":"Quinn, A. J., Bederson, B. B., Bonsignore, E. and Druin, A. StoryKit: Designing a Mobile Application for Story Creation By Children and Older Adults (2009).","paperID":"None"},{"content":"Read, J. C., Fitton, D. and Hortton, M. Giving ideas an equal chance: inclusion and representation in participatory design with children. In Proc. Proceedings of the 2014 International Conference on Interaction Design and Children (2014), 105--114.","paperID":"None"},{"content":"Read, J. C., Horton, M., Sim, G., Gregory, P., Fitton, D. and Cassidy, B. CHECk: a tool to inform and encourage ethical practice in participatory design with children. In Proc. CHI'13 Extended Abstracts on Human Factors in Computing Systems (2013), 187192.","paperID":"None"},{"content":"Scaife, M., Rogers, Y., Aldrich, F. and Davies, M. Designing for or designing with Informant design for interactive learning environments. In Proc. Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (1997), 343350.","paperID":"None"},{"content":"Strauss, A. L. and Corbin, J. M. Basics of Qualitative Research. Sage Newbury Park, CA, 1990.","paperID":"None"},{"content":"Thomas, N. and O'Kane, C. The ethics of participatory research with children. Children & Society, 12, 5 (1998), 336--348.","paperID":"None"},{"content":"US Department of the Interior. Every Kid in a Park, www.everykidinapark.gov. 2015.","paperID":"None"},{"content":"Viera, A. J. and Garrett, J. M. Understanding interobserver agreement: the kappa statistic. Fam Med, 37, 5 (2005), 360--363.","paperID":"None"},{"content":"Vitak, J., Shilton, K. and Ashktorab, Z. Beyond the Belmont Principles: Ethical Challenges, Practices, and Beliefs in the Online Data Research Community. In Proc. Computer Supported Cooperative Work (CSCW) (2016), To Appear.","paperID":"None"},{"content":"Walsh, G., Foss, E., Yip, J. and Druin, A. FACIT PD: a framework for analysis and creation of intergenerational techniques for participatory design. In Proc. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2013), 28932902.","paperID":"None"},{"content":"Yip, J., Ahn, J., Clegg, T., Bonsignore, E., Pauw, D. and Gubbels, M. It helped me do my science.: a case of designing social media technologies for children in science learning. In Proc. Proceedings of the 2014 International Conference on Interaction Design and Children (2014), 155--164.","paperID":"None"}],"title":"Children's Perspectives on Ethical Issues Surrounding Their Past Involvement on a Participatory Design Team","filename":"CHI16/p3595","authors":["Brenna McNally","Mona Leigh Guha","Matthew Louis Mauriello","Allison Druin"],"conference":"CHI '16"}