{"paperId":2858274,"reference":[{"content":"Tamara Adlin and John Pruitt. 2010. The Essential Persona Lifecycle: Your Guide to Building and Using Personas. Morgan Kaufmann/Elsevier.","paperID":"None"},{"content":"Catherine Ashcraft and Wendy Dubow The Tricky (And Necessary) Business of Being A Male Advocate For Gender Equality. 2015. Retrieved September 24th, 2015 from http://www.fastcompany.com/3046555/strong-femalelead/the-tricky-and-necessary-business-of-being-amale-advocate-for-gender-equ","paperID":"None"},{"content":"Albert Bandura. 1986. Social Foundations of Thought and Action. Prentice Hall.","paperID":"None"},{"content":"Shaowen Bardzell. 2010. Feminist HCI: Taking stock and outlining an agenda for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1301--1310. http://doi.acm.org/10.1145/1753326.1753521","paperID":"None"},{"content":"Laura Beckwith, Margaret Burnett, Susan Wiedenbeck, Curtis Cook, Shraddha Sorte, and Michelle Hastings. 2005. Effectiveness of end-user debugging software features: Are there gender issues? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 869--878. http://doi.acm.org/10.1145/1054972.1055094","paperID":"None"},{"content":"Laura Beckwith, Cory Kissinger, Margaret Burnett, Susan Wiedenbeck, Joseph Lawrance, Alan Blackwell, and Curtis Cook. 2006. Tinkering and gender in enduser programmers' debugging. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 231--240. http://doi.acm.org/10.1145/1124772.1124808","paperID":"None"},{"content":"Laura Beckwith, Derek Inman, Kyle Rector, and Margaret Burnett. 2007. On to the real world: Gender and self-efficacy in Excel. In Proceedings of the IEEE Symposium on Visual Languages and Human-Centric Computing (VLHCC '07). 119--126. http://dx.doi.org/10.1109/VLHCC.2007.42","paperID":"None"},{"content":"Michelle A. Borkin, Chelsea S. Yeh, Madelaine Boyd, Peter Macko, Krzysztof Z. Gajos, Margo Seltzer, and Hanspeter Pfister. 2013. Evaluation of filesystem provenance visualization tools. IEEE Transactions on Visualization and Computer Graphics 19, 12 (December 2013), 2476--2485. http://dx.doi.org/10.1109/TVCG.2013.155","paperID":"None"},{"content":"Adam Bradley, Cayley MacArthur, Mark Hancock, and Sheelagh Carpendale. 2015. Gendered or neutral? Considering the language of HCI, In Proceedings of the 41st Graphics Interface Conference (GI '15), 163--170.","paperID":"None"},{"content":"Leah Buechley and Michael Eisenberg. 2008. The LilyPad Arduino: Toward wearable engineering for everyone. IEEE Pervasive Computing 7, 2 (April 2008), 12--15. http://dx.doi.org/10.1109/MPRV.2008.38","paperID":"None"},{"content":"Leah Buechley and Benjamin Mako Hill. 2010. LilyPad in the Wild: How hardware's long tail is supporting new engineering and design communities. In Proceedings of the 8th ACM Conference on Designing Interactive systems (DIS '10), 199--207. http://doi.acm.org/10.1145/1858171.1858206","paperID":"None"},{"content":"Margaret Burnett, Laura Beckwith, Susan Wiedenbeck, Scott D. Fleming, Jill Cao, Thomas H. Park, Valentia Grigoreanu, and Kyle Rector. 2011. Gender pluralism in problem-solving software. Interacting with Computers, 23, 5 (September 2011), 450--460. http://dx.doi.org/10.1016/j.intcom.2011.06.004","paperID":"None"},{"content":"Margaret Burnett, Scott D. Fleming, Shamsi Iqbal, Gina Venolia, Vidya Rajaram, Umer Farooq, Valentina Grigoreanu, and Mary Czerwinski. 2010. Gender differences and programming environments: across programming populations. In Proceedings of the 2010 ACM-IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM '10). 10 pages. http://doi.acm.org/10.1145/1852786.1852824","paperID":"None"},{"content":"Margaret Burnett, Simone Stumpf, Jamie Macbeth, Stephann Makri, Laura Beckwith, Irwin Kwan, Anicia Peters, William Jernigan, GenderMag: A method for evaluating software's gender inclusiveness, Interacting with Computers (to appear). DOI 10.1093/iwc/iwv046","paperID":"None"},{"content":"Margaret Burnett, Simone Stumpf, Laura Beckwith, and Anicia Peters, The GenderMag Kit: How to Use the GenderMag Method to Find Inclusiveness Issues through a Gender Lens, Retrieved Oct. 10, 2015, from http://eusesconsortium.org/gender.","paperID":"None"},{"content":"Judith Butler. 1999. Gender Trouble: Feminism and the Subversion of Identity. Routledge.","paperID":"None"},{"content":"Patricia Cafferata and Alice M. Tybout. 1989. Gender Differences in Information Processing: A Selectivity Interpretation, Cognitive and Affective Responses to Advertising. Lexington Books.","paperID":"None"},{"content":"Jill Cao, Kyle Rector, Thomas H. Park, Scott D. Fleming, Margaret Burnett, and Susan Wiedenbeck. 2010. A debugging perspective on end-user mashup programming. In Proceedings of the 2010 IEEE Symposium on Visual Languages and Human-Centric Computing (VLHCC '10), 149--156. http://dx.doi.org/10.1109/VLHCC.2010.29","paperID":"None"},{"content":"Justine Cassell. 2002. Genderizing HCI. In The Handbook of Human-Computer Interaction, Julie A. Jacko and Andrew Sears (Eds.). L. Erlbaum Associates Inc., Hillsadale, NJ, USA 402--411.","paperID":"None"},{"content":"Shuo Chang, Vikas Kumar, Eric Gilbert, and Loren G. Terveen. 2014. Specialization, homophily, and gender in a social curation site: Findings from Pinterest. In Proceedings of the 17th ACM conference on Computer Supported Cooperative Work & Social Computing (CSCW '14), 674--686. http://doi.acm.org/10.1145/2531602.2531660","paperID":"None"},{"content":"Gary Charness and Uri Gneezy. 2012. Strong evidence for gender differences in risk taking. Journal of Economic Behavior & Organization 83, 1 (June 2012), 50--58.","paperID":"None"},{"content":"Constantinos Coursaris, Sarah Swierenga, and Ethan Watrall. 2008. An empirical investigation of color temperature and gender effects on web aesthetics. Journal of Usability Studies 3, 3 (May 2008), 103--117.","paperID":"None"},{"content":"Thomas Dohmen, Armin Falk, David Huffman, Uwe Sunde, Jürgen Schupp, and Gert G. Wagner. 2011. Individual risk attitudes: measurement, determinants, and behavioral consequences. Journal of the European Economic Association 9, 3 (April 2009), 522--550.","paperID":"None"},{"content":"Alan Durndell and Zsolt Haag. 2002. Computer self efficacy, computer anxiety, attitudes towards the Internet and reported experience with the Internet, by gender, in an East European sample. Computers in Human Behavior 18, 521--535.","paperID":"None"},{"content":"Executive Office of the President. 2013. Women and Girls in Science, Technology, Engineering, and Math (STEM). Retrieved September 24th, 2015 from www.whitehouse.gov/ostp/women","paperID":"None"},{"content":"Erin Friess. 2012. Personas and decision making in the design process: An ethnographic case study. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1209--1218. http://doi.acm.org/10.1145/2207676.2208572","paperID":"None"},{"content":"Valentina Grigoreanu, Margaret Burnett, and George Robertson. 2010. A strategy-centric approach to the design of end-user debugging tools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 713--722. http://doi.acm.org/10.1145/1753326.1753431","paperID":"None"},{"content":"Valentina Grigoreanu, Margaret Burnett, Susan Wiedenbeck, Jill Cao, Kyle Rector, and Irwin Kwan. 2012. End-user debugging strategies: A sensemaking perspective. Transactions on Computer-Human Interaction 19, 1, 5 (May 2012).","paperID":"None"},{"content":"Valentina Grigoreanu, Jill Cao, Todd Kulesza, Christopher Bogart, Kyle Rector, Margaret Burnett, and Susan Wiedenbeck. 2008. Can feature design reduce the gender gap in end-user software development environments? In Proceedings of the 2008 IEEE Symposium on Visual Languages and Human-Centric Computing (VLHCC '08), 149--156. http://dx.doi.org/10.1109/VLHCC.2008.4639077","paperID":"None"},{"content":"Jonathan Grudin. 2006. Why personas work: The psychological evidence. In John Pruitt and Tamara Adlin, The Persona LifeCycle: Keeping People in Mind Throughout Product Design, Morgan Kaufmann Publishers.","paperID":"None"},{"content":"Jonas Hallstrom, Helene Elvstrand, and Kristina Hellberg. 2015. Gender and technology in free play in Swedish early childhood education, Int J. Technology and Design Education, 25, 137--149. DOI 10.1007/s10798-014--9274-z.","paperID":"None"},{"content":"Kathleen Hartzel. 2003. How self-efficacy and gender issues affect software adoption and use. Commun. ACM 46, 9 (September 2003), 167--171. http://doi.acm.org/10.1145/903893.903933","paperID":"None"},{"content":"Weimin Hou, Manpreet Kaur, Anita Komlodi, Wayne G. Lutters, Lee Boot, Shelia R. Cotten, Claudia Morrell, A. Ant Ozok, and Zeynep Tufekci. 2006. \"Girls don't waste time\": Pre-adolescent attitudes toward ICT. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06), 875--880. http://doi.acm.org/10.1145/1125451.1125622","paperID":"None"},{"content":"Ann H. Huffman, Jason Whetten, and William H. Huffman. 2013. Using technology in higher education: The influence of gender roles on technology selfefficacy. Computers in Human Behavior 29, 4, 1779--1786.","paperID":"None"},{"content":"William Jernigan, Amber Horvath, Michael Lee, Margaret Burnett, Taylor Cuilty, Sandeep Kuttal, Anicia Peters, Irwin Kwan, Faezeh Bahmani, and Andrew Ko. 2015. A principled evaluation for a principled Idea Garden. In Proceedings of the 2015 IEEE Symposium on Visual Languages and Human-Centric Computing, October 2015. 8 pages.","paperID":"None"},{"content":"Yasmin B. Kafai and Quinn Burke. 2014. Beyond game design for broadening participation: Building new clubhouses of computing for girls. In Proceedings of Gender and IT Appropriation. Science and Practice on Dialogue -- Forum for Interdisciplinary Exchange (Gender IT '14). 8 pages.","paperID":"None"},{"content":"Caitlin Kelleher. 2009. Barriers to programming engagement. Advances in Gender and Education 1, 5--10.","paperID":"None"},{"content":"Caitlin Kelleher, Randy Pausch, and Sara Kiesler. 2007. Storytelling Alice motivates middle school girls to learn computer programming. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 1455--1464.","paperID":"None"},{"content":"Todd Kulesza, Simone Stumpf, Weng-Keen Wong, Margaret Burnett, Stephen Perona, Andrew Ko, and Ian Oberst. 2011. Why-oriented end-user debugging of naïve Bayes text classification. ACM Trans. Interact. Intell. Syst. 1, 1, Article 2 (October 2011), 31 pages. http://doi.acm.org/10.1145/2030365.2030367","paperID":"None"},{"content":"Michael Lee, Faezeh Bahmani, Irwin Kwan, Jilian Laferte, Polina Charters, Amber Horvath, Fanny Luor, Jill Cao, Catherine Law, Mihcael Bethwetherick, Sheridan Long, Margaret Burnett, and Andrew Ko. 2014. Principles of a debugging-first puzzle game for computing education. In Proceedings of the 2014 IEEE Symposium on Visual Languages and Human-Centric Computing (VLHCC '14), 57--64.","paperID":"None"},{"content":"Michael Lee and Andrew Ko. 2011. Personifying programming tool feedback improves novice programmers' learning. In Proceedings of the 7th International Workshop on Computing Education Research (ICER '11), 109--116. http://doi.acm.org/10.1145/2016911.2016934","paperID":"None"},{"content":"Thomas Mahatody, Mouldi Sagar, and Christopher Kolski. 2010. State of the art on the Cognitive Walkthrough method, its variants and evolutions, International Journal HCI 26, 8 (July 2010), 741--785.","paperID":"None"},{"content":"Jane Margolis and Allan Fisher. 2003. Unlocking the Clubhouse: Women in Computing. MIT Press.","paperID":"None"},{"content":"Tara Matthews, Tejinder Judge, and Steve Whittaker. 2012. How do designers and user experience professionals actually perceive and use personas? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1219--1228. http://doi.acm.org/10.1145/2207676.2208573","paperID":"None"},{"content":"Joan Meyers-Levy and Barbara Loken. 2015. Revisiting gender differences: What we know and what lies ahead. Journal of Consumer Psychology 25, 1, 129149.","paperID":"None"},{"content":"Joan Meyers-Levy and Durairaj Maheswaran. 1991. Exploring differences in males' and females' processing strategies. Journal Consumer Research 18, 63--70.","paperID":"None"},{"content":"National Center for Women & IT. 2014. By the numbers, Version 02282014. Retrieved September 24th, 2015 from http://www.ncwit.org/sites/default/files/resources/btn_ 02282014web.pdf","paperID":"None"},{"content":"Lene Nielsen and Kira Storgaard Hansen. 2014. Personas is applicable: A study on the use of personas in Denmark. In Proceedings of the 32nd Annual SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1665--1674. http://doi.acm.org/10.1145/2556288.2557080","paperID":"None"},{"content":"Anne O'Leary-Kelly, Bill Hardgrave, Vicki McKinney, and Darryl Wilson. 2004. The influence of professional identification on the retention of women and racial minorities in the IT workforce. NSF ITWF & ITR/EWF Principal Investigator Conference, 65--69.","paperID":"None"},{"content":"Piazza Blog. 2015. STEM Confidence Gap. Retrieved September 24th, 2015 from http://blog.piazza.com/stem-confidence-gap/","paperID":"None"},{"content":"John Pruitt and Jonathan Grudin. 2003. Personas: Practice and theory. In Proceedings of the 2003 Conference on Designing for User Experiences (DUX '03), 1--15. http://doi.acm.org/10.1145/997078.997089","paperID":"None"},{"content":"René Riedl, Marco Hubert, and Peter Kenning. 2010. Are there neural gender differences in online trust? An fMRI study on the perceived trustworthiness of ebay offers. MIS Quarterly 34, 2 (June 2010), 397--428.","paperID":"None"},{"content":"Jennifer Ann Rode. 2008. An ethnographic examination of the relationship of gender & end-user programming. Ph.D Thesis. University of California Irvine, Irvine, CA.","paperID":"None"},{"content":"Daniela Rosner and Jonathan Bean. 2009. Learning from IKEA hacking: I'm not one to decoupage a tabletop and call it a day. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 419--422. http://doi.acm.org/10.1145/1518701.1518768","paperID":"None"},{"content":"Mary Beth Rosson, Hansa Sinha, and Tisha Edor. 2010. Design planning in end-user web development: gender, feature exploration, and feelings of success. In Proceedings of the IEEE Symposium on Visual Languages and Human-Centric Computing (VLHCC '10), 141--148. http://dx.doi.org/10.1109/VLHCC.2010.28","paperID":"None"},{"content":"Per Runeson, Martin Host, Austen Rainer, and Bjorn Regnell. 2012. Case Study Research in Software Engineering: Guidelines and Examples. Wiley Publishing.","paperID":"None"},{"content":"Steven John Simon. 2001. The impact of culture and gender on web sites: An empirical study. The Data Base for Advances in Information Systems 32, 1 (Winter 2001), 18--37.","paperID":"None"},{"content":"Anil Singh, Vikram Bhadauria, Anurag Jain, and Anil Gurung. 2013. Role of gender, self-efficacy, anxiety and testing formats in learning spreadsheets. Computers in Human Behavior 29, 3 (May 2013), 739--746.","paperID":"None"},{"content":"Rick Spencer. 2000. The Streamlined Cognitive Walkthrough Method, Working Around Social Constraints Encountered in a Software Development Company. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00), 353359. http://doi.acm.org/10.1145/332040.332456","paperID":"None"},{"content":"Neeraja Subrahmaniyan, Laura Beckwith, Valentina Grigoreanu, Margaret Burnett, Susan Wiedenbeck, Vaishnavi Narayanan, Karin Bucht, Russell Drummond, and Xiaoli Fern. 2008. Testing vs. code inspection vs. ... what else? Male and female end users' debugging strategies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), ACM, 617--626.","paperID":"None"},{"content":"Desney S. Tan, Mary Czerwinski, and George Robertson. 2003. Women go with the (optical) flow. In Proceedings of the SIGCHI Conference on Human Factos in Computing Systems (CHI '03), 209--215. http://doi.acm.org/10.1145/642611.642649","paperID":"None"},{"content":"Elke U. Weber, Ann-Renée Blais, and Nancy E. Betz. 2002. A domain-specific risk-attitude scale: Measuring risk perceptions and risk behaviors. Journal of Behavioral and Decision Making 15, 263--290.","paperID":"None"},{"content":"Cathleen Wharton, John Rieman, Clayton Lewis, and Peter Polson. 1994. The cognitive walkthrough method: A practitioner's guide. In Usability Inspection Methods, Jakob Nielsen and Robert L. Mack (Eds.). John Wiley, NY. 105--140","paperID":"None"},{"content":"Gayna Williams. 2014. Are you sure your software is gender-neutral? Interactions 21, 1 (January 2014), 36--39.","paperID":"None"},{"content":"Robert K. Yin. 2009. Case Study Research: Design and Methods (Fourth Edition). Sage Publications.","paperID":"None"}],"title":"Finding Gender-Inclusiveness Software Issues with GenderMag: A Field Investigation","filename":"CHI16/p2586","authors":["Margaret Burnett","Anicia Peters","Charles Hill","Noha Elarief"],"conference":"CHI '16","citation":[],"abstract":"Gender inclusiveness in computing settings is receiving a lot of attention, but one potentially critical factor has mostly been overlooked -- software itself. To help close this gap, we recently created GenderMag, a systematic inspection method to enable software practitioners to evaluate their software for issues of gender-inclusiveness. In this paper, we present the first real-world investigation of software practitioners' ability to identify gender-inclusiveness issues in software they create/maintain using this method. Our investigation was a multiple-case field study of software teams at three major U.S. technology organizations. The results were that, using GenderMag to evaluate software, these software practitioners identified a surprisingly high number of gender-inclusiveness issues: 25% of the software features they evaluated had gender-inclusiveness issues."}