{"paperId":2858145,"citation":[],"reference":[{"content":"Adrienne H. Andrew, Gaetano Borriello, James Fogarty. 2013. Simplifying mobile phone food diaries: design and evaluation of a food index-based nutrition diary. In Proceedings of the 7th International Conference on Pervasive Computing Technologies for Healthcare, 260--263.","paperID":"None"},{"content":"Oliver Amft, Mathias Stäger, Paul Lukowicz, and Gerhard Tröster. 2005. Analysis of Chewing Sounds for Dietary Monitoring, UbiComp 2005: Ubiquitous Computing, 3660:56--72. Raymond C Baker, Daniel S. Kirschenbaum. 1993. Self-monitoring may be necessary for successful weight control. Behavior Therapy 24, 3: 377--394.","paperID":"None"},{"content":"Raymond C. Baker, and Daniel S. Kirschenbaum. 1998. Weight control during the holidays: highly consistent self-monitoring as a potentially useful coping mechanism. Health Psychology 17.4: 367.","paperID":"None"},{"content":"Elizabeth Barrett-Connor. 1991. Nutrition epidemiology: how do we know what they ate?. The American journal of clinical nutrition 54, 1:182S--187S.","paperID":"None"},{"content":"Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. 2013. Health Mashups: Presenting statistical patterns between wellbeing data and context in natural language to promote behavior change. ACM Transactions on Computer-Human Interaction (TOCHI) 20.5 (2013): 30. DOI: http://dx.doi.org/10.1145/2503823","paperID":"None"},{"content":"Frank Bentely, and Konrad Tollmar. 2013. The Power of Mobile Notifications to Increase Wellbeing Logging Behavior. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12), 1095--1098. DOI: 10.1145/2470654.2466140","paperID":"None"},{"content":"Lora E. Burke, Melanie Warziski, Terry Starrett, Jina Choo, Edvin Music, Susan Sereika, Susan Stark, and Mary Ann Sevick, 2005. Self-Monitoring Dietary Intake: Current and Future Practices. Journal of Renal Nutrition 15, 3: 281--290.","paperID":"None"},{"content":"Michelle Clare Carter, Victoria Jane Burley, Camilla Nykjaer, Janet Elizabeth Cade. 2013. Adherence to a smartphone application for weight loss compared to website and paper diary: pilot randomized controlled trial. Journal of medical Internet research, 15(4): e32. DOI: 10.2196/jmir.2283","paperID":"None"},{"content":"Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, and Julie A. Kientz. 2015. SleepTight: low-burden, self-monitoring technology for capturing and reflecting on sleep behaviors. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 121--132. DOI: http://dx.doi.org/10.1145/2750858.2804266","paperID":"None"},{"content":"Chia-Fang Chung, Jonathan Cook, Elizabeth Bales, Jasmine Zia, Sean A. Munson. 2015. More Than Telemonitoring: Health Provider Use and Nonuse of Life-Log Data in Irritable Bowel Syndrome and Weight Management. Journal of medical Internet research 17(8): e203. DOI:10.2196/jmir.4364","paperID":"None"},{"content":"Felicia Cordeiro, Elizabeth Bales, Erin Cherry, and James Fogarty. 2015. Rethinking the Mobile Food Journal: Exploring Opportunities for Lightweight Photo-Based Capture. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 3207--3216. http://doi.acm.org/10.1145/2702123.2702154","paperID":"None"},{"content":"Felicia Cordeiro, Daniel A. Epstein, Edison Thomaz, Elizabeth Bales, Arvind K. Jagannathan, Gregory D. Abowd, and James Fogart. 2015. Barriers and Negative Nudges: Exploring Challenges in Food Journaling. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1159--1162.","paperID":"None"},{"content":"Mary Ruth Craig, Alan R. Kristal, Carrie L. Cheney, and Ann L. Shattuck. 2000. The prevalence and impact of 'atypical' days in 4-day food records. Journal of the American Dietetic Association 100, 4: 421--427.","paperID":"None"},{"content":"Sunny Consolvo, Predrag Klasnja, David W. McDonald, Daniel Avrahami, Jon Froehlich, Louis LeGrand, Ryan Libby, Keith Mosher, James A. Landay. 2008. Flowers or a robot army?: encouraging awareness & activity with personal, mobile displays. UbiComp '08 Proceedings of the 10th international conference on Ubiquitous computing. 54--63.","paperID":"None"},{"content":"Carolyn Ehrlich, Elizabeth Kendall, Nicolette Frey, Michelle Denton, and Steve Kisely. 2015. Consensus building to improve the physical health of people with severe mental illness: a qualitative outcome mapping study. BMC Health Services Research 15:83.","paperID":"None"},{"content":"Block Gladys. 1982. A review of validations of dietary assessment methods. American journal of epidemiology 115, 4: 492--505.","paperID":"None"},{"content":"John C. Guare, Rena R.Wing, Marsha D. Marcus, Leonard H. Epstein, List R. Burton, and William E. Gooding. 1989. Analysis of changes in eating behavior and weight loss in type II diabetic patients: which behaviors to change. Diabetes Care 12, 7: 500--503.","paperID":"None"},{"content":"Michael R. Hufford, Saul Shiffman. 2003. Assessment methods for patient-reported outcomes. Disease Management & Health Outcomes 11, 2:77--86.","paperID":"None"},{"content":"G Biro, KFAM Hulshof, L Ovesen, JA Amorim Cruz for the EFCOSUM Group. 2002. Selection of methodology to assess food intake. European journal of clinical nutrition, 56: S25--32.","paperID":"None"},{"content":"Frederick H. Kanfer. 1970. Self-monitoring: Methodological limitations and clinical applications. Journal of consulting and clinical psychology 35, 2:148--152.","paperID":"None"},{"content":"Matthew L. Lee, Anind K. Dey. 2014. Real-time feedback for improving medication taking. CHI '14 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2259--2268 DOI: http://dx.doi.org/10.1145/2556288.2557210","paperID":"None"},{"content":"Arab Lenore, D Estrin, D H Kim, J Burke, and J Goldman. 2011. Feasibility testing of an automated image-capture method to aid dietary recall. European journal of clinical nutrition 65.10 : 1156--1162.","paperID":"None"},{"content":"Using Therapeutic Lifestyle. Can Lifestyle Modifications Using Therapeutic Lifestyle Changes (TLC) Reduce Weight and the Risk for Chronic Disease?. Research to Practice Series, No. 7.","paperID":"None"},{"content":"Jennifer Mankoff, Gray Hsieh, Ho Chak Hung, Sharon Lee, and Elizabeth Nitao. 2002. Using low-cost sensing to support nutritional awareness. UbiComp 2002: Ubiquitous Computing. 2498: 371--378.","paperID":"None"},{"content":"Elina Mattila, Ilkka Korhonen, Jukka H. Salminen, Aino Ahtinen, Esa Koskinen, Antti Sarela, Juha Parkka, and Raimo Lappalainen. 2010. Empowering Citizens for Well-being and Chronic Disease Management With Wellness Diary. Information Technology in Biomedicine, IEEE Transactions on 14, 2: 456--463.","paperID":"None"},{"content":"Tauhidur Rahman, Alexander T. Adams, Mi Zhang, Erin Cherry, Bobby Zhou, Huaishu Peng, Tanzeem Choudhury 2014. BodyBeat: a mobile system for sensing non-speech body sounds. In Proceedings of the 12th annual international conference on Mobile systems, applications, and services, 2--13. DOI: http://dx.doi.org/10.1145/2594368.2594386","paperID":"None"},{"content":"Tana Nilchaikovit, James M. Hill, Jimmie C. Holland. 1993. The effects of culture on illness behavior and medical care: Asian and American differences. General hospital psychiatry, 15(1), 41--50. doi:10.1016/01638343(93)90090-B","paperID":"None"},{"content":"Bernard H. Russell, Gery W. Ryan. 2009. Analyzing qualitative data: Systematic approaches. SAGE publications.","paperID":"None"},{"content":"Dale A. Schoeller. 1990. How accurate is self-reported dietary energy intake?. Nutrition reviews 48, 10: 373379.","paperID":"None"},{"content":"Katie A. Siek, Kay H. Connelly, Yvonne Rogers, Paul Rohwer, Desiree Lambert, and Janet L. Welch. 2006. When do we eat? An evaluation of food items input into an electronic monitoring application. In Proceedings of the First International Conference on Pervasive Computing Technologies for Healthcare (Pervasive Health) (IEEE), 1--10.","paperID":"None"},{"content":"William A. Sperduto, Harley S. Thompson, and Richard M. O'Brien. 1986. The effect of target behavior monitoring on weight loss and completion rate in a behavior modification program for weight reduction. Addictive behaviors 11, 3: 337--340.","paperID":"None"},{"content":"Arthur A. Stone, Joseph E.Schwartz, John M. Neale, Saul Shiffman, Christine A. Marco, Mary Hickcox, Jean Paty, Laura S. Porter, and Laura J. Cruise. 1998. comparison of coping assessed by ecological momentary assessment and retrospective recall (personality processes and individual differences). JPers Soc Psychol, 74:1670--1680.","paperID":"None"},{"content":"Walter C. Willett, Laura Sampson, Meir J. Stampfer, Bernard Rosner, Christopher Bain, Jelia Witschi, Charles H. Hennekens, and Frank E. Speizer. 1985. Reproducibility and validity of a semiquantitative food frequency questionnaire. American journal of epidemiology 122, 1: 51--65.","paperID":"None"},{"content":"World Health Organization. 2003. Diet, nutrition and the prevention of chronic diseases. WHO Technical Report Series 916.","paperID":"None"}],"abstract":"By enabling people to track their lifestyles, including activity level, sleeping, and diet, technology helps clinicians to treat patients suffering from \"lifestyle diseases.\" However, despite its importance compared to other lifestyle factors, it is not easy to record food intake consistently. Although researchers have attempted to solve this problem, most have not considered its applicability in the clinical context. In this paper, we aim to (1) understand food-journaling practices and (2) explore the applicability of lifestyle data in the clinical context. By observing 20 patients who recorded data including food logs, steps, and sleeping time, we found that patients recorded their food logs diligently, as they were conscious of clinicians. Clinicians were surprised by the high adherence rate of journaling and tried to overlap food data with other data, such as steps, sleeping time, etc. This paper contributes by providing qualitative insights for designing applicable strategies utilizing lifestyle data in the clinical context.","title":"\"My Doctor is Keeping an Eye on Me!\": Exploring the Clinical Applicability of a Mobile Food Logger","filename":"CHI16/p5620","authors":["Yoojung Kim","Sookyoung Ji","Hyunjeong Lee","Jeong-Whun Kim","Sooyoung Yoo","Joongseek Lee"],"conference":"CHI '16"}