{"paperId":2858328,"citation":[],"abstract":"This note presents a system that learns expressive and idiosyncratic gesture variations for gesture-based interaction. The system is used as an interaction technique in a music conducting scenario where gesture variations drive music articulation. A simple model based on Gaussian Mixture Modeling is used to allow the user to configure the system by providing variation examples. The system performance and the influence of user musical expertise is evaluated in a user study, which shows that the model is able to learn idiosyncratic variations that allow users to control articulation, with better performance for users with musical expertise.","reference":[{"content":"Sarah Fdili Alaoui, Baptiste Caramiaux, Marcos Serrano, and Frederic Bevilacqua. 2012. Movement qualities as interaction modality. In ACM DIS. 761-769.","paperID":"None"},{"content":"Saleema Amershi, Maya Cakmak, W Bradley Knox, and Todd Kulesza. 2014. Power to the people: The role of humans in interactive machine learning. AI Magazine 35, 4 (2014), 105-120.","paperID":"None"},{"content":"Sylvain Calinon, Florent Guenter, and Aude Billard. 2007. On learning, representing, and generalizing a task in a humanoid robot. IEEE Transactions on Systems, Man, and Cybernetics, Part B 37, 2 (2007), 286-298.","paperID":"None"},{"content":"Baptiste Caramiaux, Nicola Montecchio, Atau Tanaka, and Frederic Bevilacqua. 2014. Adaptive gesture recognition with variation estimation for interactive systems. ACM Transactions on Interactive Intelligent Systems (TiiS) 4, 4 (2014), 18-51.","paperID":"None"},{"content":"Jerry Alan Fails and Dan R Olsen Jr. 2003. Interactive machine learning. In ACM IUI. 39-45.","paperID":"None"},{"content":"Rebecca Fiebrink and Baptiste Caramiaux. (In press, 2016). The machine learning algorithm as creative musical tool. In Oxford Handbook of Algorithmic Music, Roger Dean and Alex McLean (Eds.). Oxford University Press.","paperID":"None"},{"content":"Rebecca Fiebrink, Perry R Cook, and Dan Trueman. 2011. Human model evaluation in interactive supervised learning. In ACM CHI. 147-156.","paperID":"None"},{"content":"Jules Françoise. 2015. Motion-Sound Mapping by Demonstration. Ph.D. Dissertation. University Pierre and Marie Curie (Paris 6).","paperID":"None"},{"content":"Eric Lee, Teresa Marrin Nakra, and Jan Borchers. 2004. You're the conductor: a realistic interactive conducting system for children. In NIME. 68-73.","paperID":"None"},{"content":"Eric Lee, Marius Wolf, and Jan Borchers. 2005. Improving orchestral conducting systems in public spaces: examining the temporal characteristics and conceptual models of conducting gestures. In ACM CHI. 731-740.","paperID":"None"},{"content":"Michael Lee, Guy Garnett, and David Wessel. 1992. An adaptive conductor follower. In ICMC. 454-454.","paperID":"None"},{"content":"Declan Murphy, Tue Haste Andersen, and Kristoffer Jensen. 2004. Conducting audio files via computer vision. In Gesture-based communication in human-computer interaction. Springer, 529-540.","paperID":"None"},{"content":"Margaret Schedel and Rebecca Fiebrink. 2011. A demonstration of bow articulation recognition with Wekinator and K-Bow. In Proceedings of ICMC.","paperID":"None"},{"content":"Diego Silang Maranan, Sarah Fdili Alaoui, Thecla Schiphorst, Philippe Pasquier, Pattarawut Subyen, and Lyn Bartram. 2014. Designing for movement: Evaluating computational models using LMA effort qualities. In ACM CHI. 991-1000.","paperID":"None"},{"content":"Dilip Swaminathan, Harvey Thornburg, Jessica Mumford, Stjepan Rajko, Jodi James, Todd Ingalls, Ellen Campana, Gang Qian, Pavithra Sampath, and Bo Peng. 2009. A dynamic bayesian approach to computational laban shape quality analysis. Advances in Human-Computer Interaction 2009 (2009), 2.","paperID":"None"},{"content":"Andrew D Wilson and Aaron F Bobick. 1999. Parametric hidden markov models for gesture recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence 21, 9 (1999), 884-900.","paperID":"None"}],"title":"Machine Learning of Personal Gesture Variation in Music Conducting","filename":"CHI16/p3428","authors":["Alvaro Sarasua","Baptiste Caramiaux","Atau Tanaka"],"conference":"CHI '16"}