{"paperId":2858564,"citation":[],"reference":[{"content":"American Board for Certification in Orthotics, Prosthetics & Pedorthics. History. Retrieved 9/2015 from https://www.abcop.org/WhoWeAre/Pages/History.aspx","paperID":"None"},{"content":"American Orthotic Prosthetic Association. 2015. AOPA Statement on 3-D Printing in Prosthetics.","paperID":"None"},{"content":"Morgan G. Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David A. Mellis, and Daniela K. Rosner. 2014. Making cultures: empowerment, participation, and democracy - or not?. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14), 1087--1092. http://dx.doi.org/10.1145/2559206.2579405.","paperID":"None"},{"content":"Chris Anderson. 2013. Makers. Wereldbibliotheek.","paperID":"None"},{"content":"Elaine Biddiss, & Tom Chau. 2007. Upper-limb prosthetics: critical factors in device abandonment. American Journal of Physical Medicine & Rehabilitation, 86, 12: 977--987.","paperID":"None"},{"content":"John N. Billock. 1986. Upper limb prosthetic terminal devices: Hands versus hooks., Clin Prosthet Orthot, 10, 2: 57--65.","paperID":"None"},{"content":"Erin Buehler, Stacy Branham, Abdullah Ali, Jeremy J. Chang, Megan Kelly Hofmann, Amy Hurst, and Shaun K. Kane. 2015. Sharing is Caring: Assistive Technology Designs on Thingiverse. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 525--534. http://doi.acm.org/10.1145/2702123.2702525","paperID":"None"},{"content":"Judith Butler. 2002. Gender trouble. Routledge, 195.","paperID":"None"},{"content":"Kathy Charmaz. 2006. Constructing grounded theory: A practical guide through qualitative research. Sage Publications Ltd, London.","paperID":"None"},{"content":"Laura Devendorf and Kimiko Ryokai. 2015. Being the Machine: Reconfiguring Agency and Control in Hybrid Fabrication. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2477--2486. http://dx.doi.org/10.1145/2702123.2702547","paperID":"None"},{"content":"e-NABLE. 2015. Enabling the Future. Retrieved 7/12/15 from http://enablingthefuture.org/","paperID":"None"},{"content":"Barney Glaser, and Anselm Strauss. 1967. The discovery of grounded theory: strategies for qualitative inquiry. Aldine.","paperID":"None"},{"content":"Amy Hurst, and Jasmine Tobias. 2011. Empowering individuals with do-it-yourself assistive technology. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '11), 11--18. http://doi.acm.org/10.1145/2049536.2049541","paperID":"None"},{"content":"J. C. K. Lai, M. P. Schoen, A. Perez Gracia, D. S. Naidu., & S. W. Leung. 2007. Prosthetic devices: challenges and implications of robotic implants and biological interfaces. In Proc. the Institution of Mechanical Engineers, Part H: Journal of Engineering in Medicine, 221, 2, 173--183.","paperID":"None"},{"content":"Silvia Lindtner, Garnet D. Hertz, and Paul Dourish. 2014. Emerging sites of HCI innovation: hackerspaces, hardware startups & incubators. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 439--448. http://dx.doi.org/10.1145/2556288.2557132","paperID":"None"},{"content":"Craig W. Martin, and Demet Edeer. 2011. Upper Limb Prostheses: A Review of the Literature with a Focus on Myoelectric Hands. WorkSafeBC Evidence Based Practice Group.","paperID":"None"},{"content":"Argyro Moraiti, Vero Vanden Abeele, Erwin Vanroye, and Luc Geurts. 2015. Empowering Occupational Therapists with a DIY-toolkit for Smart Soft Objects. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15), 387--394. http://doi.acm.org/10.1145/2677199.2680598","paperID":"None"},{"content":"Sean V. Murphy and Anthony Atal. 2014. 3D bioprinting of tissues and organs. Nature biotechnology, 32, 8: 773--785.","paperID":"None"},{"content":"Craig D. Murray,., & Mark J. Forshaw. 2013. The experience of amputation and prosthesis use for adults: a metasynthesis. Disability and rehabilitation, 35, 14: 1133--1142.","paperID":"None"},{"content":"Myoelectric Prosthetics. 2015. Introduction to Upper Limb Prosthetics. Retrieved 7/22/15 from http://www.myoelectricprosthetics.com/","paperID":"None"},{"content":"National Commission on orthotic and Prosthetic Education. Retrieved 9/2015 from http://www.ncope.org/","paperID":"None"},{"content":"Hiedi Nielson. 2015. MANUFACTURING CONSUMER PROTECTION FOR 3-D PRINTED PRODUCTS. Ariz. L. Rev., 57, 610--635.","paperID":"None"},{"content":"Kim Norton. 2007. A brief history of prosthetics. inMotion Magazine, 17.","paperID":"None"},{"content":"Open Bionics. Retrieved 12/18/2015 from http://www.openbionics.com","paperID":"None"},{"content":"Adele Peters. 2015. This Low-Cost 3-D Printer Can Produce Human Organs And Bones. Co.Exist.","paperID":"None"},{"content":"Daniela Petrelli, Elise Van den Hoven, and Steve Whittaker. 2009. Making history: intentional capture of future memories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1723--1732. http://dx.doi.org/10.1145/1518701.1518966","paperID":"None"},{"content":"Daniela Petrelli, Simon Bowen, and Steve Whittaker. 2014. Photo mementos: Designing digital media to represent ourselves at home. International Journal of Human-Computer Studies 72, 3: 320--336.","paperID":"None"},{"content":"Ponoko. Retrieved 10/20/15 from https://www.ponoko.com/","paperID":"None"},{"content":"Matt Ratto. Grease pencils and the persistence of individuality in computationally-produced custom objects.","paperID":"None"},{"content":"Isaac Record, Matt Ratto, Amy Ratelle, Adriana Ieraci, and Nina Czegledy. 2013. DIY prosthetics workshops: \"Critical Making\" for public understanding of human augmentation. In Technology and Society (ISTAS), 2013 IEEE International Symposium on, 117--125.","paperID":"None"},{"content":"Linda Resnik , Marissa R. Meucci, Shana LiebermanKlinger, Christopher Fantini, Debra L. Kelty, Roxanne Disla, Nicole Sasson. 2012. Advanced upper limb prosthetic devices: Implications for upper limb prosthetic rehabilitation. Arch Phys Med Rehabil. 93, 4: 710--17. http://dx.doi.org/10.1016/j.apmr.2011.11.010","paperID":"None"},{"content":"David Roedl, Shaowen Bardzell, and Jeffrey Bardzell. 2015. Sustainable Making? Balancing Optimism and Criticism in HCI Discourse. ACM TOCHI 22, 3.","paperID":"None"},{"content":"Ryan Schmidt, ginger coons, Vincent Chen, Timotheius Gmeiner, and Matt Ratto. 2015. 3D-printed prosthetics for the developing world. In SIGGRAPH 2015: Studio (SIGGRAPH '15), Article 21, 1 pages. http://dx.doi.org/10.1145/2785585","paperID":"None"},{"content":"D. Hal Silcox, Michael D. Rooks, Robert R. Vogel, and Lamar L. Fleming. 1993. Myoelectric prostheses. A long-term follow-up and a study of the use of alternate prostheses. The Journal of Bone & Joint Surgery, 75, 12: 1781--1789.","paperID":"None"},{"content":"Skillshare. Retrieved 10/20/15 from https://www.skillshare.com/","paperID":"None"},{"content":"Vivian Sobchack. 2010. Living a 'phantom limb': On the phenomenology of bodily integrity. Body & Society, 16, 3: 51--67.","paperID":"None"},{"content":"Anselm Leonard Strauss, and Juliet M. Corbin. 1990. Basics of qualitative research. Vol. 15. Sage.","paperID":"None"},{"content":"Lucy Suchman. 2009. Agencies in Technology Design: Feminist Reconfigurations Retrieved 03/16/2011 from http://www.lancs.ac.uk/fass/sociology/papers/suchmanagencies-technodesign.pdf?","paperID":"None"},{"content":"The Open Hand Project. Retrieved 12/18/2015 from http://www.openhandproject.org","paperID":"None"},{"content":"The Collective Project. 2015. Robert Downey Jr. Delivers a Real Bionic Arm. Retrieved 9/24/15 from https://www.youtube.com/watch?v=oEx5lmbCKtY","paperID":"None"},{"content":"Thingiverse. Things Tagged with e-NABLE. 2015. Retrieved 7/22/15 from https://www.thingiverse.com/tag:e-nable","paperID":"None"},{"content":"Alan J. Thurston. 2007. Paré and prosthetics: the early history of artificial limbs. ANZ Journal of Surgery, 77, 12: 1114--1119.","paperID":"None"},{"content":"Austin L. Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 629638. http://dx.doi.org/10.1145/2702123.2702522","paperID":"None"},{"content":"Nancy A. Van House. 2011. Feminist HCI meets facebook: Performativity and social networking sites. Interact. Comput. 23, 5 (September 2011), 422--429. http://dx.doi.org/10.1016/j.intcom.2011.03.003","paperID":"None"},{"content":"Kathleen M. Woodward. 2006. Performing age, performing gender. NWSA journal18, 1: 162--189.","paperID":"None"},{"content":"Jorge Zuniga, Dimitrios Katsavelis, Jean Peck, John Stollberg, Mark Petrykowski, Adam Carson, & Cristina Fernandez. 2015. Cyborg beast: a low-cost 3d-printed prosthetic hand for children with upper-limb differences. BMC research notes, 8, 1: 10.","paperID":"None"}],"abstract":"This paper is about the aspects of ability, selfhood, and normalcy embodied in people's relationships with prostheses. Drawing on interviews with 14 individuals with upper-limb loss and diverse experiences with prostheses, we find people not only choose to use and not use prosthesis throughout their lives but also form close and complex relationships with them. The design of \"assistive\" technology often focuses on enhancing function; however, we found that prostheses played important roles in people's development of identity and sense of normalcy. Even when a prosthesis failed functionally, such as was the case with 3D-printed prostheses created by an on-line open-source maker community (e-NABLE), we found people still praised the design and initiative because of the positive impacts on popular culture, identity, and community building. This work surfaces crucial questions about the role of design interventions in identity production, the promise of maker communities for accelerating innovation, and a broader definition of \"assistive\" technology.","title":"An Intimate Laboratory?: Prostheses as a Tool for Experimenting with Identity and Normalcy","filename":"CHI16/p1745","authors":["Cynthia L. Bennett","Keting Cen","Katherine M. Steele","Daniela K. Rosner"],"conference":"CHI '16"}