{"paperId":2858174,"abstract":"Web applications often need to present the user new information in the context of their current activity. Designers rely on a range of UI elements and visual techniques to present the new content to users, such as pop-ups, message icons, and marquees. Web designers need to select which technique to use depending on the centrality of the information and how quickly they need a reaction. However, designers often rely on intuition and anecdotes rather than empirical evidence to drive their decision-making as to which presentation technique to use. This work represents an attempt to quantify these presentation style decisions. We present a large (n=1505) user study that compares 15 visual attention-grabbing techniques with respect to reaction time, noticeability, annoyance, likability, and recall. We suggest glowing shadows and message icons with badges, as well as more possibilities for future work.","citation":[],"reference":[{"content":"Piotr D. Adamczyk and Brian P. Bailey. If Not Now, When?: The Effects of Interruption at Different Moments Within Task Execution. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (2004), 271--278.","paperID":"None"},{"content":"G. Susanne Bahr and Richard A. Ford. How and why pop-ups don't work: Pop-up prompted eye movements, user affect and decision making. Computers in Human Behavior 27, 2 (2011), 776--783.","paperID":"None"},{"content":"Brian P. Bailey and Joseph A. Konstan. On the need for attention-aware systems: Measuring effects of interruption on task performance, error rate, and affective state. Computers in Human Behavior 22, 4 (2006), 685--708.","paperID":"None"},{"content":"Lyn Bartram, Colin Ware, and Tom Calvert. Moving Icons: Detection And Distraction. IFIP TC.13 International Conference on Human-Computer Interaction (INTERACT), (2001), 157--166.","paperID":"None"},{"content":"Jan Panero Benway and David M. Lane. Banner Blindness: Web Searches Often Miss \"Obvious\" Links. Proceedings of the Human Factors and Ergonomics Society 42nd Annual Meeting, (1998), 463--467.","paperID":"None"},{"content":"Moira Burke, Anthony Hornof, Erik Nilsen, and Nicholas Gorman. High-Cost Banner Blindness: Ads Increase Perceived Workload, Hinder Visual Search, and Are Forgotten. ACM Transactions on ComputerHuman Interaction. 12, 4 (2005), 423--445.","paperID":"None"},{"content":"Edward Cutrell, Mary Czerwinski, and Eric Horvitz. Notification, Disruption, and Memory: Effects of Messaging Interruptions on Memory and Performance. INTERACT, (2001), 263--269.","paperID":"None"},{"content":"Mary Czerwinski, Eric Horvitz, and Susan Wilhite. A diary study of task switching and interruptions. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (2004), 175--182.","paperID":"None"},{"content":"Laura Dabbish, Gloria Mark, and Victor González. Why do I keep interrupting myself?: environment, habit and self-interruption. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (2011).","paperID":"None"},{"content":"Andy Field, Jeremy Miles, and Zoë Field. Discovering Statistics Using R. Sage, Los Angeles, (2012), 749--811.","paperID":"None"},{"content":"James Fogarty, Scott E. Hudson, Christopher G. Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny C. Lee, and Jie Yang. (2005). Predicting Human Interruptibility with Sensors. ACM Transactions on Computer-Human Interaction, 12(1), 119--146.","paperID":"None"},{"content":"Fong-Ling Fu, Rong-Chang Su, and Sheng-Chin Yu. EGameFlow: A scale to measure learners' enjoyment of e-learning games. Computers & Education 52, 1 (2009), 101--112.","paperID":"None"},{"content":"Tony Gillie, and Donald Broadbent. What makes interruptions disruptive? A study of length, similarity, and complexity. Psychological Research 50, 4 (1989), 243--250.","paperID":"None"},{"content":"Jennifer Gluck, Andrea Bunt, and Joanna McGrenere. (2007). Matching attentional draw with utility in interruption. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 41. http://doi.org/10.1145/1240624.1240631","paperID":"None"},{"content":"Chris Harrison, Brian Amento, Stacey Kuznetsov, and Robert Bell. Rethinking the Progress Bar. ACM Symposium on User Interface Software and Technology, (2007), 115--118.","paperID":"None"},{"content":"Chris Harrison, Zhiquan Yeo, and Scott E. Hudson. Faster Progress Bars: Manipulating Perceived Duration with Visual Augmentations. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (2010), 1545--1548.","paperID":"None"},{"content":"Weiyin Hong, James Y.L. Thong, and Kar Yan Tam. How Do Web Users Respond to Non-Banner-Ads Animation? The Effects of Task Type and User Experience. Journal of the American Society for Information Science and Technology 58, 10 (2007), 1467--1482.","paperID":"None"},{"content":"Bernardo A. Huberman and Fang Wu. The Economics of Attention: Maximizing User Value in InformationRich Environments. Advances in Complex Systems 11, 4 (2008), 487--496.","paperID":"None"},{"content":"Ipeirotis, P. Demographics of Mechanical Turk. (2010).","paperID":"None"},{"content":"Shamsi T. Iqbal and Brian P. Bailey. Investigating the Effectiveness of Mental Workload as a Predictor of Opportune Moments for Interruption. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (2005), 1489--1492.","paperID":"None"},{"content":"Sheree Josephson and Michael E. Holmes. Clutter or content? How on-screen enhancements affect how TV viewers scan and what they learn. Eye Tracking Research & Application Symposium, (2006), 155--162.","paperID":"None"},{"content":"Daniel Kahneman. Attention and effort. Englewood Cliffs, NJ: Prentice-Hall, (1973).","paperID":"None"},{"content":"Paul P. Maglio and Christopher S. Campbell. Tradeoffs in displaying peripheral information. Proceedings of the SIGCHI conference on Human factors in computing systems, 1 (2000), 241--248.","paperID":"None"},{"content":"Gloria Mark, Daniela Gudith, and Ulrich Klocke. The cost of interrupted work: more speed and stress. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (2008), 8--11.","paperID":"None"},{"content":"Winter Mason and Duncan J. Watts. Financial Incentives and the \"Performance of Crowds.\" HCOMP, (2009).","paperID":"None"},{"content":"D. Scott McCrickard, C.M. Chewar, Jacob P. Somervell, and Ali Ndiwalana. A model for notification systems evaluation--assessing user goals for multitasking activity. ACM Transactions on Computer-Human Interaction. 10, 4 (2003), 312--338.","paperID":"None"},{"content":"D. Scott McCrickard and C.M. Chewar. User Goals and Attention Costs. Communications of the ACM 46, 3 (2003), 67--72.","paperID":"None"},{"content":"NASA Task Load Index (TLX). Accessed from http://humansystems.arc.nasa.gov/groups/TLX/downloa ds/TLX.pdf","paperID":"None"},{"content":"Justin W. Owens, Barbara S. Chaparro, and Evan M. Palmer. Text Advertising Blindness: The New Banner Blindness? Journal of Usability Studies 6, 3 (2011), 172--197.","paperID":"None"},{"content":"Zachary Pousman and John Stasko. A taxonomy of ambient information systems: four patterns of design. Proceedings of the working conference on Advanced visual interfaces, (2006), 67--74.","paperID":"None"},{"content":"David A. Savitz and Andrew F. Olshan. Multiple comparisons and related issues in the interpretation of epidemiologic data. American Journal of Epidemiology 142, 9 (1995), 904--908","paperID":"None"},{"content":"Herbert A. Simon. Designing organizations for an information-rich world. Computers, Communication, and the Public Interest, The Johns Hopkins Press (1969).","paperID":"None"}],"title":"Getting Users' Attention in Web Apps in Likable, Minimally Annoying Ways","filename":"CHI16/p3324","authors":["Dan Tasse","Anupriya Ankolekar","Joshua Hailpern"],"conference":"CHI '16"}