{"paperId":2858219,"citation":[],"abstract":"Ranking users in social networks is a well-studied problem, typically solved by algorithms that leverage network structure to identify influential users and recommend people to follow. In the last decade, however, curation --- users sharing and promoting content in a network --- has become a central social activity, as platforms like Facebook, Twitter, Pinterest, and GitHub drive growth and engagement by connecting users through content and content to users. While existing algorithms reward users that are highly active with higher rankings, they fail to account for users' curatorial taste. This paper introduces CuRank, an algorithm for ranking users and content in social networks by explicitly modeling three characteristics of a good curator: discerning taste, high activity, and timeliness. We evaluate CuRank on datasets from two popular social networks --- GitHub and Vine --- and demonstrate its efficacy at ranking content and identifying good curators.","reference":[{"content":"2015. GitHub. (2015). https://github.com/.","paperID":"None"},{"content":"2015. Vine. (2015). https://vine.co/.","paperID":"None"},{"content":"Shuo Chang, Vikas Kumar, Eric Gilbert, and Loren G. Terveen. 2014a. Specialization, homophily, and gender in a social curation site: findings from Pinterest. In Proc. CSCW. 674--686.","paperID":"None"},{"content":"Yi Chang, Lei Tang, Yoshiyuki Inagaki, and Yan Liu. 2014b. What is Tumblr: a statistical overview and comparison. ACM SIGKDD Explorations Newsletter 16, 1 (2014), 21--29.","paperID":"None"},{"content":"Jordan Crook. 2015. Spotify introduces 'Found Them First' so you know how cool you are. (2015). http://techcrunch.com/2015/09/09/spotify-introducesfound-them-first-so-you-know-how-cool-you-are/.","paperID":"None"},{"content":"Laura Dabbish, Colleen Stuart, Jason Tsay, and Jim Herbsleb. 2012. Social coding in GitHub: transparency and collaboration in an open software repository. In Proc. CSCW. 1277--1286.","paperID":"None"},{"content":"Ying Ding, Erjia Yan, Arthur Frazho, and James Caverlee. 2009. PageRank for ranking authors in co-citation networks. Journal of the American Society for Information Science and Technology 60, 11 (2009), 2229--2243.","paperID":"None"},{"content":"Chris Dixon. 2015. Come for the tool, stay for the network. (2015). http://cdixon.org/2015/01/31/come-for-the-tool-stayfor-the-network/.","paperID":"None"},{"content":"David Easley and Jon Kleinberg. 2010. Networks, crowds, and markets: reasoning about a highly connected world. Cambridge University Press.","paperID":"None"},{"content":"Eric Gilbert, Saeideh Bakhshi, Shuo Chang, and Loren Terveen. 2013. I need to try this: a statistical overview of Pinterest. In Proc. CHI. 2427--2436.","paperID":"None"},{"content":"Gene H. Golub and Charles F. Van Loan. 1996. Matrix Computations (3rd ed.). Johns Hopkins University Press.","paperID":"None"},{"content":"Pankaj Gupta, Ashish Goel, Jimmy Lin, Aneesh Sharma, Dong Wang, and Reza Zadeh. 2013. WTF: the Who to Follow service at Twitter. In Proc. WWW. 505--514.","paperID":"None"},{"content":"Catherine Hall and Michael Zarro. 2012. Social curation on the website Pinterest.com. Proc. ASIS&T 49, 1 (2012), 1--9.","paperID":"None"},{"content":"Kyungsik Han, Jin Yea Jang, and Dongwon Lee. 2015. Exploring tag-based like networks. In Extended Abstracts of CHI. 1941--1946.","paperID":"None"},{"content":"Yuchen Jing, Lifang Wu, Xiuzhen Zhang, Dan Wang, and Changwen Chen. 2015. Recommending users to follow based on user taste homophily for content curation social networks. In Proc. SRS.","paperID":"None"},{"content":"M. G. Kendall. 1938. A New Measure of Rank Correlation. Biometrika 30, 1/2 (1938), 81--93.","paperID":"None"},{"content":"Jon M. Kleinberg. 1999. Authoritative sources in a hyperlinked environment. J. ACM 46, 5 (1999), 604--632.","paperID":"None"},{"content":"Haewoon Kwak, Changhyun Lee, Hosung Park, and Sue Moon. 2010. What is Twitter, a social network or a news media. In Proc. WWW. 591--600.","paperID":"None"},{"content":"Ronny Lempel and Shlomo Moran. 2000. The stochastic approach for link-structure analysis (SALSA) and the TKC e--ect. Computer Networks 33, 1 (2000), 387--401.","paperID":"None"},{"content":"Jure Leskovec and Christos Faloutsos. 2006. Sampling from large graphs. In Proc. KDD. 631--636.","paperID":"None"},{"content":"Ari Levy. 2011. LinkedIn acquires Pulse mobile-news reading tool for $90 million. (2011). http://www.bloomberg.com/news/articles/2013-04--11/ linkedin-acquires-pulse-mobile-news-reading-tool-for90-million.","paperID":"None"},{"content":"Rinkesh Nagmoti, Ankur Teredesai, and Martine De Cock. 2010. Ranking approaches for microblog search. In Proc. WI-IAT. 153--157.","paperID":"None"},{"content":"Lawrence Page, Sergey Brin, Rajeev Motwani, and Terry Winograd. 1999. The PageRank citation ranking: bringing order to the Web. Technical Report. Stanford InfoLab.","paperID":"None"},{"content":"Chris Sacca. 2015. What Twitter can be. (2015). http://lowercasecapital.com/2015/06/03/what-twittercan-be-2/.","paperID":"None"},{"content":"Yizhou Sun, Yintao Yu, and Jiawei Han. 2009. Ranking-based clustering of heterogeneous information networks with star network schema. In Proc. KDD. 797--806.","paperID":"None"},{"content":"Twitter. 2015. Twitter top 100 most followers. (2015). http://twittercounter.com/pages/100.","paperID":"None"},{"content":"Jianshu Weng, Ee-Peng Lim, Jing Jiang, and Qi He. 2010. Twitterrank: finding topic-sensitive influential twitterers. In Proc. WSDM. 261--270.","paperID":"None"},{"content":"Ding Zhou, Sergey Orshanskiy, Hongyuan Zha, and C Lee Giles. 2007. Co-ranking authors and documents in a heterogeneous network. In Proc. ICDM. 739--744.","paperID":"None"}],"title":"Accounting for Taste: Ranking Curators and Content in Social Networks","filename":"CHI16/p2383","authors":["Haizi Yu","Biplab Deka","Jerry O. Talton","Ranjitha Kumar"],"conference":"CHI '16"}