{"paperId":2858336,"abstract":"In this paper we present a design space for interactive windshield displays in vehicles and discuss how this design space can support designers in creating windshield applications for drivers, passengers, and pedestrians. Our work is motivated by numerous examples in other HCI-related areas where seminal design space papers served as a valuable basis to evolve the respective field -- most notably mobile devices, automotive user interfaces, and interactive public displays. The presented design space is based on a comprehensive literature review. Furthermore we present a classification of 211 windshield applications, derived from a survey of research projects and commercial products as well as from focus groups. We showcase the utility of our work for designers of windshield applications through two scenarios. Overall, our design space can help building applications for diverse use cases. This includes apps inside and outside the car as well as applications for specific areas (fire fighters, police, ambulance).","reference":[{"content":"DIN 15996:2008. 2008. Bild- und Tonbearbeitung in Film-, Video- und Rundfunkbetrieben - Grundsätze und Festlegungen für den Arbeitsplatz. (2008).","paperID":"None"},{"content":"Markus Ablassmeier, Gregor Mcglaun, and Gerhard Rigoll. 2005. Evaluating the Potential of Head-Up Displays for a Multimodal Interaction Concept in the Automotive Environment. In Proceedings of the 9th World Multi-Conference on Systemics, Cybernetics and Informatics (WMSCI 2005), Vol. X. IIIS.","paperID":"None"},{"content":"National Highway Traffic Safety Administration. 2013. Preliminary Statement of Policy Concerning Automated Vehicles. National Highway Traffic Safety Administration (NHTSA), Washington, DC.","paperID":"None"},{"content":"Motoyuki Akamatsu, Paul Green, and Klaus Bengler. 2013. Automotive Technology and Human Factors Research: Past, Present, and Future. International Journal of Vehicular Technology 2013, Article 526180 (2013), 27 pages. DOI:http://dx.doi.org/10.1155/2013/526180","paperID":"None"},{"content":"Florian Alt, Christoph Evers, and Albrecht Schmidt. 2009. Users' View on Context-Sensitive Car Advertisements. In Proceedings of 7th International Conference on Pervasive Computing (Lecture Notes in Computer Science), Hideyuki Tokuda, Michael Beigl, Adrian Friday, A.J.Bernheim Brush, and Yoshito Tobe (Eds.), Vol. 5538. Springer Berlin Heidelberg, 9-16. DOI: http://dx.doi.org/10.1007/978--3--642-01516--8_2","paperID":"None"},{"content":"Florian Alt, Dagmar Kern, Fabian Schulte, Bastian Pfieging, Alireza Sahami Shirazi, and Albrecht Schmidt. 2010. Enabling Micro-entertainment in Vehicles Based on Context Information. In Proceedings of the 2nd International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '10). ACM, NY, NY, USA, 117-124. DOI: http://dx.doi.org/10.1145/1969773.1969794","paperID":"None"},{"content":"Florian Alt, Alireza Sahami Shirazi, Thomas Kubitza, and Albrecht Schmidt. 2013. Interaction Techniques for Creating and Exchanging Content with Public Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1709-1718. DOI: http://dx.doi.org/10.1145/2470654.2466226","paperID":"None"},{"content":"Florian Alt, Alireza Sahami Shirazi, Max Pfeiffer, Paul Holleis, and Albrecht Schmidt. 2009. TaxiMedia: An Interactive Context-Aware Entertainment and Advertising System. In GI Jahrestagung. 3933-3940.","paperID":"None"},{"content":"Ignacio Alvarez, Aqueasha Martin, Jerone Dunbar, Joachim Taiber, Dale-Marie Wilson, and Juan E. Gilbert. 2010. Voice Interfaced Vehicle User Help. In Proceedings of the 2nd International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '10). ACM, NY, NY, USA, 42-49. DOI:http://dx.doi.org/10.1145/1969773.1969782","paperID":"None"},{"content":"Ignacio Alvarez, Aqueasha Martin, Jerone Dunbar, Joachim Taiber, Dale-Marie Wilson, and Juan E Gilbert. 2011. Designing driver-centric natural voice user interfaces. In Adjunct Proceedings Proceedings of the 3rd International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutoUI'11) (2011), 42-49.","paperID":"None"},{"content":"Media-und Sozialforschungsgesellschaft mbH ARIS Umfrageforschung Markt. 2011. Studie Automobil. online (slides). (2011). http://www.bitkom.org/files/documents/BITKOM_Studie_Automobil_-_ITK_im_Auto_und_Elektromobilitaet.pdf","paperID":"None"},{"content":"Rafael Ballagas, Michael Rohs, Jennifer G. Sheridan, and Jan Borchers. 2008. The Design Space of Ubiquitous Mobile Input. IGI Global, Hershey, PA, USA, 386-407. DOI: http://dx.doi.org/10.4018/978--1--59904--871-0.ch024","paperID":"None"},{"content":"Karlin Bark, Cuong Tran, Kikuo Fujimura, and Victor Ng-Thow-Hing. 2014. Personal Navi: Benefits of an Augmented Reality Navigational Aid Using a See-Thru 3D Volumetric HUD. In Proceedings of the 6th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '14). ACM, NY, NY, USA, Article 1, 8 pages. DOI: http://dx.doi.org/10.1145/2667317.2667329","paperID":"None"},{"content":"Lyn Bartram, Colin Ware, and Tom Calvert. 2003. Moticons:: detection, distraction and task. International Journal of Human-Computer Studies 58, 5 (2003), 515 - 545. DOI: http://dx.doi.org/10.1016/S1071--5819(03)00021--1","paperID":"None"},{"content":"J. Alejandro Betancur. 2011. Augmented Reality Some Emerging Application Areas. InTech, Chapter Physical Variable Analysis Involved in Head-Up Display Systems Applied to Automobiles. DOI: http://dx.doi.org/10.5772/25849","paperID":"None"},{"content":"Jochen Blume, Thorsten Alexander Kern, and Pablo Richter. 2014. Head-up-Display-Die nächste Generation mit Augmented-Reality-Technik. In Vernetztes Automobil, Wolfgang Siebenpfeiffer (Ed.). Springer, 137-143. DOI: http://dx.doi.org/10.1007/978--3--658-04019--2_20","paperID":"None"},{"content":"Lorenz Bohrer, Stefan Henze, Matthias Hoping, Hans-Hermann Johannes, Wolfgang Kowalsky, Henning Krautwald, Michael Kröger, Jens Meyer, Thomas Riedl, and Heino Wengelnik. 2008. Transparente Anzeigevorrichung für ein Kraftfahrzeug. DE Patent DE200,710,012,571. (17 January 2008). https://register.dpma.de/DPMAregister/pat/PatSchrifteneinsicht?docId=DE102007012571A1 Filed March 13, 2007.","paperID":"None"},{"content":"John Brandon. 2012. Top 5 huds in mordern cars today. Website. (2012). Retrieved September 19, 2015 from http://www.techradar.com/news/car-tech/ top-5-huds-in-modern-cars-today-1092312.","paperID":"None"},{"content":"Tobias Brandt. 2013. Information Systems in Automobiles - Past, Present, and Future Uses. In 19th Americas Conference on Information Systems, AMCIS 2013, Chicago, Illinois, USA, August 15--17, 2013. http://aisel.aisnet.org/amcis2013/GreenIS/GeneralPresentations/1","paperID":"None"},{"content":"Nora Broy, Simone Höckh, Annette Frederiksen, Michael Gilowski, Julian Eichhorn, Felix Naser, Horst Jung, Julia Niemann, Martin Schell, Albrecht Schmid, and Florian Alt. 2014. Exploring Design Parameters for a 3D Head-Up Display. In Proceedings of the International Symposium on Pervasive Displays (PerDis '14). ACM, NY, NY, USA, Article 38, 6 pages. DOI: http://dx.doi.org/10.1145/2611009.2611011","paperID":"None"},{"content":"Heiner Bubb. 2003. Fahrerassistenz - primaer ein Beitrag zum Komfort oder fuer die Sicherheit?. In Der Fahrer im 21. Jahrhundert : Anforderungen, Anwendungen, Aspekte für Mensch-Maschine-Systeme; Tagung Braunschweig, 2. und 3. Juni 2003 (VDI-Berichte ; 1768). VDI-Verlag, Düsseldorf, Germany, 25-44. http://bvbr.bib-bvb.de:8991/F?func=service&doc_library=BVB01&doc_number=010423777&line_number=0001&func_code=DB_RECORDS&service_type=MEDIA","paperID":"None"},{"content":"William Buxton. 1983. Lexical and Pragmatic Considerations of Input Structures. SIGGRAPH Comput. Graph. 17, 1 (Jan. 1983), 31-37. DOI: http://dx.doi.org/10.1145/988584.988586","paperID":"None"},{"content":"Nilgün Camgöz, Cengiz Yener, and Dilek Güvenç. 2004. Effects of hue, saturation, and brightness: Part 2: Attention. Color Research and Application 29, 1 (2004), 20-28. DOI: http://dx.doi.org/10.1002/col.10214","paperID":"None"},{"content":"Stuart K. Card and Jock D. Mackinlay. 1997. The Structure of the Information Visualization Design Space. In Proceedings of the 1997 IEEE Symposium on Information Visualization (InfoVis '97). IEEE Computer Society, Washington, DC, USA, 92-999. DOI: http://dx.doi.org/10.1109/INFVIS.1997.636792","paperID":"None"},{"content":"Stuart K. Card, Jock D. Mackinlay, and George G. Robertson. 1991. A Morphological Analysis of the Design Space of Input Devices. ACM Trans. Inf. Syst. 9, 2 (April 1991), 99-122. DOI: http://dx.doi.org/10.1145/123078.128726","paperID":"None"},{"content":"Vassilis Charissis and Martin Naef. 2007. Evaluation of Prototype Automotive Head-Up Display Interface: Testing Driver's Focusing Ability through a VR Simulation. In IEEE Intelligent Vehicles Symposium. IEEE Computer Society, 560-565. DOI: http://dx.doi.org/10.1109/IVS.2007.4290174","paperID":"None"},{"content":"Vassilis Charissis, Martin Naef, Stylianos Papanastasiou, and Marianne Patera. 2007. Designing a Direct Manipulation HUD Interface for In-vehicle Infotainment. In Proceedings of the 12th International Conference on Human-computer Interaction: Interaction Platforms and Techniques (HCI'07). Springer-Verlag, Berlin, Heidelberg, 551-559. http://dl.acm.org/citation.cfm?id=1757268.1757333","paperID":"None"},{"content":"Shinko Y. Cheng, Anup Doshi, and Mohan M. Trivedi. 2007. Active Heads-up Display based Speed Compliance Aid for Driver Assistance: A Novel Interface and Comparative Experimental Studies. In 2007 IEEE Intelligent Vehicles Symposium. IEEE Computer Society, 594-599. DOI: http://dx.doi.org/10.1109/IVS.2007.4290180","paperID":"None"},{"content":"Ed H. Chi. 2000. A taxonomy of visualization techniques using the data state reference model. In IEEE Symposium on Information Visualization (InfoVis 2000). IEEE Computer Society, 69-75. DOI: http://dx.doi.org/10.1109/INFVIS.2000.885092","paperID":"None"},{"content":"Sunny Consolvo, Peter Roessler, and Brett E. Shelton. 2004. The CareNet display: lessons learned from an in home evaluation of an ambient display. In UbiComp 2004: Ubiquitous Computing, Nigel Davies, Elizabeth D. Mynatt, and Itiro Siio (Eds.). Lecture Notes in Computer Science, Vol. 3205. Springer, Berlin Heidelberg, Germany, 1-17. DOI: http://dx.doi.org/10.1007/978--3--540--30119--6_1","paperID":"None"},{"content":"David Curbow. 2001. User Benefits of Connecting Automobiles to the Internet. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, NY, NY, USA, 1-2. DOI: http://dx.doi.org/10.1145/634067.634069","paperID":"None"},{"content":"James E. Cutting and Peter M. Vishton. 1995. Perceiving layout and knowing distances: The integration, relative potency, and contextual use of different information about depth.. In Perception of space and motion. Handbook of perception and cognition (2nd. ed.)., William Epstein and Sheena J. Robers (Eds.). Academic Press, San Diego, CA, USA, 69-117. DOI: http://dx.doi.org/doi/10.1016/B978-012240530--3/50005--5","paperID":"None"},{"content":"Nigel Davies, Sarah Clinch, and Florian Alt. 2014. Pervasive displays: understanding the future of digital signage. Synthesis Lectures on Mobile and Pervasive Computing 8, 1 (2014), 1-128. DOI: http://dx.doi.org/10.2200/S00558ED1V01Y201312MPC011","paperID":"None"},{"content":"Joost C. F. de Winter, Riender Happee, Marieke H. Martens, and Neville A. Stanton. 2014. Effects of adaptive cruise control and highly automated driving on workload and situation awareness: A review of the empirical evidence. Transportation Research Part F: Traffic Psychology and Behaviour (Aug. 2014). DOI: http://dx.doi.org/10.1016/j.trf.2014.06.016","paperID":"None"},{"content":"Tanja Döring, Dagmar Kern, Paul Marshall, Max Pfeiffer, Johannes Schöning, Volker Gruhn, and Albrecht Schmidt. 2011. Gestural Interaction on the Steering Wheel: Reducing the Visual Demand. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 483-492. DOI:http://dx.doi.org/10.1145/1978942.1979010","paperID":"None"},{"content":"A. Doshi, Shinko Yuanhsien Cheng, and M.M. Trivedi. 2009. A Novel Active Heads-Up Display for Driver Assistance. IEEE Transactions on Systems, Man, and Cybernetics, Part B: Cybernetics 39, 1 (Feb 2009), 85-93. DOI: http://dx.doi.org/10.1109/TSMCB.2008.923527","paperID":"None"},{"content":"Pioneer Europe. year unknown. NavGate Head-Up Display SPX-HUD01. Website. (year unknown). Retrieved September 19, 2015 from http://www.pioneer. eu/eur/products/archive/SPX-HUD01/page.html.","paperID":"None"},{"content":"Michel Ferreira, Pedro Gomes, Michelle Kruger Silveria, and Fausto Vieira. 2013. Augmented Reality Driving Supported by Vehicular Ad Hoc Networking. In 2013 IEEE International Symposium on Mixed and Augmented Reality (ISMAR'13). IEEE Computer Society, 253-254. DOI: http://dx.doi.org/10.1109/ISMAR.2013.6671791","paperID":"None"},{"content":"Steven L. Franconeri and Daniel J. Simons. 2003. Moving and looming stimuli capture attention. Perception and Psychophysics 65, 7 (2003), 999-1010. DOI: http://dx.doi.org/10.3758/BF03194829","paperID":"None"},{"content":"Kikuo Fujimura, Lijie Xu, Cuong Tran, Rishabh Bhandari, and Victor Ng-Thow-Hing. 2013. Driver Queries Using Wheel-constrained Finger Pointing and 3-D Head-up Display Visual Feedback. In Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '13). ACM, NY, NY, USA, 56-62. DOI:http://dx.doi.org/10.1145/2516540.2516551","paperID":"None"},{"content":"Jose L. Galvan. 2006. A Guide for Students of the Social and Behavioral Sciences. Pyrczak Publishing.","paperID":"None"},{"content":"K. W. Gish and L. Staplin. 1995. Human Factors Aspects of Using Head Up Displays in Automobiles: A Review of the Literature. National Highway Traffic Safety Administration (NHTSA) (report no: DOT HS 808 320), Washington, DC.","paperID":"None"},{"content":"Continental Automotive GmbH. 2014. Head-up Displays. Website. (2014). Retrieved September 19, 2015 from http://continental-head-up-display.com/.","paperID":"None"},{"content":"Christian Gold, Daniel Damböck, Lutz Lorenz, and Klaus Bengler. 2013. \"Take over!\" How long does it take to get the driver back into the loop?. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 57. 1938-1942. DOI: http://dx.doi.org/10.1177/1541931213571433","paperID":"None"},{"content":"Herbert Hagendorf, Joseph Krummenacher, Hermann-Josef Müller, and Torsten Schubert. 2011. Wahrnehmung und Aufmerksamkeit: Allgemeine Psychologie für Bachelor. Springer, Berlin Heidelberg, Germany. DOI: http://dx.doi.org/10.1007/978--3--642--12710--6","paperID":"None"},{"content":"Renate Häuslschmid, Sven Osterwald, Marcus Lang, and Andreas Butz. 2015a. Augmenting the Driver's View with Peripheral Information on a Windshield Display. In Proceedings of the 20th International Conference on Intelligent User Interfaces (IUI '15). ACM, NY, NY, USA, 311-321. DOI: http://dx.doi.org/10.1145/2678025.2701393","paperID":"None"},{"content":"Renate Häuslschmid, Laura Schnurr, Julie Wagner, and Andreas Butz. 2015b. Contact-analog Warnings on Windshield Displays Promote Monitoring the Road Scene. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '15). ACM, NY, NY, USA, 64-71. DOI: http://dx.doi.org/10.1145/2799250.2799274","paperID":"None"},{"content":"Eva Heller. 2009. Psychologie de la couleur - Effets et symboliques. Editions Pyramyd. 39-63 pages.","paperID":"None"},{"content":"M. J. M. Houtmans and A. F Sanders. 1984. Perception of signals presented in the periphery of the visual field. Acta Psychologica 55, 2 (1984), 143-155. DOI: http://dx.doi.org/10.1016/0001--6918(84)90064--7","paperID":"None"},{"content":"SAE International. 2014. Taxonomy and Definitions for Terms Related to On-Road Motor Vehicle Automated Driving Systems (Standard J3016 201401). SAE International (SAE).","paperID":"None"},{"content":"Nassim Jafarinaimi, Jodi Forlizzi, Amy Hurst, and John Zimmerman. 2005. Breakaway: An Ambient Display Designed to Change Human Behavior. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, NY, NY, USA, 1945-1948. DOI: http://dx.doi.org/10.1145/1056808.1057063","paperID":"None"},{"content":"Seung-Won Jung and Sung-Jea Ko. 2012. Depth sensation enhancement using the just noticeable depth difference. IEEE Transactions on Image Processing 21, 8 (2012), 3624-3637. DOI: http://dx.doi.org/10.1109/TIP.2012.2191569","paperID":"None"},{"content":"Hannu Karvonen, Tuomo Kujala, and Pertti Saariluoma. 2006. In-Car Ubiquitous Computing: Driver Tutoring Messages Presented on a Head-Up Display. In IEEE Intelligent Transportation Systems Conference 2006 (ITCS '06). IEEE, IEEE Computer Society, 560-565. DOI:http://dx.doi.org/10.1109/ITSC.2006.1706800","paperID":"None"},{"content":"Dagmar Kern, Paul Marshall, and Albrecht Schmidt. 2010. Gazemarks: Gaze-based Visual Placeholders to Ease Attention Switching. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2093-2102. DOI: http://dx.doi.org/10.1145/1753326.1753646","paperID":"None"},{"content":"Dagmar Kern and Albrecht Schmidt. 2009. Design Space for Driver-based Automotive User Interfaces. In Proceedings of the 1st International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '09). ACM, NY, NY, USA, 3-10. DOI: http://dx.doi.org/10.1145/1620509.1620511","paperID":"None"},{"content":"Mohamed Khamis, Andreas Bulling, and Florian Alt. 2015. Tackling Challenges of Interactive Public Displays Using Gaze. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, NY, NY, USA, 763-766. DOI: http://dx.doi.org/10.1145/2800835.2807951","paperID":"None"},{"content":"Javid Khan, Chi Can, Alan Greenaway, and Ian Underwood. 2013. A real-space interactive holographic display based on a large-aperture HOE, In Practical Holography XXVII: Materials and Applications. Proc. SPIE 8644 (2013). DOI: http://dx.doi.org/10.1117/12.2021633","paperID":"None"},{"content":"Hyungil Kim, Xuefang Wu, Joseph L. Gabbard, and Nicholas F. Polys. 2013. Exploring Head-up Augmented Reality Interfaces for Crash Warning Systems. In Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '13). ACM, NY, NY, USA, 224-227. DOI: http://dx.doi.org/10.1145/2516540.2516566","paperID":"None"},{"content":"Martin Knobel, Marc Hassenzahl, Simon Männlein, Melanie Lamara, Josef Schumann, Kai Eckoldt, Matthias Laschke, and Andreas Butz. 2013. Become a Member of the Last Gentlemen: Designing for Prosocial Driving. In Proceedings of the 6th International Conference on Designing Pleasurable Products and Interfaces (DPPI '13). ACM, NY, NY, USA, 60-66. DOI: http://dx.doi.org/10.1145/2513506.2513513","paperID":"None"},{"content":"H. H. Kornhuber. 1978. Blickmotorik. In Physiologie des Menschen. Band 13: Sehen (Sinnesphysiologie III), Kramer (Ed.). Schwarzenbeck, München, Wien, Baltimore, 357-426.","paperID":"None"},{"content":"Richard A Krueger and Mary Anne Casey. 2002. Designing and conducting focus group interviews. Social Analysis, Selected Tools and Techniques, Krueger, RA, MA Casey, J. Donner, S. Kirsch and JN Maack (2002), 4-23.","paperID":"None"},{"content":"Jochen Kruse. 2014. Head up: information in the driver's field of view. Website. (2014). Retrieved September 19, 2015 from http://next.mercedes-benz.com/en/hud-en/.","paperID":"None"},{"content":"Jiannan Li, Ehud Sharlin, Saul Greenberg, and Michael Rounding. 2013. Designing the Car iWindow: Exploring Interaction Through Vehicle Side Windows. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 1665-1670. DOI: http://dx.doi.org/10.1145/2468356.2468654","paperID":"None"},{"content":"Pamela J. Ludford, Dan Frankowski, Ken Reily, Kurt Wilms, and Loren Terveen. 2006. Because I Carry My Cell Phone Anyway: Functional Location-based Reminder Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 889-898. DOI: http://dx.doi.org/10.1145/1124772.1124903","paperID":"None"},{"content":"Roy J. Mathieu, Thomas A. Seder, Joesph F. Szczerba, and Dehua Cui. 2013. Driving maneuver assist on full windshield head-up display. US Patent 8,514,101. (20 August 2013). https://www.google.com/patents/US8514101 Filed December 2, 2011.","paperID":"None"},{"content":"Toru Miyamoto, Itaru Kitahara, Yoshinari Kameda, and Yuichi Ohta. 2006. Floating Virtual Mirrors: Visualization of the Scene Behind a Vehicle. In Advances in Artificial Reality and Tele-Existence, Zhigeng Pan, Adrian Cheok, Michael Haller, Rynson W.H. Lau, Hideo Saito, and Ronghua Liang (Eds.). Lecture Notes in Computer Science, Vol. 4282. Springer, 302-313. DOI: http://dx.doi.org/10.1007/11941354_31","paperID":"None"},{"content":"Jörg Müller, Florian Alt, Daniel Michelis, and Albrecht Schmidt. 2010. Requirements and Design Space for Interactive Public Displays. In Proceedings of the International Conference on Multimedia (MM '10). ACM, NY, NY, USA, 1285-1294. DOI: http://dx.doi.org/10.1145/1873951.1874203","paperID":"None"},{"content":"Jörg Müller, Robert Walter, Gilles Bailly, Michael Nischt, and Florian Alt. 2012. Looking Glass: A Field Study on Noticing Interactivity of a Shop Window. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 297-306. DOI: http://dx.doi.org/10.1145/2207676.2207718","paperID":"None"},{"content":"Wolfgang Narzt, Gustav Pomberger, Alois Ferscha, Dieter Kolb, Reiner Müller, Jan Wieghardt, Horst Hörtner, and Christopher Lindinger. 2006. Augmented reality navigation systems. Universal Access in the Information Society 4, 3 (2006), 177-187. DOI: http://dx.doi.org/10.1007/s10209-005-0017--5","paperID":"None"},{"content":"Victor Ng-Thow-Hing, Karlin Bark, Lee Beckwith, Cuong Tran, Rishabh Bhandari, and Srinath Sridhar. 2013. User-centered perspectives for Automotive Augmented Reality. In 2013 IEEE International Symposium on Mixed and Augmented Reality - Arts, Media, and Humanities (ISMAR-AMH '13). IEEE Computer Society, 13-22. DOI: http://dx.doi.org/10.1109/ISMAR-AMH.2013.6671262","paperID":"None"},{"content":"Tao Ni, Doug Bowman, and Chris North. 2011. AirStroke: Bringing Unistroke Text Entry to Freehand Gesture Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2473-2476. DOI: http://dx.doi.org/10.1145/1978942.1979303","paperID":"None"},{"content":"Laurence Nigay and Joëlle Coutaz. 1993. A Design Space for Multimodal Systems: Concurrent Processing and Data Fusion. In Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems (CHI '93). ACM, NY, NY, USA, 172-178. DOI: http://dx.doi.org/10.1145/169059.169143","paperID":"None"},{"content":"Takehiko Ohno, Naoki Mukawa, and Atsushi Yoshikawa. 2002. FreeGaze: A Gaze Tracking System for Everyday Gaze Interaction. In Proceedings of the 2002 Symposium on Eye Tracking Research and Applications (ETRA '02). ACM, NY, NY, USA, 125-132. DOI: http://dx.doi.org/10.1145/507072.507098","paperID":"None"},{"content":"Jason Orlosky, Kiyoshi Kiyokawa, and Haruo Takemura. 2013. Dynamic Text Management for See-through Wearable and Heads-up Display Systems. In Proceedings of the 2013 International Conference on Intelligent User Interfaces (IUI '13). ACM, NY, NY, USA, 363-370. DOI: http://dx.doi.org/10.1145/2449396.2449443","paperID":"None"},{"content":"Bastian Pfieging and Albrecht Schmidt. 2015. (Non-) Driving-Related Activities in the Car: Defining Driver Activities for Manual and Automated Driving. In Workshop on Experiencing Autonomous Vehicles: Crossing the Boundaries between a Drive and a Ride at CHI'15 (2015-04-01). http://www.hcilab.org/wp-content/uploads/ pfleging-2015-drivingrelatedactivities1.pdf","paperID":"None"},{"content":"Bastian Pfieging, Stefan Schneegass, Dagmar Kern, and Albrecht Schmidt. 2015. Vom Transportmittel zum rollenden Computer - Interaktion im Auto. Informatik Spektrum 37, 5 (October 2015), 1-5. DOI: http://dx.doi.org/10.1007/s00287-014-0804--6","paperID":"None"},{"content":"Bastian Pfieging, Stefan Schneegass, and Albrecht Schmidt. 2012. Multimodal Interaction in the Car: Combining Speech and Gestures on the Steering Wheel. In Proceedings of the 4th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '12). ACM, NY, NY, USA, 155-162. DOI: http://dx.doi.org/10.1145/2390256.2390282","paperID":"None"},{"content":"Ioannis Politis, Stephen Brewster, and Frank Pollick. 2015. Language-based Multimodal Displays for the Handover of Control in Autonomous Cars. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '15). ACM, NY, NY, USA, 3-10. DOI: http://dx.doi.org/10.1145/2799250.2799262","paperID":"None"},{"content":"Sonja Rümelin, Chadly Marouane, and Andreas Butz. 2013. Free-hand Pointing for Identification and Interaction with Distant Objects. In Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '13). ACM, NY, NY, USA, 40-47. DOI:http://dx.doi.org/10.1145/2516540.2516556","paperID":"None"},{"content":"SAE International (SAE). 1997. Safety Glazing Materials for Glazing Motor Vehicles and Motor Vehicle Equipment Operating on Land Highways Safety Standard (ANSI Z26.1 1997th Edition). SAE International (SAE), 46.","paperID":"None"},{"content":"Akihiko Sato, Itaru Kitahara, Yoshinari Kameda, and Yuichi Ohta. 2006. Visual navigation system on windshield head-up display. In In Proceedings of 13th World Congress on Intelligent Transport Systems.","paperID":"None"},{"content":"Bill Schilit, Norman Adams, and Roy Want. 1994. Context-Aware Computing Applications. In First Workshop on Mobile Computing Systems and Applications, 1994 (WMCSA 1994). IEEE Computer Society, 85-90. DOI: http://dx.doi.org/10.1109/WMCSA.1994.16","paperID":"None"},{"content":"Ronald Schroeter and Andry Rakotonirainy. 2012. The future shape of digital cars. In Proceedings of the 2012 Australasian Road Safety Research, Policing and Education Conference. Australian College of Road Safety (ACRS), 1-11.","paperID":"None"},{"content":"Ronald Schroeter, Andry Rakotonirainy, and Marcus Foth. 2012. The Social Car: New Interactive Vehicular Applications Derived from Social Media and Urban Informatics. In Proceedings of the 4th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '12). ACM, NY, NY, USA, 107-110. DOI: http://dx.doi.org/10.1145/2390256.2390273","paperID":"None"},{"content":"Thomas A. Seder, Joseph F. Szczerba, and Dehua Cui. 2012. Night vision on full windshield head-up display. US Patent 8,164,543. (24 April 2012). https://www.google.com/patents/US8164543 Filed May 18, 2009.","paperID":"None"},{"content":"Thomas A. Seder, Joseph F. Szczerba, and Dehua Cui. 2013. External presentation of information on full glass display. US Patent 8,606,430. (10 December 2013). https://www.google.com/patents/US8606430 Filed October 8, 2010.","paperID":"None"},{"content":"Jack A. Segal, William Allen Yates, Steven B. Branton, and Jeff Mossontte. 2004. Remote control having touch pad to screen mapping. US Patent 6,765,557. (20 July 2004). https://www.google.com/patents/US6765557 Filed April 10, 2000.","paperID":"None"},{"content":"Ted Selker, Winslow Burleson, and Ernesto Arroyo. 2002. E-windshield: a study of using. In Extended abstracts of the 2002 Conference on Human Factors in Computing Systems, CHI 2002, Minneapolis, Minnesota, USA, April 20--25, 2002. 508-509. DOI: http://dx.doi.org/10.1145/506443.506453","paperID":"None"},{"content":"Taly Sharon, Ted Selker, Lars Wagner, and Ariel J. Frank. 2005. CarCoach: a generalized layered architecture for educational car systems. In Proceedings of IEEE International Conference on Software-Science, Technology and Engineering (SWSTE '05). IEEE Computer Society, 13-22. DOI: http://dx.doi.org/10.1109/SWSTE.2005.9","paperID":"None"},{"content":"Srinath Sridhar and Victor Ng-Thow-Hing. 2012. Generation of virtual display surfaces for in-vehicle contextual augmented reality. In IEEE International Symposium on Mixed and Augmented Reality (ISMAR '12). IEEE Computer Society, 317-318. DOI: http://dx.doi.org/10.1109/ISMAR.2012.6402592","paperID":"None"},{"content":"Maria Staubach. 2009. Factors correlated with traffic accidents as a basis for evaluating Advanced Driver Assistance Systems. Accident Analysis & Prevention 41, 5 (9 2009), 1025-1033. DOI: http://dx.doi.org/10.1016/j.aap.2009.06.014","paperID":"None"},{"content":"Jie Sun, Zhao-hui Wu, and Gang Pan. 2009. Context-aware smart car: from model to prototype. Journal of Zhejiang University SCIENCE A 10, 7 (2009), 1049-1059. DOI: http://dx.doi.org/10.1631/jzus.A0820154","paperID":"None"},{"content":"Sun Innovations. 2015. FW-HUD. Website. (2015). Retrieved September 19, 2015 from http://www.sun-innovations.com/index.php/products/ fw-hud/laser-scanning-fw-hud.","paperID":"None"},{"content":"Joseph F. Szczerba, Dehua Cui, and Thomas A. Seder. 2013. Driver drowsy alert on full-windshield head-up display. US Patent 8,344,894. (1 January 2013). https://www.google.com/patents/US8344894 Filed September 21, 2009.","paperID":"None"},{"content":"Joesph F. Szczerba, Thomas A. Seder, and Dehua Cui. 2014. Augmented road scene illustrator system on full windshield head-up display. US Patent 8,633,979. (21 January 2014). https://www.google.com/patents/US8633979 Filed December 29, 2010.","paperID":"None"},{"content":"Marcus Tönnis, Leslie Klein, and Gudrun Klinker. 2008. Perception thresholds for augmented reality navigation schemes in large distances. In 7th IEEE/ACM International Symposium on Mixed and Augmented Reality (ISMAR '08). IEEE Computer Society, 189-190. DOI:http://dx.doi.org/10.1109/ISMAR.2008.4637360","paperID":"None"},{"content":"Marcus Tönnis and Gudrun Klinker. 2014. Boundary Conditions for Information Visualization with Respect to the User's Gaze. In Proceedings of the 5th Augmented Human International Conference (AH '14). ACM, NY, NY, USA, Article 44, 8 pages. DOI: http://dx.doi.org/10.1145/2582051.2582095","paperID":"None"},{"content":"Marcus Tönnis, Marina Plavfiic, and Gudrun Klinker. 2009. Survey and Classification of Head-Up Display Presentation Principles. In Proceedings the 17th World Congress on Ergonomics. International Ergonomics Association. CD-ROM Proceedings.","paperID":"None"},{"content":"Armin Töpfer and Steffen Silbermann. 2008. Einsatz von Kunden-Fokusgruppen. In Handbuch Kundenmanagement, Armin Töpfer (Ed.). Springer Berlin Heidelberg, 267-279. DOI: http://dx.doi.org/10.1007/978--3--540--49924--4_10","paperID":"None"},{"content":"Stephen Uphill, Christopher Francis, Dominic Jackson, James Whittamore, and Ashleigh J. Pook. 2011. Heads-up display for a gaming environment. US Patent App. 12/868,512. (11 August 2011). https://www.google.com/patents/US20110193773 Filed August 25, 2010.","paperID":"None"},{"content":"Yohei Urano, Shinji Kashiwada, Hiroshi Ando, Koji Nakamura, and Yasuhiro Takaki. 2011. Super-multiview windshield display for driving assistance. Journal of Information Display 12, 1 (2011), 43-46. DOI: http://dx.doi.org/10.1080/15980316.2011.563060","paperID":"None"},{"content":"Wen Wu, Fabian Blaicher, Jie Yang, Thomas Seder, and Dehua Cui. 2009. A Prototype of Landmark-based Car Navigation Using a Full-windshield Head-up Display System. In Proceedings of the 2009 Workshop on Ambient Media Computing (AMC '09). ACM, NY, NY, USA, 21-28. DOI: http://dx.doi.org/10.1145/1631005.1631012","paperID":"None"},{"content":"Hiroshi Yasuda and Yoshihiro Ohama. 2012. Toward a practical wall see-through system for drivers: How simple can it be?. In 2012 IEEE International Symposium on Mixed and Augmented Reality (ISMAR '12). IEEE Computer Society, 333-334. DOI: http://dx.doi.org/10.1109/ISMAR.2012.6402600","paperID":"None"},{"content":"Jung-hack Yeo. 2000. Driver's eye detection method of drowsy driving warning system. US Patent 6,130,617. (10 October 2000). http://www.google.com/patents/US6130617 Filed June 9, 1999.","paperID":"None"},{"content":"Jung-hack Yeo. 2001. Driver's drowsiness detection method of drowsy driving warning system. US Patent 6,243,015. (5 June 2001). http://www.google.com/patents/US6243015 Filed June 17, 1999.","paperID":"None"},{"content":"Yanxia Zhang, Jörg Müller, Ming Ki Chong, Andreas Bulling, and Hans Gellersen. 2014. GazeHorizon: Enabling Passers-by to Interact with Public Displays by Gaze. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, NY, NY, USA, 559-563. DOI:http://dx.doi.org/10.1145/2632048.2636071","paperID":"None"}],"citation":[],"title":"A Design Space to Support the Development of Windshield Applications for the Car","filename":"CHI16/p5076","authors":["Renate Haeuslschmid","Bastian Pfleging","Florian Alt"],"conference":"CHI '16"}