{"paperId":2858053,"citation":[],"abstract":"The lack of certain types of geographic data prevents the development of location-aware technologies in a number of important domains. One such type of \"unmapped\" geographic data is space usage rules (SURs), which are defined as geographically-bound activity restrictions (e.g. \"no dogs\", \"no smoking\", \"no fishing\", \"no skateboarding\"). Researchers in the area of human-computer interaction have recently begun to develop techniques for the automated mapping of SURs with the aim of supporting activity planning systems (e.g. one-touch \"Can I Smoke Here?\" apps, SUR-aware vacation planning tools). In this paper, we present a novel SUR mapping technique -- SPtP -- that outperforms state-of-the-art approaches by 30% for one of the most important components of the SUR mapping pipeline: associating a point observation of a SUR (e.g. a 'no smoking' sign) with the corresponding polygon in which the SUR applies (e.g. the nearby park or the entire campus on which the sign is located). This paper also contributes a series of new SUR benchmark datasets to help further research in this area.","reference":[{"content":"Jiawei Han, Micheline Kamber, and Jian Pei. 2011. Data mining: concepts and techniques. Morgan Kaufmann, Waltham.","paperID":"None"},{"content":"F. Maxwell Harper, Daniel Moy, and Joseph A. Konstan. 2009. Facts or friends?: distinguishing informational and conversational questions in social Q&A sites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09)","paperID":"None"},{"content":"Mike Hazas, James Scott, and John Krumm. 2004. Location-aware computing comes of age. Computer 2 (2004), 95--97.","paperID":"None"},{"content":"Konstantin Hopf, Florian Dageförde, and Diedrich Wolter. 2015. Identifying the Geographical Scope of Prohibition Signs. In Proc. of International Conference on Spatial Information Theory (COSIT 2015), 247--267.","paperID":"None"},{"content":"Eija Kaasinen. 2003. User needs for location-aware mobile services. Personal and ubiquitous computing 7, 1 (2003), 70--79.","paperID":"None"},{"content":"Mehmed Kantardzic. 2011. Data mining: concepts, models, methods, and algorithms. John Wiley & Sons, Hoboken, New Jersey.","paperID":"None"},{"content":"Danico Lee and Costas Tsatsoulis. 2005. Intelligent data entry assistant for XML using ensemble learning. In Proceedings of the 10th international conference on Intelligent user interfaces (IUI '05). ACM, New York, NY, USA, 83--89.","paperID":"None"},{"content":"Polikar, R. Ensemble based systems in decision making. IEEE Circuits and Systems Magazine, 6 (2006).","paperID":"None"},{"content":"Russell, B. C., Torralba, A., Murphy, K. P., & Freeman, W. T. (2008). LabelMe: a database and webbased tool for image annotation. International journal of computer vision, 77(1--3), 157--173.","paperID":"None"},{"content":"Pavel Andreevich Samsonov, Xun Tang, Johannes Schöning, Werner Kuhn, and Brent Hecht. 2015. You Can't Smoke Here: Towards Support for Space Usage Rules in Location-aware Technologies. In Proc. of CHI (CHI '15). ACM, New York, NY, USA, 971--974.","paperID":"None"},{"content":"Johannes Schöning, Brent Hecht, and Werner Kuhn. 2014. Informing Online and Mobile Map Design with the Collective Wisdom of Cartographers. In Proc. DIS '14 (2014).","paperID":"None"},{"content":"Harrison Shoff. 2015. Mapping the World. (2015). http://nerds.airbnb.com/mapping-world/","paperID":"None"},{"content":"Martin Szummer and Rosalind W Picard. 1998. Indoor-outdoor image classification. In IEEE International Workshop on Content-Based Access of Image and Video Database. IEEE, 42--51.","paperID":"None"},{"content":"Justin Talbot, Bongshin Lee, Ashish Kapoor, and Desney S. Tan. 2009. Ensemble Matrix: interactive visualization to support machine learning with multiple classifiers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1283--1292.","paperID":"None"},{"content":"D.H. Wolpert and W.G. Macready. 1997. No free lunch theorems for optimization. Evolutionary Computation, IEEE Transactions on 1, 1 (1997), 67--82.","paperID":"None"},{"content":"Kathryn Zickuhr. 2013. Location-Based Services. Technical Report. Pew Internet & American Life Project, Washington, DC, USA.","paperID":"None"}],"title":"Helping Computers Understand Geographically-Bound Activity Restrictions","filename":"CHI16/p2442","authors":["Marcus Soll","Philipp Naumann","Johannes Schöning","Pavel Samsonov","Brent Hecht"],"conference":"CHI '16"}