{"paperId":2858070,"citation":[],"abstract":"Young people using powered wheelchairs have limited access to engaging leisure activities. We address this issue through a two-stage project; 1) the participatory development of a set of wheelchair-controlled, movement-based games (with 9 participants at a school that provides education for young people who have special needs) and 2) three case studies (4 participants) exploring player perspectives on a set of three wheelchair-controlled casual games. Our results show that movement-based playful experiences are engaging for young people using powered wheelchairs. However, the participatory design process and case studies also reveal challenges for game accessibility regarding the integration of movement in games, diversity of abilities among young people using powered wheelchairs, and the representation of disability in games. In our paper, we explore how to address those challenges in the development of accessible, empowering movement-based games, which is crucial to the wider participation of young people using powered wheelchairs in play.","reference":[{"content":"Lisa Anthony, Sapna Prasad, Amy Hurst, and Ravi Kuber. 2012. A Participatory Design Workshop on Accessible Apps and Games with Students with Learning Differences. In: Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '12), 253--254. http://dx.doi.org/10.1145/2384916.2384979","paperID":"None"},{"content":"Arpita Bhattacharya, Mirko Gelsomini, Patricia PérezFuster, Gregory D. Abowd, and Agata Rozga. 2015. Designing Motion-Based Activities to Engage Students with Autism in Classroom Settings. In: Proceedings of the 14th International Conference on Interaction Design and Children (IDC '15), 69--78. http://dx.doi.org/10.1145/2771839.2771847","paperID":"None"},{"content":"Laura Benton, Hilary Johnson, Emma Ashwin, Mark Brosnan, and Beate Grawemeyer. 2012. Developing IDEAS: Supporting children with autism within a participatory design team. In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2599--2608. http://dx.doi.org/10.1145/2207676.2208650","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (July 2008), 77--101. http://dx.doi.org/10.1191/1478088706qp063oa","paperID":"None"},{"content":"Bas Brederode, Panos Markopoulos, Mathieu Gielen, Arnold Vermeeren, and Huib de Ridder. 2005. pOwerball: The design of a novel mixed-reality game for children with mixed abilities. In: Proceedings of the 2005 Conference on Interaction Design and Children (IDC '05), 32--39. http://dx.doi.org/10.1145/1109540.1109545","paperID":"None"},{"content":"Stephen Cuzzort and Thad Starner. 2008. AstroWheelie: A wheelchair based exercise game. In: Proceedings of the 2008 12th IEEE International Symposium on Wearable Computers (ISWC '08), 113114. http://dx.doi.org/10.1109/ISWC.2008.4911599","paperID":"None"},{"content":"Jamal K. Edey, Katie Seaborn, Carmen Branje, Deborah I. Fels. 2014. Powered to play: A mixed reality game for people driving powered chairs. In: Proceedings of 2014 IEEE Games Media Entertainment (GEM), 1--8. http://dx.doi.org/10.1109/GEM.2014.7048101","paperID":"None"},{"content":"Jennifer Fereday and Eimear Muir-Cochrane. 2006. Demonstrating rigor using thematic analysis: A hybrid approach of inductive and deductive coding and theme development. International Journal of Qualitative Methods 5, 1 (2006), 80--92.","paperID":"None"},{"content":"Waddell T. Franklin, Sundar S. Shyam, and Auriemma Joshua. 2015. Can Customizing an Avatar Motivate Exercise Intentions and Health Behaviors Among Those with Low Health Ideals? Cyberpsychology, Behavior, and Social Networking 18, 11 (2015), 687--690.","paperID":"None"},{"content":"Clifford Geertz. 1973. Thick Description: Toward an InterpretiveTheory of Culture. The Interpretationof Cultures: Selected Essays. Basic Books: NY.","paperID":"None"},{"content":"Kathrin M. Gerling, Regan L. Mandryk, Matthew Miller, Michael R. Kalyn, Max Birk, and Jan D. Smeddinck. 2015. Designing Wheelchair-Based Movement Games. ACM Transactions on Accessible Computing (TACCESS) 6, 2 (March 2015), Article No. 6. http://dx.doi.org/10.1145/2724729","paperID":"None"},{"content":"Kathrin M. Gerling, Matthew Miller, Regan L. Mandryk, Max V. Birk, and Jan D. Smeddinck. 2014. Effects of Balancing for Physical Abilities on Player Performance, Experience, and Self-Esteem in Exergames. In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 2201--2210. http://dx.doi.org/10.1145/2556288.2556963","paperID":"None"},{"content":"Kathrin M. Gerling, Conor Linehan, Ben Kirman, Michael R. Kalyn, Adam B. Evans, and Kieran C. Hicks. 2015. Creating Wheelchair-Controlled Video Games: Challenges and Opportunities when Involving Young People with Mobility Impairments and Game Design Experts. International Journal of HumanComputer Studies. http://dx.doi.org/10.1016/j.ijhcs.2015.08.009","paperID":"None"},{"content":"Mona L. Guha, Allison Druin, and Jerry A. Fails. 2008. Designing with and for children with special needs: An inclusionary model. In: Proceedings of the 7th International Conference on Interaction Design and Children (IDC '08), 61--64. http://dx.doi.org/10.1145/1463689.1463719","paperID":"None"},{"content":"Hamilton A. Hernandez, Zi Ye, T.C. Nicholas Graham, Darcy Fehlings, and Lauren Switzer. 2013. Designing Action-based Exergames for Children with Cerebral Palsy. In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1261--1270. http://dx.doi.org/10.1145/2470654.2466164","paperID":"None"},{"content":"Harald Holone and Jo Herstad. 2013. Three Tensions in Participatory Design for Inclusion. In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2903--2906. http://dx.doi.org/10.1145/2470654.2481401","paperID":"None"},{"content":"IGDA Game Accessibility Guidelines. 2015. Retrieved August 8, 2015 from http://igda-gasig.org/about-gameaccessibility/development-frameworks/","paperID":"None"},{"content":"Rilla Khaled and Asimina Vasalou. 2014. Bridging Serious Games and Participatory Design. International Journal of Child-Computer Interaction 2, 2 (May 2014), 93-100. http://dx.doi.org/10.1016/j.ijcci.2014.03.001","paperID":"None"},{"content":"Gillian King, Theresa Petrenchik, Mary Law, and Patricia Hurley. 2009. The Enjoyment of Formal and Informal Recreation and Leisure Activities: A comparison of school-aged children with and without physical disabilities. International Journal of Disability, Development and Education 56, 2 (April 2009), 109--130.","paperID":"None"},{"content":"Laura Malinverni, Joan Mora-Guiard, Vanesa Padillo, Maria-Angeles Mairena, Amaia Hervás, and Narcis Pares. 2014. Participatory Design Strategies to Enhance the Creative Contribution of Children with Special Needs. In: Proceedings of the 2014 Conference on Interaction Design and Children (IDC '14), 85--94. http://dx.doi.org/10.1145/2593968.2593981","paperID":"None"},{"content":"David T. Mitchell and Sharon L. Snyder. 2001. The Uneasy Home of Disability in Literature and Film. In: Gary L. Albrecht, Katherine D., Seelman, and Michael Bury (Eds.): Handbook of Disability Studies. Sage Publications: Thousand Oaks, CA, USA.","paperID":"None"},{"content":"Tony Morelli and Eelke Folmer. 2014. Real-time sensory substitution to enable players who are blind to play video games using whole body gestures. Entertainment Computing 5, 1 (January 2014), 83--90. http://dx.doi.org/10.1016/j.entcom.2013.08.003","paperID":"None"},{"content":"Michael J. Muller and Allison Druin.2009. Participatory Design: The Third Space in HCI. In: Andrew Sears and Julie A. Jacko (Eds.): HumanComputer Interaction. CRC Press: Boca Raton.","paperID":"None"},{"content":"Thomas J. O'Connor, Shirley G. Fitzgerald, Rory A. Cooper, Tricia A. Thorman, and Michael L. Boninger. 2001. Does computer game play aid in motivation of exercise and increase metabolic activity during wheelchair ergometry? Medical Engineering & Physics 23, 4 (May 2001), 267--273. http://dx.doi.org/10.1016/S1350--4533(01)00046--7","paperID":"None"},{"content":"Luc Pauwels. 2010. Visual Sociology Reframed: An Analytical Synthesis and Discussion of Visual Methods in Social and Cultural Research. Sociological Methods & Research 38, 4 (May 2010), 545--581.","paperID":"None"},{"content":"John R. Porter and Julie A. Kientz. 2013. An empirical study of issues and barriers to mainstream video game accessibility. In: Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13), Article No. 3. http://dx.doi.org/10.1145/2513383.2513444","paperID":"None"},{"content":"Md. A. Rahman, Delwar Hossain, Ahmad M. Qamar, Faizan U. Rehman, Asad H. Toonsi, Mohamed Ahmed, Abdulmotaleb El Saddik, and Saleh Basalamah. 2014. A Low-cost Serious Game Therapy Environment with Inverse Kinematic Feedback for Children Having Physical Disability. In: Proceedings of International Conference on Multimedia Retrieval (ICMR '14), 529. http://dx.doi.org/10.1145/2578726.2582619","paperID":"None"},{"content":"Kyle Rector, Cynthia L. Bennett, and Julie A. Kientz. 2013. Eyes-free yoga: an exergames using depth cameras for blind & low vision exercise. In: Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13), Article No. 12. http://dx.doi.org/10.1145/2513383.2513392","paperID":"None"},{"content":"Diane Schwartz, Elfreda Blue, Mary McDonald, George Giuliani, Genevieve Weber, Holly Seirup, Sage, Rose, Deborah Elkis-Albuhoff, Jeffrey Rosenfeld, and Andrea Perkins. Dispelling stereotypes: promoting disability equality through film. Disability & Society 25, 7 (November 2010), 841--848.","paperID":"None"},{"content":"Anne B. Smith. 2007. Children as social actors: An introduction. International Journal of Children's Rights 15, 1(2007), 1--4.","paperID":"None"},{"content":"Abbie Solish, Adrienne Perry, and Patricia Minnes. 2010. Participation of Children with and without Disabilities in Social, Recreational and Leisure Activities. Journal of Applied Research in Intellectual Disabilities 23, 3 (2010), 226--236.","paperID":"None"},{"content":"Diane E. Taub and Kimberly R. Greer. 2000. Physical Activity as a Normalizing Experience for School-Age Children with Physical Disabilities. Journal of Sport & Social Issues 24, 4 (November 2000), 395--414.","paperID":"None"},{"content":"Jonathan Waddington, Conor Linehan, Kathrin Gerling, Kieran Hicks, and Timothy L. Hodgson. 2015. Participatory Design of Therapeutic Video Games for Young People With Neurological Vision Impairment. In: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 3533--3542. http://dx.doi.org/10.1145/2702123.2702261","paperID":"None"},{"content":"Thomas Westin, Kevin Bierre, Dimitris Gramenos, and Michelle Hinn. 2010. Advances in Game Accessibility from 2005 to 2010. Universal Access in HumanComputer Interaction, 400--409.","paperID":"None"},{"content":"Jacob O. Wobbrock, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-Based Design: Concept, Principles, and Examples. ACM Transactions on Accessible Computing (TACCESS) 3, 3 (April 2011), Article No. 9. http://dx.doi.org/10.1145/1952383.1952384","paperID":"None"},{"content":"Peter Wright and John McCarthy. 2008. Empathy and Experience in HCI. In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 637--646. http://dx.doi.org/10.1145/1357054.1357156","paperID":"None"},{"content":"Bei Yuan, Eelke Folmer, and Frederick C. Harris, Jr. 2011. Game accessibility: a survey. Universal Access in the Information Society 10, 1 (March 2011), 81--100. http://dx.doi.org/10.1007/s10209-010-0189--5","paperID":"None"}],"title":"Designing Movement-based Play With Young People Using Powered Wheelchairs","filename":"CHI16/p4447","authors":["Kathrin Gerling","Kieran Hicks","Michael Kalyn","Adam Evans","Conor Linehan"],"conference":"CHI '16"}