{"paperId":2858405,"citation":[],"reference":[{"content":"Ernesto Arias, Hal Eden, Gerhard Fischer, Andrew Gorman, and Eric Scharff. 2000. Transcending the individual human mind?creating shared understanding through collaborative design. ACM Transactions on Computer-Human Interaction (TOCHI) 7, 1: 84-113.","paperID":"None"},{"content":"Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2010. Participatory design and democratizing innovation. ACM, 41-50.","paperID":"None"},{"content":"John D. Bransford, Ann L. Brown, and Rodney R. Cocking. 1999. How people learn: Brain, mind, experience, and school. National Academy Press. Retrieved September 24, 2015 from http://doi.apa.org/psycinfo/1999-02807-000","paperID":"None"},{"content":"George Chin Jr, Olga A. Kuchar, and Katherine E. Wolf. 2009. Exploring the analytical processes of intelligence analysts. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 11-20. Retrieved September 24, 2015 from http://dl.acm.org/citation.cfm?id=1518704","paperID":"None"},{"content":"Taylor H. Cox and Stacy Blake. 1991. Managing cultural diversity: Implications for organizational competitiveness. The Executive 5, 3: 45-56.","paperID":"None"},{"content":"DiSalvo, Betsy. 2012. Glitch game testers: the design and study of a learning environment for computational production with young African American males. Retrieved September 2, 2015 from https://smartech.gatech.edu/handle/1853/43646","paperID":"None"},{"content":"Betsy DiSalvo and Carl DiSalvo. 2014. Designing for Democracy in Education: Participatory Design and the Learning Sciences.","paperID":"None"},{"content":"Betsy DiSalvo and Parisa Khanipour Roshan. 2014. Medium probes: exploring the medium not the message. ACM, 239-24","paperID":"None"},{"content":"Carl DiSalvo, Andrew Clement, and Volkmar Pipek. 2012. Participatory Design For, With, and By Communities. International Handbook of Participatory Design. Simonsen, Jesper and Toni Robertson (Eds). Oxford: Routledge.(2012): 182-20","paperID":"None"},{"content":"Andrea A. DiSessa. 2006. A History of Conceptual Change Research: Threads and Fault Lines. Cambridge University Press. Retrieved September 23, 2015 from http://psycnet.apa.org/psycinfo/2006-07157-016","paperID":"None"},{"content":"1Pelle Ehn. 2008. Participation in design things. Proceedings of the Tenth Anniversary Conference on Participatory Design 2008. Indiana University, 2008.","paperID":"None"},{"content":"Pelle Ehn. 1993. Scandinavian design: On participation and skill. Participatory Design: Principles and Practices: 41-77.","paperID":"None"},{"content":"John H. Flavell. 1979. Metacognition and cognitive monitoring: A new area of cognitive-developmental inquiry. American Psychologist 34, 10: 906.","paperID":"None"},{"content":"Michael J. Muller. 2002. Participatory design: the third space in HCI. Handbook of HCI, Lawrence Erlbaum, Hillsdale, NJ.","paperID":"None"},{"content":"Corinna Ogonowski, Benedikt Ley, Jan Hess, Lin Wan, and Volker Wulf. 2013. Designing for the living room: long-term user involvement in a living lab. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1539-1548. Retrieved September 23, 2015 from http://dl.acm.org/citation.cfm?id=2466205","paperID":"None"},{"content":"Helga Pfundt and Reinders Duit. 1988. Bibliography. Students' alternative frameworks and science education. Retrieved September 23, 2015 from http://eric.ed.gov/?id=ED315266","paperID":"None"},{"content":"Elizabeth B-N Sanders. 2002. From user-centered to participatory design approaches. Design and the social sciences: Making connections: 1-8.","paperID":"None"},{"content":"R. Keith Sawyer. 2006. The Cambridge handbook of the learning sciences. Cambridge Univ Pr.","paperID":"None"},{"content":"Donald A. Schön. 1983. The reflective practitioner: How professionals think in action. Basic books. Retrieved September 25, 2015 from","paperID":"None"},{"content":"Jesper Simonsen and Toni Robertson. 2012. Routledge handbook of participatory design. Routledge.","paperID":"None"},{"content":"2Elliot Soloway, Mark Guzdial, and Kenneth E Hay. 1994. Learner-centered design: The challenge for HCI in the 21st century. interactions 1, 2: 36-48.","paperID":"None"},{"content":"2Dag Svanaes and Gry Seland. 2004. Putting the users center stage: role playing and low-fi prototyping enable end users to design mobile systems. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 479-486. Retrieved September 23, 2015 from http://dl.acm.org/citation.cfm?id=985753","paperID":"None"},{"content":"Technology Group at Vanderbilt. 1997. The Jasper project: Lessons in curriculum, instruction, assessment, and professional development. Psychology Press.","paperID":"None"},{"content":"David Wood, Jerome S. Bruner, and Gail Ross. 1976. The role of tutoring in problem solving. Journal of Child Psychology and Psychiatry 17, 2: 89-100.","paperID":"None"}],"abstract":"Participatory design is a growing practice in the field of Human Computer Interaction (HCI). This note is a review of how participatory design activities are a form of learning. The premise of this exploration is that participatory design is more than asking participants for their help in design. Instead, participatory design is a set of methods and practices used to scaffold the design experience, increasing participants' reflection of their own knowledge and accounting for their previous knowledge so they can more fully engage in the design process. This active reflection and considerations of pervious experiences are closely tied to metacognition and a number of learning theories. Exploring previous studies provides examples of how learning theories are enacted through participatory design and how a greater awareness of these theories can inform the practice of participatory design.","title":"Participatory Design through a Learning Science Lens","filename":"CHI16/p4459","authors":["Betsy DiSalvo"],"conference":"CHI '16"}