{"paperId":2858399,"citation":[],"abstract":"Drawing on semi-structured interviews and cognitive mapping with 14 craftspeople, this paper analyzes the socio-technical arrangements of people and tools in the context of workspaces and productivity. Using actor-network theory and the concept of companionability, both of which emphasize the role of human and non-human actants in the socio-technical fabrics of everyday life, I analyze the relationships between people, productivity and technology through the following themes: embodiment, provenance, insecurity, flow and companionability. The discussion section develops these themes further through comparison with rhetoric surrounding the Internet of Things (IoT). By putting the experiences of craftspeople in conversation with IoT rhetoric, I suggest several policy interventions for understanding connectivity and inter-device operability as material, flexible and respectful of human agency.","reference":[{"content":"Luigi Atzori, Antonio Iera, and Giacomo Morabito. 2010. The Internet of Things: A survey. Comput. Netw. 54, 15 (October 2010), 2787--2805. http://dx.doi.org/10.1016/j.comnet.2010.05.010","paperID":"None"},{"content":"Sally Augustin. 2004. The Meaning of Office Things: A Study of Special Objects in Office Environments. Ph.D Dissertation. Claremont Graduate University, Claremont, CA.","paperID":"None"},{"content":"Shaowen Bardzell, Daniela K. Rosner, and Jeffrey Bardzell. 2012. Crafting quality in design: Integrity, creativity, and public sensibility. In Proceedings of the Designing Interactive Systems Conference (DIS '12), 11--20. http://doi.acm.org/10.1145/2317956.2317959","paperID":"None"},{"content":"Genevieve Bell and Paul Dourish. 2007. Yetserday's tomorrows: Notes on ubiquitous computing's dominant vision. Personal Ubiquitous Comput. 11, 2: 133--143.","paperID":"None"},{"content":"Christine Borgman. Data, Data Everywhere -- But How to Manage and Govern? Video. (15 June 2015). Retreived August 22, 2015 from http://works.bepress.com/borgman/366","paperID":"None"},{"content":"Aoife Brennan, Jasdeep S. Chugh, and Theresa Kline. 2002. Traditional versus open office design: A longitudinal field study. Environment and Behavior, 34, 3: 279--299.","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology, 3, 2: 77--101.","paperID":"None"},{"content":"Graham Brown. 2009. Claiming a corner at work: Measuring employee territoriality in their workspaces. Journal of Environmental Psychology, 29, 1: 44--52.","paperID":"None"},{"content":"Matthew Crawford. 2009. The Case for Working with Your Hands or Why Office Work is Bad for Us and Fixing Things Feels Good. Penguin.","paperID":"None"},{"content":"Mihaly Csikzentmihaly. 1991. Flow: The Psychology of Optimal Experience. HarperPerennial.","paperID":"None"},{"content":"Dries De Roeck, Karin Slegers, Johan Criel, Marc Godon, Laurence Claeys, Katriina Kilpi, and Ann Jacobs. 2012. I would DiYSE for it!: a manifesto for do-it-yourself internet-of-things creation. In Proceedings of the 7th Nordic Conference on HumanComputer Interaction: Making Sense Through Design (NordiCHI '12), 170--179. http://doi.acm.org/10.1145/2399016.2399044","paperID":"None"},{"content":"Anne S. Devlin, Sarah Donovan, Arianne Novolov, Olivia Nold, Andrea Packard, and Gabrielle Zandan. 2009. \"Impressive\"? credentials, family photographs, and the perception of therapist qualities. Journal of Environmental Psychology, 29, 4: 503--512.","paperID":"None"},{"content":"Paul Dourish and Genevieve Bell. 2011. Divining the Digital Guture. MIT Press.","paperID":"None"},{"content":"Kimberly Elsbach. 2004. Interpreting workplace identities: The role of office decor. Journal of Organizational Behavior, 25, 1: 99--128.","paperID":"None"},{"content":"Virginia Eubanks. 2011. Digital Dead End: Fighting for Social Justice in the Information Age. MIT Press.","paperID":"None"},{"content":"Ylva Fernaeus, Martin Jonsson, and Jakob Tholander. 2012. Revisiting the Jacquard loom: threads of history and current patterns in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1593--1602. http://doi.acm.org/10.1145/2207676.2208280","paperID":"None"},{"content":"Sarah Fox, Rachel Rose Ulgado, and Daniela Rosner. 2015. Hacking culture, not devices: Access and recognition in feminist hackerspaces. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 56--68. http://doi.acm.org/10.1145/2675133.2675223","paperID":"None"},{"content":"Joan Fujimura. 1991. On methods, ontologies, and representation in the sociology of science: Where do we stand. In Social organization and social process: Essays in honor of Anselm Strauss, David Maines (ed). A. de Gruyter, NY, NY, 207--248.","paperID":"None"},{"content":"Jack Jen Gieseking. 2013. Where we go from here. The mental sketch mapping method and its analytic components. Qualitative Inquiry, 19, 9: 712--724.","paperID":"None"},{"content":"James Glanz. 2012. Power, pollution and the Internet. The NY Times. Retrieved September 23, 2015 from http://www.nytimes.com/2012/09/23/technology/datacenters-waste-vast-amounts-of-energy-belyingindustry-image.html","paperID":"None"},{"content":"Connie Golsteijn, Elise Hoven, David Frohlich, and Abigail Sellen. 2014. Hybrid crafting: towards an integrated practice of crafting with physical and digital components. Personal Ubiquitous Comput. 18, 3: 593611.","paperID":"None"},{"content":"Elizabeth Goodman and Daniela Rosner. 2011. From garments to gardens: negotiating material relationships online and 'by hand'. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2257--2266. http://doi.acm.org/10.1145/1978942.1979273","paperID":"None"},{"content":"Samuel D. Gosling, Sei Jin Ko, Thomas Mannarelli, and Margaret Morris. 2002. A room with a cue: Personality judgements based on office and bedrooms. Journal of Personality and Social Psychology, 82, 3: 379.","paperID":"None"},{"content":"Sara Hachem, Thiago Teixeira, and Valérie Issarny. 2011. Ontologies for the internet of things. In Proceedings of the 8th Middleware Doctoral Symposium (MDS '11), article 3, 6 pages.","paperID":"None"},{"content":"Daniela Hernandez. 2012. Before the iPad, there was the Honeywell Kitchen Computer. Wired. Retrieved September 29, 2015 from http://www.wired.com/2012/11/kitchen-computer/","paperID":"None"},{"content":"Susmita Horrow and Anjali Sardana. 2012. Identity management framework for cloud based internet of things. In Proceedings of the First International Conference on Security of Internet of Things (SecurIT '12), 200--203.","paperID":"None"},{"content":"Philip Howard. 2015. Pax Technica: How the Internet of Things May Set Us Free or Lock Us Up. Yale University Press.","paperID":"None"},{"content":"Steven J. Jackson. 2014. Rethinking repair. Media Technoloiges: Essays on Communication, Materiality, and Society. Tarleton Gillespie, Pablo Boczkowski, Kirsten Foot (eds). MIT Press, Cambridge, USA, 221-","paperID":"None"},{"content":"Tom Jenkins. 2015. Designing the \"Things\" of the IoT. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, NY, NY, USA, 449--452. http://dx.doi.org/10.1145/2677199.2691608","paperID":"None"},{"content":"Jodi Kantor and David Streitfeld. 2015. Inside Amazon: Wrestling big ideas in a bruising workplace. NY Times. Retrieved August 15, 2015 from http://www.nytimes.com/2015/08/16/technology/inside -amazon-wrestling-big-ideas-in-a-bruisingworkplace.html","paperID":"None"},{"content":"David S. Kirk and Abigail Sellen. 2010. On human remains: Values and practice in the home archiving of cherished objects. ACM Trans. Comput.-Hum. Interact. 17, 3, Article 10 (July 2010), 43 pages. http://doi.acm.org/10.1145/1806923.1806924","paperID":"None"},{"content":"Bruno Latour. 1990. Technology is society made durable. The Sociological Review 38, S1: 103--131.","paperID":"None"},{"content":"Bruno Latour. 2007. Reassembling the Social: An Introduction to Actor-Network-Theory. Oxford University Press.","paperID":"None"},{"content":"So Young Lee and Jay L. Brand. 2005. Effects of control over office workspace on perceptions of the work environment and work outcomes. Journal of Environmental Psychology, 25, 3: 323--333.","paperID":"None"},{"content":"Henri Lefebvre. 1991 The production of space. WileyBlackwell.","paperID":"None"},{"content":"Jessica Lingel and Tim Regan. 2014. \"it's in your spinal cord, it's in your fingertips\": practices of tools and craft in building software. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 295--304. http://doi.acm.org/10.1145/2531602.2531614","paperID":"None"},{"content":"Tara J. Liss-Marino. 2014. Sell (it) yourself: Marketing pleasure in digital DIY. Ph.D Dissertation. University of Pennsylvania, Philadelphia, PA.","paperID":"None"},{"content":"Susan S. Lukesh. 2014. The Internet of Things. ACM Inroads, 5, 3: 60.","paperID":"None"},{"content":"Carolyn Marvin. 1997. When old technologies were new. Oxford University Press.","paperID":"None"},{"content":"Alice Marwick. 2013. Status update. Yale University Press.","paperID":"None"},{"content":"Michael Massimi and Daniela Rosner. 2013. Crafting for major life events: implications for technology design and use. In Proceedings of the 27th International BCS Human Computer Interaction Conference (BCS-HCI '13), Article 34, 6 pages.","paperID":"None"},{"content":"Dejan Milojicic, Paul Nikolich and Barry Leiba. 2015. The internet of things: Standards for tomorrow. Ubiquity 2015, November, Article 1, 12 pages. DOI=http://dx.doi.org/10.1145/2822533","paperID":"None"},{"content":"Vincent Mosco. 2014. To the Cloud: Big Data in a Turbulent World. Paradigm Publishers.","paperID":"None"},{"content":"Greg Oldham and Yitzhak Fried. 1987. Employee reactions to workspace characteristics. Journal of Applied Psychology, 72, 1: 75.","paperID":"None"},{"content":"Howard Risatti. 2007. A Theory of Craft: Function and Aesthetic Expression. University of NC Press.","paperID":"None"},{"content":"Daniela K. Rosner. 2010. Mediated crafts: digital practices around creative handwork. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, NY, NY, USA, 2955--2958. http://doi.acm.org/10.1145/1753846.1753894","paperID":"None"},{"content":"Daniela K. Rosner and Kimiko Ryokai. 2009. Reflections on craft: probing the creative process of everyday knitters. In Proceedings of the seventh ACM conference on Creativity and cognition (C&C '09). ACM, NY, NY, USA, 195--204. http://doi.acm.org/10.1145/1640233.1640264","paperID":"None"},{"content":"Jathan Sadowski and Frank Pasquale. 2015. The spectrum of control: A social theory of the smart city. First Monday, 20, 7.","paperID":"None"},{"content":"Nikil Saval. 2014. Cubed: A secret history of the workforce. Doubleday.","paperID":"None"},{"content":"Susan Scheiberg. 1990. Emotions on display the personal decoration of work space. The American Behavioral Scientist, 33, 3: 330.","paperID":"None"},{"content":"Richard Sennett. 2008. The Craftsman. Yale University Press.","paperID":"None"},{"content":"James P. Spradley. 1979. The Ethnographic Interview. Harcourt, Brace, Jovanovic.","paperID":"None"},{"content":"Matthew Stahl. 2014. Unfree Masters: Popular Music and the Politics of Work (Refiguring American Music). Duke University Press.","paperID":"None"},{"content":"Anselm L. Strauss and Juliet M. Corbin. 1990. Basics of qualitative research. Sage.","paperID":"None"},{"content":"Joshua G. Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing technology: pleasure, utility and expressiveness in DIY and maker practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2603--2612. http://doi.acm.org/10.1145/2470654.2481360","paperID":"None"},{"content":"Gavin Turner and Jeremy Myerson. 2000. New workspace, new culture. The Journal for Quality and Participation, 23, 5: 45.","paperID":"None"},{"content":"Joseph Turow, Lee McGuigan, and Elena R. Maris. 2015. Making data mining a natural part of life: Physical retailing, customer surveillance and the 21st century social imaginary. European Journal of Cultural Studies, 18, 4--5: 464--478.","paperID":"None"},{"content":"Mark Weiser. 1994. Building invisible interfaces. Keynote talk. In Proc. ACM UIST.","paperID":"None"},{"content":"Meredith Wells, Luke Thelen, and Jennifer Ruark. 2007. Workspace personalization and organizational culture: Does your workspace reflect you or your company' Environment and Behavior, 39, 5: 616--634.","paperID":"None"},{"content":"Meredith Wells and Luke Thelen. 2002. What does your workspace say about you? The influence of personality, status, and workspace on personalization. Environment and Behavior, 34, 3: 300321.","paperID":"None"},{"content":"Jim Wood. 2010. Designing for an everyday ubicomp with tangible and embodied materials. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction (TEI '11), 449450. http://dx.doi.org/10.1145/1935701.1935825","paperID":"None"},{"content":"Amit Zoran. 2015. Hybrid craft: showcase of physical and digital integration of design and craft skills. In ACM SIGGRAPH Art Gallery (SIGGRAPH '15), 384--398. http://doi.acm.org/10.1145/2810185.2810187","paperID":"None"}],"title":"The Poetics of Socio-Technical Space: Evaluating the Internet of Things Through Craft","filename":"CHI16/p815","authors":["Jessica Lingel"],"conference":"CHI '16"}