{"paperId":2858525,"citation":[],"reference":[{"content":"Chris Berka and DJ Levendowski. 2007. EEG correlates of task engagement and mental workload in vigilance, learning, and memory tasks. Aviat Space Environ Med. 78, 5 Suppl (May 2007), B231--44.","paperID":"None"},{"content":"Benjamin Blankertz, Michael Tangermann, Carmen Vidaurre, Siamac Fazli, Claudia Sannelli, Stefan Haufe, Cecilia Maeder, Lenny Ramsey, Irene Sturm, Gabriel Curio, and Klaus-Robert Müller. 2010. The Berlin Brain-Computer Interface: Non-Medical Uses of BCI Technology. Front Neurosci 4 (Jan. 2010), 198.","paperID":"None"},{"content":"Christopher G. Burns and Stephen H. Fairclough. 2015. Use of auditory event-related potentials to measure immersion during a computer game. International Journal of Human-Computer Studies 73 (2015), 107--114.","paperID":"None"},{"content":"Ula Cartwright-Finch and Nilli Lavie. 2007. The role of perceptual load in inattentional blindness. Cognition 102, 3 (2007), 321--340.","paperID":"None"},{"content":"J T Coull. 1998. Neural correlates of attention and arousal: insights from electrophysiology, functional neuroimaging and psychopharmacology. Progress in neurobiology 55, 4 (July 1998), 343--61.","paperID":"None"},{"content":"Edward Cutrell and Desney Tan. 2008. BCI for passive input in HCI. CHI '08 Workshops (2008), 1--3.","paperID":"None"},{"content":"Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness. In MindTrek '11. 9.","paperID":"None"},{"content":"Stephen H. Fairclough. 2009. Fundamentals of physiological computing. Interacting with Comp. 21, 1--2 (Jan. 2009), 133--145.","paperID":"None"},{"content":"Pierre W Ferrez and Jose Del R Millan. 2008. Error-related EEG potentials generated during simulated brain-computer interaction. IEEE Trans. Biomed. Eng. 55, 3 (March 2008), 923--9.","paperID":"None"},{"content":"David R. Flatla, Carl Gutwin, Lennart E. Nacke, Scott Bateman, and Regan L. Mandryk. 2011. Calibration games: making calibration tasks enjoyable by adding motivating game elements. UIST '11 (2011), 403--412.","paperID":"None"},{"content":"Jérémy Frey, Christian Mühl, Fabien Lotte, and Martin Hachet. 2014. Review of the use of electroencephalography as an evaluation method for human-computer interaction. In PhyCS '14.","paperID":"None"},{"content":"David Grimes, DS Tan, and SE Hudson. 2008. Feasibility and pragmatics of classifying working memory load with an electroencephalograph. CHI '08 (2008), 835.","paperID":"None"},{"content":"F.E. Grubbs. 1969. Procedures for Detecting Outlying Observations in Samples. Technometrics 11, 1 (1969), 1--21.","paperID":"None"},{"content":"SG Hart and LE Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Human mental workload.","paperID":"None"},{"content":"Leanne M. Hirshfield, Erin Treacy Solovey, Audrey Girouard, James Kebinger, Robert J.K. Jacob, Angelo Sassaroli, and Sergio Fantini. 2009. Brain measurement for usability testing and adaptive interfaces. In CHI '09. ACM Press, NY, NY, USA, 2185.","paperID":"None"},{"content":"Ulrich Hoffmann, JM Vesin, and Touradj Ebrahimi. 2006. Spatial filters for the classification of event-related potentials. In ESANN '06.","paperID":"None"},{"content":"J. Matias Kivikangas, Inger Ekman, Guillaume Chanel, Simo Järvelä, Ben Cowley, Pentti Henttonen, and Niklas Ravaja. 2010. Review on psychophysiological methods in game research. Proc. of 1st Nordic DiGRA (2010).","paperID":"None"},{"content":"Olivier Ledoit and Michael Wolf. 2004. A well-conditioned estimator for large-dimensional covariance matrices. J Multivar Anal (Feb. 2004).","paperID":"None"},{"content":"A. John Maule and Anne C Edland. 1997. The effects of time pressure on human judgment and decision making. In Decision making: Cognitive models and Explanations.","paperID":"None"},{"content":"Ranjana K Mehta and Raja Parasuraman. 2013. Neuroergonomics: a review of applications to physical and cognitive work. Frontiers in human neuroscience 7, December (Jan. 2013), 889.","paperID":"None"},{"content":"Ernst Niedermeyer and FH Lopes da Silva. 2005. Electroencephalography: basic principles, clinical applications, and related fields. LWW.","paperID":"None"},{"content":"S Nieuwenhuis, K R Ridderinkhof, J Blom, G P Band, and A Kok. 2001. Error-related brain potentials are differentially related to awareness of response errors: evidence from an antisaccade task. Psychophysiology 38, 5 (Sept. 2001), 752--60.","paperID":"None"},{"content":"Richard E. Nisbett and Timothy DeCamp Wilson. 1977. Telling more than we can know: Verbal reports on mental processes. Psychological Review 84, 3 (1977), 231--260.","paperID":"None"},{"content":"Adrian M. Owen, Kathryn M. McMillan, Angela R. Laird, and Ed Bullmore. 2005. N-back working memory paradigm: A meta-analysis of normative functional neuroimaging studies. Human Brain Mapping 25, 1 (2005), 46--59.","paperID":"None"},{"content":"Evan M M. Peck, Beste F. Yuksel, Alvitta Ottley, Robert J.K. Jacob, and Remco Chang. 2013. Using fNIRS brain sensing to evaluate information visualization interfaces. CHI '13 (2013), 473.","paperID":"None"},{"content":"Rosalind W. Picard. 1995. Affective computing. Technical Report 321. MIT Media Laboratory.","paperID":"None"},{"content":"Matthew Pike, ML Wilson, Anna Divoli, and Alyona Medelyan. 2012. CUES: Cognitive Usability Evaluation System. EuroHCIR '12 (2012), 1--4.","paperID":"None"},{"content":"G. Michael Poor, Guy Zimmerman, Dale S. Klopfer, Samuel D. Jaffee, Laura Marie Leventhal, and Julie Barnes. 2013. Mobility Matters: Identifying Cognitive Demands That Are Sensitive to Orientation. In Interact '13, Vol. 8117 LNCS. 193--210.","paperID":"None"},{"content":"Felix Putze, Christoph Amma, and Tanja Schultz. 2015. Design and Evaluation of a Self-Correcting Gesture Interface based on Error Potentials from EEG. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3375--3384.","paperID":"None"},{"content":"Herbert Ramoser, Johannes Müller-Gerking, and Gert Pfurtscheller. 2000. Optimal spatial filtering of single trial EEG during imagined hand movement. IEEE Trans Rehabil Eng 8, 4 (2000), 441--446.","paperID":"None"},{"content":"S Sternberg. 1966. High-speed scanning in human memory. Science (NY, N.Y.) 153 (1966), 652--654.","paperID":"None"},{"content":"Romain Trachel, Thomas Brochier, and Maureen Clerc. 2013. Enhancing visuospatial attention performance with brain-computer interfaces. CHI '13 (2013), 1245.","paperID":"None"},{"content":"Chi Vi and Sriram Subramanian. 2012. Detecting error-related negativity for interaction design. CHI '12 (2012), 493.","paperID":"None"},{"content":"J.A. Wilson, C. Guger, and G. Schalk. 2012. BCI hardware and software. In Brain-computer interfaces: principles and practice. 165--188.","paperID":"None"},{"content":"Dennis Wobrock, Jérémy Frey, Delphine Graef, Jean-Baptiste de la Rivi'ere, Julien Castet, and Fabien Lotte. 2015. Continuous Mental Effort Evaluation during 3D Object Manipulation Tasks based on Brain and Physiological Signals. In INTERACT '15.","paperID":"None"}],"abstract":"Measuring brain activity with electroencephalography (EEG) is mature enough to assess mental states. Combined with existing methods, such tool can be used to strengthen the understanding of user experience. We contribute a set of methods to estimate continuously the user's mental workload, attention and recognition of interaction errors during different interaction tasks. We validate these measures on a controlled virtual environment and show how they can be used to compare different interaction techniques or devices, by comparing here a keyboard and a touch-based interface. Thanks to such a framework, EEG becomes a promising method to improve the overall usability of complex computer systems.","title":"Framework for Electroencephalography-based Evaluation of User Experience","filename":"CHI16/p2283","authors":["Jérémy Frey","Maxime Daniel","Julien Castet","Martin Hachet","Fabien Lotte"],"conference":"CHI '16"}