{"paperId":2858044,"abstract":"Many people struggle with efforts to make healthy behavior changes, such as healthy eating. Several existing approaches promote healthy eating, but present high barriers and yield limited engagement. As a lightweight alternative approach to promoting mindful eating, we introduce and examine crumbs: daily food challenges completed by consuming one food that meets the challenge. We examine crumbs through developing and deploying the iPhone application Food4Thought. In a 3 week field study with 61 participants, crumbs supported engagement and mindfulness while offering opportunities to learn about food. Our 2x2 study compared nutrition versus non-nutrition crumbs coupled with social versus non-social features. Nutrition crumbs often felt more purposeful to participants, but non-nutrition crumbs increased mindfulness more than nutrition crumbs. Social features helped sustain engagement and were important for engagement with non-nutrition crumbs. Social features also enabled learning about the variety of foods other people use to meet a challenge.","reference":[{"content":"Hugo J. E. M. Alberts, Sandra Mulkens, Maud Smeets, and Roy Thewissen. (2010). Coping with food cravings. Investigating the potential of a mindfulnessbased intervention. Appetite, 55(1), 160-163. http://doi.org/cfj8dz","paperID":"None"},{"content":"Hugo J. E. M. Alberts, Roy Thewissen, and Loes Raes. (2012). Dealing with problematic eating behaviour. The effects of a mindfulness-based intervention on eating behaviour, food cravings, dichotomous thinking and body image concern. Appetite, 58(3), 847-851. http://doi.org/fxjm5k","paperID":"None"},{"content":"Adrienne Andrew, Gaetano Borriello, and James Fogarty. (2013). Simplifying Mobile Phone Food Diaries: Design and Evaluation of a Food Index-Based Nutrition Diary. Proceedings of the International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '13), 260-263. http://doi.org/bbkk","paperID":"None"},{"content":"Bruce Arnow, Justin Kenardy, and W. Stewart Agras. (1995). The Emotional Eating Scale: The Development of a Measure to Assess Coping with Negative Affect by Eating. The International Journal of Eating disorders, 18(1), 79-90. http://doi.org/fs28bx","paperID":"None"},{"content":"Ruth A. Baer, Sarah Fischer, and Debra B. Huss. (2005). Mindfulness and Acceptance in the Treatment of Disordered Eating. Journal of Rational-Emotive & Cognitive-Behavior Therapy, 23(4), 281-300. http://doi.org/dkc49g","paperID":"None"},{"content":"Eric P. S. Baumer, Sherri Jean Katz, Jill E. Freeman, Phil Adams, Amy L. Gonzales, JP Pollak, Daniela Retelny, Jeff Niederdeppe, Christine M. Olson, and Geri K. Gay. (2012). Prescriptive Persuasion and Open-Ended Social Awareness: Expanding the Design Space of Mobile Health. Proceedings of the ACM Conference on Computer Supported Cooperative Work (CSCW '12), 475-484. http://doi.org/bbkm","paperID":"None"},{"content":"Eric P. S. Baumer, Vera Khovanskaya, Phil Adams, John P. Pollak, Stephen Voida, and Geri Gay. (2013). Designing for Engaging Experiences in Mobile Social Health Support Systems. IEEE Pervasive Computing, 12(3), 32-39. http://doi.org/bbkn","paperID":"None"},{"content":"Jeannette M. Beasley, William T. Riley, Amanda Davis, and Jatinder Singh. (2008). Evaluation of a PDA-based dietary assessment and intervention program: a randomized controlled trial. Journal of the American College of Nutrition, 27(2), 280-286. http://doi.org/bbkp","paperID":"None"},{"content":"Frank Bentley and Konrad Tollmar. (2013). The Power of Mobile Notifications to Increase Wellbeing Logging Behavior. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1095-1098. http://doi.org/f2zs59","paperID":"None"},{"content":"Sahara Byrne, Geri Gay, J. P. Pollack, Amy Gonzales, Daniela Retelny, Theodore Lee, and Brian Wansink. (2012). Caring for Mobile Phone-Based Virtual Pets can Influence Youth Eating Behaviors. Journal of Children and Media, 6(1), 83-99. http://doi.org/dskw69","paperID":"None"},{"content":"Nathan K. Cobb and Josée Poirier. (2014). Effectiveness of a Multimodal Online Well-Being Intervention: A Randomized Controlled Trial. American Journal of Preventive Medicine, 46(1), 41- 48. http://doi.org/bbkq","paperID":"None"},{"content":"Sunny Consolvo, Katherine Everitt, Ian Smith, and James A. Landay. (2006). Design Requirements for Technologies that Encourage Physical Activity. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 457-466. http://doi.org/b2wmz3","paperID":"None"},{"content":"Sunny Consolvo, Predrag Klasnja, David W. McDonald, and James A. Landay. (2009). Goal-setting Considerations for Persuasive Technologies that Encourage Physical Activity. Proceedings of the International Conference on Persuasive Technology (Persuasive '09). http://doi.org/cddnsz","paperID":"None"},{"content":"Felicia Cordeiro, Elizabeth Bales, Erin Cherry, and James Fogarty. (2015). Rethinking the Mobile Food Journal: Exploring Opportunities for Lightweight Photo-Based Capture. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 3207-3216. http://doi.org/bbkc","paperID":"None"},{"content":"Felicia Cordeiro, Daniel A. Epstein, Edison Thomaz, Elizabeth Bales, Arvind K. Jagannathan, Gregory D. Abowd, and James Fogarty. (2015). Barriers and Negative Nudges: Exploring Challenges in Food Journaling. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1159-1162. http://doi.org/bbdt","paperID":"None"},{"content":"Franco Curmi, Maria Angela Ferrario, Jen Southern, and Jon Whittle. (2013). HeartLink : Open Broadcast of Live Biometric Data to Social Networks. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1749-1758. http://doi.org/bbkr","paperID":"None"},{"content":"Daniel A. Epstein, Bradley H. Jacobson, Elizabeth Bales, David W. McDonald, and Sean A. Munson. (2015). From \"nobody cares\" to \"way to go!\": A Design Framework for Social Sharing in Personal Informatics. Proceedings of the ACM Conference on Computer Supported Cooperative Work (CSCW '15). http://doi.org/bbks","paperID":"None"},{"content":"BJ Fogg. (2009). Creating Persuasive Technologies: An Eight-Step Design Process. Proceedings of the International Conference on Persuasive Technology (Persuasive '09). http://doi.org/b4vd4k","paperID":"None"},{"content":"Celia Framson, Alan R. Kristal, Jeanette M. Schenk, Alyson J. Littman, Steve Zeliadt, and Denise Benitez. (2009). Development and validation of the Mindful Eating Questionnaire. Journal of the American Dietetic Association, 109, 1439-1444. http://doi.org/fjzb7h","paperID":"None"},{"content":"Jim Gormally, Sionag Black, Sandy Daston, and David Rardin. (1982). The Assessment of Binge Eating Severity among Obese Persons. Addictive Behaviors, 7(1), 47-55. http://doi.org/b29mxz","paperID":"None"},{"content":"Rúben Gouveia, Evangelos Karapanos, and Marc Hassenzahl. (2015). How Do We Engage With Activity Trackers? A Longitudinal Study of Habito. Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 1305-1316. http://doi.org/10.1145/2750858.2804290","paperID":"None"},{"content":"Andrea Grimes and Richard Harper. (2008). Celebratory Technology?: New Directions for Food Research in HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 467-476. http://doi.org/cvc429","paperID":"None"},{"content":"Jon Kabat-Zinn. (1990). Full Catastrophe Living: Using the Wisdom of Your Body and Mind to Face Stress, Pain, and Illness. Dell Publishing, NY. http://doi.org/fb57wh","paperID":"None"},{"content":"Jean Kristeller, Ruth Q. Wolever, and Virgil Sheets. (2014). Mindfulness-Based Eating Awareness Training (MB-EAT) for Binge Eating: A Randomized Clinical Trial. Mindfulness, 5, 282-297. http://doi.org/bbkt","paperID":"None"},{"content":"James J. Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B. Strub. (2006). Fish 'n' Steps: Encouraging Physical Activity with an Interactive Computer Game. Proceedings of the International Conference on Ubiquitous Computing (UbiComp 2006), 261-278. http://doi.org/crcvd9","paperID":"None"},{"content":"Edwin A. Locke and Gary P. Latham. (2002). Building a practically userful theory of goal setting and task motivation: a 35-year odyssey. American Pyschologist, 57(9), 705-717. http://doi.org/d4d932","paperID":"None"},{"content":"Jennifer Mankoff, Gary Hsieh, Ho Chak Hung, Sharon Lee, and Elizabeth Nitao. (2002). Using Low-Cost Sensing to Support Nutritional Awareness. Proceedings of the International Conference on Ubiquitous Computing (UbiComp '02), 1-8. http://doi.org/cf5gf2","paperID":"None"},{"content":"Jean W. Marr. (1971). Individual dietary surveys: purposes and methods. World Review of Nutrition and Dietetics, 13, 105 - 64. http://doi.org/bbkv","paperID":"None"},{"content":"Elina Mattila, Juha Pärkkä, Marion Hermersdorf, Jussi Kaasinen, Janne Vainio, Kai Samposalo, Juho Merilahti, Juha Kolari, Minna Kulju, Raimo Lappalainen, and Ilkka Korhonen. (2008). Mobile diary for wellness management-results on usage and usability in two user studies. IEEE Transactions on Information Technology in Biomedicine, 12(4), 501- 512. http://doi.org/fpfv5s","paperID":"None"},{"content":"Sean A. Munson and Sunny Consolvo. (2012). Exploring Goal-Setting, Rewards, Self-Monitoring, and Sharing to Motivate Physical Activity. Proceedings of the International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '12), 25-32.","paperID":"None"},{"content":"Sean A. Munson, Erin Krupka, Caroline Richardson, and Paul Resnick. (2015). Effects of Public Commitments and Accountability in a Technology Supported Physical Activity Intervention. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1135-1144. http://doi.org/bbkw","paperID":"None"},{"content":"Sean A. Munson, Debra Lauterbach, Mark W. Newman, and Paul Resnick. (2010). Happier Together: Integrating a Wellness Application into a Social Network Site. Persuasive Technology, 27-39. http://doi.org/fsm763","paperID":"None"},{"content":"Kenton O'Hara, John Helmes, Abigail Sellen, Richard Harper, Martijn Bhömer, and Elise van den Hoven. (2012). Food for Talk: Phototalk in the Context of Sharing a Meal. Human-Computer Interaction, 27, 124-150. http://doi.org/10.1080/07370024.2012.656069","paperID":"None"},{"content":"G. A. O'Reilly, L. Cook, D. Spruijt-Metz, and D. S. Black. (2014). Mindfulness-based interventions for obesity-related eating behaviours: A literature review. Obesity Reviews, 15, 453-461. http://doi.org/bbkx","paperID":"None"},{"content":"Josée Poirier and Nathan K. Cobb. (2012). Social influence as a driver of engagement in a web-based health intervention. Journal of Medical Internet research, 14(1), e36. http://doi.org/bbkz","paperID":"None"},{"content":"Paul J. Resnick, Adrienne W. Janney, Lorraine R. Buis, and Caroline R. Richardson. (2010). Adding an Online Community to an Internet-Mediated Walking Program. Part 2: Strategies for Encouraging Community Participation. Journal of Medical Internet research, 12(4), e72. http://doi.org/fxc3pg","paperID":"None"},{"content":"Caroline R. Richardson, Lorraine R. Buis, Adrienne W. Janney, David E. Goodrich, Ananda Sen, Michael L. Hesse, Kathleen S. Mehari, Laurie A. Fortlage, Paul J. Resnick, Brian J. Zikmund-Fisher, Victor J. Stretcher, and John D. Piette. (2010). An Online Community Improves Adherence in an Internet-Mediated Walking Program. Part 1: Results of a Randomized Controlled Trial. Journal of Medical Internet research, 12(4). http://doi.org/bh5ngp","paperID":"None"},{"content":"Jason J. Saleem, Emily S. Patterson, Laura Militello, Marta L. Render, Greg Orshansky, and Steven M. Asch. (2005). Exploring Barriers and Facilitators to the Use of Computerized Clinical Reminders. Journal of the American Medical Informatics Association, 12(4), 438-447. http://doi.org/cr6q5g","paperID":"None"},{"content":"Albert J. Stunkard and Samuel Messick. (1985). The Three-Factor Eating Questionnaire to Measure Dietary Restraint, Disinhibition and Hunger. Journal of Psychosomatic Research, 29(1), 71-83. http://doi.org/bkthvb","paperID":"None"},{"content":"Tammy Toscos, Anne Faber, Kay Connelly, and Adity Mutsuddi Upoma. (2008). Encouraging Physical Activity in Teens: Can Technology Help Reduce Barriers to Physical Activity in Adolescent Girls? Proceedings of the International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '08), 218-221. http://doi.org/cvmffx","paperID":"None"},{"content":"Christopher C. Tsai, Gunny Lee, Fred Raab, Gregory J. Norman, Timothy Sohn, William G. Griswold, and Kevin Patrick. (2007). Usability and Feasibility of PmEB: A Mobile Phone Application for Monitoring Real Time Caloric Balance. Mobile Networks and Applications, 12, 173-184. http://doi.org/bg67bf","paperID":"None"},{"content":"Brian Wansink. (2004). Environmental Factors That Increase the Food Intake and Consumption Volume of Unknowing Consumers. Annual Review of Nutrition, 24, 455-79. http://doi.org/fp2pgr","paperID":"None"}],"citation":[],"title":"Crumbs: Lightweight Daily Food Challenges to Promote Engagement and Mindfulness","filename":"CHI16/p5632","authors":["Daniel A. Epstein","Felicia Cordeiro","James Fogarty","Gary Hsieh","Sean A. Munson"],"conference":"CHI '16"}