{"paperId":2858406,"citation":[],"abstract":"Exergames are a fun and engaging way to participate in physical activity. Exergame users consistently require new content to maintain interest in the activity. One way to provide users with high quality content with minimal development work is to convert existing off-the-shelf digital games into exergames by using the game's \"modding\" interface. To explore the potential of converted exergames for inspiring high exertion levels we performed a conversion on two popular games: Half-Life 2 and The Elder Scrolls V: Skyrim. The conversions were performed in two stages. The first stage mimics existing conversion techniques and a second stage provides added incentive for players to reach higher exertion levels. A study of 18 participants found that the resulting games support anti-sedentary levels of exertion while falling slightly below national recommendations for cardiovascular exercise. Adding exercise to the games did not affect players' enjoyment.","reference":[{"content":"American College of Sports Medecine. 2013. ACSM's Guidelines for Exercise Testing and Prescription. Libincott Williams & Wilkins.","paperID":"None"},{"content":"Anthony Barnett, Ester Cerin, and Tom Baranowski. 2011. Active Video Games for Youth: A Systematic Review. Journal of Physical Activity and Health 8, 5: 724--737.","paperID":"None"},{"content":"Ben Berry. 2007. PCGamerBike Mini. Gaming Nexus. Retrieved August 25, 2015 from http://www.gamingnexus.com/Article/PCGamerBikeMini-/Item1423.aspx","paperID":"None"},{"content":"Bethesda Game Studios. 2011. The Elder Scrolls V: Skyrim [XBox 360, PC, PS3]. Bethesda Softworks, MD, USA.","paperID":"None"},{"content":"Gunnar Borg and Bruce J. Noble. 1974. Perceived Exertion. Exercise and Sport Sciences Reviews 2, 1: 131--154.","paperID":"None"},{"content":"Stephen Boyd Davis, Magnus Moar, Rachel Jacobs, Matt Watkins, Chris Riddoch, and Karl Cooke. 2006. 'Ere Be Dragons: Heartfelt Gaming. Digital Creativity DIGIT CREAT 17, 3: 157--162.","paperID":"None"},{"content":"Matthew Brehmer, T.C. Nicholas Graham, and Tadeusz Stach. 2010. Activate Your GAIM: A Toolkit for Input in Active Games. Proceedings of the International Academic Conference on the Future of Game Design and Technology, ACM, 151--158.","paperID":"None"},{"content":"Anjana Chatta, Tyler Hurst, Gayani Samaraweera, Rongkai Guo, and John Quarles. 2015. Get off the Couch?: An Approach to Utilize Sedentary Commercial Games as Exergames. Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, ACM, 47--56.","paperID":"None"},{"content":"CSEP. 2015. Par-Q Forms.","paperID":"None"},{"content":"Shaul Eizikovich. 2014. vJoy Official Site. Retrieved September 11, 2015 from http://vjoystick.sourceforge.net/site/","paperID":"None"},{"content":"GameSpot. 2012. Best of 2010: Game of the Year. GameSpot. Retrieved August 11, 2015 from https://web.archive.org/web/20130619193120/http:/ww w.gamespot.com/best-of-2010/game-of-theyear/index.html","paperID":"None"},{"content":"Yue Gao and Regan L Mandryk. 2011. GrabApple?: The Design of a Casual Exergame. Entertainment Computing-ICEC, Springer Berlin Heidelberg, 35--46.","paperID":"None"},{"content":"Rongkai Guo and John Quarles. 2013. Converting Sedentary Games To Exergames: A Case Study With a Car Racing Game. 5th International Conference on Games and Virtual Worlds for Serious Applications, VSGAMES 2013, IEEE, 1--8.","paperID":"None"},{"content":"Hamilton a Hernandez, T. C. Nicholas Graham, Darcy Fehlings, et al. 2012. Design of an Exergaming Station for Children With Cerebral Palsy. CHI '12: Proceedings of the 2012 ACM Annual Conference on Human Factors in Computing Systems. ACM, 2619--2628.","paperID":"None"},{"content":"INtense! 2015. The challenge of Adblock. modDB. Retrieved August 11, 2015 from http://www.moddb.com/news/the-challenge-of-adblock","paperID":"None"},{"content":"Mallory Ketcheson, Zi Ye, and T C Nicholas Graham. 2015. Designing for Exertion?: How Heart-Rate Powerups Increase Physical Activity in Exergames. Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. ACM, 2015.","paperID":"None"},{"content":"Shannon Knights, Nicholas Graham, Lauren Switzer, et al. 2014. An Innovative Cycling Exergame to Promote Cardiovascular Fitness in Youth with Cerebral Palsy: A Brief Report. Developmental Neurorehabilitation 1: 1--6.","paperID":"None"},{"content":"Konami. 1998. Dance Dance Revolution [Arcade,Dreamcast,Playstation,Wii,Xbox, XBox 360, PC]. Konami, Nintendo, Disney.","paperID":"None"},{"content":"Regan L. Mandryk, Michael Kalyn, Yichen Dang, Andre Doucette, Brett Taylor, and Shane Dielschneider. 2012. Turning Off-The-Shelf Games Into Biofeedback Games. Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 199--200.","paperID":"None"},{"content":"Rachel S Mark and Ryan E Rhodes. 2013. Testing the Effectiveness of Exercise Videogame Bikes Among Families in the Home-Detting: A Pilot Study. Journal of Physical Activity and Health 10, 2: 211--21.","paperID":"None"},{"content":"Metacritic. 2004. Half-Life 2 PC. metacritic. Retrieved September 2, 2015 from http://www.metacritic.com/game/pc/half-life-2","paperID":"None"},{"content":"Metacritic. 2011. The Elder Scrolls V: Skyrim Xbox 360. metacritic. Retrieved September 2, 2015 from http://www.metacritic.com/game/xbox-360/the-elderscrolls-v-skyrim","paperID":"None"},{"content":"Microsoft. 2014. Kinect. Retrieved from http://www.xbox.com/en-CA/Kinect","paperID":"None"},{"content":"Javier Monedero, Adam C. McDonnell, Melissa Keoghan, and Donal J. O'Gorman. 2014. Modified Active Videogame Play Results in Moderate-Intensity Exercise. Games for Health Journal 3, 4: 234--240.","paperID":"None"},{"content":"Florian Mueller and Katherine Isbister. 2014. Movement-Based Game Guidelines. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2191--2200.","paperID":"None"},{"content":"Paul Navarro, Megan L. Johns, Heather Martin, et al. 2013. Webz of War: A Cooperative Exergame Driven by the Heart. International Games Innovation Conference (IGIC), IEEE, 187--190.","paperID":"None"},{"content":"Canadian Society for Exercise Physiology. Canadian Sedentary Behaviour Guidelines. 1--29. Retrieved September 14, 2015 from http://www.csep.ca/cmfiles/guidelines/csep_guidelines _handbook.pdf","paperID":"None"},{"content":"Selfdeterminationtheory.org. Intrinsic Motivation Inventory. Retrieved September 21, 2015 from http://www.selfdeterminationtheory.org/intrinsicmotivation-inventory/","paperID":"None"},{"content":"Amit Shing. 2014. Target Heart Rate for Weight Loss. Retrieved September 24, 2015 from http://rapidweightlossnow.com/target-heart-rate-forweight-loss-plan/","paperID":"None"},{"content":"Blake Snow. 2011. Why most people don't finish video games. CNN. Retrieved August 11, 2015 from http://www.cnn.com/2011/TECH/gaming.gadgets/08/1 7/finishing.videogames.snow/","paperID":"None"},{"content":"Kevin G Stanley, Farjana Z Eishita, Eva Anderson, and Regan Mandryk. 2014. Gemini Redux?: Understanding Player Perception of Accumulated Context. Games Media Entertainment (GEM), IEEE, 1--8.","paperID":"None"},{"content":"Kevin G Stanley, Ian J Livingston, Alan Bandurka, Mohammad Hashemian, and Regan L Mandryk. 2011. Geminić: A Pervasive Accumulated Context Exergame. International Conference on Entertainment Computing (ICEC). Springer Berlin Heidelberg, 65--76.","paperID":"None"},{"content":"Steam. 2015. Browsing - Moddable. Steam. Retrieved August 11, 2015 from http://store.steampowered.com/search/?tags=1669&pag e=1#sort_by=Released_DESC&sort_order=DESC&tag s=1669&page=1","paperID":"None"},{"content":"Evan A. Suma, Belinda Lange, Skip Rizzo, David Krum, and Mark Bolas. 2013. Flexible Action and Articulated Skeleton Toolkit (FAAST). Retrieved September 23, 2015 from http://projects.ict.usc.edu/mxr/faast/","paperID":"None"},{"content":"Will Tuttle and Ryan Scott. 2011. Game of the Year 2010. GameSpy. Retrieved August 11, 2015 from http://www.gamespy.com/articles/114/1141516p9.html","paperID":"None"},{"content":"Valve Corporation. 2004. Half-Life 2 [PC, Xbox 360, Xbox, PS3]. Vivendi Games, Kirkland, Washington, USA.","paperID":"None"},{"content":"Rodrigo Vicencio-moreira, Regan L Mandryk, and Carl Gutwin. 2014. Balancing Multiplayer First-Person Shooter Games using Aiming Assistance. Games Media Entertainment (GEM), IEEE, 1--8.","paperID":"None"},{"content":"Benjamin Walther-franks, Dirk Wenig, Jan Smeddinck, and Rainer Malaka. 2013. Exercise My Game?: Turning Off-The-Shelf Games into Exergames. Entertainment Computing -- ICEC 2013. Springer Berlin Heidelberg, 126--131.","paperID":"None"},{"content":"Benjamin Walther-franks, Dirk Wenig, Jan Smeddinck, and Rainer Malaka. 2013. Sportal?: A First-Person Videogame Turned Exergame. In Proceedings Mensch und Computer, 539--542.","paperID":"None"},{"content":"Leonard M. Wankel. 1985. Personal and Situational Factors Affecting Exercise Involvement: The Importance of Enjoyment. Research Quarterly for Exercise and Sport 56, 3: 275--282.","paperID":"None"},{"content":"Carlos Garcia Wylie and Paul Coulton. 2009. Mobile Persuasive Exergaming. International IEEE Consumer Electronics Society's Games Innovations Conference, IEEE, 126--130.","paperID":"None"}],"title":"Thighrim and Calf-Life: A Study of the Conversion of Off-the-Shelf Video Games into Exergames","filename":"CHI16/p2681","authors":["Mallory Ketcheson","Luke Walker","T.C. Nicholas Graham"],"conference":"CHI '16"}