{"paperId":2858103,"citation":[],"abstract":"Smart journals are both an emerging class of lifelogging applications and novel digital possessions, which are used to create and curate a personal record of one's life. Through an in-depth interview study of analogue and digital journaling practices, and by drawing on a wide range of research around --technologies of memory?, we address fundamental questions about how people manage and value digital records of the past. Appreciating journaling as deeply idiographic, we map a broad range of user practices and motivations and use this understanding to ground four design considerations: recognizing the motivation to account for one's life; supporting the authoring of a unique perspective and finding a place for passive tracking as a chronicle. Finally, we argue that smart journals signal a maturing orientation to issues of digital archiving.","reference":[{"content":"Ban Al-Ani, Gloria Mark, and Bryan Semaan. 2010. Blogging in a region of conflict: supporting transition to recovery. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1069--1078. http://doi.acm.org/10.1145/1753326.1753485","paperID":"None"},{"content":"Richard Banks. 2011. The Future of Looking Back. O'Reilly Media, Inc.","paperID":"None"},{"content":"Russell Belk. 1988. Possessions and Self. Wiley Online Library.","paperID":"None"},{"content":"Henri Bergson. 1896 (2004). Matter and Memory. Courier Dover Publications.","paperID":"None"},{"content":"Jed R. Brubaker, Lynn S. Dombrowski, Anita M. Gilbert, Nafiri Kusumakaulika, and Gillian R. Hayes. 2014. Stewarding a legacy: responsibilities and relationships in the management of post-mortem data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 4157--4166. http://doi.acm.org/10.1145/2556288.2557059","paperID":"None"},{"content":"Fred B. Bryant, Colette M. Smart, and Scott P. King. 2005. Using the Past to Enhance the Present: Boosting Happiness Through Positive Reminiscence. Journal of Happiness Studies 6, 3: 227--260. http://doi.org/10.1007/s10902-005-3889-4","paperID":"None"},{"content":"Vannevar Bush. 1945. As we may think. The Atlantic Magazine.","paperID":"None"},{"content":"Scott Carter and Jennifer Mankoff. 2005. When participants do the capturing: the role of media in diary studies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 899--908. http://doi.acm.org/10.1145/1054972.1055098","paperID":"None"},{"content":"Richard Chalfen. 1987. Snapshot versions of life. University of Wisconsin Press.","paperID":"None"},{"content":"Gillian Cohen and Martin A. Conway. 2007. Memory in the real world. Psychology Press.","paperID":"None"},{"content":"Felicia Cordeiro, Elizabeth Bales, Erin Cherry, and James Fogarty. 2015. Rethinking the Mobile Food Journal: Exploring Opportunities for Lightweight Photo-Based Capture. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3207--3216. http://doi.acm.org/10.1145/2702123.2702154","paperID":"None"},{"content":"José Van Dijck. 2007. Mediated memories in the digital age. Stanford University Press","paperID":"None"},{"content":"Tao Dong, Mark S. Ackerman, and Mark W. Newman. 2014. \"If these walls could talk\": designing with memories of places. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 63--72. http://doi.acm.org/10.1145/2598510.2598605","paperID":"None"},{"content":"Chris Elsden, David S. Kirk, and Abigail C. Durrant. 2015. A Quantified Past: Toward Design for Remembering with Personal Informatics. HumanComputer Interaction 6: 1--40.","paperID":"None"},{"content":"Nicholas Felton. 2005. Nicholas Felton | Feltron.com. Retrieved September 21, 2015 from http://feltron.com","paperID":"None"},{"content":"Jim Gemmell, Gordon Bell, and Roger Lueder. 2006. MyLifeBits: a personal database for everything. Communications of the ACM 49, 1: 88--95.","paperID":"None"},{"content":"Connie Golsteijn, Elise van den Hoven, David Frohlich, and Abigail Sellen. 2012. Towards a more cherishable digital object. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 655--664. http://doi.acm.org/10.1145/2317956.2318054","paperID":"None"},{"content":"Rebecca Gulotta, William Odom, Haakon Faste, and Jodi Forlizzi. 2014. Legacy in the age of the internet: reflections on how interactive systems shape how we are remembered. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 975--984. http://doi.acm.org/10.1145/2598510.2598579","paperID":"None"},{"content":"Rebecca Gulotta, Alex Sciuto, Aisling Kelliher, and Jodi Forlizzi. 2015. Curatorial Agents: How Systems Shape Our Understanding of Personal and Familial Digital Information. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3453--3462. http://doi.acm.org/10.1145/2702123.2702297","paperID":"None"},{"content":"Cathal Gurrin, Alan F. Smeaton, and Aiden R. Doherty. 2014. Lifelogging: Personal big data. Foundations and Trends in Information Retrieval 8, 1: 1--125.","paperID":"None"},{"content":"R. Harper, D. Randall, N. Smyth, C. Evans, L. Heledd, and R. Moore. 2008. The past is a different place: they do things differently there. In Proceedings of the 7th ACM conference on Designing interactive systems (DIS '08). ACM, NY, NY, USA, 271--280. http://doi.acm.org/10.1145/1394445.1394474","paperID":"None"},{"content":"Steve Hodges, Lyndsay Williams, Emma Berry, et al. 2006. SenseCam: A Retrospective Memory Aid. In UbiComp 2006: Ubiquitous Computing, Paul Dourish and Adrian Friday (eds.). Springer Berlin Heidelberg, 177--193.","paperID":"None"},{"content":"Nancy Van House and Elizabeth F. Churchill. 2008. Technologies of memory: Key issues and critical perspectives. Memory Studies 1, 3: 295--310.","paperID":"None"},{"content":"Elise van den Hoven and Berry Eggen. 2007. Informing augmented memory system design through autobiographical memory theory. Personal and Ubiquitous Computing 12, 6: 433--443. http://doi.org/10.1007/s00779-007-0177--9","paperID":"None"},{"content":"Ellen Isaacs, Artie Konrad, Alan Walendowski, Thomas Lennig, Victoria Hollis, and Steve Whittaker. 2013. Echoes from the past: how technology mediated reflection improves well-being. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1071--1080. http://doi.acm.org/10.1145/2470654.2466137","paperID":"None"},{"content":"Alexandra Johnson. 2011. A Brief History of Diaries: From Pepys to Blogs. Hesperus.","paperID":"None"},{"content":"Marlene Kadar, Linda Warley, Jeanne Perreault, and Susanna Egan. 2006. Tracing the autobiographical. Wilfrid Laurier Univ. Press.","paperID":"None"},{"content":"Vaiva Kalnikaite and Steve Whittaker. 2012. Synergetic recollection: how to design lifelogging tools that help locate the right information. In HumanComputer Interaction: The Agency Perspective. Springer, 329--348.","paperID":"None"},{"content":"David S. Kirk and Abigail Sellen. 2010. On human remains: Values and practice in the home archiving of cherished objects. ACM Transactions on ComputerHuman Interaction (TOCHI) 17, 3: 10.","paperID":"None"},{"content":"David S. Kirk, Abigail Sellen, Carsten Rother, and Ken Wood. 2006. Understanding photowork. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 761--770. http://doi.acm.org/10.1145/1124772.1124885","paperID":"None"},{"content":"Kari Kuutti and Liam J. Bannon. 2014. The turn to practice in HCI: towards a research agenda. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 3543--3552. http://doi.acm.org/10.1145/2556288.2557111","paperID":"None"},{"content":"Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stagebased model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 557--566. http://doi.acm.org/10.1145/1753326.1753409","paperID":"None"},{"content":"Siân E. Lindley, Dave Randall, Wes Sharrock, Maxine Glancy, Nicola Smyth, and Richard Harper. 2009. Narrative, memory and practice: tensions and choices in the use of a digital artefact. In Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology (BCS-HCI '09). British Computer Society, Swinton, UK, UK, 1--9.","paperID":"None"},{"content":"Siân E. Lindley, Catherine C. Marshall, Richard Banks, Abigail Sellen, and Tim Regan. 2013. Rethinking the web as a personal archive. In Proceedings of the 22nd international conference on World Wide Web (WWW '13). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 749--760.","paperID":"None"},{"content":"Thomas Mallon. 1986. A book of one's own: People and their diaries. Penguin (Non-Classics).","paperID":"None"},{"content":"Jean-Sébastien Marcoux. 2001. The \"Casser Maison\" Ritual Constructing the Self by Emptying the Home. Journal of Material Culture 6, 2: 213--235. http://doi.org/10.1177/135918350100600205","paperID":"None"},{"content":"Catherine Marshall, Sara Bly, and Francoise BrunCottan. 2006. The long term fate of our personal digital belongings: Toward a service model for personal archives. Proceedings of IS&T Archiving: 25--30.","paperID":"None"},{"content":"Eric Meyer. 2015. Inadvertent Algorithmic Cruelty. Thoughts From Eric. Retrieved September 21, 2015 from http://meyerweb.com/eric/thoughts/2014/12/24/inadver tent-algorithmic-cruelty/","paperID":"None"},{"content":"David Middleton and Steven D. Brown. 2005. The Social Psychology of Experience: Studies in Remembering and Forgetting. Sage.","paperID":"None"},{"content":"William Odom, Mark Selby, Abigail Sellen, David Kirk, Richard Banks, and Tim Regan. 2012. Photobox: on the design of a slow technology. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 665--668. http://doi.acm.org/10.1145/2317956.2318055","paperID":"None"},{"content":"William Odom, Abi Sellen, Richard Harper, and Eno Thereska. 2012. Lost in translation: understanding the possession of digital things in the cloud. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 781--790. http://doi.acm.org/10.1145/2207676.2207789","paperID":"None"},{"content":"William Odom, Abigail J. Sellen, Richard Banks, David S. Kirk, Tim Regan, Mark Selby, Jodi L. Forlizzi, and John Zimmerman. 2014. Designing for slowness, anticipation and re-visitation: a long term field study of the photobox. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 1961--1970. http://doi.acm.org/10.1145/2556288.2557178","paperID":"None"},{"content":"William Odom, John Zimmerman, and Jodi Forlizzi. 2014. Placelessness, spacelessness, and formlessness: experiential qualities of virtual possessions. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 985--994. http://doi.acm.org/10.1145/2598510.2598577","paperID":"None"},{"content":"William Odom. 2015. Understanding Long-Term Interactions with a Slow Technology: an Investigation of Experiences with FutureMe. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 575--584. http://doi.acm.org/10.1145/2702123.2702221","paperID":"None"},{"content":"S. Tejaswi Peesapati, Victoria Schwanda, Johnathon Schultz, Matt Lepage, So-yae Jeong, and Dan Cosley. 2010. Pensieve: supporting everyday reminiscence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2027--2036. http://doi.acm.org/10.1145/1753326.1753635","paperID":"None"},{"content":"Daniela Petrelli, Elise van den Hoven, and Steve Whittaker. 2009. Making history: intentional capture of future memories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1723--1732. http://doi.acm.org/10.1145/1518701.1518966","paperID":"None"},{"content":"Daniela Petrelli, Steve Whittaker, and Jens Brockmeier. 2008. AutoTopography: what can physical mementos tell us about digital memories?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 53--62. http://doi.acm.org/10.1145/1357054.1357065","paperID":"None"},{"content":"Daniela Petrelli and Steve Whittaker. 2010. Family memories in the home: contrasting physical and digital mementos. Personal and Ubiquitous Computing 14, 2: 153--169.","paperID":"None"},{"content":"Jill Walker Rettberg. 2014. Seeing ourselves through technology: How we use selfies, blogs and wearable devices to see and shape ourselves. Palgrave Macmillan.","paperID":"None"},{"content":"Victoria Schwanda Sosik, Xuan Zhao, and Dan Cosley. 2012. See friendship, sort of: how conversation and digital traces might support reflection on friendships. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 1145--1154. http://doi.acm.org/10.1145/2145204.2145374","paperID":"None"},{"content":"Abigail J. Sellen and Steve Whittaker. 2010. Beyond total capture: a constructive critique of lifelogging. Communications of the ACM 53, 5: 70--77.","paperID":"None"},{"content":"Sarah Sharma. 2014. In the Meantime: Temporality and Cultural Politics. Duke University Press.","paperID":"None"},{"content":"Jonathan A. Smith, Paul Flowers, and Michael Larkin. 2009. Interpretative phenomenological analysis: Theory, method and research. Sage.","paperID":"None"},{"content":"Madeleine Sorapure. 2003. Screening Moments, Scrolling Lives: Diary Writing on the Web. Biography 26, 1: 1--23. http://doi.org/10.1353/bio.2003.0034","paperID":"None"},{"content":"Madeleine Sorapure. 2015. Autobiography Scholarship 2.0: Understanding New Forms of Online Life Writing. Biography 38, 2: 267--272.","paperID":"None"},{"content":"Elizabeth Thiry, Siân Lindley, Richard Banks, and Tim Regan. 2013. Authoring personal histories: exploring the timeline as a framework for meaning making. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1619--1628. http://doi.acm.org/10.1145/2470654.2466215","paperID":"None"},{"content":"F.B. Viegas, D. Boyd, D.H. Nguyen, J. Potter, and J. Donath. 2004. Digital artifacts for remembering and storytelling: posthistory and social network fragments. Proceedings of the 37th Annual Hawaii International Conference on System Sciences, 2004, 10 pp. http://doi.org/10.1109/HICSS.2004.1265287","paperID":"None"},{"content":"Fernanda B. Viégas, Scott Golder, and Judith Donath. 2006. Visualizing email content: portraying relationships from conversational histories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), ACM, NY, NY, USA, 979--988. http://doi.acm.org/10.1145/1124772.1124919","paperID":"None"},{"content":"Rebecca D. Watkins, Abigail Sellen, and Siân E. Lindley. 2015. Digital Collections and Digital Collecting Practices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3423--3432. http://doi.acm.org/10.1145/2702123.2702380","paperID":"None"},{"content":"Xuan Zhao and Siân E. Lindley. 2014. Curation through use: understanding the personal value of social media. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 2431--2440. http://doi.acm.org/10.1145/2556288.2557291","paperID":"None"},{"content":"Xuan Zhao, Niloufar Salehi, Sasha Naranjit, Sara Alwaalan, Stephen Voida, and Dan Cosley. 2013. The many faces of facebook: experiencing social media as performance, exhibition, and personal archive. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1--10. http://doi.acm.org/10.1145/2470654.2470656","paperID":"None"}],"title":"It's Just My History Isn't It?: Understanding Smart Journaling Practices","filename":"CHI16/p2819","authors":["Chris Elsden","Abigail C. Durrant","David S. Kirk"],"conference":"CHI '16"}