{"paperId":2858389,"citation":[],"reference":[{"content":"Ashley A. Anderson, Dominique Brossard, Dietram A. Scheufele, Michael A. Xenos, and Peter Ladwig. 2014. The \"Nasty Effect:\" Online Incivility and Risk Perceptions of Emerging Technologies. Journal of Computer-Mediated Communication 19, 3, 373--387. http://doi.org/10.1111/jcc4.12009","paperID":"None"},{"content":"Saeideh Bakhshi, Partha Kanuparthy, and David A. Shamma. 2015. Understanding Online Reviews: Funny, Cool or Useful? Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1270--1276. http://doi.org/10.1145/2675133.2675275","paperID":"None"},{"content":"Dirk Brand and Brink Van Der Merwe. 2014. Comment classification for an online news domain. Retrieved January 18, 2015 from https://scholar.sun.ac.za/handle/10019.1/96148","paperID":"None"},{"content":"M. Brehmer, S. Ingram, J. Stray, and T. Munzner. 2014. Overview: The Design, Adoption, and Analysis of a Visual Document Mining Tool for Investigative Journalists. IEEE Transactions on Visualization and Computer Graphics 20, 12, 2271--2280. http://doi.org/10.1109/TVCG.2014.2346431","paperID":"None"},{"content":"Dan Brown. 2006. Communicating Design: Developing Web Site Documentation for Design and Planning. New Riders Publishing, Thousand Oaks, CA, USA.","paperID":"None"},{"content":"Kevin Coe, Kate Kenski, and Stephen A. Rains. 2014. Online and Uncivil Patterns and Determinants of Incivility in Newspaper Website Comments. Journal of Communication 64, 4, 658--679. http://doi.org/10.1111/jcom.12104","paperID":"None"},{"content":"Kushal Dave. 2004. Flash Forums and ForumReader: Navigating a New Kind of Large-Scale Online. Discussion, Proceedings of the ACM Conference on Computer Supported Cooperative Work, 232--241.","paperID":"None"},{"content":"Nicholas Diakopoulos. 2015. The Editor's Eye: Curation and Comment Relevance on the NY Times. Proc. Conference on Computer Supported Cooperative Work (CSCW).","paperID":"None"},{"content":"Nicholas Diakopoulos. 2015. Picking the NYT picks: Editorial criteria and automation in the curation of online news comments. The official research journal of international symposium on online journalism (ISOJ) 5, 1.","paperID":"None"},{"content":"Nicholas Diakopoulos, Stephen Cass, and Joshua Romero. 2014. Data-Driven Rankings: The Design and Development of the IEEE Top Programming Language News App. In Proceedings of the Symposium on Computation + Journalism.","paperID":"None"},{"content":"Nicholas Diakopoulos, Munmun De Choudhury, and Mor Naaman. 2012. Finding and Assessing Social Media Information Sources in the Context of Journalism. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2451--2460. http://doi.org/10.1145/2207676.2208409","paperID":"None"},{"content":"Nicholas Diakopoulos and Mor Naaman. 2011. Towards Quality Discourse in Online News Comments. Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work, ACM, 133--142. http://doi.org/10.1145/1958824.1958844","paperID":"None"},{"content":"Bassey Etim. 2014. A Comment's Path to Publication. The NY Times. Retrieved August 8, 2015 from http://www.nytimes.com/times-insider/2014/04/17/acomments-path-to-publication/","paperID":"None"},{"content":"Siamak Faridani, Ephrat Bitton, Kimiko Ryokai, and Ken Goldberg. 2010. Opinion Space: A Scalable Tool for Browsing Online Comments. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1175--1184. http://doi.org/10.1145/1753326.1753502","paperID":"None"},{"content":"Samuel Gratzl, Alexander Lex, Nils Gehlenborg, Hanspeter Pfister, and Marc Streit. 2013. LineUp: Visual Analysis of Multi-Attribute Rankings. IEEE Transactions on Visualization and Computer Graphics 19, 12, 2277--2286. http://doi.org/10.1109/TVCG.2013.173","paperID":"None"},{"content":"Enamul Hoque and Giuseppe Carenini. 2015. ConVisIT: Interactive Topic Modeling for Exploring Asynchronous Online Conversations. Proceedings of the 20th International Conference on Intelligent User Interfaces, ACM, 169--180. http://doi.org/10.1145/2678025.2701370","paperID":"None"},{"content":"Chiao-Fang Hsu, Elham Khabiri, and James Caverlee. 2009. Ranking Comments on the Social Web. Proceedings of the 2009 International Conference on Computational Science and Engineering - Volume 04, IEEE Computer Society, 90--97. http://doi.org/10.1109/CSE.2009.109","paperID":"None"},{"content":"Karin Wahl Jorgensen. 2002. Understanding the Conditions for Public Discourse: four rules for selecting letters to the editor. Journalism Studies 3, 1. http://doi.org/10.1080/14616700120107347","paperID":"None"},{"content":"Cliff A.C. Lampe, Erik Johnston, and Paul Resnick. 2007. Follow the Reader: Filtering Comments on Slashdot. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1253--1262. http://doi.org/10.1145/1240624.1240815","paperID":"None"},{"content":"Cliff Lampe and Paul Resnick. 2004. Slash(Dot) and Burn: Distributed Moderation in a Large Online Conversation Space. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 543--550. http://doi.org/10.1145/985692.985761","paperID":"None"},{"content":"G. Harry Mc Laughlin. 1969. SMOG Grading-a New Readability Formula. Journal of Reading 12, 8, 639--646.","paperID":"None"},{"content":"Annie Louis and Ani Nenkova. What Makes Writing Great? First Experiments on Article Quality Prediction in the Science Journalism Domain.","paperID":"None"},{"content":"Kathleen McElroy. 2013. Where Old (Gatekeepers) Meets New (Media). Journalism Practice 7, 6, 755--771. http://doi.org/10.1080/17512786.2013.774117","paperID":"None"},{"content":"Kevin K. Nam and Mark S. Ackerman. 2007. Arkose: Reusing Informal Information from Online Discussions. Proceedings of the 2007 International ACM Conference on Supporting Group Work, ACM, 137--146. http://doi.org/10.1145/1316624.1316644","paperID":"None"},{"content":"Emily Pitler and Ani Nenkova. 2008. Revisiting Readability: A Unified Framework for Predicting Text Quality. Proceedings of the Conference on Empirical Methods in Natural Language Processing, Association for Computational Linguistics, 186--195.","paperID":"None"},{"content":"Vladimir V. Putin. 2013. What Putin Has to Say to Americans About Syria. The NY Times. Retrieved August 8, 2015 from http://www.nytimes.com/2013/09/12/opinion/putin-pleafor-caution-from-russia-on-syria.html","paperID":"None"},{"content":"Bill Reader. 2007. Air Mail: NPR Sees \"Community\" in Letters From Listeners. Journal of Broadcasting & Electronic Media 51, 4, 651--669. http://doi.org/10.1080/08838150701626529","paperID":"None"},{"content":"Raz Schwartz, Mor Naaman, and Rannie Teodoro. 2015. Editorial Algorithms: Using Social Media to Discover and Report Local News. Ninth International AAAI Conference on Web and Social Media.","paperID":"None"},{"content":"M. Sedlmair, M. Meyer, and T. Munzner. 2012. Design Study Methodology: Reflections from the Trenches and the Stacks. IEEE Transactions on Visualization and Computer Graphics 18, 12, 2431--2440. http://doi.org/10.1109/TVCG.2012.213","paperID":"None"},{"content":"Jane B. Singer. 2010. Quality Control. Journalism Practice 4, 2, 127--142. http://doi.org/10.1080/17512780903391979","paperID":"None"},{"content":"Sara Owsley Sood, Elizabeth F. Churchill, and Judd Antin. 2012. Automatic identification of personal insults on social news sites. Journal of the American Society for Information Science and Technology 63, 2, 270--285. http://doi.org/10.1002/asi.21690","paperID":"None"},{"content":"Natalie Jomini Stroud, Joshua M. Scacco, Ashley Muddiman, and Alexander L. Curry. 2015. Changing Deliberative Norms on News Organizations? Facebook Sites. Journal of Computer-Mediated Communication 20, 2, 188--203. http://doi.org/10.1111/jcc4.12104","paperID":"None"},{"content":"Abhay Sukumaran, Stephanie Vezich, Melanie McHugh, and Clifford Nass. 2011. Normative Influences on Thoughtful Online Participation. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3401--3410. http://doi.org/10.1145/1978942.1979450","paperID":"None"},{"content":"Nayer Wanas, Motaz El-Saban, Heba Ashour, and Waleed Ammar. 2008. Automatic Scoring of Online Discussion Posts. Proceedings of the 2Nd ACM Workshop on Information Credibility on the Web, ACM, 19--26. http://doi.org/10.1145/1458527.1458534","paperID":"None"},{"content":"Kevin Wise, Brian Hamman, and Kjerstin Thorson. 2006. Moderation, Response Rate, and Message Interactivity: Features of Online Communities and Their Effects on Intent to Participate. Journal of ComputerMediated Communication 12, 1, 24--41. http://doi.org/10.1111/j.1083--6101.2006.00313.x","paperID":"None"}],"abstract":"Online comments submitted by readers of news articles can provide valuable feedback and critique, personal views and perspectives, and opportunities for discussion. The varying quality of these comments necessitates that publishers remove the low quality ones, but there is also a growing awareness that by identifying and highlighting high quality contributions this can promote the general quality of the community. In this paper we take a user-centered design approach towards developing a system, CommentIQ, which supports comment moderators in interactively identifying high quality comments using a combination of comment analytic scores as well as visualizations and flexible UI components. We evaluated this system with professional comment moderators working at local and national news outlets and provide insights into the utility and appropriateness of features for journalistic tasks, as well as how the system may enable or transform journalistic practices around online comments.","title":"Supporting Comment Moderators in Identifying High Quality Online News Comments","filename":"CHI16/p1114","authors":["Deokgun Park","Simranjit Sachar","Nicholas Diakopoulos","Niklas Elmqvist"],"conference":"CHI '16"}