{"paperId":2858147,"citation":[],"reference":[{"content":"Christian Ulrik Andersen, Lars Bo Løfgreen and Søren Bro Pold. 2015. A Design for Things - Planetary Pledge Pyramid.","paperID":"None"},{"content":"Sophie Esmann Andersen and Anne Ellerup Nielsen. 2011. Climate-conscious citizenship in a digital public setting. MedieKultur 50 119--142.","paperID":"None"},{"content":"Hugh Beyer and Karen Holtzblatt. 1999. Contextual design. interactions 6, 1 (January 1999), 32--42. http://doi.acm.org/10.1145/291224.291229","paperID":"None"},{"content":"Alfred Borgman. 1995. The Depth of Design. The University of Chicago Press, Chicago.","paperID":"None"},{"content":"Harry Brignull and Yvonne Rogers. 2003. Enticing People to Interact with Large Public Displays in Public Spaces. INTERACT'03 Proceedings: IFIP TC13 International Conference on Human-Computer Interaction, Zurich, 1--5. September 2003, 17--24.","paperID":"None"},{"content":"Martin Brynskov, Peter Dalsgaard, Tobias Ebsen, Jonas Fritsch, Kim Halskov, and Rune Nielsen. 2009. Staging Public Interactions with Media Façades. In Proceedings of the 12th IFIP TC 13 International Conference on Human-Computer Interaction: Part I (INTERACT '09), Tom Gross, Jan Gulliksen, Paula Kotzé, Lars Oestreicher, Philippe Palanque, Raquel Oliveira Prates, and Marco Winckler (Eds.). SpringerVerlag, Berlin, Heidelberg, 154--167. http://dx.doi.org/10.1007/978--3--642-03655--2_20","paperID":"None"},{"content":"Martin Brynskov, Peter Dalsgaard and Kim Halskov. 2015. Media Architecture: Engaging Public Experiences in Public Space In The Uses of Art in Public Space (eds. Julia Lossau and Quentin Stevens). NY: Routledge, 51--66.","paperID":"None"},{"content":"Susanne Bødker.1996. Creating conditions for participation: Conflicts and resources in systems design. Human Computer Interaction 11, 3: 215-236.","paperID":"None"},{"content":"Luigina Ciolfi. 2004. Understanding spaces as places: extending interaction design paradigms. Cognition, Technology & Work 6, 1: 37--40.","paperID":"None"},{"content":"Luigina Ciolfi, Mikael Fernström, Liam J. Bannon, Parag Deshpande, Paul Gallagher, Colm McGettrick, Nicola Quinn and Stephen Shirley.2007. \"The Shannon Portal Installation: Interaction Design for Public Places\", Computer, vol.40, no. 7, pp. 64--71. doi:10.1109/MC.2007.255","paperID":"None"},{"content":"Luigina Ciolfi. 2012. \"Social Traces, Participation and the Creation of Shared Heritage\" in Giaccardi (ed.) Heritage and Social Media, London and NY: Routledge, p.69--86.","paperID":"None"},{"content":"Terry Costantino. 2014. Issues of Participation: A Framework for Choices and Compromises. Int. J. Sociotechnology Knowl. Dev. 6, 4 (October 2014), 4161. http://dx.doi.org/10.4018/ijskd.2014100104","paperID":"None"},{"content":"Peter Dalsgaard and Lone Koefoed Hansen. 2008. Performing perception staging aesthetics of interaction. ACM Trans. Comput.-Hum. Interact 15, 3. http://doi.acm.org/10.1145/1453152.1453156","paperID":"None"},{"content":"Peter Dalsgaard and Kim Halskov. 2010. Designing public media façades: cases and challenges. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2277--2286. http://doi.acm.org/10.1145/1753326.1753670.","paperID":"None"},{"content":"Peter Dalsgaard, Christian Dindler, and Kim Halskov. 2011. Understanding the dynamics of engaging interaction in public spaces. In Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction - Volume Part II (INTERACT'11), Pedro Campos, Nuno Nunes, Nicholas Graham, Joaquim Jorge, and Philippe Palanque (Eds.), Vol. Part II. Springer-Verlag, Berlin, Heidelberg, 212--229.","paperID":"None"},{"content":"Christian Dindler and Ole Sejer Iversen.2009. Motivation in the museum - Mediating between everyday engagement and cultural heritage. Proceedings of Nordes 2009. The Oslo School of Architecture and Design, Norway.","paperID":"None"},{"content":"Pelle Ehn and Morten Kyng.1987. The Collective Resource Approach to Systems Design. Computers and Democracy - A Scandinavian Challenge. Aldershot, UK: Avebury. p.17-58.","paperID":"None"},{"content":"Matthias Finke, Anthony Tang, Rock Leung, and Michael Blackstock. 2008. Lessons learned: game design for large public displays. In Proceedings of the 3rd international conference on Digital Interactive Media in Entertainment and Arts (DIMEA '08). ACM, NY, NY, USA, 26--33. DOI=10.1145/1413634.1413644","paperID":"None"},{"content":"Jodi Forlizzi and Katja Battarbee. 2004. Understanding experience in interactive systems. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '04). ACM, NY, NY, USA, 261268. http://doi.acm.org/10.1145/1013115.1013152","paperID":"None"},{"content":"Christopher Frauenberger, Judith Good, Geraldine Fitzpatrick and Ole Sejer Iversen.2015. In pursuit of rigour and accountability in participatory design, International Journal of Human-Computer Studies, Volume 74, February 2015, p. 93-106. doi:10.1016/j.ijhcs.2014.09.004","paperID":"None"},{"content":"Elisa Giaccardi and Leysia Palen.2008. The Social Production of Heritage Through Cross-Media Interaction: Making Place for Place Making, International Journal of Heritage Studies, 14(3) 281297.","paperID":"None"},{"content":"Erving Goffman. 1972. Relations in Public. Harmondsworth: Penguin.","paperID":"None"},{"content":"Erving Goffman. 1973. The Presentation of Self In Everyday Life. The Overlook Press, Woodstock, NY.","paperID":"None"},{"content":"Kim Halskov and Nicolai B. Hansen. 2015. The Diversity of Participatory Design Research Practice at PDC 2002--2012. International Journal of Human-Computer Studies 74: 81--92. http://dx.doi.org/10.1016/j.ijhcs.2014.09.003.","paperID":"None"},{"content":"Ole Sejer Iversen, Anne Marie Kanstrup, and Marianne Graves Petersen. 2004. A visit to the 'new Utopia': revitalizing democracy, emancipation and quality in co-operative design. In Proceedings of the third Nordic conference on Human-computer interaction (NordiCHI '04). ACM, NY, NY, USA, 171--179. http://doi.acm.org/10.1145/1028014.1028040.","paperID":"None"},{"content":"Ole Sejer Iversen and Rachel Smith. 2012. Connecting Audiences and the Museum through Social Media.: Experiences from the Digital Natives Experiment. In Giaccrdi (ed.) Heritage and Social Media. London and NY: Routledge.","paperID":"None"},{"content":"Jeff Johnson. 2013. Designing with the Mind in Mind: Simple Guide to Understanding User Interface Design Guidelines. Elsevier.","paperID":"None"},{"content":"Peter Krogh, Martin Ludvigsen and Andreas LykkeOlesen. 2004. Help me pull that cursor - A Collaborative Interactive Floor Enhancing Community Interaction. In proceedings of OZCHI 2004, 22--24 November, 2004 at the University of Wollongong, Australia. CD-ROM. ISBN:1 74128 079.","paperID":"None"},{"content":"Wolfgang Köhler. 1947. Gestalt Psychology. Liveright.","paperID":"None"},{"content":"Eva Lenz, Sarah Diefenbach, and Marc Hassenzahl. 2014. Aesthetics of interaction: a literature synthesis. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, NY, NY, USA, 628--637. http://doi.acm.org/10.1145/2639189.2639198","paperID":"None"},{"content":"Youn-kyung Lim, Erik Stolterman, Heekyoung Jung, and Justin Donaldson. 2007. Interaction gestalt and the design of aesthetic interactions. In Proceedings of the 2007 conference on Designing pleasurable products and interfaces (DPPI '07). ACM, NY, NY, USA, 239--254. http://doi.acm.org/10.1145/1314161.1314183.","paperID":"None"},{"content":"Tuck W. Leong and Martin Brynskov. 2009. CO2nfession: engaging with values through public conversations. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7 (OZCHI '09). ACM, NY, NY, USA, 209216. http://doi.acm.org/10.1145/1738826.1738860","paperID":"None"},{"content":"Martin Ludvigsen. 2006, Designing for social interaction: physical, co-located social computing. Center for Interactive Spaces, Aarhus.","paperID":"None"},{"content":"John McCarthy and Peter Wright. 2004. Technology as experience. interactions 11, 5: 42--43. http://doi.acm.org/10.1145/1015530.1015549","paperID":"None"},{"content":"Malcolm McCullough. 2005. Digital ground: architecture, pervasive computing, and environmental knowing. The MIT Press.","paperID":"None"},{"content":"Jörg Müller, Florian Alt, Daniel Michelis, and Albrecht Schmidt. 2010. Requirements and design space for interactive public displays. In Proceedings of the international conference on Multimedia (MM '10). ACM, NY, NY, USA, 1285--1294. DOI=10.1145/1873951.1874203","paperID":"None"},{"content":"Rune Nielsen, Jonas Fritsch, Kim Halskov, and Martin Brynskov. 2009. Out of the box: exploring the richness of children's use of an interactive table. In Proceedings of the 8th International Conference on Interaction Design and Children (IDC '09). ACM, NY, NY, USA, 61--69. http://doi.acm.org/10.1145/1551788.1551800","paperID":"None"},{"content":"Kees Overbeeke, Tom Djajadiningrat, Caroline Hummels, and Stephan Wensveen (2002) Beauty in usability: forget about ease of use! In: Green WS, Jordan PW (eds) Pleasure with products: Beyond usability. Taylor & Francis, London, pp 9-18","paperID":"None"},{"content":"Søren Bro Pold and Christian Ulrik Andersen. 2015. How to Experience and Relate to Climate Change: The Role of Digital Climate Art. In Camilla Skovbjerg Paldam, Jacob Wamberg (eds): Art, Technology and Nature: Renaissance to Postmodernity. Ashgate 163172 .","paperID":"None"},{"content":"Stuart Reeves, Steve Benford, Claire O'Malley, and Mike Fraser. 2005. Designing the spectator experience. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI '05). ACM, NY, NY, USA, 741--750. http://doi.acm.org/10.1145/1054972.1055074","paperID":"None"},{"content":"Yvonne Rogers.2006. Moving on from weiser's vision of calm computing: Engaging ubiComp experiences. In: Dourish, P., Friday, A. (eds.) UbiComp 2006. LNCS, vol. 4206, pp. 404-421. Springer, Heidelberg.","paperID":"None"},{"content":"Philip Ross and David Keyson. 2007. The case of sculpting atmospheres: towards design principles for expressive tangible interaction in control of ambient systems. Personal Ubiquitous Comput. 11, 2 (January 2007), 69--79. http://dx.doi.org/10.1007/s00779-0050062--3.","paperID":"None"},{"content":"Nina Simon.2010. The participatory museum. Museum2.0. Santa Cruz, CA. USA.","paperID":"None"},{"content":"Jesper Simonsen and Toni Robertson. 2012. Routledge International Handbook of Participatory Design. Routledge.","paperID":"None"},{"content":"Rachel Charlotte Smith and Ole Sejer Iversen.2014. Participatory heritage innovation: designing dialogic sites of engagement, Digital Creativity, Volume 25, Issue 3, p. 255--268, DOI: 10.1080/14626268.2014.904796","paperID":"None"},{"content":"Lars Erik Udsen and Anker Helms Jørgensen. 2005. The aesthetic turn: unravelling recent aesthetic approaches to human-computer interaction. Digital Creativity 16, 04, 205--216, http://dx.doi.org/10.1080/14626260500476564","paperID":"None"},{"content":"John Vines, Rachel Clarke, Peter Wright, Ole Sejer Iversen, Tuck Leong, John McCarthy, and Patrick Olivier. 2012. Summary Report on CHI 2012 invited SIG: Participation and HCI: Why Involve People in Design?","paperID":"None"},{"content":"John Vines, Rachel Clarke, Peter Wright, John McCarthy, and Patrick Olivier. 2013. Configuring participation: on how we involve people in design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 429--438. http://doi.acm.org/10.1145/2470654.2470716","paperID":"None"}],"abstract":"We introduce the participation gestalt framework for analysing participation in public interactive installations. Building on the concept of interaction gestalt, we define the participation gestalt as the unified perception and experience of participatory qualities as they unfold through interaction with the installation in a socio-cultural setting. The framework consists of five continua, mapping out the qualities of participation in relation to the degree of expressivity, exposure, investment, sociality and persistence that people experience when engaging in the interaction. Individually, the five qualities provide a vocabulary for analyzing an interactive installation. Combined, the five qualities constitute a participation gestalt framework by which HCI researchers can qualify how a certain forms of participation emerge around public installations. We exemplify the framework by analyzing four public installations in different socio-cultural contexts and examining their participation gestalt.","title":"Participation Gestalt: Analysing Participatory Qualities of Interaction in Public Space","filename":"CHI16/p4435","authors":["Peter Dalsgaard","Kim Halskov","Ole Sejer Iversen"],"conference":"CHI '16"}