{"paperId":2858212,"citation":[],"reference":[{"content":"Randall William Adams. 1971. Peripheral vision and visual attention. Retrospective Theses and Dissertations. Paper 4933.","paperID":"None"},{"content":"Jin-uk Baek, Jaehoon Jung, and Gerard J. Kim. 2005. Head mounted display with peripheral vision. In Proceedings of the 2005 international conference on Augmented tele-existence (ICAT '05). ACM, NY, NY, USA, 282--282. http://doi.acm.org/10.1145/1152399.1152472","paperID":"None"},{"content":"Patrick Baudisch, Nathaniel Good, and Paul Stewart. 2001. Focus plus context screens: combining display technology with visualization techniques. In Proceedings of the 14th annual ACM symposium on User interface software and technology (UIST '01). ACM, NY, NY, USA, 31--40. http://doi.acm.org/10.1145/502348.502354","paperID":"None"},{"content":"Hrvoje Benko, Eyal Ofek, Feng Zheng, and Andrew D. Wilson. 2015. FoveAR: Combining an Optically SeeThrough Near-Eye Display with Projector-Based Spatial Augmented Reality. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 129--135. http://dx.doi.org/10.1145/2807442.2807493","paperID":"None"},{"content":"A. Berthoz, B. Pavard, and L.R. Young. 1975. Perception of linear horizontal self-motion induced by peripheral vision (linearvection) basic characteristics and visual-vestibular interactions. Experimental Brain Research, 23(5): 471--89.","paperID":"None"},{"content":"Th. Brandt, J. Dichgans, and E. Koenig. 1973. Differential effects of central versus peripheral vision on egocentric and exocentric motion perception. Experimental Brain Research, 16(5): 476--491.","paperID":"None"},{"content":"Dewen Cheng, Yongtian Wang, Hong Hua, and Jose Sasian. 2011. Design of a wide-angle, lightweight head-mounted display using free-form optics tiling. Optics Letters, 36(11):2098--2100.","paperID":"None"},{"content":"Henry Been-Lirn Duh, James J. W. Lin, Robert V. Kenyon, Donald E. Parker, and Thomas A. Furness. 2002. Effects of Characteristics of Image Quality in an Immersive Environment. Presence: Teleoperators and Virtual Environments, 11(3): 324--332","paperID":"None"},{"content":"InfinitEye. StarVR Tech Specs. http://www.starvr.com/#techspecs. Retrieved September 23, 2015.","paperID":"None"},{"content":"Brett R. Jones, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2013. IllumiRoom: peripheral projected illusions for interactive experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 869--878. http://doi.acm.org/10.1145/2470654.2466112","paperID":"None"},{"content":"J. Adam Jones, J. Edward Swan II, Mark Bolas. 2013. Peripheral Stimulation and its Effect on Perceived Spatial Scale in Virtual Environments. IEEE Transactions on Visualization & Computer Graphics, 19(4): 701--710. http://doi.ieeecomputersociety.org/10.1109/TVCG.201 3.37","paperID":"None"},{"content":"Robert S. Kennedy, Norman E. Lane, Kevin S. Berbaum, and Michael G. Lilienthal. 1993. Simulator Sickness Questionnaire: An enhanced method for quantifying simulator sickness. International Journal of Aviation Psychology, 3(3): 203--220. DOI: 10.1207/s15327108ijap0303_3","paperID":"None"},{"content":"Joshua M. Knapp and Jack M. Loomis. 2004. Limited field of view of head-mounted displays is not the cause of distance underestimation in virtual environments. Presence: Teleoper. Virtual Environ. 13, 5 (October 2004), 572--577. DOI: http://dx.doi.org/10.1162/1054746042545238","paperID":"None"},{"content":"Eugenia M. Kolasinski. 1995. Simulator sickness in virtual environments. Technical Report 1027 (ARTITR-1027). Alexandria, VA: Army Research Institute for the Behavioral and Social Sciences.","paperID":"None"},{"content":"Frank L. Kooi and Marcel Mosch. 2006. Peripheral Motion Displays: Tapping the Potential of the Visual Periphery. Proceedings of the Human Factors and Ergonomics Society Annual Meeting, 50(16): 16041608. DOI: 10.1177/154193120605001619","paperID":"None"},{"content":"James Jeng-Weei Lin, Henry B.L. Duh, Donald E. Parker, Habib Abi-Rached, and Thomas A. Furness. Effects of field of view on presence, enjoyment, memory, and simulator sickness in a virtual environment. In Proceedings of IEEE Virtual Reality 2002 (IEEE VR '02), 164--171. http://dx.doi.org/10.1109/VR.2002.996519","paperID":"None"},{"content":"Lumus, Ltd. Lumus OE-32. http://www.lumusoptical.com/index.php?option=com_content&task=vie w&id=9&Itemid=15. Retrieved September 23, 2015.","paperID":"None"},{"content":"Andrew Maimone and Henry Fuchs. Computational Augmented Reality Eyeglasses. In Proceedings of the 2013 IEEE International Symposium on Mixed and Augmented Reality (ISMAR '13), 29--38. http://dx.doi.org/10.1109/ISMAR.2013.6671761","paperID":"None"},{"content":"Andrew Maimone, Douglas Lanman, Kishore Rathinavel, Kurtis Keller, David Luebke, and Henry Fuchs. 2014. Pinlight displays: wide field of view augmented reality eyeglasses using defocused point light sources. ACM Trans. Graph. 33, 4, Article 89 (July 2014), 11 pages. http://doi.acm.org/10.1145/2601097.2601141","paperID":"None"},{"content":"Suzanne P. McKee and Ken Nakayama. 1984. The detection of motion in the peripheral visual field. Vision Research, 24(1): 24--32. http://dx.doi.org/10.1016/0042-6989(84)90140--8","paperID":"None"},{"content":"Hajime Nagahara, Yasushi Yagi, and Masahiko Yachida. 2003. Super wide viewer using catadioptrical optics. In Proceedings of the ACM symposium on Virtual reality software and technology (VRST '03). ACM, NY, NY, USA, 169--175. DOI=10.1145/1008653.1008683 http://doi.acm.org/10.1145/1008653.1008683","paperID":"None"},{"content":"Takuya Nojima, Yoshihiko Saiga, Yu Okano, Yuki Hashimoto, and Hiroyuki Kajimoto. The Peripheral Display for Augmented Reality of Self-motion. In Proceedings of the 17th International Conference on Artificial Reality and Telexistence 2007 308--309. http://dx.doi.org/10.1109/ICAT.2007.44","paperID":"None"},{"content":"Oculus VR. Best Practices Guide. Published December 5, 2014. Retrieved September 23, 2015. https://developer.oculus.com/documentation/introvr/latest/concepts/book-bp/","paperID":"None"},{"content":"Jason Orlosky, Qifan Wu, Kiyoshi Kiyokawa, Haruo Takemura, and Christian Nitschke. 2014. Fisheye vision: peripheral spatial compression for improved field of view in head mounted displays. In Proceedings of the 2nd ACM symposium on Spatial user interaction (SUI '14). ACM, NY, NY, USA, 54--61. http://doi.acm.org/10.1145/2659766.2659771","paperID":"None"},{"content":"Małgorzata Perz. 2010. Flicker perception in the periphery. MSc. Thesis, Technische Universiteit Eindhoven.","paperID":"None"},{"content":"Phillips Television. Ambilight. http://ambilight.philips.com. Retrieved September 23, 2015.","paperID":"None"},{"content":"D. Purves, G.J. Augustine, D. Fitzpatrick, et al., editors. Neuroscience. 2nd edition. Sunderland (MA): Sinauer Associates; 2001. Chapter 11: Anatomical Distribution of Rods and Cones.","paperID":"None"},{"content":"Benjamin Watson, Neff Walker, Larry F. Hodges, and Aileen Worden. 1997. Managing level of detail through peripheral degradation: effects on search performance with a head-mounted display. ACM Trans. Comput.Hum. Interact. 4, 4 (December 1997), 323--346. http://doi.acm.org/10.1145/267135.267137","paperID":"None"},{"content":"Wearality Corporation. Wearality Sky. http://www.wearality.com/wearalitysky/. Retrieved September 23, 2015.","paperID":"None"},{"content":"Ungyeon Yang and Gerard Jounghyun Kim. 2010. Increasing the geometric field of view in head mounted displays through proprioceptive task and multimodal feedback for effective close range interaction. Behav. Inf. Technol. 29, 2 (March 2010), 175--186. http://dx.doi.org/10.1080/01449290903160459","paperID":"None"}],"abstract":"In this paper, we explore the concept of a sparse peripheral display, which augments the field-of-view of a head-mounted display with a lightweight, low-resolution, inexpensively produced array of LEDs surrounding the central high-resolution display. We show that sparse peripheral displays expand the available field-of-view up to 190º horizontal, nearly filling the human field-of-view. We prototyped two proof-of-concept implementations of sparse peripheral displays: a virtual reality headset, dubbed SparseLightVR, and an augmented reality headset, called SparseLightAR. Using SparseLightVR, we conducted a user study to evaluate the utility of our implementation, and a second user study to assess different visualization schemes in the periphery and their effect on simulator sickness. Our findings show that sparse peripheral displays are useful in conveying peripheral information and improving situational awareness, are generally preferred, and can help reduce motion sickness in nausea-susceptible people.","title":"Augmenting the Field-of-View of Head-Mounted Displays with Sparse Peripheral Displays","filename":"CHI16/p1221","authors":["Robert Xiao","Hrvoje Benko"],"conference":"CHI '16"}