{"paperId":2858203,"citation":[],"abstract":"A growing body of research has examined whether and how an individual can leverage online social networks to receive social support for health behavior change. This prior research largely focuses on attributes of the post content and the experiences and concerns of people posting. Less is known about moderators and mediators that influence whether and how one's social network will respond to a request for support. Using a factorial survey experiment, we find evidence that attitudes toward specific types of health behaviors greatly increase likelihood of response to a post, and that targeting close-tie relationships may increase effectiveness of social media based behavior change interventions, particularly related to smoking cessation.","reference":[{"content":"Katrin Auspurg and Thomas Hinz. 2014. Factorial Survey Experiments. SAGE Publications.","paperID":"None"},{"content":"Ursula E Bauer, Peter A Briss, Richard A Goodman, and Barbara A Bowman. 2014. Prevention of chronic disease in the 21st century: elimination of the leading preventable causes of premature death and disability in the USA. The Lancet 384, 9937: 45--52.","paperID":"None"},{"content":"Moira Burke and Robert E. Kraut. 2014. Growing Closer on Facebook: Changes in Tie Strength Through Social Network Site Use. Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 4187--4196.","paperID":"None"},{"content":"Maeve Duggan, Nicole B. Ellison, Cliff Lampe, Am, a Lenhart, and Mary Madden. 2014. Social Media Update 2014. Pew Research Center: Internet, Science & Tech. Retrieved July 29, 2015 from http://www.pewinternet.org/2015/01/09/social-mediaupdate-2014/","paperID":"None"},{"content":"Daniel A Epstein, Bradley H Jacobson, Elizabeth Bales, David W McDonald, and Sean A Munson. 2015. From nobody cares to way to go!: A Design Framework for Social Sharing in Personal Informatics. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1622--1636.","paperID":"None"},{"content":"Gunther Eysenbach. 2005. The law of attrition. Journal of Medical Internet Research 7, 1.","paperID":"None"},{"content":"Martin Fishbein and Icek Ajzen. 2011. Predicting and changing behavior: The reasoned action approach. Taylor & Francis.","paperID":"None"},{"content":"Gunelius, Susan. 2014. The Data Explosion in 2014 Minute by Minute - Infographic. ACI. Retrieved July 29, 2015 from http://aci.info/2014/07/12/the-dataexplosion-in-2014-minute-by-minute-infographic/","paperID":"None"},{"content":"Catherine A Heaney and Barbara A Israel. 2008. Social networks and social support. Health behavior and health education: Theory, research, and practice 4: 189--210.","paperID":"None"},{"content":"Liangjie Hong and Brian D Davison. 2010. Empirical study of topic modeling in twitter. Proceedings of the First Workshop on Social Media Analytics, ACM, 80-- 88.","paperID":"None"},{"content":"C.J. Hutto, Sarita Yardi, and Eric Gilbert. 2013. A Longitudinal Study of Follow Predictors on Twitter. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 821--830.","paperID":"None"},{"content":"Carol A. Maher, Lucy K. Lewis, Katia Ferrar, Simon Marshall, Ilse De Bourdeaudhuij, and Corneel Vandelanotte. 2014. Are health behavior change interventions that use online social networks effective? A systematic review. Journal of Medical Internet Research 16, 2.","paperID":"None"},{"content":"Mark W. Newman, Debra Lauterbach, Sean A. Munson, Paul Resnick, and Margaret E. Morris. 2011. It's not that i don't have problems, i'm just not putting them on facebook: challenges and opportunities in using online social networks for health. Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work, ACM, 341--350.","paperID":"None"},{"content":"Judith A Ouellette and Wendy Wood. 1998. Habit and intention in everyday life: the multiple processes by which past behavior predicts future behavior. Psychological Bulletin 124, 1: 54.","paperID":"None"},{"content":"Jeni Paay, Jesper Kjeldskov, Mikael B Skov, Lars Lichon, and Stephan Rasmussen. 2015. Understanding Individual Differences for Tailored Smoking Cessation Apps. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems ACM, 1699- 1708.","paperID":"None"},{"content":"Emilee Rader, Alcides Velasquez, Kayla D. Hales, and Helen Kwok. 2012. The Gap Between Producer Intentions and Consumer Behavior in Social Media. Proceedings of the 17th ACM International Conference on Supporting Group Work, ACM, 249-252.","paperID":"None"}],"title":"It Matters If My Friends Stop Smoking: Social Support for Behavior Change in Social Media","filename":"CHI16/p5548","authors":["Corbin Reno","Erika S. Poole"],"conference":"CHI '16"}