{"paperId":2858371,"citation":[],"reference":[{"content":"Louai Alarabi, Ahmed Eldawy, Rami Alghamdi, and Mohamed F. Mokbel. 2014. TAREEG: a MapReducebased system for extracting spatial data from OpenStreetMap. In Proceedings of the SIGSPATIAL Conference on Advances in Geographic Information Systems (SIGSPATIAL '14), 83--92. DOI=10.1145/2666310.2666403","paperID":"None"},{"content":"Jennings Anderson, Robert Soden, Kenneth M. Anderson, Marina Kogan, and Leysia Palen. 2015. EPIC-OSM: A Software Framework for OpenStreetMap Data Analytics. To Appear in Proceedings of the Hawaii international conference on system sciences (HICSS-49).","paperID":"None"},{"content":"Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3: Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12: 23012309. http://dx.doi.org/10.1109/TVCG.2011.185","paperID":"None"},{"content":"Susan L. Bryant, Andrea Forte, and Amy Bruckman. 2005. Becoming Wikipedian: transformation of participation in a collaborative online encyclopedia. In Proceedings of the ACM SIGGROUP conference on Supporting group work (GROUP '05), 1--10. http://doi.acm.org/10.1145/1099203.1099205","paperID":"None"},{"content":"Nama R. Budhathoki and Caroline Haythornthwaite. 2012. Motivation for Open Collaboration: Crowd and Community Models and the Case of OpenStreetMap. In American Behavioral Scientist, 57, 5: 548--575. DOI=10.1177/0002764212469364.","paperID":"None"},{"content":"Aaron Clauset and Nathan Eagle. 2012. Persistence and periodicity in a dynamic proximity network. arXiv:1211.7343.","paperID":"None"},{"content":"Padraig Corcoran, Peter Mooney, and Michela Bertolotto. 2013. Analysing the growth of OpenStreetMap networks. In Spatial Statistics 3: 21--32. DOI=10.1016/j.spasta.2013.01.002","paperID":"None"},{"content":"Martin Dittus, Giovanni Quattrone, and Licia Capra. Analysing volunteer engagement in humanitarian mapping: building contributor communities at large scale. To Appear In Proceedings of the ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW '16).","paperID":"None"},{"content":"Paul Dourish and Victoria Bellotti. 1992. Awareness and coordination in shared workspaces. In Proceedings of the ACM conference on Computer-supported cooperative work (CSCW '92), 107--114. http://doi.acm.org/10.1145/143457.143468","paperID":"None"},{"content":"Russell Rowe Dynes. 1970. Organized Behavior in Disaster. Heath Lexington Books.","paperID":"None"},{"content":"Sarah Elwood. 2008. Volunteered Geographic Information: Future Research Directions Motivated by Critical, Participatory, and Feminist GIS. GeoJournal 72, 3&4: 173--183. DOI=10.1007/s10708-008--9186-0","paperID":"None"},{"content":"Thore Fechner, Dennis Wilhelm, and Christian Kray. 2015. Ethermap: Real-time Collaborative Map Editing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 3583--3592. http://doi.acm.org/10.1145/2702123.2702536","paperID":"None"},{"content":"Charles E. Fritz and J. H. Mathewson. 1957. Convergence Behavior in Disasters: A Problem in Social Control. Committee on Disaster Studies, Disaster Study No. 9. Washington, DC, National Academy of Sciences, National Research Council.","paperID":"None"},{"content":"Michael F. Goodchild. 2007. Citizens as sensors: the world of volunteered geography. GeoJournal 69, 4: 211--221. DOI=10.1007/s10708-007--9111-y","paperID":"None"},{"content":"Aric Hagberg, Pieter Swart, and Daniel Schult. 2008. Exploring network structure, dynamics, and function using NetworkX. In Proceedings of the Python in Science Conference (SciPy 2008), 11--15.","paperID":"None"},{"content":"Mordechai Haklay. 2010. How good is volunteered geographical information? A comparative study of OpenStreetMap and Ordnance Survey datasets. Environment and Planning B: Planning and Design 37: 682--703. DOI=10.1068/b35097","paperID":"None"},{"content":"Christian Heath and Paul Luff. 1992. Collaboration and Control: Crisis Management and Multimedia Technology in London Underground Line Control Rooms. Journal of Computer Supported Cooperative Work, 1,1: 24--48. DOI=10.1007/BF00752451","paperID":"None"},{"content":"Desislava Hristova, Giovanni Quattrone, Afra Mashhadi, and Licia Capra. 2013. The Life of the Party: Impact of Social Mapping in OpenStreetMap. In Proceedings of AAAI Conference on Weblogs and Social Media (ICWSM 2013), 234--243.","paperID":"None"},{"content":"Amanda L. Hughes, Leysia Palen, Jeannette Sutton, Sophia B. Liu, and Sarah Vieweg. 2008. \"Site-Seeing\" in Disaster: An Examination of On-Line Social Convergence. In Proceedings of Conference on Information Systems for Crisis Response and Management (ISCRAM '08), 324--333.","paperID":"None"},{"content":"Brian C. Keegan. 2012. Breaking news on Wikipedia: dynamics, structures, and roles in high-tempo collaboration. In Proceedings of the ACM Conference on Computer Supported Cooperative Work Companion (CSCW '12), 315--318. http://doi.acm.org/10.1145/2141512.2141609","paperID":"None"},{"content":"Brian Keegan, Darren Gergle, and Noshir Contractor. 2011. Hot off the wiki: dynamics, practices, and structures in Wikipedia's coverage of the Tohoku catastrophes. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym '11), 105--113. http://doi.acm.org/10.1145/2038558.2038577","paperID":"None"},{"content":"Brian Keegan, Darren Gergle, and Noshir Contractor. 2012. Staying in the loop: structure and dynamics of Wikipedia's breaking news collaborations. In Proceedings of the Eighth Annual International Symposium on Wikis and Open Collaboration (WikiSym '12). Article 1, 10 pages. http://doi.acm.org/10.1145/2462932.2462934","paperID":"None"},{"content":"James M. Kendra and Tricia Wachtendorf. 2003. Reconsidering Convergence and Converger Legitimacy in Response to the World Trade Center Disaster. Terrorism and Disaster: New Threats, New Ideas (Research in Social Problems and Public Policy) 11: 97--122. DOI=10.1016/S0196--1152(03)11007--1","paperID":"None"},{"content":"Aniket Kittur, Bongwon Suh, Bryan A. Pendleton, and Ed H. Chi. 2007. He says, she says: conflict and coordination in Wikipedia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 453--462. http://doi.acm.org/10.1145/1240624.1240698","paperID":"None"},{"content":"Aniket Kittur, Ed Chi, Bryan A. Pendleton, Bongwon Suh, and Todd Mytkowicz. 2007. Power of the few vs. wisdom of the crowd: Wikipedia and the rise of the bourgeoisie. In Proceedings of alt.CHI 2007","paperID":"None"},{"content":"Marina Kogan, Leysia Palen, and Kenneth M. Anderson. 2015. Think Local, Retweet Global: Retweeting by the Geographically-Vulnerable during Hurricane Sandy. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 981--993. http://doi.acm.org/10.1145/2675133.2675218","paperID":"None"},{"content":"Jean Lave and Etienne Wenger. 1991. Situated Learning: Legitimate Peripheral Participation. Cambridge University Press.","paperID":"None"},{"content":"Yu-Wei Lin. 2011. A qualitative enquiry into OpenStreetMap making. New Review of Hypermedia and Multimedia 17, 1: 53--71. http://dx.doi.org/10.1080/13614568.2011.552647","paperID":"None"},{"content":"Mikel Maron. 2010. Haiti OpenStreetMap Response. Image. (14 January 2010). Retrieved May 20, 2015 from http://brainoff.com/weblog/2010/01/14/1518","paperID":"None"},{"content":"Alan McConchie. 2013. Introducing \"Map-Gardening\". Retrieved September 15, 2015 from http://mappingmashups.net/2013/05/25/introducingmap-gardening/./..","paperID":"None"},{"content":"Patrick Meier, 2015. Digital Humanitarians: How Big Data is changing the Face of Humanitarian Response. Taylor & Francis Press.","paperID":"None"},{"content":"Peter Mooney and Padraig Corcoran. 2012. How social is OpenStreetMap? 24--27. In Proceedings of International Conference on Geographic Information Science (AGILE 2012), 282--287.","paperID":"None"},{"content":"Peter Mooney and Padraig Corcoran. 2014. Analysis of Interaction and Co-editing Patterns amongst OpenStreetMap Contributors. Transactions in GIS 18, 5: 633--659. DOI= 10.1111/tgis.12051","paperID":"None"},{"content":"Pascal Neis, and Alexander Zipf. 2012. Analyzing the Contributor Activity of a Volunteered Geographic Information Project -- The Case of OpenStreetMap. ISPRS International Journal of Geo-Information 1, 2: 146--165. DOI=10.3390/ijgi1020146","paperID":"None"},{"content":"Leysia Palen, Sarah Vieweg, Sophia B. Liu, and Amanda Lee Hughes. 2009. Crisis in a Networked World. In Soc. Sci. Comput. Rev. 27, 4: 467--480. http://dx.doi.org/10.1177/0894439309332302","paperID":"None"},{"content":"Leysia Palen, Robert Soden, T. Jennings Anderson, and Mario Barrenechea. 2015. Success & Scale in a DataProducing Organization: The Socio-Technical Evolution of OpenStreetMap in Response to Humanitarian Events. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 4113--4122. http://doi.acm.org/10.1145/2702123.2702294","paperID":"None"},{"content":"Katherine Panciera. 2011. User lifecycles in cyclopath: a survey of users. In Proceedings of iConference (iConference '11), 741--742. http://doi.acm.org/10.1145/1940761.1940892","paperID":"None"},{"content":"Sung-Yueh Perng, Monika Buscher, Lisa Wood, Ragnhild Halvorsrud, Michael Stiso, Leonardo Ramirez, and Amro Al-Akkad. 2013. Peripheral response: microblogging during the 22/7/2011 Norway attacks. International Journal of Information Systems for Crisis Response and Management 5, 1: 41--57.","paperID":"None"},{"content":"John W. Powell. 1954. An introduction to the natural history of disaster. University of Maryland: Disaster Research Project.","paperID":"None"},{"content":"Reid Priedhorsky and Loren Terveen. 2008. The computational geowiki: what, why, and how. In Proceedings of the ACM conference on Computer supported cooperative work (CSCW '08), 267--276. http://doi.acm.org/10.1145/1460563.1460606","paperID":"None"},{"content":"Reid Priedhorsky, Jilin Chen, Shyong (Tony) K. Lam, Katherine Panciera, Loren Terveen, and John Riedl. 2007. Creating, destroying, and restoring value in wikipedia. In Proceedings of the ACM conference on Supporting group work (GROUP '07), 259--268. http://doi.acm.org/10.1145/1316624.1316663","paperID":"None"},{"content":"Tom A. B. Snijders. 2006. Statistical Methods for Network Dynamics. In Proceedings of the XLIII Scientific Meeting of the Italian Statistical Society, 281--296.","paperID":"None"},{"content":"Robert Soden and Leysia Palen. 2014. From Crowdsourced Mapping to Community Mapping: The Post-Earthquake Work of OpenStreetMap Haiti. In Proceedings of the Conference on the Design of Cooperative Systems (COOP '14), 311--326. DOI=10.1007/978--3--319-06498--7_19","paperID":"None"},{"content":"Kate Starbird and Leysia Palen. 2011. \"Voluntweeters\": self-organizing by digital volunteers in times of crisis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1071--1080. http://doi.acm.org/10.1145/1978942.1979102","paperID":"None"},{"content":"Kate Starbird and Leysia Palen. 2013. Working and sustaining the virtual \"Disaster Desk\". In Proceedings of the ACM conference on Computer supported cooperative work (CSCW '13), 491--502. http://doi.acm.org/10.1145/2441776.2441832","paperID":"None"},{"content":"Emanuele Strano, Vincenzo Nicosia, Vito Latora, Sergio Porta, and Marc Barthelemy. 2012. Elementary processes governing the evolution of road networks. In Scientific Reports 2, 296. DOI=10.1038/srep00296","paperID":"None"},{"content":"Stanley Wasserman and Katherine Faust. 1994. Social Network Analysis: Methods and Applications. Cambridge University Press.","paperID":"None"},{"content":"Joanne I. White, Leysia Palen, and Kenneth M. Anderson. 2014. Digital mobilization in disaster response: the work & self-organization of on-line pet advocates in response to hurricane sandy. In Proceedings of the ACM conference on Computer supported cooperative work & social computing (CSCW '14), 866--876. http://doi.acm.org/10.1145/2531602.2531633","paperID":"None"}],"abstract":"OpenStreetMap (OSM) is the most widely used volunteer geographic information system. Although it is increasingly relied upon during humanitarian response as the most up-to-date, accurate, or accessible map of affected areas, the behavior of the mappers who contribute to it is not well understood. In this paper, we explore the work practices and interactions of volunteer mappers operating in the high-tempo, high-volume context of disasters. To do this, we built upon and expanded prior network analysis techniques to select high-value portions of the vast OSM data for further qualitative analysis. We then performed detailed content analysis of the identified activity and, where possible, conducted interviews with the participants. This research allowed the identification of seven distinct mapping practices that can be classified according to dimensions of time, space, and interpersonal interaction. Our work represents a baseline for future research about how OSM crisis mapping practices have evolved over time.","title":"Finding the Way to OSM Mapping Practices: Bounding Large Crisis Datasets for Qualitative Investigation","filename":"CHI16/p2783","authors":["Marina Kogan","Jennings Anderson","Leysia Palen","Kenneth M. Anderson","Robert Soden"],"conference":"CHI '16"}