{"paperId":2858139,"citation":[],"abstract":"We explore the use of a new way to log into a web service, such as email or social media. Using on-demand biometrics, users sign in from a browser on a computer using just their name, which sends a request to their phone for approval. Users approve this request by authenticating on their phone using their fingerprint, which completes the login in the browser. On-demand biometrics thus replace passwords or temporary access codes found in two-step verification with the ease of use of biometrics. We present the results of an interview study on the use of on-demand biometrics with a live login backend. Participants perceived our system as convenient and fast to use and also expressed their trust in fingerprint authentication to keep their accounts safe. We motivate the design of on-demand biometrics, present an analysis of participants' use and responses around general account security and authentication, and conclude with implications for designing fast and easy cross-device authentication.","reference":[{"content":"Android Face Unlock. Biometric face recognition. Retrieved September 20, 2015 from https://support.google.com/nexus/answer/2781894","paperID":"None"},{"content":"Apple Touch ID. Mobile fingerprint scanner. Retrieved September 20, 2015 from http://www.apple.com/iphone-6/touch-id/","paperID":"None"},{"content":"Authy Two-factor Authentication. Retrieved December 31, 2015 from https://www.twilio.com/authy","paperID":"None"},{"content":"Alexander De Luca, Alina Hang, Emanuel von Zezschwitz, and Heinrich Hussmann. 2015. I Feel Like I'm Taking Selfies All Day!: Towards Understanding Biometric Authentication on Smartphones. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1411-1414. http://dx.doi.org/10.1145/2702123.2702141","paperID":"None"},{"content":"Anind K. Dey, Katarzyna Wac, Denzil Ferreira, Kevin Tassini, Jin-Hyuk Hong, and Julian Ramos. 2011. Getting closer: an empirical investigation of the proximity of user to their smart phones. In Proceedings of the 13th international conference on Ubiquitous computing (UbiComp '11), 163-172. http://doi.acm.org/10.1145/2030112.2030135","paperID":"None"},{"content":"Duo Security. Two-factor authentication. Retrieved September 20, 2015 from https://www.duosecurity.com/product","paperID":"None"},{"content":"Facebook Login Approvals. May 12, 2011. Retrieved September 20, 2015 from https://www.facebook.com/notes/facebook-engineering/introducinglogin-approvals/10150172618258920","paperID":"None"},{"content":"Google 2-Step Verification. Retrieved September 20, 2015 from https://www.google.com/landing/2step/","paperID":"None"},{"content":"Google Account Backup Codes. Retrieved December 31, 2015 from https://support.google.com/accounts/answer/1187538","paperID":"None"},{"content":"Nancie Gunson, Diarmid Marshall, Hazel Morton, and Mervyn Jack. 2011. User perceptions of security and usability of single-factor and two-factor authentication in automated telephone banking. Comput. Secur. 30, 4 (June 2011), 208-220. http://dx.doi.org/10.1016/j.cose.2010.12.001","paperID":"None"},{"content":"Christian Holz and Marius Knaust. 2015. Biometric Touch Sensing: Seamlessly Augmenting Each Touch with Continuous Authentication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 303-312. http://dx.doi.org/10.1145/2807442.2807458","paperID":"None"},{"content":"Christian Holz, Senaka Buthpitiya, and Marius Knaust. 2015. Bodyprint: Biometric User Identification on Mobile Devices Using the Capacitive Touchscreen to Scan Body Parts. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 3011-3014. http://dx.doi.org/10.1145/2702123.2702518","paperID":"None"},{"content":"Kat Krol, Eleni Philippou, Emiliano De Cristofaro, amd M. Angela Sasse. 2015. \"They brought in the horrible key ring thing!\" Analysing the Usability of TwoFactor Authentication in UK Online Banking. In Network and Distributed System Security Workshop on Usable Security (USEC '15). http://dx.doi.org/10.14722/usec.2015.23001","paperID":"None"},{"content":"Arun Kumar, Saxena Nitesh, Tsudik Gene, and Uzun Ersin. 2009. Caveat emptor: A comparative study of secure device pairing methods. In Pervasive Computing and Communications (PerCom '09), 1-10. http://dx.doi.org/10.1109/PERCOM.2009.4912753","paperID":"None"},{"content":"LinkedIn Two-Step Verification. May 31, 2013. Retrieved September 20, 2015 from http://blog.linkedin.com/2013/05/31/protecting-yourlinkedin-account-with-two-step-verification/","paperID":"None"},{"content":"Sébastien Marcel, Chris McCool, Pavel Matějka, Timo Ahonen, Jan Černocký, Shayok Chakraborty, Vineeth Balasubramanian, Sethuraman Panchanathan, Chi Ho Chan, Josef Kittler, Norman Poh, Benoît Fauve, Ondřej Glembek, Oldřich Plchot, Zdeněk Jančík, Anthony Larcher, Christophe Lévy, Driss Matrouf, JeanFrançois Bonastre, Ping-Han Lee, Jui-Yu Hung, SiWei Wu, Yi-Ping Hung, Lukáš Machlica, John Mason, Sandra Mau, Conrad Sanderson, David Monzo, Antonio Albiol, Hieu V. Nguyen, Li Bai, Yan Wang, Matti Niskanen, Markus Turtinen, Juan Arturo Nolazco-Flores, Leibny Paola Garcia-Perera, Roberto AcevesLopez, Mauricio Villegas, Roberto Paredes. 2010. On the results of the first mobile biometry (MOBIO) face and speaker verification evaluation. In Proceedings of the 20th International conference on Recognizing patterns in signals, speech, images, and videos (ICPR'10), 210-225. http://dx.doi.org/10.1007/978--3--642--17711--8_22","paperID":"None"},{"content":"Microsoft Two-step verification. Retrieved September 20, 2015 from http://windows.microsoft.com/enus/windows/two-step-verification-faq","paperID":"None"},{"content":"Microsoft Windows Hello. Biometric face recognition. Retrieved September 20, 2015 from http://windows.microsoft.com/en-us/windows10/getstarted-what-is-hello","paperID":"None"},{"content":"Nexus Imprint. Retrieved December 31, 2015 from https://support.google.com/nexus/answer/6285273","paperID":"None"},{"content":"Haojian Jin, Christian Holz and Kasper Hornbæk. 2015. Tracko: Ad-hoc Mobile 3D Tracking Using Bluetooth Low Energy and Acoustic Signals for CrossDevice Interaction. In Proceedings of the 28th annual ACM symposium on User interface software and technology (UIST '15), 147-156. http://dx.doi.org/10.1145/2807442.2807475","paperID":"None"},{"content":"Ngu Nguyen, Stephan Sigg, An Huynh, and Yusheng Ji. 2012. Pattern-Based Alignment of Audio Data for Ad Hoc Secure Device Pairing. In Proceedings of the 2012 16th Annual International Symposium on Wearable Computers (ISWC) (ISWC '12). 88-91. http://dx.doi.org/10.1109/ISWC.2012.14","paperID":"None"},{"content":"Gareth Peevers, Gary Douglas, Mervyn A. Jack, and Diarmid Marshall. 2011. A Usability Comparison of SMS and IVR as Digital Banking Channels. Int. J. Technol. Hum. Interact. 7, 4 (October 2011), 1-16. http://dx.doi.org/10.4018/jthi.2011100101","paperID":"None"},{"content":"Thanasis Petsas, Giorgos Tsirantonakis, Elias Athanasopoulos, and Sotiris Ioannidis. 2015. Two-factor authentication: is the world ready?: quantifying 2FA adoption. In Proceedings of the Eighth European Workshop on System Security (EuroSec '15), Article 4. http://dx.doi.org/10.1145/2751323.2751327","paperID":"None"},{"content":"Sundar Pichai, Google I/O 2015, Active Gmail users. May 28, 2015. Retrieved September 20, 2015 from https://events.google.com/io2015/","paperID":"None"},{"content":"Joanna Rokita, Adam Krzyzak, and C. Y. Suen. 2008. Cell Phones Personal Authentication Systems Using Multimodal Biometrics. In Proceedings of the 5th international conference on Image Analysis and Recognition (ICIAR '08), 1013-1022. http://dx.doi.org/10.1007/978--3--540--69812--8_101","paperID":"None"},{"content":"Samsung Finger Scan. Mobile fingerprint scanner. Retrieved September 20, 2015 from http://samsung.com /us/support/answer/ANS00039905/997339939","paperID":"None"},{"content":"Claudio Soriente, Gene Tsudik, and Ersin Uzun. 2008. HAPADEP: Human-Assisted Pure Audio Device Pairing. In Proceedings of the 11th international conference on Information Security (ISC '08), 385-400. http://dx.doi.org/10.1007/978--3--540--85886--7_27","paperID":"None"},{"content":"Shari Trewin, Cal Swart, Larry Koved, Jacquelyn Martino, Kapil Singh, and Shay Ben-David. 2012. Biometric authentication on a mobile device: a study of user effort, error and task disruption. In Proceedings of the 28th Annual Computer Security Applications Conference (ACSAC '12), 159-168. http://dx.doi.org/10.1145/2420950.2420976","paperID":"None"},{"content":"Sacha Trifunovic, Bernhard Distl, Dominik Schatzmann, and Franck Legendre. 2011. WiFi-Opp: ad-hoc-less opportunistic networking. In Proceedings of the 6th ACM workshop on Challenged networks (CHANTS '11), 37-42. http://dx.doi.org/10.1145/2030652.2030664","paperID":"None"},{"content":"Twitter Login Verification. May 22, 2013. Retrieved September 20, 2015 from https://blog.twitter.com/2013/getting-started-with-login-verification","paperID":"None"},{"content":"Two Factor Auth (2FA). List of websites that support two-factor authentication. Retrieved September 20, 2015 from https://www.twofactorauth.org","paperID":"None"},{"content":"Catherine S. Weir, Gary Douglas, Tim Richardson, Mervyn Jack. 2010. Usable security: User preferences for authentication methods in eBanking and the effects of experience. Interacting with Computers. 22, 3 (October 2009), 153-164. http://dx.doi.org/10.1016/j.intcom.2009.10.001","paperID":"None"},{"content":"Yahoo On-Demand Passwords. A New, Simple Way to Log In. March 15, 2015. Retrieved September 20, 2015 from http://yahoo.tumblr.com/post/113708272894/anew-simple-way-to-log-in","paperID":"None"},{"content":"Yahoo Two-step verification. Retrieved September 20, 2015 from https://help.yahoo.com/kb/SLN5013.html","paperID":"None"},{"content":"Yahoo Account Key. Retrieved December 31, 2015 from https://help.yahoo.com/kb/SLN25781.html","paperID":"None"}],"title":"On-Demand Biometrics: Fast Cross-Device Authentication","filename":"CHI16/p3761","authors":["Christian Holz","Frank R. Bentley"],"conference":"CHI '16"}