{"paperId":2858312,"reference":[{"content":"Paul Atchley, ArthurF. Kramer, George J. Andersen, and Jan Theeuwes. 1997. Spatial cuing in a stereoscopic display: Evidence for a \"depth-aware\" attentional focus. Psychonomic Bulletin & Review 4, 4 (1997), 524--529. DOI: http://dx.doi.org/10.3758/BF03214343","paperID":"None"},{"content":"Patrick Bader, Valentin Schwind, Niels Henze, Stefan Schneegass, Nora Broy, and Albrecht Schmidt. 2014. Design and Evaluation of a Layered Handheld 3D Display with Touch-sensitive Front and Back. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, New York, NY, USA, 315--318. DOI: http://dx.doi.org/10.1145/2639189.2639257","paperID":"None"},{"content":"Robert G. Batchko. 1994. Three-hundred-sixty degree electroholographic stereogram and volumetric display system. Proc. SPIE 2176 (1994), 30--41. DOI: http://dx.doi.org/10.1117/12.172650","paperID":"None"},{"content":"Nora Broy, Florian Alt, Stefan Schneegass, Niels Henze, and Albrecht Schmidt. 2013. Perceiving Layered Information on 3D Displays Using Binocular Disparity. In Proceedings of the 2Nd ACM International Symposium on Pervasive Displays (PerDis '13). ACM, New York, NY, USA, 61--66. DOI: http://dx.doi.org/10.1145/2491568.2491582","paperID":"None"},{"content":"Nora Broy, Stefan Schneegass, Florian Alt, and Albrecht Schmidt. 2014. FrameBox and MirrorBox: Tools and Guidelines to Support Designers in Prototyping Interfaces for 3D Displays. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2037--2046. DOI: http://dx.doi.org/10.1145/2556288.2557183","paperID":"None"},{"content":"Barbara Froner, Nicolas S. Holliman, and Simon P. Liversedge. 2008. A comparative study of fine depth perception on two-view 3D displays. Displays 29, 5 (2008), 440--450. DOI: http://dx.doi.org/10.1016/j.displa.2008.03.001","paperID":"None"},{"content":"Jonna Hakkila, Maaret Posti, Olli Koskenranta, and Leena Venta-Olkkonen. 2013. Design and Evaluation of Mobile Phonebook Application with Stereoscopic 3D User Interface. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 1389--1394. DOI: http://dx.doi.org/10.1145/2468356.2468604","paperID":"None"},{"content":"Beverly L. Harrison, Hiroshi Ishii, Kim J. Vicente, and William A. S. Buxton. 1995. Transparent Layered User Interfaces: An Evaluation of a Display Design to Enhance Focused and Divided Attention. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 317--324. DOI: http://dx.doi.org/10.1145/223904.223945","paperID":"None"},{"content":"Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, 139--183. DOI: http://dx.doi.org/10.1016/S0166--4115(08)62386--9","paperID":"None"},{"content":"Fu-Chung Huang, Kevin Chen, and Gordon Wetzstein. 2015. The Light Field Stereoscope: Immersive Computer Graphics via Factored Near-eye Light Field Displays with Focus Cues. ACM Trans. Graph. 34, 4, Article 60 (July 2015), 12 pages. DOI: http://dx.doi.org/10.1145/2766922","paperID":"None"},{"content":"Andrew Jones, Ian McDowall, Hideshi Yamada, Mark Bolas, and Paul Debevec. 2007. Rendering for an Interactive 360° Light Field Display. , Article 40 (2007). DOI: http://dx.doi.org/10.1145/1275808.1276427","paperID":"None"},{"content":"Marc Lambooij, Marten Fortuin, Ingrid Heynderickx, and Wijnand IJsselsteijn. 2009. Visual Discomfort and Visual Fatigue of Stereoscopic Displays: A Review. Journal of Imaging Science and Technology 53, 3 (2009), 30201-1-30201-14. DOI: http://dx.doi.org/doi:10.2352/J.ImagingSci.Technol.2009.53.3.030201","paperID":"None"},{"content":"Thurmon E Lockhart and Wen Shi. 2010. Effects of age on dynamic accommodation. Ergonomics 53, 7 (2010), 892--903. DOI: http://dx.doi.org/10.1080/00140139.2010.489968","paperID":"None"},{"content":"John P. McIntire, Paul R. Havig, and Eric E. Geiselman. 2012. What is 3D good for? A review of human performance on stereoscopic 3D displays. Proc. SPIE 8383 (2012), 83830X-83830X-13. DOI: http://dx.doi.org/10.1117/12.920017","paperID":"None"},{"content":"Peter Mowforth, John E. Mayhew, and John P. Frisby. 1981. Vergence eye movements made in response to spatial-frequency-filtered random-dot stereograms. Perception 10, 3 (1981), 299--304.","paperID":"None"},{"content":"Vijay Prema, Gary Roberts, and BC Wuensche. 2006. 3D visualisation techniques for multi-layer display technology. In IVCNZ, Vol. 6. 27--29.","paperID":"None"},{"content":"Jong-Wook Seo and Taeho Kim. 2008. Double-Layer Projection Display System Using Scattering Polarizer Film. Japanese Journal of Applied Physics 47, 3R (2008), 1602. http://stacks.iop.org/1347--4065/47/i=3R/a=1602","paperID":"None"},{"content":"Meiju Sunnari, Leena Arhippainen, Minna Pakanen, and Seamus Hickey. 2012. Studying User Experiences of Autostereoscopic 3D Menu on Touch Screen Mobile Device. In Proceedings of the 24th Australian Computer-Human Interaction Conference (OzCHI '12). ACM, New York, NY, USA, 558--561. DOI: http://dx.doi.org/10.1145/2414536.2414622","paperID":"None"},{"content":"Colin Ware and Peter Mitchell. 2008. Visualizing Graphs in Three Dimensions. ACM Trans. Appl. Percept. 5, 1, Article 2 (Jan. 2008), 15 pages. DOI: http://dx.doi.org/10.1145/1279640.1279642","paperID":"None"},{"content":"Gordon Wetzstein, Douglas Lanman, Matthew Hirsch, and Ramesh Raskar. 2012. Tensor Displays: Compressive Light Field Synthesis Using Multilayer Displays with Directional Backlighting. ACM Trans. Graph. 31, 4, Article 80 (July 2012), 11 pages. DOI: http://dx.doi.org/10.1145/2185520.2185576","paperID":"None"}],"citation":[],"abstract":"Our eyes use multiple cues to perceive depth. Current 3D displays do not support all depth cues humans can perceive. While they support binocular disparity and convergence, no commercially available 3D display supports focus cues. To use them requires accommodation, i.e. stretching the eye lens when focusing on an individual distance. Previous work proposed multilayer and light field displays that require the eye to accommodate. Such displays enable the user to focus on different depths and blur out content that is out of focus. Thereby, they might ease the separation of content displayed on different depth layers. In this paper we investigate the effect of focus cues by comparing 3D shutter glasses with a multilayer display. We show that recognizing content displayed on a multilayer display takes less time and results in fewer errors compared to shutter glasses. We further show that separating overlapping content on multilayer displays again takes less time, results in fewer errors, and is less demanding. Hence, we argue that multilayer displays are superior to standard 3D displays if layered 3D content is displayed, and they have the potential to extend the design space of standard GUI.","title":"The Effect of Focus Cues on Separation of Information Layers","filename":"CHI16/p509","authors":["Patrick Bader","Niels Henze","Nora Broy","Katrin Wolf"],"conference":"CHI '16"}