{"paperId":2858514,"abstract":"Learning a second language is challenging. Becoming fluent requires learning contextual information about how language should be used as well as word meanings and grammar. The majority of existing language learning applications provide only thin context around content. In this paper, we present work in Crystallize, a language learning game that combines traditional learning approaches with a situated learning paradigm by integrating a spaced-repetition system within a language learning roleplaying game. To facilitate long-term engagement with the game, we added a new quest paradigm, \"jobs,\" that allow a small amount of design effort to generate a large set of highly-scaffolded tasks that grow iteratively. A large-scale evaluation of the language learning game \"in the wild\" with a diverse set of 186 people revealed that the game was not only engaging players for extended amounts of time but that players learned an average of 8.7 words in an average of 40.5 minutes.","citation":[],"reference":[{"content":"2015. Anki. www.ankisrs.net. (2015).","paperID":"None"},{"content":"2015. Duolingo. www.duolingo.com. (2015).","paperID":"None"},{"content":"2015. FluentU. www.fluentu.com/japanese/. (2015).","paperID":"None"},{"content":"2015. italki. www.italki.com. (2015).","paperID":"None"},{"content":"2015. LiveMocha. http://livemocha.com/. (2015).","paperID":"None"},{"content":"2015. Rikai Chan. www.polarcloud.com/getrcx/. (2015).","paperID":"None"},{"content":"2015. Super Memory. supermemo.com/. (2015).","paperID":"None"},{"content":"2015. WaniKani. wanikani.com. (2015).","paperID":"None"},{"content":"Erik Andersen, Yun-En Liu, Richard Snider, Roy Szeto, Seth Cooper, and Zoran Popovic. 2011. On the Harmfulness of Secondary Game Objectives. In FDG '11: Proceedings of the Sixth International Conference on the Foundations of Digital Games. ACM, NY, NY, USA.","paperID":"None"},{"content":"Erik Andersen, Yun-En Liu, Richard Snider, Roy Szeto, and Zoran Popovic. Placing a Value on Aesthetics in Online Casual Games. In CHI 2011. ACM Press.","paperID":"None"},{"content":"Erik Andersen, Eleanor O'Rourke, Yun-En Liu, Richard Snider, Jeff Lowdermilk, David Truong, Seth Cooper, and Zoran Popovic. The Impact of Tutorials on Games of Varying Complexity. In CHI 2012. ACM Press.","paperID":"None"},{"content":"Richard Bailey and Jesse Davey. 2011. Internet-based Spaced Repetition Learning In and Out of the Classroom: Implementation and Student Perception. CELE Journal 20 (2011), 39--50.","paperID":"None"},{"content":"Lawrence W Barsalou. 1999. Language comprehension: Archival memory or preparation for situated action? (1999).","paperID":"None"},{"content":"Eric Butler, Erik Andersen, Adam M Smith, Sumit Gulwani, Zoran Popovic, and WA Redmond. 2015. Automatic Game Progression Design through Analysis of Solution Features. In Proc. of the SIGCHI Conf. on Human Factors in Computing (CHI2015).","paperID":"None"},{"content":"Gabriel Culbertson, Erik Andersen, Walker White, Daniel Zhang, and Malte Jung. Crystallize: An Immersive, Collaborative Game for Second Language Learning. In CSCW 2016.","paperID":"None"},{"content":"Michele D Dickey. 2007. Game design and learning: A conjectural analysis of how massively multiple online role-playing games (MMORPGs) foster intrinsic motivation. Educational Technology Research and Development 55, 3 (2007), 253--273.","paperID":"None"},{"content":"Nicolas Ducheneaut and Robert J Moore. The social side of gaming: a study of interaction patterns in a massively multiplayer online game. In CSCW 2004. ACM Press.","paperID":"None"},{"content":"Hermann Ebbinghaus. 1913. Memory: A contribution to experimental psychology. Number 3. Teacher's College, Columbia University, NY City. Originally published in 1885.","paperID":"None"},{"content":"Darren Edge, Elly Searle, Kevin Chiu, Jing Zhao, and James A Landay. MicroMandarin: mobile language learning in context. In CHI 2011. ACM Press.","paperID":"None"},{"content":"Uschi Felix. 2005. E-learning pedagogy in the third millennium: the need for combining social and cognitive constructivist approaches. ReCALL 17, 01 (2005), 85--100.","paperID":"None"},{"content":"James Paul Gee. 2003. What video games have to teach us about learning and literacy. Computers in Entertainment (CIE) 1, 1 (2003), 20--20.","paperID":"None"},{"content":"James Paul Gee. 2007. Why are video games good for learning. Unpublished manuscript. Retrieved 23 (2007).","paperID":"None"},{"content":"James Paul Gee. 2008. Learning and games. The ecology of games: Connecting youth, games, and learning 3 (2008), 21--40.","paperID":"None"},{"content":"Arthur M Glenberg, Tiana Gutierrez, Joel R Levin, Sandra Japuntich, and Michael P Kaschak. 2004. Activity and Imagined Activity Can Enhance Young Children's Reading Comprehension. Journal of Educational Psychology 96, 3 (2004), 424.","paperID":"None"},{"content":"Ward H. Goodenough. 1957. Oceania and the Problem of Controls in the Study of Cultural and Human Evolution. The Journal of the Polynesian Society 66, 2 (1957), pp. 146--155.","paperID":"None"},{"content":"James W Heisig. 2007. Remembering the Kanji, Volume 1: A Complete Course on How not to Forget the Meaning and Writing of Japanese Characters. Vol. 1. University of Hawaii Press.","paperID":"None"},{"content":"Dorothy Holland and Naomi Quinn. 1987. Cultural models in language and thought. Cambridge University Press.","paperID":"None"},{"content":"Robert Howland, Sachi Urano, and Junichi Hoshino. 2012. SanjigenJiten: computer assisted language learning system within a 3d game environment. In Advances in Computer Entertainment. Springer, 262--273.","paperID":"None"},{"content":"Jean Lave and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Cambridge university press.","paperID":"None"},{"content":"Derek Lomas, Kishan Patel, Jodi L. Forlizzi, and Kenneth R. Koedinger. Optimizing challenge in an educational game using large-scale design experiments. In CHI 2013.","paperID":"None"},{"content":"Jane McGonigal. 2003. A real little game: The performance of belief in pervasive play. Proceedings of DiGRA 2003 (2003).","paperID":"None"},{"content":"Gisli Palsson. 1994. Enskilment at sea. Man (1994), 901--927.","paperID":"None"},{"content":"Mark Peterson. 2010. Massively multiplayer online role-playing games as arenas for second language learning. Computer Assisted Language Learning 23, 5 (2010), 429--439.","paperID":"None"},{"content":"Paul Pimsleur. 1967. A memory schedule. Modern Language Journal (1967), 73--75.","paperID":"None"},{"content":"Yolanda A Rankin, McKenzie McNeal, Marcus W Shute, and Bruce Gooch. 2008. User centered game design: evaluating massive multiplayer online role playing games for second language acquisition. In Proceedings of the 2008 ACM SIGGRAPH symposium on Video games. ACM, 43--49.","paperID":"None"},{"content":"Joan Rubin. 1975. What the \"good language learner\" can teach us. TESOL quarterly (1975), 41--51.","paperID":"None"},{"content":"Guoquan Sha. 2009. AI-based chatterbots and spoken English teaching: a critical analysis. Computer Assisted Language Learning 22, 3 (2009), 269--281.","paperID":"None"},{"content":"T Townsend, P Clarke, and M Ainscow. 1999. Third Millennium Schools: prospects and problems for school effectiveness and school improvement. T. Townsend, T. Clarke & M. Ainscow, Third Millennium Schools: A world of difference in effectiveness and improvement. Lisse: Swets & Zeitlinger (1999).","paperID":"None"},{"content":"Kathleen Tuite, Timothy Pavlik, Sandra B Fan, Tyler Robison, Alexander Jaffe, Yun-En Liu, Erik Andersen, and Steven Tanimoto. 2012. Picard: A creative and social online flashcard learning game. In Proceedings of the International Conference on the Foundations of Digital Games. ACM, 231--234.","paperID":"None"},{"content":"Luis von Ahn. 2013. Duolingo: learn a language for free while helping to translate the web. In IUI'13. ACM, 1--2.","paperID":"None"}],"title":"Social Situational Language Learning through an Online 3D Game","filename":"CHI16/p957","authors":["Gabriel Culbertson","Shiyu Wang","Malte Jung","Erik Andersen"],"conference":"CHI '16"}