{"paperId":2858187,"citation":[],"abstract":"Designing for women's healthcare remains an underexplored area of HCI, particularly outside informational systems for maternal health. Drawing on a case study of a body disruption - urinary incontinence in women - we illustrate the experience of women's health both from the perspective of the patient and the therapist. We show how knowledge, esteem and agency play crucial roles in remedial women's care practices, as well as preventative. In describing these challenges we deliberate on possible futures of women's health that take advantage of the many advances in design and technology from across the spectrum of HCI research. We show how with some care and courage HCI has the potential to transform women's experience within this setting.","reference":[{"content":"Mafruha Alam, Tahmina Khanam, and Rubayat Khan. 2010. Assessing the scope for use of mobile based solution to improve maternal and child health in Bangladesh: A case study. 4th ACM/IEEE International Conference on Information and Communication Technologies and Development (ICTD '10).","paperID":"None"},{"content":"Teresa Almeida, Rob Comber, Gavin Wood, Dean Saraf, and Madeline Balaam. 2016. On Looking at the Vagina through Labella. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16), (In Press).","paperID":"None"},{"content":"Sarah Atkinson. 2011. Scales of care and responsibility: debating the surgically globalised body. Social & Cultural Geography 12, 6, 623--637. http://doi.org/10.1080/14649365.2011.601263","paperID":"None"},{"content":"Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: A Location-Mapping Mobile Application for Breastfeeding Women. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1709--1718. http://doi.acm.org/10.1145/2702123.2702328","paperID":"None"},{"content":"Jeffrey Bardzell, Shaowen Bardzell, and Lone Koefoed Hansen. 2015. Immodest Proposals: Research Through Design and Knowledge. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 2093--2102.","paperID":"None"},{"content":"Jeffrey Bardzell, Shaowen Bardzell, Guo Zhang, and Tyler Pace. 2014. The Lonely Raccoon at the Ball: Designing for Intimacy, Sociability, and Selfhood. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3943--3952.","paperID":"None"},{"content":"Jeffrey Bardzell and Shaowen Bardzell. 2011. \"Pleasure is Your Birthright\": Digitally Enabled Designer Sex Toys as a Case of Third-Wave HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 257--266.","paperID":"None"},{"content":"Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a Feminist HCI Methodology?: Social Science , Feminism , and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 675--684.","paperID":"None"},{"content":"Jo-anne Bichard, Eleanor Van Den Heuvel, Felicity Jowitt, et al. 2012. Tackling Ageing Continence through Theory, Tools & Technology (TACT3). Aging & Society 1, 2.","paperID":"None"},{"content":"Kari Bø and Margaret Sherburn. 2005. Evaluation of Female Pelvic-Floor Muscle Function and Strength. Physical Therapy: 269--282.","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 77--101.","paperID":"None"},{"content":"R a Castro, R M Arruda, and M a T Bortolini. 2015. Female urinary incontinence: effective treatment strategies. Climacteric: the journal of the International Menopause Society 18, 2, 135--41. http://doi.org/10.3109/13697137.2014.947257","paperID":"None"},{"content":"Ewen Chardronnet. 2015. GynePunk, the cyborg witches of DIY gynecology. Makery. Retrieved September 24, 2015 from http://www.makery.info/en/2015/06/30/gynepunk-lessorcieres-cyborg-de-la-gynecologie-diy/","paperID":"None"},{"content":"P. Chenette and C. Martinez. 2014. Synchronization of women's cycles: a big data and crowdsourcing approach to menstrual cycle analysis. Fertility and Sterility 102, 3, e250. http://doi.org/10.1016/j.fertnstert.2014.07.853","paperID":"None"},{"content":"Chiaro. 2015. Elvie. Retrieved September 22, 2015 from https://www.elvie.com/","paperID":"None"},{"content":"Rachel Clarke, Peter Wright, Madeline Balaam, and John Mccarthy. 2013. Digital Portraits?: Photo-sharing After Domestic Violence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2517--2526.","paperID":"None"},{"content":"Christopher A Le Dantec and W Keith Edwards. 2008. Designs on Dignity?: Perceptions of Technology Among the Homeless. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2008).","paperID":"None"},{"content":"Lina Dib, Daniela Petrelli, and Steve Whittaker. 2010. Sonic Souvenirs: Exploring the Paradoxes of Recorded Sound for Family Remembering. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW '10), 391--400.","paperID":"None"},{"content":"Rosalyn Diprose and Jack Reynolds (eds.). 2008. Merleau-Ponty: Key Concepts. Acumen Publishing Ltd.","paperID":"None"},{"content":"Abigail Durrant, Duncan Rowland, David S. Kirk, Steve Benford, Joel E. Fischer, and Derek Mcauley. 2011. Automics: Souvenir Generating Photoware for Theme Parks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1767--1776.","paperID":"None"},{"content":"Henrik Enquist and Konrad Tollmar. 2008. The Memory Stone -- A Personal ICT Device in Health Care. In Proceedings of the 5th Nordic conference on Humancomputer interaction (NordiCHI '08), ACM Press, 103--112.","paperID":"None"},{"content":"Catherine Gallagher and Thomas Laqueur (eds.). 1987. The Making of the Modern Body. University of California Press.","paperID":"None"},{"content":"Elizabeth Grosz. 1994. Volatile Bodies, toward a corporeal feminism. Indiana University Press.","paperID":"None"},{"content":"Md Haque, Ferdaus Kawsar, Mohammad Adibuzzaman, et al. 2012. Findings of e-ESAS: a mobile based symptom monitoring system for breast cancer patients in rural Bangladesh. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 899--908.","paperID":"None"},{"content":"Eleanor van den Heuvel, Mary Gilhooly, Ian Sutherland, et al. 2012. Tackling ageing incontinence through theory, tools and technology (TACT3).","paperID":"None"},{"content":"Gopinaath Kannabiran, Jeffrey Bardzell, and Shaowen Bardzell. 2011. How HCI Talks about Sexuality: Discursive Strategies , Blind Spots , and Opportunities for Future Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 695--704.","paperID":"None"},{"content":"Takayuki Kosaka, Hajime Misumi, Takuya Iwamoto, Robert Songer, and Junichi Akita. 2011. \"Mommy Tummy\" A pregnancy experience system simulating fetal movement. SIGGRAPH 2011.","paperID":"None"},{"content":"Neha Kumar and Richard J. Anderson. 2015. Mobile Phones for Maternal Health in Rural India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 427--436.","paperID":"None"},{"content":"Stacey Kuznetsov, Alex S Taylor, Tim Regan, Nicolas Villar, and Eric Paulos. 2012. At the Seams: DIYbio and Opportunities for HCI. In Proceedings of the 2014 conference on Designing Interactive Systems (DIS '12), 258--267.","paperID":"None"},{"content":"Mirim Lee, Bon-chang Koo, Hee-seok Jeong, Joongsin Park, Juhee Cho, and Jun-dong Cho. 2015. Understanding Women's Needs in Menopause for Development of mHealth. Workshop on Pervasive Wireless Healthcare (MobileHealth '15), 51--56.","paperID":"None"},{"content":"Kathleen Lennon. 2010. Feminist Perspectives on the Body. Stanford Encyclopedia of Philosophy. Retrieved September 22, 2015 from http://plato.stanford.edu/entries/feministbody/#LivFemBod","paperID":"None"},{"content":"Erin Lewis. 2011. Kegel Organ. Retrieved September 24, 2015 from http://www.erinlewis.ca/Kegel_Organ.html","paperID":"None"},{"content":"Lian Loke and Toni Robertson. 2011. The Lived Body in Design?: Mapping the Terrain. OZCHI 2011.","paperID":"None"},{"content":"Lian Loke and Toni Robertson. 2013. Moving and Making Strange: An Embodied Approach to MovementBased Interaction Design. ACM Transactions on Computer-Human Interaction 20, 1.","paperID":"None"},{"content":"Deborah Lupton. 1994. Medicine as Culture: Ilness, Disease and the Body in Western Societies. SAGE Publications Inc., London.","paperID":"None"},{"content":"Emily Martin. 1997. Medical Metaphors of Women's Bodies. In Writing on the body: female enbodiment and feminist theory, Katie Conboy, Nadia Medina and Sarah Stanbury (eds.). Columbia University Press, 15--41.","paperID":"None"},{"content":"Michael Massimi, Jill P Dimond, and Christopher A Le Dantec. 2012. Finding a New Normal: The Role of Technology in Life Disruptions. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW '12), 719--728.","paperID":"None"},{"content":"Michael Massimi, William Odom, Richard Banks, and David Kirk. 2011. Matters of Life and Death?: Locating the End of Life in Lifespan-Oriented HCI Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 987--996.","paperID":"None"},{"content":"Zoë Mathias and Diana Harcourt. 2013. Dating and intimate relationships of women with below-knee amputation: an exploratory study. Disability and rehabilitation, 1--8. http://doi.org/10.3109/09638288.2013.797509","paperID":"None"},{"content":"Catherine A. Matthews. 2014. Risk factors for urinary, fecal, or double incontinence in women. Obstetrics & Ginecology 26, 5, 393--397.","paperID":"None"},{"content":"Jamie McCartney. The Great Wall of Vagina. Retrieved September 24, 2015 from http://www.greatwallofvagina.co.uk/home","paperID":"None"},{"content":"Linda McKie. 1996. Women Hearing Men: The Cervical Smear Test and the Social Construction of Sexuality. In Sex, Sensibility and the Gendered Body (Exploratio), Janet Holland and Lisa Adkins (eds.). British Sociological Association, 120--135.","paperID":"None"},{"content":"Minna. kGoal. Retrieved September 22, 2015 from http://www.minnalife.com/products/kgoal","paperID":"None"},{"content":"Ronei M Moraes, Daniel F L Souza, Milane C O Valdek, and Liliane S Machado. 2006. A Virtual Reality Based Simulator for Gynecologic Exam Training. Information Technology Based Higher Education and Training (ITHET '06), 786--791. http://doi.org/10.1109/ITHET.2006.339700","paperID":"None"},{"content":"Melanie Morin PT, Sophie Bergeron, Samir Khalifé, Marie-Hélène Mayrand, and Yitzchak M. Binik. 2014. Morphometry of the Pelvic Floor Muscles in Women With and Without Provoked Vestibulodynia Using 4D Ultrasound. Sexual Medicine 11, 3: 776--785.","paperID":"None"},{"content":"NHS. Squeezy. Retrieved January 6, 2016 from http://www.squeezyapp.co.uk/","paperID":"None"},{"content":"Tao Ni, Amy K Karlson, and Daniel Wigdor. 2011. AnatOnMe?: Facilitating Doctor-Patient Communication Using a Projection-Based Handheld Device. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 3333--3342.","paperID":"None"},{"content":"NICE. 2015. NICE Quality Standards: Urinary incontinence in women.","paperID":"None"},{"content":"Leyla Norooz, Matthew L. Mauriello, Anita Jorgensen, Brenna Mcnally, and Jon E. Froehlich. 2015. BodyVis: A New Approach to Body Learning Through Wearable Sensing and Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2015), 1025--1034. http://doi.acm.org/10.1145/2702123.2702299","paperID":"None"},{"content":"Susan Peake, Lenore Manderson, and Helen Potts. 1999. \"Part and parcel of being a woman\": female urinary incontinence and constructions of control. Medical Anthropology Quarterly 13, 3, 267--85.","paperID":"None"},{"content":"Susan Peake and Lenore Manderson. 2008. The Constraints of a Normal Life?: The Management of Urinary Incontinence by Middle Aged Women. Women & Health, January 2013, 37--41.","paperID":"None"},{"content":"Tamara Peyton, Erika Poole, Madhu Reddy, Jennifer Kraschnewski, and Cynthia Chuang. 2014. \"Every pregnancy is different\": Designing mHealth interventions for the pregnancy ecology. In Proceedings of the 2014 conference on Designing Interactive Systems (DIS '14), 577--586.","paperID":"None"},{"content":"Divya Ramachandran, Vivek Goswami, and John Canny. 2010. Research and reality: using mobile messages to promote maternal health in rural India. 4th ACM/IEEE International Conference on Information and Communication Technologies and Development (ICTD '10).","paperID":"None"},{"content":"Brenda Roe and Carl May. 1999. Incontinence and sexuality: findings from a qualitative perspective. Journal of Advanced Nursing 30, 3: 573--9. Retrieved September 22, 2015 from http://www.ncbi.nlm.nih.gov/pubmed/10499213","paperID":"None"},{"content":"Jennifer Stroud Rossmann. 2008. Built to Specs The vaginal speculum as a case study of inadequate design. Ambidextrous, 47--49.","paperID":"None"},{"content":"Mustafa Kursat Sahin, Gulay Sahin, Mustafa Fevzi Dikici, Fusun Artiran Igde, and Fusun Yaris. 2014. Women's Perceptions and Attitudes about Cervical Cancer in Turkey: Kato's Device as an Alternative to the Pap Smear. Asian Pacific Journal Cancer Prevention 15, 905--910.","paperID":"None"},{"content":"Leslie R. Schover. 1991. The impact of breast cancer on sexuality, body image, and intimate relationships. CA: A Cancer Journal for Clinicians 41, 2, 112--120.","paperID":"None"},{"content":"Margrit Shildrick. 1997. Leaky Bodies and Boundaries: Feminism, Postmodernism and (Bio)Ethics. London: Routledge.","paperID":"None"},{"content":"Meredith M. Skeels, kenton T. Unruh, Christopher Powell, and Wanda Pratt. 2010. Catalyzing social support for breast cancer patients. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 173--182.","paperID":"None"},{"content":"Sputniko. Menstruation Machine - Takashi's Take (2010). Retrieved September 22, 2015 from http://www.sputniko.com/?p=91600","paperID":"None"},{"content":"Katarzyna Stawarz, Anna L. Cox, and Ann Blandford. 2014. Don't forget your pill!: designing effective medication reminder apps that support users' daily routines. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 2269--2278.","paperID":"None"},{"content":"Dag Svanaes. 2013. Interaction Design for and with the Lived Body?: Some Implications of Merleau-Ponty's Phenomenology. ACM Trans. Comput.-Hum Interact. 20, 1, Article 8 (April 2013), 1--30.","paperID":"None"},{"content":"Anne Tinker, Kathleen Finn, and Joanne Epp. 2000. Improving Women's Health: Issues and Interventions. The International Bank for Reconstruction and Development / The World Bank.","paperID":"None"},{"content":"Julia Twigg. 2004. The body, gender, and age: Feminist insights in social gerontology. Journal of Aging Studies 18, 1, 59--73. http://doi.org/10.1016/j.jaging.2003.09.001","paperID":"None"},{"content":"Heather Underwood, S. Revi Sterling, and John K. Bennett. 2013. The PartoPen in practice: evaluating the impact of digital pen technology on maternal health in Kenya. Sixth International Conference on Information and Communication Technologies and Development (ICTD '13), 274--283.","paperID":"None"},{"content":"Trudy Ward and Jo Whittick. 2011. Intimate and Personal Care Guidance?: Educational and Social Care Settings.","paperID":"None"},{"content":"Deborah Wright, Jennifer Fenwick, Pam Stephenson, and Leanne Monterosso. 2005. Speculum \"selfinsertion\": a pilot study. Journal of Clinical Nursing, 14, 1098--1111.","paperID":"None"},{"content":"Fitbit. Retrieved September 22, 2015 from http://www.fitbit.com/uk","paperID":"None"},{"content":"Jawbone. Retrieved September 22, 2015from https://jawbone.com/","paperID":"None"},{"content":"Defining sexual health. World Health Organization. Retrieved September 22, 2015 from http://www.who.int/reproductivehealth/topics/sexual_he alth/sh_definitions/en/index.html","paperID":"None"},{"content":"The NHS in England. Retrieved September 22, 2015 from http://www.nhs.uk/NHSEngland/thenhs/about/Pages/nh sstructure.aspx","paperID":"None"},{"content":"The Great British Public Toilet Map. Retrieved September 24, 2015 from http://greatbritishpublictoiletmap.rca.ac.uk/","paperID":"None"},{"content":"GynePunk. Retrieved September 24, 2015 from http://gynepunk.tumblr.com/","paperID":"None"},{"content":"The GaudiLab. Retrieved September 24, 2015 from http://www.gaudi.ch/GaudiLabs/?page_id=2","paperID":"None"},{"content":"2015. SmearForSmear. Retrieved September 24, 2015 from http://www.jostrust.org.uk/smearforsmear/","paperID":"None"},{"content":"2015. The women \"live-tweeting\" their periods to campaign against Trump. BBC Trending. Retrieved September 24, 2015 from http://www.bbc.co.uk/news/blogs-trending-33863958","paperID":"None"}],"title":"HCI and Intimate Care as an Agenda for Change in Women's Health","filename":"CHI16/p2599","authors":["Teresa Almeida","Rob Comber","Madeline Balaam"],"conference":"CHI '16"}