{"paperId":2858167,"citation":[],"abstract":"Patient engagement leads to better health outcomes and experiences of health care. However, existing patient engagement systems in the hospital environment focus on the passive receipt of information by patients rather than the active contribution of the patient or caregiver as a partner in their care. Through interviews with hospitalized patients and their caregivers, we identify ways that patients and caregivers actively participate in their care. We describe the different roles patients and caregivers assume in interacting with their hospital care team. We then discuss how systems designed to support patient engagement in the hospital setting can promote active participation and help patients achieve better outcomes.","reference":[{"content":"Agency for Healthcare Research and Quality. 2014. 20 Tips to Help Prevent Medical Errors. Agency for Healthcare Research and Quality, Rockville, MD. http://www.ahrq.gov/patientsconsumers/care-planning/errors/20tips/index.html","paperID":"None"},{"content":"American Hospital Association. 2015. Fast Facts on US Hospitals. Accessed Sept 24, 2015 at http://www.aha.org/research/rc/stat-studies/fastfacts.shtml","paperID":"None"},{"content":"Isabelle Aujoulat, Renzo Marcolongo, Leopoldo Bonadiman, and Alain Deccache. 2008. Reconsidering patient empowerment in chronic illness: A critique of models of self-efficacy and bodily control. In Social Science & Medicine 66: 1228--1239. http://doi.org/10.1016/j.socscimed.2007.11.034","paperID":"None"},{"content":"Serena Barello, Guendalina Graffigna, Elena Vegni, and a Claudio Bosio. 2014. The Challenges of Conceptualizing Patient Engagement in Health Care: A Lexicographic Literature Review. In Journal of Participatory Medicine 6: 1--19.","paperID":"None"},{"content":"J S Bauer, S Consolvo, B Greenstein, et al. 2012. ShutEye: Encouraging awareness of healthy sleep recommendations with a mobile, peripheral display. In Human Factors in Computing Systems (CHI'12): 1401--1410. http://doi.org/10.1145/2207676.2208600","paperID":"None"},{"content":"Timothy W. Bickmore, Laura M. Pfeifer, and Brian W. Jack. 2009. Taking the time to care: empowering low health literacy hospital patients with virtual nurse agents. In Proceedings of the 27th international conference on Human factors in computing systems (CHI 09): 1265--1274. http://doi.org/10.1145/1518701.1518891","paperID":"None"},{"content":"Christine A. Caligtan, Diane L. Carroll, Ann C. Hurley, Ronna Gersh-Zaremski, and Patricia C. Dykes. 2012. Bedside information technology to support patient-centered care. In International Journal of Medical Informatics 81, 7: 442--451. http://doi.org/10.1016/j.ijmedinf.2011.12.005","paperID":"None"},{"content":"Kristin L. Carman, Pam Dardess, Maureen Maurer, et al. 2013. Patient and Family Engagement: a framework for understanding the elements and developing interventions and policies. In Health Affairs 32, 2: 223--231. http://doi.org/10.1377/hlthaff.2012.1133","paperID":"None"},{"content":"Chia-Fang Chung, Jonathan Cook, Elizabeth Bales, Jasmine Zia, Sean A. Munson. 2015. More Than Telemonitoring: Health Provider Use and Nonuse of Life-Log Data in Irritable Bowel Syndrome and Weight Management. In Journal of Medical Internet Research 17, 8: e203 http://doi.org/10.2196/jmir.4364","paperID":"None"},{"content":"Sunny Consolvo, Predrag Klasnja, David W. McDonald, et al. 2008. Flowers or a robot army?: Encouraging awareness & activity with personal, mobile displays. In Proceedings of the 10th international conference on Ubiquitous computing (UbiComp '08): 54--63. http://doi.org/10.1145/1409635.1409644","paperID":"None"},{"content":"Sunny Consolvo, David W Mcdonald, and James A Landay. 2009. Theory-Driven Design Strategies for Technologies that Support Behavior Change in Everday Life. 405--414. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 405--414. http://doi.org/10.1145/1518701.1518766","paperID":"None"},{"content":"Angela Coulter and Jo Ellins. 2007. Effectiveness of strategies for informing, educating, and involving patients. In BMJ : British Medical Journal 335, July: 24--27. http://doi.org/10.1136/bmj.39246.581169.80","paperID":"None"},{"content":"Carole Doherty and Charitini Stavropoulou. 2012. Patients' willingness and ability to participate actively in the reduction of clinical errors: A systematic literature review. In Social Science and Medicine 75, 2: 257--263. http://doi.org/10.1016/j.socscimed.2012.02.056","paperID":"None"},{"content":"Patricia C. Dykes, Diane L. Carroll, Ann C. Hurley, Angela Benoit, Frank Chang, Rachel Pozzar, Christine A. Caligtan. 2013. Building and Testing a Patient-Centric Electronic Bedside Communication Center. In Journal of Gerontological Nursing 39, 1: 15--19. http://doi.org/10.3928/00989134-20121204-03","paperID":"None"},{"content":"Guendalina Graffigna, Serena Barello, Andrea Bonanomi, and Edoardo Lozza. 2015. Measuring patient engagement: development and psychometric properties of the Patient Health Engagement (PHE) Scale. In Frontiers in Psychology 6, March: 1--10. http://doi.org/10.3389/fpsyg.2015.00274","paperID":"None"},{"content":"Jessica Greene, Judith H. Hibbard, Rebecca Sacks, Valerie Overton, and Carmen D. Parrotta. 2015. When Patient Activation Levels Change, Health Outcomes And Costs Change, Too. In Health Affairs 34: 431--437. http://doi.org/10.1377/hlthaff.2014.0452","paperID":"None"},{"content":"Jessica Greene, Judith H. Hibbard, Rebecca Sacks, and Valerie Overton. 2013. When seeing the same physician, highly activated patients have better care experiences than less activated patients. In Health Affairs 32: 1299--1305. http://doi.org/10.1377/hlthaff.2012.1409","paperID":"None"},{"content":"Jessie Gruman, Margaret Holmes Rovner, Molly E. French, et al. 2010. From patient education to patient engagement: Implications for the field of patient education. In Patient Education and Counseling 78, 3: 350--356. http://doi.org/10.1016/j.pec.2010.02.002","paperID":"None"},{"content":"Judith H Hibbard, Ellen Peters, Paul Slovic, and Martin Tusler. 2005. Can patients be part of the solution? Views on their role in preventing medical errors. In Medical care research and review : MCRR 62, 1: 601--616. http://doi.org/10.1177/1077558705279313","paperID":"None"},{"content":"Judith H Hibbard, Jean Stockard, Eldon R Mahoney, and Martin Tusler. 2004. Development of the Patient Activation Measure (PAM): conceptualizing and measuring activation in patients and consumers. In Health services research 39: 1005--1026. http://doi.org/10.1111/j.1475-6773.2004.00269.x","paperID":"None"},{"content":"John T James. 2013. A new, evidence-based estimate of patient harms associated with hospital care. In Journal of patient safety 9, 3: 122--8. http://doi.org/10.1097/PTS.0b013e3182948a69","paperID":"None"},{"content":"Logan Kendall, Sonali R. Mishra, Ari Pollack, Barry Aaronson, and Wanda Pratt. 2015. Making background work visible: opportunities to address patient information needs in the hospital. In AMIA 2015: Annual Symposium of the American Medical Informatics Association 2015.","paperID":"None"},{"content":"Patrick W. C. Lau, Erica Y. Lau, Del P. Wong, and Lynda Ransdell. 2011. A Systematic Review of Information and Communication Technology? Based Interventions for Promoting Physical Activity Behavior Change in Children and Adolescents. In Journal of Medical Internet Research, 13, 3:e48. http://doi.org/10.2196/jmir.1533.","paperID":"None"},{"content":"Matthew L Lee and Anind K Dey. 2010. Embedded assessment of aging adults: A concept validation with stakeholders. In Pervasive Computing Technologies for Healthcare (PervasiveHealth), 2010 4th International Conference: 1--8. http://doi.org/10.4108/ICST.PERVASIVEHEALT H2010.8849","paperID":"None"},{"content":"S. J. Lewis and K. W. Heaton. 1997. Stool Form Scale as a Useful Guide to Intestinal Transit Time. In Scandinavian Journal of Gastroenterology 32, 9: 920--924. http://doi.org/10.3109/00365529709011203","paperID":"None"},{"content":"James J. Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B. Strub. 2006. Fish'n'Steps: encouraging physical activity with an interactive computer game. In Proceedings of the 8th international conference on Ubiquitous Computing (UbiComp'06). Springer-Verlag, Berlin, Heidelberg, 261--278. http://dx.doi.org/10.1007/11853565_16","paperID":"None"},{"content":"Edwin A. Locke and Gary P. Latham. 2002. Building a practically useful theory of goal setting and task motivation. A 35-year odyssey. In The American psychologist 57, 9: 705--717. http://doi.org/10.1037/0003-066X.57.9.705","paperID":"None"},{"content":"William M. Marella, Edward Finley, Auden D. Thomas, and John R. Clarke. 2007. Health Care Consumers? Inclination to Engage in Selected Patient Safety Practices. In Journal of Patient Safety 3, 4: 184--189. http://doi.org/10.1097/pts.0b013e31815a6121","paperID":"None"},{"content":"Maureen Maurer, Pam Dardess, Kristin L Carman, Karen Frazier, and Lauren Smeeding. 2012. Guide to Patient and Family Engagement: Environmental Scan Report. 12. Retrieved from http://www.ahrq.gov/research/findings/finalreports/ptfamilyscan/ptfamilyscan.pdf","paperID":"None"},{"content":"Yevgeniy Medynskiy, Svetlana Yarosh, and Elizabeth Mynatt. 2011. Five strategies for supporting healthy behavior change. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 1333--1338. http://doi.org/10.1145/1979742.1979770","paperID":"None"},{"content":"Andrew D Miller, Sonali R Mishra, Logan Kendall, Shefali Haldar, Ari H Pollack, and Wanda Pratt. 2016 (forthcoming). Partners in care: design considerations for caregivers and patients during a hospital stay. To appear in Proceedings of the 19th ACM conference on Computer supported cooperative work & social computing (CSCW '16). ACM, NY, NY, USA. http://doi.acm.org/10.1145/2531602.2531634","paperID":"None"},{"content":"Sean Munson and Sunny Consolvo. 2012. Exploring Goal-setting, Rewards, Self-monitoring, and Sharing to Motivate Physical Activity. In International Conference on Pervasive Computing Technologies for Healthcare: 25--32. http://doi.org/10.4108/icst.pervasivehealth.2012.24","paperID":"None"},{"content":"Jennifer E Prey, Janet Woollen, Lauren Wilcox, et al. 2014. Patient engagement in the inpatient setting: a systematic review. In J Am Med Inform Assoc, 21:742--750. http://doi.org/ 10.1136/amiajnl-2013-002141","paperID":"None"},{"content":"Gabriele Riegler and I. Esposito. 2001. Bristol scale stool form. A still valid help in medical practice and clinical research. In Techniques in Coloproctology 5: 163--164. http://doi.org/10.1007/s101510100019","paperID":"None"},{"content":"Meredith Skeels and Desney S. Tan. 2010. Identifying opportunities for inpatient-centric technology. In Proceedings of the 1st ACM International Health Informatics Symposium (IHI '10). ACM, NY, NY, USA, 580--589. http://doi.org/10.1145/1882992.1883087","paperID":"None"},{"content":"Kenton T Unruh, Meredith Skeels, Andrea CivanHartzler, and Wanda Pratt. 2010. Transforming Clinic Environments into Information Workspaces for Patients. In Conference on Human Factors in Computing Systems: 183--192. http://doi.org/10.1145/1753326.1753354","paperID":"None"},{"content":"Laura Pfeifer Vardoulakis, Amy Karlson, Dan Morris, Greg Smith, Justin Gatewood, and Desney Tan. 2012. Using mobile phones to present medical information to hospital patients. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems (CHI '12): 1411. http://doi.org/10.1145/2207676.2208601","paperID":"None"},{"content":"David K Vawdrey, Lauren G Wilcox, Sarah a Collins, et al. 2011. A tablet computer application for patients to participate in their hospital care. In AMIA Annual Symposium proceedings / AMIA Symposium. AMIA Symposium 2011: 1428--35. Retrieved from http://www.pubmedcentral.nih.gov/articlerender.fc gi?artid=3243172&tool=pmcentrez&rendertype=a bstract","paperID":"None"},{"content":"Charles A. Vincent and Angela Coulter. 2002. Patient safety: what about the patient? In Quality & safety in health care 11: 76--80. http://doi.org/10.1136/qhc.11.1.76","paperID":"None"},{"content":"Jo M. Walrath and Linda E. Rose. 2008. The Medication Administration Process. In Journal of Nursing Care Quality 23, 4: 345--352. http://doi.org/10.1097/01.NCQ.0000323287.64020 .01","paperID":"None"},{"content":"Amy D. Waterman, Thomas H. Gallagher, Jane Garbutt, Brian M. Waterman, Victoria Fraser, and Thomas E. Burroughs. 2006. Brief report: Hospitalized patients' attitudes about and participation in error prevention. In Journal of General Internal Medicine 21: 367--370. http://doi.org/10.1111/j.1525-1497.2005.00385.x","paperID":"None"},{"content":"Lauren Wilcox, Steven Feiner, Andy Liu, Susan Restaino, Sarah Collins, and David Vawdrey. 2012. Designing inpatient technology to meet the medication information needs of cardiology patients. In Proceedings of the 2nd ACM SIGHIT symposium on International health informatics (IHI '12): 831. http://doi.org/10.1145/2110363.2110466","paperID":"None"},{"content":"Lauren Wilcox, Dan Morris, Desney Tan, and Justin Gatewood. 2010. Designing patient-centric information displays for hospitals. In Proceedings of the 28th international conference on Human factors in computing systems (CHI '10): 2123. http://doi.org/10.1145/1753326.1753650","paperID":"None"},{"content":"Langxuan Yin, Lazlo Ring, and Timothy Bickmore. 2012. Using an interactive visual novel to promote patient empowerment through engagement. In Proceedings of the International Conference on the Foundations of Digital Games (FDG '12): 41. http://doi.org/10.1145/2282338.2282351","paperID":"None"}],"title":"\"Not Just a Receiver\": Understanding Patient Behavior in the Hospital Environment","filename":"CHI16/p3103","authors":["Sonali R. Mishra","Shefali Haldar","Ari H. Pollack","Logan Kendall","Andrew D. Miller","Maher Khelifi","Wanda Pratt"],"conference":"CHI '16"}