{"paperId":2858462,"citation":[],"abstract":"Technological artefacts express time periods in their visual design. Due time, visual culture changes and thus affects the design of pictorial representations in technological products, such as icons in user interfaces. Previous research of temporal aspects in human-computer interaction has been focusing on particular interaction situations, but not on the effects of design eras on user experience. The influence of icon design styles of different eras on aesthetic and usability experiences was studied with the method of primed product comparisons. Affective preferences and their processing times were analysed in order to examine visual usability in terms of semantic distance and aesthetic appeal of icons from different design eras. Aesthetic and usability preferences of icons from different eras varied, which allowed the investigation of the process in which users experience icons. This examination results in elaborating the process, for example the relationship between cognitive processing fluency, familiarity, and beauty.","reference":[{"content":"James C. Anderson. 2000. Aesthetic concepts of art. In Theories of art, Noel Carroll (ed.), The University of Wisconsin Press, Madison, Wisconsin, 65--92.","paperID":"None"},{"content":"John R. Anderson. 2000. Cognitive psychology and its implications (5th ed.). Worth Publishers, NY.","paperID":"None"},{"content":"John R. Anderson. 2007. How Can the Human Mind Occur in the Physical Universe? Oxford University Press. NY.","paperID":"None"},{"content":"Javier Bargas-Avila and Kasper Hornbæk. (2011). Old wine in new bottles or novel challenges? A critical analysis of empirical studies of user experience. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '11.","paperID":"None"},{"content":"Charles E. Bethell-Fox and Roger N. Shepard. 1988. Mental Rotation?: Effects of Stimulus Complexity and Familiarity. Journal of Experimental Psychology: Human Perception and Performance 14, 1: 12--23.","paperID":"None"},{"content":"Robert F. Bornstein. 1989. Exposure and affect: Overview and meta-analysis of research, 1968-1987. Psychological Bulletin 106, 2: 265--289.","paperID":"None"},{"content":"Susanne Bødker, 2006. When second wave HCI meets third wave challenges. In Proceedings of the 4th Nordic Conference on Human-Computer Interaction (NordiCHI'06), ACM Press, 1--8.","paperID":"None"},{"content":"Jacob Cohen. 1992. A power primer. Psychological Bulletin 112, 1: 155-159.","paperID":"None"},{"content":"Antonella De Angeli, Alistair Sutcliffe, and Jan Hartmann. 2006. Interaction, usability and aesthetics: What influences users' preferences? In Proceedings of the 6th Conference on Designing Interactive Systems, ACM Press, 271--280.","paperID":"None"},{"content":"Pieter Desmet and Paul Hekkert. 2007. Framework of product experience. Int. Journal of Design 1, 1: 57--66.","paperID":"None"},{"content":"Marcia M. Eaton. 2000. A sustainable definition of art. In Theories of art, Noel Carroll (ed.), The University of Wisconsin Press, Madison, Wisconsin, 141--159.","paperID":"None"},{"content":"Nico H. Frijda. 1988. The laws of emotion. American Psychologist 43, 5: 349--358.","paperID":"None"},{"content":"Mariano García, Albert N. Badre, and John T. Stasko. 1994. Development and Validation of Icons Varying in Their Abstractness. Interacting with Computers 6: 191--211.","paperID":"None"},{"content":"David Gittins. 1986. Icon-based human-computer Interaction. Int. Journal of Man-Machine Studies 24: 519--543.","paperID":"None"},{"content":"Ravindra S. Goonetilleke, Heloisa M. Shih, Hung K. On, and Julien Fritsch. 2001. The effects of training and representational characteristics in icon design. Int. Journal of Human-Computer Studies 55: 741--760.","paperID":"None"},{"content":"Marc Hassenzahl. 2004. The interplay of beauty, goodness, and usability in interactive products. Human-Computer Interaction 19, 4: 319--349.","paperID":"None"},{"content":"Marc Hassenzahl and Andrew Monk. 2010. The Inference of Perceived Usability from Beauty. Human-Computer Interaction 25, 3: 235--206.","paperID":"None"},{"content":"Marc Hassenzahl and Noam Tractinsky. 2006. User experience - a research agenda. Behaviour & Information Technology 25, 2: 91--97.","paperID":"None"},{"content":"Georg W. F. Hegel. 1835. Aesthetics, lectures on fine art, vol I. English translation by Thomas M. Knox (1975). Clarendon Press, Oxford.","paperID":"None"},{"content":"Hekkert, P. 2006. Design aesthetics: principles of pleasure in design. Psychology Science 48, 2: 157--172.","paperID":"None"},{"content":"Shih-Miao Huang, Kong-King Shieh, and Chai-Fen Chi. 2002. Factors affecting the design of computer icons. Int. Journal of Industrial Ergonomics 29: 211--218.","paperID":"None"},{"content":"Edmund Husserl. 1936. The crisis of European sciences and transcendental phenomenology. Northwestern University Press, Evanston, IL.","paperID":"None"},{"content":"Sarah J. Isherwood. 2009. Graphics and Semantics: The relationship between what is seen and what is meant in icon design. In Engineering Psychology and Cognitive Ergonomics, HCII 2009, LNAI 5639, D. Harris (ed.), Springer-Verlag, Berlin Heidelberg, 197--205.","paperID":"None"},{"content":"Sarah J. Isherwood, Siné J. P. McDougall, and Martin B. Curry. 2007. Icon Identification in Context: The Changing Role of Icon Characteristics with User Experience. Human Factors 49, 3: 465--476.","paperID":"None"},{"content":"Jussi P. P. Jokinen. 2015. Emotional user experience: Traits, events, and states. Int. Journal of Human Computer Studies 76: 67--77.","paperID":"None"},{"content":"Jussi P. P. Jokinen, Johanna M. Silvennoinen, Piia M. H. Perälä, and Pertti Saariluoma. 2015. Quick affective judgments: Validation of a method for primed product comparisons. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), ACM Press, 2221--2230.","paperID":"None"},{"content":"Immanuel Kant. 1787. Critique of pure reason. English translation by Paul Guyer and Allen Wood (1998). Cambridge University Press, Cambridge.","paperID":"None"},{"content":"Evangelos Karapanos, John Zimmerman, Jodi Forlizzi, and Jean-Bernard Martens. 2009. User experience over time: an initial framework. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09) ACM Press, 729--738.","paperID":"None"},{"content":"Klaus Krippendorff. 1989. On the essential contexts of artifacts or on the proposition that \"design is making sense (of things)\". Design Issues 5, 2: 9--39.","paperID":"None"},{"content":"Klaus Krippendorff. 2006. The Semantic turn: A new foundation for design. Taylor & Francis, CRC Press, Boca Raton, London, NY.","paperID":"None"},{"content":"Sari Kujala, Marlene Vogel, Anna E. Pohlmeyer, and Marianna Obrist. 2013. Lost in time: the meaning of temporal aspects in user experience. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems- Extended Abstracts (CHI EA'13), ACM Press, 559--564.","paperID":"None"},{"content":"Masaaki Kurosu and Kaori Kashimura. 1995. Apparent usability vs. inherent usability. CHI'95 Conference Companion: Mosaic of Creativity. ACM Press, New Your, NY, 292--293.","paperID":"None"},{"content":"Gitte Lindgaard and Cathy Dudek. 2003. What is this evasive beast we call user satisfaction? Interacting with Computers 15, 3: 429--452.","paperID":"None"},{"content":"Gitte Lindgaard, Gary Fernandes, Cathy Dudek, and Judith Brown. 2006. Attention web designers: You have 50 milliseconds to make a good first impression! Behavior & Information Technology 25, 2: 115--126.","paperID":"None"},{"content":"Anthony J. Marcel. 1983. Conscious and unconscious perception: Experiments on visual masking and word recognition. Cognitive psychology 15, 2: 197--237.","paperID":"None"},{"content":"Siné J. P. McDougall and Martin B. Curry. 2006. More than just a picture: icon interpretation in context. In Proceedings of the International Workshop on Coping with Complexity, University of Bath.","paperID":"None"},{"content":"Siné J. P. McDougall, Martin B. Curry, and Oscar de Bruijn. 1999. Measuring symbol and icon characteristics: norms for concreteness, complexity, meaningfulness, familiarity, and semantic distance for 239 symbols. Behavior Research Methods, Instruments, & Computers 31, 3: 487--519.","paperID":"None"},{"content":"Siné J. P. McDougall, Martin B. Curry, and Oscar de Bruijn. 2001. The effects of visual information on users' mental models: An evaluation of pathfinder analysis as a measure of icon usability. Int. Journal of Cognitive Ergonomics 5, 2: 153--178.","paperID":"None"},{"content":"Siné J. P. McDougall and Irene Reppa. 2013. Ease of icon processing can predict icon appeal. In HumanComputer Interaction, Part I, HCII 2013, LNCS 8004, M. Kurosu (ed.), Springer-Verlag, Berlin Heidelberg, 575--584.","paperID":"None"},{"content":"Morten Moshagen, Jochen Musch, and Anja S. Göritz. 2009. A blessing, not a curse: Experimental evidence for beneficial effects on visual aesthetics on performance. Ergonomics 52, 10: 1311--1320.","paperID":"None"},{"content":"Kevin Mullet and Darrell Sano. 1995. Designing visual interfaces: Communication oriented techniques. Prentice Hall, NJ.","paperID":"None"},{"content":"Annie W. Y. Ng and Alan H. S. Chan. 2008. Visual and Cognitive Features on Icon Effectiveness. In Proceedings of IMECS 2008, 19--21.","paperID":"None"},{"content":"David C. L. Ngo and John G. Byrne. 2001. Application of an aesthetic evaluation model to data entry screen. Computers in Human Behavior 17: 149--185.","paperID":"None"},{"content":"Donald Norman. 1998. The design of everyday things. Basic Books, NY.","paperID":"None"},{"content":"Donald Norman. 2004. Emotional design. Basic Books, NY.","paperID":"None"},{"content":"Eleftherios Papachristos and Nikolaos Avouris. 2011. Are First Impressions Only Related to Visual Appeal? In Proceedings of the INTERACT 2011, Part I, LNCS, Springer, 489--496.","paperID":"None"},{"content":"Rolf Reber, Norbert Schwarz, and Piotr Winkielman. 2004. Processing fluency and aesthetic pleasure: Is beauty in the perceiver's processing experience? Personality and Social Psychology Review 8, 4: 364382.","paperID":"None"},{"content":"Irene Reppa and Siné J. P. McDougall. 2014. When the going gets tough the beautiful get going: aesthetic appeal facilitates task performance. Psychonomic Bulletin & Review 21, 6. doi:10.3758/s13423-0140794-z","paperID":"None"},{"content":"Richard Shusterman. 2000. Pragmatist aesthetics: Living beauty, rethinking art (2nd. ed.). Rowman & Littlefield Publishers Inc., Boston.","paperID":"None"},{"content":"Pertti Saariluoma. 2003. Apperception, content-based psychology and design. In Human Behaviour in Design, U. Lindeman (ed.) Springer, Berlin, 72--78.","paperID":"None"},{"content":"Dario Salvucci and Niels A. Taatgen. 2008. Threaded cognition: an integrated theory of concurrent multitasking. Psychological review 115, 1: 101--130.","paperID":"None"},{"content":"Klaus R. Scherer. 2005. What are emotions? And how can they be measured? Social Science Information, 44, 4: 695--729.","paperID":"None"},{"content":"Klaus R. Scherer. 2009. The dynamic architecture of emotion: Evidence for the component process model. Cognition & Emotion 23, 7: 1307--1351.","paperID":"None"},{"content":"Tania Schlatter and Deborah Levinson. 2013. Visual usability, principles and practices for designing digital applications. Morgan Kaufman, MA, USA.","paperID":"None"},{"content":"Johanna Silvennoinen, Marlene Vogel, and Sari Kujala. 2014. Experiencing visual usability and aesthetics in two mobile application contexts. Journal of Usability Studies 10, 1: 46--62.","paperID":"None"},{"content":"Johanna Silvennoinen, Rebekah Rousi, Jussi P. P. Jokinen, and Piia M. H. Perälä. 2015. Apperception as a multisensory process in material experience. In Proceedings of the Academic Mindtrek Conference 2015, ACM Press.","paperID":"None"},{"content":"Craig A. Smith and Leslie D. Kirby. 2001. Toward delivering on the promise of appraisal theory. Klaus A. Scherer, Angela Schorr, and Tom Johnstone, (Eds.), In Appraisal Process in Emotion, Oxford University Press, NY, 121--138.","paperID":"None"},{"content":"Andreas Sonderegger and Juergen Sauer. 2010. The influence of design aesthetics in usability testing: Effects on user performance and perceived usability. Applied Ergonomics, 41, 3: 403--410.","paperID":"None"},{"content":"Andreas Sonderegger, Gerold Zbinden, Andreas Uebelbacher and Juergen Sauer. 2012. The influence of product aesthetics and usability over the course of time: A longitudinal field experiment. Ergonomics 55, 7: 713730.","paperID":"None"},{"content":"Meinald T. Thielsch, Ronja Engel, and Gerrit Hirschfeld. 2015. Expected usability is not a valid indicator of experienced usability. PeerJ Comput. Sci 1, e19, DOI 10.7717/peerj-cs.19","paperID":"None"},{"content":"Meinald T. Thielsch and Gerrit Hirschfeld. 2012. Spatial frequencies in aesthetic website evaluations - explaining how ultrarapid evaluations are formed. Ergonomics 55, 7: 731--742.","paperID":"None"},{"content":"Manfred Thüring and Sascha Mahlke. 2007. Usability, aesthetics and emotions in human-technology interaction. Int. Journal of Psychology 42, 4: 253--264.","paperID":"None"},{"content":"Noam Tractinsky. 2004. Towards the study of aesthetics in technology. In Proceedings of 25th Annual International Conference in Information Systems, 771780.","paperID":"None"},{"content":"Noam Tractinsky, Avivit Cockhavi, Moti Kirschenbaum, and Tal Sharfi. 2006. Evaluating the consistency of immediate aesthetic perceptions of web pages. Int. Journal of Human-Computer Studies 64, 11: 1071--1083.","paperID":"None"},{"content":"Noam Tractinsky, Adi S, Katz, and Drori Ikar. 2000. What is beautiful is usable. Interacting with Computers 13, 127--145.","paperID":"None"},{"content":"Paul van Schaik and Jonathan Ling. 2008. Modelling user experience with web sites: Usability, hedonic value, beauty and goodness. Interacting with Computers 20, 3: 419--432. doi:10.1016/j.intcom.2008.03.001","paperID":"None"},{"content":"Robert B. Zajonc. 1968. Attitudinal effects of mere exposure. Journal of Personality and Social Psychology 9, 2: 1--27.","paperID":"None"}],"title":"Aesthetic Appeal and Visual Usability in Four Icon Design Eras","filename":"CHI16/p4390","authors":["Johanna M. Silvennoinen","Jussi P.P. Jokinen"],"conference":"CHI '16"}