{"paperId":2858478,"citation":[],"reference":[{"content":"Holly P. Branigan, Martin J. Pickering, Jamie Pearson, and Janet F. McLean. 2010. Linguistic alignment between people and computers. Journal of Pragmatics 42, 9: 2355-2368. http://doi.org/10.1016/j.pragma.2009.12.012","paperID":"None"},{"content":"Mathias Broth, Jakob Cromdal and Lena Levin. In press. Starting out as a driver. Instructed pedal skill progression over a series of trials. In Memory Practices and Learning. Interactional, Institutional and Sociocultural Perspectives, Åsa Mäkitalo, Per Linell, and Roger Säljö (eds). Information Age Publishing, Charlotte, NC, USA.","paperID":"None"},{"content":"Graham Button and Wes Sharrock. 1995. On simulacrums of conversation: Toward a clarification of the relevance of conversation analysis for human-computer interaction. In The Social and Interactional Dimensions of Human-Computer Interfaces, Peter J. Thomas (ed.). Cambridge University Press, NY, USA, 107--125.","paperID":"None"},{"content":"Arnulf Deppermann. 2015. When recipient design fails: Egocentric turn-design of instructions in driving school lessons leading to breakdowns of intersubjectivity. In Gesprächsforschung 16: 63--101.","paperID":"None"},{"content":"Nicholas J. Enfield. 2006. Social consequences of common ground. In Roots of Human Sociality: Culture, Cognition and Interaction, Nicholas J. Enfield and Stephen C. Levinson (eds.). Berg, Oxford, UK, 399--430.","paperID":"None"},{"content":"Kerstin Fischer. 2011. Interpersonal variation in understanding robots as social actors. In Proceedings of the 6th International Conference on Human-Robot Interaction (HRI '11). ACM, NY, NY, USA, 53--60. http://doi.acm.org/10.1145/1957656.1957672","paperID":"None"},{"content":"Kerstin Fischer. 2011. How people talk with robots: Reduce user uncertainty. AI Magazine 32, 4: 31-38.","paperID":"None"},{"content":"Kerstin Fischer and Joe Saunders. 2012. Getting acquainted with a developing robot. In Human Behaviour Understanding, Albert A. Salah, Javier Ruiz-del-Solar, Çetin Meriçli, and Pierre-Yves Oudeyer (eds.). Springer, Berlin, 125--133. http://doi.org/10.1007/978--3--642--34014--7_11","paperID":"None"},{"content":"Terrence Fong, Charles Thorpe, and Charles Baur. 2003. Collaboration, dialogue, human-robot interaction. In Robotics Research, Raymond A. Jarvis and Alexander Zelinsky (eds.). Springer, Berlin, 255--266. http://dx.doi.org/10.1007/3--540--36460--9_17","paperID":"None"},{"content":"Norman Fraser, Nigel Gilbert, Scott McGlashan, and Robin Wooffitt. 1997. Humans, Computers and Wizards: Human (Simulated) Computer Interaction. Routledge, London, UK.","paperID":"None"},{"content":"Charles Goodwin. 1979. The interactive construction of a sentence in natural conversation. In Everyday Language: Studies in Ethnomethodology, George Psathas (ed.). Irvington, NY, USA, 97--121.","paperID":"None"},{"content":"Christian Heath and Paul Luff. 2000. Technology in Action. Cambridge University Press, UK.","paperID":"None"},{"content":"Sara Kiesler and Pamela Hinds. 2004. Introduction to this special issue on human-robot interaction. Human-Computer Interaction 19, 1--2: 1--8.","paperID":"None"},{"content":"Sara Kiesler and Lee Sproull. 1997. \"Social\" human-computer interaction. In Human Values and the Design of Computer Technology, Bataya Friedman (ed.). Center for the Study of Language and Information, Stanford, CA, USA, 191--199.","paperID":"None"},{"content":"Stefan Kopp. 2010. Social resonance and embodied coordination in face-to-face conversation with artificial interlocutors. Speech Communication 52, 6: 587-597. http://doi.org/10.1016/j.specom.2010.02.007","paperID":"None"},{"content":"Yoshinori Kuno, Kazuhisa Sadazuka, Michie Kawashima, Keiichi Yamazaki, Akiko Yamazaki, and Hideaki Kuzuoka. 2007. Museum guide robot based on sociological interaction analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 1191--1194. http://doi.acm.org/10.1145/1240624.1240804","paperID":"None"},{"content":"Paul Luff, Christian Heath, Hideaki Kuzuoka, Jon Hindmarsh, Keiichi Yamazaki, and Shinya Oyama. 2003. Fractured ecologies: Creating environments for collaboration. Human-Computer Interaction 18, 1: 51--84. http://dx.doi.org/10.1207/S15327051HCI1812_3","paperID":"None"},{"content":"Bilge Mutlu, Takayuki Kanda, Jodi Forlizzi, Jessica Hodgins, and Hiroshi Ishiguro. 2012. Conversational gaze mechanisms for humanlike robots. ACM Transactions on Interactive Intelligent Systems. 1, 2, Article 12, (33 pages). http://doi.acm.org/10.1145/2070719.2070725","paperID":"None"},{"content":"Clifford Nass and Youngme Moon. 2000. Machines and mindlessness: Social responses to computers. Journal of Social Issues 56, 1: 81--103. http://doi.org/10.1111/0022--4537.00153","paperID":"None"},{"content":"Clifford Nass, Jonathan Steuer, and Ellen R. Tauber. 1994. Computers are social actors. In Conference Companion on Human Factors in Computing Systems (CHI '94), Catherine Plaisant (ed.). ACM, NY, NY, USA, 72--78. http://dx.doi.org/10.1145/259963.260288","paperID":"None"},{"content":"Elinor Ochs, Emanuel A. Schegloff, and Sandra A. Thompson (eds.). 1996. Interaction and Grammar. Cambridge University Press, NY, USA.","paperID":"None"},{"content":"Jamie Pearson, Jiang Hu, Holly P. Branigan, Martin J. Pickering, and Clifford I. Nass. 2006. Adaptive language behavior in HCI: How expectations and beliefs about a system affect users' word choice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (eds.). ACM, NY, NY, USA, 1177--1180. http://dx.doi.org/10.1145/1124772.1124948","paperID":"None"},{"content":"Karola Pitsch, Hideaki Kuzuoka, Yuya Suzuki, Luise Süssenbach, Paul Luff, and Christian Heath. 2009. \"The first five seconds\": Contingent stepwise entry into an interaction as a means to secure sustained engagement in HRI. In Proceedings of the IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN 2009), 985--991. http://dx.doi.org/10.1109/ROMAN.2009.5326167","paperID":"None"},{"content":"Karola Pitsch, Katrin S. Lohan, Katharina Rohlfing, Joe Saunders, Chrystopher L. Nehaniv, and Britta Wrede. 2012. Better be reactive at the beginning. Implications of the first seconds of an encounter for the tutoring style in human-robot interaction. In Proceedings of the IEEE International Symposium on Robot and Human Interactive Communication (ROMAN 2012), 974--981. http://dx.doi.org/10.1109/ROMAN.2012.6343876","paperID":"None"},{"content":"Jörg Roche. 1998. Variation in Xenolects. Sociolinguistica, 12: 117--139.","paperID":"None"},{"content":"Harvey Sacks. 1992. Lectures on Conversation (Vol. 1). Gail Jefferson (ed.). Blackwell, Oxford.","paperID":"None"},{"content":"Harvey Sacks, and Emanuel A. Schegloff. 1979. Two preferences in the organization of reference to persons in conversation and their interaction. In Everyday Language: Studies in Ethnomethodology, George Psathas (ed.). Irvington, NY, NY, USA, 15--21.","paperID":"None"},{"content":"Harvey Sacks, Emanuel A. Schegloff and Gail Jefferson. 1974. A simplest systematics for the organization of turn-taking for conversation. Language 50, 4: 696--735.","paperID":"None"},{"content":"Emanuel A. Schegloff, 1987. Recycled turn beginnings: A precise repair mechanism in conversation's turn-taking organisation. In Talk and Social Organisation. Graham Button & J. R. E. Lee (eds.). Clevedon, UK, 70-85. [Originally written in 1973].","paperID":"None"},{"content":"Emanuel A. Schegloff. 1998. Reflections on studying prosody in talk-in-interaction. Language and Speech, 41, 3--4: 235--263.","paperID":"None"},{"content":"Emanuel A. Schegloff. 2007. Sequence Organization in Interaction: A Primer in Conversation Analysis. Cambridge University Press, UK.","paperID":"None"},{"content":"Emanuel A. Schegloff and Harvey Sacks. 1973. Opening up closings. Semiotica 8, 4: 289--327.","paperID":"None"},{"content":"Lucy A. Suchman. 1987. Plans and Situated Actions: The Problem of Human-Machine Communication. Cambridge University Press, UK.","paperID":"None"},{"content":"Keiichi Yamazaki, Akiko Yamazaki, Mai Okada, Yoshinori Kuno, Yoshinori Kobayashi, Yosuke Hoshi, Karola Pitsch, Paul Luff, Dirk vom Lehn, and Christian Heath. 2009. Revealing Gauguin: Engaging visitors in robot guide's explanation in an art museum. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1437--1446. http://dx.doi.org/10.1145/1518701.1518919","paperID":"None"}],"abstract":"This paper explores how humans adapt to a conventional humanoid robot. Video data of participants playing a charade game with a Nao robot were analyzed from a multimodal conversation analysis perspective. Participants soon adjust aspects of turn-design such as word selection, turn length and prosody, thereby adapting to the robot's limited perceptive abilities as they become apparent in the interaction. However, coordination of turns-at-talk remains troublesome throughout the encounter, as evidenced by overlapping turns and lengthy silences around possible turn endings. The study discusses how the robot design can be improved to support the problematic taking of turns-at-talk with humans. Two programming strategies to address the identified problems are presented: 1. to program the robot so that it will be systematically receptive at the equivalence to transition relevance places in human-human interaction, and 2. to make the robot preferably produce verbal actions that require a response in a conditional way, rather than making a response only possible.","title":"Why That Nao?: How Humans Adapt to a Conventional Humanoid Robot in Taking Turns-at-Talk","filename":"CHI16/p4921","authors":["Hannah R.M. Pelikan","Mathias Broth"],"conference":"CHI '16"}