{"paperId":2858072,"citation":[],"abstract":"We present a study that investigates the influence of different types of visualizations on collaboration. The visualizations present the group's performance either in a more cooperative or more competitive way. Decades of research suggest that cooperation leads to greater productivity than competition. However, most of the existing group mirror visualizations achieve an increase in productivity and better self-regulation by enabling a direct comparison of performance within the group. We conducted a repeated measures study with 12 groups that were supported by visualizations that displayed the number of ideas of a brainstorming session (1) per person (competitive condition) (2) per group (cooperative condition), (3) per person and per group (mixed condition) and (4) without visualization (baseline). Results indicate that groups that see a combination of individual and group performance (mixed condition) are more productive, more satisfied with their results and participate in a more balanced way.","reference":[{"content":"Khaled Bachour, Frederic Kaplan, and Pierre Dillenbourg. 2010. An Interactive Table for Supporting Participation Balance in Face-to-Face Collaborative Learning. IEEE Transactions on Learning Technologies (2010), 203--213. DOI: http://dx.doi.org/10.1109/TLT.2010.18","paperID":"None"},{"content":"Chester Irving Barnard. 1968. The functions of the executive. Vol. 11. Harvard university press.","paperID":"None"},{"content":"Bianca Beersma, John R. Hollenbeck, Stephen E. Humphrey, Henry Moon, Donald E. Conlon, and Daniel R. Ilgen. 2003. Cooperation, competition, and team performance: Toward a contingency approach. Academy of Management Journal 46, 5 (2003), 572--590. DOI: http://dx.doi.org/10.2307/30040650","paperID":"None"},{"content":"T. Bergstrom and K. Karahalios. 2007. Conversation Clock: Visualizing audio patterns in co-located groups. In System Sciences, 2007. HICSS 2007. 40th Annual Hawaii International Conference on. 78--78. DOI: http://dx.doi.org/10.1109/HICSS.2007.151","paperID":"None"},{"content":"Edward L Deci and Richard M Ryan. 1980. The empirical exploration of intrinsic motivational processes. Advances in experimental social psychology 13, 2 (1980), 39--80.","paperID":"None"},{"content":"Morton Deutsch. 1949. An experimental study of the effects of cooperation and competition upon group process. Human relations 2, 3 (1949), 199--231. DOI: http://dx.doi.org/10.1177/001872674900200301","paperID":"None"},{"content":"Michael Diehl and Wolfgang Stroebe. 1987. Productivity loss in brainstorming groups: Toward the solution of a riddle. Journal of Personality and Social Psychology (1987), 497--509.","paperID":"None"},{"content":"Pierre Dillenbourg. 2005. Designing Biases That Augment Socio-Cognitive Interactions. In Barriers and Biases in Computer-Mediated Knowledge Communication, Rainer Bromme, FriedrichW. Hesse, and Hans Spada (Eds.). Computer-Supported Collaborative Learning Series, Vol. 5. Springer US, 243--264. DOI: http://dx.doi.org/10.1007/0-387-24319-4_11","paperID":"None"},{"content":"Joan Morris DiMicco, Katherine J. Hollenbach, Anna Pandolfo, and Walter Bender. 2007. The impact of increased awareness while face-to-face. Human-Computer Interaction 22, 1 (2007), 47--96.","paperID":"None"},{"content":"Russell G Geen. 1991. Social motivation. Annual review of psychology 42, 1 (1991), 377--399. DOI:http://dx. doi.org/10.1146/annurev.ps.42.020191.002113","paperID":"None"},{"content":"Shih-Wen Huang and Wai-Tat Fu. 2013. Don'T Hide in the Crowd!: Increasing Social Transparency Between Peer Workers Improves Crowdsourcing Outcomes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 621--630. DOI: http://dx.doi.org/10.1145/2470654.2470743","paperID":"None"},{"content":"Patrick Jermann, Amy Soller, and Martin Muehlenbrock. 2001. From mirroring to guiding: A review of the state of art technology for supporting collaborative learning. In European Conference on Computer-Supported Collaborative Learning EuroCSCL-2001. 324--331.","paperID":"None"},{"content":"David W Johnson and Roger T Johnson. 1989. Cooperation and competition: Theory and research. Interaction Book Company.","paperID":"None"},{"content":"David W Johnson and Roger T Johnson. 2005. New developments in social interdependence theory. Genetic, social, and general psychology monographs 131, 4 (2005), 285--358. DOI: http://dx.doi.org/10.3200/MONO.131.4.285-358","paperID":"None"},{"content":"David W Johnson and Roger T Johnson. 2011. Intellectual Legacy: Cooperation and Competition. In Conflict, Interdependence, and Justice. Springer, 41--63. DOI: http://dx.doi.org/10.1007/978-1-4419-9994-8_3","paperID":"None"},{"content":"David W Johnson, Roger T Johnson, and Linda Scott. 1978. The effects of cooperative and individualized instruction on student attitudes and achievement. The Journal of Social Psychology 104, 2 (1978), 207--216. DOI: http://dx.doi.org/10.1080/00224545.1978.9924062","paperID":"None"},{"content":"Steven J. Karau and Kipling D. Williams. 1993. Social Loafing: A Meta-Analytic Review and Theoretical Integration. Interpersonal Relations and Group Processes 65, 4 (1993), 681--706. DOI: http://dx.doi.org/10.1037/0022-3514.65.4.681","paperID":"None"},{"content":"Taemie Kim, Agnes Chang, Lindsey Holland, and Alex Sandy Pentland. 2008. Meeting Mediator: Enhancing Group Collaborationusing Sociometric Feedback. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, New York, NY, USA, 457--466. DOI: http://dx.doi.org/10.1145/1460563.1460636","paperID":"None"},{"content":"Julius Bernard Maller. 1972. Coöperation and competition: an experimental study in motivation. Bureau of Publications, Teachers College, Columbia University.","paperID":"None"},{"content":"Roberto Martinez, Judy Kay, James R Wallace, and Kalina Yacef. 2011. Modelling symmetry of activity as an indicator of collocated group collaboration. In User Modeling, Adaption and Personalization. Springer, 207--218. DOI: http://dx.doi.org/10.1007/978--3--642--22362--4_18","paperID":"None"},{"content":"Mark A. May and Leonard W. Doob. 1937. Competition and Cooperation. Vol. 25. Social Science Research Council Bulletin.","paperID":"None"},{"content":"David M. Messick and Marilynn Brewer. 1983. Solving social dilemmas: A review. Review of personality and social psychology 2 (1983), 11--14.","paperID":"None"},{"content":"Alex F Osborn. 1953. Applied imagination. Scribner's.","paperID":"None"},{"content":"Jose Pinheiro, Douglas Bates, Saikat DebRoy, Deepayan Sarkar, and R Core Team. 2015. nlme: Linear and Nonlinear Mixed Effects Models. http://CRAN.R-project.org/package=nlme R package version 3.1--120.","paperID":"None"},{"content":"Gianluca Schiavo, Alessandro Cappelletti, Eleonora Mencarini, Oliviero Stock, and Massimo Zancanaro. 2014. Overt or Subtle? Supporting Group Conversations with Automatically Targeted Directives. In Proceedings of the 19th International Conference on Intelligent User Interfaces (IUI '14). ACM, New York, NY, USA, 225--234. DOI: http://dx.doi.org/10.1145/2557500.2557507","paperID":"None"},{"content":"Carolyn W Sherif. 1976. The social context of competition. Joy and sadness in children's sports (1976), 81--97.","paperID":"None"},{"content":"Sara Streng, Karsten Stegmann, Heinrich Hußmann, and Frank Fischer. 2009. Metaphor or diagram?: comparing different representations for group mirrors. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7. ACM, 249--256. DOI:http://dx.doi.org/10.1145/1738826.1738866","paperID":"None"},{"content":"Janienke Sturm, Olga Houben-van Herwijnen, Anke Eyck, and Jacques Terken. 2007. Influencing Social Dynamics in Meetings Through a Peripheral Display. In Proceedings of the 9th International Conference on Multimodal Interfaces (ICMI '07). ACM, New York, NY, USA, 263--270. DOI: http://dx.doi.org/10.1145/1322192.1322238","paperID":"None"},{"content":"Sarah Tausch, Doris Hausen, Ismail Kosan, Andrey Raltchev, and Heinrich Hussmann. 2014. Groupgarden: Supporting Brainstorming Through a Metaphorical Group Mirror on Table or Wall. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, New York, NY, USA, 541--550. DOI: http://dx.doi.org/10.1145/2639189.2639215","paperID":"None"},{"content":"Suzanne P Weisband, Sherry K Schneider, and Terry Connolly. 1995. Computer-mediated communication and social information: Status salience and status differences. Academy of management journal 38, 4 (1995), 1124--1151. DOI: http://dx.doi.org/10.2307/256623","paperID":"None"}],"title":"A Comparison of Cooperative and Competitive Visualizations for Co-located Collaboration","filename":"CHI16/p5034","authors":["Sarah Tausch","Stephanie Ta","Heinrich Hussmann"],"conference":"CHI '16"}