{"paperId":2858501,"abstract":"The asynchronous nature of communications on social network sites creates a unique opportunity for studying how posting content interacts with individuals' engagement. This study focuses on the behavioral changes occurring hours before and after contribution to better understand the changing needs and preferences of contributors. Using observational data analysis of individuals' activity on Facebook, we test hypotheses regarding the motivations for site visits, changes in the distribution of attention to content, and shifts in decisions to interact with others. We find that after posting content people are intrinsically motivated to visit the site more often, are more attentive to content from friends (but not others), and choose to interact more with friends (in large part due to reciprocity). In addition, contributors are more active on the site hours before posting and remain more active for less than a day afterwards. Our study identifies a unique pattern of engagement that accompanies contribution and can inform the design of social network sites to better support contributors.","citation":[],"reference":[{"content":"Albert Bandura. 1977. Social learning theory. NY: General Learning Press (1977).","paperID":"None"},{"content":"Carl W. Beckman and Paul F. Secord. 1959. The effect of perceived liking on interpersonal attraction. Human Relations (1959).","paperID":"None"},{"content":"danah m. boyd and Nicole B. Ellison. 2007. Social Network Sites: Definition, History, and Scholarship. Journal of Computer-Mediated Communication 13, 1 (2007), 210--230.","paperID":"None"},{"content":"Moira Burke and Robert E. Kraut. 2014. Growing Closer on Facebook: Changes in Tie Strength Through Social Network Site Use. In proceedings of the 32nd international conference on human factors in computing systems (CHI '14).","paperID":"None"},{"content":"Moira Burke, Cameron Marlow, and Thomas Lento. 2009. Feed me: motivating newcomer contribution in social network sites. In proceedings of the 27th international conference on human factors in computing systems (CHI '09).","paperID":"None"},{"content":"Jaclyn Cameron and Nick Geidner. 2014. Something old, something new, something borrowed from something blue: Experiments on dual viewing TV and Twitter. Journal of Broadcasting & Electronic Media 58, 3 (2014), 400--419.","paperID":"None"},{"content":"Justin Cheng, Cristian Danescu-Niculescu-Mizil, and Jure Leskovec. 2014. How Community Feedback Shapes User Behavior. In Proceedings of the 8th international conference on weblogs and social media (ICWSM '14).","paperID":"None"},{"content":"Coye Cheshire and Judd Antin. 2008. The social psychological effects of feedback on the production of Internet information pools. Journal of Computer-Mediated Communication 13, 3 (2008), 705--727.","paperID":"None"},{"content":"Marvin M. Chun, Julie D. Golomb, and Nicholas B. Turk-Browne. 2011. A taxonomy of external and internal attention. Annual review of psychology 62 (2011), 73--101.","paperID":"None"},{"content":"Utpal M. Dholakia, Richard P. Bagozzi, and Lisa K. Pearo. 2004. A social influence model of consumer participation in network-and small-group-based virtual communities. International journal of research in marketing 21, 3 (2004), 241--263.","paperID":"None"},{"content":"Thomas J. DiCiccio and Bradley Efron. 1996. Bootstrap confidence intervals. Statistical science (1996), 189--212.","paperID":"None"},{"content":"James A. Easterbrook. 1959. The effect of emotion on cue utilization and the organization of behavior. Psychological review 66, 3 (1959), 183--201.","paperID":"None"},{"content":"Jonathan St. B.T. Evans. 2008. Dual-processing accounts of reasoning, judgment, and social cognition. Annual Review of Psychology 59 (2008), 255--278.","paperID":"None"},{"content":"Hans J. Eysenck. The biological basis of personality. Charles C. Thomas, Publisher, Chapter Activation, Arousal, and Emotion, 227--263.","paperID":"None"},{"content":"Valerie S. Folkes and David O. Sears. 1977. Does everybody like a liker? Journal of Experimental Social Psychology 13, 6 (1977), 505--519.","paperID":"None"},{"content":"Mark S. Granovetter. 1973. The strength of weak ties. American journal of sociology (1973), 1360--1380.","paperID":"None"},{"content":"J. Brian Houston, Joshua Hawthorne, Matthew L. Spialek, Molly Greenwood, and Mitchell S. McKinney. 2013. Tweeting during presidential debates: Effect on candidate evaluations and debate attitudes. Argumentation and Advocacy 49, 4 (2013), 301.","paperID":"None"},{"content":"David J. Hughes, Moss Rowe, Mark Batey, and Andrew Lee. 2012. A tale of two sites: Twitter vs. Facebook and the personality predictors of social media usage. Computers in Human Behavior 28, 2 (2012), 561--569.","paperID":"None"},{"content":"Adam N. Joinson. 2008. Looking at, looking up or keeping up with people?: motives and use of facebook. In proceedings of the 26th international conference on human factors in computing systems (CHI '08).","paperID":"None"},{"content":"Funda Kivran-Swaine, Samuel Brody, and Mor Naaman. 2013. Effects of gender and tie strength on Twitter interactions. First Monday 18, 9 (2013).","paperID":"None"},{"content":"Cliff Lampe and Erik Johnston. 2005. Follow the (slash) dot: effects of feedback on new members in an online community. In Proceedings of the 13th international conference on supporting group work (GROUP '05).","paperID":"None"},{"content":"Cliff Lampe, Rick Wash, Alcides Velasquez, and Elif Ozkaya. 2010. Motivations to participate in online communities. In proceedings of the 28th international conference on human factors in computing systems (CHI '10).","paperID":"None"},{"content":"Randy J. Larsen and David M. Buss. 2002. Personality psychology: domains of knowledge about human behavior. (2002).","paperID":"None"},{"content":"Claude Lévi-Strauss. 1969. The elementary structures of kinship. Beacon Press.","paperID":"None"},{"content":"Nan Lin. 1999. Building a network theory of social capital. Connections 22, 1 (1999), 28--51.","paperID":"None"},{"content":"Elizabeth F. Loftus, Geoffrey R. Loftus, and Jane Messo. 1987. Some facts about \"weapon focus\". Law and Human Behavior 11, 1 (1987), 55.","paperID":"None"},{"content":"Misa T. Maruyama, Scott P. Robertson, Sara K. Douglas, Bryan C. Semaan, and Heather A. Faucett. 2014. Hybrid media consumption: How tweeting during a televised political debate influences the vote decision. In Proceedings of the 17th conference on computer supported cooperative work (CSCW '14).","paperID":"None"},{"content":"Mor Naaman, Jeffrey Boase, and Chih-Hui Lai. 2010. Is it really about me?: message content in social awareness streams. In Proceedings of the 13th conference on computer supported cooperative work (CSCW '10).","paperID":"None"},{"content":"Oded Nov. 2006. What motivates wikipedians' Communication of the ACM 50, 11 (2006), 60--64.","paperID":"None"},{"content":"Zizi Papacharissi and Andrew Mendelson. 2011. Toward a new (er) sociability: uses, gratifications and social capital on Facebook. In Media perspectives for the 21st century, Stylianos Papathanassopoulos (Ed.). Routledge, NY, 212--230.","paperID":"None"},{"content":"Jennifer Preece and Ben Shneiderman. 2009. The reader-to-leader framework: Motivating technology-mediated social participation. AIS Transactions on Human-Computer Interaction 1, 1 (2009), 13--32.","paperID":"None"},{"content":"Sheizaf Rafaeli, Tsahi Hayat, and Yaron Ariel. 2009. Knowledge building and motivations in Wikipedia: participation as \"Ba\". Cyberculture and new media (2009), 51--68.","paperID":"None"},{"content":"Marshall D. Sahlins and Michael Banton. 1965. On the Sociology of Primitive Exchange in The Relevance of Models for Social Anthropology. (1965).","paperID":"None"},{"content":"Tali Sharot and Elizabeth A. Phelps. 2004. How arousal modulates memory: disentangling the effects of attention and retention. Cognitive, Affective, & Behavioral Neuroscience 4, 3 (2004), 294--306.","paperID":"None"},{"content":"J. Sidney Shrauger and Stephen C. Jones. 1968. Social validation and interpersonal evaluations. Journal of Experimental Social Psychology 4, 3 (1968), 315--323.","paperID":"None"},{"content":"Dalmas A. Taylor and Irwin Altman. 1987. Communication in interpersonal relationships: social penetration processes. (1987).","paperID":"None"},{"content":"Joseph B. Walther. 1996. Computer-Mediated Communication: Impersonal, Interpersonal, and Hyperpersonal Interaction. Communication Research 23, 1 (1996), 3--43.","paperID":"None"},{"content":"Robert M. Yerkes and John D. Dodson. 1908. The relation of strength of stimulus to rapidity of habit-formation. Journal of comparative neurology and psychology 18, 5 (1908), 459--482.","paperID":"None"}],"title":"Changes in Engagement Before and After Posting to Facebook","filename":"CHI16/p564","authors":["Nir Grinberg","P. Alex Dow","Lada A. Adamic","Mor Naaman"],"conference":"CHI '16"}