{"paperId":2858200,"citation":[],"reference":[{"content":"Nor Azah Abdul Aziz, Firat Batmaz, Roger Stone, and Paul Wai Hing Chung. 2013. Selection of touch gestures for children's applications. Science and Information Conference (SAI), 2013, 721--726.","paperID":"None"},{"content":"Lisa Anthony, Quincy Brown, Jaye Nias, Berthel Tate, and Shreya Mohan. 2012. Interaction and Recognition Challenges in Interpreting Children's Touch and Gesture Input on Mobile Devices. Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces, ACM Press, 225--234. http://doi.org/10.1145/2396636.2396671","paperID":"None"},{"content":"Lisa Anthony, Quincy Brown, Jaye Nias, and Berthel Tate. 2013. Examining the need for visual feedback during gesture interaction on mobile touchscreen devices for kids. Proceedings of the International Conference on Interaction Design and Children, ACM Press, 157--164. http://doi.org/10.1145/2485760.2485775","paperID":"None"},{"content":"Lisa Anthony, Quincy Brown, Berthel Tate, Jaye Nias, Robin Brewer, and Germaine Irwin. 2014. Designing smarter touch-based interfaces for educational contexts. Personal and Ubiquitous Computing 18, 6, 1471--1483. http://doi.org/10.1007/s00779-013-0749--9","paperID":"None"},{"content":"Lisa Anthony and Jacob O. Wobbrock. 2010. A lightweight multistroke recognizer for user interface prototypes. Proceedings of Graphics Interface, Canadian Information Processing Society, 245--252.","paperID":"None"},{"content":"Lisa Anthony and Jacob O. Wobbrock. 2012. $Nprotractor: a fast and accurate multistroke recognizer. Proceedings of Graphics Interface, 117--120.","paperID":"None"},{"content":"Ahmed Sabbir Arif and Cristina Sylla. 2013. A comparative evaluation of touch and pen gestures for adult and child users. Proceedings of the International Conference on Interaction Design and Children, ACM Press, 392--395. http://doi.org/10.1145/2485760.2485804","paperID":"None"},{"content":"Keith E. Beery, Norman A. Buktenica, and Natasha A. Beery. 2004. The Beery-Buktenica Developmental Test of Visual-Motor Integration, 5th Edition. Modern Curriculum Press, NJ.","paperID":"None"},{"content":"Robin Brewer, Lisa Anthony, Quincy Brown, Germaine Irwin, Jaye Nias, and Berthel Tate. 2013. Using gamification to motivate children to complete empirical studies in lab environments. Proceedings of the International Conference on Interaction Design and Children, ACM Press, 388--391. http://doi.org/10.1145/2485760.2485816","paperID":"None"},{"content":"Quincy Brown, Lisa Anthony, Robin Brewer, Germaine Irwin, Jaye Nias, and Berthel Tate. 2013. Challenges of Replicating Empirical Studies with Children in HCI. Proceedings of the CHI2013 Workshop on the Replication of HCI Research, CEUR Workshop Proceedings, 53--57.","paperID":"None"},{"content":"Quincy Brown, Lisa Anthony, Jaye Nias, Berthel Tate, Robin Brewer, and Germaine Irwin. 2013. Towards Designing Adaptive Touch-Based Interfaces. Proceedings of the ACM SIGCHI 2013 Third Mobile Accessibility Workshop, 4pp.","paperID":"None"},{"content":"Quincy Brown and Lisa Anthony. 2012. Toward comparing the touchscreen interaction patterns of kids and adults. Proceedings of the SIGCHI Workshop on Educational Software, Interfaces and Technology, 4pp.","paperID":"None"},{"content":"Cynthia Chiong and Carly Shuler. 2010. Learning: Is there an app for that? Investigations of young children's usage and learning with mobile devices and apps. The Joan Ganz Cooney Center at Sesame Workshop, NY, NY. Retrieved August 23, 2012 from http://dmlcentral.net/resources/4496","paperID":"None"},{"content":"Andy Cockburn, David Ahlström, and Carl Gutwin. 2012. Understanding performance in touch selections: Tap, drag and radial pointing drag with finger, stylus and mouse. International Journal of Human-Computer Studies 70, 3, 218--233. http://doi.org/10.1016/j.ijhcs.2011.11.002","paperID":"None"},{"content":"Nick Donnelly, Kyle Cave, Rebecca Greenway, Julie A Hadwin, Jim Stevenson, and Edmund Sonuga-Barke. 2007. Visual search in children and adults: top-down and bottom-up mechanisms. Quarterly Journal of Experimental Psychology 60, 1, 120--36. http://doi.org/10.1080/17470210600625362","paperID":"None"},{"content":"Henry Gleitman, James Gross, and Daniel Rossberg. 2010. Psychology. W. W. Norton & Company.","paperID":"None"},{"content":"Tracy Anne Hammond and Brandon Paulson. 2011. Recognizing sketched multistroke primitives. ACM Transactions on Interactive Intelligent Systems 1, 1, 1--34. http://doi.org/10.1145/2030365.2030369","paperID":"None"},{"content":"Amanda Harris, Jochen Rick, Victoria Bonnett, Nicola Yuill, Rowanne Fleck, Paul Marshall, and Yvonne Rogers. 2009. Around the table: Are multiple-touch surfaces better than single-touch for children's collaborative interactions? Proceedings of the International Conference on Computer Supported Collaborative Learning, International Society of the Learning Sciences, 335--344. http://doi.org/10.3115/1600053.1600104","paperID":"None"},{"content":"James Herold and Thomas F. Stahovich. 2012. The 1 Recognizer: a fast, accurate, and easy-to-implement handwritten gesture recognition technique. Proceedings of the International Symposium on SketchBased Interfaces and Modeling, Eurographics Association, 39--46. http://doi.org/10.2312/SBM/SBM12/039-046","paperID":"None"},{"content":"Alexis Hiniker, Kiley Sobel, Sungsoo Ray Hong, Hyewon Suh, India Irish, Daniella Kim, and Julie A. Kientz. 2015. Touchscreen prompts for preschoolers. Proceedings of the International Conference on Interaction Design and Children, ACM Press, 109--118. http://doi.org/10.1145/2771839.2771851","paperID":"None"},{"content":"Uta Hinrichs and Sheelagh Carpendale. 2011. Gestures in the wild: studying multi-touch gesture sequences on interactive tabletop exhibits. Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, ACM Press, 3023--3032. http://doi.org/10.1145/1978942.1979391","paperID":"None"},{"content":"L.B. Kara and Thomas F. Stahovich. 2005. An imagebased, trainable symbol recognizer for hand-drawn sketches. Computers & Graphics 29, 4, 501--517. http://doi.org/10.1016/j.cag.2005.05.004","paperID":"None"},{"content":"Hong-hoe Kim, Paul Taele, Stephanie Valentine, Erin McTigue, and Tracy Hammond. 2013. KimCHI: a sketch-based developmental skill classifier to enhance pen-driven educational interfaces for children. Proceedings of the International Symposium on SketchBased Interfaces and Modeling, ACM Press, 33--42. http://doi.org/10.1145/2487381.2487389","paperID":"None"},{"content":"Mary J. LaLomia. 1994. User acceptance of handwritten recognition accuracy. Extended Abstracts of the ACM SIGCHI Conference on Human Factors in Computing Systems, ACM, 107--108. http://doi.org/10.1145/259963.260086","paperID":"None"},{"content":"WeeSan Lee, Levent Burak Kara, and Thomas F. Stahovich. 2007. An efficient graph-based recognizer for hand-drawn symbols. Computers & Graphics 31, 4, 554--567. http://doi.org/10.1016/j.cag.2007.04.007","paperID":"None"},{"content":"Yang Li. 2010. Protractor: a fast and accurate gesture recognizer. Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, ACM, 2169--2172. http://doi.org/10.1145/1753326.1753654","paperID":"None"},{"content":"Viktor Lowenfeld and W. Lambert Brittain. 1982. Creative and Mental Growth. MacMillan, NY, NY, USA.","paperID":"None"},{"content":"Lorna McKnight and Brendan Cassidy. 2010. Children's Interaction with Mobile Touch-Screen Devices. International Journal of Mobile Human Computer Interaction 2, 2, 18 pp. http://doi.org/10.4018/jmhci.2010040101","paperID":"None"},{"content":"Lorna Mcknight and Daniel Fitton. 2010. Touch-screen Technology for Children?: Giving the Right Instructions and Getting the Right Responses. Proceedings of the International Conference on Interaction Design and Children, ACM Press, 238--241. http://doi.org/10.1145/1810543.1810580","paperID":"None"},{"content":"Ian Christopher McManus. 2009. The history and geography of human handedness. In Language lateralization and psychosis (1st ed.), Iris E. C. Sommer and Reneé S. Kahn (eds.). Cambridge University Press, 37--58.","paperID":"None"},{"content":"Vicente Nacher, Javier Jaen, Elena Navarro, Alejandro Catala, and Pascual González. 2015. Multi-touch gestures for pre-kindergarten children. International Journal of Human-Computer Studies 73, 37--51. http://doi.org/10.1016/j.ijhcs.2014.08.004","paperID":"None"},{"content":"Cathleen Norris and Elliot Soloway. 2004. Envisioning the handheld-centric classroom. Journal of Educational Computing Research 30, 4, 281--294. http://doi.org/10.2190/MBPJ-L35D-C4K6-AQB8","paperID":"None"},{"content":"Pekka Parhi, Amy K. Karlson, and Benjamin B. Bederson. 2006. Target size study for one-handed thumb use on small touchscreen devices. Proceedings of the International Conference on Human Computer Interaction with Mobile Devices and Services, ACM Press, 203--210. http://doi.org/10.1145/1152215.1152260","paperID":"None"},{"content":"Jean Piaget. 1983. Piaget's Theory. In Handbook of Child Psychology, P Mussen (ed.). Wiley & Sons, NY, NY, USA.","paperID":"None"},{"content":"Janet C. Read, Stuart MacFarlane, and Chris Casey. 2003. \"Good enough for what\"?: acceptance of handwriting recognition errors by child users. Proceedings of the International Conference on Interaction Design and Children, ACM, 155--155. http://doi.org/10.1145/953536.953565","paperID":"None"},{"content":"Glenda L. Revelle and Emily Reardon. 2009. Designing and testing mobile interfaces for children. Proceedings of the International Conference on Interaction Design and Children, ACM Press, 329--332. http://doi.org/10.1145/1551788.1551876","paperID":"None"},{"content":"Shyam Reyal, Shumin Zhai, and Per Ola Kristensson. 2015. Performance and User Experience of Touchscreen and Gesture Keyboards in a Lab Setting and in the Wild. Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, ACM Press, 679--688. http://doi.org/10.1145/2702123.2702597","paperID":"None"},{"content":"Geoff Romeo, Suzy Edwards, S. McNamara, Ian Walker, and Christopher Ziguras. 2003. Touching the screen: Issues related to the use of touchscreen technology in early childhood education. British Journal of Educational Technology 34, 3, 329--339. http://doi.org/10.1111/1467--8535.00330","paperID":"None"},{"content":"Dean Rubine. 1991. Specifying gestures by example. SIGGRAPH Computer Graphics 25, 4, 329--337. http://doi.org/10.1145/127719.122753","paperID":"None"},{"content":"Kathy Ryall, Meredith Ringel Morris, Katherine Everitt, Clifton Forlines, and Chia Shen. 2006. Experiences with and observations of direct-touch tabletops. Proceedings of the IEEE International Workshop on Horizontal Interactive Human-Computer Systems, IEEE, 8pp. http://doi.org/10.1109/TABLETOP.2006.12","paperID":"None"},{"content":"Tevfik Metin Sezgin and Randall Davis. 2005. HMMbased efficient sketch recognition. Proceedings of the International Conference on Intelligent User Interfaces, ACM Press, 281--283. http://doi.org/10.1145/1040830.1040899","paperID":"None"},{"content":"Mike Sharples, Inmaculada Amedillo Sanchez, Marcelo Milrad, and Giasemi Vavoula. 2009. Mobile learning: small devices, big issues. In Technology Enhanced Learning: Principles and Products, N. Balacheff, S. Ludvigsen, T. de Jong and S. Barnes (eds.). Springer, Heidelberg, 233--249.","paperID":"None"},{"content":"Carly Shuler. 2009. Pockets of Potential: Using Mobile Technologies to Promote Children's Learning. Joan Ganz Cooney Center at Sesame Workshop, NY, NY. Retrieved August 23, 2012 from http://www.joanganzcooneycenter.org/publication/indu stry-brief-pockets-of-potential-using-mobiletechnologies-to-promote-childrens-learning/","paperID":"None"},{"content":"Jerry R. Thomas. 1980. Acquisition of motor skills: information processing differences between children and adults. Research quarterly for exercise and sport 51, 1, 158--173. http://doi.org/10.1080/02701367.1980.10609281","paperID":"None"},{"content":"Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2012. Gestures as point clouds: a $P recognizer for user interface prototypes. Proceedings of the ACM International Conference on Multimodal Interaction, ACM Press, 273--280. http://doi.org/10.1145/2388676.2388732","paperID":"None"},{"content":"Radu-Daniel Vatavu, Gabriel Cramariuc, and Doina Maria Schipor. 2015. Touch interaction for children aged 3 to 6 years: Experimental findings and relationship to motor skills. International Journal of Human-Computer Studies 74, 54--76. http://doi.org/10.1016/j.ijhcs.2014.10.007","paperID":"None"},{"content":"Radu-Daniel Vatavu, Daniel Vogel, Géry Casiez, and Laurent Grisoni. 2011. Estimating the perceived difficulty of pen gestures. Proceedings of the IFIP TC13 Conference on Human-Computer Interaction, Springer, 89--106. http://doi.org/10.1007/978--3--64223771--3_9","paperID":"None"},{"content":"Daniel Vogel and Ravin Balakrishnan. 2010. Direct Pen Interaction with a Conventional Graphical User Interface. Human-Computer Interaction 25, 4, 324--388. http://doi.org/10.1080/07370024.2010.499839","paperID":"None"},{"content":"Jacob O. Wobbrock, Htet Htet Aung, Brandon Rothrock, and Brad A. Myers. 2005. Maximizing the guessability of symbolic input. Extended Abstracts of the ACM SIGCHI Conference on Human Factors in Computing Systems, ACM, 1869--1872. http://doi.org/10.1145/1056808.1057043","paperID":"None"},{"content":"Jacob O. Wobbrock, Andrew D. Wilson, and Yang Li. 2007. Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes. Proceedings of the ACM Symposium on User Interface Software and Technology, ACM, 159--168. http://doi.org/10.1145/1294211.1294238","paperID":"None"}],"abstract":"Most touchscreen devices are not designed specifically with children in mind, and their interfaces often do not optimize interaction for children. Prior work on children and touchscreen interaction has found important patterns, but has only focused on simplified, isolated interactions, whereas most interfaces are more visually complex. We examine how interface complexity might impact children's touchscreen interactions. We collected touch and gesture data from 30 adults and 30 children (ages 5 to 10) to look for similarities, differences, and effects of interface complexity. Interface complexity affected some touch interactions, primarily related to visual salience, and it did not affect gesture recognition. We also report general differences between children and adults. We provide design recommendations that support the design of touchscreen interfaces specifically tailored towards children of this age.","title":"Characterizing How Interface Complexity Affects Children's Touchscreen Interactions","filename":"CHI16/p1921","authors":["Julia Woodward","Alex Shaw","Annie Luc","Brittany Craig","Juthika Das","Phillip Hall, Jr.","Akshay Holla","Germaine Irwin","Danielle Sikich","Quincy Brown","Lisa Anthony"],"conference":"CHI '16"}