{"paperId":2858239,"citation":[],"reference":[{"content":"Harshit Agrawal, Rishika Jain, Prabhat Kumar, and Pradeep Yammiyavar. 2014. FabCode: Visual Programming Environment for Digital Fabrication. In Proceedings of the 2014 Conference on Interaction Design and Children (IDC '14). ACM, NY, NY, USA, 353--356. DOI: http://dx.doi.org/10.1145/2593968.2610490","paperID":"None"},{"content":"Dominik Aufderheide, Werner Krybus, and Ulf Witkowski. 2012. Experiences with LEGO MINDSTORMS as an Embedded and Robotics Plattform within the Undergraduate Curriculum. In Advances in Autonomous Robotics, Guido Herrmann, Matthew Studley, Martin Pearson, Andrew Conn, Chris Melhuish, Mark Witkowski, Jong-Hwan Kim, and Prahlad Vadakkepat (Eds.). Lecture Notes in Computer Science, Vol. 7429. Springer Berlin Heidelberg, 185--196. DOI: http://dx.doi.org/10.1007/978--3--642--32527--4_17","paperID":"None"},{"content":"Maurice Balme and James Morwood. 1997. Oxford latin course. Part II. Oxford University Press Oxford.","paperID":"None"},{"content":"Albert Bandura. 1977. Self-efficacy: toward a unifying theory of behavioral change. Psychological review 84, 2 (1977), 191.","paperID":"None"},{"content":"David Bau. 2015. Droplet, a Blocks-based Editor for Text Code. J. Comput. Sci. Coll. 30, 6 (June 2015), 138--144. http: //dl.acm.org/citation.cfm?id=2753024.2753052","paperID":"None"},{"content":"David Bau, D. Anthony Bau, Mathew Dawson, and C. Sydney Pickens. 2015. Pencil Code: Block Code for a Text World. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC '15). ACM, NY, NY, USA, 445--448. DOI: http://dx.doi.org/10.1145/2771839.2771875","paperID":"None"},{"content":"Paolo Bottoni and Miguel Ceriani. 2015. Linked Data Queries As Jigsaw Puzzles: A Visual Interface for SPARQL Based on Blockly Library. In Proceedings of the 11th Biannual Conference on Italian SIGCHI Chapter (CHItaly 2015). ACM, NY, NY, USA, 86--89. DOI: http://dx.doi.org/10.1145/2808435.2808467","paperID":"None"},{"content":"Carrie J. Cai, Philip J. Guo, James R. Glass, and Robert C. Miller. 2015. Wait-Learning: Leveraging Wait Time for Second Language Education. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3701--3710. DOI: http://dx.doi.org/10.1145/2702123.2702267","paperID":"None"},{"content":"Robert M Carini, George D Kuh, and Stephen P Klein. 2006. Student engagement and student learning: Testing the linkages*. Research in higher education 47, 1 (2006), 1--32.","paperID":"None"},{"content":"Catrobat. 2015. Pocket Code. https://share.catrob.at/pocketcode. (2015).","paperID":"None"},{"content":"Yung-Ju Chang, Lezhong Li, Shih-Hsuan Chou, Min-Chih Liu, and Surong Ruan. 2013. Xpress: Crowdsourcing Native Speakers to Learn Colloquial Expressions in a Second Language. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 2555--2560. DOI:http://dx.doi.org/10.1145/2468356.2468829","paperID":"None"},{"content":"Edith Frances Claffin. 1943. Teaching the Art of Reading Latin. Classical Journal (1943), 130--136.","paperID":"None"},{"content":"Thomas M Connolly, Elizabeth A Boyle, Ewan MacArthur, Thomas Hainey, and James M Boyle. 2012. A systematic literature review of empirical evidence on computer games and serious games. Computers & Education 59, 2 (2012), 661--686.","paperID":"None"},{"content":"Stephen Cooper. 2010. The Design of Alice. Trans. Comput. Educ. 10, 4, Article 15 (Nov. 2010), 16 pages. DOI:http://dx.doi.org/10.1145/1868358.1868362","paperID":"None"},{"content":"S Erhel and E Jamet. 2013. Digital game-based learning: Impact of instructions and feedback on motivation and learning effectiveness. Computers & Education 67 (2013), 156--167.","paperID":"None"},{"content":"Google. 2015. Google Blockly. https://developers.google.com/blockly. (2015).","paperID":"None"},{"content":"Lindsay Grace, Martha Castaneda, and Jeannie Ducher. 2012. User Testing of a Language Learning Game for Mandarin Chinese. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, NY, NY, USA, 865--868. DOI: http://dx.doi.org/10.1145/2212776.2212859","paperID":"None"},{"content":"John Gruber-Miller, American Philological Association, and others. 2006. When dead tongues speak: Teaching beginning Greek and Latin. Oxford University Press.","paperID":"None"},{"content":"Mark Guzdial. 2008. Education Paving the way for computational thinking. Commun. ACM 51, 8 (2008), 25--27.","paperID":"None"},{"content":"William Gardner Hale. 1887. The Art of Reading Latin: How to Teach It. Ginn & Company.","paperID":"None"},{"content":"Cheng-Hsien Han, Chi-Lan Yang, and Hao-Chuan Wang. 2014. Supporting Second Language Reading with Picture Note-taking. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 2245--2250. DOI: http://dx.doi.org/10.1145/2559206.2581204","paperID":"None"},{"content":"Brian Harvey, Daniel D. Garcia, Tiffany Barnes, Nathaniel Titterton, Daniel Armendariz, Luke Segars, Eugene Lemon, Sean Morris, and Josh Paley. 2013. SNAP! (Build Your Own Blocks) (Abstract Only). In Proceeding of the 44th ACM Technical Symposium on Computer Science Education (SIGCSE '13). ACM, NY, NY, USA, 759--759. DOI: http://dx.doi.org/10.1145/2445196.2445507","paperID":"None"},{"content":"Brian Harvey and Jens Monig. 2010. Bringing \"No ceiling\" to scratch: can one language serve kids and computer scientists. Proc. Constructionism (2010).","paperID":"None"},{"content":"S. Holm. 1979. A simple sequentially rejective multiple test procedure. Scandinavian Journal of Statistics 6, 65--70 (1979), 1979.","paperID":"None"},{"content":"Hopscotch. 2015. Hopscotch. https://www.gethopscotch.com. (2015).","paperID":"None"},{"content":"E Hutchins, J Hollan, and D Norman. 1985. Direct manipulation interfaces. Human-Computer Interaction (1985).","paperID":"None"},{"content":"Eleanor Huzar. 1957. Structural Linguistics and Latin Teaching. Classical Journal (1957), 268--274.","paperID":"None"},{"content":"Charles Jenney, Rogers V Scudder, and Eric C Baade. 1987. Jenney's First Year Latin. Allyn and Bacon.","paperID":"None"},{"content":"James F Johnson. 1987. Alternative Approaches for the College Elementary Latin Sequence. Classical Journal (1987), 246--255.","paperID":"None"},{"content":"Caitlin Kelleher, Randy Pausch, and Sara Kiesler. 2007. Storytelling Alice Motivates Middle School Girls to Learn Computer Programming. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 1455--1464. DOI: http://dx.doi.org/10.1145/1240624.1240844","paperID":"None"},{"content":"Glenn M Knudsvig. 1986. Latin for Reading: A Beginner's Textbook with Exercises. University of Michigan Press.","paperID":"None"},{"content":"Geza Kovacs. 2013. Smart Subtitles for Language Learning. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 2719--2724. DOI: http://dx.doi.org/10.1145/2468356.2479499","paperID":"None"},{"content":"Jerry Lee Jr and others. 2009. Scratch programming for teens. Cengage Learning.","paperID":"None"},{"content":"Sorin Lerner, Stephen R. Foster, and William G. Griswold. 2015. Polymorphic Blocks: Formalism-Inspired UI for Structured Connectors. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3063--3072. DOI: http://dx.doi.org/10.1145/2702123.2702302","paperID":"None"},{"content":"Bob Lister. 2009. Latin in transition. Arts and Humanities in Higher Education 8, 2 (2009), 191--200.","paperID":"None"},{"content":"Jiangjiang Liu, Cheng-Hsien Lin, Joshua Wilson, David Hemmenway, Ethan Hasson, Zebulun Barnett, and Yingbo Xu. 2014. Making Games a \"Snap\" with Stencyl: A Summer Computing Workshop for K-12 Teachers. In Proceedings of the 45th ACM Technical Symposium on Computer Science Education (SIGCSE '14). ACM, NY, NY, USA, 169--174. DOI: http://dx.doi.org/10.1145/2538862.2538978","paperID":"None"},{"content":"David J Malan and Henry H Leitner. 2007. Scratch for budding computer scientists. In ACM SIGCSE Bulletin, Vol. 39. ACM, 223--227.","paperID":"None"},{"content":"John Maloney, Mitchel Resnick, Natalie Rusk, Brian Silverman, and Evelyn Eastmond. 2010. The scratch programming language and environment. ACM Transactions on Computing Education (TOCE) 10, 4 (2010), 16.","paperID":"None"},{"content":"John H Maloney, Kylie Peppler, Yasmin Kafai, Mitchel Resnick, and Natalie Rusk. 2008. Programming by choice: urban youth learning programming with scratch. ACM SIGCSE Bulletin 40, 1 (2008), 367--371.","paperID":"None"},{"content":"Donka D Markus and Deborah Pennell Ross. 2004. Reading Proficiency in latin through expectations and visualization. Classical world 98, 1 (2004), 79--93.","paperID":"None"},{"content":"Daniel V McCaffrey. 2006. Reading Latin Efficiently and the Need for Cognitive Strategies. When Dead Tongues Speak: Teaching Beginning Greek and Latin: Teaching Beginning Greek and Latin 6 (2006), 113.","paperID":"None"},{"content":"Barry McLaughlin. 1990. Restructuring. Applied Linguistics 11, 2 (1990), 113--128. DOI: http://dx.doi.org/10.1093/applin/11.2.113","paperID":"None"},{"content":"Mitchel Resnick. 2007. All I really need to know (about creative thinking) I learned (by studying how children learn) in kindergarten. In Proceedings of the 6th ACM SIGCHI conference on Creativity & cognition. ACM, 1--6.","paperID":"None"},{"content":"Mitchel Resnick, John Maloney, Andres Monroy-Hernandez, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and others. 2009. Scratch: programming for all. Commun. ACM 52, 11 (2009), 60--67.","paperID":"None"},{"content":"Timothy Rodgers. 2008. Student engagement in the e-learning process and the impact on their grades. International Journal of Cyber Society and Education 1, 2 (2008), 143--156.","paperID":"None"},{"content":"Timothy Rodgers and Deb Ghosh. 2001. Measuring the determinants of quality in UK higher education: a multinomial logit approach. Quality Assurance in Education 9, 3 (2001), 121--126.","paperID":"None"},{"content":"Krishnendu Roy. 2012. App Inventor for Android: Report from a Summer Camp. In Proceedings of the 43rd ACM Technical Symposium on Computer Science Education (SIGCSE '12). ACM, NY, NY, USA, 283--288. DOI: http://dx.doi.org/10.1145/2157136.2157222","paperID":"None"},{"content":"Dale H Schunk. 1990. Goal setting and self-efficacy during self-regulated learning. Educational psychologist 25, 1 (1990), 71--86.","paperID":"None"},{"content":"GM SELIGSON. 1983. LATIN AT MICHIGAN 1951--1981. In Latin Linguistics and Linguistic Theory: Proceedings of the 1st International Colloquium on Latin Linguistics, Amsterdam, April 1981, Vol. 12. John Benjamins Publishing, 295.","paperID":"None"},{"content":"Gerda M Seligson. 1964. The Structural Approach, the First Decade. The Classical World (1964), 97--100.","paperID":"None"},{"content":"Juliet P. Shaffer. 1995. Multiple Hypothesis-Testing. Annual Review of Psychology 46 (1995), 561--584.","paperID":"None"},{"content":"Jonah WD Skiles. 1943. The Teaching of the Reading of Latin in the Latin Word-Order. Classical Journal (1943), 88--104.","paperID":"None"},{"content":"Squeakland. 2015. Etoys. http://www.squeakland.org. (2015).","paperID":"None"},{"content":"Waldo E Sweet. 1957. Latin: a structural approach. University of Michigan Press.","paperID":"None"},{"content":"Waldo E Sweet. 1967. The Continued Development of the Structural Approach. Didaskalos 2, 2 (1967), 141--159.","paperID":"None"},{"content":"V.L. Takacs. 2014. BlockImpress. In Intelligent Engineering Systems (INES), 2014 18th International Conference on. 221--226. DOI: http://dx.doi.org/10.1109/INES.2014.6909372","paperID":"None"},{"content":"Feng Tian, Fei Lv, Jingtao Wang, Hongan Wang, Wencan Luo, Matthew Kam, Vidya Setlur, Guozhong Dai, and John Canny. 2010. Let's Play Chinese Characters: Mobile Learning Approaches via Culturally Inspired Group Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1603--1612.","paperID":"None"},{"content":"Jake Trower and Jeff Gray. 2015. Blockly Language Creation and Applications: Visual Programming for Media Computation and Bluetooth Robotics Control. In Proceedings of the 46th ACM Technical Symposium on Computer Science Education (SIGCSE '15). ACM, NY, NY, USA, 5--5. DOI: http://dx.doi.org/10.1145/2676723.2691871","paperID":"None"},{"content":"Kevin Wang, Corey McCaffrey, Daniel Wendel, and Eric Klopfer. 2006. 3D Game Design with Programming Blocks in StarLogo TNG. In Proceedings of the 7th International Conference on Learning Sciences (ICLS '06). International Society of the Learning Sciences, 1008--1009. http://dl.acm.org/citation.cfm?id=1150034.1150223","paperID":"None"},{"content":"David Weintrop and Uri Wilensky. 2013. Robobuilder: A Computational Thinking Game (Abstract Only). In Proceeding of the 44th ACM Technical Symposium on Computer Science Education (SIGCSE '13). ACM, NY, NY, USA, 736--736. DOI: http://dx.doi.org/10.1145/2445196.2445430","paperID":"None"},{"content":"Frederic M Wheelock. 1963. Latin: An introductory course based on ancient authors. Number 104. Barnes & Noble Imports.","paperID":"None"},{"content":"Frederic M Wheelock and Richard A LaFleur. 2005. Wheelock's Latin. HarperResource.","paperID":"None"},{"content":"Ursula Wolz, Henry H Leitner, David J Malan, and John Maloney. 2009. Starting with scratch in CS 1. In ACM SIGCSE Bulletin, Vol. 41. ACM, 2--3.","paperID":"None"},{"content":"Barry J Zimmerman, Albert Bandura, and Manuel Martinez-Pons. 1992. Self-motivation for academic attainment: The role of self-efficacy beliefs and personal goal setting. American educational research journal 29, 3 (1992), 663--676.","paperID":"None"}],"abstract":"Reading Latin poses many difficulties for English speakers, because they are accustomed to relying on word order to determine the roles of words in a sentence. In Latin, the grammatical form of a word, and not its position, is responsible for determining the word's function in a sentence. It has proven challenging to develop pedagogical techniques that successfully draw students' attention to the grammar of Latin and that students find engaging enough to use. Building on some of the most promising prior work in Latin instruction-the Michigan Latin approach--and on the insights underlying block-based programming languages used to teach children the basics of computer science, we developed Ingenium. Ingenium uses abstract puzzle blocks to communicate grammatical concepts. Engaging students in grammatical reflection, Ingenium succeeds when students are able to effectively decipher the meaning of Latin sentences. We adapted Ingenium to be used for two standard classroom activities: sentence translations and fill-in-the-blank exercises. We evaluated Ingenium with 67 novice Latin students in universities across the USA. When using Ingenium, participants opted to perform more optional exercises, completed translation exercises with significantly fewer errors related to word order and errors overall, as well as reported higher levels of engagement and attention to grammar than when using a traditional text-based interface.","title":"Ingenium: Engaging Novice Students with Latin Grammar","filename":"CHI16/p944","authors":["Sharon Zhou","Ivy J. Livingston","Mark Schiefsky","Stuart M. Shieber","Krzysztof Z. Gajos"],"conference":"CHI '16"}