{"paperId":2858310,"citation":[],"reference":[{"content":"Jeffrey Bardzell, Shaowen Bardzell, and Lone Koefoed Hansen. 2015. Immodest Proposals: Research Through Design and Knowledge. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2093--2102. http://doi.acm.org/10.1145/2702123.2702400","paperID":"None"},{"content":"Ditte Amund Basballe and Kim Halskov. 2012. Dynamics of research through design. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 58--67. http://doi.acm.org/10.1145/2317956.2317967","paperID":"None"},{"content":"Thomas Binder and Eva Brandt. 2007. Experimental design research : genealogy, intervention, argument. International association of societies of design research 2007: emerging trends in design. Hong Kong.","paperID":"None"},{"content":"Eli Blevis, Sabrina Hauser, and William Odom. 2015. Sharing the hidden treasure in pictorials. Interactions 22, 3 (April 2015), 32--43. http://doi.acm.org/10.1145/2755534","paperID":"None"},{"content":"Mark Blythe. 2014. Research through design fiction: narrative in real and imaginary abstracts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 703--712. http://doi.acm.org/10.1145/2556288.2557098","paperID":"None"},{"content":"John Bowers. 2012. The logic of annotated portfolios: communicating the value of 'research through design'. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 6877. http://doi.acm.org/10.1145/2317956.2317968","paperID":"None"},{"content":"Richard Buchanan. 1992. Wicked problems in design thinking. Design Issues, 8(2), 5--21. DOI: 10.2307/1511637","paperID":"None"},{"content":"Bill Buxton. 2007. Sketching user experience - Getting the design right and the right design. San Francisco: Morgan Kaufman.","paperID":"None"},{"content":"Nigel Cross. 2007. Designerly ways of knowing. Birkhäuser, Basel.","paperID":"None"},{"content":"Peter Dalsgaard and Christian Dindler. 2014. Between theory and practice: bridging concepts in HCI research. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, New York, NY, USA, 1635--1644. http://doi.acm.org/10.1145/2556288.2557342","paperID":"None"},{"content":"Peter Dalsgaard and Kim Halskov. 2012. Reflective design documentation. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 428--437. http://doi.acm.org/10.1145/2317956.2318020","paperID":"None"},{"content":"Peter Dalsgaard, Kim Halskov, and Rune Nielsen. 2008. \"Maps for design reflection.\"Artifact 2.3--4 (2008): 176--189.","paperID":"None"},{"content":"Kees Dorst and Nigel Cross. 2001. \"Creativity in the design process: co-evolution of problem-solution.\" Design studies 22, no. 5 (2001): 425--437.","paperID":"None"},{"content":"Anthony Dunne and Fiona Raby. Design noir: The secret life of electronic objects. Springer Science & Business Media, 2001.","paperID":"None"},{"content":"Cristopher Frayling. Research in art and design. Royal College of Art London, 1993.","paperID":"None"},{"content":"William Gaver. 2012. What should we expect from research through design? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 937946. http://doi.acm.org/10.1145/2207676.2208538","paperID":"None"},{"content":"Kristina Höök and Jonas Löwgren. 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Trans. Comput.-Hum. Interact. 19, 3, Article 23 (October 2012), 18 pages. http://doi.acm.org/10.1145/2362364.2362371","paperID":"None"},{"content":"Kristina Höök, Peter Dalsgaard, Stuart Reeves, Jeffrey Bardzell, Jonas Löwgren, Erik Stolterman, and Yvonne Rogers. 2015. Knowledge Production in Interaction Design. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 2429--2432. http://doi.acm.org/10.1145/2702613.2702653","paperID":"None"},{"content":"Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems (CHI '97). ACM, New York, NY, USA, 234--241. http://doi.acm.org/10.1145/258549.258715","paperID":"None"},{"content":"François Jacob. 1988. The Statue Within: An Autobiography. New York: Basic Books.","paperID":"None"},{"content":"Karin Knorr Cetina. 1999. Epistemic Cultures: How the Sciences make Knowledge. Cambridge, MA.: Harvard University Press.","paperID":"None"},{"content":"Ilpo Koskinen, John Zimmerman, Thomas Binder, Johan Redstrom, and Stephan Wensveen. 2011. Design Research Through Practice: From the Lab, Field, and Showroom (1st ed.). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.","paperID":"None"},{"content":"Thomas Samuel Kuhn.2012. The Structure of Scientific Revolutions. University of Chicago press.","paperID":"None"},{"content":"Bruno Latour. 2005. Reassembling the social - an introduction to actor-network-theory. Oxford University Press, Sep 2005. ISBN-10: 0199256047. ISBN-13: 9780199256044 1.","paperID":"None"},{"content":"Martin Ludvigsen. 2006, Designing for social interaction: physical, co-located social computing. Center for Interactive Spaces, Aarhus.","paperID":"None"},{"content":"Robert King Merton. 1987. \"Three fragments from a sociologist's notebooks: Establishing the phenomenon, specified ignorance, and strategic re- search materials\". Annual Review of Sociology 13, p. 1--28, 1987.","paperID":"None"},{"content":"Hans-Jörg Rheinberger. 1997. \"Toward a History of Epistemic Things: Synthesizing Proteins in the Test Tube (Writing Science).\"","paperID":"None"},{"content":"Hans-Jörg Rheinberger. 1998. \"Experimental Systems, Graphematic Spaces\". In Inscribing Science: Scientific Texts and the Materiality of Communication, Edited by Timothy Lenoir. Stanford.","paperID":"None"},{"content":"Hans-Jörg Rheinberger. 2011. \"Consistency from the perspective of an experimental systems approach to the sciences and their epistemic objects.\" Manuscrito 34, no. 1 (2011): 307--321.","paperID":"None"},{"content":"Hans-Jörg Rheinberger. 2012. \"Experimental Systems: Difference, Graphematicity, Conjuncture1.\" Intellectual Birdhouse: Artistic Practice as Research: 89--99.","paperID":"None"},{"content":"Horst Rittel and Melvin Webber. (1973). Dilemmas in a General Theory of Planning. Policy Sciences, Vol. 4, 155-169.","paperID":"None"},{"content":"Schön, Donald A. The reflective practitioner: How professionals think in action. Vol. 5126. Basic books, 1983.","paperID":"None"},{"content":"Léna Soler, Sjoerd Zwart, Michael Lynch, and Vincent Israel-Jost, editors. 2014. Science after the practice turn in the philosophy, history, and social studies of science. Routledge.","paperID":"None"},{"content":"Erik Stolterman. 2008. The nature of design practice and implications for design research. International Journal of Design 2, 1, 55--65.","paperID":"None"},{"content":"Erik Stolterman and Mikael Wiberg. 2010. ConceptDriven Interaction Design Research. Human-Computer Interaction 25, 2 (2010), 95--118.","paperID":"None"},{"content":"John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 493--502. http://doi.acm.org/10.1145/1240624.1240704","paperID":"None"},{"content":"John Zimmerman and Jodi Forlizzi. 2008. \"The role of design artifacts in design theory construction.\" Artifact 2, no. 1 (2008): 41--45.","paperID":"None"},{"content":"John Zimmerman, Erik Stolterman, and Jodi Forlizzi. 2010. An analysis and critique of Research through Design: towards a formalization of a research approach. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 310--319. http://doi.acm.org/10.1145/1858171.1858228","paperID":"None"}],"abstract":"Research through Design (RtD), a research approach that employs methods and approaches from design as a mode of inquiry, has gained momentum within HCI. However, the approach is not yet formalised, and there are ongoing debates about fundamental issues, such as how to articulate and evaluate knowledge that springs from RtD, and how this knowledge is comparable to knowledge from other forms of research. I propose that Rheinberger's conceptualisation of experimental systems, originally developed in the domain of the natural sciences, offers insights that can add to the understanding of these issues, and in turn to the development of RtD as a research approach. I examine key characteristics of experimental systems as they pertain to RtD, with a focus on the role of designs and forms of knowledge representation. I furthermore propose that the experimental systems perspective can shed light on similarities and differences between RtD and other research approaches.","title":"Experimental Systems in Research through Design","filename":"CHI16/p4991","authors":["Peter Dalsgaard"],"conference":"CHI '16"}