{"paperId":2858228,"abstract":"Elicitation studies, where users supply proposals meant to effect system commands, have become a popular method for system designers. But the method to date has assumed a within-subjects procedure and statistics. Despite the benefits of examining the relative agreement of independent groups (e.g., men versus women, children versus adults, novices versus experts, etc.), the lack of appropriate tools for between-subjects agreement rate analysis have prevented so far such comparative investigations. In this work, we expand the elicitation method to between-subjects designs. We introduce a new measure for evaluating coagreement between groups and a new statistical test for agreement rate analysis that reports the exact p-value to evaluate the significance of the difference between agreement rates calculated for independent groups. We show the usefulness of our tools by re-examining previously published gesture elicitation data, for which we discuss significant differences in agreement for technical and non-technical participants, men and women, and different acquisition technologies. Our new tools will enable practitioners to properly analyze their user-elicited data resulted from complex experimental designs with multiple independent groups and, consequently, will help them understand agreement data and verify hypotheses about agreement at more sophisticated levels of analysis.","citation":[],"reference":[{"content":"Alan Agresti. 2002. Categorical Data Analysis, 2nd Ed. USA: John Wiley & Sons.","paperID":"None"},{"content":"Lisa Anthony, Radu-Daniel Vatavu, and Jacob O. Wobbrock. 2013. Understanding the Consistency of Users' Pen and Finger Stroke Gesture Articulation. In Proc. of Graphics Interface 2013 (GI '13). Canadian Inf. Proc. Soc., Toronto, Ont., Canada, 87-94. http://dl.acm.org/citation.cfm?id=2532129.2532145","paperID":"None"},{"content":"Gilles Bailly, Thomas Pietrzak, Jonathan Deber, and Daniel J. Wigdor. 2013. Métamorphe: Augmenting Hotkey Usage with Actuated Keys. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 563-572. http://dx.doi.org/10.1145/2470654.2470734","paperID":"None"},{"content":"Birgitta Bergvall-Kareborn and Anna Stahlbrost. 2008. Participatory Design: One Step Back or Two Steps Forward?. In Proc. of the 10th Anniversary Conference on Participatory Design 2008 (PDC '08). 102-111. http://dl.acm.org/citation.cfm?id=1795234.1795249","paperID":"None"},{"content":"Robert L. Brennan and Dale J. Prediger. 1981. Coefficient Kappa: Some Uses, Misuses, and Alternatives. Educational and Psychological Measurement 41, 3 (1981), 687-699. http://dx.doi.org/10.1177/001316448104100307","paperID":"None"},{"content":"Ming Ki Chong and Hans W. Gellersen. 2013. How Groups of Users Associate Wireless Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1559-1568. http://dx.doi.org/10.1145/2470654.2466207","paperID":"None"},{"content":"William G. Cochran. 1952. The X2 Test of Goodness of Fit. Annals of Mathematical Statistics 23, 3 (1952), 315-345. http://dx.doi.org/10.1214/aoms/1177729380","paperID":"None"},{"content":"J. Cohen. 1960. A Coefficient of Agreement for Nominal Scales. Educational and Psychological Measurement 20 (April 1960), 37-46. http://dx.doi.org/10.1177/001316446002000104","paperID":"None"},{"content":"Jacob Cohen. 1968. Weighted kappa: Nominal scale agreement provision for scaled disagreement or partial credit. Psychological Bulletin 70, 4 (October 1968), 213-220. http://dx.doi.org/10.1037/h0026256","paperID":"None"},{"content":"Noel Cressie and Timothy R.C. Read. 1989. Pearson's x2 and the Loglikelihood Ratio Statistic G2 : A Comparative Review. International Statistical Review 57, 1 (1989), 19-43. http://www.jstor.org/stable/1403582","paperID":"None"},{"content":"Sonjoy Das, James C. Spall, and Roger Ghanem. 2010. Efficient Monte Carlo computation of Fisher information matrix using prior information. Computational Statistics & Data Analysis 54, 2 (2010), 272-289. http://dx.doi.org/10.1016/j.csda.2009.09.018","paperID":"None"},{"content":"Leah Findlater, Ben Lee, and Jacob Wobbrock. 2012. Beyond QWERTY: Augmenting Touch Screen Keyboards with Multi-touch Gestures for Non-alphanumeric Input. In Proc. of CHI '12. ACM, 2679-2682. http://dx.doi.org/10.1145/2207676.2208660","paperID":"None"},{"content":"Ronald A. Fisher. 1954. Statistical Methods for Research Workers. London: Oliver and Boyd.","paperID":"None"},{"content":"Joseph L. Fleiss. 1971. Measuring nominal scale agreement among many raters. Psychological Bulletin 76, 5 (November 1971), 378-382. http://dx.doi.org/10.1037/h0031619","paperID":"None"},{"content":"Kilem L. Gwet. 2012. Handbook of Inter-Rater Reliability: The Definitive Guide to Measuring the Extent of Agreement Among Multiple Raters. Advanced Analytics, LLC.","paperID":"None"},{"content":"Judith A. Hall. 1990. Nonverbal Sex Differences: Communication Accuracy and Expressive Style. Johns Hopkins University Press.","paperID":"None"},{"content":"Jesse Hoey. 2012. The Two-Way Likelihood Ratio (G) Test and Comparison to Two-Way X2 Test. arXiv:1206.4881 (2012). http://arxiv.org/abs/1206.4881","paperID":"None"},{"content":"Ole R. Holsti. 1969. Content analysis for the social sciences and humanities. Addison-Wesley.","paperID":"None"},{"content":"Robert C. James. 1992. The Mathematics Dictionary, 5th Ed. Chapman & Hall, NY.","paperID":"None"},{"content":"Shaun K. Kane, Jacob O. Wobbrock, and Richard E. Ladner. 2011. Usable Gestures for Blind People: Understanding Preference and Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 413-422. http://dx.doi.org/10.1145/1978942.1979001","paperID":"None"},{"content":"Maurice G. Kendall and B. Babington Smith. 1939. The Problem of m Rankings. Annals of Math. Stats. 10, 3 (1939), 275-287. http://www.jstor.org/stable/2235668","paperID":"None"},{"content":"Finn Kensing and Jeanette Blomberg. 1998. Participatory Design: Issues and Concerns. Computer Supported Cooperative Work 7, 3--4 (Jan. 1998), 167-185. DOI: http://dx.doi.org/10.1023/A:1008689307411","paperID":"None"},{"content":"Christian Kray, Daniel Nesbitt, John Dawson, and Michael Rohs. 2010. User-defined Gestures for Connecting Mobile Phones, Public Displays, and Tabletops. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, NY, NY, USA, 239-248. http://dx.doi.org/10.1145/1851600.1851640","paperID":"None"},{"content":"Christine Kuhnel, Tilo Westermann, Fabian Hemmert, Sven Kratz, Alexander Muller, and Sebastian Moller. 2011. I'm home: Defining and evaluating a gesture set for smart-home control. International Journal of Human-Computer Studies 69, 11 (2011), 693-704. http://dx.doi.org/10.1016/j.ijhcs.2011.04.005","paperID":"None"},{"content":"S. Kullback and R.A. Leibler. 1951. On Information and Sufficiency. Annals of Mathematical Statistics 22, 1 (1951), 79-86. http://www.jstor.org/stable/2236703","paperID":"None"},{"content":"Ekaterina Kurdyukova, Matthias Redlin, and Elisabeth Andre. 2012. Studying User-defined iPad Gestures for Interaction in Multi-display Environment. In Proceedings of the 2012 ACM International Conference on Intelligent User Interfaces (IUI '12). ACM, NY, NY, USA, 93-96. http://dx.doi.org/10.1145/2166966.2166984","paperID":"None"},{"content":"H.O. Lancaster. 1961. Significance Tests in Discrete Distributions. J. Amer. Statist. Assoc. 56, 294 (1961), 223-234. http://www.jstor.org/stable/2282247","paperID":"None"},{"content":"David McNeill. 1992. Hand and Mind: What Gesture Reveals about Thought. University Chicago Press.","paperID":"None"},{"content":"Cyrus R. Mehta and Nitin R. Patel. 1983. A Network Algorithm for Performing Fisher's Exact Test in r × c Contingency Tables. J. Amer. Statist. Assoc. 78, 382 (1983), 427-434. http://www.jstor.org/stable/2288652","paperID":"None"},{"content":"Meredith Ringel Morris. 2012. Web on the Wall: Insights from a Multimodal Interaction Elicitation Study. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12). ACM, NY, NY, USA, 95-104. http://dx.doi.org/10.1145/2396636.2396651","paperID":"None"},{"content":"Meredith Ringel Morris, Andreea Danielescu, Steven Drucker, Danyel Fisher, Bongshin Lee, m c schraefel, and Jacob O. Wobbrock. 2014. Reducing Legacy Bias in Gesture Elicitation Studies. Interactions 21, 3 (May 2014), 40-45. http://dx.doi.org/10.1145/2591689","paperID":"None"},{"content":"Charles E. Osgood. 1959. Representational model and relevant research methods. In Trends in Content Analysis, I. Pool (Ed.). Illinois Press, Urbana, IL.","paperID":"None"},{"content":"Karl Pearson. 1900. On the criterion that a given system of deviations from the probable in the case of a correlated system of variables is such that it can be reasonably supposed to have arisen from random sampling. Philos. Mag. 50, 5 (1900), 157-175. http://dx.doi.org/10.1080/14786440009463897","paperID":"None"},{"content":"M. Pilar Matud, C. Rodrguez, and J. Grande. 2007. Gender differences in creative thinking. Personality and Individual Differences 43, 5 (2007), 1137-1147. http://dx.doi.org/10.1016/j.paid.2007.03.006","paperID":"None"},{"content":"Thammathip Piumsomboon, Adrian Clark, Mark Billinghurst, and Andy Cockburn. 2013a. User-Defined Gestures for Augmented Reality. In Human-Computer Interaction INTERACT 2013 (Lecture Notes in Computer Science), Paula Kotz, Gary Marsden, Gitte Lindgaard, Janet Wesson, and Marco Winckler (Eds.), Vol. 8118. Springer Berlin Heidelberg, 282-299. http://dx.doi.org/10.1007/978--3--642--40480--1_18","paperID":"None"},{"content":"Thammathip Piumsomboon, Adrian Clark, Mark Billinghurst, and Andy Cockburn. 2013b. User-defined Gestures for Augmented Reality. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 955-960. http://dx.doi.org/10.1145/2468356.2468527","paperID":"None"},{"content":"Jaime Ruiz, Yang Li, and Edward Lank. 2011. User-defined Motion Gestures for Mobile Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 197-206. http://dx.doi.org/10.1145/1978942.1978971","paperID":"None"},{"content":"Jaime Ruiz and Daniel Vogel. 2015. Using Soft-Constraints to Reduce Legacy and Performance Bias in Gesture Elicitation Studies. In Proceedings of CHI'15, the 33rd ACM SIGCHI Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 3347-3350. http://dx.doi.org/10.1145/2702123.2702583","paperID":"None"},{"content":"Karen Rust, Meethu Malu, Lisa Anthony, and Leah Findlater. 2014. Understanding Child-defined Gestures and Children's Mental Models for Touchscreen Tabletop Interaction. In Proceedings of the 2014 Conference on Interaction Design and Children (IDC '14). ACM, NY, NY, USA, 201-204. http://dx.doi.org/10.1145/2593968.2610452","paperID":"None"},{"content":"William A. Scott. 1955. Reliability of Content Analysis: The Case of Nominal Scale Coding. Public Opinion Quarterly 19, 3 (1955), 321-325. http://dx.doi.org/10.1086/266577","paperID":"None"},{"content":"Teddy Seyed, Chris Burns, Mario Costa Sousa, Frank Maurer, and Anthony Tang. 2012. Eliciting Usable Gestures for Multi-display Environments. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12). ACM, NY, NY, USA, 41-50. http://dx.doi.org/10.1145/2396636.2396643","paperID":"None"},{"content":"Consuelo Valdes, Diana Eastman, Casey Grote, Shantanu Thatte, Orit Shaer, Ali Mazalek, Brygg Ullmer, and Miriam K. Konkel. 2014. Exploring the Design Space of Gestural Interaction with Active Tokens Through User-defined Gestures. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 4107-4116. http://dx.doi.org/10.1145/2556288.2557373","paperID":"None"},{"content":"Radu-Daniel Vatavu. 2012. User-defined Gestures for Free-hand TV Control. In Proceedings of the 10th European Conference on Interactive TV and Video (EuroiTV '12). ACM, NY, NY, USA, 45-48. http://dx.doi.org/10.1145/2325616.2325626","paperID":"None"},{"content":"Radu-Daniel Vatavu. 2013. A Comparative Study of User-Defined Handheld vs. Freehand Gestures for Home Entertainment Environments. Journal of Ambient Intelligence and Smart Environments 5, 2 (2013), 187-211. http://dx.doi.org/10.3233/AIS-130200","paperID":"None"},{"content":"Radu-Daniel Vatavu, Lisa Anthony, and Quincy Brown. 2015a. Child or Adult? Inferring Smartphone Users' Age Group from Touch Measurements Alone. In Proceedings of the 15th IFIP TC.13 International Conference on Human-Computer Interaction (INTERACT '15). 1-9. http://dx.doi.org/10.1007/978--3--319--22723--8_1","paperID":"None"},{"content":"Radu-Daniel Vatavu, Gabriel Cramariuc, and Doina Maria Schipor. 2015b. Touch Interaction for Children Aged 3 to 6 Years: Experimental Findings and Relationship to Motor Skills. International Journal of Human-Computer Studies 74 (2015), 54-76. http://dx.doi.org/10.1016/j.ijhcs.2014.10.007","paperID":"None"},{"content":"Radu-Daniel Vatavu and Jacob O. Wobbrock. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Significance Test, and Toolkit. In Proceedings of CHI'15, the 33rd ACM SIGCHI Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 1325-1334. http://dx.doi.org/10.1145/2702123.2702223","paperID":"None"},{"content":"Radu-Daniel Vatavu and Ionut-Alexandru Zaiti. 2014. Leap Gestures for TV: Insights from an Elicitation Study. In Proceedings of the 2014 ACM International Conference on Interactive Experiences for TV and Online Video (TVX '14). ACM, NY, NY, USA, 131-138. http://dx.doi.org/10.1145/2602299.2602316","paperID":"None"},{"content":"Tomaso Vecchi and Luisa Girelli. 1998. Gender differences in visuo-spatial processing: The importance of distinguishing between passive storage and active manipulation. Acta Psychologica 99, 1 (1998), 1-16. http://dx.doi.org/10.1016/S0001--6918(97)00052--8","paperID":"None"},{"content":"Jacob O. Wobbrock, Htet Htet Aung, Brandon Rothrock, and Brad A. Myers. 2005. Maximizing the Guessability of Symbolic Input. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, NY, NY, USA, 1869-1872. http://dx.doi.org/10.1145/1056808.1057043","paperID":"None"},{"content":"Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defined Gestures for Surface Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1083-1092. http://dx.doi.org/10.1145/1518701.1518866","paperID":"None"},{"content":"Huiyue Wu and Jianmin Wang. 2012. User-Defined Body Gestures for TV-based Applications. In Proceedings of the 2012 Fourth International Conference on Digital Home (ICDH '12). IEEE Computer Society, Washington, DC, USA, 415-420. http://dx.doi.org/10.1109/ICDH.2012.23","paperID":"None"}],"title":"Between-Subjects Elicitation Studies: Formalization and Tool Support","filename":"CHI16/p3390","authors":["Radu-Daniel Vatavu","Jacob O. Wobbrock"],"conference":"CHI '16"}