{"paperId":2858332,"citation":[],"abstract":"We present insights from an extended engagement and design intervention at an urban regeneration site in SE Lon-don. We describe the process of designing a walking trail and system for recording and playing back place-specific stories for those living and working on the housing estate, and show how this is set within a wider context of urban renewal, social/affordable housing and \"community building\". Like prior work, the research reveals the frictions that arise in participatory engagements with heterogeneous actors. Here we illustrate how material interventions can re-arrange existing spatial configurations, making productive the plurality of accounts intrinsic in community life. Through this, we provide an orientation to HCI and design interventions that are concerned with civic engagement and participation in processes of making places.","reference":[{"content":"Allen, J., Barlow, J., Leal, J., Maloutas, T., & Padovani, L. 2004. Housing and welfare in Southern Europe. Oxford: Blackwell.","paperID":"None"},{"content":"Mara Balestrini, Jon Bird, Paul Marshall, Alberto Zaro, and Yvonne Rogers. 2014. Understanding sustained community engagement: a case study in heritage preservation in rural Argentina. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 2675--2684.","paperID":"None"},{"content":"Nicola J. Bidwell, Masbulele Siya, Gary Marsden, William D. Tucker, M. Tshemese, N. Gaven, S. Ntlangano, Simon Robinson, and Kristen ALI Eglinton. 2008. Walking and the social life of solar charging in rural Africa. ACM Transaction Computer Human Interaction. 20, 4, 22 (2008).","paperID":"None"},{"content":"Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2012. Design Things and Design Thinking: Contemporary Participatory Design Challenges, Design Issues, 28(3).","paperID":"None"},{"content":"Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2010. Participatory design and \"democratizing innovation\". In Proceedings of the 11th Biennial Participatory Design Conference (PDC '10). ACM, NY, NY, USA, 41--50.","paperID":"None"},{"content":"Braun, V., Clarke, V. 2006. Using thematic analysis in research, Qualitative Research in Psychology, 3(2), 77101.","paperID":"None"},{"content":"Phillip Clay. 1979. Neighborhood renewal, Middle Class Resettlement and the Incumbent in American Neighborhood. Lexinton Books.","paperID":"None"},{"content":"Clara Crivellaro, Rob Comber, Martyn Dade-Robertson, Simon J. Bowen, Peter C. Wright, and Patrick Olivier. 2015. Contesting the City: Enacting the Political Through Digitally Supported Urban Walks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2853--2862.","paperID":"None"},{"content":"Martin, Coward. 2012. Between Us in the City: materiality, subjectivity, and community in the era of global urbanization, Environment And Planning D: Society & Space, Vol.30 (3), pp.468--481.","paperID":"None"},{"content":"Nigel Cross. 1993. A history of Design Methodology. In Marc de Vries, Nigel Cross, Donald P. Grant (eds).1993. Design Methodology and Relationship with Science. Kluwer Academic Publishers.","paperID":"None"},{"content":"Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making public things: how HCI design can express matters of concern. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2397--2406.","paperID":"None"},{"content":"Paul Dourish. 2006. Respaceing place: \"place\" and \"space\" ten years on. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work (CSCW '06). ACM, NY, NY, USA, 299--308.","paperID":"None"},{"content":"Farias, I., The Politics of Urban Assemblages, City, 2011, 15(3), 365--374","paperID":"None"},{"content":"Sarah Fox and Christopher Le Dantec. 2014. Community historians: scaffolding community engagement through culture and heritage. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 785--794.","paperID":"None"},{"content":"Bill Gaver, Tony Dunne, Elena Pacenti, Jay Blickstein. 1999. interactions, Vol.6(1), pp.21--29.","paperID":"None"},{"content":"Luna Glucksberg. 2014. \"We was regenerated out\": Regeneration, Recycling and Devaluing Communities. Valuation Studies. 2(2), 87--118.","paperID":"None"},{"content":"Donna Haraway. 1988. Situated Knowledges: The Science Question in Feminism and The privilege of Partial Perspective. Feminist Studies, 14 (3).","paperID":"None"},{"content":"Steve Harrison, Deborah Tatar. 2008. Places: People, Events, Loci -- the Relation of Semantic Frames in the Construction of Place, Computer Supported Cooperative Work (CSCW), Vol.17 (2), pp.97--133.","paperID":"None"},{"content":"bell hooks. 2009. Teaching Critical Thinking practical wisdom. Ebooks Corporation.","paperID":"None"},{"content":"Helen Klaebe, Marcus Foth, Jean Burgess, Mark Bilandzic. 2007. Digital Storytelling and History Lines: Community Engagement in a Master-Planned Development. In Proceedings 13th International Conference on Virtual Systems and Multimedia (VSMM'07), Brisbane.","paperID":"None"},{"content":"Matthias Korn and Jon Back. 2012. Talking it further: from feelings and memories to civic discussions in and about places. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, NY, NY, USA, 189--198.","paperID":"None"},{"content":"John Law, Vicky Singleton. 2014. ANT, Multiplicity and Policy, Critical Policy Studies, Vol.8(4), pp.379-","paperID":"None"},{"content":"Christopher A. Le Dantec and Sarah Fox. 2015. Strangers at the Gate: Gaining Access, Building Rapport, and Co-Constructing Community-Based Research. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1348--1358.","paperID":"None"},{"content":"Christopher Le Dantec. 2012. Participation and publics: supporting community engagement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1351--1360.","paperID":"None"},{"content":"Loretta Lees. 2008. Gentrification and social mixing: Towards and Inclusive Urban Renaissance? Urban Studies, 45(12) 2449--2470.","paperID":"None"},{"content":"Nortje Marres. 2012. Material Participation: Technology, the Environment and Everyday Publics, Palgrave MacMillan Press.","paperID":"None"},{"content":"Doreen Massey. 2005. For Space, Sage Publications","paperID":"None"},{"content":"Annemarie Mol. 2013. Mind you Plate! The Ontonorms of Dutch Dieting. Studies of Social Science, 34(3) 379--396.","paperID":"None"},{"content":"Ingunn Moser. 2005. On Becoming Disabled and Articulating Alternatives: The multiple modes of ordering disability and their interferences, Cultural Studies, Vol.19 (6), p.667--700.","paperID":"None"},{"content":"Sissel Olander, Tau Ulv Lenskjold, Signe Louise Yndigegn, and Maria Foverskov. 2011. Mobilizing for community building and everyday innovation. Interactions 18, 4 (July 2011), 28--32.","paperID":"None"},{"content":"Edward W. Soja. 2010. Seeking Spatial Justice, University of MN Press.","paperID":"None"},{"content":"Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-Place: Thinking through the Relations Between Data and Community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2863--2872.","paperID":"None"},{"content":"Alex S. Taylor. 2011. Out there. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 685694.","paperID":"None"},{"content":"Jeremy Till. 2005. The negotiation of hope. In Peter Blundell-Jones, Doina Petrescu, Jeremy Till. 2005. Architecture and Participation, NY: Spon Press.","paperID":"None"},{"content":"Natasha Val, 2013. Erskine Vernacular Plan: Social Engineering and Participation in Anglo-Swedish Housing 1945--1976: Ralph Erskine's Vernacular Plan. 28(2), 223--245.","paperID":"None"},{"content":"Christine Whitehead. 1991. From need to affordability: An analysis of UK Housing Objectives. 28(60), 871887.","paperID":"None"},{"content":"Pete Wright & John McCarthy, 2015, Taking [a]Part, MIT Press.","paperID":"None"}],"title":"Re-Making Places: HCI, 'Community Building' and Change","filename":"CHI16/p2958","authors":["Clara Crivellaro","Alex Taylor","Vasillis Vlachokyriakos","Rob Comber","Bettina Nissen","Peter Wright"],"conference":"CHI '16"}