{"paperId":2858435,"citation":[],"reference":[{"content":"Sriram Karthik Badam, Eli Fisher, and Niklas Elmqvist. 2015. Munin: A Peer-to-Peer Middleware for Ubiquitous Analytics and Visualization Spaces. IEEE Transactions on Visualization and Computer Graphics 21, 2 (Feb. 2015), 215-228. DOI: http://dx.doi.org/10.1109/TVCG.2014.2337337","paperID":"None"},{"content":"Benjamin B. Bederson and James D. Hollan. 1994. Pad++: A Zooming Graphical Interface for Exploring Alternate Interface Physics. In Proceedings of the 7th Annual ACM Symposium on User Interface Software and Technology (UIST '94). ACM, NY, NY, USA, 17-26. DOI: http://dx.doi.org/10.1145/192426.192435","paperID":"None"},{"content":"Jacques Bertin. 2011. Semiology of Graphics: Diagrams, Networks, Maps. ESRI Press, Redlands, Calif.","paperID":"None"},{"content":"Marat Boshernitsan and Michael Sean Downes. 2004. Visual programming languages: A survey. Technical Report UCB/CSD-04--1368. University of California, Berkeley.","paperID":"None"},{"content":"Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3; Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2301-2309. DOI: http://dx.doi.org/10.1109/TVCG.2011.185","paperID":"None"},{"content":"John Brosz, Miguel A. Nacenta, Richard Pusch, Sheelagh Carpendale, and Christophe Hurter. 2013. Transmogrification: Casual Manipulation of Visualizations. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 97-106. DOI: http://dx.doi.org/10.1145/2501988.2502046","paperID":"None"},{"content":"Jeffrey Browne, Bongshin Lee, Sheelagh Carpendale, Nathalie Riche, and Timothy Sherwood. 2011. Data Analysis on Interactive Whiteboards Through Sketch-based Interaction. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '11). ACM, NY, NY, USA, 154-157. DOI: http://dx.doi.org/10.1145/2076354.2076383","paperID":"None"},{"content":"William O. Chao, Tamara Munzner, and Michiel van de Panne. 2010. Poster: Rapid pen-centric authoring of improvisational visualizations with napkinvis. Posters Compendium InfoVis (2010).","paperID":"None"},{"content":"William S Cleveland and Robert McGill. 1984. Graphical Perception: Theory, Experimentation, and Application to the Development of Graphical Methods. J. Amer. Statist. Assoc. 79, 387 (1984), 531-554. DOI: http://dx.doi.org/10.2307/2288400","paperID":"None"},{"content":"William S. Cleveland and Robert McGill. 1987. Graphical Perception: The Visual Decoding of Quantitative Information on Graphical Displays of Data. Journal of the Royal Statistical Society. Series A (General) 150, 3 (1987), 192-229. http://www.jstor.org/stable/2981473","paperID":"None"},{"content":"Andy Cockburn, Amy Karlson, and Benjamin B. Bederson. 2009. A Review of Overview+Detail, Zooming, and Focus+Context Interfaces. Comput. Surveys 41, 1 (Jan. 2009), 2:1-2:31. DOI: http://dx.doi.org/10.1145/1456650.1456652","paperID":"None"},{"content":"Niklas Elmqvist, John Stasko, and Philippas Tsigas. 2008. DataMeadow: A Visual Canvas for Analysis of Large-scale Multivariate Data. Information Visualization 7, 1 (March 2008), 18-33. DOI: http://dx.doi.org/10.1145/1391107.1391110","paperID":"None"},{"content":"Gapminder Foundation. 2015. Gapminder, a fact-based worldview. (2015). http://www.gapminder.org","paperID":"None"},{"content":"Mathias Frisch, Jens Heydekorn, and Raimund Dachselt. 2009. Investigating Multi-touch and Pen Gestures for Diagram Editing on Interactive Surfaces. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '09). ACM, NY, NY, USA, 149-156. DOI: http://dx.doi.org/10.1145/1731903.1731933","paperID":"None"},{"content":"Issei Fujishiro, Yoshihiko Ichikawa, Rika Furuhata, and Yuriko Takeshima. 2000. GADGET/IV: a taxonomic approach to semi-automatic design of information visualization applications using modular visualization environment. In IEEE Symposium on Information Visualization, 2000. InfoVis 2000. 77-83. DOI: http://dx.doi.org/10.1109/INFVIS.2000.885093","paperID":"None"},{"content":"Lars Grammel, Chris Bennett, Melanie Tory, and Margaret-Anne Storey. 2013. A Survey of Visualization Construction User Interfaces. In EuroVis Short Papers, Mario Hlawitschka and Tino Weinkauf (Eds.). The Eurographics Association. DOI: http://dx.doi.org/10.2312/PE.EuroVisShort. EuroVisShort2013.019-023","paperID":"None"},{"content":"Carl Gutwin and Saul Greenberg. 2004. The importance of awareness for team cognition in distributed collaboration. In Team cognition: Understanding the factors that drive process and performance, E. Salas and S. M. Fiore (Eds.). American Psychological Association, Washington, DC, US, 177-201. http://hdl.handle.net/1880/45867","paperID":"None"},{"content":"Jonathan Harper and Maneesh Agrawala. 2014. Deconstructing and Restyling D3 Visualizations. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 253-262. DOI: http://dx.doi.org/10.1145/2642918.2647411","paperID":"None"},{"content":"Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing Graphical Perception: Using Mechanical Turk to Assess Visualization Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 203-212. DOI: http://dx.doi.org/10.1145/1753326.1753357","paperID":"None"},{"content":"Jeffrey Heer, Stuart K. Card, and James A. Landay. 2005. Prefuse: A Toolkit for Interactive Information Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 421-430. DOI: http://dx.doi.org/10.1145/1054972.1055031","paperID":"None"},{"content":"Daniel D. Hils. 1992. Visual languages and computing survey: Data flow visual programming languages. Journal of Visual Languages & Computing 3, 1 (March 1992), 69-101. DOI: http://dx.doi.org/10.1016/1045--926X(92)90034-J","paperID":"None"},{"content":"Weihua Huang and Chew Lim Tan. 2007. A System for Understanding Imaged Infographics and Its Applications. In Proceedings of the 2007 ACM Symposium on Document Engineering (DocEng '07). ACM, NY, NY, USA, 9-18. DOI: http://dx.doi.org/10.1145/1284420.1284427","paperID":"None"},{"content":"Samuel Huron, Sheelagh Carpendale, Alice Thudt, Anthony Tang, and Michael Mauerer. 2014. Constructive Visualization. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA, 433-442. DOI: http://dx.doi.org/10.1145/2598510.2598566","paperID":"None"},{"content":"Waqas Javed and Niklas Elmqvist. 2013. ExPlates: Spatializing Interactive Analysis to Scaffold Visual Exploration. Computer Graphics Forum 32, 3pt4 (2013), 441-450. DOI: http://dx.doi.org/10.1111/cgf.12131","paperID":"None"},{"content":"Rick Kazman and Jeromy Carri'ere. 1996. Rapid prototyping of information visualizations using VANISH. In Information Visualization '96, Proceedings IEEE Symposium on. 21-28, 118. DOI: http://dx.doi.org/10.1109/INFVIS.1996.559212","paperID":"None"},{"content":"Bongshin Lee, Rubaiat Habib Kazi, and Greg Smith. 2013. SketchStory: Telling More Engaging Stories with Data through Freeform Sketching. IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec. 2013), 2416-2425. DOI: http://dx.doi.org/10.1109/TVCG.2013.191","paperID":"None"},{"content":"Rhema Linder, Nic Lupfer, Andruid Kerne, Andrew M. Webb, Cameron Hill, Yin Qu, Kade Keith, Matthew Carrasco, and Elizabeth Kellogg. 2015. Beyond Slideware: How a Free-form Presentation Medium Stimulates Free-form Thinking in the Classroom. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15). ACM, NY, NY, USA, 285-294. DOI: http://dx.doi.org/10.1145/2757226.2757251","paperID":"None"},{"content":"Ruizhe Liu, Weihua Huang, and Chew Lim Tan. 2007. Extraction of Vectorized Graphical Information from Scientific Chart Images. In Ninth International Conference on Document Analysis and Recognition, 2007. ICDAR 2007, Vol. 1. 521-525. DOI: http://dx.doi.org/10.1109/ICDAR.2007.4378764","paperID":"None"},{"content":"Sean Lynch, Miguel A. Nacenta, and Sheelagh Carpendale. 2011. ToCoPlay: Graphical Multi-touch Interaction for Composing and Playing Music. In Human-Computer Interaction INTERACT 2011, Pedro Campos, Nicholas Graham, Joaquim Jorge, Nuno Nunes, Philippe Palanque, and Marco Winckler (Eds.). Lecture Notes in Computer Science, Vol. 6948. Springer Berlin Heidelberg, 306-322. DOI: http://dx.doi.org/10.1007/978--3--642--23765--2_22","paperID":"None"},{"content":"Redacción Madrid. 2015. Un nuevo gráfico 'manipulado' sobre el paro se cuela en TVE. La Vanguardia (Jan. 2015). http://www.lavanguardia.com/television/programas/20150123/54424726878/grafico-manipulacion-tve-paro.html","paperID":"None"},{"content":"Bryan McDonnel and Niklas Elmqvist. 2009. Towards Utilizing GPUs in Information Visualization: A Model and Implementation of Image-Space Operations. IEEE Transactions on Visualization and Computer Graphics 15, 6 (Nov 2009), 1105-1112. DOI: http://dx.doi.org/10.1109/TVCG.2009.191","paperID":"None"},{"content":"Brad A. Myers. 1990. Taxonomies of visual programming and program visualization. Journal of Visual Languages & Computing 1, 1 (March 1990), 97-123. DOI: http://dx.doi.org/10.1016/S1045--926X(05)80036--9","paperID":"None"},{"content":"Seymour Papert. 1993. Mindstorms: Children, Computers, and Powerful Ideas. Basic Books, NY.","paperID":"None"},{"content":"Seymour Papert and Idit Harel. 1991. Situating Constructionism. In Constructionism. Ablex Publishing Corporation.","paperID":"None"},{"content":"Casey Reas and Benjamin Fry. 2003. Processing: A Learning Environment for Creating Interactive Web Graphics. In ACM SIGGRAPH 2003 Web Graphics (SIGGRAPH '03). ACM, NY, NY, USA, 1-1. DOI: http://dx.doi.org/10.1145/965333.965356","paperID":"None"},{"content":"Donghao Ren, T. Hollerer, and Xiaoru Yuan. 2014. iVisDesigner: Expressive Interactive Design of Information Visualizations. IEEE Transactions on Visualization and Computer Graphics 20, 12 (Dec. 2014), 2092-2101. DOI: http://dx.doi.org/10.1109/TVCG.2014.2346291","paperID":"None"},{"content":"Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: Programming for All. Commun. ACM 52, 11 (Nov. 2009), 60-67. DOI: http://dx.doi.org/10.1145/1592761.1592779","paperID":"None"},{"content":"Ankit Rohatgi. 2015. WebPlotDigitizer. (2015). http://arohatgi.info/WebPlotDigitizer","paperID":"None"},{"content":"Greg Ross and Matthew Chalmers. 2003. A Visual Workspace for Hybrid Multidimensional Scaling Algorithms. Information Visualization 2, 4 (Dec. 2003), 247-257. DOI: http://dx.doi.org/10.1057/palgrave.ivs.9500056","paperID":"None"},{"content":"Jeffrey M. Rzeszotarski and Aniket Kittur. 2014. Kinetica: Naturalistic Multi-touch Data Visualization. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 897-906. DOI: http://dx.doi.org/10.1145/2556288.2557231","paperID":"None"},{"content":"Arvind Satyanarayan and Jeffrey Heer. 2014. Lyra: An Interactive Visualization Design Environment. Computer Graphics Forum 33, 3 (June 2014), 351-360. DOI: http://dx.doi.org/10.1111/cgf.12391","paperID":"None"},{"content":"Manolis Savva, Nicholas Kong, Arti Chhajta, Li Fei-Fei, Maneesh Agrawala, and Jeffrey Heer. 2011. ReVision: Automated Classification, Analysis and Redesign of Chart Images. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 393-402. DOI: http://dx.doi.org/10.1145/2047196.2047247","paperID":"None"},{"content":"Sebastian Schmidt, Miguel A. Nacenta, Raimund Dachselt, and Sheelagh Carpendale. 2010. A Set of Multi-touch Graph Interaction Techniques. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10). ACM, NY, NY, USA, 113-116. DOI: http://dx.doi.org/10.1145/1936652.1936673","paperID":"None"},{"content":"Jaime Snyder. 2012. Image-Enabled Discourse: Investigating the Creation of Visual Information as Communicative Practice. iSchool Information Science and Technology - Dissertations (May 2012). http://surface.syr.edu/it_etd/70","paperID":"None"},{"content":"Guo-Dao Sun, Ying-Cai Wu, Rong-Hua Liang, and Shi-Xia Liu. 2013. A Survey of Visual Analytics Techniques and Applications: State-of-the-Art Research and Future Challenges. Journal of Computer Science and Technology 28, 5 (Sept. 2013), 852-867. DOI: http://dx.doi.org/10.1007/s11390-013--1383--8","paperID":"None"},{"content":"Matthew Tobiasz, Petra Isenberg, and Sheelagh Carpendale. 2009. Lark: Coordinating Co-located Collaboration with Information Visualization. IEEE Transactions on Visualization and Computer Graphics 15, 6 (Nov. 2009), 1065-1072. DOI: http://dx.doi.org/10.1109/TVCG.2009.162","paperID":"None"},{"content":"Jeffrey Travis and Jim Kring. 2006. LabVIEW for Everyone: Graphical Programming Made Easy and Fun (3rd Edition) (National Instruments Virtual Instrumentation Series). Prentice Hall PTR, Upper Saddle River, NJ, USA.","paperID":"None"},{"content":"Bas Tummers. 2006. DataThief III. (2006). http://datathief.org","paperID":"None"},{"content":"Bret Victor. 2013. Drawing Dynamic Visualizations. Recorded at the Stanford HCI seminar. (2013). https://vimeo.com/66085662","paperID":"None"},{"content":"Fernanda B. Viegas, Martin Wattenberg, Frank van Ham, Jesse Kriss, and Matt McKeon. 2007. ManyEyes: a Site for Visualization at Internet Scale. IEEE Transactions on Visualization and Computer Graphics 13, 6 (Nov. 2007), 1121-1128. DOI: http://dx.doi.org/10.1109/TVCG.2007.70577","paperID":"None"},{"content":"Colin Ware. 2012. Information visualization: perception for design. Elsevier.","paperID":"None"},{"content":"William Wright, David Schroh, Pascale Proulx, Alex Skaburskis, and Brian Cort. 2006. The Sandbox for Analysis: Concepts and Methods. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 801-810. DOI: http://dx.doi.org/10.1145/1124772.1124890","paperID":"None"}],"abstract":"We present the design and implementation of iVoLVER, a tool that allows users to create visualizations without textual programming. iVoLVER is designed to enable flexible acquisition of many types of data (text, colors, shapes, quantities, dates) from multiple source types (bitmap charts, webpages, photographs, SVGs, CSV files) and, within the same canvas, supports transformation of that data through simple widgets to construct interactive animated visuals. Aside from the tool, which is web-based and designed for pen and touch, we contribute the design of the interactive visual language and widgets for extraction, transformation, and representation of data. We demonstrate the flexibility and expressive power of the tool through a set of scenarios, and discuss some of the challenges encountered and how the tool fits within the current infovis tool landscape.","title":"iVoLVER: Interactive Visual Language for Visualization Extraction and Reconstruction","filename":"CHI16/p4073","authors":["Gonzalo Gabriel Méndez","Miguel A. Nacenta","Sebastien Vandenheste"],"conference":"CHI '16"}