{"paperId":2858178,"citation":[],"abstract":"Large-scale idea generation platforms often expose ideators to previous ideas. However, research suggests people generate better ideas if they see abstracted solution paths (e.g., descriptions of solution approaches generated through human sensemaking) rather than being inundated with all prior ideas. Automated and semi-automated methods can also offer interpretations of earlier ideas. To benefit from sensemaking in practice with limited resources, ideation platform developers need to weigh the cost-quality tradeoffs of different methods for surfacing solution paths. To explore this, we conducted an online study where 245 participants generated ideas for two problems in one of five conditions: 1) no stimuli, 2) exposure to all prior ideas, or solution paths extracted from prior ideas using 3) a fully automated workflow, 4) a hybrid human-machine approach, and 5) a fully manual approach. Contrary to expectations, human-generated paths did not improve ideation (as meas-ured by fluency and breadth of ideation) over simply showing all ideas. Machine-generated paths sometimes significantly improved fluency and breadth of ideation over no ideas (although at some cost to idea quality). These findings suggest that automated sensemaking can improve idea generation, but we need more research to understand the value of human sensemaking for crowd ideation.","reference":[{"content":"Teresa M. Amabile. 1983. The social psychology of creativity: A componential conceptualization. Journal of personality and social psychology 45, 2: 357.","paperID":"None"},{"content":"Paul André, Aniket Kittur, and Steven P. Dow. 2014. Crowd Synthesis: Extracting Categories and Clusters from Complex Data. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 989--998. http://doi.org/10.1145/2531602.2531653","paperID":"None"},{"content":"Paul André, Haoqi Zhang, Juho Kim, Lydia Chilton, Steven P. Dow, and Robert C. Miller. 2013. Community clustering: Leveraging an academic crowd to form coherent conference sessions. First AAAI Conference on Human Computation and Crowdsourcing.","paperID":"None"},{"content":"Brian P. Bailey and Eric Horvitz. 2010. What's Your Idea?: A Case Study of a Grassroots Innovation Pipeline Within a Large Software Company. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2065--2074. http://doi.org/10.1145/1753326.1753641","paperID":"None"},{"content":"Hugh Beyer and Karen Holtzblatt. 1997. Contextual design: defining customer-centered systems. Elsevier.","paperID":"None"},{"content":"David M. Blei. 2012. Probabilistic topic models. Communications of the ACM 55, 4: 77--84. http://doi.org/10.1145/2133806.2133826","paperID":"None"},{"content":"Kevin J. Boudreau and Karim R. Lakhani. 2013. Using the crowd as an innovation partner. Harvard Business Review 91, 4: 60--69.","paperID":"None"},{"content":"Kevin J. Boudreau and Karim R. Lakhani. 2015. Open disclosure of innovations, incentives and follow-on reuse: Theory on processes of cumulative innovation and a field experiment in computational biology. Research Policy 44, 1: 4--19. http://doi.org/10.1016/j.respol.2014.08.001","paperID":"None"},{"content":"Jonathan Chang, Sean Gerrish, Chong Wang, Jordan L. Boyd-graber, and David M. Blei. 2009. Reading tea leaves: How humans interpret topic models. Advances in neural information processing systems, 288--296.","paperID":"None"},{"content":"Joel Chan, Steven C. Dang, and Steven P. Dow. 2016. Improving crowd innovation with expert facilitation. Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing. http://doi.org/10.1145/2818048.2820023","paperID":"None"},{"content":"Joel Chan and Christian Schunn. 2015. The impact of analogies on creative concept generation: Lessons from an in vivo study in engineering design. Cognitive Science 39, 1: 126--155. http://doi.org/10.1111/cogs.12127","paperID":"None"},{"content":"William G. Chase and Herbert A. Simon. 1973. The mind's eye in chess. In Visual Information Processing, William G. Chase (ed.). NY, NY, 215--281.","paperID":"None"},{"content":"Duen Horng Chau, Aniket Kittur, Jason I. Hong, and Christos Faloutsos. 2011. Apolo: Making Sense of Large Network Data by Combining Rich User Interaction and Machine Learning. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 167--176. http://doi.org/10.1145/1978942.1978967","paperID":"None"},{"content":"Lydia B. Chilton, Greg Little, Darren Edge, Daniel S. Weld, and James A. Landay. 2013. Cascade: Crowdsourcing taxonomy creation. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1999--2008. http://doi.org/10.1145/2470654.2466265","paperID":"None"},{"content":"Jacob Cohen. 1988. Statistical power analysis for the behavioral sciences. Psychology Press, Hillsdale, N.J.","paperID":"None"},{"content":"Nelson Cowan. 2000. The magical number 4 in shortterm memory: A reconsideration of mental storage capacity. Behavioral and Brain Sciences 24: 87--185.","paperID":"None"},{"content":"Darren W. Dahl and Page Moreau. 2002. The Influence and value of analogical thinking during new product ideation. Journal of Marketing Research 39, 1: 47--60.","paperID":"None"},{"content":"Scott Deerwester, Susan T. Dumais, Geroge W. Furnas, and Thomas K. Landauer. 1990. Indexing by Latent Semantic Analysis. Journal of the American Society for Information Science 41, 6: 1990.","paperID":"None"},{"content":"Darleen M. DeRosa, Carter L. Smith, and Donald A. Hantula. 2007. The medium matters: Mining the longpromised merit of group interaction in creative idea generation tasks in a meta-analysis of the electronic group brainstorming literature. Computers in Human Behavior 23, 3: 1549--1581. http://doi.org/10.1016/j.chb.2005.07.003","paperID":"None"},{"content":"J. R. Duflou and P. Verhaegen. 2011. Systematic innovation through patent based product aspect analysis. CIRP Annals - Manufacturing Technology 60, 1: 203--206.","paperID":"None"},{"content":"C. Eckert and M. Stacey. 1998. Fortune Favours Only the Prepared Mind: Why Sources of Inspiration are Essential for Continuing Creativity. Creativity and Innovation Management 7, 1: 1--12.","paperID":"None"},{"content":"Antonio Ferreira, Valeria Herskovic, and Pedro Antunes. 2008. Attention-Based Management of Information Flows in Synchronous Electronic Brainstorming. In Groupware: Design, Implementation, and Use, Robert O. Briggs, Gert-Jan -. J. Vreede and Aaron S. Read (eds.). Springer-Verlag, Berlin, Heidelberg, 1--16. Retrieved from http://dx.doi.org/10.1007/978--3540--92831--7_1","paperID":"None"},{"content":"Eve Forster and Kevin N. Dunbar. 2009. Creativity evaluation through Latent Semantic Analysis. Proceedings of the 31st Annual Conference of the Cognitive Science Society.","paperID":"None"},{"content":"Katherine Fu, Joel Chan, Jonathan Cagan, Kenneth Kotovsky, Christian Schunn, and Kristin Wood. 2013. The Meaning of Near and Far: The Impact of Structuring Design Databases and the Effect of Distance of Analogy on Design Output. Journal of Mechanical Design 135, 2: 021007. http://doi.org/10.1115/1.4023158","paperID":"None"},{"content":"M. L. Gick and K. J. Holyoak. 1983. Schema induction and analogical transfer. Cognitive Psychology 15, 1: 1--38.","paperID":"None"},{"content":"Ryan G. Gomes, Peter Welinder, Andreas Krause, and Pietro Perona. 2011. Crowdclustering. Advances in Neural Information Processing Systems 24.","paperID":"None"},{"content":"Joy P. Guilford. 1950. Creativity. American Psychologist 5: 444--454.","paperID":"None"},{"content":"Joy P. Guilford. 1956. The structure of intellect. Psychological Bulletin 53, 4: 267--293. http://doi.org/10.1037/h0040755","paperID":"None"},{"content":"Raja Gumienny, Steven Dow, Matthias Wenzel, Lutz Gericke, and Christoph Meinel. 2015. Tagging User Research Data: How to Support the Synthesis of Information in Design Teams. In Design Thinking Research, Hasso Plattner, Christoph Meinel and Larry Leifer (eds.). Springer International Publishing, 169--191.","paperID":"None"},{"content":"J Isaiah Harbison and Henk Haarmann. 2014. Automated scoring of originality using semantic representations. Proceedings of the 36th Annual Conference of the Cognitive Science Society.","paperID":"None"},{"content":"Beth A. Hennessey and Teresa M. Amabile. 2010. Creativity. Annual Review of Psychology 61: 569--98. http://doi.org/10.1146/annurev.psych.093008.100416","paperID":"None"},{"content":"Scarlett R. Herring, Chia-Chen Chang, Jesse Krantzler, and Brian P. Bailey. 2009. Getting inspired!: understanding how and why examples are used in creative design practice. Proceedings of the 27th international conference on Human factors in computing systems, ACM, 87--96. http://doi.org/10.1145/1518701.1518717","paperID":"None"},{"content":"Keith J. Holyoak and Paul Thagard. 1996. Mental leaps: Analogy in creative thought. Cambridge, MA.","paperID":"None"},{"content":"David G. Jansson and Steven M. Smith. 1991. Design fixation. Design Studies 12, 1: 3--11.","paperID":"None"},{"content":"Elahe Javadi and Wai-Tat -. T. Fu. 2011. Idea Visibility, Information Diversity, and Idea Integration in Electronic Brainstorming. Proceedings of the 6th International Conference on Foundations of Augmented Cognition: Directing the Future of Adaptive Systems, Springer-Verlag, 517--524.","paperID":"None"},{"content":"Elahe Javadi, Joseph Mahoney, and Judith Gebauer. 2013. The impact of user interface design on idea integration in electronic brainstorming: an attention-based view. Journal of the Association for Information Systems 14, 1: 1--21.","paperID":"None"},{"content":"Mark Klein and Gregorio Convertino. 2015. A Roadmap for Open Innovation Systems. Journal of Social Media for Organizations 2, 1: 1.","paperID":"None"},{"content":"Jon Kolko. 2011. Exposing the magic of design: A practitioner's guide to the methods and theory of synthesis. Oxford University Press.","paperID":"None"},{"content":"Adriana Kovashka and Kristen Grauman. 2014. Discovering Shades of Attribute Meaning with the Crowd. Third International Workshop on Parts and Attributes.","paperID":"None"},{"content":"Filip Krynicki. 2014. Methods and models for quantitative analysis of crowd brainstorming. Master's thesis. University of Waterloo, Waterloo, Ontario, Canada.","paperID":"None"},{"content":"Chinmay Kulkarni, Steven P. Dow, and Scott R. Klemmer. 2012. Early and repeated exposure to examples improves creative work. Proceedings of the 34th Annual Meeting of the Cognitive Science Society.","paperID":"None"},{"content":"Thomas K. Landauer, Peter W. Foltz, and Darrell Laham. 1998. An introduction to latent semantic analysis. Discourse Processes 25, 2: 259--284.","paperID":"None"},{"content":"Brian Lee, Savil Srivastava, Ranjitha Kumar, Ronen Brafman, and Scott R. Klemmer. 2010. Designing with Interactive Example Galleries. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2257--2266. http://doi.org/10.1145/1753326.1753667","paperID":"None"},{"content":"Julie S. Linsey, Ian Tseng, Katherine Fu, Jonathan Cagan, Kristin L. Wood, and Christian D. Schunn. 2010. A Study of Design Fixation, Its Mitigation and Perception in Engineering Design Faculty. Journal of Mechanical Design 132, 4: 041003.","paperID":"None"},{"content":"Lan Luo and Olivier Toubia. 2015. Improving Online Idea Generation Platforms and Customizing the Task Structure Based on Consumers' Domain Specific Knowledge. Journal of Marketing. http://doi.org/10.1509/jm.13.0212","paperID":"None"},{"content":"Douglas L. Medin. 1989. Concepts and conceptual structure. American Psychologist 44, 12: 1469--1481.","paperID":"None"},{"content":"George A. Miller. 1956. The magical number seven, plus or minus two: some limits on our capacity for processing information. Psychological Review 63, 2: 81--97. http://doi.org/10.1037/h0043158","paperID":"None"},{"content":"Jeffrey Pennington, Richard Socher, and Christopher D Manning. 2014. Glove: Global vectors for word representation. Proceedings of the Empiricial Methods in Natural Language Processing (EMNLP 2014) 12: 1532--1543.","paperID":"None"},{"content":"Bruce A. Reinig, Robert O. Briggs, and Jay F. Nunamaker. 2007. On the Measurement of Ideation Quality. Journal of Management Information Systems 23, 4: 143--161. http://doi.org/10.2753/MIS0742-","paperID":"None"},{"content":"Mark A. Runco. 2004. Creativity. Annual Review of Psychology 55: 657--687.","paperID":"None"},{"content":"R. Keith Sawyer. 2012. Explaining creativity: the science of human innovation. Oxford University Press, NY.","paperID":"None"},{"content":"Jamie J. Shah, Noe Vargas-Hernandez, and Steven M. Smith. 2003. Metrics for measuring ideation effectiveness. Design Studies 24, 2: 111--134.","paperID":"None"},{"content":"Pao Siangliulue, Kenneth C. Arnold, Krzysztof Z. Gajos, and Steven P. Dow. 2015. Toward Collaborative Ideation at Scale: Leveraging Ideas from Others to Generate More Creative and Diverse Ideas. Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing. http://doi.org/10.1145/2675133.2675239","paperID":"None"},{"content":"Pao Siangliulue, Joel Chan, Kzryzstof Gajos, and Steven P. Dow. 2015. Providing timely examples improves the quantity and quality of generated ideas. Proceedings of the ACM Conference on Creativity and Cognition. http://doi.org/10.1145/2757226.2757230","paperID":"None"},{"content":"Ut Na Sio, Kenneth Kotovsky, and Jonathan Cagan. 2015. Fixation or inspiration? A meta-analytic review of the role of examples on design processes. Design Studies 39: 70--99. http://doi.org/10.1016/j.destud.2015.04.004","paperID":"None"},{"content":"Steven M. Smith, Thomas B. Ward, and Jay S. Schumacher. 1993. Constraining effects of examples in a creative generation task. Memory & Cognition 21, 6: 837--45.","paperID":"None"},{"content":"John Stasko, Carsten Görg, and Zhicheng Liu. 2008. Jigsaw: Supporting Investigative Analysis through Interactive Visualization. Information Visualization 7, 2: 118--132. http://doi.org/10.1057/palgrave.ivs.9500180","paperID":"None"},{"content":"Omer Tamuz, Ce Liu, Serge Belongie, Ohad Shamir, and Adam Tauman Kalai. 2011. Adaptively learning the crowd kernel. arXiv preprint arXiv:1105.1033.","paperID":"None"},{"content":"Christian Terwiesch and Yi Xu. 2008. Innovation contests, open innovation, and multiagent problem solving. Management science 54, 9: 1529--1543.","paperID":"None"},{"content":"Thomas B. Ward, Merryl J. Patterson, and Cynthia M. Sifonis. 2004. The Role of Specificity and Abstraction in Creative Idea Generation. Creativity Research Journal 16, 1: 1--9.","paperID":"None"},{"content":"Thomas N. Wisdom and Robert L. Goldstone. 2011. Innovation, Imitation, and Problem Solving in a Networked Group. Nonlinear Dynamics-Psychology and Life Sciences 15, 2: 229.","paperID":"None"},{"content":"Jinfeng Yi, Rong Jin, Shaili Jain, Tianbao Yang, and Anil K. Jain. 2012. Semi-crowdsourced clustering: Generalizing crowd labeling by robust distance metric learning. Advances in Neural Information Processing Systems, 1772--1780.","paperID":"None"},{"content":"Yisong Yue, Chong Wang, Khalid El-Arini, and Carlos Guestrin. 2014. Personalized Collaborative Clustering. Proceedings of the 23rd International Conference on World Wide Web, ACM, 75--84. http://doi.org/10.1145/2566486.2567991","paperID":"None"},{"content":"Lixiu Yu, Aniket Kittur, and Robert E. Kraut. 2014. Distributed Analogical Idea Generation: Inventing with Crowds. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1245--1254. http://doi.org/10.1145/2556288.2557371","paperID":"None"},{"content":"James Zou, Kamalika Chaudhuri, and Adam Kalai. 2015. Crowdsourcing Feature Discovery via Adaptively Chosen Comparisons. Third AAAI Conference on Human Computation and Crowdsourcing.","paperID":"None"}],"title":"Comparing Different Sensemaking Approaches for Large-Scale Ideation","filename":"CHI16/p2717","authors":["Joel Chan","Steven Dang","Steven P. Dow"],"conference":"CHI '16"}