{"paperId":2858096,"citation":[],"abstract":"Support seeking in stigmatized contexts is useful when the discloser receives the desired response, but it also entails social risks. Thus, people do not always disclose or seek support when they need it. One such stigmatized context for support seeking is sexual abuse. In this paper, we use mixed methods to understand abuse-related posts on reddit. First, we take a qualitative approach to understand post content. Then we use quantitative methods to investigate the use of \"throwaway\" accounts, which provide greater anonymity, and report on factors associated with support seeking and first-time disclosures. In addition to significant linguistic differences between throwaway and identified accounts, we find that those using throwaway accounts are significantly more likely to engage in seeking support. We also find that men are significantly more likely to use throwaway accounts when posting about sexual abuse. Results suggest that subreddit moderators and members who wish to provide support pay attention to throwaway accounts, and we discuss the importance of context-specific anonymity in support seeking.","reference":[{"content":"Michael E. Addis and James R. Mahalik. 2003. Men, masculinity, and the contexts of help seeking. American Psychologist 58, 1: 5--14. http://doi.org/10.1037/0003066X.58.1.5","paperID":"None"},{"content":"Terrance L Albrecht, Brant R Burleson, and Dana Goldsmith. 1994. Supportive communication. Handbook of interpersonal communication 2: 419--449.","paperID":"None"},{"content":"Nazanin Andalibi and Andrea Forte. 2015. Social Computing Researchers as Vulnerable Populations. ACM Conference on Computer Supported Cooperative Work & Social Computing Workshop on Ethics for Studying Sociotechnical Systems in a Big Data World, March 14th, 2015, Vancouver, BC, Canada. Retrieved from http://bit.ly/1ITJD1X","paperID":"None"},{"content":"Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2015. Depression-related Imagery on Instagram. Proceedings of the ACM Conference Companion on Computer Supported Cooperative Work & Social Computing, ACM, 231--234.","paperID":"None"},{"content":"AP Barbee and MR Cunningham. 1995. An experimental approach to social support communications: Interactive coping in close relationships. Communication yearbook 18: 381---413.","paperID":"None"},{"content":"John A. Bargh, Katelyn Y. A. McKenna, and Grainne M. Fitzsimons. 2002. Can You See the Real Me? Activation and Expression of the \"True Self\" on the Internet. Journal of Social Issues 58, 1: 33--48. http://doi.org/10.1111/1540-4560.00247","paperID":"None"},{"content":"Gary Barker. 2007. Adolescents, social support and help-seeking behaviour. Geneva, Switzerland: World Health Organisation.","paperID":"None"},{"content":"Jeremy Birnholtz, Nicholas Aaron Ross Merola, and Arindam Paul. 2015. \"Is it Weird to Still Be a Virgin?:\" Anonymous, Locally Targeted Questions on Facebook Confession Boards. Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, ACM, 2613--2622.","paperID":"None"},{"content":"Moira Burke, Cameron Marlow, and Thomas Lento. 2010. Social network activity and social well-being. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1909--1912.","paperID":"None"},{"content":"Brant R Burleson, Terrance L Albrecht, and Irwin G Sarason. 1994. Communication of social support: Messages, interactions, relationships, and community. Sage Publications, Inc.","paperID":"None"},{"content":"Brant R Burleson, Erina L MacGeorge, ML Knapp, and JA Daly. 2002. Supportive communication. Handbook of interpersonal communication 3: 374--424.","paperID":"None"},{"content":"Stephenie R. Chaudoir and Jeffrey D. Fisher. 2010. The disclosure processes model: Understanding disclosure decision-making and post-disclosure outcomes among people living with a concealable stigmatized identity. Psychological bulletin 136, 2: 236--256. http://doi.org/10.1037/a0018193","paperID":"None"},{"content":"Dan Coates and Tina Winston. 1987. The dilemma of distress disclosure. In Self-disclosure. Springer, 229--255.","paperID":"None"},{"content":"Lorrie Faith Cranor. 1999. Internet privacy. Communications of the ACM 42, 2: 28--38.","paperID":"None"},{"content":"Carolyn E. Cutrona. 1990. Stress and Social Support? in Search of Optimal Matching. Journal of Social and Clinical Psychology 9, 1: 3--14. http://doi.org/10.1521/jscp.1990.9.1.3","paperID":"None"},{"content":"Carolyn E Cutrona and Julie A Suhr. 1992. Controllability of stressful events and satisfaction with spouse support behaviors. Communication Research 19, 2: 154--174.","paperID":"None"},{"content":"Kathryn P Davison, James W Pennebaker, and KJ Petrie. 1997. Virtual narratives: Illness representations in online support groups. Perceptions of health and illness: Current research and applications: 463--486.","paperID":"None"},{"content":"Munmun De Choudhury, Scott Counts, and Eric Horvitz. 2013. Predicting postpartum changes in emotion and behavior via social media. Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, ACM, 3267--3276.","paperID":"None"},{"content":"Munmun De Choudhury, Scott Counts, Eric J Horvitz, and Aaron Hoff. 2014. Characterizing and predicting postpartum depression from shared facebook data. Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 626--638.","paperID":"None"},{"content":"Munmun De Choudhury and Sushovan De. 2014. Mental Health Discourse on reddit: Self-Disclosure, Social Support, and Anonymity. Proceedings of the International AAAI Conference on Weblogs and Social Media.","paperID":"None"},{"content":"Jonathan Diamond. 2002. Narrative means to sober ends: Treating addiction and its aftermath. Guilford Press.","paperID":"None"},{"content":"Judith S. Donath. 2014. We Need Online Alter Egos Now More Than Ever. Wired Magazine. Retrieved from http://www.wired.com/2014/04/why-we-need-onlinealter-egos-now-more-than-ever/","paperID":"None"},{"content":"K Egdorf and RL Rahoi. 1994. Finding a Place Where\" We All Want To Hear It\": E-Mail as a Source of Social Support.","paperID":"None"},{"content":"Shelly D. Farnham and Elizabeth F. Churchill. 2011. Faceted identity, faceted lives: social and technical issues with being yourself online. Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 359--368. http://doi.org/10.1145/1958824.1958880","paperID":"None"},{"content":"Deborah L Finfgeld. 2000. Therapeutic groups online: the good, the bad, and the unknown. Issues in Mental Health Nursing 21, 3: 241--255.","paperID":"None"},{"content":"Jerry Finn. 1999. An exploration of helping processes in an online self-help group focusing on issues of disability. Health & Social Work 24, 3: 220--231.","paperID":"None"},{"content":"Michelle A Fortier, David DiLillo, Terri L MessmanMoore, James Peugh, Kathleen A DeNardi, and Kathryn J Gaffey. 2009. Severity of child sexual abuse and revictimization: The mediating role of coping and trauma symptoms. Psychology of Women Quarterly 33, 3: 308--320.","paperID":"None"},{"content":"Susannah Fox. 2011. The social life of health information 2011.","paperID":"None"},{"content":"Tiffany Gagnon. 2013. The disinhibition of reddit users. Adele Richardson's Spring.","paperID":"None"},{"content":"Jolene Galegher, Lee Sproull, and Sara Kiesler. 1998. Legitimacy, authority, and community in electronic support groups. Written communication 15, 4: 493--530.","paperID":"None"},{"content":"Erving Goffman. 1959. The presentation of self in everyday life.","paperID":"None"},{"content":"Erving Goffman. 1986. Stigma: notes on the management of spoiled identity. Simon & Schuster, New York.","paperID":"None"},{"content":"Steven N Gold, Stacey A Ketchman, Irene Zucker, Melissa A Cott, and Alfred H Sellers. 2008. Relationship between dissociative and medically unexplained symptoms in men and women reporting childhood sexual abuse. Journal of Family Violence 23, 7: 569--575.","paperID":"None"},{"content":"Kathryn Greene, Valerian J Derlega, and Alicia Mathews. 2006. Self-disclosure in personal relationships. In The Cambridge handbook of personal relationships.","paperID":"None"},{"content":"Laura Hlavach and William H Freivogel. 2011. Ethical implications of anonymous comments posted to online news stories. Journal of Mass Media Ethics 26, 1: 21-- 37.","paperID":"None"},{"content":"Amanda J. Holmstrom and Brant R. Burleson. 2011. An Initial Test of a Cognitive-Emotional Theory of Esteem Support Messages. Communication Research 38, 3: 326--355. http://doi.org/10.1177/0093650210376191","paperID":"None"},{"content":"Adam N. Joinson. 2001. Self-disclosure in computermediated communication: The role of self-awareness and visual anonymity. European Journal of Social Psychology 31, 2: 177--192. http://doi.org/10.1002/ejsp.36","paperID":"None"},{"content":"Adam N Joinson and Carina B Paine. 2007. Selfdisclosure, privacy and the Internet. The Oxford handbook of Internet psychology: 2374252.","paperID":"None"},{"content":"Ruogu Kang, Stephanie Brown, and Sara Kiesler. 2013. Why do people seek anonymity on the internet?: informing policy and design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2657--2666.","paperID":"None"},{"content":"John J La Gaipa. 1990. The negative effects of informal support systems. Personal relationships and social support: 122--139.","paperID":"None"},{"content":"Sharon Lamb and Susan Edgar-Smith. 1994. Aspects of disclosure mediators of outcome of childhood sexual abuse. Journal of Interpersonal Violence 9, 3: 307--326.","paperID":"None"},{"content":"Alex Leavitt. 2015. \"This is a Throwaway Account\": Temporary Technical Identities and Perceptions of Anonymity in a Massive Online Community. Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM.","paperID":"None"},{"content":"Christopher D. Manning, Prabhakar Raghavan, and Hinrich Schütze. 2008. Introduction to information retrieval. Cambridge University Press, New York.","paperID":"None"},{"content":"Gary T Marx. 1999. What's in a Name? Some Reflections on the Sociology of Anonymity. The Information Society 15, 2: 99--112.","paperID":"None"},{"content":"Marifran Mattson and Jennifer Gibb Hall. 2011. Health as communication nexus?: a service-learning approach.","paperID":"None"},{"content":"Wendy Moncur. 2013. The emotional wellbeing of researchers: considerations for practice. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1883--1890. Retrieved September 28, 2015 from http://dl.acm.org/citation.cfm?id=2466248","paperID":"None"},{"content":"Rosetta Moors and Ruth Webber. 2013. The dance of disclosure: Online self-disclosure of sexual assault. Qualitative Social Work 12, 6: 799--815.","paperID":"None"},{"content":"Minsu Park, David W McDonald, and Meeyoung Cha. 2013. Perception Differences between the Depressed and Non-Depressed Users in Twitter. Proceedings of the International AAAI Conference on Weblogs and Social Media.","paperID":"None"},{"content":"Jessica Pater, Oliver L Haimson, Nazanin Andalibi, and Elizabeth Mynatt. 2016. Hunger Hurts but Starving Works:\" Characterizing the Presentation of Eating Disorders Online. Proceedings of ACM Conference on Computer-Supported Cooperative Work and Social Computing, ACM.","paperID":"None"},{"content":"Umashanthi Pavalanathan and Munmun De Choudhury. 2015. Identity Management and Mental Health Discourse in Social Media. Proceedings of the 24th International Conference on World Wide Web Companion, International World Wide Web Conferences Steering Committee, 315--321.","paperID":"None"},{"content":"Jenny Preece. 1999. Empathic communities: Balancing emotional and factual communication. Interacting with computers 12, 1: 63--77.","paperID":"None"},{"content":"Antonia Quadara. 2008. Responding to young people disclosing sexual assault: A resource for schools. Australian Institute of Family Studies.","paperID":"None"},{"content":"Abuse & Incest National Network Rape. 2014. Reporting Rates. Retrieved from https://rainn.org/getinformation/statistics/reporting-rates","paperID":"None"},{"content":"Nicolas Schrading1 Cecilia O. Alm Ray and Ptucha1 Christopher M. Homan. An Analysis of Domestic Abuse Discourse on Reddit. anxiety 4183: 23300.","paperID":"None"},{"content":"Debra Rickwood, Frank P Deane, Coralie J Wilson, and Joseph Ciarrochi. 2005. Young people's help-seeking for mental health problems. Australian e-journal for the Advancement of Mental health 4, 3: 218--251.","paperID":"None"},{"content":"Bernard Rimé. 2009. Emotion elicits the social sharing of emotion: Theory and empirical review. Emotion Review 1, 1: 60--85.","paperID":"None"},{"content":"Elisa Romano and Rayleen V De Luca. 2001. Male sexual abuse: A review of effects, abuse characteristics, and links with later psychological functioning. Aggression and Violent Behavior 6, 1: 55--78.","paperID":"None"},{"content":"Sarita Yardi Schoenebeck. 2013. The Secret Life of Online Moms: Anonymity and Disinhibition on YouBeMom. com. Proceedings of the International AAAI Conference on Weblogs and Social Media.","paperID":"None"},{"content":"Pamela N Schultz. 2002. Providing information to patients with a rare cancer: using Internet discussion forums to address the needs of patients with medullary thyroid carcinoma. Clinical Journal of Oncology Nursing 6, 4: 219--222.","paperID":"None"},{"content":"Phillip Shaver, Judith Schwartz, Donald Kirson, and Cary O'Connor. 1987. Emotion knowledge: Further exploration of a prototype approach. Journal of Personality and Social Psychology 52, 6: 1061-1086. http://doi.org/10.1037/0022--3514.52.6.1061","paperID":"None"},{"content":"Barbara B Sinclair and Steven R Gold. 1997. The psychological impact of withholding disclosure of child sexual abuse. Violence and victims 12, 2: 137--145.","paperID":"None"},{"content":"Lynn Sorsoli, Maryam Kia-Keating, and Frances K Grossman. 2008. \" I keep that hush-hush\": Male survivors of sexual abuse and the challenges of disclosure. Journal of Counseling Psychology 55, 3: 333.","paperID":"None"},{"content":"Bureau of Justice Statistics. 2014. Number of rape/sexual assaults, robberies, aggravated assaults, and simple assaults, 2010--2014. Retrieved from http://www.bjs.gov/index.cfm?ty=nvat","paperID":"None"},{"content":"John Suler. 2004. The online disinhibition effect. Cyberpsychology & behavior?: the impact of the Internet, multimedia and virtual reality on behavior and society 7, 3: 321-326. http://doi.org/10.1089/1094931041291295","paperID":"None"},{"content":"Claire F Sullivan. 1996. Recipients' perceptions of support attempts across various stressful life events. Communication Research Reports 13, 2: 183--190.","paperID":"None"},{"content":"L. C. Tidwell and J. B. Walther. 2002. Computermediated communication effects on disclosure, impressions, and interpersonal evaluations: getting to know one another a bit at a time. Human Communication Research 28, 3: 317--348. http://doi.org/10.1093/hcr/28.3.317","paperID":"None"},{"content":"Sabine Trepte, Tobias Dienlin, and Leonard Reinecke. 2014. Influence of Social Support Received in Online and Offline Contexts on Satisfaction With Social Support and Satisfaction With Life: A Longitudinal Study. Media Psychology, ahead-of-print: 1--32.","paperID":"None"},{"content":"Sarah E Ullman. 2002. Social reactions to child sexual abuse disclosures: A critical review. Journal of child sexual abuse 12, 1: 89--121.","paperID":"None"},{"content":"Sarah E Ullman and Henrietta H Filipas. 2005. Gender differences in social reactions to abuse disclosures, postabuse coping, and PTSD of child sexual abuse survivors. Child abuse & neglect 29, 7: 767--782.","paperID":"None"},{"content":"Doug Urbanski. 2013. Upvoting the audience: a Burkean analysis of Reddit. Retrieved from http://thekeep.eiu.edu/cgi/viewcontent.cgi?article=2175&context=theses","paperID":"None"},{"content":"Joseph B Walther and Shawn Boyd. 2002. Attraction to computer-mediated social support. Communication technology and society: Audience adoption and uses 153188.","paperID":"None"},{"content":"Nancy Weinberg, John D Schmale, Janet Uken, and Keith Wessel. 1995. Computer-mediated support groups. Social Work with Groups 17, 4: 43--54.","paperID":"None"},{"content":"Kevin Wright. 2000. Perceptions of on-line support providers: An examination of perceived homophily, source credibility, communication and social support within on-line support groups. Communication Quarterly 48, 1: 44--59.","paperID":"None"},{"content":"Reddit API. Retrieved from http://www.reddit.com/dev/api","paperID":"None"}],"title":"Understanding Social Media Disclosures of Sexual Abuse Through the Lenses of Support Seeking and Anonymity","filename":"CHI16/p3906","authors":["Nazanin Andalibi","Oliver L. Haimson","Munmun De Choudhury","Andrea Forte"],"conference":"CHI '16"}