{"paperId":2858414,"citation":[],"reference":[{"content":"Irwin Altman and William W Haythorn. 1965. Interpersonal exchange in isolation. Sociometry (1965), 411-426.","paperID":"None"},{"content":"Irwin Altman and Dalmas Taylor. 1973. Social penetration theory. NY: Holt, Rinehart and Mnston (1973).","paperID":"None"},{"content":"John A Bargh, Katelyn YA McKenna, and Grainne M Fitzsimons. 2002. Can you see the real me? Activation and expression of the true self on the Internet. Journal of social issues 58, 1 (2002), 33-48.","paperID":"None"},{"content":"Natalya N Bazarova. 2012. Public intimacy: Disclosure interpretation and social judgments on Facebook. Journal of Communication 62, 5 (2012), 815-832.","paperID":"None"},{"content":"Natalya N Bazarova and Yoon Hyung Choi. 2014. Self-disclosure in social media: Extending the functional approach to disclosure motivations and characteristics on social network sites. Journal of Communication 64, 4 (2014), 635-657.","paperID":"None"},{"content":"Natalya N Bazarova, Yoon Hyung Choi, Victoria Schwanda Sosik, Dan Cosley, and Janis Whitlock. Social sharing of emotions on Facebook: Channel differences, satisfaction, and replies. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15).","paperID":"None"},{"content":"Michael S Bernstein, Andres Monroy-Hernandez, Drew Harry, Paul Andre, Katrina Panovich, and Gregory G Vargas. 2011. 4chan and /b/: An analysis of anonymity and ephemerality in a large online community. In Proceedings of the 5th AAAI International Conference on Weblogs and Social Media (ICWSM '11).","paperID":"None"},{"content":"Jeremy Birnholtz, Nicholas Aaron Ross Merola, and Arindam Paul. Is it weird to still be a virgin?: Anonymous, locally targeted questions on Facebook confession boards. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15).","paperID":"None"},{"content":"danah boyd. 2012. The politics of real names. Commun. ACM 55, 8 (2012), 29-31.","paperID":"None"},{"content":"Moira Burke and Mike Develin. Once More with Feeling: Supportive Responses to Social Sharing on Facebook. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16).","paperID":"None"},{"content":"Alan L Chaikin and Valerian J Derlega. 1974. Variables affecting the appropriateness of self-disclosure. Journal of Consulting and Clinical Psychology 42, 4 (1974), 588.","paperID":"None"},{"content":"Yan Chen, F. Maxwell Harper, Joseph Konstan, and Sherry Xin Li. 2010. Social comparisons and contributions to online communities: A field experiment on MovieLens. American Economic Review 100, 4 (2010), 1358-98.","paperID":"None"},{"content":"Kimberly M Christopherson. 2007. The positive and negative implications of anonymity in Internet social interactions: On the Internet, Nobody Knows You're a Dog. Computers in Human Behavior 23, 6 (2007), 3038-3056.","paperID":"None"},{"content":"Robert B Cialdini and Melanie R Trost. 1998. Social influence: Social norms, conformity and compliance. In The Handbook of Social Psychology, Vols. 1 and 2 (4th ed.), Daniel T. Gilbert, Susan T. Fiske, and Gardner Lindzey (Eds.). McGraw-Hill, 151-192.","paperID":"None"},{"content":"Denzil Correa, Leandro Araujo Silva, Mainack Mondal, Fabrficio Benevenuto, and Krishna P Gummadi. The Many Shades of Anonymity: Characterizing Anonymous Social Media Content. In Proceedings of the 9th AAAI International Conference on Weblogs and Social Media (ICWSM '15).","paperID":"None"},{"content":"Paul C Cozby. 1973. Self-disclosure: a literature review. Psychological bulletin 79, 2 (1973), 73.","paperID":"None"},{"content":"Valerian J Derlega and Alan L Chaikin. 1977. Privacy and self-disclosure in social relationships. Journal of Social Issues 33, 3 (1977), 102-115.","paperID":"None"},{"content":"Valerian J Derlega, Janusz Grzelak, and others. 1979. Appropriateness of self-disclosure. Self-disclosure: Origins, patterns, and implications of openness in interpersonal relationships (1979), 151-176.","paperID":"None"},{"content":"Valerian J Derlega, Barbara A Winstead, and Kathryn Greene. 2008. Self-disclosure and starting a close relationship. Handbook of relationship initiation (2008), 153-174.","paperID":"None"},{"content":"Joan Morris DiMicco and David R. Millen. 2007. Identity management: Multiple presentations of self in Facebook. In Proceedings of the 2007 international ACM conference on Supporting group work (GROUP '07).","paperID":"None"},{"content":"Howard J Ehrlich and David B Graeven. 1971. Reciprocal self-disclosure in a dyad. Journal of Experimental Social Psychology 7, 4 (1971), 389-400.","paperID":"None"},{"content":"Shelly D. Farnham and Elizabeth F. Churchill. 2011. Faceted identity, faceted lives: Social and technical issues with being yourself online. In Proceedings of the ACM 2011 conference on Computer supported cooperative work (CSCW '11).","paperID":"None"},{"content":"Jeana Frost, Ivar E Vermeulen, and Nienke Beekers. 2014. Anonymity versus privacy: selective information sharing in online cancer communities. Journal of medical Internet research 16, 5 (2014).","paperID":"None"},{"content":"Andrew Gelman. 2013. Preregistration of studies and mock reports. Political Analysis 21, 1 (2013), 40-41.","paperID":"None"},{"content":"Marvin R Goldfried, Lisa A Burckell, and Catherine Eubanks-Carter. 2003. Therapist self-disclosure in cognitive-behavior therapy. Journal of clinical psychology 59, 5 (2003), 555-568.","paperID":"None"},{"content":"Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, stress, and support during gender transition on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15).","paperID":"None"},{"content":"Erin E Hollenbaugh and Marcia K Everett. 2013. The effects of anonymity on self-disclosure in blogs: An application of the online disinhibition effect. Journal of Computer-Mediated Communication 18, 3 (2013), 283-302.","paperID":"None"},{"content":"Macartan Humphreys, Raul Sanchez de la Sierra, and Peter Van der Windt. 2013. Fishing, commitment, and communication: A proposal for comprehensive nonbinding research registration. Political Analysis 21, 1 (2013), 1-20.","paperID":"None"},{"content":"Sidney M Jourard. 1971. Self-disclosure: An experimental analysis of the transparent self. (1971).","paperID":"None"},{"content":"Sidney M Jourard and Paul Lasakow. 1958. Some factors in self-disclosure. The Journal of Abnormal and Social Psychology 56, 1 (1958), 91.","paperID":"None"},{"content":"Funda Kivran-Swaine, Jeremy Ting, Jed R Brubaker, Rannie Teodoro, and Mor Naaman. 2014. Understanding loneliness in social awareness streams: Expressions and responses. In Proceedings of the 8th AAAI International Conference on Weblogs and Social Media (ICWSM '14).","paperID":"None"},{"content":"Lee Knuttila. 2011. User unknown: 4chan, anonymity and contingency. First Monday 16, 10 (2011).","paperID":"None"},{"content":"Cliff Lampe, Jessica Vitak, Rebecca Gray, and Nicole Ellison. Perceptions of Facebook's value as an information source. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12).","paperID":"None"},{"content":"Julie D Lane and Daniel M Wegner. 1995. The cognitive consequences of secrecy. Journal of Personality and Social Psychology 69, 2 (1995), 237.","paperID":"None"},{"content":"Noam Lapidot-Lefler and Azy Barak. 2012. Effects of anonymity, invisibility, and lack of eye-contact on toxic online disinhibition. Computers in Human Behavior 28, 2 (2012), 434-443.","paperID":"None"},{"content":"Alice E Marwick and others. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New media & society 13, 1 (2011), 114-133.","paperID":"None"},{"content":"Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazons Mechanical Turk. Behavior research methods 44, 1 (2012), 1-23.","paperID":"None"},{"content":"Mark W Newman, Debra Lauterbach, Sean A Munson, Paul Resnick, and Margaret E Morris. It's not that I don't have problems, I'm just not putting them on Facebook: challenges and opportunities in using online social networks for health. In Proceedings of the ACM 2011 conference on Computer supported cooperative work (CSCW '11).","paperID":"None"},{"content":"Julia Omarzu. 2000. A disclosure decision model: Determining how and when individuals will self-disclose. Personality and Social Psychology Review 4, 2 (2000), 174-185.","paperID":"None"},{"content":"W Babnett Pearce and Stewart M Sharp. 1973. Self-disclosing communication. Journal of Communication 23, 4 (1973), 409-425.","paperID":"None"},{"content":"James W Pennebaker. 1989. Confession, inhibition, and disease. Advances in experimental social psychology 22 (1989), 211-244.","paperID":"None"},{"content":"James W Pennebaker. 1993. Putting stress into words: Health, linguistic, and therapeutic implications. Behaviour research and therapy 31, 6 (1993), 539-548.","paperID":"None"},{"content":"James W Pennebaker. 2012. Opening up: The healing power of expressing emotions. Guilford Press.","paperID":"None"},{"content":"Tom Postmes, Russell Spears, Khaled Sakhel, and Daphne de Groot. 2001. Social influence in computer-mediated communication: The effects of anonymity on group behavior. Personality and Social Psychology Bulletin 27, 10 (2001), 1243-1254.","paperID":"None"},{"content":"Stephen D Reicher, Russell Spears, and Tom Postmes. 1995. A social identity model of deindividuation phenomena. European review of social psychology 6, 1 (1995), 161-198.","paperID":"None"},{"content":"Craig Ross, Emily S Orr, Mia Sisic, Jaime M Arseneault, Mary G Simmering, and R Robert Orr. 2009. Personality and motivations associated with Facebook use. Computers in human behavior 25, 2 (2009), 578-586.","paperID":"None"},{"content":"Zick Rubin. 1975. Disclosing oneself to a stranger: Reciprocity and its limits. Journal of Experimental Social Psychology 11, 3 (1975), 233-260.","paperID":"None"},{"content":"Zick Rubin and Stephen Shenker. 1978. Friendship, proximity, and self-disclosure. Journal of Personality 46, 1 (1978), 1-22.","paperID":"None"},{"content":"Richard M Ryan and Edward L Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American psychologist 55, 1 (2000), 68.","paperID":"None"},{"content":"Georg Simmel. 1950. The stranger. The sociology of Georg Simmel (1950), 402-408.","paperID":"None"},{"content":"William B Stiles. 1987. I have to talk to somebody. In Self-disclosure. Springer, 257-282.","paperID":"None"},{"content":"Abhay Sukumaran, Stephanie Vezich, Melanie McHugh, and Clifford Nass. 2011. Normative influences on thoughtful online participation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11).","paperID":"None"},{"content":"John Suler. 2004. The online disinhibition effect. Cyberpsychology & behavior 7, 3 (2004), 321-326.","paperID":"None"},{"content":"Diana I Tamir and Jason P Mitchell. 2012. Disclosing information about the self is intrinsically rewarding. Proceedings of the National Academy of Sciences 109, 21 (2012), 8038-8043.","paperID":"None"},{"content":"Sherry Turkle. 1995. Life on the screen: Identity in the age of the Internet. Simon & Schuster Trade.","paperID":"None"},{"content":"Jeanine Warisse Turner, Jean A Grube, and Jennifer Meyers. 2001. Developing an optimal match within online communities: An exploration of CMC support communities and traditional support. Journal of Communication 51, 2 (2001), 231-251.","paperID":"None"},{"content":"Jessica Vitak and Jinyoung Kim. 2014. \"You can't block people offline\": Examining how Facebook's affordances shape the disclosure process. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14).","paperID":"None"},{"content":"Elizabeth Needham Waddell and Peter A Messeri. 2006. Social support, disclosure, and use of antiretroviral therapy. AIDS and Behavior 10, 3 (2006), 263-272.","paperID":"None"},{"content":"Gang Wang, Bolun Wang, Tianyi Wang, Ana Nika, Haitao Zheng, and Ben Y Zhao. Whispers in the dark: analysis of an anonymous social network. In Proceedings of the 2014 Conference on Internet Measurement Conference (IMC '14).","paperID":"None"},{"content":"Daniel M Wegner. 1989. White bears and other unwanted thoughts: Suppression, obsession, and the psychology of mental control. Penguin Press.","paperID":"None"},{"content":"Daniel M Wegner, David J Schneider, Samuel R Carter, and Teri L White. 1987. Paradoxical effects of thought suppression. Journal of personality and social psychology 53, 1 (1987), 5.","paperID":"None"},{"content":"Dongqing Zhu and Ben Carterette. 2010. An analysis of assessor behavior in crowdsourced preference judgments. In SIGIR 2010 workshop on crowdsourcing for search evaluation. 17-20.","paperID":"None"}],"abstract":"Self-disclosure is rewarding and provides significant benefits for individuals, but it also involves risks, especially in social media settings. We conducted an online experiment to study the relationship between content intimacy and willingness to self-disclose in social media, and how identification (real name vs. anonymous) and audience type (social ties vs. people nearby) moderate that relationship. Content intimacy is known to regulate self-disclosure in face-to-face communication: people self-disclose less as content intimacy increases. We show that such regulation persists in online social media settings. Further, although anonymity and an audience of social ties are both known to increase self-disclosure, it is unclear whether they (1) increase self-disclosure baseline for content of all intimacy levels, or (2) weaken intimacy's regulation effect, making people more willing to disclose intimate content. We show that intimacy always regulates self-disclosure, regardless of settings. We also show that anonymity mainly increases self-disclosure baseline and (sometimes) weakens the regulation. On the other hand, an audience of social ties increases the baseline but strengthens the regulation. Finally, we demonstrate that anonymity has a more salient effect on content of negative valence.The results are critical to understanding the dynamics and opportunities of self-disclosure in social media services that vary levels of identification and types of audience.","title":"Anonymity, Intimacy and Self-Disclosure in Social Media","filename":"CHI16/p3857","authors":["Xiao Ma","Jeff Hancock","Mor Naaman"],"conference":"CHI '16"}