{"paperId":2858316,"citation":[],"reference":[{"content":"Jason Alexander, Andrés Lucero, and Sriram Subramanian, Tilt displays: designing display surfaces with multi-axis tilting and actuation, in Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services. 2012, ACM: San Francisco, California, USA. p. 161--170.","paperID":"None"},{"content":"Matthew Blackshaw, Anthony DeVincenzi, David Lakatos, Daniel Leithinger, and Hiroshi Ishii, Recompose: direct and gestural interaction with an actuated surface, in CHI '11 Extended Abstracts on Human Factors in Computing Systems. 2011, ACM: Vancouver, BC, Canada. p. 1237--1242.","paperID":"None"},{"content":"Marcelo Coelho and Jamie Zigelbaum, Shapechanging interfaces. Personal Ubiquitous Comput., 2011. 15(2): p. 161--173.","paperID":"None"},{"content":"Andy Crabtree, Alan Chamberlain, Rebecca E. Grinter, Matt Jones, Tom Rodden, and Yvonne Rogers, Introduction to the Special Issue of \"The Turn to The Wild\". ACM Trans. Comput.-Hum. Interact., 2013. 20(3): p. 1--4.","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii, inFORM: dynamic physical affordances and constraints through shape and object actuation, in Proceedings of the 26th annual ACM symposium on User interface software and technology. 2013, ACM: St. Andrews, Scotland, United Kingdom. p. 417--426.","paperID":"None"},{"content":"John Hardy, Christian Weichel, Faisal Taher, John Vidler, and Jason Alexander, ShapeClip: Towards Rapid Prototyping with Shape-Changing Displays for Designers, in Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2015, ACM: Seoul, Republic of Korea. p. 19--28.","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson, Providing dynamically changeable physical buttons on a visual display, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2009, ACM: Boston, MA, USA. p. 299--308.","paperID":"None"},{"content":"Hiroo Iwata, Hiroaki Yano, Fumitaka Nakaizumi, and Ryo Kawamura, Project FEELEX: adding haptic surface to graphics, in Proceedings of the 28th annual conference on Computer graphics and interactive techniques. 2001, ACM. p. 469--476.","paperID":"None"},{"content":"Yvonne Jansen and Pierre Dragicevic, An Interaction Model for Visualizations Beyond The Desktop. IEEE Transactions on Visualization and Computer Graphics, 2013. 19(12): p. 2396--2405.","paperID":"None"},{"content":"Hyunjung Kim and Woohun Lee, Kinetic tiles, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2011, ACM: Vancouver, BC, Canada. p. 1279--1282.","paperID":"None"},{"content":"Daniel Leithinger and Hiroshi Ishii, Relief: a scalable actuated shape display, in Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction. 2010, ACM: Cambridge, Massachusetts, USA. p. 221--222.","paperID":"None"},{"content":"Daniel Leithinger, David Lakatos, Anthony DeVincenzi, Matthew Blackshaw, and Hiroshi Ishii, Direct and gestural interaction with relief: a 2.5D shape display, in Proceedings of the 24th annual ACM symposium on User interface software and technology. 2011, ACM: Santa Barbara, California, USA. p. 541548.","paperID":"None"},{"content":"Gian Pangaro, Dan Maynes-Aminzade, and Hiroshi Ishii, The actuated workbench: computer-controlled actuation in tabletop tangible interfaces, in Proceedings of the 15th annual ACM symposium on User interface software and technology. 2002, ACM: Paris, France. p. 181--190.","paperID":"None"},{"content":"Ivan Poupyrev, Tatsushi Nashida, and Makoto Okabe, Actuation and tangible user interfaces: the Vaucanson duck, robots, and shape displays, in Proceedings of the 1st international conference on Tangible and embedded interaction. 2007, ACM: Baton Rouge, Louisiana. p. 205--212.","paperID":"None"},{"content":"Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk, Shape-changing interfaces: a review of the design space and open research questions, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2012, ACM: Austin, Texas, USA. p. 735--744.","paperID":"None"},{"content":"Kimiko Ryokai, Stefan Marti, and Hiroshi Ishii, I/O brush: drawing with everyday objects as ink, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2004, ACM: Vienna, Austria. p. 303--310.","paperID":"None"},{"content":"Miriam Sturdee, John Hardy, Nick Dunn, and Jason Alexander, A Public Ideation of Shape-Changing Applications. in Interactive Tabletops and Surfaces (ITS'15). 2015, ACM: Madeira, Portugal. p. 219--228.","paperID":"None"},{"content":"Faisal Taher, John Hardy, Abhijit Karnik, Christian Weichel, Yvonne Jansen, Kasper Hornbæk, and Jason Alexander, Exploring Interactions with Physically Dynamic Bar Charts, in Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2015, ACM: Seoul, Republic of Korea. p. 3237--3246.","paperID":"None"},{"content":"Jun-ichiro Watanabe, Arito Mochizuki, and Youichi Horry, Bookisheet: bendable device for browsing content using the metaphor of leafing through the pages, in Proceedings of the 10th international conference on Ubiquitous computing. 2008, ACM: Seoul, Korea. p. 360--369.","paperID":"None"},{"content":"Salu Ylirisku, Siân Lindley, Giulio Jacucci, Richard Banks, Craig Stewart, Abigail Sellen, Richard Harper, and Tim Regan, Designing web-connected physical artefacts for the 'aesthetic' of the home, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2013, ACM: Paris, France. p. 909--918.","paperID":"None"}],"abstract":"Shape-changing displays - visual output surfaces with physically-reconfigurable geometry - provide new challenges for content generation. Content design must incorporate visual elements, physical surface shape, react to user input, and adapt these parameters over time. The addition of the 'shape channel' significantly increases the complexity of content design, but provides a powerful platform for novel physical design, animations, and physicalizations. In this work we use ShapeCanvas, a 4×4 grid of large actuated pixels, combined with simple interactions, to explore novice user behavior and interactions for shape-change content design. We deployed ShapeCanvas in a café for two and a half days and observed users generate 21 physical animations. These were categorized into seven categories and eight directly derived from people's personal interest. This paper describes these experiences, the generated animations and provides initial insights into shape-changing content design.","title":"ShapeCanvas: An Exploration of Shape-Changing Content Generation by Members of the Public","filename":"CHI16/p2778","authors":["Aluna Everitt","Faisal Taher","Jason Alexander"],"conference":"CHI '16"}