{"paperId":2858487,"citation":[],"reference":[{"content":"J. Blake and H.B. Gurocak. 2009. Haptic Glove With MR Brakes for Virtual Reality. Mechatronics, IEEE/ASME Transactions on 14, 5 (Oct 2009), 606--615. DOI: http://dx.doi.org/10.1109/TMECH.2008.2010934","paperID":"None"},{"content":"M. Bouzit, G. Burdea, G. Popescu, and R. Boian. 2002. The Rutgers Master II-new design force-feedback glove. Mechatronics, IEEE/ASME Transactions on 7, 2 (Jun 2002), 256--263. DOI: http://dx.doi.org/10.1109/TMECH.2002.1011262","paperID":"None"},{"content":"T. Endo, H. Kawasaki, T. Mouri, Y. Doi, T. Yoshida, Y. Ishigure, H. Shimomura, M. Matsumura, and K. Koketsu. 2009. Five-fingered haptic interface robot: HIRO III. In EuroHaptics conference, 2009 and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. World Haptics 2009. Third Joint. 458--463. DOI: http://dx.doi.org/10.1109/WHC.2009.4810812","paperID":"None"},{"content":"Brent Edward Insko. 2001. Passive Haptics Significantly Enhances Virtual Environments. Ph.D. Dissertation. University of North Carolina at Chapel Hill. http://www.cs.unc.edu/techreports/01-017.pdf","paperID":"None"},{"content":"T. Koyama, I. Yamano, K. Takemura, and T. Maeno. 2002. Multi-fingered exoskeleton haptic device using passive force feedback for dexterous teleoperation. In Intelligent Robots and Systems, 2002. IEEE/RSJ International Conference on, Vol. 3. 2905--2910 vol.3. DOI:http://dx.doi.org/10.1109/IRDS.2002.1041713","paperID":"None"},{"content":"Zhou Ma and P. Ben-Tzvi. 2015. RML Glove;An Exoskeleton Glove Mechanism With Haptics Feedback. Mechatronics, IEEE/ASME Transactions on 20, 2 (April 2015), 641--652. DOI: http://dx.doi.org/10.1109/TMECH.2014.2305842","paperID":"None"},{"content":"T. H. MASSIE. 1994. The PHANToM Haptic Interface : A Device for Probing Virtual Objects. Proceedings of the ASME Winter Annual Meeting, Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, Chicago, IL, Nov., 1994 (1994). http://ci.nii.ac.jp/naid/10018008840/en/","paperID":"None"},{"content":"Katsunari Sato, Kouta Minamizawa, Naoki Kawakami, and Susumu Tachi. 2007. Haptic Telexistence. In ACM SIGGRAPH 2007 Emerging Technologies (SIGGRAPH '07). ACM, New York, NY, USA, Article 10. DOI: http://dx.doi.org/10.1145/1278280.1278291","paperID":"None"},{"content":"Cyberglove Systems. 2015. Hand Motion Capturing and Force Feedback with Cybergrasp. (2015). http://www.cyberglovesystems.com/ [Online; accessed 25-September-2015].","paperID":"None"}],"abstract":"We present Dexmo: an inexpensive and lightweight mechanical exoskeleton system for motion capturing and force feedback in virtual reality applications. Dexmo combines multiple types of sensors, actuation units and link rod structures to provide users with a pleasant virtual reality experience. The device tracks the user's motion and uniquely provides passive force feedback. In combination with a 3D graphics rendered environment, Dexmo provides the user with a realistic sensation of interaction when a user is for example grasping an object. An initial evaluation with 20 participants demonstrate that the device is working reliably and that the addition of force feedback resulted in a significant reduction in error rate. Informal comments by the participants were overwhelmingly positive.","title":"Dexmo: An Inexpensive and Lightweight Mechanical Exoskeleton for Motion Capture and Force Feedback in VR","filename":"CHI16/p1991","authors":["Xiaochi Gu","Yifei Zhang","Weize Sun","Yuanzhe Bian","Dao Zhou","Per Ola Kristensson"],"conference":"CHI '16"}