{"paperId":2858533,"citation":[],"reference":[{"content":"Swamy Ananthanarayan, Nathan Lapinski, Katie Siek, and Michael Eisenberg. 2014. Towards the crafting of personal health technologies. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 587--596. http://dx.doi.org/10.1145/2598510.2598581","paperID":"None"},{"content":"Rafael Ballagas, Meredith Ringel, Maureen Stone, and Jan Borchers. 2003. iStuff: a physical user interface toolkit for ubiquitous computing environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 537--544. http://dx.doi.org/10.1145/642611.642705","paperID":"None"},{"content":"Massimo Banzi. 2009. Getting Started with Arduino. Make: Books, O'Reilly Media, Inc., Sebastopol, CA, USA.","paperID":"None"},{"content":"Jon Bird, Paul Marshall, and Yvonne Rogers. 2009. Low-fi skin vision: a case study in rapid prototyping a sensory substitution system. In Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology (BCSHCI '09). British Computer Society, Swinton, UK, UK, 55--64.","paperID":"None"},{"content":"Tracey Booth and Simone Stumpf. 2013. End-user experiences of visual and textual programming environments for Arduino. In End-User Development, Yvonne Dittrich, Margaret Burnett, Anders Mørch and David Redmiles (eds.). Springer Berlin Heidelberg, 25-39. http://dx.doi.org/10.1007/978--3--642--38706--7_4","paperID":"None"},{"content":"Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. 2008. The LilyPad Arduino: using computational textiles to investigate engagement, aesthetics, and diversity in computer science education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 423--432. http://dx.doi.org/10.1145/1357054.1357123","paperID":"None"},{"content":"Margaret Burnett, Curtis Cook, Omkar Pendse, Gregg Rothermel, Jay Summet, and Chris Wallace. 2003. End-user software engineering with assertions in the spreadsheet paradigm. In Proceedings of the 25th International Conference on Software Engineering (ICSE '03). IEEE Computer Society, Washington, DC, USA, 93--103. http://doi.org/10.1109/ICSE.2003.1201191","paperID":"None"},{"content":"Margaret Burnett, Curtis Cook, and Gregg Rothermel. 2004. End-user software engineering. Commun. ACM 47, 9 (September 2004), 53--58. http://dx.doi.org/10.1145/1015864.1015889","paperID":"None"},{"content":"Jill Cao, Scott D. Fleming, Margaret Burnett, and Christopher Scaffidi. 2014. Idea Garden: Situated support for problem solving by end-user programmers. Interacting with Computers 27, 6 (November 2015): 640-660. http://doi.org/10.1093/iwc/iwu022","paperID":"None"},{"content":"Jill Cao, Yann Riche, Susan Wiedenbeck, Margaret Burnett, and Valentina Grigoreanu. 2010. End-user mashup programming: through the design lens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1009--1018. http://dx.doi.org/10.1145/1753326.1753477","paperID":"None"},{"content":"Deborah R. Compeau and Christopher A. Higgins. 1995. Computer self-efficacy: development of a measure and initial test. MIS Quarterly 19, 2: 189-211. http://doi.org/10.2307/249688","paperID":"None"},{"content":"Brock Craft. 2013. Ten Troubleshooting Tips. In Arduino Projects for Dummies (1st edition). John Wiley & Sons, Ltd., Chichester, West Sussex, UK, 359-367.","paperID":"None"},{"content":"Paul Curzon and Ian Leslie. 1996. Improving hardware designs whilst simplifying their proof. In Proceedings of the 3rd International Conference on Designing Correct Circuits (DCC '96), Mary Sheeran and Satnam Singh (Eds.). British Computer Society, Swinton, UK.","paperID":"None"},{"content":"Irena Pletikosa Cvijikj and Florian Michahelles. 2011. The toolkit approach for end-user participation in the Internet of Things. In Architecting the Internet of Things, Dieter Uckelmann, Mark Harrison and Florian Michahelles (eds.). Springer Berlin Heidelberg, 65-96. http://doi.org/10.1007/978--3--642--19157--2_4","paperID":"None"},{"content":"Allen Cypher, Mira Dontcheva, Tessa Lau, and Jeffrey Nichols. 2010. No Code Required: Giving Users Tools to Transform the Web. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.","paperID":"None"},{"content":"Sarah Gallacher, Jenny O'Connor, Jon Bird, Yvonne Rogers, Licia Capra, Daniel Harrison, and Paul Marshall. 2015. Mood Squeezer: lightening up the workplace through playful and lightweight interactions. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 891--902. http://dx.doi.org/10.1145/2675133.2675170","paperID":"None"},{"content":"Saul Greenberg and Chester Fitchett. 2001. Phidgets: easy development of physical interfaces through physical widgets. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, NY, NY, USA, 209--218. http://dx.doi.org/10.1145/502348.502388","paperID":"None"},{"content":"Valentina I. Grigoreanu, Margaret M. Burnett, and George G. Robertson. 2010. A strategy-centric approach to the design of end-user debugging tools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 713--722. http://dx.doi.org/10.1145/1753326.1753431","paperID":"None"},{"content":"Alex Groce, Todd Kulesza, Chaoqiang Zhang, Shalini Shamasunder, Margaret Burnett, Weng-Keen Wong, Simone Stumpf, Shubhomoy Das, Amber Shinsel, Forrest Bice, and Kevin McIntosh. 2014. You are the only possible oracle: effective test selection for end users of interactive machine learning systems. IEEE Trans. Softw. Eng. 40, 3 (March 2014), 307--323. http://dx.doi.org/10.1109/TSE.2013.59","paperID":"None"},{"content":"Björn Hartmann, Scott R. Klemmer, Michael Bernstein, Leith Abdulla, Brandon Burr, Avi Robinson-Mosher, and Jennifer Gee. 2006. Reflective physical prototyping through integrated design, test, and analysis. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, NY, NY, USA, 299--308. http://dx.doi.org/10.1145/1166253.1166300","paperID":"None"},{"content":"Dan O'Sullivan and Tom Igoe. 2004. Physical Computing: Sensing and Controlling the Physical World with Computers. Course Technology Press, Boston, MA, USA.","paperID":"None"},{"content":"Tom Jenkins and Ian Bogost. 2014. Designing for the Internet of Things: prototyping material interactions. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 731--740. http://dx.doi.org/10.1145/2559206.2578879","paperID":"None"},{"content":"Vaiva Kalnikaite, Yvonne Rogers, Jon Bird, Nicolas Villar, Khaled Bachour, Stephen Payne, Peter M. Todd, Johannes Schöning, Antonio Krüger, and Stefan Kreitmayer. 2011. How to nudge in Situ: designing lambent devices to deliver salient information in supermarkets. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11). ACM, NY, NY, USA, 11--20. http://dx.doi.org/10.1145/2030112.2030115","paperID":"None"},{"content":"Cory Kissinger, Margaret Burnett, Simone Stumpf, Neeraja Subrahmaniyan, Laura Beckwith, Sherry Yang, and Mary Beth Rosson. 2006. Supporting enduser debugging: what do users want to know?. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '06). ACM, NY, NY, USA, 135--142. http://dx.doi.org/10.1145/1133265.1133293","paperID":"None"},{"content":"André Knörig, Reto Wettach, and Jonathan Cohen. 2009. Fritzing: a tool for advancing electronic prototyping for designers. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (TEI '09). ACM, NY, NY, USA, 351--358. http://dx.doi.org/10.1145/1517664.1517735","paperID":"None"},{"content":"Andrew J. Ko and Brad A. Myers. 2005. A framework and methodology for studying the causes of software errors in programming systems. J. Vis. Lang. Comput. 16, 1--2 (February 2005), 41--84. http://dx.doi.org/10.1016/j.jvlc.2004.08.003","paperID":"None"},{"content":"Andrew J. Ko, Brad A. Myers, and Htet Htet Aung. 2004. Six Learning Barriers in End-User Programming Systems. In Proceedings of the 2004 IEEE Symposium on Visual Languages and Human-Centric Computing (VLHCC '04). IEEE Computer Society, Washington, DC, USA, 199--206. http://dx.doi.org/10.1109/VLHCC.2004.47","paperID":"None"},{"content":"Thomas Kubitza and Albrecht Schmidt. 2015. Towards a toolkit for the rapid creation of smart environments. In End-User Development, Paloma Díaz, Volkmar Pipek, Carmelo Ardito, Carlos Jensen, Ignacio Aedo and Alexander Boden (eds.). Springer International Publishing, 230-235. http://doi.org/10.1007/978--3319--18425--8_21","paperID":"None"},{"content":"Todd Kulesza, Simone Stumpf, Weng-Keen Wong, Margaret M. Burnett, Stephen Perona, Andrew Ko, and Ian Oberst. 2011. Why-oriented end-user debugging of naive Bayes text classification. ACM Trans. Interact. Intell. Syst. 1, 1 (October 2011), 2:1-2:31. http://doi.org/10.1145/2030365.2030367","paperID":"None"},{"content":"Sandeep Kaur Kuttal, Anita Sarma, and Gregg Rothermel. 2013. Debugging support for end user mashup programming. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1609--1618. http://dx.doi.org/10.1145/2470654.2466213","paperID":"None"},{"content":"Michael J. Lee, Faezeh Bahmani, Irwin Kwan, et al. 2014. Principles of a debugging-first puzzle game for computing education. Proceedings of the 2014 IEEE Symposium on Visual Languages and Human-Centric Computing (VLHCC '14), IEEE Computer Society, 57-64. http://doi.org/10.1109/VLHCC.2014.6883023","paperID":"None"},{"content":"Alan Lesgold, Susanne Lajoie, Marilyn Bunzo, and Gary Eggan. 1992. SHERLOCK: A coached practice environment for an electronics troubleshooting job. In Computer-Assisted Instruction and Intelligent Tutoring Systems: Shared Goals and Complementary Approaches, Jill H. Larkin and Ruth W. Chabay (eds.). Lawrence Erlbaum Associates, Hillsdale, NJ, 201-238.","paperID":"None"},{"content":"Henry Lieberman. 2001. Your Wish is My Command: Programming by Example. Morgan Kaufmann, San Francisco.","paperID":"None"},{"content":"Amon Millner and Edward Baafi. 2011. Modkit: blending and extending approachable platforms for creating computer programs and interactive objects. In Proceedings of the 10th International Conference on Interaction Design and Children (IDC '11). ACM, NY, NY, USA, 250--253. http://dx.doi.org/10.1145/1999030.1999074","paperID":"None"},{"content":"John F. Pane and Brad A. Myers. 1996. Usability Issues in the Design of Novice Programming Systems. Carnegie Mellon University, School of Computer Science Technical Report Carnegie Mellon University-CS-96--132, Pittsburgh, PA. Retrieved from http://repository.cmu.edu/isr/820","paperID":"None"},{"content":"John F. Pane and Brad A. Myers. 2006. More natural programming languages and environments. In End User Development, Henry Lieberman, Fabio Paternò and Volker Wulf (eds.). Springer Netherlands, 31-50. http://doi.org/10.1007/1--4020--5386-X_3","paperID":"None"},{"content":"James Reason. 1990. Human Error. Cambridge University Press, Cambridge England?; NY.","paperID":"None"},{"content":"M. Resnick, F. Martin, R. Sargent, and B. Silverman. 1996. Programmable Bricks: toys to think with. IBM Systems Journal 35, 3.4: 443-452. http://doi.org/10.1147/sj.353.0443","paperID":"None"},{"content":"Dries De Roeck, Karin Slegers, Johan Criel, Marc Godon, Laurence Claeys, Katriina Kilpi, and An Jacobs. 2012. I would DiYSE for it!: a manifesto for do-it-yourself internet-of-things creation. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense through Design (NordiCHI '12). ACM, NY, NY, USA, 170--179. http://dx.doi.org/10.1145/2399016.2399044","paperID":"None"},{"content":"Yvonne Rogers, Jeni Paay, Margot Brereton, Kate L. Vaisutis, Gary Marsden, and Frank Vetere. 2014. Never too old: engaging retired people inventing the future with MaKey MaKey. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 39133922. http://dx.doi.org/10.1145/2556288.2557184","paperID":"None"},{"content":"Joshua G. Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing technology: pleasure, utility and expressiveness in DIY and maker practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2603--2612. http://dx.doi.org/10.1145/2470654.2481360","paperID":"None"},{"content":"Chris Taylor. 2010. Beginner Troubleshooting SparkFun Electronics. SparkFun. Retrieved September 23, 2015 from https://www.sparkfun.com/tutorials/226","paperID":"None"},{"content":"Daniel Tetteroo, Iris Soute, and Panos Markopoulos. 2013. Five key challenges in end-user development for tangible and embodied interaction. In Proceedings of the 15th ACM International Conference on Multimodal Interaction (ICMI '13). ACM, NY, NY, USA, 247--254. http://dx.doi.org/10.1145/2522848.2522887","paperID":"None"},{"content":"Blase Ur, Elyse McManus, Melwyn Pak Yong Ho, and Michael L. Littman. 2014. Practical trigger-action programming in the smart home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 803812. http://dx.doi.org/10.1145/2556288.2557420","paperID":"None"},{"content":"Nicolas Villar, James Scott, and Steve Hodges. 2011. Prototyping with Microsoft .Net Gadgeteer. Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11), ACM, NY, NY, USA, 377--380. http://dx.doi.org/10.1145/1935701.1935790","paperID":"None"},{"content":"Ron Wakkary, Markus Lorenz Schilling, Matthew A. Dalton, Sabrina Hauser, Audrey Desjardins, Xiao Zhang, and Henry W.J. Lin. 2015. Tutorial authorship and hybrid Designers: The Joy (and Frustration) of DIY Tutorials. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 609--618. http://dx.doi.org/10.1145/2702123.2702550","paperID":"None"},{"content":"Maurice V. Wilkes. 1985. Memoirs of a Computer Pioneer. The MIT Press, Cambridge, MA, USA.","paperID":"None"},{"content":"123D Circuits Electronics Lab. Autodesk 123D Circuits. Retrieved July 12, 2015 from https://123d.circuits.io/lab","paperID":"None"},{"content":"TMP36 datasheet and product info | Voltage Output Temperature Sensors | Analog Devices. Retrieved September 21, 2015 from http://www.analog.com/en/products/analog-to-digitalconverters/integrated-special-purposeconverters/integrated-temperature-sensors/tmp36.html","paperID":"None"},{"content":"Arduino Starter Kit. Retrieved July 21, 2015 from https://www.arduino.cc/en/Main/ArduinoStarterKit","paperID":"None"}],"abstract":"Considerable research has focused on the problems that end users face when programming software, in order to help them overcome their difficulties, but there is little research into the problems that arise in physical computing when end users construct circuits and program them. In an empirical study, we observed end-user developers as they connected a temperature sensor to an Arduino microcontroller and visualized its readings using LEDs. We investigated how many problems participants encountered, the problem locations, and whether they were overcome. We show that most fatal faults were due to incorrect circuit construction, and that often problems were wrongly diagnosed as program bugs. Whereas there are development environments that help end users create and debug software, there is currently little analogous support for physical computing tasks. Our work is a first step towards building appropriate tools that support end-user developers in overcoming obstacles when constructing physical computing artifacts.","title":"Crossed Wires: Investigating the Problems of End-User Developers in a Physical Computing Task","filename":"CHI16/p3485","authors":["Tracey Booth","Simone Stumpf","Jon Bird","Sara Jones"],"conference":"CHI '16"}