{"paperId":2858520,"reference":[{"content":"Teresa M. Amabile and Regina Conti. 1999. Changes in the work environment for creativity during downsizing. Academy of Management Journal 42, 6 (12 1999), 630--640. http://search.proquest.com/docview/199842575?accountid=14709","paperID":"None"},{"content":"Evi De Bruyne and Annelise De Jong. 2009. The Workplace Game: exploring end users' new behaviour. In Proceedings of the 2nd International conference on Applied human factors and ergonomics, AHFE'08, Las Vegas, USA, July 14--17, 2008. Authors version.","paperID":"None"},{"content":"Joan DiMicco, David R Millen, Werner Geyer, Casey Dugan, Beth Brownholtz, and Michael Muller. 2008. Motivations for social networking at work. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. ACM, 711--720.","paperID":"None"},{"content":"Paul Dourish and Sara Bly. 1992. Portholes: Supporting awareness in a distributed work group. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 541--547.","paperID":"None"},{"content":"Casey Dugan, Sven Laumer, Thomas Erickson, Wendy Kellogg, and Werner Geyer. 2015. The# selfiestation: Design and Use of a Kiosk for Taking Selfies in the Enterprise. In Human-Computer Interaction-INTERACT 2015. Springer, 38--46.","paperID":"None"},{"content":"Jason Fang. 2014. Two friends, two cities and 100 days. ABC Radio Australia (2014). http://www.radioaustralia.net.au/international/2014-07-04/ two-friends-two-cities-and-100-days/1337948","paperID":"None"},{"content":"Rosta Farzan, Joan M DiMicco, David R Millen, Casey Dugan, Werner Geyer, and Elizabeth A Brownholtz. 2008. Results from deploying a participation incentive mechanism within the enterprise. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 563--572.","paperID":"None"},{"content":"Adam Grant. 2015. Friends at Work? Not So Much. The New York Times (2015).","paperID":"None"},{"content":"Saul Greenberg and Michael Rounding. 2001. The notification collage: posting information to public and personal displays. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 514--521.","paperID":"None"},{"content":"Ido Guy, Adam Perer, Tal Daniel, Ohad Greenshpan, and Itai Turbahn. 2011. Guess who?: enriching the social graph through a crowdsourcing game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1373--1382.","paperID":"None"},{"content":"Beth A. Hennessey and Teresa M. Amabile. 2010. Creativity. Annual Review of Psychology 61, 1 (2010), 569--598. DOI: http://dx.doi.org/10.1146/annurev.psych.093008.100416 PMID: 19575609.","paperID":"None"},{"content":"Hui Liao, Dong Liu, and Raymond Loi. 2010. Looking at both sides of the social exchange coin: A social cognitive perspective on the joint effects of relationship quality and differentiation on creativity. Academy of Management Journal 53, 5 (2010), 1090--1109.","paperID":"None"},{"content":"Liang-Hung Lin, Wei-Hsin Eugenia Lin, Ching-Yi Wu, and Yu-Ling Ho. 2014. Creativity, And Innovation At Workplace: The Moderating Role Of Playfulness Climate. International Journal of Art Humanity Science (2014).","paperID":"None"},{"content":"Joseph F McCarthy, Ben Congleton, and F Maxwell Harper. 2008. The context, content & community collage: sharing personal digital media in the physical workplace. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. ACM, 97--106.","paperID":"None"},{"content":"Helena M Mentis, Sian E Lindley, Stuart Taylor, Paul Dunphy, Tim Regan, and Richard Harper. 2012. Taking as an act of sharing. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 1091--1100.","paperID":"None"},{"content":"Linda M Peters and Charles C Manz. 2007. Identifying antecedents of virtual team collaboration. Team Performance Management: An International Journal 13, 3/4 (2007), 117--129.","paperID":"None"},{"content":"Jennifer Thom-Santelli and David R Millen. 2009. Learning by seeing: photo viewing in the workplace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2081--2090.","paperID":"None"},{"content":"Dr. B. Vimala and A Jerina Bee. 2014. A Study On Relationship Between Workplace Fun Culture And Creativity Among It Professionals In Chennai. Journal of International academic research for multidisciplinary 2, 10 (2014).","paperID":"None"},{"content":"Samuel West and ECC Shiu. 2014. Play as a facilitator of organizational creativity. Creativity research: An inter-disciplinary and multi-disciplinary research handbook (2014), 191--206.","paperID":"None"}],"citation":[],"abstract":"We present a photo co-creation activity, called \"Stitched Groupies,\" in a photo-taking and sharing platform deployed inside IBM. \"Stitched Groupies\" allow employees to take and combine photos with peers asynchronously across physical boundaries. In a 25-day exploratory field study with 50 users taking 68 half-photos (of which 52 were completed by others), we categorized themes such as Spliced Faces, Composed Scenes, Body Modifications, Inanimate Objects and Doppelgangers. Our results suggest that photo co-creation can stimulate playfulness and fun in the workplace.","title":"Let's Stitch Me and You Together!: Designing a Photo Co-creation Activity to Stimulate Playfulness in the Workplace","filename":"CHI16/p3061","authors":["Di Lu","Casey Dugan","Rosta Farzan","Werner Geyer"],"conference":"CHI '16"}