{"paperId":2858386,"reference":[{"content":"Bajaj, C. (1997). Introduction to implicit surfaces. Morgan Kaufmann.","paperID":"None"},{"content":"Bregler, C., Loeb, L., Chuang, E., & Deshpande, H. (2002, July). Turning to the masters: motion capturing cartoons. In ACM Transactions on Graphics (TOG)(Vol. 21, No. 3, pp. 399--407). ACM.","paperID":"None"},{"content":"Bruderlin, A., & Williams, L. (1995, September). Motion signal processing. In Proceedings of the 22nd annual conference on Computer graphics and interactive techniques (pp. 97--104). ACM.","paperID":"None"},{"content":"Chenney, S., Pingel, M., Iverson, R., & Szymanski, M. (2002, June). Simulating cartoon style animation. In Proceedings of the 2nd international symposium on Non-photorealistic animation and rendering (pp. 133--138). ACM.","paperID":"None"},{"content":"Chuang, Y. Y., Goldman, D. B., Zheng, K. C., Curless, B., Salesin, D. H., & Szeliski, R. (2005, July). Animating pictures with stochastic motion textures. InACM Transactions on Graphics (TOG) (Vol. 24, No. 3, pp. 853--860). ACM.","paperID":"None"},{"content":"Coros, S., Martin, S., Thomaszewski, B., Schumacher, C., Sumner, R., & Gross, M. (2012). Deformable objects alive!. ACM Transactions on Graphics (TOG), 31(4), 69.","paperID":"None"},{"content":"Dalstein, B., Ronfard, R., & Van de Panne, M. (2015). Vector Graphics Animation with Time-Varying Topology. ACM Transactions on Graphics, 12.","paperID":"None"},{"content":"Davis, R. C., Colwell, B., & Landay, J. A. (2008, April). K-sketch: A kinetic sketch pad for novice animators. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 413--422). ACM.","paperID":"None"},{"content":"Dontcheva, M., Yngve, G. and Popović, Z., 2003. Layered acting for character animation. ACM Transactions on Graphics (TOG), 22(3), pp.409--416.","paperID":"None"},{"content":"Faloutsos, P., Van De Panne, M., & Terzopoulos, D. (1997). Dynamic free-form deformations for animation synthesis. Visualization and Computer Graphics, IEEE Transactions on, 3(3), 201--214.","paperID":"None"},{"content":"1Gilland, J. (2012). Elemental Magic: The Art of Special Effects Animation. CRC Press.","paperID":"None"},{"content":"Guay, M., Ronfard, R., Gleicher, M., & Cani, M. P. (2015). Space-time sketching of character animation. ACM Transactions on Graphics (TOG), 34(4), 1.","paperID":"None"},{"content":"Guay, M., Ronfard, R., Gleicher, M., & Cani, M. P. (2015, May). Adding dynamics to sketch-based character animations. In Sketch-Based Interfaces and Modeling (SBIM) 2015.","paperID":"None"},{"content":"Haller, M., Hanl, C., & Diephuis, J. (2004). Non-photorealistic rendering techniques for motion in computer games. Computers in Entertainment (CIE),2(4), 11--11.","paperID":"None"},{"content":"Igarashi, T., Moscovich, T., & Hughes, J. F. (2005). As-rigid-as-possible shape manipulation. ACM transactions on Graphics (TOG), 24(3), 1134--1141.","paperID":"None"},{"content":"Joshi, N., Mehta, S., Drucker, S., Stollnitz, E., Hoppe, H., Uyttendaele, M., & Cohen, M. (2012, October). Cliplets: juxtaposing still and dynamic imagery. In Proceedings of the 25th annual ACM UIST (pp. 251--260). ACM.","paperID":"None"},{"content":"Kazi, R. H., Chevalier, F., Grossman, T., & Fitzmaurice, G. (2014, October). Kitty: Sketching dynamic and interactive illustrations. In Proceedings of the 27th annual ACM symposium on User interface software and technology (pp. 395--405). ACM.","paperID":"None"},{"content":"Kazi, R. H., Chevalier, F., Grossman, T., Zhao, S., & Fitzmaurice, G. (2014, April). Draco: Bringing life to illustrations with kinetic textures. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (pp. 351--360). ACM.","paperID":"None"},{"content":"Koyama, Y., Takayama, K., Umetani, N., & Igarashi, T. (2012, July). Real-time example-based elastic deformation. In Proceedings of the 11th ACM SIGGRAPH/Eurographics conference on Computer Animation (pp. 19--24). Eurographics Association.","paperID":"None"},{"content":"Lasseter, J. (1987, August). Principles of traditional animation applied to 3D computer animation. In ACM Siggraph Computer Graphics (Vol. 21, No. 4, pp. 35--44). ACM.","paperID":"None"},{"content":"2Martin, S., Thomaszewski, B., Grinspun, E., & Gross, M. (2011). Example-based elastic materials. ACM Transactions on Graphics (TOG), 30(4), 72.","paperID":"None"},{"content":"2Moscovich, T., Igarashi, T., Rekimoto, J., Fukuchi, K., & Hughes, J. F. (2005). A multi-finger interface for performance animation of deformable drawings.Proc. of User Interface Software and Technology (UIST'05), Seattle, WA, ACM Press.","paperID":"None"},{"content":"Müller, M., Heidelberger, B., Teschner, M., & Gross, M. (2005, July). Meshless deformations based on shape matching. In ACM Transactions on Graphics (TOG) (Vol. 24, No. 3, pp. 471--478). ACM.","paperID":"None"},{"content":"Papert, S. (1980). Mindstorms: Children, computers, and powerful ideas. Basic Books, Inc.","paperID":"None"},{"content":"Schmid, J., Sumner, R. W., Bowles, H., & Gross, M. (2010). Programmable motion effects. SIGGRAPH'10: ACM SIGGRAPH 2010 papers, 1--9.","paperID":"None"},{"content":"Schödl, A., Szeliski, R., Salesin, D. H., & Essa, I. (2000, July). Video textures. In Proceedings of the 27th annual conference on Computer graphics and interactive techniques (pp. 489--498). ACM Press/Addison-Wesley Publishing Co..","paperID":"None"},{"content":"Thomas, F., Johnston, O., & Frank. Thomas. (1995). The illusion of life: Disney animation (pp. 306--312). NY: Hyperion.","paperID":"None"},{"content":"Thorne, M., Burke, D., & van de Panne, M. (2007, August). Motion doodles: an interface for sketching character motion. In ACM SIGGRAPH 2007 courses (p. 24). ACM.","paperID":"None"},{"content":"Victor, B. (2009). Drawing Dynamic Visualizations. CUSE.","paperID":"None"},{"content":"Wang, J., Drucker, S. M., Agrawala, M., & Cohen, M. F. (2006, July). The cartoon animation filter. In ACM Transactions on Graphics (TOG) (Vol. 25, No. 3, pp. 1169--1173). ACM.","paperID":"None"},{"content":"3Zhu, B., Iwata, M., Haraguchi, R., Ashihara, T., Umetani, N., Igarashi, T., & Nakazawa, K. (2011, December). Sketch-based dynamic illustration of fluid systems. In ACM Transactions on Graphics (TOG) (Vol. 30, No. 6, p. 134). ACM.","paperID":"None"}],"citation":[],"abstract":"We present Skuid, a sketching tool for crafting animated illustrations that contain the exaggerated dynamics of stylized 2D animations. Skuid provides a set of motion amplifiers which implement a set of established principles of 2D animation. These amplifiers break down a complex animation effect into independent, understandable chunks. Each amplifier imposes deformations to an underlying grid, which in turn updates the corresponding strokes. Users can combine these amplifiers at will when applying them to an existing animation, promoting rapid experimentation. Skuid leverages the freeform nature of sketching, allowing users to rapidly sketch, record motion, explore exaggerated dynamics using the amplifiers, and fine-tune their animations. Practical results confirm that users with no prior experience in animation can produce expressive animated illustrations quickly and easily with Skuid.","title":"Skuid: Sketching Dynamic Illustrations Using the Principles of 2D Animation","filename":"CHI16/p4599","authors":["Rubaiat Habib Kazi","Tovi Grossman","Nobuyuki Umetani","George Fitzmaurice"],"conference":"CHI '16"}