{"paperId":2858108,"citation":[],"reference":[{"content":"Elena Agapie, Jaime Teevan, and Andrés Monroy-Hernández. 2015. Crowdsourcing in the field: A case study using local crowds for event reporting. In Proceedings of the Third AAAI Conference on Human Computation & Crowdsourcing (HCOMP '15). AAAI, New York, NY, USA.","paperID":"None"},{"content":"David Allen. 2002. Getting Things Done: The Art of Stress-Free Productivity. Penguin Books.","paperID":"None"},{"content":"Michael S. Bernstein, Greg Little, Robert C. Miller, Björn Hartmann, Mark S. Ackerman, David R. Karger, David Crowell, and Katrina Panovich. 2010. Soylent: A word processor with a crowd inside. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10). ACM, New York, NY, USA, 313--322. http://doi.acm.org/10.1145/1866029.1866078.","paperID":"None"},{"content":"Jeremy Birnholtz and Steven Ibara. 2012. Tracking changes in collaborative writing: Edits, visibility and group maintenance. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 809818. http://doi.acm.org/10.1145/2145204.2145325.","paperID":"None"},{"content":"Jeremy Birnholtz, Stephanie Steinhardt, and Antonella Pavese. 2013. Write here, write now!: An experimental study of group maintenance in collaborative writing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 961--970. http://doi.acm.org/10.1145/2470654.2466123.","paperID":"None"},{"content":"Carrie J. Cai, Philip J. Guo, James R. Glass, and Robert C. Miller. 2015. Wait-Learning: Leveraging Wait Time for Second Language Education. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3701--3710. http://doi.acm.org/10.1145/2702123.2702267.","paperID":"None"},{"content":"Carrie J. Cai, Shamsi T. Iqbal, and Jaime Teevan. Chain reactions: The impact of order on microtask chains. In Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA. http://dx.doi.org/10.1145/2858036.2858237.","paperID":"None"},{"content":"Justin Cheng, Jaime Teevan, Shamsi T. Iqbal, and Michael S. Bernstein. 2015. Break it down: A comparison of macro- and microtasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 4061--4064. http://doi.acm.org/10.1145/2702123.2702146.","paperID":"None"},{"content":"Lydia B. Chilton, Greg Little, Darren Edge, Daniel S. Weld, and James A. Landay. 2013. Cascade: Crowdsourcing taxonomy creation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1999--2008. http://doi.acm.org/10.1145/2470654.2466265.","paperID":"None"},{"content":"Haakon Faste, Nir Rachmel, Russell Essary, and Evan Sheehan. 2013. Brainstorm, chainstorm, cheatstorm, tweetstorm: New ideation strategies for distributed HCI design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1343--1352. http://doi.acm.org/10.1145/2470654.2466177.","paperID":"None"},{"content":"Linda Flower and John R. Hayes. A cognitive process theory of writing. College Composition and Communication, 1981.","paperID":"None"},{"content":"Victor M. González and Gloria Mark. 2004. \"Constant, constant, multi-tasking craziness\": managing multiple working spheres. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 113120. http://doi.acm.org/10.1145/985692.985707.","paperID":"None"},{"content":"Nick Greer, Jaime Teevan, and Shamsi T. Iqbal. 2016. An introduction to technological support for writing. Microsoft Research Tech Report MSR-TR-2016-001, January 2016.","paperID":"None"},{"content":"Ronald T. Kellog. 1988. Attentional overload and writing performance: Effects of rough draft and outline strategies. Journal of Experimental Psychology: Learning, Memory, and Cognition, 14(2).","paperID":"None"},{"content":"Joy Kim, Justin Cheng, and Michael S. Bernstein. 2014. Ensemble: Exploring complementary strengths of leaders and crowds in creative collaboration. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 745--755. http://doi.acm.org/10.1145/2531602.2531638.","paperID":"None"},{"content":"Aniket Kittur, Boris Smus, Susheel Khamkar, and Robert E. Kraut. 2011. CrowdForge: Crowdsourcing complex work. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, New York, NY, USA, 43--52. http://doi.acm.org/10.1145/2047196.2047202.","paperID":"None"},{"content":"Nicolas Kokkalis, Thomas Köhn, Johannes Huebner, Moontae Lee, Florian Schulze, and Scott R. Klemmer. 2013. TaskGenies: Automatically providing action plans helps people complete tasks. ACM Trans. Comput.-Hum. Interact. 20, 5, Article 27 (November 2013), 25 pages. http://doi.acm.org/10.1145/2513560.","paperID":"None"},{"content":"Anand Kulkarni, Matthew Can, and Björn Hartmann. 2012. Collaboratively crowdsourcing workflows with Turkomatic. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 10031012. http://doi.acm.org/10.1145/2145204.2145354.","paperID":"None"},{"content":"Walter S. Lasecki, Kyle I. Murray, Samuel White, Robert C. Miller, and Jeffrey P. Bigham. 2011. Realtime crowd control of existing interfaces. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, New York, NY, USA, 23--32. http://doi.acm.org/10.1145/2047196.2047200.","paperID":"None"},{"content":"Walter S. Lasecki, Jaime Teevan, and Ece Kamar. 2014. Information extraction and manipulation threats in crowd-powered systems. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 248--256. http://doi.acm.org/10.1145/2531602.2531733.","paperID":"None"},{"content":"Greg Little, Lydia B. Chilton, Max Goldman, and Robert C. Miller. 2010. Exploring iterative and parallel human computation processes. In Proceedings of the ACM SIGKDD Workshop on Human Computation (HCOMP '10). ACM, New York, NY, USA, 68--76. http://doi.acm.org/10.1145/1837885.1837907.","paperID":"None"},{"content":"David Martin, Benjamin V. Hanrahan, Jacki O'Neill, and Neha Gupta. 2014. Being a Turker. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 224--235. http://doi.acm.org/10.1145/2531602.2531663.","paperID":"None"},{"content":"Michael Nebeling, Anohong Guo, Alexandra To, Steven Dow, Jaime Teevan, and Jeffery Bigham. 2015. WearWrite: Orchestrating the crowd to complete complex tasks from wearables (We wrote this paper on a watch). arXiv:1509.02983.","paperID":"None"},{"content":"Michael Nebeling, Alexandra To, Anhong Guo, Adrian de Freitas, Jaime Teevan, Steven Dow, and Jeffery Bigham. WearWrite: Crowd-assisted writing from smartwatches. In Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA. http://dx.doi.org/10.1145/2858036.2858169.","paperID":"None"},{"content":"Christine M. Neuwirth, David S. Kaufer, Ravinder Chandhok and James H. Morris. 2000. Computer support for distributed collaborative writing: A coordination science perspective. Coordination Theory and Collaboration Technology.","paperID":"None"},{"content":"Sylvie Noël and Jean-Marc Robert. 2004. Empirical Study on Collaborative Writing: What Do Co-authors Do, Use, and Like? Computer Supported Cooperative Work 13, 1 (January 2004), 63--89. http://dx.doi.org/10.1023/B:COSU.0000014876.96003.be.","paperID":"None"},{"content":"Sondra Perl. 1979. The composing processes of unskilled college writers. Research in the Teaching of English.","paperID":"None"},{"content":"Ilona Posner and Ronald Baecker. How people write together. 1992. Proceedings of the Twenty-Fifth Hawaii International Conference on System Sciences.","paperID":"None"},{"content":"John Sadauskas, Daragh Byrne, and Robert K. Atkinson. 2015. Mining memories: Designing a platform to support social media based writing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3691--3700. http://doi.acm.org/10.1145/2702123.2702383.","paperID":"None"},{"content":"James Tam and Saul Greenberg. 2006. A framework for asynchronous change awareness in collaborative documents and workspaces. International Journal of Human-Computer Studies, 64.","paperID":"None"},{"content":"Jaime Teevan, Daniel J. Liebling, and Walter S. Lasecki. 2014. Selfsourcing personal tasks. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 2527--2532. http://doi.acm.org/10.1145/2559206.2581181.","paperID":"None"},{"content":"Bill Tomlinson, Joel Ross, Paul Andre, Eric Baumer, Donald Patterson, Joseph Corneli, Martin Mahaux, Syavash Nobarany, Marco Lazzari, Birgit Penzenstadler, Andrew Torrance, David Callele, Gary Olson, Six Silberman, Marcus Stünder, Fabio Romancini Palamedi, Albert Ali Salah, Eric Morrill, Xavier Franch, Florian Floyd Mueller, Joseph 'Jofish' Kaye, Rebecca W. Black, Marisa L. Cohn, Patrick C. Shih, Johanna Brewer, Nitesh Goyal, Pirjo Näkki, Jeff Huang, Nilufar Baghaei, and Craig Saper. 2012. Massively distributed authorship of academic papers. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 11--20. http://doi.acm.org/10.1145/2212776.2212779.","paperID":"None"},{"content":"Rajan Vaish, Keith Wyngarden, Jingshu Chen, Brandon Cheung, and Michael S. Bernstein. 2014. Twitch crowdsourcing: Crowd contributions in short bursts of time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 36453654. http://doi.acm.org/10.1145/2556288.2556996.","paperID":"None"},{"content":"Christopher D. Wickens. 2002. Multiple resources and performance prediction. Theoretical Issues in Ergonomics Science, 3(2).","paperID":"None"},{"content":"Jeffrey M. Zacks, Barbara Tversky, Gowri Iyer. 2001. Perceiving, remembering, and communicating structure in events. Journal of Experimental Psychology General, 130 (1).","paperID":"None"},{"content":"Haoqi Zhang, Edith Law, Rob Miller, Krzysztof Gajos, David Parkes, and Eric Horvitz. 2012. Human computation tasks with global constraints. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 217--226. http://doi.acm.org/10.1145/2207676.2207708.","paperID":"None"}],"abstract":"This paper presents the MicroWriter, a system that decomposes the task of writing into three types of microtasks to produce a single report: 1) generating ideas, 2) labeling ideas to organize them, and 3) writing paragraphs given a few related ideas. Because each microtask can be completed individually with limited awareness of what has been already done and what others are doing, this decomposition can change the experience of collaborative writing. Prior work has used microtasking to support collaborative writing with unaffiliated crowd workers. To instead study its impact on collaboration among writers with context and investment in the writing project, we asked six groups of co-workers (or 19 people in total) to use the MicroWriter in a synchronous, collocated setting to write a report about a shared work goal. Our observations suggest ways that recent advances in microtasking and crowd work can be used to support collaborative writing within preexisting groups.","title":"Supporting Collaborative Writing with Microtasks","filename":"CHI16/p2657","authors":["Jaime Teevan","Shamsi T. Iqbal","Curtis von Veh"],"conference":"CHI '16"}