{"paperId":2858536,"reference":[{"content":"John L Andreassi. 2000. Psychophysiology: Human behavior & physiological response. Psychology Press, New York, New York.","paperID":"None"},{"content":"Wolfram Boucsein. 2012. Electrodermal activity. Springer Science & Business Media, New York, New York.","paperID":"None"},{"content":"Theodora Chaspari, Daniel Bone, James Gibson, Chi-Chun Lee, and Shrikanth Narayanan. May 26--31, 2013. Using physiology and language cues for modeling verbal response latencies of children with ASD. In Proceedings of the 2013 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, Vancouver, BC, Canada, 3702--3706.","paperID":"None"},{"content":"Don C Fowles, Margaret J Christie, Robert Edelberg, William W Grings, David T Lykken, and Peter H Venables. 1981. Publication recommendations for electrodermal measurements. Psychophysiology 18, 3 (1981), 232--239.","paperID":"None"},{"content":"Alan S Horn, Joseph T Coyle, and Solomon H Snyder. 1971. Catecholamine uptake by synaptosomes from rat brain structure-activity relationships of drugs with differential effects on dopamine and norepinephrine neurons. Mol. Pharmacol. 7, 1 (1971), 66--80.","paperID":"None"},{"content":"Peter J Lang, Margaret M Bradley, and Bruce N Cuthbert. 1990. Emotion, attention, and the startle reflex. Psychol. Rev. 97, 3 (1990), 377--395.","paperID":"None"},{"content":"AL MacMillan and JM Spalding. 1969. Human sweating response to electrophoresed acetylcholine: A test of postganglionic sympathetic function. J Neurol Neurosurg Psychiatry 32, 2 (1969), 155--160.","paperID":"None"},{"content":"Daniel McDuff, Amy Karlson, Ashish Kapoor, Asta Roseway, and Mary Czerwinski. May 5--10, 2012. AffectAura: An intelligent system for emotional memory. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, Austin, TX, 849--858.","paperID":"None"},{"content":"Richard S Neary and Marvin Zuckerman. 1976. Sensation seeking, trait and state anxiety, and the electrodermal orienting response. Psychophysiology 13, 3 (1976), 205--211.","paperID":"None"},{"content":"I Pavlidis, P Tsiamyrtzis, D Shastri, A Wesley, Y Zhou, P Lindner, P Buddharaju, R Joseph, A Mandapati, B Dunkin, and others. 2012. Fast by nature-how stress patterns define human experience and performance in dexterous tasks. Sci. Rep. 2 (2012), 305; doi: 10.1038/srep00305.","paperID":"None"},{"content":"Rosalind W Picard. 2010. Emotion research by the people, for the people. Emot Rev 2, 3 (2010), 250--254.","paperID":"None"},{"content":"Ming-Zher Poh, Tobias Loddenkemper, Nicholas C Swenson, Shubhi Goyal, Joseph R Madsen, and Rosalind W Picard. September 1--4, 2010a. Continuous monitoring of electrodermal activity during epileptic seizures using a wearable sensor. In Proceedings of the 32nd Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC 2010). IEEE, Buenos Aires, Argentina, 4415--4418.","paperID":"None"},{"content":"Ming-Zher Poh, Nicholas C Swenson, and Rosalind W Picard. 2010b. A wearable sensor for unobtrusive, long-term assessment of electrodermal activity. IEEE Trans. Biomed. Eng. 57, 5 (2010), 1243--1252.","paperID":"None"},{"content":"Slaven Ranogajec and Gregor Gersak. September 22--24, 2014. Measuring site dependency when measuring skin conductance. In Proceedings of the Twenty-Third International Electrotechnical and Computer Science Conference ERK 2014, Vol. 23. IEEE Region 8, Portoroz, Slovenia, 155--158.","paperID":"None"},{"content":"Rozalind W Picard et al., inventors; Massachusetts Institute of Technology, assignee. 2012 Mar 20. Washable wearable biosensor. (March 20 2012 Mar 20). United States patent US 8,140,143.","paperID":"None"},{"content":"Akane Sano and Rosalind W Picard. August 30-September 3, 2011. Toward a taxonomy of autonomic sleep patterns with electrodermal activity. In Proceedings of the 33rd Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC 2011). IEEE, Boston, MA, 777--780.","paperID":"None"},{"content":"Charles D Spielberger. 2010. State-Trait Anxiety Inventory. In The Corsini Encyclopedia of Psychology, Irving B Weiner and Edward W Craighead (Eds.). John Wiley & Sons, Inc., Hoboken, New Jersey.","paperID":"None"},{"content":"Marieke van Dooren, Joris H Janssen, and others. 2012. Emotional sweating across the body: Comparing 16 different skin conductance measurement locations. Physiol Behav 106, 2 (2012), 298--304.","paperID":"None"}],"citation":[],"abstract":"Electrodermal activity (EDA) is an important affective indicator, measured conventionally on the fingers with desktop sensing instruments. Recently, a new generation of wearable, battery-powered EDA devices came into being, encouraging the migration of EDA sensing to other body locations. To investigate the implications of such sensor/location shifts in psychophysiological studies we performed a validation experiment. In this experiment we used startle stimuli to instantaneously arouse the sympathetic system of n=23 subjects while sitting. Startle stimuli are standard but minimal stressors, and thus ideal for determining the sensor and location resolution limit. The experiment revealed that precise measurement of small EDA responses on the fingers and palm is feasible either with conventional or mobile EDA sensors. By contrast, precise measurement of small EDA responses on the sole is challenging, while on the wrist even detection of such responses is problematic for both EDA modalities. Given that affective wristbands have emerged as the dominant form of EDA sensing, researchers should beware of these limitations.","title":"Delineating the Operational Envelope of Mobile and Conventional EDA Sensing on Key Body Locations","filename":"CHI16/p5665","authors":["Panagiotis Tsiamyrtzis","Malcolm Dcosta","Dvijesh Shastri","Eswar Prasad","Ioannis Pavlidis"],"conference":"CHI '16"}