{"paperId":2858253,"abstract":"We use Bayesian optimization methods to design games that maximize user engagement. Participants are paid to try a game for several minutes, at which point they can quit or continue to play voluntarily with no further compensation. Engagement is measured by player persistence, projections of how long others will play, and a post-game survey. Using Gaussian process surrogate-based optimization, we conduct efficient experiments to identify game design characteristics---specifically those influencing difficulty---that lead to maximal engagement. We study two games requiring trajectory planning, the difficulty of each is determined by a three-dimensional continuous design space. Two of the design dimensions manipulate the game in user-transparent manner (e.g., the spacing of obstacles), the third in a subtle and possibly covert manner (incremental trajectory corrections). Converging results indicate that overt difficulty manipulations are effective in modulating engagement only when combined with the covert manipulation, suggesting the critical role of a user's self-perception of competence.","citation":[],"reference":[{"content":"E Andersen, Y Liu, R Snider, R Szeto, and Z Popovic. 2011. Placing a value on aesthetics in online casual games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, NY, 1275-1278.","paperID":"None"},{"content":"G. Andrade, G. Ramalho, H. Santana, and V. Corruble. 2005. Challenge-sensitive action selection: an application to game balancing. In Intelligent Agent Technology, IEEE/WIC/ACM International Conference on. 194-200. DOI: http://dx.doi.org/10.1109/IAT.2005.52","paperID":"None"},{"content":"Jeanne H Brockmyer, Christine M Fox, Kathleen A Curtiss, Evan McBroom, Kimberly M Burkhart, and Jacquelyn N Pidruzny. 2009. The development of the Game Engagement Questionnaire: A measure of engagement in video game-playing. Journal of Experimental Social Psychology 45, 4 (2009), 624-634.","paperID":"None"},{"content":"Olivier Chapelle and Lihong Li. 2011. An empirical evaluation of thompson sampling. In Advances in neural information processing systems. 2249-2257.","paperID":"None"},{"content":"Wei Chu and Zoubin Ghahramani. 2005. Preference learning with Gaussian processes. In In Proceedings of the 22nd International Conference on Machine Learning. ACM, NY, 137-144.","paperID":"None"},{"content":"Seth Cooper, Firas Khatib, Adrien Treuille, Janos Barbero, Jeehyung Lee, Michael Beenen, Andrew Leaver-Fay, David Baker, Zoran Popovic, and others. 2010. Predicting protein structures with a multiplayer online game. Nature 466, 7307 (2010), 756-760.","paperID":"None"},{"content":"Simone de Sousa Borges, V. H. S. Durelli, H. M. Reis, and S. Isotani. 2014. A systematic mapping on gamification applied to education. In Proceedings of the 29th Annual ACM Symposium on Applied Computing. ACM, NY, 216-222.","paperID":"None"},{"content":"Alena Denisova and Paul Cairns. 2015. The Placebo Effect in Digital Games: Phantom Perception of Adaptive Artificial Intelligence. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. ACM, 23-33.","paperID":"None"},{"content":"Fitocracy. 2015. Fitocracy. (2015). https://www.fitocracy.com/","paperID":"None"},{"content":"J A Fredricks, P C Blumenfeld, and A H Paris. 2004. School engagement: Potential of the concept, state of the evidence. Review of Educational Research 74 (2004), 59-109.","paperID":"None"},{"content":"B. Harrison and D.L. Roberts. 2013. Analytics-driven dynamic game adaption for player retention in Scrabble. In Computational Intelligence in Games (CIG), 2013 IEEE Conference on. 1-8. DOI: http://dx.doi.org/10.1109/CIG.2013.6633632","paperID":"None"},{"content":"R H Hohle. 1965. Inferred components of reaction times as functions of foreperiod duration. Journal of Experimental Psychology 69 (1965), 382-386.","paperID":"None"},{"content":"Aaron Isaksen, Dan Gopstein, and Andy Nealen. 2015. Exploring game space using survival analysis. In Foundations of Digital Games.","paperID":"None"},{"content":"David Jurgens, James McCorriston, and Derek Ruths. 2015. An Analysis of Exercising Behavior in Online Populations. In Ninth International AAAI Conference on Web and Social Media.","paperID":"None"},{"content":"Jeffrey I Kassinove and Mitchell L Schare. 2001. Effects of the \"near miss\" and the \"big win\" on persistence at slot machine gambling. Psychology of Addictive Behaviors 15, 2 (2001), 155.","paperID":"None"},{"content":"Firas Khatib, Frank DiMaio, Seth Cooper, Maciej Kazmierczyk, Miroslaw Gilski, Szymon Krzywda, Helena Zabranska, Iva Pichova, James Thompson, Zoran Popović, and others. 2011. Crystal structure of a monomeric retroviral protease solved by protein folding game players. Nature structural & molecular biology 18, 10 (2011), 1175-1177.","paperID":"None"},{"content":"Christoph Klimmt, Albert Rizzo, Peter Vorderer, Jan Koch, and Till Fischer. 2009. Experimental evidence for suspense as determinant of video game enjoyment. CyberPsychology & Behavior 12, 1 (2009), 29-31.","paperID":"None"},{"content":"Janne V. Kujala, Ulla Richardson, and Heikki Lyytinen. 2010. A Bayesian-optimal principle for learner-friendly adaptation in learning games. Journal of Mathematical Psychology 54, 2 (2010), 247 - 255. DOI: http://dx.doi.org/10.1016/j.jmp.2009.10.001","paperID":"None"},{"content":"Ellen J Langer. 1975. The illusion of control. Journal of personality and social psychology 32, 2 (1975), 311.","paperID":"None"},{"content":"G Levy. 2002. An introduction to quasi-random numbers. (2002). http://www.nag.co.uk/IndustryArticles/ introduction_to_quasi_random_numbers.pdf","paperID":"None"},{"content":"Robert V Lindsey, Michael C Mozer, William J Huggins, and Harold Pashler. 2013. Optimizing Instructional Policies. In Advances in Neural Information Processing Systems 26, C.J.C. Burges, L. Bottou, M. Welling, Z. Ghahramani, and K.Q. Weinberger (Eds.). Curran Associates, 2778-2786.","paperID":"None"},{"content":"K Linser and T Goschke. 2007. Unconscious modulation of the conscious experience of voluntary control. Cognition 104 (2007), 459-475.","paperID":"None"},{"content":"Y.-E. Liu, T. Mandel, E. Brunskill, and Z. Popovic. 2014. Towards automatic experimentation of educational knowledge. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, NY, 3349-3358.","paperID":"None"},{"content":"Derek Lomas, Jodi Forlizzi, Nikhil Poonwala, Nirmal Patel, Sharan Shodhan, Kishan Patel, Ken Koedinger, and Emma Brunskill. 2015. Interface Design Optimization as a Multi-Armed Bandit Problem. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, NY.","paperID":"None"},{"content":"J. D. Lomas, K. Patel, J. L. Forlizzi, and K. R. Koedinger. 2013. Optimizing challenge in an educational game using large-scale design experiments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, NY, 89-98.","paperID":"None"},{"content":"MM Hassan Mahmud, Benjamin Rosman, Subramanian Ramamoorthy, and Pushmeet Kohli. 2014. Adapting interaction environments to diverse users through online action set selection. In Proceedings of the AAAI 2014 Workshop on Machine Learning for Interactive Systems. Citeseer.","paperID":"None"},{"content":"Elisa D. Mekler, Julia Ayumi Bopp, Alexandre N. Tuch, and Klaus Opwis. 2014. A Systematic Review of Quantitative Studies on the Enjoyment of Digital Entertainment Games. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 927-936. DOI: http://dx.doi.org/10.1145/2556288.2557078","paperID":"None"},{"content":"Y R Miyamoto, C A Coleman, J J Williams, J Whitehill, S O Nesterko, and J Reich. 2015. Beyond Time-on-Task: The Relationship between Spaced Study and Certification in MOOCs. http://dx.doi.org/10.2139/ssrn.2547799, Journal of Learning Analytics (2015). Accessed: 2015-01-09.","paperID":"None"},{"content":"H L O'Brien and E. G. Toms. 2010. The development and evaluation of a survey to measure user engagement. J. of the Am. Soc. for Information Science and Technlogy 61 (2010), 50-69.","paperID":"None"},{"content":"Anna N Rafferty, Matei Zaharia, Thomas L Griffiths, and others. 2012. Optimally designing games for cognitive science research. In Proceedings of the 34th Annual Conference of the Cognitive Science Society.","paperID":"None"},{"content":"B. Roads and M. C. Mozer. 2015. Improving Human-Computer Cooperative Classification Via Cognitive Theories of Similarity. (2015).","paperID":"None"},{"content":"Jeffrey N Rouder, Jun Lu, Paul Speckman, DongChu Sun, and Yi Jiang. 2005. A hierarchical model for estimating response time distributions. Psychonomic Bulletin & Review 12, 2 (2005), 195-223.","paperID":"None"},{"content":"D Sharek and E Wiebe. 2015. Measuring Video Game Engagement Through the Cognitive and Affective Dimensions. Simulation & Gaming 45, 4--5 (Jan. 2015), 569-592.","paperID":"None"},{"content":"R. Sifa, C. Bauckhage, and A. Drachen. 2014. The Playtime Principle: Large-scale cross-games interest modeling. In Computational Intelligence and Games (CIG), 2014 IEEE Conference on. 1-8. DOI: http://dx.doi.org/10.1109/CIG.2014.6932906","paperID":"None"},{"content":"Jasper Snoek, Hugo Larochelle, and Ryan P Adams. 2012. Practical Bayesian optimization of machine learning algorithms. In Advances in neural information processing systems. 2951-2959.","paperID":"None"},{"content":"Ben G. Weber, Michael John, Michael Mateas, and Arnav Jhala. 2011. Modeling Player Retention in Madden NFL 11. In Innovative Applications of Artificial Intelligence (IAAI). AAAI Press, AAAI Press, San Francisco, CA.","paperID":"None"},{"content":"A Zook, E Fruchter, and M O Riedl. 2014. Automatic playtesting for game parameter tuning via active learning. In Proc. of the 9th Intl. Conf. on the Foundations of Digital Games, T Barnes and I Bogost (Eds.). Soc. for the Adv. of the Science of Digital Games, Ft. Lauderdale, FL.","paperID":"None"}],"title":"Designing Engaging Games Using Bayesian Optimization","filename":"CHI16/p5571","authors":["Mohammad M. Khajah","Brett D. Roads","Robert V. Lindsey","Yun-En Liu","Michael C. Mozer"],"conference":"CHI '16"}