{"paperId":2858082,"citation":[],"reference":[{"content":"Daniel Ashbrook, Kent Lyons, and Thad Starner. 2008. An investigation into round touchscreen wristwatch interaction. In Proceedings of the 10th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '08), 311--314. http://dx.doi.org/10.1145/1409240.1409276","paperID":"None"},{"content":"Daniel Ashbrook, Patrick Baudisch, and Sean White. 2011. Nenya: subtle and eyes-free mobile input with a magnetically-tracked finger ring. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2043--2046. http://dx.doi.org/10.1145/1978942.1979238","paperID":"None"},{"content":"Patrick Baudisch and Gerry Chu. 2009. Back-of-device interaction allows creating very small touch devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1923--1932. http://dx.doi.org/10.1145/1518701.1518995","paperID":"None"},{"content":"Liwei Chan, Yi-Ling Chen, Chi-Hao Hsieh, Rong-Hao Liang, and Bing-Yu Chen. 2015. CyclopsRing: Enabling Whole-Hand and Context-Aware Interactions Through a Fisheye Ring. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15), 549--556. http://dx.doi.org/10.1145/2807442.2807450","paperID":"None"},{"content":"Xiang Chen, Julia Schwarz, Chris Harrison, Jennifer Mankoff, and Scott E. Hudson. 2014. Air+touch: interweaving touch & in-air gestures. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14), 519--525. http://doi.acm.org/10.1145/2642918.2647392","paperID":"None"},{"content":"Ke-Yu Chen, Kent Lyons, Sean White, and Shwetak Patel. 2013. uTrack: 3D input using two magnetic sensors. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13), 237--244. http://dx.doi.org/10.1145/2501988.2502035","paperID":"None"},{"content":"Gabe Cohn, Daniel Morris, Shwetak Patel, and Desney Tan. 2012. Humantenna: Using the Body as an Antenna for Real-Time Whole-Body Interaction. Proceedings of the 2012 ACM Annual Conference on Human Factors in Computing Systems (CHI '12), 1901--1910. http://doi.org/10.1145/2207676.2208330!","paperID":"None"},{"content":"Gabe Cohn, Daniel Morris, Shwetak N. Patel, and Desney S. Tan. 2011. Your noise is my command: sensing gestures using the body as an antenna. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 791--800. http://dx.doi.org/10.1145/1978942.1979058","paperID":"None"},{"content":"Analog Devices, Inc. AD8302 RF/IF Gain and Phase Detector. Revision A. Published in 2002. http://www.analog.com/media/cn/technicaldocumentation/data-sheets/AD8302.pdf Last Retrieved: January 6, 2016","paperID":"None"},{"content":"Niloofar Dezfuli, Mohammadreza Khalilbeigi, Jochen Huber, Florian Müller, and Max Mühlhäuser. 2012. PalmRC: imaginary palm-based remote control for eyesfree television interaction. In Proceedings of the 10th European Conference on Interactive TV and Video (EuroiTV '12), 27--34. http://dx.doi.org/10.1145/2325616.2325623","paperID":"None"},{"content":"Paul Dietz and Darren Leigh. 2001. DiamondTouch: a multi-user touch technology. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01), 219--226. http://dx.doi.org/10.1145/502348.502389","paperID":"None"},{"content":"Fitbit, Inc. http://www.fitbit.com/aria","paperID":"None"},{"content":"Katsuyuki Fuji, Koichi Ito, and Shigeru Tajima. 2003. A study on the receiving signal level in relation with the location of electrodes for wearable devices using human body as a transmission channel. IEEE Antennas and Propagation Society International Symposium. Digest. Held in conjunction with: USNC/CNC/URSI North American Radio Sci. Meeting (Cat. No.03CH37450) 3: 1071--1074. http://doi.org/10.1109/APS.2003.1220096","paperID":"None"},{"content":"T. G. Zimmerman. 1996. Personal area networks: near-field intrabody communication. IBM Syst. J. 35, 3--4 (September 1996), 609--617. http://dx.doi.org/10.1147/sj.353.0609","paperID":"None"},{"content":"C Gabriel, S Gabriel, and E Corthout. 1996. The dielectric properties of biological tissues: I. Literature survey. Physics in medicine and biology 41, 11: 2231--49. http://doi.org/10.1088/0031--9155/41/11/001","paperID":"None"},{"content":"Keisuke Hachisuka, Azusa Nakata, Teruhito Takeda, Yusuke Terauchi, Kenji Shiba, Ken Sasaki, Hiroshi Hosaka, and Kiyoshi Itao. 2003. Development and performance analysis of an intra-body communication device. 12th International Conference on Solid-State Sensors, Actuators and Microsystems. Digest of Technical Papers (TRANSDUCERS '03) (Cat. No.03TH8664) 2: 1722--1725. http://doi.org/10.1109/SENSOR.2003.1217117","paperID":"None"},{"content":"Mark Hall, Eibe Frank, Geoffrey Holmes, Bernhard Pfahringer, Peter Reutemann, and Ian H. Witten. 2009. The WEKA data mining software: an update. SIGKDD Explor. Newsl. 11, 1 (November 2009), 10--18. http://dx.doi.org/10.1145/1656274.1656278","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2009. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology (UIST '09), 121--124. http://dx.doi.org/10.1145/1622176.1622199","paperID":"None"},{"content":"Chris Harrison, Desney Tan, and Dan Morris. 2010. Skinput: appropriating the body as an input surface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 453--462. http://dx.doi.org/10.1145/1753326.1753394","paperID":"None"},{"content":"Chris Harrison, Hrvoje Benko, and Andrew D. Wilson. 2011. OmniTouch: wearable multitouch interaction everywhere. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11), 441--450. http://dx.doi.org/10.1145/2047196.2047255","paperID":"None"},{"content":"Chris Harrison, Munehiko Sato, and Ivan Poupyrev. 2012. Capacitive fingerprinting: exploring user differentiation by sensing electrical properties of the human body. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12), 537--544. http://dx.doi.org/10.1145/2380116.2380183","paperID":"None"},{"content":"Christian Holz and Patrick Baudisch. 2010. The generalized perceived input point model and how to double touch accuracy by extracting fingerprints. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 581--590. http://dx.doi.org/10.1145/1753326.1753413","paperID":"None"},{"content":"Christian Holz, Tovi Grossman, George Fitzmaurice, and Anne Agur. 2012. Implanted user interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 503--512. http://dx.doi.org/10.1145/2207676.2207745","paperID":"None"},{"content":"Christian Holz and Marius Knaust. 2015. Biometric Touch Sensing: Seamlessly Augmenting Each Touch with Continuous Authentication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15), 303--312. http://dx.doi.org/10.1145/2807442.2807458","paperID":"None"},{"content":"Sophocles J. Orfanidis. 2008. Electromagnetic Waves and Antennas: Waveguides. Rutgers University.","paperID":"None"},{"content":"Rebecca K. Kramer, Carmel Majidi, Robert J. Wood. 2011. Wearable tactile keypad with stretchable artificial skin. In Proceedings of the IEEE International Conference on Robotics and Automation (ICRA '11), 1103--1107. http://doi.org/10.1109/ICRA.2011.5980082","paperID":"None"},{"content":"Wolf Kienzle and Ken Hinckley. 2014. LightRing: alwaysavailable 2D input on any surface. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14), 157--160. http://dx.doi.org/10.1145/2642918.2647376","paperID":"None"},{"content":"Dae-Hyeong Kim et al. Epidermal Electronics. Science 333, 6044 (2011), 838--843.","paperID":"None"},{"content":"Jungsoo Kim, Jiasheng He, Kent Lyons, and Thad Starner. 2007. The Gesture Watch: A Wireless Contact-free Gesture based Wrist Interface. In Proceedings of the 11th IEEE International Symposium on Wearable Computers (ISWC '07) Figure 1: 1--8. http://doi.org/10.1109/ISWC.2007.4373770","paperID":"None"},{"content":"Sven Kratz and Michael Rohs. 2009. Hoverflow: exploring around-device interaction with IR distance sensors. In Proceedings of the 11th International Conference on HumanComputer Interaction with Mobile Devices and Services (MobileHCI '09), Article 42 , 4 pages. http://dx.doi.org/10.1145/1613858.1613912","paperID":"None"},{"content":"Gierad Laput, Robert Xiao, Xiang 'Anthony' Chen, Scott E. Hudson, and Chris Harrison. 2014. Skin buttons: cheap, small, low-powered and clickable fixed-icon laser projectors. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14), 389--394. http://doi.acm.org/10.1145/2642918.2647356","paperID":"None"},{"content":"Gierad Laput, Chouchang Yang, Robert Xiao, Alanson Sample, and Chris Harrison. 2015. EM-Sense: Touch Recognition of Uninstrumented, Electrical and Electromechanical Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15), 157--166. http://dx.doi.org/10.1145/2807442.2807481","paperID":"None"},{"content":"Rong-Hao Liang, Shu-Yang Lin, Chao-Huai Su, Kai-Yin Cheng, Bing-Yu Chen, and De-Nian Yang. 2011. SonarWatch: appropriating the forearm as a slider bar. In SIGGRAPH Asia 2011 Emerging Technologies (SA '11), Article 5, 1 pages. http://dx.doi.org/10.1145/2073370.2073374","paperID":"None"},{"content":"Chia-Hsien Lin and Koichi Ito. 2014. A Compact DualMode Wearable Antenna for Body-Centric Wireless Communications. In Electronics 2014, 3, 398--408.","paperID":"None"},{"content":"Denys J. C. Matthies, Simon T. Perrault, Bodo Urban, and Shengdong Zhao. 2015. Botential: Localizing On-Body Gestures by Measuring Electrical Signatures on the Human Skin. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15), 207--216. http://dx.doi.org/10.1145/2785830.2785859","paperID":"None"},{"content":"Adiyan Mujibiya, Xiang Cao, Desney S. Tan, Dan Morris, Shwetak N. Patel, and Jun Rekimoto. 2013. The sound of touch: on-body touch and gesture sensing based on transdermal ultrasound propagation. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13), 189--198. http://dx.doi.org/10.1145/2512349.2512821","paperID":"None"},{"content":"Kei Nakatsuma, Hiroyuki Shinoda, Yasutoshi Makino, Katsunari Sato, and Takashi Maeno. 2011. Touch interface on back of the hand. In ACM SIGGRAPH 2011 Posters (SIGGRAPH '11), Article 39 , 1 pages. http://dx.doi.org/10.1145/2037715.2037760","paperID":"None"},{"content":"Tao Ni and Patrick Baudisch. 2009. Disappearing mobile devices. In Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology (UIST '09), 101--110. http://dx.doi.org/10.1145/1622176.1622197","paperID":"None"},{"content":"Shahriar Nirjon, Jeremy Gummeson, Dan Gelb, and KyuHan Kim. 2015. TypingRing: A Wearable Ring Platform for Text Input. In Proceedings of the 13th Annual International Conference on Mobile Systems, Applications and Services (MobiSys '15), 227--239. http://dx.doi.org/10.1145/2742647.2742665","paperID":"None"},{"content":"Masa Ogata, Yuta Sugiura, Yasutoshi Makino, Masahiko Inami, and Michita Imai. 2013. SenSkin: adapting skin as a soft interface. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13), 539--544. http://dx.doi.org/10.1145/2501988.2502039","paperID":"None"},{"content":"Manuel Prätorius, Aaron Scherzinger, and Klaus Hinrichs. 2015. SkInteract: An On-body Interaction System Based on Skin-Texture Recognition. Human-Computer Interaction (INTERACT '15), 425--432. http://dx.doi.org/10.1007/978--3--319--22723--8_34","paperID":"None"},{"content":"Shanaka Ransiri, Roshan Lalintha Peiris, Kian Peen Yeo, and Suranga Nanayakkara. 2013. SmartFinger: connecting devices, objects and people seamlessly. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (OzCHI '13), 359--362. http://dx.doi.org/10.1145/2541016.2541064","paperID":"None"},{"content":"E. Rehmi Post and Margaret Orth. 1997. Smart Fabric, or \"Wearable Clothing\". In Proceedings of the 1st IEEE International Symposium on Wearable Computers (ISWC '97), 167--168. http://doi.org/10.1109/ISWC.1997.629937","paperID":"None"},{"content":"J. Rekimoto. 2001. GestureWrist and GesturePad: unobtrusive wearable interaction devices. In Proceedings Fifth International Symposium on Wearable Computers. (ISWC '01), 21--27. http://doi.org/10.1109/ISWC.2001.962092","paperID":"None"},{"content":"Thijs Roumen, Simon T. Perrault, and Shengdong Zhao. 2015. NotiRing: A Comparative Study of Notification Channels for Wearable Interactive Rings. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2497--2500. http://dx.doi.org/10.1145/2702123.2702350","paperID":"None"},{"content":"Peter S. Hall and Yang Hao. 2012. Antennas and Propagation for Body-Centric Wireless Communications. Artech House; 2nd edition.","paperID":"None"},{"content":"Scott Saponas, Desney S. Tan, Dan Morris, and Ravin Balakrishnan. 2008. Demonstrating the feasibility of using forearm electromyography for muscle-computer interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 515--524. http://doi.acm.org/10.1145/1357054.1357138","paperID":"None"},{"content":"Scott Saponas, Desney S. Tan, Dan Morris, Ravin Balakrishnan, Jim Turner, and James A. Landay. 2009. Enabling always-available input with muscle-computer interfaces. In Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology (UIST '09), 167--176. http://doi.acm.org/10.1145/1622176.1622208","paperID":"None"},{"content":"Munehiko Sato, Ivan Poupyrev, and Chris Harrison. 2012. Touché: enhancing touch interaction on humans, screens, liquids, and everyday objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 483--492. http://dx.doi.org/10.1145/2207676.2207743","paperID":"None"},{"content":"Tsuyoshi Sekitani, Martin Kaltenbrunner, Tomoyuki Yokota, and Takao Someya. 2014. Imperceptible Electronic Skin. SID Information Display 30, 1, 20--25.","paperID":"None"},{"content":"Skulput, Inc. http://www.skulpt.me","paperID":"None"},{"content":"Simon T. Perrault, Eric Lecolinet, James Eagan, and Yves Guiard. 2013. Watchit: simple gestures and eyes-free interaction for wristwatches and bracelets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1451--1460. http://dx.doi.org/10.1145/2470654.2466192","paperID":"None"},{"content":"Martin Weigel, Tong Lu, Gilles Bailly, Antti Oulasvirta, Carmel Majidi, and Jürgen Steimle. 2015. iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2991--3000. http://dx.doi.org/10.1145/2702123.2702391","paperID":"None"},{"content":"Mathias Wilhelm, Daniel Krakowczyk, Frank Trollmann, and Sahin Albayrak. 2015. eRing: multiple finger gesture recognition with one ring using an electric field. In Proceedings of the 2nd international Workshop on Sensorbased Activity Recognition and Interaction (WOAR '15), Article 7 , 6 pages. http://dx.doi.org/10.1145/2790044.2790047","paperID":"None"},{"content":"Katrin Wolf and Jonas Willaredt. 2015. PickRing: seamless interaction through pick-up detection. In Proceedings of the 6th Augmented Human International Conference (AH '15), 13--20. http://dx.doi.org/10.1145/2735711.2735792","paperID":"None"},{"content":"Robert Xiao, Gierad Laput, and Chris Harrison. 2014. Expanding the input expressivity of smartwatches with mechanical pan, twist, tilt and click. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 193--196. http://dx.doi.org/10.1145/2556288.2557017","paperID":"None"},{"content":"Xing-Dong Yang, Tovi Grossman, Daniel Wigdor, and George Fitzmaurice. 2012. Magic finger: always-available input through finger instrumentation. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12), 147--156. http://dx.doi.org/10.1145/2380116.2380137","paperID":"None"},{"content":"Yang Zhang and Chris Harrison. 2015. Tomo: Wearable, Low-Cost Electrical Impedance Tomography for Hand Gesture Recognition. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15), 167--173. http://dx.doi.org/10.1145/2807442.2807480","paperID":"None"}],"abstract":"SkinTrack is a wearable system that enables continuous touch tracking on the skin. It consists of a ring, which emits a continuous high frequency AC signal, and a sensing wristband with multiple electrodes. Due to the phase delay inherent in a high-frequency AC signal propagating through the body, a phase difference can be observed between pairs of electrodes. SkinTrack measures these phase differences to compute a 2D finger touch coordinate. Our approach can segment touch events at 99% accuracy, and resolve the 2D location of touches with a mean error of 7.6mm. As our approach is compact, non-invasive, low-cost and low-powered, we envision the technology being integrated into future smartwatches, supporting rich touch interactions beyond the confines of the small touchscreen.","title":"SkinTrack: Using the Body as an Electrical Waveguide for Continuous Finger Tracking on the Skin","filename":"CHI16/p1491","authors":["Yang Zhang","Junhan Zhou","Gierad Laput","Chris Harrison"],"conference":"CHI '16"}