{"paperId":2858509,"citation":[],"abstract":"HCI shapes in important ways dominant notions of what counts as innovation and where (good) design is located. In this paper, we argue for the continuous expansion of the body of critical and reflexive work that asks both researcher and designer to reflect on their values of design in the world. Drawing from ethnographic research in Accra, Ghana and Shenzhen, China, we illustrate how design is as much about making artifacts as it is about producing national identity, reputation, and economic gain. Technology entrepreneurs take from and resist the discourse of their cities as emerging sites of Silicon-Valley type innovation. They render the narrative of \"catching up with the west\" overly simplistic, ahistorical and blind to situated practices of design. This view, we argue, is critical for interrogating our views of design especially as it becomes more central in the contemporary global economy.","reference":[{"content":"Morgan G. Ames, Daniela K. Rosner and Ingrid Erickson. Worship, Faith, and Evangelism: Religion as an Ideological Lens for Engineering Worlds. In Proceedings of ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW 2015), 69--8","paperID":"None"},{"content":"Morgan Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David Mellis, and Daniela Rosner. 2012. Making Cultures: Empowerment, Participation, and Democracy - or Not? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1087--1092.","paperID":"None"},{"content":"Seyram Avle. 2011. Global flows, media and developing democracies: The Ghanaian case'. Journal of African Media Studies 3(1), 7--23.","paperID":"None"},{"content":"Seyram Avle. 2014. Articulating and enacting development: Skilled returnees in Ghana's ICT industry'. Information Technologies & International Development 10(4), 1--13.","paperID":"None"},{"content":"Jeffrey Bardzell and Shaowen Bardzell. 2013. What is \"critical\" about critical design? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13)","paperID":"None"},{"content":"Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1301- 1310.","paperID":"None"},{"content":"Shaowen Bardzell, Daniela Rosner, and Jeffrey Bardzell. 2012. Crafting quality in design: Integrity, creativity, and public sensibility. Proc. of DIS 2012. ACM: New York.","paperID":"None"},{"content":"Liam Bannon. 2011. Reimagining HCI: toward a more human-centered perspective. Interactions, 18(4), 50--57.","paperID":"None"},{"content":"Liam Bannon and Pelle Ehn. 2012. Design Matters in Participatory Design. In: J. Simonsen and T. Robertson (eds) Routledge Handbook of Participatory Design, 37--63.","paperID":"None"},{"content":"Nicola Bidwell. 2014. Moving the center to design social media in rural Africa. AI & Society, 1--27.","paperID":"None"},{"content":"Susanna Bødker. 2006. When second wave HCI meets third wave challenges. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles, 1--8.","paperID":"None"},{"content":"Allan Borning and Michael Muller. 2012. Next steps in value sensitive design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1125--1134.","paperID":"None"},{"content":"Jake Bright and Aubry Hruby. 2015. The rise of Silicon Savannah and Africa's tech movement. Retrieved September 23, 2015 from http://techcrunch.com/2015/07/23/the-rise-of-silicon-savannah-and-africas-tech-movement/","paperID":"None"},{"content":"Leah Buechley and Hannah Perner-Wilson. 2012. Crafting Technology: Reimagining the Processes, Materials, and Cultures of Electronics. In ACM Transactions in Computer-Human Interaction, Vol 19, No. 3.","paperID":"None"},{"content":"Carolyn Cartier. 2002. Transnational Urbanism in the Reform-era Chinese city: Landscapes from Shenzhen. Urban Studies 39: 1513--1532.","paperID":"None"},{"content":"Anita Say Chan. 2014. Networking Peripheries. Technological Futures and the Myth of Digital Universalism. Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Andrew Crabtree, Tom Rodden, Peter Tolmie, and Graham Button. 2009. Ethnography considered harmful. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (CHI 2009), 879--888.","paperID":"None"},{"content":"Paul Dourish. 2004. What We Talk About When We Talk About Context. Personal and Ubiquitous Computing, 8(1), 19--30.","paperID":"None"},{"content":"Paul Dourish. 2006. Implications for Design. In Proceedings of of SIGCHI Conference on Human Factors in Computing Systems (CHI 2006), 541--550.","paperID":"None"},{"content":"Paul Dourish and Genevieve Bell. 2011. Divining a Digital Future: Mess and Mythology in Ubiquitous Computing. Cambridge: MIT Press.","paperID":"None"},{"content":"Paul Dourish and Scott D. Mainwaring. 2012. Ubicomp's Colonial Impulse. In Proceedings. of UbiComp'12, Springer, 133--142.","paperID":"None"},{"content":"Paul Dourish & Melissa Mazmanian. 2013: Media as material: Information representations as material foundations for organizational practice. How Matter Matters: Objects, Artifacts, and Materiality in Organization Studies, 3, 92","paperID":"None"},{"content":"Juan Du. Shenzhen: Urban Myth of a New Chinese City. Journal of Architectural Education, Volume 63, Issue 2, pp.65--66.","paperID":"None"},{"content":"Dunne, Anthony, and Fiona Raby. Design noir: The secret life of electronic objects. Springer Science & Business Media, 2001.","paperID":"None"},{"content":"Pelle Ehn, Elisabet M. Nilsson, Richard Topgaard (eds). 2014. Making Futures. Marginal Notes on Innovation, Design and Democracy. Cambridge, Massachusetts: MIT Press.","paperID":"None"},{"content":"Batia Friedman. 1996. Value-sensitive design. Interactions, 3(6), 16--23.","paperID":"None"},{"content":"Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007. The three paradigms of HCI. In Alt. Chi. Session at the SIGCHI Conference on Human Factors in Computing Systems San Jose, California, USA, 1--18.","paperID":"None"},{"content":"Jasmine Ho. 2010. Shanzhai: Economic/Cultural Production through the Cracks of Globalization. Crossroads: Cultural Studies Conference.","paperID":"None"},{"content":"Lara Houston. 2014. Inventive Infrastructure: An Exploration of Mobile Phone, Dissertation: Lancaster University.","paperID":"None"},{"content":"NPR. 2015. Intel marks 30 years in China with with new products, investements, and collaborations. Accessed on September 20, 2015 from http://newsroom.intel.com/community/intel_newsroom/blog/2015/04/07/intel-marks-30-years-in-china-with-new-products-investments-and-collaborations","paperID":"None"},{"content":"Lily Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca Grinter. 2010. Postcolonial Computing: A Lens on Design and Development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1311--1320.","paperID":"None"},{"content":"Steven J. Jackson, Syed Ishtiaque Ahmed, and Md Rashidujjaman Rifat. 2014. Learning, innovation, and sustainability among mobile phone repairers in Dhaka, Bangladesh. In Proceedings of the 2014 conference on Designing interactive systems, 905--914.","paperID":"None"},{"content":"Steven J. Jackson, Alex Pompe and Gabriel Krieshok. 2012. Repair worlds: maintenance, repair, and ICT for development in rural Namibia. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW 2012), 107--116.","paperID":"None"},{"content":"Christopher Le Dantec and Sarah Fox. 2015. Strangers at the Gate: Gaining Access, Building Rapport, and Co-Constructing Community-Based Research. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 1348--1358","paperID":"None"},{"content":"Silvia Lindtner, Anna Greenspan, David Li. 2015. Designed in Shenzhen: Shanzhai Manufacturing and Maker Entrepreneurs. In Proceedings. of 5th Decennial Aarhus Conference on Critical Alternatives, Denmark, Aug 17--21, 2015, 85--96.","paperID":"None"},{"content":"Silvia Lindtner, Garnet Hertz, Paul Dourish. 2014. Emerging Sites of HCI Innovation: Hackerspaces, Hardware Start-ups, Incubators. In Proc. of the ACM SIGCHI Conference on Human Factors in Computing Systems CHI'14 (Toronto, Canada), 439--448.","paperID":"None"},{"content":"Silvia Lindtner. 2015. Hacking with Chinese Characteristics: The Promises of the Maker Movement against China's Manufacturing Culture. Science, Technology & Human Values (Sage), Vol. 40, No. 5, pp.854--879.","paperID":"None"},{"content":"Boy Lüthje, Stefanie Hürtgen, Peter Pawlicki, and Martina Sproll. 2013. From Silicon Valley to Shenzhen: Global production and work in the IT industry. Rowman & Littlefield.","paperID":"None"},{"content":"Samantha Merritt and Shaowen Bardzell. Postcolonial language and culture theory for HCI4D. In CHI'11 Extended Abstracts on Human Factors in Computing Systems, 1675--1680.","paperID":"None"},{"content":"Mary-Ann O'Donnell. 2010. What exactly is an urban village anyway? Accessed on June 1, 2015 from http://shenzhennoted.com/2010/03/19/what-exactly-is-an-urban-village-anyway/","paperID":"None"},{"content":"Mary-Ann O'Donnell. 2011. Utopian Shenzhen 1978--1982. http://shenzhennoted.com/2011/08/27/utopian-shenzhen-1978--1982/ last accessed June 1, 2015.","paperID":"None"},{"content":"Gordon Orr. 2014. What could happen in China in 2015. Retrieved March 15, 2015 from http://www.mckinsey.com/insights/strategy/what_could_happen_in_china_in_2015?cid=other-eml-ttn-mip-mck-oth-1503","paperID":"None"},{"content":"Kavita Philip 2005. What is a Technological Author? The Pirate Function and Intellectual Property. Postcolonial Studies 8: 199--218.","paperID":"None"},{"content":"Matt Ratto and Megan Boler (eds). 2014. DIY Citizenship. Critical Making and Social Media. Cambridge, Massachusetts: MIT Press.","paperID":"None"},{"content":"Erica Robles and Mikael Wiberg. 2011. From Materials to Materiality: Thinking of Computation from within and Icehotel. ACM Interactions 18, 1, 32--37.","paperID":"None"},{"content":"Jennifer Rode. 2011. Reflexivity in digital anthropology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 123--132.","paperID":"None"},{"content":"David Roedl, Shaowen Bardzell, Jeffrey Bardzell. 2015. Sustainable Making? Balancing Optimism and Criticism in HCI Discourse, ACM TOCHI Journal, VOl. 22, Issue 3, article no. 15.","paperID":"None"},{"content":"Daniela Rosner and Morgan Ames. 2014. Designing for repair?: infrastructures and materialities of breakdown. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, 319--331.","paperID":"None"},{"content":"Daniela Rosner, Jean-François Blanchette, Leah Buechley, Paul Dourish, and Melissa Mazmanian. 2012. From materials to materiality: connecting practice and theory in HCI.\" In CHI'12 Extended Abstracts on Human Factors in Computing Systems, 2787--2790.","paperID":"None"},{"content":"Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. Reflective design. 2005. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility, 49--58","paperID":"None"},{"content":"Aarti Shahani. 2015. Hope or hype? In Africa the revolution will be wireless. Retrieved August 15, 2015 from http://www.npr.org/sections/goatsandsoda/2015/08/03/429045737/hope-or-hype-the-revolution-in-africa-will-be-wireless.","paperID":"None"},{"content":"Clay Shirkey. 2015. Little rice: Smartphones, Xiaomi, and the Chinese Dream. Colombia Global Reports.","paperID":"None"},{"content":"Herbert A. Simon. 1996. The Sciences of the Artificial. Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Lucy Suchman. 2008. Striking Likeness to Difference. Paper presented at 4S/EASST (annual meeting of Society for Social Studies of Science), Rotterdam.","paperID":"None"},{"content":"Lucy Suchman. 1995. Making work visible. Communications of the ACM 38, 9, 56--64.","paperID":"None"},{"content":"Lucy Suchman. 2002. Located accountabilities in technology production. Scandinavian Journal of Information Systems -- Special Issue on Ethnography and intervention, Vol. 14, Issue 2, pp. 91--105.","paperID":"None"},{"content":"Truna. 2015. African gamer: whose story is it anyway? In At the Intersection of Indigenous and Traditional Knowledges and Technology Design. Nicola J. Bidwell & Heike Winschiers-Theophilus (eds). Informing Science Press.","paperID":"None"},{"content":"Anna Tsing. 2005. Friction: An ethnography of global connection. Princeton University Press.","paperID":"None"},{"content":"Alex Taylor. 2011. Out there. In Proceedings of the SIGVHI Conference on Human Factors in Computing Systems (CHI 2011), 685--694.","paperID":"None"},{"content":"Yuling Sun, Silvia Lindtner, Xianghua Ding, Tun Lu, Ning Gu. 2015. Reliving the Past & Making a Harmonious Society Today: A Study of Elderly Electronic Hackers in China. In Proc. of CSCW'15.","paperID":"None"},{"content":"Austin L. Toombs, Shaowen Bardzell, Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'15), 629--638.","paperID":"None"},{"content":"Anna Vallgårda and Johan Redstöm. 2007. Computational Composites. In Proceedings of ACM Conf. Human Factors in Computing Systems (CHI 2007), 513--522.","paperID":"None"},{"content":"Ron Wakkary and Leah Maestri. The Resourcefulness of Everyday Design. In Proceedings of SIGCHI Conference on Cognition and Creativity (C&C 2007), 163--172.","paperID":"None"},{"content":"Amanda Williams, Silvia Lindtner, Ken Anderson, and Paul Dourish. 2014. Multisited Design: An Analytical Lens for Transnational HCI. Human-Computer Interaction 29, 1, 78--108.","paperID":"None"},{"content":"Winnie Wong. 2014. Van Gough on Demand: China and the Ready Made. University of Chicago Press.","paperID":"None"},{"content":"Lin Zhang and Anthony Fung. 2013. The myth of \"shanzhai\" and the paradox of digital democracy in China. Inter-Asia Cultural Studies 14 (3), 401--416.","paperID":"None"}],"title":"Design(ing) 'Here' and 'There': Tech Entrepreneurs, Global Markets, and Reflexivity in Design Processes","filename":"CHI16/p2233","authors":["Seyram Avle","Silvia Lindtner"],"conference":"CHI '16"}