{"paperId":2858587,"citation":[],"reference":[{"content":"Luca Ballan, Aparna Taneja, Jürgen Gall, Luc Van Gool, and Marc Pollefeys. 2012. Motion capture of hands in action using discriminative salient points. In ECCV. Springer.","paperID":"None"},{"content":"Andrea Colaço, Ahmed Kirmani, Hye Soo Yang, Nan-Wei Gong, Chris Schmandt, and Vivek K. Goyal. 2013. Mime: Compact, Low Power 3D Gesture Sensing for Interaction with Head Mounted Displays. In UIST.","paperID":"None"},{"content":"Seth Cooper, Firas Khatib, Adrien Treuille, Janos Barbero, Jeehyung Lee, Michael Beenen, Andrew Leaver-Fay, David Baker, Zoran Popovi´c, and Foldit Players. 2010. Predicting protein structures with a multiplayer online game. Nature 466, 7307 (2010), 756--760.","paperID":"None"},{"content":"Martin de La Gorce, David J. Fleet, and Nikos Paragios. 2011. Model-Based 3D Hand Pose Estimation from Monocular Video. Pattern Analysis and Machine Intelligence, IEEE Transactions on 33, 9 (Sept 2011), 1793--1805.","paperID":"None"},{"content":"Ali Erol, George Bebis, Mircea Nicolescu, Richard D. Boyle, and Xander Twombly. 2007. Vision-based Hand Pose Estimation: A Review. Computer Vision and Image Understanding 108, 1--2 (Oct. 2007), 52--73.","paperID":"None"},{"content":"Jože Guna, Grega Jakus, Matevž Pogačnik, Sažo Tomažič, and Jaka Sodnik. 2014. An Analysis of the Precision and Reliability of the Leap Motion Sensor and Its Suitability for Static and Dynamic Tracking. Sensors 14, 2 (2014), 3702.","paperID":"None"},{"content":"Chris Harrison, Hrvoje Benko, and Andrew D. Wilson. 2011. OmniTouch: Wearable Multitouch Interaction Everywhere. In UIST.","paperID":"None"},{"content":"Tony Heap and David Hogg. 1996. Towards 3D hand tracking using a deformable model. In Automatic Face and Gesture Recognition, 1996., Proceedings of the Second International Conference on. 140--145.","paperID":"None"},{"content":"Cem Keskin, Furkan Kıraç, Yunus Emre Kara, and Lale Akarun. 2012. Hand Pose Estimation and Hand Shape Classification Using Multi-layered Randomized Decision Forests. In ECCV.","paperID":"None"},{"content":"David Kim, Otmar Hilliges, Shahram Izadi, Alex D Butler, Jiawen Chen, Iason Oikonomidis, and Patrick Olivier. 2012. Digits: freehand 3D interactions anywhere using a wrist-worn gloveless sensor. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM, 167--176.","paperID":"None"},{"content":"Leap Motion, Inc. 2014. (2014). http://leapmotion.com/","paperID":"None"},{"content":"Marius Muja and David G. Lowe. 2014. Scalable Nearest Neighbor Algorithms for High Dimensional Data. Pattern Analysis and Machine Intelligence, IEEE Transactions on 36 (2014).","paperID":"None"},{"content":"Richard A. Newcombe, Dieter Fox, and Steven M. Seitz. 2015. DynamicFusion: Reconstruction and Tracking of Non-Rigid Scenes in Real-Time. The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2015).","paperID":"None"},{"content":"Iason Oikonomidis, Nikolaos Kyriazis, and Antonis A Argyros. 2011. Efficient model-based 3D tracking of hand articulations using Kinect.. In BMVC.","paperID":"None"},{"content":"Chen Qian, Xiao Sun, Yichen Wei, Xiaoou Tang, and Jian Sun. 2014. Realtime and robust hand tracking from depth. In CVPR.","paperID":"None"},{"content":"Toby Sharp, Cem Keskin, Duncan Robertson, Jonathan Taylor, Jamie Shotton, David Kim, Christoph Rhemann, Ido Leichter, Alon Vinnikov, Yichen Wei, Daniel Freedman, Pushmeet Kohli, Eyal Krupka, Andrew Fitzgibbon, and Shahram Izadi. 2015. Accurate, Robust, and Flexible Real-time Hand Tracking. CHI.","paperID":"None"},{"content":"Jie Song, Fabrizio Pece, Gábor Sörös, Marion Koelle, and Otmar Hilliges. 2015. Joint Estimation of 3D Hand Position and Gestures from Monocular Video for Mobile Interaction. In CHI.","paperID":"None"},{"content":"Jie Song, Gábor Sörös, Fabrizio Pece, Sean Ryan Fanello, Shahram Izadi, Cem Keskin, and Otmar Hilliges. 2014. In-air Gestures Around Unmodified Mobile Devices. In UIST.","paperID":"None"},{"content":"Srinath Sridhar, Franziska Mueller, Antti Oulasvirta, and Christian Theobalt. 2015. Fast and Robust Hand Tracking Using Detection-Guided Optimization. In CVPR.","paperID":"None"},{"content":"Srinath Sridhar, Antti Oulasvirta, and Christian Theobalt. 2013. Interactive Markerless Articulated Hand Motion Tracking Using RGB and Depth Data. In ICCV.","paperID":"None"},{"content":"Yangang Wang, Jianyuan Min, Jianjie Zhang, Yebin Liu, Feng Xu, Qionghai Dai, and Jinxiang Chai. 2013. Video-based hand manipulation capture through composite motion control. ACM Transactions on Graphics (TOG) 32, 4 (2013), 43.","paperID":"None"},{"content":"Frank Weichert, Daniel Bachmann, Bartholomäus Rudak, and Denis Fisseler. 2013. Analysis of the Accuracy and Robustness of the Leap Motion Controller. Sensors (Basel, Switzerland) 13, 5 (05 2013), 6380--6393.","paperID":"None"},{"content":"Ying Wu, John Y Lin, and Thomas S Huang. 2001. Capturing natural hand articulation. In ICCV, Vol. 2.","paperID":"None"},{"content":"Wenping Zhao, Jinxiang Chai, and Ying-Qing Xu. 2012. Combining marker-based mocap and RGB-D camera for acquiring high-fidelity hand motion data. In Proceedings of the ACM SIGGRAPH/eurographics symposium on computer animation. Eurographics Association, 33--42.","paperID":"None"}],"abstract":"We propose a novel sensing technique called proactive sensing. Proactive sensing continually repositions a camera-based sensor as a way to improve hand pose estimation. Our core contribution is a scheme that effectively learns how to move the sensor to improve pose estimation confidence while requiring no ground truth hand poses. We demonstrate this concept using a low-cost rapid swing arm system built around the state-of-the-art commercial sensing system Leap Motion. The results from our user study show that proactive sensing helps estimate users' hand poses with higher confidence compared to both static and random sensing. We further present an online model update to improve performance for each user.","title":"Proactive Sensing for Improving Hand Pose Estimation","filename":"CHI16/p2348","authors":["Dun-Yu Hsiao","Min Sun","Christy Ballweber","Seth Cooper","Zoran Popović"],"conference":"CHI '16"}