{"paperId":2858493,"citation":[],"reference":[{"content":"Akaoka, E., Ginn, T., Vertegaal, R., 2010. DisplayObjects: prototyping functional physical interfaces on 3d styrofoam, paper or cardboard models. In: Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction. ACM, pp. 49--56.","paperID":"None"},{"content":"Avrahami, D., Hudson, S. E., 2002. Forming interactivity: a tool for rapid prototyping of physical interactive products. In: Proceedings of the 4th conference on Designing interactive systems: processes, practices, methods, and techniques. ACM, pp. 141--146.","paperID":"None"},{"content":"Block, F., Haller, M., Gellerson, H., Gutwin, C., and Billinghurst, M. 2008. VoodooSketch: Extending 5 Using a NextEngine 3D Scanner HD with ScanStudio HD Pro software and netfabb Professional for repairing and hollowing out the mesh. interactive surfaces with adaptable interface palettes. In Proceedings of the 2nd International Conference on Tangible and Embedded Interaction (TEI'08). ACM. pp. 55--58.","paperID":"None"},{"content":"Follmer, S., Johnson, M., Adelson, E., and Ishii, H., 2011. deForm: an interactive malleable surface for capturing 2.5D arbitrary objects, tools and touch. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, NY, NY, USA, pp. 527--536.","paperID":"None"},{"content":"Greenberg, S., Fitchett, C., 2001. Phidgets: easy development of physical interfaces through physical widgets. In: Proceedings of the 14th annual ACM symposium on User interface software and technology. ACM, pp. 209--218.","paperID":"None"},{"content":"Hartmann, B., Klemmer, S. R., Bernstein, M., Abdulla, L., Burr, B., Robinson-Mosher, A., Gee, J., 2006. Reflective physical prototyping through integrated design, test, and analysis. In: Proceedings of the 19th annual ACM symposium on User interface software and technology. ACM, pp. 299--308.","paperID":"None"},{"content":"Hudson, S. E., Mankoff, J., 2006. Rapid construction of functioning physical interfaces from cardboard, thumbtacks, tin foil and masking tape. In: Proceedings of the 19th annual ACM symposium on User interface software and technology. ACM, pp. 289--298.","paperID":"None"},{"content":"Klemmer, S. Hartmann, B., and Takayama, L. 2006. How bodies matter: five themes for interaction design. In Proceedings of the 6th conference on Designing Interactive systems (DIS '06). ACM, NY, NY, USA, 140--149.","paperID":"None"},{"content":"Lee, J., Avrahami, D., Hudson, S., Forlizzi, J., Dietz, P. and Leigh, D. \"The Calder toolkit: wired and wireless components for rapidly prototyping interactive devices\" in Processings of the 5th Conference of Designing Interactive Systems: Processes, Practices, Methods and Techniques. 2004. pp. 167--175.","paperID":"None"},{"content":"Savage, V., Chang, C. and Hartmann, B. \"Sauron: Embedded single-camera sensing of printed physical user interfaces\" ACM Symposium on User Interface Software and Technology (UIST '13). 2013.","paperID":"None"},{"content":"Savage, V., Follmer, S., Li, J., and Hargmann, B. 2015. Makers' Marks: Physical markup for designing and fabricating functional objects. In: Proceedings of the 28th Annual Symposium on User Interface Software and Technology (UIST'15). ACM. pp. 103--108.","paperID":"None"},{"content":"Savage, V., Head, A., Hartmann, B., Goldman, D. B., Mysore, G., Li, W., 2015. Lamello: Passive acoustic sensing for tangible input components. In: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, pp. 1277--1280.","paperID":"None"},{"content":"Shön, E. 1984. The Reflective Practitioner: How Professionals Think in Action. Basic Books.","paperID":"None"},{"content":"Vázquez, M., Brockmeyer, E., Desai, R., Harrison, C., Hudson, S. E., 2015. 3d printing pneumatic device controls with variable activation force capabilities. In: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, pp. 1295--1304.","paperID":"None"},{"content":"Villar, N., Scott, J., Hodges, S., Hammil, K., Miller, C., 2012. .net gadgeteer: a platform for custom devices. In: Pervasive Computing. Springer, pp. 216--233.","paperID":"None"}],"abstract":"We present a method for fabricating prototypes of interactive computing devices from clay sculptures without requiring the designer to be skilled in CAD software. The method creates a \"what you sculpt is what you get\" process that mimics the \"what you see is what you get\" processes used in interface design for 2D screens. Our approach uses clay for modeling the basic shape of the device around 3D printed representations, which we call \"blanks\", of physical interaction widgets such as buttons, sliders, knobs and other electronics. Each blank includes 4 fiducial markers uniquely arranged on a visible surface. After scanning the sculpture, these fiducial marks allow our software to identify widget types and locations in the scanned model. The software then converts the scan into a printable prototype by positioning mounting surfaces, openings for the controls and a splitting plane for assembly. Because the blanks fit in the sculpted shape, they will reliably fit in the interactive prototype. Creating an interactive prototype requires about 30 minutes of human effort for sculpting, and after scanning, involves a single button click to use the process.","title":"What you Sculpt is What you Get: Modeling Physical Interactive Devices with Clay and 3D Printed Widgets","filename":"CHI16/p876","authors":["Michael D. Jones","Kevin Seppi","Dan R. Olsen"],"conference":"CHI '16"}