{"paperId":2858331,"citation":[],"abstract":"There are currently over 1.1 million Syrian refugees in need of healthcare services from an already overstretched Lebanese healthcare system. Access to antenatal care (ANC) services presents a particular challenge. We conducted focus groups with 59 refugees in rural Lebanon to identify contextual and cultural factors that can inform the design of digital technologies to support refugee ANC. Previously identified high utilization of smartphones by the refugee population offers a particular opportunity for using digital technology to support access to ANC as well as health advocacy. Our findings revealed a number of considerations that should be taken into account in the design of refugee ANC technologies, including: refugee health beliefs and experiences, literacy levels, refugee perceptions of negative attitudes of healthcare providers, and hierarchal and familial structures.","reference":[{"content":"Kh Abu Hamad, Y Abed, and B Abu Hamad. 2007. Risk factors associated with preterm birth in the Gaza Strip: hospital-based case-control study. Eastern Mediterranean health journal = La revue de sante de la Mediterranee orientale = al-Majallah al-sihhiyah li-sharq al-mutawassit 13, 5: 1132--114","paperID":"None"},{"content":"M Alam, T Khanam, R Khan, A Raihan, and M Chowdhury. 2010. Assessing the scope for use of mobile based solution to improve maternal and child health in Bangladesh. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development (ICTD '10). http://dx.doi.org/10.1145/2369220.2370755","paperID":"None"},{"content":"Ruth Aylett, Michael Kriegel, MeiYii Lim, et al. 2009. ORIENT: interactive agents for stage-based role-play. In Proceedings of The 8th International Conference on Autonomous Agents and Multiagent Systems, 1371--1372. http://dl.acm.org/citation.cfm?id=1558300","paperID":"None"},{"content":"Jennifer Baranoff and R Israel Gonzales. 2015. Lantern?: Empowering Refugees Through Community-Generated Guidance Using Near Field Communication. CHI'15 Extended Abstracts, 7--12. http://dx.doi.org/10.1145/2702613.2726950","paperID":"None"},{"content":"Matthew Benage, P Gregg Greenough, Patrick Vinck, Nada Omeira, and Phuong Pham. 2015. An assessment of antenatal care among Syrian refugees in Lebanon. Conflict and health 9, 1: 8. http://doi.org/10.1186/s13031-015-0035--8","paperID":"None"},{"content":"Beyond Reform & Development. 2013. Preventing Tensions and Improving Quality of Services for Syrian Refugees and Lebanese Host Communities. Retrieved September 22, 2015 from https://www.beyondrd.com/assets/publications/Local Response Opportunities (English) - BRD.pdf","paperID":"None"},{"content":"Jocelyn DeJong and Golda El-Khoury. 2006. Reproductive health of Arab young people. BMJ: British Medical Journal 333, 7573: 849--851. http://doi.org/10.1136/bmj.38996.466678.68","paperID":"None"},{"content":"Peter D. Drummond, Ayse Mizan, Katie Brocx, and Bernadette Wright. 2011. Using Peer Education to Increase Sexual Health Knowledge Among West African Refugees in Western Australia. Health Care for Women International 32, 3: 190--205. http://doi.org/10.1080/07399332.2010.529215","paperID":"None"},{"content":"Independent Programme Evaluation. 2015. Independent Programme Evaluation ( IPE ) of UNHCR's Response to the refugee influx in Lebanon and Jordan. Retrieved September 22, 2015 from http://www.unhcr.org/5551f5c59.html","paperID":"None"},{"content":"The Ministry of Public Health. 2015. The Ministry of Public Health -Primary Health Care Network Centers. Retrieved September 22, 2015 from http://www.moph.gov.lb/Prevention/PHC/Documents/phcc.pdf","paperID":"None"},{"content":"Ellen Howard and Christine Wilson Owens. 2002. Using the internet to communicate with immigrant/refugee communities about health. In Proceedings of the ACM International Conference on Digital Libraries, 397. http://dx.doi.org/10.1145/544220.544345","paperID":"None"},{"content":"Jennifer Fereday and Eimear Muir-Cochrane. 2006. Demonstrating Rigor Using Thematic Analysis: A Hybrid Approach of Inductive and Deductive Coding and Theme Development. International Journal of Qualitative Methods 5: 80--92. http://doi.org/10.1063/1.2011295","paperID":"None"},{"content":"Unhcr Innovation. 2014. UNHCR Innovation. Retrieved September 20, 2015 from http://innovation.unhcr.org/","paperID":"None"},{"content":"Internews. 2013. Lost: Syrian Refugees and the Information Gap. Retrieved September 22, 2015 from http://www.internews.org/sites/default/files/resources/Internews_Lost_SyriaReport_Nov2013_web.pdf","paperID":"None"},{"content":"Denise J. Jamieson. 2000. An Evaluation of Poor Pregnancy Outcomes Among Burundian Refugees in Tanzania. Jama 283, 3: 397. http://doi.org/10.1001/jama.283.3.397","paperID":"None"},{"content":"C Johnson. 2013. Focus on technology and the future of humanitarian action. Retrieved September 22, 2015 from http://discovery.ucl.ac.uk/1332843/","paperID":"None"},{"content":"Ahmad Kassem, Vincent Dupin, and Synne Bergby. 2015. Mid-Year Dashboard. Retrieved September 22, 2015 from http://data.unhcr.org/syrianrefugees/documents.php?page=1&view=grid&Language[]=1&Country[]=122&WG[]=20","paperID":"None"},{"content":"Neha Kumar and Richard J. Anderson. 2015. Mobile Phones for Maternal Health in Rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15: 427--436. http://doi.org/10.1145/2702123.2702258","paperID":"None"},{"content":"Neha Kumar, Trevor Perrier, Michelle Desmond, et al. 2015. Projecting Health?: Community-Led Video Education for Maternal Health. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development (ICTD '15). http://doi.org/http://doi.acm.org/10.1145/2737856.2738023","paperID":"None"},{"content":"Abdullah Al Mahmud and David V. Keyson. 2013. Designing with Midwives: Improving Prenatal Care in Low Resource Regions. In Proceedings of the ICTs for improving Patients Rehabilitation Research Techniques, 180--183. http://doi.org/10.4108/pervasivehealth.2013.252032","paperID":"None"},{"content":"Anutosh Maitra and Nataraj Kuntagod. 2013. A novel mobile application to assist maternal health workers in rural India. In Proceedings of the 5th International Workshop on Software Engineering in Health Care (SEHC '13), 75--78. http://doi.org/10.1109/SEHC.2013.6602482","paperID":"None"},{"content":"Indrani Medhi, Somani Patnaik, Emma Brunskill, S.N. Nagasena Gautama, William Thies, and Kentaro Toyama. 2011. Designing mobile interfaces for novice and low-literacy users. ACM Transactions on Computer-Human Interaction 18, 1: 1--28. http://doi.org/10.1145/1959022.1959024","paperID":"None"},{"content":"Indrani Medhi, a. Prasad, and K. Toyama. 2007. Optimal audio-visual representations for illiterate users of computers. In Proceedings of the 16th international conference on World Wide Web, 873--882. http://doi.org/10.1145/1242572.1242690","paperID":"None"},{"content":"Maletsabisa Molapo and Gary Marsden. 2013. Software support for creating digital health training materials in the field. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development (ICTD'13), 205--214. http://doi.org/10.1145/2516604.2516632","paperID":"None"},{"content":"C J Murray, G King, A D Lopez, N Tomijima, and E G Krug. 2002. Armed conflict as a public health problem. Br Med J 324, 7333: 346--349. http://doi.org/10.1136/bmj.324.7333.346","paperID":"None"},{"content":"Janni Nielsen and Mads Bødker. 2009. Collaborating with users. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group on Design (OZCHI'09), 325. http://doi.org/10.1145/1738826.1738887","paperID":"None"},{"content":"Trevor Perrier, Nicola Dell, Brian Derenzi, et al. 2015. Engaging Pregnant Women in Kenya with a Hybrid Computer-Human SMS Communication System. In Proceedings of the ACM Conference on Human Factors in Computing Systems, 1429--1438. http://doi.org/10.1145/2702123.2702124","paperID":"None"},{"content":"Lisa Quirke. 2012. Information practices in newcomer settlement: a study of Afghan immigrant and refugee youth in Toronto. In Proceedings of the 2012 iConference, 535--537. http://doi.org/10.1145/2132176.2132278","paperID":"None"},{"content":"Divya Ramachandran, Vivek Goswami, and John Canny. 2010. Research and reality. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development (ICTD '10), 1--10. http://doi.org/10.1145/2369220.2369253","paperID":"None"},{"content":"Amelia Reese Masterson, Jinan Usta, Jhumka Gupta, and Adrienne S Ettinger. 2014. Assessment of reproductive health and violence against women among displaced Syrians in Lebanon. BMC women's health 14, 1: 25. http://doi.org/10.1186/1472--6874--14--25","paperID":"None"},{"content":"Nitin Sawhney. 2009. Voices beyond walls. In Proceedings of the 8th International Conference on Interaction Design and Children (IDC '09), 302. http://doi.org/10.1145/1551788.1551866","paperID":"None"},{"content":"Harold Somers. 2006. Language Engineering and the Pathway to Healthcare: A user-oriented view. In Proceedings of the Workshop on Medical Speech Translation (MST'06), 28--35.","paperID":"None"},{"content":"Priyamvada Tiwari and Keyur Sorathia. 2014. Visualising and systematizing a per-poor ICT intervention for Rural and Semi-urban Mothers in India. In Proceedings of the 7th International Symposium on Visual Information Communication and Interaction (VINCI'14), 129--138. http://doi.org/10.1145/2636240.2636856","paperID":"None"},{"content":"UNHCR. 2013. Lebanon Operational Guidance. Retrieved September 22, 2015 from https://data.unhcr.org/syrianrefugees/download.php?id=2257","paperID":"None"},{"content":"UNHCR. 2014. Refugee Figures. Retrieved September 20, 2015 from http://www.unhcr.org/pages/49c3646c1d.html","paperID":"None"},{"content":"Unhcr. 2015. Syria Regional Refugee Response (Bekaa). Retrieved September 22, 2015 from http://data.unhcr.org/syrianrefugees/region.php?id=90&country=122","paperID":"None"},{"content":"Dennis Wollersheim, Lee Koh, Rae Walker, and Pranee Liamputtong. 2013. Constant connections: Piloting a mobile phone-based peer support program for Nuer (southern Sudanese) women. Australian Journal of Primary Health 19, 1: 7--13. http://doi.org/10.1071/PY11052","paperID":"None"},{"content":"Ying Xu, Carleen Maitland, and Brian Tomaszewski. 2015. Promoting Participatory Community Building in Refugee Camps with Mapping Technology. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development (ICTD '15). http://dx.doi.org/10.1145/2737856.2737883","paperID":"None"},{"content":"George Yerousis, Konstantin Aal, Thomas von Rekowski, David W. Randall, Markus Rohde, and Volker Wulf. 2015. Computer-Enabled Project Spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15), 3749--3758. http://doi.org/10.1145/2702123.2702283","paperID":"None"}],"title":"Syrian Refugees and Digital Health in Lebanon: Opportunities for Improving Antenatal Health","filename":"CHI16/p331","authors":["Reem Talhouk","Sandra Mesmar","Anja Thieme","Madeline Balaam","Patrick Olivier","Chaza Akik","Hala Ghattas"],"conference":"CHI '16"}