{"paperId":2858041,"citation":[],"reference":[{"content":"Leonardo Angelini, Denis Lalanne, Elise van den Hoven, Ali Mazalek, Omar Abou Khaled, and Elena Mugellini. 2015. Tangible Meets Gestural: Comparing and Blending Post-WIMP Interaction Paradigms. In Proceedings of the 9th International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, 473-476. DOI: http://dx.doi.org/10.1145/2677199.2683583","paperID":"None"},{"content":"Gilles Bailly, Jörg Müller, and Eric Lecolinet. 2012. Design and Evaluation of Finger-count Interaction: Combining Multitouch Gestures and Menus. Int. J. Hum.-Comput. Stud. 70, 10 (Oct. 2012), 673-689. DOI: http://dx.doi.org/10.1016/j.ijhcs.2012.05.006","paperID":"None"},{"content":"Tom Bartindale and Chris Harrison. 2009. Stacks on the Surface: Resolving Physical Order Using Fiducial Markers with Structured Transparency. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '09). ACM, 57-60. DOI: http://dx.doi.org/10.1145/1731903.1731916","paperID":"None"},{"content":"Tom Bartindale, Chris Harrison, Patrick Olivier, and Scott E. Hudson. 2011. SurfaceMouse: Supplementing Multi-touch Interaction with a Virtual Mouse. In Proceedings of the 5th International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, 293-296. DOI: http://dx.doi.org/10.1145/1935701.1935767","paperID":"None"},{"content":"Patrick Baudisch, Torsten Becker, and Frederik Rudeck. 2010. Lumino: Tangible Blocks for Tabletop Computers Based on Glass Fiber Bundles. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, 1165-1174. DOI: http://dx.doi.org/10.1145/1753326.1753500","paperID":"None"},{"content":"Hrvoje Benko, T. Scott Saponas, Dan Morris, and Desney Tan. 2009. Enhancing Input on and Above the Interactive Surface with Muscle Sensing. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '09). ACM, 93-100. DOI: http://dx.doi.org/10.1145/1731903.1731924","paperID":"None"},{"content":"Hrvoje Benko, Andrew D Wilson, and Patrick Baudisch. 2006. Precise Selection Techniques for Multi-Touch Screens. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI '06). 1263-1272. DOI: http://dx.doi.org/10.1145/1124772.1124963","paperID":"None"},{"content":"Andrea Bianchi and Ian Oakley. 2013. Designing Tangible Magnetic Appcessories. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13). ACM, 255-258. DOI:http://dx.doi.org/10.1145/2460625.2460667","paperID":"None"},{"content":"Andrea Bianchi and Ian Oakley. 2015. MagnID: Tracking Multiple Magnetic Tokens. In Proceedings of the 9th International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, 61-68. DOI: http://dx.doi.org/10.1145/2677199.2680582","paperID":"None"},{"content":"Eric A. Bier, Maureen C. Stone, Ken Pier, William Buxton, and Tony D. DeRose. 1993. Toolglass and Magic Lenses: The See-through Interface. In Proceedings of the 20th Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '93). ACM, 73-80. DOI: http://dx.doi.org/10.1145/166117.166126","paperID":"None"},{"content":"Rachel Blagojevic and Beryl Plimmer. 2013. CapTUI: Geometric Drawing with Tangibles on a Capacitive Multi-touch Display. In Proceedings of INTERACT '13. Springer, 511-528.","paperID":"None"},{"content":"Sebastian Boring, David Ledo, Xiang 'Anthony' Chen, Nicolai Marquardt, Anthony Tang, and Saul Greenberg. 2012. The fat thumb: using the thumb's contact size for single-handed mobile interaction. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services companion (MobileHCI '12). ACM, 207-208. DOI: http://dx.doi.org/10.1145/2371664.2371711","paperID":"None"},{"content":"Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2301-2309. DOI: http://dx.doi.org/10.1109/TVCG.2011.185","paperID":"None"},{"content":"Bryan Buchholz, Thomas J Armstrong, and Steven A Goldstein. 1992. Anthropometric data for describing the kinematics of the human hand. Ergonomics 35, 3 (1992), 261-273.","paperID":"None"},{"content":"Wolfgang Büschel, Ulrike Kister, Mathias Frisch, and Raimund Dachselt. 2014. T4 - Transparent and Translucent Tangibles on Tabletops. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, 81-88. DOI: http://dx.doi.org/10.1145/2598153.2598179","paperID":"None"},{"content":"Xiang Cao, A.D. Wilson, R. Balakrishnan, K. Hinckley, and S.E. Hudson. 2008. ShapeTouch: Leveraging contact shape on interactive surfaces. In Proceedings of the 3rd International Workshop on Horizontal Interactive Human Computer Systems (TABLETOP '08). IEEE, 129-136. DOI: http://dx.doi.org/10.1109/TABLETOP.2008.4660195","paperID":"None"},{"content":"Liwei Chan, Stefanie Müller, Anne Roudaut, and Patrick Baudisch. 2012. CapStones and ZebraWidgets: Sensing Stacks of Building Blocks, Dials and Sliders on Capacitive Touch Screens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, 2189-2192. DOI: http://dx.doi.org/10.1145/2207676.2208371","paperID":"None"},{"content":"George W. Fitzmaurice, Hiroshi Ishii, and William A. S. Buxton. 1995. Bricks: Laying the Foundations for Graspable User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM Press/Addison-Wesley Publishing Co., 442-449. DOI: http://dx.doi.org/10.1145/223904.223964","paperID":"None"},{"content":"Dustin Freeman, Hrvoje Benko, Meredith Ringel Morris, and Daniel Wigdor. 2009. ShadowGuides: Visualizations for In-situ Learning of Multi-touch and Whole-hand Gestures. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '09). ACM, 165-172. DOI: http://dx.doi.org/10.1145/1731903.1731935","paperID":"None"},{"content":"Mathias Frisch, Sebastian Kleinau, Ricardo Langner, and Raimund Dachselt. 2011. Grids & Guides: Multi-touch Layout and Alignment Tools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, 1615-1618. DOI: http://dx.doi.org/10.1145/1978942.1979177","paperID":"None"},{"content":"Emilien Ghomi, Stéphane Huot, Olivier Bau, Michel Beaudouin-Lafon, and Wendy E. Mackay. 2013. Arpège: Learning Multitouch Chord Gestures Vocabularies. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, 209-218. DOI: http://dx.doi.org/10.1145/2512349.2512795","paperID":"None"},{"content":"Chris Harrison, Julia Schwarz, and Scott E. Hudson. 2011. TapSense: Enhancing Finger Interaction on Touch Surfaces. In Proceedings of the 24th ACM Symposium on User Interface Software and Technology (UIST '11). ACM, 627-636. DOI: http://dx.doi.org/10.1145/2047196.2047279","paperID":"None"},{"content":"Chris Harrison, Robert Xiao, Julia Schwarz, and Scott E. Hudson. 2014. TouchTools: Leveraging Familiarity and Skill with Physical Tools to Augment Touch Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 2913-2916. DOI: http://dx.doi.org/10.1145/2556288.2557012","paperID":"None"},{"content":"Björn Hartmann, Meredith Ringel Morris, Hrvoje Benko, and Andrew D. Wilson. 2009. Augmenting Interactive Tables with Mice & Keyboards. In Proceedings of the 22nd ACM Symposium on User Interface Software and Technology (UIST '09). ACM, 149-152. DOI: http://dx.doi.org/10.1145/1622176.1622204","paperID":"None"},{"content":"Seongkook Heo and Geehyuk Lee. 2011. Force Gestures: Augmenting Touch Screen Gestures with Normal and Tangential Forces. In Proceedings of the 24th ACM Symposium on User Interface Software and Technology (UIST '11). ACM, 621-626. DOI: http://dx.doi.org/10.1145/2047196.2047278","paperID":"None"},{"content":"Lars Erik Holmquist, Johan Redström, and Peter Ljungstrand. 1999. Token-Based Access to Digital Information. In Proceedings of the 1st International Symposium on Handheld and Ubiquitous Computing (HUC '99). Springer-Verlag, 234-245. http://dl.acm.org/citation.cfm?id=647985.743869","paperID":"None"},{"content":"Christian Holz and Patrick Baudisch. 2013. Fiberio: A Touchscreen That Senses Fingerprints. In Proceedings of the 26th ACM Symposium on User Interface Software and Technology (UIST '13). ACM, 41-50. DOI: http://dx.doi.org/10.1145/2501988.2502021","paperID":"None"},{"content":"Yvonne Jansen, Pierre Dragicevic, and Jean-Daniel Fekete. 2012. Tangible Remote Controllers for Wall-size Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, 2865-2874. DOI: http://dx.doi.org/10.1145/2207676.2208691","paperID":"None"},{"content":"Hans-Christian Jetter, Jens Gerken, Michael Zöllner, Harald Reiterer, and Natasa Milic-Frayling. 2011. Materializing the Query with Facet-streams: A Hybrid Surface for Collaborative Search on Tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, 3013-3022. DOI: http://dx.doi.org/10.1145/1978942.1979390","paperID":"None"},{"content":"Sergi Jordà, Günter Geiger, Marcos Alonso, and Martin Kaltenbrunner. 2007. The reacTable: Exploring the Synergy Between Live Music Performance and Tabletop Tangible Interfaces. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (TEI '07). ACM, 139-146. DOI: http://dx.doi.org/10.1145/1226969.1226998","paperID":"None"},{"content":"Martin Kaltenbrunner and Ross Bencina. 2007. reacTIVision: A Computer-vision Framework for Table-based Tangible Interaction. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (TEI '07). ACM, 69-74. DOI: http://dx.doi.org/10.1145/1226969.1226983","paperID":"None"},{"content":"Hideki Koike, Wataru Nishikawa, and Kentaro Fukuchi. 2009. Transparent 2-D Markers on an LCD Tabletop System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, 163-172. DOI: http://dx.doi.org/10.1145/1518701.1518728","paperID":"None"},{"content":"Sven Kratz, Tilo Westermann, Michael Rohs, and Georg Essl. 2011. CapWidgets: Tangible Widgets Versus Multi-touch Controls on Mobile Devices. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, 1351-1356. DOI: http://dx.doi.org/10.1145/1979742.1979773","paperID":"None"},{"content":"Rong-Hao Liang, Kai-Yin Cheng, Liwei Chan, Chuan-Xhyuan Peng, Mike Y. Chen, Rung-Huei Liang, De-Nian Yang, and Bing-Yu Chen. 2013. GaussBits: Magnetic Tangible Bits for Portable and Occlusion-free Near-surface Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 1391-1400. DOI: http://dx.doi.org/10.1145/2470654.2466185","paperID":"None"},{"content":"Rong-Hao Liang, Han-Chih Kuo, Liwei Chan, De-Nian Yang, and Bing-Yu Chen. 2014. GaussStones: Shielded Magnetic Tangibles for Multi-token Interactions on Portable Displays. In Proceedings of the 27th ACM Symposium on User Interface Software and Technology (UIST '14). ACM, 365-372. DOI: http://dx.doi.org/10.1145/2642918.2647384","paperID":"None"},{"content":"Jack M Loomis and Susan J Lederman. 1986. Tactual perception. In Handbook of Perception and Human Performance, K. R. Boff, L. Kaufman, and J. P. Thomas (Eds.). John Wiley & Sons.","paperID":"None"},{"content":"Halla Olafsdottir and Caroline Appert. 2014. Multi-touch Gestures for Discrete and Continuous Control. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, 177-184. DOI: http://dx.doi.org/10.1145/2598153.2598169","paperID":"None"},{"content":"Halla Olafsdottir, Theophanis Tsandilas, and Caroline Appert. 2014. Prospective Motor Control on Tabletops: Planning Grasp for Multitouch Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 2893-2902. DOI: http://dx.doi.org/10.1145/2556288.2557029","paperID":"None"},{"content":"Brandon Paulson, Danielle Cummings, and Tracy Hammond. 2011. Object Interaction Detection Using Hand Posture Cues in an Office Setting. Int. J. Hum.-Comput. Stud. 69, 1--2 (Jan. 2011), 19-29. DOI: http://dx.doi.org/10.1016/j.ijhcs.2010.09.003","paperID":"None"},{"content":"Jun Rekimoto. 2002. SmartSkin: An Infrastructure for Freehand Manipulation on Interactive Surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, 113-120. DOI: http://dx.doi.org/10.1145/503376.503397","paperID":"None"},{"content":"Jun Rekimoto, Brygg Ullmer, and Haruo Oba. 2001. DataTiles: A Modular Platform for Mixed Physical and Graphical Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, 269-276. DOI: http://dx.doi.org/10.1145/365024.365115","paperID":"None"},{"content":"Marco Santello and John F Soechting. 1998. Gradual molding of the hand to object contours. Journal of neurophysiology 79, 3 (1998), 1307-1320.","paperID":"None"},{"content":"Atsushi Sugiura and Yoshiyuki Koseki. 1998. A User Interface Using Fingerprint Recognition: Holding Commands and Data Objects on Fingers. In Proceedings of the 11th ACM Symposium on User Interface Software and Technology (UIST '98). ACM, 71-79. DOI: http://dx.doi.org/10.1145/288392.288575","paperID":"None"},{"content":"Brygg Ullmer, Hiroshi Ishii, and Dylan Glas. 1998. mediaBlocks: Physical Containers, Transports, and Controls for Online Media. In Proceedings of the 25th Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '98). ACM, 379-386. DOI: http://dx.doi.org/10.1145/280814.280940","paperID":"None"},{"content":"Brygg Ullmer, Hiroshi Ishii, and Robert J. K. Jacob. 2003. Tangible Query Interfaces: Physically Constrained Tokens for Manipulating Database Queries. In Proceedings of INTERACT '03. 279-286.","paperID":"None"},{"content":"Consuelo Valdes, Diana Eastman, Casey Grote, Shantanu Thatte, Orit Shaer, Ali Mazalek, Brygg Ullmer, and Miriam K. Konkel. 2014. Exploring the Design Space of Gestural Interaction with Active Tokens Through User-defined Gestures. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI '14). ACM, 4107-4116. DOI: http://dx.doi.org/10.1145/2556288.2557373","paperID":"None"},{"content":"Radu-Daniel Vatavu and Ionu Alexandru Zaii. 2013. Automatic Recognition of Object Size and Shape via User-dependent Measurements of the Grasping Hand. Int. J. Hum.-Comput. Stud. 71, 5 (May 2013), 590-607. DOI: http://dx.doi.org/10.1016/j.ijhcs.2013.01.002","paperID":"None"},{"content":"Simon Voelker, Kosuke Nakajima, Christian Thoresen, Yuichi Itoh, Kjell Ivar Øvergård, and Jan Borchers. 2013. PUCs: Detecting Transparent, Passive Untouched Capacitive Widgets on Unmodified Multi-touch Displays. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, 101-104. DOI: http://dx.doi.org/10.1145/2512349.2512791","paperID":"None"},{"content":"Daniel Vogel and Géry Casiez. 2011. Conté: Multimodal Input Inspired by an Artist's Crayon. In Proceedings of the 24th ACM Symposium on User Interface Software and Technology (UIST '11). ACM, 357-366. DOI: http://dx.doi.org/10.1145/2047196.2047242","paperID":"None"},{"content":"Malte Weiss, Julie Wagner, Yvonne Jansen, Roger Jennings, Ramsin Khoshabeh, James D. Hollan, and Jan Borchers. 2009. SLAP Widgets: Bridging the Gap Between Virtual and Physical Controls on Tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, 481-490. DOI: http://dx.doi.org/10.1145/1518701.1518779","paperID":"None"},{"content":"Alexander Wiethoff, Hanna Schneider, Michael Rohs, Andreas Butz, and Saul Greenberg. 2012. Sketch-a-TUI: Low Cost Prototyping of Tangible Interactions Using Cardboard and Conductive Ink. In Proceedings of the 6th International Conference on Tangible, Embedded and Embodied Interaction (TEI '12). ACM, 309-312. DOI:http://dx.doi.org/10.1145/2148131.2148196","paperID":"None"},{"content":"Daniel Wigdor, Hrvoje Benko, John Pella, Jarrod Lombardo, and Sarah Williams. 2011. Rock & Rails: Extending Multi-touch Interactions with Shape Gestures to Enable Precise Spatial Manipulations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, 1581-1590. DOI: http://dx.doi.org/10.1145/1978942.1979173","paperID":"None"},{"content":"Mike Wu and Ravin Balakrishnan. 2003. Multi-finger and Whole Hand Gestural Interaction Techniques for Multi-user Tabletop Displays. In Proceedings of the 16th ACM Symposium on User Interface Software and Technology (UIST '03). ACM, 193-202. DOI: http://dx.doi.org/10.1145/964696.964718","paperID":"None"},{"content":"Mike Wu, Chia Shen, Kathy Ryall, Clifton Forlines, and Ravin Balakrishnan. 2006. Gesture Registration, Relaxation, and Reuse for Multi-Point Direct-Touch Surfaces. In Proceedings of the 1st International Workshop on Horizontal Interactive Human-Computer Systems (TABLETOP '06). IEEE, 185-192. DOI: http://dx.doi.org/10.1109/TABLETOP.2006.19","paperID":"None"},{"content":"Neng-Hao Yu, Sung-Sheng Tsai, I-Chun Hsiao, Dian-Je Tsai, Meng-Han Lee, Mike Y. Chen, and Yi-Ping Hung. 2011. Clip-on Gadgets: Expanding Multi-touch Interaction Area with Unpowered Tactile Controls. In Proceedings of the 24th ACM Symposium on User Interface Software and Technology (UIST '11). ACM, 367-372. DOI: http://dx.doi.org/10.1145/2047196.2047243","paperID":"None"},{"content":"Shumin Zhai, Per Ola Kristensson, Caroline Appert, Tue Haste Andersen, and Xiang Cao. 2012. Foundational Issues in Touch-Surface Stroke Gesture Design: An Integrative Review. Found. Trends Hum.-Comput. Interact. 5, 2 (Feb. 2012), 97-205. DOI: http://dx.doi.org/10.1561/1100000012","paperID":"None"}],"abstract":"TouchTokens make it possible to easily build interfaces that combine tangible and gestural input using passive tokens and a regular multi-touch surface. The tokens constrain users' grasp, and thus, the relative spatial configuration of fingers on the surface, theoretically making it possible to design algorithms that can recognize the resulting touch patterns. We performed a formative user study to collect and analyze touch patterns with tokens of varying shape and size. The analysis of this pattern collection showed that individual users have a consistent grasp for each token, but that this grasp is user-dependent and that different grasp strategies can lead to confounding patterns. We thus designed a second set of tokens featuring notches that constrain users' grasp. Our recognition algorithm can classify the resulting patterns with a high level of accuracy (>95%) without any training, enabling application designers to associate rich touch input vocabularies with command triggers and parameter controls.","title":"TouchTokens: Guiding Touch Patterns with Passive Tokens","filename":"CHI16/p4189","authors":["Rafael Morales González","Caroline Appert","Gilles Bailly","Emmanuel Pietriga"],"conference":"CHI '16"}