{"paperId":2858180,"citation":[],"reference":[{"content":"John J Barton and Vikram Vijayaraghavan. 2003. UBIWISE, a simulator for ubiquitous computing systems design. Technical report HPL-2003-93 (2003).","paperID":"None"},{"content":"Eva Brandt and Camilla Grunnet. 2000. Evoking the future: Drama and props in user centered design. In Proceedings of Participatory Design Conference (PDC '00). 11--20.","paperID":"None"},{"content":"Marion Buchenau and Jane Fulton Suri. 2000. Experience Prototyping. In Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '00). ACM, NY, NY, USA, 424--433. DOI: http://dx.doi.org/10.1145/347642.347802","paperID":"None"},{"content":"Colin Burns, Eric Dishman, William Verplank, and Bud Lassiter. 1994. Actors, Hairdos & Videotape Informance Design. In Conference Companion on Human Factors in Computing Systems (CHI '94). ACM, NY, NY, USA, 119--120. DOI: http://dx.doi.org/10.1145/259963.260102","paperID":"None"},{"content":"Bill Buxton. 2007. Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.","paperID":"None"},{"content":"Xiang Cao and Ravin Balakrishnan. 2006. Interacting with Dynamically Defined Information Spaces Using a Handheld Projector and a Pen. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, NY, NY, USA, 225--234. DOI: http://dx.doi.org/10.1145/1166253.1166289","paperID":"None"},{"content":"Stefan Carmien, Melissa Dawe, Gerhard Fischer, Andrew Gorman, Anja Kintsch, and James F. Sullivan, JR. 2005. Socio-technical Environments Supporting People with Cognitive Disabilities Using Public Transportation. ACM Trans. Comput.-Hum. Interact. 12, 2 (June 2005), 233--262. DOI: http://dx.doi.org/10.1145/1067860.1067865","paperID":"None"},{"content":"Peter Dalsgaard and Kim Halskov. 2012. Tangible 3D Tabletops: Combining Tangible Tabletop Interaction and 3D Projection. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, NY, NY, USA, 109--118. DOI: http://dx.doi.org/10.1145/2399016.2399033","paperID":"None"},{"content":"James Fogarty, Jodi Forlizzi, and Scott E. Hudson. 2002. Specifying Behavior and Semantic Meaning in an Unmodified Layered Drawing Package. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (UIST '02). ACM, NY, NY, USA, 61--70. DOI: http://dx.doi.org/10.1145/571985.571995","paperID":"None"},{"content":"Saul Greenberg, Nicolai Marquardt, Till Ballendat, Rob Diaz-Marino, and Miaosen Wang. 2011. Proxemic Interactions: The New Ubicomp- interactions 18, 1 (Jan. 2011), 42--50. DOI: http://dx.doi.org/10.1145/1897239.1897250","paperID":"None"},{"content":"Björn Hartmann, Scott R. Klemmer, Michael Bernstein, Leith Abdulla, Brandon Burr, Avi Robinson-Mosher, and Jennifer Gee. 2006. Reflective Physical Prototyping Through Integrated Design, Test, and Analysis. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, NY, NY, USA, 299--308. DOI: http://dx.doi.org/10.1145/1166253.1166300","paperID":"None"},{"content":"David Holman and Hrvoje Benko. 2011. SketchSpace: Designing Interactive Behaviors with Passive Materials. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 1987--1992. DOI: http://dx.doi.org/10.1145/1979742.1979867","paperID":"None"},{"content":"Yosuke Horiuchi, Tomoo Inoue, and Ken-ichi Okada. 2012. Virtual Stage Linked with a Physical Miniature Stage to Support Multiple Users in Planning Theatrical Productions. In Proceedings of the 2012 ACM International Conference on Intelligent User Interfaces (IUI '12). ACM, NY, NY, USA, 109--118. DOI: http://dx.doi.org/10.1145/2166966.2166989","paperID":"None"},{"content":"Takuma Hosokawa, Yasuhiko Takeda, Norio Shioiri, Mitsunori Hirano, and Kazuhiko Tanaka. 2008. Tangible Design Support System Using RFID Technology. In Proceedings of the 2Nd International Conference on Tangible and Embedded Interaction (TEI '08). ACM, NY, NY, USA, 75--78. DOI: http://dx.doi.org/10.1145/1347390.1347408","paperID":"None"},{"content":"Yasuaki Kakehi, Junichi Yamaoka, Daisuke Akatsuka, and Takeshi Naemura. 2009. Tablescape Animation: A Support System for Making Animations Using Tabletop Physical Objects. In SIGGRAPH 2009: Talks (SIGGRAPH '09). ACM, NY, NY, USA, Article 70, 1 pages. DOI: http://dx.doi.org/10.1145/1597990.1598060","paperID":"None"},{"content":"Satoshi Kanai, Soh Horiuchi, Yukiaki Kikuta, Akihiko Yokoyama, and Yoshiyuki Shiroma. 2007. An integrated environment for testing and assessing the usability of information appliances using digital and physical mock-ups. (2007), 478--487.","paperID":"None"},{"content":"Scott R. Klemmer, Jack Li, James Lin, and James A. Landay. 2004. Papier-Mache: Toolkit Support for Tangible Input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 399--406. DOI: http://dx.doi.org/10.1145/985692.985743","paperID":"None"},{"content":"Woohun Lee and Jun Park. 2005. Augmented Foam: A Tangible Augmented Reality for Product Design. In Proceedings of the 4th IEEE/ACM International Symposium on Mixed and Augmented Reality (ISMAR '05). IEEE Computer Society, Washington, DC, USA, 106--109. DOI: http://dx.doi.org/10.1109/ISMAR.2005.16","paperID":"None"},{"content":"Yang Li, Jason I. Hong, and James A. Landay. 2004. Topiary: A Tool for Prototyping Location-enhanced Applications. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, NY, NY, USA, 217--226. DOI: http://dx.doi.org/10.1145/1029632.1029671","paperID":"None"},{"content":"Blair MacIntyre, Maribeth Gandy, Steven Dow, and Jay David Bolter. 2004. DART: A Toolkit for Rapid Design Exploration of Augmented Reality Experiences. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, NY, NY, USA, 197--206. DOI: http://dx.doi.org/10.1145/1029632.1029669","paperID":"None"},{"content":"Michael R. Marner, Bruce H. Thomas, and Christian Sandor. 2009. Physical-virtual Tools for Spatial Augmented Reality User Interfaces. In Proceedings of the 2009 8th IEEE International Symposium on Mixed and Augmented Reality (ISMAR '09). IEEE Computer Society, Washington, DC, USA, 205--206. DOI: http://dx.doi.org/10.1109/ISMAR.2009.5336458","paperID":"None"},{"content":"Nicolai Marquardt, Robert Diaz-Marino, Sebastian Boring, and Saul Greenberg. 2011. The Proximity Toolkit: Prototyping Proxemic Interactions in Ubiquitous Computing Ecologies. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 315--326. DOI: http://dx.doi.org/10.1145/2047196.2047238","paperID":"None"},{"content":"Yasuto Nakanishi. 2012. Virtual Prototyping Using Miniature Model and Visualization for Interactive Public Displays. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 458--467. DOI: http://dx.doi.org/10.1145/2317956.2318024","paperID":"None"},{"content":"Tek-Jin Nam. 2005. Sketch-based Rapid Prototyping Platform for Hardware-software Integrated Interactive Products. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, NY, NY, USA, 1689--1692. DOI: http://dx.doi.org/10.1145/1056808.1056998","paperID":"None"},{"content":"Tek-Jin Nam and Woohun Lee. 2003. Integrating Hardware and Software: Augmented Reality Based Prototyping Method for Digital Products. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, NY, NY, USA, 956--957. DOI: http://dx.doi.org/10.1145/765891.766092","paperID":"None"},{"content":"Hiroshi Nishikawa, Shinya Yamamoto, Morihiko Tamai, Kouji Nishigaki, Tomoya Kitani, Naoki Shibata, Keiichi Yasumoto, and Minoru Ito. 2006. UbiREAL: Realistic Smartspace Simulator for Systematic Testing. In Proceedings of the 8th International Conference on Ubiquitous Computing (UbiComp'06). Springer-Verlag, Berlin, Heidelberg, 459--476. DOI: http://dx.doi.org/10.1007/11853565_27","paperID":"None"},{"content":"Matthias Rauterberg, Morten Fjeld, Helmut Krueger, Martin Bichsel, Uwe Leonhardt, and Markus Meier. 1998. BUILD-IT: A Planning Tool for Construction and Design. In CHI 98 Cconference Summary on Human Factors in Computing Systems (CHI '98). ACM, NY, NY, USA, 177--178. DOI: http://dx.doi.org/10.1145/286498.286657","paperID":"None"},{"content":"Daniel Saakes and Pieter Jan Stappers. 2009. A tangible design tool for sketching materials in products. Artificial Intelligence for Engineering Design, Analysis and Manufacturing 23 (8 2009), 275--287. Issue Special Issue 03. DOI: http://dx.doi.org/10.1017/S0890060409000249","paperID":"None"},{"content":"Donald A Schön. 1984. The Reflective Practitioner: How Professionals Think In Action. Basic Books, USA.","paperID":"None"},{"content":"Fabian Segelström and Stefan Holmlid. 2011. Service design visualisations meet service theory: strengths, weaknesses and perspectives. In Proceedings of Art & Science of Service, San Jose, California.","paperID":"None"},{"content":"John Underkoffier and Hiroshi Ishii. 1999. Urp: A Luminous-tangible Workbench for Urban Planning and Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 386--393. DOI: http://dx.doi.org/10.1145/302979.303114","paperID":"None"},{"content":"Jouke Verlinden. 2014. Developing an Interactive Augmented Prototyping Methodology to Support Design Reviews. Ph.D. Dissertation. Delft University of Technology, Delft, the Netherlands.","paperID":"None"},{"content":"Jouke Verlinden and Imre Horváth. 2008. Enabling interactive augmented prototyping by a portable hardware and a plug-in-based software architecture. STROJNISKI VESTNIK - Journal of Mechanical Engineering 54, 6 (2008), 458--470.","paperID":"None"},{"content":"Mark Weiser. 1991. The computer for the 21st century. Scientific american 265, 3 (1991), 94--104.","paperID":"None"},{"content":"Alexander Wiethoff, Thomas Bauer, and Sven Gehring. 2014. Investigating Multi-user Interactions on Interactive Media Facades. In Proceedings of the 2Nd Media Architecture Biennale Conference: World Cities (MAB '14). ACM, NY, NY, USA, 92--100. DOI: http://dx.doi.org/10.1145/2682884.2682890","paperID":"None"},{"content":"Karl D. D. Willis, Takaaki Shiratori, and Moshe Mahler. 2013. HideOut: Mobile Projector Interaction with Tangible Objects and Surfaces. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13). ACM, NY, NY, USA, 331--338. DOI: http://dx.doi.org/10.1145/2460625.2460682","paperID":"None"},{"content":"Robert Xiao, Chris Harrison, and Scott E. Hudson. 2013. WorldKit: Rapid and Easy Creation of Ad-hoc Interactive Applications on Everyday Surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 879--888. DOI: http://dx.doi.org/10.1145/2470654.2466113","paperID":"None"},{"content":"Ji-Dong Yim and Tek-Jin Nam. 2004. Developing Tangible Interaction and Augmented Reality in Director. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, NY, NY, USA, 1541--1541. DOI: http://dx.doi.org/10.1145/985921.986117","paperID":"None"}],"abstract":"Recently, it has become common for designers to deal with complex and large-scale ubicomp or IoT spaces. Designers without technical implementation skills have difficulties in prototyping such spaces, especially in the early phases of design. We present miniStudio, a designers' tool for prototyping ubicomp space with proxemic interactions. It is built on designers' existing software and modeling materials (Photoshop, Lego, and paper). Interactions can be defined in Photoshop based on five spatial relations: location, distance, motion, orientation, and custom. Projection-based augmented reality was applied to miniatures in order to enable tangible interactions and dynamic representations. Hidden marker stickers and a camera-projector system enable the unobtrusive integration of digital images on the physical miniature. Through the user study with 12 designers and researchers in the ubicomp field, we found that miniStudio supported rapid prototyping of large and complex ideas with multiple connected components. Based on the tool development and the study, we discuss the implications for prototyping ubicomp environments in the early phase of the design.","title":"miniStudio: Designers' Tool for Prototyping Ubicomp Space with Interactive Miniature","filename":"CHI16/p213","authors":["Han-Jong Kim","Ju-Whan Kim","Tek-Jin Nam"],"conference":"CHI '16"}