{"paperId":2858259,"citation":[],"reference":[{"content":"Ted Asay and Michael J. Lambert. 1999. The empirical case for the common factors in therapy: Quantitative findings. (1999).","paperID":"None"},{"content":"Scott Bellini. 2004. Social Skill Deficits and Anxiety in High-Functioning Adolescents with Autism Spectrum Disorders. Focus on Autism and Other Developmental Disorders, 19/2, p.78--86.","paperID":"None"},{"content":"Scott Bellini. 2006. The Development of Social Anxiety in Adolescents With Autism Spectrum Disorders. Focus on Autism and other Developmental Disabilities, 21/3, p.138--145.","paperID":"None"},{"content":"Laura Benton, Asimina Vasalou, Rilla Khaled, Hilary Johnson, and Daniel Gooch. 201 Diversity for design: a framework for involving neurodiverse children in the technology design process. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 3747--3756. ACM, 2014.","paperID":"None"},{"content":"Alan F. Blackwell. 2010. When Systemizers Meet Empathizers: Universalism and the Prosthetic Imagination.\" Interdisciplinary Science Reviews 35, no. 3--4 (2010): 387--403.","paperID":"None"},{"content":"Eli Blevis. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07)","paperID":"None"},{"content":"Louanne E. Boyd, Kathryn E. Ringland, Oliver L. Haimson, Helen Fernandez, Maria Bistarkey, and Gillian R. Hayes. 2015. Evaluating a Collaborative iPad Game's Impact on Social Relationships for Children with Autism Spectrum Disorder. ACM Trans. Access. Comput. 7, 1, Article 3 (June 2015).","paperID":"None"},{"content":"Anthony Dunne, and Fiona Raby (2013). Speculative everything: design, fiction, and social dreaming. MIT Press, 2013.","paperID":"None"},{"content":"Maria Angela Ferrario, Will Simm, Peter Newman, Stephen Forshaw, and Jon Whittle. 2014. Software engineering for 'social good': integrating action research, participatory design, and agile development. In Companion Proceedings of the 36th International Conference on Software Engineering (ICSE Companion 2014). ACM, NY, NY, USA, 520--523.","paperID":"None"},{"content":"Maria Angela Ferrario, Zoltán Bajmócy, Will Simm, and Stephen Forshaw. 2015. Towards a Sustainable Framework in Digital-Social Innovation: Integrating Circular Economy, Capability Approach and Action Research. In Proceedings of the 11th International Conference of the European Society for Ecological Economics (ESEE 15). Leeds, UK.","paperID":"None"},{"content":"Richard Ribon Fletcher, Kelly Dobson, Matthew S. Goodwin, Hoda Eydgahi, Oliver Wilder-Smith, David Fernholz, Yuta Kuboyama, Elliott Bruce Hedman, Ming-Zher Poh and Rosalind W. Picard. \"iCalm: Wearable Sensor and Network Architecture for Wirelessly Communicating and Logging Autonomic Activity,\" in Information Technology in Biomedicine, IEEE Transactions on, vol.14, no.2, pp.215--223, March 2010","paperID":"None"},{"content":"B. J. Fogg. 2002. Persuasive technology: using computers to change what we think and do. Ubiquity 2002","paperID":"None"},{"content":"Batya Friedman. 1996. Value-sensitive design. interactions, 3(6), 16--23.","paperID":"None"},{"content":"Alinda Gillott, and P. J. Standen. 2007. Levels of anxiety and sources of stress in adults with autism. Journal of intellectual disabilities 11, no. 4 (2007): 359--370.","paperID":"None"},{"content":"Matthew, S. Goodwin, Groden, J., Velicer, Wayne, F., Diller, Amy. 2007. Brief Report: Validating the Stress Survey Schedule for Persons With Autism and Other Developmental Disabilities. Focus on Autism and other Developmental Disabilities, 22/3, 183--189.","paperID":"None"},{"content":"Hamed Haddadi , Richard Mortier, Derek McAuley, and Jon Crowcroft. 2013. Human-data interaction. University of Cambridge (2013).","paperID":"None"},{"content":"Gillian R. Hayes and Gregory D. Abowd. 2006. Tensions in designing capture technologies for an evidence-based care community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (Eds.). ACM, NY, NY, USA, 937--946.","paperID":"None"},{"content":"Gillian R. Hayes. 2011. The relationship of action research to human-computer interaction. ACM Trans. Comput.-Hum. Interact. 18, 3, Article 15 (August 2011)","paperID":"None"},{"content":"Gillian R. Hayes. 2014. Knowing by Doing: Action Research as an Approach to HCI. In Ways of Knowing in HCI, pp. 49--68. Springer NY, 2014","paperID":"None"},{"content":"Jonathan Hook, Sanne Verbaan, Abigail Durrant, Patrick Olivier, and Peter Wright. \"A study of the challenges related to DIY assistive technology in the context of children with disabilities.\" In Proceedings of the 2014 conference on Designing interactive systems, pp. 597--606. ACM, 2014.","paperID":"None"},{"content":"Amy Hurst and Jasmine Tobias. \"Empowering individuals with do-it-yourself assistive technology.\" In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility, pp. 11--18. ACM, 2011.","paperID":"None"},{"content":"Reuben Kirkham, and Chris Greenhalgh. \"Social Access vs. Privacy in Wearable Computing: A Case Study of Autism.\" Pervasive Computing, IEEE 14, no. 1 (2015): 26--33.","paperID":"None"},{"content":"Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stage-based model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 557--566. ACM, 2010.","paperID":"None"},{"content":"Peter Newman, Maria Angela Ferrario, Will Simm, Stephen Forshaw, Adrian Friday, and Jon Whittle. 2015. The role of design thinking and physical prototyping in social software engineering. In Proceedings of the 37th International Conference on Software Engineering - Volume 2 (ICSE '15), Vol. 2. IEEE Press, Piscataway, NJ, USA, 487--496.","paperID":"None"},{"content":"Tekla S Perry. 2015. Giving your body a\" check engine\" light. Spectrum, IEEE 52, no. 6 (2015): 34--84.","paperID":"None"},{"content":"Phonebloks. 2015. About Phonebloks Retrieved September 22, 2015 from http://phoneblocks.com/about-phonebloks/","paperID":"None"},{"content":"Rosalind W. Picard.1997. Affective computing. Vol. 252. Cambridge: MIT press, 1997.","paperID":"None"},{"content":"Cynthia Putnam and Lorna Chong. 2008. Software and technologies designed for people with autism: what do users want?. In Proceedings of the 10th international ACM SIGACCESS conference on Computers and accessibility (Assets '08). ACM, NY, NY, USA, 3--10.","paperID":"None"},{"content":"Amon Rapp and Federica Cena. 2015. Affordances for self-tracking wearable devices. InProceedings of the 2015 ACM International Symposium on Wearable Computers (ISWC '15). ACM, NY, NY, USA, 141--142.","paperID":"None"},{"content":"Kristen Shinohara and Jacob O. Wobbrock. \"In the shadow of misperception: assistive technology use and social interactions.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 705--714. ACM, 2011.","paperID":"None"},{"content":"Will Simm, Maria Angela Ferrario, Adrian Gradinar, and Jon Whittle. 2014. Prototyping Clasp': implications for designing digital technology for and with adults with autism. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 345--354","paperID":"None"},{"content":"Will Simm, Maria Angela Ferrario, Adrian Friday, Peter Newman, Stephen Forshaw, Mike Hazas, and Alan Dix. 2015. Tiree Energy Pulse: Exploring Renewable Energy Forecasts on the Edge of the Grid. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1965--1974.","paperID":"None"},{"content":"Anja Thieme, Jayne Wallace, Thomas D. Meyer, and Patrick Olivier. 2015. Designing for mental wellbeing: towards a more holistic approach in the treatment and prevention of mental illness. In Proceedings of the 2015 British HCI Conference (British HCI '15). ACM, NY, NY, USA, 1--10.","paperID":"None"},{"content":"David Trembath, Carmela Germano, Graeme Johanson, and Cheryl Dissanayake. 2012. The experience of anxiety in young adults with autism spectrum disorders. Focus on Autism and Other Developmental Disabilities 27, no. 4 (2012): 213--224.","paperID":"None"},{"content":"Francisca, J., Van Steel, A., Bogels, Susan, M., & Perrin Sean. 2011. Anxiety Disorders in Children and Adolescents with Autistic Spectrum Disorders: A Meta-Analysis. Clinical Child and Family Psychology Review. 14, 302--317.","paperID":"None"},{"content":"White, S.W., Donald., O., Ollendick, T., Scahill, L. Anxiety in children and adolescents with autism spectrum disorders. Clinical Psychology Review, (2009), 216--229. 40.","paperID":"None"},{"content":"White, S.W., Bray, B.C., Ollendick, T. Examining Shared and Unique Aspects of Social Anxiety Disorder and Autism Spectrum Disorder Using Factor Analysis. Journal of Autism and Development Disorders 42, 5 (2012), 874--84.","paperID":"None"},{"content":"Bajmócy Zoltán, and Judit Gébert. 2014. The outlines of innovation policy in the capability approach. Technology in Society 38 (2014): 93--102.","paperID":"None"}],"abstract":"For many people living with conditions such as autism, anxiety manifests so powerfully it has a big impact on quality of life. By investigating the suitability of truly customizable wearable health devices we build on prior research that found each experience of anxiety in people with autism is unique, so 'one-suits all' solutions are not suitable. In addition, users desire agency and control in all aspects of the system. The participative approach we take is to iteratively co-develop prototypes with end users. Here we describe a case study of the co-development of one prototype, a digital stretch wristband that records interaction for later reflection called Snap. Snap has been designed to sit within a platform that allows the distributed and sustainable design, manufacture and data analysis of customizable digital health technologies. We contribute to HCI with (1) lessons learned from a DIY co-development process that follows the principles of modularity, participation and iteration and (2) the potential impact of technology in self-management of anxiety and the broader design implications of addressing unique anxiety experiences.","title":"Anxiety and Autism: Towards Personalized Digital Health","filename":"CHI16/p1270","authors":["Will Simm","Maria Angela Ferrario","Adrian Gradinar","Marcia Tavares Smith","Stephen Forshaw","Ian Smith","Jon Whittle"],"conference":"CHI '16"}