{"paperId":2858528,"reference":[{"content":"Gregory D Abowd, Anind K Dey, Peter J Brown, Nigel Davies, Mark Smith, and Pete Steggles. 1999. Towards a better understanding of context and context-awareness. In Handheld and ubiquitous computing. Springer, 304--307.","paperID":"None"},{"content":"Etyan Adar, Mira Dontcheva, and Gierad Laput. CommandSpace: Modeling the relationships between tasks, descriptions and features. In Proc. UIST 2014 (UIST '14).","paperID":"None"},{"content":"Apple Computer. 1987. Knowledge Navigator. (1987).","paperID":"None"},{"content":"Niranjan Balasubramanian, Stephen Soderl, and Oren Etzioni. AKBC-WEKEX Workshop 2012. Rel-grams: A Probabilistic Model of Relations in Text. (AKBC-WEKEX Workshop 2012).","paperID":"None"},{"content":"Nathanael Chambers and Dan Jurafsky. Unsupervised Learning of Narrative Schemas and Their Participants. In Proc. ACL 2009 (ACL '09).","paperID":"None"},{"content":"Angel X. Chang and Christopher D. Manning. Technical Report 2014. TOKENSREGEX: Defining cascaded regular expressions over tokens. (Technical Report 2014).","paperID":"None"},{"content":"Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, and James A. Landay. 2008. Activity sensing in the wild: A field trial of Ubifit Garden. In Proc. CHI '08 (CHI '08). 1797--1806.","paperID":"None"},{"content":"Anthony Fader, Stephen Soderland, and Oren Etzioni. Identifying Relations for Open Information Extraction. In Proc. EMNLP 2011 (EMNLP '11).","paperID":"None"},{"content":"Ethan Fast, Daniel Steffe, Lucy Wang, Michael Bernstein, and Joel Brandt. Emergent, Crowd-scale Programming Practice in the IDE. In Proc. CHI 2014 (CHI '14).","paperID":"None"},{"content":"Adam Fourney, Richard Mann, and Michael Terry. Query-feature graphs: bridging user vocabulary and system functionality. In Proc. UIST 2011 (UIST '11).","paperID":"None"},{"content":"Gerd Gigerenzer. How to make cognitive illusions disappear: Beyond heuristics and biases. In European review of social psychology 1991.","paperID":"None"},{"content":"Ross Girshick, Jeff Donahue, Trevor Darrell, and Jitendra Malik. 2014. Rich feature hierarchies for accurate object detection and semantic segmentation. In Proc. CVPR '14.","paperID":"None"},{"content":"Bjorn Hartmann, Daniel MacDougall, Joel Brandt, and Scott R. Klemmer. What would other programmers do: suggesting solutions to error messages. In Proc. of CHI 2010 (CHI '10).","paperID":"None"},{"content":"Andrej Karpathy and Li Fei-Fei. Deep Visual-Semantic Alignments for Generating Image Descriptions. In Proc. CPVR 2015.","paperID":"None"},{"content":"Emre Kiciman. 2015. Towards Learning a Knowledge Base of Actions from Experiential Microblogs. In AAAI Spring Symposium.","paperID":"None"},{"content":"Ranjitha Kumar, Arvind Satyanarayan, Cesar Torres, Maxine Lim, Salman Ahmad, Scott R Klemmer, and Jerry O Talton. Webzeitgeist: Design Mining the Web. In Proc. CHI 2013 (CHI '13).","paperID":"None"},{"content":"Ivan Laptev, Marcin Marszaek, Cordelia Schmid, and Benjamin Rozenfeld. Learning realistic human actions from movies. In Proc. CVPR 2008 (CPVR '08).","paperID":"None"},{"content":"Yong Jae Lee, C Lawrence Zitnick, and Michael F Cohen. 2011. Shadowdraw: real-time user guidance for freehand drawing. In Proc. SIGGRAPH '11.","paperID":"None"},{"content":"Yang Li. 2014. Reflection: Enabling Event Prediction As an On-device Service for Mobile Interaction. In Proc. UIST '14 (UIST '14). 689--698.","paperID":"None"},{"content":"H. Liu and P. Singh. ConceptNet -- A Practical Commonsense Reasoning Tool-Kit. In BT Technology Journal 2004.","paperID":"None"},{"content":"Justin Matejka, Wei Li, Tovi Grossman, and George Fitzmaurice. Community Commands: Command Recommendations for Software Applications. In Proc. UIST 2009 (UIST '09).","paperID":"None"},{"content":"William McGrath, Mozziyar Etemadi, Shuvo Roy, and Bjrn Hartmann. fabryq: Using Phones as Gateways to Communicate with Smart Devices from the Web. In Proc. EICS 2015 (EICS '15).","paperID":"None"},{"content":"Tomas Mikolov, Wen tau Yih, and Geoffrey Zweig. Linguistic regularities in continuous space word representations. In Proc. NAACL-HLT 2013.","paperID":"None"},{"content":"George A. Miller. WordNet: A Lexical Database for English. In Commun. ACM 1995.","paperID":"None"},{"content":"Ian Simon, Dan Morris, and Sumit Basu. MySong: automatic accompaniment generation for vocal melodies. In Proc. CHI 2008 (CHI '08).","paperID":"None"},{"content":"Peter D Turney, Patrick Pantel, and others. 2010. From frequency to meaning: Vector space models of semantics. Journal of artificial intelligence research 37, 1 (2010), 141--188.","paperID":"None"},{"content":"Mark Weiser. 1991. The computer for the 21st century. Scientific American 265, 3 (1991), 94--104.","paperID":"None"},{"content":"Neuman Y, Assaf D, Cohen Y, Last M, Argamon S, and Howard N. Metaphor Identification in Large Texts Corpora. In PLoS ONE 2013.","paperID":"None"},{"content":"YoungSeok Yoon and Brad Meyers. A Longitudinal Study of Programmers' Backtracking. In Proc. VL/HCC 2014 (VL/HCC '14).","paperID":"None"}],"abstract":"From smart homes that prepare coffee when we wake, to phones that know not to interrupt us during important conversations, our collective visions of HCI imagine a future in which computers understand a broad range of human behaviors. Today our systems fall short of these visions, however, because this range of behaviors is too large for designers or programmers to capture manually. In this paper, we instead demonstrate it is possible to mine a broad knowledge base of human behavior by analyzing more than one billion words of modern fiction. Our resulting knowledge base, Augur, trains vector models that can predict many thousands of user activities from surrounding objects in modern contexts: for example, whether a user may be eating food, meeting with a friend, or taking a selfie. Augur uses these predictions to identify actions that people commonly take on objects in the world and estimate a user's future activities given their current situation. We demonstrate Augur-powered, activity-based systems such as a phone that silences itself when the odds of you answering it are low, and a dynamic music player that adjusts to your present activity. A field deployment of an Augur-powered wearable camera resulted in 96% recall and 71% precision on its unsupervised predictions of common daily activities. A second evaluation where human judges rated the system's predictions over a broad set of input images found that 94% were rated sensible.","citation":[],"title":"Augur: Mining Human Behaviors from Fiction to Power Interactive Systems","filename":"CHI16/p237","authors":["Ethan Fast","William McGrath","Pranav Rajpurkar","Michael S. Bernstein"],"conference":"CHI '16"}