{"paperId":2858173,"abstract":"We introduce Metadating -- a future-focused research and speed-dating event where single participants were invited to \"explore the romance of personal data\". Participants created \"data profiles\" about themselves, and used these to \"date\" other participants. In the rich context of dating, we study how personal data is used conversationally to communicate and illustrate identity. We note the manner in which participants carefully curated their profiles, expressing ambiguity before detail, illustration before accuracy. Our findings proposition a set of data services and features, each concerned with representing and curating data in new ways, beyond a focus on purely rational or analytic relationships with a quantified self. Through this, we build on emerging interest in \"lived informatics\" and raise questions about the experience and social reality of a \"data-driven life\".","citation":[],"reference":[{"content":"Jeffrey Bardzell and Shaowen Bardzell. 2008. Intimate Interactions: Online Representation and Software of the Self. interactions 15, 5: 11--15. http://doi.org/10.1145/1390085.1400111","paperID":"None"},{"content":"Frederic C. Bartlett. 1932. Remembering: An experimental and social study. Cambridge University Press.","paperID":"None"},{"content":"Julian Bleecker. 2009. Design Fiction: A short essay on design, science, fact and fiction. Near Future Laboratory 29.","paperID":"None"},{"content":"Mark Blythe, Jamie Steane, Jenny Roe, and Caroline Oliver. 2015. Solutionism, the Game: Design Fictions for Positive Aging. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3849--3858. http://doi.acm.org/10.1145/2702123.2702491","paperID":"None"},{"content":"Mark Blythe. 2014. Research through design fiction: narrative in real and imaginary abstracts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 703--712. http://doi.acm.org/10.1145/2556288.2557098","paperID":"None"},{"content":"Susanne Bødker. 2006. When Second Wave HCI Meets Third Wave Challenges. In Proceedings of the 4th Nordic Conference on Human-computer Interaction: Changing Roles, ACM, NY, NY, USA, 1--8. http://doi.org/10.1145/1182475.1182476","paperID":"None"},{"content":"danah boyd and Kate Crawford. 2012. Critical questions for big data: Provocations for a cultural, technological, and scholarly phenomenon. Information, Communication & Society 15, 5: 662--679.","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2: 77--101.","paperID":"None"},{"content":"Marion Buchenau and Jane Fulton Suri. 2000. Experience Prototyping. In Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, ACM, NY, NY, USA 424--433. http://doi.org/10.1145/347642.347802","paperID":"None"},{"content":"Laura Buttrick, Conor Linehan, Ben Kirman, and Dan O'Hara. 2014. Fifty shades of CHI: the perverse and humiliating human-computer relationship. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 825--834. http://doi.acm.org/10.1145/2559206.2578874","paperID":"None"},{"content":"David Chatting. 2014. Speculation by Improvisation. In Workshop on Human-Computer Improvisation at Designing Interactive Systems (DIS '14). http://openlab.ncl.ac.uk/hcimprovisation/files/2014/06/ chatting-improv-v2.pdf","paperID":"None"},{"content":"Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding quantified-selfers' practices in collecting and exploring personal data. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 1143--1152. http://doi.acm.org/10.1145/2556288.2557372","paperID":"None"},{"content":"James Clawson, Jessica A. Pater, Andrew D. Miller, Elizabeth D. Mynatt, and Lena Mamykina. 2015. No longer wearing: investigating the abandonment of personal health-tracking technologies on craigslist. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 647--658. http://doi.acm.org/10.1145/2750858.2807554","paperID":"None"},{"content":"Sunny Consolvo, Katherine Everitt, Ian Smith, and James A. Landay. 2006. Design requirements for technologies that encourage physical activity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 457--466. http://doi.acm.org/10.1145/1124772.1124840","paperID":"None"},{"content":"Peter Cook. 1999. Archigram. Princeton Architectural Press.","paperID":"None"},{"content":"Andy Crabtree and Richard Mortier. 2015. Human data interaction: Historical lessons from social studies and cscw. In ECSCW 2015: Proceedings of the 14th European Conference on Computer Supported Cooperative Work, 19--23 September 2015, Oslo, Norway, Springer, 3.","paperID":"None"},{"content":"Judith Donath, Alex Dragulescu, Aaron Zinman, Fernanda Viégas, and Rebecca Xiong. 2010. Data portraits. In ACM SIGGRAPH 2010 Art Gallery (SIGGRAPH '10). ACM, NY, NY, USA, 375383. http://doi.acm.org/10.1145/1836786.1836793","paperID":"None"},{"content":"Tao Dong, Mark S. Ackerman, and Mark W. Newman. 2014. \"If these walls could talk\": designing with memories of places. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA, 63--72. http://doi.acm.org/10.1145/2598510.2598605","paperID":"None"},{"content":"Paul Dourish and Sara Bly. 1992. Portholes: supporting awareness in a distributed work group. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92), ACM, NY, NY, USA, 541--547. http://doi.acm.org/10.1145/142750.142982","paperID":"None"},{"content":"Anthony Dunne and Fiona Raby. 2013. Speculative Everything: design, fiction, and social dreaming. MIT Press.","paperID":"None"},{"content":"Nicole B. Ellison, Jeffrey T. Hancock, and Catalina L. Toma. 2012. Profile as promise: A framework for conceptualizing veracity in online dating selfpresentations. New Media & Society 14, 1: 45--62. http://doi.org/10.1177/1461444811410395","paperID":"None"},{"content":"Nicole Ellison, Rebecca Heino, and Jennifer Gibbs. 2006. Managing Impressions Online: Self-Presentation Processes in the Online Dating Environment. Journal of Computer-Mediated Communication 11, 2: 415--441. http://doi.org/10.1111/j.1083--6101.2006.00020.x","paperID":"None"},{"content":"Chris Elsden, David S. Kirk, and Abigail C. Durrant. 2015. A Quantified Past: Towards Design for Remembering with Personal Informatics. HumanComputer Interaction 6: 1--40.","paperID":"None"},{"content":"Daniel Epstein, Felicia Cordeiro, Elizabeth Bales, James Fogarty, and Sean Munson. 2014. Taming data complexity in lifelogs: exploring visual cuts of personal informatics data. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 667--676. http://doi.acm.org/10.1145/2598510.2598558","paperID":"None"},{"content":"Daniel A. Epstein, Bradley H. Jacobson, Elizabeth Bales, David W. McDonald, and Sean A. Munson. 2015. From \"Nobody Cares\" to \"Way to Go!\": A Design Framework for Social Sharing in Personal Informatics. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1622--1636. http://doi.org/10.1145/2675133.2675135","paperID":"None"},{"content":"Nicholas Felton. 2005. Nicholas Felton | Feltron.com. Retrieved September 21, 2015 from http://feltron.com.","paperID":"None"},{"content":"Jon E. Froehlich, Eric Larson, Tim Campbell, Conor Haggerty, James Fogarty, and Shwetak N. Patel. 2009. HydroSense: infrastructure-mediated single-point sensing of whole-home water activity. In Proceedings of the 11th international conference on Ubiquitous computing (UbiComp '09). ACM, NY, NY, USA, 235--244. http://doi.acm.org/10.1145/1620545.1620581","paperID":"None"},{"content":"Jon Froehlich, Leah Findlater, and James Landay. 2010. The design of eco-feedback technology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1999--2008. http://doi.acm.org/10.1145/1753326.1753629","paperID":"None"},{"content":"Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: cultural probes. interactions 6, 1: 21--29. http://dx.doi.org/10.1145/291224.291235","paperID":"None"},{"content":"William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 233--240. http://doi.acm.org/10.1145/642611.642653","paperID":"None"},{"content":"Erving Goffman. 1959. The presentation of self in everyday life. Random House.","paperID":"None"},{"content":"Rebecca Gulotta, William Odom, Haakon Faste, and Jodi Forlizzi. 2014. Legacy in the age of the internet: reflections on how interactive systems shape how we are remembered. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA, 975--984. http://doi.acm.org/10.1145/2598510.2598579","paperID":"None"},{"content":"Kevin D. Haggerty and Richard V. Ericson. 2000. The surveillant assemblage. The British journal of sociology 51, 4: 605--622.","paperID":"None"},{"content":"Samuel Huron, Sheelagh Carpendale, Alice Thudt, Anthony Tang, and Michael Mauerer. 2014. Constructive visualization. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA, 433--442. http://doi.acm.org/10.1145/2598510.2598566","paperID":"None"},{"content":"Ole Sejer Iversen and Tuck W. Leong. 2012. Valuesled participatory design: mediating the emergence of values. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, NY, NY, USA, 468--477. http://doi.acm.org/10.1145/2399016.2399087","paperID":"None"},{"content":"Rachel Jacobs, Steve Benford, Mark Selby, Michael Golembewski, Dominic Price, and Gabriella Giannachi. 2013. A conversation between trees: what data feels like in the forest. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 129138. http://doi.acm.org/10.1145/2470654.2470673","paperID":"None"},{"content":"Kenji Kawakami. 1995. 101 unuseless Japanese inventions: the art of Chindogu. WW Norton & Company.","paperID":"None"},{"content":"David Kirby. 2009. The Future is now: Diegetic Prototypes and the Role of Popular Films in Generating Real-World Technological Development. Social Studies of Science. http://doi.org/10.1177/0306312709338325","paperID":"None"},{"content":"Shaun Lawson, Ben Kirman, Conor Linehan, Tom Feltwell, and Lisa Hopkins. 2015. Problematising Upstream Technology through Speculative Design: The Case of Quantified Cats and Dogs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2663--2672. http://doi.acm.org/10.1145/2702123.2702260","paperID":"None"},{"content":"Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stagebased model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 557--566. http://doi.acm.org/10.1145/1753326.1753409","paperID":"None"},{"content":"Ian Li, Anind K. Dey, and Jodi Forlizzi. 2011. Understanding my data, myself: supporting selfreflection with ubicomp technologies. In Proceedings of the 13th international conference on Ubiquitous computing (UbiComp '11). ACM, NY, NY, USA, 405--414. http://doi.acm.org/10.1145/2030112.2030166","paperID":"None"},{"content":"Ian Li, Jon Froehlich, Jakob E. Larsen, Catherine Grevet, and Ernesto Ramirez. 2013. Personal informatics in the wild: hacking habits for health & happiness. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 3179--3182. http://doi.acm.org/10.1145/2468356.2479641","paperID":"None"},{"content":"James J. Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B. Strub. 2006. Fish-n-Steps: Encouraging physical activity with an interactive computer game. In UbiComp 2006: Ubiquitous Computing. Springer, 261--278.","paperID":"None"},{"content":"Joseph Lindley, Dhruv Sharma, and Robert Potts. 2015. Anticipatory Ethnography: Design Fiction as an Input to Design Ethnography. In Proceesings of the 2015 Conference on Ethnographic Praxis in Industry (EPIC '15). 237--253. doi:10.1111/1559--8918.01030","paperID":"None"},{"content":"Conor Linehan, Ben J. Kirman, Stuart Reeves, Mark A. Blythe, Joshua G. Tanenbaum, Audrey Desjardins, and Ron Wakkary. 2014. Alternate endings: using fiction to explore design futures. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 45--48. http://doi.acm.org/10.1145/2559206.2560472","paperID":"None"},{"content":"Deborah Lupton. 2014. Self-tracking cultures: towards a sociology of personal informatics. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design (OzCHI '14). ACM, NY, NY, USA, 77--86. http://doi.acm.org/10.1145/2686612.2686623","paperID":"None"},{"content":"Deborah Lupton. 2014. Self-Tracking Modes: Reflexive Self-Monitoring and Data Practices. Social Science Research Network, Rochester, NY. http://papers.ssrn.com/abstract=2483549","paperID":"None"},{"content":"Deborah Lupton. 2013. Understanding the Human Machine [Commentary]. Technology and Society Magazine, IEEE 32, 4: 25--30.","paperID":"None"},{"content":"Lena Mamykina, Elizabeth D. Mynatt, and David R. Kaufman. 2006. Investigating health management practices of individuals with diabetes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), ACM, NY, NY, USA, 927--936. http://doi.acm.org/10.1145/1124772.1124910","paperID":"None"},{"content":"Richard Mortier, Hamed Haddadi, Tristan Henderson, Derek McAuley, and Jon Crowcroft. 2014. HumanData Interaction: The Human Face of the Data-Driven Society. Social Science Research Network, Rochester, NY. http://papers.ssrn.com/abstract=2508051","paperID":"None"},{"content":"Bettina Nissen and John Bowers. 2015. Data-Things: Digital Fabrication Situated within Participatory Data Translation Activities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2467--2476. http://doi.acm.org/10.1145/2702123.2702245","paperID":"None"},{"content":"William Odom, John Zimmerman, Scott Davidoff, Jodi Forlizzi, Anind K. Dey, and Min Kyung Lee. 2012. A fieldwork of the future with user enactments. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 338--347. http://doi.acm.org/10.1145/2317956.2318008","paperID":"None"},{"content":"Daniela Petrelli, Elise van den Hoven, and Steve Whittaker. 2009. Making history: intentional capture of future memories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1723--1732. http://doi.acm.org/10.1145/1518701.1518966","paperID":"None"},{"content":"Maria Popova. 2015. Dear Data: Two Designers Visualize the Mundane Details of Daily Life in Magical Illustrated Postcards Mailed Across the Atlantic. Brain Pickings. 2015. Retrieved Sept 23rd 2015 from https://www.brainpickings.org/2015/03/19/dear-datagiorgia-lupi-stefanie-posavec/","paperID":"None"},{"content":"Z. Pousman, J.T. Stasko, and M. Mateas. 2007. Casual Information Visualization: Depictions of Data in Everyday Life. IEEE Transactions on Visualization and Computer Graphics 13, 6: 1145--1152. http://doi.org/10.1109/TVCG.2007.70541","paperID":"None"},{"content":"Stephen Purpura, Victoria Schwanda, Kaiton Williams, William Stubler, and Phoebe Sengers. 2011. Fit4life: the design of a persuasive technology promoting healthy behavior and ideal weight. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 423--432. http://doi.acm.org/10.1145/1978942.1979003","paperID":"None"},{"content":"John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 1163--1172. http://doi.acm.org/10.1145/2556288.2557039","paperID":"None"},{"content":"Minna Ruckenstein. 2014. Visualized and Interacted Life: Personal Analytics and Engagements with Data Doubles. Societies 4, 1: 68--84. http://doi.org/10.3390/soc4010068","paperID":"None"},{"content":"Christian Rudder. 2014. Dataclysm: Who We Are (When We Think No One's Looking). Random House Incorporated.","paperID":"None"},{"content":"Harvey Sacks. 1995. Lectures on conversation. Blackwell Publishing.","paperID":"None"},{"content":"Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-Place: Thinking through the Relations Between Data and Community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2863--2872. http://doi.acm.org/10.1145/2702123.2702558","paperID":"None"},{"content":"John Vines, Mark Blythe, Stephen Lindsay, Paul Dunphy, Andrew Monk, and Patrick Olivier. 2012. Questionable concepts: critique as resource for designing with eighty somethings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1169--1178. http://doi.acm.org/10.1145/2207676.2208567","paperID":"None"},{"content":"John Vines, Tess Denman-Cleaver, Paul Dunphy, Peter Wright, and Patrick Olivier. 2014. Experience design theatre: exploring the role of live theatre in scaffolding design dialogues. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 683--692. http://doi.acm.org/10.1145/2556288.2556960","paperID":"None"},{"content":"Ron Wakkary, Audrey Desjardins, Sabrina Hauser, and Leah Maestri. 2008. A Sustainable Design Fiction: Green Practices. ACM Trans. Comput.-Hum. Interact. 20, 4: 23:1--23:34. http://doi.org/10.1145/2494265","paperID":"None"},{"content":"Rebecca D. Watkins, Abigail Sellen, and Siân E. Lindley. 2015. Digital Collections and Digital Collecting Practices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3423--3432. http://doi.acm.org/10.1145/2702123.2702380","paperID":"None"},{"content":"Gary Wolf. 2010. The data-driven life. The NY Times 28. Retrieved Sept 23rd, 2015 from http://www.nytimes.com/2010/05/02/magazine/02selfmeasurement-t.html","paperID":"None"},{"content":"Peter Wright and John McCarthy. 2004. Technology as experience. MIT Press.","paperID":"None"},{"content":"Rebecca Xiong and Judith Donath. 1999. PeopleGarden: creating data portraits for users. In Proceedings of the 12th annual ACM symposium on User interface software and technology (UIST '99). ACM, NY, NY, USA, 37--44. http://doi.acm.org/10.1145/320719.322581","paperID":"None"},{"content":"Xuan Zhao and Siân E. Lindley. 2014. Curation through use: understanding the personal value of social media. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 2431--2440. http://doi.acm.org/10.1145/2556288.2557291","paperID":"None"}],"title":"Metadating: Exploring the Romance and Future of Personal Data","filename":"CHI16/p685","authors":["Chris Elsden","Bettina Nissen","Andrew Garbett","David Chatting","David Kirk","John Vines"],"conference":"CHI '16"}