{"paperId":2858455,"citation":[],"reference":[{"content":"Michel J. Anzanello and Flavio S. Fogliatto. 2011. Learning curve models and applications: Literature review and research directions. International Journal of Industrial Ergonomics 41, 5 (2011), 573--583.","paperID":"None"},{"content":"Ahmed S. Arif and Wolfgang Stuerzlinger. 2009. Analysis of Text Entry Performance Metrics. In Proceedings of the International Conference on Science and Technology for Humanity (TIC-STH '09). IEEE, 100--105.","paperID":"None"},{"content":"Beverly Beisge and Marilyn Kraitchman. 2003. Senior Centers: Opportunities For Successful Aging. Springer Publishing Company (2003).","paperID":"None"},{"content":"Xiaojun Bi, Tom Ouyang, and Shumin Zhai. 2014. Both Complete and Correct? Multi-Objective Optimization of Touchscreen Keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 2297--2306.","paperID":"None"},{"content":"Hermann Ebbinghaus. 1885. Memory; A Contribution to Experimental Psychology. New York by Teachers College (1885).","paperID":"None"},{"content":"Rob Edlin-White, Sue Cobb, Mirabelle D'Cruz, Anne Floyde, Sarah Lewthwaite, and Johann Riedel. Accessibility for Older Users through Adaptive Interfaces: Opportunities, Challenges and Achievements. In Human-Computer Interaction, Part III, HCII2011, LNCS6763. 483--489.","paperID":"None"},{"content":"Arthur D. Fisk, Wendy A. Rogers, Neil Charness, Sara J. Czaja, and Joseph Sharit. 2009. Designing for Older Adults: Principles and Creative Human Factors Approaches. (2009).","paperID":"None"},{"content":"Joseph L. Fleiss. 1971. Measuring nominal scale agreement among many raters. Psychological Bulletin 76, 5 (1971), 378--382.","paperID":"None"},{"content":"Mayank Goel, Alex Jansen, Travis Mandel, Shwetak N. Patel, and Jacob O. Wobbrock. 2013. ContextType: using hand posture information to improve mobile touch screen text entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 2795--2798.","paperID":"None"},{"content":"Peter Gregor, Alan F. Newell, and Mary Zajicek. 2002. Designing for dynamic diversity: interfaces for older people. In Proceedings of the Fifth International ACM Conference on Assistive Technologies. ACM, 151--156.","paperID":"None"},{"content":"Asela Gunawardana, Tim Paek, and Christopher Meek. 2010. Usability Guided Key-Target Resizing for Soft Keyboards. In Proceedings of the 15th International Conference on Intelligent User Interfaces (IUI '10). ACM, 111--118.","paperID":"None"},{"content":"Toshiyuki Hagiya, Toshiharu Horiuchi, Tomonori Yazaki, and Tsuneo Kato. 2015. Typing Tutor: Automatic Error Detection and Instruction in Text Entry for Elderly People. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, 696--703.","paperID":"None"},{"content":"Jamye M. Hickman, Wendy A. Rogers, and Arthur D. Fisk. 2007. Training older adults to use new technology. Journals of Gerontology: Series B 62 (2007).","paperID":"None"},{"content":"Eve Hoggan, Stephen A. Brewster, and Jody Johnston. 2008. Investigating the effectiveness of tactile feedback for mobile touchscreens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, 1573--1582.","paperID":"None"},{"content":"Zhao Xia Jin, Tom Plocher, and Liana Kiff. 2007. Touch screen user interfaces for older adults: button size and spacing. In Universal Access in HCI, Part I, HCII2007, LNCS4554. 933--941.","paperID":"None"},{"content":"Shaun K. Kane, Jacob O. Wobbrock, Mark Harniss, and Kurt L. Johnson. 2008. TrueKeys: identifying and correcting typing errors for people with motor impairments. In Proceedings of the 13th International Conference on Intelligent User Interfaces (IUI '08). ACM, 349--352.","paperID":"None"},{"content":"Caitlin Kelleher and Randy Pausch. 2005. Stencils-based tutorials: Design and evaluation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, 541--550.","paperID":"None"},{"content":"John F. Kelley. CAL - A Natural Language program developed with the OZ Paradigm: Implications for Supercomputing Systems. In Proceedings of the First International Conference on Supercomputing Systems. 238--248.","paperID":"None"},{"content":"Andreas Komninos, Emma Nicol, and Mark D Dunlop. 2015. Designed with Older Adults to Support Better Error Correction in SmartPhone Text Entry: The MaxieKeyboard. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, 797--802.","paperID":"None"},{"content":"Sri Kurniawan. 2008. Older people and mobile phones: A multimethod investigation. International Journal of Human Computer Studies 66,12 (2008), 889--901.","paperID":"None"},{"content":"Rock Leung, Charlotte Tang, Shathel Haddad, Joanna Mcgrenere, Peter Graf, and Vilia Ingriany. 2012. How older adults learn to use mobile devices: Survey and field investigations. ACM Transactions on Accessible Computing 4, 3 (2012), 11:1--11:33.","paperID":"None"},{"content":"Hugo Nicolau and Joaquim Jorge. 2012. Elderly text-entry performance on touchscreens. In Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility (ACCESS '12). ACM, 127--134.","paperID":"None"},{"content":"Elvio Rodrigues, Micael Carreira, and Daniel Goncalves. 2014. Enhancing typing performance of older adults on tablets. Universal Access in the Information Society (2014), 1--26.","paperID":"None"},{"content":"Wendy A. Rogers, Elizabeth F. Cabrera, Neff Walker, D. Kristen Gilbert, and Arthur D. Fisk. 1996. A survey of automatic teller machine usage across the adult lifespan. Human Factors (1996), 38,1; 156--166.","paperID":"None"},{"content":"David Sloan, Matthew Tylee Atkinson, Colin Machin, and Yunqiu Li. 2010. The Potential of Adaptive Interfaces as an Accessibility Aid for Older Web Users. In Proceedings of the 2010 International Cross Disciplinary Conference on Web Accessibility 35. ACM.","paperID":"None"},{"content":"Keith Vertanen, Haythem Memmi, Justin Emge, Shyam Reyal, and Per Ola Kristensson. VelociTap: Investigating Fast Mobile Text Entry using Sentence-based Decoding of Touchscreen Keyboard Input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15).","paperID":"None"},{"content":"John T. Wixted. 1990. Analyzing the Empirical Course of Forgetting. Journal of Experimental Psychology: Learning, Memory, and Cognition 16, 5 (1990), 927--935.","paperID":"None"},{"content":"Jacob O. Wobbrockand, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-Based Design: Concept, Principles and Examples. ACM Transactions on Accessible Computing 3, 3, 9 (2011).","paperID":"None"},{"content":"Ying Yin, Tom Y. Ouyang, Kurt Partridge, and Shumin Zhai. 2013. Making Touchscreen Keyboards Adaptive to Keys, Hand Postures, and Individuals - A Hierarchical Spatial Backoff Model Approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 2775--2784.","paperID":"None"}],"abstract":"Many older adults are interested in smartphones. However most of them encounter difficulties in self-instruction and need support. Text entry, which is essential for various applications, is one of the most difficult operations to master. In this paper, we propose Typing Tutor, an individualized tutoring system for text entry that detects input stumbles and provides instructions. By conducting two user studies, we clarify the common difficulties that novice older adults experience and how skill level is related to input stumbles. Based on these studies, we develop Typing Tutor to support learning how to enter text on a smartphone. A two-week evaluation experiment with novice older adults (65+) showed that Typing Tutor was effective in improving their text entry proficiency, especially in the initial stage of use.","title":"Typing Tutor: Individualized Tutoring in Text Entry for Older Adults Based on Input Stumble Detection","filename":"CHI16/p733","authors":["Toshiyuki Hagiya","Toshiharu Horiuchi","Tomonori Yazaki"],"conference":"CHI '16"}