{"paperId":2858085,"citation":[],"reference":[{"content":"Devdatta Akhawe and Adrienne Porter Felt. 2013. Alice in Warningland: A Large-scale Field Study of Browser Security Warning Effectiveness. In USENIX Conference on Security (USENIX'13). 257--272.","paperID":"None"},{"content":"Tanzirul Azim and Iulian Neamtiu. 2013. Targeted and Depth-first Exploration for Systematic Testing of Android Apps. In International Conference on Object Oriented Programming Systems Languages and Applications (OOPSLA'13). 641--660.","paperID":"None"},{"content":"Bank of America. 2006. SiteKey Authentication. (2006). https://www.bankofamerica.com/privacy/onlinemobile-banking-privacy/sitekey.go (last access 2015).","paperID":"None"},{"content":"Antonio Bianchi, Jacopo Corbetta, Luca Invernizzi, Yanick Fratantonio, Christopher Kruegel, and Giovanni Vigna. 2015. What the App is That' Deception and Countermeasures in the Android User Interface. In IEEE Symposium on Security and Privacy (S&P'15).","paperID":"None"},{"content":"Board of Governors of the Federal Reserve System. 2015. Consumers and Mobile Financial Services 2015. (2015). http://www.federalreserve.gov/econresdata/consumersand-mobile-financial-services-report-201503.pdf (last access 2016).","paperID":"None"},{"content":"Teh-Chung Chen, Scott Dick, and James Miller. 2010. Detecting Visually Similar Web Pages: Application to Phishing Detection. ACM Trans. Internet Technol. 10, 2 (2010), 1--38.","paperID":"None"},{"content":"Erika Chin, Adrienne Porter Felt, Kate Greenwood, and David Wagner. 2011. Analyzing Inter-application Communication in Android. In International Conference on Mobile Systems, Applications, and Services (MobiSys'11). 239--252.","paperID":"None"},{"content":"Thomas Davies and Ashweeni Beeharee. 2012. The Case of the Missed Icon: Change Blindness on Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12). 1451--1460.","paperID":"None"},{"content":"Rachna Dhamija and J. D. Tygar. 2005. The Battle Against Phishing: Dynamic Security Skins. In Symposium on Usable Privacy and Security (SOUPS'05). 77--88.","paperID":"None"},{"content":"Rachna Dhamija, J. D. Tygar, and Marti Hearst. 2006. Why Phishing Works. In SIGCHI Conference on Human Factors in Computing Systems (CHI'06). 581--590.","paperID":"None"},{"content":"Digital Trends. 2013. Do not use iMessage chat for Android, it's not safe. (2013). www.digitaltrends.com/mobile/imessage-chat-androidsecurity-flaw/ (last access 2016).","paperID":"None"},{"content":"Serge Egelman, Lorrie Faith Cranor, and Jason Hong. 2008. You've Been Warned: An Empirical Study of the Effectiveness of Web Browser Phishing Warnings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). 1065--1074.","paperID":"None"},{"content":"Serge Egelman, Jennifer King, Robert C. Miller, Nick Ragouzis, and Erika Shehan. 2007. Security User Studies: Methodologies and Best Practices. In Extended Abstracts on Human Factors in Computing Systems (CHI EA'07). ACM, 2833--2836.","paperID":"None"},{"content":"F-secure. 2010. Warning On Possible Android Mobile Trojans. (2010). www.f-secure.com/weblog/archives/00001852.html (last access 2016).","paperID":"None"},{"content":"Adrienne Porter Felt and David Wagner. 2011. Phishing on Mobile Devices. In Web 2.0 Security and Privacy Workshop (W2SP'11). 1--10.","paperID":"None"},{"content":"Forbes. 2015. Alleged \"Nazi\" Android FBI Ransomware Mastermind Arrested In Russia. (2015). http://www.forbes.com/sites/thomasbrewster/2015/04/13/alleged-nazi-android-fbi-ransomwaremastermind-arrested-in-russia/ (last access 2016).","paperID":"None"},{"content":"Google Inc. 2012. Android and Security. (2012). http://googlemobile.blogspot.ch/2012/02/android-andsecurity.html (last access 2016).","paperID":"None"},{"content":"Google Inc. 2016. Protect against harmful apps. (2016). https://support.google.com/accounts/answer/2812853 (last access 2016).","paperID":"None"},{"content":"Amir Herzberg and Ronen Margulies. 2012. My Authentication Album: Adaptive Images-Based Login Mechanism. In Information Security and Privacy Research. 315--326.","paperID":"None"},{"content":"Jason Hong. 2012. The state of phishing attacks. Commun. ACM 55, 1 (2012), 74--81.","paperID":"None"},{"content":"Jie Hou and Qi Yang. 2012. Defense Against Mobile Phishing Attack. (2012). www-personal.umich.edu/~yangqi/pivot/mobile_phishing_defense.pdf (last access 2016).","paperID":"None"},{"content":"Collin Jackson, Daniel R Simon, Desney S Tan, and Adam Barth. 2007. An evaluation of extended validation and picture-in-picture phishing attacks. In Financial Cryptography and Data Security. 281--293.","paperID":"None"},{"content":"Joel Lee, Lujo Bauer, and Michelle L. Mazurek. 2014. Studying the effectiveness of security images in Internet banking. IEEE Internet Computing 13, 1 (2014).","paperID":"None"},{"content":"Chia-Chi Lin, Hongyang Li, Xiaoyong Zhou, and XiaoFeng Wang. 2014. Screenmilker: How to Milk Your Android Screen for Secrets. In Network and Distributed System Security Symposium (NDSS'14).","paperID":"None"},{"content":"MacRumors. 2014. 'Masque Attack' Vulnerability Allows Malicious Third-Party iOS Apps to Masquerade as Legitimate Apps. (2014). http://www.macrumors.com/2014/11/10/masque-attackios-vulnerability/ (last access 2016).","paperID":"None"},{"content":"Luka Malisa, Kari Kostiainen, and Srdjan Capkun. 2015. Detecting Mobile Application Spoofing Attacks by Leveraging User Visual Similarity Perception. (2015). Cryptology ePrint Archive: Report 2015/709.","paperID":"None"},{"content":"Claudio Marforio, Ramya Jayaram Masti, Claudio Soriente, Kari Kostiainen, and Srdjan Capkun. 2016. Supplementary Material - Evaluation of Personalized Security Indicators as an Anti-Phishing Mechanism for Smartphone Applications. (2016). http://www.smartphoneuserstudy.com/supplementary_chi16.pdf (last access 2016).","paperID":"None"},{"content":"Max-Emanuel Maurer and Lukas Höfer. 2012. Sophisticated Phishers Make More Spelling Mistakes: Using URL Similarity against Phishing. In International Conference on Cyberspace Safety and Security (CSS'12). 414--426.","paperID":"None"},{"content":"Yuan Niu, Francis Hsu, and Hao Chen. 2008. iPhish: Phishing Vulnerabilities on Consumer Electronics. In Conference on Usability, Psychology, and Security (UPSEC'08). 1--8.","paperID":"None"},{"content":"Bryan Parno, Cynthia Kuo, and Adrian Perrig. 2006. Phoolproof Phishing Prevention. In International Conference on Financial Cryptography and Data Security (FC'06). 1--19.","paperID":"None"},{"content":"Ronald A Rensink. 2002. Change detection. Annual review of psychology 53, 1 (2002), 245--277.","paperID":"None"},{"content":"Gustav Rydstedt, Baptiste Gourdin, Elie Bursztein, and Dan Boneh. 2010. Framing Attacks on Smart Phones and Dumb Routers: Tap-jacking and Geo-localization Attacks. In USENIX Workshop on Offensive Technologies (WOOT'10). 1--8.","paperID":"None"},{"content":"Stuart E. Schechter, Rachna Dhamija, Andy Ozment, and Ian Fischer. 2007. The Emperor's New Security Indicators. In IEEE Symposium on Security and Privacy (S&P'07). 51--65.","paperID":"None"},{"content":"Secure List. 2013. The Android Trojan Svpeng now capable of mobile phishing. (2013). www.securelist.com/en/blog/8138/The_Android_Trojan_ Svpeng_now_capable_of_mobile_phishing (last access 2016).","paperID":"None"},{"content":"Marcel Selhorst, Christian Stüble, Florian Feldmann, and Utz Gnaida. 2010. Towards a trusted mobile desktop. In International Conference on Trust and Trustworthy Computing (TRUST'10). 78--94.","paperID":"None"},{"content":"Joshua Sunshine, Serge Egelman, Hazim Almuhimedi, Neha Atri, and Lorrie Faith Cranor. 2009. Crying Wolf: An Empirical Study of SSL Warning Effectiveness.. In USENIX Security Symposium. 399--416.","paperID":"None"},{"content":"The Vanguard Group. 2006. Vanguard Enhanced Logon. (2006). http://www.vanguard.com/us/content/Home/RegEnhancedLogOnContent.jsp (last access 2015).","paperID":"None"},{"content":"Min Wu, Robert C. Miller, and Simson L. Garfinkel. 2006a. Do Security Toolbars Actually Prevent Phishing Attacks?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). 601--610.","paperID":"None"},{"content":"Min Wu, Robert C. Miller, and Greg Little. 2006b. Web Wallet: Preventing Phishing Attacks by Revealing User Intentions. In Symposium on Usable Privacy and Security (SOUPS'06). 102--113.","paperID":"None"},{"content":"Zhi Xu and Sencun Zhu. 201. Abusing Notification Services on Smartphones for Phishing and Spamming. In USENIX Workshop on Offensive Technologies (WOOT'12). 1--11.","paperID":"None"},{"content":"Yue Zhang, Jason I. Hong, and Lorrie F. Cranor. 2007. Cantina: A Content-based Approach to Detecting Phishing Web Sites. In International Conference on World Wide Web (WWW'07). 639--648.","paperID":"None"},{"content":"Yajin Zhou, Zhi Wang, Wu Zhou, and Xuxian Jiang. 2012. Hey, You, Get Off of My Market: Detecting Malicious Apps in Official and Alternative Android Markets. In Network and Distributed System Security Symposium (NDSS'12).","paperID":"None"}],"abstract":"Mobile application phishing happens when a malicious mobile application masquerades as a legitimate one to steal user credentials. Personalized security indicators may help users to detect phishing attacks, but rely on the user's alertness. Previous studies in the context of website phishing have shown that users tend to ignore personalized security indicators and fall victim to attacks despite their deployment. Consequently, the research community has deemed personalized security indicators an ineffective phishing detection mechanism. We revisit the question of personalized security indicator effectiveness and evaluate them in the previously unexplored and increasingly important context of mobile applications. We conducted a user study with 221 participants and found that the deployment of personalized security indicators decreased the phishing attack success rate to 50%. Personalized security indicators can, therefore, help phishing detection in mobile applications and their reputation as an anti-phishing mechanism in the mobile context should be reconsidered.","title":"Evaluation of Personalized Security Indicators as an Anti-Phishing Mechanism for Smartphone Applications","filename":"CHI16/p540","authors":["Claudio Marforio","Ramya Jayaram Masti","Claudio Soriente","Kari Kostiainen","Srdjan Čapkun"],"conference":"CHI '16"}