{"paperId":2858548,"citation":[],"reference":[{"content":"The kanye west self confidence generator. http://usatoday30.usatoday.com/exp/kanye/kanye.html. Accessed: 2015-05--16.","paperID":"None"},{"content":"Arseneault, L., Bowes, L., and Shakoor, S. Bullying victimization in youths and mental health problems:much ado about nothing? Psychological medicine 40, 05 (2010), 717-729.","paperID":"None"},{"content":"Barker, V. Older adolescents' motivations for social network site use: the influence of gender, group identity, and collective self-esteem. CyberPsychology & Behavior 12, 2 (2009), 209-213.","paperID":"None"},{"content":"Barnes, S. B. A privacy paradox: Social networking in the USA. First Monday 11, 9 (2006).","paperID":"None"},{"content":"Becker, B. C., and Ortiz, E. G. Evaluation of face recognition techniques for application to facebook. In Automatic Face & Gesture Recognition, 2008. FG'08. 8th IEEE International Conference on, IEEE (2008), 1-6.","paperID":"None"},{"content":"Bekker, M., Beusmans, J., Keyson, D., and Lloyd, P. Kidreporter: a user requirements gathering technique for designing with children. Interacting with computers 15, 2 (2003), 187-202.","paperID":"None"},{"content":"Bowler, L., Mattern, E., and Knobel, C. Developing design interventions for cyberbullying: A narrative-based participatory approach.","paperID":"None"},{"content":"Brown, J. Kanye West in the Studio: Beats Down! Money Up!(2000--2006). Amber Books Publishing, 2006.","paperID":"None"},{"content":"DeHue, F., Bolman, C., and Vollink, T. Cyberbullying: Youngsters' experiences and parental perception. CyberPsychology & Behavior 11, 2 (2008), 217-223.","paperID":"None"},{"content":"Dinakar, K., Jones, B., Havasi, C., Lieberman, H., and Picard, R. Common sense reasoning for detection, prevention, and mitigation of cyberbullying. ACM Transactions on Interactive Intelligent Systems (TiiS) 2, 3 (2012), 18.","paperID":"None"},{"content":"Dinakar, K., Reichart, R., and Lieberman, H. Modeling the detection of textual cyberbullying. In The Social Mobile Web (2011).","paperID":"None"},{"content":"Druin, A. A place called childhood. Interactions 3, 1 (1996), 17-22.","paperID":"None"},{"content":"Druin, A. Cooperative inquiry: developing new technologies for children with children. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems, ACM (1999), 592-599.","paperID":"None"},{"content":"Druin, A., Bederson, B., Boltman, A., Miura, A., Knotts-Callahan, D., and Platt, M. Children as our technology design partners.","paperID":"None"},{"content":"Druin, A., Bederson, B., Hourcade, J., Sherman, L., Revelle, G., Platner, M., and Weng, S. Designing a digital library for young children: An intergenerational partnership. chi 2001.","paperID":"None"},{"content":"Fitton, D., Bell, B., Read, J. C., Iversen, O., Little, L., and Horton, M. Understanding teen ux: building a bridge to the future. In CHI'14 Extended Abstracts on Human Factors in Computing Systems, ACM (2014), 79-82.","paperID":"None"},{"content":"Gilbert, E., and Karahalios, K. Predicting tie strength with social media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2009), 211-220.","paperID":"None"},{"content":"Guha, M. L., Druin, A., Chipman, G., Fails, J. A., Simms, S., and Farber, A. Mixing ideas: a new technique for working with young children as design partners. In Proceedings of the 2004 conference on Interaction design and children: building a community, ACM (2004), 35-42.","paperID":"None"},{"content":"Hinduja, S., and Patchin, J. W. Bullying, cyberbullying, and suicide. Archives of Suicide Research 14, 3 (2010), 206-221.","paperID":"None"},{"content":"Hinduja, S., and Patchin, J. W. Social influences on cyberbullying behaviors among middle and high school students. Journal of youth and adolescence 42, 5 (2013), 711-722.","paperID":"None"},{"content":"Kim, Y. S., and Leventhal, B. Bullying and suicide. a review. International Journal of Adolescent Medicine and Health 20, 2 (2008), 133-154.","paperID":"None"},{"content":"Kontostathis, A., Reynolds, K., Garron, A., and Edwards, L. Detecting cyberbullying: query terms and techniques. In Proceedings of the 5th Annual ACM Web Science Conference, ACM (2013), 195-204.","paperID":"None"},{"content":"Lang, N. Why teens are leaving facebook: Its meaningless, February 2014.","paperID":"None"},{"content":"Lenhart, A. Teens, social media, and technology overview 2015. Pew Internet Project (2015).","paperID":"None"},{"content":"Lenhart, A., Madden, M., Smith, A., Purcell, K., Zickhur, K., and Rainie, L. Teens, kindness and cruelty on social network sites. Pew Internet Project (2011).","paperID":"None"},{"content":"Lenhart, A., Purcell, K., Smith, A., and Zickuhr, K. Social media & mobile internet use among teens and young adults. millennials. Pew Internet & American Life Project (2010).","paperID":"None"},{"content":"Livingstone, S., and Helsper, E. Gradations in digital inclusion: children, young people and the digital divide. New media & society 9, 4 (2007), 671-696.","paperID":"None"},{"content":"McCreary, M. L., Slavin, L. A., and Berry, E. J. Predicting problem behavior and self-esteem among African American adolescents. Journal of Adolescent Research 11, 2 (1996), 216-234.","paperID":"None"},{"content":"Milvy, E. Eavesdropping on the seventh grade instagram show, 2015.","paperID":"None"},{"content":"Muller, M. J., Wildman, D. M., and White, E. A. equal opportunity pd using pictive. Communications of the ACM 36, 6 (1993), 64.","paperID":"None"},{"content":"Nicolalde, D., and Brennan, P. Involving young adults in the design of health interventions. In CHI 14 Workshop on Understanding Teen UX: Building a Bridge to the Future (2014).","paperID":"None"},{"content":"O'Keeffe, G. S., Clarke-Pearson, K., et al. The impact of social media on children, adolescents, and families. Pediatrics 127, 4 (2011), 800-804.","paperID":"None"},{"content":"PROTECTION, P. Childrens online privacy protection act.","paperID":"None"},{"content":"Sarwar, B., Karypis, G., Konstan, J., and Riedl, J. Item-based collaborative filtering recommendation algorithms. In Proceedings of the 10th international conference on World Wide Web, ACM (2001), 285-295.","paperID":"None"},{"content":"Scaife, M., and Rogers, Y. Kids as informants: Telling us what we didnt know or confirming what we knew already. The design of childrens technology (1999), 27-50.","paperID":"None"},{"content":"Schneider, S. K., O'Donnell, L., Stueve, A., and Coulter, R. W. Cyberbullying, school bullying, and psychological distress: A regional census of high school students. American Journal of Public Health 102, 1 (2012), 171-177.","paperID":"None"},{"content":"Schon, D. A. The reflective practitioner: How professionals think in action, vol. 5126. Basic books, 1983.","paperID":"None"},{"content":"Shaul, B. Honestly looks to combat cyberbullying on ios, android.","paperID":"None"},{"content":"Valkenburg, P. M., and Peter, J. Social consequences of the internet for adolescents a decade of research. Current Directions in Psychological Science 18, 1 (2009), 1-5.","paperID":"None"},{"content":"Valkenburg, P. M., Peter, J., and Schouten, A. P. Friend networking sites and their relationship to adolescents' well-being and social self-esteem. CyberPsychology & Behavior 9, 5 (2006), 584-590.","paperID":"None"},{"content":"Vandebosch, H., and Van Cleemput, K. Cyberbullying among youngsters: Profiles of bullies and victims. New media & society 11, 8 (2009), 1349-1371.","paperID":"None"},{"content":"White, M. The challenges of building a compassionate robot, November 2014.","paperID":"None"},{"content":"Willard, N. Educators guide to cyberbullying and cyberthreats. Center for safe and responsible use of the Internet (2007).","paperID":"None"},{"content":"Yip, J., Clegg, T., Bonsignore, E., Gelderblom, H., Rhodes, E., and Druin, A. Brownies or bags-of-stuff?: domain expertise in cooperative inquiry with children. In Proceedings of the 12th International Conference on Interaction Design and Children, ACM (2013), 201-210.","paperID":"None"}],"abstract":"While social media platforms enable individuals to easily communicate and share experiences, they have also emerged as a tool for cyberbullying. Teenagers represent an especially vulnerable population for negative emotional responses to cyberbullying. At the same time, attempts to mitigate or prevent cyberbullying from occurring in these networked spaces have largely failed because of the complexity and nuance with which young people bully others online. To address challenges related to designing for cyberbullying intervention and mitigation, we detail findings from participatory design work with two groups of high school students in spring 2015. Over the course of five design sessions spanning five weeks, participants shared their experiences with cyberbullying and iteratively designed potential solutions. We provide an in-depth discussion of the range of cyberbullying mitigation solutions participants designed. We focus on challenges participants' identified in designing for cyberbullying support and prevention and present a set of five potential cyberbullying mitigation solutions based on the results of the design sessions.","title":"Designing Cyberbullying Mitigation and Prevention Solutions through Participatory Design With Teenagers","filename":"CHI16/p3895","authors":["Zahra Ashktorab","Jessica Vitak"],"conference":"CHI '16"}