{"paperId":2858374,"citation":[],"reference":[{"content":"Jed Brubaker, Gina Venolia, and John C. Tang. 2012. Focusing on shared experiences: Moving beyond the camera in video communication. Proc. DIS 2012, 96105. http://dx.doi.org/10.1145/2317956.2317973","paperID":"None"},{"content":"Gloria Chatzopoulou, Cheng Sheng, and Michalis Faloutsos. 2010. A first step towards understanding popularity in YouTube. IEEE Conference on Computer Communications Workshops INFOCOM 2010.","paperID":"None"},{"content":"James Cohen. 2012. The Potential of Google+ as a Media Literacy Tool. Journal of Media Literacy Education. 4,1. 93 - 96.","paperID":"None"},{"content":"Josh Constine. 2015. Facebook Confirms Live Broadcasting Will Soon Open To Journalists And Verified Profiles, (August 12, 2015). Retrieved December 23, 2015 from http://techcrunch.com/2015/08/12/facebook-livelivestreaming/","paperID":"None"},{"content":"Yuan Ding, Yuan Du, Yingkai Hu, Zhengye Liu, Luqin Wang, Keith Ross, and Anindya Ghose. 2011. Broadcast Yourself: Understanding YouTube Uploaders. Proc. Internet Measurement Conference IMC 2011. 361--370. http://dx.doi.org/10.1145/2068816.2068850","paperID":"None"},{"content":"Audubon Dougherty. 2011. Live-Streaming Mobile Video: Production as Civic Engagement. Proc. MobileHCI 2011, 425--434. http://dx.doi.org/10.1145/2037373.2037437","paperID":"None"},{"content":"Seth Fiegerman. 2015. To keep women as users, Meerkat and Periscope go troll-hunting. Retrieved July 24, 2015 from http://mashable.com/2015/04/09/meerkat-periscopetrolls/","paperID":"None"},{"content":"Kathleen Finn, Abigail Sellen, and Sylvia Wilbur (Eds.) 1997. Video-Mediated Communication, L. Erlbaum Associates Inc.","paperID":"None"},{"content":"Kerry Flynn. 2015. No, Meerkat Isn't Dead. It's Actually Innovating Faster Than Periscope. (October 13, 2015). Retrieved December 23, 2015 from http://www.ibtimes.com/no-meerkat-isnt-dead-itsactually-innovating-faster-periscope-2138470","paperID":"None"},{"content":"Barney G. Glaser and Anselm L. Strauss. 1967. The Discovery of Grounded Theory: Strategies for Qualitative Research. Chicago: Aldine Pub. Co.","paperID":"None"},{"content":"William Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on Twitch: Fostering Participatory Communities of Play within Live Mixed Media, Proc. CHI 2014, 1315--1324. http://dx.doi.org/10.1145/2556288.2557048","paperID":"None"},{"content":"Dave Harley and Geraldine Fitzpatrick. 2009. Creating a conversational context through video blogging: A case study of Geriatric1927. Computers in Human Behavior. 25, 3. 679--689.","paperID":"None"},{"content":"Jina Huh, Leslie S. Liu, Tina Neogi, Kori Inkpen, and Wanda Pratt. 2014. Health Vlogs as Social Support for Chronic Illness Management. ACM Transactions on Computer-Human Interaction (ToCHI). 21, 4 (August 2014), Article No. 23. http://dx.doi.org/10.1145/2630067","paperID":"None"},{"content":"Kori Inkpen, Brett Taylor, Sasa Junuzovic, John C. Tang, and Gina Venolia. 2013. Experiences2Go: Sharing Kids' Activities Outside the Home with Remote Family Members, Proc. CSCW 2013. 13291340. http://dx.doi.org/10.1145/2441776.2441926","paperID":"None"},{"content":"O. Juhlin, A.Engström, and E. Reponen. 2010. Mobile broadcasting: The whats and hows of live video as a social medium. Proc. MobileHCI 2010, 35--44. http://dx.doi.org/10.1145/1851600.1851610","paperID":"None"},{"content":"Scott Kleinberg. 2015. Live streaming: The next big thing in social media. Chicago Tribune. April 1, 2015, http://www.chicagotribune.com/lifestyles/ct-so-sociallivestreaming-meerkat-periscope-20150401column.html","paperID":"None"},{"content":"Mor Naaman, Jeffrey Boase, and Chih-Hui Lai. 2010. Is it Really About Me? Message Content in Social Awareness Streams. Proc. CSCW 2010. 189--192. http://dx.doi.org/10.1145/1718918.1718953","paperID":"None"},{"content":"K.O'Hara, A. Black, and M. Lipson. 2006. Everyday Practices with Mobile Video Telephony. Proc. CHI 2006, 871--880. http://dx.doi.org/10.1145/1124772.1124900","paperID":"None"},{"content":"Periscope by the Numbers. 2015. (August 12, 2015) Retrieved September 24, 2015 from https://medium.com/@periscope/periscope-by-thenumbers-6b23dc6a1704","paperID":"None"},{"content":"Karine Pires and Gwendal Simon. 2015. YouTube Live and Twitch: A Tour of User-Generated Live Streaming Systems. Multimedia Systems MMSys 2015, 225--230.","paperID":"None"},{"content":"Jason Procyk, Carman Neustaedter, Carolyn Pang, Anthony Tang, and Tejinder K. Judge. 2014. Shared Geocaching Over Distance with Mobile Video Streaming. Proc. CHI 2014, 2163--2172. http://dx.doi.org/10.1145/2556288.2557198","paperID":"None"},{"content":"Guy Schofield, Tom Bartindale, and Peter Wright. 2015. Bootlegger: Turning Fans into Film Crew. Proc. CHI 2015, 767--776. http://dx.doi.org/10.1145/2702123.2702229","paperID":"None"},{"content":"David A. Shamma, Elizabeth F. Churchill, Nikhil Bobb, and Matt Fukuda. 2009. Spinning online: A case study of internet broadcasting by DJs. Communities and Technologies (C&T 2009), 175--184. http://dx.doi.org/10.1145/1556460.1556486","paperID":"None"},{"content":"Stefan Siersdorfer, Sergiu Chelaru, and Wolfgang Nejdl, 2010. How Useful are Your Comments? Analyzing and Predicting YouTube Comments and Comment Ratings, WWW 2010, 891--900. http://dx.doi.org/10.1145/1772690.1772781","paperID":"None"},{"content":"Lei Tian, Shaosong Li, Junho Ahn, David Chu, Richard Han, Qin Lv, and Shivakant Mishra. 2013. Understanding user behavior at scale in a mobile video chat application. Proc. UbiComp 2013, 647--656. http://dx.doi.org/10.1145/2493432.2493488","paperID":"None"},{"content":"Andrew Tsou, Mike Thelwall, Philippe Mongeon, and Cassidy Sugimoto. 2014. A Community of Curious Souls: An Analysis of Commenting Behavior on TED Talks Videos. PLoS ONE. 9, 4 (April 2014) http://dx.doi.org/10.1371/journal.pone.0093609","paperID":"None"},{"content":"Raphaël Velt, Steve Benford, Stuart Reeves, Michael Evans, Maxine Glancy, and Phil Stenton. 2015. Towards an Extended Festival Viewing Experience, Proc. TVX 2015, 53--62. http://dx.doi.org/10.1145/2745197.2745206","paperID":"None"},{"content":"Justin D. Weisz, Sara Kiesler, Hui Zhang, Yuqing Ren, Robert E. Kraut, and Joseph A. Konstan. 2007. Watching together: integrating text chat with video. Proc. CHI 2007, 877--886. http://dx.doi.org/10.1145/1240624.1240756","paperID":"None"},{"content":"Ke Xie, Chaolun Xia, Nir Grinberg, Raz Schwartz, and Mor Naaman. 2013. Robust Detection of Hyper-local Events from Geotagged Social Media Data. Workshop on Multimedia Data Mining MDMKDD '13, Article No. 2. http://dx.doi.org/10.1145/2501217.2501219","paperID":"None"},{"content":"Cong Zhang and Jiangchuan Liu. 2015. On Crowdsourced Interactive Live Streaming: A Twitch.TV-Based Measurement Study. Workshop on Network and Operating Systems Support for Digital Audio and Video NOSSDAV 2015, 55--60.","paperID":"None"},{"content":"Maia Zaharieva, Matthias Zeppelzauer, and Christian Breiteneder. 2013. Automated social event detection in large photo collections. International Conference on Multimedia Retrieval (ICMR 2013), 167--174. http://dx.doi.org/10.1145/2461466.2461495","paperID":"None"},{"content":"Xuan Zhao, Niloufar Salehi, Sasha Naranjit, Sara Alwaalan, Stephen Voida, and Dan Cosley. 2013. The Many Faces of Facebook: Experiencing Social Media as Performance, Exhibition, and Personal Archive. Proc. CHI 2013, 1--10. http://dx.doi.org/10.1145/2470654.2470656","paperID":"None"}],"abstract":"We conducted a mixed methods study of the use of the Meerkat and Periscope apps for live streaming video and audio broadcasts from a mobile device. We crowdsourced a task to describe the content, setting, and other characteristics of 767 live streams. We also interviewed 20 frequent streamers to explore their motivations and experiences. Together, the data provide a snapshot of early live streaming use practices. We found a diverse range of activities broadcast, which interviewees said were used to build their personal brand. They described live streaming as providing an authentic, unedited view into their lives. They liked how the interaction with viewers shaped the content of their stream. We found some evidence for multiple live streams from the same event, which represent an opportunity for multiple perspectives on events of shared public interest.","title":"Meerkat and Periscope: I Stream, You Stream, Apps Stream for Live Streams","filename":"CHI16/p4770","authors":["John C. Tang","Gina Venolia","Kori M. Inkpen"],"conference":"CHI '16"}