{"paperId":2858119,"citation":[],"abstract":"Women's understandings of their own intimate anatomy has been identified as critical to women's reproductive health and sexual wellbeing. However, talking about it, seeking medical help when necessary as well as examining oneself in order to 'know' oneself is complicated by social-cultural constructions of the vagina, i.e. it is something private, shameful and not to be talked about. In response to this, we designed Labella, an augmented system that supports intimate bodily knowledge and pelvic fitness in women. It combines a pair of underwear and a mobile phone as a tool for embodied intimate self-discovery. In this paper, we describe Labella, and its evaluation with fourteen women, aged 25-63. We show how through situated embodied perception Labella empowers 'looking'. We highlight how the simple act of augmented looking enables the construction of knowledge which ranges from establishing the 'very basics' through to a nuanced understanding of pelvic muscle structure. Finally, we highlight the role of awkwardness and humour in the design of interactions to overcome taboo.","reference":[{"content":"Teresa Almeida, Rob Comber, and Madeline Balaam. 2016. HCI and Intimate Care as an Agenda for Change in Women's Health. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16), (In Press).","paperID":"None"},{"content":"Teresa Almeida, Rob Comber, Patrick Olivier, and Madeline Balaam. 2014. Intimate Care: Exploring eTextiles for Teaching Female Pelvic Fitness. In Proceedings of the 2014 companion publication on Designing Interactive Systems (DIS Companion '14), 5--8. http://doi.acm.org/10.1145/2598784.2602768","paperID":"None"},{"content":"Swamy Ananthanarayan, Nathan Lapinski, Katie Siek, and Michael Eisenberg. 2014. Towards the crafting of personal health technologies. In Proceedings of the 2014 conference on Designing Interactive Systems (DIS '14), ACM Press, 587--596. http://doi.org/10.1145/2598510.2598581","paperID":"None"},{"content":"Swamy Ananthanarayan, Miranda Sheh, Alice Chien, Halley Profita, and Katie Siek. 2013. PT Viz: Towards a Wearable Device for Visualizing Knee Rehabilitation Exercises. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1247--1250. http://doi.acm.org/10.1145/2470654.2466161","paperID":"None"},{"content":"Ronald T Azuma. 1997. A Survey of Augmented Reality. Presence: Teleperators and Virtual Environments 6 4, (August 1997), 355--385.","paperID":"None"},{"content":"Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: A Location-Mapping Mobile Application for Breastfeeding Women. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1709--1718. http://doi.acm.org/10.1145/2702123.2702328","paperID":"None"},{"content":"Jeffrey Bardzell and Shaowen Bardzell. 2011. \"Pleasure is Your Birthright\": Digitally Enabled Designer Sex Toys as a Case of Third-Wave HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 257--266. http://doi.acm.org/10.1145/1978942.1978979","paperID":"None"},{"content":"Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a Feminist HCI Methodology: Social Science, Feminism, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 675--684. http://doi.acm.org/10.1145/1978942.1979041","paperID":"None"},{"content":"Peter Branney, Karl Witty, Debbie Braybrook, Kate Bullen, Alan White, and Ian Eardley. 2014. Masculinities, humour and care for penile cancer: a qualitative study. Journal of Advanced Nursing 70, 9, 2051--60. http://doi.org/10.1111/jan.12363","paperID":"None"},{"content":"V. Braun and S. Wilkinson. 2001. Socio-cultural representations of the vagina. Journal of Reproductive and Infant Psychology 19, 1, 17--32. http://doi.org/10.1080/02646830020032374","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 77--101.","paperID":"None"},{"content":"Virginia Braun. 1999. Breaking a Taboo? Talking (and Laughing) about the Vagina. Feminism & Psychology 9, 3, 367--372.","paperID":"None"},{"content":"R a Castro, R M Arruda, and M a T Bortolini. 2015. Female urinary incontinence: effective treatment strategies. Climacteric: the journal of the International Menopause Society 18, 2, 135--41. http://doi.org/10.3109/13697137.2014.947257","paperID":"None"},{"content":"Chiaro. 2015. Elvie. Retrieved September 22, 2015 from https://www.elvie.com/","paperID":"None"},{"content":"Claire Dormann and Robert Biddle. 2007. Humour in game-based learning. Learning, Media and Technology 31, 4 (2007), 411--424. http://doi.org/10.1080/17439880601022023","paperID":"None"},{"content":"Paul Dourish. 2001. Where the Action Is: The Foundations of Embodied Interaction. MIT Press, Cambridge, Massachusetts.","paperID":"None"},{"content":"Anna Eaglin and Shaowen Bardzell. 2011. Sex toys and designing for sexual wellness. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11), 1837--1842. http://doi.org/10.1145/1979742.1979879","paperID":"None"},{"content":"Dan Fitton, Keith Cheverst, Mark Rouncefield, Alan Dix, and Andy Crabtree. 2004. Probing Technology with Technology Probes. Equator Workshop on Record and Replay Technologies.","paperID":"None"},{"content":"Tom Giraud, Matthieu Courgeon, Marion Tardieu, Alexandra Roatis, and Xavier Maître. 2014. A Threedimensional Mirror Augmented by Medical Imaging: Questioning Self-portraying. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14), 845--854. http://doi.acm.org/10.1145/2559206.2578876","paperID":"None"},{"content":"H. Arleen Johnson. 1990. Humor As an Innovative Method for Teaching Sensitive Topics. Educational Gerontology 16, 6, 547--559. http://doi.org/10.1080/0380127900160605","paperID":"None"},{"content":"Gopinaath Kannabiran, Jeffrey Bardzell, and Shaowen Bardzell. 2011. How HCI Talks about Sexuality?: Discursive Strategies, Blind Spots, and Opportunities for Future Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 695--704. http://doi.acm.org/10.1145/1978942.1979043","paperID":"None"},{"content":"D W F Van Krevelen and R Poelman. 2010. A Survey of Augmented Reality Technologies, Applications and Limitations. The International Journal of Virtual Reality 9, 2, 1--20.","paperID":"None"},{"content":"Philip Lamb. ARToolkit. Retrieved September 22, 2015 from http://www.hitl.washington.edu/artoolkit/","paperID":"None"},{"content":"May McCreaddie and Sheila Payne. 2011. Humour in health-care interactions: a risk worth taking. Health Expectations: An International Journal of Public Participation in Health Care and Health Policy 17, 3, 332--44. http://doi.org/10.1111/j.1369--7625.2011.00758.x","paperID":"None"},{"content":"Liz Meerabeau. 1999. The management of embarrassment and sexuality in health care. Journal of Advanced Nursing 29, 6, 1507--1513.","paperID":"None"},{"content":"Minna. kGoal. Retrieved September 22, 2015 from http://www.minnalife.com/products/kgoal","paperID":"None"},{"content":"Michelle Murphy. 2010. Immodest Witnessing: The Epistemology of Vaginal Self-Examination in the U.S. Feminist Self-Help Movement. Feminist Studies 30, 1, 115--147.","paperID":"None"},{"content":"Tao Ni, Amy K Karlson, and Daniel Wigdor. 2011. AnatOnMe: Facilitating Doctor-Patient Communication Using a Projection-Based Handheld Device. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 3333--3342. http://doi.acm.org/10.1145/1978942.1979437","paperID":"None"},{"content":"Leyla Norooz and Jon Froehlich. 2013. Exploring early designs for teaching anatomy and physiology to children using wearable e-textiles. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13), 577--580. http://doi.org/10.1145/2485760.2485869","paperID":"None"},{"content":"Leyla Norooz, Matthew L. Mauriello, Anita Jorgensen, Brenna Mcnally, and Jon E. Froehlich. 2015. BodyVis: A New Approach to Body Learning Through Wearable Sensing and Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1025--1034. http://doi.acm.org/10.1145/2702123.2702299","paperID":"None"},{"content":"Brian F. O'Donell, David A. Drachman, Heather J. Barnes, Karen E. Peterson, Joan M. Swearer, and Robert A. Lew. 1992. Incontinence and Troublesome Behaviors Predict Institutionalization in Dementia. Geriatric Psychiatry and Neurology 5, 1, 45--52.","paperID":"None"},{"content":"Halley Profita, James Clawson, Scott Gilliland, et al. 2013. Don't Mind Me Touching My Wrist?: A Case Study of Interacting with On-Body Technology in Public Social Acceptability of Wearable Technology. In Proceedings of the 2013 International Symposium on Wearable Computers (ISWC '13), 89--96.","paperID":"None"},{"content":"Juliann C. Scholl. 2007. The Use of Humor to Promote Patient- centered Care. Journal of Applied Communication Research 35, 2, 156--176. http://doi.org/10.1080/00909880701262658","paperID":"None"},{"content":"Teddy Seyed, Francisco Marinho Rodrigues, Frank Maurer, and Anthony Tang. 2014. Medical Imaging Specialists and 3D: A Domain Perspective on Mobile 3D Interactions. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14), 2341--2346.","paperID":"None"},{"content":"Dorothy B. Smith. 2004. Female Pelvic Floor Health: A Developmental Review. Journal of Wound, Ostomy & Continence Nursing 31, 3, 130--137.","paperID":"None"},{"content":"Dag Svanaes. 2013. Interaction Design for and with the Lived Body: Some Implications of Merleau-Ponty's Phenomenology. ACM Trans. Comput.-Hum Interact. 20, 1, Article 8 (April 2013), 1--30.","paperID":"None"},{"content":"Danielle Wilde. 2012. hipDisk: Experiencing the Value of Ungainly, Embodied, Performative, Fun. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 979--982.","paperID":"None"},{"content":"Danielle Wilde. 2014. hipDisk: Using sound to encourage physical extension, exploring humour in interface design. International Journal of Performance Arts and Digital Media, 4:1 (2014), 7--26. http://doi.org/10.1386/padm.4.1.7","paperID":"None"},{"content":"Iris M. Young. 2005. On Female Body Experience. Oxford University Press.","paperID":"None"},{"content":"John B. Ziegler. 1998. Use of humour in medical teaching. Medical Teacher 20, 4 (1998), 341--348. http://doi.org/10.1080/01421599880779","paperID":"None"},{"content":"Fitbit. Retrieved September 2015 from http://www.fitbit.com/uk","paperID":"None"},{"content":"Jawbone. Retrieved September 2015 from https://jawbone.com/","paperID":"None"},{"content":"Sensoria. Retrieved September 2015 from http://www.sensoriafitness.com/","paperID":"None"},{"content":"OpenCV. Retrieved September 2015 from http://www.opencv.org","paperID":"None"}],"title":"On Looking at the Vagina through Labella","filename":"CHI16/p1810","authors":["Teresa Almeida","Rob Comber","Gavin Wood","Dean Saraf","Madeline Balaam"],"conference":"CHI '16"}