{"paperId":2858181,"citation":[],"reference":[{"content":"Alison Abbott, David Cyranoski, Nicola Jones, Brendan Maher, Quirin Schiermeier, and Richard Van Noorden. 2010. Metrics: Do metrics matter? Nature News 465, 7300, 860--862. http://doi.org/10.1038/465860a","paperID":"None"},{"content":"Philip E. Agre. 1994. From high tech to human tech: Empowerment, measurement, and social studies of computing. Computer Supported Cooperative Work (CSCW) 3, 2: 167--195.","paperID":"None"},{"content":"Rebecca Boden and Debbie Epstein. 2011. A flat earth society? Imagining academic freedom. The Sociological Review 59, 3, 476--495. http://doi.org/10.1111/j.1467--954X.2011.02014.x","paperID":"None"},{"content":"Geoffrey C. Bowker and Susan Leigh Star. 2000. Sorting things out: Classification and its consequences. MIT press.","paperID":"None"},{"content":"Danah Boyd and Kate Crawford. 2012. Critical questions for big data: Provocations for a cultural, technological, and scholarly phenomenon. Information, Communication & Society 15, 5, 662--679.","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2: 77--101.","paperID":"None"},{"content":"Roger Burrows. 2012. Living with the h-index? Metric assemblages in the contemporary academy. The Sociological Review 60, 2: 355--372.","paperID":"None"},{"content":"Chris Caplice and Yossi Sheffi. 1995. A review and evaluation of logistics performance measurement systems. The International Journal of Logistics Management 6, 1: 61--74.","paperID":"None"},{"content":"Sandy Claes and Andrew Vande Moere. 2014. What Public Visualization Can Learn From Street Art. Proceedings of the IEEE VIS 2014 Arts Program. IEEE, 51--55.","paperID":"None"},{"content":"Andy Crabtree and Richard Mortier. 2015. Human data interaction: Historical lessons from social studies and cscw. ECSCW 2015: Proceedings of the 14th European Conference on Computer Supported Cooperative Work, 19--23 September 2015, Oslo, Norway, Springer, 3.","paperID":"None"},{"content":"Russell Craig, Joel Amernic, and Dennis Tourish. 2014. Perverse audit culture and accountability of the modern public university. Financial Accountability & Management 30, 1: 1--24.","paperID":"None"},{"content":"Clara Crivellaro, Rob Comber, Martyn DadeRobertson, Simon J. Bowen, Peter C. Wright, and Patrick Olivier. 2015. Contesting the City: Enacting the Political Through Digitally Supported Urban Walks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2853--2862. http://doi.acm.org/10.1145/2702123.2702176","paperID":"None"},{"content":"Jose van Dijck. 2014. Datafication, dataism and dataveillance: Big Data between scientific paradigm and ideology. Surveillance & Society 12, 2: 197--208.","paperID":"None"},{"content":"Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making public things: how HCI design can express matters of concern. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2397--2406. http://doi.acm.org/10.1145/2556288.2557359","paperID":"None"},{"content":"Carl DiSalvo. 2014. Critical making as materializing the politics of design. The Information Society 30, 2: 96--105.","paperID":"None"},{"content":"Marian Dörk, Sheelagh Carpendale, and Carey Williamson. 2011. The information flaneur: a fresh look at information seeking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 12151224. http://doi.acm.org/10.1145/1978942.1979124","paperID":"None"},{"content":"Marian Dörk, Rob Comber, and Martyn DadeRobertson. 2014. Monadic Exploration: Seeing the Whole Through Its Parts. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, NY, NY, USA, 1535--1544. http://doi.org/10.1145/2556288.2557083","paperID":"None"},{"content":"Marian Dörk, Patrick Feng, Christopher Collins, and Sheelagh Carpendale. 2013. Critical InfoVis: Exploring the Politics of Visualization. CHI '13 Extended Abstracts on Human Factors in Computing Systems, ACM, NY, NY, USA, 2189--2198. http://doi.org/10.1145/2468356.2468739","paperID":"None"},{"content":"Marian Dörk Nathalie Henry Riche, Gonzalo Ramos, and Susan Dumais. 2012. PivotPaths: Strolling through faceted information spaces. Visualization and Computer Graphics, IEEE Transactions on 18, 12: 2709--2718.","paperID":"None"},{"content":"Chris Elsden, David Kirk, Mark Selby, and Chris Speed. 2015. Beyond Personal Informatics: Designing for Experiences with Data. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 2341--2344. http://doi.acm.org/10.1145/2702613.2702632","paperID":"None"},{"content":"Wendy N. Espeland and Mitchell L. Stevens. 1998. Commensuration as a Social Process. Annual Review of Sociology 24: 313--343.","paperID":"None"},{"content":"Rosalind Gill. 2009. Breaking the silence: The hidden injuries of neo-liberal academia. Secrecy and silence in the research process: Feminist reflections: 228--244.","paperID":"None"},{"content":"Lisa Gitelman. 2013. Raw data is an oxymoron. MIT Press.","paperID":"None"},{"content":"Nathalie Henry, Howard Goodell, Niklas Elmqvist, and Jean-Daniel Fekete. 2007. 20 Years of four HCI conferences: A Visual Exploration. International Journal of Human-Computer Interaction 23, 3: 239--285.","paperID":"None"},{"content":"Péter Jacsó. 2005. Google Scholar: the pros and the cons. Online information review 29, 2: 208--214.","paperID":"None"},{"content":"Marijn Janssen, Yannis Charalabidis, and Anneke Zuiderwijk. 2012. Benefits, Adoption Barriers and Myths of Open Data and Open Government. Information Systems Management 29, 4: 258--268. http://doi.org/10.1080/10580530.2012.716740","paperID":"None"},{"content":"Aidan Kelly and Roger Burrows. 2011. Measuring the value of sociology? Some notes on performative metricization in the contemporary academy. The Sociological Review 59, s2: 130--150.","paperID":"None"},{"content":"Vera Khovanskaya, Eric P.S. Baumer, Dan Cosley, Stephen Voida, and Geri Gay. 2013. \"Everybody knows what you're doing\": a critical design approach to personal informatics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3403--3412. http://doi.acm.org/10.1145/2470654.2466467","paperID":"None"},{"content":"Rob Kitchin. 2013. Big data and human geography Opportunities, challenges and risks. Dialogues in human geography 3, 3: 262--267.","paperID":"None"},{"content":"Lisa Koeman, Vaiva Kalnikaité, and Yvonne Rogers. 2015. \"Everyone Is Talking about It!\": A Distributed Approach to Urban Voting Technology and Visualisations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3127--3136. http://doi.acm.org/10.1145/2702123.2702263","paperID":"None"},{"content":"Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stagebased model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 557--566. http://doi.acm.org/10.1145/1753326.1753409","paperID":"None"},{"content":"Deborah Lupton. 2014. Self-Tracking Modes: Reflexive Self-Monitoring and Data Practices. Social Science Research Network, Rochester, NY. http://papers.ssrn.com/abstract=2483549","paperID":"None"},{"content":"David Lyon. 2001. Surveillance society: Monitoring everyday life. McGraw-Hill International.","paperID":"None"},{"content":"Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2012. Citeology: visualizing paper genealogy. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, NY, NY, USA, 181--190. http://doi.acm.org/10.1145/2212776.2212796","paperID":"None"},{"content":"Akhil Mathur, Marc Van den Broeck, Geert Vanderhulst, Afra Mashhadi, and Fahim Kawsar. 2015. Tiny habits in the giant enterprise: understanding the dynamics of a quantified workplace. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 577--588. http://doi.acm.org/10.1145/2750858.2807528","paperID":"None"},{"content":"Viktor Mayer-Schönberger and Kenneth Cukier. 2013. Big data: A revolution that will transform how we live, work, and think. Houghton Mifflin Harcourt.","paperID":"None"},{"content":"Thomas S. Methven, Stefano Padilla, and Mike J. Chantler. 2015. I Don't Think We've Met: Encouraging Collaboration via Topic-Based Search. In Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing (CSCW'15 Companion). ACM, NY, NY, USA, 29--32. http://doi.acm.org/10.1145/2685553.2702678","paperID":"None"},{"content":"Bettina Nissen and John Bowers. 2015. Data-Things: Digital Fabrication Situated within Participatory Data Translation Activities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2467--2476. http://doi.acm.org/10.1145/2702123.2702245","paperID":"None"},{"content":"Stefano Padilla, Thomas S. Methven, David W. Corne, and Mike J. Chantler. 2014. Hot topics in CHI: trend maps for visualising research. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 815--824. DOI=10.1145/2559206.2578867 http://doi.acm.org/10.1145/2559206.2578867","paperID":"None"},{"content":"Kathleen H. Pine and Max Liboiron. 2015. The Politics of Measurement and Action. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3147--3156. http://doi.acm.org/10.1145/2702123.2702298","paperID":"None"},{"content":"Gary W. Pritchard, Pam Briggs, John Vines, and Patrick Olivier. 2015. How to Drive a London Bus: Measuring Performance in a Mobile and Remote Workplace. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1885--1894. http://doi.acm.org/10.1145/2702123.2702307","paperID":"None"},{"content":"Jill Walker Rettberg. 2014. Seeing Ourselves Through Technology: How We Use Selfies, Blogs and Wearable Devices to See and Shape Ourselves. Palgrave.","paperID":"None"},{"content":"George Robinson and Clive Morley. 2006. Call centre management: responsibilities and performance. International Journal of Service Industry Management 17, 3: 284-300.","paperID":"None"},{"content":"John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 1163--1172. http://doi.acm.org/10.1145/2556288.2557039","paperID":"None"},{"content":"Moritz Stefaner. Well-formed eigenfactor. Retrieved January 8, 2016 from http://truth-andbeauty.net/projects/well-formed-eigenfactor","paperID":"None"},{"content":"Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-Place: Thinking through the Relations Between Data and Community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2863--2872. http://doi.acm.org/10.1145/2702123.2702558","paperID":"None"},{"content":"Mitchell Whitelaw. 2012. Towards generous interfaces for archival collections. International Council on Archives Congress, 20--24.","paperID":"None"},{"content":"Wesley Willett, Jeffrey Heer, Joseph Hellerstein, and Maneesh Agrawala. 2011. CommentSpace: structured support for collaborative visual analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 3131--3140. http://doi.acm.org/10.1145/1978942.1979407","paperID":"None"},{"content":"Hugh Willmott. 1995. Managing the Academics: Commodification and Control in the Development of University Education in the U.K. Human Relations 48, 9: 993--1027. http://doi.org/10.1177/001872679504800902","paperID":"None"},{"content":"Anneke Zuiderwijk, Marijn Janssen, Sunil Choenni, Ronald Meijer, and R. Sheikh Alibaks. 2012. Sociotechnical impediments of open data. Electronic Journal of e-Government 10, 2: 156--172. .","paperID":"None"}],"abstract":"The use of data and metrics on a professional and personal level has led to considerable discourse around the performative power and politics of 'big data' and data visualization, with academia being no exception. We have developed a university system, ResViz, which publicly visualizes the externally funded research projects of academics, and their internal collaborations. We present an interview study that engages 20 key stakeholders, academics and administrators who are part of the pilot release for the first version of this system. In doing so, we describe and problematize our design space, considering the implications of making metrics visible and their social use within a large organization. Our findings cut across the way people communicate, review and manage performance with metrics. We raise seven design issues in this space -- practical considerations that expose the tensions in making metrics available for public contestation.","title":"ResViz: Politics and Design Issues in Visualizing Academic Metrics","filename":"CHI16/p5015","authors":["Chris Elsden","Sebastian Mellor","Patrick Olivier","Pete Wheldon","David Kirk","Rob Comber"],"conference":"CHI '16"}