{"paperId":2858049,"citation":[],"reference":[{"content":"Apple Pay. 2015. Apple Pay: Your wallet without the wallet. (2015). Retrieved August 22, 2015 from http://www.apple.com/apple-pay/?cid=wwa-us-kwg-features-com.","paperID":"None"},{"content":"Roger A. Arnold. 2008. Economics (9th ed.). Cengage Learning, 273--278.","paperID":"None"},{"content":"Aaron W Baur, Julian Buhler, Markus Bick, and Charlotte S Bonorden. 2015. Cryptocurrencies as a Disruption? Empirical Findings on User Adoption and Future Potential of Bitcoin and Co. In Open and Big Data Management and Innovation. Springer, 63--80.","paperID":"None"},{"content":"Bitcointalk Forum. 2015. Bitcoin Discussion. (2015). Retrieved August 22, 2015 from https://bitcointalk.org/index.php?board=1.0.","paperID":"None"},{"content":"Blockchain. 2015a. Block Height 367500. (29 July 2015). Retrieved September 20, 2015 from https://blockchain.info/block-height/367500.","paperID":"None"},{"content":"Blockchain. 2015b. Number Of Users. (2015). Retrieved August 27, 2015 from https://blockchain.info/charts/my-wallet-n-users.","paperID":"None"},{"content":"Blockchain. 2015c. Total Coins In Circulation. (2015). Retrieved August 27, 2015 from https://blockchain.info/charts/total-bitcoins.","paperID":"None"},{"content":"Jeremiah Bohr and Masooda Bashir. 2014. Who Uses Bitcoin? An exploration of the Bitcoin community. In Privacy, Security and Trust (PST). 94--101.","paperID":"None"},{"content":"Joseph Bonneau, Andrew Miller, Jeremy Clark, Arvind Narayanan, Joshua A Kroll, and Edward W Felten. 2015. Research perspectives on bitcoin and second generation cryptocurrencies. In IEEE Symposium on Security and Privacy. IEEE.","paperID":"None"},{"content":"Joseph Bonneau, Arvind Narayanan, Andrew Miller, Jeremy Clark, Joshua A Kroll, and Edward W Felten. 2014. Mixcoin: Anonymity for Bitcoin with accountable mixes. In Financial Cryptography and Data Security. Springer, 486--504.","paperID":"None"},{"content":"John M. Carroll and Victoria Bellotti. 2015. Creating Value Together: The Emerging Design Space of Peer-to-Peer Currency and Exchange. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work (CSCW '15). ACM, NY, NY, USA, 1500--1510. http://doi.acm.org/10.1145/2675133.2675270","paperID":"None"},{"content":"Kathy Charmaz. 2014. Constructing Grounded Theory, 2nd Edition. SAGE Publications Ltd.","paperID":"None"},{"content":"David Chaum. 1983. Blind signatures for untraceable payments. In Advances in cryptology. Springer, 199--203.","paperID":"None"},{"content":"Elizabeth F. Churchill. 2015. Why Should We Care About Bitcoin interactions 22, 5 (Aug. 2015), 20--21. http://doi.acm.org/10.1145/2810199","paperID":"None"},{"content":"Pavel Ciaian, Miroslava Rajcaniova, and d'Artis Kancs. 2014. The Economics of BitCoin Price Formation. arXiv preprint arXiv:1405.4498 (2014).","paperID":"None"},{"content":"Coinbase. 2015. Charts. (2015). Retrieved August 27, 2015 from https://coinbase.com/charts.","paperID":"None"},{"content":"Daryl Collins, Jonathan Morduch, Stuart Rutherford, and Orlanda Ruthven. 2009. Portfolios of the poor: how the world's poor live on $2 a day. Princeton University Press.","paperID":"None"},{"content":"Craigslist. 2015. Craigslist in US. (2015). Retrieved August 22, 2015 from http://www.craigslist.org/about/sites#US.","paperID":"None"},{"content":"Michael A. Cusumano. 2014. The Bitcoin Ecosystem. Commun. ACM 57, 10 (Sept. 2014), 22--24. http://doi.acm.org/10.1145/2661047","paperID":"None"},{"content":"Department of Finanial Services NY. 2015. Revised BitLicense Regulatory Framework. (2015). Retrieved December 20, 2015 from http://www.dfs.ny.gov/legal/regulations/rev_bitlicense_reg_framework.htm.","paperID":"None"},{"content":"Jonathan Donier and Julius Friedrich Bonart. 2014. A million metaorder analysis of market impact on the Bitcoin. Available at SSRN (2014).","paperID":"None"},{"content":"Shayan Eskandari, David Barrera, Elizabeth Stobert, and Jeremy Clark. 2015. A First Look at the Usability of Bitcoin Key Management. In NDSS Workshop on Usable Security (USEC). http://people.inf.ethz.ch/barrerad/files/usec15-eskandari.pdf","paperID":"None"},{"content":"David S Evans. 2014. Economic Aspects of Bitcoin and Other Decentralized Public-Ledger Currency Platforms. University of Chicago Coase-Sandor Institute for Law & Economics Research Paper 685 (2014).","paperID":"None"},{"content":"Ittay Eyal and Emin Gun Sirer. 2014. Majority is not enough: Bitcoin mining is vulnerable. In Financial Cryptography and Data Security. Springer, 436--454.","paperID":"None"},{"content":"Jennifer Ferreira, Mark Perry, and Sriram Subramanian. 2015. Spending Time with Money: From Shared Values to Social Connectivity. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work (CSCW '15). ACM, NY, NY, USA, 1222--1234. http://doi.acm.org/10.1145/2675133.2675230","paperID":"None"},{"content":"David Garcia, Claudio J Tessone, Pavlin Mavrodiev, and Nicolas Perony. 2014. The digital traces of bubbles: feedback cycles between socio-economic signals in the Bitcoin economy. Journal of the Royal Society Interface 11, 99 (2014), 20140623.","paperID":"None"},{"content":"Arthur Gervais, Ghassan Karame, Srdjan Capkun, and Vedran Capkun. 2013. Is Bitcoin a decentralized currency? IACR Cryptology ePrint Archive 2013 (2013), 829.","paperID":"None"},{"content":"Google Wallet. 2015. Tap and pay with your phone. (2015). Retrieved August 22, 2015 from http://www.google.com/wallet/shop-in-stores/?gclid=CKP_1JGCscMCFc0kgQodTZIACA.","paperID":"None"},{"content":"Dominic Hobson. 2013. What is Bitcoin? XRDS 20, 1 (Sept. 2013), 40--44. http://doi.acm.org/10.1145/2510124","paperID":"None"},{"content":"Tamara Holmes. 2015. Payment method statistics. (15 June 2015). Retrieved September 24, 2015 from http://www.creditcards.com/credit-card-news/payment-method-statistics-1276.php.","paperID":"None"},{"content":"Jermain Kaminski and Peter Gloor. 2014. Nowcasting the Bitcoin Market with Twitter Signals. arXiv preprint arXiv:1406.7577 (2014).","paperID":"None"},{"content":"Jofish Kaye, Janet Vertesi, Jennifer Ferreira, Barry Brown, and Mark Perry. 2014b. #CHImoney: Financial Interactions, Digital Cash, Capital Exchange and Mobile Money. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 111--114. http://doi.acm.org/10.1145/2559206.2559221","paperID":"None"},{"content":"Joseph Jofish Kaye, Mary McCuistion, Rebecca Gulotta, and David A. Shamma. 2014a. Money Talks: Tracking Personal Finances. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 521--530. http://doi.acm.org/10.1145/2556288.2556975","paperID":"None"},{"content":"Daniel Kondor, Marton Posfai, Istvan Csabai, and Gabor Vattay. 2014. Do the rich get richer? An empirical analysis of the Bitcoin transaction network. PloS one 9, 2 (2014), e86197.","paperID":"None"},{"content":"Philip Koshy, Diana Koshy, and Patrick McDaniel. 2014. An Analysis of Anonymity in Bitcoin Using P2P Network Traffic. In Financial Cryptography and Data Security. 469--485.","paperID":"None"},{"content":"Deepti Kumar, David Martin, and Jacki O'Neill. 2011. The Times They Are A-changin': Mobile Payments in India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1413--1422. http://doi.acm.org/10.1145/1978942.1979150","paperID":"None"},{"content":"Doug Levinson. 2014. What gives a dollar bill its value? Video. (23 June 2014). Retrieved September 18, 2015 from http://ed.ted.com/lessons/what-gives-a-dollar-bill-its-value-doug-levinson.","paperID":"None"},{"content":"Caitlin Lustig and Bonnie Nardi. 2015. Algorithmic Authority: The Case of Bitcoin. In System Sciences (HICSS), 2015 48th Hawaii International Conference on. 743--752. DOI: http://dx.doi.org/10.1109/HICSS.2015.95","paperID":"None"},{"content":"Scott Mainwaring, Wendy March, and Bill Maurer. 2008. From Meiwaku to Tokushita!: Lessons for Digital Money Design from Japan. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 21--24. http://doi.acm.org/10.1145/1357054.1357058","paperID":"None"},{"content":"Bill Maurer, Taylor C Nelms, and Lana Swartz. 2013. When perhaps the real problem is money itself!: the practical materiality of Bitcoin. Social Semiotics 23, 2 (2013), 261--277.","paperID":"None"},{"content":"Indrani Medhi, S.N. Nagasena Gautama, and Kentaro Toyama. 2009. A Comparison of Mobile Money-transfer UIs for Non-literate and Semi-literate Users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1741--1750. http://doi.acm.org/10.1145/1518701.1518970","paperID":"None"},{"content":"Sarah Meiklejohn, Marjori Pomarole, Grant Jordan, Kirill Levchenko, Damon McCoy, Geoffrey M. Voelker, and Stefan Savage. 2013. A Fistful of Bitcoins: Characterizing Payments Among Men with No Names. In Proceedings of the 2013 Conference on Internet Measurement Conference (IMC '13). ACM, NY, NY, USA, 127--140. http://doi.acm.org/10.1145/2504730.2504747","paperID":"None"},{"content":"Tyler Moore and Nicolas Christin. 2013. Beware the middleman: Empirical analysis of bitcoin-exchange risk. In Financial Cryptography and Data Security. Springer, 25--33.","paperID":"None"},{"content":"Satoshi Nakamoto. 2008. Bitcoin: A peer-to-peer electronic cash system. Consulted 1, 2012 (2008), 28.","paperID":"None"},{"content":"Gary Pritchard, John Vines, and Patrick Olivier. 2015. Your Money's No Good Here: The Elimination of Cash Payment on London Buses. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 907--916. http://doi.acm.org/10.1145/2702123.2702137","paperID":"None"},{"content":"Reddit. 2015. Bitcoin Subreddit. (2015). Retrieved August 22, 2015 from http://www.reddit.com/r/bitcoin.","paperID":"None"},{"content":"Simulacrum. 2013. The Demographics of Bitcoin (PART 1 UPDATED). (2013). Retrieved July 20, 2015 from http://simulacrum.cc/2013/03/04/ the-demographics-of-bitcoin-part-1-updated/.","paperID":"None"},{"content":"Michele Spagnuolo, Federico Maggi, and Stefano Zanero. 2014. Bitiodine: Extracting intelligence from the bitcoin network. In Financial Cryptography and Data Security. Springer, 457--468.","paperID":"None"},{"content":"Janet Stocks, Capitolina Díaz, and Bjorn Hallerod. 2007. Modern couples sharing money, sharing life. Palgrave Macmillan.","paperID":"None"},{"content":"Joana Taborda. 2015. United States Inflation Rate. (16 September 2015). Retrieved September 20, 2015 from http://www.tradingeconomics.com/united-states/inflation-cpi.","paperID":"None"},{"content":"Pater Tenebrarum. 2015. Misconceptions About Gold. (16 February 2015). Retrieved December 20, 2015 from http://www.acting-man.com/?p=35868.","paperID":"None"},{"content":"Marshall Van Alstyne. 2014. Why Bitcoin Has Value. Commun. ACM 57, 5 (May 2014), 30--32. http://doi.acm.org/10.1145/2594288","paperID":"None"},{"content":"Vericoin. 2015. The VeriCoin Android wallet featuring VeriBit. (2015). Retrieved August 22, 2015 from http://www.vericoin.info/.","paperID":"None"},{"content":"John Vines, Mark Blythe, Paul Dunphy, and Andrew Monk. 2011. Eighty something: banking for the older old. In Proceedings of the 25th BCS Conference on Human-Computer Interaction. British Computer Society, 64--73.","paperID":"None"},{"content":"John Vines, Mark Blythe, Paul Dunphy, Vasillis Vlachokyriakos, Isaac Teece, Andrew Monk, and Patrick Olivier. 2012a. Cheque Mates: Participatory Design of Digital Payments with Eighty Somethings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1189--1198. http://doi.acm.org/10.1145/2207676.2208569","paperID":"None"},{"content":"John Vines, Paul Dunphy, Mark Blythe, Stephen Lindsay, Andrew Monk, and Patrick Olivier. 2012b. The Joy of Cheques: Trust, Paper and Eighty Somethings. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 147--156. http://doi.acm.org/10.1145/2145204.2145229","paperID":"None"},{"content":"Yang Wang and Scott D. Mainwaring. 2008. Human-Currency Interaction: Learning from Virtual Currency Use in China. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 25--28. http://doi.acm.org/10.1145/1357054.1357059","paperID":"None"},{"content":"Aaron Yelowitz and Matthew Wilson. 2015. Characteristics of Bitcoin users: an analysis of Google search data. Applied Economics Letters 22, 13 (2015), 1030--1036. DOI: http://dx.doi.org/10.1080/13504851.2014.995359","paperID":"None"},{"content":"Viviana Zelizer. 1997. The social meaning of money: Pin money, paychecks, poor relief and other currencies. Princeton University Press Princeton.","paperID":"None"}],"abstract":"Digital currencies represent a new method for exchange -- a payment method with no physical form, made real by the Internet. This new type of currency was created to ease online transactions and to provide greater convenience in making payments. However, a critical component of a monetary system is the people who use it. Acknowledging this, we present results of our interview study (N=20) with two groups of participants (users and non-users) about how they perceive the most popular digital currency, Bitcoin. Our results reveal: non-users mistakenly believe they are incapable of using Bitcoin, users are not well-versed in how the protocol functions, they have misconceptions about the privacy of transactions, and that Bitcoin satisfies properties of ideal payment systems as defined by our participants. Our results illustrate Bitcoin's tradeoffs, its uses, and barriers to entry.","title":"Of Two Minds, Multiple Addresses, and One Ledger: Characterizing Opinions, Knowledge, and Perceptions of Bitcoin Across Users and Non-Users","filename":"CHI16/p1656","authors":["Xianyi Gao","Gradeigh D. Clark","Janne Lindqvist"],"conference":"CHI '16"}