{"paperId":2858505,"citation":[],"abstract":"As human computer interaction design research continues to expand domains, civics is emerging as an important subject through which to explore how computation shapes our public lives. In this paper we present and reflect upon a series of research through design (RtD) projects that investigate speculative civic contexts. From this, we identify and discuss tactics that can be employed in RtD projects: RtD as Representations of Systems Yet-to-Come, RtD as Prototyping Systems and RtD as Use of a System. Then we identify and discuss thematic interpretations of civics that emerged through our designs: Mediated Civics, Computed Civics, and Proxied Civics. This work contributes to discourses of speculative design, research through design, and those of civics in human computer interaction design research. ","reference":[{"content":"Eric Ambinder and David M. Jennings. 2013. The Resilient Social Network: Occupy Sandy and Supestorm Sandy.","paperID":"None"},{"content":"Jeffrey Bardzell and Shaowen Bardzell. 2013. What is \"Critical\" About Critical Design? Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3297-3306. http://doi.org/10.1145/2470654.2466451","paperID":"None"},{"content":"Jeffrey Bardzell, Shaowen Bardzell, and Lone Koefoed Hansen. 2015. Immodest Proposals: Research Through Design and Knowledge. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2093-2102. http://doi.org/10.1145/2702123.2702400","paperID":"None"},{"content":"David M. Berry. Critical Theory and the Digital. Bloomsbury Publishing. Retrieved September 24, 2015 from http://www.bloomsbury.com/us/critical-theoryand-the-digital-9781441166395","paperID":"None"},{"content":"Julian Bleeker. 2009. Design Fiction: A Short Essay on Design, Science, Fact and Fiction. Retrieved February 15, 2013 from http://nearfuturelaboratory.com/2009/03/17/designfiction-a-short-essay-on-design-science-fact-andfiction/","paperID":"None"},{"content":"Ian Bogost. 2012. Alien Phenomenology or, What it's Like to Be a Thing. University of MN Press, Minneapolis.","paperID":"None"},{"content":"John Bowers. 2012. The Logic of Annotated Portfolios: Communicating the Value of \"Research Through Design.\" Proceedings of the Designing Interactive Systems Conference, ACM, 68-77. http://doi.org/10.1145/2317956.2317968","paperID":"None"},{"content":"Jed R. Brubaker. 2014. The Afterlife of Digital Identity. CHI '14 Extended Abstracts on Human Factors in Computing Systems, ACM, 343-346. http://doi.org/10.1145/2559206.2559964","paperID":"None"},{"content":"Jed R. Brubaker, Lynn S. Dombrowski, Anita M. Gilbert, Nafiri Kusumakaulika, and Gillian R. Hayes. 2014. Stewarding a Legacy: Responsibilities and Relationships in the Management of Post-mortem Data. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 4157- 4166. http://doi.org/10.1145/2556288.2557059","paperID":"None"},{"content":"Marion Buchenau and Jane Fulton Suri. 2000. Experience Prototyping. Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, ACM, 424-433. http://doi.org/10.1145/347642.347802","paperID":"None"},{"content":"Peter Cook (ed.). 1999. Archigram. Princeton Architectural Press, NY.","paperID":"None"},{"content":"Mike Crang and Stephen Graham. 2007. SENTIENT CITIES Ambient intelligence and the politics of urban space. Information, Communication & Society 10, 6: 789-817. http://doi.org/10.1080/13691180701750991","paperID":"None"},{"content":"Christopher A Le Dantec, Mariam Asad, Aditi Misra, and Kari E Watkins. 2015. Planning with Crowdsourced Data: Rhetoric and Representation in Transportation Planning. CSCW '15: Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM Request Permissions, 1717-1727.","paperID":"None"},{"content":"Christopher A. Le Dantec and Sarah Fox. 2015. Strangers at the Gate: Gaining Access, Building Rapport, and Co-Constructing Community-Based Research. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1348-1358. http://doi.org/10.1145/2675133.2675147","paperID":"None"},{"content":"John Dewey. 2012. The Public and its Problems: An essay in political inquiry. Penn States Press, Philadelphia.","paperID":"None"},{"content":"Carl Francis DiSalvo. 2009. Design and the Construction of Publics. Design Issues 25, 1: 48-63.","paperID":"None"},{"content":"Carl DiSalvo and Tom Jenkins. 2015. Drones for Foraging. 2nd Conference on Research Though Design.","paperID":"None"},{"content":"Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making Public Things: How HCI Design Can Express Matters of Concern. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM. http://doi.org/10.1145/2556288.2557359.","paperID":"None"},{"content":"Anthony Dunne. 2006. Hertzian Tales: Electronic Products, Aesthetic Experience, and Critical Design. The MIT Press.","paperID":"None"},{"content":"Anthony Dunne and Fiona Raby. 2014. Speculative Everything: Design, Fiction, and Social Dreaming. MIT Press, Cambridge, Massachusetts?; London.","paperID":"None"},{"content":"Keller Easterling. 2014. Extrastatecraft: The Power of Infrastructure Space. Verso Books.","paperID":"None"},{"content":"Pelle Ehn. 1988. Playing the Language-games of Design and Use-on Skill and Participation. Proceedings of the ACM SIGOIS and IEEECS TC-OA 1988 Conference on Office Information Systems, ACM, 142-157. http://doi.org/10.1145/45410.45426","paperID":"None"},{"content":"Pelle Ehn. 2008. Participation in design things. Proceedings of the Tenth Anniversary Conference on Participatory Design 2008, IN University, 92-101. Retrieved February 12, 2013 from http://dl.acm.org/citation.cfm?id=1795234.1795248","paperID":"None"},{"content":"Daniel Fallman. 2003. Design-oriented humancomputer interaction. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 225-232. http://doi.org/10.1145/642611.642652","paperID":"None"},{"content":"Gabriele Ferri, Jeffrey Bardzell, Shaowen Bardzell, and Stephanie Louraine. 2014. Analyzing Critical Designs: Categories, Distinctions, and Canons of Exemplars. Proceedings of the 2014 Conference on Designing Interactive Systems, ACM, 355-364. http://doi.org/10.1145/2598510.2598588","paperID":"None"},{"content":"Sarah Fox and Christopher Le Dantec. 2014. Community Historians: Scaffolding Community Engagement Through Culture and Heritage. Proceedings of the 2014 Conference on Designing Interactive Systems, ACM, 785-794. http://doi.org/10.1145/2598510.2598563","paperID":"None"},{"content":"William Gaver. 2011. Making Spaces: How Design Workbooks Work. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1551-1560. http://doi.org/10.1145/1978942.1979169","paperID":"None"},{"content":"William Gaver. 2012. What should we expect from research through design? Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems, ACM, 937-946. http://doi.org/10.1145/2208516.2208538","paperID":"None"},{"content":"William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 233-240. http://doi.org/10.1145/642611.642653","paperID":"None"},{"content":"Adam Greenfield. 2006. Everyware: The Dawning Age of Ubiquitous Computing. New Riders Publishing, Berkeley, CA.","paperID":"None"},{"content":"Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, Stress, and Support During Gender Transition on Facebook. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1176-1190. http://doi.org/10.1145/2675133.2675152","paperID":"None"},{"content":"Maarten Hajer. 2003. Policy without polity? Policy analysis and the institutional void. Policy Sciences 36, 2: 175-195. http://doi.org/10.1023/A:1024834510939","paperID":"None"},{"content":"Joachim Halse, Eva Brandt, Brendon Clark, and Binder (eds.). 2010. Rehearsing the Future. Danish Design School Press, Copenhagen.","paperID":"None"},{"content":"Conor Linehan, Ben J. Kirman, Stuart Reeves, et al. 2014. Alternate Endings: Using Fiction to Explore Design Futures. CHI '14 Extended Abstracts on Human Factors in Computing Systems, ACM, 45-48. http://doi.org/10.1145/2559206.2560472","paperID":"None"},{"content":"Jonathan Lukens. 2013. DIY Infrastructure and the Scope of Design Practice. Design Issues 29, 3: 14-27. http://doi.org/10.1162/DESI_a_00218","paperID":"None"},{"content":"Noortje Marres. 2012. Material Participation: Technology, the Environment and Everyday Publics. Palgrave Macmillan, Basingstoke.","paperID":"None"},{"content":"Harold G Nelson and Erik Stolterman. 2012. The Design Way: Intentional Change in an Unpredictable World. The MIT Press, Cambridge, Massachusetts.","paperID":"None"},{"content":"William Odom. 2015. Understanding Long-Term Interactions with a Slow Technology: An Investigation of Experiences with FutureMe. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 575-584. http://doi.org/10.1145/2702123.2702221","paperID":"None"},{"content":"William Odom, Abi Sellen, Richard Harper, and Eno Thereska. 2012. Lost in Translation: Understanding the Possession of Digital Things in the Cloud. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 781-790. http://doi.org/10.1145/2207676.2207789","paperID":"None"},{"content":"William Odom, John Zimmerman, and Jodi Forlizzi. 2010. Designing for Dynamic Family Structures: Divorced Families and Interactive Systems. Proceedings of the 8th ACM Conference on Designing Interactive Systems, ACM, 151-160. http://doi.org/10.1145/1858171.1858199","paperID":"None"},{"content":"William Odom, John Zimmerman, and Jodi Forlizzi. 2014. Placelessness, Spacelessness, and Formlessness: Experiential Qualities of Virtual Possessions. Proceedings of the 2014 Conference on Designing Interactive Systems, ACM, 985-994. http://doi.org/10.1145/2598510.2598577","paperID":"None"},{"content":"James Pierce, Phoebe Sengers, Tad Hirsch, Tom Jenkins, William Gaver, and Carl DiSalvo. 2015. Expanding and Refining Design and Criticality in HCI. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2083-2092. http://doi.org/10.1145/2702123.2702438","paperID":"None"},{"content":"Steven Poole. 2014. The truth about smart cities: \"In the end, they will destroy democracy.\" The Guardian. Retrieved September 15, 2015 from http://www.theguardian.com/cities/2014/dec/17/truthsmart-city-destroy-democracy-urban-thinkersbuzzphrase","paperID":"None"},{"content":"M. T. Stauffer. 2002. Utopian Reflections, Reflected Utopias: Urban Designs by Archizoom and Superstudio. AA Files: 23-36.","paperID":"None"},{"content":"Joshua Tanenbaum. 2014. Design Fictional Interactions: Why HCI Should Care About Stories. interactions 21, 5: 22-23. http://doi.org/10.1145/2648414","paperID":"None"},{"content":"Cameron Tonkinwise. 2015. Just Design. Medium. Retrieved September 24, 2015 from https://medium.com/@camerontw/just-designb1f97cb3996f","paperID":"None"},{"content":"2012. How to Transform a City: Lessons from the IBM Smarter Cities Challenge. Retrieved from http://asmarterplanet.com/files/2012/08/SmarterCities-WhitePaper_031412b1.pdf","paperID":"None"},{"content":"Open City - Civic apps built with open data. Retrieved from http://opencityapps.org","paperID":"None"}],"title":"Designing Speculative Civics","filename":"CHI16/p4979","authors":["Carl DiSalvo","Tom Jenkins","Thomas Lodato"],"conference":"CHI '16"}