{"paperId":2858527,"citation":[],"reference":[{"content":"Daniel Avrahami and Scott E. Hudson. 2002. Forming Interactivity: A Tool for Rapid Prototyping of Physical Interactive Products. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '02). ACM, New York, NY, USA, 141-146. DOI: http://dx.doi.org/10.1145/778712.778735","paperID":"None"},{"content":"Maribeth Back, Jonathan Cohen, Rich Gold, Steve Harrison, and Scott Minneman. 2001. Listen Reader: An Electronically Augmented Paper-based Book. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 23-29. DOI: http://dx.doi.org/10.1145/365024.365031","paperID":"None"},{"content":"Tom Djajadiningrat, Stephan Wensveen, Joep Frens, and Kees Overbeeke. 2004. Tangible Products: Redressing the Balance Between Appearance and Action. Personal Ubiquitous Comput. 8, 5 (Sept. 2004), 294-309. DOI: http://dx.doi.org/10.1007/s00779- 004- 0293- 8","paperID":"None"},{"content":"Kenneth P. Fishkin. 2004. A Taxonomy for and Analysis of Tangible Interfaces. Personal Ubiquitous Comput. 8, 5 (Sept. 2004), 347-358. DOI: http://dx.doi.org/10.1007/s00779- 004- 0297- 4","paperID":"None"},{"content":"Kenneth P. Fishkin, Bing Jiang, Matthai Philipose, and Sumit Roy. 2004. I Sense a Disturbance in the Force: Unobtrusive Detection of Interactions with RFID-tagged Objects. In Proceeding of Ubiquitous Computing (UbiComp '04). 268-282. http://dx.doi.org/10.1007/978- 3- 540- 30119- 6_16","paperID":"None"},{"content":"Lars Erik Holmquist, Johan Redstrom, and Peter Ljungstrand. 1999. Token-Based Acces to Digital Information. In Proceedings of the 1st International Symposium on Handheld and Ubiquitous Computing (HUC '99). Springer-Verlag, London, UK, UK, 234-245. http://dl.acm.org/citation.cfm?id=647985.743869","paperID":"None"},{"content":"Sungjae Hwang, Myungwook Ahn, and Kwang-yun Wohn. 2013. MagGetz: Customizable Passive Tangible Controllers on and Around Conventional Mobile Devices. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 411-416. DOI:http://dx.doi.org/10.1145/2501988.2501991","paperID":"None"},{"content":"Hiroshi Ishii and Brygg Ullmer. 1997. Tangible Bits: Towards Seamless Interfaces Between People, Bits and Atoms. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '97). ACM, New York, NY, USA, 234-241. DOI: http://dx.doi.org/10.1145/258549.258715","paperID":"None"},{"content":"Hanchuan Li, Can Ye, and Alanson P. Sample. 2015. IDSense: A Human Object Interaction Detection System Based on Passive UHF RFID. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2555-2564. DOI: http://dx.doi.org/10.1145/2702123.2702178","paperID":"None"},{"content":"Rong-Hao Liang, Kai-Yin Cheng, Liwei Chan, Chuan-Xhyuan Peng, Mike Y. Chen, Rung-Huei Liang, De-Nian Yang, and Bing-Yu Chen. 2013. GaussBits: Magnetic Tangible Bits for Portable and Occlusion-free Near-surface Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1391-1400. DOI:http://dx.doi.org/10.1145/2470654.2466185","paperID":"None"},{"content":"Rong-Hao Liang, Kai-Yin Cheng, Chao-Huai Su, Chien-Ting Weng, Bing-Yu Chen, and De-Nian Yang. 2012. GaussSense: Attachable Stylus Sensing Using Magnetic Sensor Grid. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 319-326. DOI: http://dx.doi.org/10.1145/2380116.2380157","paperID":"None"},{"content":"Rong-Hao Liang, Han-Chih Kuo, Liwei Chan, De-Nian Yang, and Bing-Yu Chen. 2014. GaussStones: Shielded Magnetic Tangibles for Multi-token Interactions on Portable Displays. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 365-372. DOI: http://dx.doi.org/10.1145/2642918.2647384","paperID":"None"},{"content":"Nicolai Marquardt, Alex S. Taylor, Nicolas Villar, and Saul Greenberg. 2010. Rethinking RFID: Awareness and Control for Interaction with RFID Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2307-2316. DOI: http://dx.doi.org/10.1145/1753326.1753674","paperID":"None"},{"content":"Einar Sneve Martinussen and Timo Arnall. 2009. Designing with RFID. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (TEI '09). ACM, New York, NY, USA, 343-350. DOI: http://dx.doi.org/10.1145/1517664.1517734","paperID":"None"},{"content":"A.P. Sample, D.J. Yeager, and J.R. Smith. 2009. A capacitive touch interface for passive RFID tags. In RFID, 2009 IEEE International Conference on. 103-109. DOI: http://dx.doi.org/10.1109/RFID.2009.4911212","paperID":"None"},{"content":"Timothy M. Simon, Bruce H. Thomas, Ross T. Smith, and Mark Smith. 2013. Adding Input Controls and Sensors to RFID Tags to Support Dynamic Tangible User Interfaces. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). ACM, New York, NY, USA, 165-172. DOI: http://dx.doi.org/10.1145/2540930.2540979","paperID":"None"},{"content":"Brygg Ullmer, Hiroshi Ishii, and Robert J. K. Jacob. 2005. Token+Constraint Systems for Tangible Interaction with Digital Information. ACM Trans. Comput.-Hum. Interact. 12, 1 (March 2005), 81-118. DOI: http://dx.doi.org/10.1145/1057237.1057242","paperID":"None"}],"abstract":"We present GaussRFID, a hybrid RFID and magnetic-field tag sensing system that supports interactivity when embedded in retrofitted or new physical objects. The system consists of two major components - GaussTag, a magnetic-RFID tag that is combined with a magnetic unit and an RFID tag, and GaussStage, which is a tag reader that is combined with an analog Hall-sensor grid and an RFID reader. A GaussStage recognizes the ID, 3D position, and partial 3D orientation of a GaussTag near the sensing platform, and provides simple interfaces for involving physical constraints, displays and actuators in tangible interaction designs. The results of a two-day toy-hacking workshop reveal that all six groups of 31 participants successfully modified physical toys to interact with computers using the GaussRFID system.","title":"GaussRFID: Reinventing Physical Toys Using Magnetic RFID Development Kits","filename":"CHI16/p4233","authors":["Rong-Hao Liang","Han-Chih Kuo","Bing-Yu Chen"],"conference":"CHI '16"}