{"paperId":2858275,"reference":[{"content":"Bark, K., Wheeler, J. W., Premakumar, S., and Cutkosky, M. R. 2008. Comparison of skin stretch and vibrotactile stimulation for feedback of proprioceptive information. In Haptic interfaces for virtual environment and teleoperator systems, 2008. haptics 2008. symposium on, 71--78.","paperID":"None"},{"content":"Bark, K., Wheeler, J., Shull, P., Savall, J., and Cutkosky, M. 2010. Rotational skin stretch feedback: A wearable haptic display for motion. Haptics, IEEE Transactions on, 3(3), 166--176.","paperID":"None"},{"content":"Daerden, F., and Lefeber, D. 2002. Pneumatic artificial muscles: actuators for robotics and automation. European journal of mechanical and environmental engineering, 47(1), 11--21.","paperID":"None"},{"content":"Dollar, A. M., & Herr, H. 2008. Lower extremity exoskeletons and active orthoses: challenges and state- of-the-art. Robotics, IEEE Transactions on, 24(1), 144- 158.","paperID":"None"},{"content":"Jansen, C., Oving, A., and van Veen, H. J. 2004. Vibrotactile movement initiation. In Proceedings of Eurohaptics, 110--117.","paperID":"None"},{"content":"Lieberman, J., and Breazeal, C. 2007. TIKL: Development of a wearable vibrotactile feedback suit for improved human motor learning. Robotics, IEEE Transactions on, 23(5), 919--926.","paperID":"None"},{"content":"Lopes, P., Ion, A., Müller, W., Hoffmann, D., Jonell, P., and Baudisch, P. 2015. Proprioceptive Interaction. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15), 175--175.","paperID":"None"},{"content":"Lopes, P ., Jonell, P ., and Baudisch, P . 2015. Affordance++: allowing objects to communicate dynamic use. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. (CHI '15), 2515--2524.","paperID":"None"},{"content":"McDaniel, T., Goldberg, M., Villanueva, D., Viswanathan, L. N., and Panchanathan, S. 2011. Motor learning using a kinematic-vibrotactile mapping targeting fundamental movements. In Proceedings of the 19th ACM international conference on Multimedia, 543--552.","paperID":"None"},{"content":"Nakamura, A., Tabata, S., Ueda, T., Kiyofuji, S., and Kuno, Y. 2005. Multimodal presentation method for a dance training system. In CHI'05 extended abstracts on Human factors in computing systems, 1685--1688.","paperID":"None"},{"content":"Pfeiffer, M., Duente, T., Schneegass, S., Alt, F., and Rohs, M. Cruise Control for Pedestrians: Controlling Walking Direction using Electrical Muscle Stimulation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. (CHI '15), 2505--2514.","paperID":"None"},{"content":"Schönauer, C., Fukushi, K., Olwal, A., Kaufmann, H., and Raskar, R. 2012. Multimodal motion guidance: techniques for adaptive and dynamic feedback. In Proceedings of the 14th ACM international conference on Multimodal interaction, 133--140.","paperID":"None"},{"content":"Schönauer, C., Pintaric, T., and Kaufmann, H. 2011, March. Full body interaction for serious games in motor rehabilitation. In Proceedings of the 2nd Augmented Human International Conference, 4.","paperID":"None"},{"content":"Spelmezan, D., Jacobs, M., Hilgers, A., and Borchers, J. 2009. Tactile motion instructions for physical activities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 2243--2252.","paperID":"None"},{"content":"Stanley, A., and Kuchenbecker, K. J. 2012. Evaluation of tactile feedback methods for wrist rotation guidance. Haptics, IEEE Transactions on, 5(3), 240--251.","paperID":"None"},{"content":"Tamaki, E., Miyaki, T., and Rekimoto, J. 2011. PossessedHand: techniques for controlling human hands using electrical muscles stimuli. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 543--552.","paperID":"None"},{"content":"Yang, U., Jang, Y., and Kim, G. J. 2002. Designing a vibro-tactile wear for close range interaction for vr- based motion training. In International Conference on Artificial Reality and Telexistence. 4--9.","paperID":"None"}],"citation":[],"abstract":"Online fitness videos make it possible and popular to do exercise at home. However, it is not easy to notice the details of motions by merely watching training videos. We propose a new type of motion guidance system that simulates the way that the human body moves as driven by muscle contractions. We have designed external artificial muscles on a sleeve to create a pulling sensation that can guide the forearm's pronation (internal rotation) and the forearm's supination (external rotation). The sleeve consists of stepper motors to provide pulling force, fishing lines and elastic bands to imitate muscle contraction to drive the forearm to rotate instinctively. We present two preliminary experiments. The first one shows that this system can effectively guide the forearm to rotate in the correct direction. The second one shows that users can be guided to the targeted angle by utilizing a tactile cue. We also report users' feedback through the experiments and provide design recommendations and directions for future research.","title":"Motion Guidance Sleeve: Guiding the Forearm Rotation through External Artificial Muscles","filename":"CHI16/p3272","authors":["Chia-Yu Chen","Yen-Yu Chen","Yi-Ju Chung","Neng-Hao Yu"],"conference":"CHI '16"}