{"paperId":2858542,"citation":[],"reference":[{"content":"Olivier Bau and Wendy E. Mackay. 2008. OctoPocus: a dynamic guide for learning gesture-based command sets. In Proceedings of the 21st annual ACM symposium on User interface software and technology (UIST '08), 37--46. http://dx.doi.org/10.1145/1449715.1449724","paperID":"None"},{"content":"Conrad H. Blickenstorfer. 1995. Graffiti: Wow! Pen Computing Magazine, pp. 30--31.","paperID":"None"},{"content":"Steven J. Castellucci and I. Scott MacKenzie. 2013. Gestural text entry using Huffman codes. In Proceedings of the International Conference on Multimedia and Human-Computer Interaction (MHCI '13), 119.1--119.8. http://www.yorku.ca/mack/mhci2013e.html.","paperID":"None"},{"content":"Steven J. Castellucci and I. Scott MacKenzie. 2008. Unigest: text entry using three degrees of motion. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08), 3549--3554. http://dx.doi.org/10.1145/1358628.1358889","paperID":"None"},{"content":"Steven J. Castellucci and I. Scott MacKenzie. 2008. Graffiti vs. unistrokes: an empirical comparison. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 305--308. http://dx.doi.org/10.1145/1357054.1357106.","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Tovi Grossman, and George Fitzmaurice. 2014. Swipeboard: a text entry technique for ultra-small interfaces that supports novice to expert transitions. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14), 615--620. http://dx.doi.org/10.1145/2642918.2647354","paperID":"None"},{"content":"Torsten Felzer and Rainer Nordmann. 2006. Alternative text entry using different input methods. In Proceedings of the 8th international ACM SIGACCESS conference on Computers and accessibility (Assets '06), 10--17. http://dx.doi.org/10.1145/1168987.1168991","paperID":"None"},{"content":"David Goldberg and Cate Richardson. 1993. Touch-typing with a stylus. In Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems (CHI '93), 80--87. http://dx.doi.org/10.1145/16905169093","paperID":"None"},{"content":"Joshua Goodman, Gina Venolia, Keith Steury, and Chauncey Parker. 2002. Language modeling for soft keyboards. In Proceedings of the 7th international conference on Intelligent user interfaces (IUI '02), 194--195. http://dx.doi.org/10.1145/502716.502753.","paperID":"None"},{"content":"Zhenyu Gu , Xinya Xu, Chen Chu, Yuchen Zhang. 2015. To Write not Select, a New Text Entry Method Using Joystick. Human-Computer Interaction: Interaction Technologies, 35--43.","paperID":"None"},{"content":"Eleanor Jones, Jason Alexander, Andreas Andreou, Pourang Irani, and Sriram Subramanian. 2010. GesText: accelerometer-based gestural text-entry systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 2173--2182. http://dx.doi.org/10.1145/1753326.1753655","paperID":"None"},{"content":"Per-Ola Kristensson and Shumin Zhai. 2004. SHARK2: a large vocabulary shorthand writing system for pen-based computers. In Proceedings of the 17th annual ACM symposium on User interface software and technology (UIST '04), 43--52. http://dx.doi.org/10.1145/1029632.1029640","paperID":"None"},{"content":"Frank Chun Yat Li, Richard T. Guy, Koji Yatani, and Khai N. Truong. 2011. The 1line keyboard: a QWERTY layout in a single line. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11), 461--470. http://dx.doi.org/10.1145/2047196.2047257","paperID":"None"},{"content":"I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase sets for evaluating text entry techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03), 754--755. http://dx.doi.org/10.1145/765891.765971","paperID":"None"},{"content":"I. Scott MacKenzie and Shawn X. Zhang. 1997. The immediate usability of Graffiti. Graphics Interface 97: 129--137.","paperID":"None"},{"content":"I. Scott MacKenzie, R. William Soukoreff, and Joanna Helga. 2011. 1 thumb, 4 buttons, 20 words per minute: design and evaluation of H4-writer. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11), 471--480. http://dx.doi.org/10.1145/2047196.2047258.","paperID":"None"},{"content":"Anders Markussen, Mikkel Rønne Jakobsen, and Kasper Hornbæk. 2014. Vulture: a mid-air word-gesture keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1073--1082. http://dx.doi.org/10.1145/2556288.2556964","paperID":"None"},{"content":"Franck Poirier and Mohammed Belatar. 2007. UniGlyph: only one keystroke per character on a 4-button minimal keypad for key-based text entry. HCI International 2007, 479--483.","paperID":"None"},{"content":"Shuo Qiu, Kyle Rego, Lei Zhang, Feifei Zhong, and Michael Zhong. MotionInput Gestural Text Entry in the Air. http://www.columbia.edu/~sq2144/MotionInput.pdf","paperID":"None"},{"content":"Garth Shoemaker, Leah Findlater, Jessica Q. Dawson, and Kellogg S. Booth. 2009. Mid-air text input techniques for very large wall displays. In Proceedings of Graphics Interface 2009 (GI '09), 231--238.","paperID":"None"},{"content":"The Minuum Keyboard. http://minuum.com/","paperID":"None"},{"content":"William S. Walmsley, W. Xavier Snelgrove, and Khai N. Truong. 2014. Disambiguation of imprecise input with one-dimensional rotational text entry. ACM Trans. Comput.-Hum. Interact. 21, 1:4 http://dx.doi.org/10.1145/2542544","paperID":"None"},{"content":"Wiimote, https://en.wikipedia.org/wiki/Wii_Remote","paperID":"None"},{"content":"Jacob Wobbrock and Brad Myers. 2006. Trackball text entry for people with motor impairments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 479--488. http://dx.doi.org/10.1145/1124772.1124845.","paperID":"None"},{"content":"Jacob O. Wobbrock, Htet Htet Aung, Brandon Rothrock, and Brad A. Myers. 2005. Maximizing the guessability of symbolic input. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05), 1869--1872. http://dx.doi.org/10.1145/1056808.1057043","paperID":"None"},{"content":"Jacob O. Wobbrock, Duen Horng Chau, and Brad A. Myers. 2007. An alternative to push, press, and tap-tap-tap: gesturing on an isometric joystick for mobile phone text entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 667--676. http://dx.doi.org/10.1145/1240624.1240728","paperID":"None"},{"content":"Jacob O. Wobbrock, Brad A. Myers, and Duen Horng Chau. 2006. In-stroke word completion. In Proceedings of the 19th annual ACM symposium on User interface software and technology (UIST '06), 333--336. http://dx.doi.org/10.1145/1166253.1166305","paperID":"None"},{"content":"Jacob O. Wobbrock, Brad A. Myers, and John A. Kembel. 2003. EdgeWrite: a stylus-based text entry method designed for high accuracy and stability of motion. In Proceedings of the 16th annual ACM symposium on User interface software and technology (UIST '03), 61--70. http://dx.doi.org/10.1145/964696.964703","paperID":"None"},{"content":"Jacob Wobbrock, Brad Myers, and Brandon Rothrock. 2006. Few-key text entry revisited: mnemonic gestures on four keys. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 489--492. http://dx.doi.org/10.1145/1124772.1124846","paperID":"None"},{"content":"Jacob O. Wobbrock, Brad A. Myers, Htet Htet Aung, and Edmund F. LoPresti. 2003. Text entry from power wheelchairs: edgewrite for joysticks and touchpads. In Proceedings of the 6th international ACM SIGACCESS conference on Computers and accessibility (Assets '04), 110--117. http://dx.doi.org/10.1145/1028630.1028650","paperID":"None"},{"content":"Shumin Zhai and Per-Ola Kristensson. 2003. Shorthand writing on stylus keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03), 97--104. http://dx.doi.org/10.1145/642611.642630","paperID":"None"}],"abstract":"We present 1D Handwriting, a unistroke gesture technique enabling text entry on a one-dimensional interface. The challenge is to map two-dimensional handwriting to a reduced one-dimensional space, while achieving a balance between memorability and performance efficiency. After an iterative design, we finally derive a set of ambiguous two-length unistroke gestures, each mapping to 1-4 letters. To input words, we design a Bayesian algorithm that takes into account the probability of gestures and the language model. To input letters, we design a pause gesture allowing users to switch into letter selection mode seamlessly. Users studies show that 1D Handwriting significantly outperforms a selection-based technique (a variation of 1Line Keyboard) for both letter input (4.67 WPM vs. 4.20 WPM) and word input (9.72 WPM vs. 8.10 WPM). With extensive training, text entry rate can reach 19.6 WPM. Users' subjective feedback indicates 1D Handwriting is easy to learn and efficient to use. Moreover, it has several potential applications for other one-dimensional constrained interfaces.","title":"One-Dimensional Handwriting: Inputting Letters and Words on Smart Glasses","filename":"CHI16/p71","authors":["Chun Yu","Ke Sun","Mingyuan Zhong","Xincheng Li","Peijun Zhao","Yuanchun Shi"],"conference":"CHI '16"}