{"paperId":2858552,"citation":[],"abstract":"Almost any search on Google Play returns numerous app suggestions. The user quickly skims through the list and picks a few apps for a closer look. The vast majority of the apps regardless of how well-made they are go unnoticed. App icons uniquely represent each app in Google Play and help apps to get noticed, as we demonstrate in the paper. We reviewed the visual qualities of icons that could make them noticeable and likable. We then computationally measured two of the qualities visual saliency and complexity for 930 icons and linked the computed scores to app popularity (the number of app ratings and installs). The measures explained 38% of variance in the number of ratings, if app genre was accounted for. Not only does such result assert the link between icon properties and app popularity, it also highlights the automatic prediction of app popularity as a promising research direction. HCI researchers, app creators and Google Play (or another mobile marketplace) will benefit from the paper insights on what antecedes app success and how to measure the antecedents.","reference":[{"content":"Balinsky, H. Evaluating interface aesthetics: measure of symmetry. In Digital Publishing Conference (San Jose 2006), International Society for Optics and Photonics.","paperID":"None"},{"content":"Black, P. E., Scarfone, K., and Souppaya, M. Cyber security metrics and measures. In Wiley Handbook of Science and Technology for Homeland Security. John Wiley & Sons, Inc, 2008.","paperID":"None"},{"content":"Böhmer, M., Hecht, B., Schöning, J., Krüger, A., and Bauer, G. Falling asleep with Angry Birds, Facebook and Kindle: a large scale study on mobile application usage. In the 13th international conference on Human computer interaction with mobile devices and services ( 2011), ACM, 47--56.","paperID":"None"},{"content":"Chae, M. and Kim, J. Do size and structure matter to mobile users? An empirical study of the effects of screen size, information structure, and task complexity on user activities with standard web phones. Behaviour & Information Technology, 23, 3 (2004), 165--181.","paperID":"None"},{"content":"De Angeli, A., Hartmann, J., and Sutcliffe, A. The effect of brand on the evaluation of websites. In INTERACT ( 2008), Springer Berlin Heidelberg, 638--651.","paperID":"None"},{"content":"Forsythe, A. Visual Complexity: Is That All There Is? In Harris, Don, ed., Engineering Psychology and Cognitive Ergonomics. Springer Berlin Heidelberg, 2009.","paperID":"None"},{"content":"Forsythe, A., Sheehy, N., and Sawey, M. Measuring icon complexity: An automated analysis. Behavior Research Methods, Instruments, & Computers, 35, 2 (2003), 334--342.","paperID":"None"},{"content":"Hall, R. H. and Hanna, P. The impact of web page text-background colour combinations on readability, retention, aesthetics and behavioural intention. Behaviour & information technology, 23, 3 (2004), 183--195.","paperID":"None"},{"content":"Harper, Simon, Jay, Caroline, Michailidou, Eleni, and Quan, Huangmao. Analysing the visual complexity of web pages using document structure. Behavious & Information Technology, 32, 5 (2013), 491--502.","paperID":"None"},{"content":"Itti, L., Koch, C., and Niebur, E. A model of saliency-based visual attention for rapid scene analysis. IEEE Transactions on Pattern Analysis & Machine Intelligence, 20, 11 (1998), 1254--1259.","paperID":"None"},{"content":"Khalid, H., Shihab, E., Nagappan, M., and Hassan, A. What do mobile app users complain about? Software, IEEE, 32, 3 (2014), 70--77.","paperID":"None"},{"content":"Kim, H. and Fesenmaier, D. R. Persuasive design of destination web sites: An analysis of first impression. Journal of Travel Research., 47, 1 (2008), 3--13.","paperID":"None"},{"content":"Kim, H. W., Lee, H. L., and Son, J. E. An exploratory study on the determinants of smartphone app purchase. In The 11th International DSI and the 16th APDSI Joint Meeting (Taipei 2011).","paperID":"None"},{"content":"Kumar, R., Satyanarayan, A., Torres, C., Lim, M., Ahmad, S., Klemmer, S. R., and Talton, J. O. Webzeitgeist: design mining the web. In the SIGCHI Conference on Human Factors in Computing Systems ( 2013), ACM, 3083--3092.","paperID":"None"},{"content":"Lindgaard, G., Fernandes, G., Dudek, C., and Brown, J. Attention web designers: You have 50 milliseconds to make a good first impressoin! Behavior & information technology, 25, 2 (2006), 115--126.","paperID":"None"},{"content":"Ling, C., Hwang, W., and Salvendy, G. A survey of what customers want in a cell phone design. Behaviour & Information Technology, 26, 2 (March-April 2007), 149--163.","paperID":"None"},{"content":"Loy, G. and Eklundh, J. O. Detecting symmetry and symmetric constellations of features. In Computer Vision - ECCV 2006. Springer Berlin Heidelberg, 2006.","paperID":"None"},{"content":"Machilsen, B., Pauwels, M., and Wagemans, J. The role of vertical mirror symmetry in visual shape detection. Journal of Vision, 9, 12 (2009), 1--11.","paperID":"None"},{"content":"McCay-Peet, L., Lalmas, M., and Navalpakkam, V. On saliency, affect and focused attention. In SIGCHI Conference on Human Factors in Computing Systems ( 2012), ACM, 541--550.","paperID":"None"},{"content":"McDougall, S. and Reppa, I. Ease of icon processing can predict icon appeal. In 15th International Conference, HCI International ( 2013), Springer Berlin Heidelberg, 575--584.","paperID":"None"},{"content":"McDougall, S. J., de Bruijn, O., and Curry, M. B. Exploring the effects of icon characteristics on user performance: the role of icon concreteness, complexity, and distinctiveness. Journal of Experimental Psychology: Applied, 6, 4 (2000), 291--306.","paperID":"None"},{"content":"Miniukovich, A, and De Angeli, A. Computation of Interface Aesthetics. In CHI'15 (Seoul 2015).","paperID":"None"},{"content":"Miniukovich, A. and De Angeli, A. Quantification of Interface Visual Complexity. In the 2014 International Working Conference on Advanced Visual Interfaces (Como 2014), ACM, 153--160.","paperID":"None"},{"content":"Miniukovich, A. and De Angeli, A. Visual diversity and user interface quality. In the 2015 British HCI Conference ( 2015), ACM, 101--109.","paperID":"None"},{"content":"Miniukovich, A. and De Angeli, A. Visual Impression of Mobile App Interfaces. In NordiCHI'14 ( 2014), ACM.","paperID":"None"},{"content":"Mormann, M. M., Navalpakkam, V., Koch, C., and Rangel, A. Relative visual saliency differences induce sizable bias in consumer choice. Journal of Consumer Psychology, 22, 1 (2012), 67--74.","paperID":"None"},{"content":"Mudambi, S. M. and Schuff, D. What makes a helpful review? A study of customer reviews on Amazon.com. MIS Quarterly, 34, 1 (2010), 185200.","paperID":"None"},{"content":"Nadkarni, S. and Gupta, R. A task-based model of perceived website complexity. Mis Quarterly (2007), 501--524.","paperID":"None"},{"content":"Navalpakkam, V. and Itti, L. Modeling the influence of task on attention. Vision Research, 45, 2 (2005), 205--231.","paperID":"None"},{"content":"Ng, A. W. and Chan, A. H. Visual and cognitive features on icon effectiveness. In international multiconference of engineers and computer scientists ( 2008), 19--21.","paperID":"None"},{"content":"Oliva, A., Mack, M. L., Shrestha, M., and Peeper, A. Identifying the perceptual dimensions of visual complexity of scenes. the 26th Annual Meeting of the Cognitive Science Society (August 2004).","paperID":"None"},{"content":"Parkhurst, D. J. and Niebur, E. Texture contrast attracts overt visual attention in natural scenes. European Journal of Neuroscience, 19, 3 (2004), 783--789.","paperID":"None"},{"content":"Purchase, H. C., Freeman, E., and Hamer, J. An exploration of visual complexity. Digrammatic representation and inferences (2012), 200--213.","paperID":"None"},{"content":"Reber, R., Schwarz, N., and Winkielman, P. Processing fluency and aesthetic pleasure: is beauty in the perceiver's processing experience? Personality and social psychology review, 8, 4 (2004), 364--382.","paperID":"None"},{"content":"Reinecke, K., Yeh, T., Miratrix, L., Mardiko, R., Zhao, Y., and Liu, J., Gajos, K. Z. Predicting users' first impressions of website aesthetics with a quantification of perceived visual complexity and colorfulness. In CHI (Paris 2013), ACM, 20492058.","paperID":"None"},{"content":"Reppa, I. and McDougall, S. When the going gets tough the beautiful get going: aesthetic appeal facilitates task performance. Psychonomic bulletin & review, 22 (2015), 1243--1254.","paperID":"None"},{"content":"Rosenholtz, R., Li, Y., and Nakano, L. Measuring visual clutter. Journal of vision, 7, 2 (2007), 1--22.","paperID":"None"},{"content":"Sonderegger, A., Zbinden, G., Uebelbacher, A., and Sauer, J. The influence of product aesthetics and usability over the course of time: a longitudinal field experiment. Ergonomics, 55 (2012), 713--730.","paperID":"None"},{"content":"Tamura, H., Mori, S., and Yamawaki, T. Textural features corresponding to visual perception. IEEE Transactions on Systems, Man and Cybernetics, 8, 6 (1978), 460--473.","paperID":"None"},{"content":"Thielsch, M. T. and Hirschfeld, G. High and low spatial frequencies in website evaluations. Ergonomics, 53, 8 (2010), 972--978.","paperID":"None"},{"content":"Thielsch, M. T. and Hirschfeld, G. Spatial frequencies in aesthetic website evaluations- explaining how ultra-rapid evaluations are formed. Ergonomics, 55, 7 (2012), 731--742.","paperID":"None"},{"content":"Thielsch, M. T., Blotenberg, I., and Jaron, R. User evaluation of websites: From first impression to recommendation. Interacting with Computers, 26, 1 (2013), 89--102.","paperID":"None"},{"content":"Tinio, P. P. and Leder, H. Just how stable are stable aesthetic features? Symmetry, complexity, and the jaws of massive familiarization. Acta Psychologica, 130, 3 (2009), 241--250.","paperID":"None"},{"content":"Tractinsky, N. Aesthetics and apparent usability: empirically assessing cultural and methodological issues. In the ACM SIGCHI Conference on Human factors in computing systems ( 1997), ACM, 115122.","paperID":"None"},{"content":"Tractinsky, N., Cokhavi, A., Kirschenbaum, M., and Sharfi, T. Evaluating the consistency of immediate aesthetic perceptions of web pages. International journal of human-computer studies, 64, 11 (2006), 1071--1083.","paperID":"None"},{"content":"Tuch, A. N., Bargas-Avila, J. A., and Opwis, K. Symmetry and aesthetics in website design: It'sa man's business. Computers in Human Behavior, 26, 6 (2010), 1831--1837.","paperID":"None"},{"content":"Tuch, A. N., Presslaber, E. E., Stocklin, M., Opwis, K., and Bargas-Avila, J. A. The role of visual complexity and prototypicality regarding first impression of websites: Working towards understanding aesthetic judgments. International Journal of Human-Computer Studies, 70 (2012), 794--811.","paperID":"None"},{"content":"van den Berg, R., Cornelissen, F. W., and Roerdink, J. B. A crowding model of visual clutter. Journal of Vision, 9, 4 (2009), 1--11.","paperID":"None"},{"content":"Wolfe, J. M. and Horowitz, T. S. What attributes guide the deployment of visual attention and how do they do it? Nature Reviews Neuroscience, 5, 6 (2004), 495--501.","paperID":"None"},{"content":"Wu, O., Hu, W., and Shi, L. Measuring the visual complexities of Web pages. ACM Transactions on the Web (TWEB), 7, 1 (2013), 1--34.","paperID":"None"},{"content":"Zheng, X. S., Chakraborty, I., Lin, J. J. W., and Rauschenberger, R. Correlating low-level image statistics with users-rapid aesthetic and affective judgments of web pages. In SIGCHI Conference on Human Factors in Computing Systems ( 2009), ACM, 1--10.","paperID":"None"}],"title":"Pick me!: Getting Noticed on Google Play","filename":"CHI16/p4622","authors":["Aliaksei Miniukovich","Antonella De Angeli"],"conference":"CHI '16"}