{"paperId":2858477,"citation":[],"abstract":"Awareness of the huge amount of work faced by relatives in caring for a person suffering from a loss of autonomy has led to research focusing on ways to ease the burden on informal caregivers. Among them, services and devices aimed at providing social support and fighting the isolation that may be caused by the caregiving tasks appear important. However, little is known about the social support informal caregivers actually value and look for in practice. To fill this gap, we conducted a multi-sited study, focusing on older informal caregivers, because they are numerous and have lower experience with technology. Our study highlights that being part of a group is a key element in helping informal caregivers to feel that they are not alone, continue leisure activities, learn from others and sustain participation in organized activities. Through this understanding, we discuss design opportunities in a sociotechnical approach complementing online and offline social support.","reference":[{"content":"Mark S. Ackerman. 2000. The Intellectual Challenge of CSCW: The Gap Between Social Requirements and Technical Feasibility. Human-Computer Interaction 15, 2--3: 179--203.","paperID":"None"},{"content":"Malek Alaoui and Myriam Lewkowicz. 2012. Struggling against Social Isolation of the Elderly - The Design of SmartTV Applications. In From Research to Practice in the Design of Cooperative Systems: results and Open Challenges, Proceedings of the 10th International Conference on the Design of Cooperative systems, Julie Dugdale, Cédric Masclet, Maria A. Grasso, Jean-François Boujut and Parina Hassanaly (eds.). Springer, London, UK, 261--276. http://dx.doi.org/10.1007/978--1--4471--4093--1_18","paperID":"None"},{"content":"Melanie K. Barnes and Steve Duck. 1994. Everyday communicative contexts for social support. In Communication of social support: Messages, interactions, relationships and community, Brant R. Burleson, Terrance L. Albrecht and Irwin G. Sarason (eds.). Sage, Thousand Oaks, USA, CA, 175--194.","paperID":"None"},{"content":"Edwin Blake. 2007. Information and social support for semi-literate people living with HIV. Interactions 14, 5: 29--32. http://dx.doi.org/10.1145/1288515.1288535","paperID":"None"},{"content":"Susanne Bødker and Erik Grönvall. 2013. Calendars: Time coordination and overview in families and beyond. In Proceedings of the 13th European Conference on Computer Supported Cooperative Work (ECSCW 2013). Springer, London, 63--81. http://dx.doi.org/10.1007/978--1--4471--5346--7_4","paperID":"None"},{"content":"Claus Bossen, Lars Rune Christensen, Erik Grönvall, and Lasse Steenbock Vestergaard. 2013. CareCoor: Augmenting the coordination of cooperative home care work. International journal of medical informatics 82, 5: e189-e199.","paperID":"None"},{"content":"Tone Bratteteig and Ina Wagner. 2013. Moving healthcare to the home: The work to make homecare work. In Proceedings of the 13th European Conference on Computer Supported Cooperative Work (ECSCW 2013). Springer, London, 143--162. http://dx.doi.org/10.1007/978--1--4471--5346--7_8","paperID":"None"},{"content":"Louise Brereton and Mike Nolan. 2000. \"You do know he's had a stroke, don't you?\" Preparation for family care-giving-the neglected dimension. Journal of clinical nursing 9, 4: 498--506.","paperID":"None"},{"content":"Robert J. Buchanan, Chunfeng Huang and Adele Crudden. 2012. Use of the Internet by informal caregivers assisting people with multiple sclerosis. Journal of Technology in Human Services. 30, 2: 7293. http://dx.doi.org/10.1080/15228835.2012.700558","paperID":"None"},{"content":"Yunan Chen, Victor Ngo, and Sun Young Park. 2013. Caring for Caregivers: Designing for Integrality. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, NY, 91--102. http://doi.org/10.1145/2441776.2441789","paperID":"None"},{"content":"Lars Rune Christensen and Erik Grönvall. 2011. Challenges and opportunities for collaborative technologies for home care work. In Proceedings of the 12th European Conference on Computer Supported Cooperative Work (ECSCW 2011). Springer, London, 61--80. http://dx.doi.org/10.1007/978-0--85729--913-0_4","paperID":"None"},{"content":"Teresa Chiu, Elsa Marziali, Angela Colantonio, Anne Carswell, Marilyn Gruneir, Mary Tanga and Gunther Eysenbach .2009. Internet-based caregiver support for Chinese Canadians taking care of a family member with Alzheimer disease and related dementia. Canadian Journal on Aging, 28, 4: 323-336. http://dx.doi.org/10.1017/S0714980809990158","paperID":"None"},{"content":"David Constant, Lee Sproull and Sara Kiesler 1996. The kindness of strangers: The usefulness of electronic weak ties for technical advice. Organization Science 7, 2: 119-135. http://dx.doi.org/10.1287/orsc.7.2.119","paperID":"None"},{"content":"Neil S. Coulson. 2005. Receiving social support online: an analysis of a computer-mediated support group for individuals living with irritable bowel syndrome. Cyber-Psychology & Behavior 8, 6: 580--584.","paperID":"None"},{"content":"Matty Cruijsberg, Martijn H. Vastenburg, and Pieter Jan Stappers. 2012. Family Carebook: A Case Study on Designing Peace of Mind for Family Caregivers. In Ambient Intelligence-Software and Applications, Paulo Novais, Kasper Hallenborg, Dante I. Tapia et al. (eds.). Springer, Berlin, 129--136. http://dx.doi.org/10.1007/978--3--642--28783--1_16","paperID":"None"},{"content":"Pavan Dadlani, Alexander Sinitsyn, Willem Fontijn, and Panos Markopoulos. 2010. Aurama: caregiver awareness for living independently with an augmented picture frame display. Ai & Society 25, 2: 233--245.","paperID":"None"},{"content":"Karen Donelan, Craig A. Hill, Catherine Hoffman, Kimberly Scoles, Penny Hollander Feldman, Carol Levine and David Gould. 2002. Challenger to care: Informal caregivers in a changing health system. Health Affairs 21, 4: 222-231. http://dx.doi.org/10.1377/hlthaff.21.4.222","paperID":"None"},{"content":"Elizabeth H. Ehleringer and Si Jung Kim. 2013. The Wearable Lullaby: Improving Sleep Quality of Caregivers of Dementia Patients. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, 409--414. http://doi.org/10.1145/2468356.2468429","paperID":"None"},{"content":"Michailidou Eleni, Antigoni Parmaxi and Panayiotis Zaphiris. Culture effects in online social support for older people: perceptions and experience. Universal Access in the Information Society 14, 2: 281--293. http://dx.doi.org/10.1007/s10209-014-0346--3","paperID":"None"},{"content":"Nicole B. Ellison, Charles Steinfield, and Cliff Lampe. 2007. The benefits of Facebook \"friends:\" Social capital and college students' use of online social network sites. Journal of Computer Mediated Communication 12, 4: 1143--1168.","paperID":"None"},{"content":"Sheena L. Erete. 2015. Engaging Around Neighborhood Issues: How Online Communication Affects Offline Behavior. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, 1590--1601. http://dx.doi.org/10.1145/2675133.2675182","paperID":"None"},{"content":"Susannah Fox and Joanna Brenner. 2012. Family Caregivers Online. Washington, DC: Pew Research Center. Retrieved January 5, 2016 from http://pewinternet.org/Reports/2012/Caregiversonline.aspx","paperID":"None"},{"content":"Carolina Fuentes, Valeria Herskovic, Jurgen Heysen, and Monica Tentori. 2013. Towards a technology for caregivers' emotional expression and self-reflection. In Ubiquitous Computing and Ambient Intelligence. Context-Awareness and Context-Driven Interaction, Gabriel Urzaiz, Sergio Ochoa, José Bravo et al.(eds.). Springer International Publishing, 143--150. http://dx.doi.org/10.1007/978--3--319-03176--7_19","paperID":"None"},{"content":"Gérald Gaglio. 2010. Consommation d'informations sur Internet et modulation de la relation aux médecins. Le cas d'aidantes de malades atteints d'une pathologie lourde. Sociologies pratiques 20, 1: 63--74.","paperID":"None"},{"content":"Eva Ganglbauer, Geraldine Fitzpatrick, Özge Subasi, and Florian Güldenpfennig. 2014. Think globally, act locally: a case study of a free food sharing community and social networking. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, 911--921. http://doi.org/10.1145/2531602.2531664","paperID":"None"},{"content":"Kathrin M. Gerling, Matthew Miller, Regan L. Mandryk, Max V. Birk, and Jan D. Smeddinck. 2014. Effects of Balancing for Physical Abilities on Player Performance, Experience and Self-esteem in Exergames. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14), ACM, NY, 2201--2210. http://dx.doi.org/10.1145/2556288.2556963","paperID":"None"},{"content":"Nancy L. Green, Curry Guinn, and Ronnie W. Smith. 2012. Assisting social conversation between persons with Alzheimer's disease and their conversational partners. In Proceedings of the Third Workshop on Speech and Language Processing for Assistive Technologies (SLPAT '12). Association for Computational Linguistics, Stroudsburg, USA, 37--46.","paperID":"None"},{"content":"Andrea Grimes, Brian M. Landry, and Rebecca E. Grinter. 2010. Characteristics of shared health reflections in a local community. In Proceedings of the 2010 ACM conference on Computer supported cooperative work (CSCW '10). ACM, NY, NY, USA, 435--444. http://dx.doi.org/10.1145/1718918.1718992","paperID":"None"},{"content":"David H. Gustafson, Robert P. Hawkins, Eric W. Boberg, Fiona McTavish, Betta Owens, Meg Wise, Haile Berhe and Suzanne Pingree. 2002. CHESS: 10 years of research and development in consumer health informatics for broad populations, including the underserved. International Journal of Medical Informatics 65, 3: 169--177. http://dx.doi.org/10.1016/S1386--5056(02)00048--5","paperID":"None"},{"content":"Dave Harley and Geraldine Fitzpatrick. 2009. YouTube and intergenerational communication: the case of Geriatric1927. Universal access in the information society 8, 1: 5--20. http://dx.doi.org/10.1007/s10209-008-0127-y","paperID":"None"},{"content":"Susan C. Herring. 2002. Computer-mediated communication on the Internet. Annual Review of Information Science and Technology 36, 1: 109-168. http://dx.doi.org/10.1002/aris.1440360104","paperID":"None"},{"content":"Michael Hirst. 2005. Carer distress: A prospective, population-based study. Social Science & Medicine. 61, 3: 697--708. http://dx.doi.org/10.1016/j.socscimed.2005.01.001","paperID":"None"},{"content":"Ai-Ju Huang, Hao-Chuan Wang, and Chien Wen Yuan. 2014. De-virtualizing social events: understanding the gap between online and offline participation for event invitations. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 436--448. http://dx.doi.org/10.1145/2531602.2531606","paperID":"None"},{"content":"Jina Huh and Mark S. Ackerman. 2012. Collaborative help in chronic disease management: supporting individualized problems. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 853862.http://dx.doi.org/10.1145/2145204.2145331","paperID":"None"},{"content":"Jane Jenson and Stéphane Jacobzone. 2000. Care allowances for the frail elderly and their impact on women care-givers, OECD Labour Marker and Social Policy Occasional Paper, 41 (July 2000). http://dx.doi.org/10.1787/414673405257","paperID":"None"},{"content":"Ulrika Josefsson. 2003. Patients' Online Communities Experiences of emergent Swedish self-help on the Internet. In Proceedings of the First International Conference on Communities and Technologies (C&T 2003), 369--389. http://dx.doi.org/10.1007/978--94-0170115-0_19","paperID":"None"},{"content":"Andrea Kavanaugh, Carroll, John, Mary-Beth Rosson, Than Than Zin, and Debbie Denise Reese. Community networks: Where offline communities meet online. Journal of Computer-Mediated Communication 10, 4 (2005). Blackwell Publishing Ltd, pp. 1083--6101 http://dx.doi.org/10.1111/j.1083--6101.2005.tb00266.x","paperID":"None"},{"content":"Haejung S. Lee, Patricia F. Brennan and Barbara J. Daly. 2001. Relationship of empathy to appraisal, depression, life satisfaction and physical health in informal caregivers of older adults. Research in Nursing & Health 24, 1: 44--56. http://dx.doi.org/10.1002/1098240X(200102)24:1<44::AID-NUR1006>3.0.CO;2-S","paperID":"None"},{"content":"Hong Li. 2015. Informal Caregivers' Use of the Internet for Caregiving Information. Social work in health care 54, 6: 532--546. http://dx.doi.org/10.1080/00981389.2015.1045577","paperID":"None"},{"content":"Leslie S. Liu, Sen H. Hirano, Monica Tentori, et al. 2011. Improving communication and social support for caregivers of high-risk infants through mobile technologies. In Proceedings of the ACM 2011 conference on Computer supported cooperative work (CSCW '11). ACM, NY, 475--484. http://dx.doi.org/10.1145/1958824.1958897","paperID":"None"},{"content":"Leslie S. Liu, Jina Huh, Tina Neogi, Kori Inkpen, and Wanda Pratt. 2013. Health vlogger-viewer interaction in chronic illness management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 4958. http://dx.doi.org/10.1145/2470654.2470663","paperID":"None"},{"content":"Xingjie Liu, Qi He, Yuanyuan Tian, Wang-Chien Lee, John McPherson, and Jiawei Han. 2012. Event-based social networks: linking the online and offline social worlds. In Proceedings of the 18th ACM SIGKDD international conference on Knowledge discovery and data mining (KDD '12). ACM, NY, NY, USA, 1032--1040. http://doi.org/10.1145/2339530.2339693","paperID":"None"},{"content":"Haley MacLeod, Kim Oakes, Danika Geisler, Kay Connelly, and Katie Siek. 2015. Rare World: Towards Technology for Rare Diseases. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1145--1154. http://dx.doi.org/10.1145/2702123.2702494","paperID":"None"},{"content":"George E. Marcus. 1995. Ethnography in/of the World System: The Emergence of Multi-sited Ethnography. Annual Review of Anthropology 24: 95--117.","paperID":"None"},{"content":"Claudia Müller, Dominik Hornung, Theodor Hamm, and Volker Wulf. 2015. Practice-based Design of a Neighborhood Portal: Focusing on Elderly Tenants in a City Quarter Living Lab. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), ACM, NY, 22952304. http://dx.doi.org/10.1145/2702123.2702449","paperID":"None"},{"content":"Claudia Müller, Lin Wan, and Dalibor Hrg. 2010. Dealing with wandering: a case study on caregivers' attitudes towards privacy and autonomy when reflecting the use of LBS. In Proceedings of the 16th ACM international conference on Supporting group work (GROUP '10), ACM, NY, 75--84. http://dx.doi.org/10.1145/1880071.1880082","paperID":"None"},{"content":"René F. Navarro and Jesús Favela. 2011. Usability Assessment of a Pervasive System to Assist Caregivers in Dealing with Repetitive Behaviors of Patients with Dementia.In Proceedings of the 4th International Conference on PErvasive Technologies Related to Assistive Environments (PETRA '11). ACM, NY, 28:1--28:8. http://doi.org/10.1145/2141622.2141656","paperID":"None"},{"content":"Corinna Ogonowski, Benedikt Ley, Jan Hess, Lin Wan, and Volker Wulf. 2013. Designing for the Living Room?: Long-Term User Involvement in a Living Lab. In Proceedings of the 31st Annual ACM Conference on Human Factors in Computing Systems (CHI '13), ACM, NY, 1539--1548. http://doi.acm.org/10.1145/2470654.2466205","paperID":"None"},{"content":"Marta E. Pagán-Ortiza, Dharma E. Cortés, Noelle Rudloff, Patricia Weitzman and Sue Levkoff. 2014. Use of an online community to provide support to caregivers of people with dementia. Journal of gerontological social work 57, 6--7: 694--709. http://dx.doi.org/10.1080/01634372.2014.901998","paperID":"None"},{"content":"Sun Young Park and Yunan Chen. 2015. Individual and Social Recognition: Challenges and Opportunities in Migraine Management. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1540--1551. http://dx.doi.org/10.1145/2675133.2675248","paperID":"None"},{"content":"Ulrike Pfeil. 2007. Online social support for older people. SIGACCESS Access. Comput. 88: 3--8. http://dx.doi.org/10.1145/1278234.1278235","paperID":"None"},{"content":"Ulrike Pfeil and Panayiotis Zaphiris. 2007. Patterns of empathy in online communication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 919--928. http://dx.doi.org/10.1145/1240624.1240763","paperID":"None"},{"content":"Martin Pinquart and Sylvia Sörensen (2007). Correlates of physical health of informal caregivers: A metaanalysis. J Gerontol B Psychol Sci Soc Sci, 62, 2: 126137.","paperID":"None"},{"content":"Eduardo Quintana and Jesus Favela. 2012. Augmented reality annotations to assist persons with Alzheimers and their caregivers. Personal and Ubiquitous Computing 17, 6: 1105--1116. http://dx.doi.org/10.1007/s00779-012-0558--6","paperID":"None"},{"content":"Monika Riedel and Markus Kraus. 2011. Informal care provision in Europe: regulation and profile of providers. Centre for European Policy Studies.","paperID":"None"},{"content":"Rose M. Rubin and Shelley I. White-Means. 2009. Informal caregiving: Dilemmas of sandwiched caregivers. Journal of Family and Economic Issues, 30, 3: 252-267. http://dx.doi.org/10.1007/s10834-0099155-x","paperID":"None"},{"content":"Dirk Sauerland, Ansgar Wübker, Sandra M. G. Zwakhalen, et al. 2014. Costs of Care for People with Dementia Just Before and After Nursing Home Placement. Primary Data From Eight European Countries. In Proc. of 10th World Congress on Health Economies in the Age of Longevity, Dublin, Ireland.","paperID":"None"},{"content":"Susanne Schinkinger and Hilda Tellioğlu. 2014. Design Implications to Systems Supporting Informal Caregivers' Daily Life. In Human-Computer Interaction. Applications and Services. Springer International Publishing, 341--350. http://dx.doi.org/10.1007/978-3-319-07227-2_33","paperID":"None"},{"content":"Marén Schorch, Lin Wan, David Randall and Volker Wulf. 2016. Designing for Those who are Overlooked. Insider Perspectives on Care Practices and Cooperative Work of Elderly Informal Caregivers. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW '16). ACM, NY, NY, USA, (to be published).","paperID":"None"},{"content":"Meredith M. Skeels, Kenton T. Unruh, Christopher Powell, and Wanda Pratt. 2010. Catalyzing social support for breast cancer patients. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 173182. http://dx.doi.org/10.1145/1753326.1753353","paperID":"None"},{"content":"Laurie S. Stenberg-Nichols and Virginia W. Junk. 1997. The Sandwich Generation: Dependency, proximity and task assistance needs of parents. Journal of Family and Economic Issues 18, 3: 299-326. http://dx.doi.org/10.1023/A:1024978930126","paperID":"None"},{"content":"Alexandra Stiver, Leonor Barroca, Marian Petre, Mike Richards, and Dave Roberts. 2015. Civic crowdfunding: how do offline communities engage online?. In Proceedings of the 2015 British HCI Conference (British HCI '15). ACM, NY, NY, USA, 37--45. http://doi.org/10.1145/2783446.2783585","paperID":"None"},{"content":"Anselm Strauss and Juliet Corbin. 1998. Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage publications, London.","paperID":"None"},{"content":"Peggy A. Thoits. 1986. Social support as coping assistance. Journal of Consulting and Clinical Psychology 54, 4: 416--423. http://dx.doi.org/10.1037/0022-006X.54.4.416","paperID":"None"},{"content":"Philippe Thomas, Fabrice Lalloué, Pierre-Marie Preux, et al. 2006. Dementia patients caregivers quality of life: the PIXEL study. International journal of geriatric psychiatry 21, 1: 50--56.","paperID":"None"},{"content":"Matthieu Tixier, Gérald Gaglio, and Myriam Lewkowicz. 2009. Translating social support practices into online services for family caregivers. In Proceedings of the ACM 2009 international conference on Supporting group work (GROUP '09). ACM, NY, NY, USA, 71--80. http://doi.acm.org/10.1145/1531674.1531685","paperID":"None"},{"content":"Matthieu Tixier and Myriam Lewkowicz. 2015. Looking for Respite and Support: Technological Opportunities for Spousal Caregivers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1155--1158. http://dx.doi.org/10.1145/2702123.2702563","paperID":"None"},{"content":"Tarja K. Viitanen. 2007. Informal and formal care in Europe. IZA Discussion Paper No. 2648. Available at SSRN: http://ssrn.com/abstract=970484","paperID":"None"},{"content":"Yi-Chia Wang, Robert Kraut, and John M. Levine. 2012. To stay or leave?: the relationship of emotional and informational support to commitment in online health support groups. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 833842. http://dx.doi.org/10.1145/2145204.2145329","paperID":"None"},{"content":"Marsha White and Steve M. Dorman. 2001. Receiving social support online: Implications for health education. Health Education Research 16, 6: 693-707. http://dx.doi.org/10.1093/her/16.6.693","paperID":"None"},{"content":"Kevin B. Wright. 1999. The communication of social support within an on-line community for older adults: A qualitative analysis of the SeniorNet community. Communication Quarterly 47, 4: 33--43.","paperID":"None"},{"content":"Bo Xie. 2008. Multimodal Computer-Mediated Communication and Social Support among Older Chinese Internet Users. Journal of Computer-Mediated Communication 13, 3: 751--767.","paperID":"None"},{"content":"Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, and Takashi Kudo. 2013. Understanding the conflicting demands of family caregivers caring for depressed family members. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), ACM, NY, 2637--2646. http://dx.doi.org/10.1145/2470654.2481365","paperID":"None"},{"content":"Panayiotis Zaphiris and Rifaht Sarwar. 2006. Trends, similarities, and differences in the usage of teen and senior public online newsgroups. ACM Trans. Comput.-Hum. Interact. 13, 3: 403--422. http://dx.doi.org/10.1145/1183456.1183461","paperID":"None"},{"content":"Chao Zhou, Aurélien Bénel, and Jean-Pierre Cahier. 2010. Beyond Web 2.0... And Beyond the Semantic Web. In From CSCW to Web 2.0: European Developments in Collaborative Design, Dave Randall and Pascal Salembier (eds.). Springer, London, 155171. http://dx.doi.org/10.1007/978--1--84882--965--7_8","paperID":"None"}],"title":"\"Counting on the Group\": Reconciling Online and Offline Social Support among Older Informal Caregivers","filename":"CHI16/p3545","authors":["Matthieu Tixier","Myriam Lewkowicz"],"conference":"CHI '16"}