{"paperId":2858129,"citation":[],"reference":[{"content":"Roger Bakeman. 2005. Recommended effect size statistics for repeated measures designs. Behavior Research Methods 37, 3 (2005), 379--384. DOI: http://dx.doi.org/10.3758/BF03192707","paperID":"None"},{"content":"Patrick Baudisch, Desney Tan, Maxime Collomb, Dan Robbins, Ken Hinckley, Maneesh Agrawala, Shengdong Zhao, and Gonzalo Ramos. 2006. Phosphor: Explaining Transitions in the User Interface Using Afterglow Effects. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, New York, NY, USA, 169--178. DOI:http://dx.doi.org/10.1145/1166253.1166280","paperID":"None"},{"content":"Ofer Bergman, Ruth Beyth-Marom, Rafi Nachmias, Noa Gradovitch, and Steve Whittaker. 2008. Improved Search Engines and Navigation Preference in Personal Information Management. ACM Transactions on Information Systems 26, 4, Article 20 (Oct. 2008), 24 pages. DOI: http://dx.doi.org/10.1145/1402256.1402259","paperID":"None"},{"content":"Anastasia Bezerianos, Pierre Dragicevic, and Ravin Balakrishnan. 2006. Mnemonic Rendering: An Image-based Approach for Exposing Hidden Changes in Dynamic Displays. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, New York, NY, USA, 159--168. DOI: http://dx.doi.org/10.1145/1166253.1166279","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101. DOI: http://dx.doi.org/10.1191/1478088706qp063oa","paperID":"None"},{"content":"Andrea Bunt, Cristina Conati, and Joanna McGrenere. 2007. Supporting Interface Customization Using a Mixed-initiative Approach. In Proceedings of the 12th International Conference on Intelligent User Interfaces (IUI '07). ACM, New York, NY, USA, 92--101. DOI: http://dx.doi.org/10.1145/1216295.1216317","paperID":"None"},{"content":"Parmit K. Chilana, Andrew J. Ko, and Jacob O. Wobbrock. 2012. LemonAid: Selection-based Crowdsourced Contextual Help for Web Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1549--1558. DOI: http://dx.doi.org/10.1145/2207676.2208620","paperID":"None"},{"content":"Matjaz Debevc, Beth Meyer, Dali Donlagic, and Rajko Svecko. 1996. Design and evaluation of an adaptive icon toolbar. User Modeling and User-Adapted Interaction 6, 1 (1996), 1--21. DOI: http://dx.doi.org/10.1007/BF00126652","paperID":"None"},{"content":"Morgan Dixon and James Fogarty. 2010. Prefab: Implementing Advanced Behaviors Using Pixel-based Reverse Engineering of Interface Structure. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1525--1534. DOI: http://dx.doi.org/10.1145/1753326.1753554","paperID":"None"},{"content":"James R. Eagan, Michel Beaudouin-Lafon, and Wendy E. Mackay. 2011. Cracking the Cocoa Nut: User Interface Programming at Runtime. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 225--234. DOI: http://dx.doi.org/10.1145/2047196.2047226","paperID":"None"},{"content":"W. Keith Edwards, Scott E. Hudson, Joshua Marinacci, Roy Rodenstein, Thomas Rodriguez, and Ian Smith. 1997. Systematic Output Modification in a 2D User Interface Toolkit. In Proceedings of the 10th Annual ACM Symposium on User Interface Software and Technology (UIST '97). ACM, New York, NY, USA, 151--158. DOI: http://dx.doi.org/10.1145/263407.263537","paperID":"None"},{"content":"Leah Findlater and Joanna McGrenere. 2008. Impact of Screen Size on Performance, Awareness, and User Satisfaction with Adaptive Graphical User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1247--1256. DOI: http://dx.doi.org/10.1145/1357054.1357249","paperID":"None"},{"content":"Leah Findlater and Joanna McGrenere. 2010. Beyond performance: Feature awareness in personalized interfaces. International Journal of Human-Computer Studies 68, 3 (2010), 121--137. DOI: http://dx.doi.org/10.1016/j.ijhcs.2009.10.002","paperID":"None"},{"content":"Gerhard Fischer. 1993. Adaptive User Interfaces. Elsevier Science Publishers B.V., Chapter Shared Knowledge in Cooperative Problem-Solving Systems - Integrating Adaptive and Adaptable Components, 49-68. http://citeseerx.ist.psu.edu/viewdoc/ summary?doi=10.1.1.310.8392","paperID":"None"},{"content":"Gerhard Fischer and Elisa Giaccardi. 2006. Meta-design: A Framework for the Future of End-User Development. In End User Development, Henry Lieberman, Fabio Paternò, and Volker Wulf (Eds.). Human-Computer Interaction Series, Vol. 9. Springer Netherlands, 427--457. DOI: http://dx.doi.org/10.1007/1-4020-5386-X_19","paperID":"None"},{"content":"Stephen Fitchett, Andy Cockburn, and Carl Gutwin. 2013. Improving Navigation-based File Retrieval. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2329--2338. DOI: http://dx.doi.org/10.1145/2470654.2481323","paperID":"None"},{"content":"G. W. Furnas, T. K. Landauer, L. M. Gomez, and S. T. Dumais. 1987. The Vocabulary Problem in Human-system Communication. Commun. ACM 30, 11 (Nov. 1987), 964--971. DOI: http://dx.doi.org/10.1145/32206.32212","paperID":"None"},{"content":"Alfonso García Frey, Gaëlle Calvary, and Sophie Dupuy-Chessa. 2010. Xplain: An Editor for Building Self-explanatory User Interfaces by Model-driven Engineering. In Proceedings of the 2nd ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '10). ACM, New York, NY, USA, 41--46. DOI:http://dx.doi.org/10.1145/1822018.1822026","paperID":"None"},{"content":"6 Wunderkinder GmbH. 2015. Wunderlist. Version 3.12.3. (2015). http://www.wunderlist.com (Retrieved on 2015-07-01).","paperID":"None"},{"content":"Mona Haraty, Diane Tam, Shathel Haddad, Joanna McGrenere, and Charlotte Tang. 2012. Individual Differences in Personal Task Management: A Field Study in an Academic Setting. In Proceedings of Graphics Interface 2012 (GI '12). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 35--44. http: //dl.acm.org/citation.cfm?id=2305276.2305284","paperID":"None"},{"content":"Eric Horvitz, Jack Breese, David Heckerman, David Hovel, and Koos Rommelse. 1998. The LumièRe Project: Bayesian User Modeling for Inferring the Goals and Needs of Software Users. In Proceedings of the Fourteenth Conference on Uncertainty in Artificial Intelligence (UAI'98). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 256--265. http: //dl.acm.org/citation.cfm?id=2074094.2074124","paperID":"None"},{"content":"J. Johnson, T.L. Roberts, W. Verplank, D.C. Smith, C.H. Irby, M. Beard, and K. Mackey. 1989. The Xerox Star: a retrospective. Computer 22, 9 (Sept 1989), 11--26. DOI: http://dx.doi.org/10.1109/2.35211","paperID":"None"},{"content":"Helge Kahler, Anders Mørch, Oliver Stiemerling, and Volker Wulf. 2000. Tailorable systems and cooperative work. Computer Supported Cooperative Work (CSCW) 9, 1 (2000), 1--4. DOI: http://dx.doi.org/10.1023/A:1017243824820","paperID":"None"},{"content":"Henry Lieberman, Fabio Paternò, Markus Klann, and Volker Wulf. 2006. End-User Development: An Emerging Paradigm. In End User Development, Henry Lieberman, Fabio Paternò, and Volker Wulf (Eds.). Human-Computer Interaction Series, Vol. 9. Springer Netherlands, 1--8. DOI: http://dx.doi.org/10.1007/1-4020-5386-X_1","paperID":"None"},{"content":"Wendy E. Mackay. 1991. Triggers and Barriers to Customizing Software. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '91). ACM, New York, NY, USA, 153--160. DOI: http://dx.doi.org/10.1145/108844.108867","paperID":"None"},{"content":"Thomas W. Malone, Kum-Yew Lai, and Christopher Fry. 1995. Experiments with Oval: A Radically Tailorable Tool for Cooperative Work. ACM Transactions on Information Systems 13, 2 (April 1995), 177--205. DOI: http://dx.doi.org/10.1145/201040.201047","paperID":"None"},{"content":"Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2013. Patina: Dynamic Heatmaps for Visualizing Application Usage. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3227--3236. DOI: http://dx.doi.org/10.1145/2470654.2466442","paperID":"None"},{"content":"Joanna McGrenere, Ronald M. Baecker, and Kellogg S. Booth. 2002. An Evaluation of a Multiple Interface Design Solution for Bloated Software. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, New York, NY, USA, 164--170. DOI: http://dx.doi.org/10.1145/503376.503406","paperID":"None"},{"content":"Xiaojun Meng, Shengdong Zhao, Yongfeng Huang, Zhongyuan Zhang, James Eagan, and Ramanathan Subramanian. 2014. WADE: Simplified GUI Add-on Development for Third-party Software. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2221--2230. DOI: http://dx.doi.org/10.1145/2556288.2557349","paperID":"None"},{"content":"Ben Shneiderman. 2003. Promoting Universal Usability with Multi-layer Interface Design. In Proceedings of the 2003 Conference on Universal Usability (CUU '03). ACM, New York, NY, USA, 1--8. DOI: http://dx.doi.org/10.1145/957205.957206","paperID":"None"},{"content":"Daniel J Simons and Christopher F Chabris. 1999. Gorillas in our midst: Sustained inattentional blindness for dynamic events. Perception-London 28, 9 (1999), 1059--1074.","paperID":"None"},{"content":"Gunnar Stevens and Torben Wiedenhöfer. 2006. CHIC a Pluggable Solution for Community Help in Context. In Proceedings of the 4th Nordic Conference on Human-computer Interaction: Changing Roles (NordiCHI '06). ACM, New York, NY, USA, 212--221. DOI:http://dx.doi.org/10.1145/1182475.1182498","paperID":"None"},{"content":"Wolfgang Stuerzlinger, Olivier Chapuis, Dusty Phillips, and Nicolas Roussel. 2006. User Interface Façades: Towards Fully Adaptable User Interfaces. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, New York, NY, USA, 309--318. DOI: http://dx.doi.org/10.1145/1166253.1166301","paperID":"None"},{"content":"Gaurav Paruthi Tao Dong, Mark S. Ackerman, Mark W. Newman. 2013. Social Overlays: Collectively Making Websites More Usable. Lecture Notes in Computer Science, Vol. 8120. Springer Berlin Heidelberg, Berlin, Heidelberg. DOI: http://dx.doi.org/10.1007/978-3-642-40498-6","paperID":"None"},{"content":"Volker Wulf and Björn Golombek. 2001. Direct activation: A concept to encourage tailoring activities. Behaviour & Information Technology 20, 4 (2001), 249--263. DOI: http://dx.doi.org/10.1080/01449290110048016","paperID":"None"}],"abstract":"The settings panel is the standard customization mechanism used in software applications today, yet it has undergone minimal design improvement since its introduction in the 1980s. Entirely disconnected from the application UI, these panels require users to rely on often-cryptic text labels to identify the settings they want to change. We propose the Anchored Customization approach, which anchors settings to conceptually related elements of the application UI. Our Customization Layer prototype instantiates this approach: users can see which UI elements are customizable, and access their associated settings. We designed three variants of Customization Layer based on multi-layered interfaces, and implemented these variants on top of a popular web application for task management, Wunderlist. Two experiments (Mechanical Turk and face-to-face) with a total of 60 participants showed that the two minimalist variants were 35% faster than Wunderlist's settings panel. Our approach provides significant benefits for users while requiring little extra work from designers and developers of applications.","title":"Anchored Customization: Anchoring Settings to the Application Interface to Afford Customization","filename":"CHI16/p4154","authors":["Antoine Ponsard","Joanna McGrenere"],"conference":"CHI '16"}