{"paperId":2858347,"citation":[],"reference":[{"content":"Agathe Battestini, Vidya Setlur, and Timothy Sohn. 2010. A large scale study of text-messaging use. In Proceedings of the 12th international conference on Human computer interaction with mobile devices and services (MobileHCI '10). ACM, New York, NY, USA, 229--238. http://doi.acm.org/10.1145/1851600.1851638","paperID":"None"},{"content":"Joseph B. Bayer, Nicole Ellison, Sarita Y. Schoenebeck, Emily B. Falk. 2015. Sharing the Small Moments: Ephemeral Social Interaction on Snapchat. Information, Communication & Society. http://dx.doi.org/10.1080/1369118X.2015.1084349","paperID":"None"},{"content":"Karen Church and Rodrigo de Oliveira. 2013. What's up with whatsapp?: comparing mobile instant messaging behaviors with traditional SMS. In Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services (MobileHCI '13). ACM, New York, NY, USA, 352--361. http://doi.acm.org/10.1145/2493190.2493225","paperID":"None"},{"content":"https://cordova.apache.org","paperID":"None"},{"content":"Xristine Faulkner and Fintan Culwin. 2005. When fingers do the talking: a study of text messaging.Interact. Comput. 17, 2 (March 2005), 167185. http://dx.doi.org/10.1016/j.intcom.2004.11.002","paperID":"None"},{"content":"Rebecca E. Grinter and Margery A. Eldridge. 2001. y do tngrs luv 2 txt msg?. In Proceedings of the seventh conference on European Conference on Computer Supported Cooperative Work (ECSCW'01), Wolfgang Prinz, Matthias Jarke, Yvonne Rogers, Kjeld Schmidt, and Volker Wulf (Eds.). Kluwer Academic Publishers, Norwell, MA, USA, 219--238.","paperID":"None"},{"content":"Rebecca Grinter and Margery Eldridge. 2003. Wan2tlk?: everyday text messaging. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 441--448. http://doi.acm.org/10.1145/642611.642688","paperID":"None"},{"content":"Rebecca E. Grinter, Leysia Palen, and Margery Eldridge. 2006. Chatting with teenagers: Considering the place of chat technologies in teen life. ACM Trans. Comput.-Hum. Interact. 13, 4 (December 2006), 423447. http://doi.acm.org/10.1145/1188816.1188817","paperID":"None"},{"content":"Kenton P. O'Hara, Michael Massimi, Richard Harper, Simon Rubens, and Jessica Morris. 2014. Everyday dwelling with WhatsApp. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 1131--1143. http://doi.acm.org/10.1145/2531602.2531679","paperID":"None"},{"content":"http://ionicframework.com/"},{"content":"James Pierce and Eric Paulos. 2014. Counterfunctional things: exploring possibilities in designing digital limitations. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, New York, NY, USA, 375--384. http://doi.acm.org/10.1145/2598510.2598522","paperID":"None"},{"content":"Ling, Rich. The mobile connection: The cell phone's impact on society. Morgan Kaufmann, 2004.","paperID":"None"},{"content":"Alex S. Taylor and Richard Harper. 2002. Age-old practices in the 'new world': a study of gift-giving between teenage mobile phone users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, New York, NY, USA, 439--446. http://doi.acm.org/10.1145/503376.503455","paperID":"None"},{"content":"David R. Thomas. 2006. A general inductive approach for analyzing qualitative evaluation data. American journal of evaluation, 27(2), pp.237--246.","paperID":"None"}],"abstract":"Text messaging has long been a popular activity, and today smartphone apps enable users to choose from a plethora of mobile messaging applications. While we know a lot about SMS practices, we know less about practices of messaging applications. In this paper, we take a first step to explore one ubiquitous aspect of mobile messaging -- messaging history. We designed, built, and trialled a mobile messaging application without history named forget-me-not. The two-week trial showed that history-less messaging no longer supports chit-chat as seen in e.g. WhatsApp, but is still considered conversational and more 'engaging'. Participants expressed being lenient and relaxed about what they wrote. Removing the history allowed us to gain insights into what uses history has in other mobile messaging applications, such as planning events, allowing for distractions, and maintaining multiple conversation threads.","title":"Forget-me-not: History-less Mobile Messaging","filename":"CHI16/p1904","authors":["Mattias Rost","Christos Kitsos","Alexander Morgan","Martin Podlubny","Pietro Romeo","Edoardo Russo","Matthew Chalmers"],"conference":"CHI '16"}