{"paperId":2858508,"citation":[],"reference":[{"content":"Tawfiq Ammari and Sarita Schoenebeck. 2015. Networked Empowerment on Facebook Groups for Parents of Children with Special Needs. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2805--2814.","paperID":"None"},{"content":"Rosa I. Arriaga, Andrew D. Miller, Elizabeth D. Mynatt, Claudia Pagliari and Erika Shehan Poole. 2013. Theory vs. design-driven approaches for behavior change research. CHI '13 Extended Abstracts on Human Factors in Computing Systems, 2455--2458.","paperID":"None"},{"content":"Albert Bandura. 1986. Social foundations of thought and action: A social cognitive theory. Prentice-Hall, Inc, 1986.","paperID":"None"},{"content":"Julie Barlow, Chris Wright, Janice Sheasby, Andy Turner and Jenny Hainsworth. 2002. Self-management approaches for people with chronic conditions: a review. Patient education and counseling, 48, 2: 177--187.","paperID":"None"},{"content":"Marshall H Becker. 1974. The health belief model and personal health behavior. Slack, 1974.","paperID":"None"},{"content":"Bryony A Beresford and Patricia Sloper. 2003. Chronically ill adolescents' experiences of communicating with doctors: a qualitative study. Journal of Adolescent Health, 33, 3: 172--179.","paperID":"None"},{"content":"Patricia Flatley Brennan, Stephen Downs and Gail Casper. 2010. Project Health Design: rethinking the power and potential of personal health records. Journal of biomedical informatics, 43, 5: S3-S5.","paperID":"None"},{"content":"JB Brown, W Wayne Weston and Moira Stewart. 1995. The first component: exploring both the disease and the illness experience. Patient-centered Medicine Transforming the Clinical Method, 23--52.","paperID":"None"},{"content":"Yunan Chen. 2011. Health information use in chronic care cycles. Proceedings of the ACM 2011 conference on Computer supported cooperative work, 485--488.","paperID":"None"},{"content":"Yunan Chen, Victor Ngo and Sun Young Park. 2013. Caring for caregivers: designing for integrality. Proceedings of the 2013 conference on Computer supported cooperative work, 91--102.","paperID":"None"},{"content":"Chihwen Cheng, Clark Brown, Tamara New, Todd H Stokes, Carlton Dampier and May D Wang. 2012. SickleREMOTE: A two-way text messaging system for pediatric sickle cell disease patients. Biomedical and Health Informatics (BHI), 2012 IEEE-EMBS International Conference on, 408--411.","paperID":"None"},{"content":"Robert B Cialdini. 2001. The Science of Persuasion. Scientific American, 284, 2: 76.","paperID":"None"},{"content":"Sunny Consolvo, et al. 2008. Flowers or a robot army?: encouraging awareness & activity with personal, mobile displays. Proceedings of the 10th international conference on Ubiquitous computing, 54--63.","paperID":"None"},{"content":"Sunny Consolvo, David W. McDonald and James A. Landay. 2009. Theory-driven design strategies for technologies that support behavior change in everyday life. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 405--414.","paperID":"None"},{"content":"Juliet Corbin and Anselm Strauss. 1985. Managing chronic illness at home: three lines of work. Qualitative sociology, 8, 3: 224--247.","paperID":"None"},{"content":"Juliet M Corbin and Anselm Strauss. 1988. Unending work and care: Managing chronic illness at home. JosseyBass, 1988.","paperID":"None"},{"content":"Rodrigo De Oliveira, Mauro Cherubini and Nuria Oliver. 2010. MoviPill: improving medication compliance for elders using a mobile persuasive social game. Proceedings of the 12th ACM international conference on Ubiquitous computing, 251--260.","paperID":"None"},{"content":"Christine Eiser and Rachel Morse. 2001. Can parents rate their child's health-related quality of life? Results of a systematic review. Quality of Life Research, 10, 4: 347--357.","paperID":"None"},{"content":"Shelly Farnham, et al. 2002. HutchWorld: clinical study of computer-mediated social support for cancer patients and their caregivers. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 375--382.","paperID":"None"},{"content":"Jennifer Fereday and Eimear Muir-Cochrane. 2008. Demonstrating rigor using thematic analysis: A hybrid approach of inductive and deductive coding and theme development. International journal of qualitative methods, 5, 1: 80--92.","paperID":"None"},{"content":"Leon Festinger. 1954. A theory of social comparison processes. Human relations, 7, 2: 117--140.","paperID":"None"},{"content":"Chris Feudtner, Ross M Hays, Gerri Haynes, J Russell Geyer, John M Neff and Thomas D Koepsell. 2001. Deaths attributed to pediatric complex chronic conditions: national trends and implications for supportive care services. Pediatrics, 107, 6: e99-e99.","paperID":"None"},{"content":"Sarah Ford, Lesley Fallowfield and Shôn Lewis. 1996. Doctor-patient interactions in oncology. Social science & medicine, 42, 11: 1511--1519.","paperID":"None"},{"content":"Andrea Grimes, Vasudhara Kantroo and Rebecca E. Grinter. 2010. Let's play!: mobile health games for adults. Proceedings of the 12th ACM international conference on Ubiquitous computing, 241--250.","paperID":"None"},{"content":"Andrea L Hartzler, Jason P Izard, Bruce L Dalkin, Sean P Mikles and John L Gore. 2015. Design and feasibility of integrating personalized PRO dashboards into prostate cancer care. Journal of the American Medical Informatics Associationocv101.","paperID":"None"},{"content":"Gillian R Hayes, Gregory D Abowd, John S Davis, Marion L Blount, Maria Ebling and Elizabeth D Mynatt. 2008. Opportunities for pervasive computing in chronic cancer care. Springer, 2008.","paperID":"None"},{"content":"Eric B. Hekler, Predrag Klasnja, Jon E. Froehlich and Matthew P. Buman. 2013. Mind the theoretical gap: interpreting, using, and developing behavioral theory in HCI research. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3307--3316.","paperID":"None"},{"content":"Judith H Hibbard. 2004. Moving toward a more patient-centered health care delivery system. HEALTH AFFAIRSMILLWOOD VA THEN BETHESDA MA-, 23VAR-133.","paperID":"None"},{"content":"Deanna M Hoelscher, Alexandra Evans, Guys Parcel and Steven H Kelder. 2002. Designing effective nutrition interventions for adolescents. Journal of the American Dietetic Association, 102, 3: S52-S63.","paperID":"None"},{"content":"Gary Hsieh, Sean A. Munson, Maurits C. Kaptein, Harri Oinas-Kukkonen and Oded Nov. 2014. Personalizing behavior change technologies. CHI '14 Extended Abstracts on Human Factors in Computing Systems (107--110). 10.1145/2559206.2560474","paperID":"None"},{"content":"Jina Huh and Mark S. Ackerman. 2012. Collaborative Help in Chronic Disease Management: Supporting Individualized Problems. Computer-Supported Cooperative Work (CSCW), 853--862.","paperID":"None"},{"content":"Maia L Jacobs, James Clawson and Elizabeth D Mynatt. 2014. My journey compass: a preliminary investigation of a mobile tool for cancer patients. Proceedings of the 32nd annual ACM Conference on Human Factors in Computing Systems (CHI '14), 663--672.","paperID":"None"},{"content":"Elizabeth Kaziunas, Ayse G Buyuktur, Jasmine Jones, Sung W Choi, David A Hanauer and Mark S Ackerman. 2015. Transition and Reflection in the Use of Health Information: The Case of Pediatric Bone Marrow Transplant Caregivers. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 1763--1774.","paperID":"None"},{"content":"Julie A Kientz. 2010. Understanding parent-pediatrician interactions for the design of health technologies. Proceedings of the 1st ACM International Health Informatics Symposium, 230--239.","paperID":"None"},{"content":"Matthew L Lee and Anind K Dey. 2014. Real-time feedback for improving medication taking. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2259--2268.","paperID":"None"},{"content":"Leslie S Liu, et al. 2011. Improving communication and social support for caregivers of high-risk infants through mobile technologies. Proceedings of the ACM 2011 conference on Computer supported cooperative work, 475484.","paperID":"None"},{"content":"Leslie S Liu, Patrick C Shih and Gillian R Hayes. 2011. Barriers to the adoption and use of personal health record systems. Proceedings of the 2011 iConference, 363--370.","paperID":"None"},{"content":"Leslie S Liu, Kori M Inkpen and Wanda Pratt. 2015. I'm Not Like My Friends: Understanding How Children with a Chronic Illness Use Technology to Maintain Normalcy. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1527--1539.","paperID":"None"},{"content":"Yves Longtin, Hugo Sax, Lucian L. Leape, Susan E. Sheridan, Liam Donaldson and Didier Pittet. 2010. Patient Participation: Current Knowledge and Applicability to Patient Safety. Mayo Clinic Proceedings, 85, 1: 53--62.","paperID":"None"},{"content":"Kate R Lorig and Halsted R Holman. 2003. Self-management education: history, definition, outcomes, and mechanisms. Annals of behavioral medicine, 26, 1: 1--7.","paperID":"None"},{"content":"Haley MacLeod, Kim Oakes, Danika Geisler, Kay Connelly and Katie Siek. 2015. Rare World: Towards Technology for Rare Diseases. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15).","paperID":"None"},{"content":"Andrew Macvean and Judy Robertson. 2013. Understanding exergame users' physical activity, motivation and behavior over time. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1251--1260.","paperID":"None"},{"content":"Lena Mamykina, Elizabeth D Mynatt and David R Kaufman. 2006. Investigating health management practices of individuals with diabetes. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 927--936.","paperID":"None"},{"content":"Lena Mamykina, Elizabeth Mynatt, Patricia Davidson and Daniel Greenblatt. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 477--486.","paperID":"None"},{"content":"Andrew D Miller, Jessica Pater and Elizabeth D Mynatt. 2013. Design strategies for youth-focused pervasive social health games. Pervasive Computing Technologies for Healthcare (Pervasive Health), 2013 7th International Conference on, 9--16.","paperID":"None"},{"content":"Andrew D Miller. 2014. Social tools for everyday adolescent health.","paperID":"None"},{"content":"Andrew D Miller and Elizabeth D Mynatt. 2014. StepStream: a school-based pervasive social fitness system for everyday adolescent health. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2823--2832.","paperID":"None"},{"content":"Jake M Najman, et al. 2001. Bias influencing maternal reports of child behaviour and emotional state. Social psychiatry and psychiatric epidemiology, 36, 4: 186--194.","paperID":"None"},{"content":"World Health Organization. 2014. Report: Health for the World's Adolescents. Retrieved May 15, 2015 from http://apps.who.int/adolescent/seconddecade/section1/page2/reasons-for-growing-attention.html","paperID":"None"},{"content":"Donald P Orr, Sarah P Weiser, Donald A Dian and Cheryl A Maurana. 1987. Adolescent health care: perceptions and needs of the practicing physician. Journal of Adolescent Health Care, 8, 3: 239--245.","paperID":"None"},{"content":"Tina Park, Peter Chira, Kimberly Miller and Lisa Nugent. 2015. Living Profiles: an example of user-centered design in developing a teen-oriented personal health record. Personal and Ubiquitous Computing, 19, 1: 69--77.","paperID":"None"},{"content":"Rupa A Patel, Predrag Klasnja, Andrea Hartzler, Kenton T Unruh and Wanda Pratt. 2012. Probing the benefits of real-time tracking during cancer care. American Medical Informatics Association, 2012.","paperID":"None"},{"content":"Rupa A Patel, Andrea Hartzler, Wanda Pratt, Anthony Back, Mary Czerwinski and Asta Roseway. 2013. Visual feedback on nonverbal communication: a design exploration with healthcare professionals. Proceedings of the 7th International Conference on Pervasive Computing Technologies for Healthcare, 105--112.","paperID":"None"},{"content":"American Academy of Pediatrics, American Academy of Family Physicians and American College of Physicians American Society of Internal Medicine. 2002. A consensus statement on health care transitions for young adults with special health care needs. Pediatrics, 110, Supplement 3: 1304--1306.","paperID":"None"},{"content":"Tamara Peyton and Erika Poole. 2013. \"My Mobile Health, My Mobile Life\": methods for designing health interventions with adolescents. CHI '13 Extended Abstracts on Human Factors in Computing Systems, 481--486.","paperID":"None"},{"content":"Erika Shehan Poole, Andrew D Miller, Yan Xu, Elsa Eiriksdottir, Richard Catrambone and Elizabeth D Mynatt. 2011. The place for ubiquitous computing in schools: lessons learned from a school-based intervention for youth physical activity. Proceedings of the 13th Int'l Conference on Ubiquitous Computing (Ubicomp '11), 395--404.","paperID":"None"},{"content":"Center for Disease Control and Prevention. 2013. Chronic Disease Indicators. Retrieved May 15, 2015 from https://chronicdata.cdc.gov/health-area/chronic-diseaseindicators","paperID":"None"},{"content":"James O Prochaska, Wayne F Velicer, Carlo C DiClemente and Joseph Fava. 1988. Measuring processes of change: applications to the cessation of smoking. Journal of consulting and clinical psychology, 56, 4: 520.","paperID":"None"},{"content":"John G Reiss, Robert W Gibson and Leslie R Walker. 2005. Health care transition: youth, family, and provider perspectives. Pediatrics, 115, 1: 112--120.","paperID":"None"},{"content":"David S Rosen. 1993. Transition to adult health care for adolescents and young adults with cancer.","paperID":"None"},{"content":"Polly Ryan and Kathleen J Sawin. 2009. The individual and family self-management theory: Background and perspectives on context, process, and outcomes. Nursing outlook, 57, 4: 217--225. e216.","paperID":"None"},{"content":"Susan M Sawyer, Sarah Drew, Michele S Yeo and Maria T Britto. 2007. Adolescents with a chronic condition: challenges living, challenges treating. The Lancet, 369, 9571: 1481--1489.","paperID":"None"},{"content":"Dena Schulman-Green, et al. 2012. Processes of Self-Management in Chronic Illness. Journal of Nursing Scholarship, 44, 2: 136--144.","paperID":"None"},{"content":"U.S. Department of Health and Human Services. Office of Adolescent Health: Chronic Conditions. Retrieved May 15, 2015 from http://www.hhs.gov/ash/oah/adolescenthealth-topics/physical-health-and-nutrition/chronicconditions.html","paperID":"None"},{"content":"Kiek Tates and Ludwien Meeuwesen. 2001. Doctor- parent-child communication. A (re) view of the literature. Social science & medicine, 52, 6: 839--851.","paperID":"None"},{"content":"NCM Theunissen, et al. 1998. The proxy problem: child report versus parent report in health-related quality of life research. Quality of Life Research, 7, 5: 387--397.","paperID":"None"},{"content":"Matthieu Tixier and Myriam Lewkowicz. 2015. Looking for Respite and Support: Technological Opportunities for Spousal Caregivers. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1155--1158.","paperID":"None"},{"content":"Tammy Toscos, Anne Faber, Shunying An and Mona Praful Gandhi. 2006. Chick clique: persuasive technology to motivate teenage girls to exercise. CHI'06 extended abstracts on Human factors in computing systems, 18731878.","paperID":"None"},{"content":"Sarah J Tracy. 2010. Qualitative quality: Eight \"bigtent\" criteria for excellent qualitative research. Qualitative inquiry, 16, 10: 837--851.","paperID":"None"},{"content":"FC Veit, Lena A Sanci, CM Coffey, DY Young and Glenn Bowes. 1996. Barriers to effective primary health care for adolescents. The Medical Journal of Australia, 165, 3: 131--133.","paperID":"None"},{"content":"Pontus Wärnestål, Petra Svedberg and Jens Nygren. 2014. Co-constructing child personas for health-promoting services with vulnerable children. Proceedings of the 32nd annual ACM Conference on Human factors in Computing Systems (CHI '14), 3767--3776.","paperID":"None"},{"content":"Ellen Wartella, Vicky Rideout, Heather Zupancic, Leanne Beaudoin-Ryan and Alexis Lauricella. 2015. Teens, Health, and Technology. A National Survey. Center on Media and Human Development, School of Communication, Northwestern University.","paperID":"None"},{"content":"Nadir Weibel, Colleen Emmenegger, Jennifer Lyons, Ram Dixit, Linda L Hill and James D Hollan. 2013. Interpreter-mediated physician-patient communication: Opportunities for multimodal healthcare interfaces. Proceedings of the 7th International Conference on Pervasive Computing Technologies for Healthcare, 113120.","paperID":"None"},{"content":"Lauren Wilcox, Dan Morris, Desney Tan and Justin Gatewood. 2010. Designing Patient-Centric Information Displays for Hospitals. CHI '10: Proceedings of the 28th International Conference on Human factors in Computing Systems, 2123--2132.","paperID":"None"},{"content":"Yan Xu, et al. 2012. This is not a one-horse race: understanding player types in multiplayer pervasive health games for youth. Proceedings of the ACM 2012 Conference on Computer-Supported Cooperative Work (CSCW '12), 843--852.","paperID":"None"},{"content":"Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata and Takashi Kudo. 2013. Understanding the conflicting demands of family caregivers caring for depressed family members. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2637--2646.","paperID":"None"},{"content":"Svetlana Yarosh. 2013. Shifting dynamics or breaking sacred traditions?: the role of technology in twelve-step fellowships. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3413--3422.","paperID":"None"},{"content":"Tae-Jung Yun and Rosa I Arriaga. 2013. A text message a day keeps the pulmonologist away. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1769--1778.","paperID":"None"},{"content":"Brad J Zebrack, et al. 2002. Psychological outcomes in long-term survivors of childhood leukemia, Hodgkin's disease, and non-Hodgkin's lymphoma: a report from the Childhood Cancer Survivor Study. Pediatrics, 110, 1: 4252.","paperID":"None"},{"content":"Marieke Zwaanswijk, et al. 2011. Communicating with child patients in pediatric oncology consultations: a vignette study on child patients', parents', and survivors' communication preferences. Psycho-Oncology, 20, 3: 269--277.","paperID":"None"}],"abstract":"Adolescents with complex chronic illnesses, such as cancer and blood disorders, must partner with family and clinical caregivers to navigate risky procedures with life-altering implications, burdensome symptoms and lifelong treatments. Yet, there has been little investigation into how technology can support these partnerships. We conducted 38 in-depth interviews (15 with teenage adolescents with chronic forms of cancer and blood disorders, 15 with their parents, and eight with clinical caregivers) along with nine non-participant observations of clinical consultations, to better understand common challenges and needs that could be supported through design. Participants faced challenges primarily concerning: 1) teens' limited participation in their care, 2) communicating emotionally-sensitive information, and 3) managing physical and emotional responses. We draw on these findings to propose design goals for sociotechnical systems to support teens in partnering in their care, highlighting the need for design to support gradually-evolving partnerships.","title":"Care Partnerships: Toward Technology to Support Teens' Participation in Their Health Care","filename":"CHI16/p5337","authors":["Matthew K. Hong","Lauren Wilcox","Daniel Machado","Thomas A. Olson","Stephen F. Simoneaux"],"conference":"CHI '16"}