{"paperId":2858133,"citation":[],"reference":[{"content":"Daniel Afergan, Evan M. Peck, Erin T. Solovey, Andrew Jenkins, Samuel W. Hincks, Eli T. Brown, Remco Chang, and Robert JK Jacob. 2014. Dynamic difficulty using brain metrics of workload. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3797--3806.","paperID":"None"},{"content":"Matthias Böhmer and Antonio Krüger. 2013. A study on icon arrangement by smartphone users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2137--2146.","paperID":"None"},{"content":"Andreas Bulling and Thorsten O. Zander. 2014. Cognition-aware computing. Pervasive Computing, IEEE 13, 3 (2014), 80--83.","paperID":"None"},{"content":"Ivan Burmistrov, Tatiana Zlokazova, Anna Izmalkova, and Anna Leonova. 2015. Flat Design vs Traditional Design: Comparative Experimental Study. In Human-Computer Interaction-INTERACT 2015. Springer, 106--114.","paperID":"None"},{"content":"Chia-Ju Chou, Hsu-Wen Huang, Chia-Lin Lee, and Chia-Ying Lee. 2014. Effects of semantic constraint and cloze probability on Chinese classifier-noun agreement. Journal of Neurolinguistics 31 (2014), 42--54.","paperID":"None"},{"content":"Thomas Davies and Ashweeni Beeharee. 2012. The case of the missed icon: change blindness on mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1451--1460.","paperID":"None"},{"content":"Nicola Dell, Vidya Vaidyanathan, Indrani Medhi, Edward Cutrell, and William Thies. 2012. Yours is better!: participant response bias in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1321--1330.","paperID":"None"},{"content":"Jonathan R. Folstein and Cyma Van Petten. 2008. Influence of cognitive control and mismatch on the N2 component of the ERP: a review. Psychophysiology 45, 1 (2008), 152--170.","paperID":"None"},{"content":"Sabela Fondevila, Manuel Martín-Loeches, Laura Jiménez-Ortega, Pilar Casado, Alejandra Sel, Anabel Fernández-Hernández, and Werner Sommer. 2012. The sacred and the absurd-an electrophysiological study of counterintuitive ideas (at sentence level). Social neuroscience 7, 5 (2012), 445--457.","paperID":"None"},{"content":"Sharon G. Goto, Yumi Ando, Carol Huang, Alicia Yee, and Richard S. Lewis. 2010. Cultural differences in the visual processing of meaning: Detecting incongruities between background and foreground objects using the N400. Social cognitive and affective neuroscience 5, 2--3 (2010), 242--253.","paperID":"None"},{"content":"Sharon G. Goto, Alicia Yee, Kelly Lowenberg, and Richard S. Lewis. 2013. Cultural differences in sensitivity to social context: Detecting affective incongruity using the N400. Social neuroscience 8, 1 (2013), 63--74.","paperID":"None"},{"content":"Chris Harrison, Gary Hsieh, Karl DD. Willis, Jodi Forlizzi, and Scott E. Hudson. 2011. Kineticons: using iconographic motion in graphical user interface design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1999--2008.","paperID":"None"},{"content":"Cornelia Herbert, Beate M. Herbert, Thomas Ethofer, and Paul Pauli. 2011. His or mine? The time course of self-other discrimination in emotion processing. Social neuroscience 6, 3 (2011), 277--288.","paperID":"None"},{"content":"Sheng-Cheng Huang, Randolph G Bias, and David Schnyer. 2015. How are icons processed by the brain? Neuroimaging measures of four types of visual stimuli used in information systems. Journal of the Association for Information Science and Technology 66, 4 (2015), 702--720.","paperID":"None"},{"content":"Glyn W. Humphreys, Cathy J. Price, and M. Jane Riddoch. 1999. From objects to names: A cognitive neuroscience approach. Psychological research 62, 2--3 (1999), 118--130.","paperID":"None"},{"content":"Sarah J. Isherwood, Siné JP McDougall, and Martin B. Curry. 2007. Icon identification in context: The changing role of icon characteristics with user experience. Human Factors: The Journal of the Human Factors and Ergonomics Society 49, 3 (2007), 465--476.","paperID":"None"},{"content":"Robert JK Jacob. 2015. Phylter: A System for Modulating Notifications in Wearables Using Physiological Sensing. In Foundations of Augmented Cognition: 9th International Conference, AC 2015, Held as Part of HCI International 2015, Los Angeles, CA, USA, August 2-7, 2015, Proceedings, Vol. 9183. Springer, 167.","paperID":"None"},{"content":"Marta Kutas and Kara D Federmeier. 2011. Thirty years and counting: Finding meaning in the N400 component of the event related brain potential (ERP). Annual review of psychology 62 (2011), 621.","paperID":"None"},{"content":"Yi-Chieh Lee, Wen-Chieh Lin, Jung-Tai King, Li-Wei Ko, Yu-Ting Huang, and Fu-Yin Cherng. 2014. An EEG-based approach for evaluating audio notifications under ambient sounds. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3817--3826.","paperID":"None"},{"content":"Rock Leung. 2009. Improving the learnability of mobile device applications for older adults. In CHI'09 Extended Abstracts on Human Factors in Computing Systems. ACM, 3125--3128.","paperID":"None"},{"content":"Rock Leung, Joanna McGrenere, and Peter Graf. 2011. Age-related differences in the initial usability of mobile device icons. Behaviour & Information Technology 30, 5 (2011), 629--642.","paperID":"None"},{"content":"Yan-Peng Lim and Peter Charles Woods. 2010. Experimental Color in Computer Icons. In Visual Information Communication. Springer, 149--158.","paperID":"None"},{"content":"Qingguo Ma, Xiaoyi Wang, Shenyi Dai, and Liangchao Shu. 2007. Event-related potential N270 correlates of brand extension. Neuroreport 18, 10 (2007), 1031--1034.","paperID":"None"},{"content":"Scott Makeig, Tzyy-Ping Jung, Dara G. Ghahremani, and Terrence J. Sejnowski. 1996. Independent component analysis of simulated ERP data. Institute for Neural Computation, University of California: technical report INC-9606 (1996).","paperID":"None"},{"content":"Sié McDougall and Sarah Isherwood. 2009. Whats in a name? The role of graphics, functions, and their interrelationships in icon identification. Behavior research methods 41, 2 (2009), 325--336.","paperID":"None"},{"content":"Siné JP Mcdougall, Martin B. Curry, and Oscar de Bruijn. 1999. Measuring symbol and icon characteristics: Norms for concreteness, complexity, meaningfulness, familiarity, and semantic distance for 239 symbols. Behavior Research Methods, Instruments, & Computers 31, 3 (1999), 487--519.","paperID":"None"},{"content":"Ranjana K. Mehta and Raja Parasuraman. 2013. Neuroergonomics: a review of applications to physical and cognitive work. Frontiers in human neuroscience 7 (2013).","paperID":"None"},{"content":"Yang-Kun Ou and Yung-Ching Liu. 2012. Effects of sign design features and training on comprehension of traffic signs in Taiwanese and Vietnamese user groups. International Journal of Industrial Ergonomics 42, 1 (2012), 1--7.","paperID":"None"},{"content":"Evan M. Palmer, Christopher M. Brown, Carolina F. Bates, Philip J. Kellman, and Timothy C. Clausner. 2009. Perceptual cues and imagined viewpoints modulate visual search in air traffic control displays. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 53. Sage Publications, 1111--1115.","paperID":"None"},{"content":"Evan M. M. Peck, Beste F. Yuksel, Alvitta Ottley, Robert JK Jacob, and Remco Chang. 2013. Using fNIRS brain sensing to evaluate information visualization interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 473--482.","paperID":"None"},{"content":"Matthew F. Pike, Horia A. Maior, Martin Porcheron, Sarah C. Sharples, and Max L. Wilson. 2014. Measuring the effect of think aloud protocols on workload using fNIRS. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3807--3816.","paperID":"None"},{"content":"John Polich. 2007. Updating P300: an integrative theory of P3a and P3b. Clinical neurophysiology 118, 10 (2007), 2128--2148.","paperID":"None"},{"content":"Kerem Rızvanoglu and Ozgurol Ozturk. 2009. Cross-Cultural Understanding of the Dual Structure of Metaphorical Icons: An Explorative Study with French and Turkish Users on an E-Learning Site. In Internationalization, Design and Global Development. Springer Berlin Heidelberg, 89--98.","paperID":"None"},{"content":"M. Yerkes Robert and D. John. 1908. The relation of strength of stimulus to rapidity of habit-formation. Journal of comparative neurology and psychology 18 (1908), 459--482.","paperID":"None"},{"content":"Vidya Setlur, Conrad Albrecht-Buehler, Amy A. Gooch, Sam Rossoff, and Bruce Gooch. 2005. Semanticons: Visual metaphors as file icons. In Computer Graphics Forum, Vol. 24. 647--656.","paperID":"None"},{"content":"Vidya Setlur and Jock D. Mackinlay. 2014. Automatic generation of semantic icon encodings for visualizations. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. 541--550.","paperID":"None"},{"content":"Brian A. Taylor, Daniel M. Roberts, and Carryl L. Baldwin. 2011. The Role of Age-Related Neural Timing Variability in Speech Processing. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 55. SAGE Publications, 162--166.","paperID":"None"},{"content":"Chi Vi and Sriram Subramanian. 2012. Detecting error-related negativity for interaction design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 493--502.","paperID":"None"},{"content":"Chi Thanh Vi, Izdihar Jamil, David Coyle, and Sriram Subramanian. 2014. Error related negativity in observing interactive tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3787--3796.","paperID":"None"},{"content":"Yuping Wang, Jian Kong, Xiaofu Tang, Ding Zhuang, and Shunwei Li. 2000. Event-related potential N270 is elicited by mental conflict processing in human brain. Neuroscience letters 293, 1 (2000), 17--20.","paperID":"None"},{"content":"Jamie Ward. 2015. The student's guide to cognitive neuroscience. Psychology Press.","paperID":"None"},{"content":"David Warnock, Marilyn McGee-Lennon, and Stephen Brewster. 2013. Multiple notification modalities and older users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1091--1094.","paperID":"None"},{"content":"Ying Choon Wu and Seana Coulson. 2007. Iconic gestures prime related concepts: An ERP study. Psychonomic Bulletin & Review 14, 1 (2007), 57--63.","paperID":"None"},{"content":"Yun-Ying Yeh, Der-Song Lee, and Ya-Hsien Ko. 2013. Color combination and exposure time on legibility and EEG response of icon presented on visual display terminal. Displays 34, 1 (2013), 33--38.","paperID":"None"},{"content":"Yen Na Yum, Phillip J Holcomb, and Jonathan Grainger. 2011. Words and pictures: An electrophysiological investigation of domain specific processing in native Chinese and English speakers. Neuropsychologia 49, 7 (2011), 1910--1922.","paperID":"None"},{"content":"Thorsten O. Zander, Christian Kothe, Sabine Jatzev, and Matti Gaertner. 2010. Enhancing human-computer interaction with input from active and passive brain-computer interfaces. In Brain-computer interfaces. Springer, 181--199.","paperID":"None"}],"abstract":"Graphic icons play an increasingly important role in interface design due to the proliferation of digital devices in recent years. Their ability to express information in a universal fashion allows us to immediately interact with new applications, systems, and devices. Icons can, however, cause user confusion and frustration if designed poorly. Several studies have evaluated icons using behavioral-performance metrics such as reaction time as well as self-report methods. However, determining the usability of icons based on behavioral measures alone is not straightforward, because users' interpretations of the meaning of icons involve various cognitive processes and perceptual mechanisms. Moreover, these perceptual mechanisms are affected not only by the icons themselves, but by usage scenarios. Thus, we need a means of sensitively and continuously measuring users' different cognitive processes when they are interacting with icons. In this study, we propose an EEG-based approach to icon evaluation, in which users' EEG signals are measured in multiple usage scenarios. Based on a combination of EEG and behavioral results, we provide a novel interpretation of the participants' perception during these tasks, and identify some important implications for icon design.","title":"An EEG-based Approach for Evaluating Graphic Icons from the Perspective of Semantic Distance","filename":"CHI16/p4378","authors":["Fu-Yin Cherng","Wen-Chieh Lin","Jung-Tai King","Yi-Chen Lee"],"conference":"CHI '16"}