{"paperId":2858518,"citation":[],"abstract":"This paper presents findings from a co-design project that aims to augment the practices of professional energy advisors with environmental data from sensors deployed in clients' homes. Premised on prior ethnographic observations we prototyped a sensor platform to support the work of tailoring advice-giving to particular homes. We report on the deployment process and the findings to emerge, particularly the work involved in making sense of or accounting for the data in the course of advice-giving. Our ethnomethodological analysis focuses on the ways in which data is drawn upon as a resource in the home visit, and how understanding and advice-giving turns upon unpacking the indexical relationship of the data to the situated goings-on in the home. This insight, coupled with further design workshops with the advisors, shaped requirements for an interactive system that makes the sensor data available for visual inspection and annotation to support the situated sense-making that is key to giving energy advice.","reference":[{"content":"Graham Button and Richard Harper. 1995. The Relevance of \"Work-practice\" for Design. Comput. Supported Coop. Work 4, 4: 263-280. http://doi.org/10.1007/BF00749172","paperID":"None"},{"content":"Marshini Chetty, Richard Banks, Richard Harper, et al. 2010. Who's hogging the bandwidth: the consequences of revealing the invisible in the home. Proceedings of the 28th international conference on Human factors in computing systems CHI '10, ACM Press, 659-668. http://doi.org/10.1145/1753326.1753423","paperID":"None"},{"content":"Enrico Costanza, Sarvapali D. Ramchurn, and Nicholas R. Jennings. 2012. Understanding domestic energy consumption through interactive visualisation. Proceedings of the 2012 ACM Conference on Ubiquitous Computing - UbiComp '12, ACM Press, 216-225. http://dl.acm.org/citation.cfm?id=2370216.2370251","paperID":"None"},{"content":"Andrew Crabtree, Tom Rodden, Peter Tolmie, and Graham Button. 2009. Ethnography Considered Harmful. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 879-888. http://doi.org/10.1145/1518701.1518835","paperID":"None"},{"content":"Andrew Crabtree, Mark Rouncefield, and Peter Tolmie. 2012. Doing Design Ethnography. Springer, London, UK.","paperID":"None"},{"content":"Christopher A. Le Dantec and W. Keith Edwards. 2008. The view from the trenches: organization, power, and technology at two nonprofit homeless outreach centers. Proceedings of the ACM 2008 conference on Computer supported cooperative work CSCW '08, ACM Press, 589-598. http://dl.acm.org/citation.cfm?id=1460563.1460656","paperID":"None"},{"content":"Christopher A. Le Dantec and W. Keith Edwards. 2010. Across boundaries of influence and accountability: the multiple scales of public sector information systems. Proceedings of the 28th international conference on Human factors in computing systems CHI '10, ACM Press, 113-122. http://dl.acm.org/citation.cfm?id=1753326.1753345","paperID":"None"},{"content":"Tawanna Dillahunt, Jennifer Mankoff, Eric Paulos, and Susan Fussell. 2009. It's not all about \"Green\": energy use in low-income communities. Proceedings of the 11th international conference on Ubiquitous computing - Ubicomp '09, ACM Press, 255-264. http://dl.acm.org/citation.cfm?id=1620545.1620583","paperID":"None"},{"content":"Tawanna Dillahunt, Jennifer Mankoff, and Eric Paulos. 2010. Understanding conflict between landlords and tenants. Proceedings of the 12th ACM international conference on Ubiquitous computing - Ubicomp '10, ACM Press, 149-158. http://dl.acm.org/citation.cfm?id=1864349.1864376","paperID":"None"},{"content":"C DiSalvo and P Sengers. 2010. Mapping the landscape of sustainable HCI. CHI '10 Proceedings of the 28th international conference on Human factors in computing systems. http://dl.acm.org/citation.cfm?id=1753625","paperID":"None"},{"content":"Lynn Dombrowski, Jed R. Brubaker, Sen H. Hirano, Melissa Mazmanian, and Gillian R. Hayes. 2013. It takes a network to get dinner. Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing - UbiComp '13, ACM Press, 519- 528. http://dl.acm.org/citation.cfm?id=2493432.2493493","paperID":"None"},{"content":"Tao Dong, Mark W. Newman, Mark S. Ackerman, and Sarita Schoenebeck. 2015. Supporting reflection through play: field testing the home trivia system. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing UbiComp '15, ACM Press, 251-262. http://doi.org/10.1145/2750858.2804294","paperID":"None"},{"content":"Joel E. Fischer, Enrico Costanza, Sarvapali D. Ramchurn, James Colley, and Tom Rodden. 2014. Energy advisors at work: charity work practices to support people in fuel poverty. Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '14, ACM Press, 447-458. http://dl.acm.org/citation.cfm?id=2632048.2636081","paperID":"None"},{"content":"Jon Froehlich, Leah Findlater, and James Landay. 2010. The design of eco-feedback technology. CHI '10 Proceedings of the 28th international conference on Human factors in computing systems, 1999-2008. http://dl.acm.org/citation.cfm?id=1753629","paperID":"None"},{"content":"Harold Garfinkel, Michael Lynch, and Eric Livingston. 1981. I. 1 The Work of a Discovering Science Construed with Materials from the Optically Discovered Pulsar. Philosophy of the social sciences 11, 2: 131- 158.","paperID":"None"},{"content":"Harold Garfinkel. 1991. Respecification: Evidence for locally produced, naturally accountable phenomena of order, logic, reason, meaning, method, etc. in and as of the essential haecceity of immortal ordinary society (I)'an announcement of studies. In Ethnomethodology and the Human Sciences, Graham Button (ed.). Cambridge University Press, 10-19.","paperID":"None"},{"content":"Jeremy Goecks, Amy Voida, Stephen Voida, and Elizabeth D. Mynatt. 2008. Charitable technologies: Opportunities for Collaborative Computing in Nonprofit Fundraising. Proceedings of the ACM 2008 conference on Computer supported cooperative work CSCW '08, ACM Press, 689-698. http://doi.org/10.1145/1460563.1460669","paperID":"None"},{"content":"Rebecca E. Grinter, W. Keith Edwards, Mark W. Newman, and Nicolas Ducheneaut. 2005. The work to make a home network work. 469-488. http://dl.acm.org/citation.cfm?id=1242029.1242053","paperID":"None"},{"content":"Sidhant Gupta, Matthew S. Reynolds, and Shwetak N. Patel. 2010. ElectriSense: single-point sensing using EMI for electrical event detection and classification in the home. Proceedings of the 12th ACM international conference on Ubiquitous computing - Ubicomp '10, ACM Press, 139-148. http://dl.acm.org/citation.cfm?id=1864349.1864375","paperID":"None"},{"content":"John Heritage. 2013. Garfinkel and ethnomethodology. John Wiley & Sons.","paperID":"None"},{"content":"Rachel Jacobs, Steve Benford, Mark Selby, Michael Golembewski, Dominic Price, and Gabriella Giannachi. 2013. A conversation between trees: what data feels like in the forest. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13, ACM Press, 129. http://dl.acm.org/citation.cfm?id=2470654.2470673","paperID":"None"},{"content":"Yifei Jiang, Li Shang, Kun Li, et al. 2011. MAQS: a personalized mobile sensing system for indoor air quality monitoring. Proceedings of the 13th international conference on Ubiquitous computing UbiComp '11, ACM Press, 271-280. http://dl.acm.org/citation.cfm?id=2030112.2030150","paperID":"None"},{"content":"Sunyoung Kim and Eric Paulos. 2010. InAir: sharing indoor air quality measurements and visualizations. Proceedings of the 28th international conference on Human factors in computing systems CHI '10, ACM Press, 1861-1870. http://dl.acm.org/citation.cfm?id=1753326.1753605","paperID":"None"},{"content":"Gierad Laput, Walter S. Lasecki, Jason Wiese, Robert Xiao, Jeffrey P. Bigham, and Chris Harrison. 2015. Zensors: Adaptive, Rapidly Deployable, HumanIntelligent Sensor Feeds. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 1935-1944. http://doi.org/10.1145/2702123.2702416","paperID":"None"},{"content":"Marmot Review Team. 2011. The health impacts of cold homes and fuel poverty. London, England.","paperID":"None"},{"content":"Cecelia B. Merkel, Lu Xiao, Umer Farooq, et al. 2004. Participatory design in community computing contexts. Proceedings of the eighth conference on Participatory design Artful integration: interweaving media, materials and practices - PDC 04, ACM Press, 1-10. http://doi.org/10.1145/1011870.1011872","paperID":"None"},{"content":"Cecelia Merkel, Umer Farooq, Lu Xiao, Craig Ganoe, Mary Beth Rosson, and John M. Carroll. 2007. Managing technology use and learning in nonprofit community organizations. Proceedings of the 2007 symposium on Computer human interaction for the management of information technology CHIMIT '07, ACM Press. http://doi.org/10.1145/1234772.1234783","paperID":"None"},{"content":"James Pierce and Eric Paulos. 2012. Beyond energy monitors: interaction, energy, and emerging energy systems. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, ACM Press, 665. http://dl.acm.org/citation.cfm?id=2207676.2207771","paperID":"None"},{"content":"Lydia Plowman, Yvonne Rogers, and Magnus Ramage. 1995. What are workplace studies for? ECSCW, 309- 324. http://dl.acm.org/citation.cfm?id=1241958.1241978","paperID":"None"},{"content":"Zachary Pousman, Mario Romero, Adam Smith, and Michael Mateas. 2008. Living with tableau machine: a longitudinal investigation of a curious domestic intelligence. Proceedings of the 10th international conference on Ubiquitous computing - UbiComp '08, ACM Press, 370--379. http://doi.org/10.1145/1409635.1409685","paperID":"None"},{"content":"James Scott, A.J. Bernheim Brush, John Krumm, et al. 2011. PreHeat: controlling home heating using occupancy prediction. Proceedings of the 13th international conference on Ubiquitous computing UbiComp '11, ACM Press, 281-290. http://dl.acm.org/citation.cfm?id=2030112.2030151","paperID":"None"},{"content":"Susan Leigh Star and Geoffrey C Bowker. 2002. How to infrastructure. In The Handbook of New Media, L.A. Lievrouw and S.M. Livingstone (eds.). Sage, London, UK, 151-162.","paperID":"None"},{"content":"Jennifer Stoll, W. Keith Edwards, and Elizabeth D. Mynatt. 2010. Interorganizational coordination and awareness in a nonprofit ecosystem. Proceedings of the 2010 ACM conference on Computer supported cooperative work CSCW '10, ACM Press, 51-60. http://doi.org/10.1145/1718918.1718930","paperID":"None"},{"content":"Peter Tolmie, Andy Crabtree, Stefan Egglestone, Jan Humble, Chris Greenhalgh, and Tom Rodden. 2009. Digital plumbing: the mundane work of deploying UbiComp in the home. Personal and Ubiquitous Computing 14, 3: 181-196. http://doi.org/10.1007/s00779-009-0260--5","paperID":"None"},{"content":"Peter Tolmie, Andy Crabtree, Tom Rodden, James Colley, and Ewa Luger. 2016. \"This has to be the cats\" personal data legibility in networked sensing systems. Proceedings of the 2016 ACM Conference on Computer Supported Cooperative Work.","paperID":"None"},{"content":"Peter Tolmie and Andy Crabtree. 2008. Deploying research technology in the home. Proceedings of the ACM 2008 conference on Computer supported cooperative work CSCW '08, ACM Press, 639--648. http://doi.org/10.1145/1460563.1460662","paperID":"None"},{"content":"Peter Tolmie. 2011. Uncovering the Unremarkable. In Making Work Visible: Ethnographically Grounded Case Studies of Work Practice, Margaret H. Szymanski and Jack Whalen (eds.). Cambridge University Press, 53-73.","paperID":"None"},{"content":"Amy Voida, Ellie Harmon, and Ban Al-Ani. 2012. Bridging between organizations and the public: volunteer coordinators' uneasy relationship with social computing. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, ACM Press, 1967--1976. http://doi.org/10.1145/2207676.2208341","paperID":"None"},{"content":"Rayoung Yang and Mark W. Newman. 2013. Learning from a learning thermostat: lessons for intelligent systems for the home. Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing - UbiComp '13, ACM Press, 93- 102. http://dl.acm.org/citation.cfm?id=2493432.2493489","paperID":"None"}],"title":"\"Just whack it on until it gets hot\": Working with IoT Data in the Home","filename":"CHI16/p5933","authors":["Joel E. Fischer","Andy Crabtree","Tom Rodden","James A. Colley","Enrico Costanza","Michael O. Jewell","Sarvapali D. Ramchurn"],"conference":"CHI '16"}