{"paperId":2858381,"reference":[{"content":"Mark S Ackerman, Lorrie Faith Cranor and Joseph Reagle. (1999) Privacy in e-commerce: examining user scenarios and privacy preferences. in Proceedings of the 1st ACM conference on Electronic commerce, ACM, 1--8.","paperID":"None"},{"content":"Alessandro Acquisti. (2004) Privacy in electronic commerce and the economics of immediate gratification. in Proceedings of the 5th ACM Conference on Electronic Commerce, ACM, 21--29.","paperID":"None"},{"content":"Alessandro Acquisti, Laura Brandimarte and George Loewenstein. (2015) Privacy and human behavior in the age of information. Science, 347 (6221). 509--514.","paperID":"None"},{"content":"Alessandro Acquisti and Ralph Gross. (2006) Imagined communities: Awareness, information sharing, and privacy on the Facebook. in Privacy Enhancing Technologies, Springer, 36--58.","paperID":"None"},{"content":"Alessandro Acquisti, Leslie K John and George Loewenstein. (2013) What is privacy worth? The Journal of Legal Studies, 42 (2). 249--274.","paperID":"None"},{"content":"Idris Adjerid, Eyal Peer and Alessandro Acquisti. Beyond the privacy paradox: Objective versus relative risk in privacy decision making. Available at http://www.krannert.purdue.edu/academics/MIS/ workshop/Idris%20Adjerid_RDJournalPaperPurdue_Final.pdf.","paperID":"None"},{"content":"Corey M Angst and Ritu Agarwal. (2009) Adoption of electronic health records in the presence of privacy concerns: the elaboration likelihood model and individual persuasion. MIS Quarterly, 33 (2). 339370.","paperID":"None"},{"content":"Mark Billinghurst and Hirokazu Kato. (2002) Collaborative augmented reality. Communications of the ACM, 45 (7). 64--70.","paperID":"None"},{"content":"Frank Biocca. (1997) The cyborg's dilemma: progressive embodiment in virtual environments. Journal of Computer-Mediated Communication, 3 (2). 0-0.","paperID":"None"},{"content":"Frank Biocca, Chad Harms and Judee K Burgoon. (2003) Toward a more robust theory and measure of social presence: Review and suggested criteria. Presence, 12 (5). 456--480.","paperID":"None"},{"content":"Alan L Chaikin, Valerian J Derlega and Sarah J Miller. (1976) Effects of room environment on selfdisclosure in a counseling analogue. Journal of Counseling Psychology, 23 (5). 479--481.","paperID":"None"},{"content":"Mary J Culnan and Pamela K Armstrong. (1999) Information privacy concerns, procedural fairness, and impersonal trust: An empirical investigation. Organization science, 10 (1). 104--115.","paperID":"None"},{"content":"Tamara Dinev and Paul Hart. (2006) An extended privacy calculus model for e-commerce transactions. Information Systems Research, 17 (1). 61--80.","paperID":"None"},{"content":"Julia B Earp and David Baumer. (2003) Innovative web use to learn about consumer behavior and online privacy. Communications of the ACM, 46 (4). 81--83.","paperID":"None"},{"content":"Ellen Garbarino and Olivia F Lee. (2003) Dynamic pricing in internet retail: effects on consumer trust. Psychology & Marketing, 20 (6). 495--513.","paperID":"None"},{"content":"Leslie K John, Alessandro Acquisti and George Loewenstein. (2011) Strangers on a plane: Contextdependent willingness to divulge sensitive information. Journal of Consumer Research, 37 (5). 858--873.","paperID":"None"},{"content":"Daniel Kahneman. (2003) A perspective on judgment and choice: mapping bounded rationality. American Psychologist, 58 (9). 697--720.","paperID":"None"},{"content":"Daniel Kahneman. (2011) Thinking, fast and slow. Macmillan.","paperID":"None"},{"content":"Daniel Kahneman and Shane Frederick. (2002) Representativeness revisited: Attribute substitution in intuitive judgment. Heuristics and biases: The psychology of intuitive judgment, 49--81.","paperID":"None"},{"content":"Daniel Kahneman and Amos Tversky. (1979) Prospect theory: An analysis of decision under risk. Econometrica: Journal of the Econometric Society. 263--291.","paperID":"None"},{"content":"Flavius Kehr, Tobias Kowatsch, Daniel Wentzel and Elgar Fleisch. (2015) Blissfully ignorant: the effects of general privacy concerns, general institutional trust, and affect in the privacy calculus. Information Systems Journal. 25 (6). 607--635.","paperID":"None"},{"content":"Kwan Min Lee and Clifford Nass. (2003) Designing social presence of social actors in human computer interaction. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 289--296.","paperID":"None"},{"content":"Paul Benjamin Lowry, Greg Moody, Anthony Vance, Matthew Jensen, Jeff Jenkins and Taylor Wells. (2012) Using an elaboration likelihood approach to better understand the persuasiveness of website privacy assurance cues for online consumers. Journal of the American Society for Information Science and Technology, 63 (4). 755--776.","paperID":"None"},{"content":"David Lyon. (2002) Everyday surveillance: Personal data and social classifications. Information, Communication & Society, 5 (2). 242--257.","paperID":"None"},{"content":"Roger C Mayer, James H Davis and F David Schoorman. (1995) An integrative model of organizational trust. Academy of Management Review, 20 (3). 709--734.","paperID":"None"},{"content":"George R Milne and Maria-Eugenia Boza. (1999) Trust and concern in consumers' perceptions of marketing information management practices. Journal of Interactive Marketing, 13 (1). 5--24.","paperID":"None"},{"content":"Youngme Moon. (2000) Intimate exchanges: Using computers to elicit self-disclosure from consumers. Journal of Consumer Research, 26 (4). 323--339.","paperID":"None"},{"content":"Clifford Nass, Jonathan Steuer and Ellen R Tauber. (1994) Computers are social actors. in Proceedings of the SIGCHI conference on Human Factors in Computing Systems, ACM, 72--78.","paperID":"None"},{"content":"Patricia A Norberg, Daniel R Horne and David A Horne. (2007) The privacy paradox: Personal information disclosure intentions versus behaviors. Journal of Consumer Affairs, 41 (1). 100--126.","paperID":"None"},{"content":"Antti Oulasvirta, Aurora Pihlajamaa, Jukka Perkiö, Debarshi Ray, Taneli Vähäkangas, Tero Hasu, Niklas Vainio and Petri Myllymäki. (2012) Long-term effects of ubiquitous surveillance in the home. in Proceedings of the 2012 ACM Conference on Ubiquitous Computing, ACM, 41--50.","paperID":"None"},{"content":"Paul A Pavlou. (2003) Consumer acceptance of electronic commerce: Integrating trust and risk with the technology acceptance model. International Journal of Electronic Commerce, 7 (3). 101--134.","paperID":"None"},{"content":"Byron Reeves and Clifford Nass. (1996) The media equation. Cambridge University Press.","paperID":"None"},{"content":"Nora J Rifon, Robert LaRose and Sejung Choi. (2005) Your privacy is sealed: Effects of web privacy seals on trust and personal disclosures. Journal of Consumer Affairs, 39 (2). 339--362.","paperID":"None"},{"content":"Paul Schermerhorn, Matthias Scheutz and Charles R Crowell. (2008) Robot social presence and gender: Do females view robots differently than males? in Proceedings of the 3rd ACM/IEEE International Conference on Human Robot Interaction, ACM, 263270.","paperID":"None"},{"content":"John T Scholz and Mark Lubell. (1998) Trust and taxpaying: Testing the heuristic approach to collective action. American Journal of Political Science. 398--417.","paperID":"None"},{"content":"Irina Shklovski, Scott D Mainwaring, Halla Hrund Skúladóttir and Höskuldur Borgthorsson. (2014) Leakiness and creepiness in app space: Perceptions of privacy and mobile app use. in Proceedings of the 32nd annual ACM conference on Human factors in computing systems, ACM, 2347--2356.","paperID":"None"},{"content":"H Jeff Smith, Tamara Dinev and Heng Xu. (2011) Information privacy research: an interdisciplinary review. MIS Quarterly, 35 (4). 989--1016.","paperID":"None"},{"content":"H Jeff Smith, Sandra J Milberg and Sandra J Burke. (1996) Information privacy: measuring individuals' concerns about organizational practices. MIS Quarterly. 20 (2). 167--196.","paperID":"None"},{"content":"Keith E Stanovich and Richard F West. (2000) Individual differences in reasoning: Implications for the rationality debate. Behavioral and Brain Sciences, 23 (5). 645--665.","paperID":"None"},{"content":"Janice Y Tsai, Patrick Gage Kelley, Lorrie Faith Cranor and Norman Sadeh. (2010) Location-sharing technologies: Privacy risks and controls. ISJLP, 6. 119.","paperID":"None"},{"content":"Chih-Hsiung Tu. (2002) The measurement of social presence in an online learning environment. International Journal on E-learning, 1 (2). 34--45.","paperID":"None"},{"content":"Joseph Turow, Jennifer King, Chris Jay Hoofnagle, Amy Bleakley and Michael Hennessy. (2009) Americans reject tailored advertising and three activities that enable it. Available at SSRN 1478214.","paperID":"None"},{"content":"Amos Tversky and Daniel Kahneman. (1974) Judgment under uncertainty: Heuristics and biases. Science, 185 (4157). 1124--1131.","paperID":"None"},{"content":"Blase Ur, Pedro Giovanni Leon, Lorrie Faith Cranor, Richard Shay and Yang Wang. (2012) Smart, useful, scary, creepy: perceptions of online behavioral advertising. in Proceedings of the Eighth Symposium on Usable Privacy and Security, ACM, 4.","paperID":"None"},{"content":"PC Wason and J St BT Evans. (1975) Dual processes in reasoning? Cognition, 3 (2). 141--154.","paperID":"None"},{"content":"Heng Xu, Hock-Hai Teo, Bernard CY Tan and Ritu Agarwal. (2009) The role of push-pull technology in privacy calculus: the case of location-based services. Journal of Management Information Systems, 26 (3). 135--174.","paperID":"None"},{"content":"Shu-Chen Yang, Wan-Chiao Hung, Kai Sung and Cheng-Kiang Farn. (2006) Investigating initial trust toward e-tailers from the elaboration likelihood model perspective. Psychology and Marketing, 23 (5). 429--445.","paperID":"None"},{"content":"Tao Zhou. (2012) Understanding users' initial trust in mobile banking: An elaboration likelihood perspective. Computers in Human Behavior, 28 (4). 1518--1525.","paperID":"None"}],"citation":[],"abstract":"Undergraduates interviewed about privacy concerns related to online data collection made apparently contradictory statements. The same issue could evoke concern or not in the span of an interview, sometimes even a single sentence. Drawing on dual-process theories from psychology, we argue that some of the apparent contradictions can be resolved if privacy concern is divided into two components we call intuitive concern, a \"gut feeling,\" and considered concern, produced by a weighing of risks and benefits. Consistent with previous explanations of the so-called privacy paradox, we argue that people may express high considered concern when prompted, but in practice act on low intuitive concern without a considered assessment. We also suggest a new explanation: a considered assessment can override an intuitive assessment of high concern without eliminating it. Here, people may choose rationally to accept a privacy risk but still express intuitive concern when prompted.","title":"It's Creepy, But it Doesn't Bother Me","filename":"CHI16/p5240","authors":["Chanda Phelan","Cliff Lampe","Paul Resnick"],"conference":"CHI '16"}