{"paperId":2858263,"citation":[],"reference":[{"content":"Tatiana P. V. Alves, Marcos R. S. Borges and Adriana S. Vivacqua. 2013. An environment to support the discovery of potential partners in a research group. In Proceedings of the 17th International Conference Computer Supported Cooperative Work in Design (CSCWD '13), IEEE, 344--349.","paperID":"None"},{"content":"Victoria Bellotti, Sara Cambridge, Karen Hoy, Patrick C. Shih, Lisa Renery Handalian, Kyungsik Han and John M. Carroll. 2014. Towards community-centered support for peer-to-peer service exchange: rethinking the timebanking metaphor. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 2975--2984.","paperID":"None"},{"content":"Victoria Bellotti, John M. Carroll and Kyungsik Han. 2013. Random acts of kindness: The intelligent and context-aware future of reciprocal altruism and community collaboration. In Proceedings of Collaboration Technologies and Systems (CTS '13), IEEE, 1--12.","paperID":"None"},{"content":"Victoria Bellotti, Kamila Demkova, Dan Turner, Alexander Ambard and Amanda Waterman. In preparation. \"Black Market\" Activity in Peer-to-Peer Marketplaces. In preparation, available from the first author on request.","paperID":"None"},{"content":"Stephanie L. Brown, Randolph M. Nesse, Amiram D. Vinokur and Dylan M. Smith. 2003. Providing social support may be more beneficial than receiving it: Results from a prospective study of mortality. Psychological Science 14, 4: 320--327.","paperID":"None"},{"content":"Susan Bull, Jim Greer, Gordon McCalla, Lori Kettel and Jeff Bowes. 2001. User modelling in i-help: what, why, when and how. User Modeling, Vol. 2109 of Lecture Notes in Computer Science, Springer, Heidelberg 117--126.","paperID":"None"},{"content":"Edgar S. Cahn. 1986. Service Credits: A New Currency for the Welfare State. Welfare State Programme Discussion Paper No WSP/8, Suntory-Toyota International Centre for Economics and Related Disciplines, London School of Economics.","paperID":"None"},{"content":"Edgar S. Cahn. 2000. No More Throw-Away People: The Co-Production Imperative. Essential Books Ltd.","paperID":"None"},{"content":"Edgar S. Cahn and Jonathan Rowe. 1992. Time Dollars: The New Currency that Enables Americans to Turn their Hidden Resource -- Time -- into Personal Security and Community Renewal. Rodale Press.","paperID":"None"},{"content":"Jilin Chen, Werner Geyer, Casey Dugan, Michael Muller and Ido Guy. 2009. Make new friends, but keep the old: recommending people on social networking sites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 201--210. http://doi.acm.org/10.1145/1518701.1518735","paperID":"None"},{"content":"Ed Collom. 2005. Community Currency in the USA: The Environments in which it Emerges and Survives. Environmental Planning 37, 9: 1565--1587.","paperID":"None"},{"content":"Ed Collom, Judith N. Lasker and Corinne Kyriacou. 2012. Equal Time, Equal Value: Community Currencies and Time Banking in the US. Ashgate Publishing.","paperID":"None"},{"content":"Fernando Diaz, Donald Metzler and Sihem AmerYahia. 2010. Relevance and ranking in online dating systems. In Proceedings of the 33rd international ACM SIGIR conference on Research and development in information retrieval (SIGIR '10), 66--73. http://doi.acm.org/10.1145/1835449.1835463","paperID":"None"},{"content":"Ed Diener and Robert Biswas-Diener. 2008. Happiness: Unlocking the Mysteries of Psychological Wealth. Wiley Blackwell.","paperID":"None"},{"content":"Rachel Donadio. 2011. Battered by economic crisis, Greeks turn to barter networks. NY Times, October 1, page A6. http://www.nytimes.com/2011/10/02/world/europe/ingreece-barter-networks-surge.html","paperID":"None"},{"content":"Dunbar, R. I. M. (1992). Neocortex size as a constraint on group size in primates. Journal of Human Evolution 22, 6, 469--493.","paperID":"None"},{"content":"The Economist. 2013. The Rise of the Sharing Economy. (9 March): Retrieved October 6, 2014 from http://www.economist.com/news/leaders/21573104internet-everything-hire-rise-sharing-economy.","paperID":"None"},{"content":"Bradley Efron and Robert J. Tibshirani. An introduction to the bootstrap. CRC Monographs on Statistics & Applied Probability, 57. Chapman & Hall.","paperID":"None"},{"content":"Maryam Fazel-Zarandi, Hugh J. Devlin, Jun Huang and Noshir Contractor. 2011. Expert recommendation based on social drivers, social network analysis, and semantic data representation. In Proceedings of the 2nd International Workshop on Information Heterogeneity and Fusion in Recommender Systems (HetRec '11), 4148. ACM, NY. ISBN 978--1--4503--1027--7","paperID":"None"},{"content":"Kyungsik Han, Patrick Shih, Victoria Bellotti and John M. Carroll. 2015. It's Time There Was an App for That Too: A Usability Study of Mobile Timebanking. International Journal of Mobile Human Computer Interaction (IJMHCI) 7, 2: 1--22.","paperID":"None"},{"content":"Yang Sok Kim, Ashesh Mahidadia, Paul Compton, Xiongcai Cai, Mike Bain, Alfred Krzywicki and Wayne Wobcke. 2010. People recommendation based on aggregated bidirectional intentions in social network site. Knowledge Management and Acquisition for Smart Systems and Services, vol. 6232/2010 of Lecture Notes in Computer Science, Springer, Berlin. 247--260.","paperID":"None"},{"content":"Judith Lasker, Lauren Baldasari, Tara Bealer, Ethan Kramer, Zane Kratzer, Rachel Mandeville, Erin Niclaus, Julia Schulman, Danielle Suchow, Jessica Young, Abby Letcher and Anne Rogers. 2006. Building community ties and individual well-being: A case study of the community exchange organization. Paper presented at the 56th Annual Meeting of the Society for the Study of Social Problems, Montreal, Canada, August 10--12, 2006.","paperID":"None"},{"content":"Judith Lasker, Ed Collom, Tara Bealer, Erin Niclaus, Jessica Young Keefe, et al. 2011. Timebanking and health: The role of a community currency organization in enhancing well-being. Health Promotion Practice 12, 1: 102--115.","paperID":"None"},{"content":"Lei Li and Tao Li. 2012. MEET: a generalized framework for reciprocal recommender systems. In Proceedings of the 21st ACM international conference on Information and knowledge management (CIKM '12). ACM, NY, NY, USA, 35--44.","paperID":"None"},{"content":"Rensis Likert. 1932. A Technique for the Measurement of Attitudes. Archives of Psychology 22, 140: 1--55.","paperID":"None"},{"content":"Jochen Malinowski, Tobias Keim, Oliver Wendt and Tim Weitzel. 2006. Matching people and jobs: a bilateral recommendation approach. In Proceedings of the 39th Annual Hawaii International Conference on System Sciences 6, p. 137c. IEEE Computer Society, Washington.","paperID":"None"},{"content":"Julia M. Mayer, Starr Roxanne Hiltz and Quentin Jones. 2015. Making Social Matching Context-Aware: Design Concepts and Open Challenges. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 545--554.","paperID":"None"},{"content":"Elijah Mayfield and Carolyn Penstein Rosé. 2012. LightSIDE: Text Mining and Machine Learning User's Manual. 2012 Carnegie Mellon University. Retrieved September 18, 2015 from http://www.cs.cmu.edu/~emayfiel/LightSIDE.pdf","paperID":"None"},{"content":"Elijah Mayfield and Carolyn Penstein Rosé. 2013. LightSIDE: Open Source Machine Learning for Text In Handbook of Automated Essay Grading, Routledge Academic Press, XCITY, XCountry, 124--135.","paperID":"None"},{"content":"Matt Moffett and Ilan Brat. For Spain's Jobless, Time Equals Money. The Wall Street Journal, August 27, 2012, pp. A1.","paperID":"None"},{"content":"Stefan Molnar. 2011. Time is of the essence: The challenges and achievements of a Swedish time banking initiative. International Journal of Community Currency Research 15, Section A: 13--22.","paperID":"None"},{"content":"R. Matthew Montoya, Robert S. Horton and Jeffrey Kirchner. 2008. Is actual similarity necessary for attraction? A meta-analysis of actual and perceived similarity. Journal of Social and Personal Relationships, 25, 6: 889--922.","paperID":"None"},{"content":"Lucie K. Ozanne. 2010. Learning to exchange time: Benefits and obstacles to time banking. International Journal of Community Currency Research 14: 1--16.","paperID":"None"},{"content":"Luiz Pizzato, Tomek Rej, Thomas Chung, Irena Koprinska and Judy Kay. 2010a. RECON: a reciprocal recommender for online dating. In Proceedings of Recommender Systems, 207--214.","paperID":"None"},{"content":"Stephen G. Post. 2005. Altruism, happiness, and health: It's good to be good. International Journal of Behavioral Medicine 12, 2: 66--77","paperID":"None"},{"content":"Robert D. Putnam. 2000. Bowling Alone: The Collapse and Revival of American Community, Simon and Schuster.","paperID":"None"},{"content":"Dennis T. Regan. 1971. Effects of a favor and liking on compliance. Journal of Experimental Social Psychology 7, 6: 627--639.","paperID":"None"},{"content":"Debbie Richards, Meredith Taylor and Peter Busch. 2008. Expertise recommendation: A two-way knowledge communication channel. In Proceedings of ICAAS, 35--40.","paperID":"None"},{"content":"Martin E. P. Seligman. 2002. Authentic Happiness: Using the New Positive Psychology to Realize Your Potential for Lasting Fulfillment. Simon and Schuster.","paperID":"None"},{"content":"Gillian Seyfang. 2002. Tackling social exclusion with community currencies: learning from LETS to Time Banks. International Journal of Community Currency Research 6, 3. Retrieved September 22, 2015 from http://ijccr.net/2012/05/23/tackling-social-exclusionwith-community-currencies-learning-from-lets-to-timebanks/.","paperID":"None"},{"content":"Gillian Seyfang. 2003. With a little help from my friends: Evaluating timebanks as a tool for community self-help. Local Economy 18, 3: 257--264.","paperID":"None"},{"content":"Gillian Seyfang. 2004. Time banks: Rewarding community self-help in the inner city? Community Development Journal 39, 1: 62--71.","paperID":"None"},{"content":"Gillian Seyfang and Noel Longhurst. 2013. Growing green money? Mapping community currencies for sustainable development. Ecological Economics 86: 65--77.","paperID":"None"},{"content":"Gillian Seyfang and Karen Smith. 2002. The Time of Our Lives: Using Time Banking for Neighbourhood Renewal and Community Capacity Building. New Economics Foundation.","paperID":"None"},{"content":"Patrick C. Shih, Victoria Bellotti, Kyungsik Han and John M. Carroll. 2015. Unequal Time for Unequal Value: Implications of Differing Motivations for Participation in Timebanking. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1075--1084.","paperID":"None"},{"content":"Steven Tait, Chiara Leonardi, Massimo Zancanaro, Michele Caraviello, Bruno Lepri and Paolo Massa. 2014. Towards collaborative communities: a preliminary study on exchange of goods and services in local contexts. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14), 999--1002.","paperID":"None"},{"content":"Loren Terveen and David W. McDonald. 2005. Social matching: A framework and research agenda. ACM transactions on computer-human interaction (TOCHI) 12, 3: 401--434.","paperID":"None"},{"content":"Robert L. Trivers. 1971. The evolution of reciprocal altruism. The Quarterly Review of Biology 46, 1: 3557.","paperID":"None"},{"content":"Colin C. Williams, Theresa Aldridge, Roger Lee, Andrew Leyshon, Nigel Thrift and Jane Tooke. 2001. Bridges Into Work? An Evaluation of Local Exchange Trading Schemes (LETS). The Policy Press.","paperID":"None"},{"content":"Svetlana Yarosh, Tara Matthews and Michelle Zhou. 2012. Asking the right person: supporting expertise selection in the enterprise. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2247--2256.","paperID":"None"}],"abstract":"Timebanking is a growing type of peer-to-peer service exchange, but is hampered by the effort of finding good transaction partners. We seek to reduce this effort by using a Matching Algorithm for Service Transactions (MAST). MAST matches transaction partners in terms of similarity of interests and complementarity of abilities and needs. We present an experiment involving data and participants from a real timebanking network, that evaluates the acceptability of MAST, and shows that such an algorithm can retrieve matches that are subjectively better than matches based on matching the category of people's historical offers or requests to the category of a current transaction request.","title":"'MASTerful' Matchmaking in Service Transactions: Inferred Abilities, Needs and Interests versus Activity Histories","filename":"CHI16/p1644","authors":["Hyunggu Jung","Victoria Bellotti","Afsaneh Doryab","Dean Leitersdorf","Jiawei Chen","Benjamin V. Hanrahan","Sooyeon Lee","Dan Turner","Anind K. Dey","John M. Carroll"],"conference":"CHI '16"}