{"paperId":2858341,"abstract":"The paper analyzes the warez scene, an illegal underground subculture on the Internet, which specializes in removing copy protection from software and releasing the cracked software for free. Despite the lack of economic incentives and the absence of external laws regulating it, the warez scene has been able to self-govern and self-organize for more than three decades. Through a directed content analysis of the subculture's digital traces, the paper argues that the ludic competition within the warez scene is an institution of collective action, and can, therefore, be approached as a common-pool resource (CPR). Subsequently, the paper uses Ostrom's framework of long-enduring common-pool resource institutions to understand the warez scene's longevity and ability to govern itself. Theoretical and design implications of these findings are then discussed.","citation":[],"reference":[{"content":"ALiAS. 2008. Night Watch Racing (c) Lexicon Entertainment. Retrieved from http://www.nfohump.com/index.php?switchto=nfos&menu=quicknav&item=viewnfo&id=122979","paperID":"None"},{"content":"Yochai Benkler. 2002. Coase's Penguin, or, Linux and \"The Nature of the Firm.\" The Yale Law Journal 112, 3: 369. http://doi.org/10.2307/1562247","paperID":"None"},{"content":"Yochai Benkler. 2006. The Wealth of Networks: How Social Production Transforms Markets and Freedom. Yale University Press.","paperID":"None"},{"content":"Edward J. Bird and Gert G. Wagner. 1997. Sport as a Common Property Resource. Journal of Conflict Resolution 41, 6: 749--766.","paperID":"None"},{"content":"Barry Brown and Marek Bell. 2004. CSCW at play: \"There\" as a collaborative virtual environment. Proceedings of the 2004 ACM conference on Computer supported cooperative work, 350--359. http://doi.org/10.1145/1031607.1031666","paperID":"None"},{"content":"Karen Clay. 1997. Trade without Law: Private-Order Institutions in Mexican California. Journal of Law, Economics, & Organization 13, 1: 202--231.","paperID":"None"},{"content":"Rosaria Conte and Mario Paolucci. 2002. Reputation in Artificial Societies: Social Beliefs for Social Order. Springer Science & Business Media.","paperID":"None"},{"content":"Kevin Crowston, Qing Li, Kangning Wei, U. Yeliz Eseryel, and James Howison. 2007. Self-organization of teams for free/libre open source software development. Information and Software Technology 49, 6: 564--575. http://doi.org/10.1016/j.infsof.2007.02.004","paperID":"None"},{"content":"David Décary-Hétu. 2014. Police Operations 3.0: On the Impact and Policy Implications of Police Operations on the Warez Scene. Policy & Internet 6, 3: 315--340.","paperID":"None"},{"content":"David Décary-Hetu, C. Morselli, and S. LemanLanglois. 2012. Welcome to the Scene: A Study of Social Organization and Recognition among Warez Hackers. Journal of Research in Crime and Delinquency 49, 3: 359--382. http://doi.org/10.1177/0022427811420876","paperID":"None"},{"content":"Robert C. Ellickson. 2009. Order without Law: How Neighbors Settle Disputes. Harvard University Press.","paperID":"None"},{"content":"Andrea Forte, Vanesa Larco, and Amy Bruckman. 2009. Decentralization in Wikipedia Governance. Journal of Management Information Systems 26, 1: 49--72. http://doi.org/10.2753/MIS0742--1222260103","paperID":"None"},{"content":"R. Stuart Geiger and David Ribes. 2010. The work of sustaining order in wikipedia: the banning of a vandal. Proceedings of the 2010 ACM conference on Computer supported cooperative work, ACM, 117--126.","paperID":"None"},{"content":"Eric Goldman. 2003. Warez trading and criminal copyright infringement. J. Copyright Soc'y USA 51: 395.","paperID":"None"},{"content":"Avner Greif, Paul Milgrom, and Barry R. Weingast. 1994. Coordination, commitment, and enforcement: The case of the merchant guild. Journal of political economy: 745--776.","paperID":"None"},{"content":"Garrett Hardin. 1968. The Tragedy of the Commons. Science 162, 3859: 1243--1248.","paperID":"None"},{"content":"Charlotte Hess. 1996. Untangling the Web: The Internet as a Commons. Workshop in Political Theory and Policy Analysis, Indiana University.","paperID":"None"},{"content":"Hsiu-Fang Hsieh and Sarah E. Shannon. 2005. Three Approaches to Qualitative Content Analysis. Qualitative Health Research 15, 9: 1277--1288. http://doi.org/10.1177/1049732305276687","paperID":"None"},{"content":"Hybrid. 1996. Starfighter 3000 (C) Telstar/Krisalis. Retrieved from http://www.textfiles.com/piracy/HYBRID/sf3000.nfo","paperID":"None"},{"content":"iRRM. 2006. Winter Sports (c) Oxygen *MULTI5* *PROPER*. Retrieved from http://www.nfohump.com/index.php?switchto=nfos&menu=quicknav&item=viewnfo&id=108587","paperID":"None"},{"content":"iRRM. 2006. Lawnmower Racing Mania 2007 (c) VU Games. Retrieved from http://www.nfohump.com/index.php?switchto=nfos&menu=quicknav&item=viewnfo&id=108967","paperID":"None"},{"content":"Nixon K. Kariithi. 2011. Is the Devil in the Data? A Literature Review of Piracy Around the World: Literature Review of Piracy Around the World. The Journal of World Intellectual Property 14, 2: 133--154. http://doi.org/10.1111/j.1747--1796.2010.00412.x","paperID":"None"},{"content":"Aniket Kittur and Robert E. Kraut. 2010. Beyond Wikipedia: Coordination and Conflict in Online Production Groups. Proceedings of the 2010 ACM conference on Computer supported cooperative work, ACM, 215--224.","paperID":"None"},{"content":"Peter Kollock. 1994. The Emergence of Exchange Structures: An Experimental Study of Uncertainty, Commitment, and Trust. The American Journal of Sociology 100, 2: 313--345.","paperID":"None"},{"content":"Peter Kollock. 1997. The economies of online cooperation: Gifts and public goods in cyberspace. In Communities in Cyberspace, Peter Kollock and Mark Smith (eds.). Routledge, London, 220--239.","paperID":"None"},{"content":"Peter Kollock. 1999. Design principles for online communities. Retrieved July 27, 2015 from http://mysite.du.edu/~lavita/edpx_3770_13s/_docs/kollock_design_%20princ_for_online_comm%20copy.pdf","paperID":"None"},{"content":"Peter Kollock and Mark Smith. 1994. Managing the Virtual Commons: Cooperation and Conflict in Computer Communities. Retrieved July 27, 2015 from http://www.sscnet.ucla.edu/soc/csoc/papers/virtcomm/Virtcomm.htm","paperID":"None"},{"content":"Robert E. Kraut, Paul Resnick, Sara Kiesler, et al. 2012. Building Successful Online Communities: Evidence-Based Social Design. MIT Press.","paperID":"None"},{"content":"Karim Lakhani and Robert G. Wolf. 2003. Why hackers do what they do: Understanding motivation and effort in free/open source software projects.","paperID":"None"},{"content":"Cliff Lampe and Paul Resnick. 2004. Slash(dot) and Burn: Distributed Moderation in a Large Online Conversation Space. Proceedings of the SIGCHI conference on Human factors in computing systems., ACM.","paperID":"None"},{"content":"Jennifer Lee. 2002. Pirates of the Web. NY Times. Retrieved November 26, 2014 from http://www.nytimes.com/2002/07/11/technology/circuits/11WARE.html","paperID":"None"},{"content":"Peter T. Leeson. 2009. The Invisible Hook: The Hidden Economics of Pirates. Princeton University Press.","paperID":"None"},{"content":"John G. Malcolm. 2003. International Copyright Piracy: A Growing Problem with Links to Organized Crime and Terrorism. Retrieved May 20, 2015 from http://commdocs.house.gov/committees/judiciary/hju85643.000/hju85643_0f.htm","paperID":"None"},{"content":"Curtis J. Milhaupt and Mark D. West. 2000. The Dark Side of Private Ordering: An Institutional and Empirical Analysis of Organized Crime. The University of Chicago Law Review 67, 1: 41. http://doi.org/10.2307/1600326","paperID":"None"},{"content":"MYTH. 2000. Gunship! *PROPER RIP* (c) Microprose / Hasbro Interactive. Retrieved from http://www.nfohump.com/index.php?switchto=nfos&menu=quicknav&item=viewnfo&id=4132","paperID":"None"},{"content":"Bonnie Nardi and Justin Harris. 2006. Strangers and Friends: Collaborative Play in World of Warcraft. Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work, ACM, 149--158.","paperID":"None"},{"content":"oCEANiNE. 2002. RC Daredevil 3D ENGLiSH. Retrieved from http://www.nfohump.com/index.php?switchto=nfos&menu=quicknav&item=viewnfo&id=13031","paperID":"None"},{"content":"Elinor Ostrom. 1990. Governing the Commons: The Evolution of Institutions for Collective Action. Cambridge University Press.","paperID":"None"},{"content":"Elinor Ostrom. 2003. Toward a behavioral theory linking trust, reciprocity, and reputation. In Trust and reciprocity: Interdisciplinary lessons from experimental research. 19--79.","paperID":"None"},{"content":"Jennifer Preece. 2004. Etiquette, Empathy and Trust in Communities of Practice: Stepping-Stones to Social Capital. J. UCS 10, 3: 294--302.","paperID":"None"},{"content":"Alf Rehn. 2001. Electronic potlatch. A study on new technologies and primitive economic. Retrieved November 9, 2014 from http://cdn.preterhuman.net/texts/underground/paraZite.org.2006.10.13/ePotlatch.pdf","paperID":"None"},{"content":"RiTUEL. 2006. Made Man (c) Silverback Entertainment. Retrieved from http://www.nfohump.com/index.php?switchto=nfos&menu=quicknav&item=viewnfo&id=108777","paperID":"None"},{"content":"Melanie Dulong De Rosnay and Hervé Le Crosnier. 2012. An Introduction to the Digital Commons: From Common-Pool Resources to Community Governance. Building Institutions for Sustainable Scientific, Cultural and genetic Resources Commons, International Association for the Study of the Commons.","paperID":"None"},{"content":"Charles M. Schweik and Robert C. English. 2012. Internet Success: A Study of Open-source Software Commons. MIT Press.","paperID":"None"},{"content":"Ben Shneiderman. 2000. Designing trust into online experiences. Communications of the ACM 43, 12: 57--59.","paperID":"None"},{"content":"STORM. 2006. BlitzKrieg: Mission Kursk (c) CDV *Addon*. Retrieved from http://www.nfohump.com/index.php?switchto=nfos&menu=quicknav&item=viewnfo&id=105227","paperID":"None"},{"content":"TECHNIC Team. 2006. The Guild 2 (c) Jowood. Retrieved from http://www.nfohump.com/index.php?switchto=nfos&menu=quicknav&item=viewnfo&id=108873","paperID":"None"},{"content":"the_bogey. 1999. -= IRC Warez for newbies =-. Retrieved November 9, 2014 from http://web.textfiles.com/hacking/irc-warez.txt","paperID":"None"},{"content":"The Mentor (a.k.a. Loyd Blankenship). 1986. The Hacker's Manifesto. Retrieved May 20, 2015 from http://www.usc.edu/~douglast/202/lecture23/manifesto.html","paperID":"None"},{"content":"TNT. 2005. Vegas Casino Challenge Featuring Texas Hold 'Em!: Riverboat Slots V1.0 (c) EGames. Retrieved from http://www.nfohump.com/index.php?switchto=nfos&menu=quicknav&item=viewnfo&id=87949","paperID":"None"},{"content":"Gregor Urbas. 2007. Cross-national investigation and prosecution of intellectual property crimes: the example of \"Operation Buccaneer.\" Crime, Law and Social Change 46, 4--5: 207--221. http://doi.org/10.1007/s10611-007--9060-x","paperID":"None"},{"content":"Fernanda B. Viégas, Martin Wattenberg, and Matthew M. McKeon. 2007. The hidden order of Wikipedia. In Online communities and social computing. Springer, 445--454.","paperID":"None"},{"content":"VISPER. 2001. Pocket Tanks Deluxe (C) Blitwise. Retrieved from http://www.nfohump.com/index.php?switchto=nfos&menu=quicknav&item=viewnfo&id=6239","paperID":"None"},{"content":"Steve Weber. 2004. The Success of Open Source. Harvard University Press.","paperID":"None"},{"content":"Ruben Van Wendel de Joode. 2004. Continuity of the commons in open source communities. Proceedings of SSCCII-2004.","paperID":"None"},{"content":"1998. MIA: Missing in Action by Razor1911. Retrieved May 20, 2015 from http://www.defacto2.net/file/detail/b049e4","paperID":"None"},{"content":"1998. Faction Manifesto. Retrieved from http://www.defacto2.net/file/detail/a634e1/the-faction/","paperID":"None"},{"content":"2001. Operation Buccaneer, Summary of Events. Retrieved March 20, 2015 from https://www.defacto2.net/wayback/operationbuccaneer-summary-of-events-from-2001-december13/index.html","paperID":"None"},{"content":"2004. Standard Rip Rules (S.R.R) for Standard Rip Rules - Defacto2. Retrieved May 21, 2015 from https://www.defacto2.net/file/detail/a32d35/standardrip-rules/","paperID":"None"},{"content":"2015. Warez Scene Notice Collection (2006--2010)?: Internet Archive. Retrieved May 20, 2015 from https://archive.org/details/warez-scene-notices-2006--2010","paperID":"None"}],"title":"Order in the Warez Scene: Explaining an Underground Virtual Community with the CPR Framework","filename":"CHI16/p372","authors":["Priyank Chandra"],"conference":"CHI '16"}