{"paperId":2858077,"citation":[],"abstract":"Users frequently experience situations in which their ability to differentiate screen colors is affected by a diversity of situations, such as when bright sunlight causes glare, or when monitors are dimly lit. However, designers currently have no way of choosing colors that will be differentiable by users of various demographic backgrounds and abilities and in the wide range of situations where their designs may be viewed. Our goal is to provide designers with insight into the effect of real-world situational lighting conditions on people's ability to differentiate colors in applications and imagery. We therefore developed an online color differentiation test that includes a survey of situational lighting conditions, verified our test in a lab study, and deployed it in an online environment where we collected data from around 30,000 participants. We then created ColorCheck, an image-processing tool that shows designers the proportion of the population they include (or exclude) by their color choices.","reference":[{"content":"2008. Web Content Accessibility Guidelines. http://www.w3.org/TR/WCAG20/. (2008). Accessed: 2015-09--10.","paperID":"None"},{"content":"2015. Adobe Kuler. http://color.adobe.com. (2015). Accessed: 2015-09--10.","paperID":"None"},{"content":"2015. COLOURlovers. http://www.colourlovers.com. (2015). Accessed: 2015-09--10.","paperID":"None"},{"content":"Israel Abramov, James Gordon, Olga Feldman, and Alla Chavarga. 2012. Sex and vision II: color appearance of monochromatic lights. Biology of Sex Differences 3, 1 (2012), 21.","paperID":"None"},{"content":"David L Bimler, John Kirkland, Kimberly A Jameson, and others. 2004. Quantifying variations in personal color spaces: Are there sex differences in color vision? COLOR Research and application 29, 2 (2004), 128--133.","paperID":"None"},{"content":"Jennifer Birch. 2001. Diagnosis of Defective Colour Vision (second ed.). Butterworth Heinemann, Linacre House, Jordan Hill, Oxford.","paperID":"None"},{"content":"Jennifer Birch, John L. Barbur, and Alister J. Harlow. 1992. New Method Based on Random Luminance Masking for Measuring Isochromatic Zones Using High Resolution Colour Displays. Ophthalmic & Physiological Optics: the Journal of the British College of Ophthalmic Opticians (Optometrists) 12, 2 (April 1992), 133--136.","paperID":"None"},{"content":"Barry L Cole. 2004. The handicap of abnormal colour vision. Clinical and Experimental Optometry 87, 4--5 (2004), 258--275.","paperID":"None"},{"content":"Dianne Cyr, Milena Head, and Hector Larios. 2010. Colour appeal in website design within and across cultures: A multi-method evaluation. International Journal of Human-Computer Studies 68, 1 (2010), 1--21.","paperID":"None"},{"content":"Finlay Dick, Sean Semple, Ruoling Chen, and Anthony Seaton. 2000. Neurological deficits in solvent-exposed painters: a syndrome including impaired colour vision, cognitive defects, tremor and loss of vibration sensation. QJM 93, 10 (2000), 655--661.","paperID":"None"},{"content":"Dean Farnsworth. 1943. Farnsworth-Munsell 100-Hue and Dichotomous Tests for Color Vision. Journal of the Optical Society of America (1917--1983) 33 (October 1943).","paperID":"None"},{"content":"Arthur D Fisk, Wendy A Rogers, Neil Charness, Sara J Czaja, and Joseph Sharit. 2009. Designing for older adults: Principles and creative human factors approaches. CRC press.","paperID":"None"},{"content":"David R. Flatla and Carl Gutwin. 2011. Improving calibration time and accuracy for situation-specific models of color differentiation. In ASSETS '11: Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility. 195--202.","paperID":"None"},{"content":"David R. Flatla and Carl Gutwin. 2012. SSMRecolor: Improving Recoloring Tools with Situation-specific Models of Color Differentiation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). 2297--2306. http://doi.acm.org/10.1145/2207676.2208388","paperID":"None"},{"content":"David R. Flatla, Katharina Reinecke, Carl Gutwin, and Krzysztof Z. Gajos. 2013. SPRWEB: Preserving Subjective Responses to Website Colour Schemes Through Automatic Recolouring. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). 2805--2806. http://doi.acm.org/10.1145/2468356.2479521","paperID":"None"},{"content":"Rui Gong, Haisong Xu, Binyu Wang, and Ming Ronnier Luo. 2012. Image quality evaluation for smart-phone displays at lighting levels of indoor and outdoor conditions. Optical Engineering 51, 8 (2012), 084001--1.","paperID":"None"},{"content":"Legrand H. Hardy, Gertrude Rand, and M. Catherine Rittler. 1954. HRR Polychromatic Plates. Journal of the Optical Society of America 44, 7 (1954), 509--521.","paperID":"None"},{"content":"Lane Harrison, Katharina Reinecke, and Remco Chang. 2015. Infographic Aesthetics: Designing for the First Impression. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1187--1190. http://doi.acm.org/10.1145/2702123.2702545","paperID":"None"},{"content":"Ken Hinckley, Jeff Pierce, Mike Sinclair, and Eric Horvitz. 2000. Sensing Techniques for Mobile Interaction. In Proceedings of the 13th Annual ACM Symposium on User Interface Software and Technology (UIST '00). 91--100. http://doi.acm.org/10.1145/354401.354417","paperID":"None"},{"content":"Shinobu Ishihara. 1917. Tests for colour-blindness. Pseudoisochromatic Plates. (1917).","paperID":"None"},{"content":"Julie A. Jacko, Max A. Dixon, Robert H. Rosa, Jr., Ingrid U. Scott, and Charles J. Pappas. 1999. Visual Profiles: A Critical Component of Universal Access. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). 330--337. http://doi.acm.org/10.1145/302979.303105","paperID":"None"},{"content":"Jaejeung Kim, Sergey Leksikov, Punyotai Thamjamrassri, Uichin Lee, and Hyeon-Jeong Suk. 2015. CrowdColor: Crowdsourcing Color Perceptions Using Mobile Devices. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). 478--483. http://doi.acm.org/10.1145/2785830.2785887","paperID":"None"},{"content":"Youn Jin Kim, M. Ronnier Luo, Wonhee Choe, Hong Suk Kim, Seung Ok Park, Yeseul Baek, Peter Rhodes, Seongdeok Lee, and Chang Yeong Kim. 2008. Factors affecting the psychophysical image quality evaluation of mobile phone displays: the case of transmissive liquid-crystal displays. Journal of the Optical Society of America 25, 9 (Sep 2008), 2215--2222.","paperID":"None"},{"content":"Kenneth Knoblauch, François Vital-Durand, and John L Barbur. 2001. Variation of chromatic sensitivity across the life span. Vision research 41, 1 (2001), 23--36.","paperID":"None"},{"content":"Giovane R Kuhn, Manuel M Oliveira, and Leandro AF Fernandes. 2008. An efficient naturalness-preserving image-recoloring method for dichromats. Visualization and Computer Graphics, IEEE Transactions on 14, 6 (2008), 1747--1754.","paperID":"None"},{"content":"Olof Lagerlöf. 1982. Tricyclic psychopharmaca and colour vision. Documenta Ophthalmologica Proceedings Series (1982).","paperID":"None"},{"content":"Po-Hung Lin and Wen-Hung Kuo. 2011. Image Quality of a Mobile Display under Different Illuminations. Perceptual and Motor Skills 113, 1 (2011), 215--228.","paperID":"None"},{"content":"Po-Hung Lin and Patrick Patterson. 2012. Investigation of perceived image quality and colourfulness in mobile displays for different cultures, ambient illumination, and resolution. Ergonomics 55, 12 (2012), 1502--1512.","paperID":"None"},{"content":"Peter Liu, Fahad Zafar, and Aldo Badano. 2014. The effect of ambient illumination on handheld display image quality. Journal of digital imaging 27, 1 (2014), 12--18.","paperID":"None"},{"content":"Ian J Murray, Neil RA Parry, Declan J McKeefry, and Athanasios Panorgias. 2012. Sex-related differences in peripheral human color vision: a color matching study. Journal of vision 12, 1 (2012), 18.","paperID":"None"},{"content":"Allen B. Poirson and Brian A. Wandell. 1990. The Ellipsoidal Representation of Spectral Sensitivity. Vision Research 30, 4 (1990), 647--652.","paperID":"None"},{"content":"Benedict C. Regan, J.P. Reffin, and John D. Mollon. 1994. Luminance Noise and the Rapid Determination of Discrimination Ellipses in Colour Deficiency. Vision Research 34, 10 (May 1994), 1279--1299.","paperID":"None"},{"content":"Katharina Reinecke and Krzysztof Z. Gajos. 2014. Quantifying Visual Preferences Around the World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 11--20. http://doi.acm.org/10.1145/2556288.2557052","paperID":"None"},{"content":"Maureen C. Stone. 2003. A Field Guide to Digital Color. A. K. Peters, Natick, Massachusetts, USA.","paperID":"None"},{"content":"Francoise Vienot, Hans Brettel, and John D. Mollon. 1999. Digital Video Colourmaps for Checking the Legibility of Displays by Dichromats. Color: Research and Applications 24, 4 (1999), 243--252.","paperID":"None"},{"content":"Colin Ware. 2012. Information visualization: perception for design. Elsevier.","paperID":"None"},{"content":"J. Terry Yates, Ioannis Diamantopoulos, and Franz-Josef Daumann. 2001. Acquired (transient and permanent) colour vision disorders. Operational Colour Vision in the Modern Aviation Environment, NATO RTO Technical Report 16 (2001), 43--47.","paperID":"None"}],"title":"Enabling Designers to Foresee Which Colors Users Cannot See","filename":"CHI16/p2693","authors":["Katharina Reinecke","David R. Flatla","Christopher Brooks"],"conference":"CHI '16"}