{"paperId":2858238,"citation":[],"reference":[{"content":"National Highway Traffic Safety Administration. 2013. Visual-Manual NHTSA Driver Distraction Guidelines for In-Vehicle Electronic Devices (Docket No. NHTSA-2010-0053).","paperID":"None"},{"content":"Erik M. Altmann and J. Gregory Trafton. 2002. Memory for goals: An activation-based model. Cognitive science 26, 1: 39-83.","paperID":"None"},{"content":"John R. Anderson and Dan Bothell. 1998. An Integrated Theory of List Memory. Journal of Memory and Language 38, 4: 341-380.","paperID":"None"},{"content":"Jelmer P. Borst, Niels A. Taatgen, and Hedderik van Rijn. 2010. The problem state: a cognitive bottleneck in multitasking. Journal of experimental psychology. Learning, memory, and cognition 36, 2: 363-82.","paperID":"None"},{"content":"Jelmer P. Borst, Niels A. Taatgen, and Hedderik van Rijn. 2015. What Makes Interruptions Disruptive? Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 2971-2980.","paperID":"None"},{"content":"L N Boyle, J D Lee, Y Peng, et al. Text Reading and Text Input Assessment in Support of the NHTSA Visual-Manual Driver Distraction Guidelines.","paperID":"None"},{"content":"Duncan P. Brumby, Dario D. Salvucci, and Andrew Howes. 2007. An empirical investigation into dualtask trade-offs while driving and dialing. Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI...but not as we know it - Volume 2, British Computer Society, 11-14.","paperID":"None"},{"content":"Michael D. Byrne and Susan Bovair. 1997. A Working Memory Model of a Common Procedural Error. Cognitive Science 21, 1: 31-61.","paperID":"None"},{"content":"Shamsi T. Iqbal and Brian P. Bailey. 2006. Leveraging characteristics of task structure to predict the cost of interruption. Proceedings of the SIGCHI conference on Human Factors in computing systems CHI '06, ACM Press, 741.","paperID":"None"},{"content":"Christian P. Janssen, Duncan P. Brumby, and Rae Garnett. 2012. Natural Break Points: The Influence of Priorities and Cognitive and Motor Cues on Dual-Task Interleaving. Journal of Cognitive Engineering and Decision Making 6, 1: 5-29.","paperID":"None"},{"content":"Christian P. Janssen and Duncan P. Brumby. 2010. Strategic adaptation to performance objectives in a dual-task setting. Cognitive science 34, 8: 1548--1560.","paperID":"None"},{"content":"Christian P. Janssen and Duncan P. Brumby. 2015. Strategic adaptation to task characteristics, incentives, and individual differences in dualtasking. PLoS One.","paperID":"None"},{"content":"George R. Kim, Allen R. Chen, Robert J. Arceci, et al. 2006. Error reduction in pediatric chemotherapy: computerized order entry and failure modes and effects analysis. Archives of pediatrics & adolescent medicine 160, 5: 495-8.","paperID":"None"},{"content":"Sheila G. Klauer, Feng Guo, Bruce G. SimonsMorton, Marie Claude Ouimet, Suzanne E. Lee, and Thomas A. Dingus. 2014. Distracted driving and risk of road crashes among novice and experienced drivers. New England Journal of Medicine 370, 1: 54-59.","paperID":"None"},{"content":"Tom Kontogiannis. 1999. User strategies in recovering from errors in man-machine systems. Safety Science 32, 1: 49-68.","paperID":"None"},{"content":"Tuomo Kujala and Dario D. Salvucci. 2015. Modeling visual sampling on in-car displays: The challenge of predicting safety-critical lapses of control. International Journal of Human-Computer Studies 79: 66-78.","paperID":"None"},{"content":"Christian Lebière, John R. Anderson, and Lynne M. Reder. 1994. Error Modeling in the ACT-R Production System. Proceedings of the Sixteenth Annual Conference of the Cognitive Science Society, 555-559.","paperID":"None"},{"content":"Ja Young Lee, Madeleine Gibson, and John D. Lee. 2015. Secondary task boundaries influence drivers' glance durations. Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications AutomotiveUI '15, ACM Press, 273-280.","paperID":"None"},{"content":"Y. Liang, John D. Lee, and L. Yekhshatyan. 2012. How Dangerous Is Looking Away From the Road? Algorithms Predict Crash Risk From Glance Patterns in Naturalistic Driving. Human Factors: The Journal of the Human Factors and Ergonomics Society 54, 6: 1104-1116.","paperID":"None"},{"content":"Helena Mentis and Geri Gay. 2003. User recalled occurrences of usability errors. CHI '03 extended abstracts on Human factors in computing systems CHI '03, ACM Press, 736-737.","paperID":"None"},{"content":"Jin Mo and Yves Crouzet. 1996. Human error tolerant design for air traffic control systems. In Probabilistic Safety Assessment and Management'96. 400-405.","paperID":"None"},{"content":"Donald A. Norman. 1983. Design rules based on analyses of human error. Communications of the ACM 26, 4: 254-258.","paperID":"None"},{"content":"Michael A. Regan, John D. Lee, and Kristie L. Young. 2008. Driver Distraction: Theory, Effects, and Mitigation. CRC Press.","paperID":"None"},{"content":"Dario D. Salvucci, M Zuber, Ekaterina Beregovaia, and Daniel Markley. 2005. Distract-R: Rapid prototyping and evaluation of in-vehicle interfaces. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 581-589.","paperID":"None"},{"content":"Dario D. Salvucci. 2006. Modeling Driver Behavior in a Cognitive Architecture. Human Factors: The Journal of the Human Factors and Ergonomics Society 48, 2: 362-380.","paperID":"None"},{"content":"Nadine B. Sarter and David D. Woods. 1995. How in the World Did We Ever Get into That Mode? Mode Error and Awareness in Supervisory Control. Human Factors: The Journal of the Human Factors and Ergonomics Society 37, 1: 5-19.","paperID":"None"},{"content":"J W Senders, A B Kristofferson, W H Levison, C W Dietrich, and J W McDonald. 1967. The attentional demand of automobile driving.","paperID":"None"},{"content":"Gabriel Skantze. 2005. Exploring human error recovery strategies: Implications for spoken dialogue systems. Speech Communication 45, 3: 325-341.","paperID":"None"},{"content":"J. Gregory Trafton, Erik M. Altmann, Derek P. Brock, and Farilee E. Mintz. 2003. Preparing to resume an interrupted task: effects of prospective goal encoding and retrospective rehearsal. International Journal of Human-Computer Studies 58, 5: 583-603.","paperID":"None"},{"content":"Dieter Zapf and James T. Reason. 1994. Introduction: Human Errors and Error Handling. Applied Psychology 43, 4: 427-432.","paperID":"None"},{"content":"SAE J2944 Operational Definitions of Driving Performance Measures and Statistics.","paperID":"None"},{"content":"SAE J2396 Definitions and Experimental Measures Related to the Specifications of Driver Visual Behavior Using Video Based Techniques.","paperID":"None"}],"abstract":"Human-technology interactions involving errors undermine acceptance and performance. The effect of errors and the ability to recover from them represent a particularly important consideration for design in safety-critical multitasking situations. However, few studies have considered the recovery process of errors in multitasking situations, such as their contribution to driver distraction. This paper investigates errors that drivers make interacting with an infotainment system. In this study, participants (N = 46) drove a stimulated vehicle and performed word entry tasks on a touch screen. Errors undermined driving and task performance. We also identified four different error recovery strategies and found that the accumulated information related to the driving situation and the characteristics of an infotainment system affected the choice of strategy. Implications for in-vehicle interface design, driver models, and general multitasking design are discussed.","title":"Error Recovery in Multitasking While Driving","filename":"CHI16/p5104","authors":["Ja Young Lee","Madeleine C. Gibson","John D. Lee"],"conference":"CHI '16"}