{"paperId":2858593,"citation":[],"reference":[{"content":"Pär-Anders Albinsson and Shumin Zhai. 2003. High precision touch screen interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03), 105--112. http://dx.doi.org/10.1145/642611.642631","paperID":"None"},{"content":"Oscar Kin-Chung Au, Xiaojun Su, and Rynson W.H. Lau. 2014. LinearDragger: a Linear Selector for Onefinger Target Acquisition. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 2607--2616. http://dx.doi.org/10.1145/2556288.2557096","paperID":"None"},{"content":"Shiri Azenkot and Shumin Zhai. 2012. Touch behavior with different postures on soft smartphone keyboards. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services (MobileHCI '12), 251--260. http://dx.doi.org/10.1145/2371572371612","paperID":"None"},{"content":"Patrick Baudisch and Gerry Chu. 2009. Back-of-device interaction allows creating very small touch devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1923--1932. http://dx.doi.org/10.1145/1518701.1518995","paperID":"None"},{"content":"Xiaojun Bi, Yang Li, and Shumin Zhai. 2013. FFitts law: modeling finger touch with fitts' law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1363--1372. http://dx.doi.org/10.1145/2470654.2466180","paperID":"None"},{"content":"Stephen Brewster, Faraz Chohan, and Lorna Brown. 200 Tactile feedback for mobile interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 159--162. http://dx.doi.org/10.1145/1240624.1240649","paperID":"None"},{"content":"Alex Butler, Shahram Izadi, and Steve Hodges. 200 SideSight: multi-\"touch\" interaction around small devices. In Proceedings of the 21st annual ACM symposium on User interface software and technology (UIST '08), 201--204. http://dx.doi.org/10.1145/1449715.1449746","paperID":"None"},{"content":"Andy Cockburn, David Ahlström, and Carl Gutwin. 2012. Understanding performance in touch selections: Tap, drag and radial pointing drag with finger, stylus and mouse. Int. J. Hum.-Comput. Stud. 70, 3 (March 2012), 218--233. http://dx.doi.org/10.1016/j.ijhcs.2011.002","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2009. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09), 121--124. http://dx.doi.org/10.1145/1622176.1622199","paperID":"None"},{"content":"Niels Henze, Enrico Rukzio, and Susanne Boll. 2012. Observational and experimental investigation of typing behaviour using virtual keyboards for mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2659--2668. http://dx.doi.org/10.1145/2207676.2208658","paperID":"None"},{"content":"Eve Hoggan and Stephen Brewster. 2007. Designing audio and tactile crossmodal icons for mobile devices. In Proceedings of the 9th international conference on Multimodal interfaces (ICMI '07), 162--169. http://dx.doi.org/10.1145/1322192.1322222","paperID":"None"},{"content":"Eve Hoggan, Stephen A. Brewster, and Jody Johnston. 2008. Investigating the effectiveness of tactile feedback for mobile touchscreens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 1573--1582. http://dx.doi.org/10.1145/1357054.1357300","paperID":"None"},{"content":"Christian Holz and Patrick Baudisch. 2010. The generalized perceived input point model and how to double touch accuracy by extracting fingerprints. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 581--590. http://dx.doi.org/10.1145/1753326.1753413","paperID":"None"},{"content":"Christian Holz and Patrick Baudisch. 2011. Understanding touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2501--2510. http://dx.doi.org/10.1145/1978942.1979308","paperID":"None"},{"content":"Luis A. Leiva, Alireza Sahami, Alejandro Catala, Niels Henze, and Albrecht Schmidt. 2015. Text Entry on Tiny QWERTY Soft Keyboards. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 669--678. http://dx.doi.org/10.1145/2702123.2702388","paperID":"None"},{"content":"Stephen Oney, Chris Harrison, Amy Ogan, and Jason Wiese. 2013. ZoomBoard: a diminutive qwerty soft keyboard using iterative zooming for ultra-small devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2799--2802. http://dx.doi.org/10.1145/2470654.2481387","paperID":"None"},{"content":"Anna Ostberg and Nada Matic. 2015. Hover Cursor: Improving Touchscreen Acquisition Of Small Targets With Hover-enabled Pre-selection. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15), 1723--1728. http://dx.doi.org/10.1145/2702613.2732903","paperID":"None"},{"content":"Jeeyea Park and Kwang-Hee Han. 2011. Effect of Target Size and Duration of Visual Feedback on Touch Screen. HCI International 2011-Posters' Extended Abstracts, 252--256.","paperID":"None"},{"content":"Richard L. Potter, Linda J. Weldon, and Ben Shneiderman. 1988. Improving the accuracy of touch screens: an experimental evaluation of three strategies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '88), 27--32. http://dx.doi.org/10.1145/57167.57171","paperID":"None"},{"content":"Ivan Poupyrev and Shigeaki Maruyama. 2003. Tactile interfaces for small touch screens. In Proceedings of the 16th annual ACM symposium on User interface software and technology (UIST '03), 217--220. http://dx.doi.org/10.1145/964696.964721","paperID":"None"},{"content":"Anne Roudaut, Stéphane Huot, and Eric Lecolinet. 2008. TapTap and MagStick: improving one-handed target acquisition on small touch-screens. In Proceedings of the working conference on Advanced visual interfaces (AVI '08), 146--153. http://dx.doi.org/10.1145/1385569.1385594","paperID":"None"},{"content":"Andrew Sears. 1991. Improving touchscreen keyboards: Design issues and a comparison with other devices. Interact. Comput. 3, 3: 253--269.","paperID":"None"},{"content":"Chao-Huai Su, Liwei Chan, Chien-Ting Weng, RongHao Liang, Kai-Yin Cheng, and Bing-Yu Chen. 2013. NailDisplay: bringing an always available visual display to fingertips. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1461--1464. http://dx.doi.org/10.1145/2470654.2466193","paperID":"None"},{"content":"Ahsanullah, Suziah Sulaiman, Ahmad Kamil Mahmood, and Muzafar Khan. 2015. Investigation of fingertip contact area and shape for precise target selection on multi-touch screen. In Proceedings of the 9th International Conference on Ubiquitous Information Management and Communication (IMCOM '15), Article 31, 6 pages. http://dx.doi.org/10.1145/2701126.2701209","paperID":"None"},{"content":"Keith Vertanen, Haythem Memmi, Justin Emge, Shyam Reyal, and Per Ola Kristensson. 2015. VelociTap: Investigating Fast Mobile Text Entry using SentenceBased Decoding of Touchscreen Keyboard Input. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 659--668. http://dx.doi.org/10.1145/2702123.2702135","paperID":"None"},{"content":"Daniel Vogel and Patrick Baudisch. 2007. Shift: a technique for operating pen-based interfaces using touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 657666. http://dx.doi.org/10.1145/1240624.1240727","paperID":"None"},{"content":"Feng Wang and Xiangshi Ren. 2009. Empirical evaluation for finger input properties in multi-touch interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1063--1072. http://dx.doi.org/10.1145/1518701.1518864","paperID":"None"},{"content":"Daniel Wigdor, Sarah Williams, Michael Cronin, Robert Levy, Katie White, Maxim Mazeev, and Hrvoje Benko. 2009. Ripples: utilizing per-contact visualizations to improve user interaction with touch displays. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09), 3--12. http://dx.doi.org/10.1145/1622176.1622180","paperID":"None"},{"content":"Shumin Zhai, Jing Kong, and Xiangshi Ren. 2004. Speed-accuracy tradeoff in Fitts' law tasks: on the equivalency of actual and nominal pointing precision. Int. J. Hum.-Comput. Stud. 61, 6 (December 2004), 823--856. http://dx.doi.org/10.1016/j.ijhcs.2004.09.007","paperID":"None"}],"abstract":"In this paper, we investigate the effects of post-selection feedback for acquiring ultra-small (2-4mm) targets on touchscreens. Post-selection feedback shows the contact point on touchscreen after a user lifts his/her fingers to increase users' awareness of touching. Three experiments are conducted progressively using a single crosshair target, two reciprocally acquired targets and 2D random targets. Results show that in average post-selection feedback can reduce touch error rates by 78.4%, with a compromise of target acquisition time no more than 10%. In addition, we investigate participants' adjustment behavior based on correlation between successive trials. We conclude that the benefit of post-selection feedback is the outcome of both improved understanding about finger/point mapping and the dynamic adjustment of finger movement enabled by the visualization of the touch point.","title":"Investigating Effects of Post-Selection Feedback for Acquiring Ultra-Small Targets on Touchscreen","filename":"CHI16/p4699","authors":["Chun Yu","Hongyi Wen","Wei Xiong","Xiaojun Bi","Yuanchun Shi"],"conference":"CHI '16"}