{"paperId":2858494,"citation":[],"reference":[{"content":"Victoria Bellotti and Abigail Sellen. 1993. Design for privacy in ubiquitous computing environments. In Proceedings of the Third European Conference on Computer-Supported Cooperative Work 13-17 September 1993, Milan, Italy ECSCW93. Springer, 77--92.","paperID":"None"},{"content":"Shea Bennett. 2013. Social Media 2013: User Demographics For Facebook, Twitter, Pinterest And Instagram . (2013). http://www.mediabistro.com/alltwitter/socialmedia-user-demographics_b38095.","paperID":"None"},{"content":"Michael S. Bernstein, Eytan Bakshy, Moira Burke, and Brian Karrer. 2013. Quantifying the Invisible Audience in Social Networks. In Proc. CHI 2013. ACM Press, 21--30.","paperID":"None"},{"content":"Ann Brown. 2014. Kiss Facebook's Controversial \"Sponsered Stories\" Ads Goodbye! Company Kills Unpopular Feature. (2014). http://madamenoire.com/340724/kiss-facebookscontroversial-sponsored-stories-ads-goodbyecompany-kills-unpopular-feature/.","paperID":"None"},{"content":"Moira Burke, Cameron Marlow, and Thomas Lento. 2009. Feed me: motivating newcomer contribution in social network sites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 945--954.","paperID":"None"},{"content":"Matthew Chalmers and Ian MacColl. 2003. Seamful and seamless design in ubiquitous computing. In Workshop At the Crossroads: The Interaction of HCI and Systems Issues in UbiComp.","paperID":"None"},{"content":"Jacques Ellul. 1983. Living Faith. (1983).","paperID":"None"},{"content":"Motahhare Eslami, Amirhossein Aleyasen, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015a. FeedVis: A Path for Exploring News Feed Curation Algorithms. In Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing. ACM, 65--68.","paperID":"None"},{"content":"Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015b. \"I Always Assumed that I Wasn't Really that Close to [Her]\": Reasoning About Invisible Algorithms in News Feeds. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15).","paperID":"None"},{"content":"Batya Friedman, David Hurley, Daniel C. Howe, Edward Felten, and Helen Nissenbaum. 2002. Users' Conceptions of Web Security: A Comparative Study. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). 746--747.","paperID":"None"},{"content":"D. Gentner and D.R. Gentner. 1982. Flowing Waters Or Teeming Crowds: Mental Models of Electricity. Defense Technical Information Center.","paperID":"None"},{"content":"Tarleton Gillespie. 2014. Facebooks algorithm why our assumptions are wrong, and our concerns are right. (2014). http://culturedigitally.org/2014/07/facebooks-algorithm-why-our-assumptions-arewrong-and-our-concerns-are-right/.","paperID":"None"},{"content":"Kevin Hamilton, Karrie Karahalios, Christian Sandvig, and Motahhare Eslami. 2014. A path to understanding the effects of algorithm awareness. In CHI 2014 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM Press, 631--642.","paperID":"None"},{"content":"J.T. Hancock. March 2015. The Facebook Study: A Personal Account of Data Science, Ethics and Change. (March 2015). Opening Keynote at CSCW 2015.","paperID":"None"},{"content":"Bernie Hogan. 2010. The presentation of self in the age of social media: Distinguishing performances and exhibitions online. Bulletin of Science, Technology & Society (2010), 0270467610385893.","paperID":"None"},{"content":"Willett Kempton. 1986. Two Theories of Home Heat Control. Cognitive Science 10, 1 (1986), 75--90.","paperID":"None"},{"content":"Kevin Lynch. 1960. The Image of the City. MIT Press: Cambridge.","paperID":"None"},{"content":"Donald MacKenzie. 1993. Inventing accuracy: a historical sociology of nuclear missile Guidance (reprint ed.). MIT Press, Cambridge, Mass. 478 pages.","paperID":"None"},{"content":"Lorenzo Magnani. 2001. Abduction, reason, and science: Processes of discovery and explanation. Kluwer Academic Publishers.","paperID":"None"},{"content":"NF 2014. Facebook Inc. How does News Feed decide which stories to show? (2014). https://www.facebook.com/help/166738576721085.","paperID":"None"},{"content":"Don Norman. 1988. The Psychology of Everyday Things. Basic Books: NY.","paperID":"None"},{"content":"D. A. Norman. 1987. Human-computer Interaction. Chapter Some Observations on Mental Models, 241--244.","paperID":"None"},{"content":"D. A. Norman. 1990. the art of human-computer interface design. Chapter why interfaces don't work.","paperID":"None"},{"content":"Nvivo 2015. Nvivo Tool. (2015). http://www.qsrinternational.com.","paperID":"None"},{"content":"Megan O'Neill. 2012. YouTube Responds To Reply Girls, Changes Related & Recommended Videos Algorithm. (2012). http://www.adweek.com/socialtimes/youtube-reply-girls/92439.","paperID":"None"},{"content":"C. O'Raifeartaigh and B.McCann. 2014. Einstein's cosmic model of 1931 revisited: an analysis and translation of a forgotten model of the universe. The European Physical Journal H 39 (2014).","paperID":"None"},{"content":"Erika Shehan Poole, Marshini Chetty, Rebecca E Grinter, and W Keith Edwards. 2008a. More than meets the eye: transforming the user experience of home network management. In Proceedings of the 7th ACM conference on Designing interactive systems. ACM, 455--464.","paperID":"None"},{"content":"Erika Shehan Poole, Christopher A. Le Dantec, James R. Eagan, and W. Keith Edwards. 2008b. Reflecting on the Invisible: Understanding End-user Perceptions of Ubiquitous Computing. In Proceedings of the 10th International Conference on Ubiquitous Computing (UbiComp '08). 192--201.","paperID":"None"},{"content":"Emilee Rader and Rebecca Gray. 2015. Understanding User Beliefs About Algorithmic Curation in the Facebook News Feed. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 173--182.","paperID":"None"},{"content":"Ruchi Sanghvi. 2006. Facebook Gets a Facelift. (2006). https://www.facebook.com/notes/facebook/facebook-gets-a-facelift/2207967130.","paperID":"None"},{"content":"Cooper Smith. 2013. 7 Statistics About Facebook Users That Reveal Why It's Such A Powerful Marketing Platform. (2013). http://www.mediabistro.com/alltwitter/socialmedia-user-demographics_b38095.","paperID":"None"},{"content":"Paul Thagard and Cameron Shelley. 1997. Abductive reasoning: Logic, visual thinking, and coherence. In Logic and scientific methods. Springer, 413--427.","paperID":"None"},{"content":"Jacob E Van Vleet. 2014. Dialectical Theology and Jacques Ellul: An Introductory Exposition. Augsburg Fortress Publishers.","paperID":"None"},{"content":"Mark Weiser. 1994. Creating the invisible interface. UIST1994.","paperID":"None"},{"content":"Oskar Wenneling. 2007. Seamful Design-The Other Way Around. SIDER 2007, the 3rd Scandinavian Student Interaction Design Research Conference (2007).","paperID":"None"},{"content":"Marianne Wiser and Susan Carey. 1983. When heat and temperature were one. Mental models (1983), 267--297.","paperID":"None"},{"content":"Steve Woolgar. 1990. Configuring the user: the case of usability trials. The Sociological Review 38, S1 (1990), 58--99.","paperID":"None"}],"abstract":"Many online platforms use curation algorithms that are opaque to the user. Recent work suggests that discovering a filtering algorithm's existence in a curated feed influences user experience, but it remains unclear how users reason about the operation of these algorithms. In this qualitative laboratory study, researchers interviewed a diverse, non-probability sample of 40 Facebook users before, during, and after being presented alternative displays of Facebook's News Feed curation algorithm's output. Interviews revealed 10 \"folk theories' of automated curation, some quite unexpected. Users who were given a probe into the algorithm's operation via an interface that incorporated \"seams,' visible hints disclosing aspects of automation operations, could quickly develop theories. Users made plans that depended on their theories. We conclude that foregrounding these automated processes may increase interface design complexity, but it may also add usability benefits.","title":"First I \"like\" it, then I hide it: Folk Theories of Social Feeds","filename":"CHI16/p2371","authors":["Motahhare Eslami","Karrie Karahalios","Christian Sandvig","Kristen Vaccaro","Aimee Rickman","Kevin Hamilton","Alex Kirlik"],"conference":"CHI '16"}