{"paperId":2858337,"citation":[],"reference":[{"content":"Sebastian Boring, Marko Jurmu, and Andreas Butz. 2009. Scroll, tilt or move it: using mobile phones to continuously control pointers on large public displays. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7 (OZCHI '09), 161--168. http://dx.doi.org/10.1145/1738826.1738853","paperID":"None"},{"content":"Patrick Chiu, Ashutosh Kapuskar, Sarah Reitmeier, and Lynn Wilcox. 1999. NoteLook: taking notes in meetings with digital video and ink. In Proceedings of the Seventh ACM international conference on Multimedia (Part 1) (MULTIMEDIA '99), 149--158. http://dx.doi.org/10.1145/319463.319483","paperID":"None"},{"content":"W. Keith Edwards, Mark W. Newman, Jana Z. Sedivy, and Trevor F. Smith. 2009. Experiences with recombinant computing: Exploring ad hoc interoperability in evolving digital networks. ACM Transactions on Computer-Human Interaction, 16, 1: 3, 44 pages. http://dx.doi.org/10.1145/1502800.1502803","paperID":"None"},{"content":"Carl Gutwin and Saul Greenberg. 2002. A descriptive framework of workspace awareness for real-time groupware. Computer Supported Cooperative Work, CSCW, 11, 3-4: 411--446. http://dx.doi.org/10.1023/A:1021271517844","paperID":"None"},{"content":"Edward T. Hall. 1966. The Hidden Dimension. Doubleday & Co.","paperID":"None"},{"content":"Izdihar Jamil, Mark Perry, Kenton O'Hara, Abhijit Karnik, Mark T. Marshall, Swathi Jha, Sanjay Gupta, and Sriram Subramanian. 2012. Group interaction on interactive multi-touch tables by children in India. In Proceedings of the 11th International Conference on Interaction Design and Children (IDC '12), 224--227. http://doi.acm.org/10.1145/2307096.2307131","paperID":"None"},{"content":"Adam Kendon. 2010. Spacing and orientation in copresent interaction. In Development of Multimodal Interfaces: Active Listening and Synchrony, Lecture Notes in Computer Science, 5967, Springer Berlin Heidelberg, 1--15. http://dx.doi.org/10.1007/978--3--64212397--9_1","paperID":"None"},{"content":"Andrés Lucero, Jussi Holopainen, and Tero Jokela. 2011. Pass-them-around: collaborative use of mobile phones for photo sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1787--1796. http://dx.doi.org/10.1145/1978942.1979201","paperID":"None"},{"content":"Paul Luff and Christian Heath. 1998. Mobility in collaboration. In Proceedings of the 1998 ACM Conference on Computer Supported Cooperative Work (CSCW '98), 305--314. http://dx.doi.org/10.1145/289444.289505","paperID":"None"},{"content":"Neema Moraveji, Taemie Kim, James Ge, Udai Singh Pawar, Kathleen Mulcahy, and Kori Inkpen. 2008. Mischief: supporting remote teaching in developing regions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 353--362. http://dx.doi.org/10.1145/1357054.1357114","paperID":"None"},{"content":"Brad A. Myers, Herb Stiel, and Robert Gargiulo. 1998. Collaboration using multiple PDAs connected to a PC. In Proceedings of the 1998 ACM Conference on Computer Supported Cooperative Work (CSCW '98), 285--294. http://dx.doi.org/10.1145/289444.289503","paperID":"None"},{"content":"Les Nelson, Satoshi Ichimura, Elin Rønby Pedersen, and Lia Adams. 1999. Palette: a paper interface for giving presentations. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '99), 354--361. http://dx.doi.org/10.1145/302979.303109","paperID":"None"},{"content":"Ji-Young Oh, and Wolfgang Stuerzlinger. 2002. Laser pointers as collaborative pointing devices. Graphics Interface, 2002, 141--149. Retrieved December 23, 2015 from http://graphicsinterface.org/wpcontent/uploads/gi2002--17.pdf","paperID":"None"},{"content":"Gary Olson and Judith Olson. 2003. Mitigating the effects of distance on collaborative intellectual work. Economics of Innovation and New Technology, 12, 1: 27--42. http://dx.doi.org/10.1080/10438590303117","paperID":"None"},{"content":"Kenton P. O'Hara and Stephen J. Payne. 1998. The effects of operator implementation cost on planfulness of problem solving and learning. Cognitive psychology, 35, 1: 34--70. http://dx.doi.org/10.1006/cogp.1997.0676","paperID":"None"},{"content":"Microsoft Research, 2015. Office Remote. Retrieved December 23, 2015 from http://research.microsoft.com/enus/projects/officeremote/","paperID":"None"},{"content":"Jeremy Roschelle. 2003. Keynote paper: Unlocking the learning value of wireless mobile devices. Journal of Computer Assisted Learning 19, 3: 260--272. http://dx.doi.org/10.1046/j.0266--4909.2003.00028.x","paperID":"None"}],"abstract":"Slide presentations have long been stuck in a one-to-many paradigm, limiting audience engagement. Based on the concept of smartphone-based remote control of slide navigation, we present Office Social-a PowerPoint plugin and companion smartphone app that allows audience members qualified access to slides for personal review and, when the presenter enables it, public control over slide navigation. We studied the longitudinal use of Office Social across four meetings of a workgroup. We found that shared access and regulated control facilitated various forms of public and personal audience engagement. We discuss how enabling ad-hoc aggregation of co-proximate devices reduces 'interaction costs' and leads to both opportunities and challenges for presentation situations.","title":"Office Social: Presentation Interactivity for Nearby Devices","filename":"CHI16/p2487","authors":["Debaleena Chattopadhyay","Kenton O'Hara","Sean Rintel","Roman Rädle"],"conference":"CHI '16"}