{"paperId":2858131,"citation":[],"abstract":"A critical aspect of formal help-giving tasks in the enterprise is finding the right expert. We built and evaluated a tool, Find an Expert, to examine what the most important expert selection criteria are for help-seekers and how to represent them in expert selection interfaces for formal help-giving tasks. We observed users' expert selection decisions and found that the diversity of topic expertise and the amount of related experience were significantly important in helping users decide which expert to contact. Through self-reported data from users, we found that in addition to expertise and experience, expert accessibility indicators, like online availability and language proficiency, were considered important criteria for selecting experts. Finally, publicly-displayed crowdsourced ratings of experts, while deemed useful indicators of expert quality by help-seekers, raised concerns for experts. We conclude with suggestions regarding the design of expert selection interfaces for formal help-giving tasks.","reference":[{"content":"Krisztian Balog, Leif Azzopardi, and Maarten De Rijke. 2006. Formal models for expert finding in enterprise corpora. In Proceedings of ACM SIGIR. 43--50. http://dl.acm.org/citation.cfm?id=1148181","paperID":"None"},{"content":"Albert-Lszl Barabsi and Rka Albert. 1999. Emergence of Scaling in Random Networks. Science 286, 5439 (1999), 509--512. DOI: http://dx.doi.org/10.1126/science.286.5439.509","paperID":"None"},{"content":"Mathieu Bastian, Matthew Hayes, William Vaughan, Sam Shah, Peter Skomoroch, Hyungjin Kim, Sal Uryasev, and Christopher Lloyd. 2014. LinkedIn Skills: Large-scale Topic Extraction and Inference. In Proceedings of the ACM Conference on Recommender Systems (RecSys '14). ACM, New York, NY, USA, 1--8. DOI:http://dx.doi.org/10.1145/2645710.2645729","paperID":"None"},{"content":"Michael S. Bernstein, Mark S. Ackerman, Ed H. Chi, and Robert C. Miller. 2011. The Trouble with Social Computing Systems Research. In Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 389--398. DOI: http://dx.doi.org/10.1145/1979742.1979618","paperID":"None"},{"content":"David M. Blei, Andrew Y. Ng, and Michael I. Jordan. 2003. Latent dirichlet allocation. the Journal of machine Learning research 3 (2003), 993--1022. http://dl.acm.org/citation.cfm?id=944937","paperID":"None"},{"content":"Mike Bostock. 2012. Sunburst Partition. Web. (13 November 2012). Retrieved September 15, 2015 from http://bl.ocks.org/mbostock/4063423.","paperID":"None"},{"content":"Kevin Robert Canini, Bongwon Suh, and Peter L. Pirolli. 2011. Finding credible information sources in social networks based on content and social structure. In Proceedings of the IEEE Third International Conference on Social Computing (SocialCom). 1--8. http://ieeexplore.ieee.org/xpls/abs_all.jsp? arnumber=6113088","paperID":"None"},{"content":"Munmun De Choudhury, Hari Sundaram, Ajita John, and Dore Duncan Seligmann. 2007. Context aware routing of enterprise user communications. In IEEE PerCom Workshops. 39--44. http://ieeexplore.ieee. org/xpls/abs_all.jsp?arnumber=4144790","paperID":"None"},{"content":"Jason Chuang, Daniel Ramage, Christopher Manning, and Jeffrey Heer. 2012. Interpretation and Trust: Designing Model-driven Visualizations for Text Analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 443--452. DOI: http://dx.doi.org/10.1145/2207676.2207738","paperID":"None"},{"content":"Leonard N. Foner. 1997. Yenta: A Multi-agent, Referral-based Matchmaking System. In Proceedings of the First International Conference on Autonomous Agents (AGENTS '97). ACM, New York, NY, USA, 301--307. DOI: http://dx.doi.org/10.1145/267658.267732","paperID":"None"},{"content":"John Fox and Sanford Weisberg. 2015. Mixed-Effects Models in R, An Appendix to An R Companion to Applied Regression, Second Edition. Web. (23 January 2015). Retrieved September 15, 2015 from http://socserv.mcmaster.ca/jfox/Books/ Companion/appendix/Appendix-Mixed-Models.pdf.","paperID":"None"},{"content":"Morten Hertzum. 2014. Expertise Seeking: A Review. Information Processing and Management 50, 5 (Sept. 2014), 775--795. DOI: http://dx.doi.org/10.1016/j.ipm.2014.04.003","paperID":"None"},{"content":"Henry Kautz, Bart Selman, and Mehul Shah. 1997. Referral Web: Combining Social Networks and Collaborative Filtering. Commun. ACM 40, 3 (March 1997), 63--65. DOI: http://dx.doi.org/10.1145/245108.245123","paperID":"None"},{"content":"Ching-Yung Lin, Nan Cao, Shi Xia Liu, Spiros Papadimitriou, Jimeng Sun, and Xifeng Yan. 2009. SmallBlue: Social Network Analysis for Expertise Search and Collective Intelligence. In Proceedings of IEEE ICDE. 1483--1486. DOI: http://dx.doi.org/10.1109/ICDE.2009.140","paperID":"None"},{"content":"Lena Mamykina, Bella Manoim, Manas Mittal, George Hripcsak, and Björn Hartmann. 2011. Design Lessons from the Fastest Q&a Site in the West. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2857--2866. DOI: http://dx.doi.org/10.1145/1978942.1979366","paperID":"None"},{"content":"David W. McDonald and Mark S. Ackerman. 1998. Just talk to me: a field study of expertise location. In Proceedings of the ACM conference on Computer supported cooperative work. 315--324. http://dl.acm.org/citation.cfm?id=289506","paperID":"None"},{"content":"Saeedeh Momtazi and Felix Naumann. 2013. Topic modeling for expert finding using LDA. Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery 3, 5 (2013), 346--353. DOI: http://dx.doi.org/10.1002/widm.1102","paperID":"None"},{"content":"Julian E. Orr. 1996. Talking about Machines: An Ethnography of a Modern Job. ILR Press. https://books.google.com/books?id=8ZBFI_i1nqUC","paperID":"None"},{"content":"Sharoda A. Paul and Joseph W. Bolinger. 2015. Ask an Expert: Mobile Workspaces for Collaborative Troubleshooting. In Hawaii International Conference on System Sciences (HICSS). 442--451. DOI: http://dx.doi.org/10.1109/HICSS.2015.60","paperID":"None"},{"content":"Sharoda A. Paul, Lichan Hong, and Ed H. Chi. 2012. Who is Authoritative? Understanding Reputation Mechanisms in Quora. In Proceedings of Collective Intelligence Conference. http://arxiv.org/abs/1204.3724","paperID":"None"},{"content":"Tim Reichling and Volker Wulf. 2009. Expert Recommender Systems in Practice: Evaluating Semi-automatic Profile Generation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 59--68. DOI: http://dx.doi.org/10.1145/1518701.1518712","paperID":"None"},{"content":"A. W. Rivadeneira, Daniel M. Gruen, Michael J. Muller, and David R. Millen. 2007. Getting Our Head in the Clouds: Toward Evaluation Studies of Tagclouds. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 995--998. DOI: http://dx.doi.org/10.1145/1240624.1240775","paperID":"None"},{"content":"Kerry Rodden. 2013. Sequences Sunburst. Web. (21 October 2013). Retrieved September 15, 2015 from http://bl.ocks.org/kerryrodden/7090426.","paperID":"None"},{"content":"N. Sadat Shami, Kate Ehrlich, Geri Gay, and Jeffrey T. Hancock. 2009. Making sense of strangers' expertise from signals in digital artifacts. In Proc. ACM CHI. 69--78. http://dl.acm.org/citation.cfm?id=1518713","paperID":"None"},{"content":"Alison Smith, Timothy Hawes, and Meredith Myers. 2014. Hierarchie: Interactive Visualization for Hierarchical Topic Models. In Proceedings of the Workshop on Interactive Language Learning, Visualization, and Interfaces. 71--78. http://nlp.stanford.edu/events/illvi2014/ papers/smith-illvi2014b.pdf","paperID":"None"},{"content":"John Stasko, Richard Catrambone, Mark Guzdial, and Kevin McDonald. 2000. An Evaluation of Space-filling Information Visualizations for Depicting Hierarchical Structures. International Journal of Human-Computer Studies 53, 5 (Nov. 2000), 663--694. DOI: http://dx.doi.org/10.1006/ijhc.2000.0420","paperID":"None"},{"content":"A. Strauss and J.M. Corbin. 1998. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. SAGE Publications. https://books.google.com/books?id=wTwYUnHYsmMC","paperID":"None"},{"content":"L.A. Streeter and K.E. Lochbaum. 1988. An expert/expert-locating system based on automatic representation of semantic structure. In Proceedings of the Fourth Conference on Artificial Intelligence Applications. 345--350. DOI: http://dx.doi.org/10.1109/CAIA.1988.196129","paperID":"None"},{"content":"Svetlana Yarosh, Tara Matthews, and Michelle Zhou. 2012. Asking the right person: supporting expertise selection in the enterprise. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems. 2247--2256. http://dl.acm.org/citation.cfm?id=2208382","paperID":"None"},{"content":"Svetlana Yarosh, Tara Matthews, Michelle Zhou, and Kate Ehrlich. 2013. I need someone to help!: a taxonomy of helper-finding activities in the enterprise. In Proceedings of the ACM conference on Computer supported cooperative work. 1375--1386. http://dl.acm.org/citation.cfm?id=2441931","paperID":"None"}],"title":"Find an Expert: Designing Expert Selection Interfaces for Formal Help-Giving","filename":"CHI16/p3038","authors":["Sharoda A. Paul"],"conference":"CHI '16"}