{"paperId":2858417,"reference":[{"content":"Apple. Siri. https://www.apple.com/ios/siri/.","paperID":"None"},{"content":"Autographer. Autographer Wearable Camera. http://autographer.com.","paperID":"None"},{"content":"Jeff Brown. ZBar bar code reader. http://zbar.sourceforge.net/index.html.","paperID":"None"},{"content":"K. E. Caine. 2009. Supporting privacy by preventing misclosure. In CHI'09 Extended Abstracts on Human Factors in Computing Systems. ACM, 3145-3148.","paperID":"None"},{"content":"Kelly E. Caine, Celine Y. Zimmerman, Zachary Schall-Zimmerman, William R. Hazlewood, Alexander C. Sulgrove, L. Jean Camp, Katherine H. Connelly, Lesa L. Huber, and Kalpana Shankar. 2010. DigiSwitch: Design and Evaluation of a Device for Older Adults to Preserve Privacy While Monitoring Health at Home. In Proceedings of the 1st ACM International Health Informatics Symposium. 153-162.","paperID":"None"},{"content":"D. Castro, S. Hickson, V. Bettadapura, E. Thomaz, G. Abowd, H. Christensen, and I. Essa. 2015. Predicting daily activities from egocentric images using deep learning. In Proceedings of the ACM International Symposium on Wearable Computers.","paperID":"None"},{"content":"Ken Chatfield, Victor Lempitsky, Andrea Vedaldi, and Andrew Zisserman. 2011. The devil is in the details: an evaluation of recent feature encoding methods. In Proceedings of the British Machine Vision Conference.","paperID":"None"},{"content":"Fanny Coudert, Denis Butin, and Daniel Le Metayer. 2015. Body-worn cameras for police accountability: Opportunities and risks. Computer Law & Security Review 31 (2015), 749-762.","paperID":"None"},{"content":"Navneet Dalal and Bill Triggs. 2005. Histograms of Oriented Gradients for Human Detection. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 886-893.","paperID":"None"},{"content":"C. Delo. 2013. U.S. Adults Now Spending More Time on Digital Devices Than Watching TV. Advertising Age (2013).","paperID":"None"},{"content":"T. Denning, Z. Dehlawi, and T. Kohno. 2014. In Situ with Bystanders of Augmented Reality Glasses: Perspectives on Recording and Privacy-Mediating Technologies. In Proceedings of the International Conference on Human Factors in Computing Systems.","paperID":"None"},{"content":"K. Fukuchi. libqrencode. http://http://fukuchi.org/works/qrencode/.","paperID":"None"},{"content":"Google. Google Glass. https://plus.google.com/+GoogleGlass/posts.","paperID":"None"},{"content":"Steve Hodges, Lyndsay Williams, Emma Berry, Shahram Izadi, James Srinivasan, Alex Butler, Gavin Smyth, Narinder Kapur, and Ken Wood. 2006. SenseCam: a Retrospective Memory Aid. In Proceedings of the ACM International Conference on Ubiquitous Computing.","paperID":"None"},{"content":"Roberto Hoyle, Robert Templeman, Denise Anthony, David Crandall, and Apu Kapadia. 2015. Sensitive Lifelogs: A Privacy Analysis of Photos from Wearable Cameras. In ACM SIGCHI Conference on Human Factors in Computing Systems.","paperID":"None"},{"content":"R. Hoyle, R. Templeman, S. Armes, D. Anthony, D. Crandall, and A. Kapadia. 2014. Privacy behaviors of lifeloggers using wearable cameras. In Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing. 571-582.","paperID":"None"},{"content":"S. Jana, D. Molnar, A. Moshchuk, A. M. Dunn, B. Livshits, H. J. Wang, and E. Ofek. 2013a. Enabling Fine-Grained Permissions for Augmented Reality Applications with Recognizers. In USENIX Security. 415-430.","paperID":"None"},{"content":"S. Jana, A. Narayanan, and V. Shmatikov. 2013b. A Scanner Darkly: Protecting User Privacy From Perceptual Applications. In Proceedings of the IEEE Symposium on Security and Privacy.","paperID":"None"},{"content":"Yangqing Jia. 2013. Caffe: An Open Source Convolutional Architecture for Fast Feature Embedding. http://caffe.berkeleyvision.org/. (2013).","paperID":"None"},{"content":"Apu Kapadia, Tristan Henderson, Jeffrey J. Fielding, and David Kotz. 2007. Virtual Walls: Protecting Digital Privacy in Pervasive Environments. In Proceedings of the Fifth International Conference on Pervasive Computing, Vol. 4480. 162-179.","paperID":"None"},{"content":"P. Klemperer, Y. Liang, M. Mazurek, M. Sleeper, B. Ur, L. Bauer, L.F. Cranor, N. Gupta, and M. Reiter. 2012. Tag, you can see it!: using tags for access control in photo sharing. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems. ACM, 377-386.","paperID":"None"},{"content":"Mohammed Korayem, Robert Templeman, Dennis Chen, David Crandall, and Apu Kapadia. 2014. ScreenAvoider: Protecting Computer Screens from Ubiquitous Cameras. arXiv 1412.0008.","paperID":"None"},{"content":"A. Krizhevsky, I. Sutskever, and G.E. Hinton. 2012. Imagenet classification with deep convolutional neural networks. In Advances in neural information processing systems. 1097-1105.","paperID":"None"},{"content":"Michael S. Lam, Suneeta Godbole, Jacqueline Chen, Melody Oliver, Hannah Badland, Simon J. Marshall, Paul Kelly, Charlie Foster, Aiden Doherty, and Jacqueline Kerr. 2013. Measuring Time Spent Outdoors Using a Wearable Camera and GPS. In Proceedings of the 4th International SenseCam Pervasive Imaging Conference. 1-7.","paperID":"None"},{"content":"Marc Langheinrich. 2002. A Privacy Awareness System for Ubiquitous Computing Environments. In Proceedings of the ACM International Conference on Ubiquitous Computing. Vol. 2498. 237-245.","paperID":"None"},{"content":"Y. LeCun, L. Bottou, Y. Bengio, and P. Haffner. 1998. Gradient-based learning applied to document recognition. Proc. IEEE 11, 86 (1998), 2278-2324.","paperID":"None"},{"content":"David G. Lowe. 2004. Distinctive Image Features from Scale-Invariant Keypoints. International Journal of Computer Vision 60, 2 (Nov. 2004), 91-110.","paperID":"None"},{"content":"Gabriela Marcu, Anind K. Dey, and Sara Kiesler. 2012. Parent-driven Use of Wearable Cameras for Autism Support: A Field Study with Families. In Proceedings of the ACM International Conference on Ubiquitous Computing. 401-410.","paperID":"None"},{"content":"Narrative. Narrative Clip: a wearable, automatic lifelogging camera. http://getnarrative.com.","paperID":"None"},{"content":"M. Oquab, L. Bottou, I. Laptev, and J. Sivic. 2014. Learning and Transferring Mid-Level Image Representations using Convolutional Neural Networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition.","paperID":"None"},{"content":"Nisarg Raval, Landon Cox, Animesh Srivastava, Ashwin Machanavajjhala, and Kiron Lebeck. 2014. MarkIt: privacy markers for protecting visual secrets. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication. 1289-1295.","paperID":"None"},{"content":"Franziska Roesner, Tadayoshi Kohno, and David Molnar. 2013. Security and Privacy for Augmented Reality Systems. Commun. ACM (2013).","paperID":"None"},{"content":"Franziska Roesner, David Molnar, Alexander Moshchuk, Tadayoshi Kohno, and Helen J Wang. 2014. World-Driven Access Control for Continuous Sensing. Microsoft Tech Report (2014).","paperID":"None"},{"content":"Olga Russakovsky, Jia Deng, Hao Su, Jonathan Krause, Sanjeev Satheesh, Sean Ma, Zhiheng Huang, Andrej Karpathy, Aditya Khosla, Michael Bernstein, Alexander C. Berg, and Li Fei-Fei. 2014. ImageNet Large Scale Visual Recognition Challenge. arXiv 1409.0575.","paperID":"None"},{"content":"R. Templeman, A. Kapadia, R. Hoyle, and D. Crandall. 2014a. Reactive Security: Responding to Visual Stimuli from Wearable Cameras. In Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication. 1297-1306.","paperID":"None"},{"content":"R Templeman, M. Korayem, D. Crandall, and K. Kapadia. 2014b. PlaceAvoider: Steering First-Person Cameras away from Sensitive Spaces. In Network and Distributed System Security Symposium.","paperID":"None"},{"content":"Edison Thomaz, Aman Parnami, Jonathan Bidwell, Irfan Essa, and Gregory D. Abowd. 2013. Technological Approaches for Addressing Privacy Concerns when Recognizing Eating Behaviors with Wearable Cameras. In Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing. 739-748.","paperID":"None"},{"content":"Nancy A Van House and Marc Davis. 2005. The social life of cameraphone images. In Proceedings of the Pervasive Image Capture and Sharing: New Social Practices and Implications for Technology Workshop at the Seventh International Conference on Ubiquitous Computing.","paperID":"None"},{"content":"Jing Wang, Grant Schindler, and Irfan Essa. 2012. Orientation-aware Scene Understanding for Mobile Cameras. In Proceedings of the ACM International Conference on Ubiquitous Computing. 260-269.","paperID":"None"}],"citation":[],"abstract":"Low-cost, lightweight wearable cameras let us record (or 'lifelog') our lives from a 'first-person' perspective for purposes ranging from fun to therapy. But they also capture private information that people may not want to be recorded, especially if images are stored in the cloud or visible to other people. For example, recent studies suggest that computer screens may be lifeloggers' single greatest privacy concern, because many people spend a considerable amount of time in front of devices that display private information. In this paper, we investigate using computer vision to automatically detect computer screens in photo lifelogs. We evaluate our approach on an existing in-situ dataset of 36 people who wore cameras for a week, and show that our technique could help manage privacy in the upcoming era of wearable cameras.","title":"Enhancing Lifelogging Privacy by Detecting Screens","filename":"CHI16/p4309","authors":["Mohammed Korayem","Robert Templeman","Dennis Chen","David Crandall","Apu Kapadia"],"conference":"CHI '16"}