{"paperId":2858153,"citation":[],"reference":[{"content":"Konstantin Aal, George Yerousis, Kai Schubert, Dominik Hornung, Oliver Stickel, and Volker Wulf. 2014. Come_in@palestine: adapting a german computer club concept to a palestinian refugee camp. In Proceedings of the 5th ACM international conference on Collaboration across boundaries: culture, distance & technology (CABS '14). ACM, NY, NY, USA, 111--120. http://dx.doi.org/10.1145/2631488.2631498","paperID":"None"},{"content":"Ban Al-Ani, Gloria Mark, Justin Chung, and Jennifer Jones. 2012. The Egyptian blogosphere: a counternarrative of the revolution. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 1726. http://dx.doi.org/10.1145/2145204.2145213","paperID":"None"},{"content":"Anne Alexander and Miriyam Aouragh. 2014. Egypt's unfinished revolution: the role of the media revisited. International Journal of Communication, 8: 890--915.","paperID":"None"},{"content":"Mariam Asad and Christopher A. Le Dantec. 2015. Illegitimate Civic Participation: Supporting Community Activists on the Ground. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1694--1703. http://dx.doi.org/10.1145/2675133.2675156","paperID":"None"},{"content":"Ioannis Armakolas and Maja Maksimovic. 2013. \"Babylution\": A Civic Awakening in Bosnia and Herzegovina?. Eliamep Working Paper 34. Hellenic Foundation for European and Foreign Policy.","paperID":"None"},{"content":"Brüsemeister Thomas. 2008. Qualitative Forschung. Springer.","paperID":"None"},{"content":"Vedava Barakovic. 2011. Facebook Revolutions: The Case of Bosnia and Herzegovina. Acta Universitatis Sapientiae. Social Analysis 1,2: 194-205.","paperID":"None"},{"content":"Buka. Facebook Group (>204000 members). Retrieved January 04, 2015 from https://facebook.com/bukamagazin","paperID":"None"},{"content":"Business Monitor International. 2015. Telecommunications Report. Retrieved January 28, 2015 from http://marketresearch.com/BusinessMonitor-International-v304/Bosnia-HerzegovinaTelecommunications-Q1--8516444","paperID":"None"},{"content":"Neal Caren and Sarah Gaby. 2011. Occupy Online: Facebook and the Spread of Occupy Wall Street. Social Science Reseach Network. Retrieved on June 15 2014 from http://dx.doi.org/10.2139/ssrn.1943168","paperID":"None"},{"content":"Namik Colakovic and Markic Marinko. 2010. Informacione i komunikacione tehnologije u funkciji zaštite okoliša. In Univerzitetska Hronika 5, University of Travnik, Travnik, B-H: 175--181.","paperID":"None"},{"content":"Delegation of European Union to B-H. 2014. Civil Society. Retrieved February 28, 2015 from http://europa.ba/Default.aspx?id=33&lang=EN","paperID":"None"},{"content":"John Dewey and Melvin. L. Rogers. 2012. The Public and Its Problems: An Essay in Political Inquiry. Penn State University Press","paperID":"None"},{"content":"European Commission. 2014. Key findings of the Progress Report on Bosnia and Herzegovina. Retrieved February 28, 2015 from http://ec.europa.eu/enlargement/pdf/key_documents/2014/20141008bosnia-and-herzegovina-progress-report_en.pdf","paperID":"None"},{"content":"E-trafika. Facebook Group (>10700 members). Retrieved January 04, 2015 from https://facebook.com/etrafika","paperID":"None"},{"content":"Friedrich Ebert Stiftung B-H. Facebook Group (>820 members). Retrieved January 04, 2015 from https://facebook.com/FESBiH","paperID":"None"},{"content":"James Paul Gee. 2014. An Introduction to Discourse Analysis: Theory and Method (4th. ed.). Routledge.","paperID":"None"},{"content":"General Framework Agreement for Peace in Bosnia & Herzegovina. 1995. Retrieved December 28, 2015 from http://peacemaker.un.org/sites/peacemaker.un.org/files/BA_951121_DaytonAgreement.pdf","paperID":"None"},{"content":"Jeremy Goecks, Amy Voida, Stephen Voida, and Elizabeth D. Mynatt. 2008. Charitable technologies: opportunities for collaborative computing in nonprofit fundraising. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08). ACM, NY, NY, USA, 689698. http://dx.doi.org/10.1145/1460563.1460669","paperID":"None"},{"content":"Michael Gurstein. 1999. Community Informatics: Enabling Communities with Information and Communications Technologies. Idea Group Publishing.","paperID":"None"},{"content":"Claire Hardaker. 2010. Trolling in asynchronous computer-mediated communication: From user discussions to academic definitions. Journal of Politeness Research 6: 215--242. http://dx.doi.org/10.1515/JPLR.2010.011","paperID":"None"},{"content":"Cornelia Helfferich. 2009. Die Qualität qualitativer Daten - Manual für die Durchführung qualitativer Interviews (4th ed.). Verlag für Sozialwissenschaften.","paperID":"None"},{"content":"Simon Hegelich. 2015. Social Botnets als politische Meinungsmacher in der Ukraine: Big-Data-Methoden zur Analyse von Twitter-Manipulationen. Retrieved April 20th, 2015 from http://www.rundfunkinstitut.uni-koeln.de/sites/rundfunk/Tagungen/Tagung2015/Hegelich.pdf","paperID":"None"},{"content":"Helsinski parlament gradjana. Facebook Group (>1300 members). Retrieved January 04, 2015 from https://facebook.com/pages/Helsin%C5%A1kiparlament-gra%C4%91ana-BanjaLuka/1425435307682325","paperID":"None"},{"content":"Hocemo JMBG za nasu djecu. Facebook Group (>1740 members). Retrieved January 04, 2015 from https://facebook.com/groups/592849114079390","paperID":"None"},{"content":"Philip N. Howard. 2011. The Digital Origins of Dictatorship and Democracy: Information Technology and Political Islam. Oxford University Press","paperID":"None"},{"content":"Mariea Grubbs Hoy and Joseph Phelps. 2008. Online privacy and security practices of the 100 largest US nonprofit organizations. In International Journal of Nonprofit and Voluntary Sector Marketing, 14, 1: 71- 82. http://dx.doi.org/10.1002/nvsm.344","paperID":"None"},{"content":"Internet World Stats. 2015. Retrieved February 28, 2015 from http://internetworldstats.com/stats4.htm","paperID":"None"},{"content":"Jeffrey S. Juris. 2012. Reflections on #Occupy Everywhere: Social media, public space, and emerging logics of aggregation. In American Ethnologist 39: 259-279. http://dx.doi.org/10.1111/j.1548--1425.2012.01362.x","paperID":"None"},{"content":"Andrea Jonjic. 2014. Auf Lethargie folgt Revolution? Die Proteste in Bosnien und Herzegowina. Retrieved on March 3, 2014 from http://sicherheitspolitikblog.de/2014/03/03/auf-lethargie-folgt-revolution-dieproteste-in-bosnien-und-herzegowina","paperID":"None"},{"content":"Stefan Karganovic. 2014. Kako se priprema puc tehnologija obojenih revolucija. In Rusenje Republike Srpske -Teorija i tehnologija prevrata, Stefan Karganovic, Pjotr Iljcenkov, John Lockland, Irina Lebedeva, Johnatan Movat and Nebojsa Malic. Besjeda, Banja Luka, B-H, 14--15.","paperID":"None"},{"content":"Larisa Kurtovic. 2013. Nationalist order and party patronage in post-Dayton B-H. Scholar Research Brief, IREX/DePaul University, US. Retrieved on September 17, 2014 from https://irex.org/resource/nationalistorder-and-party-patronage-post-dayton-bosniaherzegovina-research-brief","paperID":"None"},{"content":"Tibor Kremic, Oya Icmeli Tukel and Walter O. Rom. 2006. Outsourcing decision support: a survey of benefits, risks, and decision factors. Supply Chain Management: An International Journal 11, 6: 467 - 482. http://dx.doi.org/10.1108/13598540610703864","paperID":"None"},{"content":"Ivonne Küsters. 2006. Das narrative Interview im Forschungsprozess. In Narrative Interviews. Verlag für Sozialwissenschaften, Wiesbaden, DE, 39--176.","paperID":"None"},{"content":"Habibul Haque Khondker. 2011. Role of the New Media in the Arab Spring. In Globalizations 8. 5: 675679. http://dx.doi.org/10.1080/14747731.2011.621287","paperID":"None"},{"content":"Sahar Khamis and Katherine Vaughn. 2011. Cyberactivism in the Egyptian Revolution: How Civic Engagement and Citizen Journalism. In Arab Media and Society 14, 3: 1--25.","paperID":"None"},{"content":"Klaus Krippendorff. 2004. Content Analysis: An Introduction to Its Methodology. Thousand Oaks. Sage Publications Inc.","paperID":"None"},{"content":"Christopher A. Le Dantec and W. Keith Edwards. 2010. Across boundaries of influence and accountability: the multiple scales of public sector information systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 113--122. http://dx.doi.org/10.1145/1753326.1753345","paperID":"None"},{"content":"Kristen Lovejoy and Gregory D. Saxton. 2012. Information, Community, and Action: How Nonprofit Organizations Use Social Media. Journal of Computer-Mediated Communication 17, 3: 337--353. http://dx.doi.org/10.1111/j.1083--6101.2012.01576.x","paperID":"None"},{"content":"Kristen Lovejoy, Richard D. Waters and Gregory D. Saxton. 2012. Engaging stakeholders through Twitter: How nonprofit organizations are getting more out of 140 characters or less. PR Review 38, 2: 313-318. http://dx.doi.org/10.1016/j.pubrev.2012.01.005","paperID":"None"},{"content":"Elaine Massung, David Coyle, Kirsten F. Cater, Marc Jay, and Chris Preist. 2013. Using crowdsourcing to support pro-environmental community activism. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 371--380. http://dx.doi.org/10.1145/2470654.2470708","paperID":"None"},{"content":"Yousri Marzouki, Inès Skandrani-Marzouki, Moez Béjaoui, Haythem Hammoudi, and Tarek Bellaj. 2012. The Contribution of Facebook to the 2011 Tunisian Revolution: A Cyberpsychological Insight. Cyberpsychology, Behavior, and Social Networking: 237--244. http://dx.doi.org/10.1089/cyber.2011.0177.","paperID":"None"},{"content":"Philipp Mayring. 2000. Qualitative Content Analysis. Retrieved June 05, 2014 from http://qualitativeresearch.net/index.php/fqs/article/view/1089","paperID":"None"},{"content":"Brenda McPhail, Terry Costantino, David Bruckmann, Ross Barclay and Andrew Clement. 1998. Caveat Exemplar: Participatory Design in a Non-Profit Volunteer Organisation. Computer Supported Cooperative Work 7, 3--4: 223--241. http://dx.doi.org/10.1023/A:3A1008631020266","paperID":"None"},{"content":"Kristen Meredith. 2013. Social Media and Cyber Utopianism: Civil Society versus the Russian State during the 'White Revolution' 2011--2012. St Antony's International Review 8, 2: 89--105.","paperID":"None"},{"content":"Andrés Monroy-Hernández, danah boyd, Emre Kiciman, Munmun De Choudhury, and Scott Counts. 2013. The new war correspondents: the rise of civic media curation in urban warfare. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, NY, NY, USA, 1443--1452. http://dx.doi.org/10.1145/2441776.2441938","paperID":"None"},{"content":"Seungahn Nah and Gregory D. Saxton. 2013. Modeling the adoption and use of social media by nonprofit organizations, In New Media & Society, 15, 2: 294--313 http://dx.doi.org/10.1177/1461444812452411","paperID":"None"},{"content":"NN. The Division for Social Policy and Development (DSPD) is part of the Department of Economic and Social Affairs (DESA) of the United Nations Secretariat. 2010. Why are ICTs important for Civil Society Organizations? Retrieved from January 6th, 2016 from http://www.un.org/esa/socdev/ngo/docs/2010/directory/ictcso.pdf","paperID":"None"},{"content":"Occupy Banjaluka. Facebook Group (>770 members). Retrieved January 04, 2015 from https://facebook.com/groups/255985807771350","paperID":"None"},{"content":"Park je nas. Facebook Group (>38400 members, 15000 members in first 24 hours after group start). Retrieved January 04, 2015 from https://facebook.com/groups/park.je.nas","paperID":"None"},{"content":"Poplave u regionu. Facebook Group (>49000 members). Retrieved September 20, 2015 from https://www.facebook.com/Poplave-u-regionu1441672986080458","paperID":"None"},{"content":"Dinesh Rathi, Lisa Given, Eric Forcier and Sarah Vela. 2014. Every Task its Tool, Every Tool its Task: Social Media Use in Canadian Non-Profit Organizations. In Proceedings of the CAIS. Retrieved April 5, 2015 from http://www.caisacsi.ca/ojs/index.php/cais/article/view/90","paperID":"None"},{"content":"Republika Srpska Ministry of Internal Affairs. 2015. Announcement. Retrieved January 27, 2015 from http://mup.vladars.net/lat/index.php?vijest=11693&vrsta=saopstenja","paperID":"None"},{"content":"Dusan Reljic. 2004. The News Media and the Transformation of Ethnopolitical Conflicts. In Transforming Ethnopolitical Conflict, Austin A., Fischer, M., Ropers, N.. Verlag für Sozialwissenschaften, Wiesbaden, DE, 321--339. http://dx.doi.org/10.1007/978--3--663-05642--3_16","paperID":"None"},{"content":"Markus Rohde. 2004. Find what binds: Building Social Capital in an Iranian NGO community system. In Social Capital and Information Technology, Marleen Huysman and Volker Wulf. MIT Press, 75--111.","paperID":"None"},{"content":"Markus Rohde. 2007. Integrated Organization and Technology Development (OTD) and the Impact of Socio-Cultural Concepts - A CSCW Perspective. Ph.D Dissertation. Datalogiske skrifter. University of Roskilde, Denmark, 97ff.","paperID":"None"},{"content":"Markus Rohde. 2013. Trust in Electronically Supported Networks of Political Activists. Workshop paper in Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, NY, NY, USA.","paperID":"None"},{"content":"Alexander Ronzhyn. 2014. The Use of Facebook and Twitter During the 2013-2014 Protests in Ukraine. In Proceedings of the European Conference on Social Media, 442--448.","paperID":"None"},{"content":"Tina Rosenberg. 2011. Revolution U: What Egypt learned from the students who overthrew Milosevic. Foreign Policy. Retrieved June 05, 2014 from http://foreign policy.com/articles/2011/02/16/revolution_u","paperID":"None"},{"content":"Volker Wulf, Kaoru Misaki, Meryem Atam, David Randall, and Markus Rohde. 2013. 'On the ground' in Sidi Bouzid: investigating social media use during the tunisian revolution. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, NY, NY, USA, 14091418. http://dx.doi.org/10.1145/2441776.2441935","paperID":"None"},{"content":"Saqib Saeed, Markus Rohde and Volker Wulf. 2011. Analyzing political activists' organization practices: Findings from a long term case study of the ESF. International Journal of Computer Supported Cooperative Work (CSCW) 4--5, 265--304. http://dx.doi.org/10.1007/s10606-011--9144-0","paperID":"None"},{"content":"Hany Salaheldeen and Michael Nelson. 2012. Losing my revolution: how many resources shared on social media have been lost?. In Theory and Practice of Digital Libraries. Springer Berlin Heidelberg, DE, 125--137. http://dx.doi.org/10.1007/978--3--642--33290--6_14","paperID":"None"},{"content":"Hany Salaheldeen and Michael Nelson. 2013. Resurrecting My Revolution. In Research and Advanced Technology for Digital Libraries. Springer Berlin Heidelberg, DE, 333--345. http://dx.doi.org/10.1007/978--3--642--40501--3_34","paperID":"None"},{"content":"Julia Skinner. 2011. Social Media and Revolution: The Arab Spring and the Occupy Movement as Seen through Three Information Studies Paradigms. All Sprouts Content. Paper 483.","paperID":"None"},{"content":"Spasimo Kastel. Facebook Group (>3500 members). Retrieved January 04, 2015 from https://facebook.com/spasimokastel","paperID":"None"},{"content":"Ines Steinke. 2000. Gütekriterien qualitativer Forschung. In Qualitative Forschung, Uwe Flick, Ernst von Kardorff and Ines Steinke. Reinbek b. Hamburg, Rowohlt, DE, 319--331.","paperID":"None"},{"content":"Gunnar Stevens, Michael Veith and Volker Wulf. 2005. Bridging among Ethnic Communities by Crosscultural Communities of Practice. Communities and Technologies. 377--396. http://dx.doi.org/10.1007/1--4020--3591--8_20","paperID":"None"},{"content":"Gunnar Stevens and Torben Wiedenhöfer. 2006. CHIC - a pluggable solution for community help in context. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles (NordiCHI '06), Anders Mørch, Konrad Morgan, Tone Bratteteig, Gautam Ghosh, and Dag Svanaes (Eds.). ACM, NY, NY, USA, 212--221. http://dx.doi.org/10.1145/1182475.1182498","paperID":"None"},{"content":"Jo Tacchi, Markus Foth and Greg Hearn. 2009. Action research practices and media for development. International Journal of Education and Development Using Information and Communication Technology 5, 2: 32--48.","paperID":"None"},{"content":"Transparency International. Facebook Group (>3200 members). Retrieved January 04, 2015 from https://facebook.com/TIBiH","paperID":"None"},{"content":"Lejla Turcilo. 2010. Will the Internet set us free: New media and old politics in Bosnia-Herzegovina. Medianali 4, 8: 11--22.","paperID":"None"},{"content":"Ustav Bosne i Hercegovine. 1995. Retrieved December 28, 2015 from http://oscebih.org/dejtonski_mirovni_ sporazum/SR/annex4.htm","paperID":"None"},{"content":"Amy Voida. 2011. Shapeshifters in the voluntary sector: exploring the human-centered-computing challenges of nonprofit organizations. interactions 18, 6 (November 2011), 27--31. http://dx.doi.org/10.1145/2029976.2029985","paperID":"None"},{"content":"Amy Voida, Ellie Harmon, and Ban Al-Ani. 2011. Homebrew databases: complexities of everyday information management in nonprofit organizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 915--924. http://dx.doi.org/10.1145/1978942.1979078","paperID":"None"},{"content":"Amy Voida, Ellie Harmon, and Ban Al-Ani. 2012. Bridging between organizations and the public: volunteer coordinators' uneasy relationship with social computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1967--1976. http://dx.doi.org/10.1145/2207676.2208341","paperID":"None"},{"content":"Richard Waters and Kevin Lo. 2012. Exploring the Impact of Culture in the Social Media Sphere: A Content Analysis of Nonprofit Organizations' Use of Facebook. Journal of Intercultural Communication Research, 41: 297--319. http://dx.doi.org/10.1080/17475759.2012.728772","paperID":"None"},{"content":"Andreas Witzel. 2000. Das problemzentrierte Interview. In Forum:Qualitative Sozialforschung, 1, 1, Article 22.","paperID":"None"},{"content":"Volker Wulf, Markus Rohde, Volkmar Pipek, and Gunnar Stevens. 2011. Engaging with practices: design case studies as a research framework in CSCW. In Proceedings of the ACM 2011 conference on Computer supported cooperative work (CSCW '11). ACM, NY, NY, USA, 505--512. http://dx.doi.org/10.1145/1958824.1958902","paperID":"None"},{"content":"Volker Wulf, Konstantin Aal, Ibrahim Abu Kteish, Meryem Atam, Kai Schubert, Markus Rohde, George P. Yerousis, and David Randall. 2013. Fighting against the wall: social media use by political activists in a Palestinian village. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 19791988. http://dx.doi.org/10.1145/2470654.2466262","paperID":"None"},{"content":"Volker Wulf, Kaoru Misaki, Meryem Atam, David Randall, and Markus Rohde. 2013. 'On the ground' in Sidi Bouzid: investigating social media use during the tunisian revolution. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, NY, NY, USA, 14091418. http://dx.doi.org/10.1145/2441776.2441935","paperID":"None"},{"content":"Daisy Yoo, Milli Lake, Trond Nilsen, Molly E. Utter, Robert Alsdorf, Theoneste Bizimana, Lisa P. Nathan, Mark Ring, Elizabeth J. Utter, Robert F. Utter, and Batya Friedman. 2013. Envisioning across generations: a multi-lifespan information system for international justice in rwanda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 25272536. http://dx.doi.org/10.1145/2470654.2481349","paperID":"None"},{"content":"Zašto je zaista uhapšen Sanel Menzil iz Kotor Varoši: Sporni fotografija i komentar. Retrieved September 10, 2015 from http://banjalukain.com/clanak/130103/zastoje-zaista-uhapsen-sanel-menzil-iz-kotor-varosi-spornifotografija-i-komentar","paperID":"None"},{"content":"Eric. A. Zimmer. 2003. Understanding a Secondary Digital Divide: Nonprofit Organizations and Internet Bandwidth Connectivity. In Trends in Communication 11, 1: 81--94. http://dx.doi.org/10.1207/S15427439TC1101_06","paperID":"None"}],"abstract":"Bosnia-Herzegovina and its administrative unit or \"entity\", Republika Srpska are divided, transitional post-war societies. The aim of this paper is to present a preliminary analysis of regional activists' use of information and communication technology (ICT) and to identify improvement potential. Empirical investigations of social media use and qualitative interviews with the country's activists indicate strong interest in ICT. Benefits for the use of ICT by activists include more efficient access to their target group, easier information sharing with the general population, and quicker reaction to spontaneous \"offline\" activities. Simultaneously, data points to problems such as limited budgets and know-how, intensive outsourcing practices, and a significant lack of awareness regarding data security. Activists see improvement potential in areas of training on content optimization, campaign management, ICT use and maintenance, security, and privacy. Additionally, there is potential to improve upon the sustainability of activist's work and patterns related to their ICT outsourcing.","title":"ICT Use by Prominent Activists in Republika Srpska","filename":"CHI16/p3364","authors":["Borislav Tadic","Markus Rohde","Volker Wulf","David Randall"],"conference":"CHI '16"}