{"paperId":2858146,"citation":[],"abstract":"Digital technologies offer the possibility of community empowerment via the reconfiguration of public services. This potential relies on actively involved citizens engaging with decision makers to pursue civic goals. In this paper we study one such group of involved citizens, examining the evidencing practices of a rare disease charity campaigning for accessible public transport. Through fieldwork and interviews, we highlight the ways in which staff and volunteers assembled and presented different forms of evidence, in doing so reframing what is conceived as 'valid knowledge'. We note the challenges this group faced in capturing experiential knowledge around the accessibility barriers of public transport, and the trade-offs that are made when presenting evidence to policy and decision makers. We offer a number of design considerations for future HCI research, focusing on how digital technology might be configured more appropriately to support campaigning around the politics of mobility.","reference":[{"content":"Madeleine Akrich, Máire Leane, Celia Roberts and João Arriscado Nunes. 2014. Practising childbirth activism: A politics of evidence. BioSocieties 9, 2: 129--152.","paperID":"None"},{"content":"Dan Aldridge-Neil, Helmet cameras capture bad driving. BBC News Website (1st February 2011). Retrieved 19th August 2015 from http://www.bbc.co.uk/news/uk-12334486","paperID":"None"},{"content":"Paul M. Aoki, R. J. Honicky, Alan Mainwaring, Chris Myers, Eric Paulos, Sushmita Subramanian, and Allison Woodruff. 2009. A vehicle for research: using street sweepers to explore the landscape of environmental community action. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 375--384. http://dx.doi.org/10.1145/1518701.1518762","paperID":"None"},{"content":"Mariam Asad and Christopher A. Le Dantec. 2015. Illegitimate Civic Participation: Supporting Community Activists on the Ground. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1694--1703. http://dx.doi.org/10.1145/2675133.2675156","paperID":"None"},{"content":"Ségolène Aymé, Anna Kole, Stephen Groft. 2008. Empowerment of patients: lessons from the rare diseases community. The Lancet 371 2048--2051.","paperID":"None"},{"content":"Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: A Location-Mapping Mobile Application for Breastfeeding Women. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1709--1718. http://dx.doi.org/10.1145/2702123.2702328","paperID":"None"},{"content":"BBC News. 2014. Essex cyclist with helmet camera 'reported 60 motorist offenders'. BBC News Website (7th October 2014). Retrieved 19th August 2015 from http://www.bbc.co.uk/news/uk-england-essex-29505994","paperID":"None"},{"content":"Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2010. Participatory design and \"democratizing innovation\". In Proceedings of the 11th Biennial Participatory Design Conference (PDC '10). ACM, NY, NY, USA, 41--50. http://dx.doi.org/10.1145/1900441.1900448","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101","paperID":"None"},{"content":"Michel Callon and Vololona Rabeharisoa. 2008. The Growing Engagement of Emergent Concerned Groups in Political and Economic Life: Lessons from the French Association of Neuromuscular Disease Patients. Science, Technology & Human Values 33, 2: 230--261.","paperID":"None"},{"content":"Carlos Cardonha, Diego Gallo, Priscilla Avegliano, Ricardo Herrmann, Fernando Koch, and Sergio Borger. 2013. A crowdsourcing platform for the construction of accessibility maps. In Proceedings of the 10th International Cross-Disciplinary Conference on Web Accessibility (W4A '13). ACM, NY, NY, USA, Article 26. http://dx.doi.org/10.1145/2461121.2461129","paperID":"None"},{"content":"Patrick Carrington, Amy Hurst, and Shaun K. Kane. 2014. Wearables and chairables: inclusive design of mobile input and output techniques for power wheelchair users. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 3103--3112. http://dx.doi.org/10.1145/2556288.2557237","paperID":"None"},{"content":"Jaime Cascio. 2005. The Rise of the Participatory Panopticon. WorldChanging (4th May 2005). Retrieved 19th August 2015 from http://www.worldchanging.com/archives/002651.html","paperID":"None"},{"content":"Clara Crivellaro, Rob Comber, John Bowers, Peter C. Wright, and Patrick Olivier. 2014. A pool of dreams: facebook, politics and the emergence of a social movement. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 3573--3582. http://dx.doi.org/10.1145/2556288.2557100","paperID":"None"},{"content":"Clara Crivellaro, Rob Comber, Martyn Dade-Robertson, Simon J. Bowen, Peter C. Wright, and Patrick Olivier. 2015. Contesting the City: Enacting the Political Through Digitally Supported Urban Walks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2853--2862. http://dx.doi.org/10.1145/2702123.2702176","paperID":"None"},{"content":"Melissa Dawe. 2006. Desperately seeking simplicity: how young adults with cognitive disabilities and their families adopt assistive technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 1143--1152. http://dx.doi.org/10.1145/1124772.1124943","paperID":"None"},{"content":"Carl DiSalvo, Ann Light, Tad Hirsch, Christopher A. Le Dantec, Elizabeth Goodman, and Katie Hill. 2010. HCI, communities and politics. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, NY, NY, USA, 3151--3154. http://dx.doi.org/10.1145/1753846.1753940","paperID":"None"},{"content":"Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making public things: how HCI design can express matters of concern. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2397--2406. http://dx.doi.org/10.1145/2556288.2557359","paperID":"None"},{"content":"Audubon Dougherty. 2011. Live-streaming mobile video: production as civic engagement. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, NY, NY, USA, 425--434. http://dx.doi.org/10.1145/2037373.2037437","paperID":"None"},{"content":"Paul Dourish. 2010. HCI and environmental sustainability: the politics of design and the design of politics. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, NY, NY, USA, 1--10. http://dx.doi.org/10.1145/1858171.1858173","paperID":"None"},{"content":"Prabal Dutta, Paul M. Aoki, Neil Kumar, Alan Mainwaring, Chris Myers, Wesley Willett, and Allison Woodruff. 2009. Common Sense: participatory urban sensing using a network of handheld air quality monitors. In Proceedings of the 7th ACM Conference on Embedded Networked Sensor Systems (SenSys '09). ACM, NY, NY, USA, 349--350. http://dx.doi.org/10.1145/1644038.1644095","paperID":"None"},{"content":"Steven Epstein. 1995. The Construction of Lay Expertise: AIDS Activism and the Forging of Credibility in the Reform of Clinical Trials. Science, Technology & Human Values 20, 4: 408--437.","paperID":"None"},{"content":"European Commission. 2008. COM(2008) 679 Final: Communication from the Commission to the European Parliament, the Council, the European Economic and Social Committee and the Committee of the Regions on Rare Diseases: Europe's Challenges. Retrieved 19th August 2015 from http://ec.europa.eu/health/ph_threats/non_com/docs/rare_com_en.pdf","paperID":"None"},{"content":"Torsten Felzer and Stephan Rinderknecht. 2015. Experiences of Someone with a Neuromuscular Disease in Operating a PC (and Ways to Successfully Overcome Challenges). ACM Trans. Access. Comput. 6, 2, Article 4 (March 2015), 18 pages. http://dx.doi.org/10.1145/2700436","paperID":"None"},{"content":"Eletha Flores, Gabriel Tobon, Ettore Cavallaro, Francesca I. Cavallaro, Joel C. Perry, and Thierry Keller. 2008. Improving patient motivation in game development for motor deficit rehabilitation. In Proceedings of the 2008 International Conference on Advances in Computer Entertainment Technology (ACE '08). ACM, NY, NY, USA, 381--384. http://dx.doi.org/10.1145/1501750.1501839","paperID":"None"},{"content":"Marcus Foth, Leonardo Parra Agudelo, and Robin Palleis. 2013. Digital soapboxes: towards an interaction design agenda for situated civic innovation. In Proceedings of the 2013 ACM conference on Pervasive and ubiquitous computing adjunct publication (UbiComp '13 Adjunct). ACM, NY, NY, USA, 725--728. http://dx.doi.org/10.1145/2494091.2495995","paperID":"None"},{"content":"Marcus Foth, Tommi Heikkinen, Johanna Ylipulli, Anna Luusua, Christine Satchell, and Timo Ojala. 2014. UbiOpticon: Participatory Sousveillance with Urban Screens and Mobile Phone Cameras. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14). ACM, NY, NY, USA, Pages 56. http://dx.doi.org/10.1145/2611009.2611034","paperID":"None"},{"content":"Andrew Thomas Garbett, Rob Comber, Paul Egglestone, Maxine Glancy, and Patrick Olivier. 2014. Finding \"real people\": trust and diversity in the interface between professional and citizen journalists. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 3015--3024. http://dx.doi.org/10.1145/2556288.2557114","paperID":"None"},{"content":"Dan Witzner Hansen, Henrik H. T. Skovsgaard, John Paulin Hansen, and Emilie Møllenbach. 2008. Noise tolerant selection by gaze-controlled pan and zoom in 3D. In Proceedings of the 2008 symposium on Eye tracking research & applications (ETRA '08). ACM, NY, NY, USA, 205--212. http://dx.doi.org/10.1145/1344471.1344521","paperID":"None"},{"content":"John Paulin Hansen, Kristian Tørning, Anders Sewerin Johansen, Kenji Itoh, and Hirotaka Aoki. 2004. Gaze typing compared with input by head and hand. In Proceedings of the 2004 symposium on Eye tracking research & applications (ETRA '04). ACM, NY, NY, USA, 131--138. http://dx.doi.org/10.1145/968363.968389","paperID":"None"},{"content":"Jeanne Hayes and Elizabeth \"Lisa\" M. Hannold (2007). The road to empowerment: a historical perspective on the medicalization of disability. Journal of Health and Human Services Administration 30, 3: 352--377","paperID":"None"},{"content":"Libby Hemphill and Andrew J. Roback. 2014. Tweet acts: how constituents lobby congress via Twitter. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 1200--1210. http://dx.doi.org/10.1145/2531602.2531735","paperID":"None"},{"content":"House of Commons Transport Select Committee. 2013. Access to transport for disabled people still unacceptably poor. UK Parliament Website (17th September 2003). Retrieved 19th August 2015 from http://www.parliament.uk/business/committees/committees-a-z/commons-select/transportcommittee/news/disabled-report--substantive/","paperID":"None"},{"content":"Rob Kitchin. 1998. 'Out of Place', 'Knowing One's Place': Space, power and the exclusion of disabled people. Disability & Society 13, 3: 343--356","paperID":"None"},{"content":"Lisa Koeman, Vaiva Kalnikaité, and Yvonne Rogers. 2015. \"Everyone Is Talking about It!\": A Distributed Approach to Urban Voting Technology and Visualisations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3127--3136. http://dx.doi.org/10.1145/2702123.2702263","paperID":"None"},{"content":"Mark A. M. Kramer, Erika Reponen, and Marianna Obrist. 2008. MobiMundi: exploring the impact of usergenerated mobile content -- the participatory panopticon. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services (MobileHCI '08). ACM, NY, NY, USA, 575--577. http://dx.doi.org/10.1145/1409240.1409355","paperID":"None"},{"content":"Stacey Kuznetsov and Eric Paulos. 2010. Participatory sensing in public spaces: activating urban surfaces with sensor probes. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, NY, NY, USA, 21--30. http://dx.doi.org/10.1145/1858171.1858175","paperID":"None"},{"content":"Christopher A. Le Dantec, Mariam Asad, Aditi Misra, and Kari E. Watkins. 2015. Planning with Crowdsourced Data: Rhetoric and Representation in Transportation Planning. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1717--1727. http://dx.doi.org/10.1145/2675133.2675212","paperID":"None"},{"content":"James Lee. 2015. Trailblazers go undercover to investigate public transport. MDUK Website (29th April 2015). Retrieved 19th August 2015 from http://www.musculardystrophyuk.org/news/trailblazersgo-undercover-to-investigate-public-transport/","paperID":"None"},{"content":"Haley MacLeod, Kim Oakes, Danika Geisler, Kay Connelly, and Katie Siek. 2015. Rare World: Towards Technology for Rare Diseases. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1145--1154. http://dx.doi.org/10.1145/2702123.2702494","paperID":"None"},{"content":"Steve Mann, Jason Nolan and Barry Wellman. 2003. Sousveillance: Inventing and Using Wearable Computing Devices for Data Collection in Surveillance Environments, Surveillance & Society 1, 3: 331--355.","paperID":"None"},{"content":"MDUK. 2015 MDUK Trailblazers Public Transport General Survey 2015. Retrieved 19th August 2015 from https://www.surveymonkey.com/s/2KB7RW7","paperID":"None"},{"content":"MDUK. 2015 MDUK Trailblazers Public Transport Survey 2015 - Tell us about your recent journey! Retrieved 19th August 2015 from https://www.surveymonkey.com/s/HFXPJCH","paperID":"None"},{"content":"MDUK. 2015. MDUK Website: About Us. Retrieved 19th August 2015 from http://www.musculardystrophyuk.org/about-us/","paperID":"None"},{"content":"MDUK. 2011. Wheelchair Provision for Children and Adults with Muscular Dystrophy and other Neuromuscular Conditions: Best Practice Guidelines http://www.musculardystrophyuk.org/app/uploads/2015/02/wheelchair-guidelines.pdf","paperID":"None"},{"content":"Karyn Moffatt, Joanna McGrenere, Barbara Purves, and Maria Klawe. 2004. The participatory design of a sound and image enhanced daily planner for people with aphasia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 407--414. http://dx.doi.org/10.1145/985692.985744","paperID":"None"},{"content":"Laura Montini. 2013. Health 2.0: The Power of the Internet to Raise Awareness of Rare Diseases. In Rare Diseases in the Age of Health 2.0, Rajeev K. Bali, Lodewijk Bos, Michael Christopher Gibbons, Simon Ibell (eds.). Springer, Berlin, Germany, 83--95.","paperID":"None"},{"content":"Tiago Moreira, Orla O'Donovan and Etaoine Howlett. 2014. Assembling dementia care: Patient organisations and social research. BioSocieties 9, 2: 173--193.","paperID":"None"},{"content":"Patrick Olivier and Peter Wright. 2015. Digital Civics: Taking a Local Turn. Interactions 22, 4: 61- 63.","paperID":"None"},{"content":"Chris Page. 2014. How easy is public transport access for disabled users' BBC News Website (5th August 2014). Retrieved 19th August 2015 from http://www.bbc.co.uk/news/uk-northern-ireland-","paperID":"None"},{"content":"Vololona Rabeharisoa, Tiago Moreira, and Madeleine Akrich. 2014. Evidence-based activism: Patients', users' and activists' groups in knowledge society. BioSocieties 9, 2: 111--128.","paperID":"None"},{"content":"Vololona Rabeharisoa, Michel Callon, Angela Marques Filipe, João Arriscado Nunes, Florence Paterson, and Frédéric Vergnaud. 2014. From 'politics of numbers' to 'politics of singularisation': Patients' activism and engagement in research on rare diseases in France and Portugal. BioSocieties 9, 2: 194--217.","paperID":"None"},{"content":"Tom Shakespeare. 1993. Disabled people's selforganisation: a new social movement? Disability, Handicap & Society 8, 3: 249--264","paperID":"None"},{"content":"Kelly Shigeno, Sergio Borger, Diego Gallo, Ricardo Herrmann, Mateus Molinaro, Carlos Cardonha, Fernando Koch, and Priscilla Avegliano. 2013. Citizen sensing for collaborative construction of accessibility maps. In Proceedings of the 10th International Cross-Disciplinary Conference on Web Accessibility (W4A '13). ACM, NY, NY, USA, Article 24,","paperID":"None"},{"content":"Constantine E. Steriadis and Philip Constantinou. 2003. Designing human-computer interfaces for quadriplegic people. ACM Trans. Comput.-Hum. Interact. 10, 2 (June 2003), 87--118. http://dx.doi.org/10.1145/772047.772049","paperID":"None"},{"content":"Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-Place: Thinking through the Relations Between Data and Community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2863--2872. http://dx.doi.org/10.1145/2702123.2702558","paperID":"None"},{"content":"Nick Taylor, Justin Marshall, Alicia Blum-Ross, John Mills, Jon Rogers, Paul Egglestone, David M. Frohlich, Peter Wright, and Patrick Olivier. 2012. Viewpoint: empowering communities with situated voting devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1361--1370. http://dx.doi.org/10.1145/2207676.2208594","paperID":"None"},{"content":"Carol Thomas. 2004. Developing the Social Relational in the Social Model of Disability: a theoretical agenda. In Implementing the Social Model of Disability: Theory and Research, Colin Barnes and Geof Mercer (eds.). The Disability Press, Leeds, UK, 32--47.","paperID":"None"},{"content":"Amit Ranjan Trivedi, Abhash Kumar Singh, Sundara Tejaswi Digumarti, Deepak Fulwani, and Swagat Kumar. 2013. Design and Implementation of a Smart Wheelchair. In Proceedings of Conference on Advances In Robotics (AIR '13), Article 96 , 6 pages. http://dx.doi.org/10.1145/2506095.2506140","paperID":"None"},{"content":"Vasilis Vlachokyriakos, Rob Comber, Karim Ladha, Nick Taylor, Paul Dunphy, Patrick McCorry, and Patrick Olivier. 2014. PosterVote: expanding the action repertoire for local political activism. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 795--804. http://dx.doi.org/10.1145/2598510.2598523","paperID":"None"},{"content":"Wesley Willett, Paul Aoki, Neil Kumar, Sushmita Subramanian, and Allison Woodruff. 2010. Common sense community: scaffolding mobile sensing and analysis for novice users. In Proceedings of the 8th international conference on Pervasive Computing (Pervasive'10). ACM, NY, NY, USA, 301--318. http://dx.doi.org/10.1007/978--3--642--12654--3_18","paperID":"None"},{"content":"Jacob O. Wobbrock, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-Based Design: Concept, Principles and Examples. ACM Trans. Access. Comput. 3, 3, Article 9 (April 2011), 27 pages. http://dx.doi.org/10.1145/1952383.1952384","paperID":"None"}],"title":"Technology and the Politics of Mobility: Evidence Generation in Accessible Transport Activism","filename":"CHI16/p2417","authors":["Sunil Rodger","John Vines","Janice McLaughlin"],"conference":"CHI '16"}