{"paperId":2858445,"reference":[{"content":"Manal Almalki, Kathleen Gray, and Fernando Martin Sanchez. 2015. The use of self-quantification systems for personal health information: big data management activities and prospects. Health Information Science and Systems 3, Suppl 1 (24 Feb. 2015), S1. DOI: http://dx.doi.org/10.1186/2047--2501--3-S1-S1","paperID":"None"},{"content":"Ole Andreas Alsos, Anita Das, and Dag Svanæs. 2012. Mobile health IT: The effect of user interface and form factor on doctor-patient communication. International Journal of Medical Informatics 81, 1 (14 Oct. 2012), 12--28. DOI: http://dx.doi.org/10.1016/j.ijmedinf.2011.09.004","paperID":"None"},{"content":"Jessica S. Ancker, Holly O. Witteman, Baria Hafeez, Thierry Provencher, Mary Van de Graaf, and Esther Wei. 2015a. The Invisible Work of Personal Health Information Management Among People With Multiple Chronic Conditions: Qualitative Interview Study Among Patients and Providers. Journal of Medical Internet Research 17, 6 (14 June 2015), e137. DOI: http://dx.doi.org/10.2196/jmir.4381","paperID":"None"},{"content":"Jessica S. Ancker, Holly O. Witteman, Baria Hafeez, Thierry Provencher, Mary Van de Graaf, and Esther Wei. 2015b. \"You Get Reminded You're a Sick Person\": Personal Data Tracking and Patients With Multiple Chronic Conditions. Journal of Medical Internet Research 17, 8 (19 Aug. 2015), e202. DOI: http://dx.doi.org/10.2196/jmir.4209","paperID":"None"},{"content":"Stefan Becker, Talya Miron-Shatz, Nikolaus Schumacher, Johann Krocza, Clarissa Diamantidis, and Urs-Vito Albrecht. 2014. mHealth 2.0: Experiences, Possibilities, and Perspectives. JMIR mHealth and uHealth 2, 2 (16 May 2014). DOI: http://dx.doi.org/10.2196/mhealth.3328","paperID":"None"},{"content":"Yunan Chen, Victor Ngo, Sidney Harrison, and Victoria Duong. 2011. Unpacking Exam-room Computing: Negotiating Computer-use in Patient-physician Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2011) (CHI '11). ACM, NY, NY, USA, 3343--3352. DOI: http://dx.doi.org/10.1145/1978942.1979438","paperID":"None"},{"content":"Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding Quantified-selfers? Practices in Collecting and Exploring Personal Data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2014) (CHI '14). ACM, NY, NY, USA, 1143--1152. DOI: http://dx.doi.org/10.1145/2556288.2557372","paperID":"None"},{"content":"Chia-Fang Chung, Jonathan Cook, Elizabeth Bales, Jasmine Zia, and Sean A. Munson. 2015. More Than Telemonitoring: Health Provider Use and Nonuse of Life-Log Data in Irritable Bowel Syndrome and Weight Management. Journal of Medical Internet Research 17, 8 (21 Aug. 2015), e203. DOI: http://dx.doi.org/10.2196/jmir.4364","paperID":"None"},{"content":"Jeremy Clark and Aleksander Essex. 2012. CommitCoin: carbon dating commitments with Bitcoin. In Financial Cryptography and Data Security, Angelos D. Keromytis (Ed.). Springer Berlin Heidelberg, 390--398. DOI: http://dx.doi.org/10.1007/978--3--642--32946--3_28","paperID":"None"},{"content":"Juliet Corbin and Anselm Strauss. 2008. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory (3 ed.). Sage Publications, Inc. DOI: http://dx.doi.org/10.4135/9781452230153","paperID":"None"},{"content":"Pat Croskerry. 2013. From Mindless to Mindful Practice -- Cognitive Bias and Clinical Decision Making. New England Journal of Medicine 368, 26 (27 June 2013), 2445--2448. DOI: http://dx.doi.org/10.1056/NEJMp1303712 PMID: 23802513.","paperID":"None"},{"content":"M. Demonceau, A. Donneau, J. Croisier, E. Skawiniak, M. Boutaayamou, D. Maquet, and G. Garraux. 2015. Contribution of a Trunk Accelerometer System to the Characterization of Gait in Patients with Mild to Moderate Parkinson's disease. IEEE Journal of Biomedical and Health Informatics 19, 6 (19 Aug. 2015), 1803--1808. DOI: http://dx.doi.org/10.1109/JBHI.2015.2469540","paperID":"None"},{"content":"Manon L. Dontje, Martijn de Groot, Remko R. Lengton, Cees P. van der Schans, and Wim P. Krijnen. 2015. Measuring steps with the Fitbit activity tracker: an inter-device reliability study. Journal of Medical Engineering & Technology 39, 5 (27 May 2015), 286--290. http://www.tandfonline.com/doi/abs/10. 3109/03091902.2015.1050125","paperID":"None"},{"content":"David M. Eddy. 1990. The challenge. Journal of the American Medical Association 263, 2 (12 Jan. 1990), 287--290. DOI: http://dx.doi.org/10.1001/jama.1990.03440020121046","paperID":"None"},{"content":"Spencer C. Evans, Michael C. Roberts, Jared W. Keeley, Jennifer B. Blossom, Christina M. Amaro, Andrea M. Garcia, Cathleen Odar Stough, Kimberly S. Canter, Rebeca Robles, and Geoffrey M. Reed. 2015. Vignette methodologies for studying clinicians decision-making: Validity, utility, and application in ICD-11 field studies. International Journal of Clinical and Health Psychology 15, 2 (29 Jan. 2015), 160--170. DOI: http://dx.doi.org/10.1016/j.ijchp.2014.12.001","paperID":"None"},{"content":"Jeffrey L. Fox. 2015. Obama catapults patient-empowered Precision Medicine. Nature Biotechnology 33, 4 (7 April 2015), 325. DOI: http://dx.doi.org/10.1038/nbt0415--325","paperID":"None"},{"content":"Richard Frankel, Andrea Altschuler, Sheba George, James Kinsman, Holly Jimison, Nan R. Robertson, and John Hsu. 2005. Effects of Exam-Room Computing on Clinician-Patient Communication. Journal of General Internal Medicine 20, 8 (1 July 2005), 677--682. DOI: http://dx.doi.org/10.1111/j.1525--1497.2005.0163.x","paperID":"None"},{"content":"B. M. Frier, M. M. Jensen, and B. D. Chubb. 2015. Hypoglycaemia in adults with insulin-treated diabetes in the UK: self-reported frequency and effects. Diabetic Medicine (7 Sept. 2015). DOI: http://dx.doi.org/10.1111/dme.12878","paperID":"None"},{"content":"Thomas Goetz. 2010. It's time to redesign medical data. TEDMED. (Oct. 2010). http://www.ted.com/talks/thomas_goetz_it_s_ time_to_redesign_medical_data?language=en","paperID":"None"},{"content":"Thomas Goetz. 2011. The Decision Tree: How to make better choices and take control of your health (1 ed.). Rodale Books.","paperID":"None"},{"content":"Benjamin Hughes. 2008. To 2.0 or not to 2.0-have junior doctors already answered the question? Medicine 2.0 Conference (9 May 2008). http://www.medicine20congress.com/ocs/index.php/med/med2008/paper/view/92","paperID":"None"},{"content":"Tim Kelsey. 2013. Personalised care plans will give patients control of their own health - Tim Kelsey. NHS England (25 Sept. 2013). https://www.england.nhs.uk/2013/09/25/tim-kelsey-2/","paperID":"None"},{"content":"Samir S. Khariwala, Steven G. Carmella, Irina Stepanov, Dipankar Bandyopadhyay, Heather H. Nelson, Bevan Yueh, Dorothy K. Hatsukami, and Stephen S. Hecht. 2015. Self-reported Tobacco use does not correlate with carcinogen exposure in smokers with head and neck cancer. The Laryngoscope 125, 8 (5 April 2015), 1844--1848. DOI: http://dx.doi.org/10.1002/lary.25290","paperID":"None"},{"content":"John Millar. 2004. A shared care model for complex chronic disease care: A community of practice. (2004). PHSA Navigation Workshop.","paperID":"None"},{"content":"National Information Board. 2014. Personalised health and care 2020: Using Data and Technology to Transform Outcomes for Patients and Citizens. (Nov. 2014). https://www.gov.uk/government/ publications/personalised-health-and-care-2020","paperID":"None"},{"content":"Aditi Pai. 2013. Timeline: Smartphone-enabled health devices. MobiHealthNews (7 June 2013).","paperID":"None"},{"content":"Aditi Pai. 2015. iHealth Core, a new weight scale for people with chronic conditions. MobiHealthNews (15 Sept. 2015).","paperID":"None"},{"content":"Rupa A. Patel, Predrag Klasnja, Andrea Hartzler, Kenton T. Unruh, and Wanda Pratt. Probing the benefits of real-time tracking during cancer care. In AMIA Annual Symposium Proceedings. 1340--1349. http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3540467/","paperID":"None"},{"content":"Emily S. Patterson, Anh D. Nguyen, James P. Halloran, and Steven M. Asch. 2004. Human Factors Barriers to the Effective Use of Ten HIV Clinical Reminders. Journal of the American Medical Informatics Association 11, 1 (Jan. 2004), 50--59. DOI: http://dx.doi.org/10.1197/jamia.M1364","paperID":"None"},{"content":"Catherine Pope, Sue Ziebland, and Nicholas Mays. 2000. Qualitative research in health care: Analysing qualitative data. British Medical Journal 320, 7227 (2000), 114--116. DOI: http://dx.doi.org/10.1136/bmj.320.7227.114","paperID":"None"},{"content":"Donald A Redelmeier, Derek J Koehler, Varda Liberman, and Amos Tversky. 1995. Probability judgment in medicine discounting unspecified possibilities. Medical Decision Making 15, 3 (Aug. 1995), 227--230. DOI: http://dx.doi.org/10.1177/0272989X9501500305","paperID":"None"},{"content":"Mike Scaife and Yvonne Rogers. 1996. External cognition: how do graphical representations work? International journal of human-computer studies 45, 2 (Aug. 1996), 185--213. DOI: http://dx.doi.org/10.1006/ijhc.1996.0048","paperID":"None"},{"content":"R. Schoenberg, L. Nathanson, C. Safran, and D. Z. Sands. 2000. Weaving the Web into legacy information systems.. In Proceedings of the AMIA Symposium (2000). 769--773. http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2243891/","paperID":"None"},{"content":"W. S. A. Smellie, M. J. Galloway, D. Chinn, and P. Gedling. 2002. Is clinical practice variability the major reason for differences in pathology requesting patterns in general practice? 55, 4 (April 2002), 312--314. http://jcp.bmj.com/content/55/4/312","paperID":"None"},{"content":"Mark Sullivan. 2014. Guess what? Doctors don't care about your Fitbit data. VentureBeat (2014).","paperID":"None"},{"content":"Melanie Swan. 2009. Emerging Patient-Driven Health Care Models: An Examination of Health Social Networks, Consumer Personalized Medicine and Quantified Self-Tracking. International Journal of Environmental Research and Public Health 6, 2 (Feb. 2009), 492--525. DOI: http://dx.doi.org/10.3390/ijerph6020492","paperID":"None"},{"content":"Melanie Swan. 2012. Health 2050: The Realization of Personalized Medicine through Crowdsourcing, the Quantified Self, and the Participatory Biocitizen. Journal of Personalized Medicine 2, 3 (Sept. 2012), 93--118. DOI: http://dx.doi.org/10.3390/jpm2030093","paperID":"None"},{"content":"Carl Thompson and Dawn Dowding. 2002. Clinical decision making and judgement in nursing. John Wiley & Sons.","paperID":"None"},{"content":"Athanasios Tsoukalas, Timothy Albertson, and Ilias Tagkopoulos. 2015. From Data to Optimal Decision Making: A Data-Driven, Probabilistic Machine Learning Approach to Decision Support for Patients With Sepsis. JMIR Medical Informatics 3, 1 (2015). DOI: http://dx.doi.org/10.2196/medinform.3445","paperID":"None"},{"content":"U.S. Food and Drug Administration. 2014. K132764 Approval Letter. Technical Report. Department of Health & Human Services. http://www.accessdata.fda.gov/cdrh_docs/pdf13/K132764.pdf","paperID":"None"},{"content":"Paraskevas Vezyridis and Stephen Timmons. 2015. On the adoption of personal health records: some problematic issues for patient empowerment. 17, 2 (2015), 113--124. DOI: http://dx.doi.org/10.1007/s10676-015--9365-x","paperID":"None"},{"content":"Signe Vikkels. 2005. Subtle Redistribution of Work, Attention and Risks: Electronic Patient Records and Organisational Consequences. Scandinavian Journal of Information Systems 17, 1 (2005). http://aisel.aisnet.org/sjis/vol17/iss1/10","paperID":"None"},{"content":"Nathan Zeldes and Neil Baum. 2011. Information overload in medical practice. Journal of Medical Practice Management 26, 5 (2011), 314--316.","paperID":"None"}],"citation":[],"abstract":"While the Quantified Self and personal informatics fields have focused on the individual's use of self-logged data about themselves, the same kinds of data could, in theory, be used to improve diagnosis and care planning. In this paper, we seek to understand both the opportunities and bottlenecks in the use of self-logged data for differential diagnosis and care planning during patient visits to both primary and secondary care. We first conducted a literature review to identify potential factors influencing the use of self-logged data in clinical settings. This informed the design of our experiment, in which we applied a vignette-based role-play approach with general practitioners and hospital specialists in the US and UK, to elicit reflections on and insights about using patient self-logged data. Our analysis reveals multiple opportunities for the use of self-logged data in the differential diagnosis workflow, identifying capture, representational, and interpretational challenges that are potentially preventing self-logged data from being effectively interpreted and applied by clinicians to derive a patient's prognosis and plan of care.","title":"The Quantified Patient in the Doctor's Office: Challenges & Opportunities","filename":"CHI16/p3066","authors":["Peter West","Richard Giordano","Max Van Kleek","Nigel Shadbolt"],"conference":"CHI '16"}