{"paperId":2858373,"reference":[{"content":"Larry A Allen, Lynne W Stevenson, Kathleen L Grady, Nathan E Goldstein, Daniel D Matlock, Robert M Arnold, Nancy R Cook, G Michael Felker, Gary S Francis, Paul J Hauptman, and others. 2012. Decision making in advanced heart failure a scientific statement from the American Heart Association. Circulation 125, 15 (2012), 1928-1952.","paperID":"None"},{"content":"Ofra Amir, Barbara J Grosz, Krzysztof Z Gajos, Sonja M Swenson, and Lee M Sanders. 2015. From Care Plans to Care Coordination: Opportunities for Computer Support of Teamwork in Complex Healthcare. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1419-1428.","paperID":"None"},{"content":"Joan S Ash, Marc Berg, and Enrico Coiera. 2004. Some unintended consequences of information technology in health care: the nature of patient care information system-related errors. Journal of the American Medical Informatics Association 11, 2 (2004), 104-112.","paperID":"None"},{"content":"Melissa T Baysari, Johanna I Westbrook, Katrina L Richardson, and Richard O Day. 2011. The influence of computerized decision support on prescribing during ward-rounds: are the decision-makers targeted? Journal of the American Medical Informatics Association 18, 6 (2011), 754-759.","paperID":"None"},{"content":"Riccardo Bellazzi and Blaz Zupan. 2008. Predictive data mining in clinical medicine: current issues and guidelines. International journal of medical informatics 77, 2 (2008), 81-97.","paperID":"None"},{"content":"Jozien Bensing. 2000. Bridging the gap.: The separate worlds of evidence-based medicine and patient-centered medicine. Patient education and counseling 39, 1 (2000), 17-25.","paperID":"None"},{"content":"Raymond L Benza, Dave P Miller, Robyn J Barst, David B Badesch, Adaani E Frost, and Michael D McGoon. 2012. An evaluation of long-term survival from time of diagnosis in pulmonary arterial hypertension from the REVEAL Registry. CHEST Journal 142, 2 (2012), 448-456.","paperID":"None"},{"content":"Mary Jo Bitner, Amy L Ostrom, and Felicia N Morgan. 2007. Service Blueprinting: A Practical Technique for Service Innovation. (2007).","paperID":"None"},{"content":"Claus Bossen, Lotte Groth Jensen, and Flemming Witt. 2012. Medical secretaries' care of records: the cooperative work of a non-clinical group. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 921-930.","paperID":"None"},{"content":"Caryn Christensen, James R Larson, and others. 1993. Collaborative medical decision making. Medical Decision Making 13, 4 (1993), 339-346.","paperID":"None"},{"content":"Maureen Coombs and Steven J Ersser. 2004. Medical hegemony in decision-making-a barrier to interdisciplinary working in intensive care? Journal of advanced nursing 46, 3 (2004), 245-252.","paperID":"None"},{"content":"Jennifer Cowger, Kartik Sundareswaran, Joseph G Rogers, Soon J Park, Francis D Pagani, Geetha Bhat, Brian Jaski, David J Farrar, and Mark S Slaughter. 2013. Predicting survival in patients receiving continuous flow left ventricular assist devices: the HeartMate II risk score. Journal of the American College of Cardiology 61, 3 (2013), 313-321.","paperID":"None"},{"content":"Srikant Devaraj, Sushil K Sharma, Dyan J Fausto, Sara Viernes, and Hadi Kharrazi. 2014. Barriers and Facilitators to Clinical Decision Support Systems Adoption: A Systematic Review. Journal of Business Administration Research 3, 2 (2014), p36.","paperID":"None"},{"content":"Pelle Ehn. 1993. Scandinavian design: On participation and skill. Participatory design: Principles and practices (1993), 41-77.","paperID":"None"},{"content":"Glyn Elwyn, Isabelle Scholl, Caroline Tietbohl, Mala Mann, Adrian GK Edwards, Catharine Clay, France Legare, Trudy van der Weijden, Carmen L Lewis, Richard M Wexler, and others. 2013. Many miles to go: a systematic review of the implementation of patient decision support interventions into routine clinical practice. BMC medical informatics and decision making 13, Suppl 2 (2013), S14.","paperID":"None"},{"content":"John W Ely, Mark L Graber, and Pat Croskerry. 2011. Checklists to reduce diagnostic errors. Academic Medicine 86, 3 (2011), 307-313.","paperID":"None"},{"content":"Anthony Faiola, Preethi Srinivas, Yamini Karanam, David Chartash, and Bradley Doebbeling. 2014. VizCom: a novel workflow model for ICU clinical decision support. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 1705-1710.","paperID":"None"},{"content":"David Feldman, Salpy V Pamboukian, Jeffrey J Teuteberg, Emma Birks, Katherine Lietz, Stephanie A Moore, Jeffrey A Morgan, Francisco Arabia, Mary E Bauman, Hoger W Buchholz, and others. 2013. The 2013 International Society for Heart and Lung Transplantation Guidelines for mechanical circulatory support: executive summary. The Journal of Heart and Lung Transplantation 32, 2 (2013), 157-187.","paperID":"None"},{"content":"Centers for Medicare and Medicaid Services. 2010. Decision Memo for Ventricular Assist Devices as Destination Therapy (CAG-00119R2). (2010). https://www.cms.gov/medicare-coverage-database/details/nca-decision-memo.aspx?NCAId=243&ver=9&NcaName=Ventricular+Assist+Devices+as+Destination+Therapy+(2nd+Recon)&bc=BEAAAAAAEAAA&&fromdb=true.","paperID":"None"},{"content":"Dominick L Frosch and Robert M Kaplan. 1999. Shared decision making in clinical medicine: past research and future directions. American journal of preventive medicine 17, 4 (1999), 285-294.","paperID":"None"},{"content":"Eileen Gambrill. 1999. Evidence-based practice: An alternative to authority-based practice. Families in Society: The Journal of Contemporary Social Services 80, 4 (1999), 341-350.","paperID":"None"},{"content":"Karine Gravel, France Legare, and Ian D Graham. 2006. Barriers and facilitators to implementing shared decision-making in clinical practice: a systematic review of health professionals' perceptions. Implement Sci 1, 1 (2006), 16.","paperID":"None"},{"content":"MG Myriam Hunink, Milton C Weinstein, Eve Wittenberg, Michael F Drummond, Joseph S Pliskin, John B Wong, and Paul P Glasziou. 2014. Decision making in health and medicine: integrating evidence and values. Cambridge University Press.","paperID":"None"},{"content":"Monique WM Jaspers, Marian Smeulers, Hester Vermeulen, and Linda W Peute. 2011. Effects of clinical decision-support systems on practitioner performance and patient outcomes: a synthesis of high-quality systematic review findings. Journal of the American Medical Informatics Association 18, 3 (2011), 327-334.","paperID":"None"},{"content":"Kensaku Kawamoto, Caitlin A Houlihan, E Andrew Balas, and David F Lobach. 2005. Improving clinical practice using clinical decision support systems: a systematic review of trials to identify features critical to success. Bmj 330, 7494 (2005), 765.","paperID":"None"},{"content":"Gilad J Kuperman, Anne Bobb, Thomas H Payne, Anthony J Avery, Tejal K Gandhi, Gerard Burns, David C Classen, and David W Bates. 2007. Medication-related clinical decision support in computerized provider order entry systems: a review. Journal of the American Medical Informatics Association 14, 1 (2007), 29-40.","paperID":"None"},{"content":"James R Larson, Caryn Christensen, Ann S Abbott, and Timothy M Franz. 1996. Diagnosing groups: charting the flow of information in medical decision-making teams. Journal of personality and social psychology 71, 2 (1996), 315.","paperID":"None"},{"content":"Stephen J Leslie, Mark Hartswood, Catrin Meurig, Sinead P McKee, Roger Slack, Rob Procter, and Martin A Denvir. 2006. Clinical decision support software for management of chronic heart failure: Development and evaluation. Computers in biology and medicine 36, 5 (2006), 495-506.","paperID":"None"},{"content":"Wayne C Levy, Dariush Mozaffarian, David T Linker, Santosh C Sutradhar, Stefan D Anker, Anne B Cropp, Inder Anand, Aldo Maggioni, Paul Burton, Mark D Sullivan, and others. 2006. The seattle heart failure model prediction of survival in heart failure. Circulation 113, 11 (2006), 1424-1433.","paperID":"None"},{"content":"Gregory Makoul and Marla L Clayman. 2006. An integrative model of shared decision making in medical encounters. Patient education and counseling 60, 3 (2006), 301-312.","paperID":"None"},{"content":"Yatin Mehta, Abhinav Gupta, Subhash Todi, SN Myatra, DP Samaddar, Vijaya Patil, Pradip Kumar Bhattacharya, and Suresh Ramasubban. 2014. Guidelines for prevention of hospital acquired infections. Indian journal of critical care medicine: peer-reviewed, official publication of Indian Society of Critical Care Medicine 18, 3 (2014), 149.","paperID":"None"},{"content":"Bill Moggridge. 2007. Designing interactions. Vol. 14.","paperID":"None"},{"content":"Mark A Musen, Blackford Middleton, and Robert A Greenes. 2014. Clinical decision-support systems. In Biomedical informatics. Springer, 643-674.","paperID":"None"},{"content":"Zahra Niazkhani, Habibollah Pirnejad, Marc Berg, and Jos Aarts. 2009. The impact of computerized provider order entry systems on inpatient clinical workflow: a literature review. Journal of the American Medical Informatics Association 16, 4 (2009), 539-549.","paperID":"None"},{"content":"Annette M O'Connor, John E Wennberg, France Legare, Hilary A Llewellyn-Thomas, Benjamin W Moulton, Karen R Sepucha, Andrea G Sodano, and Jaime S King. 2007. Toward the tipping point: decision aids and informed patient choice. Health Affairs 26, 3 (2007), 716-725.","paperID":"None"},{"content":"M Peleg and S Tu. 2006. Decision support, knowledge representation and management in medicine. Methods of Information in Medicine 45 (2006), 72-80.","paperID":"None"},{"content":"Victoria A Shaffer, C Adam Probst, Edgar C Merkle, Hal R Arkes, and Mitchell A Medow. 2013. Why do patients derogate physicians who use a computer-based diagnostic support system? Medical Decision Making 33, 1 (2013), 108-118.","paperID":"None"},{"content":"Dean F Sittig, Adam Wright, Jerome A Osheroff, Blackford Middleton, Jonathan M Teich, Joan S Ash, Emily Campbell, and David W Bates. 2008. Grand challenges in clinical decision support. Journal of Biomedical Informatics 41 (2008), 387-392.","paperID":"None"},{"content":"Alan R Tait, Terri Voepel-Lewis, Brian J Zikmund-Fisher, and Angela Fagerlin. 2010. The effect of format on parents' understanding of the risks and benefits of clinical research: a comparison between text, tables, and graphics. Journal of health communication 15, 5 (2010), 487-501.","paperID":"None"},{"content":"Svetlena Taneva, Waxberg Sara, Goss Julian, Rossos Peter, Nicholas Emily, and Cafazzo Joseph. 2014. The Meaning of Design in Healthcare: Industry, Academia, Visual Design, Clinician, Patient and Hf Consultant Perspectives. In Proceedings of the Extended Abstracts of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 1099-1104. DOI: http://dx.doi.org/10.1145/2559206.2579407","paperID":"None"},{"content":"Jonathan M Teich, Pankaj R Merchia, Jennifer L Schmiz, Gilad J Kuperman, Cynthia D Spurr, and David W Bates. 2000. Effects of computerized physician order entry on prescribing practices. Archives of internal medicine 160, 18 (2000), 2741-2747.","paperID":"None"},{"content":"Bruce A Thyer and Laura L Myers. 1999. On science, antiscience, and the client's right to effective treatment. Social Work (1999), 501-504.","paperID":"None"},{"content":"Danielle Timmermans, Bert Molewijk, Anne Stiggelbout, and Job Kievit. 2004. Different formats for communicating surgical risks to patients and the effect on choice of treatment. Patient education and counseling 54, 3 (2004), 255-263.","paperID":"None"},{"content":"Visith Uy, Suepattra G May, Caroline Tietbohl, and Dominick L Frosch. 2014. Barriers and facilitators to routine distribution of patient decision support interventions: a preliminary study in community-based primary care settings. Health Expectations 17, 3 (2014), 353-364.","paperID":"None"},{"content":"Annette L Valenta, Margaret M Browning, Timothy E Weddle, Greer WP Stevenson, Andrew D Boyd, and Denise M Hynes. 2010. Physician perceptions of clinical reminders. In Proceedings of the 1st ACM International Health Informatics Symposium. ACM, 710-717.","paperID":"None"},{"content":"Robert L Wears and Marc Berg. 2005. Computer technology and clinical work: still waiting for Godot. Jama 293, 10 (2005), 1261-1263.","paperID":"None"},{"content":"Jeremy C Wyatt and Douglas G Altman. 1995. Commentary: Prognostic models: clinically useful or quickly forgotten? Bmj 311, 7019 (1995), 1539-1541.","paperID":"None"},{"content":"Qian Yang, John Zimmerman, and Aaron Steinfeld. 2015. Review of Medical Decision Support Tools : Emerging Opportunity for Interaction Design. In IASDR 2015 Interplay Proceedings.","paperID":"None"}],"citation":[],"abstract":"Clinical decision support tools (DSTs) are computational systems that aid healthcare decision-making. While effective in labs, almost all these systems failed when they moved into clinical practice. Healthcare researchers speculated it is most likely due to a lack of user-centered HCI considerations in the design of these systems. This paper describes a field study investigating how clinicians make a heart pump implant decision with a focus on how to best integrate an intelligent DST into their work process. Our findings reveal a lack of perceived need for and trust of machine intelligence, as well as many barriers to computer use at the point of clinical decision-making. These findings suggest an alternative perspective to the traditional use models, in which clinicians engage with DSTs at the point of making a decision. We identify situations across patients' healthcare trajectories when decision supports would help, and we discuss new forms it might take in these situations.","title":"Investigating the Heart Pump Implant Decision Process: Opportunities for Decision Support Tools to Help","filename":"CHI16/p4477","authors":["Qian Yang","John Zimmerman","Aaron Steinfeld","Lisa Carey","James F. Antaki"],"conference":"CHI '16"}