{"paperId":2858184,"abstract":"Our research explores the idea of using a human proxy to attend a class on one's behalf where video streaming is used to share the class with the remote student. We explored this idea through an online survey and in-class participation. Survey results show that people favored \"top students\" to represent them where gender and race played a much less important role. Students also highly valued a proxy who was also taking the class so they could discuss the course material. In class, students found the setup beneficial and highly valued the pair-wised learning that it afforded. Despite this, proxies found it difficult to concentrate in class and to be a surrogate for someone else at the same time. Together our results highlight the benefits and challenges with human proxies for classroom attendance and raise a series of design sensitivities that should be explored as part of future research.","citation":[],"reference":[{"content":"Victoria Bellotti and Abigail Sellen.1993. Design for Privacy in Ubiquitous Computing Environments, Proceedings of the Third European Conference on Computer-Supported Cooperative Work (ECSCW'93), Kluwer Academic Publishers, Milan, pp. 77--92.","paperID":"None"},{"content":"Jeremy Birnholtz, Clarissa Mak, Saul Greenberg, and Ron Baecker. 2008. Attention by proxy? issues in audience awareness for webcasts to distributed groups. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 103--106. DOI=10.1145/1357054.1357071","paperID":"None"},{"content":"Sara A. Bly, Steve R. Harrison, and Susan Irwin. 199 Media spaces: bringing people together in a video, audio, and computing environment. Commun. ACM 36, 1 (January 1993), 28--46. DOI=10.1145/151233.151235","paperID":"None"},{"content":"Michael Boyle, Carman Neustaedter, and Saul Greenberg. 2009. Privacy Factors in Video-based Media Spaces, Media Space: 20+ Years of Mediated Life, Springer.","paperID":"None"},{"content":"Milton Chen. 2001. Design of a virtual auditorium. In Proceedings of the ninth ACM international conference on Multimedia (MULTIMEDIA '01). ACM, New York, NY, USA, 19--28. DOI=10.1145/500141.500147","paperID":"None"},{"content":"Milton Chen. 2002. Achieving effective floor control with a low-bandwidth gesture-sensitive videoconferencing system. In Proceedings of the tenth ACM international conference on Multimedia (MULTIMEDIA '02). ACM, New York, NY, USA, 476--483. DOI=10.1145/641007.641109","paperID":"None"},{"content":"Milton Chen. 2003. Visualizing the pulse of a classroom. In Proceedings of the eleventh ACM international conference on Multimedia (MULTIMEDIA '03). ACM, New York, NY, USA, 555--561. DOI=10.1145/957013.957130","paperID":"None"},{"content":"Paul Dourish and Sara Bly. 1992. Portholes: supporting awareness in a distributed work group. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92), Penny Bauersfeld, John Bennett, and Gene Lynch (Eds.). ACM, New York, NY, USA, 541--547. DOI=10.1145/142750.142982","paperID":"None"},{"content":"Nicolas Ducheneaut, Ming-Hui Wen, Nicholas Yee, and Greg Wadley. 200 Body and mind: a study of avatar personalization in three virtual worlds. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1151--1160. DOI=10.1145/1518701.1518877","paperID":"None"},{"content":"Ulf-Daniel Ehlers. 2013. Open Learning Cultures: A Guide to Quality, Evaluation, and Assessment for Future Learning. New York: Springer.","paperID":"None"},{"content":"1Deborah Fels, Judith K. Waalen, Shumin Zhai, and Patrice Weiss. Telepresence under exceptional circumstances: Enriching the connection to school for sick children. In Proceedings of Interact, 2001, 617--624.","paperID":"None"},{"content":"Robert S. Fish, Robert E. Kraut, and Barbara L. Chalfonte. 1990. The VideoWindow system in informal communication. In Proceedings of the 1990 ACM conference on Computer-supported cooperative work (CSCW '90). ACM, New York, NY, USA, 1--11. DOI=10.1145/99332.99335","paperID":"None"},{"content":"Gina Garramone, Allen C. Harris, and Ronald Anderson. 1986. Uses of political computer bulletin boards. Journal of Broadcasting & Electronic Media, 30, 325--339.","paperID":"None"},{"content":"Saul Greenberg and Michael Rounding. 2001. The notification collage: posting information to public and personal displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 514--521. DOI=10.1145/365024.365339","paperID":"None"},{"content":"Steve Harrison. 2009. S. Media Space: 20+ Years of Mediated Life, Springer.","paperID":"None"},{"content":"Starr Roxanne Hiltz. 1994. The Virtual Classroom: Learning Without Limits Via Computer Networks. Ablex Publishing Corp., Norwood, NJ, USA.","paperID":"None"},{"content":"H, Hu. 2013. MOOC Migration. Diverse: Issues in Higher Education, 30, 4, 10--11.","paperID":"None"},{"content":"Kori Inkpen, Brett Taylor, Sasa Junuzovic, John Tang, and Gina Venolia. 2013. Experiences2Go: sharing kids' activities outside the home with remote family members. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 1329--1340. DOI=10.1145/2441776.2441926","paperID":"None"},{"content":"Gavin Jancke, Gina Danielle Venolia, Jonathan Grudin, J. J. Cadiz, and Anoop Gupta. 2001. Linking public spaces: technical and social issues. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 530--537. DOI=10.1145/365024.365352","paperID":"None"},{"content":"Gavin Jancke, Jonathan Grudin, and Anoop Gupta. 2000. Presenting to local and remote audiences: design and use of the TELEP system. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '00). ACM, New York, NY, USA, 384--391. DOI=10.1145/332040.332461","paperID":"None"},{"content":"2Brennan Jones, Anna Witcraft, Scott Bateman, Carman Neustaedter, and Anthony Tang. 2015. Mechanics of Camera Work in Mobile Video Collaboration. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 957--966. DOI=10.1145/2702123.2702345","paperID":"None"},{"content":"2Norman P. Jouppi. 2002. First steps towards mutually-immersive mobile telepresence. In Proceedings of the 2002 ACM conference on Computer supported cooperative work (CSCW '02). ACM, New York, NY, USA, 354--363. DOI=10.1145/587078.587128","paperID":"None"},{"content":"Norman P. Jouppi, Subu Iyer, Stan Thomas, and April Slayden. 2004. BiReality: mutually-immersive telepresence. In Proceedings of the 12th annual ACM international conference on Multimedia (MULTIMEDIA '04). ACM, New York, NY, USA, 860--867. DOI=10.1145/1027527.1027725","paperID":"None"},{"content":"Gregory Kearsley. 1995. The nature and value of interaction in distance learning, ACSDE Research Monograph No. 12, University Park, PA: Pennsylvania State University, American Center for the Study of Distance Education, 83092.","paperID":"None"},{"content":"Atsunobu Kimura, Masayuki Ihara, Minoru Kobayashi, Yoshitsugu Manabe, and Kunihiro Chihara. 2007. Visual feedback: its effect on teleconferencing. In Proceedings of the 12th international conference on Human-computer interaction: applications and services (HCI'07), Julie A. Jacko (Ed.). Springer-Verlag, Berlin, Heidelberg, 591--600.","paperID":"None"},{"content":"Eunyee Koh. 2010. Conferencing room for telepresence with remote participants. In Proceedings of the 16th ACM international conference on Supporting group work (GROUP '10). ACM, New York, NY, USA, 309--310. DOI=10.1145/1880071.1880124","paperID":"None"},{"content":"Sven Kratz, Don Kimber, Weiqing Su, Gwen Gordon, and Don Severns. 2014. Polly: \"being there\" through the parrot and a guide. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services (MobileHCI '14). ACM, New York, NY, USA, 625--630. DOI=10.1145/2628363.2628430","paperID":"None"},{"content":"Karel Kreijns, Paul Kirschner, Wim Jochems, and Hans van Buuren. 2011. Measuring perceived social presence in distributed learning groups. Education and Information Technologies, 16, 4, 365--381.","paperID":"None"},{"content":"Anicca Kristoffersson, Silvia Coradeschi, Amy Loutfi, and Kerstin Severinson-Eklundh. 2011. An Exploratory Study of Health Professionals' Attitudes about Robotic Telepresence Technology. Journal of Technology in Human Services, 29, 263--283.","paperID":"None"},{"content":"Min Kyung Lee and Leila Takayama. 2011. \"Now, i have a body\": uses and social norms for mobile remote presence in the workplace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 33--42. DOI=10.1145/1978942.1978950","paperID":"None"},{"content":"3Jason Leigh, Maggie Rawlings, Javier Girado, Greg Dawe, Ray Fang, Alan Verlo, Muhammad-Ali Khan, Alan Cruz, Dana Plepys, Daniel Sandin, and Thomas Defanti. 2000. AccessBot: an Enabling Technology for Telepresence. Proceedings of the 10th Internet Society Conference, INET.","paperID":"None"},{"content":"3Michael Massimi and Carman Neustaedter. 2014. Moving from talking heads to newlyweds: exploring video chat use during major life events. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, New York, NY, USA, 43--52. DOI=10.1145/2598510.2598570","paperID":"None"},{"content":"3Kana Misawa and Jun Rekimoto. 2015. ChameleonMask: Embodied Physical and Social Telepresence using Human Surrogates. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 401--411. DOI=10.1145/2702613.2732506","paperID":"None"},{"content":"Tomoyuki Morita, Kenji Mase, Yasushi Hirano, and Shoji Kajita. 2007. Reciprocal attentive communication in remote meeting with a humanoid robot. In Proceedings of the 9th international conference on Multimodal interfaces (ICMI '07). ACM, New York, NY, USA, 228--235. DOI=10.1145/1322192.1322232","paperID":"None"},{"content":"Shohei Nagai, Shunichi Kasahara, and Jun Rekimoto. 2015. LiveSphere: Sharing the Surrounding Visual Environment for Immersive Experience in Remote Collaboration. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 113--116. DOI=10.1145/2677199.2680549","paperID":"None"},{"content":"Carman Neustaedter and Elena Fedorovskaya. 2009. Presenting identity in a virtual world through avatar appearances. In Proceedings of Graphics Interface 2009 (GI '09). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 183--190.","paperID":"None"},{"content":"3Carman Neustaedter and Saul Greenberg. 2003. The Design of a Context-Aware Home Media Space for Balancing Privacy and Awareness, In Proceedings of the Fifth International Conference on Ubiquitous Computing (UbiComp 2003), Springer.","paperID":"None"},{"content":"3Carman Neustaedter, Carolyn Pang, Azadeh Forghani, Erick Oduor, Serena Hillman, Tejinder K. Judge, Michael Massimi, and Saul Greenberg. 2015. Sharing Domestic Life through Long-Term Video Connections. ACM Trans. Comput.-Hum. Interact. 22, 1, Article 3 (February 2015), 29 pages. DOI=10.1145/2696869","paperID":"None"},{"content":"3Scott L. Newstok. 2013. A Plea for \"Close Learning.\" Liberal Education. 99, 4, 16--19.","paperID":"None"},{"content":"Andreas Paepcke, Bianca Soto, Leila Takayama, Frank Koenig, and Blaise Gassend. 2011. Yelling in the hall: using sidetone to address a problem with mobile remote presence systems. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, New York, NY, USA, 107--116. DOI=10.1145/2047196.2047209","paperID":"None"},{"content":"4Jason Procyk, Carman Neustaedter, Carolyn Pang, Anthony Tang, and Tejinder K. Judge. 2014. Shared geocaching over distance with mobile video streaming. In Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW Companion '14). ACM, New York, NY, USA, 293--296. DOI=10.1145/2556420.2557635","paperID":"None"},{"content":"4Jason Procyk, Carman Neustaedter, Carolyn Pang, Anthony Tang, and Tejinder K. Judge. 2014. Exploring video streaming in public settings: shared geocaching over distance using mobile video chat. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2163--2172. DOI=10.1145/2556288.2557198","paperID":"None"},{"content":"4Irene Rae, Gina Venolia, John C. Tang, and David Molnar. 2015. A Framework for Understanding and Designing Telepresence. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1552--1566. DOI=10.1145/2675133.2675141","paperID":"None"},{"content":"4Irene Rae, Leila Takayama, and Bilge Mutlu. 2013. The influence of height in robot-mediated communication. In Proceedings of the 8th ACM/IEEE international conference on Human-robot interaction (HRI '13). IEEE Press, Piscataway, NJ, USA, 1--8.","paperID":"None"},{"content":"4Yuanchun Shi, Weikai Xie, Guangyou Xu, Runting Shi, Enyi Chen, Yanhua Mao, and Fang Liu. 2003. The Smart Classroom: Merging Technologies for Seamless Tele-Education. Pervasive Computing IEEE, 2, 2, 47--55.","paperID":"None"},{"content":"4J. Sucher, S. Todd, S. Jones, T. Throckmorton, K. Turner, and F. Moore. 2011. Robotic telepresence: a helpful adjunct that is viewed favorably by critically ill surgical patients. The American Journal of Surgery, 202, 6, 843--847.","paperID":"None"},{"content":"4Leila Takayama and Helen Harris. 2013. Presentation of (telepresent) self: on the double-edged effects of mirrors. In Proceedings of the 8th ACM/IEEE international conference on Human-robot interaction (HRI '13). IEEE Press, Piscataway, NJ, USA, 381--388.","paperID":"None"},{"content":"4Chih-Hsiung Tu. 2000. On-line learning migration: from social learning theory to social presence theory in a CMC environment. Journal of Network and Computer Applications, 23(1), 27--37.","paperID":"None"},{"content":"4Gina Venolia, John Tang, Ruy Cervantes, Sara Bly, George Robertson, Bongshin Lee, and Kori Inkpen. 2010. Embodied social proxy: mediating interpersonal connection in hub-and-satellite teams. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1049--1058. DOI=10.1145/1753326.1753482","paperID":"None"},{"content":"Steve Whittaker, David Frohlich, and Owen Daly-Jones. 1994. Informal workplace communication: what is it like and how might we support it?. In Conference Companion on Human Factors in Computing Systems (CHI '94), Catherine Plaisant (Ed.). ACM, New York, NY, USA, 208-. DOI=10.1145/259963.260328","paperID":"None"},{"content":"5Nicole Yankelovich, Nigel Simpson, Jonathan Kaplan, and Joe Provino. 2007. Porta-person: telepresence for the connected conference room. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). ACM, New York, NY, USA, 2789--2794. DOI=10.1145/1240866.1241080","paperID":"None"}],"title":"Human Proxies for Remote University Classroom Attendance","filename":"CHI16/p931","authors":["Clarissa Ishak","Carman Neustaedter","Dan Hawkins","Jason Procyk","Michael Massimi"],"conference":"CHI '16"}