{"paperId":2858451,"citation":[],"abstract":"Participants in social media systems must balance many considerations when choosing what to share and with whom. Sharing with others invites certain risks, as well as potential benefits; achieving the right balance is even more critical when sharing photos, which can be particularly engaging, but potentially compromising. In this paper, we examine photo-sharing decisions as an interaction between high-level user preferences and specific features of the images being shared. Our analysis combines insights from a 96-user survey with metadata from 10.4M photos to develop a model integrating these perspectives to predict permissions settings for uploaded photos. We discuss implications, including how such a model can be applied to provide online sharing experiences that are more safe, more scalable, and more satisfying.","reference":[{"content":"Shane Ahern, Dean Eckles, Nathaniel S. Good, Simon King, Mor Naaman, and Rahul Nair. 2007. Over-exposed?: Privacy Patterns and Considerations in Online and Mobile Photo Sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 357--366. DOI: http://dx.doi.org/10.1145/1240624.1240683","paperID":"None"},{"content":"Saeideh Bakhshi, David Shamma, Lyndon Kennedy, and Eric Gilbert. 2015. Why We Filter Our Photos and How It Impacts Engagement. http://www.aaai.org/ocs/index.php/ICWSM/ICWSM15/paper/view/10573","paperID":"None"},{"content":"Andrew Besmer and Heather Richter Lipford. 2010. Moving Beyond Untagging: Photo Privacy in a Tagged World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1563--1572. DOI: http://dx.doi.org/10.1145/1753326.1753560","paperID":"None"},{"content":"Flickr. 2015a. Find every photo with Flickr's new unified search experience. (2015). http://blog.flickr.net/en/2015/05/07/flickr-unified-search/.","paperID":"None"},{"content":"Flickr. 2015b. Thank You, Flickr Community! (2015). http://blog.flickr.net/en/2015/06/10/thank-you-flickr-community/.","paperID":"None"},{"content":"David Frohlich, Allan Kuchinsky, Celine Pering, Abbe Don, and Steven Ariss. 2002. Requirements for Photoware. In Proceedings of the 2002 ACM Conference on Computer Supported Cooperative Work (CSCW '02). ACM, NY, NY, USA, 166--175. DOI: http://dx.doi.org/10.1145/587078.587102","paperID":"None"},{"content":"Erving Goffman. 1959. The presentation of self in everyday life. University of Edinburgh.","paperID":"None"},{"content":"Bernie Hogan. 2010. The Presentation of Self in the Age of Social Media: Distinguishing Performances and Exhibitions Online. Bulletin of Science, Technology, & Society 30, 6 (2010), 377--386. DOI: http://dx.doi.org/10.1177/0270467610385893","paperID":"None"},{"content":"Mariea Grubbs Hoy and George Milne. 2010. Gender differences in privacy-related measures for young adult Facebook users. Journal of Interactive Advertising 10, 2 (2010), 28--45. DOI: http://dx.doi.org/10.1080/15252019.2010.10722168","paperID":"None"},{"content":"Dhiraj Joshi, Ritendra Datta, Elena Fedorovskaya, Quang-Tuan Luong, James Z Wang, Jia Li, and Jiebo Luo. 2011. Aesthetics and emotions in images. Signal Processing Magazine, IEEE 28, 5 (2011), 94--115. DOI: http://dx.doi.org/10.1109/MSP.2011.941851","paperID":"None"},{"content":"Sanjay Kairam, Mike Brzozowski, David Huffaker, and Ed Chi. 2012. Talking in Circles: Selective Sharing in Google+. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1065--1074. DOI: http://dx.doi.org/10.1145/2207676.2208552","paperID":"None"},{"content":"Shehroz S. Khan and Daniel Vogel. 2012. Evaluating Visual Aesthetics in Photographic Portraiture. In Proceedings of the Eighth Annual Symposium on Computational Aesthetics in Graphics, Visualization, and Imaging (CAe '12). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 55--62. http://dl.acm.org/citation.cfm?id=2328888.2328898","paperID":"None"},{"content":"David Kirk, Abigail Sellen, Carsten Rother, and Ken Wood. 2006. Understanding Photowork. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 761--770. DOI: http://dx.doi.org/10.1145/1124772.1124885","paperID":"None"},{"content":"Peter Klemperer, Yuan Liang, Michelle Mazurek, Manya Sleeper, Blase Ur, Lujo Bauer, Lorrie Faith Cranor, Nitin Gupta, and Michael Reiter. 2012. Tag, You Can See It!: Using Tags for Access Control in Photo Sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 377--386. DOI: http://dx.doi.org/10.1145/2207676.2207728","paperID":"None"},{"content":"Alex Krizhevsky, Ilya Sutskever, and Geoffrey E. Hinton. 2012. ImageNet Classification with Deep Convolutional Neural Networks. In Advances in Neural Information Processing Systems 25, F. Pereira, C.J.C. Burges, L. Bottou, and K.Q. Weinberger (Eds.). Curran Associates, Inc., 1097--1105.","paperID":"None"},{"content":"Cliff A.C. Lampe, Erik Johnston, and Paul Resnick. 2007. Follow the Reader: Filtering Comments on Slashdot. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 1253--1262. DOI: http://dx.doi.org/10.1145/1240624.1240815","paperID":"None"},{"content":"Airi Lampinen, Vilma Lehtinen, Asko Lehmuskallio, and Sakari Tamminen. 2011. We're in It Together: Interpersonal Management of Disclosure in Social Network Services. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 3217--3226. DOI:http://dx.doi.org/10.1145/1978942.1979420","paperID":"None"},{"content":"Airi Lampinen, Sakari Tamminen, and Antti Oulasvirta. 2009. All My People Right Here, Right Now: Management of Group Co-presence on a Social Networking Site. In Proceedings of the ACM 2009 International Conference on Supporting Group Work (GROUP '09). ACM, NY, NY, USA, 281--290. DOI:http://dx.doi.org/10.1145/1531674.1531717","paperID":"None"},{"content":"Kevin Lewis, Jason Kaufman, and Nicholas Christakis. 2008. The Taste for Privacy: An Analysis of College Student Privacy Settings in an Online Social Network. Journal of Computer-Mediated Communication 14, 1 (2008), 79--100. DOI: http://dx.doi.org/10.1111/j.1083--6101.2008.01432.x","paperID":"None"},{"content":"Eden Litt. 2012. Knock, knock. Who's there? The imagined audience. Journal of Broadcasting & Electronic Media 56, 3 (2012), 330--345. DOI: http://dx.doi.org/10.1080/08838151.2012.705195","paperID":"None"},{"content":"Eden Litt and Eszter Hargittai. 2014. Smile, snap, and share? A nuanced approach to privacy and online photo-sharing. Poetics 42 (2014), 1--21. DOI: http://dx.doi.org/10.1016/j.poetic.2013.10.002","paperID":"None"},{"content":"Andrew D. Miller and W. Keith Edwards. 2007. Give and Take: A Study of Consumer Photo-sharing Culture and Practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 347--356. DOI: http://dx.doi.org/10.1145/1240624.1240682","paperID":"None"},{"content":"Oded Nov, Mor Naaman, and Chen Ye. Motivational, Structural and Tenure Factors that Impact Online Community Photo Sharing. In International AAAI Conference on Web and Social Media (ICWSM '09).","paperID":"None"},{"content":"Pere Obrador, Xavier Anguera, Rodrigo de Oliveira, and Nuria Oliver. 2009. The Role of Tags and Image Aesthetics in Social Image Search. In Proceedings of the First SIGMM Workshop on Social Media (WSM '09). ACM, NY, NY, USA, 65--72. DOI: http://dx.doi.org/10.1145/1631144.1631158","paperID":"None"},{"content":"Anne Oeldorf-Hirsch and S. Shyam Sundar. 2010. Online photo sharing as mediated communication. In annual conference of the International Communication Association, Singapore.","paperID":"None"},{"content":"Leysia Palen and Paul Dourish. 2003. Unpacking \"Privacy\" for a Networked World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 129--136. DOI: http://dx.doi.org/10.1145/642611.642635","paperID":"None"},{"content":"Rossano Schifanella, Miriam Redi, and Luca Maria Aiello. 2015. An Image Is Worth More than a Thousand Favorites: Surfacing the Hidden Beauty of Flickr Pictures. http://www.aaai.org/ocs/index.php/ICWSM/ICWSM15/paper/view/10547","paperID":"None"},{"content":"Manya Sleeper, Rebecca Balebako, Sauvik Das, Amber Lynn McConahy, Jason Wiese, and Lorrie Faith Cranor. 2013. The Post That Wasn't: Exploring Self-censorship on Facebook. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, NY, NY, USA, 793--802. DOI: http://dx.doi.org/10.1145/2441776.2441865","paperID":"None"},{"content":"Anna C. Squicciarini, Cornelia Caragea, and Rahul Balakavi. 2014. Analyzing Images? Privacy for the Modern Web. In Proceedings of the 25th ACM Conference on Hypertext and Social Media (HT '14). ACM, NY, NY, USA, 136--147. DOI: http://dx.doi.org/10.1145/2631775.2631803","paperID":"None"},{"content":"Michael A. Stefanone and Derek Lackaff. 2009. Reality Television as a Model for Online Behavior: Blogging, Photo, and Video Sharing. Journal of Computer-Mediated Communication 14, 4 (2009), 964--987. DOI: http://dx.doi.org/10.1111/j.1083--6101.2009.01477.x","paperID":"None"},{"content":"Fred Stutzman and Jacob Kramer-Duffield. 2010. Friends Only: Examining a Privacy-enhancing Behavior in Facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1553--1562. DOI: http://dx.doi.org/10.1145/1753326.1753559","paperID":"None"},{"content":"Monika Taddicken. 2014. The Privacy Paradox in the Social Web: The Impact of Privacy Concerns, Individual Characteristics, and the Perceived Social Relevance on Different Forms of Self-Disclosure. Journal of Computer-Mediated Communication 19, 2 (2014), 248--273. DOI: http://dx.doi.org/10.1111/jcc4.12052","paperID":"None"},{"content":"Mike Thelwall. 2008. Social Networks, Gender, and Friending: An Analysis of MySpace Member Profiles. J. Am. Soc. Inf. Sci. Technol. 59, 8 (June 2008), 1321--1330. DOI: http://dx.doi.org/10.1002/asi.v59:8","paperID":"None"},{"content":"Bart Thomee, David Ayman Shamma, G. Friedland, B. Elizalde, K. Ni, D. Poland, D. Borth, and L. Li. 2016. YFCC100M: The New Data in Multimedia Research. Commun. ACM 59, 2 (2016). DOI: http://dx.doi.org/10.1145/2812802","paperID":"None"},{"content":"Amy Voida and Elizabeth D. Mynatt. 2005. Six Themes of the Communicative Appropriation of Photographic Images. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 171--180. DOI: http://dx.doi.org/10.1145/1054972.1054997","paperID":"None"},{"content":"Yang Wang, Gregory Norcie, Saranga Komanduri, Alessandro Acquisti, Pedro Giovanni Leon, and Lorrie Faith Cranor. 2011. \"I Regretted the Minute I Pressed Share\": A Qualitative Study of Regrets on Facebook. In Proceedings of the Seventh Symposium on Usable Privacy and Security (SOUPS '11). ACM, NY, NY, USA, Article 10, 16 pages. DOI: http://dx.doi.org/10.1145/2078827.2078841","paperID":"None"},{"content":"Molly McLure Wasko and Samer Faraj. 2005. Why Should I Share? Examining Social Capital and Knowledge Contribution in Electronic Networks of Practice. MIS Quarterly 29, 1 (2005), pp. 35--57. http://www.jstor.org/stable/25148667","paperID":"None"},{"content":"Pamela Wisniewski, Heather Lipford, and David Wilson. 2012. Fighting for My Space: Coping Mechanisms for Sns Boundary Regulation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 609--618. DOI: http://dx.doi.org/10.1145/2207676.2207761","paperID":"None"}],"title":"Snap Decisions?: How Users, Content, and Aesthetics Interact to Shape Photo Sharing Behaviors","filename":"CHI16/p113","authors":["Sanjay Kairam","Joseph 'Jofish' Kaye","John Alexis Guerra-Gomez","David A. Shamma"],"conference":"CHI '16"}