{"paperId":2858068,"citation":[],"reference":[{"content":"Patrick Baudisch and Ruth Rosenholtz. 2003. Halo: a technique for visualizing off-screen objects. In Proc. CHI. 481-488.","paperID":"None"},{"content":"Patrick M Baudisch and John C Krumm. 2013. Location-to-landmark. (Dec. 31 2013). US Patent 8,620,570.","paperID":"None"},{"content":"Benjamin B Bederson, James D Hollan, Ken Perlin, Jonathan Meyer, David Bacon, and George Furnas. 1996. Pad++: A zoomable graphical sketchpad for exploring alternate interface physics. Journal of Visual Languages & Computing 7, 1 (1996), 3-32.","paperID":"None"},{"content":"John Brosz, Miguel A Nacenta, Richard Pusch, Sheelagh Carpendale, and Christophe Hurter. 2013. Transmogrification: causal manipulation of visualizations. In Proc. UIST. 97-106.","paperID":"None"},{"content":"Stefano Burigat and Luca Chittaro. 2011. Visualizing references to off-screen content on mobile devices: A comparison of Arrows, Wedge, and Overview+ Detail. Interacting with Computers 23, 2 (2011), 156-166.","paperID":"None"},{"content":"Stefano Burigat, Luca Chittaro, and Silvia Gabrielli. 2006. Visualizing locations of off-screen objects on mobile devices: a comparative evaluation of three approaches. In Proc. MobileHCI. 239-246.","paperID":"None"},{"content":"Stefano Burigat, Luca Chittaro, and Andrea Vianello. 2012. Dynamic visualization of large numbers of off-screen objects on mobile devices: an experimental comparison of wedge and overview+ detail. In Proc. MobileHCI. 93-102.","paperID":"None"},{"content":"M Sheelagh T Carpendale and Catherine Montagnese. 2001. A framework for unifying presentation space. In Proc. UIST. 61-70.","paperID":"None"},{"content":"Luca Chittaro and Stefano Burigat. 2004. 3D location-pointing as a navigation aid in Virtual Environments. In Proc. Working Conference on Advanced Visual Interfaces. ACM, 267-274.","paperID":"None"},{"content":"Andy Cockburn, Amy Karlson, and Benjamin B Bederson. 2008. A review of overview+ detail, zooming, and focus+ context interfaces. ACM Computing Surveys (CSUR) 41, 1 (2008), 2.","paperID":"None"},{"content":"Mark Egenhofer. 1999. Spatial information appliances: A next generation of geographic information systems. In 1st Brazilian workshop on geoinformatics, Campinas, Brazil.","paperID":"None"},{"content":"Niklas Elmqvist, Nathalie Henry, Yann Riche, and Jean-Daniel Fekete. 2008. Melange: space folding for multi-focus interaction. In Proc. CHI. 1333-1342.","paperID":"None"},{"content":"Steven Feiner, Blair MacIntyre, Tobias Hollerer, and Anthony Webster. 1997. A touring machine: Prototyping 3D mobile augmented reality systems for exploring the urban environment. Personal Technologies 1, 4 (1997), 208-217.","paperID":"None"},{"content":"George W Furnas. 2006. A fisheye follow-up: further reflections on focus+ context. In Proc. CHI. 999-1008.","paperID":"None"},{"content":"Reginald G Golledge. 1999. Human wayfinding and cognitive maps. Wayfinding Behavior: Cognitive Mapping and Other Spatial Processes (1999), 5-45.","paperID":"None"},{"content":"Floraine Grabler, Maneesh Agrawala, Robert W. Sumner, and Mark Pauly. 2008. Automatic Generation of Tourist Maps. ACM Trans. Graph. 27, 3, Article 100 (Aug. 2008), 11 pages.","paperID":"None"},{"content":"Sean Gustafson. 2008. Visualizing off-screen locations on small mobile displays. Master's thesis. Department of Computer Science, University of Manitoba.","paperID":"None"},{"content":"Sean Gustafson, Patrick Baudisch, Carl Gutwin, and Pourang Irani. 2008. Wedge: clutter-free visualization of off-screen locations. In Proc. CHI. 787-796.","paperID":"None"},{"content":"Sean Gustafson and Pourang P Irani. 2007. Comparing visualizations for tracking off-screen moving targets. In CHI Extended Abstracts. 2399-2404.","paperID":"None"},{"content":"Takeo Igarashi and Ken Hinckley. 2000. Speed-dependent automatic zooming for browsing large documents. In Proc. UIST. 139-148.","paperID":"None"},{"content":"Alexandra Ion, Y-L Betty Chang, Michael Haller, Mark Hancock, and Stacey D Scott. 2013. Canyon: providing location awareness of multiple moving objects in a detail view on large displays. In Proc. CHI. 3149-3158.","paperID":"None"},{"content":"Sibren Isaacman, Richard Becker, Ramon Caceres, Stephen Kobourov, Margaret Martonosi, James Rowland, and Alexander Varshavsky. 2011. Identifying important places in peoples lives from cellular network data. In Pervasive Computing. Springer, 133-151.","paperID":"None"},{"content":"Waqas Javed, Sohaib Ghani, and Niklas Elmqvist. 2012. Polyzoom: multiscale and multifocus exploration in 2D visual spaces. In Proc. CHI. 287-296.","paperID":"None"},{"content":"Susanne Jul and George W Furnas. 1998. Critical zones in desert fog: aids to multiscale navigation. In Proc. UIST. 97-106.","paperID":"None"},{"content":"Dominik P Käser, Maneesh Agrawala, and Mark Pauly. 2011. FingerGlass: efficient multiscale interaction on multitouch screens. In Proc. CHI. 1601-1610.","paperID":"None"},{"content":"Henry Lieberman. 1994. Powers of ten thousand: navigating in large information spaces. In Proc. UIST. 15-16.","paperID":"None"},{"content":"Kevin Lynch. 1960. The image of the city. MIT Press.","paperID":"None"},{"content":"J Mackinlay, Lance Good, P Zellweger, Mark Stefik, and Patrick Baudisch. 2003. City Lights: Contextual views in minimal space. In Proc. CHI. 838-839.","paperID":"None"},{"content":"Daniel Miau and Steven Feiner. 2016. Personalized Compass Supplementary Material. (2016). http://dx.doi.org/10.1145/2858036.2858068.","paperID":"None"},{"content":"Kayur Patel, Mike Y Chen, Ian Smith, and James A Landay. 2006. Personalizing routes. In Proc. UIST. 187-190.","paperID":"None"},{"content":"Manojit Sarkar and Marc H Brown. 1992. Graphical fisheye views of graphs. In Proc. CHI. 83-91.","paperID":"None"},{"content":"Noah Snavely, Rahul Garg, Steven M Seitz, and Richard Szeliski. 2008. Finding paths through the world's photos. In ACM Trans. Graph., Vol. 27.","paperID":"None"},{"content":"Noah Snavely, Steven M Seitz, and Richard Szeliski. 2006. Photo tourism: exploring photo collections in 3D. In ACM Trans. Graph., Vol. 25. 835-846.","paperID":"None"},{"content":"Molly E Sorrows and Stephen C Hirtle. 1999. The nature of landmarks for real and electronic spaces. In Spatial Information Theory. Cognitive and Computational Foundations of Geographic Information Science. Springer, 37-50.","paperID":"None"},{"content":"Riku Suomela and Juha Lehikoinen. 2000. Context compass. In The Fourth International Symposium on Wearable Computers. IEEE, 147-154.","paperID":"None"},{"content":"Edward C Tolman. 1948. Cognitive maps in rats and men. Psychological Review 55, 4 (1948), 189.","paperID":"None"},{"content":"Colin Ware and Marlon Lewis. 1995. The DragMag image magnifier. In Conference Companion on Human Factors in Computing Systems. ACM, 407-408.","paperID":"None"},{"content":"Changqing Zhou, Nupur Bhatnagar, Shashi Shekhar, and Loren Terveen. 2007. Mining personally important places from GPS tracks. In IEEE 23rd International Conference on Data Engineering Workshop. 517-526.","paperID":"None"}],"abstract":"Maps on mobile/wearable devices often make it difficult to determine the location of a point of interest (POI). For example, a POI may exist outside the map or on a background with no meaningful cues. To address this issue, we present Personalized Compass, a self-contained compact graphical location indicator. Personalized Compass uses personal a priori POIs to establish a reference frame, within which a POI in question can then be localized. Graphically, a personalized compass combines a multi-needle compass with an abstract overview map. We analyze the characteristics of Personalized Compass and the existing Wedge technique, and report on a user study comparing them. Personalized Compass performs better for four inference tasks, while Wedge is better for a locating task. Based on our analysis and study results, we suggest the two techniques are complementary and offer design recommendations.","title":"Personalized Compass: A Compact Visualization for Direction and Location","filename":"CHI16/p5114","authors":["Daniel Miau","Steven Feiner"],"conference":"CHI '16"}