{"paperId":2858125,"citation":[],"reference":[{"content":"Daniel Ashbrook, Patrick Baudisch, and Sean White, Nenya: subtle and eyes-free mobile input with a magnetically-tracked finger ring, In Proc. of CHI'11, pp.2043--2046.","paperID":"None"},{"content":"Alex Bulter, Shahram Izadi, and Steve Hodges, SideSight: Multi-'touch' Interaction Around Small Devices, In Proc. of UIST'08, pp.201--204.","paperID":"None"},{"content":"Liwei Chan, Chi-Hao Hsieh, Yi-Ling Chen, Shuo Yang, Da-Yuan Huang, Rong-Hao Liang, and Bing-Yu Chen, Cyclops: Wearable and Single-Piece Full-Body Gesture Input Devices, In Proc. of CHI'15, pp.3001-","paperID":"None"},{"content":"Liwei Chan, Rong-Hao Liang, Ming-Chang Tsai, KaiYin Cheng, Chao-Huai Su, Mike Y. Chen, Wen-Huang Cheng, and Bing-Yu Chen, FingerPad: private and subtle interaction using fingertips. In Proc. of UIST'13, pp.255--260.","paperID":"None"},{"content":"Ke-Yu Chen, Daniel Ashbrook, Mayank Goel, SungHyuck Lee, and Shwetak Patel, AirLink: sharing files between multiple devices using in-air gestures. In Proc. of UbiComp'14, pp.565--569.","paperID":"None"},{"content":"Ke-Yu Chen, Gabe A Cohn, Sidhant Gupta, and Shwetak N Patel, uTouch: sensing touch gestures on unmodified LCDs, In Proc. of CHI'13, pp.2581--2584. Figure 11: Possible hand instrumentation, including a 3D case to place the sensor board (white box).","paperID":"None"},{"content":"Ke-Yu Chen, Kent Lyons, Sean White, and Shwetak Patel, uTrack: 3D Input Using Two Magnetic Sensors, In Proc. of UIST'13, pp.237--244.","paperID":"None"},{"content":"Gabe Cohn, Daniel Morris, Shwetak Patel, and Desney Tan, Humantenna: Using the Body as an Antenna for Real-Time Whole-Body Interaction. In Proc. of CHI'12, pp.1901--1910.","paperID":"None"},{"content":"Travis Deyle, Szabolcs Palinko, Erika Shehan Poole, and Thad Starner, Hambone: A Bio-Acoustic Gesture Interface, In Proc. of ISWC'07, pp.3--10.","paperID":"None"},{"content":"Sidhant Gupta, Ke-Yu Chen, Matthew S Reynolds, and Shwetak N Patel, LightWave: Using Compact Fluorescent Lights as Sensors, In Proc. of UbiComp'11, pp.65--74.","paperID":"None"},{"content":"Sidhant Gupta, Daniel Morris, Shwetak Patel, and Desney Tan, SoundWave: Using the Doppler Effect to Sense Gestures, In Proc. of CHI'12, pp.1911--1914.","paperID":"None"},{"content":"Xinying Han, Hiroaki Seki, Yoshitsugu Kamiya, and Masatoshi Hikizu, Wearable handwriting input device using magnetic field, In Proc. of SICE'07, pp.365--368.","paperID":"None"},{"content":"Xinying Hana, Hiroaki Seki, Yoshitsugu Kamiya, and Masatoshi Hikizu. Wearable handwriting input device using magnetic field: 2nd report: Influence of misalignment of magnet and writing plane, Precision Engineering issue 34, pp.425--430.","paperID":"None"},{"content":"Chris Harrison and Scott E Hudson, Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices, In Proc. of UIST'09, pp.121--124.","paperID":"None"},{"content":"Chris Harrison, Hrvoje Benko, and Andrew D Wilson, OmniTouch: wearable multitouch interaction everywhere, In Proc. of UIST'11, pp.441--450.","paperID":"None"},{"content":"Chris Harrison, Desney Tan, and Dan Morris, Skinput: appropriating the body as an input surface, In Proc. of CHI'10, pp.453--462.","paperID":"None"},{"content":"Edward Nelson Henderson, An Inertial Measurement System for Hand and Finger Tracking, Master Thesis 2015.","paperID":"None"},{"content":"David Kim, Otmar Hilliges, Shahram Izadi, Alex Butler1, Jiawen Chen, Iason Oikonomidis, and Patrick Olivier, Digits: freehand 3D interactions anywhere using a wrist-worn gloveless sensor, In Proc. of UIST'12, pp.167--176.","paperID":"None"},{"content":"Martin B Kraichman, Handbook of electromagnetic propagation in conducting media, 2nd Edition, Naval Material Command, 1976.","paperID":"None"},{"content":"James Kramer, Peter Lindener, and William R George, Communication system for deaf, deaf-blind, or nonvocal individuals using instrumented glove, US Patent US5047952, 1988.","paperID":"None"},{"content":"Rong-Hao Liang, Kai-Yin Cheng, Chao-Huai Su, Chien-Ting Weng, Bing-Yu Chen and De-Nian Yang, GaussSense: attachable stylus sensing using magnetic sensor grid, In Proc. of UIST'12, pp.319--326.","paperID":"None"},{"content":"Qifan Pu, Sidhant Gupta, Shyamnath Gollakota, and Shwetak Patel, Whole-home gesture recognition using wireless signals, In Proc. of MobiCom'13, pp.27--38.","paperID":"None"},{"content":"Frederick Raab, Ernest Blood, Terry Steiner, and Herbert Jones, Magnetic Position and Orientation Tracking System, IEEE Transactions on Aerospace Electron System 1979, pp.709--718.","paperID":"None"},{"content":"Ruth Ravichandran, Elliot Saba, Ke-Yu Chen, Mayank Goel, Sidhant Gupta and Shwetak N Patel, WiBreathe: Estimating Respiration Rate Using Wireless Signals in Natural Settings in the Home, IEEE PerCom'15, pp.131--139.","paperID":"None"},{"content":"Probir Kumar Ray and Ajay Mahajan, A genetic algorithm-based approach to calculate the optimal configuration of ultrasonic sensors in a 3D position estimation system, Robotics and Autonomous Systems 2002, Volume 41, Issue 4, pp.165--177.","paperID":"None"},{"content":"Jie Song, Gabor Soros, Fabrizio Pece, Sean Ryan Fanello, Shahram Izadi, Cem Keskin, and Otmar Hilliges, In-air gestures around unmodified mobile devices, In Proc. of UIST'14, pp.319--329.","paperID":"None"},{"content":"Thad Starner, Jake Auxier, Daniel Ashbrook, and Maribeth Gandy, The gesture pendant: a selfilluminating, wearable, infrared computer vision system for home automation control and medical monitoring, In Proc. of ISWC'00, pp.87--94.","paperID":"None"},{"content":"David J Sturman and David Zeltzer, A survey of glovebased input, IEEE Transactions on Computer Graphics and Applications 1994, Volume 14, pp.30--39.","paperID":"None"},{"content":"S Yabukami, S Hashi, T Ozawa, S. Hoshi, M. Toyoda, Y. Okazaki, and K.I. Arai, Development of a PositionSensing System for a Wireless Magnetic Marker Using a Differential Pickup Coil, Journal of the Magnetics Society of Japan 2005, Volume 29, Issue 2, pp.146--152.","paperID":"None"},{"content":"S Yabukami, K Ogasawara, H Saitoh, S. Hoshi, M. Toyoda, Y. Okazaki, and K.I. Arai, Development of a Fingertip Position-Sensing System using LC Resonated Markers, Journal of the Magnetics Society of Japan 2007, Volume 31, Issue 6, pp.439--444.","paperID":"None"},{"content":"Qiao Zhang, Shyamnath Gollakota, Ben Taskar, and Raj P N Rao, Non-intrusive tongue machine interface, In Proc. of CHI'14, pp.2555--2558.","paperID":"None"}],"abstract":"With the resurgence of head-mounted displays for virtual reality, users need new input devices that can accurately track their hands and fingers in motion. We introduce Finexus, a multipoint tracking system using magnetic field sensing. By instrumenting the fingertips with electromagnets, the system can track fine fingertip movements in real time using only four magnetic sensors. To keep the system robust to noise, we operate each electromagnet at a different frequency and leverage bandpass filters to distinguish signals attributed to individual sensing points. We develop a novel algorithm to efficiently calculate the 3D positions of multiple electromagnets from corresponding field strengths. In our evaluation, we report an average accuracy of 1.33 mm, as compared to results from an optical tracker. Our real-time implementation shows Finexus is applicable to a wide variety of human input tasks, such as writing in the air.","title":"Finexus: Tracking Precise Motions of Multiple Fingertips Using Magnetic Sensing","filename":"CHI16/p1504","authors":["Ke-Yu Chen","Shwetak N. Patel","Sean Keller"],"conference":"CHI '16"}