{"paperId":2858378,"citation":[],"abstract":"Interactive devices and the services they support are reliant on the cloud and the digital infrastructure supporting it. The environmental impacts of this infrastructure are substantial and for particular services the infrastructure can account for up to 85% of the total impact. In this paper, we apply the principles of Sustainable Interaction Design to cloud services use of the digital infrastructure. We perform a critical analysis of current design practice with regard to interactive services, which we identify as the cornucopian paradigm. We show how user-centered design principles induce environmental impacts in different ways, and combine with technical and business drivers to drive growth of the infrastructure through a reinforcing feedback cycle. We then create a design rubric, substantially extending that of Blevis [6], to cover impacts of the digital infrastructure. In doing so, we engage in design criticism, identifying examples (both actual and potential) of good and bad practice. We then extend this rubric beyond an eco-efficiency paradigm to consider deeper and more radical perspectives on sustainability, and finish with future directions for exploration.","reference":[{"content":"Ahmadi Achachlouei, Mohammad, Åsa Moberg, and Elisabeth Hochschorner. 2015. Life Cycle Assessment of a Magazine, Part I: Tablet Edition in Emerging and Mature States. Journal of Industrial Ecology (2015).","paperID":"None"},{"content":"Chris Anderson, 2006. The Long Tail. Hyperion.","paperID":"None"},{"content":"Oliver Bates and Mike Hazas. 2013. Exploring the hidden impacts of HomeSys: energy and emissions of home sensing and automation. In Proceedings of the 2013 ACM conference on Pervasive and ubiquitous computing adjunct publication (UbiComp '13 Adjunct). ACM, NY, NY, USA, 809--814.","paperID":"None"},{"content":"Oliver Bates, Mike Hazas, Adrian Friday, Janine Morley, and Adrian K. Clear. 2014. Towards an holistic view of the energy and environmental impacts of domestic media and IT. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 11731182.","paperID":"None"},{"content":"Oliver Bates, Carolynne Lord, Bran Knowles, Adrian Friday, Adrian Clear, and Mike Hazas. 2015. Exploring (un) sustainable growth of digital technologies in the home. In Proceedings ICT4S 2015, Atlantic Press, 300309.","paperID":"None"},{"content":"Eli Blevis. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 503--512.","paperID":"None"},{"content":"Eli Blevis, Kevin Makice, William Odom, David Roedl, Christian Beck, Shunying Blevis, and Arvind Ashok. 2007. Luxury & new luxury, quality & equality. In Proceedings of the 2007 conference on Designing pleasurable products and interfaces (DPPI '07). ACM, NY, NY, USA, 296--311.","paperID":"None"},{"content":"Marian Chertow. 2000. The IPAT equation and its variants. Journal of Industrial Ecology 4,4:13--29.","paperID":"None"},{"content":"Cisco Visual Networking Index: Forecast and Methodology, 2014--2019 White Paper. Retrieved 23rd September 2015 from: http://www.cisco.com/c/en/us/solutions/collateral/service-provider/ip-ngn-ip-next-generationnetwork/white_paper_c11--481360.html","paperID":"None"},{"content":"Andy Daecher and Tom Galizia, 2015. 'Ambient Computing: Putting the Internet of Things to work'. In Tech Trends 2015: The Fusion of Business and IT. Deloitte University Press.","paperID":"None"},{"content":"Department of Energy and Climate Change. 2013. Household Electricity Survey. Retrieved 24th September 2015 from https://www.gov.uk/government/publications/househol d-electricity-survey--2","paperID":"None"},{"content":"Tawanna Dillahunt, Jennifer Mankoff, and Jodi Forlizzi. 2010. A proposed framework for assessing environmental sustainability in the HCI community. In Examining Appropriation, Re-use, and Maintenance of Sustainability Workshop at CHI. 2010.","paperID":"None"},{"content":"Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1975--1984.","paperID":"None"},{"content":"John S. Dryzek, 2013. The politics of the earth: Environmental discourses. Oxford University Press.","paperID":"None"},{"content":"Tammy Everts. Page Bloat Update. Retrieved 24th September 2015 from http://www.soasta.com/blog/page-bloat-average-webpage-2-mb/","paperID":"None"},{"content":"Daniel Fallman. 2003. Design-oriented humancomputer interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 225--232.","paperID":"None"},{"content":"Reza Farrahi Moghaddam, Fereydoun Farrahi Moghaddam and Mohamed Cheriet. A Graph-based Perspective to Total Carbon Footprint Assessment of Non-marginal Technology-driven Projects Use case of {OTT/IPTV}. In Computing Research Repository, September 2014. arXiv:1409.0876","paperID":"None"},{"content":"Freifunk. Retrieved 23rd September 2015 from https://freifunk.net/en/","paperID":"None"},{"content":"Batya Friedman (Editor). 1997. Human Values and the Design of Computer Technology. Stanford CA: CSLI Press.","paperID":"None"},{"content":"Tony Fry. 1999. A New design philosophy: an introduction to defuturing. UNSW Press.","paperID":"None"},{"content":"Silke Gegenbauer and Elaine M. Huang. 2012. Inspiring the design of longer-lived electronics through an understanding of personal attachment. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 635--644.","paperID":"None"},{"content":"Google. Google Photos Shared Albums Advert. Accessed 30th December 2015 at https://www.google.com/photos/about/?page=sharedalbums","paperID":"None"},{"content":"Google. Google Photos from All Devices advert. Accessed 30th December 2015 at https://www.google.com/photos/about/?page=autobackup","paperID":"None"},{"content":"Greenpeace. (2012). How Clean is Your Cloud? Retrieved 18th September 2015 from http://www.greenpeace.org/international/en/publications/Campaign-reports/Climate-Reports/How-Clean-isYour-Cloud/","paperID":"None"},{"content":"Kristin Hanks, William Odom, David Roedl, and Eli Blevis. 2008. Sustainable millennials: attitudes towards sustainability and the material effects of interactive technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 333--342.","paperID":"None"},{"content":"https://www.hipchat.com, retrieved 23rd September 2015.","paperID":"None"},{"content":"HP Design for Environment. Retrieved 24th September 2015 from http://www8.hp.com/us/en/hpinformation/environment/design-for-environment.html","paperID":"None"},{"content":"Elaine M. Huang and Khai N. Truong. 2008. Breaking the disposable technology paradigm: opportunities for sustainable interaction design for mobile phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 323--332.","paperID":"None"},{"content":"Huang, Elaine M., Koji Yatani, Khai N. Truong, Julie A. Kientz, and Shwetak N. Patel. 2009. Understanding mobile phone situated sustainability: the influence of local constraints and practices on transferability. IEEE Pervasive Computing 1 (2009): 46--53.","paperID":"None"},{"content":"Jina Huh, Kevin Nam, and Nikhil Sharma. 2010. Finding the lost treasure: understanding reuse of used computing devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1875--1878.","paperID":"None"},{"content":"Inc.com. An all-day video conference for remote workers: crazy or brilliant? Retrieved 23rd September 2015 from http://www.inc.com/yakowicz/howshutterstock-handles-remote-workers.html","paperID":"None"},{"content":"Dmytro Karamshuk, Nishanth Sastry, Andrew Secker, and Jigna Chandaria. 2015. ISP-friendly Peer-assisted On-demand Streaming of Long Duration Content in BBC iPlayer. In Proceedings of INFOCOM 2015, 289297.","paperID":"None"},{"content":"Kiyo Ishii, Junya Kurumida, Ken-ichi Sato, Tomohiro Kudoh, and Shu Namiki. 2015. Unifying Top-down and Bottom-up Approaches to Evaluate Network Energy Consumption. Journal of Lightwave Technology, 99, 2015.","paperID":"None"},{"content":"Bran Knowles, Lynne Blair, Mike Hazas, and Stuart Walker. 2013. Exploring sustainability research in computing: where we are and where we go next. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). ACM, NY, NY, USA, 305--314.","paperID":"None"},{"content":"Bran Knowles, Lynne Blair, Paul Coulton, and Mark Lochrie. 2014. Rethinking plan A for sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3593--3596.","paperID":"None"},{"content":"Vishesh Kumar, Danny J. Bee, Prasad S. Shirodkar, Serdar Tumkor, Bernhard P. Bettig, and John W. Sutherland. 2005. Towards sustainable 'product and material flow' cycles: identifying barriers to achieving product multi-use and zero waste. In ASME 2005 International Mechanical Engineering Congress and Exposition, pp. 433--442. American Society of Mechanical Engineers, 2005.","paperID":"None"},{"content":"Carolynne Lord, Mike Hazas, Adrian K. Clear, Oliver Bates, Rosalind Whittam, Janine Morley, and Adrian Friday. 2015. Demand in My Pocket: Mobile Devices and the Data Connectivity Marshalled in Support of Everyday Practice. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 27292738.","paperID":"None"},{"content":"Leah Maestri and Ron Wakkary. 2011. Understanding repair as a creative process of everyday design. In Proceedings of the 8th ACM conference on Creativity and cognition (C&C '11). ACM, NY, NY, USA, 81--90.","paperID":"None"},{"content":"Jens Malmodin, Åsa Moberg, Dag Lundén, Goran Finnveden & N. Lövehagen 2010. Greenhouse Gas Emissions and Operational Electricity Use in the ICT and Entertainment & Media Sectors. Journal of Industrial Ecology 14(5).","paperID":"None"},{"content":"Jennifer C. Mankoff, Eli Blevis, Alan Borning, Batya Friedman, Susan R. Fussell, Jay Hasbrouck, Allison Woodruff, and Phoebe Sengers. 2007. Environmental sustainability and interaction. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). ACM, NY, NY, USA, 21212124.","paperID":"None"},{"content":"Ross McLachlan and Stephen Brewster. 2012. Towards new widgets to reduce PC power consumption. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, NY, NY, USA, 2153--2158.","paperID":"None"},{"content":"Meyerson, D. (2001). Tempered radicals. Boston, MA: Harvard Business School.","paperID":"None"},{"content":"Microsoft Azure. Retrieved 24th September 2015 from https://azure.microsoft.com/en-gb/services/cloudservices/","paperID":"None"},{"content":"The Minions. Xfinity Internet Commercial. Retrieved 29th December 2015 from https://www.youtube.com/watch?v=Ok39RWPb-XI","paperID":"None"},{"content":"Jacob Nielsen. Nielsen's Law of Internet Bandwidth. Retrieved 23rd September 2015 from http://www.nngroup.com/articles/law-of-bandwidth/","paperID":"None"},{"content":"Nielsen. Global Digital Landscape report, March 2015. Retrieved 31st December 2015 from: http://tinyurl.com/hbscghx","paperID":"None"},{"content":"Duan Ning. 2001. Cleaner Production, Eco-industry and Circular Economy. Research of Environmental Sciences 6 (2001).","paperID":"None"},{"content":"William Odom, James Pierce, Erik Stolterman, and Eli Blevis. 2009. Understanding why we preserve some things and discard others in the context of interaction design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1053--1062.","paperID":"None"},{"content":"Yue Pan, Siddharth Maini, and Eli Blevis. Framing the Issues of Cloud Computing & Sustainability: A Design Perspective. 2010. In Cloud Computing Technology and Science (CloudCom), 2010 IEEE Second International Conference on, pp. 603--608.","paperID":"None"},{"content":"Yue Pan, David Roedl, John C. Thomas, and Eli Blevis. 2012. Re-conceptualizing fashion in sustainable HCI. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 621--630.","paperID":"None"},{"content":"Daniel Pargmann and Barath Raghavan. Limits'15: First Workshop on Computing within Limits. First Monday 20(8), Aug 2015. DOI: http://dx.doi.org/10.5210/fm.v20i8.6118","paperID":"None"},{"content":"Anne Sylvie Pharabod and Francois de Singly. The Impact of Digital Technology on the Family. Orange Digital Society Forum. Retrieved 29th December 2015 at http://digital-society-forum.orange.com/en/lesforums/52la_famille_connectee_ce_que_le_numerique_fait_a_la_famille","paperID":"None"},{"content":"James Pierce. 2012. Undesigning technology: considering the negation of design by design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 957--966.","paperID":"None"},{"content":"Chris Preist and Paul Shabajee. 2010. Energy Use in the Media Cloud: Behaviour Change, or Technofix? In Cloud Computing Technology and Science (CloudCom), 2010 IEEE Second International Conference on, pp. 581--586.","paperID":"None"},{"content":"Christian Remy and Elaine M. Huang. 2015. Addressing the obsolescence of end-user devices: approaches from the field of sustainable HCI. In ICT Innovations for Sustainability, pp. 257--267. Springer International Publishing, 2015.","paperID":"None"},{"content":"Johan Rockström, Johan, Will Steffen, Kevin Noone, Åsa Persson, F. Stuart Chapin, Eric F. Lambin, Timothy M. Lenton et al. 2009. A safe operating space for humanity. Nature 461, no. 7263 (2009): 472--475.","paperID":"None"},{"content":"Inge Røpke and Toke Haunstrup Christensen. Energy impacts of ICT Insights from an everyday life perspective. Telematics and Informatics 29, no. 4 (2012): 348--361.","paperID":"None"},{"content":"Scality. Data that lives forever in the cloud. Press release, June 2011. Retrieved 30th December 2015 from: http://tinyurl.com/hsvnfg3","paperID":"None"},{"content":"Daniel Schien, Chris Preist, Mike Yearworth, and Paul Shabajee. 2012. Impact of location on the energy footprint of digital media. In Sustainable Systems and Technology (ISSST), 2012 IEEE International Symposium on, pp. 1--6.","paperID":"None"},{"content":"Daniel Schien, Daniel, Paul Shabajee, Stephen G. Wood, and Chris Preist. 2013. A model for green design of online news media services. In Proceedings of the 22nd international conference on World Wide Web, pp. 1111--1122. International World Wide Web Conferences Steering Committee.","paperID":"None"},{"content":"Daniel Schien, Paul Shabajee, Mike Yearworth, and Chris Preist. 2013. Modeling and assessing variability in energy consumption during the use stage of online multimedia services. Journal of Industrial Ecology 17, no. 6 (2013): 800--813.","paperID":"None"},{"content":"R. J. G. Simons, and A. Pras, 2010. The hidden energy cost of web advertising. Retrieved 24th September 2015 from http://eprints.eemcs.utwente.nl/18066/01/HiddenEnergy-Costs.pdf","paperID":"None"},{"content":"M. Six Silberman, Lisa Nathan, Bran Knowles, Roy Bendor, Adrian Clear, Maria Håkansson, Tawanna Dillahunt, and Jennifer Mankoff. 2014. Next steps for sustainable HCI. interactions 21, 5 (September 2014), 66--69.","paperID":"None"},{"content":"Surfline, Accessed 24th September 2015 at http://www.surfline.com/home/index.cfm","paperID":"None"},{"content":"Sustainable Development Commission, 2007. You are what you sell. Retrieved 23rd September 2015 from http://www.sdcommission.org.uk/publications.php?id=624","paperID":"None"},{"content":"Gregg Tarr. Global action cam sales to hit 9M in 2018. Retrieved 24th September 2015 from http://www.twice.com/news/statistics/global-actioncam-sales-hit-9m-2018/46008","paperID":"None"},{"content":"Stephen P. Tarzia, Peter A. Dinda, Robert P. Dick, and Gokhan Memik. 2010. Display power management policies in practice. In Proceedings of the 7th international conference on Autonomic computing (ICAC '10). ACM, NY, NY, USA, 51--60.","paperID":"None"},{"content":"Tidal Music and Video Streaming Service publicity. Accessed 30th December 2015 at: http://tidal.com/","paperID":"None"},{"content":"Bill Tomlinson, Eli Blevis, Bonnie Nardi, Donald J. Patterson, M. SIX Silberman, and Yue Pan. 2013. Collapse informatics and practice: Theory, method, and design. ACM Transactions on Computer Human Interaction 20, 4, Article 24 (September 2013), 26 pages.","paperID":"None"},{"content":"U.S. Environmental Protection Agency. (2007). Report to Congress on Server and Data Center Energy Efficiency Public Law 109--431.","paperID":"None"},{"content":"Daniel R. Williams, Peter Thomond, and Ian Mackenzie. 2014. The greenhouse gas abatement potential of enterprise cloud computing. Environmental Modelling & Software 56 (2014): 6--12.","paperID":"None"},{"content":"Martin Woolley. 2003. Choreographing obsolescence ecodesign: the pleasure/dissatisfaction cycle. In Proceedings of the 2003 international conference on Designing pleasurable products and interfaces, pp. 7781. ACM.","paperID":"None"},{"content":"World Business Council for Sustainable Development. Eco-Efficiency: Creating More Value with Less Impact. 2000. Retrieved 31st December 2015 from http://oldwww.wbcsd.org/web/publications/eco_efficiency_creating_more_value.pdf","paperID":"None"},{"content":"Xiao Zhang and Ron Wakkary. 2011. Design analysis: understanding e-waste recycling by Generation Y. In Proceedings of the 2011 Conference on Designing Pleasurable Products and Interfaces (DPPI '11). ACM, NY, NY, USA, Article 6.","paperID":"None"},{"content":"John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, NY, NY, USA, 493--502.","paperID":"None"}],"title":"Understanding and Mitigating the Effects of Device and Cloud Service Design Decisions on the Environmental Footprint of Digital Infrastructure","filename":"CHI16/p1324","authors":["Chris Preist","Daniel Schien","Eli Blevis"],"conference":"CHI '16"}