{"paperId":2858343,"citation":[],"abstract":"Massive changes in the economy and computing technology in recent years call for a close examination of their relationship. Changes include a broad range of topics and issues, some of which directly and crucially fall within the purview of HCI research and practice. We propose a perspective that engages issues of political economy, with a focus on social inequality. We introduce some of the history of concepts of this perspective, and discuss implications for HCI. We observe that practical and conceptual resources within HCI for considering political economy and inequality are emerging.","reference":[{"content":"Baumer, E. and Silberman, M. (2011). When the implication is not to design (technology). Proc CHI'11. Pp. 2271-2274.","paperID":"None"},{"content":"Bellotti, V., Cambridge, S., Hoy, K., Shih, P., Handalian, L. Han, K., and Carroll, J.M. (2014). Towards Community-Centered Support for Peer-to-Peer Service Exchange: Rethinking the Timebanking Metaphor. Proc NordiCHI 2014. Pp. 2975-2984.","paperID":"None"},{"content":"Black, B. (1986). The Abolition of Work and Other Essays. http://inspiracy.com/black/abolition/part1.html","paperID":"None"},{"content":"Blevis, E. (2007). Sustainable interaction design: Invention & disposal, renewal & reuse. Proc CHI'07. Pp. 503-512.","paperID":"None"},{"content":"Boltanski, L. and Chiapello, È. (2005). The New Spirit of Capitalism. Verso.","paperID":"None"},{"content":"Brynjarsdóttir, H., Håkansson, M., Pierce, J., Baumer, E., DiSalvo, C. and Sengers, P. (2012). Sustainably unpersuaded: How persuasion narrows our vision of sustainability. Proc CHI'12. Pp. 947-956.","paperID":"None"},{"content":"Brynjolfsson, E. and McAfee, A. (2011). Race Against the Machine. Digital Frontier Press.","paperID":"None"},{"content":"Buchanan, J. (1999). The Logical Foundations of Constitutional Liberty. Liberty Fund.","paperID":"None"},{"content":"Caffentzis, G. (2013). In Letters of Blood and Fire. PM Press.","paperID":"None"},{"content":"Card, S., Moran, T. and Newell, A. (1983). The Psychology of Human-Computer Interaction. LEA.","paperID":"None"},{"content":"Dillahunt, T. (2014). Fostering social capital in economically distressed communities. Proc CHI '14. Pp. 531--540.","paperID":"None"},{"content":"Dillahunt, T. (2014). Toward a deeper understanding of sustainability within HCI. CHI'14 Extended Abstracts.","paperID":"None"},{"content":"Dillahunt, T., Mankoff, J., Paulos, E., Fussell, S. (2009). It's not all about green: Energy use in low-income communities. Proc Ubicomp'09. Pp. 255--264.","paperID":"None"},{"content":"Ekbia, H. and Nardi, B. (2014). Heteromation and its (dis)contents. First Monday, June.","paperID":"None"},{"content":"Engeström, Y. (2007). From communities of practice to mycorrhizae. In Hughes et al. (eds.) Communities of Practice: Critical Perspectives. Routledge. Pp. 41--54.","paperID":"None"},{"content":"Foster, J. (2002). Ecology Against Capitalism. Monthly Review Press.","paperID":"None"},{"content":"Friedman, B. Value-sensitive design. (1996). Interactions 3(6):16--20.","paperID":"None"},{"content":"Friedman, B. and Nathan, L. P. (2010). Multi-lifespan information system design. Proc CHI'10. Pp. 22432246.","paperID":"None"},{"content":"Galbraith, J. K. (1985). The Economics of Innocent Fraud: Truth for Our Time. Allen Lane.","paperID":"None"},{"content":"Gorz, A. (1985). Paths to Paradise. South End Press.","paperID":"None"},{"content":"Grudin, J. (1990). The computer reaches out: The historical continuity of interface design. Proc CHI 1990. Pp. 261--268.","paperID":"None"},{"content":"Håkansson, M. and Sengers, P. (2013). Beyond Being Green: Simple Living Families and ICT. Proc. CHI '13. Pp. 2725-2734.","paperID":"None"},{"content":"Harvey, D. (2007). The Enigma of Capital. Oxford University Press.","paperID":"None"},{"content":"Huws, U. (2003). The Making of a Cyberteriat: Virtual Work in a Real World. Monthly Review Press.","paperID":"None"},{"content":"IPCC (2014). Climate Change 2013: The Physical Science Basis. Working Group I Contribution to the Fifth Assessment Report of the IPCC.","paperID":"None"},{"content":"Irani, L. and Silberman, S. (2013). Turkopticon: Interrupting worker invisibility in Amazon Mechanical Turk. Proc CHI'13. Pp. 16--21.","paperID":"None"},{"content":"Jackson, S. (2014). Rethinking Repair. In Media Technologies. T. Gillespie et al., eds. MIT Press.","paperID":"None"},{"content":"Joshi, S. and Cerrato Pargman, T. (2015). On Fairness & Sustainability: Motivating Change in the Networked Society. Proceedings ICT4S.","paperID":"None"},{"content":"Kallinikos, J. (2004). Farewell to constructivism. In The Social Study of Inf and Com Technology. C. Avgerou et al., eds. Oxford U Press. Pp. 140--161.","paperID":"None"},{"content":"Kirman, B., Lawson, S., Linehan, J. and O'Hara, D. (2013). CHI and the future robot enslavement of humankind; A retrospective. Proc CHI'13.","paperID":"None"},{"content":"Knowles, B., Blair, L., Hazas, M. and Walker, S. (2013). Exploring sustainability research in computing. Proc Ubicomp'13. Pp. 305-314.","paperID":"None"},{"content":"Knowles, B. and Eriksson, E. (2015). Deviant and guiltridden: Computing within psychological limits. First Monday, August 2015.","paperID":"None"},{"content":"Knowles, B., Lochrie, M., Coulton, P., and Whittle, J. (2014). Barter: a technology strategy for local wealth generation. IT Professional 16 (3): 28--34.","paperID":"None"},{"content":"Kuutti, K. (2010). Where are the Ionians of user experience research? Proc NordiCHI'10. Pp. 715-718.","paperID":"None"},{"content":"LeDantec, C. (2012). Participation and publics: Supporting community engagement. Proc CHI 2012. Pp. 1351--1360.","paperID":"None"},{"content":"MacKenzie D., Muniesa, F. and Siu, L. (2007). Do Economists Make Markets? Princeton University Press.","paperID":"None"},{"content":"Maestri, L. and Wakkary, R. (2011). Understanding repair as a creative process of everyday design. Creativity and Cognition: 81--90.","paperID":"None"},{"content":"Marshall, A. (1890). The Principles of Economics. Macmillan and Co.","paperID":"None"},{"content":"Marx, K. (1939/1993). Grundrisse: Foundations of a Critique of Political Economy. Penguin Classics.","paperID":"None"},{"content":"Mosco, V. (2009). The Political Economy of Communication. Sage Publications.","paperID":"None"},{"content":"Morozov, E. (2013). To Save Everything, Click Here: The Folly of Technological Solutionism. Public Affairs.","paperID":"None"},{"content":"Nathan, L. (2008). Ecovillages, Values, and Information Technology: Balancing Sustainability with Daily Life in 21st Century America. Proc CHI Extended Abstracts. Pp. 3723-3728.","paperID":"None"},{"content":"Ostrom, E. (2010). Beyond markets and states: Polycentric governance of complex economic systems. American Economic Review 100: 1--33.","paperID":"None"},{"content":"Palen, L., Vieweg, S. and Anderson, K. (2011). Supporting \"everyday analysts\" in time- and safety-critical situations. The Information Society 27(1): 52--62.","paperID":"None"},{"content":"Pargman, D. and Raghavan, B. (2014). Rethinking sustainability in computing: From buzzword to nonnegotiable limits. Proc NordiCHI'14.","paperID":"None"},{"content":"Patel, N., Savani, K., Dave, P., Shah, K., Klemmer, S. and Parikh, T. (2013). Power to the peers: Authority of source effects for a voice-based agricultural information service in rural India. ITID 9(2).","paperID":"None"},{"content":"Peterson, V. (2005). How (the meaning of) gender matters in political economy. New Political Economy 10(4): 499--521.","paperID":"None"},{"content":"Pierce, J. (2012). Undesigning technology: Considering the negation of design by design. Proc CHI'12. Pp. 957966.","paperID":"None"},{"content":"Pierce, J., Strengers, Y., Sengers, P. and Bødker, S. (2013). Intro to special issue on practice-oriented approaches. TOCHI 20(4).","paperID":"None"},{"content":"Piketty, T. (2014). Capital in the Twenty-First Century. Belknap Press.","paperID":"None"},{"content":"Ratto, M. (2011). Critical Making: Conceptual and Material Studies in Technology and Social Life. The Information Society, 27 (4).","paperID":"None"},{"content":"Robinson, M. and Bannon, L. (1991). Questioning representations. Proc ECSCW'91. Pp. 219--233.","paperID":"None"},{"content":"Robertson, T. and Simonsen, J. (2013). Participatory Design: An Introduction. New York: Routledge International.","paperID":"None"},{"content":"Saez, E. and Zucman, G. (2014). Wealth Inequality in the USA since 1913. http://gabrielzucman.eu/files/SaezZucman2014Slides.pdf","paperID":"None"},{"content":"Sambasivan, N., Ho, M., Kam, M. Kodagoda, N., Dray, S., Thomas, J. and Light, A. (2009). Human-centered computing in international development. Proc CHI EA '09. Pp. 4745--4750.","paperID":"None"},{"content":"schraefel, m.c. (2013). Green food through green food: A human centered design approach to green food technology. UbiComp'13 Adjunct. Pp. 595--598.","paperID":"None"},{"content":"Sennett, R. (2006). The Culture of the New Capitalism. Yale University Press.","paperID":"None"},{"content":"Silberman, M.S. (2015). Human-Centered Computing and the Future of Work: Lessons from Mechanical Turk and Turkopticon, 2008-2015. PhD Thesis, University of California, Irvine.","paperID":"None"},{"content":"Standing, G. (2011). The Precariat. Bloomsbury Academic.","paperID":"None"},{"content":"Stigler, G. (1971). The Theory of Economic Regulation. University of Chicago Press.","paperID":"None"},{"content":"Stiglitz, G. (2006). Making Globalization Work. W. W. Norton.","paperID":"None"},{"content":"Suarez-Villa, L. (2012). Globalization and Technocapitalism. Ashgate.","paperID":"None"},{"content":"Suarez-Villa, L. (2015). Corporate Power, Oligopolies, and the Crisis of the State. SUNY Press.","paperID":"None"},{"content":"Taylor, A. (2014). The People's Platform. Metropolitan.","paperID":"None"},{"content":"Tomlinson, W., Blevis, E., Nardi, B., Patterson, D., Silberman, M. and Pan, Y. (2013). Collapse informatics and practice. TOCHI 20 (4): Article 24.","paperID":"None"},{"content":"Toyama, K. (2015). Geek Heresy: Rescuing Social Change from the Cult of Technology. Public Affairs Press.","paperID":"None"},{"content":"Van Dijk, J. (2009). Users like you? Theorizing agency in user-generated content. Media, Culture and Society 31: 41--58.","paperID":"None"},{"content":"Van Dijk, J. and Nieborg, D. (2009). Wikinomics and its discontents: A critical analysis of Web 2.0 business manifestos. New Media & Society 11(5): 855--874.","paperID":"None"},{"content":"Wakkary, R. and Tanenbaum, K. (2009). A sustainable identity: The creativity of an everyday designer. Proc CHI'09. Pp. 365-374.","paperID":"None"},{"content":"Weber, M. (1904/2002). The Protestant Ethic and the Spirit of Capitalism. London & Boston: Unwin Hyman.","paperID":"None"},{"content":"Williamson, O. (2000). The Economic Institutions of Capitalism. The Free Press.","paperID":"None"},{"content":"Winner, L. (1980). Do artifacts have politics? Daedalus 109: 121--136.","paperID":"None"},{"content":"Woelfer, J. and Hendry, D. (2011). Homeless young people and technology. Interactions. Pp. 70--73.","paperID":"None"},{"content":"Wong, J. (2009). Prepare for descent: Interaction design in our new future. Workshop paper. Proc CHI'09.","paperID":"None"}],"title":"Social Inequality and HCI: The View from Political Economy","filename":"CHI16/p4997","authors":["Hamid Ekbia","Bonnie Nardi"],"conference":"CHI '16"}