{"paperId":2858069,"abstract":"We describe the design, implementation, and deployment of Fenestra, a domestic technology embodied in the form of a wirelessly connected round mirror, photo frame, and candle that displays photos of departed loved ones. Fenestra's interaction design, form, and materials are inspired by Japanese domestic practices of memorializing departed loved ones with a home altar called butsudan. We deployed Fenestra in three Japanese households to explore how this design artifact might support everyday domestic practices of memorialization, and where complications might potentially emerge. Findings reveal that a range of outcomes emerged across our participants' experiences of living with Fenestra--from profound remembrance to unexpected uses to unsettling encounters. These findings are interpreted to present opportunities for future research and practice initiatives in the HCI community.","citation":[],"reference":[{"content":"Toshimaro Ama. 2005. Why are the Japanese non-religious?: Japanese spirituality: being non-religious in a religious culture. University Press of America.","paperID":"None"},{"content":"Genevieve Bell. 2006. No more SMS from Jesus: ubicomp, religion and techno-spiritual practices. In UbiComp 2006: Ubiquitous Computing. Springer, 141-158.","paperID":"None"},{"content":"George A. Bonanno and Stacey Kaltman. 1999. Toward an integrative perspective on bereavement. Psychological bulletin 125, 6: 760.","paperID":"None"},{"content":"Jed R. Brubaker, Lynn S. Dombrowski, Anita M. Gilbert, Nafiri Kusumakaulika, and Gillian R. Hayes. 201 Stewarding a Legacy: Responsibilities and Relationships in the Management of Post-mortem Data. Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 4157-4166. http://doi.org/10.1145/2556288.2557059","paperID":"None"},{"content":"Jed R. Brubaker and Gillian R. Hayes. 2011. We will never forget you [online]: an empirical investigation of post-mortem myspace comments. Proceedings of the ACM 2011 conference on Computer supported cooperative work, ACM, 123-132.","paperID":"None"},{"content":"Elizabeth Buie and Mark Blythe. 2013. Spirituality: there's an app for that!(but not a lot of research). CHI'13 Extended Abstracts on Human Factors in Computing Systems, ACM, 2315-2324.","paperID":"None"},{"content":"Dan Cosley, Victoria Schwanda Sosik, Johnathon Schultz, S. Tejaswi Peesapati, and Soyoung Lee. 2012. Experiences with designing tools for everyday reminiscing. Human-Computer Interaction 27, 1--2: 175-198.","paperID":"None"},{"content":"Minako Deno, Mitsunori Miyashita, Daisuke Fujisawa, Satomi Nakajima, and Masaya Ito. 2011. The relationships between complicated grief, depression, and alexithymia according to the seriousness of complicated grief in the Japanese general population. Journal of affective disorders 135, 1: 122-127.","paperID":"None"},{"content":"Tanja Döring, Axel Sylvester, and Albrecht Schmidt. 2013. Ephemeral user interfaces: valuing the aesthetics of interface components that do not last. interactions 20, 4: 32-37.","paperID":"None"},{"content":"Ruth M. Van Dyke and Susan E. Alcock. 2003. Archaeologies of memory: An introduction. Archaeologies of memory: 1-13. Cambridge University Press.","paperID":"None"},{"content":"Pin Sym Foong and Denisa Kera. 2008. Applying reflective design to digital memorials. In Proceedings of International Workshop on Social and Mundane Technologies.","paperID":"None"},{"content":"Batya Friedman and Lisa P. Nathan. 2010. Multi-lifespan information system design: a research initiative for the hci community. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2243-2246.","paperID":"None"},{"content":"William Gaver, Mark Blythe, Andy Boucher, Nadine Jarvis, John Bowers, and Peter Wright. 2010. The prayer companion: openness and specificity, materiality and spirituality. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 2055-2064.","paperID":"None"},{"content":"William Gaver, Phoebe Sengers, Tobie Kerridge, Joseph Kaye, and John Bowers. 2007. Enhancing Ubiquitous Computing with User Interpretation: Field Testing the Home Health Horoscope. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 537-546. http://doi.org/10.1145/1240624.1240711","paperID":"None"},{"content":"William W. Gaver, John Bowers, Kirsten Boehner, et al. 2013. Indoor Weather Stations: Investigating a Ludic Approach to Environmental HCI Through Batch Prototyping. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3451-3460. http://doi.org/10.1145/2470654.2466474","paperID":"None"},{"content":"Barney Glaser and Anselm L. Strauss. 2009. The discovery of grounded theory: Strategies for qualitative research. Transaction Publishers.","paperID":"None"},{"content":"Ann-Marie Golden, Tim Dalgleish, and Bundy Mackintosh. 2007. Levels of specificity of autobiographical memories and of biographical memories of the deceased in bereaved individuals with and without complicated grief. Journal of abnormal psychology 116, no. 4: 786.","paperID":"None"},{"content":"Rebecca Gulotta, William Odom, Haakon Faste, and Jodi Forlizzi. 2014. Legacy in the Age of the Internet: Reflections on How Interactive Systems Shape How We Are Remembered. Proceedings of the 2014 Conference on Designing Interactive Systems, ACM, 975-984. http://doi.org/10.1145/2598510.2598579","paperID":"None"},{"content":"Rebecca Gulotta, William Odom, Jodi Forlizzi, and Haakon Faste. 2013. Digital Artifacts As Legacy: Exploring the Lifespan and Value of Digital Data. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1813-1822. http://doi.org/10.1145/2470654.2466240","paperID":"None"},{"content":"Elizabeth Hallam and Jenny Hockey. 2001. Death, memory and material culture. Bloomsbury Academic.","paperID":"None"},{"content":"Lars Hallnäs and Johan Redström. 2001. Slow technology-designing for reflection. Personal and ubiquitous computing 5, 3: 201-212.","paperID":"None"},{"content":"John Helmes, Alex S. Taylor, Xiang Cao, Kristina Höök, Peter Schmitt, and Nicolas Villar. 2010. Rudiments 1, 2 & 3: design speculations on autonomy. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction (TEI '11). ACM, NY, NY, USA, 145--152.","paperID":"None"},{"content":"Michelle Hlubinka, Jennifer Beaudin, Emmanuel Munguia Tapia, and John S. An. 2002. AltarNation: interface design for meditative communities. CHI'02 Extended Abstracts on Human Factors in Computing Systems, ACM, 612-613.","paperID":"None"},{"content":"Hilary Hutchinson, Wendy Mackay, Bo Westerlund, et al. 2003. Technology probes: inspiring design for and with families. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 17-","paperID":"None"},{"content":"Masaya Ito, Satomi Nakajima, Daisuke Fujisawa, et al. 2012. Brief measure for screening complicated grief: reliability and discriminant validity. PloS one 7, 2: e31209.","paperID":"None"},{"content":"Jack B. Kamerman. 1988. Death in the midst of life: Social and cultural influences on death, grief, and mourning. Prentice Hall.","paperID":"None"},{"content":"Dave Kirk, Rolf Wiesemes, Adam Moore, and Jim Kosem. 2010. Towards Pervasive Monuments. Proceedings of Digital Futures 10.","paperID":"None"},{"content":"David S. Kirk and Abigail Sellen. 2010. On human remains: Values and practice in the home archiving of cherished objects. ACM Transactions on Computer-Human Interaction (TOCHI) 17, 3: 10.","paperID":"None"},{"content":"Dennis Klass, Phyllis R. Silverman, and Steven Nickman. 2014. Continuing bonds: New understandings of grief. Taylor & Francis.","paperID":"None"},{"content":"Tuck Leong, Frank Vetere, and Steve Howard. 2008. Abdicating choice: the rewards of letting go. Digital Creativity 19, 4: 233-243.","paperID":"None"},{"content":"Tuck Wah Leong, Frank Vetere, and Steve Howard. 2006. Randomness as a resource for design. Proceedings of the 6th conference on Designing Interactive Systems, ACM, 132-139.","paperID":"None"},{"content":"Avril Maddrell and James D. Sidaway. 2010. Deathscapes: Spaces for death, dying, mourning and remembrance. Ashgate Publishing.","paperID":"None"},{"content":"Michael Massimi and Ronald M. Baecker. 2011. Dealing with death in design: Developing systems for the bereaved. Proceedings of the 2011 annual conference on Human factors in computing systems, ACM, 1001-1010.","paperID":"None"},{"content":"Michael Massimi and Andrea Charise. 2009. Dying, death, and mortality: towards thanatosensitivity in HCI. CHI'09 Extended Abstracts on Human Factors in Computing Systems, ACM, 2459-2468.","paperID":"None"},{"content":"Michael Massimi, William Odom, Richard Banks, and David Kirk. 2011. Matters of Life and Death: Locating the End of Life in Lifespan-oriented Hci Research. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 987-996. http://doi.org/10.1145/1978942.1979090","paperID":"None"},{"content":"Matthew Miles and A. Michael Huberman. Qualitative data analysis: An expanded sourcebook. Sage, 1994.","paperID":"None"},{"content":"Wendy Moncur, Miriam Julius, Elise van Denhoven, and David Kirk. 2015. Story Shell: The Participatory Design of a Bespoke Digital Memorial. In Proceedings of 4th Participatory Innovation Conference, 470--477.","paperID":"None"},{"content":"Wendy Moncur and David Kirk. 2014. An emergent framework for digital memorials. Proceedings of the 2014 conference on Designing interactive systems, ACM, 965-974.","paperID":"None"},{"content":"Wendy Moncur, Jan Bikker, Elaine Kasket, and John Troyer. 2012. From death to final disposition: roles of technology in the post-mortem interval. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 531--540. DOI=10.1145/2207676.2207750","paperID":"None"},{"content":"Wendy Moncur. 2013. The emotional wellbeing of researchers: considerations for practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1883--1890. DOI=10.1145/2470654.2466248","paperID":"None"},{"content":"William Odom, Richard Harper, Abigail Sellen, David Kirk, and Richard Banks. 2010. Passing on & putting to rest: understanding bereavement in the context of interactive technologies. Proceedings of the SIGCHI conference on Human Factors in computing systems, ACM, 1831-1840.","paperID":"None"},{"content":"William Odom, James Pierce, Erik Stolterman, and Eli Blevis. 2009. Understanding why we preserve some things and discard others in the context of interaction design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1053-1062. Retrieved September 19, 2015 from http://dl.acm.org/citation.cfm?id=1518862","paperID":"None"},{"content":"William T. Odom, Abigail J. Sellen, Richard Banks, et al. 2014. Designing for Slowness, Anticipation and Re-visitation: A Long Term Field Study of the Photobox. Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1961-1970. http://doi.org/10.1145/2556288.2557178","paperID":"None"},{"content":"William Odom, John Zimmerman, and Jodi Forlizzi. 2014. Placelessness, Spacelessness, and Formlessness: Experiential Qualities of Virtual Possessions. Proceedings of the 2014 Conference on Designing Interactive Systems, ACM, 985-994. http://doi.org/10.1145/2598510.2598577","paperID":"None"},{"content":"Daniela Petrelli, Simon Bowen, and Steve Whittaker. 2014. Photo Mementos: Designing Digital Media to Represent Ourselves at Home. Int. J. Hum.-Comput. Stud. 72, 3: 320-336. http://doi.org/10.1016/j.ijhcs.2013.09.009","paperID":"None"},{"content":"Daniela Petrelli, Nicolas Villar, Vaiva Kalnikaite, Lina Dib, and Steve Whittaker. 2010. FM radio: family interplay with sonic mementos. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2371-2380.","paperID":"None"},{"content":"Jason Procyk and Carman Neustaedter. 2014. GEMS: The Design and Evaluation of a Location-based Storytelling Game. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1156-1166. http://doi.org/10.1145/2531602.2531701","paperID":"None"},{"content":"Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph \"Jofish\" Kaye. 2005. Reflective Design. Proceedings of the 4th Decennial Conference on Critical Computing: Between Sense and Sensibility, ACM, 49-58. http://doi.org/10.1145/1094562.1094569","paperID":"None"},{"content":"M. Katherine Shear, Naomi Simon, Melanie Wall, et al. 2011. Complicated grief and related bereavement issues for DSM-5. Depression and anxiety 28, 2: 103-117.","paperID":"None"},{"content":"Robert John Smith. 1974. Ancestor worship in contemporary Japan. Stanford University Press.","paperID":"None"},{"content":"Hikaru Suzuki. 2013. \"Beyond Ancestor Worship: Continued Relationship With Significant Others.\" In Death and Dying in Contemporary Japan, 141--141.","paperID":"None"},{"content":"Wenn-Chieh Tsai, Po-Hao Wang, Hung-Chi Lee, Rung-Huei Liang, and Jane Hsu. 2014. The reflexive printer: toward making sense of perceived drawbacks in technology-mediated reminiscence. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 995--1004. DOI=10.1145/2598510.2598589","paperID":"None"},{"content":"Daisuke Uriu and Naohito Okude. 2010. ThanatoFenestra: photographic family altar supporting a ritual to pray for the deceased. In Adjunct Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, NY, NY, USA, 422--425. DOI=10.1145/1858171.1858253","paperID":"None"},{"content":"Daisuke Uriu, Takahiro Ogasawara, Naohito Shimizu, and Naohito Okude. 2006. MASTABA: the household shrine in the future archived digital pictures. ACM SIGGRAPH 2006 Sketches, ACM, 151.","paperID":"None"},{"content":"Jay Vidyarthi, Bernhard E. Riecke, and Diane Gromala. 2012. Sonic Cradle: Designing for an Immersive Experience of Meditation by Connecting Respiration to Music. Proceedings of the Designing Interactive Systems Conference, ACM, 408-417. http://doi.org/10.1145/2317956.2318017","paperID":"None"},{"content":"Tony Walter, Rachid Hourizi, Wendy Moncur, and Stacey Pitsillides. 2012. Does the internet change how we die and mourn? Overview and analysis. Omega-Journal of Death and Dying 64, 4: 275-302.","paperID":"None"},{"content":"Jonathan Watts. 2012. The vihara of compassion: an introduction to Buddhist care for the dying and bereaved in the modern world. Contemporary Buddhism 13, 1: 139-155.","paperID":"None"},{"content":"Franz Winter. 2014. Handbook of Contemporary Japanese Religions. Religious Studies Review 40, 4: 191-194.","paperID":"None"},{"content":"Allison Woodruff, Sally Augustin, and Brooke Foucault. 2007. Sabbath day home automation: it's like mixing technology and religion. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 527-536.","paperID":"None"},{"content":"Kate Woodthorpe. 2011. Using bereavement theory to understand memorialising behaviour. Bereavement Care 30, 2: 29-32.","paperID":"None"},{"content":"Susan P. Wyche, Kelly E. Caine, Benjamin K. Davison, Shwetak N. Patel, Michael Arteaga, and Rebecca E. Grinter. 2009. Sacred imagery in techno-spiritual design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 55-58.","paperID":"None"},{"content":"Susan P. Wyche and Rebecca E. Grinter. 2009. Extraordinary computing: religion as a lens for reconsidering the home. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 749-758.","paperID":"None"},{"content":"John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research Through Design As a Method for Interaction Design Research in HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 493-502. http://doi.org/10.1145/1240624.1240704","paperID":"None"}],"title":"Designing for Domestic Memorialization and Remembrance: A Field Study of Fenestra in Japan","filename":"CHI16/p5945","authors":["Daisuke Uriu","William Odom"],"conference":"CHI '16"}