{"paperId":2858204,"citation":[],"reference":[{"content":"Jayeeta Banerjee, Deepti Majumdar, Madhu Sudan Pal, and Dhurjati Majumdar. 2011. Readability, subjective preference and mental workload studies on young indian adults for selection of optimum font type and size during onscreen reading. Al Ameen Journal of Medical Sciences 4 (2011), 131--143.","paperID":"None"},{"content":"Michael Bernard, Chia Hui Liao, and Melissa Mills. 2001. The Effects of Font Type and Size on the Legibility and Reading Time of Online Text by Older Adults. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, NY, NY, USA, 175--176. DOI: http://dx.doi.org/10.1145/634067.634173","paperID":"None"},{"content":"Michael Bernard, Bonnie Lida, Shannon Riley, Telia Hackler, and Karen Janzen. 2002. A comparison of popular online fonts: Which size and type is best. Usability News 4, 1 (2002), 2002.","paperID":"None"},{"content":"Michael L Bernard, Barbara S Chaparro, Melissa M Mills, and Charles G Halcomb. 2003. Comparing the effects of text size and format on the readibility of computer-displayed Times New Roman and Arial text. International Journal of Human-Computer Studies 59, 6 (2003), 823--835.","paperID":"None"},{"content":"David Beymer, Daniel Russell, and Peter Orton. 2008. An Eye Tracking Study of How Font Size and Type Influence Online Reading. In Proceedings of the 22Nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction - Volume 2 (BCS-HCI '08). British Computer Society, Swinton, UK, UK, 15--18. http://dl.acm.org/citation.cfm?id=1531826.1531831","paperID":"None"},{"content":"David Beymer and Daniel M. Russell. 2005. WebGazeAnalyzer: A System for Capturing and Analyzing Web Reading Behavior Using Eye Gaze. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, NY, NY, USA, 1913--1916. DOI: http://dx.doi.org/10.1145/1056808.1057055","paperID":"None"},{"content":"David Beymer, Daniel M Russell, and Peter Z Orton. 2007. An eye tracking study of how font size, font type, and pictures influence online reading. Proceedings INTERACT 2007 (2007), 456--460.","paperID":"None"},{"content":"Sanjiv K Bhatia, Ashok Samal, Nithin Rajan, and Marc T Kiviniemi. 2011. Effect of font size, italics, and colour count on web usability. International Journal of Computational Vision and Robotics 2, 2 (2011), 156--179.","paperID":"None"},{"content":"Laura Bix. 2002. The Elements of Text and Message Design and Their Impact on Message Legibility: A Literature Review. Journal of Design Communication 4 (2002).","paperID":"None"},{"content":"Dan Boyarski, Christine Neuwirth, Jodi Forlizzi, and Susan Harkness Regli. 1998. A Study of Fonts Designed for Screen Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '98). ACM Press/Addison-Wesley Publishing Co., NY, NY, USA, 87--94. DOI: http://dx.doi.org/10.1145/274644.274658","paperID":"None"},{"content":"Georg Buscher, Ralf Biedert, Daniel Heinesch, and Andreas Dengel. 2010. Eye tracking analysis of preferred reading regions on the screen. In CHI '10 Extended Abstracts on Human Factors in Computing Systems. ACM, 3307--3312.","paperID":"None"},{"content":"C. Chapman. 2011. The most popular fonts used by designers. http://www.webdesignerdepot.com/2011/08/ the-most-popular-fonts-used-by-designers/. (August 2011). last accessed Jan 8, 2016.","paperID":"None"},{"content":"Jan Constantin. 2013. Typographic Design Patterns And Current Practices (2013 Edition). Smashing Magazine.http://www.smashingmagazine.com/2013/05/ typographic-design-patterns-practices-case-study-2013/. (May 2013). last accessed Jan 8, 2016.","paperID":"None"},{"content":"Iain Darroch, Joy Goodman, Stephen Brewster, and Phil Gray. 2005. The Effect of Age and Font Size on Reading Text on Handheld Computers. In Proceedings of the 2005 IFIP TC13 International Conference on Human-Computer Interaction (INTERACT'05). Springer-Verlag, Berlin, Heidelberg, 253--266. DOI: http://dx.doi.org/10.1007/11555261_23","paperID":"None"},{"content":"S. Dehaene. 1992. Varieties of numerical abilities. Cognition 44 (1992), 1--42.","paperID":"None"},{"content":"Marc C. Dyson and Mark Haselgrove. 2001a. The influence of reading speed and line length on the effectiveness of reading from screen. Int. J. Human-Computer Studies 54 (2001), 582--612. DOI: http://dx.doi.org/doi:10.1006/ijhc.2001.0458","paperID":"None"},{"content":"Mary C Dyson and Mark Haselgrove. 2001b. The influence of reading speed and line length on the e?ectiveness of reading from screen. International Journal of Human-Computer Studies 54, 4 (2001), 585--612.","paperID":"None"},{"content":"L. Evett and D. Brown. 2005. Text formats and web design for visually impaired and dyslexic readers-Clear Text for All. Interacting with Computers 17 (2005), 453--472. Issue 4.","paperID":"None"},{"content":"M.A. Just and P.A. Carpenter. 1980. A theory of reading: From eye ?xations to comprehension. Psychological review 87 (1980), 329--354.","paperID":"None"},{"content":"Michael Martin. 2009. Typographic Design Patterns and Best Practices. Smashing Magazine.http://www.smashingmagazine.com/2009/08/ 20/typographic-design-survey-bestpractices-from-the-best-blogs. (2009). last accessed Jan 8, 2016.","paperID":"None"},{"content":"J. Nielsen. 2012. Lower-literacy users. Jakob Nielsen's Alertbox. http://www.useit.com/alertbox/20050314.html. (March 2012). last accessed Jan 8, 2016.","paperID":"None"},{"content":"Jakob Nielsen and Kara Pernice. 2010. Eyetracking web usability. New Riders Pub.","paperID":"None"},{"content":"Beth A O'Brien, J Stephen Mansfield, and Gordon E Legge. 2005. The effect of print size on reading speed in dyslexia. Journal of Research in Reading 28, 3 (2005), 332--349.","paperID":"None"},{"content":"Donald G. Paterson and Miles A. Tinker. 1929. Studies of typographical factors in?uencing speed of reading. II. Size of type. Journal of Applied Psychology 13, 2 (1929), 120.","paperID":"None"},{"content":"Donald G Paterson and Miles A Tinker. 1932. Studies of typographical factors influencing speed of reading. VIII. Space between lines or leading. Journal of Applied Psychology 16, 4 (1932), 388.","paperID":"None"},{"content":"Christopher Power, Helen Petrie, David Swallow, Emma Murphy, Bláithín Gallagher, and Carlos A Velasco. 2013. Navigating, Discovering and Exploring the Web: Strategies Used by People with Print Disabilities on Interactive Websites. In Human-Computer Interaction-INTERACT 2013. Springer, 667--684.","paperID":"None"},{"content":"K. Rayner and S.A. Duffy. 1986. Lexical complexity and fixation times in reading: Effects of word frequency, verb complexity, and lexical ambiguity. Memory & Cognition 14, 3 (1986), 191--201.","paperID":"None"},{"content":"Luz Rello and Mari-Carmen Marcos. 2012. An Eye Tracking Study on Text Customization for User Performance and Preference. In Proceedings of the 2012 Eighth Latin American Web Congress (LA-WEB '12). IEEE Computer Society, Washington, DC, USA, 64--70. DOI: http://dx.doi.org/10.1109/LA-WEB.2012.13","paperID":"None"},{"content":"Luz Rello, Martin Pielot, Mari-Carmen Marcos, and Roberto Carlini. 2013. Size Matters (Spacing Not): 18 Points for a Dyslexic-friendly Wikipedia. In Proceedings of the 10th International Cross-Disciplinary Conference on Web Accessibility (W4A '13). ACM, NY, NY, USA, Article 17, 4 pages. DOI: http://dx.doi.org/10.1145/2461121.2461125","paperID":"None"},{"content":"Jeff Sauro and Joseph S. Dumas. 2009. Comparison of Three One-question, Post-task Usability Questionnaires. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1599--1608. DOI: http://dx.doi.org/10.1145/1518701.1518946","paperID":"None"},{"content":"S.C. Sereno and K. Rayner. 2003. Measuring word recognition in reading: eye movements and event-related potentials. Trends in Cognitive Sciences 7, 11 (2003), 489--493.","paperID":"None"},{"content":"A. Dawn Shaikh. 2005. The Effects of Line Length on Reading Online News. Usability News 7, 2 (2005), 1--4.","paperID":"None"},{"content":"Tobii Technology. 2005. Product description Tobii 50 Series. (2005).","paperID":"None"}],"abstract":"We report from an eye-tracking experiment with 104 participants who performed reading tasks on the most popular text-heavy website of the Web: Wikipedia. Using a hybrid-measures design, we compared objective and subjective readability and comprehension of the articles for font sizes ranging from 10 to 26 points, and line spacings ranging from 0.8 to 1.8 (font: Arial). Our findings provide evidence that readability, measured via mean fixation duration, increased significantly with font size. Further, comprehension questions had significantly more correct responses for font sizes 18 and 26. For line spacing, we found marginal effects, suggesting that the two tested extremes (0.8 and 1.8) impair readability. These findings provide evidence that text-heavy websites should use fonts of size 18 or larger and use default line spacing when the goal is to make a web page easy to read and comprehend. Our results significantly differ from previous recommendations, presumably, because this is the first work to cover font sizes beyond 14 points.","title":"Make It Big!: The Effect of Font Size and Line Spacing on Online Readability","filename":"CHI16/p3637","authors":["Luz Rello","Martin Pielot","Mari-Carmen Marcos"],"conference":"CHI '16"}