{"paperId":2858254,"reference":[{"content":"Amelia Acker and Jed R. Brubaker. 2014. Death, Memorialization, and Social Media: A Platform Perspective for Personal Archives. Archivaria 77.","paperID":"None"},{"content":"Archive of Our Own. Terms of Service FAQ: Fannish Next of Kin. Retrieved from http://archiveofourown.org/tos_faq#next_of_kin","paperID":"None"},{"content":"Jed R. Brubaker, Lynn S. Dombrowski, Anita M. Gilbert, Nafiri Kusumakaulika, and Gillian R. Hayes. 2014. Stewarding a legacy. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 4157--4166. http://doi.org/10.1145/2556288.2557059","paperID":"None"},{"content":"Jed R. Brubaker, Gillian R. Hayes, and Paul Dourish. 2013. Beyond the Grave: Facebook as a Site for the Expansion of Death and Mourning. The Information Society 29, 3: 152--163. http://doi.org/10.1080/01972243.2013.777300","paperID":"None"},{"content":"Jed R. Brubaker and Gillian R. Hayes. 2011. \"We will never forget you [online]\": an empirical investigation of post-mortem MySpace comments. Proceedings of the ACM 2011 conference on Computer supported cooperative work CSCW '11, ACM Press, 123--132. http://doi.org/10.1145/1958824.1958843","paperID":"None"},{"content":"Jed R. Brubaker and Janet Vertesi. 2010. Death and the Social Network. HCI at the End of Life Workshop at CHI2010.","paperID":"None"},{"content":"Jed R. Brubaker. 2015. Death, Identity, and the Social Network. Dissertation at the University of California, Irvine.","paperID":"None"},{"content":"Facebook. Memorialization Request. Retrieved from https://www.facebook.com/help/contact/16052132","paperID":"None"},{"content":"Facebook. How do I report a deceased person or an account that needs to be memorialized? Retrieved from https://www.facebook.com/help/www/150486848","paperID":"None"},{"content":"Facebook. What will happen to my account if I pass away? Retrieved from https://www.facebook.com/help/www/103897939","paperID":"None"},{"content":"Robert Douglas Ferguson, Michael Massimi, Emily Anne Crist, and Karyn Anne Moffatt. 2014. Craving, creating, and constructing comfort. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14, ACM Press, 1479--1490. http://doi.org/10.1145/2531602.2531631","paperID":"None"},{"content":"P. S. Foong and D. Kera. 2008. Applying reflective design to digital memorials. SIMTech'08. Retrieved April 12, 2011 from http://mundanetechnologies.com/goingson/workshop/cambridge/papers/FoongKera.pdf","paperID":"None"},{"content":"P. S. Foong. 2008. Designing technology for sensitive contexts: supporting end-of-life decision making. Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat, ACM, 172--179. http://doi.org/10.1145/1517744.1517801","paperID":"None"},{"content":"Emily Getty, Jessica Cobb, Meryl Gabeler, Christine Nelson, Ellis Weng, and Jeffrey T Hancock. 2011. I Said Your Name in an Empty Room: Grieving and Continuing Bonds on Facebook. Proceedings of the 2011 annual conference on Human factors in computing systems CHI 11, ACM, 997--1000. http://doi.org/10.1145/1978942.1979091","paperID":"None"},{"content":"Margaret Gibson. 2015. Automatic and automated mourning: messengers of death and messages from the dead. Continuum 29, 3: 339--353. http://doi.org/10.1080/10304312.2015.1025369","paperID":"None"},{"content":"Google. About Inactive Account Manager. Google Accounts Help. Retrieved May 4, 2015 from https://support.google.com/accounts/bin/answer.py?answer=3036546","paperID":"None"},{"content":"E van den Hoven, W. Smeenk, H. Bilsen, Rob Zimmermann, Simone de Waart, and Koen van Turnhout. 2008. Communicating commemoration. Proc. of SIMTech '08. Retrieved October 13, 2010 from http://www.elisevandenhoven.com/publications/hoven-simtech08.pdf","paperID":"None"},{"content":"Joseph \"Jofish\" Kaye, Janet Vertesi, Shari Avery, et al. 2006. To have and to hold. Proceedings of the SIGCHI conference on Human Factors in computing systems CHI '06, ACM Press, 275. http://doi.org/10.1145/1124772.1124814","paperID":"None"},{"content":"David Kirk and R. Banks. 2008. On the design of technology heirlooms. Proc. SIMTech '08. Retrieved October 13, 2010 from http://www.cs.nott.ac.uk/~rcb/MScProjects/dis/Kirk&BanksTechnologyHeirlooms.pdf","paperID":"None"},{"content":"David S. Kirk and Abigail Sellen. 2010. On human remains: Values and practice in the home archiving of cherished objects. ACM Transactions on Computer-Human Interaction 17, 3: 1--43. http://doi.org/10.1145/1806923.1806924","paperID":"None"},{"content":"Cristiano Maciel and Vinicius Carvalho Pereira. 2013. Social network users' religiosity and the design of post mortem aspects. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 8119 LNCS, PART 3: 640--657. http://doi.org/10.1007/978--3--642--40477--1_43","paperID":"None"},{"content":"Michael Massimi and Ronald M Baecker. 2010. A Death in the Family: Opportunities for Designing Technologies for the Bereaved. Proceedings of the 28th international conference on Human factors in computing systems CHI '10, 1821--1830. http://doi.org/10.1145/1753326.1753600","paperID":"None"},{"content":"Michael Massimi and Andrea Charise. 2009. Dying, death, and mortality: towards thanatosensitivity in HCI. Proceedings of the 27th international conference extended abstracts on Human factors in computing systems, 2459--2468. Retrieved October 13, 2010 from http://portal.acm.org/citation.cfm?id=1520349","paperID":"None"},{"content":"Michael Massimi, Will Odom, David Kirk, and Richard Banks. 2010. HCI at the end of life. Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems CHI EA '10: 4477. http://doi.org/10.1145/1753846.1754178","paperID":"None"},{"content":"Michael Massimi, William Odom, Richard Banks, and David Kirk. 2011. Matters of Life and Death?: Locating the End of Life in Lifespan-Oriented HCI Research. CHI 2011.","paperID":"None"},{"content":"Michael Massimi. 2013. Exploring remembrance and social support behavior in an online bereavement support group. Proceedings of the 2013 conference on Computer supported cooperative work CSCW '13, ACM Press, 1169. http://doi.org/10.1145/2441776.2441908","paperID":"None"},{"content":"D. McCallig. 2014. Facebook after death: an evolving policy in a social network. International Journal of Law and Information Technology 22, 2: 107--140. http://doi.org/10.1093/ijlit/eat012","paperID":"None"},{"content":"Stephan Micklitz, Martin Ortlieb, and Jessica Staddon. 2013. \"I hereby leave my email to...\": Data Usage Control and the Digital Estate. 2013 IEEE Security and Privacy Workshops, IEEE, 42--44. http://doi.org/10.1109/SPW.2013.28","paperID":"None"},{"content":"Wendy Moncur and David Kirk. 2014. An emergent framework for digital memorials. Proceedings of the 2014 conference on Designing interactive systems DIS '14, ACM Press, 965--974. http://doi.org/10.1145/2598510.2598516","paperID":"None"},{"content":"Joji Mori, Martin Gibbs, Michael Arnold, Bjorn Nansen, and Tamara Kohn. 2012. Design considerations for after death. Proceedings of the 24th Australian Computer-Human Interaction Conference on - OzCHI '12, ACM Press, 395--404. http://doi.org/10.1145/2414536.2414599","paperID":"None"},{"content":"William Odom, Richard Banks, David Kirk, Richard Harper, Siân Lindley, and Abigail Sellen. 2012. Technology heirlooms? Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, ACM Press, 337. http://doi.org/10.1145/2207676.2207723","paperID":"None"},{"content":"William Odom, Richard Harper, Abigail Sellen, David Kirk, and Richard Banks. 2010. Passing on & putting to rest. Proceedings of the 28th international conference on Human factors in computing systems CHI '10: 1831. http://doi.org/10.1145/1753326.1753601","paperID":"None"},{"content":"William Odom. 2015. Understanding Long-Term Interactions with a Slow Technology. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 575--584. http://doi.org/10.1145/2702123.2702221","paperID":"None"},{"content":"Raquel O Prates, Mary Beth Rosson, and Clarisse S De Souza. 2015. Human-Computer Interaction -- INTERACT 2015. Springer International Publishing, Cham. http://doi.org/10.1007/978--3319--22701--6","paperID":"None"},{"content":"Anita Marie Tsaasan, Nafiri Kusumakaulika, and Jed R Brubaker. 2015. Design Considerations and Implications in Post-Mortem Data Management. iConference 2015 Proceedings.","paperID":"None"},{"content":"M. Zhang, C. Jennett, M. Malheiros, and M. A. Sasse. 2012. Data after death: User requirements and design challenges for SNSs and email providers. CHI 2012 Workshop Memento Mori: Technology Design for the End of Life.","paperID":"None"},{"content":"IfIDie. Retrieved from http://ifidie.net/","paperID":"None"},{"content":"Perpetu. Retrieved from https://perpetu.co/","paperID":"None"},{"content":"Archive of Our Own. Retrieved from http://archiveofourown.org/","paperID":"None"}],"abstract":"Post-mortem profiles on social network sites serve as both an archive of the deceased person's life and a gathering place for friends and loved ones. Many existing systems utilize inheritance as a model for post-mortem data management. However, the social and networked nature of personal data on social media, as well as the memorializing practices in which friends engage, indicate that other approaches are necessary. In this paper, we articulate the design choices made throughout the development of Legacy Contact, a post-mortem data management solution designed and deployed at Facebook. Building on the duties and responsibilities identified by Brubaker et al., we describe how Legacy Contact was designed to honor last requests, provide information surrounding death, preserve the memory of the deceased, and facilitate memorializing practices. We provide details around the design of the Legacy Contact selection process, the functionality provided to legacy contacts after accounts have been memorialized, and changes made to post-mortem profiles.","citation":[],"title":"Legacy Contact: Designing and Implementing Post-mortem Stewardship at Facebook","filename":"CHI16/p2908","authors":["Jed R. Brubaker","Vanessa Callison-Burch"],"conference":"CHI '16"}