{"paperId":2858333,"citation":[],"abstract":"Many existing studies of social media focus on only one platform, but the reality of users' lived experiences is that most users incorporate multiple platforms into their communication practices in order to access the people and networks they desire to influence. In order to better understand how people make sharing decisions across multiple sites, we asked our participants (N=29) to categorize all modes of communication they used, with the goal of surfacing their mental models about managing sharing across platforms. Our interview data suggest that people simultaneously consider \"audience\" and \"content\" when sharing and these needs sometimes compete with one another; that they have the strong desire to both maintain boundaries between platforms as well as allowing content and audience to permeate across these boundaries; and that they strive to stabilize their own communication ecosystem yet need to respond to changes necessitated by the emergence of new tools, practices, and contacts. We unpack the implications of these tensions and suggest future design possibilities.","reference":[{"content":"Mark Ackerman. 2000. The intellectual challenge of CSCW: The gap between requirements and technical feasibility. Journal of Human-Computer Interaction. 15, 179--203.","paperID":"None"},{"content":"Tawfig Ammari, Priya Kumar, Cliff Lampe, and Sarita Schoenebeck. 2015. Managing children's online identities: How parents decide what to disclose about their children online. In Proceedings of CHI'15. 18951904.","paperID":"None"},{"content":"Leslie Baxter. 1990. Dialectical contradictions in relationship development. Journal of Social and Personal Relationships. 7, 69--88.","paperID":"None"},{"content":"Joseph Bayer, Nicole B. Ellison, Sarita Schoenebeck, and Emily Falk. (in press). Sharing the small moments: Ephemeral social interaction on Snapchat. To appear in Information, Communication & Society.","paperID":"None"},{"content":"Nancy K Baym, Andrew Ledbetter, and Andrew Ledbetter. 2009. Tunes that bind? Predicting friendship strength in a music-based social network. Information, Communication and Society, 12, 408--427.","paperID":"None"},{"content":"Michael Bernstein, Eytan Bakshy, Moira Burke, and Brian Karrer. 2013. Quantifying the invisible audience in social networks. In Proceedings of CHI'13, 21--30.","paperID":"None"},{"content":"Joanna Brenner and Aaron Smith. 2013. 72% of Online Adults are Social Networking Site Users, Pew Research Center's Internet & American Life Project, Washington, DC.","paperID":"None"},{"content":"Moira Burke, Cameron Marlow, and Thomas Lento. 2009. Feed me: Motivating newcomer contribution in social network sites. In Proceedings of CHI'09. 945954.","paperID":"None"},{"content":"Moira Burke and Robert Kraut. 2014. Growing closer on Facebook?: Changes in tie strength through social network site use. In Proceedings of CHI'14, 4187--4196.","paperID":"None"},{"content":"Maeve Duggan, Nicole B. Ellison, Cliff Lampe, Amanda Lenhart and Mary Madden. 2015. Social media update 2014, Pew Research Center, Washington, DC.","paperID":"None"},{"content":"Marta Cecchinato, Anna Cox, and Jon Bird. 2015. Working 9-5? Professional differences in email and boundary management practices. In Proceedings of the ACM Conference on Human Factors in Computering Systems (CHI'15). 3989--3998.","paperID":"None"},{"content":"Maeve Duggan and Aaron Smith. 2014. Social Media Update 2013, Pew Research Center, Washington DC.","paperID":"None"},{"content":"Nicole B. Ellison and danah boyd. 2013. Sociality through Social Network Sites. In Dutton, W. H. (Ed.), The Oxford Handbook of Internet Studies. Oxford: Oxford University Press, 151--172.","paperID":"None"},{"content":"Nicole Ellison, Rebecca Heino, and Jennifer Gibbs. 2006. Managing impressions online: Self-presentation processes in the online dating environment. Journal of Computer-Mediated Communication. 11, 415--441.","paperID":"None"},{"content":"Nicole B. Ellison, Charles Steinfield and Cliff Lampe. 2011. Connection strategies: Social capital implications of Facebook-enabled communication practices. New Media & Society. 1461444810385389.","paperID":"None"},{"content":"Nicole B. Ellison and Jessica Vitak. 2015. Social Network Site Affordances and their Relationship to Social Capital Processes. In Sundar, S. (Ed.) The Handbook of the Psychology of Communication Technology. Hoboken, NJ: Wiley-Blackwell, 205--227.","paperID":"None"},{"content":"Shelly D Farnham and Elizabeth F Churchill. 2011. Faceted identity, faceted lives?: Social and technical issues with being yourself online. In Proceedings of CSCW'11. 359--368.","paperID":"None"},{"content":"Rowanne Fleck, Anna Cox, and Rosalyn Robison. 2015. Balancing boundaries: Using multiple devices to manage work-life balance. In Proceedings of ACM Conference on Human Factors in Computing Systems (CHI'15). 3985--3988.","paperID":"None"},{"content":"Andrea Forte and Cliff Lampe. 2013. Defining, understanding, and supporting open collaboration: Lessons from the literature. American Behavioral Scientist. 257, 535--547.","paperID":"None"},{"content":"Andrea Forte, Michael Dickard, Rachel Magee, and Denise E Agosto. 2014. What do teens ask their online social networks' Social search practices among high school students. In Proceedings of CSCW'14. 28--37.","paperID":"None"},{"content":"Jennifer Gibbs. 2009. Dialectics in a global software team: Negotiating tensions across time, space, and culture. Human Relations, 62, 905--935.","paperID":"None"},{"content":"Eric Gilbert, Karrie Karahalios and Christian Sandvig. 2008. The Network in the Garden: An Empirical Analysis of Social Media in Rural Life. in Conference on Human Factors in Computing Systems (CHI), (Florence, Italy, ACM Press, 1603--1612.","paperID":"None"},{"content":"Erving Goffman. 1959. The presentation of self in everyday life. Anchor: NY, 1959.","paperID":"None"},{"content":"Steve Harrison, and Paul Dourish. 1996. Re-place-ing space: The roles of place and space in collaborative systems. In Proceedings of CSCW'96, 67--76.","paperID":"None"},{"content":"Eszter Hargittai. 2007. Whose space? Differences among users and non-users of social network sites Journal of Computer-Mediated Communication, 13, 276--297.","paperID":"None"},{"content":"Caroline Haythornthwaite. 2005. Social networks and Internet connectivity effects. Information, Communication & Society 8, 2, 125--147.","paperID":"None"},{"content":"Bernie Hogan. 2010. The presentation of self in the age of social media: Distinguishing performances and exhibitions online. Bulletin of Science, Technology & Society 30, 6, 377--386.","paperID":"None"},{"content":"Youyang Hou, and Cliff Lampe. 2015. Social media effectiveness for public engagement: Examples of small nonprofits. In Proceedings of CHI'15, 31073116.","paperID":"None"},{"content":"Lee Humphreys. 2012. Connecting, coordinating, cataloguing: Communicative practices on mobile social networks. Journal of Broadcasting & Electronic Media, 56, 494--510.","paperID":"None"},{"content":"Adam N. Joinson. 2008. Looking at, looking up or keeping up with people?: motives and use of facebook. in Conference on Human Factors in Computing Systems (CHI), (Florence, Italy, ACM Press, 10271036.","paperID":"None"},{"content":"Shamanth Kumar, Reza Zafarani, and Huan Liu. Understanding user migration patterns in social media. 2011. Association for the Advancement of Artificial Intelligence. 1204--1209.","paperID":"None"},{"content":"Siân Lindley, Catherine C Marshall, Richard Banks, Abigail Sellen, and Tim Regan. 2013. Rethinking the Web as a personal archive. In Proceedings of WWW'13. 749--759.","paperID":"None"},{"content":"Eden Litt. 2012. Knock, knock. Who's there? The imagined audience. Journal of Broadcasting and Electronic Media. 56, 330--345.","paperID":"None"},{"content":"Alice E. Marwick and d. boyd. 2010. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1, 114--133.","paperID":"None"},{"content":"Caitlin McLaughlin and Jessica Vitak. 2012. Norm evolution and violation on Facebook. New Media & Society 14, 2, 299--315.","paperID":"None"},{"content":"Sherif, Muzafer. 1936. The Psychology of Social Norms. NY: Harper & Brothers.","paperID":"None"},{"content":"Zizi Papacharissi and Andrew Mendelson. 2010. Toward a new (er) sociability: uses, gratifications and social capital on Facebook. in Papathanassopoulos, S. ed. Media Perspectives for the 21st Century, Routledge, 212.","paperID":"None"},{"content":"Tracii Ryan and Sophia Xenos. 2011. Who uses Facebook? An investigation into the relationship between the Big Five, shyness, narcissism, loneliness, and Facebook usage. Computers in Human Behavior, 27 (5). 1658--1664.","paperID":"None"},{"content":"Corina Sas and Steve Whittaker. 2013. Design for forgetting?: Disposing of digital possessions after a breakup. In Proceedings of CHI'13. 1823--1832.","paperID":"None"},{"content":"Michael Shott. 1996. An exegesis of the curation concept. Journal of Anthropological Research. 52, 259--280.","paperID":"None"},{"content":"Aaron Smith. 2015. U.S. Smartphone use in 2015. Pew Research Center, Washington DC.","paperID":"None"},{"content":"Andrew D. Smock, Nicole B. Ellison, Cliff Lampe, and Donghee Yvette Wohn. 2011. Facebook as a toolkit: A uses and gratification approach to unbundling feature use. Computers in Human Behavior 27, 6, 2322--2329.","paperID":"None"},{"content":"Fred Stutzman and Woodrow Hartzog. 2012. Boundary regulation in social media. In Proceedings of CSCW'12. 769--778.","paperID":"None"},{"content":"Yang Wang, Pedro Giovanni Leon, Gregory Norcie, Alessandro Acquisti, and Lorrie Faith Cranor. 2011. \" I regretted the minute I pressed share \": A Qualitative study of regrets on Facebook. In Proceedings of SOUPS'11. Article 10.","paperID":"None"},{"content":"Yiran Wang, Melissa Niiya, Gloria Mark, Stephanie Reich, and Mark Warschauer. 2015. Coming of age (digitally): An ecological view of social media use among college students. In Proceedings of CSCW'15. 571--582.","paperID":"None"},{"content":"Alcides Velasquez, Rick Wash, Cliff Lampe, and Tor Bjornrud. 2014. Latent users in an online usergenerated content community. In Proceeding of CSCW. 23, 21--50.","paperID":"None"},{"content":"Rebecca D. Watkins, Abigail Sellen, and Siân E. Lindley. 2015. Digital collections and digital collecting practices. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, 3423--3432.","paperID":"None"},{"content":"Rowan Wilken. 2015. Mobile media and ecologies of location. Communication Research and Practice, 1, 4257.","paperID":"None"},{"content":"Asimina Vasalou, Adam N Joinson and Delphine Courvoisier. 2010. Cultural differences, experience with social networks and the nature of \"true commitment\" in Facebook. International Journal of Human-Computer Studies, 68 (10). 719--728.","paperID":"None"},{"content":"Jessica Vitak and Jinyoung Kim. 2014. You can't block people offline: examining how facebook's affordances shape the disclosure process. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW'14), 461--474.","paperID":"None"},{"content":"Richard Wike. 2014. Emerging Nations Embrace Internet, Mobile Technology, Pew Research Center, Washington, DC.","paperID":"None"},{"content":"Xu Bin, Pamara Chang, Christopher Welker, Natalya Bazarova, Dan Cosley. (in press). Automatic archiving versus default deletion: What Snapchat tells us about ephemerality in design. To appear in Proceedings of CSCW'16.","paperID":"None"},{"content":"Hui Zhang, Munmun De Choudhury, Jonathan Grudin. 2014. Creepy but inevitable? The evolution of social networking. In Proceeding of CSCW'14. 368--378.","paperID":"None"},{"content":"Xuan Zhao and Siân Lindley. 2014. Curation through use?: Understanding the personal value of social media. In Proceedings of CHI'14. 2431--2440.","paperID":"None"},{"content":"Xuan Zhao, Niloufar Salehi, Sasha Naranjit, Sara Alwaalan, Stephen Voida, and Dan Cosley. 2013. The many faces of Facebook?: Experiencing social media as performance, exhibition, and personal archive. In Proceedings of CHI'13. 1--10.","paperID":"None"}],"title":"The Social Media Ecology: User Perceptions, Strategies and Challenges","filename":"CHI16/p89","authors":["Xuan Zhao","Cliff Lampe","Nicole B. Ellison"],"conference":"CHI '16"}