{"paperId":2858190,"citation":[],"reference":[{"content":"L. Gregory Appelbaum, Matthew S. Cain, Elise F. Darling, Stephen R. Mitroff. 2013. Action video game playing is associated with improved visual sensitivity, but not alterations in visual sensory memory. Atten Percept Psychophys 75, 6: 11611167. http://dx.doi.org/10.3758/s13414-013-0472","paperID":"None"},{"content":"Walter R. Boot, Daniel P. Blakely, Daniel J. Simons. 2011. Do action video games improve perception and cognition? Frontiers in Psychology. http://dx.doi.org/10.3389/fpsyg.2011.00226","paperID":"None"},{"content":"Walter R. Boot, Arthur F. Kramer, Daniel J. Simons, Monica Fabiani, Gabriele Gratton. 2008. The effects of video game playing on attention, memory, and executive control. Acta Psychologica 129: 387--398. http://dx.doi.org/10.1016/j.actpsy.2008.09.005","paperID":"None"},{"content":"William Boyce, Torbjorn Torsheim, Candace Currie, Alessio Zambon. 2006. The Family Affluence Scale as a measure of national wealth: Validation of an adolescent self-report measure. Social Indicators Research 78: 473--487. http://dx.doi.org/10.1007/s11205-005-1607-6","paperID":"None"},{"content":"Neil Burgess, Eleanor A. Maguire, John O'Keefe. 2002. The human hippocampus and spatial and episodic memory. Neuron 35: 625--641. http://dx.doi.org/10.1016/S0896-6273(02)00830-9","paperID":"None"},{"content":"Matthew S. Cain, William Prinzmetal, Arthur P. Shimamura, Ayelet N. Landau. (2014). Improved control of exogenous attention in action video game players. Frontiers in Psychology. http://dx.doi.org/10.3389/fpsyg.2014.00069","paperID":"None"},{"content":"Ben Casselman. 2015. Resistance is futile: eSports is massive ... and growing. Retrieved September 23, 2015 from http://espn.go.com/espn/story/_/id/13059210/esports-massive-industry-growing","paperID":"None"},{"content":"Alan D. Castel, Jay Pratt, Emily Drummond. 2005. The effects of action video game experience on the time course of inhibition of return and the efficiency of visual search. Acta Psychologica 199: 217--230. http://dx.doi.org/10.1016/j.actpsy.2005.02.004","paperID":"None"},{"content":"William G. Chase, Herbert A. Simon. 1973. Perception in chess. Cognitive Psychology 4: 5581. http://dx.doi.org/10.1016/00100285(73)90004--2","paperID":"None"},{"content":"Kait Clark, Mathias S. Fleck, Stephen R. Mitroff. 2011. Enhanced change detection performance reveals improved strategy use in avid action video game players. Acta Psychologica 136: 67--72. http://dx.doi.org/10.1016/j.actpsy.2010.10.003","paperID":"None"},{"content":"Lorenza S. Colzato, Wery P. M. van den Wildenberg, Sharon Zmigrod, Bernhard Hommel. 2013. Action video gaming and cognitive control: Playing first person shooter games is associated with improvement in working memory but not action inhibition. Psychological Research 77: 234239. http://dx.doi.org/10.1007/s00426-012-0415-2","paperID":"None"},{"content":"Andrew R. A. Conway, Michael J. Kane, Michael F. Bunting, D. Zach Hambrick, Oliver Wilhelm, Randall W. Engle. 2005. Working memory span tasks: A methodological review and user's guide. Psychonomic Bulletin & Review 12, 5: 769--786. http://dx.doi.org/10.3758/BF03196772","paperID":"None"},{"content":"Sarah E. Donohue, Marty G. Woldorff, Stephen R. Mitroff. 2010. Video game players show more precise multisensory temporal processing abilities. Attention, Perception, & Psychophysics 72, 4: 1120--1129. http://dx.doi.org/10.3758/APP.72.4.1120","paperID":"None"},{"content":"Douglas Gentile. 2009. Pathological video-game use among youth ages 8 to 18: A national study. Psychological Science 20, 5: 594--602. http://dx.doi.org/10.1111/j.14679280.2009.02340.x","paperID":"None"},{"content":"Douglas A. Gentile, Hyekyung Choo, Albert Liau, Timothy Sim, Dongdong Li, Daniel Fung, Angeline Khoo. 2011. Pathological video game use among youths: A two-year longitudinal study. Pediatrics 127, 2: E319-e329. http://dx.doi.org/10.1542/peds.2010-1353","paperID":"None"},{"content":"Fernand Gobet, Herbert A. Simon. 1996. Expert Chess memory: Revisiting the chunking hypothesis. Memory 6: 225--255. http://dx.doi.org/10.1080/741942359","paperID":"None"},{"content":"GosuGamers. 2015. eSports Gaming Events. Retrieved December 17, 2015 from http://www.gosugamers.net/events","paperID":"None"},{"content":"C. Shawn Green, Daphne Bavelier. 2003. Action video game modifies visual selective attention. Nature 423, 29: 534--537.","paperID":"None"},{"content":"C.S. Green and D. Bavelier. 2007. Action-videogame experience alters the spatial resolution of vision. Psychol Sci 18, 1: 88--94. http://dx.doi.org/10.1111/j.14679280.2007.01853.x","paperID":"None"},{"content":"Leah Jackson. 2013. The rise of esports in America. Retrieved September 23, 2015 from http://www.ign.com/articles/2013/07/25/the-riseof-esports-in-america","paperID":"None"},{"content":"Thomas W. James, Doreen Kimura. 1997. Sex differences in remembering the locations of objects in an array: Location-shifts versus location-exchanges. Evolution and Human Behavior 18, 3: 155--163. http://dx.doi.org/10.1016/S1090-5138(97)00004-4","paperID":"None"},{"content":"Michael J. Kane, David Z. Hambrick, Stephen W. Tuholski, Oliver Wilhelm, Tabitha W. Payne, Randall W. Engle. 2004. The Generality of working memory capacity: A latent-variable approach to verbal and visuospatial memory span and reasoning. J Exp Psychol Gen 133, 2: 189217. http://dx.doi.org/10.1037/00963445.133.2.189","paperID":"None"},{"content":"Petri Lankoski, Staffan Björk. 2015. Game Research Methods. ETC Press.","paperID":"None"},{"content":"Andrew J. Latham, Lucy L. M. Patston, Lynette J. Tippett. 2013. Just how expert are \"expert\" videogame players? Assessing the experience and expertise of video-game players across \"action\" video-game genres. Frontiers in Psychology. http://dx.doi.org/10.3389/fpsyg.2013.00941","paperID":"None"},{"content":"Amanda Lenhart, Sydney Jones, Alexandra Macgill. 2008. Adults and video games. Pew Internet & American Life Project. Retrieved September 23, 2015 from http://www.pewinternet.org/2008/12/07/adultsand-video-games/","paperID":"None"},{"content":"Lauren J. Levy, Robert S. Astur, Karyn M. Frick. 2005. Men and women differ in object memory but not performance of a virtual radial maze. Behavioral Neuroscience 119, 4: 853--862. http://dx.doi.org/10.1037/0735-7044.119.4.853","paperID":"None"},{"content":"Ian M. Lyons, Sian L. Beilock. 2009. Beyond quantity: Individual differences in working memory and the ordinal understanding of numerical symbols. Cognition 113, 2: 189--204. http://dx.doi.org/10.1016/j.cognition.2009.08.003","paperID":"None"},{"content":"Ian M. Lyons, Sian L. Beilock. 2011. Numerical ordering ability mediates the relation between number-sense and arithmetic competence. Cognition 121, 2: 256--261. http://dx.doi.org/10.1016/j.cognition.2011.07.009","paperID":"None"},{"content":"Patrick Mackey. 2013. The summoner's guidebook: How to be the best at league of legends. Retrieved September 23, 2015 from http://www.engadget.com/2013/08/15/thesummoners-guidebook-how-to-be-the-best-atleague-of-legend/","paperID":"None"},{"content":"Neil A. Macmillan, C. Douglas Creelman. 2004. Detection theory: A user's guide. Psychology Press.","paperID":"None"},{"content":"Sebastiaan Mathôt, Daniel Schreij, Jan Theeuwes. 2012. OpenSesame: An open-source, graphical experiment builder for the social sciences. Behavior Research Methods 44, 2: 314--324. http://dx.doi.org/10.3758/s13428-011-0168-7","paperID":"None"},{"content":"Ashley F. McDermott, Daphne Bavelier, C. Shawn Green. 2014. Memory abilities in action video game players. Computers in Human Behavior 34: 69--78. http://dx.doi.org/10.1016/j.chb.2014.01.018","paperID":"None"},{"content":"Frederick L. Oswald, Samuel T. McAbee, Thomas S. Redick, David Z. Hambrick. 2014. The development of a short domain-general measure of working memory capacity. Behav Res. http://dx.doi.org/10.3758/s13428-014-0543-2","paperID":"None"},{"content":"Kasey L. Powers, Patricia J. Brooks, Naomi J. Aldrich, Melissa A. Palladino, Louis Alfieri. 2013. Effects of video-game play on information processing: A meta-analytic investigation. Psychonomic Bulletin & Review 20: 1055--1079. http://dx.doi.org/10.3758/s13423-013-0418-z","paperID":"None"},{"content":"Kristopher J. Preacher, Derek D. Rucker, Robert C. MacCallum, W. Alan Nicewander. 2005. Use of the extreme groups approach: A critical reexamination and new recommendations. Psychological Methods 10, 2: 178--192. http://dx.doi.org/10.1037/1082-989X.10.2.178","paperID":"None"},{"content":"Thomas S. Redick, James M. Broadway, Matt E. Meier, Princy S. Kuriakose, Nash Unsworth, Michael J. Kane, and Randall W. Engle. Measuring working memory capacity with automated complex span tasks. European Journal of Psychological Assessment 28, 3: 164--171. http://dx.doi.org/10.1027/1015--5759/a000123","paperID":"None"},{"content":"Delphine Sasanguie, Silke M. Göbel, Kristina Moll, Karolien Smets, Bert Reynvoet. Approximate number sense, symbolic number processing, or number-space mappings: What underlies mathematics achievement? Journal of Experimental Child Psychology 114, 3: 418--431. http://dx.doi.org/10.1016/j.jecp.2012.10.012","paperID":"None"},{"content":"Nash Unsworth, Randall W. Engle. 2005. Working memory capacity and fluid abilities: Examining the correlation between Operation Span and Raven. Intelligence 33: 67--81. http://dx.doi.org/10.1016/j.intell.2004.08.003","paperID":"None"},{"content":"Nash Unsworth, Thomas S. Redick, Brittany D. McMillan, David Z. Hambrick, Michael J. Kane, Randall W. Engle. 2015. Is playing video games related to cognitive abilities? Psychological Science 26, 6: 759--774. http://dx.doi.org/10.1177/0956797615570367","paperID":"None"},{"content":"Alex Wilhelm. 2012. MLG's eSports events now attract more young male viewers than the Rose Bowl. Retrieved September 23, 2015 from http://thenextweb.com/media/2012/07/18/mlgsesports-events-now-attract-more-young-maleviewers-than-the-rose-bowl/","paperID":"None"},{"content":"Nick Wingfield. 2014. In e-Sports, video gamers draw real crowds and big money. Retrieved September 23, 2015 from http://www.nytimes.com/2014/08/31/technology/e sports-explosion-brings-opportunity-riches-forvideo-gamers.html?_r=0","paperID":"None"},{"content":"Nick Yee. 2006. Motivations for play in online games. CyberPsychology & Behavior 9, 6: 772775. http://dx.doi.org/10.1089/cpb.2006.9.772","paperID":"None"}],"abstract":"In this study we evaluated a novel approach for examining the link between gaming expertise and cognitive skills, and the value of recruiting and running participants at a MOBA gaming tournament. Participants completed a set of cognitive tasks that measured spatial working and long term (location) memory, basic cognitive processing, and gaming experience. Comparable reliability on the working memory task and results in line with previous research on the location memory task indicated the data collected was valid and reliable. We observed a significant relation between gaming experience and response time on the location memory task. We discuss that conducting gaming research at a tournament is a valid way of collecting data for a gaming expertise study while providing a range of gaming expertise that may not be available when recruiting at college campuses. Furthermore, our results extend previous gaming research that suggests that individual differences in gaming experience are correlated with the speed of recalling spatial information from long term memory.","title":"Using an International Gaming Tournament to Study Individual Differences in MOBA Expertise and Cognitive Skills","filename":"CHI16/p3473","authors":["Justin W. Bonny","Lisa M. Castaneda","Tom Swanson"],"conference":"CHI '16"}