{"paperId":2858403,"citation":[],"reference":[{"content":"Morgan G. Ames. 2013. Managing mobile multitasking: the culture of iPhones on stanford campus. CHI '13, 1487-1498.","paperID":"None"},{"content":"Jared S. Bauer, Sunny Consolvo, Benjamin Greenstein, et al. 2012. ShutEye: Encouraging awareness of healthy sleep recommendations with a mobile, peripheral display. CHI '12, 1401-1410.","paperID":"None"},{"content":"Eric P.S. Baumer, Phil Adams, Vera D. Khovanskaya, et al. 2013. Limiting, leaving, and (re)lapsing. CHI '13, ACM Press, 3257. http://doi.org/10.1145/2470654.2466446","paperID":"None"},{"content":"Joseph B. Bayer and Scott W. Campbell. 2012. Texting while driving on automatic: Considering the frequencyindependent side of habit. Computers in Human Behavior 28, 6, 2083-2090.","paperID":"None"},{"content":"Kirk Warren Brown and Richard M. Ryan. 2003. The benefits of being present: Mindfulness and its role in psychological well-being. Journal of personality and social psychology 84, 4, 822--848.","paperID":"None"},{"content":"Jed R. Brubaker, Gillian R. Hayes, and Paul Dourish. 2013. Beyond the Grave: Facebook as a Site for the Expansion of Death and Mourning. The Information Society 29, 3, 152-163. http://doi.org/10.1080/01972243.2013.777300","paperID":"None"},{"content":"Luca Chittaro and Andrea Vianello. 2014. Computersupported mindfulness: Evaluation of a mobile thought distancing application on naive meditators. International Journal of Human-Computer Studies 72, 3, 337-348. http://doi.org/10.1016/j.ijhcs.2013.11.001","paperID":"None"},{"content":"E.K. Choe, B. Lee, M. Kay, W. Pratt, and J.A Kientz. 2015. SleepTight: Low-burden, Self-monitoring Technology for Capturing and Reflecting on Sleep Behaviors. UbiComp '15, 121--132.","paperID":"None"},{"content":"Emily I. M. Collins, Anna L. Cox, Jon Bird, and Cassie Cornish-Tresstail. 2014. Barriers to engagement with a personal informatics productivity tool. Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures the Future of Design - OzCHI '14, ACM Press, 370-379. http://doi.org/10.1145/2686612.2686668","paperID":"None"},{"content":"Sunny Consolvo, Predrag Klasnja, David W. McDonald, and James A. Landay. 2009. Goal-setting considerations for persuasive technologies that encourage physical activity. Persuasive '09. http://doi.org/10.1145/1541948.1541960","paperID":"None"},{"content":"Sunny Consolvo, Ryan Libby, Ian Smith, et al. 2008. Activity sensing in the wild. CHI '08, 1797. http://doi.org/10.1145/1357054.1357335","paperID":"None"},{"content":"Felicia Cordeiro, Daniel A. Epstein, Edison Thomaz, et al. 2015. Barriers and Negative Nudges: Exploring Challenges in Food Journaling. CHI '15, 1159-1162. http://doi.org/10.1145/2702123.2702155","paperID":"None"},{"content":"Tamara Denning, Adrienne Andrew, Rohit Chaudhri, et al. 2009. BALANCE: Towards a Usable Pervasive Wellness Application with Accurate Activity Inference. IEEE Workshop on Mobile Computing Systems and Applications 2009, 5. http://doi.org/10.1145/1514411.1514416","paperID":"None"},{"content":"Kirsten A Foot. 2014. The Online Emergence of Pushback on Social Media in the USA: A Historical Discourse Analysis. International Journal of Communication 8, 30.","paperID":"None"},{"content":"Jon Froehlich, Tawanna Dillahunt, Predrag Klasnja, et al. 2009. UbiGreen. CHI '09, 1043. http://doi.org/10.1145/1518701.1518861","paperID":"None"},{"content":"Sophie Huey-Ming Guo, Her-Kun Chang, and Chun-Yi Lin. 2014. Impact of Mobile Diabetes Self-Care System on patients' knowledge, behavior and efficacy. Computers in Industry 69, 22-29. http://doi.org/10.1016/j.compind.2014.11.001","paperID":"None"},{"content":"Ellie Harmon and Melissa Mazmanian. 2013. Stories of the smartphone in everyday discourse: Conflict, tension & instability. CHI '13, 1051-1060.","paperID":"None"},{"content":"Alexis Hiniker, Kiley Sobel, Hyewon Suh, Yi-Chen Sung, Charlotte P. Lee, and Julie A. Kientz. 2015. Texting while Parenting: How Adults Use Mobile Phones while Caring for Children at the Playground. CHI '15, 727-736. http://doi.org/10.1145/2702123.2702199","paperID":"None"},{"content":"Hsiu-Fang Hsieh and Sarah E Shannon. 2005. Three approaches to qualitative content analysis. Qualitative health research 15, 9, 1277-88. http://doi.org/10.1177/1049732305276687","paperID":"None"},{"content":"Matthew Kay, Eun Kyoung Choe, Jesse Shepherd, et al. 2012. Lullaby: a capture & access system for understanding the sleep environment. UbiComp '12, 226-234.","paperID":"None"},{"content":"Predrag Klasnja, Sunny Consolvo, and Wanda Pratt. 2011. How to evaluate technologies for health behavior change in HCI research. CHI 2011, 3063. http://doi.org/10.1145/1978942.1979396","paperID":"None"},{"content":"Predrag Klasnja and Wanda Pratt. 2012. Healthcare in the pocket: mapping the space of mobile-phone health interventions. Journal of biomedical informatics 45, 1, 184-98. http://doi.org/10.1016/j.jbi.2011.08.017","paperID":"None"},{"content":"Minsam Ko, Kyong-Mee Chung, Subin Yang, et al. 2015. NUGU: A Group-based Intervention App for Improving Self-Regulation of Limiting Smartphone Use. CSCW '15, 1235-1245. http://doi.org/10.1145/2675133.2675244","paperID":"None"},{"content":"Ellen J Langer. 2014. Mindfulness. Da Capo Press.","paperID":"None"},{"content":"Uichin Lee, Subin Yang, Minsam Ko, and Joonwon Lee. 2014. Supporting Temporary Non-Use of Smartphones. CHI '14 Workshop: Refusing, Limitng, Departing: Why We Should Study Technology Non-Use Workshop.","paperID":"None"},{"content":"Markus Löchtefeld, Matthias Böhmer, and Lyubomir Ganev. 2013. AppDetox. MUM '13, 1-2. http://doi.org/10.1145/2541831.2541870","paperID":"None"},{"content":"Hong Lu, Denise Frauendorfer, Mashfiqui Rabbi, et al. 2012. StressSense. UbiComp '12, 351. http://doi.org/10.1145/2370216.2370270","paperID":"None"},{"content":"Julie Maitland and Matthew Chalmers. 2010. Selfmonitoring, self-awareness, and self-determination in cardiac rehabilitation. CHI '10, 1213. http://doi.org/10.1145/1753326.1753508","paperID":"None"},{"content":"M. Mazmanian. 2012. Avoiding the trap of constant connectivity: When congruent frames allow for heterogeneous practices. Academy of Management Journal. 56, 5, 1225--1250. http://doi.org/10.5465/amj.2010.0787","paperID":"None"},{"content":"Brandon T McDaniel and Sarah M Coyne. 2014. \"Technoference\": The Interference of Technology in Couple Relationships and Implications for Women's Personal and Relational Well-Being. Psychology of Popular Media Culture.","paperID":"None"},{"content":"Susan Michie, Michelle Richardson, Marie Johnston, et al. 2013. The behavior change technique taxonomy (v1) of 93 hierarchically clustered techniques: building an international consensus for the reporting of behavior change interventions. Annals of behavioral medicine : a publication of the Society of Behavioral Medicine 46, 1, 81-95. http://doi.org/10.1007/s12160-013--9486--6","paperID":"None"},{"content":"Sean A. Munson and Sunny Consolvo. 2012. Exploring goal-setting, rewards, self-monitoring, and sharing to motivate physical activity. Pervasive Health, 25-32.","paperID":"None"},{"content":"Lori Pbert. 2013. The handbook of health behavior change. Springer Publishing Company.","paperID":"None"},{"content":"L. Portwood-Stacer. 2013. Media refusal and conspicuous non-consumption: The performative and political dimensions of Facebook abstention. New Media & Society 15, 7, 1041-1057.","paperID":"None"},{"content":"Andrew K. Przybylski, Kou Murayama, Cody R. DeHaan, and Valerie Gladwell. 2013. Motivational, emotional, and behavioral correlates of fear of missing out. Computers in Human Behavior 29, 4, 1841-1848. http://doi.org/10.1016/j.chb.2013.02.014","paperID":"None"},{"content":"Lee Rainie, Aaron Smith, and Maeve Duggan. 2013. Coming and going on Facebook. Pew Research Center's Internet and American Life Project.","paperID":"None"},{"content":"Caroline R Richardson, Tiffany L Newton, Jobby J Abraham, Ananda Sen, Masahito Jimbo, and Ann M Swartz. 2008. A meta-analysis of pedometer-based walking interventions and weight loss. Annals of family medicine 6, 1, 69-77. http://doi.org/10.1370/afm.761","paperID":"None"},{"content":"Christine Satchell and Paul Dourish. 2009. Beyond the user: use and non-use in HCI. OzCHI 2009, 9-16.","paperID":"None"},{"content":"Sarita Yardi Schoenebeck. 2014. Giving up Twitter for Lent?: How and Why We Take Breaks from Social Media. CHI '14, 773-782.","paperID":"None"},{"content":"Choonsung Shin and Anind K. Dey. 2013. Automatically detecting problematic use of smartphones. UbiComp '13, 335. http://doi.org/10.1145/2493432.2493443","paperID":"None"},{"content":"Manya Sleeper, Alessandro Acquisti, Lorrie Faith Cranor, Patrick Gage Kelley, Sean A. Munson, and Norman Sadeh. 2015. I Would Like To..., I Shouldn't..., I Wish I... CSCW '15, 1058-1069. http://doi.org/10.1145/2675133.2675193","paperID":"None"},{"content":"Jay Vidyarthi, Bernhard E. Riecke, and Diane Gromala. 2012. Sonic Cradle. DIS '12, 408. http://doi.org/10.1145/2317956.2318017","paperID":"None"}],"abstract":"Though many people report an interest in self-limiting certain aspects of their phone use, challenges adhering to self-defined limits are common. We conducted a design exercise and online survey to map the design space of interventions for smartphone non-use and distilled these into a small taxonomy of intervention categories. Using these findings, we implemented \"MyTime,\" an intervention to support people in achieving goals related to smartphone non-use. We conducted a deployment study with 23 participants over two weeks and found that participants reduced their time with the apps they feel are a poor use of time by 21% while their use of the apps they feel are a good use of time remained unchanged. We found that a small taxonomy describes users' diverse set of desired behavior changes relating to smartphone non-use, and that these desired changes predict: 1) the hypothetical features they are interested in trying, 2) the extent to which they engage with these features in practice, and 3) their changes in behavior in response to the intervention. We link users' desired behaviors to the categories of our design taxonomy, providing a foundation for a theoretical model of designing for smartphone non-use.","title":"MyTime: Designing and Evaluating an Intervention for Smartphone Non-Use","filename":"CHI16/p4746","authors":["Alexis Hiniker","Sungsoo (Ray) Hong","Tadayoshi Kohno","Julie A. Kientz"],"conference":"CHI '16"}