{"paperId":2858214,"citation":[],"abstract":"A primary goal of research in usable security and privacy is to understand the differences and similarities between users. While past researchers have clustered users into different groups, past categories of users have proven to be poor predictors of end-user behaviors. In this paper, we perform an alternative clustering of users based on their behaviors. Through the analysis of data from surveys and interviews of participants, we identify five user clusters that emerge from end-user behaviors-Fundamentalists, Lazy Experts, Technicians, Amateurs and the Marginally Concerned. We examine the stability of our clusters through a survey-based study of an alternative sample, showing that clustering remains consistent. We conduct a small-scale design study to demonstrate the utility of our clusters in design. Finally, we argue that our clusters complement past work in understanding privacy choices, and that our categorization technique can aid in the design of new computer security technologies.","reference":[{"content":"Mark S. Ackerman, Lorrie Faith Cranor, and Joseph Reagle. 1999. Privacy in e-Commerce: Examining User Scenarios and Privacy Preferences. Proceedings of the 1st ACM Conference on Electronic Commerce, ACM, 1--8. http://doi.org/10.1145/336992.336995","paperID":"None"},{"content":"Alessandro Acquisti and Ralph Gross. 2006. Imagined Communities: Awareness, Information Sharing, and Privacy on the Facebook. In Privacy Enhancing Technologies, George Danezis and Philippe Golle (eds.). Springer Berlin Heidelberg, 36--58.","paperID":"None"},{"content":"Anne Adams and Martina Angela Sasse. 1999. Users Are Not the Enemy. Commun. ACM 42, 12: 40--46. http://doi.org/10.1145/322796.322806","paperID":"None"},{"content":"Julio Angulo, Erik Wästlund, and Johan Högberg. 2014. What Would It Take for You to Tell Your Secrets to a Cloud? In Secure IT Systems. Springer, 129--145.","paperID":"None"},{"content":"Bettina Berendt, Oliver Günther, and Sarah Spiekermann. 2005. Privacy in e-Commerce: Stated Preferences vs. Actual Behavior. Commun. ACM 48, 4: 101--106. http://doi.org/10.1145/1053291.1053295","paperID":"None"},{"content":"Hugh Beyer and Karen Holtzblatt. 1997. Contextual design: defining customer-centered systems. Elsevier.","paperID":"None"},{"content":"Glenn A. Bowen. 2008. Naturalistic inquiry and the saturation concept: a research note. Qualitative Research 8, 1: 137--152. http://doi.org/10.1177/1468794107085301","paperID":"None"},{"content":"Laura Brandimarte, Alessandro Acquisti, and George Loewenstein. 2013. Misplaced Confidences Privacy and the Control Paradox. Social Psychological and Personality Science 4, 3: 340--347. http://doi.org/10.1177/1948550612455931","paperID":"None"},{"content":"Farah Chanchary and Sonia Chiasson. 2015. User Perceptions of Sharing, Advertising, and Tracking. Eleventh Symposium On Usable Privacy and Security (SOUPS 2015), 53--67.","paperID":"None"},{"content":"Sunny Consolvo, Ian E. Smith, Tara Matthews, Anthony LaMarca, Jason Tabert, and Pauline Powledge. 2005. Location Disclosure to Social Relations: Why, when, & What People Want to Share. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 81--90. http://doi.org/10.1145/1054972.1054985","paperID":"None"},{"content":"Gregory Conti and Edward Sobiesk. 2007. An Honest Man Has Nothing to Fear: User Perceptions on Webbased Information Disclosure. Proceedings of the 3rd Symposium on Usable Privacy and Security, ACM, 112--121. http://doi.org/10.1145/1280680.1280695","paperID":"None"},{"content":"Alan Cooper. 1999. The Inmates are Running the Asylum. Macmillan.","paperID":"None"},{"content":"Kovila Coopamootoo and Thomas Gross. 2014. Mental Models: An Approach to Model Privacy Concern and Behavior. Workshop on Privacy Personas and Segmentation, PPS 2014, held with SOUPS 2014. See: http://cups.cs.cmu.edu/soups/2014/workshops/privacy/ s2p2.pdf","paperID":"None"},{"content":"Lynne Coventry, Debora Jeske and Pam Briggs. 2014. Combining privacy and risk perceptions to better understand user behavior. Workshop on Privacy Personas and Segmentation, PPS 2014, held with SOUPS 2014. See: http://cups.cs.cmu.edu/soups/2014/workshops/privacy/ s2p3.pdf","paperID":"None"},{"content":"John W. Creswell. 2013. Research Design: Qualitative, Quantitative, and Mixed Methods Approaches, 2nd Edition, Sage.","paperID":"None"},{"content":"Paul Dourish and Ken Anderson. 2006. Collective Information Practice: Emploring Privacy and Security As Social and Cultural Phenomena. Hum.-Comput. Interact. 21, 3: 319--342. http://doi.org/10.1207/s15327051hci2103_2","paperID":"None"},{"content":"Dinei Florencio and Cormac Herley. 2007. A Largescale Study of Web Password Habits. Proceedings of the 16th International Conference on World Wide Web, ACM, 657--666. http://doi.org/10.1145/1242572.1242661","paperID":"None"},{"content":"Batya Friedman, David Hurley, Daniel C. Howe, Edward Felten, and Helen Nissenbaum. 2002. Users' Conceptions of Web Security: A Comparative Study. CHI '02 Extended Abstracts on Human Factors in Computing Systems, ACM, 746--747. http://doi.org/10.1145/506443.506577","paperID":"None"},{"content":"Adam N. Joinson, Ulf-Dietrich Reips, Tom Buchanan, and Carina B. Paine Schofield. 2010. Privacy, Trust, and Self-Disclosure Online. Human-Computer Interaction 25, 1: 1--24. http://doi.org/10.1080/07370020903586662","paperID":"None"},{"content":"Ruogu Kang, Laura Dabbish, Nathaniel Fruchter, and Sara Kiesler. 2015. \"My Data Just Goes Everywhere:\" User Mental Models of the Internet and Implications for Privacy and Security. In Eleventh Symposium On Usable Privacy and Security (SOUPS 2015) (pp. 3952).","paperID":"None"},{"content":"Jennifer King. 2014. Taken Out of Context: An Empirical Analysis of Westin's Privacy Scale. Workshop on Privacy Personas and Segmentation, PPS 2014, held with SOUPS 2014. See: http://cups.cs.cmu.edu/soups/2014/workshops/privacy/ s1p1.pdf.","paperID":"None"},{"content":"Predrag Klasnja, Sunny Consolvo, Jaeyeon Jung, et al. 2009. \"When I Am on Wi-Fi, I Am Fearless\": Privacy Concerns & Practices in Eeryday Wi-Fi Use. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1993--2002. http://doi.org/10.1145/1518701.1519004","paperID":"None"},{"content":"Bart P. Knijnenburg, Alfred Kobsa, and Hongxia Jin. 2013. Preference-based Location Sharing: Are More Privacy Options Really Better? Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2667--2676. http://doi.org/10.1145/2470654.2481369","paperID":"None"},{"content":"Bart P. Knijnenburg, Alfred Kobsa, and Hongxia Jin. 2013. Dimensionality of information disclosure behavior. International Journal of Human-Computer Studies 71, 12: 1144--1162. http://doi.org/10.1016/j.ijhcs.2013.06.003","paperID":"None"},{"content":"Lydia Kraus, Ina Wechsung and Sebastian Möller. 2014. A Comparison of Privacy and Security Knowledge and Privacy Concern as Influencing Factors for Mobile Protection Behavior. Workshop on Privacy Personas and Segmentation, PPS 2014, held with SOUPS 2014. See: http://cups.cs.cmu.edu/soups/2014/workshops/privacy/ s2p4.pdf","paperID":"None"},{"content":"Ponnurangam Kumaraguru and Lorrie Faith Cranor. 2005. Privacy Indexes: A Survey of Westin's Studies. Technical Report Carnegie Mellon University-ISRI-5--138, December 2005, Carnegie Mellon University.","paperID":"None"},{"content":"Doohwang Lee, Robert Larose, and Nora Rifon. 2008. Keeping our network safe: a model of online protection behaviour. Behaviour & Information Technology 27, 5: 445--454. http://doi.org/10.1080/01449290600879344","paperID":"None"},{"content":"Ryan Lytle. 2013. The Beginner's Guide to Google+. http://mashable.com/2013/10/27/google-plusbeginners-guide/.","paperID":"None"},{"content":"Tomasz Miaskiewicz, Tamara Sumner, and Kenneth A. Kozar. 2008. A Latent Semantic Analysis Methodology for the Identification and Creation of Personas. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1501--1510. http://doi.org/10.1145/1357054.1357290","paperID":"None"},{"content":"A. Morton and M.A. Sasse. 2014. Desperately seeking assurances: Segmenting users by their informationseeking preferences. 2014 Twelfth Annual International Conference on Privacy, Security and Trust (PST), 102--111. http://doi.org/10.1109/PST.2014.6890929","paperID":"None"},{"content":"Judith S. Olson, Jonathan Grudin, and Eric Horvitz. 2005. A Study of Preferences for Sharing and Privacy. CHI '05 Extended Abstracts on Human Factors in Computing Systems, ACM, 1985--1988. http://doi.org/10.1145/1056808.1057073","paperID":"None"},{"content":"Sai Teja Peddinti, Allen Collins, Aaron Sedley, Nina Taft, Anna Turner and Allison Woodruff. 2015. Perceived Frequency of Advertising Practices. Workshop on Privacy Personas and Segmentation, PPS 2015, held with SOUPS 2015. See: https://cups.cs.cmu.edu/soups/2015/papers/ppsPeddinit i.pdf","paperID":"None"},{"content":"Kim Bartel Sheehan. 2002. Toward a Typology of Internet Users and Online Privacy Concerns. The Information Society 18, 1: 21--32. http://doi.org/10.1080/01972240252818207","paperID":"None"},{"content":"Anselm Leonard Strauss and Juliet M. Corbin. 1990.Basics of Qualitative Research: Grounded Theory Procedures and Techniques. Sage.","paperID":"None"},{"content":"Colleen Swanson, Ruth Urner, and Edward Lank. 2010. Naïve Security in a Wi-Fi World. In Trust Management IV, Masakatsu Nishigaki, Audun Jøsang, Yuko Murayama and Stephen Marsh (eds.). Springer Berlin Heidelberg, 32--47.","paperID":"None"},{"content":"Jennifer Urban and Chris Hoofnagle. 2014. The Privacy Pragmatic as Privacy Vulnerable, Workshop on Privacy Personas and Segmentation, PPS 2014, held with SOUPS 2014. See: http://cups.cs.cmu.edu/soups/2014/workshops/privacy/s1p2.pdf","paperID":"None"},{"content":"Jessica Vitak. 2015. Balancing Privacy Concerns and Impression Management Strategies on Facebook. Workshop on Privacy Personas and Segmentation, PPS 2015, held with SOUPS 2015. See: https://cups.cs.cmu.edu/soups/2015/papers/ppsVitak.pdf","paperID":"None"},{"content":"Rick Wash and Emilee Rader. 2015. Too Much Knowledge? Security Beliefs and Protective Behaviors Among United States Internet Users. In Eleventh Symposium On Usable Privacy and Security (SOUPS 2015) (pp. 309--325).","paperID":"None"},{"content":"Robert S. Weiss. 1995. Learning from strangers: The art and method of qualitative interview studies. Simon and Schuster.","paperID":"None"},{"content":"Pamela Wisniewski, Bart Knijnenburg and Heather Richter Lipford. 2014. Profiling facebook users' privacy behaviors. Workshop on Privacy Personas and Segmentation, PPS 2014, held with SOUPS 2014. See: http://cups.cs.cmu.edu/soups/2014/workshops/privacy/ s2p1.pdf","paperID":"None"},{"content":"Allison Woodruff, Vasyl Pihur, Sunny Consolvo, Lauren Schmidt, Laura Brandimarte, and Alessandro Acquisti. 2014. Would a privacy fundamentalist sell their dna for $1000... if nothing bad happened as a result? the westin categories, behavioral intentions, and consequences. In Symposium on Usable Privacy and Security (SOUPS).","paperID":"None"}],"title":"Privacy Personas: Clustering Users via Attitudes and Behaviors toward Security Practices","filename":"CHI16/p5228","authors":["Janna Lynn Dupree","Richard Devries","Daniel M. Berry","Edward Lank"],"conference":"CHI '16"}