{"paperId":2858457,"citation":[],"reference":[{"content":"Tomas Akenine-Möller. 2005. Fast 3D Triangle-box Overlap Testing. In ACM SIGGRAPH 2005 Courses (SIGGRAPH '05). ACM, NY, NY, USA, Article 8. DOI: http://dx.doi.org/10.1145/1198555.1198747","paperID":"None"},{"content":"Marc Alexa and Wojciech Matusik. 2010. Reliefs As Images. ACM Trans. Graph. 29, 4 (July 2010), 60:1--60:7. DOI: http://dx.doi.org/10.1145/1778765.1778797","paperID":"None"},{"content":"Jason Alexander, Andrés Lucero, and Sriram Subramanian. 2012. Tilt Displays: Designing Display Surfaces with Multi-axis Tilting and Actuation. In Proceedings of the International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, NY, NY, USA, 161--170. DOI: http://dx.doi.org/10.1145/2371574.2371600","paperID":"None"},{"content":"AntiVJ. 2009. Enghien. (2009). Retrieved September 17, 2015 from http://antivj.com/enghien/.","paperID":"None"},{"content":"Olivier Bau, Ivan Poupyrev, Ali Israr, and Chris Harrison. 2010. TeslaTouch: Electrovibration for Touch Surfaces. In Proceedings of the Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, NY, NY, USA, 283--292. DOI: http://dx.doi.org/10.1145/1866029.1866074","paperID":"None"},{"content":"Hrvoje Benko, Ricardo Jota, and Andrew Wilson. 2012. MirageTable: Freehand Interaction on a Projected Augmented Reality Tabletop. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 199--208. DOI: http://dx.doi.org/10.1145/2207676.2207704","paperID":"None"},{"content":"Amit Bermano, Philipp Brüschweiler, Anselm Grundhöfer, Daisuke Iwai, Bernd Bickel, and Markus Gross. 2013. Augmenting Physical Avatars Using Projector-based Illumination. ACM Trans. Graph. 32, 6, Article 189 (Nov. 2013), 10 pages. DOI: http://dx.doi.org/10.1145/2508363.2508416","paperID":"None"},{"content":"Oliver Bimber and Ramesh Raskar. 2005. Spatial Augmented Reality: Merging Real and Virtual Worlds. A K Peters.","paperID":"None"},{"content":"James F. Blinn. 1978. Simulation of Wrinkled Surfaces. In Proceedings of the Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '78). ACM, NY, NY, USA, 286--292. DOI: http://dx.doi.org/10.1145/800248.507101","paperID":"None"},{"content":"James F. Blinn and Martin E. Newell. 1976. Texture and Reflection in Computer Generated Images. Commun. ACM 19, 10 (Oct. 1976), 542--547. DOI: http://dx.doi.org/10.1145/360349.360353","paperID":"None"},{"content":"Harry Blum. 1967. A Transformation for Extracting New Descriptors of Shape. Models for the Perception of Speech and Visual Form (1967).","paperID":"None"},{"content":"Marcelo Coelho, Hiroshi Ishii, and Pattie Maes. 2008. Surffex: A Programmable Surface for the Design of Tangible Interfaces. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, NY, NY, USA, 3429--3434. DOI: http://dx.doi.org/10.1145/1358628.1358869","paperID":"None"},{"content":"Marcelo Coelho and Pattie Maes. 2009. Shutters: A Permeable Surface for Environmental Control and Communication. In Proceedings of the International Conference on Tangible and Embedded Interaction (TEI '09). ACM, NY, NY, USA, 13--18. DOI: http://dx.doi.org/10.1145/1517664.1517671","paperID":"None"},{"content":"Marcelo Coelho and Jamie Zigelbaum. 2011. Shape-changing Interfaces. Personal Ubiquitous Comput. 15, 2 (Feb. 2011), 161--173. DOI: http://dx.doi.org/10.1007/s00779-010-0311-y","paperID":"None"},{"content":"Peter Dalsgaard and Kim Halskov. 2011. 3D Projection on Physical Objects: Design Insights from Five Real Life Cases. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1041--1050. DOI: http://dx.doi.org/10.1145/1978942.1979097","paperID":"None"},{"content":"Peter Dalsgaard and Kim Halskov. 2014. Tangible 3D Tabletops. interactions 5, 21 (2014). DOI: http://dx.doi.org/10.1145/2658859","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic Physical Affordances and Constraints Through Shape and Object Actuation. In Proceedings of the Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 417--426. DOI: http://dx.doi.org/10.1145/2501988.2502032","paperID":"None"},{"content":"Antonio Gomes, Andrea Nesbitt, and Roel Vertegaal. 2013. MorePhone: A Study of Actuated Shape Deformations for Flexible Thin-lm Smartphone Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 583--592. DOI: http://dx.doi.org/10.1145/2470654.2470737","paperID":"None"},{"content":"Antonio Gomes and Roel Vertegaal. 2015. PaperFold: Evaluating Shape Changes for Viewport Transformations in Foldable Thin-Film Display Devices. In Proceedings of the International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, NY, NY, USA, 153--160. DOI: http://dx.doi.org/10.1145/2677199.2680572","paperID":"None"},{"content":"Michael D. Grossberg, Harish Peri, Shree K. Nayar, and Peter N. Belhumeur. 2004. Making one object look like another: controlling appearance using a projector-camera system. In Proceedings of the IEEE Computer Society Conference Computer Vision and Pattern Recognition. DOI: http://dx.doi.org/10.1109/CVPR.2004.1315067","paperID":"None"},{"content":"Kim Halskov, Peter Dalsgaard, and Louise Bak Stolze. 2014. Analysing Engaging Experiences with a Tangible 3D Tabletop. In Proceedings of the Conference on Advances in Computer Entertainment Technology (ACE '14). ACM, NY, NY, USA, Article 29, 10 pages. DOI: http://dx.doi.org/10.1145/2663806.2663831","paperID":"None"},{"content":"Oren Horev. 2006. 'Talking to the Hand' An exploration into shape shifting objects and morphing interfaces. (2006). Master's thesis.","paperID":"None"},{"content":"Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical Atoms: Beyond Tangible Bits, Toward Transformable Materials. interactions 19, 1 (Jan. 2012), 38--51. DOI: http://dx.doi.org/10.1145/2065327.2065337","paperID":"None"},{"content":"Brett Jones, Rajinder Sodhi, Michael Murdock, Ravish Mehra, Hrvoje Benko, Andrew Wilson, Eyal Ofek, Blair MacIntyre, Nikunj Raghuvanshi, and Lior Shapira. 2014. RoomAlive: Magical Experiences Enabled by Scalable, Adaptive Projector-camera Units. In Proceedings of the Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 637--644. DOI: http://dx.doi.org/10.1145/2642918.2647383","paperID":"None"},{"content":"Mark W. Jones, J. Andreas Baerentzen, and Milos Sramek. 2006. 3D Distance Fields: A Survey of Techniques and Applications. IEEE Transactions on Visualization and Computer Graphics 12, 4 (July 2006), 581--599. DOI: http://dx.doi.org/10.1109/TVCG.2006.56","paperID":"None"},{"content":"Daniel Leithinger, Sean Follmer, Alex Olwal, Samuel Luescher, Akimitsu Hogge, Jinha Lee, and Hiroshi Ishii. 2013. Sublimate: State-changing Virtual and Physical Rendering to Augment Interaction with Shape Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1441--1450. DOI: http://dx.doi.org/10.1145/2470654.2466191","paperID":"None"},{"content":"Daniel Leithinger, David Lakatos, Anthony DeVincenzi, Matthew Blackshaw, and Hiroshi Ishii. 2011. Direct and Gestural Interaction with Relief: A 2.5D Shape Display. In Proceedings of the Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 541--548. DOI: http://dx.doi.org/10.1145/2047196.2047268","paperID":"None"},{"content":"Wojciech Matusik, Boris Ajdin, Jinwei Gu, Jason Lawrence, Hendrik P. A. Lensch, Fabio Pellacini, and Szymon Rusinkiewicz. 2009. Printing Spatially-varying Reflectance. ACM Trans. Graph. 28, 5, Article 128 (Dec. 2009), 9 pages. DOI: http://dx.doi.org/10.1145/1618452.1618474","paperID":"None"},{"content":"Simon Olberding, Michael Wessely, and Jürgen Steimle. 2014. PrintScreen: Fabricating Highly Customizable Thin-lm Touch-displays. In Proceedings of the Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 281--290. DOI: http://dx.doi.org/10.1145/2642918.2647413","paperID":"None"},{"content":"Ben Piper, Carlo Ratti, and Hiroshi Ishii. 2002. Illuminating Clay: A 3-D Tangible Interface for Landscape Analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, NY, NY, USA, 355--362. DOI: http://dx.doi.org/10.1145/503376.503439","paperID":"None"},{"content":"Ramesh Raskar, Greg Welch, Kok-Lim Low, and Deepak Bandyopadhyay. 2001. Shader Lamps: Animating Real Objects With Image-Based Illumination. In Proceedings of the Eurographics Workshop on Rendering Techniques. Springer-Verlag, London, UK, UK, 89--102. http://dl.acm.org/citation.cfm?id=647653.732300","paperID":"None"},{"content":"Majken K. Rasmussen, Timothy Merrit, Miguel Bruns Alonso, and Marianne G. Petersen. 2016. Balancing User and System Control in Shape-Changing Interfaces: a Designerly Exploration. In Proceedings of the Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, NY, NY, USA.","paperID":"None"},{"content":"Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shape-changing Interfaces: A Review of the Design Space and Open Research Questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 735--744. DOI: http://dx.doi.org/10.1145/2207676.2207781","paperID":"None"},{"content":"Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: Toward High \"Shape Resolution\" in Self-actuated Flexible Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 593--602. DOI: http://dx.doi.org/10.1145/2470654.2470738","paperID":"None"},{"content":"Jean Serra. 1983. Image Analysis and Mathematical Morphology. Academic Press, Inc.","paperID":"None"},{"content":"Ian Stavness, Billy Lam, and Sidney Fels. 2010. pCubee: A Perspective-corrected Handheld Cubic Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1381--1390. DOI: http://dx.doi.org/10.1145/1753326.1753535","paperID":"None"},{"content":"The CGAL Project. 2015. CGAL User and Reference Manual (4.6.3 ed.). CGAL Editorial Board. http://doc.cgal.org/4.6.3/Manual/packages.html","paperID":"None"},{"content":"Jonas Togler, Fabian Hemmert, and Reto Wettach. 2009. Living Interfaces: The Thrifty Faucet. In Proceedings of the International Conference on Tangible and Embedded Interaction (TEI '09). ACM, NY, NY, USA, 43--44. DOI: http://dx.doi.org/10.1145/1517664.1517680","paperID":"None"},{"content":"Valbuena, Pablo. 2008. Augmented Sculpture. (2008). Retrieved September 17, 2015 from http://www.pablovalbuena.com/selectedwork/augmented-sculpture-v1/.","paperID":"None"},{"content":"Lance Williams. 1978. Casting Curved Shadows on Curved Surfaces. SIGGRAPH Comput. Graph. 12, 3 (Aug. 1978), 270--274. DOI: http://dx.doi.org/10.1145/965139.807402","paperID":"None"},{"content":"Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically Actuated Soft Composite Materials for Shape Changing Interfaces. In Proceedings of the Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 13--22. DOI: http://dx.doi.org/10.1145/2501988.2502037","paperID":"None"}],"abstract":"We propose combining shape-changing interfaces and spatial augmented reality for extending the space of appearances and interactions of actuated interfaces. While shape-changing interfaces can dynamically alter the physical appearance of objects, the integration of spatial augmented reality additionally allows for dynamically changing objects' optical appearance with high detail. This way, devices can render currently challenging features such as high frequency texture or fast motion. We frame this combination in the context of computer graphics with analogies to established techniques for increasing the realism of 3D objects such as bump mapping. This extensible framework helps us identify challenges of the two techniques and benefits of their combination. We utilize our prototype shape-changing device enriched with spatial augmented reality through projection mapping to demonstrate the concept. We present a novel mechanical distance-fields algorithm for real-time fitting of mechanically constrained shape-changing devices to arbitrary 3D graphics. Furthermore, we present a technique for increasing effective screen real estate for spatial augmented reality through view-dependent shape change.","title":"Combining Shape-Changing Interfaces and Spatial Augmented Reality Enables Extended Object Appearance","filename":"CHI16/p791","authors":["David Lindlbauer","Jens Emil Grønbæk","Morten Birk","Kim Halskov","Marc Alexa","Jörg Müller"],"conference":"CHI '16"}