{"paperId":2858168,"citation":[],"reference":[{"content":"Victoria Bellotti and Keith Edwards. 2001. Intelligibility and accountability: human considerations in contextaware systems. Hum.-Comput. Interact. 16, 2 (December 2001), 193--212. http://dx.doi.org/10.1207/S15327051HCI16234_05","paperID":"None"},{"content":"A.J. Bernheim Brush, Bongshin Lee, Ratul Mahajan, Sharad Agarwal, Stefan Saroiu, and Colin Dixon. 2011. Home automation in the wild: challenges and opportunities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2115--2124. http://dx.doi.org/10.1145/1978942.1979249","paperID":"None"},{"content":"Dario Bonino, Emiliano Castellina, Fulvio Corno, and Luigi De Russis. 2011. DOGeye: Controlling your home with eye interaction. Interact. Comput. 23, 5 (September 2011), 484--498. http://dx.doi.org/10.1016/j.intcom.2011.06.002","paperID":"None"},{"content":"Marshini Chetty, Richard Banks, Richard Harper, Tim Regan, Abigail Sellen, Christos Gkantsidis, Thomas Karagiannis, and Peter Key. 2010. Who's hogging the bandwidth: the consequences of revealing the invisible in the home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 659--668. http://dx.doi.org/10.1145/1753326.1753423","paperID":"None"},{"content":"Enrico Costanza, Joel E. Fischer, James A. Colley, Tom Rodden, Sarvapali D. Ramchurn, and Nicholas R. Jennings. 2014. Doing the laundry with agents: a field trial of a future smart energy system in the home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 813--822. http://dx.doi.org/10.1145/2556288.2557167","paperID":"None"},{"content":"Scott Davidoff, Min Kyung Lee, Anind K. Dey, and John Zimmerman. 2007. Rapidly exploring application design through speed dating. In Proceedings of the 9th international conference on Ubiquitous computing (UbiComp '07), John Krumm, Gregory D. Abowd, Aruna Seneviratne, and Thomas Strang (Eds.). Springer-Verlag, Berlin, Heidelberg, 429--446. http://dx.doi.org/ 10.1007/978-3-540-74853-3_25","paperID":"None"},{"content":"Scott Davidoff. 2011. Routine as resource for the design of learning systems. (Doctoral Dissertation) (Carnegie Mellon UniversityHCII-11-103). 344 p. Available from the Carnegie Mellon SCS Technical Report Collection.","paperID":"None"},{"content":"Anind K. Dey, Raffay Hamid, Chris Beckmann, Ian Li, and Daniel Hsu. 2004. a CAPpella: programming by demonstration of context-aware applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 33--40. http://dx.doi.org/10.1145/985692.985697","paperID":"None"},{"content":"Jon Froehlich, Leah Findlater, Marilyn Ostergren, Solai Ramanathan, Josh Peterson, Inness Wragg, Eric Larson, Fabia Fu, Mazhengmin Bai, Shwetak Patel, and James A. Landay. 2012. The design and evaluation of prototype eco-feedback displays for fixture-level water usage data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2367--2376. http://dx.doi.org/10.1145/2207676.2208397","paperID":"None"},{"content":"Andrew C. Gallagher, Carman G. Neustaedter, Liangliang Cao, Jiebo Luo, and Tsuhan Chen. 2008. Image annotation using personal calendars as context. In Proceedings of the 16th ACM international conference on Multimedia (MM '08). ACM, NY, NY, USA, 681--684. http://dx.doi.org/10.1145/1459359.1459458","paperID":"None"},{"content":"Dandan Huang, Melanie Tory, and Lyn Bartram. 2014. Data in everyday life: Visualizing time-varying data on a calendar. In Proc. Poster Compendium IEEE VIS.","paperID":"None"},{"content":"Antonio Isalgue, Massimo Palme, Helena Coch, and Rafael Serra. 2006. The importance of users' actions for the sensation of comfort in buildings. In Proceedings PLEA, 6--8.","paperID":"None"},{"content":"Tiiu Koskela and Kaisa Väänänen-Vainio-Mattila. 2004. Evolution towards smart home environments: empirical evaluation of three user interfaces. Personal Ubiquitous Comput. 8, 3--4 (July 2004), 234--240. http://dx.doi.org/10.1007/s00779-004-0283-x","paperID":"None"},{"content":"Christine Kühnel, Tilo Westermann, Fabian Hemmert, Sven Kratz, Alexander Müller, and Sebastian Möller. 2011. I'm home: Defining and evaluating a gesture set for smart-home control. International Journal of HumanComputer Studies 69, 11: 693--704. http://doi.org/10.1016/j.ijhcs.2011.04.005","paperID":"None"},{"content":"Matthias Laschke, Marc Hassenzahl, Sarah Diefenbach, and Marius Tippkämper. 2011. With a little help from a friend: a shower calendar to save water. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 633--646. http://dx.doi.org/10.1145/1979742.1979659","paperID":"None"},{"content":"Brian Y. Lim and Anind K. Dey. 2011. Investigating intelligibility for uncertain context-aware applications. In Proceedings of the 13th international conference on Ubiquitous computing (UbiComp '11). ACM, NY, NY, USA, 415--424. http://dx.doi.org/10.1145/2030112.2030168","paperID":"None"},{"content":"Jennifer Mankoff, Anind K. Dey, Gary Hsieh, Julie Kientz, Scott Lederer, and Morgan Ames. 2003. Heuristic evaluation of ambient displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 169--176. http://dx.doi.org/10.1145/642611.642642","paperID":"None"},{"content":"Sarah Mennicken and Elaine M. Huang. 2012. Hacking the natural habitat: an in-the-wild study of smart homes, their development, and the people who live in them. In Proceedings of the 10th international conference on Pervasive Computing (Pervasive'12), Judy Kay, Paul Lukowicz, Hideyuki Tokuda, Patrick Olivier, and Antonio Krüger (Eds.). Springer-Verlag, Berlin, Heidelberg, 143--160. http://dx.doi.org/10.1007/978-3642-31205-2_10","paperID":"None"},{"content":"Sarah Mennicken, Jo Vermeulen, and Elaine M. Huang. 2014. From today's augmented houses to tomorrow's smart homes: new directions for home automation research. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, NY, NY, USA, 105--115. http://dx.doi.org/10.1145/2632048.2636076","paperID":"None"},{"content":"Carman Neustaedter and A. J. Bernheim Brush. 2006. \"LINC-ing\" the family: the participatory design of an inkable family calendar. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (Eds.). ACM, NY, NY, USA, 141--150. http://dx.doi.org/10.1145/1124772.1124796","paperID":"None"},{"content":"Carman Neustaedter, Lyn Bartram, and Aaron Mah. 2013. Everyday activities and energy consumption: how families understand the relationship. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1183--1192. http://dx.doi.org/10.1145/2470654.2466153","paperID":"None"},{"content":"Carman Neustaedter, A. J. Bernheim Brush, and Saul Greenberg. 2009. The calendar is crucial: Coordination and awareness through the family calendar. ACM Trans. Comput.-Hum. Interact. 16, 1, Article 6 (April 2009), 48 pages. http://dx.doi.org/10.1145/1502800.1502806","paperID":"None"},{"content":"Jeffrey Nichols, Brad A. Myers, Michael Higgins, Joseph Hughes, Thomas K. Harris, Roni Rosenfeld, and Mathilde Pignol. 2002. Generating remote control interfaces for complex appliances. In Proceedings of the 15th annual ACM symposium on User interface software and technology (UIST '02). ACM, NY, NY, USA, 161--170. http://dx.doi.org/10.1145/571985.572008","paperID":"None"},{"content":"Leysia Palen. 1999. Social, individual and technological issues for groupware calendar systems. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 17--24. http://dx.doi.org/10.1145/302979.302982","paperID":"None"},{"content":"Erika Shehan Poole, Marshini Chetty, Rebecca E. Grinter, and W. Keith Edwards. 2008. More than meets the eye: transforming the user experience of home network management. In Proceedings of the 7th ACM conference on Designing interactive systems (DIS '08). ACM, NY, NY, USA, 455--464. http://dx.doi.org/10.1145/1394445.1394494","paperID":"None"},{"content":"Jennifer A. Rode, Eleanor F. Toye, and Alan F. Blackwell. 2004. The fuzzy felt ethnography? understanding the programming patterns of domestic appliances. Personal Ubiquitous Comput. 8, 3--4 (July 2004), 161--176. http://dx.doi.org/10.1007/s00779-0040272-0","paperID":"None"},{"content":"Florian Schaub, Peter Lang, Bastian Könings, and Michael Weber. 2013. PriCal: dynamic privacy adaptation of collaborative calendar displays. In Proceedings of the 2013 ACM conference on Pervasive and ubiquitous computing adjunct publication (UbiComp '13 Adjunct). ACM, NY, NY, USA, 223--226. http://dx.doi.org/10.1145/2494091.2494163","paperID":"None"},{"content":"Yolande A.A. Strengers. 2011. Designing eco-feedback systems for everyday life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2135--2144. http://dx.doi.org/10.1145/1978942.1979252","paperID":"None"},{"content":"Mark Stringer, Geraldine Fitzpatrick, and Eric Harris. 2006. Lessons for the Future: Experiences with the Installation and Use of Today's Domestic Sensors & Technologies. In Proceedings of the 4th international conference on Pervasive Computing (Pervasive '06), Kenneth P. Fishkin, Bernt Schiele, Paddy Nixon, and Aaron Quigley (Eds.). Springer-Verlag, Berlin Heidelberg, 383--399. http://dx.doi.org/10.1007/11748625_24","paperID":"None"},{"content":"Truong, Khai N., Elaine M. Huang, and Gregory D. Abowd. \"CAMP: A magnetic poetry interface for enduser programming of capture applications for the home.\" In Proceedings of the 6th International Conference on Ubiquitous Computing (UbiComp '04), Nigel Davies, Elizabeth Mynatt, and Itiro Siio (Eds.). Springer-Verlag, Berlin Heidelberg, 143--160. http://dx.doi.org/10.1007/b99948","paperID":"None"},{"content":"Joe Tullio and Elizabeth D. Mynatt. 2007. Use and implications of a shared, forecasting calendar. In Proceedings of the 11th IFIP TC 13 international conference on Human-computer interaction (INTERACT'07), Cécilia Baranauskas, Philippe Palanque, Julio Abascal, and Simone Diniz Junqueira Barbosa (Eds.). Springer-Verlag, Berlin Heidelberg, 269282. http://dx.doi.org/ 10.1007/978-3-540-74796-3_26","paperID":"None"},{"content":"Blase Ur, Jaeyeon Jung, and Stuart Schechter. 2014. Intruders versus intrusiveness: teens' and parents' perspectives on home-entryway surveillance. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, NY, NY, USA, 129--139. http://dx.doi.org/10.1145/2632048.2632107","paperID":"None"},{"content":"Viswanath Venkatesh, Michael G. Morris, Gordon B. Davis, and Fred D. Davis. 2003. User acceptance of information technology: toward a unified view. MIS Q. 27, 3 (September 2003), 425--478.","paperID":"None"},{"content":"Jo Vermeulen, Geert Vanderhulst, Kris Luyten, and Karin Coninx. 2010. PervasiveCrystal: Asking and answering why and why not questions about pervasive computing applications. In Proceedings of the 6th International Conference on Intelligent Environments (IE'10), IEEE, 271--276. http://dx.doi.org/10.1109/IE.2010.56","paperID":"None"},{"content":"Rayoung Yang, Mark W. Newman, and Jodi Forlizzi. 2014. Making sustainability sustainable: challenges in the design of eco-interaction technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 823--832. http://dx.doi.org/10.1145/2556288.2557380","paperID":"None"}],"abstract":"With the growing adoption of smart home technologies, inhabitants are faced with the challenge of making sense of the data that their homes can collect to configure automated behaviors that benefit their routines. Current commercial smart home interfaces usually provide information on individual devices instead of a more comprehensive overview of a home's behavior. To reduce the complexity of smart home data and integrate it better into inhabitants' lives, we turned to the familiar metaphor of a calendar and developed our smart home interface Casalendar. In order to investigate the concept and evaluate our goals to facilitate the understanding of smart home data, we created a prototype that we installed in two commercial smart homes for a month. The results we present in this paper are based on our analysis of user data from questionnaires, semi-structured interviews, participant-driven audio and screenshot feedback as well as logged interactions with our system. Our findings exposed advantages and disadvantages of this metaphor, emerging usage patterns, privacy concerns and challenges for information visualization. We further report on implications for design and open challenges we revealed through this work.","title":"Integrating the Smart Home into the Digital Calendar","filename":"CHI16/p5958","authors":["Sarah Mennicken","David Kim","Elaine May Huang"],"conference":"CHI '16"}