{"paperId":2858458,"citation":[],"reference":[{"content":"Ronald Baecker, Kate Sellen, Sarah Crosskey, Veronique Boscart, Barbara Barbosa Neves. 2014. Technology to Reduce Social Isolation and Loneliness. In Proceedings of the SIGACCESS Conference on Computers and Accessibility (ASSETS '14), 27--34.","paperID":"None"},{"content":"Barbara Barbosa Neves, Rachel L. Franz, Cosmin Munteanu, Ronald Baecker, Mags Ngo. 2015. \"My Hand Doesn't Listen to Me!\": Adoption and Evaluation of a Communication Technology for the 'Oldest Old'. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1593--1602.","paperID":"None"},{"content":"Helen Bartlett, Jeni Warburton, C-W. Lui, L. Peach, M. Carroll. 2013. Preventing Social Isolation in Later Life: Findings and Insights from a Pilot Queensland Intervention Study. Ageing and Society 33, 7 (2013), 1167--1189.","paperID":"None"},{"content":"Eric. P. S. Baumer, Phil Adams, Vera D. Khovanskaya, Tony C. Liao, Madeline E. Smith, Victoria S. Sosik, Kaiton Williams. 2013. Limiting, Leaving, and (Re)Lapsing: An Exploration of Facebook Non-Use Practices and Experiences. In Proceedings SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 3257--3266.","paperID":"None"},{"content":"Eric P. S. Baumer, Morgan G. Ames, Jed R. Brubaker, Jenna Burrell, Paul Dourish. 2014. Refusing, Limiting, Departing: Why We Should Study Technology NonUse. In Extended Abstracts on Human Factors in Computing Systems (CHI EA '14), 65--68.","paperID":"None"},{"content":"Eric P. S. Baumer and M. Six Silberman. 2011. When the Implication Is Not to Design (Technology). In Proceedings SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2271--2274.","paperID":"None"},{"content":"D. L. Biordi and N. R. Nicholson. 2013. Social Isolation. In Chronic Illness: Impact and Intervention, I. M. Lubkin and P. D. Larsen Eds. Jones & Bartlett Learning (Burlington, MA), 97--132.","paperID":"None"},{"content":"Mark Blythe, Peter Wright, John Bowers, Andy Boucher, Nadine Jarvis, Phil Reynolds and Bill Gaver. 2010. Age and Experience: Ludic Engagement in a Residential Care Setting. In Proceedings of DIS 2010. ACM Press, 161--170.","paperID":"None"},{"content":"Alan Borning and Michael Muller. 2012. Next Steps for Value Sensitive Design. In Proceedings of CHI '12. ACM Press, 1125--1134.","paperID":"None"},{"content":"Oliver. K. Burmeister. 2012. What Seniors Value About Online Community. Community Informatics 8, 1.","paperID":"None"},{"content":"Mima Cattan, Martin White, John Bond and Alison Learmouth. 2005. Preventing Social Isolation and Loneliness among Older People: A Systematic Review of Health Promotion Interventions. Ageing & Society 25, 01, 41--67. http://dx.doi.org/doi:10.1017/S0144686X04002594","paperID":"None"},{"content":"E. Y. Cornwell and L. J. Waite. 2009. Social Disconnectedness, Perceived Isolation, and Health among Older Adults. Journal of Health and Social Behavior 50, 31 - 48. http://dx.doi.org/10.1177/002214650905000103","paperID":"None"},{"content":"Sara J. Czaja, Walter R. Boot, Neil Charness, Wendy A. Rogers, Joseph Sharit, Arthur D. Fisk, Chin Chin Lee, Sankaran N. Nair. 2015. The Personalized Reminder Information and Social Management System (Prism) Trial: Rationale, Methods and Baseline Characteristics. Contemporary Clinical Trials 40, 3546.","paperID":"None"},{"content":"Paul Dourish. 2014. Reading and Interpreting Ethnography. In Ways of Knowing in HCI, J.S. Olson and W.A. Kellogg Eds. Springer, 2014.","paperID":"None"},{"content":"P. Dourish and G. Bell. 2011. Divining a Digital Future: Mess and Mythology in Ubiquitous Computing. The MIT Press (Cambridge, MA, London, England).","paperID":"None"},{"content":"Batya Friedman, Peter H. Kahn Jr, Alan Borning. 2005. Value Sensitive Design and Information Systems. In Human-Computer Interaction and Management Information Systems: Foundations, Ping Zhang and Dennis F. Galletta Eds. M.E. Sharpe (Armonk, N.Y; London), 2005, 348--372.","paperID":"None"},{"content":"Verena Fuchsberger, Martin Murer, Manfred Tscheligi. 2014. Human-Computer Non-Interaction: The Activity of Non-Use. In Proceedings of the 2014 Companion Publication on Designing Interactive Systems (DIS '14), 57--60.","paperID":"None"},{"content":"Chiara Garattini, Joseph Wherton and David Prendergast. 2012. Linking the Lonely: An Exploration of a Communication Technology Designed to Support Social Interaction among Older Adults. Univ. Acc. in the Inf. Soc. 11, 2, 211--222. http://dx.doi.org/10.1007/s10209-011-0235-y","paperID":"None"},{"content":"William Gaver, John Bowers, Tobie Kerridge, Andy Boucher, Nadine Jarvis. 2009. Anatomy of a Failure: How We Knew When Our Design Went Wrong, and What We Learned from It. In Proceedings SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 2213--2222.","paperID":"None"},{"content":"Kathrin M. Gerling, Regan L. Mandryk and Conor Linehan. 2015. Long-Term Use of Motion-Based Video Games in Care Home Settings. In Proceedings SIGCHI Conference on Human Factors in Computing Systems, (CHI '15), 1573--1582.","paperID":"None"},{"content":"Lorna Gibson, Wendy Moncur, Paula Forbes, John Arnott, Christopher Martin and Amritpal S. Bhachu. 2010. Designing Social Networking Sites for Older Adults. In Proceedings of British Computer Society Specialist Group Conference (BCS '10). 186--194.","paperID":"None"},{"content":"Trisha Greenhalgh, Joe Wherton, Paul Sugarhood, Sue Hinder and Rob Procter. 2013. What Matters to Older People with Assisted Living Needs? A Phenomenological Analysis of the Use and Non-Use of Telehealth and Telecare. Social Science & Medicine 93, 86--94. http://dx.doi.org/10.1016/j.socscimed.2013.05.036","paperID":"None"},{"content":"Peter Gregor, Alan F. Newell, Mary Zajicek. 2002. Designing for Dynamic Diversity Interfaces for Older People. In Proceedings of the ACM Conference on Assistive Technologies (ASSETS '02), 151--156.","paperID":"None"},{"content":"Marilys Guillemin and Lynn Gillam. 2004. Ethics, Reflexivity, and \"Ethically Important Moments\" in Research. Qualitative Inquiry 10, 2, 261--280.","paperID":"None"},{"content":"Steve Harrison, Phoebe Sengers, Deborah Tatar. 2011. Making Epistemological Trouble: Third-Paradigm HCI as Successor Science. Interacting with Computers 23, 5, 385--392.","paperID":"None"},{"content":"Vilma Lehtinen, Jaana Näsänen and Risto Sarvas. 2009. \"A Little Silly and Empty-Headed\" - Older Adults' Understandings of Social Networking Sites. In Proceedings of British HCI Conf., 45--54.","paperID":"None"},{"content":"Helen Lester, N. Mead, C. C. Graham, L. Gask and S. Reilly. 2012. An Exploration of the Value and Mechanisms of Befriending for Older Adults in England. Ageing and Society 32, 307--328 (2012).","paperID":"None"},{"content":"Ann Light. 2011. Democratising Technology: Making Transformation Using Designing, Performance and Props. In Proceedings SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2239--2242.","paperID":"None"},{"content":"John McCarthy and Peter Wright. 2015. Taking [a]Part: The Politics and Aesthetics of Participation in Experience-Centered Design. The MIT Press (Cambridge, MA; London, UK).","paperID":"None"},{"content":"Wendy Moncur. 2013. The Emotional Wellbeing of Researchers: Considerations for Practice. In Proceedings SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1883--1890.","paperID":"None"},{"content":"M. Mort, C. Roberts and B. Callen. Ageing with Telecare: Care or Coercion in Austerity? Sociology of Health & Illness 35, 6 (2013), 799 - 812.","paperID":"None"},{"content":"Cosmin Munteanu, Heather Molyneaux, Wendy Moncur, Mario Romero, Susan O'Donnell, John Vines. 2015. Situational Ethics: Re-Thinking Approaches to Formal Ethics Requirements for Human-Computer Interaction. In Proceedings SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 105114.","paperID":"None"},{"content":"Nicholas R. Nicholson. 2012. A Review of Social Isolation: An Important but Underassessed Condition in Older Adults. Journal of Primary Prevention 33, 23, 137--152. http://dx.doi.org/10.1007/s10935-0120271--2","paperID":"None"},{"content":"Sonja Pedell, Frank Vetere, Lars Kulik, Elizabeth Ozanne and Alan Gruner. 2010. Social Isolation of Older People: The Role of Domestic Technologies. In Proceedings of OzCHI 2010. ACM Press, 167--170. http://dx.doi.org/10.1145/1952222.1952255","paperID":"None"},{"content":"J. Pols and D. Willems. 2010. Innovation and Evaluation: Taming and Unleashing Telecare Technology. Sociology of Health & Illness 33, 3, 484 498.","paperID":"None"},{"content":"L. Portwood-Stacer. 2013. Media Refusal and Conspicuous Non-Consumption: The Performative and Political Dimensions of Facebook Abstention. New Media & Society 15, 7, 1041 - 1057.","paperID":"None"},{"content":"E. Raymond, A. Sevigny, A. Tourigny, A. Vezina, R. Verreault and A. C. Guilbert. 2013. On the Track of Evaluated Programmes Targeting the Social Participation of Seniors: A Typology Proposal. Ageing and Society 33, 2, 267 - 296.","paperID":"None"},{"content":"Christine Satchell and Paul Dourish. 2009. Beyond the User: Use and Non-Use in Hci. In Proceedings of the Australian Computer-Human Special Interest Group Conference (OzCHI '09), 9--16.","paperID":"None"},{"content":"Sergio Sayago and Josep Blat. 2011. An Ethnographical Study of the Accessibility Barriers in the Everyday Interactions of Older People with the Web. Universal Access in the Information Society 10, 359--371.","paperID":"None"},{"content":"Neil Selwyn. 2003. Apart from Technology: Understanding People's Non-Use of Information and Communication Technologies in Everyday Life. Technology in Society 25, 99--116.","paperID":"None"},{"content":"Neil Selwyn. 2006. Digital Division or Digital Decision? A Study of Non-Users and Low-Users of Computers. Poetics 34, 273 - 292.","paperID":"None"},{"content":"Phoebe Sengers, Kirsten Boehner, Shay David and Joseph Kaye. 2005. Reflective Design. In Proceedings of Aarhus '05. ACM Press, 49--58.","paperID":"None"},{"content":"T. Sorell and H. Draper. 2014. Robot Carers, Ethics, and Older People. Ethics and Information Technology 16, 3 (2014), 183--195.","paperID":"None"},{"content":"A. Steptoe, A. Shankar, P. Demakakos and J. Wardle. Social Isolation, Loneliness, and All-Cause Mortality in Older Men and Women. Proceedings of the National Academy of Sciences of the United States of America 110, 15 (2013), 5797 - 5801.","paperID":"None"},{"content":"Marcus S. Svensson and Tomas Sokoler. 2008. Ticketto-Talk-Television: Designing for the Circumstantial Nature of Everyday Social Interaction. In Proceedings of NordiCHI 2008. 334--343.","paperID":"None"},{"content":"John Vines, Rachel Clarke, Peter Wright, John McCarthy and Patrick Olivier. 2013. Configuring Participation: On How We Involve People in Design. In Proceedings of CHI '13. ACM Press, 429--438.","paperID":"None"},{"content":"René Vutborg, Jesper Kjeldskov, Sonja Pedell and Frank Vetere. 2010. Family Storytelling for Grandparents and Grandchildren Living Apart. In Proceedings of NordiCHI 2010, 531 - 540.","paperID":"None"},{"content":"Jenny Waycott, Hilary Davis, Frank Vetere, Amee Morgans, Alan Gruner, Elizabeth Ozanne and Lars Kulik. 2014. Captioned Photographs in Psychosocial Aged Care: Relationship Building and Boundary Work. In Proceedings of the Sigchi Conference on Human Factors in Computing Systems (CHI '14), 4167 - 4176.","paperID":"None"},{"content":"Jenny Waycott, Hilary, Davis, Anja Thieme, Stacy Branham, John Vines and Cosmin Munteanu. Ethical encounters in HCI: Research in sensitive settings. In Extended Abstracts on Human Factors in Computing Systems (CHI EA '15), 2369--2372","paperID":"None"},{"content":"Jenny Waycott, Amee Morgans, Sonja Pedell, Elizabeth Ozanne, Frank Vetere, Lars Kulik and Hilary Davis. 2015. Ethics in Evaluating a Sociotechnical Intervention with Socially Isolated Older Adults. Qualitative Health Research 25, 11, 1518--1528. http://dx.doi.org/10.1177/1049732315570136","paperID":"None"},{"content":"Jenny Waycott, Sonja Pedell, Frank Vetere, Elizabeth Ozanne, Lars Kulik, Alan Gruner and John Downs. 2012. Actively Engaging Older Adults in the Development and Evaluation of Tablet Technology. In Proceedings of the Australian Computer-Human Interaction Conference (OzCHI '12), 643--652.","paperID":"None"},{"content":"Jenny Waycott, Greg Wadley, Stefan Schutt, Arthur Stabolidis and Reeva Lederman. 2015. The Challenge of Technology Research in 'Sensitive Hci'. In Proceedings of the Australian Computer-Human Interaction Conference (OzCHI '15), 240--249.","paperID":"None"},{"content":"Jenny Waycott, Frank Vetere, Sonja Pedell, Lars Kulik, Elizabeth Ozanne, Alan Gruner and John Downs. 2013. Older Adults as Digital Content Producers. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems. ACM Press, 39--48.","paperID":"None"},{"content":"Peter Wright and John McCarthy. 2015. The Politics and Aesthetics of Participatory HCI. Interactions, November-December 2015, 26--31.","paperID":"None"},{"content":"Sally Wyatt. 2003. Non-Users Also Matter: The Construction of Users and Non-Users of the Internet. In How Users Matter: The Co-Construction of Users and Technology, N. Oudshoorn and T. Pinch Eds. The MIT Press (Cambridge, MA, London, England), 67 - 79.","paperID":"None"},{"content":"S. Zwijsen, A. R. Niemeijer and C. M. P. M. Hertogh. 2011. Ethics of Using Assistive Technology in the Care of Community-Dwelling Elderly People: An Overview of the Literature. Aging & Mental Health 15, 4, 419 427.","paperID":"None"}],"abstract":"This paper considers what we can learn from the experiences of people who choose not to participate in technology-based social interventions. We conducted ethnographically-informed field studies with socially isolated older adults, who used and evaluated a new iPad application designed to help build new social connections. In this paper we reflect on how the values and assumptions guiding the technological intervention were not always shared by those participating in the evaluation. Drawing on our field notes and interviews with the older adults who chose to discontinue participation, we use personas to illustrate the complexities and tensions involved in individual decisions to not participate. This analysis contributes to HCI research calling for a more critical perspective on technological interventions. We provide detailed examples highlighting the complex circumstances of our non-participants' lives, present a framework that outlines the socio-technical context of non-participation, and use our findings to promote reflective practice in HCI research that aims to address complex social issues.","title":"Not For Me: Older Adults Choosing Not to Participate in a Social Isolation Intervention","filename":"CHI16/p745","authors":["Jenny Waycott","Frank Vetere","Sonja Pedell","Amee Morgans","Elizabeth Ozanne","Lars Kulik"],"conference":"CHI '16"}