{"paperId":2858382,"citation":[],"reference":[{"content":"Azza Abouzied, Joseph Hellerstein, and Avi Silberschatz. 2012. DataPlay: interactive tweaking and example-driven correction of graphical database queries. In Proc. UIST '12, 207--218.","paperID":"None"},{"content":"Apple Inc. Swift. 2015. https://developer.apple.com/swift/","paperID":"None"},{"content":"Apple Inc. WatchKit. 2015. https://developer.apple.com/watchkit/","paperID":"None"},{"content":"Ira D. Baxter, Andrew Yahin, Leonardo Moura, Marcelo Sant'Anna, and Lorraine Bier. 1998. Clone Detection Using Abstract Syntax Trees. In Proc. ICSM '98, 368--377.","paperID":"None"},{"content":"Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12, 2301--2309.","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Tovi Grossman, Daniel J. Wigdor, and George Fitzmaurice. 2014. Duet: exploring joint interactions on a smart phone and a smart watch. In Proc. CHI '14, 159--168.","paperID":"None"},{"content":"Pei-Yu (Peggy) Chi and Yang Li. 2015. Weave: Scripting Cross-Device Wearable Interaction. In Proc. CHI '15, 3923--3932.","paperID":"None"},{"content":"Stephan Diehl. 2007. Software Visualization: Visualizing the Structure, Behaviour, and Evolution of Software. Springer-Verlag NY, Inc., Secaucus, NJ, USA.","paperID":"None"},{"content":"James Fogarty, Desney Tan, Ashish Kapoor, and Simon Winder. 2008. CueFlik: interactive concept learning in image search. In Proc. CHI '08, 29--38.","paperID":"None"},{"content":"Jens Grubert, Matthias Heinisch, Aaron Quigley, and Dieter Schmalstieg. 2015. MultiFi: Multi Fidelity Interaction with Displays On and Around the Body. In Proc. CHI '15, 3933--3942.","paperID":"None"},{"content":"Google Inc. Android Wear. 2015. https://www.android.com/wear/","paperID":"None"},{"content":"Google Inc. Chrome Apps. 2015. https://developer.chrome.com/apps/","paperID":"None"},{"content":"Björn Hartmann, Scott R. Klemmer, Michael Bernstein, Leith Abdulla, Brandon Burr, Avi Robinson-Mosher, and Jennifer Gee. 2006. Reflective physical prototyping through integrated design, test, and analysis. In Proc. UIST '06, 299--308.","paperID":"None"},{"content":"Björn Hartmann, Loren Yu, Abel Allison, Yeonsoo Yang, and Scott R. Klemmer. 2008. Design as exploration: creating interface alternatives through parallel authoring and runtime tuning. In Proc. UIST '08, 91--100.","paperID":"None"},{"content":"Ariya Hidayat. Esprima: ECMAScript parsing infrastructure for multipurpose analysis. 20 http://esprima.org/","paperID":"None"},{"content":"Steven Houben and Nicolai Marquardt. 2015. WatchConnect: A Toolkit for Prototyping Smartwatch-Centric Cross-Device Applications. In Proc. CHI '15, 1247--1256.","paperID":"None"},{"content":"Melody Y. Ivory and Marti A Hearst. 2001. The state of the art in automating usability evaluation of user interfaces. ACM Comput. Surv. 33, 4, 470--516.","paperID":"None"},{"content":"Thorsten Karrer, Jan-Peter Krämer, Jonathan Diehl, Björn Hartmann, and Jan Borchers. 2011. Stacksplorer: call graph navigation helps increasing code maintenance efficiency. In Proc. UIST '11, 217--224.","paperID":"None"},{"content":"Jun Kato, Sean McDirmid, and Xiang Cao. 2012. DejaVu: integrated support for developing interactive camera-based programs. In Proc. UIST '12, 189--196.","paperID":"None"},{"content":"Scott R. Klemmer, Mark W. Newman, Ryan Farrell, Mark Bilezikjian, and James A. Landay. 2001. The designers' outpost: a tangible interface for collaborative web site. In Proc. UIST '01, 1--10.","paperID":"None"},{"content":"James A. Landay and Brad A. Myers. 1996. Sketching storyboards to illustrate interface behaviors. In Proc. CHI '09, 193--194.","paperID":"None"},{"content":"Brian Lee, Savil Srivastava, Ranjitha Kumar, Ronen Brafman, and Scott R. Klemmer. 2010. Designing with interactive example galleries. In Proc. CHI '10, 2257--2266.","paperID":"None"},{"content":"Yang Li and James A. Landay. 2008. Activity-based prototyping of ubicomp applications for long-lived, everyday human activities. In Proc. CHI '08, 1303--1312.","paperID":"None"},{"content":"Yang Li, Xiang Cao, Katherine Everitt, Morgan Dixon, and James A. Landay. 2010. FrameWire: a tool for automatically extracting interaction logic from paper prototyping tests. In Proc. CHI '10, 503--512.","paperID":"None"},{"content":"Henry Lieberman and Christopher Fry. 1995. Bridging the gulf between code and behavior in programming. In Proc. CHI '95, 480--486.","paperID":"None"},{"content":"James Lin and James A. Landay. 2008. Employing patterns and layers for early-stage design and prototyping of cross-device user interfaces. In Proc. CHI '08, 1313--1322.","paperID":"None"},{"content":"Microsoft Inc. HoloLens. 2015. https://www.microsoft.com/microsoft-hololens/","paperID":"None"},{"content":"Brad Myers, Scott E. Hudson, and Randy Pausch. 2000. Past, present, and future of user interface software tools. ACM Trans. Comput.-Hum. Interact. 7, 1, 3--","paperID":"None"},{"content":"Michael Nebeling, Theano Mintsi, Maria Husmann, and Moira Norrie. 2014. Interactive development of cross-device user interfaces. In Proc. CHI '14, 2793--2802.","paperID":"None"},{"content":"Donald A. Norman and Stephen W. Draper. 1986. User Centered System Design; New Perspectives on Human-Computer Interaction. L. Erlbaum Assoc. Inc., Hillsdale, NJ, USA.","paperID":"None"},{"content":"Stephen Oney and Joel Brandt. 2012. Codelets: linking interactive documentation and example code in the editor. In Proc. CHI '12, 2697--2706.","paperID":"None"},{"content":"Roman Rädle, Hans-Christian Jetter, Mario Schreiner, Zhihao Lu, Harald Reiterer, and Yvonne Rogers. 2015. Spatially-aware or Spatially-agnostic?: Elicitation and Evaluation of User-Defined Cross-Device Interactions. In Proc. CHI '15, 3913--3922.","paperID":"None"},{"content":"Daniel Ritchie, Ankita Arvind Kejriwal, and Scott R. Klemmer. 2011. d.tour: style-based exploration of design example galleries. In Proc. UIST '11, 165--174.","paperID":"None"},{"content":"Sifteo Inc. Sifteo Cubes. 2015. https://www.sifteo.com/","paperID":"None"},{"content":"Michael Toomim, Andrew Begel, and Susan L. Graham. 2004. Managing Duplicated Code with Linked Editing. In Proc. VLHCC '04: the 2004 IEEE Symposium on Visual Languages - Human Centric Computing, 173--180.","paperID":"None"},{"content":"Khai N. Truong, Gillian R. Hayes, and Gregory D. Abowd. 2006. Storyboarding: an empirical determination of best practices and effective guidelines. In Proc. DIS '06, 12--21.","paperID":"None"},{"content":"Jishuo Yang and Daniel Wigdor. 2014. Panelrama: enabling easy specification of cross-device web applications. In Proc. CHI '14, 2783--2792.","paperID":"None"},{"content":"Mark Weiser. 1981. Program slicing. In Proc. ICSE '81: the 5th International Conference on Software engineering, 439--449.","paperID":"None"}],"abstract":"Cross-device interactions involve input and output on multiple computing devices. Implementing and reasoning about interactions that cover multiple devices with a diversity of form factors and capabilities can be complex. To assist developers in programming cross-device interactions, we created DemoScript, a technique that automatically analyzes a cross-device interaction program while it is being written. DemoScript visually illustrates the step-by-step execution of a selected portion or the entire program with a novel, automatically generated cross-device storyboard visualization. In addition to helping developers understand the behavior of the program, DemoScript also allows developers to revise their program by interactively manipulating the cross-device storyboard. We evaluated DemoScript with 8 professional programmers and found that DemoScript significantly improved development efficiency by helping developers interpret and manage cross-device interaction; it also encourages testing to think through the script in a development process.","title":"Enhancing Cross-Device Interaction Scripting with Interactive Illustrations","filename":"CHI16/p5482","authors":["Pei-Yu (Peggy) Chi","Yang Li","Björn Hartmann"],"conference":"CHI '16"}