{"paperId":2858267,"citation":[],"abstract":"To prevent unauthorized parties from accessing data stored on their smartphones, users have the option of enabling a \"lock screen\" that requires a secret code (e.g., PIN, drawing a pattern, or biometric) to gain access to their devices. We present a detailed analysis of the smartphone locking mechanisms currently available to billions of smartphone users worldwide. Through a month-long field study, we logged events from a panel of users with instrumented smartphones (N=134). We are able to show how existing lock screen mechanisms provide users with distinct tradeoffs between usability (unlocking speed vs. unlocking frequency) and security. We find that PIN users take longer to enter their codes, but commit fewer errors than pattern users, who unlock more frequently and are very prone to errors. Overall, PIN and pattern users spent the same amount of time unlocking their devices on average. Additionally, unlock performance seemed unaffected for users enabling the stealth mode for patterns. Based on our results, we identify areas where device locking mechanisms can be improved to result in fewer human errors -- increasing usability -- while also maintaining security.","reference":[{"content":"Panagiotis Andriotis, Theo Tryfonas, and George Oikonomou. 2014. Complexity Metrics and User Strength Perceptions of the Pattern-Lock Graphical Authentication Method. In Proceedings of the Second International Conference on Human Aspects of Information Security, Privacy, and Trust - Volume 8533. Springer-Verlag NY, Inc., NY, NY, USA, 115-126. DOI: http://dx.doi.org/10.1007/978--3--319-07620--1_11","paperID":"None"},{"content":"Adam J. Aviv, Katherine Gibson, Evan Mossop, Matt Blaze, and Jonathan M. Smith. 2010. Smudge Attacks on Smartphone Touch Screens. In Proceedings of the 4th USENIX Conference on Offensive Technologies (WOOT'10). USENIX Association, Berkeley, CA, USA, 1-7. http: //dl.acm.org/citation.cfm?id=1925004.1925009","paperID":"None"},{"content":"Adam J. Aviv, Benjamin Sapp, Matt Blaze, and Jonathan M. Smith. 2012. Practicality of Accelerometer Side Channels on Smartphones. In Proceedings of the 28th Annual Computer Security Applications Conference (ACSAC '12). ACM, NY, NY, USA, 41-50. DOI: http://dx.doi.org/10.1145/2420950.2420957","paperID":"None"},{"content":"Chandrasekhar Bhagavatula, Kevin Iacovino, Su Mon Kywe, Lorrie Faith Cranor, and Blase Ur. 2014. Poster: Usability Analysis of Biometric Authentication Systems on Mobile Phones, In Symposium On Usable Privacy and Security Poster (SOUPS 2014). SOUPS Poster (2014).","paperID":"None"},{"content":"Andrea Bianchi, Ian Oakley, Vassilis Kostakos, and Dong Soo Kwon. 2011. The Phone Lock: Audio and Haptic Shoulder-surfing Resistant PIN Entry Methods for Mobile Devices. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, NY, NY, USA, 197-200. DOI: http://dx.doi.org/10.1145/1935701.1935740","paperID":"None"},{"content":"Joseph Bonneau, Sören Preibusch, and Ross Anderson. 2012. A Birthday Present Every Eleven Wallets? The Security of Customer-Chosen Banking PINs. In Financial Cryptography and Data Security, Angelos D. Keromytis (Ed.). Lecture Notes in Computer Science, Vol. 7397. Springer Berlin Heidelberg, 25-40. DOI: http://dx.doi.org/10.1007/978--3--642--32946--3_3","paperID":"None"},{"content":"Alexander De Luca, Alina Hang, Frederik Brudy, Christian Lindner, and Heinrich Hussmann. 2012. Touch Me Once and I Know It's You!: Implicit Authentication Based on Touch Screen Patterns. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 987-996. DOI: http://dx.doi.org/10.1145/2207676.2208544","paperID":"None"},{"content":"Alexander De Luca, Alina Hang, Emanuel von Zezschwitz, and Heinrich Hussmann. 2015. I Feel Like I'm Taking Selfies All Day!: Towards Understanding Biometric Authentication on Smartphones. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1411-1414. DOI: http://dx.doi.org/10.1145/2702123.2702141","paperID":"None"},{"content":"Alexander De Luca, Marian Harbach, Emanuel von Zezschwitz, Max-Emanuel Maurer, Bernhard Ewald Slawik, Heinrich Hussmann, and Matthew Smith. 2014. Now You See Me, Now You Don't: Protecting Smartphone Authentication from Shoulder Surfers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2937-2946. DOI: http://dx.doi.org/10.1145/2556288.2557097","paperID":"None"},{"content":"Serge Egelman, Sakshi Jain, Rebecca S. Portnoff, Kerwell Liao, Sunny Consolvo, and David Wagner. 2014. Are You Ready to Lock? Understanding user motivations for smartphone locking behaviors. In Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security (CCS '14). ACM, NY, NY, USA, 750-761. DOI: http://dx.doi.org/10.1145/2660267.2660273","paperID":"None"},{"content":"Rainhard D. Findling and Rene Mayrhofer. 2013. Towards Secure Personal Device Unlock Using Stereo Camera Pan Shots. In Computer Aided Systems Theory EUROCAST 2013, Roberto Moreno-Daz, Franz Pichler, and Alexis Quesada-Arencibia (Eds.). Lecture Notes in Computer Science, Vol. 8112. Springer Berlin Heidelberg, 417-425. DOI: http://dx.doi.org/10.1007/978--3--642--53862--9_53","paperID":"None"},{"content":"Marian Harbach, Emanuel von Zezschwitz, Andreas Fichtner, Alexander De Luca, and Matthew Smith. 2014. It's a Hard Lock Life: A Field Study of Smartphone (Un)Locking Behavior and Risk Perception. In Symposium On Usable Privacy and Security (SOUPS 2014). USENIX Association, Menlo Park, CA, 213-230. https://www.usenix.org/conference/ soups2014/proceedings/presentation/harbach","paperID":"None"},{"content":"Eiji Hayashi, Sauvik Das, Shahriyar Amini, Jason Hong, and Ian Oakley. 2013. CASA: Context-aware Scalable Authentication. In Proceedings of the Ninth Symposium on Usable Privacy and Security (SOUPS '13). ACM, NY, NY, USA, Article 3, 10 pages. DOI: http://dx.doi.org/10.1145/2501604.2501607","paperID":"None"},{"content":"Sung-Hwan Kim, Jong-Woo Kim, Seon-Yeong Kim, and Hwan-Gue Cho. 2011. A New Shoulder-surfing Resistant Password for Mobile Environments. In Proceedings of the 5th International Conference on Ubiquitous Information Management and Communication (ICUIMC '11). ACM, NY, NY, USA, Article 27, 8 pages. DOI: http://dx.doi.org/10.1145/1968613.1968647","paperID":"None"},{"content":"Anandatirtha Nandugudi, Anudipa Maiti, Taeyeon Ki, Fatih Bulut, Murat Demirbas, Tevfik Kosar, Chunming Qiao, Steven Y. Ko, and Geoffrey Challen. 2013. PhoneLab: A Large Programmable Smartphone Testbed. In Proceedings of First International Workshop on Sensing and Big Data Mining (SENSEMINE'13). ACM, NY, NY, USA, Article 4, 6 pages. DOI: http://dx.doi.org/10.1145/2536714.2536718","paperID":"None"},{"content":"Stuart Schechter and Joseph Bonneau. 2015. Learning Assigned Secrets for Unlocking Mobile Devices. In Eleventh Symposium On Usable Privacy and Security (SOUPS 2015). USENIX Association, Ottawa, 277-295. https://www.usenix.org/conference/soups2015/ proceedings/presentation/schechter","paperID":"None"},{"content":"Hanul Sieger, Niklas Kirschnick, and Sebastian Moller. 2010. Poster: User preferences for biometric authentication methods and graded security on mobile phones, In Symposium On Usable Privacy and Security Poster (SOUPS 2010). SOUPS Poster (2010).","paperID":"None"},{"content":"Laurent Simon and Ross Anderson. 2013. PIN Skimmer: Inferring PINs Through the Camera and Microphone. In Proceedings of the Third ACM Workshop on Security and Privacy in Smartphones & Mobile Devices (SPSM '13). ACM, NY, NY, USA, 67-78. DOI: http://dx.doi.org/10.1145/2516760.2516770","paperID":"None"},{"content":"Tetsuji Takada and Yuki Kokubun. 2013. Extended PIN Authentication Scheme Allowing Multi-Touch Key Input. In Proceedings of International Conference on Advances in Mobile Computing & Multimedia (MoMM '13). ACM, NY, NY, USA, Article 307, 4 pages. DOI:http://dx.doi.org/10.1145/2536853.2536944","paperID":"None"},{"content":"Sebastian Uellenbeck, Markus Durmuth, Christopher Wolf, and Thorsten Holz. 2013. Quantifying the Security of Graphical Passwords: The Case of Android Unlock Patterns. In Proceedings of the 2013 ACM SIGSAC Conference on Computer & Communications Security (CCS '13). ACM, NY, NY, USA, 161-172. DOI: http://dx.doi.org/10.1145/2508859.2516700","paperID":"None"},{"content":"Emanuel von Zezschwitz, Alexander De Luca, Bruno Brunkow, and Heinrich Hussmann. 2015a. SwiPIN: Fast and Secure PIN-Entry on Smartphones. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1403-1406. DOI: http://dx.doi.org/10.1145/2702123.2702212","paperID":"None"},{"content":"Emanuel von Zezschwitz, Alexander De Luca, Philipp Janssen, and Heinrich Hussmann. 2015b. Easy to Draw, but Hard to Trace?: On the Observability of Grid-based (Un)Lock Patterns. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2339-2342. DOI: http://dx.doi.org/10.1145/2702123.2702202","paperID":"None"},{"content":"Emanuel von Zezschwitz, Paul Dunphy, and Alexander De Luca. 2013. Patterns in the Wild: A Field Study of the Usability of Pattern and Pin-based Authentication on Mobile Devices. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, NY, NY, USA, 261-270. DOI:http://dx.doi.org/10.1145/2493190.2493231","paperID":"None"},{"content":"Nan Zheng, Kun Bai, Hai Huang, and Haining Wang. 2014. You Are How You Touch: User Verification on Smartphones via Tapping Behaviors. In Proceedings of the 2014 IEEE 22nd International Conference on Network Protocols (ICNP '14). IEEE Computer Society, Washington, DC, USA, 221-232. DOI: http://dx.doi.org/10.1109/ICNP.2014.43","paperID":"None"}],"title":"The Anatomy of Smartphone Unlocking: A Field Study of Android Lock Screens","filename":"CHI16/p4806","authors":["Marian Harbach","Alexander De Luca","Serge Egelman"],"conference":"CHI '16"}