{"paperId":2858278,"citation":[],"abstract":"Prior work shows that setting limits on young children's screen time is conducive to healthy development but can be a challenge for families. We investigate children's (age 1 - 5) transitions to and from screen-based activities to understand the boundaries families have set and their experiences living within them. We report on interviews with 27 parents and a diary study with a separate 28 families examining these transitions. These families turn on screens primarily to facilitate parents' independent activities. Parents feel this is appropriate but self-audit and express hesitation, as they feel they are benefiting from an activity that can be detrimental to their child's well-being. We found that families turn off screens when parents are ready to give their child their full attention and technology presents a natural stopping point. Transitioning away from screens is often painful, and predictive factors determine the pain of a transition. Technology-mediated transitions are significantly more successful than parent-mediated transitions, suggesting that the design community has the power to make this experience better for parents and children by creating technologies that facilitate boundary-setting and respect families' self-defined limits.","reference":[{"content":"Leena Alanen and Berry Mayall. 2001. Conceptualizing Child-adult Relations. Psychology Press.","paperID":"None"},{"content":"American Academy of Pediatrics. 2014. Where We Stand: TV Viewing Time. Healthy Children. Retrieved from http://www.healthychildren.org/English/familylife/Media/Pages/Where-We-Stand-TV-ViewingTime.aspx","paperID":"None"},{"content":"American Academy of Pediatrics. 2015. Tips to keep your child healthy. Healthy Children. Retrieved from https://www.healthychildren.org/English/healthyliving/growing-healthy/Pages/assessment.aspx","paperID":"None"},{"content":"Ari Brown, Donald L. Shifrin, and David L. Hill. 2015. Beyond \"turn it off\": How to advise families on media use. AAP News 36, 10, 54. http://doi.org/10.1542/aapnews.20153610--54","paperID":"None"},{"content":"Carl R. Bybee, Danny Robinson, and Joseph Turow. 1982. Determinants of parental guidance of children's television viewing for a special subgroup: Mass media scholars. Journal of Broadcasting 26, 3, 697--710. http://doi.org/10.1080/08838158209364038","paperID":"None"},{"content":"Sandra L. Calvert. 1999. Children's journeys through the information age. McGraw-Hill series in developmental psychology.","paperID":"None"},{"content":"Eve V Clark. 2009. First language acquisition. Cambridge University Press.","paperID":"None"},{"content":"Brian Coates, H. Ellison Pusser, and Irene Goodman. 1976. The influence of \"Sesame Street\" and \"Mister Rogers' Neighborhood\" on children's social behavior in preschool. Child Development 47, 138--144.","paperID":"None"},{"content":"Catherine A Cote, Rachel H Thompson, and Paige M McKerchar. 2005. The effects of antecedent interventions and extinction on toddlers' compliance during transitions. Journal of applied behavior analysis 38, 2, 235--238.","paperID":"None"},{"content":"Aimee Dorr, Peter Kovaric, and Catherine Doubleday. 1989. Parent-child coviewing of television. Journal of Broadcasting & Electronic Media 33, 1, 35--51. http://doi.org/10.1080/08838158909364060","paperID":"None"},{"content":"Jóhanna Einarsdóttir. 2007. Research with children: methodological and ethical challenges. European Early Childhood Education Research Journal 15, 2, 197--211. http://doi.org/10.1080/13502930701321477","paperID":"None"},{"content":"Y. Fujioka and E. W. Austin. 2002. The Relationship of Family Communication Patterns to Parental Mediation Styles. Communication Research 29, 6, 642--665. http://doi.org/10.1177/009365002237830","paperID":"None"},{"content":"Jeanne B Funk, Jason Brouwer, Kathleen Curtiss, and Evan McBroom. 2009. Parents of preschoolers: expert media recommendations and ratings knowledge, media-effects beliefs, and monitoring practices. Pediatrics 123, 3, 981--8. http://doi.org/10.1542/peds.2008--1543","paperID":"None"},{"content":"Lesley Gallacher. 2006. \"The terrible twos\": Gaining control in the nursery? Children's Geographies. 3, 2, 243--264.","paperID":"None"},{"content":"Michelle M Garrison, Kimberly Liekweg, and Dimitri A Christakis. 2011. Media use and child sleep: the impact of content, timing, and environment. Pediatrics 128, 1, 29--35.","paperID":"None"},{"content":"Douglas A Gentile, Rachel A Reimer, Amy I Nathanson, David A Walsh, and Joey C Eisenmann. 2014. Protective effects of parental monitoring of children's media use: a prospective study. JAMA pediatrics 168, 5, 479--84. http://doi.org/10.1001/jamapediatrics.2014.146","paperID":"None"},{"content":"Douglas A. Gentile and David A. Walsh. 2002. A normative study of family media habits. Journal of Applied Developmental Psychology 23, 2, 157--178.","paperID":"None"},{"content":"Yasmeen Hashish, Andrea Bunt, and James E Young. 2014. Involving Children in Content Control: A Collaborative and Education-oriented Content Filtering Approach. CHI '14, ACM, 1797--1806. http://doi.org/10.1145/2556288.2557128","paperID":"None"},{"content":"H Hendershot. 2002. Great expectations: The rise and fall of the V-Chip. Television Quarterly.","paperID":"None"},{"content":"Juan Pablo Hourcade, Sarah L. Mascher, David Wu, and Luiza Pantoja. 2015. Look, My Baby Is Using an iPad! An Analysis of YouTube Videos of Infants and Toddlers Using Tablets. CHI '15, ACM Press, 1915--1924. http://doi.org/10.1145/2702123.2702266","paperID":"None"},{"content":"Hsiu-Fang Hsieh and Sarah E Shannon. 2005. Three approaches to qualitative content analysis. Qualitative health research 15, 9, 1277--88. http://doi.org/10.1177/1049732305276687","paperID":"None"},{"content":"Brittany Huber, Joanne Tarasuik, Mariana N. Antoniou, Chelsee Garrett, Steven J. Bowe, and Jordy Kaufman. 2016. Young children's transfer of learning from a touchscreen device. Computers in Human Behavior 56, 56--64. http://doi.org/10.1016/j.chb.2015.11.010","paperID":"None"},{"content":"Aletha C. Huston, John C. Wright, Mabel L. Rice, Dennis Kerkman, and Michelle St. Peters. 1990. Development of television viewing patterns in early childhood: A longitudinal investigation. 26, 3, 409420.","paperID":"None"},{"content":"Janne J. Jensen and Mikael B. Skov. 2005. A review of research methods in children's technology design. IDC '05, 80--87. http://doi.org/10.1145/1109540.1109551","paperID":"None"},{"content":"Claire B. Kopp. 1992. Emotional distress and control in young children. New Directions for Child and Adolescent Development 1992, 55, 41--56. http://doi.org/10.1002/cd.23219925505","paperID":"None"},{"content":"Leon Kuczynski, Grazyna Kochanska, Marian Radke-Yarrow, and Ona Girnius-Brown. 1987. A developmental interpretation of young children's noncompliance. 23, 6, 799--806.","paperID":"None"},{"content":"Leon Kuczynski and Grazyna Kochanska. 1989. Development of children's noncompliance strategies from toddlerhood to age 5.","paperID":"None"},{"content":"Dale Kunkel, Wendy Jo Maynard Farinola, Kirstie Farrar, Edward Donnerstein, Erica Biely, and Lara Zwarun. 2002. Deciphering the V-Chip: An Examination of the Television Industry's Program Rating Judgments. Journal of Communication 52, 1, 112--138. http://doi.org/10.1111/j.14602466.2002.tb02535.x","paperID":"None"},{"content":"Amanda Lenhart. 2012. Cell phone ownership. Retrieved from http://www.pewinternet.org/2012/03/19/cell-phoneownership/","paperID":"None"},{"content":"Carolyn A. Lin and David J. Atkin. 1989. Parental mediation and rulemaking for adolescent use of television and VCRs. Journal of Broadcasting & Electronic Media 33, 1, 53--67. http://doi.org/10.1080/08838158909364061","paperID":"None"},{"content":"Sonia Livingstone and Ellen J. Helsper. 2008. Parental Mediation of Children's Internet Use. Journal of Broadcasting & Electronic Media 52, 4, 581--599. http://doi.org/10.1080/08838150802437396","paperID":"None"},{"content":"Berry Mayall. 2001. Understanding Childhoods':a London study. In: Conceptualizing child-adult relations. Routledge, London, 114--128.","paperID":"None"},{"content":"A. I. Nathanson. 1999. Identifying and Explaining the Relationship Between Parental Mediation and Children's Aggression. Communication Research 26, 124--143. http://doi.org/10.1177/009365099026002002","paperID":"None"},{"content":"Amy I. Nathanson. 2001. Parent and Child Perspectives on the Presence and Meaning of Parental Television Mediation. Journal of Broadcasting & Electronic Media 45, 2, 201--220. http://doi.org/10.1207/s15506878jobem4502_1","paperID":"None"},{"content":"Amy I. Nathanson. 2002. The Unintended Effects of Parental Mediation of Television on Adolescents. Media Psychology 4, 3, 207--230. http://doi.org/10.1207/S1532785XMEP0403_01","paperID":"None"},{"content":"M. M. Neumann and D. L. Neumann. 2015. The use of touch-screen tablets at home and pre-school to foster emergent literacy. Journal of Early Childhood Literacy, 1468798415619773. http://doi.org/10.1177/1468798415619773","paperID":"None"},{"content":"Mabel L. Rice, Aletha C. Huston, Rosemarie Truglio, and John C. Wright. 1990. Words from \"Sesame Street\": Learning vocabulary while viewing. Developmental Psychology 26, 421--428.","paperID":"None"},{"content":"Karen Schneider-Rosen and Melodie Wenz-Gross. 1990. Patterns of Compliance from Eighteen to Thirty Months of Age. Child Development 61, 1, 104--112. http://doi.org/10.1111/j.14678624.1990.tb02764.x","paperID":"None"},{"content":"Carly Shuler, Zachary Levine, and Jinny Ree. 2012. iLearn II: An analysis of the education category of Apple's app store. NY: The Joan Ganz Cooney Center at Sesame Workshop.","paperID":"None"},{"content":"Aric Sigman. 2012. Time for a view on screen time. Archives of disease in childhood 97, 11, 935--42. http://doi.org/10.1136/archdischild-2012--302196","paperID":"None"},{"content":"Victor C Strasburger. 2010. Media education. Pediatrics 126, 5, 1012--7. http://doi.org/10.1542/peds.2010-1636","paperID":"None"},{"content":"Lori Takeuchi, Reed Stevens, and others. 2011. The new coviewing: Designing for learning through joint media engagement. NY, NY: The Joan Ganz Cooney Center at Sesame Workshop.","paperID":"None"},{"content":"Darcy A Thompson, Sarah Polk, Charissa S L Cheah, et al. 2015. Maternal Beliefs and Parenting Practices Regarding Their Preschool Child's Television Viewing: An Exploration in a Sample of Low-Income Mexican-Origin Mothers. Clinical pediatrics 54, 9, 862--70. http://doi.org/10.1177/0009922815574074","paperID":"None"},{"content":"Patti M Valkenburg, Marina Krcmar, Allerd L Peeters, and Nies M Marseille. 1999. Developing A Scale to Assess Three Styles of Television Mediation: \"Instructive Mediation,\" \"Restrictive Mediation,\" and \"Social Coviewing.\" Journal of Broadcasting & Electronic Media 43, 1, 52--66. http://doi.org/10.1080/08838159909364474","paperID":"None"},{"content":"E. A. Vandewater. 2005. \"No--You Can't Watch That\": Parental Rules and Young Children's Media Use. American Behavioral Scientist 48, 5, 608--623. http://doi.org/10.1177/0002764204271497","paperID":"None"},{"content":"Ron Warren. 2003. Parental Mediation of Preschool Children's Television Viewing. Journal of Broadcasting & Electronic Media 47, 3, 394--417. http://doi.org/10.1207/s15506878jobem4703","paperID":"None"},{"content":"Barbara J. Wilson. 2008. Media and children's aggression, fear, and altruism. Future of Children 18, 1, 87--118.","paperID":"None"},{"content":"Cynthia Sau Ting Wu, Cathrine Fowler, Winsome Yuk Yin Lam, Ho Ting Wong, Charmaine Hei Man Wong, and Alice Yuen Loke. 2014. Parenting approaches and digital technology use of preschool age children in a Chinese community. Italian journal of pediatrics 40, 1, 1--8.","paperID":"None"},{"content":"Nicola Yuill, Yvonne Rogers, and Jochen Rick. 2013. Pass the iPad: collaborative creating and sharing in family groups. CHI '13, 941--950. http://doi.org/10.1145/2470654.2466120","paperID":"None"},{"content":"Frederick J Zimmerman and Dimitri A Christakis. 2007. Associations between content types of early media exposure and subsequent attentional problems. Pediatrics 120, 5, 986--992.","paperID":"None"},{"content":"2008. International Handbook of Children, Media and Culture. SAGE Publications.","paperID":"None"},{"content":"2013. Zero to eight: Children's media use in America 2013. A Common Sense Media research study, 1--31. Retrieved from https://www.commonsensemedia.org/research/zeroto-eight-childrens-media-use-in-america-2013","paperID":"None"},{"content":"2013. United States Census Bureau. QuickFacts. Retrieved from http://www.census.gov/quickfacts/table/INC110213 /53033,00","paperID":"None"}],"title":"Screen Time Tantrums: How Families Manage Screen Media Experiences for Toddlers and Preschoolers","filename":"CHI16/p648","authors":["Alexis Hiniker","Hyewon Suh","Sabina Cao","Julie A. Kientz"],"conference":"CHI '16"}