{"paperId":2858272,"citation":[],"abstract":"This research measures human performance in inferring the functional types (i.e., home, work, leisure and transport) of locations in geo-location data using different visual representations of the data (textual, static and animated visualizations) along with different amounts of data (1, 3 or 5 day(s)). We first collected real life geo-location data from tweets. We then asked the data owners to tag their location points, resulting in ground truth data. Using this dataset we conducted an empirical study involving 45 participants to analyze how accurately they could infer the functional location of the original data owners under different conditions, i.e., three data representations, three data densities and four location types. The study results indicate that while visual techniques perform better than textual ones, the functional locations of human activities can be inferred with a relatively high accuracy even using only textual representations and a low density of location points. Workplace was more easily inferred than home while transport was the functional location with the highest accuracy. Our results also showed that it was easier to infer functional locations from data exhibiting more stable and consistent mobility patterns, which are thus more vulnerable to privacy disclosures. We discuss the implications of our findings in the context of privacy preservation and provide guidelines to users and companies to help preserve and safeguard people's privacy.","reference":[{"content":"S. Ahern, M. Naaman, R. Nair, and J. H. Yang. 2007. World Explorer: Visualizing Aggregate Data from Unstructured Text in Geo-referenced Collections. In Proc. of ACM/IEEE JCDL. 1--10.","paperID":"None"},{"content":"G. Andrienko, N. Andrienko, H. Bosch, T. Ertl, G. Fuchs, P. Jankowski, and D. Thom. 2013. Thematic Patterns in Georeferenced Tweets through Space-Time Visual Analytics. Computing in Science & Engineering 15, 3 (2013), 72--82.","paperID":"None"},{"content":"G. Andrienko, N. Andrienko, C. Hurter, S. Rinzivillo, and S. Wrobel. 2011. From movement tracks through events to places: Extracting and characterizing significant places from mobility data. In Proc. of IEEE VAST. 161--170.","paperID":"None"},{"content":"N. Andrienko, G. Andrienko, G. Fuchs, and P. Jankowski. 2015. Scalable and Privacy-respectful Interactive Discovery of Place Semantics from Human Mobility Traces. Information Visualization (2015).","paperID":"None"},{"content":"R. Balebako, J. Jung, W. Lu, L. F. Cranor, and C. Nguyen. 2013. \"Little Brothers Watching You\": Raising Awareness of Data Leaks on Smartphones. In Proc. of ACM SOUPS. 1--11.","paperID":"None"},{"content":"M. Bostock, V. Ogievetsky, and J. Heer. 2011. D3: Data-Driven Documents. IEEE Trans. Visualization & Comp. Graphics 17, 12 (Dec 2011), 2301--2309.","paperID":"None"},{"content":"I. Boyandin, E. Bertini, P. Bak, and D. Lalanne. 2011. Flowstrates: An Approach for Visual Exploration of Temporal Origin-destination Data. In Proc. of EuroVis. 971--980.","paperID":"None"},{"content":"J. Chae, Y. Cui, Y. Jang, G. Wang, A. Malik, and D. S. Ebert. 2015. Trajectory-based Visual Analytics for Anomalous Human Movement Analysis using Social Media. In IEEE EuroVis Workshop on Visual Analytics, E. Bertini and J. C. Roberts (Eds.).","paperID":"None"},{"content":"J. Chae, D. Thom, H. Bosch, Y. Jang, R. Maciejewski, D.S. Ebert, and T. Ertl. 2012. Spatiotemporal social media analytics for abnormal event detection and examination using seasonal-trend decomposition. In Proc. IEEE of VAST. 143--152.","paperID":"None"},{"content":"J. Chae, D. Thom, Y. Jang, S.Y. Kim, T. Ertl, and D.S. Ebert. 2014. Public behavior response analysis in disaster events utilizing visual analytics of microblog data. Computers & Graphics 38 (2014), 51--60.","paperID":"None"},{"content":"Y.-A. de Montjoye, C. A. Hidalgo, M. Verleysen, and V. D. Blondel. 2013. Unique in the Crowd: The privacy bounds of human mobility. Scientific Reports 3, 1376 (2013).","paperID":"None"},{"content":"S. Dredge. 2014. Tinder dating app was sharing more of users' location data than they realised. The Guardian (20th February 2014).","paperID":"None"},{"content":"N. Eagle, A. Pentland, and D. Lazer. 2009. Inferring friendship network structure by using mobile phone data. Proc. of National Academy of Sciences 106, 36 (2009), 15274--15278.","paperID":"None"},{"content":"S. Eubank, H. Guclu, V. S. A. Kumar, M. V. Marathe, A. Srinivasan, Z. Toroczkai, and N. Wang. 2004. Modelling disease outbreaks in realistic urban social networks. Nature 429 (May 2004), 180--184.","paperID":"None"},{"content":"D. Fisher. 2010. Animation for Visualization: Opportunities and Drawbacks. O'Reilly Media, Chapter 19, 329--352.","paperID":"None"},{"content":"G. Fuchs, G. Andrienko, N. Andrienko, and P. Jankowski. 2013. Extracting Personal Behavioral Patterns from Geo-Referenced Tweets. In AGILE Conf. on Geographic Information Science.","paperID":"None"},{"content":"T. Fujisaka, R. Lee, and K. Sumiya. Discovery of User Behavior Patterns from Geo-tagged Micro-blogs. In Proc. of ICUIMC. Article 36, 10 pages.","paperID":"None"},{"content":"L. Gabrielli, S. Rinzivillo, F. Ronzano, and D. Villatoro. 2014. From Tweets to Semantic Trajectories: Mining Anomalous Urban Mobility Patterns. In Citizen in Sensor Networks, Jordi Nin and Daniel Villatoro (Eds.). Lecture Notes in Computer Science, Vol. 8313. 26--35.","paperID":"None"},{"content":"S. Jiang, Jr. J. Ferreira, and M. C. Gonzalez. 2012. Discovering Urban Spatial-temporal Structure from Human Activity Patterns. In Proc. of ACM SIGKDD Int. Workshop UrbComp. 95--102.","paperID":"None"},{"content":"B. Krishnamurthy and C. E. Wills. 2010. On the leakage of personally identifiable information via online social networks. SIGCOMM Comput. Commun. Rev. 40, 1 (Jan 2010), 112--117.","paperID":"None"},{"content":"I. Liccardi, J. Pato, and D. J. Weitzner. 2014. Improving Mobile App Selection through Transparency and Better Permission Analysis. J. of Privacy & Confidentiality: Vol. 5: Iss. 2, Article 1. (2014), 1--55.","paperID":"None"},{"content":"J. Lindqvist, J. Cranshaw, J. Wiese, J. Hong, and J. Zimmerman. 2011. I'm the Mayor of My House: Examining Why People Use Foursquare - A Social-driven Location Sharing Application. In Proc. of ACM CHI. 2409--2418.","paperID":"None"},{"content":"M. Merisavo, J. Vesanen, A. Arponen, S. Kajalo, and Mika R. 2006. The effectiveness of targeted mobile advertising in selling mobile services: An empirical study. Int. J. Mob. Commun. 4, 2 (Jan 2006), 119--127.","paperID":"None"},{"content":"A. Noulas, S. Scellato, C. Mascolo, and M. Pontil. 2011. An Empirical Study of Geographic User Activity Patterns in Foursquare. ICWSM (2011), 570--573.","paperID":"None"},{"content":"T. Parka, Rashmi S., and Gavriel S. 2008. Effective advertising on mobile phones: A literature review and presentation of results from 53 case studies. Behav. Inf. Technol. 27, 5 (Sep 2008), 355--373.","paperID":"None"},{"content":"S. Patil, G. Norcie, A. Kapadia, and A. J. Lee. 2012. Reasons, Rewards, Regrets: Privacy Considerations in Location Sharing As an Interactive Practice. In Proc. of SOUPS. 5:1--5:15.","paperID":"None"},{"content":"D. Phan, L. Xiao, R. Yeh, P. Hanrahan, and T. Winograd. 2005. Flow Map Layout. In Proc. of IEEE INFOVIS. 219--224.","paperID":"None"},{"content":"D. Pierce. 2015. Location is your most critical data and everyone's watching. Wired (27th April 2015).","paperID":"None"},{"content":"T. Pontes, M. Vasconcelos, J. Almeida, P. Kumaraguru, and V. Almeida. 2012. We Know Where You Live: Privacy Characterization of Foursquare Behavior. In Proc. of ACM UbiComp. 898--905.","paperID":"None"},{"content":"D. Quercia, N. Lathia, F. Calabrese, G. Di Lorenzo, and J. Crowcroft. 2010. Recommending Social Events from Mobile Phone Location Data. In Proc. of IEEE Data Mining (ICDM). 971--976.","paperID":"None"},{"content":"R. Rösler and T. Liebig. 2013. Using Data from Location Based Social Networks for Urban Activity Clustering. In Geographic Information Science at the Heart of Europe, Danny Vandenbroucke, Bénédicte Bucher, and Joep Crompvoets (Eds.). Springer Int. Publishing, 55--72.","paperID":"None"},{"content":"A. Sadilek, H. Kautz, and J. P. Bigham. 2013. Modeling the Interplay of People's Location, Interactions, and Social Ties. In Proc. of AAAI IJCAI. 3067--3071.","paperID":"None"},{"content":"A. Sadilek, H. Kautz, and V. Silenzio. 2012. Predicting disease transmission from geotagged micro-blog data.. In Proc. of AAAI Conf. on Artificial Intelligence. 136--142.","paperID":"None"},{"content":"F. Shih and J. Boortz. 2013. Understanding People's Preferences for Disclosing Contextual Information to Smartphone Apps. In Human Aspects of Information Security, Privacy, and Trust (Lecture Notes in Computer Science), L. Marinos and I. Askoxylakis (Eds.), Vol. 8030. Springer, 186--196.","paperID":"None"},{"content":"J. Staiano, N. Oliver, B. Lepri, R. de Oliveira, M. Caraviello, and N. Sebe. 2014. Money Walks: A Human-centric Study on the Economics of Personal Mobile Data. In Proc. of ACM UbiComp. 583--594.","paperID":"None"},{"content":"K. P. Tang, J. I. Hong, and D. P. Siewiorek. 2011. Understanding How Visual Representations of Location Feeds Affect End-user Privacy Concerns. In Proc. of ACM UbiComp. 207--216.","paperID":"None"},{"content":"I. Trestian, S. Ranjan, A. Kuzmanovic, and A. Nucci. 2009. Measuring serendipity: Connecting people, locations and interests in a mobile 3G network. In Proc. of ACM IMC. 267--279.","paperID":"None"},{"content":"J. Tsai, P. G. Kelley, L. F. Cranor, and N. M. Sadeh. 2010. Location Sharing Technologies: Privacy Risks and Controls. J. of Law & Policy for the Information Society 6, 2 (2010), 119--151.","paperID":"None"},{"content":"J. Wood, J. Dykes, and A. Slingsby. 2010. Visualisation of Origins, Destinations and Flows with OD Maps. Cartographic Journal 47, 2 (2010), 117--129.","paperID":"None"},{"content":"H. Xu, H.-H. Teo, B. C. Y. Tan, and R. Agarwal. 2009. The Role of Push-Pull Technology in Privacy Calculus: The Case of Location-Based Services. J. of Management Inf. Syst. 26, 3 (Dec 2009), 135--174.","paperID":"None"},{"content":"C. Zhou, D. Frankowski, P. Ludford, S. Shekhar, and L. Terveen. 2007. Discovering Personally Meaningful Places: An Interactive Clustering Approach. ACM Trans. Inf. Syst. 25, 3 (July 2007), 31.","paperID":"None"}],"title":"I Know Where You Live: Inferring Details of People's Lives by Visualizing Publicly Shared Location Data","filename":"CHI16/p1","authors":["Ilaria Liccardi","Alfie Abdul-Rahman","Min Chen"],"conference":"CHI '16"}