{"paperId":2858186,"reference":[{"content":"Ban Al-Ani, Gloria Mark, Justin Chung, and Jennifer Jones. 2012. The Egyptian blogosphere: a counternarrative of the revolution. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work CSCW '12, ACM Press, 17--26. http://doi.org/10.1145/2145204.2145213","paperID":"None"},{"content":"Ban Al-Ani, Gloria Mark, and Bryan Semaan. 2010. Blogging in a region of conflict: supporting transition to recovery. Proceedings of the 28th international conference on Human factors in computing systems CHI '10, ACM Press, 1069--1078. http://doi.org/10.1145/1753326.1753485","paperID":"None"},{"content":"Harry Chatten Boyte. 2004. Everyday Politics: Reconnecting Citizens and Public Life. University of Pennsylvania Press.","paperID":"None"},{"content":"Juliet Corbin and Anselm Strauss. 2007. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. SAGE Publications.","paperID":"None"},{"content":"Clara Crivellaro, Rob Comber, John Bowers, Peter C. Wright, and Patrick Olivier. 2014. A pool of dreams: facebook, politics and the emergence of a social movement. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 3573--3582. http://doi.org/10.1145/2556288.2557100","paperID":"None"},{"content":"Arlene Daniels. 1987. Invisible Work. Social Problems 34, 5, 403--415.","paperID":"None"},{"content":"Jill P. Dimond, Michaelanne Dye, Daphne Larose, and Amy S. Bruckman. 2013. Hollaback!: the role of storytelling online in a social movement organization. Proceedings of the 2013 conference on Computer supported cooperative work CSCW '13, ACM Press, 477. http://doi.org/10.1145/2441776.2441831","paperID":"None"},{"content":"Y Engeström. 2000. Activity theory as a framework for analyzing and redesigning work. Ergonomics 43, 7, 960--74. http://doi.org/10.1080/001401300409143","paperID":"None"},{"content":"Diana Forsythe. 1999. \"It's Just a Matter of Common Sense\": Ethnography as Invisible Work. Computer Supported Cooperative Work 8, 1--2, 127--145.","paperID":"None"},{"content":"Catherine Grevet, Loren G. Terveen, and Eric Gilbert. 2014. Managing political differences in social media. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14, ACM Press, 1400--1408. http://doi.org/10.1145/2531602.2531676","paperID":"None"},{"content":"Y. Linlin Huang, Kate Starbird, Mania Orand, Stephanie A. Stanek, and Heather T. Pedersen. 2015. Connected Through Crisis: Emotional Proximity and the Spread of Misinformation Online. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15, ACM Press, 969--980. http://doi.org/10.1145/2675133.2675202","paperID":"None"},{"content":"Edwin Hutchins. 1996. Cognition in the Wild. A Bradford Book.","paperID":"None"},{"content":"Gloria Mark, Mossaab Bagdouri, Leysia Palen, James Martin, Ban Al-Ani, and Kenneth Anderson. 2012. Blogs as a collective war diary. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work CSCW '12, ACM Press, 37--46. http://doi.org/10.1145/2145204.2145215","paperID":"None"},{"content":"Andrés Monroy-Hernández, Danah Boyd, Emre Kiciman, Munmun De Choudhury, and Scott Counts. 2013. The new war correspondents: the rise of civic media curation in urban warfare. Proceedings of the 2013 conference on Computer supported cooperative work CSCW '13, ACM Press, 1443--1452. http://doi.org/10.1145/2441776.2441938","paperID":"None"},{"content":"Preeti Mudliar and Nimmi Rangaswamy. 2015. Offline Strangers, Online Friends: Bridging Classroom Gender Segregation with WhatsApp. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 3799--3808. http://doi.org/10.1145/2702123.2702533","paperID":"None"},{"content":"Bonnie A Nardi. 1993. A Small Matter of Programming: Perspectives on End User Computing. MIT Press, Cambridge, Mass.","paperID":"None"},{"content":"Alexandra Olteanu, Sarah Vieweg, and Carlos Castillo. 2015. What to Expect When the Unexpected Happens: Social Media Communications Across Crises. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15, ACM Press, 994--1009. http://doi.org/10.1145/2675133.2675242","paperID":"None"},{"content":"Yan Qu, Chen Huang, Pengyi Zhang, and Jun Zhang. 2011. Microblogging after a major disaster in China: a case study of the 2010 Yushu earthquake. Proceedings of the ACM 2011 conference on Computer supported cooperative work CSCW '11, ACM Press, 25--34. http://doi.org/10.1145/1958824.1958830","paperID":"None"},{"content":"Aleksandra Sarcevic, Leysia Palen, Joanne White, Kate Starbird, Mossaab Bagdouri, and Kenneth Anderson. 2012. \"Beacons of hope\" in decentralized coordination: learning from on-the-ground medical twitters during the 2010 Haiti earthquake. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work CSCW '12, ACM Press, 47--56. http://doi.org/10.1145/2145204.2145217","paperID":"None"},{"content":"Doug Schuler. 2001. Cultivating Society's Civic Intelligence: Patterns for a New \"World Brain.\" Journal of Society, Information and Communication 4, 2.","paperID":"None"},{"content":"Douglas Schuler. 2009. Communities, technology, and civic intelligence. Proceedings of the fourth international conference on Communities and technologies C&T '09, ACM Press, 61--70. http://doi.org/10.1145/1556460.1556470","paperID":"None"},{"content":"Bryan C. Semaan, Scott P. Robertson, Sara Douglas, and Misa Maruyama. 2014. Social media supporting political deliberation across multiple public spheres: towards depolarization. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14, ACM Press, 1409--1421. http://doi.org/10.1145/2531602.2531605","paperID":"None"},{"content":"Bryan Semaan and Gloria Mark. 2011. Technologymediated social arrangements to resolve breakdowns in infrastructure during ongoing disruption. ACM Transactions on Computer-Human Interaction 18, 4, 1--21. http://doi.org/10.1145/2063231.2063235","paperID":"None"},{"content":"Bryan Semaan and Gloria Mark. 2012. \"facebooking\" towards crisis recovery and beyond. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work CSCW '12, ACM Press, 27--36. http://doi.org/10.1145/2145204.2145214","paperID":"None"},{"content":"Irina Shklovski, Leysia Palen, and Jeannette Sutton. 2008. Finding community through information and communication technology in disaster response. Proceedings of the ACM 2008 conference on Computer supported cooperative work CSCW '08, ACM Press, 127--136. http://doi.org/10.1145/1460563.1460584","paperID":"None"},{"content":"David Snow. 2004. Framing Processes, Ideology, and Discursive Fields. In The Blackwell Companion to Social Movements, David Snow, Sarah Soule and Hanspeter Kriesi (eds.). Blackwell Publishers Ltd.","paperID":"None"},{"content":"David Snow. 2008. Elaborating the discursive contexts of framing: discursive fields and spaces. Studies in Symbolic Interaction 30, 3--28.","paperID":"None"},{"content":"Lyn Spillman. 1995. Culture, Social Structure, and Discursive Fields. Current Perspectives in Social Theory 15, 129--54.","paperID":"None"},{"content":"Susan Leigh Star and Anselm Strauss. 1999. Layers of Silence, Arenas of Voice: The Ecology of Visible and Invisible Work. Computer Supported Cooperative Work (CSCW) 8, 1--2, 9--30. http://doi.org/10.1023/A:1008651105359","paperID":"None"},{"content":"Kate Starbird and Leysia Palen. 2011. \"Voluntweeters\": self-organizing by digital volunteers in times of crisis. Proceedings of the 2011 annual conference on Human factors in computing systems CHI '11, ACM Press, 1071--1080. http://doi.org/10.1145/1978942.1979102","paperID":"None"},{"content":"Kate Starbird and Leysia Palen. 2012. (How) will the revolution be retweeted?: information diffusion and the 2011 Egyptian uprising. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work CSCW '12, ACM Press, 7--16. http://doi.org/10.1145/2145204.2145212","paperID":"None"},{"content":"Bogdan State and Lada Adamic. 2015. The Diffusion of Support in an Online Social Movement: Evidence from the Adoption of Equal-Sign Profile Pictures. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15, ACM Press, 1741--1750. http://doi.org/10.1145/2675133.2675290","paperID":"None"},{"content":"Lucy A. Suchman. 1987. Plans and situated actions: the problem of human-machine communication. Cambridge University Press.","paperID":"None"},{"content":"Umbrella Opinion Day. 2015. Umbrella Opinion Day: Individual Survey. Google Drive.","paperID":"None"},{"content":"Kazys Varnelis. 2008. Networked Publics. The MIT Press.","paperID":"None"},{"content":"Vasilis Vlachokyriakos, Rob Comber, Karim Ladha, et al. 2014. PosterVote: expanding the action repertoire for local political activism. Proceedings of the 2014 conference on Designing interactive systems - DIS '14, ACM Press, 795--804. http://doi.org/10.1145/2598510.2598523","paperID":"None"},{"content":"Volker Wulf, Kaoru Misaki, Meryem Atam, David Randall, and Markus Rohde. 2013. \"On the ground\" in Sidi Bouzid: investigating social media use during the tunisian revolution. Proceedings of the 2013 conference on Computer supported cooperative work CSCW '13, ACM Press, 1409--1418. http://doi.org/10.1145/2441776.2441935","paperID":"None"}],"abstract":"While studies of social movements have mostly examined prevalent public discourses, undercurrents' the backstage practices consisting of meaning-making processes, narratives, and situated work-have received less attention. Through a qualitative interview study with sixteen participants, we examine the role of social media in supporting the undercurrents of the Umbrella Movement in Hong Kong. Interviews focused on an intense period of the movement exemplified by sit-in activities inspired by Occupy Wall Street in the USA. Whereas the use of Facebook for public discourse was similar to what has been reported in other studies, we found that an ecology of social media tools such as Facebook, WhatsApp, Telegram, and Google Docs mediated undercurrents that served to ground the public discourse of the movement. We discuss how the undercurrents sustained and developed public discourses in concrete ways.","citation":[],"title":"Mediating the Undercurrents: Using Social Media to Sustain a Social Movement","filename":"CHI16/p3883","authors":["Yong Ming Kow","Yubo Kou","Bryan Semaan","Waikuen Cheng"],"conference":"CHI '16"}