{"paperId":2858467,"citation":[],"reference":[{"content":"Paul Allen and G. William Mercer. 2007. The role of public surveys in measuring program effectiveness and improving road safety. Improving Traffic Safety Culture in the United States, 93.","paperID":"None"},{"content":"Matts-Åke Belin, Per Tillgren, and Evert Vedung. 2012. Vision Zero -- a road safety policy innovation. International journal of injury control and safety promotion 19.2: 171--179.","paperID":"None"},{"content":"Klaus Bengler, Klaus Dietmeyer, Berthold Färber, Markus Maurer, Christoph Stiller, and Hermann Winner. 2014. Three Decades of Driver Assistance Systems: Review and Future Perspectives. Intelligent Transportation Systems Magazine,IEEE 4, October: 6-22.","paperID":"None"},{"content":"Fang Chen, Călin Giubega, Peter Chen, and Minjuan Wang. 2014. Designing an In-Vehicle Advisory System to Support Traffic Awareness. 10th ITS European Congress, Helsinki, Finland, 10th ITS European Congress, 1--12.","paperID":"None"},{"content":"Fang Chen, Minjuan Wang, Xi Chan, and Jiaqi Li. 2012. How Shall We Design the Future Vehicle for Chinese Market. Work: A Journal of Prevention, Assessment and Rehabilitation 41: 4265--4272.","paperID":"None"},{"content":"Lian Duan. 2012. Culture Differences Analysis A Comparison between Chinese Drivers and Swedish Drivers on Driving Behaviors.","paperID":"None"},{"content":"Jason Edwards, James Freeman, David Soole, and Barry Watson. 2014. A framework for conceptualising traffic safety culture. Transportation Research Part F: Traffic Psychology and Behaviour 26: 293--302.","paperID":"None"},{"content":"Johan Fagerlönn, Stefan Lindberg, and Anna Sirkka. 2012. Graded auditory warnings during in-vehicle use: using sound to guide drivers without additional noise. Proceedings of the 4th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, c: 85--90.","paperID":"None"},{"content":"Geert Hofstede, Gert Jan Hofstede, and Michael Minkov. 1997. Cultures and organizations. New York, NY: McGraw Hill.","paperID":"None"},{"content":"Geert Hoftede, Gert Jan Hofstede, and Michael Minkov. 2010. Cultures and organizations: software of the mind: intercultural cooperation and its importance for survival. McGraw-Hill.","paperID":"None"},{"content":"Neale Kinnear, Steve W. Kelly, Stephen Stradling, and James Thomson. 2013. Understanding how drivers learn to anticipate risk on the road: A laboratory experiment of affective anticipation of road hazards. Accident Analysis and Prevention 50: 1025--1033.","paperID":"None"},{"content":"Mary F Lesch, Pei-Luen Patrick Rau, Zhengxuan Zhao, and Chengyi Liu. 2009. A cross-cultural comparison of perceived hazard in response to warning components and configurations: US vs. China. Applied ergonomics 40, 5: 953--6","paperID":"None"},{"content":"Anders Lindgren, Alexander Angelelli, Paul Alvardo Mendoza, and Fang Chen. 2009. Driver behaviour when using an integrated advisory warning display for advanced driver assistance systems. IET Intelligent Transport Systems 3, 4: 390--399.","paperID":"None"},{"content":"Anders Lindgren, Fang Chen, Patrick W Jordan, and Haixin Zhang. 2008. Requirements for the Design of Advanced Driver Assistance Systems - the differences between Swedish and Chinese drivers. International Journal of Design 2, 2: 41--54.","paperID":"None"},{"content":"Lawrence P Lonero. 2007. Finding the next cultural paradigm for road safety. In Improving traffic safety culture in the United States: The journey forward.","paperID":"None"},{"content":"Ingunn Olea Lund and Torbjörn Rundmo. 2009. Cross-cultural comparisons of traffic safety, risk perception, attitudes and behaviour. Safety Science 47, 4: 547--553.","paperID":"None"},{"content":"David Marshall and Minjuan Wang. 2012. Development of an In-Vehicle User Interface for Traffic Information Presentation. Proceedings of the 44th Annual International Nordic Ergonomics and Human Factors Society Conference, Saltsjöbaden, Sweden.","paperID":"None"},{"content":"National Bureau of Statistics of China. 2013. Statistical Communiqué of the People's Republic of China on the 2012 National Economic and Social Development. China.","paperID":"None"},{"content":"Frederik Naujoks and Alexandra Neukum. 2014. Timing of in-vehicle advisory warnings based on cooperative perception. In Proceedings of the Human Factors and Ergonomics Society Europe Chapter Annual Meeting, 193--206.","paperID":"None"},{"content":"Frederik Naujoks and Alexandra Neukum. 2014. Specificity and timing of advisory warnings based on cooperative perception. In Mensch & Computer-Workshop band: 14, 229--238.","paperID":"None"},{"content":"Türker Ozkan, Timo Lajunen, Joannes El Chliaoutakis, Dianne Parker, and Heikki Summala. 2006. Cross-cultural differences in driving skills: a comparison of six countries. Accident; analysis and prevention 38, 5: 1011--8.","paperID":"None"},{"content":"Nash Stanton, Roger Lew, Nolan Boyle, Brian P. Dyre Rowdy J. Hope, and Ernesto A. Bustamante. 2011. An Implementation of a Graded Deceleration Display in Brake Light Warning Systems. Proceedings of the Human Factors and Ergonomics Society Annual Meeting, 55, 1: 1573--1577.","paperID":"None"},{"content":"H Summala. 2007. Towards understanding motivational and emotional factors in driver behaviour: Comfort through satisficing. In Modelling driver behaviour in automotive environments. Springer London, 189--207.","paperID":"None"},{"content":"The Swedish Transport Administration. 2012. Analysis of Road Safety Trends 2011.","paperID":"None"},{"content":"Min Juan Wang, Lian Duan, Jia Xin Wang, et al. 2016. Drive Advisory System?: Will Swedish and Chinese Drivers Appreciate it in the Same Way? International Journal of Engineering and Technology 8, 4: 286.","paperID":"None"},{"content":"MinJuan Wang, Yi Ci Li, and Fang Chen. 2012. How can we design 3D auditory interfaces which enhance traffic safety for Chinese drivers? Proceedings of the 4th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, ACM Press, 77--83.","paperID":"None"},{"content":"Cheng-qiu Xie and Dianne Parker. 2002. A social psychological approach to driving violations in two Chinese cities. Transportation Research Part F Traffic Psychology and Behaviour 5, 4: 293--308.","paperID":"None"},{"content":"K. L. Young, Megan Bayly, and Michael G. Lenné. 2012. Cross-regional in-vehicle information system design: the preferences and comprehension of Australian, US and Chinese drivers. IET Intelligent Transport Systems 6, 1: 36.","paperID":"None"},{"content":"Kristie L Young, Christina M Rudin-Brown, Michael G Lenné, and Amy R Williamson. 2012. The implications of cross-regional differences for the design of In-vehicle Information Systems: A comparison of Australian and Chinese drivers. Applied ergonomics 43, 3: 564--73.","paperID":"None"},{"content":"Wei Zhang, Yueng-Hsiang Huang, Matthias Roetting, Ying Wang, and Hua Wei. 2006. Driver's views and behaviors about safety in China--what do they NOT know about driving? Accident; analysis and prevention 38, 1: 22--7.","paperID":"None"},{"content":"Xujun Zhang, Hongyan Yao, Guoqing Hu, Mengjing Cui, Yue Gu, and Huiyun Xiang. 2013. Basic characteristics of road traffic deaths in china. Iranian journal of public health 42, 1: 7--15.","paperID":"None"}],"abstract":"With an increased number of both cars and drivers in the world, it is of great importance to design well-functioning driver support systems for them, in order to reduce the number of accidents. Despite the fact that the growing markets can be found in Asia, most advisory traffic information systems (ATIS) are designed for, and adapted to, the western market, and its predominant traffic safety cultures (TSCs). However, traffic safety cultures differ between different parts of the world, and this in turn affects how drivers respond to advisory traffic information. In our study, we designed an ATIS to accommodate two different traffic safety cultures. Our findings show that although drivers belonging to both TSCs drove more safely with our ATIS than without, they still responded very differently to it, using it to support their different driving strategies. This implies that the traffic safety culture of the driver cannot be ignored; ATIS designers need to study and understand the TSC they are designing for.","title":"Why and How Traffic Safety Cultures Matter when Designing Advisory Traffic Information Systems","filename":"CHI16/p2808","authors":["MinJuan Wang","Sus Lundgren Lyckvi","Fang Chen"],"conference":"CHI '16"}