{"paperId":2858553,"citation":[],"reference":[{"content":"47% Of Doctors Use Smartphone, Tablet And PC InformationWeek: 2013. http://www.informationweek.com/mobile/47-ofdoctors-use-smartphone-tablet-and-pc/d/did/1111170 Accessed: 2015-09-25","paperID":"None"},{"content":"D. Avrahami, D. Gergle, S.E. Hudson, and S. Kiesler. 2007. Improving the match between callers and receivers: A study on the effect of contextual information on cell phone interruptions. Behaviour & Information Technology 26, 3 (2007), 247--259. http://dx.doi.org/10.1080/01449290500402338","paperID":"None"},{"content":"Jakob E. Bardram and Thomas R. Hansen. 2004. The AWARE architecture: supporting context-mediated social awareness in mobile cooperation. In Proceedings of the 2004 ACM conference on Computer supported cooperative work (CSCW'04), 2004. 192--201. http://dx.doi.org/10.1145/1031607.1031639","paperID":"None"},{"content":"King Beach. 2006. Becoming a bartender: The role of external memory cues in a work-directed educational activity. Applied Cognitive Psychology 7, 3 (2006), 191--204. http://dx.doi.org/10.1002/acp.2350070304","paperID":"None"},{"content":"Hugh Beyer and Karen Holtzblatt. Contextual design. Morgan Kaufmann, San Francisco, Calif., 1998.","paperID":"None"},{"content":"Timothy Bickmore, Daniel Mauer, Francisco Crespo, and Thomas Brown. 2007. Persuasion, Task Interruption and Health Regimen Adherence. Persuasive Technology Lecture Notes in Computer Science 4744 (2007), 1--11. http://dx.doi.org/10.1007/978-3-540-77006-0_1","paperID":"None"},{"content":"Ann Blandford et al. 2014. Strategies for conducting situated studies of technology use in hospitals. Cognition, Technology & Work Cogn Tech Work 17, 4 (2014), 489--502. http://dx.doi.org/10.1007/s10111014-0318-7","paperID":"None"},{"content":"Yunan Chen. 2010. Documenting transitional information in EMR. In Proceedings of the 28th international conference on Human factors in computing systems CHI '10 (2010), 1787--1796. http://dx.doi.org/10.1145/1753326.1753594","paperID":"None"},{"content":"John W. Creswell and Vicki L. Clark. 2007. Designing and conducting mixed methods research, Thousand Oaks, Calif.: SAGE Publications.","paperID":"None"},{"content":"Anind Dey. 2001. Understanding and Using Context. Personal and Ubiquitous Computing 5, 1 (2001), 4--7. http://dx.doi.org/10.1007/s007790170019","paperID":"None"},{"content":"Anind K. Dey, Gregory D. Abowd, and Daniel Salber. 2001. A conceptual framework and a toolkit for supporting the rapid prototyping of context-aware applications. Hum.-Comput. Interact. 16, 2 (December 2001), 97--166. http://dx.doi.org/10.1207/S15327051HCI16234_02","paperID":"None"},{"content":"K.Anders Ericsson. 2004. Deliberate Practice and the Acquisition and Maintenance of Expert Performance in Medicine and Related Domains. Academic Medicine 79, 10 (2004), S70--S81.","paperID":"None"},{"content":"G. Fitzpatrick, T. Mansfield, and S.M. Kaplan. 1996. Locales framework: exploring foundations for collaboration support. In Proceedings Sixth Australian Conference on Computer-Human Interaction (1996), 34--41. http://dx.doi.org/10.1109/OZCHI.1996.559985","paperID":"None"},{"content":"Geraldine Fitzpatrick. 2003. The locales framework: understanding and designing for wicked problems, Dordrecht: Kluwer Academic Publishers.","paperID":"None"},{"content":"James Fogarty, Scott E. Hudson, Christopher G. Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny C. Lee, and Jie Yang. 2005. Predicting human interruptibility with sensors. ACM Trans. Comput.Hum. Interact. 12, 1 (March 2005), 119--146. http://dx.doi.org/10.1145/1057237.1057243","paperID":"None"},{"content":"Tony Gillie and Donald Broadbent. 1989. What makes interruptions disruptive? A study of length, similarity, and complexity. Psychol. Res Psychological Research 50, 4 (1989), 243--250. http://dx.doi.org/10.1007/BF00309260","paperID":"None"},{"content":"Preetinder Gill, Ashwini Kamath, and Tejkaran Singh Gill. 2012. Distraction: an assessment of smartphone usage in health care work settings. Risk Management and Healthcare Policy 5 (2012), 105--114. http://dx.doi.org/10.2147/RMHP.S34813","paperID":"None"},{"content":"Sukeshini Grandhi and Quentin Jones. Conceptualizing Interpersonal Interruption Management: A Theoretical Framework and Research Program. In Proceedings of 42nd Hawaii International Conference on System Sciences, IEEE (2009), 1--10. http://dx.doi.org/10.1109/HICSS.2009.124","paperID":"None"},{"content":"Sukeshini Grandhi and Quentin Jones. 2010. Technology-mediated interruption management. International Journal of Human-Computer Studies 68, 5 (2010), 288--306. http://dx.doi.org/10.1016/j.ijhcs.2009.12.005","paperID":"None"},{"content":"Sukeshini A. Grandhi and Quentin Jones. 2015. Knock, knock! who's there? Putting the user in control of managing interruptions. International Journal of Human-Computer Studies 79 (2015), 35--50. http://dx.doi.org/10.1016/j.ijhcs.2015.02.008","paperID":"None"},{"content":"Saul Greenberg, Geraldine Fitzpatrick, Carl Gutwin, and Simon Kaplan. 2000. Adapting the Locales Framework for Heuristic Evaluation of Groupware. AJIS Australasian Journal of Information Systems 7, 2 (2000), 102--108. http://dx.doi.org/10.3127/ajis.v7i2.267","paperID":"None"},{"content":"Linda Mcgillis Hall, Cheryl Pedersen, and Laura Fairley. 2010. Losing the moment: understanding interruptions to nurses' work. The Journal of Nursing Administration 40, 4 (2010), 169--176. http://dx.doi.org/10.1097/NNA.0b013e3181d41162","paperID":"None"},{"content":"Linda Mcgillis Hall et al. 2010. Going blank: factors contributing to interruptions to nurses' work and related outcomes. Journal of Nursing Management 18, 8 (2010), 1040--1047. http://dx.doi.org/10.1111/j.13652834.2010.01166.x","paperID":"None"},{"content":"Linda Mcgillis Hall et al. 2010. Interruptions and Pediatric Patient Safety. Journal of Pediatric Nursing 25, 3 (2010), 167--175. http://dx.doi.org/10.1016/j.pedn.2008.09.005","paperID":"None"},{"content":"Shameem Hameed, Thomas Ferris, Swapnaa Jayaraman, and Nadine Sarter. 2009. Using Informative Peripheral Visual and Tactile Cues to Support Task and Interruption Management. Human Factors: The Journal of the Human Factors and Ergonomics Society 51, 2 (2009), 126--135. http://dx.doi.org/10.1177/0018720809336434","paperID":"None"},{"content":"Joyce Ho and Stephen S. Intille. 2005. Using contextaware computing to reduce the perceived burden of interruptions from mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 909--918. http://dx.doi.org/10.1145/1054972.1055100","paperID":"None"},{"content":"Jong-Yi Hong, Eui-Ho Suh, and Sung-Jin Kim. 2009. Context-aware systems: A literature review and classification. Expert Systems with Applications 36, 4 (2009), 8509--8522. http://dx.doi.org/10.1016/j.eswa.2008.10.071","paperID":"None"},{"content":"Eric Horvitz, Paul Koch, and Johnson Apacible. 2004. BusyBody: creating and fielding personalized models of the cost of interruption. In Proceedings of the 2004 ACM conference on Computer supported cooperative work (CSCW '04). ACM, New York, NY, USA, 507--510. http://dx.doi.org/10.1145/1031607.1031690","paperID":"None"},{"content":"James M. Hudson, Jim Christensen, Wendy A. Kellogg, and Thomas Erickson. 2002. \"I'd be overwhelmed, but it's just one more thing to do\": availability and interruption in research management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, New York, NY, USA, 97--104. http://dx.doi.org/10.1145/503376.503394","paperID":"None"},{"content":"Shamsi T. Iqbal and Eric Horvitz. 2007. Disruption and recovery of computing tasks: field study, analysis, and directions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 677--686. http://dx.doi.org/10.1145/1240624.1240730","paperID":"None"},{"content":"Quintus R. Jett and Jennifer M. George. 2003. Work interrupted: A closer look at the role of interruptions in organizational life. The Academy of Management Review 28, 3 (2003), 494--507. http://dx.doi.org/10.5465/AMR.2003.10196791","paperID":"None"},{"content":"Simon M. Kaplan and Geraldine Fitzpatrick. 1997. Designing support for remote intensive-care telehealth using the locales framework. In Proceedings of the conference on Designing interactive systems processes, practices, methods, and techniques DIS '97 (1997), 173--184. http://dx.doi.org/10.1145/263552.263604","paperID":"None"},{"content":"Joakim Klemets and Tor Erik Evjemo. 2014. Technology-mediated awareness: Facilitating the handling of (un)wanted interruptions in a hospital setting. International Journal of Medical Informatics 83, 9 (2014), 670--682. http://dx.doi.org/10.1016/j.ijmedinf.2014.06.007","paperID":"None"},{"content":"Linda T. Kohn. 2000. To err is human building a safer health system, Washington, D.C.: National Academy Press.","paperID":"None"},{"content":"Sameer Malhotra, Desmond Jordan, Edward Shortliffe, and Vimla L. Patel. 2007. Workflow modeling in critical care: Piecing together your own puzzle. Journal of Biomedical Informatics 40, 2 (2007), 81--92. http://dx.doi.org/10.1016/j.jbi.2006.06.002","paperID":"None"},{"content":"Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The cost of interrupted work: more speed and stress. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 107--110. http://dx.doi.org/10.1145/1357054.1357072","paperID":"None"},{"content":"D.Scott Mccrickard, C.M. Chewar, Jacob P. Somervell, and Ali Ndiwalana. 2003. A model for notification systems evaluation--assessing user goals for multitasking activity. In Proceedings of ACM Transactions on Computer-Human Interaction (TOCHI'03) 10, 4 (2003), 312--338. http://dx.doi.org/10.1145/966930.966933","paperID":"None"},{"content":"Daniel McFarlane. 2002. Comparison of four primary methods for coordinating the interruption of people in human-computer interaction. Hum.-Comput. Interact. 17, 1 (March 2002), 63--139. http://dx.doi.org/10.1207/S15327051HCI1701_2","paperID":"None"},{"content":"Daniel C. McFarlane and Kara A. Latorella. 2002. The scope and importance of human interruption in humancomputer interaction design. Hum.-Comput. Interact. 17, 1 (March 2002), 1--61. http://dx.doi.org/10.1207/S15327051HCI1701_1","paperID":"None"},{"content":"M.A. Munoz, M. Rodriguez, J. Favela, A.I. MartinezGarcia, and V.M. Gonzalez. 2003. Context-aware mobile communication in hospitals. IEEE Computer Society 36, 9 (2003), 38--46. http://dx.doi.org/10.1109/MC.2003.1231193","paperID":"None"},{"content":"Robert.A. Myers, Mary.C. Mccarthy, Amelia. Whitlatch, and Pratik.J. Parikh. 2015. Differentiating between detrimental and beneficial interruptions: a mixed-methods study. BMJ Quality & Safety (2015). http://dx.doi.org/10.1136/bmjqs-2015-004401","paperID":"None"},{"content":"Antti Oulasvirta and K. Anders Ericsson. 2009. Effects of repetitive practice on interruption costs: an empirical review and theoretical implications. In European Conference on Cognitive Ergonomics: Designing beyond the Product -- Understanding Activity and User Experience in Ubiquitous Environments (ECCE '09), Leena Norros, Hanna Koskinen, Leena Salo, and Paula Savioja (Eds.). VTT Technical Research Centre of Finland, VTT, Finland, Finland, Article 28, 9 pages.","paperID":"None"},{"content":"Shobha Phansalkar et al. 2010. A review of human factors principles for the design and implementation of medication safety alerts in clinical information systems. Journal of the American Medical Informatics Association (2010), 493--501. http://dx.doi.org/10.1136/jamia.2010.005264","paperID":"None"},{"content":"Atish Rajkomar and Ann Blandford. 2012. Understanding infusion administration in the ICU through Distributed Cognition. Journal of Biomedical Informatics 45, 3 (2012), 580--590. http://dx.doi.org/10.1016/j.jbi.2012.02.003","paperID":"None"},{"content":"Madhu C. Reddy, Paul Dourish, and Wanda Pratt. 2001. Coordinating Heterogeneous Work: Information and Representation in Medical Care. In Proceedings of European Conference on Computer-Supported Cooperative Work (ECSCW'01), 2001. 239--258. http://dx.doi.org/10.1007/0-306-48019-0_13","paperID":"None"},{"content":"Madhu C. Reddy, Wanda Pratt, Paul Dourish, and M Shabot. Sociotechnical requirements analysis for clinical systems. Methods of information in medicine. 42, 4 (2002), 437--444.","paperID":"None"},{"content":"Madhu C. Reddy, Paul Dourish, and Wanda Pratt. 2006. Temporality in Medical Work: Time also Matters. In Proceedings of ACM Computer supported cooperative work (CSCW'06) 15, 1 (2006), 29-53. http://dx.doi.org/10.1007/s10606-005-9010-z","paperID":"None"},{"content":"T. J. Robertson, Shrinu Prabhakararao, Margaret Burnett, Curtis Cook, Joseph R. Ruthruff, Laura Beckwith, and Amit Phalgune. 2004. Impact of interruption style on end-user debugging. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 287--294. http://dx.doi.org/10.1145/985692.985729","paperID":"None"},{"content":"Penelope M. Sanderson and Tobias Grundgeiger. 2015. How do interruptions affect clinician performance in healthcare? Negotiating fidelity, control, and potential generalizability in the search for answers. International Journal of Human-Computer Studies 79 (2015), 85--96. http://dx.doi.org/10.1016/j.ijhcs.2014.11.003","paperID":"None"},{"content":"Farzan Sasangohar, Birsen Donmez, Patricia Trbovich, and Anthony C. Easty. 2012. Not All Interruptions are Created Equal: Positive Interruptions in Healthcare. PsycEXTRA Dataset 56, 1 (2012), 824--848. http://dx.doi.org/10.1177/1071181312561172","paperID":"None"},{"content":"Farzan Sasangohar, Birsen Donmez, Anthony C. Easty, and Patricia L. Trbovich. 2015. The relationship between interruption content and interrupted task severity in intensive care nursing: an observational study. International Journal of Nursing Studies 52, 10 (2015), 1573--1581. http://dx.doi.org/10.1016/j.ijnurstu.2015.06.002","paperID":"None"},{"content":"B. Schilit, N. Adams, and R. Want. 1994. ContextAware Computing Applications. In Proceedings of 1994 First Workshop on Mobile Computing Systems and Applications (1994), 85--90. http://dx.doi.org/10.1109/WMCSA.1994.16","paperID":"None"},{"content":"Edie Scott and Napier Alan. Eliciting Functional Requirements for an Aged Care & Rehabilitation eReferral System Using the Locales Framework [online]. In: Coiera, Enrico (Editor); Chu, Stephen (Editor); Simpson, Carmel (Editor). HIC 2003 RACGP12CC [combined conference]: Proceedings. Brunswick East, Vic.: Health Informatics Society of Australia (HISA) ; Royal Australian College of General Practitioners (RACGP), 2003. 52--57.","paperID":"None"},{"content":"Mary Cathryn Sitterding, Marion E. Broome, Linda Q. Everett, and Patricia Ebright. 2012. Understanding Situation Awareness in Nursing Work. Advances in Nursing Science 35, 1 (2012), 77--92. http://dx.doi.org/10.1097/ANS.0b013e3182450158","paperID":"None"},{"content":"Preethi Srinivas, Anthony Faiola, and Babar Khan. 2015. Supporting information management in ICU rounding. A novel mobile system for managing patient-centered notes and action-items. In Proceedings of IEEE Healthcom 2015 (accepted).","paperID":"None"},{"content":"N.A. Stanton, P.R.G. Chambers, and J. Piggott. 2001. Situational awareness and safety. Safety Science 39, 3 (2001), 189--204. http://dx.doi.org/10.1016/S09257535(01)00010--8","paperID":"None"},{"content":"John C. Tang, Nicole Yankelovich, James Begole, Max Van Kleek, Francis Li, and Janak Bhalodia. 2001. ConNexus to awarenex: extending awareness to mobile users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 221--228. http://dx.doi.org/10.1145/365024.365105","paperID":"None"},{"content":"J.Gregory Trafton, Erik M. Altmann, Derek P. Brock, and Farilee E. Mintz. 2003. Preparing to resume an interrupted task: effects of prospective goal encoding and retrospective rehearsal. International Journal of Human-Computer Studies 58, 5 (2003), 583-603. http://dx.doi.org/10.1016/S1071-5819(03)00023--5","paperID":"None"},{"content":"Christina Vasiliou, Andri Ioannou, and Panayiotis Zaphiris. 2015. An Artifact Ecology in a Nutshell: A Distributed Cognition Perspective for Collaboration and Coordination. In Proceedings of Human-Computer Interaction - INTERACT 2015 Lecture Notes in Computer Science 9297 (2015), 55--72. http://dx.doi.org/10.1007/978-3-319-22668-2_5","paperID":"None"},{"content":"Fred R.H. Zijlstra, Robert A. Roe, Anna B. Leonora, and Irene Krediet. 2010. Temporal factors in mental work: Effects of interrupted activities. Journal of Occupational and Organizational Psychology 72, 2 (2010), 163--185. http://dx.doi.org/10.1348/096317999166581","paperID":"None"}],"abstract":"Previous research on reducing unwanted interruptions in hospital intensive care units (ICU) have focused on providing context-aware solutions that consider factors such as location and activity of the person receiving the interruption. We seek to broaden an understanding of how to manage interruptions by using the Locales Framework to analyze data collected from a field study on mobile notification interruptions in the ICU. Based on our data along with previous literature on cognitive theories, mental models, strategies for managing interruptions, and principles of human factors, we propose five guidelines to aid in designing mobile technology interventions for the ICU.","title":"Designing Guidelines for Mobile Health Technology: Managing Notification Interruptions in the ICU","filename":"CHI16/p4502","authors":["Preethi Srinivas","Anthony Faiola","Gloria Mark"],"conference":"CHI '16"}