{"paperId":2858384,"abstract":"Recent research has improved our understanding of how to create strong, memorable text passwords. However, this research has generally been in the context of desktops and laptops, while users are increasingly creating and entering passwords on mobile devices. In this paper we study whether recent password guidance carries over to the mobile setting. We compare the strength and usability of passwords created and used on mobile devices with those created and used on desktops and laptops, while varying password policy requirements and input methods. We find that creating passwords on mobile devices takes significantly longer and is more error prone and frustrating. Passwords created on mobile devices are also weaker, but only against attackers who can make more than 10^13 guesses. We find that the effects of password policies differ between the desktop and mobile environments, and suggest ways to ease password entry for mobile users.","reference":[{"content":"H. Akaike. 1974. A New Look at the Statistical Model Identification. Automatic Control, IEEE Transactions on 19, 6 (1974), 716--723. http://dx.doi.org/doi:10.1109/TAC.1974.1100705","paperID":"None"},{"content":"Patti Bao, Jeffrey Pierce, Stephen Whittaker, and Shumin Zhai. 2011. Smart Phone Use by Non-Mobile Business Users. In Proc. International Conference on Human Computer Interaction with Mobile Devices and Services. http://doi.acm.org/10.1145/2037373.2037440","paperID":"None"},{"content":"BBC. 2015. Ashley Madison: What's in the leaked accounts data dump? (August 2015). http://www.bbc.com/news/technology-33986228","paperID":"None"},{"content":"Chandrasekhar Bhagavatula, Blase Ur, Kevin Iacovino, Su Mon Kywe, Lorrie Faith Cranor, and Marios Savvides. 2015. Biometric Authentication on iPhone and Android: Usability, Perceptions, and Influences on Adoption. In Proc. Network and Distributed Systems Symposium Workshop on Usable Security. http://dx.doi.org/10.14722/usec.2015.23003","paperID":"None"},{"content":"Joseph Bonneau. 2010. The Gawker hack: how a million passwords were lost. (2010). http: //www.lightbluetouchpaper.org/2010/12/15/thegawker-hack-how-a-million-passwords-were-lost/.","paperID":"None"},{"content":"Joseph Bonneau. 2012a. Statistical metrics for individual password strength. In 20th International Workshop on Security Protocols. http://www.jbonneau.com/doc/B12-SPWstatistical_password_strength_metrics.pdf","paperID":"None"},{"content":"Joseph Bonneau. 2012b. The science of guessing: analyzing an anonymized corpus of 70 million passwords. In Proc. IEEE Symposium on Security and Privacy. http://www.jbonneau.com/doc/B12-IEEESPanalyzing_70M_anonymized_passwords.pdf","paperID":"None"},{"content":"Michael Buhrmester, Tracy Kwang, and Samuel D. Gosling. 2011. Amazon's Mechanical Turk: A New Source of Inexpensive, Yet High-Quality, Data Perspectives on Psychological Science 6, 1 (2011), 3--5. http://pps.sagepub.com/content/6/1/3.abstract","paperID":"None"},{"content":"William E. Burr, Donna F. Dodson, and W. Timothy Polk. 2006. Electronic Authentication Guideline. Technical Report. NIST. http://csrc.nist.gov/publications/nistpubs/80063/SP800--63V1_0_2.pdf","paperID":"None"},{"content":"Sonia Chiasson, Paul C van Oorschot, and Robert Biddle. 2006. A Usability Study and Critique of Two Password Managers.. In Proc. USENIX Security Symposium. http: //dl.acm.org/citation.cfm?id=1267336.1267337","paperID":"None"},{"content":"Yiannis Chrysanthou. 2013. Modern Password Cracking: A hands-on approach to creating an optimised and versatile attack. Master's thesis. Royal Holloway, University of London. https://www.ma. rhul.ac.uk/static/techrep/2013/MA-2013-07.pdf","paperID":"None"},{"content":"D. R. Cox. 1972. Regression Models and Life-Tables. Journal of the Royal Statistical Society. Series B (Methodological) 34 (1972), 187--220. http://www.jstor.org/stable/2985181","paperID":"None"},{"content":"Alexander De Luca, Marian Harbach, Emanuel von Zezschwitz, Max-Emanuel Maurer, Bernhard Ewald Slawik, Heinrich Hussmann, and Matthew Smith. 2014. Now You See Me, Now You Don't: Protecting Smartphone Authentication from Shoulder Surfers. In Proc. CHI'14: 32nd Annual ACM Conference on Human Factors in Computing Systems. 10. http://doi.acm.org/10.1145/2556288.2557097","paperID":"None"},{"content":"M. Dell'Amico, P. Michiardi, and Y. Roudier. 2010. Password Strength: An Empirical Analysis. In Proc. INFOCOM. http://dx.doi.org/10.1109/INFCOM.2010.5461951","paperID":"None"},{"content":"Julie S. Downs, Mandy B. Holbrook, Steve Sheng, and Lorrie Faith Cranor. 2010. Are your participants gaming the system? Screening Mechanical Turk workers. In Proc. CHI'10: 28th Annual ACM Conference on Human Factors in Computing Systems. http://doi.acm.org/10.1145/1753326.1753688","paperID":"None"},{"content":"Paul Dunphy, Andreas P. Heiner, and N. Asokan. 2010. A Closer Look at Recognition-based Graphical Passwords on Mobile Devices. In Proc. Symposium on Usable Privacy and Security. Article 3, 12 pages. http://doi.acm.org/10.1145/1837110.1837114","paperID":"None"},{"content":"Sascha Fahl, Marian Harbach, Yasemin Acar, and Matthew Smith. 2013. On the ecological validity of a password study. In Proc. Symposium on Usable Privacy and Security. http://doi.acm.org/10.1145/2501604.2501617","paperID":"None"},{"content":"Adrienne Porter Felt and David Wagner. 2011. Phishing on Mobile Devices. In Proc. Web 2.0 Security & Privacy. http://www.w2spconf.com/2011/papers/feltmobilephishing.pdf","paperID":"None"},{"content":"Dinei Florêncio, Cormac Herley, and Baris Coskun. 2007. Do strong web passwords accomplish anything?. In Proc. USENIX HotSec. http: //dl.acm.org/citation.cfm?id=1361419.1361429","paperID":"None"},{"content":"Megan Geuss. 2015. Mozilla: data stolen from hacked bug database was used to attack Firefox. (Sep 2015). http://arstechnica.com/security/2015/09/ mozilla-data-stolen-from-hacked-bug-databasewas-used-to-attack-firefox/","paperID":"None"},{"content":"Dan Goodin. 2012a. 8 million leaked passwords connected to LinkedIn, dating website. (Jun 2012). http://arstechnica.com/security/2012/06/8million-leaked-passwords-connected-tolinkedin/","paperID":"None"},{"content":"Dan Goodin. 2012b. Why passwords have never been weaker-and crackers have never been stronger. Ars Technica. (August 2012). http://arstechnica.com/ security/2012/08/passwords-under-assault/.","paperID":"None"},{"content":"Dan Goodin. 2015. Once seen as bulletproof, 11 million+ Ashley Madison passwords already cracked. (Sep 2015). http://arstechnica.com/security/2015/09/onceseen-as-bulletproof-11-million-ashley-madisonpasswords-already-cracked/","paperID":"None"},{"content":"Kristen K. Greene, Joshua Franklin, and John Kelsey. 2015. Tap On, Tap Off: Onscreen Keyboards and Mobile Password Entry. http://www.shmoocon.org/speakers#tappedout. (2015). ShmooCon.","paperID":"None"},{"content":"Kristen K. Greene, Melissa A. Gallagher, Brian C. Stanton, and Paul Y. Lee. 2014. I Can't Type That! P@$$w0rd Entry on Mobile Devices. In Proc. Human Computer Interaction International. http://dx.doi.org/10.1007/978--3--319-07620--1_15","paperID":"None"},{"content":"S. M. Taiabul Haque, Matthew Wright, and Shannon Scielzo. 2013. Passwords and interfaces: towards creating stronger passwords by using mobile phone handsets. In Proc. Workshop on Security and Privacy in Smartphones and Mobile Devices at ACM Conference on Computer and Communications Security. http://doi.acm.org/10.1145/2516760.2516767","paperID":"None"},{"content":"Marian Harbach, Emanuel von Zezschwitz, Andreas Fichtner, Alexander De Luca, and Matthew Smith. 2014. It's a Hard Lock Life: A Field Study of Smartphone (Un)Locking Behavior and Risk Perception. In Proc. Symposium On Usable Privacy and Security. https://www.usenix.org/conference/soups2014/ proceedings/presentation/harbach","paperID":"None"},{"content":"Philip Inglesant and M. Angela Sasse. 2010. The True Cost of Unusable Password Policies: Password Use in the Wild. In Proc. CHI'10: 28th Annual ACM Conference on Human Factors in Computing Systems. http://doi.acm.org/10.1145/1753326.1753384","paperID":"None"},{"content":"Markus Jakobsson and Ruj Akavipat. 2012. Rethinking Passwords to Adapt to Constrained Keyboards. In Proc. Mobile Security Technologies. http://www.markus-jakobsson.com/fastwords.pdf","paperID":"None"},{"content":"Ambarish Karole, Nitesh Saxena, and Nicolas Christin. 2011. A Comparative Usability Evaluation of Traditional Password Managers. In Proc. International Conference on Information Security and Cryptology. http: //dl.acm.org/citation.cfm?id=2041036.2041056","paperID":"None"},{"content":"Patrick Gage Kelley, Saranga Komanduri, Michelle L. Mazurek, Rich Shay, Tim Vidas, Lujo Bauer, Nicolas Christin, Lorrie Faith Cranor, and Julio Lopez. 2012. Guess again (and again and again): Measuring password strength by simulating password-cracking algorithms. In Proc. IEEE Symposium on Security and Privacy. http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=6234434","paperID":"None"},{"content":"Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing User Studies With Mechanical Turk. In Proc. CHI'08: 26th Annual ACM Conference on Human Factors in Computing Systems. http://doi.acm.org/10.1145/1357054.1357127","paperID":"None"},{"content":"Saranga Komanduri, Richard Shay, Lorrie Faith Cranor, Cormac Herley, and Stuart Schechter. 2014. Telepathwords: Preventing Weak Passwords by Reading Users' Minds. In Proc. USENIX Security Symposium. https://www.usenix.org/conference/ usenixsecurity14/technicalsessions/presentation/komanduri","paperID":"None"},{"content":"Saranga Komanduri, Richard Shay, Patrick Gage Kelley, Michelle L. Mazurek, Lujo Bauer, Nicolas Christin, Lorrie Faith Cranor, and Serge Egelman. 2011. Of Passwords and People: Measuring the Effect of Password-Composition Policies. In Proc. CHI'11: 29th Annual ACM Conference on Human Factors in Computing Systems. http://doi.acm.org/10.1145/1978942.1979321","paperID":"None"},{"content":"KoreLogic. 2010-. \"Crack Me If You Can\" - DEFCON 2014. http://contest-2013.korelogic.com. (2010-).","paperID":"None"},{"content":"Steve Kovach. 2014. We Still Don't Have Assurance From Apple That iCloud Is Safe. (September 2014). http://www.businessinsider.com/apple-statementon-icloud-hack-2014--9","paperID":"None"},{"content":"Tara Matthews, Jeffrey Pierce, and John Tang. 2009. No Smart Phone is an Island: The Impact of Places, Situations, and Other Devices on Smart Phone Use. In IBM Research Report. http: //domino.research.ibm.com/library/cyberdig.nsf/ papers/F5FD878B5B062ACA85257635004EC3F5/ %24File/rj10452.pdf","paperID":"None"},{"content":"Sergey Maydebura, Dong Hyun Jeong, and Byunggu Yu. 2013. Understanding Environmental Influences on Performing Password-Based Mobile Authentication. In Proc. Information Reuse and Integration. http://dx.doi.org/10.1109/IRI.2013.6642543","paperID":"None"},{"content":"Michelle L. Mazurek, Saranga Komanduri, Timothy Vidas, Lujo Bauer, Nicolas Christin, Lorrie Faith Cranor, Patrick Gage Kelley, Richard Shay, and Blase Ur. 2013. Measuring Password Guessability for an Entire University. In Proc. ACM Conference on Computer and Communication Security. http://doi.acm.org/10.1145/2508859.2516726","paperID":"None"},{"content":"PHDays. 2013. \"Hash Runner\"? Positive Hack Days. http://2013.phdays.com/program/contests/. (2013).","paperID":"None"},{"content":"Ashwini Rao, Birendra Jha, and Gananand Kini. 2013. Effect of Grammar on Security of Long Passwords. In Proc. ACM Conference on Data and Application Security and Privacy. http://doi.acm.org/10.1145/2435349.2435395","paperID":"None"},{"content":"Florian Schaub, Ruben Deyhle, and Michael Weber. 2012. Password Entry Usability and Shoulder Surfing Susceptibility on Different Smartphone Platforms. In Proc. International Conference on Mobile and Ubiquitous Multimedia. Article 13. http://doi.acm.org/10.1145/2406367.2406384","paperID":"None"},{"content":"Roland Schlöglhofer and Johannes Sametinger. 2012. Secure and Usable Authentication on Mobile Devices. In Proc. International Conference on Advances in Mobile Computing & Multimedia. 6. http://doi.acm.org/10.1145/2428955.2429004","paperID":"None"},{"content":"Richard Shay, Saranga Komanduri, Adam L. Durity, Phillip (Seyoung) Huh, Michelle L. Mazurek, Sean M. Segreti, Blase Ur, Lujo Bauer, Nicolas Christin, and Lorrie Faith Cranor. 2014. Can Long Passwords Be Secure and Usable?. In Proc. CHI'14: 32nd Annual ACM Conference on Human Factors in Computing Systems. 10. http://doi.acm.org/10.1145/2556288.2557377","paperID":"None"},{"content":"Richard Shay, Saranga Komanduri, Patrick Gage Kelley, Pedro Giovanni Leon, Michelle L. Mazurek, Lujo Bauer, Nicolas Christin, and Lorrie Faith Cranor. 2010. Encountering Stronger Password Requirements: User Attitudes and Behaviors. In Proc. Symposium on Usable Privacy and Security. http://doi.acm.org/10.1145/1837110.1837113","paperID":"None"},{"content":"Jens Steube. 2009-. Hashcat Advanced Password Recovery. https://hashcat.net/oclhashcat/. (2009-).","paperID":"None"},{"content":"Michael Toomim, Travis Kriplean, Claus Pörtner, and James Landay. 2011. Utility of Human-Computer Interactions: Toward a Science of Preference Measurement. In Proc. CHI'11: 29th Annual ACM Conference on Human Factors in Computing Systems. http://doi.acm.org/10.1145/1978942.1979277","paperID":"None"},{"content":"Blase Ur, Patrick Gage Kelly, Saranga Komanduri, Joel Lee, Michael Maass, Michelle Mazurek, Timothy Passaro, Richard Shay, Timothy Vidas, Lujo Bauer, Nicolas Christin, and Lorrie Faith Cranor. 2012. How Does Your Password Measure Up? The Effect of Strength Meters on Password Creation. In Proc. USENIX Security Symposium. http: //dl.acm.org/citation.cfm?id=2362793.2362798","paperID":"None"},{"content":"Blase Ur, Sean M. Segreti, Lujo Bauer, Nicolas Christin, Lorrie Faith Cranor, Saranga Komanduri, Darya Kurilova, Michelle L. Mazurek, William Melicher, and Richard Shay. 2015. Measuring Real-World Accuracies and Biases in Modeling Password Guessability. In 24th USENIX Security Symposium (USENIX Security 15). USENIX Association, Washington, D.C., 463--481. https://www.usenix.org/conference/ usenixsecurity15/technicalsessions/presentation/ur","paperID":"None"},{"content":"Emanuel von Zezschwitz, Alexander De Luca, and Heinrich Hussmann. 2014. Honey, I Shrunk the Keys: Influences of Mobile Devices on Password Composition and Authentication Performance. In Proc. NordiCHI'14: 12th Annual Nordic Conference on Human-Computer Interaction. 10. http://doi.acm.org/10.1145/2639189.2639218","paperID":"None"},{"content":"Emanuel von Zezschwitz, Paul Dunphy, and Alexander De Luca. 2013. Patterns in the Wild: A Field Study of the Usability of Pattern and PIN-Based Authentication on Mobile Devices. In Proc. International Conference on Human-Computer Interaction with Mobile Devices and Services. 10. http://doi.acm.org/10.1145/2493190.2493231","paperID":"None"},{"content":"Matt Weir, Sudhir Aggarwal, Michael Collins, and Henry Stern. 2010. Testing Metrics for Password Creation Policies by Attacking Large Sets of Revealed Passwords. In ACM Conference on Computer and Communication Security. http://doi.acm.org/10.1145/1866307.1866327","paperID":"None"},{"content":"M. Weir, S. Aggarwal, B. de Medeiros, and B. Glodek. 2009. Password Cracking Using Probabilistic Context-Free Grammars. In Proc. IEEE Symposium on Security & Privacy. http://dx.doi.org/10.1109/SP.2009.8","paperID":"None"},{"content":"Yulong Yang, Janne Lindqvist, and Antti Oulasvirta. 2014. Text Entry Method Affects Password Security. Computing Research Repository (2014). http://arxiv.org/abs/1403.1910","paperID":"None"}],"citation":[],"title":"Usability and Security of Text Passwords on Mobile Devices","filename":"CHI16/p527","authors":["William Melicher","Darya Kurilova","Sean M. Segreti","Pranshu Kalvani","Richard Shay","Blase Ur","Lujo Bauer","Nicolas Christin","Lorrie Faith Cranor","Michelle L. Mazurek"],"conference":"CHI '16"}