{"paperId":2858124,"abstract":"This paper looks at the activities of environmentally minded technology designers and provides an account of how these designers think, behave and differ. In contrast to traditional designers, green designers appear to: (1) Bias decisions (2) Design from a deep, personal ethos; (3) Accept 'not knowing' as a part of the design process; (4) Rely on alternative ways of knowing, and; (5) Shift roles as needed throughout the design process. While a superficial treatment of these differences might seem to disenfranchise green designers, we show that an analysis of green design as a discursive practice highlights how, through engagement with others, green design can enhance pro-environmental dialog and enact meaningful change.","citation":[],"reference":[{"content":"Henrikke Baumann, Frank Boons, and Annica Bragd. 2002. Mapping the green product development field: engineering, policy and business perspectives. Journal of Cleaner Production 10, 5: 409--425. http://doi.org/10.1016/S0959--6526(02)00015-X","paperID":"None"},{"content":"Suzanne Benn, Dexter Dunphy, and Andrew Griffiths. 2014. Organizational change for corporate sustainability. Routledge.","paperID":"None"},{"content":"Hugh Beyer and Karen Holtzblatt. 1997. Contextual design: defining customer-centered systems. Elsevier.","paperID":"None"},{"content":"Eli Blevis. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 503--512. DOI=http://dx.doi.org/10.1145/1240624.1240705","paperID":"None"},{"content":"Kenneth S. Bowers, Glenn Regehr, Claude Balthazard, and Kevin Parker. 1990. Intuition in the context of discovery. Cognitive psychology 22, 1: 72--110. http://doi.org/10.1016/0010-0285(90)90004-N","paperID":"None"},{"content":"Daniel Boyarski. 1998. Designing design education. ACM SIGCHI Bulletin 30, 3: 7--10. DOI=http://dx.doi.org/10.1145/565711.565716","paperID":"None"},{"content":"Bill Buxton. 2010. Sketching user experiences: getting the design right and the right design: getting the design right and the right design. Morgan Kaufmann.","paperID":"None"},{"content":"Nigel Cross. 2006. Designerly ways of knowing. Springer.","paperID":"None"},{"content":"Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1975--1984. DOI=http://dx.doi.org/10.1145/1753326.1753625","paperID":"None"},{"content":"Paul Dourish. 2010. HCI and environmental sustainability: the politics of design and the design of politics. Proceedings of the 8th ACM Conference on Designing Interactive Systems, ACM, 1--10. DOI=http://dx.doi.org/10.1145/1858171.1858173","paperID":"None"},{"content":"Marcel Duchamp, Marc Dachy, Richard Hamilton, et al. 1994. The creative act. Sub Rosa, Brussels, Belgium.","paperID":"None"},{"content":"Vernard Eller. 1973. The simple life: The Christian stance toward possessions. WB Eerdmans Publishing Company.","paperID":"None"},{"content":"Daniel Esty and Andrew Winston. 2009. Green to gold: How smart companies use environmental strategy to innovate, create value, and build competitive advantage. John Wiley & Sons.","paperID":"None"},{"content":"Michel Foucault. 1987. The ethic of the care for the self as a practice of freedom: An interview with Michael Foucault on 20th January 1984. In Foucault Live: Interviews 1961--1984. (1996). Sylvère Lotinger (ed.). NY: Semiotext(e).","paperID":"None"},{"content":"Michel Foucault. 1998. The Will to Knowledge: The History of Sexuality vol. I.","paperID":"None"},{"content":"Batya Friedman, Peter H. Kahn Jr, Alan Borning, and Alina Huldtgren. 2013. Value sensitive design and information systems. In Early engagement and new technologies: Opening up the laboratory. Springer, 55--95. DOI=http://dx.doi.org/10.1007/978--94-007--78443_4","paperID":"None"},{"content":"William Bradley Glisson, Tim Storer, Gavin Mayall, Iain Moug, and George Grispos. 2011. Electronic retention: what does your mobile phone reveal about you? International Journal of Information Security 10, 6: 337--349. http://doi.org/10.1007/s10207-011-0144--3","paperID":"None"},{"content":"Gerard Goggin. 2012. Cell phone culture: Mobile technology in everyday life. Routledge.","paperID":"None"},{"content":"Maria Håkansson and Phoebe Sengers. 2013. Beyond being green: simple living families and ICT. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2725--2734. DOI=http://dx.doi.org/10.1145/2470654.2481378","paperID":"None"},{"content":"Ann Harrison and Jason Scorse. 2004. Moving up or moving out? Anti-sweatshop activists and labor market outcomes. National Bureau of Economic Research. Retrieved January 12, 2016 from http://www.nber.org/papers/w10492.","paperID":"None"},{"content":"Elaine M. Huang, Eli Blevis, Jennifer Mankoff, Lisa P. Nathan, and Bill Tomlinson. 2009. Defining the role of HCI in the challenges of sustainability. CHI'09 Extended Abstracts on Human Factors in Computing Systems, ACM, 4827--4830. DOI=http://dx.doi.org/10.1145/1520340.1520751","paperID":"None"},{"content":"Elaine M. Huang and Khai N. Truong. 2008. Breaking the disposable technology paradigm: opportunities for sustainable interaction design for mobile phones. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 323--332. DOI=http://dx.doi.org/10.1145/1357054.1357110","paperID":"None"},{"content":"Heekyoung Jung, Eli Blevis, and Erik Stolterman. 2010. Conceptualizations of the materiality of digital artifacts and their implications for sustainable interaction design. University of Indiana .","paperID":"None"},{"content":"Bryan Lawson. 2006. How designers think: the design process demystified. Routledge.","paperID":"None"},{"content":"Mattias Lindahl. 2006. Engineering designers' experience of design for environment methods and tools-Requirement definitions from an interview study. Journal of cleaner production 14, 5: 487--496. http://doi.org/10.1016/j.jclepro.2005.02.003","paperID":"None"},{"content":"Jennifer C. Mankoff, Eli Blevis, Alan Borning, et al. 2007. Environmental sustainability and interaction. CHI'07 extended abstracts on Human factors in computing systems, ACM, 2121--2124. DOI=http://dx.doi.org/10.1145/1240866.1240963","paperID":"None"},{"content":"William McDonough and Michael Braungart. 2010. Cradle to cradle: Remaking the way we make things. MacMillan.","paperID":"None"},{"content":"Jason F. McLennan. 2004. The philosophy of sustainable design: The future of architecture. Ecotone publishing.","paperID":"None"},{"content":"Debra Meyerson. 2001. Tempered radicals: How people use difference to inspire change at work. Harvard Business Press.","paperID":"None"},{"content":"Paul Newland, James A. Powell, and Chris Creed. 1987. Understanding architectural designers' selective information handling. Design Studies 8, 1: 2--16. http://doi.org/10.1016/0142--694X(87)90026--3","paperID":"None"},{"content":"Peter Nicholson. 2005. Green Design vs. Sustainable Design. Dexigner. Retrieved January 12, 2016 from http://www.dexigner.com/news/4166.","paperID":"None"},{"content":"Ram Nidumolu, C. K. Prahalad, and M. R. Rangaswami. 2015. Why sustainability is now the key driver of innovation. Engineering Management Review, IEEE 43, 2: 85--91. http://dx.doi.org/10.1109/EMR.2015.7123233","paperID":"None"},{"content":"Official Journal of the European Union. Directive 2002/95/EC of the European Parliament on the restriction of the use of certain hazardous substances in electrical and electronic equipment. 37/19, (2003).","paperID":"None"},{"content":"Official Journal of the European Union. Directive 2011/65/EU of the European Parliament on the restriction of certain hazardous substances in electrical and electronic equipment. 174/88, (2011).","paperID":"None"},{"content":"Official Journal of the European Union. Regulation (EC) No 1907/2006 of the European Parliament concerning the Registration, Evaluation, Authorisation and Restriction of Chemicals (REACH), establishing a European Chemicals Agency. (2006)","paperID":"None"},{"content":"Yue Pan, David Roedl, John C. Thomas, and Eli Blevis. 2012. Re-conceptualizing fashion in sustainable HCI. Proceedings of the Designing Interactive Systems Conference, ACM, 621--630. DOI=http://dx.doi.org/10.1145/2317956.2318049","paperID":"None"},{"content":"David Pepper. 2007. Tensions and dilemmas of ecotopianism. Environmental Values 16, 3: 289--312. http://doi.org/10.3197/096327107X228364","paperID":"None"},{"content":"Donald A. Schön. 1983. The reflective practitioner: How professionals think in action. Basic books.","paperID":"None"},{"content":"Stephen RJ Sheppard, Alison Shaw, David Flanders, et al. 2011. Future visioning of local climate change: a framework for community engagement and planning with scenarios and visualisation. Futures 43, 4: 400--412. http://doi.org/10.1016/j.futures.2011.01.009","paperID":"None"},{"content":"Stefan Thomke and Barbara Feinberg. 2009. Design thinking and innovation at Apple. Harvard Busyness School: 1--12.","paperID":"None"},{"content":"Johan Tingström and Reine Karlsson. 2006. The relationship between environmental analyses and the dialogue process in product development. Journal of Cleaner Production 14, 15: 1409--1419. http://doi.org/10.1016/j.jclepro.2005.11.012","paperID":"None"},{"content":"UN Resolution A/60/1, adopted by the General Assembly on 15 September 2005. United Nations General Assembly, (2005).","paperID":"None"},{"content":"US Environmental Protection Agency. My Green Apps. http://www.epa.gov/greenapps/.","paperID":"None"},{"content":"Papanek Victor. 1982. Design for the real world: Human ecology and social change. NY, Pantheon Books.","paperID":"None"},{"content":"Ron Wakkary, Audrey Desjardins, Sabrina Hauser, and Leah Maestri. 2013. A sustainable design fiction: Green practices. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 4: 23. DOI=http://dx.doi.org/10.1145/2494265","paperID":"None"},{"content":"Galit Zadok and Riikka Puustinen. 2010. The green switch: Designing for sustainability in mobile computing. The First USENIX Workshop on Sustainable Information Technology. http://static.usenix.org/legacy/events/sustainit10/tech/full_papers/zadok.pdf.","paperID":"None"}],"title":"Learning from Green Designers: Green Design as Discursive Practice","filename":"CHI16/p1312","authors":["Earl Friedberg","Edward Lank"],"conference":"CHI '16"}