{"paperId":2858303,"citation":[],"abstract":"Updates alter the way software functions by fixing bugs, changing features, and modifying the user interface. Sometimes changes are welcome, even anticipated, and sometimes they are unwanted leading to users avoiding potentially unwanted updates. If users delay or do not install updates it can have serious security implications for their computer. Updates are one of the primary mechanisms for correcting discovered vulnerabilities, when a user does not update they remain vulnerable to an increasing number of attacks. In this work we detail the process users go through when updating their software, including both the positive and negative issues they experience. We asked 307 survey respondents to provide two contrasting software update stories. Using content analysis we analysed the stories and found that users go through six stages while updating: awareness, deciding to update, preparation, installation, troubleshooting, and post state. We further detail the issues respondents experienced during each stage and the impact on their willingness to update.","reference":[{"content":"2015. Amazon Mechanical Turk. (2015). Accessed Sept. 25, 2015 https://requester.mturk.com/.","paperID":"None"},{"content":"Hazim Almuhimedi, Adrienne Porter Felt, Robert W. Reeder, and Sunny Consolvo. 2014. Your Reputation Precedes You: History, Reputation, and the Chrome Malware Warning. In Symposium on Usable Privacy and Security.","paperID":"None"},{"content":"Leyla Bilge and Tudor Dumitras. 2012. Before we knew it: an empirical study of zero-day attacks in the real world. In Proceedings of the 2012 ACM conference on Computer and communications security (CCS '12). ACM, NY, NY, USA, 833--844.","paperID":"None"},{"content":"Cristian Bravo-Lillo, Lorrie Cranor, Saranga Komanduri, Stuart Schechter, and Manya Sleeper. 2014. Harder to Ignore--. In Symposium on Usable Privacy and Security (SOUPS).","paperID":"None"},{"content":"Cristian Bravo-Lillo, Lorrie Faith Cranor, Julie Downs, Saranga Komanduri, and Manya Sleeper. 2011b. Improving computer security dialogs. In Human-Computer Interaction (Interact).","paperID":"None"},{"content":"Cristian Bravo-Lillo, Lorrie Faith Cranor, Julie S Downs, and Saranga Komanduri. 2011a. Bridging the gap in computer security warnings: A mental model approach. Security & Privacy, IEEE 9, 2 (2011), 18--26.","paperID":"None"},{"content":"Cristian Bravo-Lillo, Saranga Komanduri, Lorrie Faith Cranor, Robert W Reeder, Manya Sleeper, Julie Downs, and Stuart Schechter. 2013. Your attention please: desgning security-decision UIs to make genuine rrisk harder to ignore. In Symposium on Usable Privacy and Security.","paperID":"None"},{"content":"Peter Bright. 2015. Microsoft accused of adding Windows 10s spy features to Windows 7 and 8. Web. (Sept. 2015). http://arstechnica.co.uk/ information-technology/2015/09/ microsoft-accused-of-adding-spy-features-to-windows-7--8/","paperID":"None"},{"content":"Jean Camp, Tim Kelley, and Prashanth Rajivan. Instrument for Measuring Computing and Security Expertise--TR715. Technical Report.","paperID":"None"},{"content":"L Camp. 2003. Designing for trust. Trust, Reputation, and Security: Theories and Practice (2003), 203--209.","paperID":"None"},{"content":"CNN Political Unit. 2013. McCain: 'Why the hell' do iPhone apps need updating-- (May 2013). http://politicalticker.blogs.cnn.com/2013/05/21/mccainwhy-the-hell-do-iphone-apps-need-updating/.","paperID":"None"},{"content":"Lorrie Faith Cranor. 2008. A Framework for Reasoning About the Human in the Loop. UPSEC 8 (2008), 1--15.","paperID":"None"},{"content":"Tudor Dumitras, Priya Narasimhan, and Eli Tilevich. 2010. To upgrade or not to upgrade: impact of online upgrades across multiple administrative domains. In Proceedings of the ACM international conference on Object oriented programming systems languages and applications (OOPSLA '10). ACM, NY, NY, USA, 865--876.","paperID":"None"},{"content":"W.K. Edwards, E.S. Poole, and J. Stoll. 2007. Security automation considered harmful. In Proceedings of the IEEE New Security Paradigms Workshop (NSPW 2007). 18--21.","paperID":"None"},{"content":"Michael Fagan, Mohammad Mai-- Hasan Khan, and Ross Buck. 2015. A study of users experiences and beliefs about software update messages. Computers in Human Behavior 51 (2015), 504--519.","paperID":"None"},{"content":"Samuel Gibbs. 2015. Apple faces lawsuit over storage space on iPhones and iPads. (2015). http://www.theguardian.com/technology/2015/jan/02/applelawsuit-storage-space-iphones-ipad-ios8-softwareadvertised-capacity.","paperID":"None"},{"content":"Christos Gkantsidis, Thomas Karagiannis, Milan VojnoviC, Christos Gkantsidis, Thomas Karagiannis, and Milan VojnoviC. 2006. Planet scale software updates. In ACM SIGCOMM Computer Communication Review. ACM, NY, NY, USA, 423--434.","paperID":"None"},{"content":"Dan Goodin. 2015. Ding dong, the witch is dead: Microsoft AV gets tough on Ask Toolbar. ArsTechnica news site, Accessed Sept. 12 2015. (June 2015).","paperID":"None"},{"content":"Bela Gor and David Aspinall. 2015. Accessible Banking: Experiences and Future Directions. In Workshop on Inclusive Privacy and Security (WIPS).","paperID":"None"},{"content":"Iulia Ion, Rob Reeder, and Sunny Consolvo. 2015. ...no one can hack my mind: Comparing Expert and Non-Expert Security Practices. In SOUPS15.","paperID":"None"},{"content":"Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara Kiesler. 2014. Privacy Attitudes of Mechanical Turk Workers and the U.S. Public. In Symposium On Usable Privacy and Security (SOUPS '14). 37--49.","paperID":"None"},{"content":"Dara Kerr. 2012. Microsoft hit with lawsuit over Surface's storage space. (2012). http://www.cnet.com/news/microsoft-hit-with-lawsuitover-surfaces-storage-space/.","paperID":"None"},{"content":"M. Khan, Zehui Bi, and J.A. Copeland. 2012. Software updates as a security metric: Passive identification of update trends and effect on machine infection. In Military Communications Conference (MILCOM). 1--6.","paperID":"None"},{"content":"Kat Krol, Matthew Moroz, and M. Angela Sasse. 2012. Don't work. Can't work-- Why it--s time to rethink security warnings. In Risk and Security of Internet and Systems (CRiSIS), 2012 7th International Conference on. 1 --8.","paperID":"None"},{"content":"Muhammad Mahmoud, Sonia Chiasson, and Ashraf Matrawy. 2012. Does Context In--uence Responses to Firewall Warnings--. In eCrime Researchers Summit (eCrime).","paperID":"None"},{"content":"G.V. Marconato, V. Nicomette, and M. Kaaniche. 2012. Security-related vulnerability life cycle analysis. In Risk and Security of Internet and Systems (CRiSIS), 2012 7th International Conference on. 1--8.","paperID":"None"},{"content":"Eduardo R. B. Marques. 2013. Fine-grained Patches for Java Software Upgrades. In 5th Workshop on Hot Topics in Software Upgrades.","paperID":"None"},{"content":"Microsoft. 2012. Microsoft Security Intelligence Report, Volume 13. (January -- June 2012).","paperID":"None"},{"content":"Matthew B Miles, A Michael Huberman, and Johnny Saldana. 2014. Qualitative Data Analysis: A Methods Source Book. SAGE Publications, Incorporated.","paperID":"None"},{"content":"David Moore, Colleen Shannon, and k claffy. 2002. Code-Red: A Case Study on the Spread and Victims of an Internet Worm. In Proceedings of the 2Nd ACM SIGCOMM Workshop on Internet Measurment (IMW '02). ACM, NY, NY, USA, 273--284.","paperID":"None"},{"content":"Antonio Nappa, Richard Johnson, Leyla Bilge, Juan Caballero, and Tudor Dumitras. 2015. The Attack of the Clones: A Study of the Impact of Shared Code on Vulnerability Patching. In Symposium on Security and Privacy.","paperID":"None"},{"content":"Kartik Nayak, Daniel Marino, Petros Efstathopoulos, and Tudor Dumitras. 2014. Some Vulnerabilities Are Different Than Others: Studying Vulnerabilities and Attack Surfaces in the Wild. In International Symposium on Research in Attacks, Intrusions and Defenses (RAID).","paperID":"None"},{"content":"Jared Newman. 2015. Java installer ditches the Ask Toolbar, swaps in Yahoo defaults. Online, Accessed Sept. 12 2015. (June 2015).","paperID":"None"},{"content":"Srivatsan Parthesarathy, Reiner Fink, Sean L Flynn, and Ray Sun. 2002. Software update notification. (March 5 2002). US Patent 6,353,926.","paperID":"None"},{"content":"Erika Shehan Poole, Marshini Chetty, Tom Morgan, Rebecca E. Grinter, and W. Keith Edwards. 2009. Computer help at home: methods and motivations for informal technical support. In CHI --09: Proceedings of the 27th international conference on Human factors in computing systems. ACM, NY, NY, USA, 739--748.","paperID":"None"},{"content":"Emilee Rader, Rick Wash, and Brandon Brooks. 2012. Stories as informal lessons about security. In SOUPS --12: Proceedings of the Eighth Symposium on Usable Privacy and Security. ACM.","paperID":"None"},{"content":"Eric Rescorla. 2003. Security holes... Who cares--. In USENIX Security. Washington, DC.","paperID":"None"},{"content":"Johnny Saldana. 2013. The Coding Manual for Qualitative Researchers. SAGE Publications Ltd.","paperID":"None"},{"content":"David Sharek, Cameron Swofford, and Michael Wogalter. 2008. Failure to recognize fake Internet popup warning messages. In the human factors and ergonomics society. Study whre showed real and fake Windows XP Warning windows. No difference between real and fake.","paperID":"None"},{"content":"Andreas Sotirakopoulos, Kirstie Hawkey, and Konstantin Beznosov. 2011. On the Challenges in Usable Security Lab Studies: Lessons Learned from Replicating a Study on SSL Warnings. In SOUPS11.","paperID":"None"},{"content":"Joshua Sunshine, Serge Egelman, Hazim Almuhimedi, Neha Atri, and Lorrie Faith Cranor. 2009. Crying Wolf: An Empirical Study of SSL Warning Effectiveness. In The 18th USENIX Security Symposium.","paperID":"None"},{"content":"Symantec Corporation. 2014. Internet Security Threat Report, Volume 19. (2014).","paperID":"None"},{"content":"Yuan Tian, Bin Liu, Weisi Dai, Blase Ur, Patrick Tague, and Lorrie Faith Cranor. 2015. Supporting Privacy-Conscious App Update Decisions with User Reviews. In Proceedings of the 5th Annual ACM CCS Workshop on Security and Privacy in Smartphones and Mobile Devices (SPSM '15). ACM, NY, NY, USA, 51--61. DOI: http://dx.doi.org/10.1145/2808117.2808124","paperID":"None"},{"content":"Peleus Uhley. 2013. Strategies for Updating at Scale at Adobe. Keynote address at 5th workshop on hot topics in Software Upgrades. (June 2013). https://www.usenix.org/conference/hotswup13/workshopprogram/presentation/uhley.","paperID":"None"},{"content":"Kami Vaniea, Emilee Rader, and Rick Wash. 2014. Betrayed by Updates: How Negative Experience Affect Future Security. In CHI 2014: Conference on Human Factors in Computing Systems.","paperID":"None"},{"content":"Rick Wash. 2010. Folk Models of Home Computer Security. In Proceedings of SOUPS.","paperID":"None"},{"content":"Rick Wash, Emilee Rader, Kami Vaniea, and Michelle Rizor. 2014. Out of the Loop: How Automated Software Updates Cause Unintended Security Consequences. In Symposium on Usable Privacy and Security (SOUPS).","paperID":"None"},{"content":"Leah Zhang-Kennedy, Sonia Chiasson, and Robert Biddle. 2014. Stop Clicking on \"Update Later\": Persuading Users They Need Up-to-Date Antivirus Protection. In Persuasive Technology.","paperID":"None"}],"title":"Tales of Software Updates: The process of updating software","filename":"CHI16/p3215","authors":["Kami Vaniea","Yasmeen Rashidi"],"conference":"CHI '16"}