{"paperId":2858570,"citation":[],"abstract":"We introduce a new usability inspection method called HED (heuristic evaluation during demonstrations) for measuring and comparing usability of competing complex IT systems in public procurement. The method presented enhances traditional heuristic evaluation to include the use context, comprehensive view of the system, and reveals missing functionality by using user scenarios and demonstrations. HED also quantifies the results in a comparable way. We present findings from a real-life validation of the method in a large-scale procurement project of a healthcare and social welfare information system. We analyze and compare the performance of HED to other usability evaluation methods used in procurement. Based on the analysis HED can be used to evaluate the level of usability of an IT system during procurement correctly, comprehensively and efficiently.","reference":[{"content":"Benoit A. Aubert, Michel Patry, and Suzanne Rivard. 1998. Assessing the risk of IT outsourcing. In Proceedings of the Thirty-First Hawaii International Conference on System Sciences, 685--692.","paperID":"None"},{"content":"J.M. Christian Bastien, and Dominique L. Scapin. 1995. Evaluating a user interface with ergonomic criteria. Int J Human-Computer Interaction 7, 2: 105121. http://dx.doi.org/10.1080/10447319509526114","paperID":"None"},{"content":"J. Brender. 1997. Medical informatics: does the healthcare domain have special features? Letter to the editor. Methods of Information in Medicine 36, 1:59-60.","paperID":"None"},{"content":"John Brooke. 1996. SUS: a \"quick and dirty\" usability scale. In Usability Evaluation in Industry, Patrick W. Jordan, Bruce Thomas, Bernard A. Weerdmeester, and Ian L. McClelland (eds.). Taylor and Francis, London, UK.","paperID":"None"},{"content":"Thomas T. Carey. 1991. A Usability Requirements Model for Procurement Life Cycles. In Human Factors in Information Systems: An Organizational Perspective, Jane. M Carey (ed.). Ablex, Norwood, NJ, 89--104.","paperID":"None"},{"content":"John M. Carroll. 1997. Scenario based Design. In Handbook of Human-Computer Interaction, Martin G. Helander, Thomas K. Landauer and Prasad V. Prabhu (eds.). Elsevier, Amsterdam, NL, 383--406.","paperID":"None"},{"content":"C.J. Carvalho, Elizabeth M. Borycki, and Andre Kushniruk. 2009. Ensuring the Safety of Health Information Systems: Using Heuristics for Patient Safety. Healthcare Quarterly 12: 49--54.","paperID":"None"},{"content":"Parmit K. Chilana, Jacob O. Wobbrock, and Andrew J. Ko. 2010. Understanding usability practices in complex domains. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 2337--2346. http://dx.doi.org/10.1145/1753326.1753678","paperID":"None"},{"content":"John P. Chin, Virginia A. Diehl, and Kent L. Norman. 1988. Development of an instrument measuring user satisfaction of the human-computer interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '88), 213-218. http://dx.doi.org/10.1145/57167.57203","paperID":"None"},{"content":"Gilbert Cockton, and Alan Woolrych. 2002. Sale must end: should discount methods be cleared off HCI's shelves? Interactions 9, 5: 13--18. http://dx.doi.org/10.1145/566981.566990","paperID":"None"},{"content":"Kathrin Cresswell, Zoe Morrison, Sarah Crowe, Ann Robertson, and Aziz Sheikh. 2011. Anything but engaged: user involvement in the context of a national electronic health record implementation. Informatics in Primary Care 19: 191--206.","paperID":"None"},{"content":"Directive 2004/18/EC of the European Parliament and of the Council of 31 March 2004 on the coordination of procedures for the award of public works contracts, public supply contracts and public service contracts. Retrieved September 25, 2015 from http://eurlex.europa.eu/legalcontent/en/TXT/?uri=CELEX:32004L0018","paperID":"None"},{"content":"Joseph S. Dumas, and Janice C. Redish. 1999. A Practical Guide to Usability Testing. Intellect.","paperID":"None"},{"content":"Joseph S. Dumas, and Marilyn C. Salzman. 2006. Usability Assessment Methods. Reviews of Human Factors and Ergonomics 2, 1: 109--140. http://dx.doi.org/10.1177/1557234X0600200105","paperID":"None"},{"content":"Paul J. Edwards, Kevin P. Moloney, Julie A. Jacko, and François Sainfort, F. 2008. Evaluating Usability of a Commercial Electronic Health Record: A Case Study. International Journal of Human-Computer Studies 66, 10: 718--728. http://dx.doi.org/10.1016/j.ijhcs.2008.06.002","paperID":"None"},{"content":"Laura H. Einbinder, Judy B. Remz, and David Cochran. 1996. Mapping Clinical Scenarios to Functional Requirements: A Tool for Evaluating Clinical Information Systems. In Proceedings of AMIA Annual Fall Symposium, 747--751.","paperID":"None"},{"content":"Finnish Act on Public Contracts (348/2007). Retrieved September 25, 2015 from http://www.finlex.fi/en/laki/kaannokset/2007/en20070348.pdf","paperID":"None"},{"content":"Günther Gediga, Kai-Christoph Hamborg, and Ivo Düntsch. 1999. The IsoMetrics usability inventory: An operationalization of ISO 9241--10 supporting summative and formative evaluation of software systems. Behaviour & Information Technology 18, 3: 151--164. http://dx.doi.org/10.1080/014492999119057","paperID":"None"},{"content":"Natasa Gisev, J. Simon Bell, and Timothy F. Chen. 2013. Interrater agreement and interrater reliability: Key concepts, approaches, and applications. Research in Social and Administrative Pharmacy 9, 3: 330--338. http://dx.doi.org/10.1016/j.sapharm.2012.04.004","paperID":"None"},{"content":"Marta González, Llúcia Masip, Antoni Granollers, and Marta Oliva. 2009. Quantitative Analysis in a Heuristic Evaluation Experiment. Advances in Engineering Software 4, 12: 1271--1278. http://dx.doi.org/10.1016/j.advengsoft.2009.01.027","paperID":"None"},{"content":"Jan Gulliksen, Bengt Göransson. 2001. Reengineering the Systems Development Process for User-Centred Design. In Human-Computer Interaction INTERACT '01, M. Hirose (ed.). IOS Press, Amsterdam, NL, 359366.","paperID":"None"},{"content":"H. Rex Hartson, Terence S. Andre, and Robert C. Williges. 2003. Criteria For Evaluating Usability Evaluation Methods. Int J Human-Computer Interaction 15, 1: 145-81. http://dx.doi.org/10.1207/S15327590IJHC1501_13","paperID":"None"},{"content":"HIMSS EHR Usability Task Force. 2009. Defining and Testing EMR Usability: Principles and Proposed Methods of EMR Usability Evaluation and Rating, Healthcare Information and Management Systems Society. Retrieved September 25, 2015 from http://s3.amazonaws.com/rdcmshimss/files/production/public/FileDownloads/HIMSS_DefiningandTestingEMRUsability.pdf","paperID":"None"},{"content":"Kasper Hornbæk. 2006. Current Practice in Measuring Usability: Challenges to Usability Studies and Research. Int J Human-Computer Studies 64, 2: 79102. http://dx.doi.org/10.1016/j.ijhcs.2005.06.002","paperID":"None"},{"content":"Debra Howcroft, and Ben Light. 2002. A Study of User Involvement in Packaged Software Selection. In Proceedings of ICIS 2002, paper 7. http://aisel.aisnet.org/icis2002/7","paperID":"None"},{"content":"Saila Huuskonen. 2014. Recording and use of information in a client information system in child protection work. Acta Electronica Universitatis Tamperensis: 1387. Tampere University Press. PhD thesis. Retrieved from http://urn.fi/URN:ISBN:978951--44--9368--3","paperID":"None"},{"content":"Monique W.M. Jaspers. 2009. A Comparison of Usability Methods for Testing Interactive Health Technologies: Methodological Aspects and Empirical evidence. Int J Medical Informatics 78, 5: 340--353. http://dx.doi.org/10.1016/j.ijmedinf.2008.10.002","paperID":"None"},{"content":"Timo Jokela, and Elizabeth Buie. 2012. Getting UX into the Contract. In Usability in Government Systems: User Experience Design for Citizens and Public Servants, Elizabeth Buie, and Dianne Murray (eds.). Morgan Kaufmann, Waltham, MA, 251--165.","paperID":"None"},{"content":"Timo Jokela, Juha Laine, and Marko Nieminen. 2013. Usability in RFP's: The Current Practice and Outline for the Future. In Proceeding of HCII 2013, Part II. LNCS, vol 8005, M. Kurosu (ed.). Springer, Berlin Heidelberg, 101--106. http://dx.doi.org/10.1007/978--3642--39262--7_12","paperID":"None"},{"content":"Jurek Kirakowski. 1994. The use of questionnaire methods for usability assessment. Retrieved September 25, 2015 from http://sumi.ucc.ie/sumipapp.html","paperID":"None"},{"content":"Andre Kushniruk, Marie-Catherine Beuscart-Zéphir, Alexis Grzes, Elizabeth Borycki, Ludivine Watbled, and Joseph Kannry. 2010. Increasing the Safety of Healthcare Information Systems through Improved Procurement: Toward a Framework for Selection of Safe Healthcare Systems. Healthcare Quarterly 13: 5358. http://dx.doi.org/10.12927/hcq.2010.21967","paperID":"None"},{"content":"Andre W. Kushniruk, and Vimla L. Patel. 2004. Cognitive and Usability Engineering Methods for the Evaluation of Clinical Information Systems. J Biomedical Informatics 37, 1: 56--76. http://dx.doi.org/10.1016/j.jbi.2004.01.003","paperID":"None"},{"content":"Erik Liljegren, and Anna-Lisa Osvalder. 2004. Cognitive Engineering Methods as Usability Evaluation Tools for Medical Equipment. Int J Industrial Ergonomics 34, 1: 49--62. http://dx.doi.org/10.1016/j.ergon.2004.01.008","paperID":"None"},{"content":"Thomas L. Lincoln, and Daniel J. Essin. 1993. Clinical Information Processing Scenarios: Selecting Clinical Information Systems. In Evaluating Healthcare Information Systems: Methods and Applications, James G. Anderson, Carolyn E. Aydin, and Stephen J. Jay, (eds.). Sage Publications, Thousand Oaks, CA.","paperID":"None"},{"content":"Barbara Mirel. 2004. Interaction Design for Complex Problem Solving - Developing Useful and Usable Software, Morgan Kaufmann.","paperID":"None"},{"content":"Carl E. Moe. 2014. Research on Public Procurement of Information Systems: The Need for a Process Approach. Comm of the Association for Information Systems 34: 1320--1335. http://aisel.aisnet.org/cais/vol34/iss1/78","paperID":"None"},{"content":"John Møller-Jensen, Ivan Lund Pedersen. and Jesper Simonsen. 2006. Measurement of the Clinical Usability of a Configurable EHR. In Ubiquity: Technologies for Better Health in Aging Societies, Arie Hasman, Reinhold Haux, Johan van der Lei, Etienne De Clercq, Francis H.Roger France (eds.). IOS Press, Amsterdam, NL, 356--361.","paperID":"None"},{"content":"Jakob Nielsen. 1993. Usability Engineering. Morgan Kaufmann.","paperID":"None"},{"content":"Jakob Nielsen, Rolf Molich. 1990. Heuristic evaluation of user interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '90), 249--256. http://dx.doi.org/10.1145/97243.97281","paperID":"None"},{"content":"Linda W.P. Peute, and Monique W.M. Jaspers. 2007. The Significance of a Usability Evaluation of an Emerging Laboratory Order Entry System. Int J Medical Informatics 76, 2--3: 157--168. http://dx.doi.org/10.1016/j.ijmedinf.2006.06.003","paperID":"None"},{"content":"Linda W.P. Peute, Richard Spithoven, Piet J.M. Bakker, and Monique W.M. Jaspers. 2008. Usability Studies on Interactive Health Information Systems: Where Do we Stand? In eHealth Beyond the Horizon Get IT There: Proceedings of MIE 2008, Stig Kjær Andersen, Gunnar O. Klein, Stefan Schulz, Jos Aarts, M. Cristina Mazzoleni (eds.). IOS Press, Amsterdam, NL, 327--332.","paperID":"None"},{"content":"Ginny Redish. 2007. Expanding Usability Testing to Evaluate Complex Systems. J Usability Studies 2, 3: 102-111.","paperID":"None"},{"content":"Sirpa Riihiaho, Marko Nieminen, Stina Westman, Ronja Addams-Moring, and Jukka Katainen. 2015. Procuring Usability: Experiences of Usability Testing in Tender Evaluation. In Nordic Contributions in IS Research, vol. 223 LNBIP, Harri Oinas-Kukkonen, Netta Iivari, Kari Kuutti, Anssi Öörni, Mikko Rajanen (eds.). Springer, CH, 108--120. http://dx.doi.org/10.1007/978--3--319--21783--3_8","paperID":"None"},{"content":"Jeff Sauro. 2014. The Relationship Between Problem Frequency and Problem Severity in Usability Evaluations. J Usability Studies 10, 1: 17--25.","paperID":"None"},{"content":"Robert M. Schumacher, Jayson M. Webb, and Korey R. Johnson. 2009. How to Select an Electronic Health Record System that Healthcare Professionals can Use. User centric Inc. Retrieved September 25, 2015 from http://www.usercentric.com/sites/usercentric.com/files/usercentric-ehr-white-paper.pdf","paperID":"None"},{"content":"Philip Scown. 1998. Improving the Procurement Process: Humanizing Accountants with a Human Factors Education. In Proceedings of ICIS 1998, paper 2. http://aisel.aisnet.org/icis1998/2","paperID":"None"},{"content":"Stephen M. Shortell, Arnold D. Kaluzny. 2006. Health care management: Organizational design and behavior, (5th ed.). Thompson.","paperID":"None"},{"content":"Alistair Sutcliffe. 2002. Assessing the reliability of heuristic evaluation for Web site attractiveness and usability. In HICSS Proceedings of the 35th Annual Hawaii International Conference on System Sciences 2002, 1838--1847. http://dx.doi.org/10.1109/HICSS.2002.994098","paperID":"None"},{"content":"Kimmo Tarkkanen, Ville Harkke. 2015. Evaluation for Evaluation: Usability Work during Tendering Proces. In Extended Abstracts of the SIGCHI Conference on Human Factors in Computing Systems (CHI'15), 22892294. http://dx.doi.org/10.1145/2702613.2732851","paperID":"None"},{"content":"Johanna Viitanen, Hannele Hyppönen, Tinja Lääveri, Jukka Vänskä, Jarmo Reponen, Ilkka Winblad. 2010. National Questionnaire Study on Clinical ICT Systems Proofs: Physicians Suffer from Poor Usability. Int J Medical Informatics 80, 10: 708--725. http://dx.doi.org/10.1016/j.ijmedinf.2011.06.010","paperID":"None"},{"content":"Jiajie Zhang, and Muhammad F. Walji. 2011. TURF: toward a unified framework of EHR usability. J Biomedical Informatics 44, 6: 1056-67. http://dx.doi.org/10.1016/j.jbi.2011.08.005","paperID":"None"}],"title":"We Need Numbers!: Heuristic Evaluation during Demonstrations (HED) for Measuring Usability in IT System Procurement","filename":"CHI16/p4129","authors":["Mari Tyllinen","Johanna Kaipio","Tinja Lääveri","Marko H.T. Nieminen"],"conference":"CHI '16"}