{"paperId":2858099,"citation":[],"abstract":"The most common method of presenting tactile stimuli to touch screens has been to directly attach a tactile display to the screens. This requires a transparent tactile display so that the view is not obstructed. In contrast, transparency is not required if the tactile stimuli are presented on the back of the device. However, stimulating the entire palm is not appropriate because touch screens are typically used by only one finger. To overcome these limitations, we propose a new method in which tactile feedback is delivered to a single finger on the back of a touch screen. We used an electro-tactile display because it is small and dense. The tactile display presents touch stimuli as mirror images of the shapes on the touch screen. By comparing cases in which the device was operated by one or two hands, we found that shape discrimination is possible using this method.","reference":[{"content":"Olivier Bau, Ivan Poupyrev, Ali Israr, and Chris Harrison. 2010. Teslatouch: Electro vibration for touch surfaces. In Proceedings of the UIST'10, 283--292.","paperID":"None"},{"content":"Masaaki Fukumoto and Toshiaki Sugimura. 2001. Active click: Tactile feedback for touch panels. In Proceedings of the SIGCHI Extended Abstracts on Human Factors in Computing Systems (CHI'01), 121--122.","paperID":"None"},{"content":"Shogo Fukushima and Hiroyuki Kajimoto. 2011. Palm touch panel. In Proceedings of the ITS'11, 1975--1980.","paperID":"None"},{"content":"Akira Hasegwa, Tomiya Yamazumi, Satoshi Hasegwa, and Masaru Miyao. 2012. Evaluating the input of characters using software keyboards in a mobile learning environment. WMUTE, 214--217.","paperID":"None"},{"content":"Hiroyuki Kajimoto, Masaki Suzuki, and Yonezo Kanno. 2014. HamsaTouch: Tactile vision substitution with smartphone and electro-tactile display. In Proceedings of the SIGCHI Extended Abstracts on Human Factors in Computing Systems (CHI'14), 1273--1278.","paperID":"None"},{"content":"Hiroyuki Kajimoto. 2012. Electrotactile display with real time impedance feedback using pulse width modulation. IEEE Transaction on Haptics, 5: 184--188.","paperID":"None"},{"content":"Hiroyuki Kajimoto. 2012. Skeletouch: Transparent electro-tactile display for mobile surfaces. SIGGRAPH Asia 2012 Emerging Technologies, Article No.21.","paperID":"None"},{"content":"John G. Linvill and James C. Bliss. 1966. A direct translation reading aid for the blind. In Proceedings of the IEEE, 54: 40--51.","paperID":"None"},{"content":"Satoshi Saga and Koichiro Deguchi. 2012. Lateralforce-based 2.5 dimensional tactile display for touch screen. Haptic Symposium 2012, 15--20.","paperID":"None"},{"content":"Andrew Sears. 1991. Improving touchscreen keyboards: Design issues and a comparison with other devices, interacting with computers. Interacting with Computers. 3: 253--269.","paperID":"None"},{"content":"Tactus Technology, Inc. 2012. Taking touch screen interfaces into a new dimension. Tactus Technology White Paper","paperID":"None"},{"content":"Laura Winfield, John Glassmire, J. Edward Colgate, and Michael Peshkin. 2007. T-pad: Tactile pattern display through variable friction reduction. In Proceedings of the World Haptics Conference (WHC'07), 421--426","paperID":"None"},{"content":"Nesra Yannier, Ali Israr, Jill F. Lehman, and Roberta L. Klatzky. 2015. FeelSleeve: Haptic feedback to enhance early reading. In Proceeding of the SIGCHI on Human Factors in Computing Systems (CHI'15), 1015--1024.","paperID":"None"},{"content":"Koji Yatani and Khai N. Truong. 2009. Semfeel: A user interface with semantic tactile feedback for mobile touchscreen devices. In Proceeding of the UIST'09, 111--120.","paperID":"None"}],"title":"Tactile Presentation to the Back of a Smartphone with Simultaneous Screen Operation","filename":"CHI16/p3717","authors":["Sugarragchaa Khurelbaatar","Yuriko Nakai","Ryuta Okazaki","Vibol Yem","Hiroyuki Kajimoto"],"conference":"CHI '16"}