{"paperId":2858582,"citation":[],"abstract":"Social support can significantly improve health outcomes for individuals living with disease, and online forums have emerged as an important vehicle for social support. Whereas research has focused on the delivery and use of social support, little is known about how these communities are sustained. We describe one sociotechnical mechanism that enables sustainable communities to provide social support to a large number of people. We focus upon thirteen disease-specific discussion forums hosted by the WebMD online health community. In these forums, small, densely connected cores of members who maintain strong relationships generate the majority of support for others. Through content analysis we find they provide informational support to a large number of more itinerant members, but provide one another with community support. Based on these observations, we describe a sociotechnical mechanism of online support that is distinct from non-support oriented communities, and has implications for the design of self-sustaining online support systems.","reference":[{"content":"A. Balali, H. Faili, and M. Asadpour. 2014. A Supervised Approach to Predict the Hierarchical Structure of Conversation Threads for Comments. The Scientific World Journal 2014: e479746. http://doi.org/10.1155/2014/479746","paperID":"None"},{"content":"A Bambina. 2007. Online Social Support: The Interplay of Social Networks and Computer-Mediated Communication. Cambria Press.","paperID":"None"},{"content":"Azy Barak, Meyran Boniel-Nissim, and John Suler. 2008. Fostering empowerment in online support groups. Computers in Human Behavior 24, 5: 1867--1883. http://doi.org/10.1016/j.chb.2008.02.004","paperID":"None"},{"content":"SP Borgatti, MG Everett, and LC Freeman. 2002. Ucinet for Windows: Software for Social Network Analysis. Analytic Technologies.","paperID":"None"},{"content":"Stephen P Borgatti and Martin G Everett. 2000. Models of core/periphery structures. Social Networks 21, 4: 375--395. http://doi.org/10.1016/S03788733(99)00019--2","paperID":"None"},{"content":"Susan L. Bryant, Andrea Forte, and Amy Bruckman. 2005. Becoming Wikipedian: Transformation of Participation in a Collaborative Online Encyclopedia. Proceedings of the 2005 International ACM SIGGROUP Conference on Supporting Group Work, ACM, 1--10. http://doi.org/10.1145/1099203.1099205","paperID":"None"},{"content":"R. W. Burgoyne. 2005. Exploring direction of causation between social support and clinical outcome for HIV-positive adults in the context of highly active antiretroviral therapy. AIDS Care 17, 1: 111--124. http://doi.org/10.1080/09540120412331305179","paperID":"None"},{"content":"Brian S. Butler. 2001. Membership Size, Communication Activity, and Sustainability: A Resource-Based Model of Online Social Structures. Information Systems Research 12, 4: 346--362. http://doi.org/10.1287/isre.12.4.346.9703","paperID":"None"},{"content":"Brian S. Butler, Patrick J. Bateman, Peter H. Gray, and E. Ilana Diamant. 2014. An attraction-selectionattrition theory of online community size and resilience. Mis Quarterly 38, 3: 699--728.","paperID":"None"},{"content":"Brian Butler, Lee Sproull, Sara Kiesler, and Robert Kraut. 2002. Community effort in online groups: Who does the work and why. Leadership at a distance: Research in technologically supported work: 171--194.","paperID":"None"},{"content":"Andrea Civan, David W. McDonald, Kenton T. Unruh, and Wanda Pratt. 2009. Locating patient expertise in everyday life. Proceedings of the ACM 2009 international conference on Supporting group work, ACM, 291--300. Retrieved May 15, 2015 from http://dl.acm.org/citation.cfm?id=1531718","paperID":"None"},{"content":"Andrea Civan and Wanda Pratt. 2007. Threading Together Patient Expertise. AMIA Annual Symposium Proceedings 2007: 140--144.","paperID":"None"},{"content":"Kevin Crowston, A. Wiggins, and J. Howison. 2010. Analyzing Leadership Dynamics in Distributed Group Communication. 2010 43rd Hawaii International Conference on System Sciences (HICSS), 1--10. http://doi.org/10.1109/HICSS.2010.62","paperID":"None"},{"content":"K. Crowston, K. Wei, Q. Li, and J. Howison. 2006. Core and periphery in Free/Libre and Open Source software team communications. System Sciences, 2006. HICSS'06. Proceedings of the 39th Annual Hawaii International Conference on, 118a-118a. Retrieved December 25, 2012 from http://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=1","paperID":"None"},{"content":"Peter Csermely, András London, Ling-Yun Wu, and Brian Uzzi. 2013. Structure and dynamics of core/periphery networks. Journal of Complex Networks 1, 2: 93--123. http://doi.org/10.1093/comnet/cnt016","paperID":"None"},{"content":"Mihai Cucuringu, M. Puck Rombach, Sang Hoon Lee, and Mason A. Porter. 2014. Detection of CorePeriphery Structure in Networks Using Spectral Methods and Geodesic Paths. arXiv:1410.6572 [condmat, physics:physics]. Retrieved May 16, 2015 from http://arxiv.org/abs/1410.6572","paperID":"None"},{"content":"Carolyn E. Cutrona and Daniel W. Russell. 1990. Type of social support and specific stress: Toward a theory of optimal matching. In Social support: An interactional view, B. R. Sarason, I. G. Sarason and G. R. Pierce (eds.). John Wiley & Sons, Oxford, England, 319--366.","paperID":"None"},{"content":"K. P. Davison, J. W. Pennebaker, and S. S. Dickerson. 2000. Who talks? The social psychology of illness support groups. The American Psychologist 55, 2: 205-217.","paperID":"None"},{"content":"M. De Choudhury, W. A Mason, J. M Hofman, and D. J Watts. 2010. Inferring relevant social networks from interpersonal communication. Proceedings of the 19th international conference on World wide web, 301--310.","paperID":"None"},{"content":"Jerry Finn. 1999. An exploration of helping processes in an online self-help group focusing on issues of disability. Health & Social Work 24, 3: 220--31.","paperID":"None"},{"content":"D. Fisher, M. Smith, and H.T. Welser. 2006. You Are Who You Talk To: Detecting Roles in Usenet Newsgroups. Proceedings of the 39th Annual Hawaii International Conference on System Sciences, 2006. HICSS '06, 59b--59b. http://doi.org/10.1109/HICSS.2006.536","paperID":"None"},{"content":"Mary P. Gallant. 2003. The Influence of Social Support on Chronic Illness Self-Management: A Review and Directions for Research. Health Education & Behavior 30, 2: 170--195. http://doi.org/10.1177/1090198102251030","paperID":"None"},{"content":"Preetinder Gill and Whisnant. 2012. A qualitative assessment of an online support community for ovarian cancer patients. Patient Related Outcome Measures: 51. http://doi.org/10.2147/PROM.S36034","paperID":"None"},{"content":"E. Gleave, H.T. Welser, T.M. Lento, and M.A. Smith. 2009. A Conceptual and Operational Definition of \"Social Role\" in Online Community. 42nd Hawaii International Conference on System Sciences, 2009. HICSS '09, 1--11. http://doi.org/10.1109/HICSS.2009.6","paperID":"None"},{"content":"Andreea Daniela Gorbatai and M. Piskorski. 2012. Social Structure of Contributions to Wikipedia. Harvard Business School. Retrieved September 23, 2013 from http://www.wjh.harvard.edu/~hos/papers/AndreeaGorb attai/AndreeaGorbattai.pdf","paperID":"None"},{"content":"Benjamin H. Gottlieb. 1985. Social Networks and Social Support: An Overview of Research, Practice, and Policy Implications. Health Education & Behavior 12, 1: 5--22. http://doi.org/10.1177/109019818501200102","paperID":"None"},{"content":"Mark Granovetter. 1973. The Strength of Weak Ties. Social Science Research Network, Rochester, NY. Retrieved April 28, 2014 from http://papers.ssrn.com/abstract=1504479","paperID":"None"},{"content":"Andrea Hartzler and Wanda Pratt. 2011. Managing the personal side of health: how patient expertise differs from the expertise of clinicians. Journal of medical Internet research 13, 3.","paperID":"None"},{"content":"Starr Roxanne Hiltz. 1993. The Network Nation: Human Communication Via Computer. MIT Press.","paperID":"None"},{"content":"James Howison, Andrea Wiggins, and Kevin Crowston. 2011. Validity Issues in the Use of Social Network Analysis with Digital Trace Data. Journal of the Association for Information Systems 12, 12: 767--797.","paperID":"None"},{"content":"Jina Huh. 2015. Clinical Questions in Online Health Communities: The Case of \"See your doctor\" Threads. Proceeding of the 2015 conference on Computer Supported Cooperative Work, ACM Press.","paperID":"None"},{"content":"B. H. Kaplan, J. C. Cassel, and S. Gore. 1977. Social support and health. Medical Care 15, 5 SUPPL: 47--58.","paperID":"None"},{"content":"Chen Lin, Jiang-Ming Yang, Rui Cai, Xin-Jing Wang, and Wei Wang. 2009. Simultaneously Modeling Semantics and Structure of Threaded Discussions: A Sparse Coding Approach and Its Applications. Proceedings of the 32Nd International ACM SIGIR Conference on Research and Development in Information Retrieval, ACM, 131--138. http://doi.org/10.1145/1571941.1571966","paperID":"None"},{"content":"Yunzhong Liu, Feng Chen, and Yi Chen. 2013. Learning Thread Reply Structure on Patient Forums. Proceedings of the 2013 International Workshop on Data Management & Analytics for Healthcare, ACM, 1--4. http://doi.org/10.1145/2512410.2512426","paperID":"None"},{"content":"Diane Maloney-Krichmar and Jenny Preece. 2005. A Multilevel Analysis of Sociability, Usability, and Community Dynamics in an Online Health Community. ACM Trans. Comput.-Hum. Interact. 12, 2: 201--232. http://doi.org/10.1145/1067860.1067864","paperID":"None"},{"content":"Audris Mockus, Roy T. Fielding, and James D. Herbsleb. 2002. Two Case Studies of Open Source Software Development: Apache and Mozilla. ACM Trans. Softw. Eng. Methodol. 11, 3: 309--346. http://doi.org/10.1145/567793.567795","paperID":"None"},{"content":"Katherine Panciera, Aaron Halfaker, and Loren Terveen. 2009. Wikipedians Are Born, Not Made: A Study of Power Editors on Wikipedia. Proceedings of the ACM 2009 International Conference on Supporting Group Work, ACM, 51--60. http://doi.org/10.1145/1531674.1531682","paperID":"None"},{"content":"David Martin Powers. 2011. Evaluation: from Precision, Recall and F-measure to ROC, Informedness, Markedness and Correlation. Retrieved January 8, 2016 from http://dspace.flinders.edu.au/xmlui/handle/2328/27165","paperID":"None"},{"content":"J. Preece and B. Shneiderman. 2009. The Reader-toLeader Framework: Motivating technology-mediated social participation. AIS Transactions on HumanComputer Interaction 1, 1: 5.","paperID":"None"},{"content":"Yuqing Ren, Robert Kraut, and Sara Kiesler. 2007. Applying Common Identity and Bond Theory to Design of Online Communities. Organization Studies 28, 3: 377--408. http://doi.org/10.1177/0170840607076007","paperID":"None"},{"content":"Yuqing Ren, Robert Kraut, Sara Kiesler, and Paul Resnick. 2012. Encouraging commitment in online communities. Building successful online communities: Evidence-based social design: 77--125.","paperID":"None"},{"content":"Catherine Ridings and Molly McLure Wasko. 2010. Online discussion group sustainability: Investigating the interplay between structural dynamics and social dynamics over time. Journal of the Association for Information Systems 11, 2. Retrieved from http://aisel.aisnet.org/jais/vol11/iss2/1","paperID":"None"},{"content":"J. Brian Rollman, Kevin Krug, and Fredrick Parente. 2000. The Chat Room Phenomenon: Reciprocal Communication in Cyberspace. CyberPsychology & Behavior 3, 2: 161--166. http://doi.org/10.1089/109493100316003","paperID":"None"},{"content":"Karen S. Rook. 1987. Social support versus companionship: Effects on life stress, loneliness, and evaluations by others. Journal of Personality and Social Psychology 52, 6: 1132-1147. http://doi.org/http://dx.doi.org.proxy2.cl.msu.edu/10.1 037/0022-3514.52.6.1132","paperID":"None"},{"content":"Jacob Solomon and Rick Wash. 2014. Critical Mass of What? Exploring Community Growth in WikiProjects. Retrieved January 24, 2015 from http://www.aaai.org/ocs/index.php/ICWSM/ICWSM14 /paper/download/8104/8148","paperID":"None"},{"content":"Margarita Staniute, Julija Brozaitiene, and Robertas Bunevicius. 2013. Effects of Social Support and Stressful Life Events on Health-Related Quality of Life in Coronary Artery Disease Patients: The Journal of Cardiovascular Nursing 28, 1: 83--89. http://doi.org/10.1097/JCN.0b013e318233e69d","paperID":"None"},{"content":"Joni L. Strom and Leonard E. Egede. 2012. The Impact of Social Support on Outcomes in Adult Patients with Type 2 Diabetes: A Systematic Review. Current diabetes reports 12, 6: 769--781. http://doi.org/10.1007/s11892-012-0317-0","paperID":"None"},{"content":"Bongwon Suh, Gregorio Convertino, Ed H. Chi, and Peter Pirolli. 2009. The Singularity is Not Near: Slowing Growth of Wikipedia. Proceedings of the 5th International Symposium on Wikis and Open Collaboration, ACM, 8:1--8:10. http://doi.org/10.1145/1641309.1641322","paperID":"None"},{"content":"Shelley E. Taylor. 2011. Social support: A review. In The Oxford Handbook of Health Psychology, Howard S. Friedman (ed.). Oxford University Press, 189--214. Retrieved April 1, 2015 from https://books.google.com/books?hl=en&lr=&id=apBo AgAAQBAJ&oi=fnd&pg=PA189&dq=social+support :+a+review+taylor&ots=73zdmsH6vO&sig=PaBBp6F yaLCBBXf3ZYTtokBcGwQ","paperID":"None"},{"content":"Van Der Molem. 1999. Relating information needs to the cancer experience: 1. Information as a key coping strategy. European Journal of Cancer Care 8, 4: 238--244. http://doi.org/10.1046/j.1365--2354.1999.00176.x","paperID":"None"},{"content":"Hongning Wang, Chi Wang, ChengXiang Zhai, and Jiawei Han. 2011. Learning Online Discussion Structures by Conditional Random Fields. Proceedings of the 34th International ACM SIGIR Conference on Research and Development in Information Retrieval, ACM, 435-444. http://doi.org/10.1145/2009916.2009976","paperID":"None"},{"content":"Xi Wang, Kang Zhao, and Nick Street. 2014. Social Support and User Engagement in Online Health Communities. In Smart Health, Xiaolong Zheng, Daniel Zeng, Hsinchun Chen, Yong Zhang, Chunxiao Xing and Daniel B. Neill (eds.). Springer International Publishing, 97--110. Retrieved September 5, 2015 from http://link.springer.com/chapter/10.1007/978--3--31908416--9_10","paperID":"None"},{"content":"Yi-chia Wang, Mahesh Joshi, William Cohen, and Carolyn Rosé. 2008. Recovering Implicit Thread Structure in Newsgroup Style Conversations.","paperID":"None"},{"content":"Yi-Chia Wang, Robert Kraut, and John M. Levine. 2012. To Stay or Leave?: The Relationship of Emotional and Informational Support to Commitment in Online Health Support Groups. Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work, ACM, 833--842. http://doi.org/10.1145/2145204.2145329","paperID":"None"},{"content":"Barry Wellman and Scot Wortley. 1990. Different Strokes from Different Folks: Community Ties and Social Support. American Journal of Sociology 96, 3: 558--588.","paperID":"None"},{"content":"Howard T. Welser, Eric Gleave, Danyel Fisher, and Marc Smith. 2007. Visualizing the signatures of social roles in online discussion groups, The. Journal of Social Structure: 8.","paperID":"None"},{"content":"Social Support for Health: An Increased Role in Health Care? | Peers For Progress. Retrieved July 29, 2015 from http://peersforprogress.org/pfp_blog/socialsupport-for-health-an-increased-role-in-health-care/","paperID":"None"},{"content":"Alexa - Top Sites by Category: Health. Retrieved January 24, 2015 from http://www.alexa.com/topsites/category/Top/Health","paperID":"None"},{"content":"Guidelines for Academic Requesters - WeAreDynamo Wiki. Retrieved July 17, 2015 from http://wiki.wearedynamo.org/index.php/Guidelines_for _Academic_Requesters","paperID":"None"}],"title":"A Sociotechnical Mechanism for Online Support Provision","filename":"CHI16/p3559","authors":["Joshua Introne","Bryan Semaan","Sean Goggins"],"conference":"CHI '16"}