{"paperId":2858522,"citation":[],"reference":[{"content":"Rachel F Adler and Raquel Benbunan-Fich. 2013. Selfinterruptions in discretionary multitasking. Computers in Human Behavior, 29 (4). 1441--1449. DOI: 10.1016/j.chb.2013.01.040","paperID":"None"},{"content":"Deepak Akkil, Jari Kangas, Jussi Rantala, Poika Isokoski, Oleg Spakov and Roope Raisamo. 2015. Glance Awareness and Gaze Interaction in Smartwatches. in Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 1271--1276. DOI: 10.1145/2702613.2732816","paperID":"None"},{"content":"Patrick Baudisch and Gerry Chu. 2009. Back-of-device interaction allows creating very small touch devices. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1923--1932. DOI: 10.1145/1518701.1518995","paperID":"None"},{"content":"Dennis B. Beringer. 1984. Caculator Watches as Data Entry Devices: The Fundamental Things Apply as Time Goes by. Proceedings of the Human Factors and Ergonomics Society Annual Meeting, 28 (3). 253--257. DOI: 10.1177/154193128402800313","paperID":"None"},{"content":"Jelmer P. Borst, Niels A. Taatgen and Hedderik van Rijn. 2015. What Makes Interruptions Disruptive?: A Process-Model Account of the Effects of the Problem State Bottleneck on Task Interruption and Resumption. in Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, Seoul, South Korea, 2971--2980. DOI: 10.1145/2702123.2702156","paperID":"None"},{"content":"Barry Brown, Moira McGregor and Eric Laurier. 2013. iPhone in vivo: video analysis of mobile device use. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, DOI: 10.1145/2470654.2466132","paperID":"None"},{"content":"Barry Brown, Moira McGregor and Donald McMillan. 2014. 100 days of iPhone use: understanding the details of mobile device use. in Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, ACM, Toronto, ON, Canada, 223--232. DOI: 10.1145/2628363.2628377","paperID":"None"},{"content":"Barry Brown, Moira McGregor and Donald McMillan. 2015. Searchable Objects: Search in Everyday Conversation. in Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computi, ACM, Vancouver, Canada., 508517. DOI: 10.1145/2675133.2675206","paperID":"None"},{"content":"Marta E Cecchinato, Anna L Cox and Jon Bird. 2015. Smartwatches: the Good, the Bad and the Ugly? in Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 2133--2138. DOI:","paperID":"None"},{"content":"1145/2702613.2732837 10. Stephen J Ceci and Urie Bronfenbrenner. 1985. \"Don't Forget to Take the Cupcakes out of the Oven\": Prospective Memory, Strategic Time-Monitoring, and Context. Child development. 152--164. DOI: 10.2307/1130182","paperID":"None"},{"content":"Jae-Min Cha, Eunjung Choi and Jihyoun Lim. 2015. Virtual Sliding QWERTY: A new text entry method for smartwatches using Tap-N-Drag. Applied ergonomics, 51. 263--272. DOI: 10.1016/j.apergo.2015.05.008","paperID":"None"},{"content":"Wei-Hung Chen. 2015. Blowatch: Blowable and Handsfree Interaction for Smartwatches. in Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 103--108. DOI: 10.1145/2702613.2726961","paperID":"None"},{"content":"Hyeonjoong Cho, Miso Kim and Kyeongeun Seo. 2014. A text entry technique for wrist-worn watches with tiny touchscreens. in Proceedings of the adjunct publication of the 27th annual ACM symposium on User interface software and technology, ACM, 79--80. DOI: 10.1145/2658779.2658785","paperID":"None"},{"content":"Kate Crawford, Jessa Lingel and Tero Karppi. 2015. Our metrics, ourselves: A hundred years of self-tracking from the weight scale to the wrist wearable device. European Journal of Cultural Studies, 18 (4--5). 479496. DOI: 10.1177/1367549415584857","paperID":"None"},{"content":"Mary Czerwinski, Edward Cutrell and Eric Horvitz. 2000. Instant messaging and interruption: Influence of task type on performance. in OZCHI 2000 conference proceedings, 361--367.","paperID":"None"},{"content":"Mark D Dunlop, Andreas Komninos and Naveen Durga. 2014. Towards high quality text entry on smartwatches. in CHI'14 Extended Abstracts on Human Factors in Computing Systems, ACM, 2365--2370. DOI: 10.1145/2559206.2581319","paperID":"None"},{"content":"Grace de la Flor, Paul Luff, Marina Jirotka, John Pybus, Ruth Kirkham and Annamaria Carusi. 2010. The Case of the Disappearing Ox: Seeing Through Digital Images to an Analysis of Ancient Texts. in Proceedings of the 28th international conference on Human factors in computing systems, ACM, Atlanta, Georgia, USA, 473482. DOI: 10.1145/1753326.1753397","paperID":"None"},{"content":"Wayne C. W. Giang, Inas Shanti, Huei-Yen Winnie Chen, Alex Zhou and Birsen Donmez. 2015. Smartwatches vs. smartphones: a preliminary report of driver behavior and perceived risk while responding to notifications. in Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, ACM, Nottingham, United Kingdom, 154--161. DOI: 10.1145/2799250.2799282","paperID":"None"},{"content":"Pentti Haddington, Tiina Keisanen, Lorenza Mondada and Maurice Nevile. 2014. Multiactivity in social interaction: Beyond multitasking. John Benjamins Publishing Company.","paperID":"None"},{"content":"Christian Heath, Jon Hindmarsh and Paul Luff. 2010. Video in Qualitative Research. SAGE.","paperID":"None"},{"content":"Christian Heath and Paul Luff. 2000. Technology in action. Cambridge university press.","paperID":"None"},{"content":"Christian Heath, M S Svensson, J Hindmarsh and P Luff. 2002. Configuring awareness. Computer Supported Cooperative Work (CSCW), 11 (3). 317--347. DOI: 10.1023/A:1021247413718","paperID":"None"},{"content":"Robert A Hennfng, Steven L Sauter, Gavriel Salvendy and Edward F Krieg JR. 1989. Microbreak length, performance, and stress in a data entry task. Ergonomics, 32 (7). 855--864. DOI: 10.1080/00140138908966848","paperID":"None"},{"content":"Niels Henze, Enrico Rukzio and Susanne Boll. 2011. 100,000,000 taps: analysis and improvement of touch performance in the large. in Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services, ACM, 133--142. DOI: 10.1145/2037373.2037395","paperID":"None"},{"content":"Tony Hey and Anne Trefethen. 2003. The Data Deluge: An e-Science Perspective. in Grid Computing: Making the Global Infrastructure a reality, John Wiley & Sons, Ltd 809--824.","paperID":"None"},{"content":"Geoffrey Hinton, Li Deng, Dong Yu, George E Dahl, Abdel-rahman Mohamed, Navdeep Jaitly, Andrew Senior, Vincent Vanhoucke, Patrick Nguyen and Tara N Sainath. 2012. Deep neural networks for acoustic modeling in speech recognition: The shared views of four research groups. Signal Processing Magazine, IEEE, 29 (6). 82--97.","paperID":"None"},{"content":"Christian Holz and Patrick Baudisch. 2010. The generalized perceived input point model and how to double touch accuracy by extracting fingerprints. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 581--590. DOI: 10.1145/1753326.1753413","paperID":"None"},{"content":"Christian Holz and Patrick Baudisch. 2011. Understanding touch. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2501--2510. DOI: 10.1145/1978942.1979308","paperID":"None"},{"content":"Jonggi Hong, Seongkook Heo, Poika Isokoski and Geehyuk Lee. 2015. SplitBoard: A Simple Split Soft Keyboard for Wristwatch-sized Touch Screens. in Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 12331236. DOI: 10.1145/2702123.2702273","paperID":"None"},{"content":"Xuedong Huang, James Baker and Raj Reddy. 2014. A historical perspective of speech recognition. Communications of the ACM, 57 (1). 94--103.","paperID":"None"},{"content":"Shamsi T Iqbal and Eric Horvitz. 2007. Disruption and recovery of computing tasks: field study, analysis, and directions. in Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 677--686. DOI: 10.1145/1240624.1240730","paperID":"None"},{"content":"Tero Jokela, Jarno Ojala and Thomas Olsson. 2015. A Diary Study on Combining Multiple Information Devices in Everyday Activities and Tasks. in Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3903--3912. DOI: 10.1145/2702123.2702211","paperID":"None"},{"content":"Oskar Juhlin. 2015. Digitizing fashion: software for wearable devices. interactions, 22 (3). 44--47.","paperID":"None"},{"content":"Amy K Karlson, Benjamin B Bederson and John SanGiovanni. 2005. AppLens and launchTile: two designs for one-handed thumb use on small devices. in Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 201--210. DOI: 10.1145/1054972.1055001","paperID":"None"},{"content":"Andreas Komninos and Mark Dunlop. 2014. Text input on a smart watch. Pervasive Computing, IEEE, 13 (4). 50--58.","paperID":"None"},{"content":"Sven Kratz and Michael Rohs. 2009. HoverFlow: expanding the design space of around-device interaction. in Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services, ACM, 4. DOI: 10.1145/1613858.1613864","paperID":"None"},{"content":"John Krumm, Gerry Cermak and Eric Horvitz. 2003. Rightspot: A novel sense of location for a smart personal object. in (Dey, A., Schmidt, A. and McCarthy, J. eds). UbiComp 2003: Ubiquitous Computing, Springer Berlin Heidelberg, 36--43.","paperID":"None"},{"content":"Luis Leiva, Matthias Bhömer, Sven Gehring and Antonio Krüger. 2012. Back to the app: the costs of mobile application interruptions. in Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services, ACM, San Francisco, California, USA, 291--294. DOI: 10.1145/2371574.2371617","paperID":"None"},{"content":"Gilly Leshed and Phoebe Sengers. 2011. I lie to myself that i have freedom in my own schedule: productivity tools and experiences of busyness. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 905--914. DOI: 10.1145/1978942.1979077","paperID":"None"},{"content":"K. Lyons and H. Profita. 2014. The Multiple Dispositions of On-Body and Wearable Devices. Pervasive Computing, IEEE, 13 (4). 24--31. DOI: 10.1109/MPRV.2014.79","paperID":"None"},{"content":"Kent Lyons. 2015. What can a dumb watch teach a smartwatch?: informing the design of smartwatches. in Proceedings of the 2015 ACM International Symposium on Wearable Computers, ACM, 3--10. DOI: 10.1145/2802083.2802084","paperID":"None"},{"content":"X Malcolm, Alex Haley and MS Handler. 1992. The autobiography of Malcolm X. Ballantine Books New York.","paperID":"None"},{"content":"Thomas L Martin. 2002. Time and time again: Parallels in the development of the watch and the wearable computer. in Wearable Computers, 2002.(ISWC 2002). Proceedings. Sixth International Symposium on, IEEE, 5--11. DOI: 10.1109/ISWC.2002.1167212","paperID":"None"},{"content":"Donald McMillan, Moira McGregor and Barry Brown. 2015. From in the wild to in vivo: Video Analysis of Mobile Device Use. in Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, ACM, 494--503. DOI: 0.1145/2785830.2785883","paperID":"None"},{"content":"Lewis Mumford and Langdon Winner. 2010. Technics and civilization. University of Chicago Press.","paperID":"None"},{"content":"Michael Nebeling, Anhong Guo, Alexandra To, Steven Dow, Jaime Teevan and Jeffrey P Bigham. 2015. WearWrite: Orchestrating the Crowd to Complete Complex Tasks from Wearables. in UIST '15 Adjunct Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, ACM, 39--40. DOI: 10.1145/2815585.2817782","paperID":"None"},{"content":"Kenton P. O'Hara, Michael Massimi, Richard Harper, Simon Rubens and Jessica Morris. 2014. Everyday dwelling with WhatsApp. in Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, ACM, Baltimore, Maryland, USA, 1131--1143. DOI: 10.1145/2531602.2531679","paperID":"None"},{"content":"Kenton P. O'Hara, Alex Taylor, William Newman and Abigail J. Sellen. 2002. Understanding the materiality of writing from multiple sources. International journal of human-computer studies, 56 (3). 269--305.","paperID":"None"},{"content":"Ian Oakley and Doyoung Lee. 2014. Interaction on the edge: offset sensing for small devices. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 169--178. DOI: 10.1145/2556288.2557138","paperID":"None"},{"content":"Stephen Oney, Chris Harrison, Amy Ogan and Jason Wiese. 2013. ZoomBoard: a diminutive qwerty soft keyboard using iterative zooming for ultra-small devices. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 27992802. DOI: 10.1145/2470654.2481387","paperID":"None"},{"content":"Pekka Parhi, Amy K Karlson and Benjamin B Bederson. 2006. Target size study for one-handed thumb use on small touchscreen devices. in Proceedings of the 8th conference on Human-computer interaction with mobile devices and services, ACM, 203--210. DOI: 10.1145/1152215.1152260","paperID":"None"},{"content":"M. Perry, K. O'Hara, A. Sellen, B. Brown and R. Harper. 2001. Dealing with Mobility: Understanding access anytime, anywhere. ACM Transactions on computer human interaction, 8 (4). 323--347.","paperID":"None"},{"content":"Martin Pielot, Karen Church and Rodrigo de Oliveira. 2014. An in-situ study of mobile phone notifications. in Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, ACM, 233--242. DOI: 10.1145/2628363.2628364","paperID":"None"},{"content":"Christian Piguet. 2002. The First Quartz Electronic Watch. in (Hochet, B., Acosta, A. and Bellido, M. eds). Integrated Circuit Design. Power and Timing Modeling, Optimization and Simulation, Springer Berlin Heidelberg, 1--15.","paperID":"None"},{"content":"Frederic Pollmann, Dirk Wenig and Rainer Malaka. 2014. HoverZoom: making on-screen keyboards more accessible. in CHI'14 Extended Abstracts on Human Factors in Computing Systems, ACM, 1261--1266. DOI: 10.1145/2559206.2581173","paperID":"None"},{"content":"Andrew K Przybylski and Netta Weinstein. 2013. Can you connect with me now? How the presence of mobile communication technology influences face-to-face conversation quality. Journal of Social and Personal Relationships, 30 (3). 237--246.","paperID":"None"},{"content":"Reza Rawassizadeh, Blaine A Price and Marian Petre. 2014. Wearables: has the age of smartwatches finally arrived? Communications of the ACM, 58 (1). 45--47.","paperID":"None"},{"content":"James A Roberts and Meredith E David. 2016. My life has become a major distraction from my cell phone: Partner phubbing and relationship satisfaction among romantic partners. Computers in Human Behavior, 54. 134--141.","paperID":"None"},{"content":"Anne Roudaut, Stéphane Huot and Eric Lecolinet. 2008. TapTap and MagStick: improving one-handed target acquisition on small touch-screens. in Proceedings of the working conference on Advanced visual interfaces, ACM, 146--153. DOI: 10.1145/1385569.1385594","paperID":"None"},{"content":"Jeffrey M Rzeszotarski, Ed Chi, Praveen Paritosh and Peng Dai. 2013. Inserting micro-breaks into crowdsourcing workflows. in First AAAI Conference on Human Computation and Crowdsourcing,","paperID":"None"},{"content":"F. Sana, T. Weston and N.J. Cepeda. 2012. Laptop Multitasking Hinders Classroom Learning for Both Users and Nearby Peers. Computers & Education","paperID":"None"},{"content":"Steven Schirra and Frank R Bentley. 2015. It's kind of like an extra screen for my phone: Understanding Everyday Uses of Consumer Smart Watches. in Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 2151--2156. DOI: 10.1145/2702613.2732931","paperID":"None"},{"content":"Mark T Smith. 2007. Reconciling ICT and Wearable Design: Ten Lessons from Working with Swatch. The Role of Design in Wearable Computing, 16","paperID":"None"},{"content":"Hagen Soltau and Alex Waibel. 1998. On the influence of hyperarticulated speech on recognition performance. in ICSLP-98. International Conference on Spoken Language Processing,","paperID":"None"},{"content":"Bernhard Suhm, Brad Myers and Alex Waibel. 1996. Interactive recovery from speech recognition errors in speech user interfaces. in Spoken Language, 1996. ICSLP 96. Proceedings., Fourth International Conference on, IEEE, 865--868. DOI: 10.1109/ICSLP.1996.607738","paperID":"None"},{"content":"Melanie Swan. 2012. Sensor Mania! The Internet of Things, Wearable Computing, Objective Metrics, and the Quantified Self 2.0. Journal of Sensor and Actuator Networks, 1 (3). 217.","paperID":"None"},{"content":"J Gregory Trafton and Christopher A Monk. 2007. Task interruptions. Reviews of human factors and ergonomics, 3 (1). 111--126.","paperID":"None"},{"content":"Wouter Van Vlaenderen, Jens Brulmans, Jo Vermeulen and Johannes Schöning. 2015. WatchMe: A Novel Input Method Combining a Smartwatch and Bimanual Interaction. in Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 2091--2095. DOI: 10.1145/2702613.2732789","paperID":"None"},{"content":"Daisuke Wakabayashi. 2015. Apple Watch Users Discover Another Way to Go 'Hands Free'. Retrieved December, 27, 2015 from http://www.wsj.com/articles/nosy-apple-watch-usersdiscover-another-way-to-go-hands-free-1451077454","paperID":"None"},{"content":"Junjue Wang, Kaichen Zhao, Xinyu Zhang and Chunyi Peng. 2014. Ubiquitous keyboard for small mobile devices: harnessing multipath fading for fine-grained keystroke localization. in Proceedings of the 12th annual international conference on Mobile systems, applications, and services, ACM, 14--27. DOI: 10.1145/2594368.2594384","paperID":"None"},{"content":"Robert Xiao, Gierad Laput and Chris Harrison. 2014. Expanding the input expressivity of smartwatches with mechanical pan, twist, tilt and click. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 193--196. DOI: 10.1145/2556288.2557017","paperID":"None"}],"abstract":"In recent years, the smartwatch has returned as a form factor for mobile computing with some success. Yet it is not clear how smartwatches are used and integrated into everyday life differently from mobile phones. For this paper, we used wearable cameras to record twelve participants' daily use of smartwatches, collecting and analysing incidents where watches were used from over 34 days of user recording. This allows us to analyse in detail 1009 watch uses. Using the watch as a timepiece was the most common use, making up 50% of interactions, but only 14% of total watch usage time. The videos also let us examine why and how smartwatches are used for activity tracking, notifications, and in combination with smartphones. In discussion, we return to a key question in the study of mobile devices: how are smartwatches integrated into everyday life, in both the actions that we take and the social interactions we are part of?","title":"Smartwatch in vivo","filename":"CHI16/p5456","authors":["Stefania Pizza","Barry Brown","Donald McMillan","Airi Lampinen"],"conference":"CHI '16"}