{"paperId":2858094,"citation":[],"abstract":"There is an increasing demand to encourage inclusivity in the design of digital services. In response to this issue we have created App Movement, a platform that enables the promotion, collaborative design, and deployment of community-commissioned mobile applications. The platform facilitates collaborative customization of a common app template, for which the development and deployment of the app is fully automated. We describe the motivation, design and implementation of App Movement, and report the findings from an 8 month deployment wherein 27 campaigns were created, 11 of which have been successful, and over 1,600 users pledged their support using the platform. We present three case studies to demonstrate its use and adoption in successful and unsuccessful campaigns. We discuss the implications of these studies, including questions of governance (ownership of content, liability of user generated content and moderation), sustainability and the potential to extend App Movement beyond location-based review apps.","reference":[{"content":"Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andy Garbett. 2015. FeedFinder: A Location-Mapping Mobile Application for Breastfeeding Women. Human Factors in Computing Systems CHI 15.","paperID":"None"},{"content":"Justin Cheng and Michael Bernstein. 2014. Catalyst: triggering collective action with thresholds. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14, ACM Press, 1211--1221. http://doi.org/10.1145/2531602.2531635","paperID":"None"},{"content":"Clara Crivellaro, Rob Comber, John Bowers, Peter C. Wright, and Patrick Olivier. 2014. A pool of dreams: facebook, politics and the emergence of a social movement. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 3573--3582. http://doi.org/10.1145/2556288.2557100","paperID":"None"},{"content":"Laura Dabbish, Colleen Stuart, Jason Tsay, and Jim Herbsleb. 2012. Social Coding in GitHub: Transparency and Collaboration in an Open Software Repository. Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work, 2011: 1277--1286. http://doi.org/10.1145/2145204.2145396","paperID":"None"},{"content":"Thomas Feeney. 2015. Why I set up the Greek bailout crowdfund. The Guardian. Retrieved from http://gu.com/p/4a9p5/sbl","paperID":"None"},{"content":"Gerhard Fischer and Eric Scharff. 2000. Meta-design: design for designers. Proceedings of the conference on Designing interactive systems processes, practices, methods, and techniques DIS '00, L D: 396--405. http://doi.org/10.1145/347642.347798","paperID":"None"},{"content":"Google. Google reCAPTCHA. Retrieved from https://www.google.com/recaptcha","paperID":"None"},{"content":"Scott a. Hale, Helen Margetts, and Taha Yasseri. 2013. Petition growth and success rates on the UK No. 10 Downing Street website. Proceedings of the 5th Annual ACM Web Science Conference on - WebSci '13, 10: 132--138. http://doi.org/10.1145/2464464.2464518","paperID":"None"},{"content":"Philip N Howard, Aiden Duffy, Deen Freelon, Muzammil Hussain, Will Mari, and Mrawa Mazaid. 2011. What Was the Role of Social Media During the Arab Spring? Project on Information Technology and Political Islam: 1--30.","paperID":"None"},{"content":"Sunyoung Kim, Jennifer Mankoff, and Eric Paulos. 2013. Sensr: Evaluating A Flexible Framework for Authoring Mobile Data-Collection Tools for Citizen Science. Proceedings of the 2013 Conference on Computer Supported Cooperative Work CSCW '13: 1453--1462. http://doi.org/10.1145/2441776.2441940","paperID":"None"},{"content":"Stephen F King and Paul Brown. 2007. Fix My Street or Else: Using the Internet to Voice Local Public Service Concerns. Computers and Society: 72--80. http://doi.org/10.1145/1328057.1328076","paperID":"None"},{"content":"TripAdvisor LLC. Trip Advisor. Retrieved September 1, 2015 from http://www.tripadvisor.co.uk/","paperID":"None"},{"content":"Steve Mann, Jason Nolan, and Barry Wellman. 2003. Sousveillance?: Inventing and Using Wearable Computing Devices for Data Collection in Surveillance Environments?. Surveillance and Society 1, 3: 331--355. Retrieved from http://www.surveillance-andsociety.org/articles1(3)/sousveillance.pdf","paperID":"None"},{"content":"Jennifer Marlow, Laura Dabbish, and Jim Herbsleb. 2013. Impression Formation in Online Peer Production?: Activity Traces and Personal Profiles in GitHub. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW: 117--128. http://doi.org/10.1145/2441776.2441792","paperID":"None"},{"content":"Trevor van Mierlo. 2014. The 1% rule in four digital health social networks: an observational study. Journal of medical Internet research 16, 2: e33. http://doi.org/10.2196/jmir.2966","paperID":"None"},{"content":"Patrick Olivier and Peter Wright. 2015. Digital civics: Taking a Local Turn. interactions 22, 4: 61--63. http://doi.org/10.1145/2776885","paperID":"None"},{"content":"Johan Oomen and Lora Aroyo. 2011. Crowdsourcing in the Cultural Heritage Domain?: Opportunities and Challenges. C&T '11 Proceedings of the 5th International Conference on Communities and Technologies, July: 138--149. http://doi.org/10.1145/2103354.2103373","paperID":"None"},{"content":"OpenStreetMap Foundation. Open Street Map. Retrieved September 1, 2015 from http://openstreetmap.org","paperID":"None"},{"content":"Kickstarter PBC. Kickstarter. Retrieved September 1, 2015 from https://www.kickstarter.com/","paperID":"None"},{"content":"Royal Society for the Protection of Birds. 2015. Big Garden Birdwatch 2015. Retrieved September 10, 2015 from http://www.rspb.org.uk/discoverandenjoynature/discove randlearn/birdwatch/results.aspx","paperID":"None"},{"content":"Guy Schofield, Tom Bartindale, and Peter Wright. 2015. Bootlegger: Turning Fans into Film Crew. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15: 767--776. http://doi.org/10.1145/2702123.2702229","paperID":"None"},{"content":"Trebor Scholz. 2014. Platform Cooperativism vs. the Sharing Economy. Retrieved September 14, 2015 from https://medium.com/@trebors/platform-cooperativismvs-the-sharing-economy-2ea737f1b5ad","paperID":"None"},{"content":"Stack Exchange Inc. StackOverflow. Retrieved September 1, 2015 from https://stackoverflow.com/","paperID":"None"},{"content":"Tristram Stuart. 2014. Stop food waste in Europe #StopFoodWaste. Retrieved September 1, 2015 from https://www.change.org/p/frans-timmermans-stop-foodwaste-in-europe-stopfoodwaste","paperID":"None"},{"content":"John Suler. 2005. The online disinhibition effect. International Journal of Applied Psychoanalytic Studies 2, 2: 184--188. http://doi.org/10.1002/aps.42","paperID":"None"},{"content":"Jason Tsay, Laura Dabbish, and James Herbsleb. 2014. Let's talk about it: evaluating contributions through discussion in GitHub. Proceedings of the 22nd ACM SIGSOFT International Symposium on Foundations of Software Engineering - FSE 2014. http://doi.org/10.1145/2635868.2635882","paperID":"None"},{"content":"Bogdan Vasilescu, Alexander Serebrenik, Premkumar Devanbu, and Vladimir Filkov. 2014. How Social Q & A Sites are Changing Knowledge Sharing in Open Source Software Communities. 342--354.","paperID":"None"},{"content":"Yoo Warren. 2010. Grassroots Mapping: tools for participatory and activist cartography.","paperID":"None"},{"content":"Indiegogo Greek Bailout Fund. Retrieved from https://www.indiegogo.com/projects/greek-bailout-fund","paperID":"None"}],"title":"App Movement: A Platform for Community Commissioning of Mobile Applications","filename":"CHI16/p26","authors":["Andrew Garbett","Rob Comber","Edward Jenkins","Patrick Olivier"],"conference":"CHI '16"}