{"paperId":2858342,"abstract":"Increasing numbers of American parents identify as lesbian, gay, bisexual, or transgender (LGBT). Shifting social movements are beginning to achieve greater recognition for LGBT parents and more rights for their families; however, LGBT parents still experience stigma and judgment in a variety of social contexts. We interviewed 28 LGBT parents to investigate how they navigate their online environments in light of these societal shifts. We find that 1) LGBT parents use social media sites to detect disapproval and identify allies within their social networks; 2) LGBT parents become what we call incidental advocates, when everyday social media posts are perceived as advocacy work even when not intended as such; and 3) for LGBT parents, privacy is a complex and collective responsibility, shared with children, partners, and families. We consider the complexities of LGBT parents' online disclosures in the context of shifting social movements and discuss the importance of supporting individual and collective privacy boundaries in these contexts.","citation":[],"reference":[{"content":"Gordon W. Allport. 1954. 1979. The nature of prejudice. NY.","paperID":"None"},{"content":"Paul R. Amato. 2012. The well-being of children with gay and lesbian parents. Social Science Research 41, 4: 771--774.","paperID":"None"},{"content":"Tawfiq Ammari, Priya Kumar, Cliff Lampe, and Sarita Schoenebeck. 2015. Managing Children's Online Identities: How Parents Decide what to Disclose about their Children Online. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1895--1904.","paperID":"None"},{"content":"Tawfiq Ammari and Sarita Schoenebeck. 2015. Understanding and Supporting Fathers and Fatherhood on Social Media Sites. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1905--1914.","paperID":"None"},{"content":"Belle Rose Ragins. 2004. Sexual orientation in the workplace: the unique work and career experiences of gay, lesbian and bisexual workers. In Research in Personnel and Human Resources Management. Emerald Group Publishing Limited, 35--120.","paperID":"None"},{"content":"Mary Bernstein and Renate Reimann. 2001. Queer families, queer politics: Challenging culture and the state. Columbia University Press.","paperID":"None"},{"content":"Buzz Bissinger. (2015, June 30). Caitlyn Jenner: The full story. Vanity Fair.","paperID":"None"},{"content":"Courtney Blackwell, Jeremy Birnholtz, and Charles Abbott. 2014. Seeing and being seen: Co-situation and impression formation using Grindr, a location-aware gay dating app. New Media & Society: 1461444814521595.","paperID":"None"},{"content":"danah boyd. 2012. The Politics of \"Real Names.\" Commun. ACM 55, 8: 29--31.","paperID":"None"},{"content":"danah boyd. 2008. Taken out of context: American teen sociality in networked publics. ProQuest.","paperID":"None"},{"content":"Rose Chapman, Rochelle Watkins, Tess Zappia, Pam Nicol, and Linda Shields. 2012. Nursing and medical students' attitude, knowledge and beliefs regarding lesbian, gay, bisexual and transgender parents seeking health care for their children. Journal of Clinical Nursing 21, 7--8: 938--945.","paperID":"None"},{"content":"Lisa M. Diamond and Sarah Lucas. 2004. Sexual Minority and Heterosexual Youths' Peer Relationships: Experiences, Expectations, and Implications for Well Being. Journal of Research on Adolescence 14, 3: 313--340.","paperID":"None"},{"content":"Ron Eglash. 2004. Appropriating technology: Vernacular science and social power. University of MN Press.","paperID":"None"},{"content":"Nicole B. Ellison, Jessica Vitak, Charles Steinfield, Rebecca Gray, and Cliff Lampe. 2011. Negotiating Privacy Concerns and Social Capital Needs in a Social Media Environment. In Privacy Online, Sabine Trepte and Leonard Reinecke (eds.). Springer Berlin Heidelberg, 19--32.","paperID":"None"},{"content":"Lee B. Erickson, Pamela Wisniewski, Heng Xu, John M. Carroll, Mary Beth Rosson, and Daniel F. Perkins. 2015. The boundaries between: Parental involvement in a teen's online world. Journal of the Association for Information Science and Technology.","paperID":"None"},{"content":"Robin K. Fox. 2007. One of the hidden diversities in schools: Families with parents who are lesbian or gay. Childhood Education 83, 5: 277--281.","paperID":"None"},{"content":"Alison Gash. (2015, Mar 4). Oregon Leads the Way With Nation's First Openly Bisexual Governor. Slate.","paperID":"None"},{"content":"Gary J. Gates. 2013. LGBT Parenting in the USA. eScholarship.","paperID":"None"},{"content":"Lorna Gibson and Vicki L. Hanson. 2013. Digital Motherhood: How Does Technology Help New Mothers' Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 313--322.","paperID":"None"},{"content":"William Goedel. 2015. Geosocial-networking application use in application-using gay, bisexual, and other men who have sex with men (MSM) in Atlanta, Georgia. 143rd APHA Annual Meeting and Exposition. APHA.","paperID":"None"},{"content":"Jaime M. Grant, Lisa Mottet, Justin Edward Tanis, Jack Harrison, Jody Herman, and Mara Keisling. 2011. Injustice at every turn: A report of the National Transgender Discrimination Survey. National Center for Transgender Equality.","paperID":"None"},{"content":"Mary L. Gray. 2009. Out in the country: Youth, media, and queer visibility in rural America. NYU Press.","paperID":"None"},{"content":"Mary L. Gray. 2009. Negotiating Identities/Queering Desires: Coming Out Online and the Remediation of the Coming-Out Story. Journal of Computer-Mediated Communication 14, 4: 1162--1189.","paperID":"None"},{"content":"Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, Stress, and Support During Gender Transition on Facebook. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1176--1190.","paperID":"None"},{"content":"Gregory M. Herek, John P. Capitanio, and others. 1996. \"Some of my best friends\": Intergroup contact, concealable stigma, and heterosexuals' attitudes toward gay men and lesbians. Personality and Social Psychology Bulletin 22: 412--424.","paperID":"None"},{"content":"Lynne Hillier and Lyn Harrison. 2007. Building Realities Less Limited Than Their Own: Young People Practising Same-Sex Attraction on the Internet. Sexualities 10, 1: 82--100.","paperID":"None"},{"content":"Lynne Hillier, Philomena Horsley, Chyloe Kurdas, and others. 2001. \"It's Just Easier\": The Internet as a Safety-net for Same Sex Attracted Young People. Australian Research Centre in Sex Health and Society.","paperID":"None"},{"content":"Lynne Hillier, Kimberly J. Mitchell, and Michele L. Ybarra. 2012. The Internet As a Safety Net: Findings From a Series of Online Focus Groups With LGB and Non-LGB Young People in the USA. Journal of LGBT Youth 9, 3: 225--246.","paperID":"None"},{"content":"Bernie Hogan. 2012. Pseudonyms and the Rise of the Real-Name Web. Social Science Research Network, Rochester, NY.","paperID":"None"},{"content":"Elise Hu. (2015, May 11). The First Place In East Asia To Welcome Same-Sex Marriage. NPR.org.","paperID":"None"},{"content":"Hilary Hutchinson, Wendy Mackay, Bo Westerlund, et al. 2003. Technology Probes: Inspiring Design for and with Families. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 17--24.","paperID":"None"},{"content":"Konstantinos Kazakos, Elizabeth Bales, Carman Neustaedter, Svetlana Yarosh, Joseph \"Jofish\" Kaye, and David Kirk. 2013. Exploring the Diversity of Families: Designing Technologies for the Contemporary Family Life. CHI '13 Extended Abstracts on Human Factors in Computing Systems, ACM, 3255--3258.","paperID":"None"},{"content":"Joseph G. Kosciw and Elizabeth M. Diaz. 2008. Involved, Invisible, Ignored: The Experiences of Lesbian, Gay, Bisexual and Transgender Parents and Their Children in Our Nation's K-12 Schools. Gay, Lesbian and Straight Education Network (GLSEN).","paperID":"None"},{"content":"Genet Kozik-Rosabal. 2000. \"Well We Haven't Noticed Anything Bad Going On,\" Said the Principal: Parents Speak about Their Gay Families and Schools. Education and Urban Society 32, 3: 368--89.","paperID":"None"},{"content":"Priya Kumar and Sarita Schoenebeck. 2015. The Modern Day Baby Book: Enacting Good Mothering and Stewarding Privacy on Facebook. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1302--1312.","paperID":"None"},{"content":"Serena Lambert. 2005. Gay and lesbian families: What we know and where to go from here. The Family Journal 13, 1: 43--51.","paperID":"None"},{"content":"Airi Lampinen, Vilma Lehtinen, Asko Lehmuskallio, and Sakari Tamminen. 2011. We're in It Together: Interpersonal Management of Disclosure in Social Network Services. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3217--3226.","paperID":"None"},{"content":"Pamela J. Lannutti. 2011. Examining Communication about Marriage Amendments: Same-Sex Couples and Their Extended Social Networks. Journal of Social Issues 67, 2: 264--281.","paperID":"None"},{"content":"Pamela J. Lannutti. 2013. Same-Sex Marriage and Privacy Management: Examining Couples' Communication with Family Members. Journal of Family Communication 13, 1: 60--75.","paperID":"None"},{"content":"Nicole Legate, Richard M. Ryan, and Netta Weinstein. 2012. Is Coming Out Always a \"Good Thing\"? Exploring the Relations of Autonomy Support, Outness, and Wellness for Lesbian, Gay, and Bisexual Individuals. Social Psychological and Personality Science 3, 2: 145--152.","paperID":"None"},{"content":"Bruce G. Link and Jo C. Phelan. 2001. Conceptualizing stigma. Annual review of Sociology: 363--385.","paperID":"None"},{"content":"Daphne Lofquist, USA Bureau of the Census, and others. 2011. Same-sex couple households. US Department of Commerce, Economics and Statistics Administration, US Census Bureau.","paperID":"None"},{"content":"Caitlin McLaughlin and Jessica Vitak. 2012. Norm evolution and violation on Facebook. New Media & Society 14, 2: 299--315.","paperID":"None"},{"content":"Ruth McNair, Deborah Dempsey, Sarah Wise, and Amaryll Perlesz. 2002. Lesbian Parenting: Issues, Strengths and Challenges.","paperID":"None"},{"content":"Ethan Mereish and V. Paul Poteat. 2015. Effects of heterosexuals' direct and extended friendships with sexual minorities on their attitudes and behaviors: intergroup anxiety and attitude strength as mediators and moderators. Journal of Applied Social Psychology 45, 3: 147--157.","paperID":"None"},{"content":"Jeff Merkley. 2014. Text - S.815 - 113th Congress (2013--2014): Employment Non-Discrimination Act of 2013.","paperID":"None"},{"content":"Meredith Ringel Morris. 2014. Social Networking Site Use by Mothers of Young Children. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1272--1282.","paperID":"None"},{"content":"Peter Moskowitz. (2015, July 2). Why you should stop waving the rainbow flag on Facebook. The Washington Post.","paperID":"None"},{"content":"Stephen Neville and Mark Henrickson. 2009. The constitution of \"lavender families\": a LGB perspective. Journal of Clinical Nursing 18, 6: 849--856.","paperID":"None"},{"content":"Leysia Palen and Paul Dourish. 2003. Unpacking privacy for a networked world. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 129--136.","paperID":"None"},{"content":"Charlotte J. Patterson. 1992. Children of lesbian and gay parents. Child development 63, 5: 1025--1042.","paperID":"None"},{"content":"Amaryll Perlesz, Rhonda Brown, Jo Lindsay, Ruth McNair, David De Vaus, and Marian Pitts. 2006. Family in transition: parents, children and grandparents in lesbian families give meaning to \"doing family.\" Journal of Family Therapy 28, 2: 175--199.","paperID":"None"},{"content":"Sandra Petronio. 2002. Boundaries of privacy. State University of NY Press, Albany, NY. /","paperID":"None"},{"content":"Sandra Petronio. 2010. Communication privacy management theory: What do we know about family privacy regulation? Journal of Family Theory & Review 2, 3: 175--196.","paperID":"None"},{"content":"Christopher Pullen and Margaret Cooper. 2010. LGBT identity and online new media. Routledge.","paperID":"None"},{"content":"Robert T. Cserni and Ilan Talmud. 2015. To Know that You Are Not Alone: The Effect of Internet Usage on LGBT Youth's Social Capital. In Communication and Information Technologies Annual. Emerald Group Publishing Limited, 161--182.","paperID":"None"},{"content":"Michael J. Rosenfeld. 2010. Nontraditional families and childhood progress through school. Demography 47, 3: 755--775.","paperID":"None"},{"content":"Yoel Roth. 2014. Locating the \"Scruff Guy\": Theorizing Body and Space in Gay Geosocial Media. International Journal of Communication 8, 0: 21.","paperID":"None"},{"content":"Elizabeth Short, Damien W. Riggs, Amaryll Perlesz, Rhonda Brown, and Graeme Kane. 2007. Lesbian, gay, bisexual and transgender (LGBT) parented families: A literature review prepared for the Australian Psychological Society.","paperID":"None"},{"content":"Vincent M. B. Silenzio, Paul R. Duberstein, Wan Tang, Naiji Lu, Xin Tu, and Christopher M. Homan. 2009. Connecting the invisible dots: Reaching lesbian, gay, and bisexual adolescents and young adults at risk for suicide through online social networks. Social Science & Medicine 69, 3: 469--474.","paperID":"None"},{"content":"Changing Attitudes on Gay Marriage. (2015, July 29). Pew Research Center's Religion & Public Life Project. Retrieved August 27, 2015 from http://www.pewforum.org/2015/07/29/graphicsslideshow-changing-attitudes-on-gay-marriage/","paperID":"None"},{"content":"Mark Surman and Katherine Reilly. 2003. Appropriating the internet for social change: towards the strategic use of networked technologies by transnational civil society organizations. Social Science Research Council.","paperID":"None"},{"content":"Paul Taylor. 2013. A survey of LGBT Americans: attitudes, experiences and values in changing times. Pew Research Center.","paperID":"None"},{"content":"David R. Thomas. 2006. A General Inductive Approach for Analyzing Qualitative Evaluation Data. American Journal of Evaluation 27, 2: 237--246.","paperID":"None"},{"content":"Jeffrey W. Treem and Paul M. Leonardi. 2012. Social Media Use in Organizations: Exploring the Affordances of Visibility, Editability, Persistence, and Association. Social Science Research Network, Rochester, NY.","paperID":"None"},{"content":"Matt Vella. (2015, June 1). Twitter Bot Corrects You If You Misgender Caitlyn Jenner. Time.","paperID":"None"},{"content":"Stephanie Vie. 2014. In defense of \"slacktivism\": The Human Rights Campaign Facebook logo as digital activism. First Monday 19, 4.","paperID":"None"},{"content":"Jessica Vitak, Stacy Blasiola, Eden Litt, and Sameer Patil. 2015. Balancing Audience and Privacy Tensions on Social Network Sites: Strategies of Highly Engaged Users. International Journal of Communication 9: 20.","paperID":"None"},{"content":"Pamela Wisniewski, Haiyan Jia, Heng Xu, Mary Beth Rosson, and John M. Carroll. 2015. Preventative vs. Reactive: How Parental Mediation Influences Teens' Social Media Privacy Behaviors. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 302--316.","paperID":"None"},{"content":"Sarita Yardi and danah boyd. 2010. Dynamic Debates: An Analysis of Group Polarization Over Time on Twitter. Bulletin of Science, Technology & Society 30, 5: 316--327.","paperID":"None"},{"content":"Sarita Yardi and Amy Bruckman. 2011. Social and Technical Challenges in Parenting Teens' Social Media Use. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3237--3246.","paperID":"None"},{"content":"2015. Obergefell v. Hodges.","paperID":"None"},{"content":"Same-sex Marriage Referendum. (2015, May). The Irish Times. Retrieved August 27, 2015 from http://www.irishtimes.com/news/politics/marriagereferendum","paperID":"None"},{"content":"Evidence of Persistent and Pervasive Workplace Discrimination Against LGBT People: The Need for Federal Legislation Prohibiting Discrimination and Providing for Equal Employment Benefits. (2012, June). Williams Institute. Retrieved September 13, 2015 from http://williamsinstitute.law.ucla.edu/research/workplace/ llr-enda-v45--3/","paperID":"None"},{"content":"Discrimination and Harassment by Law Enforcement Officers in the LGBT Community. (2015, March). Williams Institute. Retrieved September 13, 2015 from http://williamsinstitute.law.ucla.edu/research/violencecrime/discrimination-and-harassment-by-lawenforcement-officers-in-the-lgbt-community/","paperID":"None"},{"content":"Discrimination Against State and Local Government LGBT Employees: An Analysis of Administrative Complaints. (2014, July). Williams Institute. Retrieved September 13, 2015 from http://williamsinstitute.law.ucla.edu/research/workplace/lgbtqpj-mallory-sears-2014/","paperID":"None"},{"content":"The Cost of the Closet and the Rewards of Inclusion. Human Rights Campaign. (2014, May). Retrieved September 13, 2015 from http://www.hrc.org/resources/entry/the-cost-of-thecloset-and-the-rewards-of-inclusion","paperID":"None"},{"content":"Non-Discrimination Laws: State by State Information Map. American Civil Liberties Union. Retrieved August 27, 2015 from https://www.aclu.org/map/nondiscrimination-laws-state-state-information-map","paperID":"None"},{"content":"Foster and Adoption Laws. (2015, Dec 23). Retrieved January 7, 2016 from http://www.lgbtmap.org/equalitymaps/foster_and_adoption_laws","paperID":"None"},{"content":"Facebook Analysis Proves Millions Worldwide Switched to HRC Red Equality Logo. (2013, Dec 10). Human Rights Campaign. Retrieved January 7, 2016 from http://www.hrc.org/blog/facebook-analysis-provesmillions-worldwide-switched-to-hrc-red-equality-lo","paperID":"None"},{"content":"72 hours to launch Celebrate Pride. (2015, July 2). Facebook Code. Retrieved September 24, 2015 from https://code.facebook.com/posts/778505998932780/72hours-to-launch-celebrate-pride/","paperID":"None"}],"title":"LGBT Parents and Social Media: Advocacy, Privacy, and Disclosure during Shifting Social Movements","filename":"CHI16/p610","authors":["Lindsay Blackwell","Jean Hardy","Tawfiq Ammari","Tiffany Veinot","Cliff Lampe","Sarita Schoenebeck"],"conference":"CHI '16"}