{"paperId":2858366,"abstract":"In recent years, the HCI community has recognized the need to address long(er) term information system design around on-going societal problems. Yet how to engage stakeholders effectively in multi-lifespan design thinking remains an open challenge. Toward that end, the work reported here extends an established envisioning method by introducing two new design methods, the multi-lifespan timeline and multi-lifespan co-design, with an emphasis on the element of (long) time. The new methods aim to stimulate participants' visions of future information systems by: (a) enhancing participants' understanding of longer timeframes (e.g., 100 years), and (b) guiding participants to effectively project themselves long into the future in their design thinking. We explored these multi-lifespan design methods in work with 51 Africans from Rwanda and the Great Lakes region living in the USA to understand the challenges and opportunities they envision for designing future information systems for transitional justice in Rwanda. Contributions are two-fold: (1) methodological innovation, and (2) a case study of multi-lifespan design thinking generated by diaspora members of post-conflict societies.","citation":[],"reference":[{"content":"American Psychiatric Association. 2000. Diagnostic and Statistical Manual of Mental Disorder, 4th Edition, Text Revision. Washington, DC: American Psychiatric Association.","paperID":"None"},{"content":"Roland Amoussouga. 2008. A Witness in Court. Video. (30 October, 2008.). Retrieved September 24, 2015 from http://tribunalvoices.org/voices/video/621","paperID":"None"},{"content":"Michael L. Best, Thomas N. Smyth, Daniel SerranoBaquero, and John Etherton. 2009. Designing for and with diaspora: A case study of work for the Truth and Reconciliation Commission of Liberia. In Proceedings of the Extended Abstracts on Human Factors in Computing Systems (CHI EA 2009), 2903--2918. http://doi.acm.org/10.1145/1520340.1520418","paperID":"None"},{"content":"Tone Bratteteig and Erik Stolterman, E. 1997. Design in groups?and all that jazz. In Computers and Design in Context, Morten Kyng and Lars Mathiassen (eds.). MIT Press, 289--316.","paperID":"None"},{"content":"Abigail C. Durrant, David S. Kirk, and Stuart Reeves. 2014. Human values in curating a human rights media archive. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2014), 2685--2694. http://doi.acm.org/10.1145/2556288.2557196","paperID":"None"},{"content":"Batya Friedman and Lisa P. Nathan. 2010. Multilifespan information system design: a research initiative for the HCI community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2010), 2243--2246. http://doi.acm.org/10.1145/1753326.1753665","paperID":"None"},{"content":"Batya Friedman, Lisa P. Nathan, and Daisy Yoo. (in press). Multi-lifespan information system design in support of transitional justice: Evolving situated design principles for the long(er) term. Interacting with Computers.","paperID":"None"},{"content":"Genocide Archive of Rwanda. Website. Retrieved September 14, 2015 from http://www.genocidearchiverwanda.org.rw","paperID":"None"},{"content":"Human Rights Watch. Law and Reality: Progress in Judicial Reform in Rwanda. 2008. Retrieved September 14, 2015 from https://www.hrw.org/reports/2008/07/25/law-andreality","paperID":"None"},{"content":"International Center for Transitional Justice. 2009. What Is Transitional Justice?. Retrieved September 14, 2015 from https://www.ictj.org/sites/default/files/ICTJGlobal-Transitional-Justice-2009-English.pdf","paperID":"None"},{"content":"Robert Jungk and Norbert Müllert. 1987. Future Workshops: How to Create Desirable Futures. Institute for Social Inventions, London, United Kingdom.","paperID":"None"},{"content":"Finn Kensing and Kim Halskov Madsen. 1992. Generating visions: Future workshops and metaphorical design. In Design at Work: Coorporative Design of Computer Systems, Joan Greenbaum and Morten Kyng (eds.). Lawrence Erlbaum Associates, Inc., 155--168.","paperID":"None"},{"content":"Lisa P. Nathan, Nell Carden Grey, Milli Lake, Trond Nilsen, Elizabeth J. Utter, Robert F. Utter, Mark Ring, Zoe Kahn, and Batya Friedman. 2011. Multi-lifespan information system design: Investigating a new design approach in Rwanda. In Proceedings of the 2011 iConference (iConference 2011), 591--597. http://doi.acm.org/10.1145/1940761.1940841","paperID":"None"},{"content":"Justine Ndongo-Keller. 2008. Communal Wrongdoing. Video. (8 October, 2008.). Retrieved September 24, 2015 from http://tribunalvoices.org/voices/video/599","paperID":"None"},{"content":"The New Times. Inside Ingando Training. Article. (14 December, 2008.). Retrieved September 22, 2015 from http://www.newtimes.co.rw/section/article/2008--1214/87391/","paperID":"None"},{"content":"Alex Obote Odora. 2008. Prosecution and Reconciliation. Video. (22 October, 2008.). Retrieved September 24, 2015 from http://tribunalvoices.org/voices/video/627","paperID":"None"},{"content":"Stuart Reeves. 2012. Envisioning ubiquitous computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2012), 1573--1582. http://doi.acm.org/10.1145/2207676.2208278","paperID":"None"},{"content":"Rwanda Governance Board. Umuganda. 2014. Retrieved September 14, 2015 from http://www.rgb.rw/governance-innovations/umuganda","paperID":"None"},{"content":"Thomas N. Smyth, John Etherton, and Michael L. Best. 2010. MOSES: exploring new ground in media and post-conflict reconciliation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2010), 1059--1068. http://doi.acm.org/10.1145/1753326.1753484","paperID":"None"},{"content":"Syria Accountability and Justice Centre. Website. Retrieved September 14, 2015 from http://syriaaccountability.org","paperID":"None"},{"content":"Charles Taku. 2008. Crimes Have No Ethnicity. Video. (3 November, 2008.). Retrieved September 24, 2015 from http://tribunalvoices.org/voices/video/153","paperID":"None"},{"content":"United Nations. 1994. Security Council resolution 955 (1994). Retrieved September 14, 2015 from http://www.unmict.org/ictr-remembers/docs/res9551994_en.pdf","paperID":"None"},{"content":"United Nations. 2004. The rule of law and transitional justice in conflict and post-conflict societies: Report of the Secretary-General. Retrieved September 14, 2015 from http://www.unrol.org/doc.aspx?n=2004%20report.pdf","paperID":"None"},{"content":"United Nations. 2014. The justice and reconciliation process in Rwanda. Retrieved September 22 from http://www.un.org/en/preventgenocide/rwanda/pdf/Bac kgrounder%20Justice%202014.pdf","paperID":"None"},{"content":"United Nations High Commissioner for Refugees. 2015. World on War: UNHCR Global Trends-Forced Displacements in 2014. Retrieved September 14, 2015 from http://unhcr.org/556725e69.html","paperID":"None"},{"content":"United Nations International Criminal Tribunal for Rwanda. The ICTR in Brief. 2015. Retrieved June 15, 2015 from http://www.unictr.org/en/tribunal","paperID":"None"},{"content":"Peter Uvin. 1999. Ethnicity and power in Burundi and Rwanda: Different paths to mass violence. Comparative Politics 31, 3: 253--271.","paperID":"None"},{"content":"Voices from the Rwanda Tribunal. Website. Retrieved September 21, 2015 from http://www.tribunalvoices.org","paperID":"None"},{"content":"WITNESS. Website. Retrieved September 14, 2015 from https://witness.org/our-work/video-evidence","paperID":"None"},{"content":"Daisy Yoo, Milli Lake, Trond Nilsen, Molly E. Utter, Robert Alsdorf, Theoneste Bizimana, Lisa P. Nathan, Mark Ring, Elizabeth J. Utter, Robert F. Utter, and Batya Friedman. 2013. Envisioning Across Generations: A Multi-lifespan Information System for International Justice in Rwanda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2013), 2527--2536. http://doi.acm.org/10.1145/2470654.2481349","paperID":"None"},{"content":"Daisy Yoo, Alina Huldtgren, Jill Palzkill Woelfer, David G. Hendry, and Batya Friedman. 2013. A value sensitive action-reflection model: evolving a co-design space with stakeholder and designer prompts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2013), 2527--2536. http://doi.acm.org/10.1145/2470654.2470715","paperID":"None"}],"title":"Multi-lifespan Design Thinking: Two Methods and a Case Study with the Rwandan Diaspora","filename":"CHI16/p4423","authors":["Daisy Yoo","Katie Derthick","Shaghayegh Ghassemian","Jean Hakizimana","Brian Gill","Batya Friedman"],"conference":"CHI '16"}