{"paperId":2858335,"citation":[],"reference":[{"content":"Nikolaus Bee and Elisabeth André. 2008. Writing with Your Eye: A Dwell Time Free Writing System Adapted to the Nature of Human Eye Gaze. In Perception in Multimodal Dialogue Systems, Elisabeth André, Laila Dybkjær, Wolfgang Minker, Heiko Neumann, Roberto Pieraccini, and Michael Weber (Eds.). Lecture Notes in Computer Science, Vol. 5078. Springer Berlin Heidelberg, 111--122.","paperID":"None"},{"content":"Wenxin Feng, Ming Chen, and Margrit Betke. 2014. Target Reverse Crossing: A Selection Method for Camera-based Mouse-replacement Systems. In Proceedings of the 7th International Conference on PErvasive Technologies Related to Assistive Environments (PETRA '14). ACM, New York, NY, USA, Article 39, 4 pages.","paperID":"None"},{"content":"John Paulin Hansen, Anders Sewerin Johansen, Dan Witzner Hansen, Kenji Itoh, and Satoru Mashino. 2003. Command Without a Click: Dwell Time Typing by Mouse and Gaze Selections. In Human-Computer Interaction (INTERACT '03), M. Rauterberg et al. (Ed.). IOS Press, 121--128.","paperID":"None"},{"content":"Poika Isokoski. 2004. Performance of Menu-augmented Soft Keyboards. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 423--430.","paperID":"None"},{"content":"Josh Kaufman. 2015. Google 10000 English. https://github.com/first20hours/google-10000-english. (2015). Accessed: 2015-09--22.","paperID":"None"},{"content":"Per-Ola Kristensson and Keith Vertanen. 2012. The Potential of Dwell-free Eye-typing for Fast Assistive Gaze Communication. In Proceedings of the Symposium on Eye Tracking Research and Applications (ETRA '12). ACM, New York, NY, USA, 241--244.","paperID":"None"},{"content":"Per-Ola Kristensson and Shumin Zhai. 2004. SHARK2: A Large Vocabulary Shorthand Writing System for Pen-based Computers. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, New York, NY, USA, 43--52.","paperID":"None"},{"content":"Yi Liu, Chi Zhang, Chonho Lee, Bu-Sung Lee, and Alex Qiang Chen. 2015. GazeTry: Swipe Text Typing Using Gaze. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15). ACM, New York, NY, USA, 192--196.","paperID":"None"},{"content":"Winwaed Software Technology LLC. 2012. Calculating Word and N-Gram Statistics from a Wikipedia Corpora. http://www.monlp.com/2012/04/16/calculating-word-andn-gram-statistics-from-a-wikipedia-corpora/. (2012). Accessed: 2015-09--22.","paperID":"None"},{"content":"I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, New York, NY, USA, 754--755.","paperID":"None"},{"content":"Päivi Majaranta. 2009. Text entry by eye gaze. Ph.D. Dissertation. University of Tampere.","paperID":"None"},{"content":"Päivi Majaranta and Kari-Jouko Räihä. 2002. Twenty Years of Eye Typing: Systems and Design Issues. In Proceedings of the 2002 Symposium on Eye Tracking Research & Applications (ETRA '02). ACM, New York, NY, USA, 15--22.","paperID":"None"},{"content":"Eric S. Missimer, Samuel Epstein, John J. Magee, and Margrit Betke. 2010. Customizable Keyboard. In Proceedings of the 12th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '10). ACM, New York, NY, USA, 249--250.","paperID":"None"},{"content":"Carlos H. Morimoto and Arnon Amir. 2010. Context Switching for Fast Key Selection in Text Entry Applications. In Proceedings of the 2010 Symposium on Eye-Tracking Research & Applications (ETRA '10). ACM, New York, NY, USA, 271--274.","paperID":"None"},{"content":"Diogo Pedrosa, Maria Da Graça Pimentel, Amy Wright, and Khai N. Truong. 2015. Filteryedping: Design Challenges and User Performance of Dwell-Free Eye Typing. ACM Trans. Access. Comput. 6, 1, Article 3 (March 2015), 37 pages.","paperID":"None"},{"content":"Daniel Rough, Keith Vertanen, and Per Ola Kristensson. 2014. An Evaluation of Dasher with a High-performance Language Model As a Gaze Communication Method. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, New York, NY, USA, 169--176.","paperID":"None"},{"content":"Kari-Jouko Räihä. 2015. Life in the Fast Lane: Effect of Language and Calibration Accuracy on the Speed of Text Entry by Gaze. In Human-Computer Interaction -- INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Lecture Notes in Computer Science, Vol. 9296. Springer International Publishing, 402--417.","paperID":"None"},{"content":"Hiroaki Sakoe and Seibi Chiba. 1990. Readings in Speech Recognition. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, Chapter Dynamic Programming Algorithm Optimization for Spoken Word Recognition, 159--165.","paperID":"None"},{"content":"R. William Soukoreff and I. Scott MacKenzie. 2003. Metrics for Text Entry Research: An Evaluation of MSD and KSPC, and a New Unified Error Metric. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 113--120.","paperID":"None"},{"content":"C. C. Tappert. 1982. Cursive Script Recognition by Elastic Matching. IBM J. Res. Dev. 26, 6 (Nov. 1982), 765--771.","paperID":"None"},{"content":"D.J. Ward and D.J.C MacKay. 2002. Fast Hands-free Writing by Gaze Direction. Nature 418, 6900 (2002), 838.","paperID":"None"},{"content":"Shumin Zhai and Per-Ola Kristensson. 2003. Shorthand Writing on Stylus Keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 97--104.","paperID":"None"},{"content":"Shumin Zhai and Per Ola Kristensson. 2012. The Word-gesture Keyboard: Reimagining Keyboard Interaction. Commun. ACM 55, 9 (Sept. 2012), 91--101.","paperID":"None"}],"abstract":"Text entry using gaze-based interaction is a vital communication tool for people with motor impairments. Most solutions require the user to fixate on a key for a given dwell time to select it, thus limiting the typing speed. In this paper we introduce EyeSwipe, a dwell-time-free gaze-typing method. With EyeSwipe, the user gaze-types the first and last characters of a word using the novel selection mechanism \"reverse crossing.\" To gaze-type the characters in the middle of the word, the user only needs to glance at the vicinity of the respective keys. We compared the performance of EyeSwipe with that of a dwell-time-based virtual keyboard. EyeSwipe afforded statistically significantly higher typing rates and more comfortable interaction in experiments with ten participants who reached 11.7 words per minute (wpm) after 30 min typing with EyeSwipe.","title":"EyeSwipe: Dwell-free Text Entry Using Gaze Paths","filename":"CHI16/p1952","authors":["Andrew Kurauchi","Wenxin Feng","Ajjen Joshi","Carlos Morimoto","Margrit Betke"],"conference":"CHI '16"}