{"paperId":2858102,"citation":[],"abstract":"Crowdsourced video is now a viable tool with which broadcasters and communities alike can produce authentic, high quality video content. However, the literacy, language, skills and tools to produce a documentary through commissioning content are currently difficult to acquire. We explore opening up the documentary film commissioning process to community contributors by developing a framework which instructs, guides and informs non-professional contributors in capturing the content required for making videos. Through the results of an in-the-wild deployment we discuss how our framework scaffolds content creation, the capture of high quality footage and coordination amongst teams of contributors. We then discuss how this can inform community media creation in the future.","reference":[{"content":"Andre Almeida and Heitor Alvelos. 2010. Interactive Storytelling. Springer Berlin Heidelberg, Berlin, Heidelberg. http://doi.org/10.1007/978-3642-16638-9","paperID":"None"},{"content":"Daniel Arijon. 1991. Grammar of the Film Language. Silman-James Press. Retrieved September 7, 2015 from https://books.google.co.uk/books/about/Grammar_o f_the_Film_Language.html?id=6bQlAQAAIAAJ&pgis=1","paperID":"None"},{"content":"Tom Bartindale, Guy Schofield, Clara Crivellaro, and Peter Wright. 2016. TryFilm: Situated Support for Interactive Media Productions. Computer Supported Cooperative Work, ACM Press.","paperID":"None"},{"content":"BBC. 2015. Technical Standards for Delivery of Television Programmes to UK Broadcasters. Retrieved from http://www.bbc.co.uk/guidelines/dq/contents/televis ion.shtml","paperID":"None"},{"content":"Dick C. A. Bulterman, Pablo Cesar, and Rodrigo Laiola Guimarães. 2013. Socially-aware multimedia authoring. ACM Transactions on Multimedia Computing, Communications, and Applications 9, 1s: 1--23. http://doi.org/10.1145/2491893","paperID":"None"},{"content":"Renan G. Cattelan, Cesar Teixeira, Rudinei Goularte, and Maria Da Graça C. Pimentel. 2008. Watch-and-comment as a paradigm toward ubiquitous interactive video editing. ACM Transactions on Multimedia Computing, Communications, and Applications 4, 4: 1--24. Retrieved August 1, 2012 from http://dl.acm.org/citation.cfm?id=1412196.1412201","paperID":"None"},{"content":"Gaby David. 2010. Camera phone images, videos and live streaming: a contemporary visual trend. Visual Studies 25, 1: 89--98. http://doi.org/10.1080/14725861003607017","paperID":"None"},{"content":"Arvid Engström, Martin Esbjörnsson, and Oskar Juhlin. 2008. Mobile collaborative live video mixing. Proceedings of the 10th international conference on Human computer interaction with mobile devices and services - MobileHCI '08, ACM Press, 157. http://doi.org/10.1145/1409240.1409258","paperID":"None"},{"content":"Arvid Engström, Mark Perry, and Oskar Juhlin. 2012. Amateur vision and recreational orientation: CSCW, ACM Press, 651. Retrieved August 3, 2012 from http://dl.acm.org/citation.cfm?id=2145204.2145304","paperID":"None"},{"content":"Martin D. Flintham, Raphael Velt, Max L. Wilson, et al. 2015. Run Spot Run. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 747--756. http://doi.org/10.1145/2702123.2702463","paperID":"None"},{"content":"David Philip Green, Simon J. Bowen, Christopher Newell, et al. 2015. Beyond Participatory Production. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 3157--3166. http://doi.org/10.1145/2702123.2702203","paperID":"None"},{"content":"Lyndon Kennedy and Mor Naaman. 2009. Less talk, more rock. Proceedings of the 18th international conference on World wide web - WWW '09, ACM Press, 311. http://doi.org/10.1145/1526709.1526752","paperID":"None"},{"content":"Rodrigo Laiola Guimarães, Pablo Cesar, Dick C.A. Bulterman, Vilmos Zsombori, and Ian Kegel. 2011. Creating personalized memories from social events. Proceedings of the 19th ACM international conference on Multimedia - MM '11, ACM Press, 303. http://doi.org/10.1145/2072298.2072339","paperID":"None"},{"content":"Mark Perry, Oskar Juhlin, Mattias Esbjörnsson, and Arvid Engström. 2009. Lean collaboration through video gestures. Proceedings of the 27th international conference on Human factors in computing systems CHI '09, ACM Press, 2279. http://doi.org/10.1145/1518701.1519051","paperID":"None"},{"content":"Marco de Sá, David A. Shamma, and Elizabeth F. Churchill. 2013. Live mobile collaboration for video production: design, guidelines, and requirements. Personal and Ubiquitous Computing 18, 3: 693--707. http://doi.org/10.1007/s00779-013-0700-0","paperID":"None"},{"content":"Guy Schofield, Tom Bartindale, and Peter Wright. 2015. Bootlegger: Turning Fans into Film Crew. CHI, ACM Press (Association for Computing Machinery).","paperID":"None"},{"content":"Cees G.M. Snoek, Bauke Freiburg, Johan Oomen, and Roeland Ordelman. 2010. Crowdsourcing rock n' roll multimedia retrieval. Proceedings of the international conference on Multimedia - MM '10, ACM Press, 1535. http://doi.org/10.1145/1873951.1874278","paperID":"None"},{"content":"Kai Su, Mor Naaman, Avadhut Gurjar, Mohsin Patel, and Daniel P. W. Ellis. 2012. Making a scene. Proceedings of the 2nd ACM International Conference on Multimedia Retrieval ICMR '12, ACM Press, 1. http://doi.org/10.1145/2324796.2324829","paperID":"None"},{"content":"Raphael Velt, Steve Benford, Stuart Reeves, Michael Evans, Maxine Glancy, and Phil Stenton. 2015. Towards an Extended Festival Viewing Experience. Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video - TVX '15, ACM Press, 53--62. http://doi.org/10.1145/2745197.2745206","paperID":"None"},{"content":"Alexandra Weilenmann, Roger Säljö, and Arvid Engström. 2013. Mobile video literacy: negotiating the use of a new visual technology. Personal and Ubiquitous Computing 18, 3: 737--752. http://doi.org/10.1007/s00779-013-0703-x","paperID":"None"},{"content":"Fan Footage. Retrieved September 18, 2015 from https://fanfootage.com/","paperID":"None"},{"content":"Burst. Retrieved September 18, 2015 from https://www.burst.com/","paperID":"None"},{"content":"Seenit -- Home. Retrieved September 18, 2015 from http://seenit.io/","paperID":"None"},{"content":"BBC Taster - Ramadan in a day. Retrieved September 25, 2015 from http://www.bbc.co.uk/taster/projects/ramadan-in-aday","paperID":"None"},{"content":"The Five C's of Cinematography: Motion Picture Filming Techniques: Joseph V. Mascelli: 9781879505414: Amazon.com: Books. Retrieved September 4, 2015 from http://www.amazon.com/The-Five-CsCinematography-Techniques/dp/187950541X","paperID":"None"},{"content":"Bootlegger Open Source Softaware on Git Hub. Retrieved from https://github.com/digitalinteraction/bootleggerserver","paperID":"None"}],"title":"Scaffolding Community Documentary Film Making using Commissioning Templates","filename":"CHI16/p2705","authors":["Tom Bartindale","Guy Schofield","Peter Wright"],"conference":"CHI '16"}