{"paperId":2858061,"citation":[],"abstract":"The social nature of multiplayer games provides compelling play experiences that are dynamic, unpredictable, and satisfying; however, playing digital games with others can result in feeling socially excluded. There are several known harmful effects of ostracism, including on cognition and the interpretation of social information. To investigate the effects of social exclusion in the context of a multiplayer game, we developed and validated a social exclusion paradigm that we embedded in an online game. Called Operator Challenge, our paradigm influenced feelings of social exclusion and access to hostile cognitions (measured through a word-completion task). In addition, the degree of experienced belonging predicted player enjoyment, effort, and the number of hostile words completed; however, the experience measures did not mediate the relationship between belonging and access to hostile cognitions. Our work facilitates understanding the causes and effects of exclusion, which is important for the study of player experience in multiplayer games.","reference":[{"content":"Craig A. Anderson, Nicholas L. Carnagey, and Janie Eubanks. 2003. Exposure to violent media: The effects of songs with violent lyrics on aggressive thoughts and feelings. Journal of Personality and Social Psychology 84 (5), 960--971. http://dx.doi.org/10.1037/00223514.84.5.960","paperID":"None"},{"content":"Craig A. Anderson and Karen E. Dill. 2000. Video games and aggressive thoughts, feelings, and behavior in the laboratory and in life. Journal of Personality and Social Psychology 78(4), 772--790. http://dx.doi.org/10.1037/0022--3514.78.4.772","paperID":"None"},{"content":"Roy F. Baumeister, Jean M. Twenge, and Christopher K. Nuss. 2002. Effects of social exclusion on cognitive processes: Anticipated aloneness reduces intelligent thought. Journal of Personality and Social Psychology 83(4), 817--827. http://dx.doi.org/10.1037/00223514.83.4.817","paperID":"None"},{"content":"Roy F. Baumeister, C. Nathan DeWall, Natalie J. Ciarocco, and Jean M. Twenge. 2005. Social Exclusion Impairs Self-Regulation. Journal of Personality and Social Psychology 88(4), 589--604. http://dx.doi.org/10.1037/0022--3514.88.4.589","paperID":"None"},{"content":"Mary E Ballard and Kelly M Welch. 2015. Virtual Warfare: Cyberbullying and Cyber-Victimization in MMOG Play. Games and Culture. http://dx.doi.org/10.1177/1555412015592473","paperID":"None"},{"content":"Brock Bastian, Jolanda Jetten, and Helena R.M. Radke. 2012. Cyber-dehumanization: Violent video game play diminishes our humanity. Journal of Experimental Social Psychology 48(2), 486--491. http://dx.doi.org/10.1016/j.jesp.2011.10.009","paperID":"None"},{"content":"Max Birk and Regan L. Mandryk. 2013. Control your game-self. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'13). ACM, NY, NY, USA, 685--694. http://dx.doi.org/10.1145/2470654.2470752","paperID":"None"},{"content":"Max V Birk, Regan L Mandryk, Matthew K Miller, Kathrin M Gerling. 2015. How Self-Esteem Shapes our Interactions with Play Technologies. In Proceeding of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY'15). ACM, NY, NY, USA, 35--45. http://dx.doi.org/10.1145/2793107.2793111","paperID":"None"},{"content":"Jeremy Blackburn and Haewoon Kwak. 2014. STFU NOOB!: predicting crowdsourced decisions on toxic behavior in online games. In Proceedings of the 23rd international conference on World wide web (WWW'14). ACM, NY, NY, USA, 877--888. http://dx.doi.org/10.1145/2566486.2567987","paperID":"None"},{"content":"Jim Blascovich, Jack Loomis, Andrew C. Beall, Kimberly R. Swinth, Crystal L. Hoyt, and Jeremy N. Bailenson. 2002. TARGET ARTICLE: Immersive Virtual Environment Technology as a Methodological Tool for Social Psychology. Psychological Inquiry 13(2), 103--124. http://dx.doi.org/10.1207/s15327965pli1302_01","paperID":"None"},{"content":"Nicholas D Bowman, Daniel Schultheiss, and Christina Schumann. 2012. I'm Attached, and I'm a Good Guy/Gal!: How Character Attachment Influences Proand Anti-Social Motivations to Play Massively Multiplayer Online Role-Playing Games. Cyberpsychology, Behavior, and Social Networking 15(3), 169--174. http://dx.doi.org/10.1089/cyber.2011.0311","paperID":"None"},{"content":"Jason Bowey, Max V Birk, and Regan L Mandryk. (2015). Manipulating Leaderboards to Induce Player Experience. In Proceeding of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY'15). ACM, NY, NY, 115--120. http://dx.doi.org/10.1145/2793107.2793138","paperID":"None"},{"content":"Emily Brown, and Paul Cairns. 2004. A grounded investigation of game immersion. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, NY, NY, USA, 1297--1300. http://dx.doi.org/10.1145/985921.986048","paperID":"None"},{"content":"Vivian Hsueh-Hua Chen, Henry Been-Lirn Duh, and Chiew Woon Ng. 2009. Players who play to make others cry. In Proceedings of the International Conference on Advances in Computer Enterntainment Technology (ACE '09). ACM, NY, NY, 341--344 http://dx.doi.org/10.1145/1690388.1690454","paperID":"None"},{"content":"Helena Cole and Mark D Griffiths. 2007. Social Interactions in Massively Multiplayer Online RolePlaying Gamers. Cyber-Psychology & Behavior 10(4), 575--583. http://dx.doi.org/10.1089/cpb.2007.9988","paperID":"None"},{"content":"Sally S Dickerson and Margaret E Kemeny. 2004. Acute Stressors and Cortisol Responses: A Theoretical Integration and Synthesis of Laboratory Research. Psychological Bulletin 130(3), 355--391. http://dx.doi.org/10.1037/0033--2909.130.3.355","paperID":"None"},{"content":"C Nathan DeWall, Jean M Twenge, Seth A Gitter, and Roy F Baumeister. 2009. Its the thought that counts: The role of hostile cognition in shaping aggressive responses to social exclusion. Journal of Personality and Social Psychology 96(1), 45--59. http://dx.doi.org/10.1037/a0013196","paperID":"None"},{"content":"Anders Drachen, Matthew Yancey, John Maguire, Derrek Chu, Iris Yuhui Wang, Tobias Mahlmann, Matthias Schubert, and Diego Klabajan. 2014. Skillbased differences in spatio-temporal team behaviour in Defense of the Ancients 2 (DotA 2). In Proceedings of IEEE Games Media Entertainment (GEM'14). IEEE, 1--8. http://dx.doi.org/10.1109/gem.2014.7048109","paperID":"None"},{"content":"Christopher Dring. 2015. More money is spent on games than movies and music combined, says HIS (Web log post). Retrieved by http://www.mcvuk.com/news/read/more-money-isspent-on-games-than-movies-and-music-combinedsays-ihs/0151059","paperID":"None"},{"content":"Naomi I Eisenberger and Matthew D. Lieberman. 2004. Why rejection hurts: a common neural alarm system for physical and social pain. Trends in Cognitive Sciences 8(7), 294--300. http://dx.doi.org/10.1016/j.tics.2004.05.010","paperID":"None"},{"content":"Entertainment Software Association. 2014. Essential Facts about the Computer and Video Games Industry (Annual report). Retrieved by http://www.theesa.com/wpcontent/uploads/2014/10/ESA_EF_2014.pdf","paperID":"None"},{"content":"Entertainment Software Association. 2015. Essential Facts about the Computer and Video Games Industry (Annual report). Retrieved by http://www.theesa.com/wpcontent/uploads/2015/04/ESA-Essential-Facts2015.pdf","paperID":"None"},{"content":"Josefine Fahlström, and Emma Matson. 2014. Preventing Toxic Behaviour through Game Mechanics. (Master's Thesis). Retrieved from http://www.divaportal.org/smash/get/diva2:731451/FULLTEXT01.pdf","paperID":"None"},{"content":"Wendi L Gardner, Cynthia L Pickett, and Marilynn B Brewer. 2000. Social exclusion and selective memory: How the need to belong influences memory for social events. Personality and Social Psychology Bulletin 26(4), 486--496. http://dx.doi.org/10.1177/0146167200266007","paperID":"None"},{"content":"Marylène Gagné. 2003. The Role of Autonomy Support and Autonomy Orientation in Prosocial Behavior Engagement. Motivation and Emotion 27(3), 199--223. http://dx.doi.org/10.1023/a:1025007614869","paperID":"None"},{"content":"John Gaudiosi. 2012. Riot Games' League Of Legends Officially Becomes Most Played PC Game In The World (Web log post). Retrieved from http://www.forbes.com/sites/johngaudiosi/2012/07/11/riot-games-league-of-legends-officially-becomes-mostplayed-pc-game-in-the-world/","paperID":"None"},{"content":"Margaret Gruter and Roger D Masters. 1986. Ostracism as a social and biological phenomenon: An introduction. Ethology and Sociobiology 7(3--4), 149158. http://dx.doi.org/10.1016/0162--3095(86)90043--9","paperID":"None"},{"content":"Andrew F Hayes. 2013. Introduction to Mediation, Moderation, and Conditional Process Analysis: A Regression-Based Approach. Journal of Educational Measurement 51(3), 335--337. http://dx.doi.org/10.1111/jedm.12050","paperID":"None"},{"content":"Robin Hunicke, Marc LeBlanc, and Robert Zubek. 2004. MDA: A formal approach to game design and game research. In Proceedings of the AAAI Workshop on Challenges in Game AI, vol. 4.","paperID":"None"},{"content":"Matthew P Kassner, Eric D Wesselmann, Alvin Ty Law, and Kipling D Williams. 2012. Virtually Ostracized: Studying Ostracism in Immersive Virtual Environments. Cyberpsychology, Behavior, and Social Networking 15(8), 399--403. http://dx.doi.org/10.1089/cyber.2012.0113","paperID":"None"},{"content":"Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 453--456. http://dx.doi.org/10.1145/1357054.1357127","paperID":"None"},{"content":"Clemens Kirschbaum, Karl-Martin Pirke and Dirk H. Hellhammer. 1993. The Trier Social Stress Test - A Tool for Investigating Psychobiological Stress Responses in a Laboratory Setting. Neuropsychobiology 28, (1--2), 76--81. http://dx.doi.org/10.1159/000119004","paperID":"None"},{"content":"Noam Lapidot-Lefler and Azy Barak. 2012. Effects of anonymity, invisibility, and lack of eye-contact on toxic online disinhibition. Computers in Human Behavior 28(2), 434--443. http://dx.doi.org/10.1016/j.chb.2011.10.014","paperID":"None"},{"content":"Jeffery Lin. 2015. More Science Behind Shaping Player Behavior in Online Games (Presentation). Retrieved from http://gdcvault.com/play/1022160/More-ScienceBehind-Shaping-Player","paperID":"None"},{"content":"Winter Mason and Siddharth Suri. 2011. Conducting behavioral research on Amazon's Mechanical Turk. Behavior Research Methods, 44, (1), 1--23. http://dx.doi.org/10.3758/s13428-011-0124--6","paperID":"None"},{"content":"Keiichi Miki, Kouki Kawamorita, Yutaka Araga, Toshimitsu Mushu, and Ayako Sudo. 1998. Urinary and Salivary Stress Hormone Levels While Performing Arithmetic Calculation in a Noisy Environment. Industrial Health 36(1), 66--69. http://dx.doi.org/10.2486/indhealth.36.66","paperID":"None"},{"content":"Edward McAuley, Terry Duncan, and Vance V Tammen. 1989. Psychometric Properties of the Intrinsic Motivation Inventory in a Competitive Sport Setting: A Confirmatory Factor Analysis. Research Quarterly for Exercise and Sport 60(1), 48--58.","paperID":"None"},{"content":"Bonnie Nardi, & Justin Harris. 2006. Strangers and friends: Collaborative play in World of Warcraft. In Proceedings of the 20th anniversary conference on Computer supported cooperative work (CSCW'06). ACM, NY, NY, 149--158.","paperID":"None"},{"content":"OkCupid. Web service. http://www.okcupid.com/","paperID":"None"},{"content":"Erich Prisner. 2009. Game Theory Through Examples. Cambridge University Press (CUP). http://dx.doi.org/10.5948/9781614441151","paperID":"None"},{"content":"Cynthia L Pickett, Wendi L Gardner, and Megan Knowles. 2004. Getting a cue: The need to belong and enhanced sensitivity to social cues. Personality and Social Psychology Bulletin 30(9), 1095--1107. http://dx.doi.org/10.1177/0146167203262085","paperID":"None"},{"content":"Andrew K Przybylski, Edward . Deci, C Scott Rigby, and Richard M. Ryan. 2014. Competence-impeding electronic games and players' aggressive feelings, thoughts, and behaviors. Journal of Personality and Social Psychology 106(3), 441--457. http://dx.doi.org/10.1037/a0034820","paperID":"None"},{"content":"Andrew K Przybylski, Netta Weinstein, Richard M Ryan, and C Scott Rigby. 2009. Having to versus wanting to play: Background and consequences of harmonious versus obsessive engagement in video games. CyberPsychology & Behavior 12(5), 485--492. http://dx.doi.org/10.1089/cpb.2009.0083","paperID":"None"},{"content":"Johnmarshall Reeve, Hyungshim Jang, Dan Carrell, Soohyun Jeon, and Jon Barch. 2004. Enhancing Students Engagement by Increasing Teachers Autonomy Support. Motivation and Emotion 28(2), 147--169. http://dx.doi.org/10.1023/b:moem.0000032312.95499. 6f","paperID":"None"},{"content":"Leonard Reinecke, Tilo Hartmann, and Allison Eden. 2014. The guilty couch potato: The role of ego depletion in reducing recovery through media use. Journal of Communication 64(4). 569--589. http://dx.doi.org/10.1111/jcom.12107","paperID":"None"},{"content":"Leonard Reinecke, Ron Tamborini, Matthew Grizzard, Robert Lewis, Allison Eden, and Nicholas D Bowman. 2012. Characterizing mood management as need satisfaction: The effects of intrinsic needs on selective exposure and mood repair. Journal of Communication 62(3), 437--453. http://dx.doi.org/10.1111/j.1460--2466.2012.01649.x","paperID":"None"},{"content":"Riot games. 2014. League player reach new heights in 2014 (Web log post). Retrieved by http://www.riotgames.com/articles/20140711/1322/lea gue-players-reach-new-heights-2014","paperID":"None"},{"content":"Richard M Ryan and Edward L Deci. 2000. Selfdetermination theory and the facilitation of intrinsic motivation, social development, and well-being. American Psychologist 55(1), 68--78. http://dx.doi.org/10.1037/0003-066x.55.1.68","paperID":"None"},{"content":"Richard M. Ryan, C Scott Rigby, and Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30(4), 344--360. http://dx.doi.org/10.1007/s11031-006--9051--8","paperID":"None"},{"content":"Kenneth B Shores, Yilin He, Kristina L Swanenburg, Robert Kraut, and John Riedl. 2014. The identification of deviance and its impact on retention in a multiplayer game. In Proceedings of the 17th ACM conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, NY, NY, USA, 1356--1365. http://dx.doi.org/10.1145/2531602.2531724","paperID":"None"},{"content":"Statista. 2015. Most played PC games on gaming platform Raptr in November 2015, by share of playing time (Web service). http://www.statista.com/statistics/251222/most-playedpc-games/","paperID":"None"},{"content":"John Suler. 2004. The Online Disinhibition Effect. Cyber-Psychology & Behavior 7(3), 321--326. http://dx.doi.org/10.1089/1094931041291295","paperID":"None"},{"content":"Penelope Sweetser, and Peta Wyeth. 2005. GameFlow: a model for evaluating player enjoyment in games. Computers in Entertainment (CIE) 3(3), 3--3. http://dx.doi.org/10.1145/1077246.1077253","paperID":"None"},{"content":"Jean M Twenge, Roy F Baumeister, Dianne M Tice, and Tanja S Stucke. 2001. If you can't join them, beat them: Effects of social exclusion on aggressive behavior. Journal of Personality and Social Psychology 81(6), 1058--1069. http://dx.doi.org/10.1037/0022--3514.81.6.1058","paperID":"None"},{"content":"Jean M Twenge, Roy F Baumeister, C Nathan DeWall, Natalie J Ciarocco, and J Michael Bartels. 2007. Social exclusion decreases prosocial behavior. Journal of Personality and Social Psychology 92(1), 56--66. http://dx.doi.org/10.1037/0022--3514.92.1.56","paperID":"None"},{"content":"David Watson, Lee A Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: The PANAS scales. Journal of Personality and Social Psychology 54(6), 1063--1070. http://dx.doi.org/10.1037/00223514.54.6.1063","paperID":"None"},{"content":"Kipling D Williams, Christopher K T Cheung, and Wilma Choi. 2000. Cyberostracism: Effects of being ignored over the Internet. Journal of Personality and Social Psychology 79(5), 748--762. http://dx.doi.org/10.1037/0022--3514.79.5.748","paperID":"None"},{"content":"Kipling D Williams, Cassandra L Govan, Vanessa Croker, Daniel Tynan, Maggie Cruickshank, and Albert Lam. 2002. Investigations into differences between social- and cyberostracism. Group Dynamics: Theory, Research, and Practice 6(1), 65--77. http://dx.doi.org/10.1037/1089--2699.6.1.65","paperID":"None"},{"content":"Kipling D Williams and Blair Jarvis. 2006. Cyberball: A program for use in research on interpersonal ostracism and acceptance. Behavior Research Methods 38(1), 174--180. http://dx.doi.org/10.3758/bf03192765","paperID":"None"},{"content":"Kipling D Williams. 2007. Ostracism: The Kiss of Social Death. Social Personality Psychology Compass 1(1), 236--247. http://dx.doi.org/10.1111/j.17519004.2007.00004.x","paperID":"None"},{"content":"Kipling D Williams. 2007. Ostracism. Annual Review of Psychology 58, 1, 425--452. http://dx.doi.org/10.1146/annurev.psych.58.110405.08","paperID":"None"},{"content":"Wouter Wolf, Ana Levordashka, Johanna R. Ruff, Steven Kraaijeveld, Jan-Matthis Lueckmann, and Kipling D. Williams. 2014. Ostracism Online: A social media ostracism paradigm. Behavior Research Methods 47(2), 361--373. http://dx.doi.org/10.3758/s13428-014-0475-x","paperID":"None"},{"content":"Lisa Zadro, Catherine Boland, and Rick Richardson. 2006. How long does it last? The persistence of the effects of ostracism in the socially anxious. Journal of Experimental Social Psychology 42(5), 692--697. http://dx.doi.org/10.1016/j.jesp.2005.10.007","paperID":"None"},{"content":"Dolf Zillmann. 1988. Mood management: Using entertainment to full advantage. Communication, Social Cognition, and Affect, 31, 147--171.","paperID":"None"}],"title":"The Effects of Social Exclusion on Play Experience and Hostile Cognitions in Digital Games","filename":"CHI16/p3007","authors":["Max V. Birk","Benjamin Buttlar","Jason T. Bowey","Susanne Poeller","Shelby C. Thomson","Nicola Baumann","Regan L. Mandryk"],"conference":"CHI '16"}