{"paperId":2858419,"citation":[],"reference":[{"content":"Abuhamdeh, S. and Csikszentmihalyi, M. The importance of challenge for the enjoyment of intrinsically motivating, goal-directed activities. Personality and Social Psychology Bulletin 38, 3 (2012), 317--330.","paperID":"None"},{"content":"Ariely, D. Combining Experiences Over Time: The Effects of Duration, Intensity Changes and On-Line Measurements on Retrospective Pain Evaluations. Journal of Behavioral Decision Making 11 (1998), 1945.","paperID":"None"},{"content":"Bernhaupt, R. (ed.), Game User Experience Evaluation. Springer, 2015.","paperID":"None"},{"content":"Brave, S. and Nass, C. Emotion in human-computer interaction. in Julie, A.J. and Andrew, S. eds. The human-computer interaction handbook, L. Erlbaum Associates Inc., 2003, 81--96.","paperID":"None"},{"content":"Cockburn, A., Quinn, P. and Gutwin, C. Examining the peak-end effects of subjective experience. in Proceedings of CHI'15: ACM Conference on Human Factors in Computing Systems, ACM Press, (2015), 357--366.","paperID":"None"},{"content":"Cowley, E. and Farrell, C. Retrospective evaluations: Will chance versus luck oriented individuals select different moments of an experience? Advances in Consumer Research, San Antonio, USA, 2006, http://www.acrwebsite.org/volumes/v33/naacr_v33_32. pdf.","paperID":"None"},{"content":"Csikszentmihalyi, M. Flow: The Psychology of Optimal Experience. Harper and Row, NY, 1991.","paperID":"None"},{"content":"Diener, E., Wirtz, D. and Oishi, S. End effects of rated life quality: the James Dean Effect. Psychol Sci. 12, 2 (2001), 124--128.","paperID":"None"},{"content":"Dixon, M. and Verma, R. Sequence effects in service bundles: Implications for service design and scheduling. Journal of Operations Management 31, 3 (2013), 138--152.","paperID":"None"},{"content":"Do, A., Rupert, A. and Wolford, G. Evaluations of pleasurable experiences: The peak-end rule. Psychonomic Bulletin & Review 15, 1 (2008), 96--98.","paperID":"None"},{"content":"Finn, B. Ending on a High Note: Adding a Better End to Effortful Study. Journal of Experimental Psychology: Learning, Memory, and Cognition 36, 6 (2010), 15481553.","paperID":"None"},{"content":"Fredrickson, B. and Kahneman, D. Duration neglect in retrospective evaluations of affective episodes. Journal of Personality and Social Psychology 65, 1 (1993), 4555.","paperID":"None"},{"content":"Hamari, J. and Tuunanen, J. Player types: A metasynthsis. Transactions of the Digital Games Research Association 1, 2 (2014), 29--53.","paperID":"None"},{"content":"Harrison, C., Amento, B., Kuznetsov, S. and Bell, R. Rethinking the progress bar. in Proceedings of the 20th annual ACM symposium on User interface software and technology, ACM, (2007), 115--118.","paperID":"None"},{"content":"Harrison, C., Yeo, Z. and Hudson, S.E. Faster progress bars: manipulating perceived duration with visual augmentations. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, (2010), 1545--1548.","paperID":"None"},{"content":"Hassenzahl, M. and Sandweg, N. From mental effort to perceived usability: transforming experiences into summary assessments CHI '04 Extended Abstracts on Human Factors in Computing Systems, ACM, Vienna, Austria, 2004, 1283--1286","paperID":"None"},{"content":"Kahneman, D. Evaluation by Moments: Past and Future. in Kahneman, D. and Tversky, A. eds. Choices, Values and Frames, Cambridge University Press NY, 2000.","paperID":"None"},{"content":"Kahneman, D. Experience Utility and Objective Happiness: A Moment-Based Approach. in Kahneman, D. and Tversky, A. eds. Choices, Values and Frames, Cambridge University Press NY, 2000.","paperID":"None"},{"content":"Kahneman, D., Fredrickson, B., Schreiber, C. and Redelmeier, D. When More Pain Is Preferred to Less: Adding a Better End. Journal of Personality and Social Psychology 65, 1 (1993), 401--405.","paperID":"None"},{"content":"Kahneman, D., Wakker, P. and Sarin, R. Back to Bentham? Explorations of Experienced Utility. The Quarterly Journal of Economics 112, 2 (1997), 375405.","paperID":"None"},{"content":"Langer, T., Sarin, R. and Weber, M. The retrospective evaluation of payment sequences: duration neglect and peak-and-end effects. Journal of Economic Behavior & Organization 58, 1 (2005), 157--175.","paperID":"None"},{"content":"McGonigal, J. 2014. Games Can Make a Better World. from http://janemcgonigal.com/2014/01/06/transcriptgames-can-make-a-better-world/.","paperID":"None"},{"content":"Nasiry, J. and Popescu, I. Dynamic Pricing with LossAverse Consumers and Peak-End Anchoring. Operations Research 59, 6 (2011), 1361--1368.","paperID":"None"},{"content":"Pagulayan, R.J., Keeker, K., Wixon, D., Romero, R.L. and Fuller, T. User-centered design in games. in Jacko, J., A and Sears, A. eds. The human-computer interaction handbook, L. Erlbaum Associates Inc., 2003, 883--906.","paperID":"None"},{"content":"Redelmeier, D.A. and Kahneman, D. Patients' memories of painful medical treatments: real-time and retrospective evaluations of two minimally invasive procedures. Pain 66, 1 (1996), 3--8.","paperID":"None"},{"content":"Redelmeier, D.A., Katz, J. and Kahneman, D. Memories of colonoscopy: a randomized trial. Pain 104, 1 (2003), 187--194.","paperID":"None"},{"content":"Ryan, R., Rigby, C.S. and Przybylski, A. The Motivational Pull of Video Games: A SelfDetermination Theory Approach. Motivation and Emotion 30, 4 (2006), 344--360.","paperID":"None"},{"content":"Streufert, S. and Streufert, S.C. Effects of conceptual structure, failure, and success on attribution of causality and interpersonal attitudes. Journal of Personality and Social Psychology 11, 2 (1969), 138--147.","paperID":"None"},{"content":"Švelch, J. Comedy of Contingency: Making Physical Humor in Video Game Spaces. International Journal of Communication 8 (2014), 2530--2552.","paperID":"None"},{"content":"Sweetser, P. and Wyeth, P. GameFlow: a model for evaluating player enjoyment in games. Comput. Entertain. 3, 3 (2005), 3--3.","paperID":"None"}],"abstract":"The peak-end rule is a psychological heuristic observing that people's retrospective assessment of an experience is strongly influenced by the intensity of the peak and final moments of that experience. We examine how aspects of game player experience are influenced by peak-end manipulations to the sequence of events in games that are otherwise objectively identical. A first experiment examines players' retrospective assessments of two games (a pattern matching game based on Bejeweled and a point-and-click reaction game) when the sequence of difficulty is manipulated to induce positive, negative and neutral peak-end effects. A second experiment examines assessments of a shootout game in which the balance between challenge and skill is similarly manipulated. Results across the games show that recollection of challenge was strongly influenced by peak-end effects; however, results for fun, enjoyment, and preference to repeat were varied -- sometimes significantly in favour of the hypothesized effects, sometimes insignificant, but never against the hypothesis.","title":"Peak-End Effects on Player Experience in Casual Games","filename":"CHI16/p5608","authors":["Carl Gutwin","Christianne Rooke","Andy Cockburn","Regan L. Mandryk","Benjamin Lafreniere"],"conference":"CHI '16"}