{"paperId":2858370,"citation":[],"reference":[{"content":"Ashkin, A. and Dziedzic, J. M. Optical levitation by radiation pressure. Applied Physics Letters (1971), 19(8), 283--285.","paperID":"None"},{"content":"Baker, A. C., Anastasiadis, K. and Humphrey, V. F. The nonlinear pressure field of a plane circular piston: Theory and experiment. The Journal of the Acoustical Society of America, 84(4), 1483--1487. (1988).","paperID":"None"},{"content":"Brandt, E. H. (2001). Acoustic physics: Suspended by sound. Nature, 413(6855), 474--475.","paperID":"None"},{"content":"Tom Carter, Sue Ann Seah, Benjamin Long, Bruce Drinkwater and Sriram Subramanian. 2013. UltraHaptics: multi-point mid-air haptic feedback for touch surfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 505--514. DOI=10.1145/2501988.2502018 http://doi.acm.org/10.1145/2501988.2502018","paperID":"None"},{"content":"Courtney, C. R., Drinkwater, B. W., Demore, C. E., Cochran, S., Grinenko, A. and Wilcox, P. D. (2013). Dexterous manipulation of microparticles using Bessel function acoustic pressure fields. Applied Physics Letters, 102(12), 123508.","paperID":"None"},{"content":"Foresti, D., Nabavi, M., Klingauf, M., Ferrari, A. and Poulikakos, D. (2013). Acoustophoretic contactless transport and handling of matter in air. Proceedings of the National Academy of Sciences, 110(31), 1254912554.","paperID":"None"},{"content":"Glynne-Jones, P., Démoré, C. E., Ye, C., Qiu, Y., Cochran, S. and Hill, M. (2012). Array-controlled ultrasonic manipulation of particles in planar acoustic resonator. Ultrasonics, Ferroelectrics, and Frequency Control, IEEE Transactions on, 59(6), 1258--1266.","paperID":"None"},{"content":"Hackaday. 2015. Ultrasonic power transfer: ubeam--s curious engineering. http://hackaday.com/the-curiouscase-of-ultrasonic-power-transfer/","paperID":"None"},{"content":"Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni and Jean-Baptiste Labrune. 2012. Radical atoms: beyond tangible bits, toward transformable materials. interactions 19, 1 (January 2012), 38--51. DOI=10.1145/2065327.2065337 http://doi.acm.org/10.1145/2065327.2065337","paperID":"None"},{"content":"Lam, K. H., Hsu, H. S., Li, Y., Lee, C., Lin, A., Zhou, Q., ... and Shung, K. K. (2013). Ultrahigh frequency lensless ultrasonic transducers for acoustic tweezers application. Biotechnology and bioengineering, 110(3), 881--886.","paperID":"None"},{"content":"Jinha Lee, Rehmi Post and Hiroshi Ishii. 2011. ZeroN: mid-air tangible interaction enabled by computer controlled magnetic levitation. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, New York, NY, USA, 327--336. DOI=10.1145/2047196.2047239 http://doi.acm.org/10.1145/2047196.2047239","paperID":"None"},{"content":"Marzo A., Seah S.A., Drinkwater B.W., Sahoo D.R., Long B. and Subramanian S. 2015. Holographic acoustic elements for manipulation of levitated objects. Nature communications, 6.","paperID":"None"},{"content":"Napier, J. R. (1956). The prehensile movements of the human hand. Journal of bone and joint surgery, 38(4), 902--913.","paperID":"None"},{"content":"Yoichi Ochiai, Takayuki Hoshi and Jun Rekimoto. 2014. Pixie dust: graphics generated by levitated and animated objects in computational acoustic-potential field. ACM Trans. Graph. 33, 4, Article 85 (July 2014), 13 pages. DOI=10.1145/2601097.2601118 http://doi.acm.org/10.1145/2601097.2601118","paperID":"None"},{"content":"Themis Omirou, Asier Marzo, Sue Ann Seah and Sriram Subramanian. 2015. LeviPath: Modular Acoustic Levitation for 3D Path Visualisations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 309--312. DOI=10.1145/2702123.2702333 http://doi.acm.org/10.1145/2702123.2702333","paperID":"None"},{"content":"Seah, S., Drinkwater, B., Carter, T., Malkin, R. and Subramanian, S. (2014). Correspondence: Dexterous ultrasonic levitation of millimeter-sized objects in air. IEEE transactions on ultrasonics, ferroelectrics, and frequency control, 61(7), 1233--1236.","paperID":"None"},{"content":"Tommaso Toffoli and Norman Margolus. 1991. Programmable matter: concepts and realization. Phys. D 47, 1--2 (January 1991), 263--272. DOI=10.1016/0167--2789(91)90296-L http://dx.doi.org/10.1016/0167--2789(91)90296-L","paperID":"None"},{"content":"Whymark, R. R. (1975). Acoustic field positioning for containerless processing. Ultrasonics, 13(6), 251--261.","paperID":"None"}],"abstract":"A tool able to generate remote forces would allow us to handle dangerous or fragile materials without contact or occlusions. Acoustic levitation is a suitable technology since it can trap particles in air or water. However, no approach has tried to endow humans with an intertwined way of controlling it. Previously, the acoustic elements were static, had to surround the particles and only translation was possible. Here, we present the basic manoeuvres that can be performed when levitators are attached to our moving hands. A Gauntlet of Levitation and a Sonic Screwdriver are presented with their manoeuvres for capturing, moving, transferring and combining particles. Manoeuvres can be performed manually or assisted by a computer for repeating patterns, stabilization and enhanced accuracy or speed. The presented prototypes still have limited forces but symbolize a milestone in our expectations of future technology.","title":"GauntLev: A Wearable to Manipulate Free-floating Objects","filename":"CHI16/p3277","authors":["Asier Marzo"],"conference":"CHI '16"}