{"paperId":2858156,"abstract":"In social play settings, it can be difficult for people with different skill levels to play a game together. Player balancing that provides skill assistance for the weaker player can allow for enjoyable play experiences; however, previous research (and conventional wisdom) has suggested that skill assistance should be kept hidden to avoid perceptions of unfairness. We carried out a study to test how disclosing skill assistance affects player experience. We found -- surprisingly -- that disclosing assistance did not harm play experience; players were more influenced by the benefits of equalized performance resulting from assistance than by their knowledge of the assist. We introduce the idea of attribution biases to help explain why awareness was not harmful -- people tend to take credit for their successes, but attribute failures externally. We discuss how game designers can incorporate skill assistance to build multiplayer games that improve experiences for a wide range of players.","citation":[],"reference":[{"content":"Sami Abuhamdeh, and Mihaly Csikszentmihalyi. 2012. The importance of challenge for the enjoyment of intrinsically motivated, goal-directed activities. Personality and Social Psychology Bulletin 38, no. 3: 317330.","paperID":"None"},{"content":"Sami Abuhamdeh, Mihaly Csikszentmihalyi, and Jalal Baland. 2015. Enjoying the possibility of defeat: Outcome uncertainty, suspense, and intrinsic motivation. Motivation and Emotion 39, no. 1: 1--10.","paperID":"None"},{"content":"Ernest Adams. 2008. Difficulty Modes and Dynamic Difficulty Adjustment. Gamasutra: The Art & Business of Making Games Blog. Published May.","paperID":"None"},{"content":"Ravin Balakrishnan. 2004. \"Beating\" Fitts' law: virtual enhancements for pointing facilitation. International Journal of Human-Computer Studies 61, no. 6: 857874.","paperID":"None"},{"content":"Alexander Baldwin, Daniel Johnson, and Peta A. Wyeth. 2014. The effect of multiplayer dynamic difficulty adjustment on the player experience of video games. In Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems (CHI EA '14). ACM, NY, NY, USA, 1489--1494.","paperID":"None"},{"content":"Scott Bateman, Regan L. Mandryk, Tadeusz Stach, and Carl Gutwin. 2011. Target assistance for subtly balancing competitive play. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2355--2364. http://doi.acm.org/10.1145/1978942.1979287","paperID":"None"},{"content":"Barbaros Bostan, and Sertaç Öğüt. 2009. Game challenges and difficulty levels: lessons learned From RPGs. In International Simulation and Gaming Association Conference.","paperID":"None"},{"content":"Jared E. Cechanowicz, Carl Gutwin, Scott Bateman, Regan Mandryk, and Ian Stavness. 2014. Improving player balancing in racing games. In Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play (CHI PLAY '14). ACM, NY, NY, USA, 47--56. http://doi.acm.org/10.1145/2658537.2658701","paperID":"None"},{"content":"Noah Falstein. 2005. Understanding fun-the theory of natural funativity. Introduction to game development: 71--98.","paperID":"None"},{"content":"Franz Faul, Edgar Erdfelder, Axel Buchner, and Albert-Georg Lang. 2009. Statistical power analyses using G* Power 3.1: Tests for correlation and regression analyses. Behavior research methods 41, no. 4: 11491160.","paperID":"None"},{"content":"Rocío Fernández-Ballesteros, ed. 2002. Encyclopedia of psychological assessment. Sage","paperID":"None"},{"content":"Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of experimental psychology 47, no. 6: 381.","paperID":"None"},{"content":"Tracy Fullerton. 2014. Game design workshop: a playcentric approach to creating innovative games. CRC.","paperID":"None"},{"content":"Kathrin Maria Gerling, Matthew Miller, Regan L. Mandryk, Max Valentin Birk, and Jan David Smeddinck. 2014. Effects of balancing for physical abilities on player performance, experience and self-esteem in exergames. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2201--2210. http://doi.acm.org/10.1145/2556288.2556963","paperID":"None"},{"content":"Janet Go, Rafael Ballagas, and Mirjana Spasojevic. 2012. Brothers and sisters at play: exploring game play with siblings. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 739--748. http://doi.acm.org/10.1145/2145204.2145316","paperID":"None"},{"content":"Hamilton A. Hernandez, T.C. Nicholas Graham, Darcy Fehlings, Lauren Switzer, Zi Ye, Quentin Bellay, Md Ameer Hamza, Cheryl Savery, and Tadeusz Stach. 2012. Design of an exergaming station for children with cerebral palsy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2619--2628. http://doi.acm.org/10.1145/2207676.2208652","paperID":"None"},{"content":"Robin Hunicke. 2005. The case for dynamic difficulty adjustment in games. In Proceedings of the 2005 ACM SIGCHI International Conference on Advances in computer entertainment technology (ACE '05). ACM, NY, NY, USA, 429--433. http://doi.acm.org/10.1145/1178477.1178573","paperID":"None"},{"content":"Robin Hunicke, and Vernell Chapman. 2004. AI for dynamic difficulty adjustment in games. In Challenges in Game Artificial Intelligence AAAI Workshop, vol. 2, p. 1. sn","paperID":"None"},{"content":"Peter Laurens, Richard F. Paige, Phillip J. Brooke, and Howard Chivers. 2007. A novel approach to the detection of cheating in multiplayer online games. In Engineering Complex Computer Systems. 12th IEEE International Conference on, pp. 97--106. IEEE 2007","paperID":"None"},{"content":"Julian Looser, Andy Cockburn, and Joshua Savage. 2005. On the validity of using First-Person Shooters for Fitts' law studies. People and Computers XIX 2: 33--36.","paperID":"None"},{"content":"Edward McAuley, Terry Duncan, and Vance V. Tammen. 1989. Psychometric properties of the Intrinsic Motivation Inventory in a competitive sport setting: A confirmatory factor analysis. Research quarterly for exercise and sport 60, no. 1: 48--58.","paperID":"None"},{"content":"Julie G. Moulard, Michael W. Kroff, and Judith Anne Garretson Folse. 2012. Unraveling consumer suspense: The role of hope, fear, and probability fluctuations. Journal of Business Research 65, no. 3: 340--346.","paperID":"None"},{"content":"Lennart E. Nacke, Chris Bateman, and Regan L. Mandryk. 2014. BrainHex: A neurobiological gamer typology survey. Entertainment computing 5, no. 1: 55--62.","paperID":"None"},{"content":"Bonnie Nardi and Justin Harris. 2006. Strangers and friends: collaborative play in world of warcraft. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work (CSCW '06). ACM, NY, NY, USA, 149--158. http://doi.acm.org/10.1145/1180875.1180898","paperID":"None"},{"content":"Daniel Natapov, Steven J. Castellucci, and I. Scott MacKenzie. 2009. ISO 9241--9 evaluation of video game controllers. In Proceedings of Graphics Interface 2009 (GI '09). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 223--230.","paperID":"None"},{"content":"Mark Newheiser. 2009. Playing Fair: A Look at Competition in Gaming. Strange Horizons.","paperID":"None"},{"content":"Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and emotion 30, no. 4: 344--360.","paperID":"None"},{"content":"Katie Salen, and Eric Zimmerman. 2004. Rules of play: Game design fundamentals. MIT press.","paperID":"None"},{"content":"Penelope Sweetser and Peta Wyeth. 2005. GameFlow: a model for evaluating player enjoyment in games. Comput. Entertain. 3, 3 (July 2005), 3--3. http://doi.acm.org/10.1145/1077246.1077253","paperID":"None"},{"content":"Graham Vaughan, and Michael A. Hogg. 2005. Introduction to social psychology. Pearson.","paperID":"None"},{"content":"Rodrigo Vicencio-Moreira, Regan L. Mandryk, Carl Gutwin, and Scott Bateman. 2014. The effectiveness (or lack thereof) of aim-assist techniques in first-person shooter games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 937--946. http://doi.acm.org/10.1145/2556288.2557308","paperID":"None"},{"content":"Rodrigo Vicencio-Moreira, Regan L. Mandryk, and Carl Gutwin. 2015. Now You Can Compete With Anyone: Balancing Players of Different Skill Levels in a First-Person Shooter Game. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, pp. 2255--2264. ACM.","paperID":"None"},{"content":"Peter Vorderer, Tilo Hartmann, and Christoph Klimmt. 2003. Explaining the enjoyment of playing video games: the role of competition. In Proceedings of the second international conference on Entertainment computing (ICEC '03). Carnegie Mellon University, Pittsburgh, PA, USA, 1--9.","paperID":"None"},{"content":"Bernard Weiner. 1979. A theory of motivation for some classroom experiences. Journal of educational psychology 71, no. 1: 3.","paperID":"None"},{"content":"Bernard Weiner. 1986. An attributional theory of motivation. Emotion, NY: Springer-Verlag.","paperID":"None"},{"content":"Bernard Weiner, 2001. Intrapersonal and interpersonal theories of motivation from an attribution perspective. In Student Motivation, pp. 17--30. Springer US, 2001.","paperID":"None"}],"title":"How Disclosing Skill Assistance Affects Play Experience in a Multiplayer First-Person Shooter Game","filename":"CHI16/p3462","authors":["Ansgar E. Depping","Regan L. Mandryk","Chengzhao Li","Carl Gutwin","Rodrigo Vicencio-Moreira"],"conference":"CHI '16"}