{"paperId":2858050,"citation":[],"reference":[{"content":"Jeffrey Bardzell and Shaowen Bardzell. 2013. What is \"Critical\" About Critical Design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3297--3306. DOI: http://dx.doi.org/10.1145/2470654.2466451","paperID":"None"},{"content":"Simon Baron-Cohen, Fiona J. Scott, Carrie Allison, Joanna Williams, Patrick Bolton, Fiona E. Matthews, and Carol Brayne. 2009. Prevalence of Autism-Spectrum Conditions: UK School-Based Population Study. The British Journal of Psychiatry 194 (2009), 500--509. DOI: http://dx.doi.org/10.1192/bjp.bp.108.059345","paperID":"None"},{"content":"Laura Benton and Hilary Johnson. 2015. Widening participation in technology design: A review of the involvement of children with special educational needs and disabilities. International Journal of Child-Computer Interaction (2015). DOI: http://dx.doi.org/10.1016/j.ijcci.2015.07.001","paperID":"None"},{"content":"Jan Borchers. 2001. A Pattern Approach to Interaction Design. John Wiley & Sons, Inc., NY, NY, USA.","paperID":"None"},{"content":"John Bowers. 2012. The logic of annotated portfolios: communicating the value of 'research through design'. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, Newcastle Upon Tyne, United Kingdom, 68--77. DOI: http://dx.doi.org/10.1145/2317956.2317968","paperID":"None"},{"content":"Peter Börjesson, Wolmet Barendregt, Eva Eriksson, and Olof Torgersson. 2015. Designing Technology for and with Developmentally Diverse Children: A Systematic Literature Review. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC '15). ACM, NY, NY, USA, 79--88. DOI: http://dx.doi.org/10.1145/2771839.2771848","paperID":"None"},{"content":"Nigel Cross. 2001. Designerly Ways of Knowing: Design Discipline Versus Design Science. Design Issues 17, 3 (2001), 49--55. DOI: http://dx.doi.org/10.1162/074793601750357196","paperID":"None"},{"content":"Peter Dalsgaard and Kim Halskov. 2012. Reflective design documentation. In Proceedings of the Designing Interactive Systems Conference. ACM, 428--437. http://dl.acm.org/citation.cfm?id=2318020","paperID":"None"},{"content":"Peter Dalsgaard, Kim Halskov, and Rune Nielsen. 2008. Maps for Design Reflection. Artifact 2, 3--4 (Sept. 2008), 176--189. DOI: http://dx.doi.org/10.1080/17493460802526412","paperID":"None"},{"content":"Christian Dindler and Ole Sejer Iversen. 2007. Fictional Inquiry Design collaboration in a shared narrative space. CoDesign 3, 4 (Dec. 2007), 213--234. DOI: http://dx.doi.org/doi:10.1080/15710880701500187","paperID":"None"},{"content":"Allison Druin. 1999. Cooperative Inquiry: Developing New Technologies for Children with Children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 592--599. DOI: http://dx.doi.org/10.1145/302979.303166","paperID":"None"},{"content":"Marc Fakhoury. 2015. Autistic spectrum disorders: A review of clinical features, theories and diagnosis. International Journal of Developmental Neuroscience 43 (June 2015), 70--77. DOI: http://dx.doi.org/10.1016/j.ijdevneu.2015.04.003","paperID":"None"},{"content":"Daniel Fallman and Erik Stolterman. 2010. Establishing criteria of rigour and relevance in interaction design research. Digital Creativity 21, 4 (2010), 265--272. DOI: http://dx.doi.org/10.1080/14626268.2010.548869","paperID":"None"},{"content":"Sue Fletcher-Watson. 2013. A Targeted Review of Computer-Assisted Learning for People with Autism Spectrum Disorder: Towards a Consistent Methodology. Review Journal of Autism and Developmental Disorders 1, 2 (Nov. 2013), 87--100. DOI: http://dx.doi.org/10.1007/s40489-013-0003--4","paperID":"None"},{"content":"Christopher Frauenberger. 2015. Disability and Technology A Critical Realist Perspective. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. ACM Press, Lisbon, Portugal, 8. DOI: http://dx.doi.org/10.1145/2700648.2809851","paperID":"None"},{"content":"Christopher Frauenberger, Judith Good, Alyssa Alcorn, and Helen Pain. 2013. Conversing Through and About Technologies: Design Critique as an Opportunity to Engage Children with Autism and Broaden Research(er) Perspectives. International Journal of Child-Computer Interaction 1, 2 (May 2013), 38--49. DOI: http://dx.doi.org/10.1016/j.ijcci.2013.02.001","paperID":"None"},{"content":"Christopher Frauenberger, Judith Good, Geraldine Fitzpatrick, and Ole Sejer Iversen. 2015. In pursuit of rigour and accountability in participatory design. International Journal of Human-Computer Studies 74, 0 (2015), 93--106. DOI: http://dx.doi.org/10.1016/j.ijhcs.2014.09.004","paperID":"None"},{"content":"Christopher Frauenberger, Judith Good, Wendy Keay-Bright, and Helen Pain. 2012. Interpreting Input from Children: A Designerly Approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2377--2386. DOI: http://dx.doi.org/10.1145/2207676.2208399","paperID":"None"},{"content":"Verena Fuchsberger, Martin Murer, and Manfred Tscheligi. 2013. Materials, materiality, and media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2853--2862. http://dl.acm.org/citation.cfm?id=2481395","paperID":"None"},{"content":"Bill Gaver and John Bowers. 2012. Annotated portfolios. interactions 19, 4 (July 2012), 40--49. DOI: http://dx.doi.org/10.1145/2212877.2212889","paperID":"None"},{"content":"William Gaver. 2012. What should we expect from research through design?. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems (CHI '12). ACM, Austin, TX, USA, 937--946. DOI: http://dx.doi.org/10.1145/2208516.2208538","paperID":"None"},{"content":"O. Golan, E. Ashwin, Y. Granader, S. McClintock, K. Day, V. Leggett, and S. Baron-Cohen. 2010. Enhancing emotion recognition in children with autism spectrum conditions: an intervention using animated vehicles with real emotional faces. Journal of autism and developmental disorders 40, 3 (2010), 269--279. DOI: http://dx.doi.org/10.1007/s10803-009-0862--9","paperID":"None"},{"content":"Ouriel Grynszpan, Patrice L. (Tamar) Weiss, Fernando Perez-Diaz, and Eynat Gal. 2014. Innovative technology-based interventions for autism spectrum disorders: A meta-analysis. Autism 18, 4 (May 2014), 346--361. DOI: http://dx.doi.org/10.1177/1362361313476767","paperID":"None"},{"content":"S. Harrison, D. Tatar, and P. Sengers. 2007. The Three Paradigms of HCI. In Proceedings of alt.chi. ACM SIGCHI.","paperID":"None"},{"content":"Sen H. Hirano, Michael T. Yeganyan, Gabriela Marcu, David H. Nguyen, Lou Anne Boyd, and Gillian R. Hayes. 2010. vSked: evaluation of a system to support classroom activities for children with autism. In Proceedings of the 28th international conference on Human factors in computing systems (CHI '10). ACM, Atlanta, Georgia, USA, 1633--1642. DOI: http://dx.doi.org/10.1145/1753326.1753569","paperID":"None"},{"content":"Juan Pablo Hourcade, Stacy R. Williams, Ellen A. Miller, Kelsey E. Huebner, and Lucas J. Liang. 2013. Evaluation of Tablet Apps to Encourage Social Interaction in Children with Autism Spectrum Disorders. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3197--3206. DOI: http://dx.doi.org/10.1145/2470654.2466438","paperID":"None"},{"content":"Kristina Höök, Peter Dalsgaard, Stuart Reeves, Jeffrey Bardzell, Jonas Löwgren, Erik Stolterman, and Yvonne Rogers. 2015. Knowledge Production in Interaction Design. ACM Press, 2429--2432. DOI: http://dx.doi.org/10.1145/2702613.2702653","paperID":"None"},{"content":"Kristina Höök and Jonas Löwgren. 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Transactions on Computer-Human Interaction 19, 3 (Oct. 2012), 1--18. DOI: http://dx.doi.org/10.1145/2362364.2362371","paperID":"None"},{"content":"Lorcan Kenny, Caroline Hattersley, Bonnie Molins, Carole Buckley, Carol Povey, and Elizabeth Pellicano. 2015. Which terms should be used to describe autism? Perspectives from the UK autism community. Autism (July 2015), 1362361315588200. DOI: http://dx.doi.org/10.1177/1362361315588200","paperID":"None"},{"content":"Bruno Latour. 2005. Reassembling the social: an introduction to actor-network-theory. Oxford University Press, Oxford ; NY.","paperID":"None"},{"content":"Jennifer Mankoff, Gillian R. Hayes, and Devva Kasnitz. 2010. Disability studies as a source of critical inquiry for the field of assistive technology. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '10). ACM, Orlando, Florida, USA, 3--10. DOI: http://dx.doi.org/10.1145/1878803.1878807","paperID":"None"},{"content":"Laura Millen, Sue Cobb, and Harshada Patel. 2011. A method for involving children with autism in design. In Proceedings of the 10th International Conference on Interaction Design and Children (IDC '11). ACM, Ann Arbor, Michigan, 185--188. DOI: http://dx.doi.org/10.1145/1999030.1999057","paperID":"None"},{"content":"Judith S. Olson and Wendy A. Kellogg (Eds.). 2014. Ways of Knowing in HCI. Springer NY, NY, NY. http://link.springer.com/10.1007/978--1--4939-0378--8","paperID":"None"},{"content":"Sathiyaprakash Ramdoss, Wendy Machalicek, Mandy Rispoli, Austin Mulloy, Russell Lang, and Mark O'Reilly. 2012. Computer-based interventions to improve social and emotional skills in individuals with autism spectrum disorders: A systematic review. Developmental Neurorehabilitation 15, 2 (2012), 119--135. DOI: http://dx.doi.org/10.3109/17518423.2011.651655","paperID":"None"},{"content":"Donald A. Schön. 1983. The Reflective Practitioner: How Professionals Think in Action. Basic Books, NY.","paperID":"None"},{"content":"Tom Shakespeare. 2014. Disability Rights and Wrongs Revisited (second edition ed.). Routledge, Oxon UK.","paperID":"None"},{"content":"Jim Sinclair. 2013. Why I dislike \"person first\" Language. Autonomy, the Critical Journal of Interdisciplinary Autism Studies 1, 2 (Oct. 2013). http://www.larry-arnold.net/Autonomy/index.php/autonomy/article/view/OP1","paperID":"None"},{"content":"Erik Stolterman. 2008. The Nature of Design Practice and Implications for Interaction Design Research. International Journal of Design 2, 1 (2008). http://www.ijdesign.org/ojs/index.php/IJDesign/article/view/240","paperID":"None"},{"content":"Lucy Suchman. 1998. Human/Machine Reconsidered. Cognitive Studies 5, 1 (1998), 1_5--1_13. DOI: http://dx.doi.org/10.11225/jcss.5.1_5","paperID":"None"},{"content":"Fenne van Doorn, Pieter Jan Stappers, and Mathieu Gielen. 2013. Design research by proxy: using children as researchers to gain contextual knowledge about user experience.. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2883--2892. http://dl.acm.org/citation.cfm?id=2481399","paperID":"None"},{"content":"Giasemi Vavoula and Mike Sharples. 2007. Future technology workshop: A collaborative method for the design of new learning technologies and activities. International Journal of Computer-Supported Collaborative Learning 2, 4 (2007), 393--419. DOI: http://dx.doi.org/10.1007/s11412-007--9026-0","paperID":"None"},{"content":"Michele A. Williams, Caroline Galbraith, Shaun K. Kane, and Amy Hurst. 2014. \"Just Let the Cane Hit It\": How the Blind and Sighted See Navigation Differently. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, NY, NY, USA, 217--224. DOI: http://dx.doi.org/10.1145/2661334.2661380","paperID":"None"},{"content":"Tracee Vetting Wolf, Jennifer A. Rode, Jeremy Sussman, and Wendy A. Kellogg. 2006. Dispelling \"design\" as the black art of CHI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, Montral, Canada, 521--530. DOI: http://dx.doi.org/10.1145/1124772.1124853","paperID":"None"},{"content":"Jason Yip, Tamara Clegg, Elizabeth Bonsignore, Helene Gelderblom, Emily Rhodes, and Allison Druin. 2013. Brownies or Bags-of-stuff?: Domain Expertise in Cooperative Inquiry with Children. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). ACM, NY, NY, USA, 201--210. DOI: http://dx.doi.org/10.1145/2485760.2485763","paperID":"None"},{"content":"John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In CHI '07: Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, San Jose, California, USA, 493--502. DOI: http://dx.doi.org/10.1145/1240624.1240704","paperID":"None"},{"content":"John Zimmerman, Erik Stolterman, and Jodi Forlizzi. 2010. An analysis and critique of Research through Design: towards a formalization of a research approach. In DIS '10: Proceedings of the 8th ACM Conference on Designing Interactive Systems. ACM, Aarhus, Denmark, 310--319. DOI: http://dx.doi.org/10.1145/1858171.1858228","paperID":"None"}],"abstract":"This paper describes the design work being conducted as part of the OutsideTheBox project. Within the time-frame of eight months, we engaged four children with autism in a participatory design process to develop their own smart object. We re-interpreted Future Workshops and Co-operative Inquiry to demonstrate that a) autistic children can lead processes with a deliberately open design brief and b) this leads us to explore design spaces that are un-imaginable for neuro-typical, adult designers. To capture these four design cases, we have developed Design Exposes, a concept that is inspired by annotated portfolios and Actor-Network Theory. We apply this concept to our cases and present four exposes that subsequently allow us to draw out intermediate-level design knowledge about co-creating technology with autistic children. We close by critically reflecting on the design processes as well as our concept of capturing them.","title":"Designing Smart Objects with Autistic Children: Four Design Exposès","filename":"CHI16/p130","authors":["Christopher Frauenberger","Julia Makhaeva","Katharina Spiel"],"conference":"CHI '16"}