{"paperId":2858318,"citation":[],"reference":[{"content":"Harry Brignull and Yvonne Rogers. 2003. Enticing people to interact with large public displays in public spaces. In Proceedings of the Conference on Human-Computer Interaction (INTERACT '03). 17--24.","paperID":"None"},{"content":"Martin Brynskov, Ava Fatah, and Peter Dalsgaard 2014. Proceedings of the 2nd Media Architecture Biennale Conference: World Cities.","paperID":"None"},{"content":"Martin Brynskov, Ava Fatah, and Peter Dalsgaard. 2012. Proceedings of the 1st Media Architecture Biennale Conference: Participation.","paperID":"None"},{"content":"Michael Burmester, Marcus Mast, Kilian Jäger, and Hendrik Homans. 2010. Valence Method for Formative Evaluation of User Experience. In Proceedings of the SIGCHI Conference on Designing Interactive Systems (DIS '10), 364--367. doi: 10.1145/1858171.1858239","paperID":"None"},{"content":"Peter Dalsgaard and Kim Halskov. 2009. Dynamically Transparent Window. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 3019--3034. doi: 10.1145/1520340.1520429","paperID":"None"},{"content":"Peter Dalsgaard and Kim Halskov. 2010. Designing Urban Media Façades: Cases and Challenges. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 2277--2286. doi: 10.1145/1753326.1753670","paperID":"None"},{"content":"Peter Dalsgaard and Kim Halskov. 2011. 3D Projection on Physical Objects: Design Insights from Five Real Life Cases. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1041--1050. doi: 10.1145/1978942.1979097","paperID":"None"},{"content":"Pelle Ehn and Morten Kyng. 1991. Cardboard Computers: Mocking-it-up and hands-on the future. In Design at Work: Cooperative Design of Computer Systems, ed. Greenbaum, J. and Kyng, M. Hillsdale, NJ: Lawrence Erlbaum Associates, 169--195. ISBN:08058-0612--1","paperID":"None"},{"content":"Eva Eriksson. 2006. Bthere or be Square: A Method for Extreme Contextualizing of Design. In Proceedings of Wonderground.","paperID":"None"},{"content":"Hans William Falck and Kim Halskov. 2013. Towards a Framework for Projection Installations. In Proceedings of the SIGCHI Conference on Pervasive Displays (PerDis '13), 67--72. doi: 10.1145/2491568.2491583","paperID":"None"},{"content":"Patrick Tobias Fischer and Eva Hornecker. 2012. Urban HCI: spatial aspects in the design of shared encounters for media facades. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). 307--316. doi: 10.1145/2207676.2207719","paperID":"None"},{"content":"Patrick Tobias Fischer, Christian Zöllner, and Eva Hornecker. 2010. VR/Urban: Spread.gun Design process and challenges in developing a shared encounter for media façades. In Proceedings of the 24th BCS Interaction Specialist Group Conference (BCS '10), 289--298.","paperID":"None"},{"content":"Dennis Frenchman and Francisca Rojas. 2006. Zaragoza's Digital Mile: Place Making in a New Public Realm. City.","paperID":"None"},{"content":"Kim Halskov and Peter Dalsgaard.2006. Inspiration card workshops. In Proceedings of the SIGCHI conference on Designing Interactive systems (DIS '06), 2--11. doi: 10.1145/1142405.1142409","paperID":"None"},{"content":"Kim Halskov and Tobias Ebsen. 2013. A framework for designing complex media facades. Design Studies 34 (5), 663--679 Elsevier. doi: 10.1016/j.destud.2013.04.001","paperID":"None"},{"content":"Kim Halskov and Rune Nielsen. 2006. Virtual video prototyping. Human-Computer Interaction Journal vol 21, (199--233).","paperID":"None"},{"content":"Luke Hespanhol and Peter Dalsgaard. 2015. Social Interaction Design Patterns for Urban Media Architecture. In Proceedings of the Conference on Human-Computer Interaction (INTERACT '15). 596613. doi: 10.1007/978--3--319--22698--9","paperID":"None"},{"content":"Marius Hoggenmueller and Alexander Wiethoff. 2014. LightSet: enabling urban prototyping of interactive media façades. In Proceedings of the SIGCHI Conference on Designing Interactive Systems (DIS '14), 925--934. doi: 10.1145/2598510.2598551","paperID":"None"},{"content":"Marius Hoggenmueller and Alexander Wiethoff. 2015. Blinking Lights and Other Revelations - Experiences Designing Hybrid Media Facades. In Proceedings of the SIGCHI Conference on Pervasive Displays (PerDis '15), 77--82. doi: 10.1145/2757710.2757725","paperID":"None"},{"content":"Henrik Korsgaard, Nicolai Brodersen Hansen, Ditte Basballe, Peter Dalsgaard, and Kim Halskov. 2012. Odenplan-a media façade design process. In Proceedings of the Media Architecture Biennale (MAB '12) 23--32. doi: 10.1145/2421076.2421081","paperID":"None"},{"content":"Paul Marshall, Richard Morris, Yvonne Rogers, Stefan Kreitmayer, and Matt Davies. 2011. Rethinking \"multiuser\": an in-the-wild study of how groups approach a walk-up-and-use tabletop interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 3033--3042. doi: 10.1145/1978942.1979392","paperID":"None"},{"content":"Andrew Vande Moere and Niels Wouters. 2012. The role of context in media architecture. In Proceedings of the International Symposium on Pervasive Displays (PerDis '12), Article 12. doi: 10.1145/2307798.2307810","paperID":"None"},{"content":"Peter Peltonen, Esko Kurvinen, Antti Salovaara, Giulio Jacucci, Tommi Ilmonen, John Evans, Antti Oulasvirta, and Petri Saarikko. 2008. It's Mine, Don't Touch!: interactions at a large multi-touch display in a city centre. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 1285--1294. doi: 10.1145/1357054.1357255","paperID":"None"},{"content":"Casey Reas and Ben Fry.2007. Processing - A Programming Handbook for Visual Designers and Artists, MIT Press.","paperID":"None"},{"content":"Thomas W. Reynolds, and Jonathan Gutman. 1988. Laddering Theory, Method, Analysis, and Interpretation. Journal of Advertising Research, vol. 28.","paperID":"None"},{"content":"Susanne Seitinger, Daniel S. Perry, and William J. Mitchell. 2009. Urban pixels: painting the city with light. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). 839848. doi: 10.1145/1518701.1518829","paperID":"None"},{"content":"Aleander Wiethoff and Andreas Butz. 2010. ColourVision Controlling Light Patterns through Postures In Proceedings of the International Symposium on Smart Graphics. ISBN 978--3--64213543--9","paperID":"None"},{"content":"Alexander Wiethoff and Magdalena Bloeckner. 2011. Lightbox -- Exploring Interaction Modalities with Colored Light. In Proceedings of the SIGCHI Conference on Tangible, Embedded and Embodied Interactions (TEI '11), 399--400. doi: 10.1145/1935701.1935799","paperID":"None"},{"content":"Alexander Wiethoff and Sven Gehring. 2012. Designing interaction with media façades: A case study. In Proceedings of the SIGCHI Conference on Designing Interactive Systems (DIS '12), 308--317. doi: 10.1145/2317956.2318004","paperID":"None"},{"content":"Alexander Wiethoff, Jana Gerstberger and Sven Gehring. 2015. StarLight - Exploring Embodied Interactions with Media Architecture and Large Public Audiences. In Proceedings of the SIGCHI Conference on Pervasive Displays (PerDis '15), 83--89. doi: 10.1145/2757710.2757726","paperID":"None"},{"content":"Alexander Wiethoff, Thomas Bauer, and Sven Gehring. 2014. Investigating Multi-User Interactions on Interactive Media Façades. In Proceedings of the Media Architecture Biennale (MAB '14), 92--100. doi: 10.1145/2682884.2682890","paperID":"None"},{"content":"Alexander Wiethoff, Marius Hoggenmueller, and Eva Hornecker. 2014. Orkhfistra: on the design of interactive media architecture for public environments. In Proceedings of the Nordic Conference on Human-Computer Interaction (NordiCHI '14), 1077--1080. doi: 10.1145/2639189.2670280","paperID":"None"}],"abstract":"Media Architecture is reaching a level of maturity at which we can identify tools and approaches for addressing the main challenges for HCI practitioners working in this field. While previous influential contributions within Media Architecture have identified challenges for designers and offered case studies of specific approaches, here, we (1) provide guidance on how to tackle the domain-specific challenges of Media Architecture design -- pertaining to the interface, integration, content, context, process, prototyping, and evaluation -- on the basis of the development of numerous installations over the course of seven years, and thorough studies of related work, and (2) present five categories of tools and approaches -- software tools, projection, 3D models, hardware prototyping, and evaluation tools -- developed to address these challenges in practice, exemplified through six concrete examples from real-life cases.","title":"Designing Media Architecture: Tools and Approaches for Addressing the Main Design Challenges","filename":"CHI16/p2562","authors":["Peter Dalsgaard","Kim Halskov","Alexander Wiethoff"],"conference":"CHI '16"}