{"paperId":2858372,"citation":[],"reference":[{"content":"D. Asenov and P. Müller. 2013. Customizing the visualization and interaction for embedded domain-specific languages in a structured editor. In Visual Languages and Human-Centric Computing (VL/HCC), 2013 IEEE Symposium on. 127-130. DOI: http://dx.doi.org/10.1109/VLHCC.2013.6645255","paperID":"None"},{"content":"D. Asenov and P. Müller. 2014. Envision: A fast and flexible visual code editor with fluid interactions (Overview). In Visual Languages and Human-Centric Computing (VL/HCC), 2014 IEEE Symposium on. 9-12. DOI: http://dx.doi.org/10.1109/VLHCC.2014.6883014","paperID":"None"},{"content":"A. Bragdon, R. Zeleznik, S. P. Reiss, S. Karumuri, W. Cheung, J. Kaplan, C. Coleman, F. Adeputra, and Joseph J. LaViola, Jr. 2010. Code Bubbles: a working set-based interface for code understanding and maintenance. In Proceedings of the 28th international conference on Human factors in computing systems (CHI '10). ACM, New York, NY, USA, 2503-2512. DOI: http://dx.doi.org/10.1145/1753326.1753706","paperID":"None"},{"content":"S. Conversy. 2014. Unifying Textual and Visual: A Theoretical Account of the Visual Perception of Programming Languages. In Proceedings of the 2014 ACM International Symposium on New Ideas, New Paradigms, and Re?ections on Programming & Software (Onward! 2014). ACM, New York, NY, USA, 201-212. DOI: http://dx.doi.org/10.1145/2661136.2661138","paperID":"None"},{"content":"G. Cumming. 2014. The New Statistics: Why and How. Psychological Science 25, 1 (2014), 7-29. DOI: http://dx.doi.org/10.1177/0956797613504966","paperID":"None"},{"content":"R. DeLine, A. Bragdon, K. Rowan, J. Jacobsen, and S. P. Reiss. 2012. Debugger Canvas: industrial experience with the Code Bubbles paradigm. In Proceedings of the 2012 International Conference on Software Engineering (ICSE 2012). IEEE Press, Piscataway, NJ, USA, 1064-1073. http://dl.acm.org/citation.cfm?id=2337223.2337362","paperID":"None"},{"content":"R. DeLine and K. Rowan. 2010. Code canvas: zooming towards better development environments. In Proceedings of the 32nd ACM/IEEE International Conference on Software Engineering - Volume 2 (ICSE '10). ACM, New York, NY, USA, 207-210. DOI: http://dx.doi.org/10.1145/1810295.1810331","paperID":"None"},{"content":"P. Dragicevic. 2016. Fair Statistical Communication in HCI. In Modern Statistical Methods for HCI, J. Robertson and M.C. Kaptein (Eds.). Springer. In press.","paperID":"None"},{"content":"J. Feigenspan, C. Kstner, S. Apel, J. Liebig, M. Schulze, R. Dachselt, M. Papendieck, T. Leich, and G. Saake. 2013. Do background colors improve program comprehension in the #ifdef hell? Empirical Software Engineering 18, 4 (2013), 699-745. DOI: http://dx.doi.org/10.1007/s10664-012--9208-x","paperID":"None"},{"content":"T.R.G. Green and M. Petre. 1992. When visual programs are harder to read than textual programs. In Human-Computer Interaction: Tasks and Organisation, Proceedings ECCE-6 (6th European Conference Cognitive Ergonomics). 57.","paperID":"None"},{"content":"T.R.G. Green and M. Petre. 1996. Usability Analysis of Visual Programming Environments: A \"Cognitive Dimensions\" Framework. JVLC 7, 2 (1996), 131 - 174. DOI: http://dx.doi.org/10.1006/jvlc.1996.0009","paperID":"None"},{"content":"T. Hakala, P. Nykyri, and J. Sajaniemi. 2006. An Experiment on the Effects of Program Code Highlighting on Visual Search for Local Patterns. Psychology of Programming Interest Group (2006), 38-52.","paperID":"None"},{"content":"D. Hendrix, II Cross, J.H., and S. Maghsoodloo. 2002. The effectiveness of control structure diagrams in source code comprehension activities. Software Engineering, IEEE Transactions on 28, 5 (May 2002), 463-477. DOI: http://dx.doi.org/10.1109/TSE.2002.1000450","paperID":"None"},{"content":"A. Z. Henley and S. D. Fleming. 2014. The Patchworks Code Editor: Toward Faster Navigation with Less Code Arranging and Fewer Navigation Mistakes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2511-2520. DOI: http://dx.doi.org/10.1145/2556288.2557073","paperID":"None"},{"content":"A. J. Ko and B. A. Myers. 2006. Barista: An implementation framework for enabling new tools, interaction techniques and views in code editors. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI '06). ACM, New York, NY, USA, 387-396. DOI: http://dx.doi.org/10.1145/1124772.1124831","paperID":"None"},{"content":"T. Lieber, J. R. Brandt, and R. C. Miller. 2014. Addressing Misconceptions About Code with Always-on Programming Visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2481-2490. DOI: http://dx.doi.org/10.1145/2556288.2557409","paperID":"None"},{"content":"S. Matht, D. Schreij, and J. Theeuwes. 2012. OpenSesame: An open-source, graphical experiment builder for the social sciences. Behavior Research Methods 44, 2 (2012), 314-324. DOI: http://dx.doi.org/10.3758/s13428-011-0168--7","paperID":"None"},{"content":"F. Olivero, M. Lanza, M. D'Ambros, and R. Robbes. 2011. Enabling program comprehension through a visual object-focused development environment. In Visual Languages and Human-Centric Computing (VL/HCC), 2011 IEEE Symposium on. 127 -134. DOI: http://dx.doi.org/10.1109/VLHCC.2011.6070389","paperID":"None"},{"content":"J. Ou, M. Vechev, and O. Hilliges. 2015. An Interactive System for Data Structure Development. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3053-3062. DOI: http://dx.doi.org/10.1145/2702123.2702319","paperID":"None"},{"content":"J. Sillito, G. C. Murphy, and K. De Volder. 2006. Questions programmers ask during software evolution tasks. In Proceedings of the 14th ACM SIGSOFT international symposium on Foundations of software engineering (SIGSOFT '06/FSE-14). ACM, New York, NY, USA, 23-34. DOI: http://dx.doi.org/10.1145/1181775.1181779","paperID":"None"},{"content":"R. Wilcox. 2012. Chapter 4 Confidence Intervals in the One-Sample Case. In Introduction to Robust Estimation and Hypothesis Testing (Third Edition) (third edition ed.), R. Wilcox (Ed.). Academic Press, Boston, 103 - 136. DOI: http://dx.doi.org/10.1016/ B978-0--12--386983--8.00004--4","paperID":"None"}],"abstract":"Researchers often introduce visual tools to programming environments in order to facilitate program comprehension, reduce navigation times, and help developers answer difficult questions. Syntax highlighting is the main visual lens through which developers perceive their code, and yet its effects and the effects of richer code presentations on code comprehension have not been evaluated systematically. We present a rigorous user study comparing mainstream syntax highlighting to two visually-enhanced presentations of code. Our results show that: (1) richer code visualizations reduce the time necessary to answer questions about code features, and (2) contrary to the subjective perception of developers, richer code visualizations do not lead to visual overload. Based on our results we outline practical recommendations for tool designers.","title":"The Effect of Richer Visualizations on Code Comprehension","filename":"CHI16/p5040","authors":["Dimitar Asenov","Otmar Hilliges","Peter Müller"],"conference":"CHI '16"}