{"paperId":2858126,"reference":[{"content":"Agnew, J. The Causes and Effects of Distortion and Internal Noise in Hearing Aids. Trends Amplif 3, 3 (1998), 82--118.","paperID":"None"},{"content":"Alsos, O.A., Das, A., and Svanæs, D. Mobile health IT: the effect of user interface and form factor on doctor-patient communication. Int J Med Inform 81, 1 (2012), 12--28.","paperID":"None"},{"content":"Bødker, S. Understanding representation in design. Hum.-Comput. Interact. 13, 2 (1998), 107--125.","paperID":"None"},{"content":"Chen, Y., Ngo, V., Harrison, S., and Duong, V. Unpacking exam-room computing: negotiating computer-use in patient-physician interactions, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Vancouver, BC, Canada, ACM (2011), 3343--3352.","paperID":"None"},{"content":"Christiansen, E. Boundary objects, please rise! On the role of boundary objects in distributed collaboration and how to design for them, in CHI 2005 Workshop of Cognition and Collaboration, Portland, OR, (2005),","paperID":"None"},{"content":"Dahl, Y., Linander, H., and Hanssen, G.K. Co-designing interactive tabletop solutions for active patient involvement in audiological consultations, in Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational, Helsinki, Finland, ACM (2014), 207--216.","paperID":"None"},{"content":"Dahl, Y. and Svanæs, D. A comparison of location and token-based interaction techniques for point-of-care access to medical information. Personal Ubiquitous Comput. 12, 6 (2008), 459--478.","paperID":"None"},{"content":"Dix, A. Designing for appropriation, in Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI...but not as we know it Volume 2, University of Lancaster, United Kingdom, British Computer Society (2007), 27--30.","paperID":"None"},{"content":"Dourish, P. The Appropriation of Interactive Technologies: Some Lessons from Placeless Documents. CSCW 12, (2003), 465--490.","paperID":"None"},{"content":"Elberling, C. and Worsoe, K. Fading Sounds: About Hearing and Hearing Aids. Bording A/S, DK-2730 Herlev, Denmark (2006).","paperID":"None"},{"content":"English, K. Get ready for the Next Big Thing in audiologic counseling. Hearing Journal 58, 7 (2005), 10--15.","paperID":"None"},{"content":"Epstein, R.M. and Street, R.L.J. The Values and Value of Patient-Centered Care. Ann Fam Med 9, 2 (2011), 100--103.","paperID":"None"},{"content":"Goff, A.E., The Use of Hearing Aid Outcome Measures in the Audiologic Treatment of Older Adults, in Ohio State University. Department of Speech and Hearing Sciences. 2013.","paperID":"None"},{"content":"Grenness, C., Hickson, L., Laplante-Lévesque, A., Meyer, C., and Davidson, B. Communication patterns in audiologic rehabilitation history-taking: audiologists, patients, and their companions. Ear Hear 36, 2 (2015), 191--204.","paperID":"None"},{"content":"Humes, L.E. Dimensions of Hearing Aid Outcome. J Am Acad Audiol 10, 26--39 (1999).","paperID":"None"},{"content":"Jang, A., MacLean, D.L., and Heer, J. BodyDiagrams: improving communication of pain symptoms through drawing, in Proceedings of the 32nd annual ACM conference on Human factors in computing systems, Toronto, Ontario, Canada, ACM (2014), 1153--1162.","paperID":"None"},{"content":"Jenstad, L.M., Van Tasell, D.J., and Ewert, C. Hearing aid troubleshooting based on patient's descriptions. Journal of the American Academy of Audiology 14, 7 (2003).","paperID":"None"},{"content":"Kjeldsen, M.P. and Matthews, B. Talking about hearing: designing from users' problematisations, in Proceedings of the 5th Nordic conference on Human-computer interaction: building bridges, Lund, Sweden, ACM (2008), 531--534.","paperID":"None"},{"content":"Knutson, J.F. and Lansing, C.R. The relationship between communication problems and psychological difficulties in persons with profound acquired hearing loss. Journal of Speech and Hearing Disorders 55, 8 (1990).","paperID":"None"},{"content":"Kuk, F., Bülow, M., Damsgaard, A., Ludvigsen, C., and Jessen, A. Hearing Aid Fittings and the Use of Simulated Sound Environments. The Hearing Review (2004), 42--49.","paperID":"None"},{"content":"Luff, P. and Heath, C. Mobility in collaboration, in Proceedings of the 1998 ACM conference on Computer supported cooperative work, Seattle, Washington, USA, ACM (1998), 305--314.","paperID":"None"},{"content":"Martin, R.L. \"Wear your hearing aids or your brain will rust\". Hearing Journal 57, 1 (2004), 46.","paperID":"None"},{"content":"Matthews, B. and Heinemann, T. Technology use and patient participation in audiological consultations. AMJ 1, 12 (2009), 174--180.","paperID":"None"},{"content":"McCormack, A. and Fortnum, H. Why do people fitted with hearing aids not wear them? Int J Audiol 52, 5 (2013), 360--368.","paperID":"None"},{"content":"Mick, P., Foley, D.M., and Lin, F.R. Hearing loss is associated with poorer ratings of patient-physician communication and healthcare quality. J Am Geriatr Soc 62, 11 (2014), 2207--2209.","paperID":"None"},{"content":"Robinson, J., Russ, D., and Siu, B. Effect of multimedia fitting tool on final gain settings. The Hearing Review 9, 3 (2002), 42--45.","paperID":"None"},{"content":"Schmidt, K. and Bannon, L. Taking CSCW seriously: Supporting articulation work. CSCW 1, 1 (1992), 7--40.","paperID":"None"},{"content":"Shield, B. Evaluation of the social and economic costs of hearing impairment: A report for Hear-It. London: London South Bank University (2006).","paperID":"None"},{"content":"Star, S.L. and Griesemer, J.R. Institutional Ecology, 'Translations' and Boundary Objects: Amateurs and Professionals in Berkeley's Museum of Vertebrate Zoology, 1907--39. Social Studies of Science 19, (1989), 387--420.","paperID":"None"},{"content":"Street, R.J., Gordon, H., Ward, M., Krupat, E., and Kravitz, R. Patient participation in medical consultations: why some patients are more involved than others. Med Care 43, 10 (2005), 960--969.","paperID":"None"},{"content":"Tye-Murray, N., Spry, J.L., and Mauzé, E. Professionals with Hearing Loss: Maintaining That Competitive Edge. Ear and Hearing 30, 4 (2009), 475--484.","paperID":"None"},{"content":"Wilcox, L., Morris, D., Tan, D., and Gatewood, J. Designing patient-centric information displays for hospitals, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Atlanta, Georgia, USA, ACM (2010), 2123--2132.","paperID":"None"},{"content":"Öberg, M., Approaches to Audiological Rehabilitation with Hearing Aids: Studies on pre-fitting strategies and assessment of outcomes (Doctoral thesis). 2008, Division of Technical Audiology, Department of Clinical and Experimental Medicine, Linköping University.","paperID":"None"}],"citation":[],"abstract":"This paper explores how interactive technology can help overcome barriers to active patient participation in audiological consultations involving hearing aid tuning. We describe the design and evaluation of a prototype sound simulator intended to trigger reflection in patients regarding their hearing experiences, and help guide the tuning process. The prototype was tested in twelve consultations. Our findings suggest that it helped facilitate patient participation during the tuning process by: (1) encouraging an iterative, patient-driven approach; (2) stimulating context-specific feedback and follow-up questions; (3) helping patients make sense of medical information and treatment actions; (4) offering patient control over the process pace and what situations to optimize for; and (5) promoting reflections on daily hearing aid use. Post-consultation interviews revealed that the prototype was perceived useful in several ways. Our results highlight the benefit of flexible designs that can be appropriated to fit the spontaneous needs of patients and audiologists","title":"Breaking the Sound Barrier: Designing for Patient Participation in Audiological Consultations","filename":"CHI16/p3079","authors":["Yngve Dahl","Geir Kjetil Hanssen"],"conference":"CHI '16"}