{"paperId":2858567,"abstract":"Voting is a glocalized event across countries, states and municipalities in which individuals of all abilities want to participate. To enable people with disabilities to participate accessible voting is typically implemented by adding assistive technologies to electronic voting machines to accommodate people with disabilities. To overcome the complexities and inequities in this practice, two interfaces, EZ Ballot, which uses a linear yes/no input system for all selections, and QUICK Ballot, which provides random access voting through direct selection, were designed to provide one system for all voters. This paper reports efficacy testing of both interfaces. The study demonstrated that voters with a range of visual abilities were able to use both ballots independently. While non-sighted voters made fewer errors on the linear ballot (EZ Ballot), partially-sighted and sighted voters completed the random access ballot (QUICK Ballot) in less time. In addition, a higher percentage of non-sighted participants preferred the linear ballot, and a higher percentage of sighted participants preferred the random ballot.","reference":[{"content":"Bederson, B., Lee, B., Sherman, R. M., Herrnson, P. S., & Niemi, R. G. (2003). Electronic voting system usability issues. Paper presented at the Proceedings of the SIGCHI conference on Human factors in computing systems, Ft. Lauderdale, FL, USA.","paperID":"None"},{"content":"Byrne, M. D., Greene, K. K., & Everett, S. P. (2007). Usability of voting systems: baseline data for paper, punch cards, and lever machines. Paper presented at the Proceedings of the SIGCHI conference on Human factors in computing systems, San Jose, California, USA.","paperID":"None"},{"content":"Chen, K. B., Savage, A. B., Chourasia, A. O., Wiegmann, D. A., & Sesto, M. E. (2013). Touch screen performance by individuals with and without motor control disabilities. Applied Ergonomics, 44(2), 297--302. http://dx.doi.org/10.1016/j.apergo.2012.08.004","paperID":"None"},{"content":"Connell, B. R., Jones, M., Mace, R., Mueller, J., Mullick, A., Ostroff, E., . . . Vanderheiden, G. (1997). The Principles of Universal Design. NC State University, The Center for Universal Design. Retrieved from http://www.ncsu.edu/project/designprojects/udi/center-for-universal-design/theprinciples-of-universal-design/","paperID":"None"},{"content":"Everett, S. P., Byrne, M. D., & Greene, K. K. (2006). Measuring the Usability of Paper Ballots: Efficiency, Effectiveness, and Satisfaction. Proceedings of the Human Factors and Ergonomics Society Annual Meeting, 50(24), 2547--2551. doi: 10.1177/154193120605002407","paperID":"None"},{"content":"Gilbert, J. (2005). PRIME III: One Machin, One Vote for Everyone. from http://www.juangilbert.com/","paperID":"None"},{"content":"Gilbert, J., McMillian, Y., Rouse, K., Williams, P., Rogers, G., McClendon, J., . . . Cross, E. (2010). Universal access in e-voting for the blind. Universal Access in the Information Society, 9(4), 357--365. doi: 10.1007/s10209-009-0181-0","paperID":"None"},{"content":"Jastrzembski, T. S., & Charness, N. (2007). What Older Adults Can Teach Us About Designing Better Ballots. Ergonomics in Design: The Quarterly of Human Factors Applications, 15(4), 6--11. doi: 10.1518/106480407x255198","paperID":"None"},{"content":"Jin, Z., Plocher, T., & Kiff, L. (2007a). Touch Screen User Interfaces for Older Adults: Button Size and Spacing. In C. Stephanidis (Ed.), Universal Acess in Human Computer Interaction. Coping with Diversity (Vol. 4554, pp. 933--941): Springer Berlin Heidelberg.","paperID":"None"},{"content":"Jong, M., Hoof, J., & Gosselt, J. (2007). User research of a voting machine: Preliminary findings and experiences. Journal of Usability Studies, 2(4), 180--189.","paperID":"None"},{"content":"Lee, S., Yilin, L., Xiong, X., & Sanford, J. (2013). \"Development of a More Universal Voting Interface.\" Proceedings of the Human Factors and Ergonomics Society Annual Meeting 57(1): 16241628.","paperID":"None"},{"content":"Leporini, B., Buzzi, M. C., & Buzzi, M. (2012a, 2012 / 01 / 01 /). Interacting with mobile devices via VoiceOver: Usability and accessibility issues.","paperID":"None"},{"content":"Nielsen, J. (2012). User Satisfaction vs. Performance Metrics. from http://www.nngroup.com/articles/satisfaction-vsperformance-metrics/","paperID":"None"},{"content":"Oliveira, J., Guerreiro, T., Nicolau, H., Jorge, J., & Gonçalves, D. (2011). Blind people and mobile touch-based text-entry: acknowledging the need for different flavors. Paper presented at the The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility, Dundee, Scotland, UK.","paperID":"None"},{"content":"Ott, B. R., Heindel, W. C., & Papandonatos, G. D. (2003). A survey of voter participation by cognitively impaired elderly patients. Neurology, 60(9), 1546--1548.","paperID":"None"},{"content":"Park, Y. S., Han, S. H., Park, J., & Cho, Y. (2008). Touch key design for target selection on a mobile phone. Paper presented at the Proceedings of the 10th international conference on Human computer interaction with mobile devices and services, Amsterdam, Netherlands.","paperID":"None"},{"content":"Piner, G. E., & Byrne, M. D. (2011b). The Experience of Accessible Voting: Results of a Survey among Legally-Blind Users. Proceedings of the Human Factors and Ergonomics Society Annual Meeting, 55(1), 1686--1690.","paperID":"None"},{"content":"Runyan, N. (2007). Improving Access to Voting A Report on the Technology for Accessible Voting Systems.","paperID":"None"},{"content":"Runyan, N., & Tobias, J. (2007). Accessibility Review Report for California Top-to-Bottom Voting Systems Review.","paperID":"None"},{"content":"Sanford, J., Harris, F., Yang, H.-y., J.Bell, C., Endicott, S., Salisbury, L., & Baranak, A. (2013). Understanding Voting Experiences of People with Disabilities. The Information Technology and Innovation Foundation","paperID":"None"},{"content":"Sanford, J. A. (2012). Universal Design as a Rehabilitation Strategy: Design for the Ages (1 Ed.): Springer.","paperID":"None"},{"content":"Summers, K., Chisnell, D., Davies, D., Alton, N., & Mckeever, M. (2014). Making Voting Accessible: Designing Digital Ballot Making for People with Low Literacy and Mild Cognitive Disabilities. USENIX Journal of Election Technology and Systems, 2(2).","paperID":"None"},{"content":"Vanderheiden, G. C. (1990b). Thirty-Something Million: Should They Be Exceptions? Human Factors: The Journal of the Human Factors and Ergonomics Society, 32(4), 383--396.","paperID":"None"},{"content":"Vanderheiden, G. C. (2004). Using extended and enhanced usability (EEU) to provide access to mainstream electronic voting machines. Information Technology and Disabilities, X(2).","paperID":"None"},{"content":"Wand, J. N. (2001). The Butterfly Did It: The Aberrant Vote for Buchanan in Palm Beach County, FL. American Political Science Review, 95(04), 793--810.","paperID":"None"}],"citation":[],"title":"Universal Design Ballot Interfaces on Voting Performance and Satisfaction of Voters with and without Vision Loss","filename":"CHI16/p4861","authors":["Seunghyun \"Tina\" Lee","Yilin Elaine Liu","Ljilja Ruzic","Jon Sanford"],"conference":"CHI '16"}