{"paperId":2858561,"citation":[],"reference":[{"content":"Aharony, Nadav, et al. Social fMRI: Investigating and shaping social mechanisms in the real world. Pervasive and Mobile Computing 7.6. 643--659. 2011.","paperID":"None"},{"content":"Averill, James R. Anger and Aggression in Biological Perspective. Anger and Aggression. Springer New York. 33--53. 1982.","paperID":"None"},{"content":"Bandura, A. Social foundations of thought and action. The health psychology reader, 94--106. 2002.","paperID":"None"},{"content":"Beauchamp, M. R., & Eys, M. A. Group dynamics in exercise and sport psychology. 2014.","paperID":"None"},{"content":"Becker, Marshall H., and Lois A. Maiman. Sociobehavioral determinants of compliance with health and medical care recommendations.Medical care 13.1. 10--24. 1975.","paperID":"None"},{"content":"Beyer, Hugh, and Karen Holtzblatt. Contextual design: defining customer-centered systems. Elsevier, 1997.","paperID":"None"},{"content":"Blake, J., and K. Davis. Norms, values and sanctions In Faris, REL (ed.) Handbook of Modern Sociology. Rand McNally, Skokie 101. 456--484.1964","paperID":"None"},{"content":"Bonnie Brinton Anderson, C. Brock Kirwan, Jeffrey L. Jenkins, David Eargle, Seth Howard, and Anthony Vance. 2015. How Polymorphic Warnings Reduce Habituation in the Brain: Insights from an fMRI Study. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2883--2892. DOI=10.1145/2702123.2702322 http://doi.acm.org/10.1145/2702123.2702322","paperID":"None"},{"content":"Brislin, Richard W. Back-translation for cross-cultural research. Journal of cross-cultural psychology 1.3. 185216. 1970","paperID":"None"},{"content":"Cartwright, D. Achieving Change in People: Some Applications of Group Dynamics Theory1. Group Facilitation, (9), 59. 2008.","paperID":"None"},{"content":"Cialdini, R. B., Kallgren, C. A., & Reno, R. R. A focus theory of normative conduct: A theoretical refinement and reevaluation of the role of norms in human behavior. Advances in experimental social psychology, 24(20), 1--243. 1991.","paperID":"None"},{"content":"Cooper, David, and John H. Kagel. Other regarding preferences: a selective survey of experimental results. Handbook of experimental economics 2. 2009.","paperID":"None"},{"content":"Deutsch, M. An experimental study of the effects of cooperation and competition upon group process. Human relations, 2(3), 199--231. 1949.","paperID":"None"},{"content":"DiMicco, J. M., Hollenbach, K. J., Pandolfo, A., & Bender, W. The impact of increased awareness while face-to-face. Human-Computer Interaction, 22(1--2), 47--96. 2007.","paperID":"None"},{"content":"Dörnyei, Z. Psychological processes in cooperative language learning: Group dynamics and motivation. Modern Language Journal, 482--493. 1997.","paperID":"None"},{"content":"Eric P.S. Baumer, Sherri Jean Katz, Jill E. Freeman, Phil Adams, Amy L. Gonzales, John Pollak, Daniela Retelny, Jeff Niederdeppe, Christine M. Olson, and Geri K. Gay. 2012. Prescriptive persuasion and openended social awareness: expanding the design space of mobile health. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 475--484. DOI=10.1145/2145204.2145279 http://doi.acm.org/10.1145/2145204.2145279","paperID":"None"},{"content":"Forsythe, Robert, et al. \"Fairness in simple bargaining experiments.\" Games and Economic behavior 6.3 (1994): 347--369.","paperID":"None"},{"content":"Grandjean, E., & Hünting, W. Ergonomics of posture-review of various problems of standing and sitting posture. Applied ergonomics, 8(3), 135--140. 1977.","paperID":"None"},{"content":"Haug, S., Meyer, C., Schorr, G., Bauer, S., & John, U. Continuous individual support of smoking cessation using text messaging: a pilot experimental study. Nicotine & Tobacco Research. 2009.","paperID":"None"},{"content":"Hofstede, G. Dimensionalizing cultures: The Hofstede model in context.Online readings in psychology and culture, 2(1), 8. 2011","paperID":"None"},{"content":"Hou, M. Y., Hurwitz, S., Kavanagh, E., Fortin, J., & Goldberg, A. B. Using daily text-message reminders to improve adherence with oral contraceptives: a randomized controlled trial. Obstetrics & Gynecology, 116(3), 633--640. 2010.","paperID":"None"},{"content":"James J. Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B. Strub. 2006. Fish'n'Steps: encouraging physical activity with an interactive computer game. In Proceedings of the 8th international conference on Ubiquitous Computing (UbiComp'06), Paul Dourish and Adrian Friday (Eds.). Springer-Verlag, Berlin, Heidelberg, 261--278. DOI=10.1007/11853565_16 http://dx.doi.org/10.1007/11853565_16","paperID":"None"},{"content":"Janienke Sturm, Olga Houben-van Herwijnen, Anke Eyck, and Jacques Terken. 2007. Influencing social dynamics in meetings through a peripheral display. In Proceedings of the 9th international conference on Multimodal interfaces (ICMI '07). ACM, New York, NY, USA, 263--270. DOI=10.1145/1322192.1322238 http://doi.acm.org/10.1145/1322192.1322238","paperID":"None"},{"content":"Jun-Ki Min, Afsaneh Doryab, Jason Wiese, Shahriyar Amini, John Zimmerman, and Jason I. Hong. 2014. Toss 'n' turn: smartphone as sleep and sleep quality detector. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 477--486. DOI=http://dx.doi.org/10.1145/2556288.2557220","paperID":"None"},{"content":"Kalsher, M. J., & Williams, K. J. Behavioral compliance: Theory, methodology, and results. Handbook of warnings, 313--329. 2006.","paperID":"None"},{"content":"Kelly, J. F., Magill, M., & Stout, R. L. How do people recover from alcohol dependence? A systematic review of the research on mechanisms of behavior change in Alcoholics Anonymous. Addiction Research & Theory,17(3), 236--259. 2009.","paperID":"None"},{"content":"Kiran K. Rachuri, Mirco Musolesi, Cecilia Mascolo, Peter J. Rentfrow, Chris Longworth, and Andrius Aucinas. 2010. EmotionSense: a mobile phones based adaptive platform for experimental social psychology research. In Proceedings of the 12th ACM international conference on Ubiquitous computing (UbiComp '10). ACM, New York, NY, USA, 281--290. DOI=http://dx.doi.org/10.1145/1864349.1864393","paperID":"None"},{"content":"Meng-Chieh Chiu, Shih-Ping Chang, Yu-Chen Chang, Hao-Hua Chu, Cheryl Chia-Hui Chen, Fei-Hsiu Hsiao, and Ju-Chun Ko. 2009. Playful bottle: a mobile social persuasion system to motivate healthy water intake. In Proceedings of the 11th international conference on Ubiquitous computing (UbiComp '09). ACM, New York, NY, USA, 185--194. DOI=10.1145/1620545.1620574 http://doi.acm.org/10.1145/1620545.1620574.","paperID":"None"},{"content":"Michael L. Manapat, Martin A. Nowak, and David G. Rand. 2013. Information, irrationality, and the evolution of trust. Journal of Economic Behavior & Organization 90: S57-S75.","paperID":"None"},{"content":"NIKE PLUS, https://secure-nikeplus.nike.com/plus/","paperID":"None"},{"content":"Pavol Bielik, Michal Tomlein, Peter Krátky, Štefan Mitrík, Michal Barla, and Mária Bieliková. 2012. Move2Play: an innovative approach to encouraging people to be more physically active. In Proceedings of the 2nd ACM SIGHIT International Health Informatics Symposium (IHI '12). ACM, New York, NY, USA, 6170. DOI=10.1145/2110363.2110374 http://doi.acm.org/10.1145/2110363.2110374","paperID":"None"},{"content":"Rajan Vaish, Keith Wyngarden, Jingshu Chen, Brandon Cheung, and Michael S. Bernstein. 2014. Twitch crowdsourcing: crowd contributions in short bursts of time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3645--3654. DOI=10.1145/2556288.2556996 http://doi.acm.org/10.1145/2556288.2556996","paperID":"None"},{"content":"Riley, W., Jerome, A., Behar, A., & Weil, J. Computer and manual self-help behavioral strategies for smoking reduction: initial feasibility and one-year followup. Nicotine & tobacco research, 4, 183--188. 2002.","paperID":"None"},{"content":"Robert LiKamWa, Yunxin Liu, Nicholas D. Lane, and Lin Zhong. 2013. MoodScope: building a mood sensor from smartphone usage patterns. In Proceeding of the 11th annual international conference on Mobile systems, applications, and services (MobiSys '13). ACM, New York, NY, USA, 389--402. DOI=http://dx.doi.org/10.1145/2462456.2464449","paperID":"None"},{"content":"Schachter, S. Deviation, rejection, and communication. The Journal of Abnormal and Social Psychology, 46(2), 190. 1951.","paperID":"None"},{"content":"Schultz, P. W., Nolan, J. M., Cialdini, R. B., Goldstein, N. J., & Griskevicius, V. The constructive, destructive, and reconstructive power of social norms. Psychological science, 18(5), 429--434. 2007.","paperID":"None"},{"content":"Sherif, M. The psychology of social norms. 1936.","paperID":"None"},{"content":"Shmueli, E., Singh, V. K., Lepri, B., & Pentland, A. Sensing, Understanding, and Shaping Social Behavior. Computational Social Systems, IEEE Transactions on, 1(1), 22--34. 2014.","paperID":"None"},{"content":"Skinner, Burrhus Frederic. The behavior of organisms: An experimental analysis. (1938).","paperID":"None"},{"content":"Stout, L. A. Other-regarding preferences and social norms. Georgetown Law and Economics Research Paper, 2001.","paperID":"None"},{"content":"Strauss, Anselm, and Juliet Corbin. Grounded theory methodology. Handbook of qualitative research. 1994. 273--285. 1994.","paperID":"None"},{"content":"Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, and James A. Landay. 2008. Activity sensing in the wild: a field trial of ubifit garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1797--1806. DOI=10.1145/1357054.1357335 http://doi.acm.org/10.1145/1357054.1357335","paperID":"None"},{"content":"Sunny Consolvo, Katherine Everitt, Ian Smith, and James A. Landay. 2006. Design requirements for technologies that encourage physical activity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (Eds.). ACM, New York, NY, USA, 457--466. DOI=10.1145/1124772.1124840 http://doi.acm.org/10.1145/1124772.1124840","paperID":"None"},{"content":"Taemie Kim, Agnes Chang, Lindsey Holland, and Alex Sandy Pentland. 2008. Meeting mediator: enhancing group collaborationusing sociometric feedback. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08). ACM, New York, NY, USA, 457--466. DOI=10.1145/1460563.1460636 http://doi.acm.org/10.1145/1460563.1460636.","paperID":"None"},{"content":"Venta, L., Isomursu, M., Ahtinen, A., & Ramiah, S. My phone is a part of my soul-How People Bond with Their Mobile Phones. InMobile Ubiquitous Computing, Systems, Services and Technologies, 2008. UBICOMM'08. The Second International Conference on. 311--317. 2008.","paperID":"None"},{"content":"Womersley, L., & May, S. Sitting posture of subjects with postural backache. Journal of manipulative and physiological therapeutics, 29(3), 213--218. 2006.","paperID":"None"},{"content":"Wong, W. Y., & Wong, M. S. Detecting spinal posture change in sitting positions with tri-axial accelerometers. Gait & Posture, 27(1), 168--171. 2008.","paperID":"None"},{"content":"Yeoreum Lee, Youn-kyung Lim, and Hyeon-Jeong Suk. 2011. Altruistic interaction design: a new interaction design approach for making people care more about others. In Proceedings of the 2011 Conference on Designing Pleasurable Products and Interfaces (DPPI '11). ACM, New York, NY, USA, , Article 9 , 4 pages. DOI=10.1145/2347504.2347514 http://doi.acm.org/10.1145/2347504.2347514","paperID":"None"},{"content":"Zhang, S., McCullagh, P., Nugent, C., Zheng, H., & Baumgarten, M. Optimal model selection for posture recognition in home-based healthcare. International Journal of Machine Learning and Cybernetics, 2(1), 114. 2011.","paperID":"None"}],"abstract":"Research shows the critical role of social relationships in behavior change, and the advancement of mobile technologies brings new opportunities of using online social support for persuasive applications. In this paper, we propose Relational Norm Intervention (RNI) model for behavior change, which involves two individuals as a target user and a helper respectively. RNI model uses Negative Reinforcement and Other-Regarding Preferences as motivating factors for behavior change. The model features the passive participation of a helper who will undergo artificially generated discomforts (e.g., limited access to a mobile device) when a target user performs against a target behavior. Based on in-depth discussions from a two-phase design workshop, we designed and implemented BeUpright, a mobile application employing RNI model to correct sitting posture of a target user. Also, we conducted a two-week study to evaluate the effectiveness and user experience of BeUpright. The study showed that the RNI model has a potential to increase efficacy, in terms of behavior change, compared to conventional notification approaches. The most influential factor of RNI model in the changing the behavior of target users was the intention to avoid discomforting their helpers. RNI model also showed a potential to help unmotivated individuals in behavior change. We discuss the mechanism of the RNI model in relation to prior literature on behavior change and implications of exploiting discomfort in mobile behavior change services.","title":"BeUpright: Posture Correction Using Relational Norm Intervention","filename":"CHI16/p6040","authors":["Jaemyung Shin","Bumsoo Kang","Taiwoo Park","Jina Huh","Jinhan Kim","Junehwa Song"],"conference":"CHI '16"}