{"paperId":2858500,"abstract":"Internet health information seeking can potentially alter physician-patient interactions, which in turn can influence healthcare delivery. Investigating physicians' perceptions about internet-informed patients is important for understanding this phenomenon in countries like India, where this is a relatively recent trend. We conducted a qualitative study to this effect, conceptualizing internet health information access as a disintermediation process, and examining this phenomenon through the dimensions of meanings ascribed, power dynamics and social norms. We found that physicians' perceptions about internet informed patients and their interactions with these patients were largely adversarial. However, some physicians viewed the phenomenon as inevitable. They developed methods that leveraged patients' internet access for the purpose of increasing patient awareness and self-efficacy. We conceptualize this new role of physicians as apomediation, and present recommendations for design and implementation of health information platforms in countries such as India, where power dynamics form a salient part of physician-patient interactions.","citation":[],"reference":[{"content":"Shashank M. Akerkar and L. S. Bichile. 2004. Doctor patient relationship: changing dynamics in the information age. Journal of Postgraduate Medicine 50, 2(2004), 120 - 122.","paperID":"None"},{"content":"Neeraj K. Arora, Bradford W. Hesse, Barbara K. Rimer, Kasisomayajula Viswanath, Marla L. Clayman, and Robert T. Croyle. Frustrated and confused: the American public rates its cancer-related information seeking experiences. Journal of General Internal Medicine 23, 3 (2008), 223--228.","paperID":"None"},{"content":"Maria Bakardjieva. 2001. Becoming a domestic internet user. In Proceedings of the 3rd International Conference on Uses and Services in Telecommunications (2001), 12--14.","paperID":"None"},{"content":"Timothy W. Bickmore, Laura M. Pfeifer, and Brian W. Jack. 2009. Taking the time to care: empowering low health literacy hospital patients with virtual nurse agents. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '09), 1265--1274.","paperID":"None"},{"content":"Alex Broom. 2005. Virtually he@ lthy: the impact of internet use on disease experience and the doctor-patient relationship. Qualitative Health Research 15, 3 (2005), 325--345.","paperID":"None"},{"content":"Kamel Maged N. Boulos and Steve Wheeler. 2007. The emerging Web 2.0 social software: an enabling suite of sociable technologies in health and health care education. Health Information & Libraries Journal 24, 1 (2007), 2--23.","paperID":"None"},{"content":"Carma L. Bylund, Jennifer A. Gueguen, Christina M. Sabee, Rebecca S. Imes, Yuelin Li, and Amy Aldridge Sanford. 2007. Provider'patient dialogue about Internet health information: an exploration of strategies to improve the provider-patient relationship. Patient Education and Counseling 66, 3 (2007), 346--352.","paperID":"None"},{"content":"Jishnu, Das, and Jeffrey Hammer. 2007. Money for nothing: the dire straits of medical practice in Delhi, India. Journal of Development Economics 83,1(2007), 1--36.","paperID":"None"},{"content":"Kisalay Datta, Tarun Bhatnagar, Manoj Murhekar. 2010. Private Practitioners' Knowledge, Attitude and Practices about Tuberculosis, Hooghly District, India. The Indian Journal of Tuberculosis 57, 4 (2010),199--206.","paperID":"None"},{"content":"Joseph A. Diaz, Christopher N. Sciamanna, Evangelos Evangelou, Michael J. Stamp, and Tom Ferguson. 2005. Brief report: What types of Internet guidance do patients want from their physicians' Journal of General Internal Medicine 20, 8 (2005), 683--685.","paperID":"None"},{"content":"Madhav G. Deo. 2013. Doctor population ratio for India- The reality. The Indian Journal of Medical Research 137, 4 (2013), 632--635.","paperID":"None"},{"content":"Gunther Eysenbach. 2007. From intermediation to disintermediation and apomediation: new models for consumers to access and assess the credibility of health information in the age of Web 2. 0. Studies in Health Technology and Informatics 129, 1 (2007),162--166.","paperID":"None"},{"content":"Jairo N. Fuertes, Alexa Mislowack, Jennifer Bennett, Laury Paul, Tracey C. Gilbert, Gerardo Fontan, and Laura S. Boylan. 2007. The physician-patient working alliance. Patient Education and Counseling 66, 1 (2007), 29--36.","paperID":"None"},{"content":"Grethe Fochsen, Kirti Deshpande and Anna Thorson. 2006. Power imbalance and consumerism in the doctor-patient Relationship: Health care providers; experiences of patient encounters in a rural district in India. Qualitative Health Research 16, 9 (2006), 1236--51.","paperID":"None"},{"content":"Susannah Fox, Lee Rainie. 2000. The online health care revolution. Retrieved on September 15, 2015 from http://www.pewinternet.org/pdfs/PIP_Health_Report.pdf","paperID":"None"},{"content":"Barney G. Glaser and Anselm L. Strauss. 2009. The Discovery of Grounded Theory: Strategies for Qualitative Research. Transaction Publishers.","paperID":"None"},{"content":"Michael Hardey. 1999. Doctor in the house: the Internet as a source of lay health knowledge and the challenge to expertise. Sociology of Health and Illness 21, 6 (1999), 820--35.","paperID":"None"},{"content":"John Hsu, John, Jie Huang, Vicki Fung, Nan Robertson, Holly Jimison, and Richard Frankel. 2005 Health information technology and physician-patient interactions: impact of computers on communication during outpatient primary care visits. Journal of the American Medical Informatics Association 12, 4 (2005), 474--480.","paperID":"None"},{"content":"Frank R. Kardes. 1996. In defense of experimental consumer psychology. Journal of Consumer Psychology 5, 3 (1996), 279--296.","paperID":"None"},{"content":"Julie A. Kientz, Rosa I. Arriaga, Marshini Chetty, Gillian R. Hayes, Jahmeilah Richardson, Shwetak N. Patel, and Gregory D. Abowd. 2007.Grow and know: understanding record-keeping needs for tracking the development of young children. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '07), 1351--1360.","paperID":"None"},{"content":"Julie A. Kientz. 2010. Understanding parent pediatrician interactions for the design of health technologies. In Proceedings of the 1st ACM International Health Informatics Symposium, ACM 230--239.","paperID":"None"},{"content":"Jenny Kitzinger. 1994. The methodology of focus groups: the importance of interaction between research participants. Sociology of Health and Illness 16, 1 (1994), 104--121.","paperID":"None"},{"content":"Richard A. Krueger, M. A. Casey. 2000. A practical guide for applied research. A Practical Guide for Applied research, Sage Publications.","paperID":"None"},{"content":"Min-Sun Kim, Renee Storm Klingle, William F. Sharkey, Hee Sun Park, David H. Smith, and Deborah Cai. 2000. A test of a cultural model of patients' motivation for verbal communication in patient-doctor interactions. Communications Monographs. 67, 3 (2000), 262--283.","paperID":"None"},{"content":"Karen Locke. 2001. Grounded Theory in Management Research. Sage.","paperID":"None"},{"content":"Wilson Lowrey and William Anderson. 2006. The impact of internet use on the public perception of physicians: A perspective from the sociology of professions literature. Health Communication 19, 2 (2006), 125--31.","paperID":"None"},{"content":"John G. Lynch. 1982. On the external validity of experiments in consumer research. Journal of Consumer Research 9, 3 (1982), 225--39.","paperID":"None"},{"content":"Miriam McMullan. 2006. Patients using the Internet to obtain health information: How this affects the patient' health professional relationship. Patient Education and Counseling 63, 1--2 (2006), 24--8.","paperID":"None"},{"content":"Matthew B. Miles, Michael A. Huberman. 1994. Qualitative Data Analysis: An Expanded Sourcebook. Sage.","paperID":"None"},{"content":"Shobha Mocherla, Usha Raman, Brien Holden. 2012. Expressions of equity: Imbalances in the patient-clinician interaction. Indian Journal of Medical Ethics 9, 2 (2012), 87--93.","paperID":"None"},{"content":"Sean A. Munson, Hasan Cavusoglu, Larry Frisch, and Sidney Fels. 2013. Sociotechnical challenges and progress in using social media for health. Journal of medical Internet research 15, 10 (2013).","paperID":"None"},{"content":"Elizabeth Murray, Bernard Lo, Lance Pollack, Karen Donelan, Joe Catania, Martha White, Kinga Zapert, Rachel Turner. 2003. The impact of health information on the internet on the physician-patient relationship. Archives of Internal Medicine 63, 14 (2003), 1727--34.","paperID":"None"},{"content":"Sarah Nettleton , Roger Burrows , Lisa O'Malley, and Ian Watt. 2004. Health E-types' Information, Communication & Society 7,4 (2004), 531--553.","paperID":"None"},{"content":"Bhanu Prakash. 2010. Patient satisfaction. Journal of Cutaneous and Aesthetic Surgery 3, 3 (2010), 151--55.","paperID":"None"},{"content":"Henry W.W. Potts, Jeremy C. Wyatt. 2002. Survey of doctors' experience of patients using the Internet. Journal of Medical Internet Research, 4,1.","paperID":"None"},{"content":"Jim Rowan and Elizabeth D. Mynatt. 2005. Digital family portrait field trial: Support for aging in place. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '05), 521--530.","paperID":"None"},{"content":"Kathrin Sommerhalder, Andrea Abrahama, Maria Caiata Zuffereyb, Jürgen Bartha, Thomas Abela. 2009. Internet information and medical consultations: Experiences from patients' and physicians' perspectives. Patient Education and Counseling 77, 2 (2009), 266--71.","paperID":"None"},{"content":"Hyewon Suh, John R. Porter, Alexis Hiniker, and Julie A. Kientz. @ BabySteps: design and evaluation of a system for using twitter for tracking children's developmental milestones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (CHI '14), 2279--2288.","paperID":"None"},{"content":"Sujatha, V. 2007. Pluralism in Indian medicine Medical lore as a genre of medical knowledge. Contributions to Indian Sociology 41, 2: 169--202.","paperID":"None"},{"content":"Hedy Wald, Catherine Dube, David Anthony. 2006. Untangling the web -The impact of internet use on health care and the physician-patient relationship. Patient Education and Counseling 68, 3 (2006), 218224.","paperID":"None"},{"content":"Geoff Walsham. 2002. Cross-cultural software production and use: a structurational analysis. MIS Quarterly, 26, 4 (2002), 359--380.","paperID":"None"},{"content":"Qing T. Zeng, Jonathan Crowell, Robert M. Plovnick, Eunjung Kim, Long Ngo, and Emily Dibble. Assisting consumer health information retrieval with query recommendations. Journal of the American Medical Informatics Association 13, 1 (2006), 80--90.","paperID":"None"},{"content":"Yan Zhang. 2010. Contextualizing consumer health information searching: an analysis of questions in a social Q&A community. In Proceedings of the 1st ACM International Health Informatics Symposium, ACM, 210--219.","paperID":"None"}],"title":"Who's the Doctor?: Physicians' Perception of Internet Informed Patients in India","filename":"CHI16/p3091","authors":["Rajesh Chandwani","Vaibhavi Kulkarni"],"conference":"CHI '16"}