{"paperId":2858232,"abstract":"Given the widespread adoption of mobile devices and the private personal and work information they carry, casual or deliberate shoulder surfing is an increasing concern with these devices. We iteratively designed a tablet interface that detects when people nearby are looking at the screen, providing awareness through glyph notifications, and response through visual protections, and evaluated its use in two experiments. The results indicate that mobile content privacy management systems such as ours could help alleviate the cognitive and social burden of managing mobile device privacy in dynamic settings. We identify physical privacy behaviours and preferences that can inform the design of privacy notification and management protocols on mobile devices. We argue that such systems require subtlety so as not to advertise the users' intention for privacy, flexibility in addressing dynamic privacy needs and trustworthiness to promote adoption.","citation":[],"reference":[{"content":"Altman, I. (1975). The Environment and Social Behavior: Privacy, Personal Space, Territory, and Crowding. Monterey, Calif.: Brooks/Cole.","paperID":"None"},{"content":"Altman, I. (1977). Privacy regulation: culturally universal or culturally specific. Journal of Social Issues, 33(3), 6684.","paperID":"None"},{"content":"Altman, I., & Chemers, M. M. (1984). Culture and environment (No. 2). CUP Archive.","paperID":"None"},{"content":"Ballendat, T., Marquardt, N., & Greenberg, S. (2010, November). Proxemic interaction: designing for a proximity and orientation-aware environment. In ACM International Conference on Interactive Tabletops and Surfaces (pp. 121--130). ACM.","paperID":"None"},{"content":"Bartram, L., Ware, C., & Calvert, T. (2003). Moticons:: detection, distraction and task. International Journal of Human-Computer Studies, 58(5), 515--545.","paperID":"None"},{"content":"Bellotti, V., & Sellen, A. (1993, January). Design for privacy in ubiquitous computing environments. In Proceedings of the Third European Conference on Computer-Supported Cooperative Work 13--17 September 1993, Milan, Italy ECSCW'93 (pp. 77--92). Springer Netherlands.","paperID":"None"},{"content":"Boyle, M., Neustaedter, C., & Greenberg, S. (2009). Privacy factors in video-based media spaces. In Media Space 20+ Years of Mediated Life, 97--122.","paperID":"None"},{"content":"Brudy, F., Ledo, D., & Greenberg, S. (2014, April). Is anyone looking?: mediating shoulder surfing on public displays (the video). In CHI'14 Extended Abstracts on Human Factors in Computing Systems (pp. 159--160).","paperID":"None"},{"content":"Brunk, B. (2002). Understanding the privacy space. First Monday, 7(10).","paperID":"None"},{"content":"Brunk, B. (2005). A user-centric privacy space framework. Security and Usability, LF Cranor and S. Garfinkel, Eds. O'Reilly, 401--420","paperID":"None"},{"content":"Chen, Y., & Xu, H. (2013, February). Privacy management in dynamic groups: Understanding information privacy in medical practices. In Proceedings of the 2013 conference on Computer supported cooperative work (pp. 541--552). ACM.","paperID":"None"},{"content":"Comscore. (2014). The U.S. mobile app report. Retrieved from: http://www.comscore.com/Insights/Presentations-andWhitepapers/2014/The-US-Mobile-App-Report","paperID":"None"},{"content":"Dhami, M. K., Hertwig, R., & Hoffrage, U. (2004). The role of representative design in an ecological approach to cognition. Psychological bulletin, 130(6), 959.","paperID":"None"},{"content":"Dostal, J., Kristensson, P. O., & Quigley, A. (2013, June). Multi-view proxemics: distance and position sensitive interaction. In Proceedings of the 2nd ACM International Symposium on Pervasive Displays (pp. 1--6). ACM.","paperID":"None"},{"content":"Dourish, P., Grinter, R. E., De La Flor, J. D., & Joseph, M. (2004). Security in the wild: user strategies for managing security as an everyday, practical problem. Personal and Ubiquitous Computing, 8(6), 391--401.","paperID":"None"},{"content":"Downs, J. S., Holbrook, M., & Cranor, L. F. (2007, October). Behavioral response to phishing risk. In Proceedings of the anti-phishing working groups 2nd annual eCrime researchers summit (pp. 37--44). ACM.","paperID":"None"},{"content":"Egelman, S., Oates, A., & Krishnamurthi, S. (2011, May). Oops, I did it again: mitigating repeated access control errors on facebook. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (pp. 2295--2304). ACM.","paperID":"None"},{"content":"Goucher, W. (2011). Look behind you: the dangers of shoulder surfing. Computer Fraud & Security, 2011(11), 17--20.","paperID":"None"},{"content":"Greenberg, S., Marquardt, N., Ballendat, T., DiazMarino, R., & Wang, M. (2011). Proxemic interactions: the new ubicomp?. interactions, 18(1), 42--50.","paperID":"None"},{"content":"Hall, E. T., & Hall, E. T. (1969). The hidden dimension (Vol. 1990). NY: Anchor Books.","paperID":"None"},{"content":"Hansson, R., Ljungstrand, P., & Redström, J. (2001, January). Subtle and public notification cues for mobile devices. In Ubicomp 2001: Ubiquitous Computing (pp. 240--246). Springer Berlin Heidelberg.","paperID":"None"},{"content":"Harrison, C., & Dey, A. K. (2008, April). Lean and zoom: proximity-aware user interface and content magnification. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 507--510). ACM.","paperID":"None"},{"content":"Hawkey, K., & Inkpen, K. M. (2007, May). PrivateBits: managing visual privacy in web browsers. In Proceedings of Graphics Interface 2007 (pp. 215--223). ACM.","paperID":"None"},{"content":"Iachello, G., & Hong, J. (2007). End-user privacy in human-computer interaction. Foundations and Trends in Human-Computer Interaction, 1(1), 1--137.","paperID":"None"},{"content":"Ishiguro, Y., & Rekimoto, J. (2011, March). Peripheral vision annotation: noninterference information presentation method for mobile augmented reality. In Proceedings of the 2nd Augmented Human International Conference (p. 8). ACM.","paperID":"None"},{"content":"José Ramón Padilla-López, Alexandros Andre Chaaraoui, Francisco Flórez-Revuelt. (2015).Visual privacy protection methods: A survey. In Expert Systems with Applications, 42(9), 4177--4195","paperID":"None"},{"content":"Kumar, M., Garfinkel, T., Boneh, D., & Winograd, T. (2007, July). Reducing shoulder-surfing by using gazebased password entry. In Proceedings of the 3rd symposium on Usable privacy and security (pp. 13--19). ACM.","paperID":"None"},{"content":"Langheinrich, M. (2001, January). Privacy by design--principles of privacy-aware ubiquitous systems. In Ubicomp 2001: Ubiquitous Computing (pp. 273--291). Springer Berlin Heidelberg.","paperID":"None"},{"content":"Lee L. (2014). Digital media technology and individual privacy. Communication technology and social change: Theory and implications, Lin, C. A., & Atkin, D. J. (Eds.). Routledge, 257--279.","paperID":"None"},{"content":"Lian, S., Hu, W., Song, X., & Liu, Z. (2013). Smart privacy-preserving screen based on multiple sensor fusion. Consumer Electronics, IEEE Transactions on, 59(1), 136--143.","paperID":"None"},{"content":"Luff, P., & Heath, C. (1998, November). Mobility in collaboration. In Proceedings of the 1998 ACM conference on Computer supported cooperative work (pp. 305--314). ACM.","paperID":"None"},{"content":"Murphy, A., Reddy, M, & Xu, H. (2014). Privacy practices in collaborative environments: a study of emergency department staff. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing.(pp.269--282).","paperID":"None"},{"content":"Muslukhov, I., Boshmaf, Y., Kuo, C., Lester, J., & Beznosov, K. (2013, August). Know your enemy: the risk of unauthorized access in smartphones by insiders. In Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services (pp. 271--280). ACM.","paperID":"None"},{"content":"Palen, L., & Dourish, P. (2003, April). Unpacking privacy for a networked world. In Proceedings of the SIGCHI conference on Human factors in computing systems (pp. 129--136). ACM.","paperID":"None"},{"content":"Patrick A. (2007). Commentary on Research on New Security Indicators -essay. http://www.andrewpatrick.ca/essays/commentary-onresearch-on-new-security-indicators.","paperID":"None"},{"content":"Patterson, M. L., Mullens, S., & Romano, J. (1971). Compensatory reactions to spatial intrusion. Sociometry, 114--121.","paperID":"None"},{"content":"Polhemus, Inc.(2013). G4 user manual. Retrieved on March 15, 2013 from http://polhemus.com/_assets/img/G4_User_Manual_UR M10PH238-D.pdf.","paperID":"None"},{"content":"Portnoff, S.R., Lee, N.L., Egelman, S., Mishra, P., Leung, D., & Wagner, D. (2015, April) Somebody's watching me?: Assessing the effectiveness of Webcam indicator lights. In Proceedings of the SIGCHI conference on Human factors in computing systems (pp. 1649--1658). ACM.","paperID":"None"},{"content":"Probst, G. (2000). Analysis of the Effects of Privacy Filter Use on Horizontal Deviations in Posture of VDT Operators (Doctoral dissertation, Virginia Polytechnic Institute and State University).","paperID":"None"},{"content":"Project Tango Depth Perception. (n.d.) In Google Developers. Retrieved on July 23, 2015 from https://developers.google.com/projecttango/overview/depth-perception","paperID":"None"},{"content":"Regus. (2014). Business people globally describe their ideal work environment. Retrieved from: press.regus.com/unitedkingdom/download/60669/gbs11theidealworkplaceenvironmentreport_final.pdf.","paperID":"None"},{"content":"Sotirakopoulos, A., Hawkey, K., & Beznosov, K. (2011, July). On the challenges in usable security lab studies: lessons learned from replicating a study on SSL warnings. In Proceedings of the Seventh Symposium on Usable Privacy and Security (p. 3). ACM.","paperID":"None"},{"content":"Tan, D. S., Keyani, P., & Czerwinski, M. (2005, November). Spy-resistant keyboard: more secure password entry on public touch screen displays. In Proceedings of the 17th Australia conference on Computer-Human Interaction: Citizens Online: Considerations for Today and the Future (pp. 1--10). (CHISIG) of Australia.","paperID":"None"},{"content":"Tarasewich, P., Gong, J., & Conlan, R. (2006, April). Protecting private data in public. In CHI'06 Extended Abstracts on Human Factors in Computing Systems, 1409--1414.","paperID":"None"},{"content":"Thompson. H.(March, 2011). Visual data breach risk assessment study. For People Security and 3M. Retrieved from: http://solutions.3m.com/3MContentRetrievalAPI/BlobServlet?locale=en_US&lmd=1291398659000&assetId=1273672752407&assetType=MMM_Image&blobAttribute=ImageFile","paperID":"None"},{"content":"Ware, C. (2012). Information visualization: perception for design. Elsevier.","paperID":"None"},{"content":"Wiedenbeck, S., Waters, J., Sobrado, L., & Birget, J. C. (2006, May). Design and evaluation of a shoulder-surfing resistant graphical password scheme. In Proceedings of the working conference on Advanced visual interfaces (pp. 177--184). ACM.","paperID":"None"},{"content":"Zhou, H., Ferreira, V., Alves, T., Hawkey, K., & Reilly, D. (2015, April). Somebody Is Peeking!: A Proximity and Privacy Aware Tablet Interface. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (pp. 1971--1976). ACM.","paperID":"None"},{"content":"Zhou, H., Ferreira, V., Alves, T. S., MacKay, B., Hawkey, K., & Reilly, D. (2015). Exploring Privacy Notification and Control Mechanisms for Proximity Aware Tablets. International Journal of Mobile Human Computer Interaction (IJMHCI), 7(3), 1--19.","paperID":"None"}],"title":"Enhancing Mobile Content Privacy with Proxemics Aware Notifications and Protection","filename":"CHI16/p1362","authors":["Huiyuan Zhou","Khalid Tearo","Aniruddha Waje","Elham Alghamdi","Thamara Alves","Vinicius Ferreira","Kirstie Hawkey","Derek Reilly"],"conference":"CHI '16"}