{"paperId":2858240,"reference":[{"content":"Gregory D. Abowd and Elizabeth D. Mynatt. 2000. Charting past, present, and future research in ubiquitous computing. Transactions on ComputerHuman Interaction (TOCHI) 7, 1: 29-58. http://doi.org/10.1145/344949.344988","paperID":"None"},{"content":"David W. Baker, Julie A. Gazmararian, Mark V. Williams, et al. 2002. Functional health literacy and the risk of hospital admission among Medicare managed care enrollees. American journal of public health 92, 8: 1278-1283.","paperID":"None"},{"content":"David W. Baker, Ruth M. Parker, Mark V. Williams, and W. Scott Clark. 1998. Health literacy and the risk of hospital admission. Journal of General Internal Medicine 13, 12: 791-798. http://doi.org/10.1046/j.1525--1497.1998.00242.x","paperID":"None"},{"content":"Richard B. Balaban, Joel S. Weissman, Peter A. Samuel, and Stephanie Woolhandler. 2008. Redefining and redesigning hospital discharge to enhance patient care: a randomized controlled study. Journal of General Internal Medicine 23, 8: 1228-1233. http://doi.org/10.1007/s11606-0080618--9","paperID":"None"},{"content":"Albert Bandura. 1977. Self-efficacy: toward a unifying theory of behavioral change. Psychological Review 84, 2: 191-215. http://doi.org/10.1016/0146--6402(78)90002--4","paperID":"None"},{"content":"Albert Bandura. 2004. Health Promotion by Social Cognitive Means. Health Education & Behavior 31, 2: 143-164. http://doi.org/10.1177/1090198104263660","paperID":"None"},{"content":"David M. Baorto and James J. Cimino. 2000. An \"infobutton\" for enabling patients to interpret online Pap smear reports. Proceedings / AMIA ... Annual Symposium. AMIA Symposium: 47-50.","paperID":"None"},{"content":"Julie Barlow, Chris Wright, Janice Sheasby, Andy Turner, and Jenny Hainsworth. 2002. Selfmanagement approaches for people with chronic conditions: a review. Patient Education and Counseling 48, 2: 177-187.","paperID":"None"},{"content":"Priscilla Barnes, Kelly Caine, Kay Connelly, and Katie Siek. 2013. Understanding the needs of low SES patients with type 2 diabetes. ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering). http://doi.org/10.4108/icst.pervasivehealth.2013.25","paperID":"None"},{"content":"Yoav Ben-Shlomo and Diana Kuh. 2002. A life course approach to chronic disease epidemiology: conceptual models, empirical challenges and interdisciplinary perspectives. International Journal of Epidemiology 31, 2: 285-293.","paperID":"None"},{"content":"Jochanan Benbassat and Mark Taragin. 2000. Hospital readmissions as a measure of quality of health care: advantages and limitations. Archives of Internal Medicine 160, 8: 1074-1081.","paperID":"None"},{"content":"Thomas Bodenheimer, Kate Lorig, Halsted Holman, and Kevin Grumbach. 2002. Patient self-management of chronic disease in primary care. JAMA 288, 19: 2469-2475.","paperID":"None"},{"content":"Robert E. Burke, Ruixin Guo, Allan V. Prochazka, and Gregory J. Misky. 2014. Identifying keys to success in reducing read missions using the ideal transitions in care framework. BMC Health Services Research 14, 1: 423. http://doi.org/10.1186/14726963--14--423","paperID":"None"},{"content":"Kristin L. Carman, Pam Dardess, Maureen Maurer, et al. 2013. Patient and family engagement: a framework for understanding the elements and developing interventions and policies. Health Affairs (Project Hope) 32, 2: 223-231. http://doi.org/10.1377/hlthaff.2012.1133","paperID":"None"},{"content":"Richard Charlton, Michael B. Gravenor, Anwen Rees, et al. 2014. Factors associated with low fitness in adolescents - a mixed methods study. BMC Public Health 14, 1: 764. http://doi.org/10.1186/1471--2458--14--764","paperID":"None"},{"content":"Eun Kyoung Choe, Nicole B. Lee, Bonghin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding quantified-selfers' practices in collecting and exploring personal data. http://doi.org/10.1145/2556288.2557372","paperID":"None"},{"content":"James J. Cimino, G Elhanan, and Q Zeng. 1997. Supporting infobuttons with terminological knowledge. AMIA Annual Symposium Proceedings: 528-532.","paperID":"None"},{"content":"Andrea Civan and Wanda Pratt. 2007. Threading together patient expertise. AMIA Annual Symposium Proceedings: 140-144.","paperID":"None"},{"content":"Andrea Civan-Hartzler, David W. McDonald, Chris Powell, Meredith M. Skeels, Marlee Mukai, and Wanda Pratt. 2010. Bringing the field into focus: user-centered design of a patient expertise locator. ACM Request Permissions, 1675-1684. http://doi.org/10.1145/1753326.1753577","paperID":"None"},{"content":"Sunny Consolvo, Katherine Everitt, Ian Smith, and James A. Landay. 2006. Design requirements for technologies that encourage physical activity. http://doi.org/10.1145/1124772.1124840","paperID":"None"},{"content":"Juliet M. Corbin and Anselm Strauss. 1988. Unending work and care: managing chronic illness at home. Jossey-Bass.","paperID":"None"},{"content":"Anuj K. Dalal, Patricia C. Dykes, Sarah Collins, et al. 2015. A web-based, patient-centered toolkit to engage patients and caregivers in the acute care setting: a preliminary evaluation. Journal of the American Medical Informatics Association : JAMIA: ocv093. http://doi.org/10.1093/jamia/ocv093","paperID":"None"},{"content":"Patricia C. Dykes, Diana Stade, Frank Chang, et al. 2014. Participatory Design and Development of a Patient-centered Toolkit to Engage Hospitalized Patients and Care Partners in their Plan of Care. Proceedings of the AMIA Symposium 2014: 486- 495.","paperID":"None"},{"content":"Geraldine Fitzpatrick and Gunnar Ellingsen. 2013. A Review of 25 Years of CSCW Research in Healthcare: Contributions, Challenges and Future Agendas. Computer Supported Cooperative Work (CSCW) 22, 4--6: 609-665. http://doi.org/10.1007/s10606-012--9168-0","paperID":"None"},{"content":"Alan J. Forster, Harvey J. Murff, Josh F. Peterson, Tejal K. Gandhi, and David W. Bates. 2003. The incidence and severity of adverse events affecting patients after discharge from the hospital. Annals of Internal Medicine 138, 3: 161-167.","paperID":"None"},{"content":"Susannah Fox. 2011. The social life of health information, 2011. Pew internet & American life project. Retrieved from http://pewinternet.org/Reports/2011/Social-Life-ofHealth-Info.aspx","paperID":"None"},{"content":"Peter G. Gibson, Heather Powell, Amanda J. Wilson, et al. 2002. Limited (information only) patient education programs for adults with asthma. The Cochrane database of systematic reviews, 2: CD001005. http://doi.org/10.1002/14651858.CD001005","paperID":"None"},{"content":"Paul Glasziou, Les Irwig, and David Mant. 2005. Monitoring in chronic disease: a rational approach. BMJ (Clinical research ed.) 330, 7492: 644-648. http://doi.org/10.1136/bmj.330.7492.644","paperID":"None"},{"content":"Luke O. Hansen, Robert S. Young, Keiki Hinami, Alicia Leung, and Mark V. Williams. 2011. Interventions to reduce 30-day rehospitalization: a systematic review. Annals of Internal Medicine 155, 8: 520-528. http://doi.org/10.7326/0003--4819155--8--201110180-00008","paperID":"None"},{"content":"Andrea Hartzler and Wanda Pratt. 2011. Managing the personal side of health: how patient expertise differs from the expertise of clinicians. Journal of Medical Internet Research 13, 3: e62. http://doi.org/10.2196/jmir.1728","paperID":"None"},{"content":"Andrea L. Hartzler, Shomir Chaudhuri, Brett C. Fey, David R. Flum, and Danielle Lavallee. 2015. Integrating Patient-Reported Outcomes into Spine Surgical Care through Visual Dashboards: Lessons Learned from Human-Centered Design. eGEMs 3, 2: 1133. http://doi.org/10.13063/2327--9214.1133","paperID":"None"},{"content":"Vicki S. Helgeson and Sheldon Cohen. 1996. Social support and adjustment to cancer: reconciling descriptive, correlational, and intervention research. Health psychology: Official journal of the Division of Health Psychology, American Psychological Association 15, 2: 135-148.","paperID":"None"},{"content":"James G. Hodge, Lawrence O. Gostin, and Peter D. Jacobson. 1999. Legal issues concerning electronic health information: privacy, quality, and liability. JAMA 282, 15: 1466-1471.","paperID":"None"},{"content":"Leora I. Horwitz, John P. Moriarty, Christine Chen, et al. 2013. Quality of discharge practices and patient understanding at an academic medical center. JAMA internal medicine 173, 18: 1715- 1722. http://doi.org/10.1001/jamainternmed.2013.9318","paperID":"None"},{"content":"Stephen F. Jencks, Mark V. Williams, and Eric A. Coleman. 2009. Rehospitalizations among patients in the Medicare fee-for-service program. The New England journal of medicine 360, 14: 1418-1428. http://doi.org/10.1056/NEJMsa0803563","paperID":"None"},{"content":"Amber E. Johnson, L. Ebony Boulware, Cheryl A.M. Anderson, et al. 2014. Perceived barriers and facilitators of using dietary modification for CKD prevention among African Americans of low socioeconomic status: a qualitative study. BMC nephrology 15, 1: 194. http://doi.org/10.1186/14712369--15--194","paperID":"None"},{"content":"Shreya Kangovi, Frances K. Barg, Tamala Carter, et al. 2014. Challenges faced by patients with low socioeconomic status during the post-hospital transition. Journal of General Internal Medicine 29, 2: 283-289. http://doi.org/10.1007/s11606-0132571--5","paperID":"None"},{"content":"Julie A. Kientz. 2012. Embedded capture and access: encouraging recording and reviewing of data in the caregiving domain. 16, 2.","paperID":"None"},{"content":"Amy J.H. Kind, Steve Jencks, Jane Brock, et al. 2014. Neighborhood socioeconomic disadvantage and 30-day rehospitalization: a retrospective cohort study. Annals of Internal Medicine 161, 11: 765- 774. http://doi.org/10.7326/M13--2946","paperID":"None"},{"content":"Gina Koch, Bonnie J. Wakefield, and Douglas S. Wakefield. 2015. Barriers and facilitators to managing multiple chronic conditions: a systematic literature review. Western Journal of Nursing Research 37, 4: 498-516. http://doi.org/10.1177/0193945914549058","paperID":"None"},{"content":"Danielle C Lavallee, Paul Wicks, Rafael Alfonso Cristancho, and C. Daniel Mullins. 2014. Stakeholder engagement in patient-centered outcomes research: high-touch or high-tech? Expert Review of Pharmacoeconomics & Outcomes Research 14, 3: 335-344. http://doi.org/10.1586/14737167.2014.901890","paperID":"None"},{"content":"Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stagebased model of personal informatics systems. ACM, New York, New York, USA. http://doi.org/10.1145/1753326.1753409","paperID":"None"},{"content":"Kate R. Lorig and Halsted R. Holman. 2003. Self-management education: History, definition, outcomes, and mechanisms. Annals of Behavioral Medicine 26, 1: 1-7. http://doi.org/10.1207/S15324796ABM2601_01","paperID":"None"},{"content":"Kate R. Lorig, Philip Ritter, Anita L. Stewart, et al. 2001. Chronic disease self-management program: 2-year health status and health care utilization outcomes. Medical Care 39, 11: 1217-1223.","paperID":"None"},{"content":"Amgad N. Makaryus and Eli A. Friedman. 2005. Patients' understanding of their treatment plans and diagnosis at discharge. Mayo Clinic Proceedings 80, 8: 991-994. http://doi.org/10.4065/80.8.991","paperID":"None"},{"content":"Lena Mamykina, Arlene M. Smaldone, and Suzanne R. Bakken. 2015. Adopting the sensemaking perspective for chronic disease self-management. Journal of Biomedical Informatics 56, C: 406-417. http://doi.org/10.1016/j.jbi.2015.06.006","paperID":"None"},{"content":"Kenneth D. Mandl, Peter Szolovits, and Isaac S. Kohane. 2001. Public standards and patients' control: how to keep electronic medical records accessible but private. BMJ (Clinical research ed.) 322, 7281: 283-287.","paperID":"None"},{"content":"Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall, and Cristiano Storni. 2015. Self-Care Technologies in HCI: Trends, Tensions, and Opportunities. ACM Transactions on Computer-Human Interaction (TOCHI) 22, 6: 33-45. http://doi.org/10.1145/2803173","paperID":"None"},{"content":"Carla Parry, Heidi M. Kramer, and Eric A. Coleman. 2006. A qualitative exploration of a patient-centered coaching intervention to improve care transitions in chronically ill older adults. Home Health Care Services Quarterly 25, 3--4: 39-53. http://doi.org/10.1300/J027v25n03_03","paperID":"None"},{"content":"Laura M. Pfeifer and Timothy W. Bickmore. 2011. Longitudinal Remote Follow-Up by Intelligent Conversational Agents for Post-Hospitalization Care. AAAI Spring Symposium - Technical Report, SS-11-01, 33--40.","paperID":"None"},{"content":"Jenny Preece. 1998. Empathic communities: reaching out across the Web. interactions. http://doi.org/10.1145/274430.274435","paperID":"None"},{"content":"Jane Sarasohn-Kahn. 2012. The wisdom of patients: Health care meets online social media. California Health Care Foundation (2008). Retrieved from http://www.chcf.org/publications/2008/04/thewisdom-of-patients-health-care-meets-onlinesocial-media","paperID":"None"},{"content":"Sasha Shepperd, Natasha A. Lannin, Lindy M. Clemson, Annie McCluskey, Ian D. Cameron, and Sarah L. Barras. 2013. Discharge planning from hospital to home. The Cochrane Database of Systematic Reviews 1: CD000313. http://doi.org/10.1002/14651858.CD000313.pub4","paperID":"None"},{"content":"Meredith M. Skeels, Kenton T. Unruh, Christopher Powell, and Wanda Pratt. 2010. Catalyzing Social Support for Breast Cancer Patients. CHI ... conference proceedings / Conference on Human Factors in Computing Systems. CHI Conference: 173-182. http://doi.org/10.1145/1753326.1753353","paperID":"None"},{"content":"Brian K. Smith, Jeanna Frost, Meltem Albayrak, and Rajneesh Sudhakar. 2007. Integrating glucometers and digital photography as experience capture tools to enhance patient understanding and communication of diabetes self-management. Personal and Ubiquitous Computing, 11(4), 273286.","paperID":"None"},{"content":"Elliot Soloway, Shari L. Jackson, Jonathan Klein, et al. 1996. Learning theory in practice: case studies of learner-centered design. ACM, New York, New York, USA. http://doi.org/10.1145/238386.238476","paperID":"None"},{"content":"Kelly D. Stamp, Monique A. Machado, and Nancy A. Allen. 2014. Transitional care programs improve outcomes for heart failure patients: an integrative review. The Journal of Cardiovascular Nursing 29, 2: 140-154. http://doi.org/10.1097/JCN.0b013e31827db560","paperID":"None"},{"content":"Cristiano Storni. 2015. Patients' lay expertise in chronic self-care: a case study in type 1 diabetes. Health expectations: An international journal of public participation in health care and health policy 18, 5: 1439-1450. http://doi.org/10.1111/hex.12124","paperID":"None"},{"content":"Amanda Third and Ingrid Richardson. 2010. Connecting, supporting and empowering young people living with chronic illness and disability: the live-wire online community. Report prepared for the Starlight Children's Foundation. Retrieved from https://starlight.org.au/sites/all/tmp/files/200programs/Livewire-Online-Community-ResearchProject.pdf","paperID":"None"},{"content":"Kenton T. Unruh, Meredith Skeels, Andrea Civan Hartzler, and Wanda Pratt. 2010. Transforming Clinic Environments into Information Workspaces for Patients. Human Factors in Computing Systems Proceedings of the SIGCHI Conference, 183--192. http://doi.org/10.1145/1753326.1753354","paperID":"None"},{"content":"Nienke van der Meulen, Jesse Jansen, Sandra van Dulmen, Jozien Bensing, and Julia van Weert. 2008. Interventions to improve recall of medical information in cancer patients: a systematic review of the literature. Psycho-oncology 17, 9: 857-868. http://doi.org/10.1002/pon.1290","paperID":"None"},{"content":"Simone N. Vigod, Paul A. Kurdyak, Cindy-Lee Dennis, et al. 2013. Transitional interventions to reduce early psychiatric readmissions in adults: systematic review. The British Journal of Psychiatry : the journal of mental science 202, 3: 187-194. http://doi.org/10.1192/bjp.bp.112.115030","paperID":"None"},{"content":"Lauren Wilcox, Janet Woollen, Jennifer Prey, et al. 2015. Interactive Tools for Inpatient Medication Tracking: A Multi-Phase Study with Cardiothoracic Surgery Patients. Journal of the American Medical Informatics Association: JAMIA. http://doi.org/http://dx.doi.org/10.1093/jamia/ocv16","paperID":"None"},{"content":"Shuo Zhou, Timothy Bickmore, Michael PaascheOrlow, and Brian Jack. 2014. Agent-User Concordance and Satisfaction with a Virtual Hospital Discharge Nurse. Lecture Notes in Computer Science, 8637, 528--541.","paperID":"None"}],"citation":[],"abstract":"Patients going home after a hospitalization face many challenges. This transition period exposes patients to unnecessary risks related to inadequate preparation prior to leaving the hospital, potentially leading to errors and patient harm. Although patients engaging in self-management have better health outcomes and increased self-efficacy, little is known about the processes in place to support and develop these skills for patients leaving the hospital. Through qualitative interviews and observations of 28 patients during and after their hospitalizations, we explore the challenges they face transitioning from hospital care to self-management. We identify three key elements in this process: knowledge, resources, and self-efficacy. We describe how both system and individual factors contribute to breakdowns leading to ineffective patient management. This work expands our understanding of the unique challenges faced by patients during this difficult transition and uncovers important design opportunities for supporting crucial yet unmet patient needs.","title":"Closing the Gap: Supporting Patients' Transition to Self-Management after Hospitalization","filename":"CHI16/p5324","authors":["Ari H. Pollack","Uba Backonja","Andrew D. Miller","Sonali R. Mishra","Maher Khelifi","Logan Kendall","Wanda Pratt"],"conference":"CHI '16"}