{"paperId":2858106,"citation":[],"reference":[{"content":"Beagle Bone Black. Retrieved Dec 24, 2015 from http://beagleboard.org/BLACK","paperID":"None"},{"content":"Dustin Beyer, Serafima Gurevich, Stefanie Mueller, Hsiang-Ting Chen, and Patrick Baudisch. 2015. Platener: Low-Fidelity Fabrication of 3D Objects by Substituting 3D Print with Laser-Cut Plates. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 17991806. http://dx.doi.org/10.1145/2702123.2702225","paperID":"None"},{"content":"Bill Buxton. 2010. Sketching user experiences: getting the design right and the right design: getting the design right and the right design. Morgan Kaufmann.","paperID":"None"},{"content":"Camera Calibration with OpenCV. Retrieved Dec 24, 2015 from http://docs.opencv.org/doc/tutorials/calib3d/camera_calibration/camera_calibration.html","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Stelian Coros, Jennifer Mankoff, and Scott E. Hudson. 2015. Encore: 3D Printed Augmentation of Everyday Objects with Printed-Over, Affixed and Interlocked Attachments. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 7382. http://dx.doi.org/10.1145/2807442.2807498","paperID":"None"},{"content":"CRAMPS 2.0. Retrieved Dec 24, 2015 from http://reprap.org/wiki/CRAMPS","paperID":"None"},{"content":"Sean Follmer, David Carr, Emily Lovell, and Hiroshi Ishii. 2010. CopyCAD: remixing physical objects with copy and paste from the real world. In Adjunct proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10), 381--382. http://dx.doi.org/10.1145/1866218.1866230","paperID":"None"},{"content":"Wei Gao, Yunbo Zhang, Diogo C. Nazzetta, Karthik Ramani, and Raymond J. Cipra. 2015. RevoMaker: Enabling Multi-directional and Functionally-embedded 3D printing using a Rotational Cuboidal Platform. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 437446. http://dx.doi.org/10.1145/2807442.2807476","paperID":"None"},{"content":"Heating Cartridge. Retrieved Dec 24, 2015 from www.makergeeks.com/cecahefor3dp.html","paperID":"None"},{"content":"Joong Han Lee. Haptic Intelligentsia. Retrieved Dec 24, 2015 from http://studio-homunculus.com","paperID":"None"},{"content":"LinuxCNC. Retrieved Dec 24, 2015 from http://www.linuxcnc.org","paperID":"None"},{"content":"Albert Liu, Steve Marschner, Noah Snavely. 2015. Caliber: Camera Localization and Calibration Using Rigidity Constraints. International Journal of Computer Vision, pp.1--21. http://dx.doi.org/10.1007/s11263-0150866--1","paperID":"None"},{"content":"Master Appliance. Retrieved Dec 24, 2015 from https://www.masterappliance.com/content/35407-tipassortment-kit-5-tips-1-adaptor","paperID":"None"},{"content":"Mataerial. Retrieved Dec 24, 2015 from http://www.mataerial.com","paperID":"None"},{"content":"Mini Kossel. Retrieved Dec 24, 2015 from http://reprap.org/wiki/Kossel","paperID":"None"},{"content":"Stefanie Mueller, Sangha Im, Serafima Gurevich, Alexander Teibrich, Lisa Pfisterer, François Guimbretière, and Patrick Baudisch. 2014. WirePrint: 3D printed previews for fast prototyping. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14), 273--280. http://dx.doi.org/10.1145/2642918.2647359","paperID":"None"},{"content":"Stefanie Mueller, Pedro Lopes, and Patrick Baudisch. 2012. Interactive construction: interactive fabrication of functional mechanical devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12), NY, USA, 599606. http://dx.doi.org/10.1145/2380116.2380191","paperID":"None"},{"content":"Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, and Patrick Baudisch. 2014. faBrickation: fast 3D printing of functional objects by integrating construction kit building blocks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3827--3834. http://dx.doi.org/10.1145/2556288.2557005","paperID":"None"},{"content":"Huaishu Peng, Amit Zoran, and François V. Guimbretière. 2015. D-Coil: A Hands-on Approach to Digital 3D Models Design. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1807--1815. http://dx.doi.org/10.1145/2702123.2702381","paperID":"None"},{"content":"RhinoCAD. Retrieved Dec 24, 2015 from http://www.rhino3d.com","paperID":"None"},{"content":"Rhinocommon SDK. Retrived Dec 24, 2015 from http://4.rhino3d.com/5/rhinocommon/","paperID":"None"},{"content":"Alec Rivers, Ilan E. Moyer, and Frédo Durand. 2012. Position-correcting tools for 2D digital fabrication. ACM Trans. Graph. 31, 4, Article 88. http://dx.doi.org/10.1145/2185520.2185584","paperID":"None"},{"content":"Jutta Schumann, Thomas Strothotte, Stefan Laser, and Andreas Raab. 1996. Assessing the effect of non-photorealistic rendered images in CAD. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '96), 35--41. http://dx.doi.org/10.1145/238386.238398","paperID":"None"},{"content":"Lei Shi, Idan Zelzer, Catherine Feng, and Shiri Azenkot. 2016. Tickers and Talker: An Accessible Labeling Toolkit for 3D Printed Models. In Proceedings of the 34rd Annual ACM Conference on Human Factors in Computing Systems (CHI '16). http://dx.doi.org/10.1145/2858036.2858507","paperID":"None"},{"content":"Pitchaya Sitthi-Amorn, Javier E. Ramos, Yuwang Wangy, Joyce Kwan, Justin Lan, Wenshou Wang, and Wojciech Matusik. 2015. MultiFab: a machine vision assisted platform for multi-material 3D printing. ACM Trans. Graph. 34, 4, Article 129. http://dx.doi.org/10.1145/2766962","paperID":"None"},{"content":"Hyunyoung Song, François Guimbretière, Chang Hu, and Hod Lipson. 2006. ModelCraft: capturing freehand annotations and edits on physical 3D models. In Proceedings of the 19th annual ACM symposium on User interface software and technology (UIST '06), 1322. http://dx.doi.org/10.1145/1166253.1166258","paperID":"None"},{"content":"Xuan Song, Yayue Pan, Yong Chen. 2015. Development of a Low-Cost Parallel Kinematic Machine for Multidirectional Additive Manufacturing. Journal of Manufacturing Science and Engineering, 137(2), 021005. http://dx.doi.org/10.1115/1.4028897","paperID":"None"},{"content":"Spraying System. Retrieved Dec 24, 2015 from http://www.spray.com/cat70/cat70pdf/ssco_cat70_f.pdf","paperID":"None"},{"content":"Alexander Teibrich, Stefanie Mueller, François Guimbretière, Robert Kovacs, Stefan Neubert, and Patrick Baudisch. 2015. Patching Physical Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 8391. http://dx.doi.org/10.1145/2807442.2807467","paperID":"None"},{"content":"John R. Tumbleston, David Shirvanyants, Nikita Ermoshkin, Rima Janusziewicz, Ashley R. Johnson, David Kelly, Kai Chen, Robert Pinschmidt, Jason P. Rolland, Alexander Ermoshkin, Edward T. Samulski, Joseph M. DeSimone. 2015. Continuous liquid interface production of 3D objects. Science, 347(6228), 1349--1352. http://dx.doi.org/10.1126/science.aaa2397","paperID":"None"},{"content":"Christian Weichel, John Hardy, Jason Alexander, and Hans Gellersen. 2015. ReForm: Integrating Physical and Digital Design through Bidirectional Fabrication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 93102. http://dx.doi.org/10.1145/2807442.2807451","paperID":"None"},{"content":"Karl D.D. Willis, Cheng Xu, Kuan-Ju Wu, Golan Levin, and Mark D. Gross. 2010. Interactive fabrication: new interfaces for digital fabrication. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction (TEI '11), 69--72. http://dx.doi.org/10.1145/1935701.1935716","paperID":"None"},{"content":"Amit Zoran and Joseph A. Paradiso. 2013. FreeD: a freehand digital sculpting tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2613--2616. http://dx.doi.org/10.1145/2470654.2481361","paperID":"None"},{"content":"Amit Zoran, Roy Shilkrot, and Joseph Paradiso. 2013. Human-computer interaction for hybrid carving. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13), 433--440. http://dx.doi.org/10.1145/2501988.2502023","paperID":"None"}],"abstract":"Current interactive fabrication tools offer tangible feedback by allowing users to work directly on the physical model, but they are slow because users need to participate in the physical instantiation of their designs. In contrast, CAD software offers powerful tools for 3D modeling but delays access to the physical workpiece until the end of the design process. In this paper we propose On-the-Fly Print: a 3D modeling approach that allows the user to design 3D models digitally while having a low-fidelity physical wireframe model printed in parallel. Our software starts printing features as soon as they are created and updates the physical model as needed. Users can quickly check the design in a real usage context by removing the partial physical print from the printer and replacing it afterwards to continue printing. Digital content modification can be updated with quick physical correction using a retractable cutting blade. We present the detailed description of On-the-Fly Print and showcase several examples designed and printed with our system.","title":"On-The-Fly Print: Incremental Printing While Modelling","filename":"CHI16/p887","authors":["Huaishu Peng","Rundong Wu","Steve Marschner","François Guimbretière"],"conference":"CHI '16"}