{"paperId":2858165,"abstract":"Users' individual differences in their mobile touch behaviour can help to continuously verify identity and protect personal data. However, little is known about the influence of GUI elements and hand postures on such touch biometrics. Thus, we present a metric to measure the amount of user-revealing information that can be extracted from touch targeting interactions and apply it in eight targeting tasks with over 150,000 touches from 24 users in two sessions. We compare touch-to-target offset patterns for four target types and two hand postures. Our analyses reveal that small, compactly shaped targets near screen edges yield the most descriptive touch targeting patterns. Moreover, our results show that thumb touches are more individual than index finger ones. We conclude that touch-based user identification systems should analyse GUI layouts and infer hand postures. We also describe a framework to estimate the usefulness of GUIs for touch biometrics.","reference":[{"content":"Julio Angulo and Erik Wästlund. 2012. Exploring Touch-Screen Biometrics for User Identification on Smart Phones. Privacy and Identity Management for Life 375 (2012), 130--143.","paperID":"None"},{"content":"Shiri Azenkot and Shumin Zhai. 2012. Touch Behavior with Different Postures on Soft Smartphone Keyboards. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, NY, NY, USA, 251--260.","paperID":"None"},{"content":"Tyler Baldwin and Joyce Chai. 2012. Towards Online Adaptation and Personalization of Key-target Resizing for Mobile Devices. In Proceedings of the 2012 ACM International Conference on Intelligent User Interfaces (IUI '12). ACM, NY, NY, USA, 11--20.","paperID":"None"},{"content":"David Barber. 2012. Bayesian Reasoning and Machine Learning. Cambridge University Press.","paperID":"None"},{"content":"Patrick Baudisch and Gerry Chu. 2009. Back-of-device Interaction Allows Creating Very Small Touch Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1923--1932.","paperID":"None"},{"content":"Joanna Bergstrom-Lehtovirta and Antti Oulasvirta. 2014. Modeling the Functional Area of the Thumb on Mobile Touchscreen Surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1991--2000.","paperID":"None"},{"content":"Michael Beton, Vincent Marie, and Christophe Rosenberger. 2013. Biometric secret path for mobile user authentication: A preliminary study. In Computer and Information Technology (WCCIT), 2013 World Congress on. 1--6.","paperID":"None"},{"content":"Xiaojun Bi, Shiri Azenkot, Kurt Partridge, and Shumin Zhai. 2013a. Octopus: Evaluating Touchscreen Keyboard Correction and Recognition Algorithms via. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 543--552.","paperID":"None"},{"content":"Xiaojun Bi, Yang Li, and Shumin Zhai. 2013b. FFitts Law: Modeling Finger Touch with Fitts' Law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1363--1372.","paperID":"None"},{"content":"Ulrich Burgbacher and Klaus Hinrichs. 2014. An Implicit Author Verifikcation System for Text Messages Based on Gesture Typing Biometrics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2951--2954.","paperID":"None"},{"content":"Daniel Buschek and Florian Alt. 2015. TouchML: A Machine Learning Toolkit for Modelling Spatial Touch Targeting Behaviour. In Proceedings of the 20th International Conference on Intelligent User Interfaces (IUI '15). ACM, NY, NY, USA, 110--114.","paperID":"None"},{"content":"Daniel Buschek, Alexander Auch, and Florian Alt. 2015a. A Toolkit for Analysis and Prediction of Touch Targeting Behaviour on Mobile Websites. In Proceedings of the 7th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '15). ACM, NY, NY, USA, 54--63.","paperID":"None"},{"content":"Daniel Buschek, Alexander De Luca, and Florian Alt. 2015b. Improving Accuracy, Applicability and Usability of Keystroke Biometrics on Mobile Touchscreen Devices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1393--1402.","paperID":"None"},{"content":"Daniel Buschek, Alexander De Luca, and Florian Alt. 2015c. There is more to Typing than Speed: Expressive Mobile Touch Keyboards via Dynamic Font Personalisation. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, NY, NY, USA, 125--130.","paperID":"None"},{"content":"Daniel Buschek, Simon Rogers, and Roderick Murray-Smith. 2013. User-specific Touch Models in a Cross-device Context. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, NY, NY, USA, 382--391.","paperID":"None"},{"content":"Daniel Buschek, Oliver Schoenleben, and Antti Oulasvirta. 2014. Improving Accuracy in Back-of-Device Multitouch Typing: A Clustering-based Approach to Keyboard Updating. In Proceedings of the 19th International Conference on Intelligent User Interfaces (IUI '14). ACM, NY, NY, USA, 57--66.","paperID":"None"},{"content":"Heather Crawford, Karen Renaud, and Tim Storer. 2013. A framework for continuous, transparent mobile device authentication. Computers & Security 39, Part B (2013), 127--136.","paperID":"None"},{"content":"Alexander De Luca, Alina Hang, Frederik Brudy, Christian Lindner, and Heinrich Hussmann. 2012. Touch Me Once and I Know It's You!: Implicit Authentication Based on Touch Screen Patterns. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 987--996.","paperID":"None"},{"content":"Mohammad Omar Derawi, Claudia Nickel, Patrick Bours, and Christoph Busch. 2010. Unobtrusive User-Authentication on Mobile Phones Using Biometric Gait Recognition. In Proceedings of the 2010 Sixth International Conference on Intelligent Information Hiding and Multimedia Signal Processing (IIH-MSP '10). IEEE Computer Society, Washington, DC, USA, 306--311.","paperID":"None"},{"content":"Leah Findlater and Jacob Wobbrock. 2012. Personalized Input: Improving Ten-finger Touchscreen Typing Through Automatic Adaptation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 815--824.","paperID":"None"},{"content":"Paul M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology 47, 6 (1954), 381--391.","paperID":"None"},{"content":"Clifton Forlines, Daniel Wigdor, Chia Shen, and Ravin Balakrishnan. 2007. Direct-touch vs. Mouse Input for Tabletop Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 647--656.","paperID":"None"},{"content":"M. Frank, R. Biedert, E. Ma, I. Martinovic, and D. Song. 2013. Touchalytics: On the Applicability of Touchscreen Input as a Behavioral Biometric for Continuous Authentication. Information Forensics and Security, IEEE Transactions on 8, 1 (Jan 2013), 136--148.","paperID":"None"},{"content":"Asela Gunawardana, Tim Paek, and Christopher Meek. 2010. Usability Guided Key-target Resizing for Soft Keyboards. In Proceedings of the 15th International Conference on Intelligent User Interfaces (IUI '10). ACM, NY, NY, USA, 111--118.","paperID":"None"},{"content":"Niels Henze, Enrico Rukzio, and Susanne Boll. 2011. 100,000,000 Taps: Analysis and Improvement of Touch Performance in the Large. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, NY, NY, USA, 133--142.","paperID":"None"},{"content":"Christian Holz and Patrick Baudisch. 2010. The Generalized Perceived Input Point Model and How to Double Touch Accuracy by Extracting Fingerprints. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 581--590.","paperID":"None"},{"content":"Christian Holz and Patrick Baudisch. 2011. Understanding Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2501--2510.","paperID":"None"},{"content":"Christian Holz and Patrick Baudisch. 2013. Fiberio: A Touchscreen That Senses Fingerprints. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 41--50.","paperID":"None"},{"content":"Markus Löchtefeld, Phillip Schardt, Antonio Krüger, and Sebastian Boring. 2015. Detecting Users Handedness for Ergonomic Adaptation of Mobile User Interfaces. In Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia (MUM '15). ACM, NY, NY, USA, 245--249.","paperID":"None"},{"content":"David J.C. MacKay. 2003. Information Theory, Inference, and Learning Algorithms. Cambridge University Press.","paperID":"None"},{"content":"Philipp Mock, Jörg Edelmann, Andreas Schilling, and Wolfgang Rosenstiel. 2014. User Identification Using Raw Sensor Data from Typing on Interactive Displays. In Proceedings of the 19th International Conference on Intelligent User Interfaces (IUI '14). ACM, NY, NY, USA, 67--72.","paperID":"None"},{"content":"Mohammad Nauman, Tamleek Ali, and Azhar Rauf. 2013. Using Trusted Computing for Privacy Preserving Keystroke-based Authentication in Smartphones. Telecommunication Systems 52, 4 (April 2013), 2149--2161.","paperID":"None"},{"content":"Antti Oulasvirta, Teemu Roos, Arttu Modig, and Laura Leppänen. 2013. Information Capacity of Full-body Movements. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1289--1298.","paperID":"None"},{"content":"Pekka Parhi, Amy K. Karlson, and Benjamin B. Bederson. 2006. Target Size Study for One-handed Thumb Use on Small Touchscreen Devices. In Proceedings of the 8th Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '06). ACM, NY, NY, USA, 203--210.","paperID":"None"},{"content":"Keith B. Perry and Juan Pablo Hourcade. 2008. Evaluating One Handed Thumb Tapping on Mobile Touchscreen Devices. In Proceedings of Graphics Interface 2008 (GI '08). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 57--64.","paperID":"None"},{"content":"Carl Edward Rasmussen and Christopher K. I. Williams. 2006. Gaussian processes for machine learning. The MIT Press.","paperID":"None"},{"content":"Simon Rogers, John Williamson, Craig Stewart, and Roderick Murray-Smith. 2011. AnglePose: Robust, Precise Capacitive Touch Tracking via 3D Orientation Estimation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2575--2584.","paperID":"None"},{"content":"Napa Sae-Bae, Kowsar Ahmed, Katherine Isbister, and Nasir Memon. 2012. Biometric-rich Gestures: A Novel Approach to Authentication on Multi-touch Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 977--986.","paperID":"None"},{"content":"Michael E. Tipping. 2001. Sparse Bayesian Learning and the Relevance Vector Machine. Journal of Machine Learning Research 1 (Sept. 2001), 211--244.","paperID":"None"},{"content":"Feng Wang and Xiangshi Ren. 2009. Empirical Evaluation for Finger Input Properties in Multi-touch Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1063--1072.","paperID":"None"},{"content":"Daryl Weir, Daniel Buschek, and Simon Rogers. 2013. Sparse Selection of Training Data for Touch Correction Systems. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, NY, NY, USA, 404--407.","paperID":"None"},{"content":"Daryl Weir, Simon Rogers, Roderick Murray-Smith, and Markus Löchtefeld. 2012. A User-specific Machine Learning Approach for Improving Touch Accuracy on Mobile Devices. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, NY, NY, USA, 465--476.","paperID":"None"},{"content":"Jacob O. Wobbrock, Brad A. Myers, and Htet Htet Aung. 2008. The Performance of Hand Postures in Front- and Back-of-device Interaction for Mobile Computing. International Journal of Human-Computer Studies 66, 12 (2008), 857--875.","paperID":"None"},{"content":"Hui Xu, Yangfan Zhou, and Michael R. Lyu. 2014. Towards Continuous and Passive Authentication via Touch Biometrics: An Experimental Study on Smartphones. In Symposium On Usable Privacy and Security (SOUPS 2014). USENIX Association, Menlo Park, CA, 187--198.","paperID":"None"},{"content":"Ying Yin, Tom Yu Ouyang, Kurt Partridge, and Shumin Zhai. 2013. Making Touchscreen Keyboards Adaptive to Keys, Hand Postures, and Individuals: A Hierarchical Spatial Backoff Model Approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2775--2784.","paperID":"None"},{"content":"Xi Zhao, Tao Feng, and Weidong Shi. 2013. Continuous mobile authentication using a novel Graphic Touch Gesture Feature. In 2013 IEEE Sixth International Conference on Biometrics: Theory, Applications and Systems (BTAS). 1--6.","paperID":"None"},{"content":"Nan Zheng, Kun Bai, Hai Huang, and Haining Wang. 2014. You Are How You Touch: User Verification on Smartphones via Tapping Behaviors. In 2014 IEEE 22nd International Conference on Network Protocols (ICNP). 221--232.","paperID":"None"}],"citation":[],"title":"Evaluating the Influence of Targets and Hand Postures on Touch-based Behavioural Biometrics","filename":"CHI16/p1349","authors":["Daniel Buschek","Alexander De Luca","Florian Alt"],"conference":"CHI '16"}