{"paperId":2858317,"citation":[],"reference":[{"content":"2015. ReThink before the damage is done. Retreived September 22, 2015 from http://www.rethinkwords.com/.","paperID":"None"},{"content":"Diana Baumrind. 1987. A developmental perspective on adolescent risk taking in contemporary America. New directions for child development (37). 93--125.","paperID":"None"},{"content":"Lorrie Cranor, Adam L. Durity, Abigail Marsh and Blase Ur. 2014. Parents' and Teens' Perspectives on Privacy In a Technology-Filled World. in Proceedings of Symposium on Usable Privacy and Security (SOUPS), Menlo Park, CA.","paperID":"None"},{"content":"E. Mark Cummings, Kathleen N. Bergman and Kelly A. Kuznicki. 2012. Emerging Methods for Studying Families as Systems. in Proceedings of PSU 20th Annual Symposium on Family Issues, State College, PA.","paperID":"None"},{"content":"Katie Davis, David P. Randall, Anthony Ambrose and Mania Orand. 2014. 'I was bullied too': stories of bullying and coping in an online community. Information, Communication & Society, 18 (4). 357375. 10.1080/1369118x.2014.952657","paperID":"None"},{"content":"Zanieb De Souza and Geoffrey N. Dick. 2008. Information Disclosure by Children in Social Networking - And What do the Parents Know? in Proceedings of AMCIS 2008 Proceedings.","paperID":"None"},{"content":"Marcie C. Goeke-Morey, E. Mark Cummings and Lauren M. Papp. 2007. Children and Marital Conflict Resolution: Implications for Emotional Security and Adjustment. Journal of Family Psychology, 21 (4). 744--753.","paperID":"None"},{"content":"Kilem L. Gwet. 2010. Handbook of Inter-Rater Reliability, 4th Edition: The Definitive Guide to Measuring The Extent of Agreement Among Raters. Advanced Analytics, LLC, Gaithersburg, MD.","paperID":"None"},{"content":"Haiyan Jia, Pamela Wisniewski, Heng Xu, Mary Beth Rosson and John M. Carroll. 2015. Risk-taking as a Learning Process for Shaping Teen's Online Information Privacy Behaviors Computer-Supported Cooperative Work and Social Computing, Vancouver, BC, Canada.","paperID":"None"},{"content":"Haiyan Jia and Heng Xu. 2015. Examining Individuals' Collective Privacy Concerns on Social Networking Sites. in Proceedings of International Conference on Information Systems (ICIS), Fort Worth, TX.","paperID":"None"},{"content":"Lisa M. Jones, Kimberly J. Mitchell and David Finkelhor. 2012. Trends in Youth Internet Victimization: Findings From Three Youth Internet Safety Surveys 2000-2010. Journal of Adolescent Health, 50 (2). 179--186. http://dx.doi.org/10.1016/j.jadohealth.2011.09.015","paperID":"None"},{"content":"Ksenia Koroleva, Franziska Brecht, Luise Goebel and Monika Malinova. 2011. 'Generation Facebook' - A Cognitive Calculus Model of Teenage User Behavior on Social Network Sites. in Proceedings of AMCIS 2011 Proceedings, Detroit, MI.","paperID":"None"},{"content":"Jean-Philippe Laurenceau and Niall Bolger. 2005. Using Diary Methods to Study Marital and Family Processes. Journal of Family Psychology, 19 (1). 8697.","paperID":"None"},{"content":"Amanda Lenhart, Maeve Duggan, Andrew Perrin, Renee Stepler, Lee Rainie and Kim Parker. 2015. Teens, Social Media & Technology Overview 2015, Pew Research Center.","paperID":"None"},{"content":"R. M. Lerner. 2002. Adolescence: Development, diversity, context, and application. Prentice-Hall, Upper Saddle River, NJ.","paperID":"None"},{"content":"Anna Lichtwarck-Aschoff, Saskia Kunnen and Paul van Geert. 2010. Adolescent Girls' Perceptions of Daily Conflicts With Their Mothers: Within-Conflict Sequences and Their Relationship to Autonomy. Journal of Adolescent Research, 25 (4). 527--556. 10.1177/0743558410367953","paperID":"None"},{"content":"Sonia Livingstone. 2006. Drawing Conclusions from New Media Research: Reflections and Puzzles Regarding Children's Experience of the Internet. The Information Society, 22 (4). 219--230. 10.1080/01972240600791358","paperID":"None"},{"content":"Sonia Livingstone, Leslie Haddon, Anke Görzig and Kjartan Ólafsson. 2011. Risks and safety on the internet: The perspective of European children, EU Kids Online.","paperID":"None"},{"content":"Sonia Livingstone and Ellen J. Helsper. 2008. Parental Mediation of Children's Internet Use. Journal of Broadcasting & Electronic Media, 52 (4). 581--599. 10.1080/08838150802437396","paperID":"None"},{"content":"Sonia Livingstone, Kjartan Ólafsson, Brian O'Neill and Veronica Donoso. 2012. Towards a better internet for children: findings and recommendations from EU Kids Online to inform the CEO coalition. Network, E.K.O. ed., The London School of Economics and Political Science, London, UK.","paperID":"None"},{"content":"Sonya Livingstone. 2008. Taking risky opportunities in youthful content creation: Teenagers' use of social networking sites for intimacy, privacy, and self-expression. New Media & Society, 10. 393--411.","paperID":"None"},{"content":"Mary Madden, Sandra Cortesi, Urs Gasser, Amanda Lenhart and Maeve Duggan. 2012. Parents, Teens, and Online Privacy, Pew Research Center's Internet & American Life Project.","paperID":"None"},{"content":"Mary Madden, Amanda Lenhart, Sandra Cortesi, Urs Gasser, Maeve Duggan, Aaron Smith and Meredith Beaton. 2013. Teens, Social Media, and Privacy","paperID":"None"},{"content":"Joseph McGrath. 1981. Dilemmatics: The study of research choices and dilemmas. American Behavioral Scientist, 25 (2).","paperID":"None"},{"content":"Gustavo S. Mesch. 2009. Parental Mediation, Online Activities, and Cyberbullying CyberPsychology & Behavior, 12 (4). 387--393.","paperID":"None"},{"content":"Kimberly J. Mitchell, David Finkelhor and Janis Wolak. 2003. The Exposure Of Youth To Unwanted Sexual Material On The Internet: A National Survey of Risk, Impact, and Prevention. Youth & Society, 34 (3). 330--358. 10.1177/0044118x02250123","paperID":"None"},{"content":"Kimberly J. Mitchell, Lisa M. Jones, David Finkelhor and Janis Wolak. 2014. Trends in Unwanted Online Experiences and Sexting : Final Report, Crimes Against Children Research Center.","paperID":"None"},{"content":"Kimberly J. Mitchell, Lisa M. Jones, David Finkelhor and Janis Wolak. 2013. Understanding the decline in unwanted online sexual solicitations for U.S. youth 2000-2010: Findings from three Youth Internet Safety Surveys. Child Abuse & Neglect, 37. 1225--1236. 10.1016/j.chiabu.2013.07.002","paperID":"None"},{"content":"Sandra Petronio. 2002. Boundaries of privacy: dialectics of disclosure. SUNY Press.","paperID":"None"},{"content":"Qualtrics. 2015. Qualtrics REST API. Retreived January 5, 2015 from http://www.qualtrics.com/university/researchsuite/developer-tools/api-integration/qualtrics-rest-api/.","paperID":"None"},{"content":"Larry D. Rosen, Nancy A. Cheever and L. Mark Carrier. 2008. The association of parenting style and child age with parental limit setting and adolescent MySpace behavior. Journal of Applied Developmental Psychology, 29 (6). 459--471. http://dx.doi.org/10.1016/j.appdev.2008.07.005","paperID":"None"},{"content":"Anna C. Squicciarini, Heng Xu and Xiaolong Zhang. 2011. CoPE: Enabling collaborative privacy management in online social networks. Journal of the American Society for Information Science and Technology, 62 (3). 521--534. 10.1002/asi.21473","paperID":"None"},{"content":"Steve Stemler. 2001. An Overview of Content Analysis. Practical Assessment, Research & Evaluation, 7 (17).","paperID":"None"},{"content":"Fergus Stevenson and Marc A. Zimmerman. 2005. Adolescent Resilience: A Framework for Understanding Healthy Development in the Face of Risk. Annual Review of Public Health, 26. 399--419.","paperID":"None"},{"content":"Richard H. Thaler and Cass R. Sunstein. 2008. Nudge: Improving decisions about health, wealth, and happiness. Constitutional Political Economy, 19 (4). 356--360.","paperID":"None"},{"content":"Pamela Wisniewski, H. Jia, N. Wang, H. Xu, M. B. Rosson and J.M. Carroll. 2015. Resilience Mitigates the Negative Effects of Adolescent Internet Addiction and Online Risk Exposure. in Proceedings of ACM Conference on Human Factors in Computing Systems (CHI 2015), Seoul, Korea.","paperID":"None"},{"content":"Pamela Wisniewski, H. Jia, H. Xu, M. B. Rosson and J.M. Carroll. 2015. \"Preventative\" vs. \"Reactive:\" How Parental Mediation Influences Teens' Social Media Privacy Behaviors Computer-Supported Cooperative Work and Social Computing, Vancouver, BC, Canada.","paperID":"None"},{"content":"Pamela Wisniewski, Heng Xu, John M. Carroll and Mary Beth Rosson. 2013. Grand Challenges of Researching Adolescent Online Safety: A Family Systems Approach. in Proceedings of AMCIS 2013, Chicago, IL.","paperID":"None"},{"content":"Pamela Wisniewski, Heng Xu, Mary Beth Rosson and John M. Carroll. 2014. Adolescent Online Safety: The \"Moral\" of the Story. in Proceedings of CSCW 2014, Baltimore, MD.","paperID":"None"},{"content":"Heng Xu, Nazneen Irani and Sencun; and Xu Zhu, Wei. 2008. Alleviating Parental Concerns for Children's Online Privacy: A Value Sensitive Design Investigation. in Proceedings of ICIS 2008 Proceedings.","paperID":"None"}],"abstract":"In our study, 68 teens spend two months reflecting on their weekly online experiences and report 207 separate risk events involving information breaches, online harassment, sexual solicitations, and exposure to explicit content. We conduct a structured, qualitative analysis to characterize the salient dimensions of their risk experiences, such as severity, level of agency, coping strategies, and whether the teens felt like the situation had been resolved. Overall, we found that teens can potentially benefit from lower risk online situations, which allow them to develop crucial interpersonal skills, such as boundary setting, conflict resolution, and empathy. We can also use the dimensions of risk described in this paper to identify potentially harmful risk trajectories before they become high-risk situations. Our end goal is to find a way to empower and protect teens so that they can benefit from online engagement.","title":"Dear Diary: Teens Reflect on Their Weekly Online Risk Experiences","filename":"CHI16/p3919","authors":["Pamela Wisniewski","Heng Xu","Mary Beth Rosson","Daniel F. Perkins","John M. Carroll"],"conference":"CHI '16"}