{"paperId":2858158,"citation":[],"abstract":"Wall-sized displays support group work by allowing several people to work both separately and together. However, whether people interact directly through touch input or indirectly through mouse input can have profound effects on collaboration. We present a study that compares how groups collaborate using either multitouch or multiple mice on a wall-display. Participants used both input methods to work on two tasks: a shared-goal task and a mixed-motive task. Results show differences in participants' awareness in collaborative tasks between the two input methods. The results also help understand the physical constraints touch input set on participants' control of actions in collaborative tasks. We discuss how this influences collaboration. Results also show that touch input did not promote more equal participation than mouse input. We contrast the findings to earlier research on wall-display and tabletop collaboration.","reference":[{"content":"Alec Azad, Jaime Ruiz, Daniel Vogel, Mark Hancock, and Edward Lank. 2012. Territoriality and behaviour on and around large vertical publicly-shared displays. Proceedings of the Designing Interactive Systems Conference, ACM, 468--477. http://doi.org/10.1145/2317956.2318025","paperID":"None"},{"content":"Anastasia Bezerianos and Ravin Balakrishnan. 2005. The vacuum: facilitating the manipulation of distant objects. CHI '05: Proceedings of the SIGCHI conference on Human factors in computing systems, ACM Press, 361--370. http://doi.org/http://doi.acm.org/10.1145/1054972.10550","paperID":"None"},{"content":"Jeremy P Birnholtz, Tovi Grossman, Clarissa Mak, and Ravin Balakrishnan. 2007. An exploratory study of input configuration and group process in a negotiation task using a large display. Proceedings of the SIGCHI conference on Human factors in computing systems: 91--100. http://doi.org/10.1145/1240624.1240638","paperID":"None"},{"content":"Andrew Bragdon, Rob DeLine, Ken Hinckley, and Meredith Ringel Morris. 2011. Code space: touch + air gesture hybrid interactions for supporting developer meetings. Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces, ACM, 212--221. http://doi.org/10.1145/2076354.2076393","paperID":"None"},{"content":"Joan Morris DiMicco, Anna Pandolfo, and Walter Bender. 2004. Influencing Group Participation with a Shared Display. Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work, ACM, 614--623. http://doi.org/10.1145/1031607.1031713","paperID":"None"},{"content":"Andre Doucette, Carl Gutwin, Regan L. Mandryk, Miguel Nacenta, and Sunny Sharma. 2013. Sometimes when We Touch: How Arm Embodiments Change Reaching and Collaboration on Digital Tables. Proceedings of the 2013 Conference on Computer Supported Cooperative Work, ACM, 193--202. http://doi.org/10.1145/2441776.2441799","paperID":"None"},{"content":"Clifton Forlines, Daniel Wigdor, Chia Shen, and Ravin Balakrishnan. 2007. Direct-touch vs. Mouse Input for Tabletop Displays. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 647--656. http://doi.org/10.1145/1240624.1240726","paperID":"None"},{"content":"Carl Gutwin and Saul Greenberg. 2002. A Descriptive Framework of Workspace Awareness for Real-Time Groupware. Comput. Supported Coop. Work 11, 3: 411--446. http://doi.org/http://dx.doi.org/10.1023/A:10212715178","paperID":"None"},{"content":"Chad Harms and Frank Biocca. 2004. Internal Consistency and Reliability of the Networked Minds Measure of Social Presence. Retrieved September 29, 2015 from http://cogprints.org/7026/","paperID":"None"},{"content":"Vicki Ha, Kori M. Inkpen, Tara Whalen, and Regan L. Mandryk. 2006. Direct Intentions: The Effects of Input Devices on Collaboration Around a Tabletop Display. Proceedings of the First IEEE International Workshop on Horizontal Interactive Human-Computer Systems, IEEE Computer Society, 177--184. http://doi.org/10.1109/TABLETOP.2006.10","paperID":"None"},{"content":"Kirstie Hawkey, Melanie Kellar, Derek Reilly, Tara Whalen, and Kori M. Inkpen. 2005. The proximity factor: impact of distance on co-located collaboration. Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work, ACM, 31--40. http://doi.org/http://doi.acm.org/10.1145/1099203.10992 09","paperID":"None"},{"content":"Eva Hornecker, Paul Marshall, Nick Sheep Dalton, and Yvonne Rogers. 2008. Collaboration and interference: awareness with mice or touch input. Proceedings of the 2008 ACM conference on Computer supported cooperative work, ACM, 167--176. http://doi.org/http://doi.acm.org/10.1145/1460563.14605","paperID":"None"},{"content":"Petra Isenberg, Anastasia Bezerianos, Nathalie Henry, Sheelagh Carpendale, and Jean-Daniel Fekete. 2009. CoCoNutTrix: Collaborative Retrofitting for Information Visualization. Computer Graphics and Applications: Special Issue on Collaborative Visualization 29, 5: 44--57.","paperID":"None"},{"content":"Mikkel R. Jakobsen and Kasper Hornbæk. 2014. Up Close and Personal: Collaborative Work on a Highresolution Multitouch Wall Display. ACM Trans. Comput.-Hum. Interact. 21, 2: 11:1--11:34. http://doi.org/10.1145/2576099","paperID":"None"},{"content":"Mikkel R. Jakobsen, Yvonne Jansen, Sebastian Boring, and Kasper Hornbæk. 2015. Should I Stay or Should I Go? Selecting Between Touch and Mid-air Gestures For Large-Display Interaction. Proc. INTERACT 2015, LNCS 9298, Springer, 455--473. http://doi.org/10.1007/978--3--319--22698--9_31","paperID":"None"},{"content":"Tejinder K. Judge, Pardha S. Pyla, D. Scott McCrickard, Steve Harrison, and H. Rex Hartson. 2008. Studying Group Decision Making in Affinity Diagramming. Retrieved March 15, 2013 from http://eprints.cs.vt.edu/archive/00001043/","paperID":"None"},{"content":"Azam Khan, George Fitzmaurice, Don Almeida, Nicolas Burtnyk, and Gordon Kurtenbach. 2004. A remote control interface for large displays. Proceedings of the 17th annual ACM symposium on User interface software and technology, ACM, 127--136. http://doi.org/10.1145/1029632.1029655","paperID":"None"},{"content":"Can Liu, Olivier Chapuis, Michel Beaudouin-Lafon, Eric Lecolinet, and Wendy E. Mackay. 2014. Effects of Display Size and Navigation Type on a Classification Task. Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 4147--4156. http://doi.org/10.1145/2556288.2557020","paperID":"None"},{"content":"Paul Marshall, Rowanne Fleck, Amanda Harris, et al. 2009. Fighting for Control: Children's Embodied Interactions when Using Physical and Digital Representations. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2149--2152. http://doi.org/10.1145/1518701.1519027","paperID":"None"},{"content":"P. Marshall, E. Hornecker, R. Morris, S. Dalton, and Y. Rogers. 2008. When the fingers do the talking: A study of group participation for different kinds of shareable surfaces. Proceedings of TABLETOP '08, IEEE Computer Society, 37--44.","paperID":"None"},{"content":"Joseph E. McGrath. 1984. Groups: Interaction and Performance. Prentice-Hall, Inc., NJ, USA.","paperID":"None"},{"content":"Christian Müller-Tomfelde, Claudia Schremmer, and Anja Wessels. 2007. Exploratory study on concurrent interaction in co-located collaboration. Proceedings of the 19th Australasian conference on Computer-Human Interaction: Entertaining User Interfaces, 175--178. http://doi.org/10.1145/1324892.1324925","paperID":"None"},{"content":"Brad A. Myers, Rishi Bhatnagar, Jeffrey Nichols, et al. 2002. Interacting at a Distance: Measuring the Performance of Laser Pointers and Other Devices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 33--40. http://doi.org/10.1145/503376.503383","paperID":"None"},{"content":"Miguel A. Nacenta, David Pinelle, Dane Stuckel, and Carl Gutwin. 2007. The effects of interaction technique on coordination in tabletop groupware. Proceedings of Graphics Interface 2007, ACM, 191--198. http://doi.org/http://doi.acm.org/10.1145/1268517.12685","paperID":"None"},{"content":"Peter Peltonen, Esko Kurvinen, Antti Salovaara, et al. 2008. It's Mine, Don't Touch!: interactions at a large multi-touch display in a city centre. Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems, ACM, 1285--1294. http://doi.org/http://doi.acm.org/10.1145/1357054.13572","paperID":"None"},{"content":"Brianna Potvin, Colin Swindells, Melanie Tory, and Margaret-Anne Storey. 2012. Comparing Horizontal and Vertical Surfaces for a Collaborative Design Task. Adv. in Hum.-Comp. Int. 2012: 6:6--6:6. http://doi.org/10.1155/2012/137686","paperID":"None"},{"content":"Y. Rogers and S. Lindley. 2004. Collaborating around vertical and horizontal large interactive displays: which way is best? Interacting with Computers 16, 6: 1133--1152. http://doi.org/10.1016/j.intcom.2004.07.008","paperID":"None"},{"content":"Yvonne Rogers, Youn-kyung Lim, William R. Hazlewood, and Paul Marshall. 2009. Equal Opportunities: Do Shareable Interfaces Promote More Group Participation Than Single User Displays? Human-Computer Interaction 24, 1: 79--116.","paperID":"None"},{"content":"Farzan Sasangohar, I. Scott MacKenzie, and Stacey D. Scott. 2009. Evaluation of Mouse and Touch Input for a Tabletop Display Using Fitts' Reciprocal Tapping Task. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 53, 12: 839--843. http://doi.org/10.1177/154193120905301216","paperID":"None"},{"content":"Alexander Schick, Florian van de Camp, Joris Ijsselmuiden, and Rainer Stiefelhagen. 2009. Extending Touch: Towards Interaction with Large-scale Surfaces. Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces, ACM, 117--124. http://doi.org/10.1145/1731903.1731927","paperID":"None"},{"content":"Stacey D. Scott, M. Sheelagh, T. Carpendale, and Kori M. Inkpen. 2004. Territoriality in collaborative tabletop workspaces. Proceedings of the 2004 ACM conference on Computer supported cooperative work, ACM, 294--303. http://doi.org/http://doi.acm.org/10.1145/1031607.10316","paperID":"None"},{"content":"Daniel Vogel and Ravin Balakrishnan. 2005. Distant Freehand Pointing and Clicking on Very Large, High Resolution Displays. Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology, ACM, 33--42. http://doi.org/10.1145/1095034.1095041","paperID":"None"},{"content":"Diane Watson, Mark Hancock, Regan L. Mandryk, and Max Birk. 2013. Deconstructing the Touch Experience. Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces, ACM, 199--208. http://doi.org/10.1145/2512349.2512819","paperID":"None"},{"content":"Nicola Yuill and Yvonne Rogers. 2012. Mechanisms for collaboration: A design and evaluation framework for multi-user interfaces. ACM Trans. Comput.-Hum. Interact. 19, 1: 1:1--1:25. http://doi.org/10.1145/2147783.2147784","paperID":"None"}],"title":"Negotiating for Space?: Collaborative Work Using a Wall Display with Mouse and Touch Input","filename":"CHI16/p2050","authors":["Mikkel R. Jakobsen","Kasper Hornbæk"],"conference":"CHI '16"}