{"paperId":"2858269","reference":[{"content":"Derek Bailey. 1993. Improvisation: It's Nature and Practice in Music. Da Capo, Cambridge, MA.","paperID":"None"},{"content":"David Borgo. 2005. Sync or Swarm: Improvising Music in a Complex Age. Continuum, NY, NY, USA.","paperID":"None"},{"content":"James V. Bradley. 1958. Complete Counterbalancing of Immediate Sequential Effects in a Latin Square Design. J. Amer. Statist. Assoc. 53, 282 (1958), 525--528. DOI: http://dx.doi.org/10.1080/01621459.1958.10501456","paperID":"None"},{"content":"Nick Bryan-Kinns. 2004. Daisyphone: The Design and Impact of a Novel Environment for Remote Group Music Improvisation. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '04). ACM, NY, NY, USA, 135--144. DOI: http://dx.doi.org/10.1145/1013115.1013135","paperID":"None"},{"content":"Nick Bryan-Kinns and Fraser Hamilton. 2012. Identifying Mutual Engagement. Behaviour & Information Technology 31, 2 (2012), 101--125. DOI: http://dx.doi.org/10.1080/01449290903377103","paperID":"None"},{"content":"William L. Cahn. 2005. Creative Music Making. Routledge, NY, NY.","paperID":"None"},{"content":"Arne Eigenfeldt and Ajay Kapur. 2008. An Agent-based System for Robotic Musical Performance. In Proceedings of the International Conference on New Interfaces for Musical Expression. Genoa, Italy, 144--149. http://www.nime.org/proceedings/2008/nime2008_144.pdf","paperID":"None"},{"content":"Jacob Eisenberg and William Forde Thompson. 2003. A Matter of Taste: Evaluating Improvised Music. Creativity Research Journal 15, 2--3 (2003), 287--296. DOI: http://dx.doi.org/10.1080/10400419.2003.9651421","paperID":"None"},{"content":"Rebecca Fiebrink, Perry R. Cook, and Dan Trueman. 2011. Human Model Evaluation in Interactive Supervised Learning. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 147--156. DOI: http://dx.doi.org/10.1145/1978942.1978965","paperID":"None"},{"content":"Lalya Gaye, Lars Erik Holmquist, Frauke Behrendt, and Atau Tanaka. 2006. Mobile Music Technology: Report on an Emerging Community. In Proceedings of the 2006 Conference on New Interfaces for Musical Expression (NIME '06). IRCAM & Centre Pompidou, Paris, France, 22--25. http://dl.acm.org/citation.cfm?id=1142215.1142219","paperID":"None"},{"content":"Michael Gurevich, Adnan Marquez-Borbon, and Paul Stapleton. 2012. Playing with Constraints: Stylistic Variation with a Simple Electronic Instrument. Computer Music Journal 36, 1 (2012), 23--41. DOI: http://dx.doi.org/10.1162/COMJ_a_00103","paperID":"None"},{"content":"Eric Horvitz. 1999. Principles of Mixed-Initiative User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 159--166. DOI: http://dx.doi.org/10.1145/302979.303030","paperID":"None"},{"content":"Mark Jenkins. 2012. iPad Music: In the Studio and on Stage. Taylor & Francis, Burlington, MA, USA.","paperID":"None"},{"content":"Sergi Jordà. 2010. The Reactable: Tangible and Tabletop Music Performance. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, NY, NY, USA, 2989--2994. DOI: http://dx.doi.org/10.1145/1753846.1753903","paperID":"None"},{"content":"Matthew Kay and Jacob O. Wobbrock. 2015. ARTool: Aligned Rank Transform for Nonparametric Factorial ANOVAs. R package version 0.9.5. Available online at https://github.com/mjskay/ARTool. (2015).","paperID":"None"},{"content":"Korg Inc. 2011. Korg WIST SDK: Wireless Sync-Start Technology for iOS Music Apps. https://code.google.com/p/korg-wist-sdk/. (2011).","paperID":"None"},{"content":"Sang Won Lee, Jason Freeman, and Andrew Collela. 2012. Real-Time Music Notation, Collaborative Improvisation, and Laptop Ensembles. In Proceedings of the International Conference on New Interfaces for Musical Expression. University of MI, Ann Arbor, MI. http://www.nime.org/proceedings/2012/nime2012_62.pdf","paperID":"None"},{"content":"Aengus Martin, Craig T. Jin, and Oliver Bown. 2011. A Toolkit for Designing Interactive Musical Agents. In Proceedings of the 23rd Australian Computer-Human Interaction Conference (OzCHI '11). ACM, NY, NY, USA, 194--197. DOI: http://dx.doi.org/10.1145/2071536.2071567","paperID":"None"},{"content":"Charles Martin, Henry Gardner, and Ben Swift. 2014. Exploring Percussive Gesture on iPads with Ensemble Metatone. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1025--1028. DOI: http://dx.doi.org/10.1145/2556288.2557226","paperID":"None"},{"content":"Charles Martin, Henry Gardner, and Ben Swift. 2015a. Tracking Ensemble Performance on Touch-Screens with Gesture Classification and Transition Matrices. In Proceedings of the International Conference on New Interfaces for Musical Expression, Edgar Berdahl and Jesse Allison (Eds.). Louisiana State University, Baton Rouge, Louisiana, USA, 359--364. http://www.nime.org/proceedings/2015/nime2015_242.pdf","paperID":"None"},{"content":"Charles Martin, Henry Gardner, Ben Swift, and Michael Martin. 2015b. Music of 18 Performances: Evaluating Apps and Agents with Free Improvisation. In Proceedings of the 2015 Conference of the Australasian Computer Music Association, Ian Stevenson (Ed.). Australasian Computer Music Association, Fitzroy, Australia, 85--94. http://hdl.handle.net/1885/95205","paperID":"None"},{"content":"Guerino Mazzola and Paul B. Cherlin. 2009. Flow, Gesture, and Spaces in Free Jazz. Springer, Berlin, Germany.","paperID":"None"},{"content":"MIDI Manufacturers Association. 1996. The Complete MIDI 1.0 Detailed Specification: Incorporating All Recommended Practices. MIDI Manufacturers Association, La Habra, California, USA.","paperID":"None"},{"content":"Jieun Oh, Jorge Herrera, Nicholas J. Bryan, Luke Dahl, and Ge Wang. 2010. Evolving the Mobile Phone Orchestra. In Proceedings of the International Conference on New Interfaces for Musical Expression. University of Technology Sydney, Sydney, Australia, 82--87. http://www.nime.org/proceedings/2010/nime2010_082.pdf","paperID":"None"},{"content":"Sile O'Modhrain. 2011. A Framework for the Evaluation of Digital Musical Instruments. Computer Music Journal 35, 1 (2011), 28--42. DOI: http://dx.doi.org/10.1162/COMJ_a_00038","paperID":"None"},{"content":"Ivan Poupyrev, Michael J. Lyons, Sidney Fels, and Tina Blaine (Bean). 2001. New Interfaces for Musical Expression. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, NY, NY, USA, 491--492. DOI: http://dx.doi.org/10.1145/634067.634348","paperID":"None"},{"content":"Jeff Pressing. 1988. Improvisation: Methods and Models. In Generative Processes in Music, John Sloboda (Ed.). Oxford University Press, Oxford, UK. DOI: http://dx.doi.org/10.1093/acprof:oso/9780198508465.003.0007","paperID":"None"},{"content":"Jeff Pressing. 1990. Cybernetic Issues in Interactive Performance Systems. Computer Music Journal 14, 1 (1990), pp. 12--25. DOI: http://dx.doi.org/10.2307/3680113","paperID":"None"},{"content":"Muhammad Hafiz Wan Rosli, Karl Yerkes, Matthew Wright, Timothy Wood, Hannah Wolfe, Charlie Roberts, Anis Haron, and Fernando Rincon Estrada. 2015. Ensemble Feedback Instruments. In Proceedings of the International Conference on New Interfaces for Musical Expression, Edgar Berdahl and Jesse Allison (Eds.). Louisiana State University, Baton Rouge, Louisiana, USA, 144--149. http://www.nime.org/proceedings/2015/nime2015_329.pdf","paperID":"None"},{"content":"R. Keith Sawyer. 2006. Group Creativity: Musical Performance and Collaboration. Psychology of Music 34, 2 (2006), 148--165. DOI: http://dx.doi.org/10.1177/0305735606061850","paperID":"None"},{"content":"Ben Shneiderman. 2007. Creativity Support Tools: Accelerating Discovery and Innovation. Commun. ACM 50, 12 (Dec. 2007), 20--32. DOI: http://dx.doi.org/10.1145/1323688.1323689","paperID":"None"},{"content":"Ben Shneiderman and Pattie Maes. 1997. Direct Manipulation vs. Interface Agents. Interactions 4, 6 (Nov. 1997), 42--61. DOI: http://dx.doi.org/10.1145/267505.267514","paperID":"None"},{"content":"Scott Smallwood, Dan Trueman, Perry R. Cook, and Ge Wang. 2008. Composing for Laptop Orchestra. Computer Music Journal 32, 1 (2008), pp. 9--25. DOI: http://dx.doi.org/10.1162/comj.2008.32.1.9","paperID":"None"},{"content":"Derek T. Smith. 2009. Development and Validation of a Rating Scale for Wind Jazz Improvisation Performance. Journal of Research in Music Education 57, 3 (2009), 217--235. DOI: http://dx.doi.org/10.1177/0022429409343549","paperID":"None"},{"content":"Harald Stenström. 2009. Free Ensemble Improvisation. Number 13 in ArtMonitor. Konstnärliga fakultetskansliet, University of Gothenburg, Gothenburg, Sweden. http://hdl.handle.net/2077/20293","paperID":"None"},{"content":"Dan Stowell, Andrew Robertson, Nick Bryan-Kinns, and Mark D. Plumbley. 2009. Evaluation of Live Human-computer Music-Making: Quantitative and Qualitative Approaches. Int. J. Hum.-Comput. Stud. 67, 11 (Nov. 2009), 960--975. DOI: http://dx.doi.org/10.1016/j.ijhcs.2009.05.007","paperID":"None"},{"content":"Atau Tanaka. 2010. Mapping Out Instruments, Affordances, and Mobiles. In Proceedings of the International Conference on New Interfaces for Musical Expression, Kirsty Beilharz, Andrew Johnston, Sam Ferguson, and Amy Yi-Chun Chen (Eds.). University of Technology Sydney, Sydney, Australia, 88--93. http://www.nime.org/proceedings/2010/nime2010_088.pdf","paperID":"None"},{"content":"Dan Trueman. 2007. Why a Laptop Orchestra? Organised Sound 12 (2007), 171--179. Issue 2. DOI: http://dx.doi.org/10.1017/S135577180700180X","paperID":"None"},{"content":"Sebastian Trump and Jamie Bullock. 2014. Orphion: A Gestural Multi-Touch Instrument for the iPad. In Proceedings of the International Conference on New Interfaces for Musical Expression. Goldsmiths, University of London, London, United Kingdom, 159--162. http://www.nime.org/proceedings/2014/nime2014_277.pdf","paperID":"None"},{"content":"Marcelo Mortensen Wanderley and Nicola Orio. 2002. Evaluation of Input Devices for Musical Expression: Borrowing Tools from HCI. Computer Music Journal 26, 3 (2002), 62--76. DOI: http://dx.doi.org/10.1162/014892602320582981","paperID":"None"},{"content":"Ge Wang. 2014. Ocarina: Designing the iPhone's Magic Flute. Computer Music Journal 38, 2 (2014), 8--21. DOI: http://dx.doi.org/10.1162/COMJ_a_00236","paperID":"None"},{"content":"Ge Wang, Georg Essl, and Henri Penttinen. 2008. Do Mobile Phones Dream of Electric Orchestras?. In Routes/Roots: Proceedings of the International Computer Music Conference. MPublishing, University of MI Library, Ann Arbor, MI. http://hdl.handle.net/2027/spo.bbp2372.2008.039","paperID":"None"},{"content":"Ge Wang, Jieun Oh, and Tom Lieber. 2011. Designing for the iPad : Magic Fiddle. In Proceedings of the International Conference on New Interfaces for Musical Expression. Oslo, Norway, 197--202. http://www.nime.org/proceedings/2011/nime2011_197.pdf","paperID":"None"},{"content":"David A. Williams. 2014. Another Perspective: The iPad Is a REAL Musical Instrument. Music Educators Journal 101, 1 (2014), 93--98. DOI: http://dx.doi.org/10.1177/0027432114540476","paperID":"None"},{"content":"Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only ANOVA Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 143--146. DOI: http://dx.doi.org/10.1145/1978942.1978963","paperID":"None"},{"content":"Anna Xambó, Eva Hornecker, Paul Marshall, Sergi Jordà, Chris Dobbyn, and Robin Laney. 2013. Let's Jam the Reactable: Peer Learning During Musical Improvisation with a Tabletop Tangible Interface. ACM Trans. Comput.-Hum. Interact. 20, 6, Article 36 (Dec. 2013), 34 pages. DOI: http://dx.doi.org/10.1145/2530541","paperID":"None"}],"citation":[],"abstract":"We present the results of two controlled studies of free-improvised ensemble music-making on touch-screens. In our system, updates to an interface of harmonically-selected pitches are broadcast to every touch-screen in response to either a performer pressing a GUI button, or to interventions from an intelligent agent. In our first study, analysis of survey results and performance data indicated significant effects of the button on performer preference, but of the agent on performance length. In the second follow-up study, a mixed-initiative interface, where the presence of the button was interlaced with agent interventions, was developed to leverage both approaches. Comparison of this mixed-initiative interface with the always-on button-plus-agent condition of the first study demonstrated significant preferences for the former. The different approaches were found to shape the creative interactions that take place. Overall, this research offers evidence that an intelligent agent and a networked GUI both improve aspects of improvised ensemble music-making.","title":"Intelligent Agents and Networked Buttons Improve Free-Improvised Ensemble Music-Making on Touch-Screens","filename":"CHI16/p2295","authors":["Charles Martin","Henry Gardner","Ben Swift","Michael Martin"],"conference":"CHI '16"}