{"paperId":2858453,"citation":[],"abstract":"It has been argued that transparent displays are beneficial for certain tasks by allowing users to simultaneously see on-screen content as well as the environment behind the display. However, it is yet unclear how much in background awareness users gain and if performance suffers for tasks performed on the transparent display, since users are no longer shielded from distractions. Therefore, we investigate the influence of display transparency on task performance and background awareness in a dual-task scenario. We conducted an experiment comparing transparent displays with conventional displays in different horizontal and vertical configurations. Participants performed an attention-demanding primary task on the display while simultaneously observing the background for target stimuli. Our results show that transparent and horizontal displays increase the ability of participants to observe the background while keeping primary task performance constant.","reference":[{"content":"Lyn Bartram, Colin Ware, and Tom Calvert. 2003. Moticons: Detection, Distraction and Task. Int. J. Hum.-Comput. Stud. 58, 5 (May 2003), 515--545. DOI: http://dx.doi.org/10.1016/S1071--5819(03)00021--1","paperID":"None"},{"content":"Jeremy Birnholtz, Lindsay Reynolds, Eli Luxenberg, Carl Gutwin, and Maryam Mustafa. 2010. Awareness Beyond the Desktop: Exploring Attention and Distraction with a Projected Peripheral-vision Display. In Proceedings of Graphics Interface 2010 (GI '10). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 55--62. http://dl.acm.org/citation.cfm?id=1839214.1839225","paperID":"None"},{"content":"Matthew Brehmer, Joanna McGrenere, Charlotte Tang, and Claudia Jacova. 2012. Investigating Interruptions in the Context of Computerised Cognitive Testing for Older Adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2649--2658. DOI: http://dx.doi.org/10.1145/2207676.2208656","paperID":"None"},{"content":"Mary Czerwinski, Greg Smith, Tim Regan, Brian Meyers, George Robertson, and Gary Starkweather. 2003. Toward characterizing the productivity benefits of very large displays. In (2003) Interact 2003. IOS Press. http://research.microsoft.com/apps/pubs/default.aspx?id=64317","paperID":"None"},{"content":"Andrew Dillon, Lisa Kleinman, Gil Ok Choi, and Randolph Bias. 2006. Visual Search and Reading Tasks Using ClearType and Regular Displays: Two Experiments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 503--511. DOI: http://dx.doi.org/10.1145/1124772.1124849","paperID":"None"},{"content":"Clifton Forlines, Chia Shen, Daniel Wigdor, and Ravin Balakrishnan. 2006. Exploring the Effects of Group Size and Display Configuration on Visual Search. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (CSCW '06). http://doi.acm.org/10.1145/1180875.1180878","paperID":"None"},{"content":"David Grimes, Desney S. Tan, Scott E. Hudson, Pradeep Shenoy, and Rajesh P.N. Rao. 2008. Feasibility and Pragmatics of Classifying Working Memory Load with an Electroencephalograph. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 835--844. DOI: http://dx.doi.org/10.1145/1357054.1357187","paperID":"None"},{"content":"Carl Gutwin and Saul Greenberg. 2002. A Descriptive Framework of Workspace Awareness for Real-Time Groupware. Comput. Supported Coop. Work 11, 3 (Nov. 2002), 411--446. DOI: http://dx.doi.org/10.1023/A:1021271517844","paperID":"None"},{"content":"Doris Hausen, Hendrik Richter, Adalie Hemme, and Andreas Butz. 2013. Comparing Input Modalities for Peripheral Interaction: A Case Study on Peripheral Music Control. In Human-Computer Interaction INTERACT 2013. Lecture Notes in Computer Science, Vol. 8119. Springer Berlin Heidelberg, 162--179. DOI: http://dx.doi.org/10.1007/978--3--642--40477--1_10","paperID":"None"},{"content":"Heejeong Heo, Seungki Kim, Hyungkun Park, Jeeyong Chung, Geehyuk Lee, and Woohun Lee. 2013. TransWall. In ACM SIGGRAPH 2013 Emerging Technologies (SIGGRAPH '13). ACM, NY, NY, USA, Article 14, 1 pages. DOI: http://dx.doi.org/10.1145/2503368.2503382","paperID":"None"},{"content":"Masahito Hirakawa and Satoshi Koike. 2004. A Collaborative Augmented Reality System using Transparent Display. In Proceedings of the International Symposium on Multimedia Software Engineering (ISMSE '04). DOI: http://dx.doi.org/10.1109/MMSE.2004.2","paperID":"None"},{"content":"Junko Ichino, Kazuo Isoda, Ayako Hanai, and Tetsuya Ueda. 2013. Effects of the Display Angle in Museums on User's Cognition, Behavior, and Subjective Responses. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). DOI: http://dx.doi.org/10.1145/2470654.2481413","paperID":"None"},{"content":"Kori Inkpen, Kirstie Hawkey, Melanie Kellar, Regan Mandryk, Karen Parker, Derek Reilly, Stacey Scott, and Tara Whalen. 2015. Exploring Display Factors that Influence Co-Located Collaboration: Angle, Size, Number, and User Arrangement. In Proceedings HCI International 2005 (HCII '13).","paperID":"None"},{"content":"Hiroshi Ishii and Minoru Kobayashi. 1992. ClearBoard: A Seamless Medium for Shared Drawing and Conversation with Eye Contact. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, NY, NY, USA, 525--532. DOI: http://dx.doi.org/10.1145/142750.142977","paperID":"None"},{"content":"Denis Lalanne and Agnes Lisowska Masson. 2011. A Fitt of Distraction: Measuring the Impact of Distracters and Multi-users on Pointing Efficiency. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 2125--2130. DOI: http://dx.doi.org/10.1145/1979742.1979908","paperID":"None"},{"content":"Nilli Lavie. 2005. Distracted and confused?: Selective attention under load. Trends in Cognitive Sciences 9, 2 (2005).","paperID":"None"},{"content":"Hyunjae Lee, Sangyoung Cho, Jiwoo Hong, Geehyuk Lee, and Woohun Lee. 2014. JANUS. In ACM SIGGRAPH 2014 Emerging Technologies (SIGGRAPH '14). ACM, NY, NY, USA, Article 15, 1 pages. DOI: http://dx.doi.org/10.1145/2614066.2614098","paperID":"None"},{"content":"Alex Leykin and Mihran Tuceryan. 2004. Automatic Determination of Text Readability over Textured Backgrounds for Augmented Reality Systems. In Proceedings of the 3rd IEEE/ACM International Symposium on Mixed and Augmented Reality (ISMAR '04). IEEE Computer Society, Washington, DC, USA, 224--230. DOI: http://dx.doi.org/10.1109/ISMAR.2004.22","paperID":"None"},{"content":"Jiannan Li, Saul Greenberg, and Ehud Sharlin. 2014a. Enhancing Workspace Awareness on Collaborative Transparent Displays. Research report 2014--1065--16, Department of Computer Science, University of Calgary, Calgary, Alberta, Canada. (October 2014).","paperID":"None"},{"content":"Jiannan Li, Saul Greenberg, Ehud Sharlin, and Joaquim Jorge. 2014b. Interactive Two-sided Transparent Displays: Designing for Collaboration. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA, 395--404. DOI: http://dx.doi.org/10.1145/2598510.2598518","paperID":"None"},{"content":"David Lindlbauer, Toru Aoki, Anita Höchtl, Yuji Uema, Michael Haller, Masahiko Inami, and Jörg Müller. 2014a. A Collaborative See-through Display Supporting On-demand Privacy. In ACM SIGGRAPH 2014 Emerging Technologies (SIGGRAPH '14). ACM, NY, NY, USA, Article 1, 1 pages. DOI: http://dx.doi.org/10.1145/2614066.2614095","paperID":"None"},{"content":"David Lindlbauer, Toru Aoki, Robert Walter, Yuji Uema, Anita Höchtl, Michael Haller, Masahiko Inami, and Jörg Müller. 2014b. Tracs: Transparency-control for See-through Displays. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 657--661. DOI: http://dx.doi.org/10.1145/2642918.2647350","paperID":"None"},{"content":"Can Liu, Olivier Chapuis, Michel Beaudouin-Lafon, Eric Lecolinet, and Wendy E. Mackay. 2014. Effects of Display Size and Navigation Type on a Classification Task. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). DOI: http://dx.doi.org/10.1145/2556288.2557020","paperID":"None"},{"content":"Paul P. Maglio and Christopher S. Campbell. 2000. Tradeoffs in Displaying Peripheral Information. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, NY, NY, USA, 241--248. DOI: http://dx.doi.org/10.1145/332040.332438","paperID":"None"},{"content":"Vidhya Navalpakkam, Justin Rao, and Malcolm Slaney. 2011. Using Gaze Patterns to Study and Predict Reading Struggles Due to Distraction. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 1705--1710. DOI: http://dx.doi.org/10.1145/1979742.1979832","paperID":"None"},{"content":"Alex Olwal, Stephen DiVerdi, Nicola Candussi, Ismo Rakkolainen, and Tobias Höllerer. In Virtual Reality Conference (VR'06). DOI: http://dx.doi.org/10.1109/VR.2006.25","paperID":"None"},{"content":"Alex Olwal, Stephen DiVerdi, Ismo Rakkolainen, and Tobias Höllerer. 2007. Consigalo: Multi-user Face-to-face Interaction on Immaterial Displays. In Proceedings of the International Conference on INtelligent TEchnologies for Interactive enterTAINment (INTETAIN '08). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, Brussels, Belgium, Belgium, Article 8, 9 pages. http://dl.acm.org/citation.cfm?id=1363200.1363211","paperID":"None"},{"content":"Kathrin Probst, David Lindlbauer, Michael Haller, Bernhard Schwartz, and Andreas Schrempf. 2014. A Chair As Ubiquitous Input Device: Exploring Semaphoric Chair Gestures for Focused and Peripheral Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 4097--4106. DOI: http://dx.doi.org/10.1145/2556288.2557051","paperID":"None"},{"content":"Umar Rashid, Miguel A. Nacenta, and Aaron Quigley. 2012. Factors Influencing Visual Attention Switch in Multi-display User Interfaces: A Survey. In Proceedings of the 2012 International Symposium on Pervasive Displays (PerDis '12). ACM, NY, NY, USA, Article 1, 6 pages. DOI: http://dx.doi.org/10.1145/2307798.2307799","paperID":"None"},{"content":"Adrian Reetz and Carl Gutwin. 2014. Making Big Gestures: Effects of Gesture Size on Observability and Identification for Co-located Group Awareness. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 4087--4096. DOI: http://dx.doi.org/10.1145/2556288.2557219","paperID":"None"},{"content":"Xiaobin Shen. 2007. An Evaluation Methodology for Ambient Displays. Journal of Engineering, Computing and Architecture 1 (2007). Issue 2.","paperID":"None"},{"content":"Srikanth Kirshnamachari Sridharan, Juan David Hincapié-Ramos, David R. Flatla, and Pourang Irani. 2013. Color Correction for Optical See-through Displays Using Display Color Profiles. In Proceedings of the 19th ACM Symposium on Virtual Reality Software and Technology (VRST '13). ACM, NY, NY, USA, 231--240. DOI: http://dx.doi.org/10.1145/2503713.2503716","paperID":"None"},{"content":"Kishore Swaminathan and Steve Sato. 1997. Interaction Design for Large Displays. interactions 4, 1 (Jan. 1997), 15--24. DOI: http://dx.doi.org/10.1145/242388.242395","paperID":"None"},{"content":"Desney S. Tan and Mary Czerwinski. Effects of Visual Separation and Physical Discontinuities when Distributing Information across Multiple Displays. In Proceedings of the Annual Conference of CHISIG, the Computer Human Interaction Special Interest Group of the Ergonomics Society of Australia (OZCHI 2003).","paperID":"None"},{"content":"John C. Tang and Scott Minneman. 1991. VideoWhiteboard: Video Shadows to Support Remote Collaboration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '91). ACM, NY, NY, USA, 315--322. DOI: http://dx.doi.org/10.1145/108844.108932","paperID":"None"},{"content":"John C. Tang and Scott L. Minneman. 1990. VideoDraw: A Video Interface for Collaborative Drawing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '90). ACM, NY, NY, USA, 313--320. DOI: http://dx.doi.org/10.1145/97243.97302","paperID":"None"},{"content":"Richard A. Tyrrell and Herschel W. Leibowitz. 1990. The relation of vergence effort to report of visual fatigue following prolonged near work. Human Factors 32, 3 (1990). DOI: http://dx.doi.org/doi:10.1177/001872089003200307","paperID":"None"}],"title":"Influence of Display Transparency on Background Awareness and Task Performance","filename":"CHI16/p1705","authors":["David Lindlbauer","Klemen Lilija","Robert Walter","Jörg Müller"],"conference":"CHI '16"}