{"paperId":2858360,"citation":[],"reference":[{"content":"Jacob Anhøj and Claus Møldrup. (2004). Feasibility of Collecting Diary Data from Asthma Patients through Mobile Phones and SMS (Short Message Service): Response Rate Analysis and Focus Group Evaluation from a Pilot Study. Journal of Medical Internet Research, 6(4), e42. http://doi.org/dfvrrg","paperID":"None"},{"content":"Nikola Banovic, Christina Brant, Jennifer Mankoff, and Anind K. Dey. (2014). ProactiveTasks: The Short of Mobile Device Use Sessions. Proceedings of the International Conference on Human-Computer Interaction with Mobile Devices & Services (MobileHCI 2014), 243-252. http://doi.org/bbn9","paperID":"None"},{"content":"Lisa Feldman Barrett and Daniel J. Barrett. (2001). An Introduction to Computerized Experience Sampling in Psychology. Social Science Computer Review, 19(2), 175-185. http://doi.org/d4tqhc","paperID":"None"},{"content":"J.S. Beck and A.T. Beck. (2011). Cognitive Behavior Therapy: Basics and Beyond. Guilford Press.","paperID":"None"},{"content":"Frank Bentley and Konrad Tollmar. (2013). The Power of Mobile Notifications to Increase Wellbeing Logging Behavior. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2013), 1095-1098. http://doi.org/f2zs59","paperID":"None"},{"content":"Lora E. Burke, Jing Wang, and Mary Ann Sevick. (2011). Self-Monitoring in Weight Loss: A Systematic Review of the Literature. Journal of the American Dietetic Association, 111(1), 92-102. http://doi.org/ct2ph2","paperID":"None"},{"content":"Scott Carter, Jennifer Mankoff, and Jeffrey Heer. (2007). Momento: Support for Situated Ubicomp Experimentation. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2007), 125-134. http://doi.org/d69b3v","paperID":"None"},{"content":"Scott Carter and Jennifer Mankoff. (2005). When Participants do the Capturing: The Role of Media in Diary Studies. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI (2005), 899-908. http://doi.org/dqfsph","paperID":"None"},{"content":"Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, and Julie A. Kientz. (2015). SleepTight: Low-Burden, Self-Monitoring Technology for Capturing and Reflecting on Sleep Behaviors. Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp 2015), 121-132. http://doi.org/bbpb","paperID":"None"},{"content":"Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. (2014). Understanding Quantified-Selfers' Practices in Collecting and Exploring Personal Data. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI 2014), 1143-1152. http://doi.org/bbpd","paperID":"None"},{"content":"Karen Church, Mauro Cherubini, and Nuria Oliver. (2014). A Large-Scale Study of Daily Information Needs Captured In Situ. ACM Transactions on Computer-Human Interaction, 21(2). http://doi.org/bbpf","paperID":"None"},{"content":"Sunny Consolvo, Predrag Klasnja, David W. McDonald, Daniel Avrahami, Jon E. Froehlich, Louis LeGrand, Ryan Libby, Keith Mosher, and James A. Landay. (2008). Flowers or a Robot Army?: Encouraging Awareness & Activity with Personal, Mobile Displays. Proceedings of the International Conference on Ubiquitous Computing (UbiComp 2008), 54-63. http://doi.org/dk9hqb","paperID":"None"},{"content":"Sunny Consolvo, Ian E. Smith, Tara Matthews, Anthony LaMarca, Jason Tabert, and Pauline Powledge. (2005). Location Disclosure to Social Relations: Why, When, & What People Want to Share. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2005), 81-90. http://doi.org/dk5d5v","paperID":"None"},{"content":"Sunny Consolvo and Miriam Walker. (2003). Using the Experience Sampling Method to Evaluate Ubicomp Applications. IEEE Pervasive Computing, 2(2), 24-31. http://doi.org/cmbg6h","paperID":"None"},{"content":"Mihaly Csikszentmihalyi and Reed Larson. (1987). Validity and Reliability of the Experience-Sampling Method. The Journal of Nervous and Mental Disease, 175(9), 526-536. http://doi.org/bwb7km","paperID":"None"},{"content":"Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. (2015). A Lived Informatics Model of Personal Informatics. Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp 2015), 731-742. http://doi.acm.org/10.1145/2750858.2804250","paperID":"None"},{"content":"James Fogarty, Scott E. Hudson, Christopher G. Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny C. Lee, and Jie Yang. (2005). Predicting Human Interruptibility with Sensors. ACM Transactions on Computer-Human Interaction, 12(1), 119-146. http://doi.org/fpqwt3","paperID":"None"},{"content":"Thomas Fritz, Elaine M. Huang, Gail C. Murphy, and Thomas Zimmermann. (2014). Persuasive Technology in the Real World: A Study of Long-Term Use of Activity Sensing Devices for Fitness. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI 2014), 487-496. http://doi.org/bbdv","paperID":"None"},{"content":"Jon E. Froehlich, Mike Y. Chen, Sunny Consolvo, Beverly L. Harrison, and James A. Landay. (2007). MyExperience: A System for In Situ Tracing and Capturing of User Feedback on Mobile Phones. Proceedings of the International Conference on Mobile Systems, Applications and Services (Mobisys 2007), 57-70. http://doi.org/c8smx6","paperID":"None"},{"content":"Jon E. Froehlich, Mike Y. Chen, Ian E. Smith, and Fred Potter. (2006). Voting with your Feet: An Investigative Study of the Relationship Between Place Visit Behavior and Preference. Proceedings of the International Conference on Ubiquitous Computing (UbiComp 2006), 333-350. http://doi.org/dw2bxj","paperID":"None"},{"content":"Eric Granholm, Catherine Loh, and Joel Swendsen. (2008). Feasibility and Validity of Computerized Ecological Momentary Assessment in Schizophrenia. Schizophrenia Bulletin, 34(3), 507-14. http://doi.org/bb5ch2","paperID":"None"},{"content":"Eric Hoddes, Vincent Zarcone, and William Dement. (1972). Development and Use of Stanford Sleepiness Scale. Psychophysiology, 9(1), 150.","paperID":"None"},{"content":"Stefan E Hormuth. (1986). The Sampling of Experiences In Situ. Journal of Personality, 54(1), 262-293. http://doi.org/fr7bs4","paperID":"None"},{"content":"James M. Hudson, Jim Christensen, Wendy A. Kellogg, and Thomas Erickson. (2002). \"I'd be overwhelmed, but it's just one more thing to do\": Availability and Interruption in Research Management. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2002), 97-104. http://doi.org/dq59k7","paperID":"None"},{"content":"Stephen S. Intille, Emmanuel Munguia Tapia, John Rondoni, Jennifer Beaudin, Chuck Kukla, Sitij Agarwal, Ling Bao, and Kent Larson. (2003). Tools for Studying Behavior and Technology in Natural Settings. Proceedings of the International Conference on Ubiquitous Computing (UbiComp 2003), 157-174. http://doi.org/dghjhz","paperID":"None"},{"content":"Ashish Kapoor and Eric Horvitz. (2008). Experience Sampling for Building Predictive User Models: A Comparative Study. Proceeding of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2008), 657-666. http://doi.org/d6sr59","paperID":"None"},{"content":"Predrag Klasnja, Beverly L. Harrison, Louis LeGrand, Anthony LaMarca, Jon E. Froehlich, and Scott E. Hudson. (2008). Using Wearable Sensors and Real Time Inference to Understand Human Recall of Routine Activities. Proceedings of the International Conference on Ubiquitous Computing (UbiComp 2008), 154-163. http://doi.org/fwkjv6","paperID":"None"},{"content":"Predrag Klasnja and Wanda Pratt. (2012). Healthcare in the Pocket: Mapping the Space of Mobile-Phone Health Interventions. Journal of Biomedical Informatics, 45(1), 184-198. http://doi.org/c8t7t9","paperID":"None"},{"content":"William J. Korotitsch and Rosemery O. Nelson-Gray. (1999). An Overview of Self-Monitoring Research in Assessment and Treatment. Psychological Assessment, 11(4), 415-425. http://doi.org/fs8szw","paperID":"None"},{"content":"Neal Lathia, Kiran K. Rachuri, Cecilia Mascolo, and Peter J. Rentfrow. (2013). Contextual Dissonance: Design Bias in Sensor-Based Experience Sampling Methods. Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp 2013), ACM Press, 183-192. http://doi.org/bbpg","paperID":"None"},{"content":"C.W. Lejuez, Derek R. Hopko, Ron Acierno, Stacey B. Daughters, and Sherry L. Pagoto. (2011). Ten Year Revision of the Brief Behavioral Activation Treatment for Depression: Revised Treatment Manual. Behavior Modification, 35(2), 111-161. http://doi.org/d2cgds","paperID":"None"},{"content":"Ian Li, Anind K. Dey, and Jodi Forlizzi. (2010). A Stage-Based Model of Personal Informatics Systems. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI 2010)., 557-566. http://doi.org/bh8zsb","paperID":"None"},{"content":"C.R. Martell, S. Dimidijian, and R. Herman-Dunn. (2013). Behavioral Activation for Depression: A Clinician's Guide. Guilford Press.","paperID":"None"},{"content":"Leysia Palen and Marilyn Salzman. (2002). Voice-Mail Diary Studies for Naturalistic Data Capture Under Mobile Conditions. Proceedings of the ACM Conference on Computer Supported Cooperative Work (CSCW 2002), 87-95. http://doi.org/drg82q","paperID":"None"},{"content":"Martin Pielot, Tilman Dingler, Jose San Pedro, and Nuria Oliver. (2015). When Attention is Not Scarce Detecting Boredom from Mobile Phone Usage. Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp 2015), 825-836. http://doi.acm.org/10.1145/2750858.2804252","paperID":"None"},{"content":"John Rieman. (1993). The Diary Study: A WorkplaceOriented Research Tool to Guide Laboratory Efforts. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 1993), 321-326. http://doi.org/cxn7sw","paperID":"None"},{"content":"John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. (2014). Personal Tracking as Lived Informatics. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI 2014), 1163-1172. http://doi.org/bbdz","paperID":"None"},{"content":"Stephanie Rosenthal, Anind K. Dey, and Manuela Veloso. (2011). Using Decision-Theoretic Experience Sampling to Build Personalized Mobile Phone Interruption Models. Proceedings of the International Conference on Pervasive Computing (Pervasive 2011), 170-187. http://doi.org/d2fcbj","paperID":"None"},{"content":"James A. Russell, Anna Weiss, and Gerald A. Mendelsohn. (1989). Affect Grid: A Single-Item Scale of Pleasure and Arousal. Journal of Personality and Social Psychology, 57(3), 493-502.","paperID":"None"},{"content":"Saul Shiffman. (2009). Ecological Momentary Assessment (EMA) in Studies of Substance Use. Psychological Assessment, 21(4), 486-497. http://doi.org/csttmw","paperID":"None"},{"content":"Timothy Sohn, Kevin A. Li, William G. Griswold, and James D. Hollan. (2008). A Diary Study of Mobile Information Needs. Proceeding of the CHI Conference on Human Factors in Computing Systems (CHI 2008), 433-442. http://doi.org/fjrb85","paperID":"None"},{"content":"Arthur A. Stone, Christine A. Bachrach, Jared B. Jobe, Howard S. Kurtzman, and Virginia S. Cain (eds.). (1999). The Science of Self-Report: Implications for Research and Practice. Psychology Press.","paperID":"None"},{"content":"Arthur A. Stone, Saul Shiffman, Joseph E Schwartz, Joan E Broderick, and Michael R Hufford. (2003). Patient Compliance with Paper and Electronic Diaries. Controlled Clinical Trials, 24(2), 182-199. http://doi.org/bnwr3b","paperID":"None"},{"content":"Arthur A. Stone and Saul Shiffman. (2003). Ecological Momentary Assessment (EMA) in Behavorial Medicine. Journal of Happiness Studies, 4(1), 35-52. http://doi.org/bdjp7x","paperID":"None"},{"content":"Edison Thomaz, Irfan Essa, and Gregory D. Abowd. (2015). A Practical Approach for Recognizing Eating Moments with Wrist-Mounted Inertial Sensing. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp 2015), 1029-1040. http://dx.doi.org/10.1145/2750858.2807545","paperID":"None"},{"content":"Khai N. Truong, Thariq Shihipar, and Daniel J. Wigdor. (2014). Slide to X: Unlocking the Potential of Smartphone Unlocking. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI 2014), 3635-3644. http://doi.org/bbph","paperID":"None"},{"content":"Rajan Vaish, Keith Wyngarden, Jingshu Chen, Brandon Cheung, and Michael S. Bernstein. (2014). Twitch Crowdsourcing: Crowd Contributions in Short Bursts of Time. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI 2014), 3645-3654. http://doi.org/bbpj","paperID":"None"}],"abstract":"In situ self-report is widely used in human-computer interaction, ubiquitous computing, and for assessment and intervention in health and wellness. Unfortunately, it remains limited by high burdens. We examine unlock journaling as an alternative. Specifically, we build upon recent work to introduce single-slide unlock journaling gestures appropriate for health and wellness measures. We then present the first field study comparing unlock journaling with traditional diaries and notification-based reminders in self-report of health and wellness measures. We find unlock journaling is less intrusive than reminders, dramatically improves frequency of journaling, and can provide equal or better timeliness. Where appropriate to broader design needs, unlock journaling is thus an overall promising method for in situ self-report.","title":"Examining Unlock Journaling with Diaries and Reminders for In Situ Self-Report in Health and Wellness","filename":"CHI16/p5658","authors":["Xiaoyi Zhang","Laura R. Pina","James Fogarty"],"conference":"CHI '16"}