{"paperId":2858325,"citation":[],"reference":[{"content":"Saskia Bakker, Elise van den Hoven, and Berry Eggen. 2015. Peripheral interaction: characteristics and considerations. Personal and Ubiquitous Computing 19, 1 (2015), 239-254.","paperID":"None"},{"content":"Bill Buxton. 2007. Sketching User Experiences: Getting the Design Right and the Right Design (Interactive Technologies). Morgan Kaufmann, San Francisco, USA.","paperID":"None"},{"content":"The Nielsen Company. 2014. 2014 Nielsen Music U.S. Report. (7 January 2014). Retrieved January 12, 2016 from http://www.nielsen.com/content/dam/corporate/us/en/public%20factsheets/Soundscan/nielsen-2014-year-end-music-report-us.pdf.","paperID":"None"},{"content":"Juliet M. Corbin and Anselm Strauss. 1990. Grounded theory research: Procedures, canons, and evaluative criteria. Qualitative Sociology 13, 1 (1990), 3-21. DOI: http://dx.doi.org/10.1007/BF00988593","paperID":"None"},{"content":"Design Council. 2007. A Study of the Design Process, Eleven lessons: managing design in eleven global brands. (2007). Retrieved January 12, 2016 from http://www.designcouncil.org.uk/resources/report/11-lessons-managing-design-global-brands.","paperID":"None"},{"content":"Paul Dourish. 2001. Where the action is: the foundations of embodied interaction. MIT Press.","paperID":"None"},{"content":"Eva Hornecker and Jacob Buur. 2006. Getting a grip on tangible interaction: a framework on physical space and social interaction. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 437-446.","paperID":"None"},{"content":"Scott E Hudson, Chris Harrison, Beverly L Harrison, and Anthony LaMarca. 2010. Whack gestures: inexact and inattentive interaction with mobile devices. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction. ACM, 109-112.","paperID":"None"},{"content":"IDEO.org. 2015. The Field Guide to Human-Centred Design. IDEO. Retrieved January 12, 2016 from http://www.designkit.org/resources/1.","paperID":"None"},{"content":"SkyBlue Technologies Inc. 2008. Learn about the small portable device that saves NPR and public radio stories. (2008). Retrieved January 12, 2016 from http://www.radiobookmark.com/static/learn_more.","paperID":"None"},{"content":"D Kahneman. 1973. Attention and Effort. Prentice-Hall.","paperID":"None"},{"content":"Ai Kawakami, Kiyoshi Furukawa, and Kazuo Okanoya. 2014. Music evokes vicarious emotions in listeners. Frontiers in Psychology 5, Article 431 (2014), 7 pages.","paperID":"None"},{"content":"Christian Loclair, Sean Gustafson, and Patrick Baudisch. 2010. PinchWatch: a wearable device for one-handed microinteractions. In Proceedings of the Workshop on Ensembles of On-Body Devices at the Conference on Human-Computer Interaction with Mobile Devices and Services, Vol. 10. ACM, 4.","paperID":"None"},{"content":"Joyce Ma, Lisa Sindorf, Isaac Liao, and Jennifer Frazier. 2015. Using a Tangible Versus a Multi-touch Graphical User Interface to Support Data Exploration at a Museum Exhibit. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 33-40.","paperID":"None"},{"content":"Jakob Nielsen. 1994. Usability engineering. Elsevier.","paperID":"None"},{"content":"Ofcom. 2015. The Communications Market 2015: Radio and Audio. (August 2015). Retrieved January 12, 2016 from http://stakeholders.ofcom.org.uk/binaries/research/cmr/cmr15/UK_3.pdf.","paperID":"None"},{"content":"Fernando Olivera, Manuel García-Herranz, Pablo A Haya, and Pablo Llinás. 2011. Do not disturb: physical interfaces for parallel peripheral interactions. In Human-Computer Interaction-INTERACT 2011. Springer, 479-486.","paperID":"None"},{"content":"Sami Ronkainen, Jonna Häkkilä, Saana Kaleva, Ashley Colley, and Jukka Linjama. 2007. Tap input as an embedded interaction method for mobile devices. In Proceedings of the 1st international conference on Tangible and embedded interaction. ACM, 263-270.","paperID":"None"},{"content":"David Rose. 2014. Enchanted Objects: Design, Human Desire, and the Internet of Things. Scribner.","paperID":"None"},{"content":"Orit Shaer and Robert JK Jacob. 2009. A specification paradigm for the design and implementation of tangible user interfaces. ACM Transactions on Computer-Human Interaction (TOCHI) 16, 4 (2009), 20.","paperID":"None"},{"content":"Lie Ming Tang, Judy Kay, and Bob Kummerfeld. 2015. Gamification of tangible internet connected buttons towards long term goals. The University of Sydney, School of Information Technologies Technical Reports 701 (June 2015), 4.","paperID":"None"},{"content":"Peter Tolmie, James Pycock, Tim Diggins, Allan MacLean, and Alain Karsenty. 2002. Unremarkable computing. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 399-406.","paperID":"None"},{"content":"BBC Trust. 2015. BBC Trust Service Review: Radio 1, 1Xtra, Radio 2, Radio 3, 6 Music and Asian Network. (19 March 2015). Retrieved January 12, 2016 from http://downloads.bbc.co.uk/bbctrust/assets/files/pdf/our_work/music_radio/music_radio.pdf.","paperID":"None"},{"content":"B. Ullmer and H. Ishii. 2000. Emerging Frameworks for Tangible User Interfaces. IBM Syst. J. 39, 3--4 (July 2000), 915-931. DOI: http://dx.doi.org/10.1147/sj.393.0915","paperID":"None"},{"content":"Bret Victor. 2011. A brief rant on the future of interaction design. (8 November 2011). Retrieved January 12, 2016 from http://worrydream.com/ABriefRantOnTheFutureOfInteractionDesign/.","paperID":"None"},{"content":"Avery Wang. 2006. The Shazam Music Recognition Service. Commun. ACM 49, Article 8 (Aug. 2006), 5 pages. DOI: http://dx.doi.org/10.1145/1145287.1145312","paperID":"None"},{"content":"Katrin Wolf, Anja Naumann, Michael Rohs, and Jörg Müller. 2011. Taxonomy of Microinteractions: Defining Microgestures Based on Ergonomic and Scenario-dependent Requirements. In Proceedings of the 13th IFIP TC 13 International Conference on Human-computer Interaction - Volume Part I (INTERACT'11). Springer-Verlag, Berlin, Heidelberg, 559-575. http://dl.acm.org/citation.cfm?id=2042053.2042111","paperID":"None"}],"abstract":"A physical hardware prototype--The Button was developed as a research probe to understand how radio audiences could discover, organise and consume music radio content at the touch of a physical button, the only control on a tiny handheld device. The Button allows listeners to tag tracks they like via a simple one-touch interaction method, and save them to a non-commercial online playlist service: BBC Playlister. Users can then export these tags to other music streaming platforms, such as Spotify, Deezer, etc. Following a user-centric design process, a large in-the-wild study was conducted over several weeks to investigate the value of the Button in aiding listeners' discovery of music. One group of participants was given a mobile phone app designed to facilitate tagging music heard on BBC radio stations; two other groups were given both the app and a Button (in one of two hardware versions). The findings revealed that Button users made significantly more tags on average than app users, indicating that a physical device could add significant value for radio listeners who want to tag music. Participants valued the simple one-touch interaction method, especially in situations where their smartphones were out of reach or contextual constraints meant that interaction with a complex device was undesirable or difficult.","title":"Pressing Not Tapping: Comparing a Physical Button with a Smartphone App for Tagging Music in Radio Programmes","filename":"CHI16/p5874","authors":["Lianne Kerlin","Jasmine Cox","Stephen Jolly","Michael Evans","George Green","David Regan"],"conference":"CHI '16"}