{"paperId":2858591,"citation":[],"reference":[{"content":"Wokje Abrahamse, Linda Steg, Charles Vlek, and Talib Rothengatter. 2005. A review of intervention studies aimed at household energy conservation. Journal of Environmental Psychology 25, 3, 273--291. http://doi.org/10.1016/j.jenvp.2005.08.002","paperID":"None"},{"content":"Icek Ajzen. 1985. From intentions to actions: A theory of planned behavior. Springer.","paperID":"None"},{"content":"Icek Ajzen. 1991. The theory of planned behavior. Organizational behavior and Human Decision Processes 50, 2, 179--211. http://doi.org/10.1016/07495978(91)90020-T","paperID":"None"},{"content":"Icek Ajzen. 2011. The theory of planned behaviour: Reactions and reflections. Psychology & Health 26, 9, 1113--1127. http://doi.org/10.1080/08870446.2011.613995","paperID":"None"},{"content":"Christopher J Armitage and Mark Conner. 2001. Efficacy of the Theory of Planned Behaviour: a metaanalytic review. The British Journal of Social Psychology 40, 4, 471--499. http://doi.org/10.1348/014466601164939","paperID":"None"},{"content":"Sandra K Barta and Richard D Stacy. 2005. The effects of a theory-based training program on nurses? selfefficacy and behavior for smoking cessation counseling. The Journal of Continuing Education in Nursing 36, 3, 117.","paperID":"None"},{"content":"Frank Bentley and Konrad Tollmar. 2013. The power of mobile notifications to increase wellbeing logging behavior. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'13), 1095. http://doi.org/10.1145/2470654.2466140","paperID":"None"},{"content":"Roger Buehler, Dale Griffin, and Michael Ross. 1994. Exploring the \"planning fallacy\": Why people underestimate their task completion times. Journal of Personality and Social Psychology 67, 3, 366--381. http://doi.org/10.1037/0022--3514.67.3.366","paperID":"None"},{"content":"Shelly Chaiken. 1980. Heuristic versus systematic information processing and the use of source versus message cues in persuasion. Journal of Personality and Social Psychology 39, 5, 752. http://dx.doi.org/10.1037/0022-3514.39.5.752","paperID":"None"},{"content":"Nikos L D Chatzisarantis and Martin S Hagger. 2005. Effects of a brief intervention based on the Theory of Planned Behavior on leisure-time physical activity participation. Journal of Sports & Exercise Psychology 27, 470--487.","paperID":"None"},{"content":"Anna Collins and Barbara Mullan. 2011. An extension of the theory of planned behavior to predict immediate hedonic behaviors and distal benefit behaviors. Food Quality and Preference 22, 7, 638--646. http://doi.org/10.1016/j.foodqual.2011.03.011","paperID":"None"},{"content":"Mark Conner, Paschal Sheeran, Paul Norman, and Christopher J Armitage. 2000. Temporal stability as a moderator of relationships in the Theory of Planned Behaviour. The British Journal of Social Psychology 39, 4, 469--493. http://doi.org/http://dx.doi.org/10.1348/014466600164","paperID":"None"},{"content":"Mark Conner and Christopher J Armitage. 1998. Extending the Theory of Planned Behavior: A Review and Avenues for Further Research. Journal of Applied Social Psychology 28, 15, 1429--1464. http://doi.org/10.1111/j.1559-1816.1998.tb01685.x","paperID":"None"},{"content":"Dmnsw Dissanayake. 2014. The Impact of Perceived Desirability and Perceived Feasibility on Entrepreneurial Intention among Undergraduate Students in Sri Lanka: An Extended Model. Kelaniya Journal of Management 2, 1, 39--57. http://doi.org/10.4038/kjm.v2i1.6543","paperID":"None"},{"content":"Russell H Fazio and Tamara Towles-Schwen. 1999. The MODE model of attitude-behavior processes. In Dual Process Theories in Social Psychology, Shelly Chaiken, Yaacov Trope (eds.), 97--116.","paperID":"None"},{"content":"Martin Fishbein, Harry C Triandis, Frederick H Kanfer, Marshall Becker, and Susan E Middlestadt. 2001. Factors influencing behavior and behavior change.","paperID":"None"},{"content":"Jason R. Fitzsimmons and Evan J. Douglas. 2011. Interaction between feasibility and desirability in the formation of entrepreneurial intentions. Journal of Business Venturing 26, 4, 431--440. http://doi.org/10.1016/j.jbusvent.2010.01.001","paperID":"None"},{"content":"B J Fogg. 2002. Persuasive Technology: Using Computers to Change What We Think and Do (Interactive Technologies). Morgan Kaufmann Publishers.","paperID":"None"},{"content":"Shane Frederick, George Loewenstein, and Ted O'donoghue. 2002. Time discounting and time preference: A critical review. Journal of Economic Literature 351--401. http://doi.org/10.1257/002205102320161311","paperID":"None"},{"content":"Kentaro Fujita. 2008. Seeing the forest beyond the trees: A construal-level approach to self-control. Social and Personality Psychology Compass 2, 3, 1475--1496. http://doi.org/ 10.1111/j.1751-9004.2008.00118.x","paperID":"None"},{"content":"Gaston Godin and Gerjo Kok. 1996. The Theory of Planned Behavior: A Review of Its Applications to Health-related Behaviors. American Journal of Health Promotion 11, 2, 87--98. http://doi.org/10.4278/08901171-11.2.87","paperID":"None"},{"content":"Harper, F. Maxwell, Sherry Xin Li, Yan Chen, and Joseph A. Konstan. 2007. Social Comparisons to Motivate Contributions to an Online Community. In Persuasive Technology, Yvonne de Kort, Wijnand IJsselsteijn, Cees Midden, Berry Eggen, and B. J. Fogg (eds.). Springer Berlin Heidelberg, 148--159.","paperID":"None"},{"content":"Eric B Hekler, Predrag Klasnja, Jon E Froehlich, and Matthew P Buman. 2013. Mind the theoretical gap: interpreting, using, and developing behavioral theory in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'13), 3307--3316. http://doi.org/10.1145/2470654.2466452","paperID":"None"},{"content":"Morris B Holbrook. 1978. Beyond attitude structure?: toward. Journal of Marketing Research 15, 4, 545--556. http://doi.org/ 10.2307/3150624","paperID":"None"},{"content":"John B Jemmott III, Loretta Sweet Jemmott, and Geoffrey T Fong. 1998. Abstinence and safer sex HIV risk-reduction interventions for African American adolescents: a randomized controlled trial. Jama 279, 19, 1529--1536. http://doi.org/10.1001/jama.279.19.1529","paperID":"None"},{"content":"Hadi Kharrazi, Anthony Faiola, and Joseph Defazio. 2009. Healthcare game design: Behavioral modeling of serious gaming design for children with chronic diseases. Lecture Notes in Computer Science 5613 LNCS, PART 4, 335--344. http://doi.org/10.1007/978-3642-02583-9_37","paperID":"None"},{"content":"Hadi Kharrazi. 2009. Improving healthy behaviors in type 1 diabetic patients by interactive frameworks. AMIA Annual Symposium, 322--326.","paperID":"None"},{"content":"Hyang-Sook Kim and S Shyam Sundar. 2011. Using interface cues in online health community boards to change impressions and encourage user contribution. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11), 599--608. http://doi.org/ 10.1145/1978942.1979028","paperID":"None"},{"content":"Ziva Kunda. 1990. The case for motivated reasoning. Psychological Bulletin 108, 3, 480. http://dx.doi.org/10.1037/0033-2909.108.3.480","paperID":"None"},{"content":"Yu-Hao Lee and Gary Hsieh. 2013. Does slacktivism hurt activism?: the effects of moral balancing and consistency in online activism. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'13), 811--820. http://doi.org/ 10.1145/2470654.2470770","paperID":"None"},{"content":"Nira Liberman and Jens Förster. 2009. The effect of psychological distance on perceptual level of construal. Cognitive Science 33, 7, 1330--1341. http://doi.org/10.1111/j.1551--6709.2009.01061.x","paperID":"None"},{"content":"Nira Liberman and Yaacov Trope. 1998. The role of feasibility and desirability considerations in near and distant future decisions: A test of temporal construal theory. Journal of Personality and Social Psychology 75, 1, 5--18. http://doi.org/10.1037/0022--3514.75.1.5","paperID":"None"},{"content":"Yuliya Lutchyn and Marco Yzer. 2011. Construal level theory and theory of planned behavior: time frame effects on salient belief generation. Journal of Health Communication 16, 6, 595--606. http://doi.org/10.1080/10810730.2011.551991","paperID":"None"},{"content":"William M Macharia, Gladys Leon, Brian H Rowe, Barbara J Stephenson, and R Brian Haynes. 1992. An overview of interventions to improve compliance with appointment keeping for medical services. Jama 267, 13, 1813--1817. http://doi.org/10.1001/jama.1992.03480130129038","paperID":"None"},{"content":"Rosemary Robin Charlotte McEachan, Mark Conner, Natalie Jayne Taylor, and Rebecca Jane Lawton. 2011. Prospective prediction of health-related behaviours with the Theory of Planned Behaviour: a metaanalysis. Health Psychology Review 5, 2, 97--144. http://doi.org/10.1080/17437199.2010.521684","paperID":"None"},{"content":"Terence R. Mitchell, Leigh Thompson, Erika Peterson, and Randy Cronk. 1997. Temporal Adjustments in the Evaluation of Events: The \"Rosy View.\" Journal of Experimental Social Psychology 33, 4, 421--448. http://doi.org/10.1006/jesp.1997.1333","paperID":"None"},{"content":"Richard Netemeyer, Michelle Van Ryn, and Icek Ajzen. 1991. The theory of planned behavior. Orgnizational Behavior and Human Decision Processes 50, 179--211. http://doi.org/10.1016/07495978(91)90020-T","paperID":"None"},{"content":"Eleanor O'Rourke, Kyla Haimovitz, Christy Ballweber, Carol Dweck, and Zoran Popović. 2014. Brain points: A growth mindset incentive structure boosts persistence in an educational game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (CHI'14), 3339--3348. http://doi.org/10.1145/2556288.2557157","paperID":"None"},{"content":"Dianne Parker, Stephen G Stradling, and Antony S R Manstead. 1996. Modifying Beliefs and Attitudes to Exceeding the Speed Limit: An Intervention Study Based on the Theory of Planned Behavior. Journal of Applied Social Psychology 26, 1, 1--19. http://doi.org/ 10.1111/j.1559--1816.1996.tb01835.x","paperID":"None"},{"content":"Richard E Petty and John T Cacioppo. 1986. The elaboration likelihood model of persuasion. Springer.","paperID":"None"},{"content":"Donna M Randall and James A Wolff. 1994. The time interval in the intention-behaviour relationship: Metaanalysis. British Journal of Social Psychology 33, 4, 405--418. http://doi.org/10.1111/j.20448309.1994.tb01037.x","paperID":"None"},{"content":"Al M Rashid, Kimberly Ling, Regina D Tassone, Paul Resnick, Robert Kraut, and John Riedl. 2006. Motivating participation by displaying the value of contribution. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI'06), 955--958. http://doi.org/10.1145/1124772.1124915","paperID":"None"},{"content":"Milton J Rosenberg. 1956. Cognitive structure and attitudinal affect. Journal of Abnormal Psychology 53, 3, 367--372. http://doi.org/10.1037/h0044579","paperID":"None"},{"content":"Zheng, Saijing, Mary Beth Rosson, Patrick C. Shih, and John M. Carroll. 2015. \"Understanding Student Motivation, Behaviors and Perceptions in MOOCs.\" In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW'15), 1882--1895. http://doi.org/10.1145/2675133.2675217","paperID":"None"},{"content":"Kenneth Savitsky, Victoria Husted Medvec, Ann E Charlton, and Thomas Gilovich. 1998. \"What, Me Worry\"?: Arousal, Misattribution, and the Effect of Temporal Distance on Confidence. Personality and Social Psychology Bulletin 24, 5, 529--536. http://doi.org/10.1177/0146167298245008","paperID":"None"},{"content":"Paschal Sheeran and Shiena Orbell. 1998. Do intentions predict condom use? Meta-analysis and examination of six moderator variables. The British Journal of Social Psychology 37, 2, 231--250. http://doi.org/10.1111/j.2044-8309.1998.tb01167.x","paperID":"None"},{"content":"Aneesha Singh, Annina Klapper, Jinni Jia, et al. 2014. Motivating people with chronic pain to do physical activity: opportunities for technology design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'14), 2803--2812. http://doi.org/10.1145/2556288.2557268","paperID":"None"},{"content":"Martine Stead, Stephen Tagg, Anne Marie MacKintosh, and Douglas Eadie. 2005. Development and evaluation of a mass media Theory of Planned Behaviour intervention to reduce speeding. Health Education Research 20, 1, 36--50. http://doi.org/10.1093/her/cyg093","paperID":"None"},{"content":"Sutton Stephan. 1998. Predicting and explaining intentions and behavior: How well are we doing? Journal of Applied Social Psychology 28, 15, 1317--1338. http://doi.org/10.1111/j.15591816.1998.tb01679.x","paperID":"None"},{"content":"Anja Thieme, Rob Comber, Julia Miebach, et al. 2012. \"We've bin watching you\": Designing for reflection and social persuasion to promote sustainable lifestyles. In Proceedings of the 2012 ACM Annual Conference on Human Factors in Computing Systems (CHI '12), 2337--2346. http://doi.org/10.1145/2208276.2208394","paperID":"None"},{"content":"Yaacov Trope and N Liberman. 2000. Temporal construal and time-dependent changes in preference. Journal of Personality and Social Psychology 79, 6, 876--889. http://doi.org/10.1037/0022--3514.79.6.876","paperID":"None"},{"content":"Yaacov Trope and Nira Liberman. 2003. Temporal construal. Psychological Review 110, 3, 40300421. http://doi.org/10.1037/0033--295X.110.3.403","paperID":"None"},{"content":"Yaacov Trope and Nira Liberman. 2010. Construallevel theory of psychological distance. Psychological Review 117, 2, 440. http://dx.doi.org/10.1037/a0018963","paperID":"None"},{"content":"Yaacov Trope and Nira Liberman. 2011. Construal level theory. Handbook of Theories of Social Psychology 1, 11800134.","paperID":"None"}],"abstract":"Despite the prevalence of theories and interventions related to behavior change, our knowledge on how intention for a target, or planned behavior, changes over time remains limited. This hinders our ability to consider the temporal aspect in our designs to support behavior change. To understand the effect of temporal distances on planned behaviors, we conducted two studies, building on the Theory of Planned Behavior and Constual Level Theory. We found that attitude about the target is more salient the further away the event, as people focus on the why of a behavior. On the other hand, perceived behavior control can influence intention in both near and far future. When the target is in the near future, people generally focus on the feasibility, or the how of the behavior. In the far future, people may also consider factors related to behavior control, if they are motivated to do so (i.e., hold a strong attitude towards the action). Findings help advance the Theory of Planned Behavior and offer strategies for designers and event organizers to motivate planned behaviors that are in the near and far future.","title":"Designing for Future Behaviors: Understanding the Effect of Temporal Distance on Planned Behaviors","filename":"CHI16/p1084","authors":["Minhyang (Mia) Suh","Gary Hsieh"],"conference":"CHI '16"}