{"paperId":2858489,"citation":[],"reference":[{"content":"BENGTSSON, J. 1994. Kinoform design with an optimal-rotationangle method. Appl. Opt. 33, 29 (Oct), 6879.6884.","paperID":"None"},{"content":"BOLANOWSKI, S. J. Jr., GESCHEIDER, G. A., VERRILLO, R.T., AND CHECKOSKY, C. M. 1968. Four channels mediate the mechanical aspects of touch. The Journal of the Acoustical Society of America. 84, 5, 1680.94.","paperID":"None"},{"content":"BRANDT, E. H. 1989. Levitation in physics. Science 243, 4889, 349.55.","paperID":"None"},{"content":"CAIN, C. P., ROACH, W. P., STOLARSKI, D. J., NOOJIN, G. D., KUMRU, S. S., STOCKTON, K. L., ZOHNER, J. J., AND ROCKWELL, B. A. 2007. Infrared laser damage thresholds for skin at wavelengths from 0.810 to 1.54 microns for femto-tomicrosecond pulse durations. In Proc. SPIE. Vol. 6435. 64350W.64350W.12.","paperID":"None"},{"content":"CARTER, T., SEAH, S. A., LONG, B., DRINKWATER, B., AND SUBRAMANIAN, S. 2013. Ultrahaptics: Multi-point mid-air haptic feedback for touch surfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology, ACM, NY, NY, USA, UIST '13, 505.514.","paperID":"None"},{"content":"GUPTA, S., MORRIS, D., PATEL, S. N., AND TAN, D. 2013. Airwave: Non-contact haptic feedback using air vortex rings. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, NY, NY, USA, UbiComp '13, 419.428.","paperID":"None"},{"content":"HASEGAWA, K., AND SHINODA, H. 2013. Aerial display of vibrotactile sensation with high spatialtemporal resolution using large-aperture airborne ultrasound phased array. In World Haptics Conference (WHC), 2013, 31.36.","paperID":"None"},{"content":"HAYASAKI, Y., SUGIMOTO, T., TAKITA, A., AND NISHIDA, N. 2005. Variable holographic femtosecond laser processing by use of a spatial light modulator. Appl. Phys. Lett. 87, 3.","paperID":"None"},{"content":"HOSHI, T., TAKAHASHI, M., IWAMOTO, T., AND SHINODA, H. 2010. Noncontact tactile display based on radiation pressure of airborne ultrasound. IEEE Transactions on Haptics 3, 3, 155.165.","paperID":"None"},{"content":"INOUE, S., KOBAYASHI-KIRSCHVINK, K. J., MONNAI, Y., HASEGAWA, K., MAKINO, Y., AND SHINODA, H. 2014. Horn: The hapt-optic reconstruction. In ACM SIGGRAPH 2014 Emerging Technologies, ACM, NY, NY, USA, SIGGRAPH '14, 11:1.11:1.","paperID":"None"},{"content":"IWAKI, S., MORIMASA, H., NORITSUGU, T., AND KOBAYASHI, M. 2011. Contactless manipulation of an object on a plane surface using multiple air jets. In ICRA, IEEE, 3257.3262.","paperID":"None"},{"content":"JUN, J. H, PARK, J. R., KIM, S. P., MIN, B. Y., PARK J. Y., KIM H. S., CHOI, S., JUNG, S. J., HWA P. S., YEOM D. I., JUNG, G. I., KIM J. S., AND CHUNG, S. C. 2015. Laser-induced thermoelastic effects can evoke tactile sensations. Scientific Reports 5, 11016.","paperID":"None"},{"content":"KIMURA, H., UCHIYAMA, T., AND YOSHIKAWA, H. 2006. Laser produced 3d display in the air. In ACM SIGGRAPH 2006 Emerging Technologies, ACM, NY, NY, USA, SIGGRAPH --06.","paperID":"None"},{"content":"KONO, M., KAKEHI, Y., AND HOSHI, T., 2013. lapillus bug. SIGGRAPH Asia 2013 Art Gallery.","paperID":"None"},{"content":"LEE, H., KIM, J. S., CHOI, S., JUN, J. H., PARK, J. R., KIM, A. H., OH, H. B., KIM, H. S, AND CHUNG, S. C., 2015. Mid-air tactile stimulation using laserinduced thermoelastic effects: The first study for indirect radiation. In World Haptics Conference (WHC), 2015, 374.380.","paperID":"None"},{"content":"LEE, J., POST, R., AND ISHII, H. 2011. Zeron: Midair tangible interaction enabled by computer controlled magnetic levitation. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology, ACM, NY, NY, USA, UIST '11, 327.336.","paperID":"None"},{"content":"MARSHALL, M., CARTER, T., ALEXANDER, J., AND SUBRAMANIAN, S. 2012. Ultra-tangibles: Creating movable tangible objects on interactive tables. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, NY, NY, USA, CHI '12, 2185.2188.","paperID":"None"},{"content":"OCHIAI, Y., HOSHI, T., OYAMA, A., AND REKIMOTO, J. 2013. Poppable display: A display that enables popping, breaking, and tearing interactions with people. In Consumer Electronics (GCCE), 2013 IEEE 2nd Global Conference on, 124.128.","paperID":"None"},{"content":"OCHIAI, Y., HOSHI, T., AND REKIMOTO, J. 2014. Pixie dust: Graphics generated by levitated and animated objects in computational acoustic-potential field. ACM Trans. Graph. 33, 4 (July), 85:1.85:13.","paperID":"None"},{"content":"OCHIAI, Y., KUMAGAI, K., HOSHI, T., REKIMOTO, J., HASEGAWA, S., AND YOSHIO, H. 2015. Fairy lights in femtoseconds: Aerial and volumetric graphics rendered by focused femtosecond laser combined with computational holographic fields. In ACM SIGGRAPH 2015 Emerging Technologies, ACM, NY, NY, USA, SIGGRAPH '15.","paperID":"None"},{"content":"SAGA, S. 2014. Fingerflux: Near-surface haptic feedback on tabletops. In Proceedings of AsiaHaptics 2014, AsiaHaptics 2014.","paperID":"None"},{"content":"SODHI, R., POUPYREV, I., GLISSON, M., AND ISRAR, A. 2013. Aireal: Interactive tactile experiences in free air. ACM Trans. Graph. 32, 4 (July), 134:1.134:10.","paperID":"None"},{"content":"SUZUKI, Y., AND KOBAYASHI, M. 2005. Air jet driven force feedback in virtual reality. Computer Graphics and Applications, IEEE 25, 1 (Jan), 44.47.","paperID":"None"},{"content":"WEISS, M., WACHARAMANOTHAM, C., VOELKER, S., AND BORCHERS, J. 2011. Fingerflux: Near-surface haptic feedback on tabletops. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology, ACM, NY, NY, USA, UIST '11, 615.620.","paperID":"None"}],"abstract":"We present a new method of rendering aerial haptic images that uses femtosecond-laser light fields and ultrasonic acoustic fields. In conventional research, a single physical quantity has been used to render aerial haptic images. In contrast, our method combines multiple fields (light and acoustic fields) at the same time. While these fields have no direct interference, combining them provides benefits such as multi-resolution haptic images and a synergistic effect on haptic perception. We conducted user studies with laser haptics and ultrasonic haptics separately and tested their superposition. The results showed that the acoustic field affects the tactile perception of the laser haptics. We explored augmented reality/virtual reality (AR/VR) applications such as providing haptic feedback of the combination of these two methods. We believe that the results of this study contribute to the exploration of laser haptic displays and expand the expression of aerial haptic displays based on other principles.","title":"Cross-Field Aerial Haptics: Rendering Haptic Feedback in Air with Light and Acoustic Fields","filename":"CHI16/p3238","authors":["Yoichi Ochiai","Kota Kumagai","Takayuki Hoshi","Satoshi Hasegawa","Yoshio Hayasaki"],"conference":"CHI '16"}