{"paperId":2858122,"citation":[],"abstract":"Geotagged tweets and other forms of social media volunteered geographic information (VGI) are becoming increasingly critical to many applications and scientific studies. An important assumption underlying much of this research is that social media VGI is \"local\", or that its geotags correspond closely with the general home locations of its contributors. We demonstrate through a study on three separate social media communities (Twitter, Flickr, Swarm) that this localness assumption holds in only about 75% of cases. In addition, we show that the geographic contours of localness follow important sociodemographic trends, with social media in, for instance, rural areas and older areas, being substantially less local in character (when controlling for other demographics). We demonstrate through a case study that failure to account for non-local social media VGI can lead to misrepresentative results in social media VGI-based studies. Finally, we compare the methods for determining localness, finding substantial disagreement in certain cases, and highlight new best practices for social media VGI-based studies and systems.","reference":[{"content":"Sofiane Abbar, Yelena Mejova, and Ingmar Weber. 2015. You Tweet What You Eat: Studying Food Consumption Through Twitter. ACM Press. http://doi.org/10.1145/2702123.2702153","paperID":"None"},{"content":"Luc Anselin. 2005. Exploring Spatial Data with GeoDa: A Workbook. Center for Spatially Integrated Social Science.","paperID":"None"},{"content":"Hila Becker, Mor Naaman, and Luis Gravano. 2011. Beyond Trending Topics: Real-World Event Identification on Twitter. ICWSM. http://doi.org/10.1.1.221.2822","paperID":"None"},{"content":"Roger Bivand and Gianfranco Piras. Regional Research Institute.","paperID":"None"},{"content":"Zhiyuan Cheng, James Caverlee, Kyumin Lee, and Daniel Z. Sui. 2011. Exploring Millions of Footprints in Location Sharing Services. ICWSM 2011.","paperID":"None"},{"content":"Ryan Compton, Chi-Kwan Lee, Tsai-Ching Lu, Lakdeepal de Silva, and Michael Macy. 2013. Detecting future social unrest in unprocessed twitter data: \"emerging phenomena and big data.\" ISI, IEEE, 56--60.","paperID":"None"},{"content":"Ryan Compton, Craig Lee, Jiejun Xu, et al. 2013. Using publicly visible social media to build detailed forecasts of civil unrest. 1--11.","paperID":"None"},{"content":"Justin Cranshaw, Jason I Hong, and Norman Sadeh. 2012. The Livehoods Project?: Utilizing Social Media to Understand the Dynamics of a City. ICWSM: 58--65.","paperID":"None"},{"content":"Aron Culotta. 2014. Estimating county health statistics with twitter. JSM Proceedings, ACM Press, 1335--1344. http://doi.org/10.1145/2556288.2557139","paperID":"None"},{"content":"Bertrand De Longueville, Robin S. Smith, and Gianluca Luraschi. 2009. Omg, from here, i can see the flames!: a use case of mining location based social networks to acquire spatio-temporal data on forest fires. Proceedings of the 2009 international workshop on location based social networks, ACM, 73--80.","paperID":"None"},{"content":"Melanie Eckle. Quality Assessment of Remote Mapping in OpenStreetMap for Disaster Management Purposes. Retrieved September 24, 2015 from http://iscram2015.uia.no/wp-content/uploads/2015/05/51.pdf","paperID":"None"},{"content":"Eric Fischer. Locals and Tourists. Retrieved from https://www.flickr.com/photos/walkingsf/sets/72157624 209158632/","paperID":"None"},{"content":"Huiji Gao, Jiliang Tang, and Huan Liu. 2012. Exploring Social-Historical Ties on Location-Based Social Networks. ICWSM.","paperID":"None"},{"content":"Song Gao, Linna Li, Wenwen Li, Krzysztof Janowicz, and Yue Zhang. 2014. Constructing gazetteers from volunteered Big Geo-Data based on Hadoop. Computers, Environment and Urban Systems. http://doi.org/10.1016/j.compenvurbsys.2014.02.004","paperID":"None"},{"content":"S.A. Golder and M.W. Macy. 2011. Diurnal and Seasonal Mood Vary with Work, Sleep, and Daylength Across Diverse Cultures. Science 333, 6051: 1878--1881. http://doi.org/10.1126/science.1202775","paperID":"None"},{"content":"Mark Graham, Ralph K. Straumann, and Bernie Hogan. 2015. Digital Divisions of Labor and Informational Magnetism: Mapping Participation in Wikipedia. Annals of the Association of American Geographers 0, 0: 1--21. http://doi.org/10.1080/00045608.2015.1072791","paperID":"None"},{"content":"Darren Hardy, James Frew, and Michael F. Goodchild. 2012. Volunteered geographic information production as a spatial process. International Journal of Geographical Information Science: 1--22. http://doi.org/10.1080/13658816.2011.629618","paperID":"None"},{"content":"Brent Hecht and Darren Gergle. 2010. On the \"localness\" of user-generated content. CSCW: 229. http://doi.org/10.1145/1718918.1718962","paperID":"None"},{"content":"Brent Hecht, Lichan Hong, Bongwon Suh, and Ed H. Chi. 2011. Tweets from Justin Bieber's heart: the dynamics of the location field in user profiles. CHI, ACM.","paperID":"None"},{"content":"Brent Hecht and Monica Stephens. 2014. A Tale of Cities': Urban Biases in Volunteered Geographic Information. ICWSM.","paperID":"None"},{"content":"Nadav Hochman and Raz Schwartz. 2012. Visualizing instagram: Tracing cultural visual rhythms. ICWSMSocMedVis, 6--9.","paperID":"None"},{"content":"Myung-Hwa Hwang, Shaowen Wang, Guofeng Cao, Anand Padmanabhan, and Zhenhua Zhang. 2013. Spatiotemporal transformation of social media geostreams: a case study of Twitter for flu risk analysis. ACM Press, 12--21. http://doi.org/10.1145/2534303.2534310","paperID":"None"},{"content":"David Jurgens, Tyler Finethy, James McCorriston, Yi Tian Xu, and Derek Ruths. 2015. Geolocation prediction in twitter using social networks: A critical analysis and review of current practice. ICWSM.","paperID":"None"},{"content":"Marina Kogan, Leysia Palen, and Kenneth M. Anderson. 2015. Think Local, Retweet Global: Retweeting by the Geographically-Vulnerable during Hurricane Sandy. CSCW, ACM Press, 981--993. http://doi.org/10.1145/2675133.2675218","paperID":"None"},{"content":"Giorgos Kordopatis-Zilos, Symeon Papadopoulos, and Yiannis Kompatsiaris. 2015. Geotagging Social Media Content with a Refined Language Modelling Approach. In Intelligence and Security Informatics, Michael Chau, G. Alan Wang and Hsinchun Chen (eds.). Springer International Publishing, Cham, 21--40.","paperID":"None"},{"content":"Juhi Kulshrestha, Farshad Kooti, Ashkan Nikravesh, and P. Krishna Gummadi. 2012. Geographic Dissection of the Twitter Network. ICWSM.","paperID":"None"},{"content":"Vasileios Lampos and Nello Cristianini. 2010. Tracking the flu pandemic by monitoring the social web. Cognitive Information Processing (CIP), 2010 2nd International Workshop on, IEEE, 411--416.","paperID":"None"},{"content":"Linna Li, Michael F. Goodchild, and Bo Xu. 2013. Spatial, temporal, and socioeconomic patterns in the use of Twitter and Flickr. Cartography and Geographic Information Science 40, 2: 61--77. http://doi.org/10.1080/15230406.2013.777139","paperID":"None"},{"content":"Momin M. Malik, Hemank Lamba, Constantine Nakos, and Jürgen Pfeffer. 2015. Population Bias in Geotagged Tweets. ICWSM.","paperID":"None"},{"content":"James McCorriston, David Jurgens, and Derek Ruths. 2015. Organizations Are Users Too: Characterizing and Detecting the Presence of Organizations on Twitter. ICWSM.","paperID":"None"},{"content":"Alan Mislove, Sune Lehmann, Yong-yeol Ahn, Jukkapekka Onnela, and J Niels Rosenquist. Understanding the Demographics of Twitter Users. ICWSM: 554--557.","paperID":"None"},{"content":"Lewis Mitchell, Morgan R Frank, Kameron Decker Harris, Peter Sheridan Dodds, and Christopher M Danforth. 2013. The geography of happiness: connecting twitter sentiment and expression, demographics, and objective characteristics of place. PloS one 8, 5. http://doi.org/10.1371/journal.pone.0064417","paperID":"None"},{"content":"Mohamed Musthag and Deepak Ganesan. 2013. Labor dynamics in a mobile micro-task market. CHI, ACM, 641--650.","paperID":"None"},{"content":"Mor Naaman, Amy Xian Zhang, Samuel Brody, and Gilad Lotan. 2012. On the Study of Diurnal Urban Routines on Twitter. ICWSM: 258--265.","paperID":"None"},{"content":"Anastasios Noulas, Salvatore Scellato, Neal Lathia, and Cecilia Mascolo. 2012. Mining user mobility features for next place prediction in location-based services. ICDM, IEEE, 1038--1043.","paperID":"None"},{"content":"Barbara Poblete, Ruth Garcia, Marcelo Mendoza, and Alejandro Jaimes. 2011. Do all birds tweet the same?: characterizing twitter around the world. CIKM, ACM, 1025--1030. http://doi.org/10.1145/2063576.2063724","paperID":"None"},{"content":"Derek Ruths and Jürgen Pfeffer. 2014. Social media for large studies of behavior. Science 346, 6213: 1063--1064.","paperID":"None"},{"content":"Takeshi Sakaki, Makoto Okazaki, and Yutaka Matsuo. 2010. Earthquake shakes Twitter users: real-time event detection by social sensors. WWW, ACM, 851--860.","paperID":"None"},{"content":"Raz Schwartz and Germaine R Halegoua. 2014. The spatial self: Location-based identity performance on social media. New Media & Society: 1--18. http://doi.org/10.1177/1461444814531364","paperID":"None"},{"content":"Shilad Sen, Toby Jia-Jun Li, WikiBrain Team, and Brent Hecht. 2014. WikiBrain: Democratizing Computation on Wikipedia. OpenSym, ACM, 27:1--27:10. http://doi.org/10.1145/2641580.2641615","paperID":"None"},{"content":"Shilad W. Sen, Heather Ford, David R. Musicant, Mark Graham, Oliver S.B. Keyes, and Brent Hecht. 2015. Barriers to the Localness of Volunteered Geographic Information. CHI, ACM Press, 197--206. http://doi.org/10.1145/2702123.2702170","paperID":"None"},{"content":"Alessio Signorini, Alberto Maria Segre, and Philip M. Polgreen. 2011. The Use of Twitter to Track Levels of Disease Activity and Public Concern in the U.S. during the Influenza A H1N1 Pandemic. PLoS ONE 6, 5: e19467. http://doi.org/10.1371/journal.pone.0019467","paperID":"None"},{"content":"Anthony Stefanidis, Andrew Crooks, and Jacek Radzikowski. 2013. Harvesting ambient geospatial information from social media feeds. GeoJournal 78, 2: 319--338. http://doi.org/10.1007/s10708-011--9438--2","paperID":"None"},{"content":"Andrea H. Tapia, Nicolas Lalone, Elizabeth MacDonald, Michelle Hall, Nathan Case, and Matt Heavner. 2014. AURORASAURUS: Citizen Science, Early Warning Systems and Space Weather. HCOMP.","paperID":"None"},{"content":"Sho Tsugawa, Yusuke Kikuchi, Fumio Kishino, Kosuke Nakajima, Yuichi Itoh, and Hiroyuki Ohsaki. 2015. Recognizing Depression from Twitter Activity. CHI, ACM Press, 3187--3196. http://doi.org/10.1145/2702123.2702280","paperID":"None"},{"content":"Andranik Tumasjan, Timm Oliver Sprenger, Philipp G. Sandner, and Isabell M. Welpe. 2010. Predicting Elections with Twitter: What 140 Characters Reveal about Political Sentiment. ICWSM 10: 178--185.","paperID":"None"},{"content":"Alessandro Venerandi, Daniele Quercia, and Diego Saez-trumper. 2015. Measuring Urban Deprivation from User Generated Content. CSCW.","paperID":"None"},{"content":"Ting-Yu Wang, F. Maxwell Harper, and Brent Hecht. 2014. Designing Better Location Fields in User Profiles. Proceedings of the 18th International Conference on Supporting Group Work, ACM, 73--80. http://doi.org/10.1145/2660398.2660424","paperID":"None"},{"content":"Spencer a Wood, Anne D Guerry, Jessica M Silver, and Martin Lacayo. 2013. Using social media to quantify nature-based tourism and recreation. Scientific reports 3: 2976. http://doi.org/10.1038/srep02976","paperID":"None"},{"content":"Amy X. Zhang and Scott Counts. 2015. Modeling Ideology and Predicting Policy Change with Social Media: Case of Same-Sex Marriage. CHI, ACM Press, 2603--2612. http://doi.org/10.1145/2702123.2702193","paperID":"None"},{"content":"Yan-Tao Zheng, Zheng-Jun Zha, and Tat-Seng Chua. 2012. Mining Travel Patterns from Geotagged Photos. ACM TIST 3, 3: 1--18. http://doi.org/10.1145/2168752.2168770","paperID":"None"},{"content":"Dennis Zielstra, Hartwig Hochmair, Pascal Neis, and Francesco Tonini. 2014. Areal Delineation of Home Regions from Contribution and Editing Patterns in OpenStreetMap. ISPRS International Journal of GeoInformation 3, 4: 1211--1233. http://doi.org/10.3390/ijgi3041211","paperID":"None"}],"title":"The Geography and Importance of Localness in Geotagged Social Media","filename":"CHI16/p515","authors":["Isaac L. Johnson","Subhasree Sengupta","Johannes Schöning","Brent Hecht"],"conference":"CHI '16"}