{"paperId":2858409,"citation":[],"abstract":"Rarely are computing systems developed entirely by members of the communities they serve, particularly when that community is underrepresented in computing. Archive of Our Own (AO3), a fan fiction archive with nearly 750,000 users and over 2 million individual works, was designed and coded primarily by women to meet the needs of the online fandom community. Their design decisions were informed by existing values and norms around issues such as accessibility, inclusivity, and identity. We conducted interviews with 28 users and developers, and with this data we detail the history and design of AO3 using the framework of feminist HCI and focusing on the successful incorporation of values into design. We conclude with considering examples of complexity in values in design work: the use of design to mitigate tensions in values and to influence value formation or change.","reference":[{"content":"Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: Social science, feminism, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 675--684. http://doi.org/10.1145/1978942.1979041","paperID":"None"},{"content":"Shaowen Bardzell. 2010. Feminist HCI: Taking stock and outlining an agenda for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1301--1310. http://doi.org/10.1145/1753326.1753521","paperID":"None"},{"content":"Alan Borning and Michael Muller. 2012. Next steps for value sensitive design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1125--1134. http://doi.org/10.1145/2207676.2208560","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101. http://doi.org/10.1191/1478088706qp063oa","paperID":"None"},{"content":"Jed R. Brubaker, Lynn S. Dombrowski, Anita M. Gilbert, Nafiri Kusumakaulika, and Gillian R. Hayes. 2014. Stewarding a legacy: Responsibilities and relationships in the management of post-mortem data. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 4157--4166. http://doi.org/10.1145/2556288.2557059","paperID":"None"},{"content":"Amy Bruckman, Kurt Luther, and Casey Fiesler. 2015. When should we use real names in published accounts of internet research? In Digital Research Confidential, Ezster Hargittai and Christian Sandvig (eds.). MIT Press, Cambridge, MA.","paperID":"None"},{"content":"Liam Bullingham and Ana C. Vasconcelos. 2013. \"The presentation of self in the online world\": Goffman and the study of online identities. Journal of Information Science 39, 1: 101--112. http://doi.org/10.1177/0165551512470051","paperID":"None"},{"content":"Kristina Busse and Karen Hellekson. 2012. Identity, ethics, and fan privacy. In Fan Culture, Katherine Larsen and Lynn Zubernis (eds.). Cambridge Scholars Publishing, Newcastle, UK, 38--56.","paperID":"None"},{"content":"Kristina Busse. 2015. Fan Labor and Feminism. Cinema Journal 54, 3, 110--115.","paperID":"None"},{"content":"Apala Lahiri Chavan, Douglas Gorney, Beena Prabhu, and Sarit Arora. 2009. The washing machine that ate my sari--mistakes in cross-cultural design. Interactions 16, 1: 26--31. http://doi.org/10.1145/1456202.1456209","paperID":"None"},{"content":"Francesca Coppa and Rebecca Tushnet. 2011. How to suppress women's remix. Camera Obscura 26, 2: 131--139.","paperID":"None"},{"content":"Kevin Crowston, James Howison, and Hala Annabi. 2006. Information systems success in free and open source software development: Theory and measures. Software Process Improvement and Practice 11: 123--148.","paperID":"None"},{"content":"Jill P. Dimond, Casey Fiesler, Betsy DiSalvo, Jon Pelc, and Amy S. Bruckman. 2012. Qualitative data collection technologies: A comparison of instant messaging, email, and phone. In Proceedings of the ACM International Conference on Supporting Group Work (GROUP '12), 277--280. http://doi.org/ 10.1145/2389176.2389218","paperID":"None"},{"content":"Jill P. Dimond, Michaelanne Dye, Daphne Larose, and Amy S. Bruckman. 2013. Hollaback!: The role of collective storytelling online in a social movement organization. In Proceedings of the ACM conference on Computer Supported Cooperative Work (CSCW '13), 477--490. http://doi.org/10.1145/2441776.2441831","paperID":"None"},{"content":"Casey Fiesler and Amy S. Bruckman. 2014. Remixers' understandings of fair use online. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14), 1023--1032. http://doi.org/10.1145/2531602.2531695","paperID":"None"},{"content":"Casey Fiesler, Jessica Feuston, and Amy S. Bruckman. 2015. Understanding copyright law in online creative communities. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 116--129. http://doi.org/ 10.1145/2675133.2675234","paperID":"None"},{"content":"Casey Fiesler, Cliff Lampe, and Amy S. Bruckman. 2016. Reality and perception of copyright terms of service for online content creation. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '16).","paperID":"None"},{"content":"Monica Flegel. 2015. Legitimacy, validity, and writing for free: Fan fiction, gender, and the limits of (unpaid) creative labor. The Journal of Popular Culture 47, 6, 1092--1108.","paperID":"None"},{"content":"Sarah Fox, Rachel Rose Ulgado, and Daniela K. Rosner. 2015. Hacking culture, not devices: Access and recognition in feminist hackerspaces. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 56--68. http://doi.org/ 10.1145/2675133.2675223","paperID":"None"},{"content":"Batya Friedman, Peter H. Kahn, and Alan Borning. 2006. Value Sensitive Design and information systems. In Human-Computer Interaction in Management Information Systems: Foundations, Ping Zhang and Dennis. F. Galletta (eds.). Routledge, NY, NY, 348--372.","paperID":"None"},{"content":"Erving Goffman. 1959. Presentation of Self in Everyday Life. Anchor Books, NY, NY.","paperID":"None"},{"content":"Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, stress, and support during gender transition on Facebook. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1176--1190. http://doi.org/ 10.1145/2675133.2675152","paperID":"None"},{"content":"Aaron Halfaker, R. Stuart Geiger, and Loren G. Terveen. 2014. Snuggle: Designing for efficient socialization and ideological critique. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 311--320. http://doi.org/10.1145/2556288.2557313","paperID":"None"},{"content":"Karen Hellekson. 2009. A fannish field of value: Online fan gift culture. Cinema Journal 48, 4: 113--118. http://doi.org/10.1353/cj.0.0140","paperID":"None"},{"content":"Karen Hellekson. 2015. Making use of: The gift, commerce, and fans. Cinema Journal 54, 3: 125--131. http://doi.org/ 10.1353/cj.2015.0017","paperID":"None"},{"content":"Nancy A. Van House. 2011. Feminist HCI meets facebook: Performativity and social networking sites. Interacting with Computers 23, 5: 422--429. http://doi.org/10.1016/j.intcom.2011.03.003","paperID":"None"},{"content":"Anne Jamison. 2013. Fic: Why Fanfiction is Taking Over the World. Smart Pop, Dallas, TX.","paperID":"None"},{"content":"Henry Jenkins. 2006. Convergence Culture. NY University Press, NY, NY.","paperID":"None"},{"content":"Shannon Fay Johnson. 2014. Fan fiction metadata creation and utilization within fan fiction archives: Three primary models. Transformative Works and Cultures 17. http://doi.org/10.3983/twc.2014.0578","paperID":"None"},{"content":"Robert E. Kraut and Paul Resnick. 2011. Building Successful Online Communities: Evidence-Based Social Design. MIT Press, Cambridge, MA.","paperID":"None"},{"content":"Alexis Lothian. 2012. Archival anarchies: Online fandom, subcultural conservation, and the transformative work of digital ephemera. International Journal of Cultural Studies 16, 6, 541--556. http://doi.org/10.1177/1367877912459132","paperID":"None"},{"content":"Dawn Nafus. 2012. \"Patches don't have gender\": What is not open in open source software. New Media & Society 14, 4: 669--683. http://doi.org/10.1177/1461444811422887","paperID":"None"},{"content":"Linda Polin, Sheila Pisa, Bonnie Nardi, Sylvie Noel, and Dev Sen. 2015. Mediated search for information: Finding information and help inside and outside ravelry.com. The 2015 Annual Meeting of the American Educational Research Association.","paperID":"None"},{"content":"Irving Seidman. 1998. Interviewing as Qualitative Research. Teachers College Press, NY, NY.","paperID":"None"},{"content":"Lucy Suchman. 2009. Agencies in technology design: Feminist reconfigurations. Online Proceedings of the 5th European Symposium on Gender & ICT. Retrieved January 7, 2016 from http://www.informatik.unibremen.de/soteg/gict2009/proceedings/GICT2009_Suc hman.pdf","paperID":"None"},{"content":"Dave Thomas and Andy Hunt. 2004. Open Source Ecosystems. IEEE Software 21, 6, 89--91.","paperID":"None"},{"content":"Bogdan Vasilescu, Daryl Posnett, Baishakhi Ray, Mark G.J. van den Brand, Premkumar Devanbu, and Vladimir Filkov. 2015. Gender and tenure diversity in GitHub teams. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 3789--3798. http://doi.org/ 10.1145/2702123.2702549","paperID":"None"},{"content":"Karel Vredenburg, Ji-Ye Mao, Paul W. Smith, and Tom Carey. 2002. A survey of user-centered design practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02), 471478. http://doi.org/10.1145/503457.503460","paperID":"None"},{"content":"Congressional Hearing before the Subcommittee on Courts, Intellectual Property, and the Internet. 2014. The Scope of Fair Use. Retrieved January 7, 2016 from http://judiciary.house.gov/index.cfm/2014/1/thescope-of-fair-use","paperID":"None"}],"title":"An Archive of Their Own: A Case Study of Feminist HCI and Values in Design","filename":"CHI16/p2574","authors":["Casey Fiesler","Shannon Morrison","Amy S. Bruckman"],"conference":"CHI '16"}