{"paperId":2858375,"citation":[],"reference":[{"content":"Altman, B. Disability Definitions, Models, Classification Schemes and Applications. In Handbook of Disability Studies, G. L. Albrecht, K. D. Seelman, and M. Bury, Eds. Sage Publications, 2001.","paperID":"None"},{"content":"Bailey, S., Boddy, K., Briscoe, S., and Morris, C. Involving disabled children and young people as partners in research: a systematic review. Child: Care, Health and Development (Nov. 2014), n/a--n/a.","paperID":"None"},{"content":"Bichard, J.-A., Coleman, R., and Langdon, P. Does My Stigma Look Big in This? Considering Acceptability and Desirability in the Inclusive Design of Technology Products. In Proceedings of the 4th International Conference on Universal Access in Human Computer Interaction: Coping with Diversity, UAHCI'07, Springer-Verlag (Berlin, Heidelberg, 2007), 622--631.","paperID":"None"},{"content":"Bouck, E. C., Okolo, C. M., and Courtad, C. A. Technology at Home: Implications for Children with Disabilities. Journal of Special Education Technology 22, 3 (2007).","paperID":"None"},{"content":"Brock, A. M., Truillet, P., Oriola, B., Picard, D., and Jouffrais, C. Interactivity improves usability of geographic maps for visually impaired people. Human-Computer Interaction 30, 2 (2015), 156--194.","paperID":"None"},{"content":"Charmaz, K. Constructing Grounded Theory: A Practical Guide through Qualitative Analysis (Introducing Qualitative Methods series), 1 ed. Sage Publications Ltd, Jan. 2006.","paperID":"None"},{"content":"Connors, C., and Stalker, K. Children's experiences of disability -- pointers to a social model of childhood disability. Disability & Society 22, 1 (2006).","paperID":"None"},{"content":"Darzentas, D. P., Brown, M. A., Flintham, M., and Benford, S. The data driven lives of wargaming miniatures. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI '15, ACM (NY, NY, USA, 2015), 2427--2436.","paperID":"None"},{"content":"Davis, J. Conceptual Issues in Childhood and Disability. In Routledge Handbook of Disability Studies. Routledge, 2012.","paperID":"None"},{"content":"Dramas, F., Mace, M., Katz, B. F., and Jouffrais, C. Object Localization System for the Blind: Designing a User-Centered Auditory Interface. In Annual International Technology & Persons with Disabilities Conference (CSUN Conference), San Diego, CA, 22/03/2010--27/03/2010, CSUN Conference (http://www.csunconference.org/, Mar. 2010), (electronic medium).","paperID":"None"},{"content":"Druin, A. The role of children in the design of new technology. Behaviour and information technology 21, 1 (2002), 1--25.","paperID":"None"},{"content":"Fielder, A., Best, A., and Bax, M. The Management of Visual Impairment in Childhood. Clinics in developmental medicine. Mac Keith Press, 1993.","paperID":"None"},{"content":"Gaver, B., Dunne, T., and Pacenti, E. Design: cultural probes. interactions 6, 1 (1999), 21--29.","paperID":"None"},{"content":"Gotzelmann, T., and Pavkovic, A. Towards automatically generated tactile detail maps by 3d printers for blind persons. In Computers Helping People with Special Needs, K. Miesenberger, D. Fels, D. Archambault, P. Penaz, and W. Zagler, Eds., vol. 8548 of Lecture Notes in Computer Science. Springer International Publishing, 2014, 1--7.","paperID":"None"},{"content":"Graf, C. Verbally annotated tactile maps Challenges and approaches. In Spatial Cognition VII. Springer, 2010, 303--318.","paperID":"None"},{"content":"Gual, J., Puyuelo, M., and Loveras, J. Analysis of Volumetric Tactile Symbols Produced with 3d Printing. In ACHI 2012 (2012).","paperID":"None"},{"content":"Henderson, S., Skelton, H., and Rosenbaum, P. Assistive devices for children with functional impairments: impact on child and caregiver function. Developmental Medicine & Child Neurology 50, 2 (Feb. 2008), 89--98.","paperID":"None"},{"content":"Hu, P. J.-H., Clark, T. H., and Ma, W. W. Examining technology acceptance by school teachers: a longitudinal study. Information & Management 41, 2 (Dec. 2003), 227--241.","paperID":"None"},{"content":"Hurst, A., and Tobias, J. Empowering Individuals with Do-it-yourself Assistive Technology. In The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility, ASSETS '11, ACM (NY, NY, USA, 2011), 11--18.","paperID":"None"},{"content":"Hutchinson, H., Mackay, W., Westerlund, B., Bederson, B. B., Druin, A., Plaisant, C., Beaudouin-Lafon, M., Conversy, S., Evans, H., Hansen, H., and others. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2003), 17--24.","paperID":"None"},{"content":"Kawulich, B. Participant Observation as a Data Collection Method. Forum Qualitative Sozialforschung / Forum: Qualitative Social Research 6, 2 (2005).","paperID":"None"},{"content":"Kaye, J. J. Making scents: Aromatic output for hci. interactions 11, 1 (Jan. 2004), 48--61.","paperID":"None"},{"content":"Kim, D. W., and Ando, H. Development of directional olfactory display. In Proceedings of the 9th ACM SIGGRAPH Conference on Virtual-Reality Continuum and Its Applications in Industry, VRCAI '10, ACM (NY, NY, USA, 2010), 143--144.","paperID":"None"},{"content":"Kim, J., and Yeh, T. Toward 3d-printed movable tactile pictures for children with visual impairments. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI '15, ACM (NY, NY, USA, 2015), 2815--2824.","paperID":"None"},{"content":"Kinoe, Y., and Noguchi, A. Qualitative Study for the Design of Assistive Technologies for Improving Quality of Life of Visually Impaired. In Human Interface and the Management of Information. Information and Knowledge in Applications and Services, S. Yamamoto, Ed., vol. 8522 of Lecture Notes in Computer Science. Springer International Publishing, 2014, 602--613.","paperID":"None"},{"content":"Kortum, P. HCI Beyond the GUI: Design for Haptic, Speech, Olfactory, and Other Nontraditional Interfaces. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 2008.","paperID":"None"},{"content":"Lai, M.-K. Universal scent blackbox: Engaging visitors communication through creating olfactory experience at art museum. In Proceedings of the 33rd Annual International Conference on the Design of Communication, SIGDOC '15, ACM (NY, NY, USA, 2015), 27:1--27:6.","paperID":"None"},{"content":"Laufs, U., Ruff, C., and Zibuschka, J. Mt4j - A cross-platform multi-touch development framework. CoRR abs/1012.0467 (2010).","paperID":"None"},{"content":"Mackay, W. E., and Fayard, A.-L. HCI, natural science and design: a framework for triangulation across disciplines. In Proceedings of the 2nd conference on Designing interactive systems: processes, practices, methods, and techniques, ACM (1997), 223--234.","paperID":"None"},{"content":"Malinverni, L., MoraGuiard, J., Padillo, V., Mairena, M., Hervas, A., and Pares, N. Participatory Design Strategies to Enhance the Creative Contribution of Children with Special Needs. In Proceedings of the 2014 Conference on Interaction Design and Children, IDC '14, ACM (NY, NY, USA, 2014), 85--94.","paperID":"None"},{"content":"Manshad, M., Pontelli, E., and Manshad, S. Trackable interactive multimodal manipulatives: Towards a tangible user environment for the blind. In Computers Helping People with Special Needs, K. Miesenberger, A. Karshmer, P. Penaz, and W. Zagler, Eds., vol. 7383 of Lecture Notes in Computer Science. Springer Berlin Heidelberg, 2012, 664--671.","paperID":"None"},{"content":"McElligot, J., and van Leeuwen, L. Designing Sound Tools and Toys For Blind and Visually Impaired Children. In IDC, ACM (2004), 65--72.","paperID":"None"},{"content":"McGookin, D., Robertson, E., and Brewster, S. Clutching at straws: Using tangible interaction to provide non-visual access to graphs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '10, ACM (NY, NY, USA, 2010), 1715--1724.","paperID":"None"},{"content":"Miele, J. A., Landau, S., and Gilden, D. Talking TMAP: automated generation of audio-tactile maps using Smith-Kettlewell's TMAP software. The British Journal of Visual Impairment 24, 2 (2006).","paperID":"None"},{"content":"Murer, M., Aslan, I., and Tscheligi, M. Lollio: Exploring taste as playful modality. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction, TEI '13, ACM (NY, NY, USA, 2013), 299--302.","paperID":"None"},{"content":"Murphy, E., Bates, E., and Fitzpatrick, D. Designing auditory cues to enhance spoken mathematics for visually impaired users. In Proceedings of the 12th International ACM SIGACCESS Conference on Computers and Accessibility, ASSETS '10, ACM (NY, NY, USA, 2010), 75--82.","paperID":"None"},{"content":"Organization, W. H. Health topics Disabilities, 2014.","paperID":"None"},{"content":"Organization, W. H. Visual disturbances and blindness (H53-H54), 2015.","paperID":"None"},{"content":"Parkes, D. Audio tactile systems for complex environments as a vision impaired person (1994).","paperID":"None"},{"content":"Patomaki, S., Raisamo, R., Salo, J., Pasto, V., and Hippula, A. Experiences on haptic interfaces for visually impaired young children. In Proceedings of the 6th international conference on Multimodal interfaces, ACM (2004), 281--288.","paperID":"None"},{"content":"Petit, G., Dufresne, A., Levesque, V., Hayward, V., and Trudeau, N. Refreshable Tactile Graphics Applied to Schoolbook Illustrations for Students with Visual Impairment (2008).","paperID":"None"},{"content":"Phillips, B., and Zhao, H. Predictors of Assistive Technology Abandonment. Assistive Technology 5, 1 (1993).","paperID":"None"},{"content":"Pielot, M., Henze, N., Heuten, W., and Boll, S. Tangible user interface for the exploration of auditory city maps. In Haptic and Audio Interaction Design, I. Oakley and S. Brewster, Eds., vol. 4813 of Lecture Notes in Computer Science. Springer Berlin Heidelberg, 2007, 86--97.","paperID":"None"},{"content":"Potter, L. E., Korte, J., and Nielsen, S. Design with the deaf: do deaf children need their own approach when designing technology? ACM Press (2014), 249--252.","paperID":"None"},{"content":"Rassmus-Grohn, K., Magnusson, C., and Eftring, H. E. Iterative design of an audio-haptic drawing application. In CHI'07 Extended Abstracts on Human Factors in Computing Systems, ACM (2007), 2627--2632.","paperID":"None"},{"content":"Roe, J. Social inclusion: meeting the socio-emotional needs of children with vision needs. British Journal of Visual Impairment 26, 2 (2008), 147--158.","paperID":"None"},{"content":"Rouby, C., Schaal, B., Dubois, D., Gervais, R., and Holley, A., Eds. Olfaction, Taste, and Cognition. Cambridge University Press, 2002. Cambridge Books Online.","paperID":"None"},{"content":"Sanchez, J., and Elias, M. Guidelines for designing mobility and orientation software for blind children. In Human-Computer Interaction?INTERACT 2007. Springer, 2007, 375--388.","paperID":"None"},{"content":"Schon, D. A. The reflective practitioner: How professionals think in action, vol. 5126. Basic Books, 1984.","paperID":"None"},{"content":"Shams, L., and Seitz, A. R. Benefits of Multisensory Learning. Trends in Cognitive Sciences 12, 11 (2008), 411--417.","paperID":"None"},{"content":"Steinfeld, E., and Maisel, J. L. Universal design creating inclusive environments. John Wiley & Sons, Hoboken, N.J., 2012.","paperID":"None"},{"content":"Ullmer, B., and Ishii, H. Emerging frameworks for tangible user interfaces. IBM Syst. J. 39, 3--4 (July 2000), 915--931.","paperID":"None"},{"content":"Wang, Z., Li, B., Hedgpeth, T., and Haven, T. Instant tactile-audio map: Enabling access to digital maps for people with visual impairment. In Proceedings of the 11th International ACM SIGACCESS Conference on Computers and Accessibility, Assets '09, ACM (NY, NY, USA, 2009), 43--50.","paperID":"None"},{"content":"Winberg, F., and Bowers, J. Assembling the senses: towards the design of cooperative interfaces for visually impaired users. In Proceedings of the 2004 ACM conference on Computer supported cooperative work, ACM (2004), 332--341.","paperID":"None"},{"content":"Zeng, L., and Weber, G. Accessible Maps for the Visually Impaired. In Proceedings of IFIP INTERACT 2011 Workshop on ADDW, CEUR, vol. 792 (2011), 54--60.","paperID":"None"}],"abstract":"We report on the design process leading to the creation of MapSense, a multi-sensory interactive map for visually impaired children. We conducted a formative study in a specialized institute to understand children's educational needs, their context of care and their preferences regarding interactive technologies. The findings (1) outline the needs for tools and methods to help children to acquire spatial skills and (2) provide four design guidelines for educational assistive technologies. Based on these findings and an iterative process, we designed and deployed MapSense in the institute during two days. It enables collaborations between children with a broad range of impairments, proposes reflective and ludic scenarios and allows caretakers to customize it as they wish. A field experiment reveals that both children and caretakers considered the system successful and empowering.","title":"MapSense: Multi-Sensory Interactive Maps for Children Living with Visual Impairments","filename":"CHI16/p445","authors":["Emeline Brule","Gilles Bailly","Anke Brock","Frederic Valentin","Grégoire Denis","Christophe Jouffrais"],"conference":"CHI '16"}