{"paperId":2858526,"abstract":"Desktop users frequently open and switch between multiple windows. Here we present an experiment comparing 3 window switching interfaces: the Cards interface spreads windows out like a vertical stack of cards with the most recent window at the front; the Mosaic interface places each window in a grid ordered by recency; and, the Exposé interface provides an map-like overview based on the relative size and position of windows. Experimental results suggest that the Mosaic interface scales, enabling faster window selection than the Cards interface and less erroneous window selection than the Exposé interface.","reference":[{"content":"Bly, S. A. and Rosenberg, J. K. 1986. A comparison of tiled and overlapping windows. Proc. CHI'86, ACM Press, 101--106.","paperID":"None"},{"content":"Card S. K. and Henderson, A. 1987. A Multiple, Virtual-Workspace Interface to Support User Task Switching. Proc CHI'87, ACM Press, 53--59.","paperID":"None"},{"content":"Hutchings, D. R., Smith, G., Meyers, B., Czerwinski, M., Robertson, G. 2004. Display space usage and window management operation comparisons between single monitor and multiple monitor users. Proc. AVI'04, ACM Press, 32--39.","paperID":"None"},{"content":"Kandogan, E. and Shneiderman, B. Elastic windows: Evaluation of multi-window operations. Proc. CHI'97, ACM Press, 250--257.","paperID":"None"},{"content":"Robertson, G., Horvitz, E., Czerwinski, M., Baudisch, P, Hutchings, D., Meyers, B., Robbins, D. and Smith, G. 2004. Scalable Fabric: Flexible task management. Proc AVI'04, ACM Press, 85--89.","paperID":"None"},{"content":"Robertson, G., van Dantzich, M., Robbins, D., Czerwinski, M., Hinckley, K., Risden, K., Thiel, D. and Gorokhovsky, V. 2000. The task gallary: a 3D window manager. Proc CHI'00, ACM Press, 494--501.","paperID":"None"},{"content":"Smith, G., Baudisch, P., Robertson, G., Czerwinski, M., Meyers, B., Robbins, D. and Andrews, D. 2003. GroupBar: the taskbar evolved. Proc OZCHI'03, ACM Press, 34--43.","paperID":"None"},{"content":"Tak, S., Scarr, J., Gutwin, C. and Cockburn, A. 2011. Supporting Window Switching with Spatially Consistent Thumbnail Zones: Design and Evaluation. Proc INTERACT'11, LNCS 6946, 331--347.","paperID":"None"},{"content":"Warr, A. and Chi, E. H. 2013. Swipe vs. scroll: web page switching on mobile browsers. Proc CHI'13, ACM Press, 2171--2174.","paperID":"None"}],"citation":[],"title":"Window Shopping: A Study of Desktop Window Switching","filename":"CHI16/p3335","authors":["Andrew Warr","Ed H. Chi","Helen Harris","Alexander Kuscher","Jenn Chen","Robert Flack","Nicholas Jitkoff"],"conference":"CHI '16"}