{"paperId":2858423,"abstract":"In the past few years an unprecedented wave of anti-abortion policies were introduced and enacted in state governments in the U.S., affecting millions of constituents. We study this rapid spread of policy change as a function of the underlying ideology of constituents. We examine over 200,000 public messages posted on Twitter surrounding abortion in the year 2013, a year that saw 82 new anti-abortion policies enacted. From these posts, we characterize people's expressions of opinion on abortion and show how these expressions align with policy change on these issues. We detail a number of ideological differences between constituents in states enacting anti versus pro-abortion policies, such as a tension between the moral values of purity versus fairness, and a differing emphasis on the fetus versus the pregnant woman. We also find significant differences in how males versus females discuss the issue of abortion, including greater emphasis on health and religion by males. Using these measures to characterize states, we can construct models to explain the spread of abortion policy from state to state and project which types of abortion policies a state will introduce. Models defining state similarity using our Twitter-based measures improved policy projection accuracy by 7.32% and 12.02% on average over geographic and poll-based ideological similarity, respectively. Additionally, models constructed from the expressions of male-only constituents perform better than models from the expressions of female-only constituents, suggesting that the ideology of men is more aligned with the recent spread of anti-abortion legislation than that of women.","citation":[],"reference":[{"content":"Paula L Abrams. 2013. The Scarlet Letter: The Supreme Court and the language of abortion stigma. Michigan Journal of Gender & Law 19 (2013), 2012-8.","paperID":"None"},{"content":"Michael B Berkman and Robert E O'Connor. 1993. Do women legislators matter? Female legislators and state abortion policy. American Politics Research 21, 1 (1993), 102-124.","paperID":"None"},{"content":"Frances S Berry and William D Berry. 1990. State lottery adoptions as policy innovations: An event history analysis. American political science review 84, 02 (1990), 395-415.","paperID":"None"},{"content":"Heather D Boonstra and Elizabeth Nash. 2014. A Surge of State Abortion Restrictions Puts Providers - and the Women They Serve In the Crosshairs. Guttmacher Policy Review 17, 1 (Winter 2014).","paperID":"None"},{"content":"Raviv Cohen and Derek Ruths. 2013. Classifying Political Orientation on Twitter: It's Not Easy!. In Proc. of ICWSM. AAAI.","paperID":"None"},{"content":"Celeste M Condit. 1994. Decoding abortion rhetoric: Communicating social change. University of Illinois Press.","paperID":"None"},{"content":"Michael Conover, Clayton Davis, Emilio Ferrara, Karissa McKelvey, Filippo Menczer, and Alessandro Flammini. 2013. The geospatial characteristics of a social movement communication network. PloS one 8, 3 (2013).","paperID":"None"},{"content":"Michael Conover, Jacob Ratkiewicz, Matthew Francisco, Bruno Goncalves, Filippo Menczer, and Alessandro Flammini. 2011. Political Polarization on Twitter. In Proc. of ICWSM. AAAI.","paperID":"None"},{"content":"Elizabeth A Cook, Ted G Jelen, William C Wilcox, and Clyde Wilcox. 1992. Between two absolutes: Public opinion and the politics of abortion. Westview Press.","paperID":"None"},{"content":"Munmun De Choudhury, Scott Counts, and Eric Horvitz. 2013. Major life changes and behavioral markers in social media: Case of childbirth. In Proc. of CSCW. ACM, 1431-1442.","paperID":"None"},{"content":"Myra Marx Ferree. 2003. Resonance and Radicalism: Feminist Framing in the Abortion Debates of the USA and Germany. Amer. J. Sociology 109, 2 (2003), 304-344.","paperID":"None"},{"content":"Lawrence B Finer, Lori F Frohwirth, Lindsay A Dauphinee, Susheela Singh, and Ann M Moore. 2005. Reasons US women have abortions: quantitative and qualitative perspectives. Perspectives on sexual and reproductive health 37, 3 (2005), 110-118.","paperID":"None"},{"content":"The Sunlight Foundation. 2015 (accessed on September 23rd, 2015). Scout: Abortion Bills. https://scout.sunlightfoundation.com/search/ state_bills/*abortion.","paperID":"None"},{"content":"Gallup. 2015 (accessed on September 2nd, 2015)b. The State of the States. http://www.gallup.com/poll/125066/State-States.aspx.","paperID":"None"},{"content":"Gallup. 2015 (accessed on September 7th, 2015)a. Americans Choose Pro-Choice for the First Time in Seven Years. http://www.gallup.com/poll/183434/americans-choose-pro-choice-first-time-seven-years.aspx.","paperID":"None"},{"content":"Daniel Gayo-Avello. 2013. A meta-analysis of state-of-the-art electoral prediction from Twitter data. Social Science Computer Review (2013).","paperID":"None"},{"content":"Martin Gilens. 2012. Affluence and influence: Economic inequality and political power in America. Princeton University Press.","paperID":"None"},{"content":"Marianne Githens and Dorothy M Stetson. 2013. Abortion politics: Public policy in cross-cultural perspective. Routledge.","paperID":"None"},{"content":"Jesse Graham, Jonathan Haidt, and Brian A Nosek. 2009. Liberals and conservatives rely on different sets of moral foundations. Journal of personality and social psychology 96, 5 (2009), 1029.","paperID":"None"},{"content":"Jesse Graham, Brian A Nosek, Jonathan Haidt, Ravi Iyer, Spassena Koleva, and Peter H Ditto. 2011. Mapping the moral domain. Journal of personality and social psychology 101, 2 (2011), 366.","paperID":"None"},{"content":"Lawrence J Grossback, Sean Nicholson-Crotty, and David AM Peterson. 2004. Ideology and learning in policy diffusion. American Politics Research 32, 5 (2004), 521-545.","paperID":"None"},{"content":"Donald P Haider-Markel. 2001. Policy diffusion as a geographical expansion of the scope of political conflict: Same-sex marriage bans in the 1990s. State Politics & Policy Quarterly 1, 1 (2001), 5-26.","paperID":"None"},{"content":"Brent Hecht and Monica Stephens. 2014. A tale of cities: Urban biases in volunteered geographic information. In Proc. of ICWSM. AAAI.","paperID":"None"},{"content":"Guttmacher Institute. 2015 (accessed on September 2nd, 2015). Monthly State Update Archive: Major Actions. http://www.guttmacher.org/statecenter/updates/archive.html.","paperID":"None"},{"content":"Kathleen H Jamieson and Paul Waldman. 2002. The press effect: Politicians, journalists, and the stories that shape the political world. Oxford University Press.","paperID":"None"},{"content":"Spassena P Koleva, Jesse Graham, Ravi Iyer, Peter H Ditto, and Jonathan Haidt. 2012. Tracing the threads: How five moral concerns (especially Purity) help explain culture war attitudes. Journal of Research in Personality 46, 2 (2012), 184-194.","paperID":"None"},{"content":"Mor Naaman, Amy X Zhang, Samuel Brody, and Gilad Lotan. 2012. On the Study of Diurnal Urban Routines on Twitter. In Proc. of ICWSM. AAAI.","paperID":"None"},{"content":"Matthew L Newman, Carla J Groom, Lori D Handelman, and James W Pennebaker. 2008. Gender differences in language use: An analysis of 14,000 text samples. Discourse Processes 45, 3 (2008), 211-236.","paperID":"None"},{"content":"Barbara Norrander and Clyde Wilcox. 1999. Public opinion and policymaking in the states: The case of post-Roe abortion policy. Policy Studies Journal 27, 4 (1999), 707.","paperID":"None"},{"content":"Benjamin I Page and Robert Y Shapiro. 1983. Effects of public opinion on policy. American political science review 77, 01 (1983), 175-190.","paperID":"None"},{"content":"Michael J Paul and Mark Dredze. 2011. You are what you Tweet: Analyzing Twitter for public health. In Proc. of ICWSM. AAAI, 265-272.","paperID":"None"},{"content":"James W Pennebaker, Cindy K Chung, Molly Ireland, Amy Gonzales, and Roger J Booth. 2007. The development and psychometric properties of LIWC2007. (2007).","paperID":"None"},{"content":"Pew. 2013 (accessed on September 8th, 2015). Abortion Viewed in Moral Terms. http://www.pewforum.org/2013/08/15/abortion-viewed-in-moral-terms/.","paperID":"None"},{"content":"Paul Resnick, Neophytos Iacovou, Mitesh Suchak, Peter Bergstrom, and John Riedl. 1994. GroupLens: an open architecture for collaborative filtering of netnews. In Proceedings of the 1994 ACM conference on Computer supported cooperative work. ACM, 175-186.","paperID":"None"},{"content":"Eduardo J Ruiz, Vagelis Hristidis, Carlos Castillo, Aristides Gionis, and Alejandro Jaimes. 2012. Correlating flnancial time series with micro-blogging activity. In Proceedings of the fifth ACM international conference on Web search and data mining. ACM, 513-522.","paperID":"None"},{"content":"Kate Starbird and Leysia Palen. 2012. (How) will the revolution be retweeted?: information diffusion and the 2011 Egyptian uprising. In Proceedings of the acm 2012 conference on computer supported cooperative work. ACM, 7-16.","paperID":"None"},{"content":"Dorothy McBride Stetson. 2001. Abortion Politics, Women's Movements, and the Democratic State: A Comparative Study of State Feminism: A Comparative Study of State Feminism. OUP Oxford.","paperID":"None"},{"content":"Amy X Zhang and Scott Counts. 2015. Modeling Ideology and Predicting Policy Change with Social Media: Case of Same-Sex Marriage. In Proceedings of the SIGCHI conference on human factors in computing systems.","paperID":"None"}],"title":"Gender and Ideology in the Spread of Anti-Abortion Policy","filename":"CHI16/p3378","authors":["Amy X. Zhang","Scott Counts"],"conference":"CHI '16"}