{"paperId":2858393,"citation":[],"reference":[{"content":"Syed Ishtiaque Ahmed, Maruf Zaber, Mehrab Bin Morshed, Md. Habibullah Bin Ismail, Dan Cosley, and Steven J. Jackson. 2015. Suhrid: A Collaborative Mobile Phone Interface for Low Literate People. In Proceedings of ACM Symposium on Computing for Development (DEV'15), ACM, NY, NY, USA, 1085--1094.","paperID":"None"},{"content":"Victoria Bellotti, Alexander Ambard, Daniel Turner, Christina Gossmann, Kamila Demkova, and John M. Carroll. 2015. A Muddle of Models of Motivation for Using Peer-to-Peer Economy Systems. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1085--1094.","paperID":"None"},{"content":"Nicola J. Bidwell. \"Moving the centre to design social media in rural Africa.\" AI & SOCIETY (2014): 1--27.","paperID":"None"},{"content":"Nicola J Bidwell, Mounia Lalmas, Gary Marsden, Bongiwe Dlutu, Senzo Ntlangano, Azola Manjingolo, William D. Tucker, Matt Jones, Simon Robinson, and Elina Vartiainen. \"Please call ME. NU 4EVER: designing for 'callback' in rural Africa.\" (2011).","paperID":"None"},{"content":"Pernille Bjørn, and Nina Boulus-Rødje. \"The multiple intersecting sites of design in CSCW research.\" Computer Supported Cooperative Work (CSCW) 24, no. 4 (2015): 319--351.","paperID":"None"},{"content":"Josh Borstein. 2015. The great Uber fairness fallacy: as a driver, how do you bargain with an app? Article. Retrieved on 24/9/15 from http://www.theguardian.com/technology/2015/aug/24/uber-fairness-independent-contractors-employees-rights","paperID":"None"},{"content":"John Bowers, Graham Button, and Wes Sharrock. \"Workflow from within and without: technology and cooperative work on the print industry shopfloor.\" In Proceedings of the Fourth European Conference on Computer-Supported Cooperative Work ECSCW'95, pp. 51--66. Springer Netherlands, 1995.","paperID":"None"},{"content":"Graham Button. (1993). Technology in working order: Studies of work, interaction, and technology. Routledge","paperID":"None"},{"content":"Graham Button. (2000). The ethnographic tradition and design. Design studies. 21. 319--333","paperID":"None"},{"content":"Graham Button and Wes Sharrock (1997). The production of order and the order of production: possibilities for distributed organisations, work and technology in the print industry. In Proceedings of the Fifth European Conference on Computer Supported Cooperative Work (pp. 1--16). Springer Netherlands","paperID":"None"},{"content":"Bryant Cannon and Hanna Chung, A Framework for Designing Co-Regulation Models Well-Adapted to Technology-Facilitated Sharing Economies, 31 San-ta Clara High Tech. L.J. 23 (2015). Retrieved on 23/9/15 from http://digitalcommons.law.scu.edu/cgi/viewcontent.cgi?article=1589&context=chtlj","paperID":"None"},{"content":"Stefania Castellani, Antonietta Grasso, Jacki O'Neill and Frederic Roulland. (2009). Designing technology as an embedded resource for troubleshooting. JCSCW, 18(2--3), 199--227.","paperID":"None"},{"content":"Radha Chanchani and Fagun Rajkotia (CiSTUP). A study of the Auto-Rickshaw sector in Bangalore City Suggestions for Improved Governance. 20012. Retrieved on 22/09/15 from http://cistup.iisc.ernet.in/pdf/newsandevents/Autorickshaws-Blore_FinalReport_Dec12_Cistup.pdf","paperID":"None"},{"content":"Civitas Consultancies Pvt Ltd for City Connect Foundation Chennai (CCCF). Study on the Auto-rickshaw sector in Chennai. December 2010. Retrieved on 24/09/15 from http://chennaicityconnect.com/wp-content/uploads/2011/03/Auto-Study-Chennai.pdf","paperID":"None"},{"content":"Andy Crabtree. 2003. Designing Collaborative Systems: A Practical Guide to Ethnography, Springer","paperID":"None"},{"content":"Tawanna R. Dillahunt and Amelia R. Malone. 2015. The Promise of the Sharing Economy among Disadvantaged Communities. Proceedings of CHI '15. ACM, NY, NY, USA, 2285--2294.","paperID":"None"},{"content":"Jonathan Donner. \"The rules of beeping: exchanging messages via intentional \"missed calls\" on mobile phones.\" Journal of Computer-Mediated Communication 13.1 (2007): 1--22.","paperID":"None"},{"content":"Paul Dourish and Genevieve Bell. 2011. Divining a Digital Future: Mess and Mythology in Ubiquitous Computing. MIT Press. Cambridge, Mass, London, England","paperID":"None"},{"content":"Silvia Elaluf-Calderwood and Carsten Sørensen. 420 years of mobility: ICT enabled mobile interdependencies in London hackney cab work. Routledge, 2008.","paperID":"None"},{"content":"Alek Felstiner. 2011. Working the crowd: employment and labor law in the crowdsourcing industry. Berkeley Journal of Employment and Labor Law, Vol. 32, No. 1, 2011.","paperID":"None"},{"content":"Harold Garfinkel (1967) Studies in ethnomethodology. Englewood Cliffs, NJ: Prentice-Hall","paperID":"None"},{"content":"Fabien Girardin and Josep Blat. \"The co-evolution of taxi drivers and their in-car navigation systems.\" Pervasive and Mobile Computing 6.4 (2010): 424--434.","paperID":"None"},{"content":"Neha Gupta, David Martin, Benjamin V. Hanrahan, and Jacki O'Neill. \"Turk-Life in India.\" In Proceedings of the 18th International Conference on Supporting Group Work, pp. 1--11. ACM, 2014.","paperID":"None"},{"content":"Ruey-Lin Hsiao, Se-Hwa Wu, and Sheng-Tsung Hou. \"Sensitive cabbies: Ongoing sense-making within technology structuring.\" Information and Organization 18.4 (2008): 251--279.","paperID":"None"},{"content":"John Hughes, Val King, Tom Rodden, and Hans Andersen. \"Moving out from the control room: ethnography in system design.\" In Proceedings of the 1994 ACM conference on Computer supported cooperative work, pp. 429--439. ACM, 1994.","paperID":"None"},{"content":"Tapio Ikkala and Airi Lampinen. \"Monetizing Network Hospitality: Hospitality and Sociability in the Context of Airbnb.\" In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, pp. 1033--1044. ACM, 2015.","paperID":"None"},{"content":"Lilly C. Irani and M. Six Silberman. 2013. Turkopticon: interrupting worker invisibility in amazon mechanical turk. In Proceedings of CHI '13. ACM, NY, NY, USA, 611--620.","paperID":"None"},{"content":"Emily Isaac (2014) Disruptive Innovation: Risk-Shifting and Precarity in the Age of Uber. Berkeley Roundtable on the International Economy BRIE Working Paper 2014--7. December 7, 2014. brie.berkeley.edu","paperID":"None"},{"content":"Benjamin Jen, Jashanjit Kaur, Jonathan De Heus, and Tawanna R. Dillahunt. 2014. Analyzing employment technologies for economically distressed individuals. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 1945--1950.","paperID":"None"},{"content":"Aniket Kittur, Jeffrey V. Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease, and John Horton. \"The future of crowd work.\" In Proceedings of the 2013 conference on Computer supported cooperative work, pp. 1301--1318. ACM, 2013.","paperID":"None"},{"content":"Airi MI.Lampinen, Account sharing in the context of networked hospitality exchange. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 2014.","paperID":"None"},{"content":"Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with Machines: The Impact of Algorithmic and Data-Driven Management on Human Workers. In Proceedings of CHI '15. ACM, NY, NY, USA, 1603--1612.","paperID":"None"},{"content":"Gilly Leshed, Theresa Velden, Oya Rieger, Blazej Kot, and Phoebe Sengers. \"In-car gps navigation: engagement with and disengagement from the environment.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 1675--1684. ACM, 2008.","paperID":"None"},{"content":"Moira McGregor, Barry Brown and Mereike Gloss. 2015 Disrupting the cab: Uber, Ridesharing and the Taxi Industry. Journal of Peer Production. Issue 6. Retrieved on 23/09/15 from http://peerproduction.net/issues/issue-6-disruption-and-the-law/essays/disrupting-the-cab-uber-ridesharing-and-the-taxi-industry/","paperID":"None"},{"content":"David Martin, Benjamin V. Hanrahan, Jacki O'Neill, and Neha Gupta. \"Being a turker.\" In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, pp. 224--2 ACM, 2014.","paperID":"None"},{"content":"David Martin, Jacki O'Neill, Neha Gupta, Benjamin V. Hanrahan (In press). Turking in a Global Labour Market. To appear in JCSCW 2016. 25 (1). Springer.","paperID":"None"},{"content":"Indrani Medhi, Aman Sagar, and Kentaro Toyama. \"Text-free user interfaces for illiterate and semi-literate users.\" Information and Communication Technologies and Development, 2006. ICTD'06. International Conference on. IEEE, 2006","paperID":"None"},{"content":"Toon Meelan and Koen Frenken. 2015. Stop Saying Uber Is Part Of The Sharing Economy. Blog. Retrieved 22/09/15 from http://www.fastcoexist.com/3040863/stop-saying-uber-is-part-of-the-sharing-economy","paperID":"None"},{"content":"Evgeny Morozov The 'sharing economy' under-mines workers' rights. Blog retrieved on 23/9/15 from http://www.ft.com/intl/cms/s/0/92c3021c-34c2--11e3-8148-00144feab7de.html","paperID":"None"},{"content":"Subhashree Natarajan and T.K.T Sheik Abdullah. Social Organizations: Decongesting the Muddled Economies of Auto-Rickshaw Drivers in India. In World Applied Sciences Journal 30 (7): 831--837, 2014.","paperID":"None"},{"content":"P2P Foundation. Peer. Retrieved on 23/09/15 from http://p2pfoundation.net/peer","paperID":"None"},{"content":"Tapan Parikh, Kaushik Ghosh, and Apala Chavan. 2003. Design studies for a financial management system for micro-credit groups in rural India. In Proceedings of the ACM Conference on Universal Usability (CUU'03), 15--22.","paperID":"None"},{"content":"Neil Patel, Deepti Chittamuru, Anupam Jain, Paresh Dave, and Tapan Parikh. 2010, Avaaj otalo: A field study of an interactive voice forum for small farmers in rural India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10), 733--742.","paperID":"None"},{"content":"Gary Pritchard, John Vines, Pam Briggs, Lisa Thomas, and Patrick Olivier. \"Digitally driven: how location based services impact the work practices of London bus drivers.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 3617--3626. ACM, 2014.","paperID":"None"},{"content":"David Randall, Richard Harper, and Mark Rouncefield. Fieldwork for design: theory and practice. Springer Science & Business Media, 2007.","paperID":"None"},{"content":"Noopur Raval and Paul Dourish. Standing Out from the Crowd: Emotional Labor, Body Labor, and Temporal Labor in Ridesharing. To appear in P. Bjorn and D. Konstan (Eds): Proceedings of Computer-Supported Cooperative Work 2016, February 27 - March 2 2016. NY: ACM press.Robinson, W. I. (2009) Saskia Sassen and the Sociology of Globalization: A Critical Appraisal. Sociological Analysis. Spring 2009","paperID":"None"},{"content":"Evan Rawley and Timothy S. Simcoe (2012) Information Technology, Productivity, and Asset Owner-ship: Evidence from Taxicab Fleets. Organization Science Articles in Advance, pp. 1-15","paperID":"None"},{"content":"Lisa Rayle, Susan Shaheen, Nelson Chan, Danielle Dai, and Robert Cervero. 2014. App-Based, On-Demand Ride Services: Comparing Taxi and Ridesourcing Trips and User Characteristics in San Francisco, University of California: Berkeley","paperID":"None"},{"content":"Mark Rouncefield, John A. Hughes, Tom Rodden, and Stephen Viller. \"Working with \"constant interruption\": CSCW and the small office.\" In Proceedings of the 1994 ACM conference on Computer supported cooperative work, pp. 275--286. ACM, 1994.","paperID":"None"},{"content":"Patricia Sachs (1995). Transforming Work: Collaboration, Learning and Design. Communications of the ACM, Vol. 38, No 9. 36--44","paperID":"None"},{"content":"Niloufar Salehi, Lilly Irani, Michael Bernstein, Ali Alkhatib, Eva Ogbe, and Kristy Milland (2015). We Are Dynamo: Overcoming Stalling and Friction in Collective Action for Crowd Workers. In B. Begole and J. Kim (Eds): Proceedings of CHI 2015, Seoul, South Korea, April 18--23, 2015. NY: ACM press, pp. 1621--1630","paperID":"None"},{"content":"Amartya Sen. 2001. Development As Freedom. Oxford University Press","paperID":"None"},{"content":"Patrick C.Shih, Victoria Bellotti, Kyungsik Han, and John M. Carroll. \"Unequal Time for Unequal Value: Implications of Differing Motivations for Participation in Timebanking.\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, pp. 1075--1084. ACM, 2015.","paperID":"None"},{"content":"Lucy A. Suchman. 1987. Plans and Situated Actions: The Problem of Human-Machine Communication. Cambridge University Press","paperID":"None"},{"content":"Lucy Suchman \"Making work visible.\" Communications of the ACM 38.9 (1995): 56-ff.","paperID":"None"},{"content":"Jacob Thebault-Spieker, Loren G. Terveen, and Brent Hecht. 2015. Avoiding the South Side and the Suburbs: The Geography of Mobile Crowdsourcing Markets. In Proceedings CSCW '15. ACM, NY, NY, USA, 265--275.","paperID":"None"},{"content":"Kentaro Toyama. 2015. Geek Heresy: Rescuing Social Change from the Cult of Technology. Public Affairs.","paperID":"None"},{"content":"Stacco Troncoso. 2014 Is Sharewashing the new Greenwashing? Blog retrieved on 22/9/2014 from http://blog.p2pfoundation.net/is-sharewashing-the-new-greenwashing/2014/05/23","paperID":"None"},{"content":"Urban Mass Transit Company Limited. Bangalore Mobility Indicators 2010--11. Submitted to Directorate of Urban Land Transport (DULT). Dec 2011. Retrieved 22/09/2015 from http://www.urbantransport.kar.gov.in/Bangalore%20Mobility%20Indicators_(22--12--2011).pdf","paperID":"None"}],"abstract":"This paper contributes to the growing literature on peer-to-peer (P2P) applications through an ethnographic study of auto-rickshaw drivers in Bengaluru, India. We describe how the adoption of a P2P application, Ola, which connects passengers to rickshaws, changes drivers work practices. Ola is part of the 'peer services' phenomenon which enable new types of ad-hoc trade in labour, skills and goods. Auto-rickshaw drivers present an interesting case because prior to Ola few had used Smartphones or the Internet. Furthermore, as financially vulnerable workers in the informal sector, concerns about driver welfare become prominent. Whilst technologies may promise to improve livelihoods, they do not necessarily deliver [57]. We describe how Ola does little to change the uncertainty which characterizes an auto drivers' day. This leads us to consider how a more equitable and inclusive system might be designed.","title":"Peer-to-peer in the Workplace: A View from the Road","filename":"CHI16/p5063","authors":["Syed Ishtiaque Ahmed","Nicola J. Bidwell","Himanshu Zade","Srihari H. Muralidhar","Anupama Dhareshwar","Baneen Karachiwala","Cedrick N. Tandong","Jacki O'Neill"],"conference":"CHI '16"}