{"paperId":2858243,"citation":[],"abstract":"RFID tags can be used to add inexpensive, wireless, batteryless sensing to objects. However, quickly and accurately estimating the state of an RFID tag is difficult. In this work, we show how to achieve low-latency manipulation and movement sensing with off-the-shelf RFID tags and readers. Our approach couples a probabilistic filtering layer with a monte-carlo-sampling-based interaction layer, preserving uncertainty in tag reads until they can be resolved in the context of interactions. This allows designers' code to reason about inputs at a high level. We demonstrate the effectiveness of our approach with a number of interactive objects, along with a library of components that can be combined to make new designs.","reference":[{"content":"Xiaojun Bi and Shumin Zhai. 2013. Bayesian touch: a statistical criterion of target selection with finger touch. In The 26th Annual ACM Symposium on User Interface Software and Technology, UIST'13, St. Andrews, United Kingdom, October 8--11, 2013. 51-60. DOI: http://dx.doi.org/10.1145/2501988.2502058","paperID":"None"},{"content":"Michael Buettner, Richa Prasad, Matthai Philipose, and David Wetherall. 2009. Recognizing daily activities with RFID-based sensors. In UbiComp 2009: Ubiquitous Computing, 11th International Conference, UbiComp 2009, Orlando, FL, USA, September 30 - October 3, 2009, Proceedings. 51-60. DOI: http://dx.doi.org/10.1145/1620545.1620553","paperID":"None"},{"content":"Stuart K Card, Allen Newell, and Thomas P Moran. 1983. The psychology of human-computer interaction. L. Erlbaum Associates Inc.","paperID":"None"},{"content":"Federal Communication Commission (FCC). 2011. Title 47: Telecommunication, Part 15 Radio Frequency Devices. www.fcc.gov. (January, 31 2011). http://www.fcc.gov/","paperID":"None"},{"content":"Kenneth P. Fishkin, Bing Jiang, Matthai Philipose, and Sumit Roy. 2004. I Sense a Disturbance in the Force: Unobtrusive Detection of Interactions with RFID-tagged Objects. In UbiComp 2004: Ubiquitous Computing: 6th International Conference, Nottingham, UK, September 7--10, 2004. Proceedings. 268-282. DOI: http://dx.doi.org/10.1007/978--3--540--30119--6_16","paperID":"None"},{"content":"Saul Greenberg and Chester Fitchett. 2001. Phidgets: easy development of physical interfaces through physical widgets. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology, UIST 2001, Disney's BoardWalk Inn Resort, Walt Disney World, Orlando, FL, USA, November 11--14, 2001. 209-218. DOI:http://dx.doi.org/10.1145/502348.502388","paperID":"None"},{"content":"Tobias Alexander Große-Puppendahl, Yannick Berghoefer, Andreas Braun, Raphael Wimmer, and Arjan Kuijper. 2013. OpenCapSense: A rapid prototyping toolkit for pervasive interaction using capacitive sensing. In 2013 IEEE International Conference on Pervasive Computing and Communications, PerCom 2013, San Diego, CA, USA, March 18--22, 2013. 152-159. DOI: http://dx.doi.org/10.1109/PerCom.2013.6526726","paperID":"None"},{"content":"GS1. 2004. EPC Radio-Frequency Identity Protocols Generation-2 UHF RFID. (2004). http://www.gs1.org/sites/default/files/docs/epc/Gen2_Protocol_Standard.pdf.","paperID":"None"},{"content":"Björn Hartmann, Scott R. Klemmer, Michael S. Bernstein, Leith Abdulla, Brandon Burr, Avi Robinson-Mosher, and Jennifer Gee. 2006. Reflective physical prototyping through integrated design, test, and analysis. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology, Montreux, Switzerland, October 15--18, 2006. 299-308. DOI: http://dx.doi.org/10.1145/1166253.1166300","paperID":"None"},{"content":"Scott E. Hudson and Jennifer Mankoff. 2006. Rapid construction of functioning physical interfaces from cardboard, thumbtacks, tin foil and masking tape. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology, Montreux, Switzerland, October 15--18, 2006. 289-298. DOI: http://dx.doi.org/10.1145/1166253.1166299","paperID":"None"},{"content":"Scott E. Hudson and Gary L. Newell. 1992. Probabilistic State Machines: Dialog Management for Inputs with Uncertainty. In Proceedings of the Fifth ACM Symposium on User Interface Software and Technology, UIST 1992, Monteray, CA, USA, November 15--18, 1992. 199-208. DOI: http://dx.doi.org/10.1145/142621.142650","paperID":"None"},{"content":"Impinj. 2013. Low Level User Data Support. Application Note. (2013). https://support.impinj.com/hc/en-us/articles/202755318-Application-Note-Low-Level-User-Data-Support.","paperID":"None"},{"content":"Impinj, Inc. 2011. Impinj Speedway Revolution R220 (www.impinj.com ed.). Impinj, Inc., 701 N. 34th Street, Suite 300 Seattle, WA 98103.","paperID":"None"},{"content":"Gierad Laput, Eric Brockmeyer, Scott E. Hudson, and Chris Harrison. 2015. Acoustruments: Passive, Acoustically-Driven, Interactive Controls for Handheld Devices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI 2015, Seoul, South Korea, April 18--23, 2015. 2161-2170. DOI: http://dx.doi.org/10.1145/2702123.2702414","paperID":"None"},{"content":"Johnny C. Lee, Daniel Avrahami, Scott E. Hudson, Jodi Forlizzi, Paul H. Dietz, and Darren Leigh. 2004. The calder toolkit: wired and wireless components for rapidly prototyping interactive devices. In Proceedings of the Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, Cambridge, MA, USA, August 1--4, 2004. 167-175. DOI: http://dx.doi.org/10.1145/1013115.1013139","paperID":"None"},{"content":"Hanchuan Li, Can Ye, and Alanson P. Sample. 2015. IDSense: A Human Object Interaction Detection System Based on Passive UHF RFID. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI 2015, Seoul, South Korea, April 18--23, 2015. 2555-2564. DOI: http://dx.doi.org/10.1145/2702123.2702178","paperID":"None"},{"content":"RFID Journal LLC. 2015. How much does an RFID tag cost today? (sep 2015). http://www.rfidjournal.com/faq/show?85","paperID":"None"},{"content":"Trimble Navigation Ltd. 2000-2015. Sketchup. http://www.sketchup.com/. (2000-2015).","paperID":"None"},{"content":"Jennifer Mankoff, Scott E. Hudson, and Gregory D. Abowd. 2000a. Interaction techniques for ambiguity resolution in recognition-based interfaces. In Proceedings of the 13th Annual ACM Symposium on User Interface Software and Technology, UIST 2000, San Diego, California, USA, November 6--8, 2000. 11-20. DOI: http://dx.doi.org/10.1145/354401.354407","paperID":"None"},{"content":"Jennifer Mankoff, Scott E. Hudson, and Gregory D. Abowd. 2000b. Providing integrated toolkit-level support for ambiguity in recognition-based interfaces. In Proceedings of the CHI 2000 Conference on Human factors in computing systems, The Hague, Netherlands, April 1--6, 2000. 368-375. DOI: http://dx.doi.org/10.1145/332040.332459","paperID":"None"},{"content":"David Mellis, Sam Jacoby, Leah Buechley, Hannah Perner-Wilson, and Jie Qi. 2013. Microcontrollers as material: crafting circuits with paper, conductive ink, electronic components, and an \"untoolkit\". In Seventh International Conference on Tangible, Embedded, and Embodied Interaction, TEI'13, Barcelona, Spain, February 10--13, 2013. 83-90. DOI: http://dx.doi.org/10.1145/2460625.2460638","paperID":"None"},{"content":"P.V. Nikitin, R. Martinez, S. Ramamurthy, H. Leland, G. Spiess, and K.V.S. Rao. 2010. Phase based spatial identification of UHF RFID tags. In 2010 IEEE International Conference on RFID. 102-109. DOI: http://dx.doi.org/10.1109/RFID.2010.5467253","paperID":"None"},{"content":"Sharon L. Oviatt. 1999. Mutual Disambiguation of Recognition Errors in a Multimodel Architecture. In Proceeding of the CHI '99 Conference on Human Factors in Computing Systems: The CHI is the Limit, Pittsburgh, PA, USA, May 15--20, 1999. 576-583. DOI: http://dx.doi.org/10.1145/302979.303163","paperID":"None"},{"content":"Siddika Parlak and Ivan Marsic. 2013. Detecting object motion using passive RFID: A trauma resuscitation case study. Instrumentation and Measurement, IEEE Transactions on 62, 9 (2013), 2430-2437.","paperID":"None"},{"content":"Matthai Philipose. 2005. Large-Scale human activity recognition using ultra-dense sensing. The Bridge, National Academy of Engineering 35, 4 (2005).","paperID":"None"},{"content":"Raf Ramakers, Kashyap Todi, and Kris Luyten. 2015. PaperPulse: An Integrated Approach for Embedding Electronics in Paper Designs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI 2015, Seoul, South Korea, April 18--23, 2015. 2457-2466. DOI: http://dx.doi.org/10.1145/2702123.2702487","paperID":"None"},{"content":"Valkyrie Savage, Colin Chang, and Björn Hartmann. 2013. Sauron: embedded single-camera sensing of printed physical user interfaces. In The 26th Annual ACM Symposium on User Interface Software and Technology, UIST'13, St. Andrews, United Kingdom, October 8--11, 2013. 447-456. DOI: http://dx.doi.org/10.1145/2501988.2501992","paperID":"None"},{"content":"Valkyrie Savage, Andrew Head, Björn Hartmann, Dan B. Goldman, Gautham J. Mysore, and Wilmot Li. 2015. Lamello: Passive Acoustic Sensing for Tangible Input Components. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI 2015, Seoul, South Korea, April 18--23, 2015. 1277-1280. DOI: http://dx.doi.org/10.1145/2702123.2702207","paperID":"None"},{"content":"Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: fabricating custom capacitive touch sensors to prototype interactive objects. In The 25th Annual ACM Symposium on User Interface Software and Technology, UIST '12, Cambridge, MA, USA, October 7--10, 2012. 579-588. DOI: http://dx.doi.org/10.1145/2380116.2380189","paperID":"None"},{"content":"Julia Schwarz, Jennifer Mankoff, and Scott E. Hudson. 2011. Monte carlo methods for managing interactive state, action and feedback under uncertainty. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology, Santa Barbara, CA, USA, October 16--19, 2011. 235-244. DOI: http://dx.doi.org/10.1145/2047196.2047227","paperID":"None"},{"content":"Julia Schwarz, Jennifer Mankoff, and Scott E. Hudson. 2015. An Architecture for Generating Interactive Feedback in Probabilistic User Interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI 2015, Seoul, South Korea, April 18--23, 2015. 2545-2554. DOI: http://dx.doi.org/10.1145/2702123.2702228","paperID":"None"},{"content":"ThingMagic, A Division of Trimble 2015. M6E-NANO: Embedded UHF RFID Module (www.thingmagic.com ed.). ThingMagic, A Division of Trimble, One Merrill Street Woburn, MA 01801.","paperID":"None"},{"content":"Sebastian Thrun, Wolfram Burgard, and Dieter Fox. 2005. Probabilistic Robotics (Intelligent Robotics and Autonomous Agents). The MIT Press.","paperID":"None"},{"content":"Alexander Wiethoff, Hanna Schneider, Julia Küfner, Michael Rohs, Andreas Butz, and Saul Greenberg. 2013. Paperbox: a toolkit for exploring tangible interaction on interactive surfaces. In Creativity and Cognition 2013, C&C '13, Sydney, NSW, Australia, June 17--20, 2013. 64-73. DOI: http://dx.doi.org/10.1145/2466627.2466635","paperID":"None"},{"content":"John Williamson. 2006. Continuous uncertain interaction. Ph.D. Dissertation. University of Glasgow.","paperID":"None"},{"content":"Robert Xiao, Chris Harrison, and Scott E. Hudson. 2013. WorldKit: rapid and easy creation of ad-hoc interactive applications on everyday surfaces. In 2013 ACM SIGCHI Conference on Human Factors in Computing Systems, CHI '13, Paris, France, April 27 - May 2, 2013. 879-888. DOI: http://dx.doi.org/10.1145/2470654.2466113","paperID":"None"}],"title":"RapID: A Framework for Fabricating Low-Latency Interactive Objects with RFID Tags","filename":"CHI16/p5897","authors":["Andrew Spielberg","Alanson Sample","Scott E. Hudson","Jennifer Mankoff","James McCann"],"conference":"CHI '16"}