{"paperId":2858581,"citation":[],"reference":[{"content":"2016. \"Dashcams P1210466\" by Fernost - Own work. Licensed under Public Domain via Commons. (2016).","paperID":"None"},{"content":"Mark S. Ackerman, Lorrie Faith Cranor, and Joseph Reagle. 1999. Privacy in e-Commerce: Examining User Scenarios and Privacy Preferences. In Proceedings of the ACM Conference on Electronic Commerce (EC '99). 1-8.","paperID":"None"},{"content":"Shane Ahern, Dean Eckles, Nathaniel S. Good, Simon King, Mor Naaman, and Rahul Nair. 2007. Over-exposed : Privacy Patterns and Considerations in Online and Mobile Photo Sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). 357-366.","paperID":"None"},{"content":"Austrian Data Protection Authority. 2016. Video cameras in cars. (2016). https://www.dsb.gv.at/site/cob54058/8105/default.aspx accessed January 8, 2016.","paperID":"None"},{"content":"Suzanne M Bianchi, Melissa A Milkie, Liana C Sayer, and John P Robinson. 2000. Is Anyone Doing the Housework? Trends in the Gender Division of Household Labor. Social forces 79, 1 (2000), 191-228.","paperID":"None"},{"content":"Nama R Budhathoki and Caroline Haythornthwaite. 2013. Motivation for Open Collaboration Crowd and Community Models and The Case of OpenStreetMap. American Behavioral Scientist 57, 5 (2013), 548-575.","paperID":"None"},{"content":"Judy Cameron, Katherine M Banko, and W David Pierce. 2001. Pervasive Negative Effects of Rewards on Intrinsic Motivation: The Myth Continues. The Behavior Analyst 24, 1 (2001), 1.","paperID":"None"},{"content":"Bill Canis and David Randall Peterman. 2014. \"Black Boxes\" in Passenger Vehicles: Policy Issues. (2014). http: //digital.library.unt.edu/ark:/67531/metadc462832/ accessed January 8, 2016.","paperID":"None"},{"content":"Kangsuk Chae, Daihoon Kim, Seohyun Jung, Jaeduck Choi, and Souhwan Jung. 2010. Evidence Collecting System from Car Black Boxes. In Consumer Communications and Networking Conference (CCNC 2010). 1-2.","paperID":"None"},{"content":"Shao-Chi Chen, Hsin-Yi Chen, Yi-Ling Chen, Hsin-Mu Tsai, and Bing-Yu Chen. 2014. Making in-Front-of Cars Transparent: Sharing First-Person-Views via Dashcam. Computer Graphics Forum 33, 7 (2014), 289-297.","paperID":"None"},{"content":"Hichang Cho, MeiHui Chen, and Siyoung Chung. 2010. Testing an Integrative Theoretical Model of Knowledge-sharing Behavior in the Context of Wikipedia. Journal of the American Society for Information Science and Technology 61, 6 (2010), 1198-1212.","paperID":"None"},{"content":"Eun Kyoung Choe, Sunny Consolvo, Jaeyeon Jung, Beverly Harrison, and Julie A. Kientz. 2011. Living in A Glass House: A Survey of Private Moments in the Home. In Proceedings of the International Conference on Ubiquitous Computing (UbiComp '11). 41-44.","paperID":"None"},{"content":"Sunny Consolvo, Ian E. Smith, Tara Matthews, Anthony LaMarca, Jason Tabert, and Pauline Powledge. 2005. Location Disclosure to Social Relations: Why, When, & What People Want to Share. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). 81-90.","paperID":"None"},{"content":"Jennifer Kaye Dean. 2009. Quantifying Social Justice Advocacy Competency: Development of the Social Justice Advocacy Scale. Ph.D. Dissertation. GEORGIA STATE UNIVERSITY.","paperID":"None"},{"content":"Tamara Denning, Zakariya Dehlawi, and Tadayoshi Kohno. 2014. In Situ with Bystanders of Augmented Reality Glasses: Perspectives on Recording and Privacy-mediating Technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 2377-2386.","paperID":"None"},{"content":"Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From Game Design Elements to Gamefulness: Defining \"Gamification\". In Proceedings of the International Academic MindTrek Conference: Envisioning Future Media Environments (MindTrek '11). 9-15.","paperID":"None"},{"content":"Benjamin Edelman. 2012. Earnings and Ratings at Google Answers. Economic Inquiry 50, 2 (2012), 309-320.","paperID":"None"},{"content":"Batya Friedman, Peter H Kahn Jr, Jennifer Hagman, Rachel L Severson, and Brian Gill. 2006. The Watcher and the Watched: Social Judgments About Privacy in a Public Place. Human-Computer Interaction 21, 2 (2006), 235-272.","paperID":"None"},{"content":"M. Gerla, Eun-Kyu Lee, G. Pau, and Uichin Lee. 2014. Internet of Vehicles: From Intelligent Grid to Autonomous Cars and Vehicular Clouds. In Internet of Things. 241-246.","paperID":"None"},{"content":"Jordan Golson. 2015. Garmin's New Dash Cam Can Help You Avoid Crashes. (2015). http://www.wired.com/2015/09/garmins-new-dash-cam-can-help-avoid-crashes accessed January 8, 2016.","paperID":"None"},{"content":"Roberto Hoyle, Robert Templeman, Steven Armes, Denise Anthony, David Crandall, and Apu Kapadia. 2014. Privacy Behaviors of Lifeloggers Using Wearable Cameras. In Proceedings of the International Conference on Ubiquitous Computing (UbiComp '14). 571-582.","paperID":"None"},{"content":"Giovanni Iachello and Jason Hong. 2007. End-user Privacy in Human-Computer Interaction. Foundations and Trends in Human-Computer Interaction 1, 1 (2007), 1-137.","paperID":"None"},{"content":"John T Jost and Aaron C Kay. 2010. Social Justice: History, Theory, and Research. Wiley Online Library.","paperID":"None"},{"content":"Nicolas Kaufmann, Thimo Schulze, and Daniel Veit. 2011. More than Fun and Money. Worker Motivation in Crowdsourcing - A Study on Mechanical Turk. In Proceedings of the Americas Conference on Information Systems (AMCIS '11). 1-11.","paperID":"None"},{"content":"Masatomo Kobayashi, Shoma Arita, Toshinari Itoko, Shin Saito, and Hironobu Takagi. 2015. Motivating Multi-Generational Crowd Workers in Social-Purpose Work. In Proceedings of the ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '15). 1813-1824.","paperID":"None"},{"content":"Ponnurangam Kumaraguru and Lorrie F. Cranor. 2005. Privacy Indexes: A Survey of Westin's Studies. (2005).","paperID":"None"},{"content":"Marc Langheinrich. 2001. Privacy by Design - Principles of Privacy-Aware Ubiquitous Systems. In Proceedings of the International Conference on Ubiquitous Computing (UbiComp '01). 273-291.","paperID":"None"},{"content":"Uichin Lee and Mario Gerla. 2010. A Survey of Urban Vehicular Sensing Platforms. Computer Networks 54, 4 (2010), 527-544.","paperID":"None"},{"content":"Uichin Lee, Jihyoung Kim, Eunhee Yi, Juyup Sung, and Mario Gerla. 2013. Analyzing Crowd Workers in Mobile Pay-for-answer Q&A. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). 533-542.","paperID":"None"},{"content":"Uichin Lee, Biao Zhou, M. Gerla, E. Magistretti, P. Bellavista, and A. Corradi. 2006. Mobeyes: Smart Mobs for Urban Monitoring with a Vehicular Sensor Network. Wireless Communications 13, 5 (2006), 52-57.","paperID":"None"},{"content":"William E Loges and Joo-Young Jung. 2001. Exploring the Digital Divide: Internet Connectedness and Age. Communication Research 28, 4 (2001), 536-562.","paperID":"None"},{"content":"M. Massimi, K.N. Truong, D. Dearman, and G.R. Hayes. 2010. Understanding Recording Technologies in Everyday Life. Pervasive Computing 9, 3 (2010), 64-71.","paperID":"None"},{"content":"David W McMillan and David M Chavis. 1986. Sense of Community: A Definition and Theory. Journal of community psychology 14, 1 (1986), 6-23.","paperID":"None"},{"content":"Alexey Medvedev, Arkady Zaslavsky, Vladimir Grudinin, and Sergey Khoruzhnikov. 2014. Citywatcher: Annotating and Searching Video Data Streams for Smart Cities Applications. In Internet of Things, Smart Spaces, and Next Generation Networks and Systems. Vol. 8638. Springer International Publishing, 144-155.","paperID":"None"},{"content":"Kevin Kyung Nam, Mark S. Ackerman, and Lada A. Adamic. 2009. Questions in, Knowledge in?: A Study of Naver's Question Answering Community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). 779-788.","paperID":"None"},{"content":"David H. Nguyen, Aurora Bedford, Alexander Gerard Bretana, and Gillian R. Hayes. 2011. Situating the Concern for Information Privacy Through an Empirical Study of Responses to Video Recording. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). 3207-3216.","paperID":"None"},{"content":"David H. Nguyen, Gabriela Marcu, Gillian R. Hayes, Khai N. Truong, James Scott, Marc Langheinrich, and Christof Roduner. 2009. Encountering SenseCam: Personal Recording Technologies in Everyday Life. In Proceedings of the International Conference on Ubiquitous Computing (UbiComp '09). 165-174.","paperID":"None"},{"content":"Judith S. Olson, Jonathan Grudin, and Eric Horvitz. 2005. A Study of Preferences for Sharing and Privacy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI EA '05). 1985-1988.","paperID":"None"},{"content":"Nathaniel Ostashewski and Doug Reid. 2015. A History and Frameworks of Digital Badges in Education. In Gamification in Education and Business, Torsten Reiners and Lincoln C. Wood (Eds.). Springer International Publishing, 187-200.","paperID":"None"},{"content":"Joon-Sang Park, Uichin Lee, Soon Y. Oh, Mario Gerla, and Desmond S. Lun. 2006. Emergency Related Video Streaming in VANET Using Network Coding. In Proceedings of the International Workshop on Vehicular Ad Hoc Networks (VANET '06). 102-103.","paperID":"None"},{"content":"H Wesley Perkins and Debra K DeMeis. 1996. Gender and Family Effects on the \"Second-Shift\" Domestic Activity of College-educated Young Adults. Gender & Society 10, 1 (1996), 78-93.","paperID":"None"},{"content":"Patrick Planing. 2014. Innovation Acceptance: the Case of Advanced Driver-assistance Systems. Springer Science & Business Media.","paperID":"None"},{"content":"Daphne Ruth Raban. 2008. The Incentive Structure in an Online Information Market. Journal of the American Society for Information Science and Technology 59, 14 (2008), 2284-2295.","paperID":"None"},{"content":"Top Rider. 2015. Research on Vehicle Blackbox. (2015). https://www.top-rider.com:447/news/articleView.html?idxno=19493 accessed January 8, 2016.","paperID":"None"},{"content":"Manya Sleeper, Sebastian Schnorf, Brian Kemler, and Sunny Consolvo. 2015. Attitudes Toward Vehicle-based Sensing and Recording. In Proceedings of the International Conference on Ubiquitous Computing (UbiComp '15). 1017-1028.","paperID":"None"},{"content":"H Jeff Smith, Sandra J Milberg, and Sandra J Burke. 1996. Information Privacy: Measuring Individuals' Concerns About Organizational Practices. MIS quarterly 20, 2 (1996), 167-196.","paperID":"None"},{"content":"Youcheng Wang and Daniel R Fesenmaier. 2003. Assessing Motivation of Contribution in Online Communities: An Empirical Investigation of an Online Travel Community. Electronic markets 13, 1 (2003), 33-45.","paperID":"None"},{"content":"Molly McLure Wasko and Samer Faraj. 2005. Why Should I Share? Examining Social Capital and Knowledge Contribution in Electronic Networks of Practice. MIS quarterly 29, 1 (2005), 35-57.","paperID":"None"}],"abstract":"Dashcams support continuous recording of external views that provide evidence in case of unexpected traffic-related accidents and incidents. Recently, sharing of dashcam videos has gained significant traction for accident investigation and entertainment purposes. Furthermore, there is a growing awareness that dashcam video sharing will greatly extend urban surveillance. Our work aims to identify the major motives and concerns behind the sharing of dashcam videos for urban surveillance. We conducted two survey studies (n=108, n=373) in Korea. Our results show that reciprocal altruism/social justice and monetary reward were the major motives and that participants were strongly motivated by altruism and social justice. Our studies have also identified major privacy concerns and found that groups with greater privacy concerns had lower altruism and justice motive, but had higher monetary motive. Our main findings have significant implications on the design of a dashcam video-sharing service.","title":"Motives and Concerns of Dashcam Video Sharing","filename":"CHI16/p4758","authors":["Sangkeun Park","Joohyun Kim","Rabeb Mizouni","Uichin Lee"],"conference":"CHI '16"}