{"paperId":2858515,"citation":[],"reference":[{"content":"Judd Antin and Elizabeth F. Churchill. 201 Badges in social media: A social psychological perspective. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: Workshop on Gamification.","paperID":"None"},{"content":"Sonia M. Arteaga, Mo Kudeki, and Adrienne Woodworth. 2009. Combating obesity trends in teenagers through persuasive mobile technology. SIGACCESS Accessibility and Computing 94: 17--25. http://doi.acm.org/10.1145/1595061.1595064","paperID":"None"},{"content":"Hernan Badenes, Mateo N. Bengualid, Jilin Chen, Liang Gou, Eben Haber, Jalal Mahmud, Jeffrey W. Nichols, Aditya Pal, Jerald Schoudt, Barton A. Smith, Ying Xuan, Huahai Yang, and Michelle X. Zhou. 2014. System U: automatically deriving personality traits from social media for people recommendation. In Proceedings of the 8th ACM Conference on Recommender Systems (RecSys '14), 373--374. http://doi.acm.org/10.1145/2645710.2645719","paperID":"None"},{"content":"Gabriel Barata, Sandra Gama, Joaquim Jorge, and Daniel Gonçalves. 2013. Engaging engineering students with gamification. In Proceedings of the 5th International Conference on Games and Virtual Worlds for Serious Applications (VS-GAMES '13), 1--8.","paperID":"None"},{"content":"Richard Bartle. 1996. Hearts, clubs, diamonds, spades: Players who suit MUDs. Journal of MUD research 1, 1: 19.","paperID":"None"},{"content":"David Codish and Gilad Ravid. 2014. Personality based gamification-educational gamification for extroverts and introverts. In Proceedings of the 9th CHAIS Conference for the Study of Innovation and Learning Technologies: Learning in the Technological Era, 36--44.","paperID":"None"},{"content":"Teresa Correa, Amber Willard Hinsley, and Homero Gil De Zuniga. 2010. Who interacts on the Web?: The intersection of users' personality and social media use. Computers in Human Behavior 26, 2: 247--253.","paperID":"None"},{"content":"Paul T. Costa, Jr. and Robert R. McCrae. 1992. NEO Personality Inventory-Revised (NEO-PI-R) and NEO Five-Factor Inventory (NEO-FFI) Professional Manual. Psychological Assessment Resources, Odessa, FL.","paperID":"None"},{"content":"Sebastian Deterding, 2011. Situated motivational affordances of game elements: A conceptual model. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: Workshop on Gamification.","paperID":"None"},{"content":"Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: defining \"gamification\". In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments, 9--15. http://doi.acm.org/1145/2181037.2181040","paperID":"None"},{"content":"Sebastian Deterding, Miguel Sicart, Lennart Nacke, Kenton O'Hara, and Dan Dixon. 20 Gamification. using game-design elements in non-gaming contexts. In Extended Abstracts of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2425--2428. http://doi.acm.org/10.1145/1979742.1979575","paperID":"None"},{"content":"Tao Dong, Mira Dontcheva, Diana Joseph, Karrie Karahalios, Mark Newman, and Mark Ackerman. 20 Discovery-based games for learning software. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2083--2086. http://doi.acm.org/10.1145/2207676.2208358","paperID":"None"},{"content":"Rosta Farzan, Joan M. DiMicco, David R. Millen, Casey Dugan, Werner Geyer, and Elizabeth A. Brownholtz. 2008. Results from deploying a participation incentive mechanism within the enterprise. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 563--572. http://doi.acm.org/10.1145/1357054.1357145","paperID":"None"},{"content":"Lauren S. Ferro and Stefan Greuter. 2013. Towards personalised, gamified systems: an investigation into game design, personality and player typologies. In Proceedings of The 9th Australasian Conference on Interactive Entertainment: Matters of Life and Death (IE'13), 7. http://dx.doi.org/10.1145/2513002.2513024","paperID":"None"},{"content":"Gartner. 2012. Gartner says by 2014, 80 percent of current gamified applications will fail to meet business objectives primarily due to poor design. Retrieved November 27, 2012 from http://www.gartner.com/it/page.jsp?id=2251015","paperID":"None"},{"content":"James J. Gibson, 1977. The theory of affordances. In Perceiving, Acting, and Knowing: Toward an Ecological Psychology, Robert Shaw and John Bransford (eds.). Lawrence Erlbaum Associates, Hillsdale, NJ, 67--82.","paperID":"None"},{"content":"Lewis R. Goldberg. 1992. The development of markers of the Big-Five factor structure. Psychological assessment 4, 1: 26.","paperID":"None"},{"content":"Samuel D. Gosling, Peter J. Rentfrow, and William B. Swann. 2003. A very brief measure of the Big-Five personality domains. Journal of Research in personality 37, 6: 504--528.","paperID":"None"},{"content":"Dina Goren-Bar, Ilenia Graziola, Fabio Pianesi, and Massimo Zancanaro. 2006. The influence of personality factors on visitor attitudes towards adaptivity dimensions for mobile museum guides. User Modeling and User-Adapted Interaction 16, 1: 31--62.","paperID":"None"},{"content":"Sajanee Halko, and Julie A. Kientz. 2010. Personality and persuasive technology: an exploratory study on health-promoting mobile applications. In Persuasive Technology, 6137: 150--161.","paperID":"None"},{"content":"Juho Hamari. (2013). Transforming homo economicus into homo ludens: A field experiment on gamification in a utilitarian peer-to-peer trading service. Electronic Commerce Research and Applications 12, 4: 236--245.","paperID":"None"},{"content":"Juho Hamari, Jonna Koivisto, and Harri Sarsa. 2014. Does gamification work?: A literature review of empirical studies on gamification. In Proceedings of the 47th Hawaii International Conference on System Sciences (HICSS '14), 3025--3034.","paperID":"None"},{"content":"Anthony Hilling. 2012. Extrovert and Introvert -- What is the difference? Retrieved November 5, 2012 from: http://www.hillinghypnotherapy.co.uk/personality-test-online/personality-testing-explained/extrovert-and-introvert-what-is-the-difference/","paperID":"None"},{"content":"Hwee Hoon and Tan Min Li Tan. 2008. Organizational citizenship behavior and social loafing: The role of personality, motives, and contextual factors. The Journal of Psychology 142, 1: 89--108.","paperID":"None"},{"content":"Kai Huotari, and Juho Hamari. 2012. Defining gamification: A service marketing perspective. In Proceedings of the 16th International Academic MindTrek Conference, 17--22.","paperID":"None"},{"content":"Kai Huotari and Juho Hamari. 2011. \"Gamification\" from the perspective of service marketing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: Workshop on Gamification. http://doi.acm.org/10.1145/2393132.2393137","paperID":"None"},{"content":"Oliver P. John, Laura P. Naumann, and Christopher J. Soto. 2008. Paradigm shift to the integrative Big Five trait taxonomy: History, measurement, and conceptual issues. In Handbook of Personality: Theory and Research (3rd ed.), Oliver P. John, Richard W. Robbins, and Lawrence A. Pervin (eds.). Guilford Press, NY , NY, 114--158.","paperID":"None"},{"content":"J.H. Jung, Christoph Schneider, and Joseph Valacich. 2010. Enhancing the motivational affordance of information systems: The effects of real-time performance feedback and goal setting in group collaboration environments. Management Science 56, 4: 724--742.","paperID":"None"},{"content":"Maurits Kaptein and Dean Eckles. 2012. Heterogeneity in the effects of online persuasion. Journal of Interactive Marketing 26, 3: 176--188.","paperID":"None"},{"content":"Maurits Kaptein, Joyca Lacroix, and Privender Saini. 2010. Individual differences in persuadability in the health promotion domain. In Proceedings of the 5th International Conference on Persuasive Technology (PERSUASIVE '10), 94--105. http://dx.doi.org/10.1007/978--3--642--13226--1_11","paperID":"None"},{"content":"Yamini Karanam, Hanan Alotaibi, Leslie Filko, Elham Makhsoom, Lindsay Kaser, and Stephen Voida. 2014. Motivational affordances and personality types in personal informatics. In Adjunct Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14), 79--82. http://doi.acm.org/10.1145/2638728.2638800","paperID":"None"},{"content":"Wei Li, Tovi Grossman, and George Fitzmaurice. 2012. GamiCAD: a gamified tutorial system for first time autocad users. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12), 103--112. http://doi.acm.org/10.1145/2380116.2380131","paperID":"None"},{"content":"Henry C. Lucas. 1971. Computer-based information systems in organizations. Science Research Associates, Chicago, IL.","paperID":"None"},{"content":"Salatore R. Maddi. 1989. Personality theories: A comparative analysis (5th ed.). Dorsey Press, Chicago, IL.","paperID":"None"},{"content":"Robert R. McCrae, and Paul T. Costa. 1989. Reinterpreting the Myers-Briggs type indicator from the perspective of the Five Factor model of personality. Journal of Personality 57, 1: 17--40.","paperID":"None"},{"content":"James C. McElroy, Anthony R. Hendrickson, Anthony M. Townsend, and Samuel M. DeMarie. 2007. Dispositional factors in Internet use: Personality versus cognitive style. MIS Quarterly 31, 809--820.","paperID":"None"},{"content":"Joanna McGrenere, Ronald M. Baecker, and Kellogg S. Booth. 2002. An evaluation of a multiple interface design solution for bloated software. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02), 164--170. http://doi.acm.org/10.1145/503376.503406","paperID":"None"},{"content":"Nitya Narasimhan, Silviu Chiricescu, and Venu Vasudevan. 2011. The gamification of television: Is there life beyond badges? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: Workshop on Gamification.","paperID":"None"},{"content":"Oded Nov and Ofer Arazy. 2013. Personality-targeted design: Theory, experimental procedure, and preliminary results. In Proceedings of the 2013 ACM Conference on Computer Supported Cooperative Work (CSCW '13), 977--984. http://doi.acm.org/10.1145/2441776.2441887","paperID":"None"},{"content":"Dennis W. Organ. 1988. Organizational citizenship behavior: The good soldier syndrome. Lexington Books, Lexington, MA.","paperID":"None"},{"content":"Dennis W. Organ. 1994. Personality and organizational citizenship behavior. Journal of Management 20, 2: 465--478.","paperID":"None"},{"content":"Vladimir Pavlenko and S.V. Chernyi and D.G. Goubkina. 2009. EEG correlates of anxiety and emotional stability in adult healthy subjects. Neurophysiology 41, 5: 337--345.","paperID":"None"},{"content":"Philip M. Podsakoff, Scott B. MacKenzie, Julie Beth Paine, and Daniel G. Bachrach. 2000. Organizational citizenship behaviors: A critical review of the theoretical and empirical literature and suggestions for future research. Journal of Management 26, 3: 513--563.","paperID":"None"},{"content":"Maryam Tohidi, William Buxton, Ronald Baecker, and Abigail Sellen. 2006. User sketches: a quick, inexpensive, and effective way to elicit more reflective user feedback. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles (NordiCHI '06), Anders Mørch, Konrad Morgan, Tone Bratteteig, Gautam Ghosh, and Dag Svanaes (Eds.). ACM, NY, NY, USA, 105--114. DOI=http://dx.doi.org/10.1145/1182475.1182487","paperID":"None"},{"content":"Johnmarshall Reeve. 2005. Understanding Motivation and Emotion. John Wiley & Sons, NY, NY.","paperID":"None"},{"content":"Craig Ross, Emily S. Orr, Mia Sisic, Jaime M. Arseneault, Mary G. Simmering, and R. Robert Orr. 2009. Personality and motivations associated with Facebook use. Computers in Human Behavior 25, 2: 578--586.","paperID":"None"},{"content":"Lee Sheldon. 2011. The multiplayer classroom: Designing coursework as a game. Cengage Learning, Boston, MA.","paperID":"None"},{"content":"Penelope Sweetser and Peta Wyeth. 2005, July. GameFlow: A model for evaluating player enjoyment in games. ACM Computers in Entertainment (CIE) 3, 3: Article 3A.","paperID":"None"},{"content":"Kevin Werbach and Dan Hunter. 2012. For the win: How game thinking can revolutionize your business. Wharton Digital Press, Philadelphia, PA.","paperID":"None"},{"content":"Ping Zhang. 2008. Technical opinion: Motivational affordances: Reasons for ICT design and use. Communications of the ACM 51, 11: 145--147. http://doi.acm.org/10.1145/1400214.1400244","paperID":"None"},{"content":"Gabe Zichermann and Christopher Cunningham. 2011. Gamification by design: Implementing game mechanics in web and mobile apps. O'Reilly Media, Sebastopol, CA.","paperID":"None"}],"abstract":"While motivational affordances are widely used to enhance user engagement in \"gamified\" apps, they are often employed en masse. Prior research offers little guidance about how individuals with different dispositions may react-positively and negatively-to specific affordances. In this paper, we present a survey study investigating the relationships among individuals' personality traits and perceived preferences for various motivational affordances used in gamification. Our results show that extraverts tend to be motivated by Points, Levels, and Leaderboards; people with high levels of imagination/openness are less likely to be motivated by Avatars. Negative correlations were found between emotional stability (the inverse of neuroticism) and several motivational affordances, indicating a possible limitation of gamification as an approach for a large segment of the population. Our findings contribute to the HCI community, and in particular to designers of persuasive and gamified apps, by providing design suggestions for targeting specific audiences based on personality.","title":"Personality-targeted Gamification: A Survey Study on Personality Traits and Motivational Affordances","filename":"CHI16/p2001","authors":["Yuan Jia","Bin Xu","Yamini Karanam","Stephen Voida"],"conference":"CHI '16"}