{"paperId":2858519,"citation":[],"reference":[{"content":"Eric Akaoka, Tim Ginn, and Roel Vertegaal. 2010. Display Objects: Prototyping functional physical interfaces on 3D styrofoam, paper or cardboard models. In Proc. TEI '10, 49--56.","paperID":"None"},{"content":"Javier Alonso-Mora, Andreas Breitenmoser, Martin Rufli, Roland Siegwart, and Paul Beardsley. 2012. Image and animation display with multiple mobile robots. Int. J. Rob. Res. 31, 6 (May 2012), 753--773.","paperID":"None"},{"content":"Atelier Zafari, Cube House Project. http://atelier-zafari.com/cube-house/","paperID":"None"},{"content":"Federico Augugliaro, and Raffaello D'Andrea. 2013. Admittance control for physical human-quadrocopter interaction. Control Conference (ECC), IEEE, 18051810.","paperID":"None"},{"content":"Steve Benford, Chris Greenhalgh, Gail Reynard, Chris Brown, and Boriana Koleva. 1998. Understanding and constructing shared spaces with mixed reality boundaries. ACM Trans. Comput.-Hum. Interact. 5, 3 (September 1998), 185--223.","paperID":"None"},{"content":"Hrvoje Benko, Ricardo Jota, and Andrew Wilson. 2012. MirageTable: Freehand interaction on a projected augmented reality tabletop. In Proc. CHI'12, 199--208.","paperID":"None"},{"content":"William Buxton. 1992. Telepresence: Integrating shared task and person spaces. In Proc. of Graphics Interface'92, 123--129.","paperID":"None"},{"content":"Jessica R. Cauchard, Jane, L. E., Kevin Y. Zhai, and James A. Landay. 2015. Drone & me: An exploration into natural human-drone interaction, In Proc. UbiComp'15, 361--365.","paperID":"None"},{"content":"George W. Fitzmaurice, Hiroshi Ishii, and William Buxton. 1995. Bricks: Laying the foundations for graspable user interfaces. In Proc. CHI'95, 442--449.","paperID":"None"},{"content":"Flight Assembled Architecture. www.gramaziokohler.com/web/e/projekte/209.html","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic physical affordances and constraints through shape and object actuation. In Proc. UIST'13, 417--426.","paperID":"None"},{"content":"Seth C. Goldstein, and Todd C. Mowry. 2004. Claytronics: A scalable basis for future robots. In RoboSphere'04.","paperID":"None"},{"content":"Seth C. Goldstein, Jason D. Campbell, and Todd C. Mowry. 2005. Programmable matter. IEEE Computer, 38, 6, 99--101.","paperID":"None"},{"content":"David Holman, Roel Vertegaal, Mark Altosaar, Nico Troje, and Derek Johns. 2005. PaperWindows: Interaction techniques for digital paper. In Proc. CHI '05, 591--599.","paperID":"None"},{"content":"HoloLens. 2015. www.microsoft.com/microsofthololens","paperID":"None"},{"content":"Eva Hornecker and Thomas Psik. 2005. Using ARToolKit markers to build tangible prototypes and simulate other technologies. In Proc. INTERACT'05, 30--42.","paperID":"None"},{"content":"Hiroshi Ishii, and Brygg Ullmer. 1997. Tangible bits: Beyond pixels. In Proc. CHI'97, 234--241.","paperID":"None"},{"content":"Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical atoms: Beyond tangible bits, toward transformable materials. Interactions 19, 1 (January 2012), 38--51.","paperID":"None"},{"content":"Doug L. James and Dinesh K. Pai. 2002. DyRT: Dynamic response textures for real time deformation simulation with graphics hardware. ACM Trans. Graph. 21, 3 (July 2002), 582--585.","paperID":"None"},{"content":"Sergi Jordà, Günter Geiger, Marcos Alonso, and Martin Kaltenbrunner. 2007. The reacTable: Exploring the synergy between live music performance and tabletop tangible interfaces. In Proc. TEI '07, 139--146.","paperID":"None"},{"content":"Mustafa Karagozler, Brian Kirby, Wei Jie Lee, Eugene Marinelli, Tze Chang Ng. 2006. Ultralight modular robotic building blocks for the rapid deployment of planetary outposts. RASC-AL Forum.","paperID":"None"},{"content":"Brian Kirby, Jason Campbell, Burak Aksak, Padmanabhan Pillai, James Hoburg, Todd C. Mowry and Seth C. Goldstein. 2005. Catoms: Moving robots without moving parts. AAAI Robotics Exhibition'05, 1730--1731.","paperID":"None"},{"content":"Jinha Lee, Rehmi Post, and Hiroshi Ishii. 2011. ZeroN: Mid-air tangible interaction enabled by computer controlled magnetic levitation. In Proc. UIST'11, 327336.","paperID":"None"},{"content":"Jinha Lee and Cati Boulanger. 2012. Direct, spatial, and dexterous interaction with see-through 3D desktop. In ACM SIGGRAPH 2012 Posters, 69.","paperID":"None"},{"content":"Daniel Leithinger and Hiroshi Ishii. 2010. Relief: A scalable actuated shape display. In Proc TEI'10, 221--222.","paperID":"None"},{"content":"MIT Flyfire. 2014 - http://senseable.mit.edu/flyfire/","paperID":"None"},{"content":"Paul Milgram and Fumio Kishino. 1994. A Taxonomy of Mixed Reality Visual Display. In IEICE Trans. Information and Systems, vol. E77-D, no. 12, 1321--1329.","paperID":"None"},{"content":"Paul Milgram and Herman Colquhoun Jr. 1999. A Taxonomy of Real and Virtual World Display Integration. Mixed Reality - Merging Real and Virtual Worlds. Springer Verlag, p. 5--30.","paperID":"None"},{"content":"Kei Nitta, Keita Higuchi, and Jun Rekimoto. 2014. HoverBall: Augmented sports with a flying ball. In Proc. AH'14, Article 13.","paperID":"None"},{"content":"Hiroki Nozaki. 2014. Flying display: A movable display pairing projector and screen in the air. In Proc. CHI EA'14, 909--914.","paperID":"None"},{"content":"Yoichi Ochiai, Takayuki Hoshi and Jun Rekimoto. 2014. Pixie dust: Graphics generated by levitated and animated objects in computational acoustic-potential field. ACM Trans. Graph. 33, 4, 85.","paperID":"None"},{"content":"Kevin Pfeil, Seng Lee Koh, and Joseph LaViola. 2013. Exploring 3D gesture metaphors for interaction with unmanned aerial vehicles. In Proc. IUI'13, 257--266.","paperID":"None"},{"content":"Ivan Poupyrev, Tatsushi Nashida, Shigeaki Maruyama, Jun Rekimoto, and Yasufumi Yamaji. 2004. Lumen: Interactive visual and shape display for calm computing. In Proc SIGGRAPH '04, 17.","paperID":"None"},{"content":"John Underkoffler and Hiroshi Ishii. 1999. Urp: A luminous-tangible workbench for urban planning and design. In Proc. CHI '99, 386--393.","paperID":"None"},{"content":"Hayes Solos Raffle, Amanda J. Parkes, and Hiroshi Ishii. 2004. Topobo. In Proc. CHI '04, 647--654.","paperID":"None"},{"content":"Ramesh Raskar, Greg Welch, Kok-Lim Low, and Deepak Bandyopadhyay. 2001. Shader Lamps: Animating real objects with image-based illumination. In Proc. of the 12th Eurographics Workshop on Rendering Techniques, Springer-Verlag, 89--102.","paperID":"None"},{"content":"George. G. Robertson, Jock. D. Mackinlay and Stuart K. Card. 1991. Cone trees. In Proc. CHI '91, 189--194.","paperID":"None"},{"content":"Michael Rubenstein, Christian Ahler and Radhika Nagpal. 2012. Kilobot: A low cost scalable robot system for collective behaviors. ICRA'12, 3293--98.","paperID":"None"},{"content":"Michael Rubenstein, Alejandro Cornejo and Radhika Nagpal, R. 2014. Programmable self-assembly in a thousand-robot swarm. Science 345(6198), 795--799.","paperID":"None"},{"content":"Juergen Scheible, Achim Hoth, Julian Saal and Haifeng Su. 2013. Display drone: A flying robot based interactive display. In Proc. PerDis'13, 49--54.","paperID":"None"},{"content":"Stefan Schneegass, Florian Alt, Jürgen Scheible, Albrecht Schmidt, and Haifeng Su. 2014. Midair displays: Exploring the concept of free-floating public displays. In Proc. CHI EA'14, 2035--2040.","paperID":"None"},{"content":"Ivan Sutherland. 1965. The Ultimate Display. In Proc. IFIP 65, 2, 506--508.","paperID":"None"},{"content":"Daniel Szafir, Bilge Mutlu and Terrence Fong. 2015. Communicating directionality in flying robots. In Proc. HRI'15, 19--26.","paperID":"None"},{"content":"Grzegorz Szafranski, and Roman Czyba. 2011. Different approaches of PID control UAV type quadrotor. IMAV'11, 70--75.","paperID":"None"},{"content":"Tomasso Toffoli and Norman Margolus. 1991. Programmable matter: Concepts and realization. Physica D: Nonlinear Phenomena 47, 1, 263--272.","paperID":"None"},{"content":"George Whitesides and Bartosz Grzybowski. 2002. Self-assembly at all scales, Science, 295(5564), 241--821.","paperID":"None"},{"content":"Andrew D. Wilson and Hrovje Benko. 2010. Combining multiple depth cameras and projectors for interactions on, above and between surfaces. In Proc. UIST '10, 273--282.","paperID":"None"},{"content":"Roel Vertegaal and Ivan Poupyrev. 2008. Organic user interfaces. Communications of the ACM 51, 6, 26--30.","paperID":"None"},{"content":"Vicon. 2015. http://www.vicon.com/","paperID":"None"}],"abstract":"We present BitDrones, a toolbox for building interactive real reality 3D displays that use nano-quadcopters as self-levitating tangible building blocks. Our prototype is a first step towards interactive self-levitating programmable matter, in which the user interface is represented using Catomic structures. We discuss three types of BitDrones: PixelDrones, equipped with an RGB LED and a small OLED display; ShapeDrones, augmented with an acrylic mesh spun over a 3D printed frame in a larger geometric shape; and DisplayDrones, fitted with a thin-film 720p touchscreen. We present a number of unimanual and bimanual input techniques, including touch, drag, throw and resize of individual drones and compound models, as well as user interface elements such as self-levitating cone trees, 3D canvases and alert boxes. We describe application scenarios and depict future directions towards creating high-resolution self-levitating programmable matter.","title":"BitDrones: Towards Using 3D Nanocopter Displays as Interactive Self-Levitating Programmable Matter","filename":"CHI16/p770","authors":["Antonio Gomes","Calvin Rubens","Sean Braley","Roel Vertegaal"],"conference":"CHI '16"}