{"paperId":2858045,"citation":[],"abstract":"Recent research examines how and why people abandon self tracking tools. We extend this work with new insights drawn from people reflecting on their experiences after they stop tracking, examining how designs continue to influence people even after abandonment. We further contrast prior work considering abandonment of health and wellness tracking tools with an exploration of why people abandon financial and location tracking tools, and we connect our findings to models of personal informatics. Surveying 193 people and interviewing 12 people, we identify six reasons why people stop tracking and five perspectives on life after tracking. We discuss these results and opportunities for design to consider life after self tracking.","reference":[{"content":"Louise Barkhuus and Anind Dey. (2003). LocationBased Services for Mobile Telephony: A Study of Users' Privacy Concerns. Proceedings of the IFIP TC13 International Conference on Human-Computer Interaction (INTERACT '03), 207--212.","paperID":"None"},{"content":"Eric P.S. Baumer, Phil Adams, Vera D. Khovanskaya, Tony C. Liao, Madeline E. Smith, Victoria Schwanda Sosik, and Kaiton Williams. (2013). Limiting, leaving, and (re) lapsing: an exploration of facebook non-use practices and experiences. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 3257--3266. http://doi.org/7wf","paperID":"None"},{"content":"Eun Kyoung Choe. (2014). Designing Self-Monitoring Technology to Promote Data Capture and Reflection. PhD Dissertation. The Information School, University of Washington, Seattle Washington.","paperID":"None"},{"content":"James Clawson, Jessica A. Pater, Andrew D. Miller, Elizabeth D. Mynatt, and Lena Mamykina. (2015). No Longer Wearing: Investigating the Abandonment of Personal Health-Tracking Technologies on Craigslist. Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). http://doi.org/10.1145/2750858.2807554","paperID":"None"},{"content":"Felicia Cordeiro, Daniel A. Epstein, Edison Thomaz, Elizabeth Bales, Arvind K. Jagannathan, Gregory D. Abowd, and James Fogarty. (2015). Barriers and Negative Nudges: Exploring Challenges in Food Journaling. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1159--1162. http://doi.org/bbdt","paperID":"None"},{"content":"Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. (2015). A Lived Informatics Model of Personal Informatics. Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 731--742. http://doi.org/10.1145/2750858.2804250","paperID":"None"},{"content":"Susannah Fox and Maeve Duggan. (2013). Tracking for Health. Pew Internet, 1--32. http://www.pewinternet.org/Reports/2013/Trackingfor-Health.aspx","paperID":"None"},{"content":"Thomas Fritz, Elaine M. Huang, Gail C. Murphy, and Thomas Zimmermann. (2014). Persuasive Technology in the Real World: A Study of Long-Term Use of Activity Sensing Devices for Fitness. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 487--496. http://doi.org/bbdv","paperID":"None"},{"content":"Matthew Kay, Dan Morris, mc schraefel, and Julie A. Kientz. (2013). There's No Such Thing as Gaining a Pound: Reconsidering the Bathroom Scale User Interface. Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13), 401--410. http://doi.org/bbdw","paperID":"None"},{"content":"Joseph \"Jofish\" Kaye, Mary McCuistion, Rebecca Gulotta, and David A. Shamma. (2014). Money talks: Tracking Personal Finances. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 521--530. http://doi.org/bbdx","paperID":"None"},{"content":"Amanda Lazar, Joshua Tanenbaum, Christian Koehler, and David H. Nguyen. (2015). Why We Use and Abandon Smart Devices. Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 635--646. http://doi.org/10.1145/2750858.2804288","paperID":"None"},{"content":"Ian Li, Anind Dey, and Jodi Forlizzi. (2010). A StageBased Model of Personal Informatics Systems. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 557--566. http://doi.org/bh8zsb","paperID":"None"},{"content":"Janne Lindqvist, Justin Cranshaw, Jason Wiese, Jason Hong, and John Zimmerman. (2011). I'm the Mayor of My House: Examining Why People Use foursquare-a Social-Driven Location Sharing Application. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2409--2418. http://doi.org/c956b2","paperID":"None"},{"content":"John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. (2014). Personal Tracking as Lived Informatics. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1163--1172. http://doi.org/bbdz","paperID":"None"},{"content":"Victoria Schwanda, Steven Ibara, Lindsay Reynolds, and Dan Cosley. (2011). Side Effects and \"Gateway\" Tools: Advocating a Broader look at Evaluating Persuasive Systems. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 345--348. http://doi.org/drcwkj","paperID":"None"},{"content":"Mark Whooley, Bernd Ploderer, and Kathleen Gray. (2014). On the Integration of Self-tracking Data amongst Quantified Self Members. Proceedings of the International BCS Human Computer Interaction Conference (BCS-HCI '14), 151--160. http://doi.org/bbdq","paperID":"None"}],"title":"Beyond Abandonment to Next Steps: Understanding and Designing for Life after Personal Informatics Tool Use","filename":"CHI16/p1109","authors":["Daniel A. Epstein","Monica Caraway","Chuck Johnston","An Ping","James Fogarty","Sean A. Munson"],"conference":"CHI '16"}