{"paperId":2858135,"citation":[],"abstract":"Foldem, a novel method of rapid fabrication of objects with multi-material properties is presented. Our specially formulated Foldem sheet allows users to fabricate and easily assemble objects with rigid, bendable, and flexible properties using a standard laser-cutter. The user begins by creating his designs in a vector graphics software package. A laser cutter is then used to fabricate the design by selectively ablating/vaporizing one or more layers of the Foldem sheet to achieve the desired physical properties for each joint. Herein the composition of the Foldem sheet, as well as various design considerations taken into account while building and designing the method, are described. Sample objects made with Foldem are demonstrated, each showcasing the unique attributes of Foldem. Additionally, a novel method for carefully calibrating a laser cutter for precise ablation is presented.","reference":[{"content":"Daniel M Aukes, Benjamin Goldberg, Mark R Cutkosky, and Robert J Wood. 2014. An analytic framework for developing inherentlymanufacturable pop-up laminate devices. Smart Materials and Structures 23, 9: 094013. http://doi.org/10.1088/0964-1726/23/9/094013","paperID":"None"},{"content":"Dustin Beyer, Serafima Gurevich, Stefanie Mueller, Hsiang-ting Chen, and Patrick Baudisch. Platener : Low-Fidelity Fabrication of 3D Objects by Substituting 3D Print with Laser-Cut Plates. 3--10.","paperID":"None"},{"content":"Eric Brockmeyer, Ivan Poupyrev, and Scott Hudson. 2013. PAPILLON. Proceedings of the 26th annual ACM symposium on User interface software and technology - UIST '13, ACM Press, 457--462. http://doi.org/10.1145/2501988.2502027","paperID":"None"},{"content":"Dongping Deng and Yong Chen. 2012. Design of Origami Sheets for Foldable Object Fabrication. Volume 3: 38th Design Automation Conference, Parts A and B, ASME, 223. http://doi.org/10.1115/DETC2012-71530","paperID":"None"},{"content":"James Fogarty, Jodi Forlizzi, and Scott E. Hudson. 2002. Specifying behavior and semantic meaning in an unmodified layered drawing package. Proceedings of the 15th annual ACM symposium on User interface software and technology - UIST '02, ACM Press, 61. http://doi.org/10.1145/571985.571995","paperID":"None"},{"content":"Neil Gershenfeld. 2007. Fab: The Coming Revolution on Your Desktop--from Personal Computers to Personal Fabrication. Retrieved September 20, 2015 from http://dl.acm.org/citation.cfm?id=1211574","paperID":"None"},{"content":"Gierad Laput, Eric Brockmeyer, Scott E. Hudson, and Chris Harrison. 2015. Acoustruments. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 2161--2170. http://doi.org/10.1145/2702123.2702414","paperID":"None"},{"content":"Simon J Leigh, Robert J Bradley, Christopher P Purssell, Duncan R Billson, and David A Hutchins. 2012. A simple, low-cost conductive composite material for 3D printing of electronic sensors. PloS one 7, 11: e49365. http://doi.org/10.1371/journal.pone.0049365","paperID":"None"},{"content":"Hod Lipson and Melba Kurman. 2013. Fabricated: The New World of 3D Printing. John Wiley & Sons. Retrieved September 24, 2015 from https://books.google.com/books?hl=en&lr=&id=Mp LXWHp-srIC&pgis=1","paperID":"None"},{"content":"Shuhei Miyashita and Daniela Rus. 2013. MultiCrease Self-Folding by Uniform Heating SelfFolding Method. Ecal 2013, 1: 955--956.","paperID":"None"},{"content":"Catarina Mota. 2011. The rise of personal fabrication. Proceedings of the 8th ACM conference on Creativity and cognition C&C '11, ACM Press, 279. http://doi.org/10.1145/2069618.2069665","paperID":"None"},{"content":"Stefanie Mueller, Bastian Kruck, and Patrick Baudisch. 2013. LaserOrigami. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13, ACM Press, 2585. http://doi.org/10.1145/2470654.2481358","paperID":"None"},{"content":"Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, and Patrick Baudisch. 2014. faBrickation. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 3827--3834. http://doi.org/10.1145/2556288.2557005","paperID":"None"},{"content":"Thomas J. Ober, Daniele Foresti, and Jennifer a. Lewis. 2015. Active mixing of complex fluids at the microscale. Proceedings of the National Academy of Sciences 2015, 2: 201509224. http://doi.org/10.1073/pnas.1509224112","paperID":"None"},{"content":"Huaishu Peng, Jennifer Mankoff, Scott E. Hudson, and James McCann. 2015. A Layered Fabric 3D Printer for Soft Interactive Objects. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 1789--1798. http://doi.org/10.1145/2702123.2702327","paperID":"None"},{"content":"Jie Qi and Leah Buechley. 2010. Electronic popables. Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction TEI '10, ACM Press, 121. http://doi.org/10.1145/1709886.1709909","paperID":"None"},{"content":"Jie Qi and Leah Buechley. 2012. Animating paper using shape memory alloys. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, ACM Press, 749. http://doi.org/10.1145/2207676.2207783","paperID":"None"},{"content":"Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice, and Björn Hartmann. 2014. A series of tubes. Proceedings of the 27th annual ACM symposium on User interface software and technology - UIST '14, ACM Press, 3--12. http://doi.org/10.1145/2642918.2647374","paperID":"None"},{"content":"Ryan Schmidt and Karan Singh. 2010. meshmixer. ACM SIGGRAPH 2010 Talks on SIGGRAPH '10, ACM Press, 1. http://doi.org/10.1145/1837026.1837034","paperID":"None"},{"content":"Jürgen Steimle Simon Olberding, Sergio Soto Ortega, Klaus Hildebrandt. 2015. Foldio: Digital Fabrication of Interactive and Shape--Changing Objects With Foldable Printed Electronics. Proceedings of the 28th annual ACM symposium on User interface software and technology.","paperID":"None"},{"content":"Pitchaya Sitthi-Amorn, Javier E. Ramos, Yuwang Wangy, et al. 2015. MultiFab. ACM Transactions on Graphics 34, 4: 129:1--129:11. http://doi.org/10.1145/2766962","paperID":"None"},{"content":"J Am Chem Soc, George M Whitesides, and Bartosz Grzybowski. 2002. Self-Assembly at All Scales. 295, March: 2418--2422.","paperID":"None"},{"content":"Yoav Sterman, Erik D. Demaine, and Neri Oxman. 2013. PCB Origami: A Material-Based Design Approach to Computer-Aided Foldable Electronic Devices. Journal of Mechanical Design 135, 11: 114502. http://doi.org/10.1115/1.4025370","paperID":"None"},{"content":"Michael T Tolley, Samuel M Felton, Shuhei Miyashita, Daniel Aukes, Daniela Rus, and Robert J Wood. 2014. Self-folding origami: shape memory composites activated by uniform heating. Smart Materials and Structures 23, 9: 094006. http://doi.org/10.1088/0964--1726/23/9/094006","paperID":"None"},{"content":"Michael T. Tolley, Samuel M. Felton, Shuhei Miyashita, et al. 2013. Self-folding shape memory laminates for automated fabrication. IEEE International Conference on Intelligent Robots and Systems: 4931--4936. http://doi.org/10.1109/IROS.2013.6697068","paperID":"None"},{"content":"Patrick Baudisch Udayan Umapathi, Hsiang-Ting Chen, Stefanie Mueller, Ludwig Wall, Anna Seufert. 2015. LaserStacker: Fabricating 3D Objects by Laser Cutting and Welding. Proceedings of the 28th annual ACM symposium on User interface software and technologyth annual ACM symposium on User interface software and technology.","paperID":"None"},{"content":"Daniel Wigdor Varun Perumal C. 2015. Printem: Instant Printed Circuit Boards with Standard Office Printers & Inks. Proceedings of the 28th annual ACM symposium on User interface software and technology.","paperID":"None"},{"content":"Kiril Vidimče, Szu-Po Wang, Jonathan RaganKelley, and Wojciech Matusik. 2013. OpenFab. ACM Transactions on Graphics 32, 4: 1. http://doi.org/10.1145/2461912.2461993","paperID":"None"},{"content":"Karl Willis, Eric Brockmeyer, Scott Hudson, and Ivan Poupyrev. 2012. Printed optics. Proceedings of the 25th annual ACM symposium on User interface software and technology - UIST '12, ACM Press, 589. http://doi.org/10.1145/2380116.2380190","paperID":"None"},{"content":"3D Printing 2015--2025: Technologies, Markets, Players: IDTechEx. Retrieved September 23, 2015 from http://www.idtechex.com/research/reports/3dprinting-2015-2025-technologies-markets-players000423.asp","paperID":"None"},{"content":"Objet Connex Multi-Material 3D Printers | Stratasys. Retrieved September 23, 2015 from http://www.stratasys.com/3d-printers/designseries/connex-systems","paperID":"None"},{"content":"Polyjet Matrix 3D Printing | Simultaneous Multimaterial 3D Printing. Retrieved September 23, 2015 from http://proto3000.com/polyjet-matrix-3Dprinting-technology-services.php","paperID":"None"},{"content":"Purple on White Laserable Acrylic Sheet. Retrieved September 23, 2015 from https://www.inventables.com/technologies/purpleon-white-laserable-acrylic-sheet","paperID":"None"},{"content":"Nike News - Nike Football Accelerates Innovation with 3D printed \"Concept Cleat\" for Shuttle. Retrieved September 23, 2015 from http://news.nike.com/news/nike-footballaccelerates-innovation-with-3d-printed-conceptcleat-for-shuttle","paperID":"None"},{"content":"Zuhal, Saturn's Wonderer | by Neri Oxman. Retrieved September 23, 2015 from http://www.materialecology.com/projects/details/zu hal","paperID":"None"},{"content":"Multicolor-extruder - RepRapWiki. Retrieved September 23, 2015 from http://reprap.org/wiki/Multicolor-extruder","paperID":"None"},{"content":"ColorFabb - woodFill Fine 3D Printing WOOD Filament. Retrieved September 23, 2015 from http://colorfabb.com/woodfill-fine","paperID":"None"},{"content":"Workshop Wednesday: How To Heat-Bend Acrylic Enclosures | Make: DIY Projects, How-Tos, Electronics, Crafts and Ideas for Makers. Retrieved September 24, 2015 from http://makezine.com/2013/02/06/workshopwednesday-heat-bending-acrylic-enclosures/","paperID":"None"},{"content":"Product overview by DMG MORI. Retrieved September 24, 2015 from http://caen.dmgmori.com/products/lasertec/lasertecadditivemanufacturing/lasertec-65-3d","paperID":"None"},{"content":"Pepakura Designer. Retrieved September 24, 2015 from http://www.tamasoft.co.jp/pepakura-en/","paperID":"None"},{"content":"Autodesk 123D Design. Retrieved September 24, 2015 from http://www.123dapp.com/design","paperID":"None"},{"content":"VersaLaser | Specification. Retrieved September 24, 2015 from http://www.versalaser.com.au/specification.html","paperID":"None"},{"content":"PAGE6. Retrieved September 24, 2015 from http://www.bendableplastic.com/PAGE6.html","paperID":"None"},{"content":"Super 77 Anniversary Promotion. Retrieved September 24, 2015 from http://solutions.3m.com/wps/portal/3M/en_US/Adh esives/Tapes/Promotions/Super77-AnniversaryPromotion/","paperID":"None"},{"content":"3MTM Scotch-WeldTM Epoxy Adhesive DP420 Black, 37 mL, 12 per case. Retrieved January 8, 2016 from http://solutions.3m.com/wps/portal/3M/en_US/Adh esives/Tapes/Products/~/3M-Scotch-Weld-EpoxyAdhesive-DP420-Black-37-mL-12-percase?N=6081606+4294871756&rt=rud","paperID":"None"},{"content":"1992. Apparatus and method for creating threedimensional objects. Retrieved September 23, 2015 from https://www.google.com/patents/US5121329","paperID":"None"}],"title":"Foldem: Heterogeneous Object Fabrication via Selective Ablation of Multi-Material Sheets","filename":"CHI16/p5765","authors":["Varun Perumal C","Daniel Wigdor"],"conference":"CHI '16"}