{"paperId":2858400,"citation":[],"reference":[{"content":"Erinn Atwater, Cecylia Bocovich, Urs Hengartner, Ed Lank, and Ian Goldberg. 2015. Leading Johnny to Water: Designing for Usability and Trust. In Eleventh Symposium On Usable Privacy and Security. 69-88.","paperID":"None"},{"content":"Aaron Bangor, Philip Kortum, and James Miller. 2008. An Empirical Evaluation of the System Usability Scale. International Journal of Human-Computer Interaction 24, 6 (2008), 574-594.","paperID":"None"},{"content":"Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining What Individual SUS Scores Mean: Adding An Adjective Rating Scale. Journal of Usability Studies 4, 3 (2009), 114-123.","paperID":"None"},{"content":"John Brooke. 1996. SUS -- A Quick and Dirty Usability Scale. In Usability Evaluation in Industry. CRC Press.","paperID":"None"},{"content":"John Brooke. 2013. SUS: A Retrospective. Journal of Usability Studies 8, 2 (2013), 29-40.","paperID":"None"},{"content":"Sascha Fahl, Marian Harbach, Thomas Muders, Matthew Smith, and Uwe Sander. 2012. Helping Johnny 2.0 to Encrypt His Facebook Conversations. In Proceedings of the Eighth Symposium on Usable Privacy and Security. ACM, 11.","paperID":"None"},{"content":"Electronic Frontier Foundation. 2015. Secure Messaging Scorecard. (Accessed 25 Sep 2015). https://www.eff.org/secure-messaging-scorecard.","paperID":"None"},{"content":"Simson L Garfinkel. 2003. Email-based Identification and Authentication: An Alternative to PKI? IEEE Security & Privacy 1, 6 (2003), 20-26.","paperID":"None"},{"content":"Simson L Garfinkel and Robert C Miller. 2005. Johnny 2: A User Test of Key Continuity Management with S/MIME and Outlook Express. In Proceedings of the First Symposium on Usable Privacy and Security. ACM, 13-24.","paperID":"None"},{"content":"Shirley Gaw, Edward W Felten, and Patricia Fernandez-Kelly. 2006. Secrecy, Flagging, and Paranoia: Adoption Criteria in Encrypted Email. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 591-600.","paperID":"None"},{"content":"HushMail. 2015. (Accessed 25 Sep 2015). https://www.hushmail.com/.","paperID":"None"},{"content":"Stanley Milgram and Ernest Van den Haag. 1978. Obedience to Authority. (1978).","paperID":"None"},{"content":"ProtonMail. 2015. (Accessed 25 Sep 2015). https://protonmail.ch/.","paperID":"None"},{"content":"Karen Renaud, Melanie Volkamer, and Arne Renkema-Padmos. 2014. Why Doesn't Jane Protect Her Privacy?. In Privacy Enhancing Technologies. Springer, 244-262.","paperID":"None"},{"content":"Scott Ruoti, Jeff Andersen, Travis Hendershot, Daniel Zappala, and Kent Seamons. 2015a. Helping Johnny Understand and Avoid Mistakes: A Comparison of Automatic and Manual Encryption in Email. arXiv preprint arXiv:1510.08435 (2015).","paperID":"None"},{"content":"Scott Ruoti, Jeff Andersen, Daniel Zappala, and Kent Seamons. 2015b. Why Johnny Still, Still Can't Encrypt: Evaluating the Usability of a Modern PGP Client. arXiv preprint arXiv:1510.08555 (2015).","paperID":"None"},{"content":"Scott Ruoti, Nathan Kim, Ben Burgon, Timothy Van Der Horst, and Kent Seamons. 2013. Confused Johnny: When Automatic Encryption Leads to Confusion and Mistakes. In Proceedings of the Ninth Symposium on Usable Privacy and Security. ACM, 5.","paperID":"None"},{"content":"Scott Ruoti, Brent Roberts, and Kent Seamons. 2015. Authentication Melee: A Usability Analysis of Seven Web Authentication Systems. In Proceedings of the 24th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee.","paperID":"None"},{"content":"Jeff Sauro. 2011. A Practical Guide to the System Usability Scale: Background, Benchmarks & Best Practices. Measuring Usability LLC.","paperID":"None"},{"content":"S. Sheng, L. Broderick, CA Koranda, and JJ Hyland. 2006. Why Johnny Still Can't Encrypt: Evaluating the Usability of Email Encryption Software. In Proceedings of the Second Symposium On Usable Privacy and Security - Poster Session.","paperID":"None"},{"content":"Andreas Sotirakopoulos, Kirstie Hawkey, and Konstantin Beznosov. 2010. \"I did it because I trusted you\": Challenges with the Study Environment Biasing Participant Behaviours. In SOUPS Usable Security Experiment Reports Workshop.","paperID":"None"},{"content":"StartMail. 2015. (Accessed 25 Sep 2015). https://www.startmail.com/.","paperID":"None"},{"content":"Thomas S Tullis and Jacqueline N Stetson. 2004. A Comparison of Questionnaires for Assessing Website Usability. In Usability Professional Association Conference. 1-12.","paperID":"None"},{"content":"TutaNota. 2015. (Accessed 25 Sep 2015). https://tutanota.com/.","paperID":"None"},{"content":"Virtru. 2015. (Accessed 25 Sep 2015). https://www.virtru.com/.","paperID":"None"},{"content":"Alma Whitten and J. D. Tygar. 1999. Why Johnny Can't Encrypt: A Usability Evaluation of PGP 5.0. In 8th USENIX Security Symposium. citeseer.nj.nec.com/whitten99why.html","paperID":"None"}],"abstract":"Secure email is increasingly being touted as usable by novice users, with a push for adoption based on recent concerns about government surveillance. To determine whether secure email is ready for grassroots adoption, we employ a laboratory user study that recruits pairs of novice users to install and use several of the latest systems to exchange secure messages. We present both quantitative and qualitative results from 25 pairs of novice users as they use Pwm, Tutanota, and Virtru. Participants report being more at ease with this type of study and better able to cope with mistakes since both participants are \"on the same page\". We find that users prefer integrated solutions over depot-based solutions, and that tutorials are important in helping first-time users. Hiding the details of how a secure email system provides security can lead to a lack of trust in the system. Participants expressed a desire to use secure email, but few wanted to use it regularly and most were unsure of when they might use it.","title":"\"We're on the Same Page\": A Usability Study of Secure Email Using Pairs of Novice Users","filename":"CHI16/p4298","authors":["Scott Ruoti","Jeff Andersen","Scott Heidbrink","Mark O'Neill","Elham Vaziripour","Justin Wu","Daniel Zappala","Kent Seamons"],"conference":"CHI '16"}