{"paperId":2858452,"citation":[],"reference":[{"content":"Ahmed Sabbir Arif, Michel Pahud, Ken Hinckley, and Bill Buxton. 2014. Experimental study of stroke shortcuts for a touchscreen keyboard with gesture redundant keys removed. In Proceedings of GI '14. Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 43--50.","paperID":"None"},{"content":"Robert Ball and Chris North, Analysis of user behavior on high-resolution tiled displays. 2005. Human-Computer Interaction-INTERACT 2005.Vol 3585 of the series Lecture Notes in Computer Science: 350363. http://doi.org/10.1007/11555261_30","paperID":"None"},{"content":"Enyoung Cho, Moky: invisible touchpad keyboard. 2015. Retrieved Sep. 7, 2015 from https://www.indiegogo.com/projects/moky-invisibletouchpad-keyboard","paperID":"None"},{"content":"W. Fallot-Burghardt, M. Fjeld, C. Speirs, S. Ziegenspeck, H. Krueger, and T. Läubli. 2006. Touch&Type: a novel pointing device for notebook computers. In Proceedings of NordiCHI '06. 465--468. http://doi.acm.org/10.1145/1182475.1182538","paperID":"None"},{"content":"Leah Findlater, Ben Lee, and Jacob Wobbrock. 2012. Beyond QWERTY: augmenting touch screen keyboards with multi-touch gestures for non-alphanumeric input. In Proceedings of CHI '12. ACM, 2679--2682. http://dx.doi.org/10.1145/2207676.2208660","paperID":"None"},{"content":"Vittorio Fuccella, Poika Isokoski, and Benoit Martin. 2013. Gestures and widgets: performance in text editing on multi-touch capable mobile devices. In Proceedings of CHI '13. ACM, 2785--2794. http://dx.doi.org/10.1145/2470654.2481385","paperID":"None"},{"content":"Iman Habib, Niklas Berggren, Erik Rehn, Gustav Josefsson, Andreas Kunz, and Morten Fjeld. 2009. Dgts: Combined typing and pointing. Human-Computer Interaction-INTERACT 2009, Vol. 5727 of the series Lecture Notes in Computer Science: 232235. http://doi.org/10.1007/978--3--642-03658--3_30","paperID":"None"},{"content":"Poika Isokoski. 2004. Performance of menuaugmented soft keyboards. In Proceedings of CHI '04. ACM, 423--430. http://dx.doi.org/10.1145/985692.985746","paperID":"None"},{"content":"Sunjun Kim, Jeongmin Son, Geehyuk Lee, Hwan Kim, and Woohun Lee. 2013. TapBoard: making a touch screen keyboard more touchable. In Proceedings of CHI '13. ACM, 553--562. http://doi.acm.org/10.1145/2470654.2470733","paperID":"None"},{"content":"Bryan Klimt and Yiming Yang. 2004. The enron corpus: A new dataset for email classification research. Machine learning: ECML. Springer Berlin Heidelberg, 217--226. http://doi.org/10.1007/978--3--540--30115--8_22","paperID":"None"},{"content":"Thomas A. Mysliwiec, 1994. Fingermouse: A freehand computer pointing interface. In Proceeding of International Conference on Automatic Face and Gesture Recognition, 372--277. http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1 .1.54.4906","paperID":"None"},{"content":"Michael Ortega and Laurence Nigay. 2009. AirMouse: Finger gesture for 2D and 3D interaction. Human-Computer Interaction-INTERACT 2009. Springer Berlin Heidelberg, 214--227. http://doi.org/10.1007/978--3--642-03658--3_28","paperID":"None"},{"content":"Joseph D. Rutledge and Ted Selker. 1990. Force-to-motion functions for pointing. In Proceedings of INTERACT '90. 701--706.","paperID":"None"},{"content":"Julia Schwarz, Scott Hudson, Jennifer Mankoff, and Andrew D. Wilson. 2010. A framework for robust and flexible handling of inputs with uncertainty. In Proceedings of UIST '10. ACM, New York, NY, USA, 47--56. http://dx.doi.org/10.1145/1866029.1866039","paperID":"None"},{"content":"R. William Soukoreff and I. Scott MacKenzie. 2003. Metrics for text entry research: an evaluation of MSD and KSPC, and a new unified error metric. In Proceedings of CHI '03, ACM, 113--120. http://doi.acm.org/10.1145/642611.642632","paperID":"None"},{"content":"William Soukoreff and I. Scott MacKenzie. 2004. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. International journal of human-computer studies, 61, 6 (December 2004): 751--789. http://dx.doi.org/10.1016/j.ijhcs.2004.09.001","paperID":"None"},{"content":"Christian Sutter and Martina Ziefle, 2005. Interacting with notebook input devices: An analysis of motor performances and user's expertise. Human Factors, 47: 169--187. http://doi.org/10.1518/0018720053653893","paperID":"None"},{"content":"Ying-Chao Tung, Ta Yang Cheng, Neng-Hao Yu, Chiuan Wang, and Mike Y. Chen. 2015. FlickBoard: Enabling Trackpad Interaction with Automatic Mode Switching on a Capacitive-sensing Keyboard. In Proceedings of CHI '15. ACM, 1847--1850. http://doi.acm.org/10.1145/2702123.2702582","paperID":"None"},{"content":"Wayne Westerman. 1999. Hand tracking, finger identification, and chordic manipulation on a multi-touch surface. Doctoral dissertation, University of Delaware.","paperID":"None"},{"content":"Andrew D. Wilson, and Edward Cutrell. 2005. FlowMouse: a computer vision-based pointing and gesture input device, Human-Computer Interaction INTERACT. Springer Berlin Heidelberg, 565--578. http://doi.org/10.1007/11555261_46","paperID":"None"}],"abstract":"We introduce TapBoard 2, a touchpad-based keyboard that solves the problem of typing and pointing disambiguation. The pointing interaction design of TapBoard 2 is nearly identical to natural touchpad interaction, and its shared workspace naturally invites bimanual pointing interaction. To implement TapBoard 2, we developed a novel gesture representation scheme for a systematic design and gesture recognizer. A user evaluation showed that TapBoard 2 successfully supports collocated pointing and typing interaction. It was able to disambiguate typing and pointing actions with an accuracy of greater than 95%. In addition, the typing and pointing performance of TapBoard 2 were comparable to that of a separate keyboard and mouse. In particular, the bimanual pointing operations of TapBoard 2 are highly efficient and strongly favored by participants.","title":"TapBoard 2: Simple and Effective Touchpad-like Interaction on a Multi-Touch Surface Keyboard","filename":"CHI16/p5163","authors":["Sunjun Kim","Geehyuk Lee"],"conference":"CHI '16"}