{"paperId":2858412,"citation":[],"reference":[{"content":"Accot, J. and Zhai, S. Beyond Fitts' Law: Models for Trajectory-Based HCI Tasks. in Proceedings of CHI'97 Conference on Human Factors in Computing Systems (1997), 295--302.","paperID":"None"},{"content":"Accot, J. and Zhai, S. More than Dotting the i's -Foundations for Crossing-Based Interfaces. in Proceedings of CHI'2002 Conference on Human Factors in Computing Systems Minneapolis, MN, 20--25 April, 2002, 73--80.","paperID":"None"},{"content":"Anderson, F. and Bischof, W.F. Learning and performance with gesture guides. in Proceedings of the ACM Conference on Human Factors in Computing Systems, ACM, (2013), 1109--1118.","paperID":"None"},{"content":"Apitz, G. and Guimbretiere, F. CrossY: a crossing-based drawing application Proceedings of the 17th annual ACM symposium on User interface software and technology, ACM, Santa Fe, NM, USA, 2004, 3--12.","paperID":"None"},{"content":"Bailly, G., Lecolinet, E. and Guiard, Y. Finger-Count and Radial-Stroke: Two Techniques for Augmenting Linear Menus on Multi-Touch Surfaces. in Proceedings of CHI 2010: ACM Conference on Human Factors in Computing Systems, ACM Press, (2010), 591--594.","paperID":"None"},{"content":"Bau, O. and Mackay, W.E. OctoPocus: a dynamic guide for learning gesture-based command sets. in Proceedings of the ACM Symposium on User Interface Software and Technology, ACM, (2008), 37--46.","paperID":"None"},{"content":"Bragdon, A., Nelson, E., Li, Y. and Hinckley, K. Experimental analysis of touch-screen gesture designs in mobile environments Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Vancouver, BC, Canada, 2011, 403--412.","paperID":"None"},{"content":"Cockburn, A. and Gutwin, C. A Predictive Model of Human Performance with Scrolling and Hierarchical Lists. Human-Computer Interaction 24, 3 (2009), 273314.","paperID":"None"},{"content":"Cockburn, A., Gutwin, C., Scarr, J. and Malacria, S. Supporting Novice to Expert Transitions in User Interfaces. ACM Computing Surveys 47, 2 (2014), 31:31--31:36.","paperID":"None"},{"content":"Cockburn, A., Kristensson, P., Alexander, J. and Zhai, S. Hard Lessons: Effort-Inducing Interfaces Benefit Spatial Learning. in Proceedings of CHI'07: ACM Conference on Human Factors in Computing Systems, ACM Press, (2007), 1571--1580.","paperID":"None"},{"content":"Ehret, B. Learning Where to Look: Location Learning in Graphical User Interfaces. in Proceedings of CHI'2002 Conference on Human Factors in Computing Systems, ACM Press, (2002), 211--218.","paperID":"None"},{"content":"Froehlich, J., Wobbrock, J.O. and Kane, S.K. Barrier pointing: using physical edges to assist target acquisition on mobile device touch screens Proceedings of the 9th international ACM SIGACCESS conference on Computers and accessibility, ACM, Tempe, AZ, USA, 2007, 19--26.","paperID":"None"},{"content":"Ghomi, E., Faure, G., St, Huot, p., Chapuis, O. and Beaudouin-Lafon, M. Using rhythmic patterns as an input method Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Austin, TX, USA, 2012, 1253--1262.","paperID":"None"},{"content":"Goldberg, D. and Richardson, C. Touch-Typing With a Stylus. in Proceedings of INTERCHI'93 Conference on Human Factors in Computing Systems, (1993), 80--87.","paperID":"None"},{"content":"Gutwin, C., Cockburn, A., Scarr, J. and Malacria, S. Faster Command Selection on Tablets with FastTap. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, (2014), 26172626.","paperID":"None"},{"content":"Hinckley, K., Pierce, J., Sinclair, M. and Horvitz, E. Sensing techniques for mobile interaction. in Proceedings of the 2000 ACM Symposium on User Interface Software and Technology, (2000), 91--100.","paperID":"None"},{"content":"Hinckley, K., Yatani, K., Pahud, M., Coddington, N., Rodenhouse, J., Wilson, A., Benko, H. and Buxton, B. Pen + touch = new tools Proceedings of the 23nd annual ACM symposium on User interface software and technology, ACM, NY, NY, USA, 2010, 27--36.","paperID":"None"},{"content":"Jain, M. and Balakrishnan, R. User learning and performance with bezel menus Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Austin, TX, USA, 2012, 2221--2230.","paperID":"None"},{"content":"Kurtenbach, G. The Design and Evaluation of Marking Menus Department of Computer Science, University of Toronto, Toronto, 1993.","paperID":"None"},{"content":"Kurtenbach, G. and Buxton, B. The Limits of Expert Performance Using Hierarchic Marking Menus. in Proceedings of InterCHI'93, (1993), 482--487.","paperID":"None"},{"content":"Kurtenbach, G. and Buxton, W. User Learning and Performance with Marking Menus. in Proceedings of CHI'94 Conference on Human Factors in Computing Systems, ACM, (1994), 258--264.","paperID":"None"},{"content":"Kurtenbach, G., Fitzmaurice, G., Baudel, T. and Buxton, B. The Design of a GUI Paradigm based on Tablets, Two-hands, and Transparency. in Proceedings of CHI'97 Conference on Human Factors in Computing Systems, Atlanta, GA, March 22--27, (1997), 35--42.","paperID":"None"},{"content":"Kurtenbach, G., Fitzmaurice, G., Owen, R. and Baudel, T. The Hotbox: efficient access to a large number of menu-items Proceedings of the SIGCHI conference on Human Factors in Computing Systems, ACM, Pittsburgh, Pennsylvania, USA, 1999, 231--237.","paperID":"None"},{"content":"Kurtenbach, G., Sellen, A. and Buxton, W. An Empirical Evaluation of Some Articulatory and Cognitive Aspects of Marking Menus. Human-Computer Interaction 8, 1 (1993), 1--23.","paperID":"None"},{"content":"Mackay, W.E. Which interaction technique works when?: floating palettes, marking menus and tool glasses support different task strategies Proceedings of the Working Conference on Advanced Visual Interfaces, ACM, Trento, Italy, 2002, 203--208.","paperID":"None"},{"content":"Malacria, S., Bailly, G., Harrison, J., Cockburn, A. and Gutwin, C. Promoting Hotkey Use through Rehearsal with ExposeHK. in Proceedings of CHI'13: ACM Conference on Human Factors in Computing Systems, ACM, (2013), 573--582.","paperID":"None"},{"content":"Ramos, G. and Balakrishnan, R. Zliding: Fluid Zooming and Sliding for High Precision Parameter Manipulation. in Proceedings of UIST'05: ACM Symposium on User Interface Software and Technology, ACM Press, (2005), 143--152.","paperID":"None"},{"content":"Ramos, G., Buoulos, M. and Balakrishnan, R. Pressure Widgets. in Proceedings of CHI'04. ACM Conference on Human Factors in Computing Systems, ACM Press, (2004), 487--494.","paperID":"None"},{"content":"Robertson, G., Czerwinski, M., Larson, K., Robbins, D., Thiel, D. and van Dantzich, M. Data Mountain: Using Spatial Memory for Document Management. in Proceedings of UIST'98 ACM Symposium on User Interface Software and Technology, (1998), 153--162.","paperID":"None"},{"content":"Roth, V. and Turner, T. Bezel swipe: conflict-free scrolling and multiple selection on mobile touch screen devices Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Boston, MA, USA, 2009, 1523--1526.","paperID":"None"},{"content":"Roudaut, A., Lecolinet, E. and Guiard, Y. MicroRolls: Expanding Touch-Screen Input Vocabulary by Distinguishing Rolls vs. Slides of the Thumb. in Proceedings of CHI 2009: ACM Conference on Human Factors in Computing Systems, ACM, (2009), 1927--1936.","paperID":"None"},{"content":"Scarr, J., Cockburn, A. and Gutwin, C. Supporting and Exploiting Spatial Memory in User Interfaces. Foundations and Trends in Human-Computer Interaction 6, 1 (2013), 1--84","paperID":"None"},{"content":"Scarr, J., Cockburn, A., Gutwin, C. and Bunt, A. Improving command selection with Command Maps. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, (2012), 257--266.","paperID":"None"},{"content":"Scarr, J., Cockburn, A., Gutwin, C., Bunt, A. and Cechanowicz, J. The Usability of Command Maps in Realistic Tasks. in Proceedings of ACM CHI 2014 Conference on Human Factors in Computing Systems, ACM, (2014).","paperID":"None"},{"content":"Scarr, J., Cockburn, A., Gutwin, C. and Malacria, S. Testing the robustness and performance of spatially consistent interfaces. in Proceedings of the 2013 SIGCHI Conference on Human Factors in Computing Systems, ACM, (2013), 3139--3148.","paperID":"None"},{"content":"Schmidt, R. Frequent augmented feedback can degrade learning: Evidence and interpretations. in Requin, J. and Stelmach, G. eds. Tutorials in motor neuroscience, 1991, 59--75.","paperID":"None"},{"content":"Wobbrock, J., Myers, B. and Kembel, J. EdgeWrite: A stylus-based text entry method designed for high accuracy and stability of motion. in Proceedings of the 16th annual ACM symposium on User Interface Software and Technology, ACM Press, (2003), 61--70.","paperID":"None"},{"content":"Yu, N.-H., Huang, D.-Y., Hsu, J.-J. and Hung, Y.-P. Rapid selection of hard-to-access targets by thumb on mobile touch-screens Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services, ACM, Munich, Germany, 2013, 400--403.","paperID":"None"},{"content":"Zhai, S. and Kristensson, P. Shorthand Writing on Stylus Keyboard. in Proceedings of CHI'2003 Conference on Human Factors in Computing Systems, (2003), 97--104.","paperID":"None"}],"abstract":"Hidden toolbars are becoming common on mobile devices. These techniques maximize the space available for application content by keeping tools off-screen until needed. However, current designs require several actions to make a selection, and they do not provide shortcuts for users who have become familiar with the toolbar. To better understand the performance capabilities and tradeoffs involved in hidden toolbars, we outline a design space that captures the key elements of these controls, and report on an empirical evaluation of four designs. Two of our designs provide shortcuts that are based on the user's spatial memory of item locations. The study found that toolbars with spatial-memory shortcuts had significantly better performance (700ms faster) than standard designs currently in use. Participants quickly learned the shortcut selection method (although switching to a memory-based method led to higher error rates than the visually-guided techniques). Participants strongly preferred one of the shortcut methods that allowed selections by swiping across the screen bezel at the location of the desired item. This work shows that shortcut techniques are feasible and desirable on touch devices, and shows that spatial memory can provide a foundation for designing shortcuts.","title":"Supporting Transitions to Expertise in Hidden Toolbars","filename":"CHI16/p4687","authors":["Katherine Schramm","Carl Gutwin","Andy Cockburn"],"conference":"CHI '16"}