{"paperId":2858309,"reference":[{"content":"Athreya, S. R., Kalaitzidou, K., Das, S. 2010. Processing and characterization of a carbon black-filled electrically conductive Nylon-12 nanocomposite produced by selective laser sintering. Materials Science and Engineering: A, 527, Issues 10-11, 25 April 2010. doi:10.1016/j.msea.2009.12.028","paperID":"None"},{"content":"Fu, C.W., Song, P., Yan, X., Yang, L.W., Jayaraman, P.K., and Cohen-Or, D. 2015. Computational interlocking furniture assembly. ACM Trans. Graph. 34, 4, Article 91 (July 2015), 11 pages. DOI=http://dx.doi.org/10.1145/2766892","paperID":"None"},{"content":"Gershenfeld, N. 2007. Fab: The Coming Revolution on Your Desktop--from Personal Computers to Personal Fabrication. Basic Books (February 6, 2007).","paperID":"None"},{"content":"Gong, N.-W., Steimle, J., Olberding, S., Hodges, S., Gillian, N., Kawahara, Y., and Paradiso, J. A. 2014. PrintSense: a versatile sensing technique to support multimodal flexible surface interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1407--1410. DOI=http://dx.doi.org/10.1145/2556288.2557173","paperID":"None"},{"content":"Geomagic® Haptic Devices website. 2015. Retrieved at September 25, 2015 from http://www.geomagic.com/en/products-landingpages/haptic","paperID":"None"},{"content":"Gong, N.-W., Zoran, A. and Paradiso, J. A. 2013. Inkjet-printed conductive patterns for physical manipulation of audio signals. In Proceedings of the adjunct publication of the 26th annual ACM symposium on User interface software and technology (UIST '13 Adjunct). ACM, NY, NY, USA, 1314. DOI=http://dx.doi.org/10.1145/2508468.2514932.","paperID":"None"},{"content":"Innovative Products SENSOR BEARINGS FOR INDUSTRIAL MACHINERY. NSK Europe website. Retrieved December 26, 2015, from http://www.nskeurope.com/cps/rde/xchg/eu_en/hs.xsl/innovative-sensor-bearings-for-industrialmachinery.html","paperID":"None"},{"content":"Ishii, H., Leithinger, D., Follmer, S., Zoran, A., Schoessler, P., and Counts, J. 2015. TRANSFORM: Embodiment of \"Radical Atoms\" at Milano Design Week. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 687--694. DOI=http://dx.doi.org/10.1145/2702613.2702969","paperID":"None"},{"content":"Kawahara, Y., Hodges, S., Gong, N.-W., Olberding, S. and Steimle, J. 2014. Building Functional Pervasive Computing Prototypes using Conductive Inkjet Printing. In IEEE Pervasive Computing, (Volume:13 , Issue: 3 ), July-Sept. 2014. DOI=http://doi.ieeecomputersociety.org/10.1109/MPRV. 2014.41","paperID":"None"},{"content":"Schmitt, P. 2011. Original Machines: Developing Tools and Methods for Object-Oriented Mechatronics. PhD dissertation, Massachusetts Institute of Technology. Dept. of Architecture. Program in Media Arts and Sciences.","paperID":"None"},{"content":"Shapeways website - 3D Printing Service and Marketplace. (n.d.). Retrieved August 23, 2015, from http://www.shapeways.com/materials/wax","paperID":"None"},{"content":"Shilkrot, R., Maes, P., Paradiso, J. A., and Zoran, A. 2015. Augmented Airbrush for Computer Aided Painting (CAP). ACM Trans. Graph. 34, 2, Article 19 (March 2015). DOI=http://dx.doi.org/10.1145/2699649","paperID":"None"},{"content":"Stratasys Direct Manufacturing website - 3D PRINTING & MANUFACTURING. (n.d.). Retrieved August 23, 2015, from https://www.stratasysdirect.com/materials/direct-metallaser-sintering/","paperID":"None"},{"content":"Steimle, J. 2015. Printed electronics for human-computer interaction. In ACM Interactions 22, 3 (April 2015), 72--75. DOI=http://dx.doi.org/10.1145/2754304","paperID":"None"},{"content":"Systems and Solutions for Metal Manufacturing. EOS website. Retrieved August 23, 2015, from http://www.eos.info/systems_solutions/metal","paperID":"None"},{"content":"The World's First 3D Electronics Printer. Voxel8 website. Retrieved August 23, 2015, from http://www.voxel8.co/","paperID":"None"},{"content":"Li, H., Hu, R., Alhashim, I., and Zhang, H. 2015. Foldabilizing furniture. ACM Trans. Graph. 34, 4, Article 90 (July 2015), 12 pages. DOI=http://dx.doi.org/10.1145/2766912","paperID":"None"},{"content":"Motor encoder units. SKF website. Retrieved December 26, 2015, from http://www.skf.com/us/products/bearings-unitshousings/engineered-products/sensor-bearingunits/motor-encoder-units/index.html?switch=y","paperID":"None"},{"content":"Nakagaki, K., Inamura, C., Totaro, P., Shihipar, T., Akikyama, C., Shuang, Y., and Ishii. H. 2015. LinkedStick: Conveying a Physical Experience using a Shape Shifting Stick. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA,1609--1614. DOI=http://dx.doi.org/10.1145/2702613.2732712","paperID":"None"},{"content":"Capacitance measurement with the Arduino Uno. Nethercott website . Retrieved August 24, 2015, from http://wordpress.codewrite.co.uk/pic/2014/01/21/capmeter-with-arduino-uno/","paperID":"None"},{"content":"Niiyama, R., Sun, X., Yao, L., Ishii, H., Rus, D., and Kim, S. 2015. Sticky Actuator: Free-Form Planar Actuators for Animated Objects. International Conference on Tangible, Embedded, and Embodied Interaction (TEI'15), ACM, NY, NY, USA, 7784. DOI=http://dx.doi.org/10.1145/2677199.2680600","paperID":"None"},{"content":"Norton, R. L. 2010. Machine Design, (4th Edition), Prentice-Hall.","paperID":"None"},{"content":"Material Properties of SLS Thermoplastics. JR Prototypes website. Retrieved August 23, 2015, from http://www.jrprototypes.com/sls-prototypes/slsmaterial-properties.htm","paperID":"None"},{"content":"Patkar, M. (2013, September 10). 8 Cool Smartphone Controlled Toys You Secretly Desire! Retrieved August 23, 2015, from http://www.makeuseof.com/tag/8-cool-smartphonecontrolled-toys-you-secretly-desire","paperID":"None"},{"content":"PRESSURE-SENSITIVE CONDUCTIVE SHEET (VELOSTAT/LINQSTAT). (n.d.). Retrieved August 23, 2015, from https://www.adafruit.com/products/1361","paperID":"None"},{"content":"Yao, L., Niiyama, R., Ou, J., Follmer, S., Silva, C. D., and Ishii, .. 2013. PneUI: pneumatically actuated soft composite materials for shape changing interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, NY, NY, USA, 13--22. DOI=http://dx.doi.org/10.1145/2501988.2502037","paperID":"None"},{"content":"Willis, K., Brockmeyer, E., Hudson, S. and Poupyrev, I. 2012. Printed optics: 3D printing of embedded optical elements for interactive devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, NY, NY, USA, 589--598. DOI=http://dx.doi.org/10.1145/2380116.2380190","paperID":"None"},{"content":"Zoran, A. 2011. \"The 3D Printed Flute: Digital Fabrication and Design of Musical Instruments,\" Journal of New Music Research (JNMR), volume 40, issue 4, December 2011.","paperID":"None"},{"content":"Zoran, A, Shilkrot, R, and Paradiso, J.A. 2013. Human-computer interaction for hybrid carving. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, NY, NY, USA, 433--440. DOI=http://dx.doi.org/10.1145/2501988.2502023","paperID":"None"}],"citation":[],"abstract":"Many interactive devices use both machine elements and sensors, simultaneously but redundantly enabling and measuring the same physical function. We present Steel-Sense, an approach to joining these two families of elements to create a new type of HCI design primitive. We leverage recent developments in 3D printing to embed sensing in metal structures that are otherwise difficult to equip with sensors, and present four design principles, implementing (1) an electronic switch integrated within a ball bearing; (2) a voltage divider within a gear; (3) a variable capacitor embedded in a hinge; and (4) a pressure sensor within a screw. Each design demonstrates a different sensing principle, and signals its performance through (1) movement; (2) position; (3) angle (4) or stress. We mirror our elements physical performance in a virtual environment, evaluate our designs electronically and structurally, and discuss future work and implications for HCI research.","title":"Steel-Sense: Integrating Machine Elements with Sensors by Additive Manufacturing","filename":"CHI16/p5731","authors":["Tatyana Vasilevitsky","Amit Zoran"],"conference":"CHI '16"}