{"paperId":2858059,"citation":[],"reference":[{"content":"Swamy Ananthanarayan, Nathan Lapinski, Katie Siek, and Michael Eisenberg. \"Towards the crafting of personal health technologies.\" In Proceedings of the 2014 conference on Designing interactive systems, pp. 587--596. ACM, 2014.","paperID":"None"},{"content":"Mara Balestrini, Paul Marshall, and Tomas Diez. \"Beyond boundaries: the home as city infrastructure for smart citizens.\" In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication, pp. 987--990. ACM, 2014.","paperID":"None"},{"content":"Mara Balestrini, Tomas Diez, Paul Marshall, Alex Gluhak, and Yvonne Rogers. \"IoT Community Technologies: Leaving Users to Their Own Devices or Orchestration of Engagement?\" In EAI Endorsed Transactions on Internet of Things, EAI, 2015, Vol. 15 (1).","paperID":"None"},{"content":"Michael Blackstock, and Rodger Lea. \"IoT mashups with the WoTKit.\" In Internet of Things (IOT), 2012 3rd International Conference on the, pp. 159--166. IEEE, 2012.","paperID":"None"},{"content":"Alan F. Blackwell, and Rob Hague. \"AutoHAN: An architecture for programming the home.\" In Human-Centric Computing Languages and Environments, 2001. Proceedings IEEE Symposia on, pp. 150--157. IEEE, 2001.","paperID":"None"},{"content":"Saskia Bakker, Elise van den Hoven, and Berry Eggen. \"Peripheral interaction: characteristics and considerations.\" Personal and Ubiquitous Computing 19, no. 1 (2015): 239--254.","paperID":"None"},{"content":"Andreas Butz, Michael Schmitz, Antonio Krüger, and Harald Hullmann. \"Tangible UIs for media control: probes into the design space.\" In CHI'05 Extended Abstracts on Human Factors in Computing Systems, pp. 957971. ACM, 2005.","paperID":"None"},{"content":"Jeeyong Chung, Kyungeun Min, and Woohun Lee. \"CUBEMENT: democratizing mechanical movement design.\" In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction, pp. 81--84. ACM, 2014.","paperID":"None"},{"content":"Andrew Dahley, Craig Wisneski, and Hiroshi Ishii. \"Water lamp and pinwheels: ambient projection of digital information into architectural space.\" In CHI 98 Cconference Summary on Human Factors in Computing Systems, pp. 269--270. ACM, 1998.","paperID":"None"},{"content":"Tomas Diez, and Alex Posada. \"The fab and the smart city: the use of machines and technology for the city production by its citizens.\" In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction, pp. 447--454. ACM, 2013.","paperID":"None"},{"content":"Tanja Döring, Axel Sylvester, and Albrecht Schmidt. \"A design space for ephemeral user interfaces.\" In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction, pp. 75--82. ACM, 2013.","paperID":"None"},{"content":"Alois Ferscha, Simon Vogl, Bernadette Emsenhuber, and Bernhard Wally. \"Physical shortcuts for media remote controls.\" In Proceedings of the 2nd international conference on INtelligent TEchnologies for interactive enterTAINment, p. 9. ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), 2008.","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. inFORM: dynamic physical affordances and constraints through shape and object actuation. In Proceedings of the 26th annual ACM symposium on User interface software and technology. ACM, 2013.","paperID":"None"},{"content":"John Hardy, Christian Weichel, Faisal Taher, John Vidler, and Jason Alexander. \"ShapeClip: towards rapid prototyping with shape-changing displays for designers.\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, pp. 19--28. ACM, 2015.","paperID":"None"},{"content":"Jeremy M. Heiner, Scott E. Hudson, and Kenichiro Tanaka. \"The information percolator: ambient information display in a decorative object.\" In Proceedings of the 12th annual ACM symposium on User interface software and technology, pp. 141--148. ACM, 1999.","paperID":"None"},{"content":"Eva Hornecker, and Jacob Buur. \"Getting a grip on tangible interaction: a framework on physical space and social interaction.\" In Proceedings of the SIGCHI conference on Human Factors in computing systems, pp. 437--446. ACM, 2006.","paperID":"None"},{"content":"Steven Houben, and Christian Weichel. \"Overcoming interaction blindness through curiosity objects.\" In CHI'13 Extended Abstracts on Human Factors in Computing Systems, pp. 1539--1544. ACM, 2013.","paperID":"None"},{"content":"Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon et al. \"Technology probes: inspiring design for and with families.\" In Proceedings of the SIGCHI conference on Human factors in computing systems, pp. 17--24. ACM, 2003","paperID":"None"},{"content":"Hiroshi Ishii, and Brygg Ullmer. \"Tangible bits: towards seamless interfaces between people, bits and atoms.\" In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems, pp. 234--241. ACM, 1997.","paperID":"None"},{"content":"Hiroshi Ishii, Craig Wisneski, Scott Brave, Andrew Dahley, Matt Gorbet, Brygg Ullmer, and Paul Yarin. \"ambientROOM: integrating ambient media with architectural space.\" In CHI 98 Cconference Summary on Human Factors in Computing Systems, pp. 173--174. ACM, 1998.","paperID":"None"},{"content":"Jens H. Jahnke, Marc D'entremont, and Jochen Stier. \"Facilitating the programming of the smart home.\" Wireless Communications, IEEE 9, no. 6 (2002): 70--76.","paperID":"None"},{"content":"Yvonne Jansen, Pierre Dragicevic, and Jean-Daniel Fekete. \"Evaluating the efficiency of physical visualizations.\" Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2013.","paperID":"None"},{"content":"Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. \"Opportunities and challenges for data physicalization.\" In CHI 2015-Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2015.","paperID":"None"},{"content":"Rohit A. Khot, Larissa Hjorth, and Florian 'Floyd' Mueller. \"Understanding physical activity through 3D printed material artifacts.\" In Proceedings of the 32nd annual ACM conference on Human factors in computing systems, pp. 3835--3844. ACM, 2014.","paperID":"None"},{"content":"Robert Kowalski, Sebastian Loehmann, and Doris Hausen. \"cubble: a multi-device hybrid approach supporting communication in long-distance relationships.\" In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction, pp. 201--204. ACM, 2013.","paperID":"None"},{"content":"Jamshaid G. Mohebzada, and Arsalan H. Bhojani. \"The cubes: A tangible game-based learning system.\" In Innovations in Information Technology (IIT), 2011 International Conference on, pp. 179--184. IEEE, 2011.","paperID":"None"},{"content":"Elizabeth D. Mynatt, Maribeth Back, Roy Want, Michael Baer, and Jason B. Ellis. \"Designing audio aura.\" In Proceedings of the SIGCHI conference on Human factors in computing systems, pp. 566--573. ACM Press/Addison-Wesley Publishing Co., 1998.","paperID":"None"},{"content":"Hyunjoo Oh, and Mark D. Gross. \"Cube-in: A Learning Kit for Physical Computing Basics.\" In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, pp. 383--386. ACM, 2015.","paperID":"None"},{"content":"Zachary Pousman, and John Stasko. \"A taxonomy of ambient information systems: four patterns of design.\" In Proceedings of the working conference on Advanced visual interfaces, pp. 67--74. ACM, 2006.","paperID":"None"},{"content":"Zachary Pousman, John T. Stasko, and Michael Mateas. \"Casual information visualization: Depictions of data in everyday life.\" Visualization and Computer Graphics, IEEE Transactions on 13, no. 6 (2007): 1145--1152.","paperID":"None"},{"content":"Kathrin Probst, Michael Haller, Kentaro Yasu, Maki Sugimoto, and Masahiko Inami. \"Move-it sticky notes providing active physical feedback through motion.\" In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction, pp. 29--36. ACM, 2014.","paperID":"None"},{"content":"Michal Rinott, Shachar Geiger, Eran Gal-Or, and Luka Or. \"Cubes.\" InProceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction, pp. 397--398. ACM, 2013.","paperID":"None"},{"content":"Bert Schiettecatte, and Jean Vanderdonckt. \"AudioCubes: a distributed cube tangible interface based on interaction range for sound design.\" In Proceedings of the 2nd international conference on Tangible and embedded interaction, pp. 3--10. ACM, 2008.","paperID":"None"},{"content":"Orit Shaer, and Eva Hornecker. \"Tangible user interfaces: past, present, and future directions.\" Foundations and Trends in Human-Computer Interaction 3, no. 1--2 (2010): 1--137.","paperID":"None"},{"content":"Ehud Sharlin, Yuichi Itoh, Benjamin Watson, Yoshifumi Kitamura, Steve Sutphen, and Lili Liu. \"Cognitive cubes: a tangible user interface for cognitive assessment.\" In Proceedings of the SIGCHI conference on Human factors in computing systems, pp. 347--354. ACM, 2002.","paperID":"None"},{"content":"Simon Stusak, Aurélien Tabard, Franziska Sauka, Rohit Ashok Khot, and Andreas Butz. \"Activity sculptures: Exploring the impact of physical visualizations on running activity.\" Visualization and Computer Graphics, IEEE Transactions on 20, no. 12 (2014): 2201--2210.","paperID":"None"},{"content":"Simon Stusak, Jeannette Schwarz, and Andreas Butz. \"Evaluating the Memorability of Physical Visualizations.\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, pp. 3247--3250. ACM, 2015.","paperID":"None"},{"content":"Faisal Taher, John Hardy, Abhijit Karnik, Christian Weichel, Yvonne Jansen, Kasper Hornbæk, and Jason Alexander. \"Exploring interactions with physically dynamic bar charts.\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, pp. 3237--3246. ACM, 2015.","paperID":"None"},{"content":"Craig Wisneski, Hiroshi Ishii, Andrew Dahley, Matt Gorbet, Scott Brave, Brygg Ullmer, and Paul Yarin. \"Ambient displays: Turning architectural space into an interface between people and digital information.\" In Cooperative buildings: Integrating information, organization, and architecture, pp. 22--32. Springer Berlin Heidelberg, 1998.","paperID":"None"},{"content":"Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. \"bioLogic: Natto Cells as Nanoactuators for Shape Changing Interfaces.\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, pp. 1--10. ACM, 2015.","paperID":"None"},{"content":"Jack Zhao, and Andrew Vande Moere. \"Embodiment in data sculpture: a model of the physical visualization of information.\" In Proceedings of the 3rd international conference on Digital Interactive Media in Entertainment and Arts, pp. 343--350. ACM, 2008.","paperID":"None"},{"content":"LabView. Retrieved on January 7, 2015 from http://www.ni.com/labview/","paperID":"None"},{"content":"Max/MSP. Retrieved on January 7, 2015 from https://cycling74.com/","paperID":"None"},{"content":"NodeRed. Retrieved on January 7, 2015 from http://nodered.org/","paperID":"None"},{"content":"SamLabs. Retrieved on January 7, 2015 from https://samlabs.me/","paperID":"None"},{"content":"Quartz Composer. Retrieved on January 7, 2015 from https://developer.apple.com/","paperID":"None"}],"abstract":"Internet of things (IoT) devices and sensor kits have the potential to democratize the access, use, and appropriation of data. Despite the increased availability of low cost sensors, most of the produced data is \"black box\" in nature: users often do not know how to access or interpret data. We propose a \"human-data design\" approach in which end-users are given tools to create, share, and use data through tangible and physical visualizations. This paper introduces Physikit, a system designed to allow users to explore and engage with environmental data through physical ambient visualizations. We report on the design and implementation of Physikit, and present a two-week field study which showed that participants got an increased sense of the meaning of data, embellished and appropriated the basic visualizations to make them blend into their homes, and used the visualizations as a probe for community engagement and social behavior.","title":"Physikit: Data Engagement Through Physical Ambient Visualizations in the Home","filename":"CHI16/p1608","authors":["Steven Houben","Connie Golsteijn","Sarah Gallacher","Rose Johnson","Saskia Bakker","Nicolai Marquardt","Licia Capra","Yvonne Rogers"],"conference":"CHI '16"}