{"paperId":2858258,"citation":[],"reference":[{"content":"Mohyen Uddin Ahmed and Peter Funk, 2012. A computer Aided System for Post-operative Pain Treatment Combining Knowledge Discovery and CaseBased Reasoning. In ICCBR, B.D. Agudo and I. Watson Eds. Springer, Lyon, France.","paperID":"None"},{"content":"Gazihan Alankus, Amanda Lazar, Mattt May, and Caitlin Kelleher, 2010. Towards Customizable Games for Stroke Rehabilitation. In Proceedings of the Conference on Human Factors in Computing Systems, CHI '10 (Atlanta, GA, USA), ACM, 2113--2122 http://doi.acm.org/10.1145/1753326.1753649","paperID":"None"},{"content":"Jan-Henk Annema, Mathijs Verstraete, Vero Vanden Abeeele, Stef Desmet, and David Geerts, 2010. Videogames in therapy: a therapist's perspective. In Fun and Games ACM, Leuven, Belgium, 94--97.","paperID":"None"},{"content":"Karlene Ball, Daniel B. Berch, Karin F. Helmers, Jared B. Jobe, Mary D. Leveck, Michael Marsiske, John N. Morris, George W. Rebok, David M. Smith, Sharon L. Tennstedt, Frederick W. Unverzagt, and Sherry L. Willis, 2002. Effects of cognitive training interventions with older adults: A randomized controlled trial. JAMA 288, 18, 2271--2281.","paperID":"None"},{"content":"Chris Bateman and Richard Boon, 2006. 21st Century Game Design. Charles River Media, Hingham, MA, USA.","paperID":"None"},{"content":"Aimee L. Betker, Ankur Desai, Cristabel Nett, Naaz Kapadia, and Tony Szturm, 2007. Game-based Exercises for Dynamic Short-Sitting Balance Rehabilitation of People with Chronic Spinal Cord and Traumatic Brain Injuries. Physical Therapy 87, 10, 1389--1398.","paperID":"None"},{"content":"Brain Injury Association of America: Quick Facts About Brain Injury. Retrieved September 8, 2015, from http://www.biausa.org/bia-media-center.htm","paperID":"None"},{"content":"Sinead Brosnan, 2009. Potential of Wii-Rehabilitation for Persons Recovering From Acute Stroke. In Special Interest Section Quarterly: Physical Disabilities The American Occupational Therapy Association, Inc.","paperID":"None"},{"content":"Stuart Brown, 2009. Play: How it shapes the brain, opens the imagination and invigorates the soul. Penguin Group, NY, NY, USA.","paperID":"None"},{"content":"J.W. Burke, M.D.J. Mcneill, D.K. Charles, P.J. Morrow, H. Crosbie, and S.M. Mcdonough, 2009. Optimising engagement for stroke rehabilitation using serious games. The Visual Computer 25, 1085--1099.","paperID":"None"},{"content":"J.W. Burke, M.D.J. Mcneill, D.K. Charles ·, P.J. Morrow, .H. Crosbie, and S.M. Mcdonough, 2009. Serious Games for Upper Limb Rehabilitation Following a Stroke. In Games and Virtual Worlds for Serious Applications, VS-GAMES '09 IEEE, Coventry, UK, 103 -110.","paperID":"None"},{"content":"Jinghui Cheng and Cynthia Putnam, 2015. Therapeutic Gaming in Context: Observing Game Game Use for Brain Injury Rehabilitation. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. CHI EA '15, (Seoul, Korea), ACM, 1169--1174. http://doi.acm.org/10.1145/2702613.2732697","paperID":"None"},{"content":"Jinghui Cheng, Cynthia Putnam and Doris Rusch, 2015. Towards Efficacy-Centered Game Design Patterns For Brain Injury Rehabilitation: A DataDriven Approach. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, ASSETS '15 , (Lisbon, Portugal), ACM, 291--299. http://doi.acm.org/10.1145/2700648.2809858","paperID":"None"},{"content":"Ki Hun Cho, Kyoung Jin Lee, and Chang Ho Song, 2012. Virtual-reality balance training with a videogame system improves dynamic balance in chronic stroke patients. The Tohoku Journal of Experimental Medicine 228, 1, 69--74.","paperID":"None"},{"content":"CogFit-Quest Retrieved July 6, 2014, from http://www.cogfitquest.com","paperID":"None"},{"content":"B. B. Connor and P. J. Standen, 2012. So much technology, so little time: factors affecting use of computer-based brain training games for cognitive rehabilitation following stroke. In Proc. 9th Intl Conf. Disability, Virtual Reality & Associated Technologies, Laval, France, 53--59.","paperID":"None"},{"content":"Jeffrey P. Cuthbert, Kristi Staniszewski, Kaitlin Hays, Don Gerber, Audrey Natale, and Denise O'Dell, 2014. Virtual reality-based therapy for the treatment of balance deficits in patients receiving inpatient rehabilitation for traumatic brain injury. Brain Injury 28, 2, 181--188.","paperID":"None"},{"content":"Judith E Deutsch, D. Robbins, J. Morrison, and Phyllis Guarrera-Bowlby, 2009. Wii-based compared to standard of care balance and mobility rehabilitation for two individuals post-stroke. In Virtual Rehabilitation International Conference IEEE, Haifa, Israel, 117--120. http://dx.doi.org/10.1109/ICVR.2009.5174216","paperID":"None"},{"content":"Sheryl Flynn, Phyllis Palma, and Anneke Bender, 2007. Feasibility of Using the Sony PlayStation 2 Gaming Platform for an Individual Poststroke: A Case Report. Journal of Neurological Physical Therapy (JNPT) 31, 180--189.","paperID":"None"},{"content":"Jose-Antonio Gil-Gomez, Jose-Antonio Lozano, Mariano Alcaniz, and Sergio Albioi, 2009. Nintendo Wii Balance board for balance disorders. In Virtual Rehabilitation International Conference IEEE, Haifa, Israel, 213. http://dx.doi.org/10.1109/ICVR.2009.5174251.","paperID":"None"},{"content":"Jonathan Halton, 2008. Virtual rehabilitation with video games: A new frontier for occupational therapy. Occupational Therapy Now, 10 (1), 12--14.","paperID":"None"},{"content":"Jonathan Halton, 2010. Rehabilitation with the Nintendo Wii: Experiences at a rehabilitation hospital. Occupational Therapy Now, 12 (3), 11--14.","paperID":"None"},{"content":"Brian T. Horowitz. Blue Marble Games Aid People With Traumatic Brain Injuries. Retrieved June 20, 2015, from http://www.eweek.com/enterpriseapps/slideshows/blue-marble-games-aid-people-withtraumatic-brain-injuries","paperID":"None"},{"content":"Henri L Hurkmans, Gerard M Ribbers, Marjolein F Streur-Kranenburg, Henk J Stam, and Rita J Van Den Berg-Emons, 2011. Energy expenditure in chronic stroke patients playing Wii Sports: a pilot study. Journal of Neuroengineering and Rehabilitation. 8. http://dx.doi.org/10.1186/1743-0003--8--38.","paperID":"None"},{"content":"Alec Holt, Isabelle Bichindaritz, Rainer Schmidt, and Petra Perner, 2005. Medical applications in case-based reasoning. The Knowledge Engineering Review 20, 3, 289--292. http://dx.doi.org/DOI 10.1017/S0269888906000622","paperID":"None"},{"content":"Injury Prevention & Control: Traumatic Brain Injury. Retrieved September 8, 2015, from: http://www.cdc.gov/traumaticbraininjury/","paperID":"None"},{"content":"Jintronix. Retrieved June 20, 2015, from http://jintronix.com/","paperID":"None"},{"content":"Loh Yong Joo, Tjan Soon Yin, Donald Xu, Ernest Thia, Pei Fen Chia, Christopher Wee Keong Kuah, and Kong Keng He, 2010. A feasibility study using interactive commercial off-the-shelf computer gaming in upper limb rehabilitation in patients after stroke. J Rehabil Med 42, 5, 437--441. http://dx.doi.org/10.2340/16501977-0528.","paperID":"None"},{"content":"KHUO.com, 2014. \"Wii games among therapy options for brain injury patients at TIRR.\" Retrieved December 20, 2015 from http://www.khou.com/story/news/2014/07/14/1142954 0/","paperID":"None"},{"content":"Kate E Laver, Stacey George, Susie Thomas, Judith E Deutsch, and Maria Crotty, 2011. Virtual reality for stroke rehabilitation. Cochrane Database of Systematic Reviews 9.Art. No.: CD008349, http://dx.doi.org/10.1002/14651858.CD008349","paperID":"None"},{"content":"Lumosity. Retrieved July 6, 2014, from http://www.lumosity.com/","paperID":"None"},{"content":"Aasia Khanuma, Muidmuftib, M.Younusjaveda, and M.Zubairshafiq, 2009. Fuzzy case-based reasoning for facial expression recognition. Fuzzy Sets and Systems 160,231--250.","paperID":"None"},{"content":"Cindy Marling, Jay Shubrook, and Frank Schwartz, 2008. Case-Based Decision Support for Patients with Type 1 Diabetes on Insulin Pump therapy. In ECCBR 2008. LNCS (LNAI), K. D..Atltoff, R. Bergmann, M. Minor and A. Hanft Eds. Springer-Verlag Berlin.","paperID":"None"},{"content":"Mira. Retrieved June 20, 2015, from www.mirarehab.com","paperID":"None"},{"content":"Jacob Nielson. Thinking Aloud: The #1 Usability Tool. Retrieved September 8, 2015 from http://www.nngroup.com/articles/thinking-aloud-the-1usability-tool/","paperID":"None"},{"content":"Jessica M Paavola, Kory E Oliver, and Ksenia I Ustinova, 2013. Use of X-box Kinect Gaming Console for Rehabilitation of an Individual with Traumatic Brain Injury: A Case Report. Novel Physiotherapies 3, 1. http://dx.doi.org/10.4172/2165--7025.1000129.","paperID":"None"},{"content":"Juan F. De Paz, Sara Rodríguez, Javier Bajo, and Juan M. Corchado, 2009. Case-based reasoning as a decision support system for cancer diagnosis: A case study. . International Journal of Hybrid Intelligent Systems Data Mining and Hybrid Intelligent Systems 6, 2, 97--110","paperID":"None"},{"content":"Sanja Petrovic, 2012. Case-based Reasoning in Radiotherapy Planning. In Proceedings of the 4th International Symposium on Applied Sciences in Biomedical and Communication Technologies (ISABEL '11) ACM, Barcelona, Spain, 1--5. http://doi.acm.org/10.1145/2093698.2093797.","paperID":"None"},{"content":"Cynthia Putnam, Jinghui Cheng, and Greg Seymour, 2014. Therapist Perspectives: Active Video Games Use in In-patient Settings for People with Brain-Injuries. Games For Health Journal 3, 6, 366--370.","paperID":"None"},{"content":"Cynthia Putnam and Jinghui Cheng, 2014. Therapist-Centered Requirements: A Multi-Method Approach of Requirement Gathering to Support Rehabilitation Gaming. In Proceedings of the International Conference on Requirements Engineering, RE 2014 (Kariskrona, Sweden), IEEE, 13--22. http://dx.doi.org/10.1109/RE.2014.6912243","paperID":"None"},{"content":"Rebecca Redmond. Wii-Habilitation. Retrieved July 11, 2014, from http://www.wiihabilitation.co.uk","paperID":"None"},{"content":"Gustavo Saposnik and Mindy Levin, 2011. Virtual reality in stroke rehabilitation: a meta-analysis and implications for clinicians. Journal of Cerebral Circulation 42, 5, 1380--1386.","paperID":"None"},{"content":"Gustavo Saposnik, M. Mamdani, M. Bayley, K.E. Thorpe, J. Hall, L.G. Cohen, and R. Teasell, 2010. Effectiveness of Virtual Reality Exercises in STroke Rehabilitation (EVREST): Rationale, Design, and Protocol of a Pilot Randomized Clinical Trial Assessing the Wii Gaming System. International Journal of Stroke 5, 1, 47--51.","paperID":"None"},{"content":"Michael E. Selzer, Stephanie Clarke, Leonardo Cohen, Pamela Duncan, and Fred Gage, 2006. Textbook of Neural Repair and Rehabilitation. Cambridge University Press, NY, NY, USA.","paperID":"None"},{"content":"Jonathan M. Silver, Thomas W. Mcallister, and Stuart C. Yudofsky, 2011. Textbook of Traumatic Brain Injury. American Psychiatric Publishing, Inc, Arlington, VA, USA.","paperID":"None"},{"content":"J. Ridley Stroop, 1945. Studies of Interference in Serial Verbal Reactions. Journal of Experimental Psychology, 18, 643--662.","paperID":"None"},{"content":"Tactus Therapy. Retrieved June 20, 2015, from http://tactustherapy.com/app/language/","paperID":"None"},{"content":"Ian Watson, 1997. Applying Case-Based Reasoning: Techniques for Enterprise Systems. Morgan Kaufmann Publishers, San Francisco, CA, USA.","paperID":"None"},{"content":"G. Yavuzer, A. Senel, M.B. Atay, and H.J. Stam, 2008. \"Playstation eyetoy games\" improve upper extremityrelated motor functioning in subacute stroke: a randomized controlled clinical trial. European Journal of Physical and Rehabilitation Medicine 44, 3, 237244.","paperID":"None"},{"content":"Samantha Zickefoose, Karen Hux, Jessica Brown, and Katrina Wulf, 2013. Let the games begin: A preliminary study using Attention Process Training-3 and Lumosity brain games to remediate attention deficits following traumatic brain injury. Brain Injury 27, 6, 707--716. DOI= http://dx.doi.org/10.3109/02699052.2013.775484.","paperID":"None"}],"abstract":"Brain injury (BI) is recognized as a major health issue. It is common for therapists to include commercial-off-the-shelf (COTS) games in their therapies to help motivate patients who have had a BI engage in rehabilitation tasks. In this paper, we present a prototype 'Choose a Game' tool that focuses on helping therapists select appropriate games that match their therapeutic goals and patient attributes. The tool leveraged a knowledge-base that we created about COTS games use in BI therapy. We evaluated the prototype through user studies with 29 therapists at two rehabilitation hospitals. While further improvements are needed, the tool enabled therapists to use games from a wider range of selections and therapists were generally satisfied with the game recommendations and the tool's user experience. This project is also a demonstration of a novel research model for investigating domains where technologies are rapidly proliferating for users with wide-ranging attributes such as the domain of therapeutic gaming for BI rehabilitation.","title":"'Choose a Game': Creation and Evaluation of a Prototype Tool to Support Therapists in Brain Injury Rehabilitation","filename":"CHI16/p2038","authors":["Cynthia Putnam","Jinghui Cheng","Feng Lin","Sai Yalla","Stephanie Wu"],"conference":"CHI '16"}