{"paperId":2858340,"citation":[],"reference":[{"content":"Hugh Beyer and Karen Holtzblatt. 1997. Contextual DJeesign: Defining Customer-Centered Systems. Elsevier.","paperID":"None"},{"content":"Elaine Biddiss and Tom Chau. 2007. Upper-limb prosthetics: critical factors in device abandonment. American Journal of Physical Medicine & Rehabilitation 86, 12: 977--987.","paperID":"None"},{"content":"Adream Blair-Early and Frankie Flood. 2014. Using Interdisciplinary and Active Research to Encourage Higher Resolution Research and Prototyping in Design. Journal of Systemics, Cybernetics and Informatics 12: 23--27.","paperID":"None"},{"content":"Craig Brown and Amy Hurst. 2012. VizTouch. Sixth International Conference on Tangible, Embedded and Embodied Interaction, ACM, 131--138. http://doi.org/10.1145/2148131.2148160","paperID":"None"},{"content":"Erin Buehler, Stacy Branham, Abdullah Ali, Jeremy Chang, Megan Hofmann, Amy Hurst, Shaun Kane. 201 Sharing is Caring: Assistive Technology Designs on Thingiverse. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 525--534. http://doi.org/10.1145/2702123. 2702525","paperID":"None"},{"content":"Erin Buehler, Amy Hurst, and Megan Hofmann. 2014. Coming to Grips: 3D Printing for Accessibility. Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility, ACM, 291--292. http://doi.org/10.1145/2661334. 2661345","paperID":"None"},{"content":"Victoria Chao. 2014. The Boy With the Lego Hand. The Atlantic. Retrieved June 4, 2015 from http://www.theatlantic.com/technology/archive/2014/11/the-boy-with-the-lego-hand/382637/","paperID":"None"},{"content":"Xiang \"Anthony\" Chen, Stelian Coros, Jennifer Mankoff, and Scott E. Hudson. 2015. Encore: 3D Printed Augmentation of Everyday Objects with Printed-over, Affixed and Interlocked Attachments. ACM SIGGRAPH 2015 Posters, ACM, 3:1--3:1. http://doi.org/10.1145/2787626.2787650","paperID":"None"},{"content":"Mike Creuzer, Aleksander Jones, Ro Ortiz, and Laird Popkin. 2015. Hand-O-Matic. Retrieved from http://webapp.e-nable.me/","paperID":"None"},{"content":"Melissa Dawe. 2006. Desperately Seeking Simplicity: How Young Adults with Cognitive Disabilities and Their Families Adopt Assistive Technologies. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1143--1152. http://doi.org/1145/1124772.1124943","paperID":"None"},{"content":"1Timothy R Dillingham, Liliana E Pezzin, and Ellen J MacKenzie. 2002. Limb amputation and limb deficiency: epidemiology and recent trends in the USA. Southern medical journal 95, 8: 875--883.","paperID":"None"},{"content":"Colin E. Dombroski, Megan ER Balsdon, and Adam Froats. 2014. The use of a low cost 3D scanning and printing tool in the manufacture of custom-made foot orthoses: a preliminary study. BMC Research Notes 7, 1: 443. http://doi.org/10.1186/1756-0500--7--443","paperID":"None"},{"content":"Jodi Forlizzi, Carl DiSalvo, and Francine Gemperle. 2004. Assistive robotics and an ecology of elders living independently in their homes. Human-Computer Interaction 19, 1: 25--59.","paperID":"None"},{"content":"Nicholas Herbert, David Simpson, William D. Spence, and William Ion. 2005. A preliminary investigation into the development of 3-D printing of prosthetic sockets. Journal of Rehabilitation Research and Development 42, 2: 141--6.","paperID":"None"},{"content":"Jonathan Hook, Sanne Verbaan, Peter Wright, and Patrick Olivier. 2013. Exploring the Design of technologies and services that support do-it-yourself assistive technology practice. Proceedings of DE 2013.","paperID":"None"},{"content":"Amy Hurst and Shaun Kane. 2013. Making \"Making\" Accessible. Proceedings of the 12th International Conference on Interaction Design and Children, ACM, 635--638. http://doi.org/10.1145/2485760.2485883","paperID":"None"},{"content":"Amy Hurst and Jasmine Tobias. 2011. Empowering Individuals with Do-it-yourself Assistive Technology. The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility, ACM, 11--18. http://doi.org/10.1145/ 2049536.2049541","paperID":"None"},{"content":"Vijay Kumar, Ruzena Bajcsy, and William Harwin. 1996. Design of customized rehabilitation aids. In Robotics Research. Springer, 122--133.","paperID":"None"},{"content":"Vijay Kumar, Ruzena Bajcsy, William Harwin, and Patrick Harker. 1996. Rapid Design and Prototyping of Customized Rehabilitation Aids. Commun. ACM 39, 2: 55--61. http://doi.org/10.1145/230798.230804","paperID":"None"},{"content":"Stacey Kuznetsov and Eric Paulos. 2010. Rise of the Expert Amateur: DIY Projects, Communities, and Cultures. Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, ACM, 295--304. http://doi.org/10.1145/1868914. 1868950","paperID":"None"},{"content":"2Constantinos Mavroidis, Richard G Ranky, Mark L Sivak, Benjamin L Patritti, Joseph DiPisa, Alyssa Caddle, Kara Gilhooly, Lauren Govoni, Seth Sivak, Michael Lancia, Robert Drillio, Paolo Bonato. 2011. Patient specific ankle-foot orthoses using rapid prototyping. Journal of neuroengineering and rehabilitation 8, 1: 1.","paperID":"None"},{"content":"2Lynne V McFarland, Sandra L Hubbard Winkler, Allen W Heinemann, Melissa Jones, Alberto Esquenazi, and others. 2010. Unilateral upper-limb loss: satisfaction and prosthetic-device use in veterans and service members from Vietnam and OIF/OEF conflicts. J Rehabil Res Dev 47, 4: 299--316.","paperID":"None"},{"content":"David A. Mellis and Leah Buechley. 2012. Case Studies in the Personal Fabrication of Electronic Products. Proceedings of the Designing Interactive Systems Conference, ACM, 268--277. http://doi.org/10.1145/ 2317956.2317998","paperID":"None"},{"content":"Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, and Patrick Baudisch. 2014. faBrickation: Fast 3D Printing of Functional Objects by Integrating Construction Kit Building Blocks. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3827--3834. http://doi.org/10.1145/2556288.2557005","paperID":"None"},{"content":"Liliana E. Pezzin, Timothy R. Dillingham, Ellen J. MacKenzie, Patti Ephraim, and Paddy Rossbach. 2004. Use and satisfaction with prosthetic limb devices and related services. Archives of Physical Medicine and Rehabilitation 85, 5: 723--729.","paperID":"None"},{"content":"Betsy Phillips and Hongxin Zhao. 1993. Predictors of assistive technology abandonment. Assistive Technology 5, 1: 36--45.","paperID":"None"},{"content":"Katherine A Raichle, Marisol A Hanley, Ivan Molton, Nancy J. Kadel, Kellye Campbell, Emily Phelps, Dawn Ehde, Douglas G. Smith. 2008. Prosthesis use in persons with lower-and upper-limb amputation. Journal of rehabilitation research and development 45, 7: 961.","paperID":"None"},{"content":"F. Rengier, A. Mehndiratta, H. von Tengg-Kobligk, C. M. Zechmann, R. Unterhinninghofen, H.-U. Kauczor, F. L. Giesel. 2010. 3D printing based on imaging data: review of medical applications. International Journal of Computer Assisted Radiology and Surgery 5, 4: 335--341. http://doi.org/10.1007/s11548-010-0476-x","paperID":"None"},{"content":"Linda Resnik, Marissa R Meucci, Shana Lieberman-Klinger, Christopher Fantini, Debra L. Kelty, Roxanne Disla, Nicole Sasson. 2012. Advanced upper limb prosthetic devices: implications for upper limb prosthetic rehabilitation. Archives of physical medicine and rehabilitation 93, 4: 710--717.","paperID":"None"},{"content":"Douglas G Smith and Ernest M Burgess. 2001. The use of CAD/CAM technology in prosthetics and orthotics-current clinical models and a view to the future. Journal of rehabilitation research and development 38, 3: 327--334.","paperID":"None"},{"content":"3Cristen Torrey, David W McDonald, Bill N Schilit, and Sara Bly. 2007. How-To pages: Informal systems of expertise sharing. In ECSCW 2007. Springer, 391--410.","paperID":"None"},{"content":"3Oliver Wainwright. The Lego prosthetic arm that children can create and hack themselves. the Guardian. Retrieved July 27, 2015 from http://www.theguardian.com/artanddesign/architecture-design-blog/2015/jul/22/lego-prosthetic-arm-that-kids-can-hack-themselves","paperID":"None"},{"content":"3Kathryn E Waldera, Craig W Heckathorne, Margaret Parker, and Stefania Fatone. 2013. Assessing the prosthetic needs of farmers and ranchers with amputations. Disability and Rehabilitation: Assistive Technology 8, 3: 204--212.","paperID":"None"},{"content":"Robert K Yin. 2013. Case study research: Design and methods. Sage publications.","paperID":"None"},{"content":"2014. Taking Measurements in Tracker Cyborg Beast. CyborgBeast. Retrieved September 13, 2015 from http://www.cyborgbeast.org/taking-measurements-tracker/","paperID":"None"},{"content":"Enabling The Future | A Global Network Of Passionate Volunteers Using 3D Printing To Give The World A \"Helping Hand.\" Retrieved September 9, 2015 from http://enablingthefuture.org/","paperID":"None"},{"content":"3MIT lab's FitSocket measures human limb tissue to 3D print better-fitting prosthetics. 3ders.org. Retrieved September 20, 2015 from http://www.3ders.org/articles/20150909-mit-labs-fitsocket-measures-human-limb-tissue-to-3d-print-better-fitting-prosthetics.html","paperID":"None"},{"content":"3State-of-the-Art Prosthetics Are Incredible, but Not Always Useful. NOVA Next. Retrieved September 3, 2015 from http://www.pbs.org/wgbh/nova/next/tech/ durable-prostheses/","paperID":"None"},{"content":"3ABOUT US. Enabling The Future. Retrieved December 28, 2015 from http://enablingthefuture.org/ about/","paperID":"None"},{"content":"Printhese, Roel Deden's reimagined 3D printed arm prosthesis wins Dutch James Dyson Award. 3ders.org. Retrieved September 11, 2015 from http://www.3ders.org/articles/20150909-roel-dedens-reimagined-3d-printed-arm-prosthesis-wins-dutch-james-dyson-award.html","paperID":"None"}],"abstract":"This paper presents a case study of three participants with upper-limb amputations working with researchers to design prosthetic devices for specific tasks: playing the cello, operating a hand-cycle, and using a table knife. Our goal was to identify requirements for a design process that can engage the assistive technology user in rapidly prototyping assistive devices that fill needs not easily met by traditional assistive technology. Our study made use of 3D printing and other playful and practical prototyping materials. We discuss materials that support on-the-spot design and iteration, dimensions along which in-person iteration is most important (such as length and angle) and the value of a supportive social network for users who prototype their own assistive technology. From these findings we argue for the importance of extensions in supporting modularity, community engagement, and relatable prototyping materials in the iterative design of prosthetics.","title":"Helping Hands: Requirements for a Prototyping Methodology for Upper-limb Prosthetics Users","filename":"CHI16/p1769","authors":["Megan Hofmann","Jeffrey Harris","Scott E. Hudson","Jennifer Mankoff"],"conference":"CHI '16"}