{"paperId":2858461,"citation":[],"abstract":"Serious games and gamified simulations are increasingly being used to aid instruction in technical disciplines including the medical field. Assessments of player performance are important in understanding user profiles in order to establish serious games as a reliable, consistent method for increasing skills and competence in all trainees. In this study we used questionnaires, game characteristic metrics and EEG analysis to explore players' performance in a bronchoscopy simulator. We found that players who performed better were younger, made fewer errors, were quicker and differed in spectral profile during game play. Our findings, while speculative, have implications for training regimes in which gamified simulations are employed. We make suggestions for game design and for tailoring training regimes to suit individual learning styles to enhance knowledge acquisition and retention.","reference":[{"content":"Australian Medical Workforce Advisory Committee 2001. The Cardiothoracic Surgery Workforce in Australia. Sydney.","paperID":"None"},{"content":"Francesco Bellotti, Bill Kapralos, Kiju Lee, Pablo Moreno-Ger, and Riccardo Berta. 2013. Assessment in and of Serious Games: An Overview. Advances in Human-Computer Interaction. Article ID 136864.","paperID":"None"},{"content":"Selim R. Benbadis, Diego A. Rielo, EEG Artifacts. Retrieved 11th August from: emedicine.medscape.com/article/1140247-overview.","paperID":"None"},{"content":"Richard Blunt. 2009. Do serious games work? Results from three studies, eLearn Magazine, no. 12.","paperID":"None"},{"content":"Jeanne H. Brockmyer, Christine M. Fox, Kathleen A. Curtiss, Evan McBroom, Kimberly M. Burkhart, and Jacquelyn N. Pidruzny. 2009. The development of the Game Engagement Questionnaire: a measure of engagement in video game-playing. Journal of Experimental Social Psychology, 45, 4: 624--634.","paperID":"None"},{"content":"Margaret Crossley, Merrill Hiscock. 1992. Agerelated differences in concurrent-task performance of normal adults: Evidence for a decline in processing resources. Psychology and Aging, Vol 7, 4: 499--506.","paperID":"None"},{"content":"Lotfi Derbali and Claude Frasson. 2010. Player's motivation and EEG Waves Patterns in a Serious Game Environment. In Intelligent Tutoring Systems Part II, Lecture Notes in Computer Science, 6095: 297--299.","paperID":"None"},{"content":"Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: defining \"gamification\". In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (MindTrek '11). ACM, NY, NY, USA.","paperID":"None"},{"content":"Cedric Dumas and Tim Coles. 2013. Bronchoscopy Training. Australian eHealth Research Centre Colloquium, 27 March, Brisbane.","paperID":"None"},{"content":"Leonardo Fogassi, Giuseppe Luppino. (2005).Motor functions of the parietal lobe. Current Opinion in Neurobiology, 15:626--631.","paperID":"None"},{"content":"Fong-Ling Fu, Rong-Chang Su, and Sheng-Chin Yu. 2009. EGameFlow: a scale to measure learners' enjoyment of e-learning games. Computers and Education, 52, 1: 101--112.","paperID":"None"},{"content":"Lluis Fuentemilla, Gareth Barnes, Emrah Düzel, Brian Levine. 2014. Theta oscillations orchestrate medial temporal lobe and neocortex in remembering autobiographical memories, NeuroImage, 85, 2: 730--737.","paperID":"None"},{"content":"Alan Gevins, Mary E. Smith, Linda K. McEvoy, and Daphne Yu. 1997. High-resolution EEG mapping of cortical activation related to working memory: effects of task difficulty, type of processing, and practice. Cereb Cortex, 7: 374--85.","paperID":"None"},{"content":"Maurits Graafland, Jan M. Schraagen and Marlies P. Schijven. 2012. Systematic review of serious games for medical education and surgical skills training. British Journal of Surgery; 99: 1322--1330.","paperID":"None"},{"content":"Eric J. He, Han Yuan, Lijing Yang, Cameron P. Sheikholeslami, Bin He. 2008. EEG spatio-spectral mapping during video game play. In Information Technology and Applications in Biomedicine, 346348.","paperID":"None"},{"content":"Health Workforce 2025 - Medical Specialties, Volume 3, November 2012, Health Workforce Australia.","paperID":"None"},{"content":"Shigeto Ikeda, 1974. Atlas of flexible Bronchofiberoscopy. Igaku Shoin.","paperID":"None"},{"content":"Eric Kandel, James Schwartz, Thomas Jessell. 2000. Principles of Neural Science. McGraw-Hill.","paperID":"None"},{"content":"Daniel Katz, Samuel DeMaria, Prabal Khanal, Kanav Kahol. 2014. Serious Gaming to Improve the Safety of Central Venous Catheter Placement. International Journal of Gaming and Computer-Mediated Simulations, 6: 4.","paperID":"None"},{"content":"Catherine Lebel and Christian Beaulieu. 2011. Longitudinal development of human brain wiring continues from childhood into adulthood. The Journal of Neuroscience, 31, 30: 10937--10947.","paperID":"None"},{"content":"Kung-Yee Liang, Scott L. Zeger. 1986. Longitudinal data analysis using generalized linear models. Biometrika.13--22.","paperID":"None"},{"content":"Timothy McMahan, Ian Parberry, Thomas D. Parsons. 2015. Modality specific assessment of video game player's experience using the Emotiv. Entertainment Computing, 7: 1--6. ISSN 1875--9521, http://dx.doi.org/10.1016/j.entcom.2015.03.001.","paperID":"None"},{"content":"David Michael and Sande Chen. 2005. Proof of learning: assessment in serious games. http://www.gamasutra.com/view/feature/2433/proof _of_learning_assessment_in_.php.","paperID":"None"},{"content":"Emiliana Pellouchoud, Michael E. Smith, Linda McEvoy, and Alan Gevins. 1999. Mental effortrelated EEG modulation during video-game play: comparison between juvenile subjects with epilepsy and normal control subjects. Epilepsia, 40, 4: 3843.","paperID":"None"},{"content":"Marc Prensky. 2001. Digital natives, digital immigrants. On the Horizon. NCB University Press, 9, 5.","paperID":"None"},{"content":"Michael D. Rugg, 1995. Event-related potential studies of human memory. In The Cognitive Neurosciences (Gazzaniga, M.S., ed.), 789--801, MIT Press.","paperID":"None"},{"content":"Daniel Senkowski, Sophie Molholm, Manuel Gomez-Ramirez and John J. Foxe. 2006. Oscillatory Beta Activity Predicts Response Speed during a Multisensory Audiovisual Reaction Time Task: A High-Density Electrical Mapping Study. Cerebral Cortex 16:1556--1565.","paperID":"None"},{"content":"Charles Shagass 1972. Electrical activity of the brain. In: Greenfield NS, Sternbach RA, editors. Handbook of Psychophysiology. NY: Rinehart & Winston, 263--328.","paperID":"None"},{"content":"Aidan Sliney, David Murphy. 2008. JDoc: A Serious Game for Medical Learning, in Advances in Computer-Human Interaction, 2008 First International Conference on, 131--136.","paperID":"None"},{"content":"Edward E. Smith and John Jonides, 1997. Working memory: A view from neuroimaging. Cognitive Psychology, 33: 5--42.","paperID":"None"},{"content":"Michael Smith, Alan Gevins, Halle Brown, Arati Karnik, Robert Du. (2001) Monitoring Task Loading with Multivariate EEG Measures during Complex Forms of Human-Computer Interaction. Human Factors: The Journal of the Human Factors and Ergonomics Society. Fall vol. 43, 3:366--380.","paperID":"None"},{"content":"Joseph Thompson, Mark Blair, Andrew Henrey. 2014. Over the Hill at 24: Persistent Age-Related Cognitive-Motor Decline in Reaction Times in an Ecologically Valid Video Game Task Begins in Early Adulthood. PLoS ONE 9, 4: e94215.","paperID":"None"},{"content":"Anthony D. Wagner, Benjamin J. Shannon, Itamar Kahn, and Randy L. Buckner. 2005. Parietal lobe contributions to episodic memory retrieval. Trends in Cognitive Sciences 9: 9.","paperID":"None"},{"content":"Voravika Wattanasoontorn, Ruben García, Imma Boada, Mateu Sbert. 2013. Serious games for health. Entertainment Computing 12, 4, 4:231--247.","paperID":"None"}],"title":"Gamer Style: Performance Factors in Gamified Simulation","filename":"CHI16/p2014","authors":["Surabhi Gupta","Tim Coles","Cedric Dumas","Simon J. McBride","DanaKai Bradford"],"conference":"CHI '16"}