{"paperId":2858507,"citation":[],"abstract":"Three-dimensional models are important learning resources for blind people. With advances in 3D printing, 3D models are becoming more available. However, unlike visual or tactile graphics, there is no standard accessible way to label components in 3D models. We present a labeling toolkit that enables users to add and access audio labels to 3D printed models. The toolkit includes Tickers, small 3D printed percussion instruments added to 3D models, and Talker, a signal processing application that detects and classifies Ticker sounds. To use the toolkit, a model designer adds Tickers to a model using 3D modeling software. A user then prints the model with Tickers and records audio labels for each Ticker. Finally, users can strum the Tickers and Talker will play the corresponding labels. We evaluated Tickers and Talker with three models in a study with nine blind participants. Our toolkit achieved an accuracy of 93% across all participants and models. We discuss design implications and future work for accessible 3D printed models.","reference":[{"content":"American Printing House. Product: DNA Twist. Retrieved September 25, 2015 from https://shop.aph.org/webapp/wcs/stores/servlet/Product _DNA Twist_1-08978-00P_10001_11051","paperID":"None"},{"content":"American Printing House. Product: Globe: Tactile and Visual. Retrieved September 25, 2015 from https://shop.aph.org/webapp/wcs/stores/servlet/Product _Globe: Tactile and Visual_1-0155100P_10001_11051","paperID":"None"},{"content":"Catherine M. Baker, Lauren R. Milne, Jeffrey Scofield, Cynthia L. Bennett, and Richard E. Ladner. 2014. Tactile graphics with a voice: Using QR codes to access text in tactile graphics. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14), 75--82. http://doi.acm.org/10.1145/2661334.2661366","paperID":"None"},{"content":"Richard E. Berg. 1995. The Physics of Sound. Prentice Hall.","paperID":"None"},{"content":"Craig Brown and Amy Hurst. 2012. VizTouch: automatically generated tactile visualizations of coordinate spaces. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), 131--138. http://doi.acm.org/10.1145/2148131.2148160","paperID":"None"},{"content":"Erin Buehler, Stacy Branham, Abdullah Ali, Jeremy J. Chang, Megan Kelly Hofmann, Amy Hurst, and Shaun K. Kane. 2015. Sharing is Caring: Assistive Technology Designs on Thingiverse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 525--534. http://doi.acm.org/10.1145/2702123.2702525","paperID":"None"},{"content":"Erin Buehler, Amy Hurst, and Megan Hofmann. 2014. Coming to grips: 3D printing for accessibility. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14), 291--292. http://doi.acm.org/10.1145/2661334.2661345","paperID":"None"},{"content":"Erin Buehler, Shaun K. Kane, and Amy Hurst. 2014. ABC and 3D: opportunities and obstacles to 3D printing in special education environments. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14), 107--114. http://doi.acm.org/10.1145/2661334.2661365","paperID":"None"},{"content":"Alain Dufaux. 2001. Detection and Recognition of Impulsive Sound Signals. Ph.D. Dissertation. Institute de Microtechnique Neuchatel, Switzerland.","paperID":"None"},{"content":"Chris Harrison, Desney Tan, and Dan Morris. 2010. Skinput: appropriating the body as an input surface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 453--462. http://doi.acm.org/10.1145/1753326.1753394","paperID":"None"},{"content":"Jonathan Hook, Thomas Nappey, Steve Hodges, Peter Wright, and Patrick Olivier. 2014. Making 3D printed objects interactive using wireless accelerometers. In Proceedings of the Extended Abstracts of the SIGCHI Conference on Human Factors in Computing Systems (CHI EA '14), 1435--1440. http://doi.acm.org/10.1145/2559206.2581137","paperID":"None"},{"content":"Amy Hurst and Jasmine Tobias. 2011. Empowering Individuals with Do-It-Yourself Assistive Technology. In Proceedings of the 13th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '11), 11--18. http://doi.acm.org/10.1145/2049536.2049541","paperID":"None"},{"content":"Independent Living Aids, LLC. PenFriend Extra Labels. Retrieved September 25, 2015 from http://www.independentliving.com/prodinfo.asp?numb er=7","paperID":"None"},{"content":"Yoshio Ishiguro and Ivan Poupyrev. 2014. 3D printed interactive speakers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1733--1742. http://doi.acm.org/10.1145/2556288.2557046","paperID":"None"},{"content":"Shaun K. Kane and Jeffrey P. Bigham. 2014. Tracking @stemxcomet: teaching programming to blind students via 3D printing, crisis management, and twitter. In Proceedings of the 45th ACM Technical Symposium on Computer Science Education (SIGCSE '14), 247--252. http://doi.acm.org/10.1145/2538862.2538975","paperID":"None"},{"content":"Michael A. Kolitsky. Making Tactile 3D Prints Talk. Retrieved September 25, 2015 from http://www.instructables.com/id/Making-Tactile-3DPrints-Talk/?ALLSTEPS","paperID":"None"},{"content":"Michael A. Kolitsky. 2014. 3D Printed Tactile Learning Objects: Proof of Concept. Retrieved December 22, 2015 from https://nfb.org/images/nfb/publications/jbir/jbir14/jbir0 40102.html","paperID":"None"},{"content":"Michael A. Kolitsky. 3D printing makes Visible Human cadaver sections accessible for blind students. Retrieved September 25, 2015 from http://www.nextgenemedia.com/NLM3Dprints/NLM3Dprints.html","paperID":"None"},{"content":"Richard E. Ladner, Melody Y. Ivory, Rajesh Rao, Sheryl Burgstahler, Dan Comden, Sangyun Hahn, Matthew Renzelmann, Satria Krisnandi, Mahalakshmi Ramasamy, Beverly Slabosky, Andrew Martin, Amelia Lacenski, Stuart Olsen, Dmitri Groce. 2005. Automating tactile graphics translation. In Proceedings of the 7th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '05), 150157. http://doi.acm.org/10.1145/1090785.1090814","paperID":"None"},{"content":"Gierad Laput, Eric Brockmeyer, Scott E. Hudson, and Chris Harrison. 2015. Acoustruments: Passive, Acoustically-Driven, Interactive Controls for Handheld Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 2161--2170. http://doi.acm.org/10.1145/2702123.2702414","paperID":"None"},{"content":"Samantha McDonald, Joshua Dutterer, Ali Abdolrahmani, Shaun K. Kane, and Amy Hurst. 2014. Tactile aids for visually impaired graphical design education. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14), 275--276. http://doi.acm.org/10.1145/2661334.2661392","paperID":"None"},{"content":"National Federation of the Blind Jernigan Institute. 2009. The Braille Literacy Crisis in America. National Federation of the Blind.","paperID":"None"},{"content":"Huaishu Peng, Jen Mankoff, Scott E Hudson, and James Mccann. 2015. A Layered Fabric 3D Printer for Soft Interactive Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1789--1798. http://doi.acm.org/10.1145/2702123.2702327","paperID":"None"},{"content":"Juan G. Roederer. 2008. The Physics and Psychophysics of Music: An Introduction. Springer Science & Business Media.","paperID":"None"},{"content":"Thomas D. Rossing. 2000. Science of Percussion Instruments. World Scientific.","paperID":"None"},{"content":"Audrey C. Rule, Greg P. Stefanich, Robert M. Boody, and Belinda Peiffer. 2011. Impact of Adaptive Materials on Teachers and their Students with Visual Impairments in Secondary Science and Mathematics Classes. International Journal of Science Education 33, 6: 865--887. http://doi.org/10.1080/09500693.2010.506619","paperID":"None"},{"content":"Munehiko Sato, Ivan Poupyrev, and Chris Harrison. 2012. Touché: enhancing touch interaction on humans, screens, liquids, and everyday objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 483--492. http://doi.acm.org/10.1145/2207676.2207743","paperID":"None"},{"content":"Valkyrie Savage, Colin Chang, and B Hartmann. 2013. Sauron: embedded single-camera sensing of printed physical user interfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13), 447--456. http://doi.acm.org/10.1145/2501988.2501992","paperID":"None"},{"content":"Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice, and Björn Hartmann. 2014. A series of tubes: adding interactivity to 3D prints using internal pipes. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14), 447--456. http://doi.acm.org/10.1145/2642918.2647374","paperID":"None"},{"content":"Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: fabricating custom capacitive touch sensors to prototype interactive objects. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12), 579--588. http://doi.acm.org/10.1145/2380116.2380189","paperID":"None"},{"content":"Huiying Shen, Owen Edwards, Joshua Miele, and James M. Coughlan. 2013. CamIO: a 3D computer vision system enabling audio/haptic interaction with physical objects by blind users. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13), 41. http://doi.acm.org/10.1145/2513383.2513423","paperID":"None"},{"content":"Lei Shi. 2015. Talkabel: A Labeling Method for 3D Printed Models. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15), 361-362. http://doi.acm.org/10.1145/2700648.2811327","paperID":"None"},{"content":"George Tzanetakis and Perry Cook. 2002. Musical genre classification of audio signals. IEEE Transactions on Speech and Audio Processing 10, 5: 293-302. http://dx.doi.org/10.1109/TSA.2002.800560","paperID":"None"},{"content":"Marynel Vázquez, Eric Brockmeyer, Ruta Desai, Chris Harrison, and Scott E. Hudson. 2015. 3D Printing Pneumatic Device Controls with Variable Activation Force Capabilities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1295--1304. http://doi.acm.org/10.1145/2702123.2702569","paperID":"None"},{"content":"Junjue Wang, Kaichen Zhao, Xinyu Zhang, and Chunyi Peng. 2014. Ubiquitous keyboard for small mobile devices. In Proceedings of the 12th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '14), 14--27. http://doi.acm.org/10.1145/2594368.2594384","paperID":"None"},{"content":"Karl Willis, Eric Brockmeyer, Scott Hudson, and Ivan Poupyrev. 2012. Printed optics: 3D printing of embedded optical elements for interactive devices. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12), 589--598. http://doi.acm.org/10.1145/2380116.2380190","paperID":"None"}],"title":"Tickers and Talker: An Accessible Labeling Toolkit for 3D Printed Models","filename":"CHI16/p4896","authors":["Lei Shi","Idan Zelzer","Catherine Feng","Shiri Azenkot"],"conference":"CHI '16"}