{"paperId":2858231,"citation":[],"abstract":"The concept of gamification is receiving increasing attention, particularly for its potential to motivate students. However, to date the majority of studies in the context of education have predominantly focused on University students. This paper explores how gamification could potentially benefit a specific student population, children with dyslexia who are transitioning from primary to secondary school. Two teachers from specialist dyslexia teaching centres used classDojo, a gamification platform, during their teaching sessions for one term. We detail how the teachers appropriated the platform in different ways and how the students discussed classDojo in terms of motivation. These findings have subsequently informed a set of provisional implications for gamification distilling opportunities for future pedagogical uses, gamification design for special education and methodological approaches to how gamification is studied.","reference":[{"content":"Antin, J., & Churchill, E. F., 2011. Badges in social media: A social psychological perspective. In CHI 2011 Gamification Workshop Proceedings (Vancouver, BC, Canada, 2011).","paperID":"None"},{"content":"Barata, G., Gama, S., Jorge, J., & Gonçalves, D., 2013. Improving Participation and Learning with Gamification. In Proceedings of Gamification '13, October 2--4, 2013, Stratford, ON, Canada.","paperID":"None"},{"content":"Benton, L., Vasalou, A., Khaled, R., Johnson, H., and Gooch, D., 2014. Diversity for design: a framework for involving neurodiverse children in the technology design process. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems, pp. 3747--3756. ACM.","paperID":"None"},{"content":"Boticki, I., Baksa, J., Seow, P. and Looi, C. K., 2015. Usage of a mobile social learning platform with virtual badges in a primary school. Computers & Education, 86, pp. 120--136.","paperID":"None"},{"content":"Braun, V., & Clarke, V. (2006). Using thematic analysis in psychology. Qualitative research in psychology, 3(2), 77--101.","paperID":"None"},{"content":"Brewer, R., Anthony, L., Brown, Q., Irwin, G., Nias, J., & Tate, B., 2013. Using gamification to motivate children to complete empirical studies in lab environments. In Proc. of the 12th International Conference on Interaction Design and Children, pp. 388--391. ACM.","paperID":"None"},{"content":"Carroll, J. M., and Iles, J. E., 2006. An assessment of anxiety levels in dyslexic students in higher education. British journal of educational psychology, 76(3), pp. 651--662","paperID":"None"},{"content":"Cuban, L., Kirkpatrick, H., & Peck, C., 2001. High access and low use of technologies in high school classrooms: Explaining an apparent paradox. American Educational Research Journal, 38(4), pp. 813--834.","paperID":"None"},{"content":"de Freitas, A. A., & de Freitas, M. M., 2013. Classroom Live: a software-assisted gamification tool. Computer Science Education, 23(2), 186--206.","paperID":"None"},{"content":"Deci, E. L. (1971). Effects of externally mediated rewards on intrinsic motivation. Journal of Personality and Social Psychology, 18, 105--115.","paperID":"None"},{"content":"Deci, E. L., Koestner, R., & Ryan, R. M., 2001. Extrinsic rewards and intrinsic motivation in education: Reconsidered once again. Review of Educational Research, 71(1), 1--27.","paperID":"None"},{"content":"Decker, A. and Lawley, E. L., 2013. Life's a game and the game of life: how making a game out of it can change student behavior. In Proceeding of the 44th ACM technical symposium on Computer science education, ACM Press, pp. 233--238.","paperID":"None"},{"content":"Demonet, J., Taylor, M. and Chaix, Y., 2004. Developmental dyslexia. Lancet, 363, pp. 1451--1460.","paperID":"None"},{"content":"Denny, P., 2013. The effect of virtual achievements on student engagement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, pp. 763--772.","paperID":"None"},{"content":"Deterding, S., Dixon, D., Khaled, R., & Nacke, L., 2011. From game design elements to gamefulness: defining gamification. In Proceedings of the 15th International Academic MindTrek Conference, pp. 915. ACM.","paperID":"None"},{"content":"Dodero, G., Gennari, R., Melonio, A., & Torello, S., 2014. Towards tangible gamified co-design at school: two studies in primary schools. In Proceedings of the first ACM SIGCHI annual symposium on Computerhuman interaction in play, pp. 77--86. ACM.","paperID":"None"},{"content":"Domínguez, A., Saenz-de-Navarrete, J., De-Marcos, L., Fernández-Sanz, L., Pagés, C., & Martínez-Herráiz, J. J., 2013. Gamifying learning experiences: Practical implications and outcomes. Computers & Education, 63, 380--392.","paperID":"None"},{"content":"Ern, A., 2014. The use of gamification and serious games within interventions for children with autism spectrum disorder. University of Twente.","paperID":"None"},{"content":"Filsecker, M. and Hickey, D. T., 2014. A multilevel analysis of the effects of external rewards on elementary students' motivation, engagement and learning in an educational game. Computers & Education, 75, pp. 136--148.","paperID":"None"},{"content":"Flyvbjerg, B., 2006. Five misunderstandings about case-study research. Qualitative inquiry, 12(2), 219245.","paperID":"None"},{"content":"Geertz, C., 1994. Thick description: Toward an interpretive theory of culture. Readings in the philosophy of social science, pp. 213--231.","paperID":"None"},{"content":"Gooch, D., Benton, L., Khaled, R., Luke, D., & Vasalou, A., 2015. Creating Bridges: The Role of Exploratory Design Research in an Intelligent Tutoring System Project. Interacting with Computers, iwv009.","paperID":"None"},{"content":"Hakulinen, L., Auvinen, T. and Korhonen, A., 2013. Empirical Study on the Effect of Achievement Badges in TRAKLA2 Online Learning Environment, In Proceedings of Learning and Teaching in Computing and Engineering (LaTiCE) conference, March 21--24, 2013, Macau, pp. 47--54.","paperID":"None"},{"content":"Hamari, J. and Koivisto, J., 2013. Social motivations to use gamification: an empirical study of gamifying exercise, In Proceedings of the European Conference on Information Systems, Utrecht, Netherlands.","paperID":"None"},{"content":"Hamari, J., Koivisto, J. and Sarsa, H., 2014. Does Gamification Work? -- A Literature Review of Empirical Studies on Gamification. In proceedings of the 47th Hawaii International Conference on System Sciences, Hawaii, USA.","paperID":"None"},{"content":"Hanus, M. D. and Fox, J., 2015. Assessing the effects of gamification in the classroom: A longitudinal study on intrinsic motivation, social comparison, satisfaction, effort, and academic performance. Computers & Education, 80, pp. 152--161.","paperID":"None"},{"content":"Hecker, C. 2010. Achievements Considered Harmful? Game Developers Conference 2010.","paperID":"None"},{"content":"Hidi, S., & Harackiewicz, J. M., 2000. Motivating the academically unmotivated: A critical issue for the 21st century. Review of educational research, 70(2), pp. 151--179.","paperID":"None"},{"content":"Hmelo-Silver, C. E., 2004. Problem-based learning: What and how do students learn?. Educational psychology review, 16(3), pp. 235--266.","paperID":"None"},{"content":"Landers, R. N., and Landers, A. K., 2015. An Empirical Test of the Theory of Gamified Learning The Effect of Leaderboards on Time-on-Task and Academic Performance. Simulation & Gaming, 45(6), pp. 769--785.","paperID":"None"},{"content":"Livingstone, S. (2012). Critical reflections on the benefits of ICT in education. Oxford Review of Education, 38(1), 9--24.","paperID":"None"},{"content":"Maehr, M. L., & Meyer, H. A., 1997. Understanding motivation and schooling: Where we've been, where we are, and where we need to go. Educational Psychology Review, 9(4), 371--409.","paperID":"None"},{"content":"Mekler, E. D., Brühlmann, F., Opwis, K., & Tuch, A. N., 2013. Disassembling gamification: the effects of points and meaning on user motivation and performance. In CHI'13 Extended Abstracts on Human Factors in Computing Systems (pp. 1137--1142). ACM.","paperID":"None"},{"content":"Mekler, E. D., Brühlmann, F., Opwis, K., & Tuch, A. N., 2013. Do points, levels and leaderboards harm intrinsic motivation?: an empirical analysis of common gamification elements. In Proceedings of the First International Conference on Gameful Design, Research, and Applications (pp. 66--73). ACM.","paperID":"None"},{"content":"Nicholson, S., 2012. A user-centered theoretical framework for meaningful gamification. Proceedings GLS, 8.","paperID":"None"},{"content":"Ormrod, J.E., 2006. Educational Psychology: Developing Learners, fifth edition. Pearson/Merrill Prentice Hall.","paperID":"None"},{"content":"Pintrich, P. R., Marx, R. W., & Boyle, R. A., 1993. Beyond cold conceptual change: The role of motivational beliefs and classroom contextual factors in the process of conceptual change. Review of Educational research, 63(2), 167--199.","paperID":"None"},{"content":"Rose, J., 2009. Identifying and Teaching Children and Young People with Dyslexia and Literacy Difficulties. Report for the Department of Children, Schools and Families.","paperID":"None"},{"content":"Rosen, M., 1991. Coming to Terms with the Field: Understanding and Doing Organizational Ethnography. Journal of Management Studies, 28(1), pp. 1--24.","paperID":"None"},{"content":"Ross, M. (2010). Case study: Math teacher uses gamification to help at-risk students succeed. Retrieved from http://www.teachthought.com/trends/a-casestudy-in-gamification/","paperID":"None"},{"content":"Ryan, R. M., & Deci, E. L., 2000. Intrinsic and extrinsic motivations: Classic definitions and new directions. Contemporary educational psychology, 25(1), 54--67.","paperID":"None"},{"content":"Sætre, A. B., 2013. Mathematics on the tablet: Using mobile technology and gamification to support student learning in junior high. MSc Thesis, Universitas Osloensis, 2013.","paperID":"None"},{"content":"Schiefele, U., Krapp, A. and Winteler, A., Interest as a predictor of academic achievement: A meta-analysis of research. In Renninger, K., Hidi, S. and Krapp, A. (Eds), 1992. The role of interest in learning and development. Hillsdale, NJ: Lawrence Erlbaum Associates.","paperID":"None"},{"content":"Schramm, W., 1971. Notes on Case Studies of Instructional Media Projects. US Department of Health, Education and Welfare: National Institute of Education","paperID":"None"},{"content":"Seaborn, K., & Fels, D. I., 2015. Gamification in theory and action: A survey. International Journal of Human-Computer Studies, 74, pp. 14--31.","paperID":"None"},{"content":"Snowling, M.J., Adams, J.W., Bowyer-Crane, C. and Tobin, V., 2000. Levels of literacy among juvenile offenders: the incidence of specific reading difficulties. Criminal Behaviour and Mental Health, 10, pp. 229241.","paperID":"None"},{"content":"Yin, R. K., 2014. Case study research: Design and methods. Sage publications.","paperID":"None"},{"content":"Zisimopoulos, D. and Galanaki, E., 2009. Academic Intrinsic Motivation and Perceived Academic Competence in Greek Elementary Students with and without Learning Disabilities. Learning Disabilities Research & Practice, 24(1), pp. 33--43.","paperID":"None"}],"title":"Using Gamification to Motivate Students with Dyslexia","filename":"CHI16/p969","authors":["Daniel Gooch","Asimina Vasalou","Laura Benton","Rilla Khaled"],"conference":"CHI '16"}