{"paperId":2858235,"citation":[],"reference":[{"content":"Michelle Annett, Tovi Grossman, Daniel Wigdor, and George Fitzmaurice. 2011. Medusa: a proximity-aware multi-touch tabletop. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 337--346.","paperID":"None"},{"content":"Sergul Aydore, Dimitrios Pantazis, and Richard M Leahy. 2013. A note on the phase locking value and its properties. Neuroimage 74 (2013), 231--244.","paperID":"None"},{"content":"Anne Beuter, Leon Glass, Michael C Mackey, and Michele S Titcombe. 2013. Nonlinear dynamics in physiology and medicine. Vol. 25. Springer Science & Business Media.","paperID":"None"},{"content":"Sangwon Choi, Jaehyun Han, Sunjun Kim, Seongkook Heo, and Geehyuk Lee. 2011. ThickPad: a hover-tracking touchpad for a laptop. In Proceedings of the 24th annual ACM symposium adjunct on User interface software and technology. ACM, 15--16.","paperID":"None"},{"content":"Paul Dietz and Darren Leigh. 2001. DiamondTouch: a multi-user touch technology. In Proceedings of the 14th annual ACM symposium on User interface software and technology. ACM, 219--226.","paperID":"None"},{"content":"Dennis Gabor. 1946. Theory of communication. Part 1: The analysis of information. Journal of the Institution of Electrical Engineers-Part III: Radio and Communication Engineering 93, 26 (1946), 429--441.","paperID":"None"},{"content":"Mark Hallett. 1998. Overview of human tremor physiology. Movement Disorders 13, S3 (1998), 43--48.","paperID":"None"},{"content":"Chris Harrison, Munehiko Sato, and Ivan Poupyrev. 2012. Capacitive fingerprinting: exploring user differentiation by sensing electrical properties of the human body. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM, 537--544.","paperID":"None"},{"content":"Jean-Philippe Lachaux, Eugenio Rodriguez, Jacques Martinerie, Francisco J Varela, and others. 1999. Measuring phase synchrony in brain signals. Human brain mapping 8, 4 (1999), 194--208.","paperID":"None"},{"content":"Roderick Murray-Smith, Andrew Ramsay, Simon Garrod, Melissa Jackson, and Bojan Musizza. 2007. Gait alignment in mobile phone conversations. In Proceedings of the 9th international conference on Human computer interaction with mobile devices and services. ACM, 214--221.","paperID":"None"},{"content":"Milan Palus and Dirk Hoyer. 1998. Detecting nonlinearity and phase synchronization with surrogate data. Engineering in Medicine and Biology Magazine, IEEE 17, 6 (1998), 40--45.","paperID":"None"},{"content":"Arkady Pikovsky, Michael Rosenblum, and Jrgen Kurths. 2003. Synchronization: a universal concept in nonlinear sciences. Vol. 12. Cambridge university press.","paperID":"None"},{"content":"David Ernesto Troncoso Romero and Gordana Jovanovic Dolecek. 2012. Digital FIR Hilbert Transformers: Fundamentals and Efficient Design Methods. INTECH Open Access Publisher.","paperID":"None"},{"content":"Ted Selker, Patricia Collins, and Will Dayton. 2011. Psychosocial indicators via hand tremor. In Human-Computer InteractionINTERACT 2011. Springer, 596--599.","paperID":"None"},{"content":"Steven Strachan and Roderick Murray-Smith. 2004. Muscle tremor as an input mechanism. In Proc. UIST, Vol. 2. 482.","paperID":"None"},{"content":"Shota Suto and Susumu Shibusawa. 2013. A Tabletop System Using Infrared Image Recognition for Multi-user Identification. In Human-Computer Interaction INTERACT 2013. Lecture Notes in Computer Science, Vol. 8118. 55--62.","paperID":"None"},{"content":"Yoshiki Takeoka, Takashi Miyaki, and Jun Rekimoto. 2010. Z-touch: an infrastructure for 3d gesture interaction in the proximity of tabletop surfaces. In ACM International Conference on Interactive Tabletops and Surfaces. ACM, 91--94.","paperID":"None"},{"content":"Andrew D Wilson. 2010. Using a depth camera as a touch sensor. In ACM international conference on interactive tabletops and surfaces. ACM, 69--72.","paperID":"None"}],"abstract":"When using non-contact finger tracking, fingers can be classified as to which hand they belong to by analysing the phase relation of physiological tremor. In this paper, we show how 3D capacitive sensors can pick up muscle tremor in fingers above a device. We develop a signal processing pipeline based on nonlinear phase synchronisation that can reliably group fingers to hands and experimentally validate our technique. This allows significant new gestural capabilities for 3D finger sensing without additional hardware","title":"Fingers of a Hand Oscillate Together: Phase Syncronisation of Tremor in Hover Touch Sensing","filename":"CHI16/p3433","authors":["John Williamson"],"conference":"CHI '16"}