{"paperId":2858583,"citation":[],"reference":[{"content":"Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). 2005--2014. http://dx.doi.org/10.1145/2207676.2208347","paperID":"None"},{"content":"John Bowers. 2012. The logic of annotated portfolios: communicating the value of 'research through design'. In Proceedings of the Designing Interactive Systems Conference (DIS '12). 68--77. http://dx.doi.org/10.1145/2317956.2317968","paperID":"None"},{"content":"Antonio Damasio. 2008. Descartes' error: Emotion, reason and the human brain. Random House.","paperID":"None"},{"content":"Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. The MIT Press.","paperID":"None"},{"content":"Moshe Feldenkrais. 1972. Awareness Through Movement. Harper & Row.","paperID":"None"},{"content":"Frank Feltham, Lian Loke, Elise van den Hoven, Jeffrey Hannam, and Bert Bongers. 2014. The slow floor: increasing creative agency while walking on an interactive surface. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). 105--112. http://dx.doi.org/10.1145/2540930.2540974","paperID":"None"},{"content":"Jodi Forlizzi and Katja Battarbee. 2004. Understanding experience in interactive systems. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '04). 261--268. http://dx.doi.org/10.1145/1013115.1013152","paperID":"None"},{"content":"William Gaver. 2012. What should we expect from research through design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). 937--946. http://dx.doi.org/10.1145/2207676.2208538","paperID":"None"},{"content":"Marianne Graves Petersen, Ole Sejer Iversen, Peter Gall Krogh, and Martin Ludvigsen. 2004. Aesthetic interaction: a pragmatist's aesthetics of interactive systems. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '04). ACM, New York, NY, USA, 269--276.","paperID":"None"},{"content":"Marianne Graves Petersen, Ole Sejer Iversen, Peter Gall Krogh, and Martin Ludvigsen. 2004. Aesthetic interaction: a pragmatist's aesthetics of interactive systems. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '04). 269--276. http://dx.doi.org/10.1145/1013115.1013153","paperID":"None"},{"content":"Mads Hobye. 2014. Designing for Homo Explorens: open social play in performative frames. PhD diss., Malmö University.","paperID":"None"},{"content":"Caroline, Hummels, Kees Overbeeke, and Sietske Klooster. 2007. Move to get moved: a search for methods, tools and knowledge to design for expressive and rich movement-based interaction. Personal and Ubiquitous Computing, 11(8), 677--690.","paperID":"None"},{"content":"Kristina Höök. 2008. Affective Loop Experiences --What Are They?. In Proceedings of the 3rd international conference on Persuasive Technology (PERSUASIVE '08), Harri Oinas-Kukkonen, Per Hasle, Marja Harjumaa, Katarina Segerståhl, and Peter Øhrstrøm (Eds.). 1--12. http://dx.doi.org/10.1007/978--3540--68504--3_1","paperID":"None"},{"content":"Kristina Höök. 2010. Transferring qualities from horseback riding to design. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10). 226--235. http://dx.doi.org/10.1145/1868914.1868943","paperID":"None"},{"content":"Kristina Höök, Peter Dalsgaard, Stuart Reeves, Jeffrey Bardzell, Jonas Löwgren, Erik Stolterman, and Yvonne Rogers. 2015. Knowledge Production in Interaction Design. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). 2429--2432. http://dx.doi.org/10.1145/2702613.2702653","paperID":"None"},{"content":"Kristina Höök and Jonas Löwgren. 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Trans. Comput.-Hum. Interact. 19, 3, Article 23 (October 2012).","paperID":"None"},{"content":"Kristina Höök, Anna Ståhl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, and Eva-Carin Banka Johnson. 2015. COVER STORY: Somaesthetic design. Interactions 22, 4 (June 2015), 26--33.","paperID":"None"},{"content":"Tim Ingold. 2011. Being alive: Essays on movement, knowledge and description. Taylor & Francis.","paperID":"None"},{"content":"Katherine Isbister, Kristina Höök, K., Mark Sharp, and Jarmo Laaksolahti. 2006. The sensual evaluation instrument: developing an affective evaluation tool. In Proceedings of the SIGCHI conference on Human Factors in computing systems (pp. 1163--1172). ACM.","paperID":"None"},{"content":"William James. 1905. The experience of activity. Psychological Review 12, no. 1 (1905): 1.","paperID":"None"},{"content":"Martin Jonsson, Anna Ståhl, Johanna Mercurio, Anna Karlsson, Naveen Ramani and Kristina Höök. 2016. The Aesthetics of Heat: Guiding Awareness with Thermal Stimuli. In Proceedings of the 10th International Conference on Tangible, Embedded and Embodied Interaction (TEI '16).","paperID":"None"},{"content":"Deane Juhan. 1995. Job's body: A handbook for bodywork (Excerpts) Bone, Breath, Gesture; Practices of Embodiment, California: North Atlantic Books: 35378.","paperID":"None"},{"content":"George Khut. 2006. Development and Evaluation of Participant-Centred Biofeedback Artworks. Unpublished doctoral exegesis, University of Western Sydney.","paperID":"None"},{"content":"George Lakoff and Mark Johnson. 1999. Philosophy in the flesh: The embodied mind and its challenge to western thought. Basic books.","paperID":"None"},{"content":"Youn-kyung Lim, Erik Stolterman, Heekyoung Jung, and Justin Donaldson. 2007. Interaction gestalt and the design of aesthetic interactions. In Proceedings of the 2007 conference on Designing pleasurable products and interfaces (DPPI '07). 239--254. http://dx.doi.org/10.1145/1314161.1314183","paperID":"None"},{"content":"Wonjun Lee, Youn-kyung Lim, and Richard Shusterman. 2014. Practicing somaesthetics: exploring its impact on interactive product design ideation. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). 1055--1064. http://dx.doi.org/10.1145/2598510.2598561","paperID":"None"},{"content":"Lian Loke, George Khut, L. Muller, M. Slattery, C. Truman, and J. Duckworth. 2013. Re-sensitising the body: Interactive art and the FeldenkraisMethod. International Journal of Arts and Technology","paperID":"None"},{"content":"Lain Loke, and Toni Robertson. 2013. Moving and Making Strange: An Embodied Approach to Movement-based Interaction Design. ACM Trans. Comput.Hum. Interact. 20, 1, Article 7.","paperID":"None"},{"content":"Jonas Löwgren and Mads Hobye. 2011. Touching a stranger: Designing for engaging experience in embodied interaction. International Journal of Design, 3(5), pp. 31--48.","paperID":"None"},{"content":"Jonas Löwgren and Erik Stolterman. 2004. Thoughtful interaction design: A design perspective on information technology. Mit Press.","paperID":"None"},{"content":"Helena M. Mentis, Jarmo Laaksolahti, and Kristina Höök. 2014. My Self and You: Tension in Bodily Sharing of Experience. ACM Trans. Comput.-Hum. Interact. 21, 4, Article 20 (June 2014)","paperID":"None"},{"content":"Maurice Merleau-Ponty. 1962. Phenomenology of perception. Routledge.","paperID":"None"},{"content":"Jin Moen. 2005. Towards people based movement interaction and kinaesthetic interaction experiences. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility (CC '05). 121--124. http://dx.doi.org/10.1145/1094562.1094579","paperID":"None"},{"content":"Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical design in HCI research: designing and learning through use-it-yourself. In Proceedings of the Designing Interactive Systems Conference (DIS '12). 514--523. http://dx.doi.org/10.1145/2317956.2318034","paperID":"None"},{"content":"C. Núñez-Pacheco and Lian Loke. 2014. Crafting the Body-Tool: A Body-centred Perspective on Wearable Technology Design. In DIS'14: Proceedings of the 2014 Designing Interactive Systems Conference, ACM.","paperID":"None"},{"content":"Terry Regier and Paul Kay. 2009. Language, thought, and color: Whorf was half right. Trends in cognitive sciences 13, no. 10. 439--446.","paperID":"None"},{"content":"Marie-Louise, Rinman, Anders Friberg, Bendik Bendiksen, Demian Cirotteau, Sofia Dahl, Ivar Kjellmo, Barbara Mazzarino, and Antonio Camurri. 2004. Ghost in the Cave-an interactive collaborative game using non-verbal communication. In Gesture-Based Communication in Human-Computer Interaction, pp. 549--556. Springer Berlin Heidelberg.","paperID":"None"},{"content":"Pedro Sanches, Kristina Höök, Elsa Vaara, Claus Weymann, Markus Bylund, Pedro Ferreira, Nathalie Peira, and Marie Sjölinder. 2010. Mind the body!: designing a mobile stress management application encouraging personal reflection. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). 47--56. http://doi.acm.org/10.1145/1858171.1858182","paperID":"None"},{"content":"Thecla Schiphorst. 2007. Really, really small: the palpability of the invisible. In Proceedings of the 6th ACM SIGCHI conference on Creativity & cognition (C&C '07). 7--16. http://dx.doi.org/10.1145/1254960.1254962","paperID":"None"},{"content":"Thecla Schiphorst. 2011. Self-evidence: applying somatic connoisseurship to experience design. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). 145--160. http://dx.doi.org/10.1145/1979742.1979640","paperID":"None"},{"content":"Thecla Schiphorst. 2009. soft(n): toward a somaesthetics of touch. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). 2427--2438. http://dx.doi.org/10.1145/1520340.1520345","paperID":"None"},{"content":"Thecla Schiphorst. 2009. The Varieties of User Experience Bridging Embodied Methodologies from Somatics and Performance to Human Computer Interaction, Unpublished thesis manuscript, University of Plymouth.","paperID":"None"},{"content":"Donald A. Schön. 1983. The reflective practitioner: How professionals think in action. Vol. 5126. Basic books.","paperID":"None"},{"content":"Maxine Sheets-Johnstone. 2011. The primacy of movement (Vol. 82). John Benjamins Publishing.","paperID":"None"},{"content":"Richard Shusterman. 2008. Body consciousness: A philosophy of mindfulness and somaesthetics. Cambridge University Press.","paperID":"None"},{"content":"Richard Shusterman. 2013. Somaesthetics. The Encyclopedia of Human-Computer Interaction, 2nd Ed. Soegaard, Mads, and Rikke Friis Dam.","paperID":"None"},{"content":"Vygandas Šimbelis, Anders Lundström, Kristina Höök, Jordi Solsona, and Vincent Lewandowski. 2014. Metaphone: machine aesthetics meets interaction design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 1--10. http://dx.doi.org/10.1145/2556288.2557152","paperID":"None"},{"content":"Erik Stolterman. 2008. The Nature of Design Practice and Implications for Interaction, International Journal of Design, Vol 2, No 1.","paperID":"None"},{"content":"Anna Ståhl, Jonas Löwgren, and Kristina Höök. 2014. Evocative balance: Designing for interactional empowerment. Journal of Interaction Design. Vol. 8, No 1.","paperID":"None"},{"content":"Petra Sundström. 2005. Exploring the affective loop. Licenciate Thesis, Stockholm University, Sweden","paperID":"None"},{"content":"Francisco J. Varela. 1999. Ethical know-how: Action, wisdom, and cognition. Stanford University Press.","paperID":"None"},{"content":"Jay Vidyarthi, Bernhard E. Riecke, and Diane Gromala. 2012. Sonic Cradle: designing for an immersive experience of meditation by connecting respiration to music. In Proceedings of the Designing Interactive Systems Conference (DIS '12). 408--417. http://dx.doi.org/10.1145/2317956.2318017","paperID":"None"},{"content":"Danielle Wilde. 2012. hipDisk: understanding the value of ungainly, embodied, performative, fun. In CHI'12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 111--120.","paperID":"None"},{"content":"Farnaz Zangouei, Mohammad Ali Babazadeh Gashti, Kristina Höök, Tim Tijs, Gert-Jan de Vries, and Joyce Westerink. 2010. How to stay in the emotional rollercoaster: lessons learnt from designing EmRoll. In Proceedings of the 6th Nordic Conference on HumanComputer Interaction: Extending Boundaries (NordiCHI '10). 571--580. http://dx.doi.org/10.1145/1868914.1868978","paperID":"None"},{"content":"John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). 493--502. http://dx.doi.org/10.1145/1240624.1240704","paperID":"None"}],"abstract":"We propose a strong concept we name Somaesthetic Appreciation based on three different enquiries. First, our own autobiographical design enquiry, using Feldenkrais as a resource in our design process, bringing out the Soma Carpet and Breathing Light applications. Second, through bringing in others to experience our systems, engaging with and qualitatively analysing their experiences of our applications. In our third enquiry, we try to pin down what characterises and sets Somaesthetic Appreciation designs apart through comparing with and analysing others' design inquiries as well as grounding them in the somaesthetic theories. We propose that the Somaesthetic Appreciation designs share a subtleness in how they encourage and spur bodily inquiry in their choice of interaction modalities, they require an intimate correspondence -- feedback and interactions that follow the rhythm of the body, they entail a distinct manner of making space shutting out the outside world -- metaphorically and literally -- to allow users to turn their attention inwards, and they rely on articulation of bodily experiences to encourage learning and increased somatic awareness.","title":"Somaesthetic Appreciation Design","filename":"CHI16/p3131","authors":["Kristina Höök","Martin P. Jonsson","Anna Ståhl","Johanna Mercurio"],"conference":"CHI '16"}