{"paperId":2858055,"citation":[],"abstract":"Numerous studies have tracked people's everyday use of digital devices, but without consideration of how such data might be of personal interest to the user. We have developed a personal tracking application that enables users to automatically monitor their 'screen time' on mobile devices (iOS and Android) and computers (Mac and Windows). The application interface enables users to combine screen time data from multiple devices. We trialled the application for 28+ days with 21 users, collecting log data and interviewing each user. We found that there is interest in personal tracking in this area, but that the study participants were less interested in quantifying their overall screen time than in gaining data about their use of specific devices and applications. We found that personal tracking of device use is desirable for goals including: increasing productivity, disciplining device use, and cutting down on use.","reference":[{"content":"Yuvraj Agarwal and Malcolm Hall. 2013. ProtectMyPrivacy: detecting and mitigating privacy leaks on iOS devices using crowdsourcing. In Proceeding of the 11th annual international conference on Mobile systems, applications, and services (MobiSys '13). 97--110. http://doi.acm.org/10.1145/2462456.2464460","paperID":"None"},{"content":"Kumaripaba Athukorala, Eemil Lagerspetz, Maria von Kügelgen, Antti Jylhä, Adam J. Oliner, Sasu Tarkoma, and Giulio Jacucci. 2014. How carat affects user behavior: implications for mobile battery awareness applications. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). 1029--1038. http://doi.acm.org/10.1145/2556288.2557271","paperID":"None"},{"content":"Barry Brown, Stuart Reeves, and Scott Sherwood. 2011. Into the wild: challenges and opportunities for field trial methods. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). 1657--1666. http://doi.acm.org/10.1145/1978942.1979185","paperID":"None"},{"content":"Matthias Böhmer, Brent Hecht, Johannes Schöning, Antonio Krüger, and Gernot Bauer. 2011. Falling asleep with Angry Birds, Facebook and Kindle: a large scale study on mobile application usage. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). 47--56. http://doi.acm.org/10.1145/2037373.2037383","paperID":"None"},{"content":"Juan Pablo Carrascal and Karen Church. 2015. An InSitu Study of Mobile App & Mobile Search Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 2739--2748. http://doi.acm.org/10.1145/2702123.2702486","paperID":"None"},{"content":"Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding quantified-selfers' practices in collecting and exploring personal data. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). 1143--1152. http://doi.acm.org/10.1145/2556288.2557372","paperID":"None"},{"content":"Karen Church, Denzil Ferreira, Nikola Banovic, and Kent Lyons. 2015. Understanding the Challenges of Mobile Phone Usage Data. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). 504--514. http://doi.acm.org/10.1145/2785830.2785891","paperID":"None"},{"content":"Felicia Cordeiro, Daniel A. Epstein, Edison Thomaz, Elizabeth Bales, Arvind K. Jagannathan, Gregory D. Abowd, and James Fogarty. 2015. Barriers and Negative Nudges: Exploring Challenges in Food Journaling. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 1159--1162. http://doi.acm.org/10.1145/2702123.2702155","paperID":"None"},{"content":"Henriette Cramer, Mattias Rost, and Lars Erik Holmquist. 2011. Performing a check-in: emerging practices, norms and 'conflicts' in location-sharing using foursquare. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services(MobileHCI '11). 57--66. http://doi.acm.org/10.1145/2037373.2037384","paperID":"None"},{"content":"Kate Crawford, Jessa Lingel, Terra Karppi. 2015. Our metrics, ourselves: A hundred years of self-tracking from the weight scale to the wrist wearable device. European Journal of Cultural Studies 18,4--5: 479--496 DOI: 10.1177/1367549415584857","paperID":"None"},{"content":"Nicholas S. Dalton, Emily Collins, and Paul Marshall. 2015. Display Blindness?: Looking Again at the Visibility of Situated Displays using Eye-tracking. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 3889--3898. http://doi.acm.org/10.1145/2702123.2702150","paperID":"None"},{"content":"David Dearman and Jeffery S. Pierce. 2008. It's on my other computer!: computing with multiple devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 767--776. DOI=http://dx.doi.org/10.1145/1357054.1357177","paperID":"None"},{"content":"Trinh Minh Tri Do, Jan Blom, and Daniel GaticaPerez. 2011. Smartphone usage in the wild: a largescale analysis of applications and context. In Proceedings of the 13th international conference on multimodal interfaces (ICMI '11). 353--360. http://doi.acm.org/10.1145/2070481.2070550","paperID":"None"},{"content":"Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A lived informatics model of personal informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). 731--742. http://doi.acm.org/10.1145/2750858.2804250","paperID":"None"},{"content":"Hossein Falaki, Ratul Mahajan, Srikanth Kandula, Dimitrios Lymberopoulos, Ramesh Govindan, and Deborah Estrin. 2010. Diversity in smartphone usage. In Proceedings of the 8th international conference on Mobile systems, applications, and services (MobiSys '10). 179--194. http://doi.acm.org/10.1145/1814433.1814453","paperID":"None"},{"content":"Denzil Ferreira, Anind K. Dey, and Vassilis Kostakos. 2011. Understanding human-smartphone concerns: a study of battery life. In Proceedings of the 9th international conference on Pervasive computing (Pervasive'11). 19--33.","paperID":"None"},{"content":"Denzil Ferreira, Eija Ferreira, Jorge Goncalves, Vassilis Kostakos, and Anind K. Dey. 2013. Revisiting human-battery interaction with an interactive battery interface. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). 563--572. http://doi.acm.org/10.1145/2493432.2493465","paperID":"None"},{"content":"Nicola K Gale, Gemma Heath, Elaine Cameron, Sabina Rashid and Sabi Redwood. 2013. Using the framework method for the analysis of qualitative data in multidisciplinary health research. BMC Medical Research Methodology, 13:117 DOI:10.1186/1471--2288--13--117","paperID":"None"},{"content":"Google (2012) The New Multiscreen World: Understanding Cross-Platform Consumer Behaviour. Think With Google Newsletter, August 2012.","paperID":"None"},{"content":"Victoria Hollis, Artie Konrad, and Steve Whittaker. 2015. Change of Heart: Emotion Tracking to Promote Behavior Change. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 2643--2652. http://doi.acm.org/10.1145/2702123.2702196","paperID":"None"},{"content":"Christian Holz, Frank Bentley, Karen Church, and Mitesh Patel. 2015. \"I'm just on my phone and they're watching TV\": Quantifying mobile device use while watching television. In Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video (TVX '15). 93--102. http://doi.acm.org/10.1145/2745197.2745210","paperID":"None"},{"content":"Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 17--24. DOI=http://dx.doi.org/10.1145/642611.642616","paperID":"None"},{"content":"https://inthemoment.io/","paperID":"None"},{"content":"Lucas D. Introna, Fernando M. Ilharco. 2006. On the Meaning of Screens: Towards a Phenomenological Account of Screenness. Human Studies 29, 1: 57--76. DOI 10.1007/s10746-005--9009-y","paperID":"None"},{"content":"Tero Jokela, Jarno Ojala, and Thomas Olsson. 2015. A Diary Study on Combining Multiple Information Devices in Everyday Activities and Tasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 3903--3912. http://doi.acm.org/10.1145/2702123.2702211","paperID":"None"},{"content":"Amy K. Karlson, Brian R. Meyers, Andy Jacobs, Paul Johns, and Shaun K. Kane. 2009. Working Overtime: Patterns of Smartphone and PC Usage in the Day of an Information Worker. In Proceedings of the 7th International Conference on Pervasive Computing (Pervasive '09), Hideyuki Tokuda, Michael Beigl, Adrian Friday, A. J. Brush, and Yoshito Tobe (Eds.). Springer-Verlag, Berlin, Heidelberg, 398--405. DOI=http://dx.doi.org/10.1007/978--3--642-01516--8_27","paperID":"None"},{"content":"Matthew Kay, Dan Morris, mc schraefel, and Julie A. Kientz. 2013. There's no such thing as gaining a pound: reconsidering the bathroom scale user interface. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). 401--410. http://doi.acm.org/10.1145/2493432.2493456","paperID":"None"},{"content":"Uichin Lee, Joonwon Lee, Minsam Ko, Changhun Lee, Yuhwan Kim, Subin Yang, Koji Yatani, Gahgene Gweon, Kyong-Mee Chung, and Junehwa Song. 2014. Hooked on smartphones: an exploratory study on smartphone overuse among college students. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). 23272336. http://doi.acm.org/10.1145/2556288.2557366","paperID":"None"},{"content":"Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stage-based model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). 557--566. http://doi.acm.org/10.1145/1753326.1753409","paperID":"None"},{"content":"Carolynne Lord, Mike Hazas, Adrian K. Clear, Oliver Bates, Rosalind Whittam, Janine Morley, and Adrian Friday. 2015. Demand in My Pocket: Mobile Devices and the Data Connectivity Marshalled in Support of Everyday Practice. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 2729--2738. http://doi.acm.org/10.1145/2702123.2702162","paperID":"None"},{"content":"Deborah Lupton. 2014. Self-tracking cultures: towards a sociology of personal informatics. InProceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design (OzCHI '14). 77--86. http://doi.acm.org/10.1145/2686612.2686623","paperID":"None"},{"content":"Gloria Mark, Yiran Wang, and Melissa Niiya. 2014. Stress and multitasking in everyday college life: an empirical study of online activity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 41--50. http://doi.acm.org/10.1145/2556288.2557361","paperID":"None"},{"content":"Donald McMillan, Alistair Morrison, Owain Brown, Malcolm Hall, and Matthew Chalmers. Further Into The Wild: Running Worldwide Trials of Mobile Systems. In Proceedings of Pervasive 2010. 210--227. DOI 10.1007/978--3--642--12654--3_13","paperID":"None"},{"content":"Alistair Morrison, Donald McMillan, Stuart Reeves, Scott Sherwood, and Matthew Chalmers. 2012. A hybrid mass participation approach to mobile software trials. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1311--1320. DOI=http://dx.doi.org/10.1145/2207676.2208588","paperID":"None"},{"content":"Antti Oulasvirta and Lauri Sumari. 2007. Mobile kits and laptop trays: managing multiple devices in mobile information work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 11271136. DOI=http://dx.doi.org/10.1145/1240624.1240795","paperID":"None"},{"content":"Alice Pagano, John Bird. 2015. Reading A Life Through Books. In Proceedings of Workshop on Beyond Personal Informatics, at CHI '15, Seoul, Korea, 18th April 2015.","paperID":"None"},{"content":"Abhinav Parate, Matthias Böhmer, David Chu, Deepak Ganesan, and Benjamin M. Marlin. 2013. Practical prediction and prefetch for faster access to applications on mobile phones. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). 275--284. http://doi.acm.org/10.1145/2493432.2493490","paperID":"None"},{"content":"Alex Pentland. 2014. Social Physics. How Good Ideas Spread - The Lessons from a New Science. MIT Press.","paperID":"None"},{"content":"http://www.qualitytimeapp.com/"},{"content":"Jill Walker Rettberg. 2014. Seeing Ourselves Through Technology. Palgrave Pivot.","paperID":"None"},{"content":"Karen Renaud, Judith Ramsay, Mario Hair. 2006. \"You've got e-mail!\"... shall I deal with it now? Electronic mail from the recipient's perspective. International Journal of Human-Computer Interaction, 21, 3: 313--332.","paperID":"None"},{"content":"Karen Renaud, Paul Gray. 2004. Making sense of low level usage data to understand user activities. In P. Kotze & G. Marsden (Eds.), In Proceedings of SAICSIT 2004. 111--120.","paperID":"None"},{"content":"https://www.rescuetime.com","paperID":"None"},{"content":"Jane Ritchie and Jane Lewis. 2003. Qualitative research practice: a guide for social science students and researchers. London: Sage.","paperID":"None"},{"content":"Yvonne Rogers, Kay Connelly, Lenore Tedesco, William Hazlewood, Andrew Kurtz, Robert E. Hall, Josh Hursey, and Tammy Toscos. 2007. Why it's worth the hassle: the value of in-situ studies when designing Ubicomp. In Proceedings of the 9th international conference on Ubiquitous computing (UbiComp '07). 336--353.","paperID":"None"},{"content":"John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). 1163--1172. http://doi.acm.org/10.1145/2556288.2557039","paperID":"None"},{"content":"John Rooksby, Timothy E Smith, Alistair Morrison, Mattias Rost and Matthew Chalmers. 2015 Configuring Attention in the Multiscreen Living Room. In Proceedings of ECSCW 2015, 19th - 23rd September, Oslo.","paperID":"None"},{"content":"John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2015. Pass the Ball: Enforced Turn-Taking in Activity Tracking. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 2417--2426. http://doi.acm.org/10.1145/2702123.2702577","paperID":"None"},{"content":"Daniel T. Wagner, Andrew Rice, and Alastair R. Beresford. 2014. Device analyzer: large-scale mobile data collection. SIGMETRICS Perform. Eval. Rev. 41, 4: 53--56. http://doi.acm.org/10.1145/2627534.2627553","paperID":"None"}],"title":"Personal Tracking of Screen Time on Digital Devices","filename":"CHI16/p284","authors":["John Rooksby","Parvin Asadzadeh","Mattias Rost","Alistair Morrison","Matthew Chalmers"],"conference":"CHI '16"}