{"paperId":2858305,"citation":[],"abstract":"Mobile keyboards often present error corrections and word completions (suggestions) as candidates for anticipated user input. However, these suggestions are not cognitively free: they require users to attend, evaluate, and act upon them. To understand this trade-off between suggestion savings and interaction costs, we conducted a text transcription experiment that controlled interface assertiveness: the tendency for an interface to present itself. Suggestions were either always present (extraverted), never present (introverted), or gated by a probability threshold (ambiverted). Results showed that although increasing the assertiveness of suggestions reduced the number of keyboard actions to enter text and was subjectively preferred, the costs of attending to and using the suggestions impaired average time performance.","reference":[{"content":"Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2010. Predicting the cost of error correction in character based text entry technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, 5--14. DOI: http://dx.doi.org/10.1145/1753326.1753329","paperID":"None"},{"content":"Shiri Azenkot and Shumin Zhai. 2012. Touch behavior with different postures on soft smartphone keyboards. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services (MobileHCI '12). ACM, New York, NY, 251--260. DOI:http://dx.doi.org/10.1145/2371574.","paperID":"None"},{"content":"Stuart K. Card, Thomas P. Moran, and Allen Newell. 1983. The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, London.","paperID":"None"},{"content":"Mark Dunlop and John Levine. 2012. Multidimensional pareto optimization of touchscreen keyboards for speed, familiarity and improved spell checking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, 2669--2678. DOI: http://dx.doi.org/10.1145/ 2207676.2208659","paperID":"None"},{"content":"Leah Findlater and Jacob Wobbrock. 2012. Personalized input: improving ten-finger touchscreen typing through automatic adaptation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, 815--824. DOI: http://dx.doi.org/10.1145/2207676.2208520","paperID":"None"},{"content":"Frank O. Flemisch, Catherine A. Adams, Sheila R. Conway, Ken H. Goodrich, Michael T. Palmer, and Paul C. Schutte. 2003. The H-Metaphor as a Guideline for Vehicle Automation and Interaction. Technical Report NASA/TM-2003--212672. NASA Langley Research Center, Hampton, VA. http://ntrs.nasa.gov/search.jsp?R=20040031835","paperID":"None"},{"content":"Andrew Fowler, Kurt Partridge, Ciprian Chelba, Xiaojun Bi, Tom Ouyang, and Shumin Zhai. 2015. Effects of Language Modeling and Its Personalization on Touchscreen Typing Performance. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, 649--658. DOI: http://dx.doi.org/10.1145/2702123.2702503","paperID":"None"},{"content":"Nestor Garay-Vitoria and Julio Abascal. 2006. Text prediction systems: a survey. Universal Access in the Information Society 4 (2006), 188--203. DOI: http://dx.doi.org/10.1007/s10209-005-0005--9","paperID":"None"},{"content":"Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. Elsevier, North Holland, 139--183. DOI: http://dx.doi.org/10.1016/S0166--4115(08)62386--9","paperID":"None"},{"content":"Niels Henze, Enrico Rukzio, and Susanne Boll. 2012. Observational and experimental investigation of typing behaviour using virtual keyboards for mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, 2659--2668. DOI: http://dx.doi.org/10.1145/2207676.2208658","paperID":"None"},{"content":"Heidi M. Horstmann and Simon P. Levine. 1990. Modeling of user performance with computer access and augmentative communication systems for handicapped people. Augmentative and Alternative Communication 6, 4 (1990), 231--241. DOI: http://dx.doi.org/10.1080/07434619012331275514","paperID":"None"},{"content":"Eric Horvitz, Carl Kadie, Tim Paek, and David Hovel. 2003. Models of attention in computing and communication: from principles to applications. Commun. ACM 46, 3 (March 2003), 52--59. DOI: http://dx.doi.org/10.1145/636772.636798","paperID":"None"},{"content":"Heidi Horstmann Koester and Simon P. Levine. 1993. A model of performance cost versus benefit for augmentative communication systems. In Proceedings of the 15th Annual International Conference of the IEEE Engineering in Medicine and Biology Society. 1303--1304. DOI: http://dx.doi.org/10.1109/IEMBS.1993.979147","paperID":"None"},{"content":"Heidi Horstmann Koester and Simon P. Levine. 1994. Modeling the Speed of Text Entry with a Word Prediction Interface. IEEE Transactions on Rehabilitation Engineering 2, 3 (1994), 177--187. DOI: http://dx.doi.org/10.1109/86.331567","paperID":"None"},{"content":"Heidi Horstmann Koester and Simon P. Levine. 1996. Effect of a word prediction feature on user performance. Augmentative and Alternative Communication 12, 3 (1996), 155--168. DOI: http://dx.doi.org/10.1080/07434619612331277608","paperID":"None"},{"content":"Per Ola Kristensson and Keith Vertanen. 2012. Performance comparisons of phrase sets and presentation styles for text entry evaluations. In Proceedings of the 2012 ACM international conference on Intelligent User Interfaces (IUI '12). ACM, New York, NY, 29--32. DOI: http://dx.doi.org/10.1145/2166966.2166972","paperID":"None"},{"content":"Ying Liu and Kari Jouko Räihä. 2010. Predicting Chinese text entry speeds on mobile phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, 2183--2192. DOI: http://dx.doi.org/10.1145/1753326.","paperID":"None"},{"content":"I. Scott MacKenzie, Tatu Kauppinen, and Miika Silfverberg. 2001. Accuracy measures for evaluating computer pointing devices. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '01). ACM, New York, NY, 9--16. DOI: http://dx.doi.org/10.1145/365024.365028","paperID":"None"},{"content":"I. Scott MacKenzie and R. William Soukoreff. 2002. Text Entry for Mobile Computing: Models and Methods, Theory and Practice. Human-Computer Interaction 17, 2--3 (2002), 147--198. DOI: http://dx.doi.org/10.1080/07370024.2002.9667313","paperID":"None"},{"content":"I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase sets for evaluating text entry techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, New York, NY, 754--755. DOI: http://dx.doi.org/10.1145/765891.765971","paperID":"None"},{"content":"I. Scott MacKenzie and Kumiko Tanaka-Ishii (Eds.). 2007. Text Entry Systems: Mobility, Accessibility, Universality. Morgan Kaufmann, San Francisco, CA.","paperID":"None"},{"content":"Toshiyuki Masui. 1998. An efficient text input method for pen-based computers. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '98). ACM Press/Addison-Wesley Publishing Co., New York, NY, 328--335. DOI: http://dx.doi.org/10. 1145/274644.274690","paperID":"None"},{"content":"Hugo Nicolau and Joaquim Jorge. 2012. Touch typing using thumbs: understanding the effect of mobility and hand posture. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, 2683--2686. DOI: http://dx.doi.org/10.1145/2207676.2208661","paperID":"None"},{"content":"Antti Oulasvirta, Anna Reichel, Wenbin Li, Yan Zhang, Myroslav Bachynskyi, Keith Vertanen, and Per Ola Kristensson. 2013. Improving two-thumb text entry on touchscreen devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, 2765--2774. DOI: http://dx.doi.org/10.1145/2470654.2481383","paperID":"None"},{"content":"Philip Quinn and Andy Cockburn. 2016. When Bad Feels Good: Assistance Failures and Interface Preferences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY. DOI: http://dx.doi.org/10.1145/2858036.","paperID":"None"},{"content":"Philip Quinn, Andy Cockburn, and Jérôme Delamarche. 2013. Examining the costs of multiple trajectory pointing techniques. International Journal of Human-Computer Studies 71, 4 (2013), 492--509. DOI: http://dx.doi.org/10.1016/j.ijhcs.2012.12.001","paperID":"None"},{"content":"Philip Quinn, Andy Cockburn, Kari-Jouko Räihä, and Jérôme Delamarche. 2011. On the costs of multiple trajectory pointing methods. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, 859--862. DOI: http://dx.doi.org/10.1145/1978942.1979067","paperID":"None"},{"content":"Andrew Sears. 1991. Improving Touchscreen Keyboards: Design issues and a comparison with other devices. Interacting with Computers 3, 3 (1991), 253--269. DOI: http://dx.doi.org/10.1016/0953--5438(91)90016-U","paperID":"None"},{"content":"Andrew Sears, Julie A. Jacko, Josey Chu, and Francisco Moro. 2001. The role of visual search in the design of effective soft keyboards. Behaviour & Information Technology 20, 3 (2001), 159--166. DOI: http://dx.doi.org/10.1080/01449290110049790","paperID":"None"},{"content":"R. William Soukoreff and I. Scott MacKenzie. 1995. Theoretical upper and lower bounds on typing speed using a stylus and a soft keyboard. Behaviour & Information Technology 14, 6 (1995), 370--379. DOI: http://dx.doi.org/10.1080/01449299508914656","paperID":"None"},{"content":"Keith Trnka, John McCaw, Debra Yarrington, Kathleen F. McCoy, and Christopher Pennington. 2009. User Interaction with Word Prediction: The Effects of Prediction Quality. ACM Transactions on Accessible Computing 1, 3, Article 17 (Feb. 2009), 34 pages. DOI: http://dx.doi.org/10.1145/1497302.1497307","paperID":"None"},{"content":"Daryl Weir, Henning Pohl, Simon Rogers, Keith Vertanen, and Per Ola Kristensson. 2014. Uncertain Text Entry on Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, 2307--2316. DOI: http://dx.doi.org/10.1145/2556288.2557412","paperID":"None"},{"content":"Shumin Zhai, Michael Hunter, and Barton A. Smith. 2002. Performance Optimization of Virtual Keyboards. Human-Computer Interaction 17, 2--3 (2002), 229--269. DOI: http://dx.doi.org/10.1080/07370024.2002.9667315","paperID":"None"}],"title":"A Cost-Benefit Study of Text Entry Suggestion Interaction","filename":"CHI16/p83","authors":["Philip Quinn","Shumin Zhai"],"conference":"CHI '16"}