{"paperId":"2858037","reference":[{"content":"Johnny Accot and Shumin Zhai. 1997. Beyond Fitts' law: models for trajectory-based HCI tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '97), 295--302. http://dx.doi.org/10.1145/258549.258760","paperID":"None"},{"content":"Johnny Accot and Shumin Zhai. 1999. Performance evaluation of input devices in trajectory-based tasks: an application of the steering law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99), pp.466--472. http://dx.doi.org/10.1145/302979.303133","paperID":"None"},{"content":"Johnny Accot and Shumin Zhai. 2001. Scale effects in steering law tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01), pp.1--8. http://dx.doi.org/10.1145/365024.365027","paperID":"None"},{"content":"Johnny Accot and Shumin Zhai. 2002. More than dotting the i's -- foundations for crossing-based interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02), 73--80. http://dx.doi.org/10.1145/503376.503390","paperID":"None"},{"content":"Johnny Accot and Shumin Zhai. 2003. Refining Fitts' law models for bivariate pointing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03), 193--200. http://dx.doi.org/10.1145/642611.642646","paperID":"None"},{"content":"Takeshi Asano, Ehud Sharlin, Yoshifumi Kitamura, Kazuki Takashima, and Fumio Kishino. 2005. Predictive interaction using the delphian desktop. In Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '05), 133--141. http://dx.doi.org/10.1145/1095034.1095058","paperID":"None"},{"content":"Géry Casiez, Patricia Plénacoste, and Christophe Chaillou. 2004. Does DOF separation on elastic devices improve user 3D steering task performance? In Proceedings of the Asia Pacific Conference on Computer Human Interaction (APCHI '04), pp.70--80. http://dx.doi.org/10.1007/978--3--540--27795--8_8","paperID":"None"},{"content":"Jack Tigh Dennerlein, David B. Martin, and Christopher Hasser. 2000. Force-feedback improves performance for steering and combined steeringtargeting tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00), 423--429. http://dx.doi.org/10.1145/332040.332469","paperID":"None"},{"content":"Paul M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, Vol.47, No.6, 381--391. http://psycnet.apa.org/doi/10.1037/h0055392","paperID":"None"},{"content":"Carl Gutwin and Amy Skopik. 2003. Fisheyes are good for large steering tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03), 201--208. http://dx.doi.org/10.1145/642611.642648","paperID":"None"},{"content":"Raghavendra S. Kattinakere, Tovi Grossman, and Sriram Subramanian. 2007. Modeling steering within above-the-surface interaction layers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 317--326. http://dx.doi.org/10.1145/1240624.1240678","paperID":"None"},{"content":"Sergey Kulikov, I. Scott MacKenzie, and Wolfgang Stuerzlinger. 2005. Measuring the effective parameters of steering motions. In Extended Abstracts of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 1569--1572. http://dx.doi.org/10.1145/1056808.1056968","paperID":"None"},{"content":"Sergey Kulikov and Wolfgang Stuerzlinger. 2006. Targeted steering motions. In Extended Abstracts of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 983--988. http://dx.doi.org/10.1145/1125451.1125640","paperID":"None"},{"content":"Lei Liu, Jean-Bernard Martens, and Robert van Liere. 2011. Revisiting path steering for 3D manipulation tasks. International Journal of Human-Computer Studies, Vol.69, Issue 3, 170--181. http://dx.doi.org/10.1016/j.ijhcs.2010.11.006","paperID":"None"},{"content":"Martez E. Mott, and Jacob O. Wobbrock. 2014. Beating the bubble: using kinematic triggering in the bubble lens for acquiring small, dense targets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 733--742. http://dx.doi.org/10.1145/2556288.2557410","paperID":"None"},{"content":"Satoshi Naito, Yoshifumi Kitamura, and Fumio Kishino. 2004. Steering law in an environment of spatially coupled style with matters of pointer size and trajectory width. In Proceedings of the Asia Pacific Conference on Computer Human Interaction (APCHI '04), 305--316. http://dx.doi.org/10.1007/978--3--540--27795--8_31","paperID":"None"},{"content":"Robert Pastel. 2006. Measuring the difficulty of steering through corners. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 1087--1096. http://dx.doi.org/10.1145/1124772.1124934","paperID":"None"},{"content":"Minghui Sun, Xiangshi Ren, Shumin Zhai, and Toshiharu Mukai. 2012. An investigation of the relationship between texture and human performance in steering tasks. In Proceedings of the Asia Pacific Conference on Computer Human Interaction (APCHI '12), 1--6. http://dx.doi.org/10.1145/2350046.2350048","paperID":"None"},{"content":"Xiaolei Zhou, Xiang Cao, and Xiangshi Ren. 2009. Speed-accuracy tradeoff in trajectory-based tasks with temporal constraint. In Proceedings of the IFIP International Conference on Human Computer Interaction (INTERACT '09), 906--919. http://dx.doi.org/10.1007/978--3--642-03655--2_99","paperID":"None"},{"content":"Shumin Zhai, Johnny Accot, and Rogier Woltjer. 2004. Human action laws in electronic virtual worlds: an empirical study of path steering performance in VR. Presence, Vol.13, No.2, 113--127. http://dx.doi.org/10.1162/1054746041382393","paperID":"None"}],"citation":[],"abstract":"The performance of trajectory-based tasks is modeled by the steering law, which predicts the required time from the index of difficulty (ID). This paper focuses on the fact that the time required to pass through a straight path with linearly-varying width alters depending on the direction of the movement. In this study, an expression for the relationship between the ID of narrowing and widening paths has been developed. This expression can be used to predict the movement time needed to pass through in the opposite direction from only a few data points, after measuring the time needed in the other direction. In the experiment, the times for five IDs were predicted with high precision from the measured time for one ID, thereby illustrating the effectiveness of the proposed method.","title":"Modeling the Steering Time Difference between Narrowing and Widening Tunnels","filename":"CHI16/p1846","authors":["Shota Yamanaka","Homei Miyashita"],"conference":"CHI '16"}