{"paperId":2858060,"citation":[],"reference":[{"content":"Eytan Adar, Desney S. Tan, and Jaime Teevan. 2013. Benevolent Deception in Human Computer Interaction. Chi 2013 (2013), 1863--1872. DOI: http://dx.doi.org/10.1145/2470654.2466246","paperID":"None"},{"content":"George A. Akerlof and Robert J. Shiller. 2015. Privacy in context: Technology, policy, and the integrity of social life. Princeton University Press.","paperID":"None"},{"content":"Harm Akker, Valerie M. Jones, and Hermie J. Hermens. 2014. Tailoring Real-time Physical Activity Coaching Systems: A Literature Survey and Model. User Modeling and User-Adapted Interaction 24, 5 (Dec. 2014), 351--392. DOI: http://dx.doi.org/10.1007/s11257-014--9146-y","paperID":"None"},{"content":"A Albrechtslund. 2008. Online social networking as participatory surveillance. First Monday 13, 3 (2008), 1--11. http://firstmonday.org/ojs/index.php/fm/article/viewArticle/2142","paperID":"None"},{"content":"James M Alexander and Jonathan M Smith. 2010. Disinformation : A Taxonomy. Technical Report. University of Pennsylvania Department of Computer & Information Science.","paperID":"None"},{"content":"Luigi Anolli, Michela Balconi, and Rita Ciceri. 2001. Deceptive Miscommunication Theory ( DeMiT ): A New Model for the Analysis of Deceptive Communication. Say not to say New perspectives on miscommunication FEBRUARY (2001), 73--100. http://books.google.com/books?hl=en&lr=&id=PsiLjRHr1JQC&oi=fnd&pg=PA73&dq=Deceptive+Miscommunication+Theory+(+DeMiT+):+A+new+model+for+the+analysis+of+deceptive+communication&ots=GkJjOpQJfZ&sig=DfUVh93xYcd2WThfB5_w3vU7nfo","paperID":"None"},{"content":"Paul M. Aoki and Allison Woodruff. 2005. Making Space for Stories: Ambiguity in the Design of Personal Communication Systems. (2005), 10. DOI: http://dx.doi.org/10.1145/1054972.1054998","paperID":"None"},{"content":"James Auger. 2013. Speculative design: crafting the speculation. Digital Creativity 24, 1 (2013), 11--35.","paperID":"None"},{"content":"Jeffrey Bardzell, Shaowen Bardzell, and Erik Stolterman. 2014. Reading critical designs: supporting reasoned interpretations of critical design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1951--1960.","paperID":"None"},{"content":"Jeremy Birnholtz, Graham Dixon, and Jeffrey Hancock. 2012. Distance, ambiguity and appropriation: Structures affording impression management in a collocated organization. Computers in Human Behavior 28, 3 (2012), 1028--1035.","paperID":"None"},{"content":"Sissela Bok. 1978. Lying: Moral choice in public life. NY: Pantheon (1978).","paperID":"None"},{"content":"danah boyd. 2002. Faceted id/entity: Managing representation in a digital world. Ph.D. Dissertation. Massachusetts Institute of Technology.","paperID":"None"},{"content":"danah boyd. 2014. It's Complicated: the Social Lives of Networked Teens. Yale University Press.","paperID":"None"},{"content":"Finn Brunton and Helen Nissenbaum. 2015. Obfuscation: A User's Guide for Privacy and Protest. Mit Press.","paperID":"None"},{"content":"David B Buller and Judee K Burgoon. 1996. Interpersonal deception theory. Communication theory 6, 3 (1996), 203--242.","paperID":"None"},{"content":"Judee K Burgoon, Roxanne Parrott, Beth A Le Poire, Douglas L Kelley, Joseph B Walther, and Denise Perry. 1989. Maintaining and restoring privacy through communication in different types of relationships. Journal of Social and Personal Relationships 6, 2 (1989), 131--158.","paperID":"None"},{"content":"Carl Camden, Michael T. Motley, and Ann Wilson. 1984. White lies in interpersonal communication: A taxonomy and preliminary investigation of social motivations. Western Journal of Speech Communication 48, 4 (1984), 309--325. DOI: http://dx.doi.org/10.1080/10570318409374167","paperID":"None"},{"content":"Elizabeth Anne Casale. 2015. Cryptocurrencies and the Anonymous Nature of Transactions on the Internet. Ph.D. Dissertation.","paperID":"None"},{"content":"Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, and James A. Landay. 2008. Activity Sensing in the Wild: A Field Trial of Ubifit Garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1797--1806. DOI: http://dx.doi.org/10.1145/1357054.1357335","paperID":"None"},{"content":"Judith Wagner DeCew. 1997. In pursuit of privacy: Law, ethics, and the rise of technology. Cornell University Press.","paperID":"None"},{"content":"Bella M DePaulo, Deborah A Kashy, Susan E Kirkendol, Melissa M Wyer, and Jennifer A Epstein. 1996. Lying in everyday life. Journal of personality and social psychology 70, 5 (1996), 979.","paperID":"None"},{"content":"Roger Dingledine, Nick Mathewson, and Paul Syverson. 2004. Tor: The second-generation onion router. Technical Report. DTIC Document.","paperID":"None"},{"content":"Maeve Duggan. 2015. Mobile Messaging and Social Media 2015. Pew Research Center (2015). http://www.pewinternet.org/2015/08/19/mobile-messagingand-social-media-2015/","paperID":"None"},{"content":"Anthony Dunne and Fiona Raby. 2013. Speculative everything: design, fiction, and social dreaming. MIT Press.","paperID":"None"},{"content":"Peter Eckersley. 2010. How unique is your web browser?. In Privacy Enhancing Technologies. Springer, 1--18.","paperID":"None"},{"content":"Mauricio S Featherman, Anthony D Miyazaki, and David E Sprott. 2010. Reducing online privacy risk to facilitate e-service adoption: the influence of perceived ease of use and corporate credibility. Journal of Services Marketing 24, 3 (2010), 219--229.","paperID":"None"},{"content":"Elizabeth Fife and Juan Orjuela. 2012. The privacy calculus: Mobile apps and user perceptions of privacy and security. International Journal of Engineering Business Management 5, 6 (2012), 7.","paperID":"None"},{"content":"Bill Gaver and Heather Martin. 2000. Alternatives: Exploring Information Appliances Through Conceptual Design Proposals. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, NY, NY, USA, 209--216. DOI: http://dx.doi.org/10.1145/332040.332433","paperID":"None"},{"content":"William Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. 5 (2003), 233--240. DOI: http://dx.doi.org/10.1145/642611.642653","paperID":"None"},{"content":"Nicholas Gilewicz and Francois Allard-Huver. 2012. Digital Parrhesia as a Counterweight to Astroturfing. Online Credibility and Digital Ethos: Evaluating Computer-Mediated Communication: Evaluating Computer-Mediated Communication (2012), 215.","paperID":"None"},{"content":"Herbert P Grice. 1970. Logic and conversation. na.","paperID":"None"},{"content":"Ceki Gulcu and Gene Tsudik. 1996. Mixing E-mail with Babel. In Network and Distributed System Security, 1996., Proceedings of the Symposium on. IEEE, 2--16.","paperID":"None"},{"content":"Jeff Hancock, Jeremy Birnholtz, Natalya Bazarova, Jamie Guillory, Josh Perlin, and Barrett Amos. 2009. Butler lies: awareness, deception and design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 517--526.","paperID":"None"},{"content":"Max Van Kleek, Dave Murray-Rust, Amy Guy, Daniel A Smith, and Nigel R Shadbolt. 2015. Self Curation, Social Partitioning, Escaping from Prejudice and Harassment: the Many Dimensions of Lying Online. In WebSci2015.","paperID":"None"},{"content":"Eugenia Kolivos and Anna Kuperman. 2012. Consumer law: Web of lies-legal implications of astroturfing. Keeping Good Companies 64, 1 (2012), 38.","paperID":"None"},{"content":"David Krane, Laura Light, and Diana Gravitch. 2002. Privacy on and off the Internet: What consumers want. Harris Interactive (2002).","paperID":"None"},{"content":"Ponnurangam Kumaraguru and Lorrie Faith Cranor. 2005. Privacy indexes: a survey of Westin's studies. (2005).","paperID":"None"},{"content":"Svenn Lindskold and Pamela S Walters. 1983. Categories for acceptability of lies. The Journal of Social Psychology 120, 1 (1983), 129--136.","paperID":"None"},{"content":"Shah Mahmood and Yvo Desmedt. 2012. Your Facebook deactivated friend or a cloaked spy. In Pervasive Computing and Communications Workshops (PERCOM Workshops), 2012 IEEE International Conference on. IEEE, 367--373.","paperID":"None"},{"content":"a. E. Marwick and d. boyd. 2010. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1 (July 2010), 114--133. DOI: http://dx.doi.org/10.1177/1461444810365313","paperID":"None"},{"content":"Steven a. McCornack. 1992. Information manipulation theory. Communication Monographs 59, 1 (1992), 1--16. DOI: http://dx.doi.org/10.1080/03637759209376245","paperID":"None"},{"content":"Miriam J Metzger. 2004. Privacy, trust, and disclosure: Exploring barriers to electronic commerce. Journal of Computer-Mediated Communication 9, 4 (2004), 00--00.","paperID":"None"},{"content":"Charles E Naquin, Terri R Kurtzberg, and Liuba Y Belkin. 2010. The finer points of lying online: e-mail versus pen and paper. The Journal of applied psychology 95, 2 (2010), 387--394. DOI: http://dx.doi.org/10.1037/a0018627","paperID":"None"},{"content":"Helen Nissenbaum. 2004. Privacy as contextual integrity. Washington law review 79, 1 (2004).","paperID":"None"},{"content":"Helen Nissenbaum. 2009. Privacy in context: Technology, policy, and the integrity of social life. Stanford University Press.","paperID":"None"},{"content":"Kate Raynes-Goldie. 2010. Aliases, creeping, and wall cleaning: Understanding privacy in the age of Facebook. First Monday 15, 1 (2010).","paperID":"None"},{"content":"Vincent Scarlata, Brian Neil Levine, and Clay Shields. 2001. Responder anonymity and anonymous peer-to-peer file sharing. In Network Protocols, 2001. Ninth International Conference on. IEEE, 272--280.","paperID":"None"},{"content":"Peter Schaar. 2010. Privacy by design. Identity in the Information Society 3, 2 (2010), 267--274.","paperID":"None"},{"content":"Omer Tene and Jules Polenetsky. 2012. To Track or Do Not Track: Advancing Transparency and Individual Control in Online Behavioral Advertising. Minn. JL Sci. & Tech. 13 (2012), 281.","paperID":"None"},{"content":"Ronny E Turner, Charles Edgley, and Glen Olmstead. 1975. Information control in conversations: Honesty is not always the best policy. Kansas Journal of Sociology (1975), 69--89.","paperID":"None"},{"content":"Wikipedia. 2015. Disinformation -- Wikipedia, The Free Encyclopedia. (2015). https://en.wikipedia.org/wiki/Disinformation [Online; accessed 15-Sept-2015].","paperID":"None"}],"abstract":"Deception is typically regarded as a morally impoverished choice. However, in the context of increasingly intimate, connected and ramified systems of online interaction, manipulating information in ways that could be considered deceptive is often necessary, useful, and even morally justifiable. In this study, we apply a speculative design approach to explore the idea of tools that assist in pro-social forms of online deception, such as those that conceal, distort, falsify and omit information in ways that promote sociality. In one-on-one semi-structured interviews, we asked 15 participants to respond to a selection of speculations, consisting of imagined tools that reify particular approaches to deception. Participants reflected upon potential practical, ethical, and social implications of the use of such tools, revealing a variety of ways such tools might one day encourage polite behaviour, support individual autonomy, provide a defence against privacy intrusions, navigate social status asymmetries, and even promote more open, honest behaviour.","title":"Computationally Mediated Pro-Social Deception","filename":"CHI16/p552","authors":["Max Van Kleek","Dave Murray-Rust","Amy Guy","Kieron O'Hara","Nigel Shadbolt"],"conference":"CHI '16"}