{"paperId":2858160,"citation":[],"abstract":"This paper presents an investigation of how the Scottish electorate utilised photo-sharing on social media as a means of participation in the democratic process and for political self-expression in the periods immediately prior to two recent major democratic votes: the 2014 Scottish independence referendum, and the 2015 UK general election. We extend previous HCI literature on the growing use of social media in a political context and contribute specifically on understanding the emergent use of visual media by citizens when engaging with political issues and democratic process. Through a qualitative analysis of images shared on the platform Instagram, we demonstrate that the Scottish electorate did indeed used image-sharing for political self-expression -- posting a variety of visual content, representative of a diversity of political opinion. We conclude that users utilised Instagram as a platform to craft and present their \"political selves\". We raise questions for future research around power and inequality on such platforms as well as their capability of providing a persistent forum for debate.","reference":[{"content":"Nazanin Andalibi, Pinar Ozturk and Andrea Forte. Depression-Related Imagery on Instagram. 2015. In Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing. 231--234.","paperID":"None"},{"content":"Saeideh Bakhshi, David A. Shamma and Eric Gilbert. 2014. Faces Engage Us: Photos with Faces Attract More Likes and Comments on Instagram. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 965--974.","paperID":"None"},{"content":"Adam Barry. 2015. Alcohol Industry Advertising Practices on Social Media: A Case Study of Instagram. 143rd APHA Annual Meeting and Exposition.","paperID":"None"},{"content":"Jody C. Baumgartner, and Jonathan S. Morris. 2009. MyFaceTube Politics: Social Networking Web Sites and Political Engagement of Young Adults. Social Science Computer Review. 1--21.","paperID":"None"},{"content":"BBC News Online. 2014. Osborne's Tax Summary Dismissed as Propaganda by the TUC. Retrieved 24th September 2015 from http://www.bbc.co.uk/ news/business-29871522","paperID":"None"},{"content":"Victoria E. Bonnell. Iconography of Power: Soviet Political Posters under Lenin and Stalin. University of California Press.","paperID":"None"},{"content":"Ted Brader. 2006. Campaigning for Hearts and Minds: How Emotional Appeals in Political Ads Work. University of Chicago Press.","paperID":"None"},{"content":"Jenny Bronstein. 2013. Like Me! Analyzing the 2012 Presidential Candidates' Facebook Pages. Online Information Review. 37 (2). 173--192.","paperID":"None"},{"content":"Phil Brooker, John Vines, Selina Sutton, Julie Barnett, Tom Feltwell, and Shaun Lawson. Debating Poverty Porn on Twitter: Social Media as a Place for Everyday Socio-Political Talk. 2015. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, USA. 3177--3186.","paperID":"None"},{"content":"Stevie Chancellor, Zhiyuan Lin, Erica L. Goodman, Stephanie Zerwas and Munmun De Choudhury. 2016. Quantifying and Predicting Mental Illness Severity in Online Pro-Eating Disorder Communities. In Proceedings of CSCW 2016.","paperID":"None"},{"content":"David Clark-Carter. 2010. Quantitative Psychological Research. Psychology Press.","paperID":"None"},{"content":"Derrick L. Cogburn & Fatima K. Espinoza-Vasquez. 2011. From Networked Nominee to Networked Nation: Examining the Impact of Web 2.0 and Social Media on Political Participation and Civic Engagement in the 2008 Obama Campaign. Journal of Political Marketing. 10, 1--2.","paperID":"None"},{"content":"Michael Cornfield and Lee Rainie. 2006. The Impact of the Internet on Politics. Pew Internet & American Life Project. 1--5.","paperID":"None"},{"content":"Clara Crivellaro, Rob Comber, John Bowers, Peter Wright and Patrick Olivier. 2014. A Pool of Dreams: Facebook, Politics and the Emergence of a Social Movement. Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). 3573--3582.","paperID":"None"},{"content":"Peter Dahlgren. 2005. The Internet, Public Spheres, and Political Communication: Dispersion and Deliberation. Political Communication. 22 (2). 147--162.","paperID":"None"},{"content":"John W. Delicath, and Kevin Michael DeLuca. 2003. Image Events, The Public Sphere, and Argumentative Practice: The Case of Radical Environmental Groups. Argumentation 17, 3: 315--333.","paperID":"None"},{"content":"Kevin Michael DeLuca. 2005. Image Politics: The New Rhetoric of Environmental Activism. Psychology Press.","paperID":"None"},{"content":"Daniela V. Dimitrova and Dianne Bystrom. 2013. The Effects of Social Media on Political Participation and Candidate Image Evaluations in the 2012 Iowa Caucuses. American Behavioral Scientist. SAGE.","paperID":"None"},{"content":"Daniela V. Dimitrova, Adam Shehata, Jesper Strömbäck, and Lars. W. Nord. 2011. The Effects of Digital Media on Political Knowledge and Participation in Election Campaigns. Communication Research.","paperID":"None"},{"content":"Nicole Doerr, and Simon Teune. Visual Codes in Movements. When the Protest Imagery Hits the Establishment. European Protest Movements. 157--169.","paperID":"None"},{"content":"Nina Eliasoph. 1990. Political Culture and the Presentation of a Political Self. Theory and Society. 19 (4), 465--494.","paperID":"None"},{"content":"Jon Elster. 1998. Deliberative Democracy. Cambridge University Press.","paperID":"None"},{"content":"Edward Erikson. 2008. \"Hillary is My Friend\": MySpace and Political Fandom. Rocky Mountain Communication Review. 4 (2). 3--16.","paperID":"None"},{"content":"Tom Feltwell, Jamie Mahoney and Shaun Lawson. 2015. \"Aye, Have a Dream #IndyRef\": Use of Instagram during the Scottish Referendum. In Proceedings of the 2015 British HCI Conference. 267--268.","paperID":"None"},{"content":"Natalie Fenton, Veronica Barassi. 2011. Alternative Media and Social Networking Sites: The Politics of Individuation and Political Participation. The Communication Review. 14 (3), 179--196.","paperID":"None"},{"content":"Catherine Flood. 2012. British Posters. Advertising, Art & Activism. V&A Publishing.","paperID":"None"},{"content":"Nancy Fraser. 1990. Rethinking the Public Sphere: A Contribution to the Critique of Actually Existing Democracy. Social Text. 56--80","paperID":"None"},{"content":"Daniel Gayo-Avello. 2015. Social Media, Democracy, and Democratization. IEEE Multimedia. 22, 2. 10--16.","paperID":"None"},{"content":"Martin Gibbs, James Meese, Michael Arnold, Bjorn Nansen and Marcus Carter. 2015. #Funeral and Instagram: Death, Social Media, and Platform Vernacular. Information, Communication & Society. 18 (3), 255--268.","paperID":"None"},{"content":"Todd Graham and Scott Wright. 2014. Analysing 'Super-Participation' in Online Third Spaces. In Analyzing Social Media Data and Web Networks","paperID":"None"},{"content":"Paolo Gerbaudo. 2012. Tweets and the Streets: Social Media and Contemporary Activism. Pluto Press.","paperID":"None"},{"content":"Rachel K Gibson. 2015. Part Change, Social Media and the Rise of 'Citizen-Initiated' Campaigning. Party Politics. 21 (2). 183--197.","paperID":"None"},{"content":"Homeroa Gil de Zúñiga. 2012. Social Media Use for New and Individuals' Social Capital, Civic Engagement and Political Participations. Journal of ComputerMediated Communication. 17. 319--336.","paperID":"None"},{"content":"Homero Gil de Zúñiga, Aaron Veenstra, Emily Vraga and Dhavan Shah. 2010. Digital Democracy: Reimagining Pathways to Political Participation. Journal of Information Technology & Politics. 7, 1. 3651.","paperID":"None"},{"content":"Carlo Ginzburg. 2001. 'Your Country Needs You': a Case Study in Political Iconography. History Workshop Journal. 52: 1--22.","paperID":"None"},{"content":"G. Thomas Goodnight. 1999. The Personal, Technical, and Public Spheres of Argument. Contemporary Rhetorical Theory: A Reader. Guiliford Press. NY.","paperID":"None"},{"content":"Trischa Goodnow. 2013. Facing Off: A Comparative Analysis of Obama and Romney Facebook Timeline Photographs. American Behavioral Scientist. SAGE.","paperID":"None"},{"content":"Jacob Groshek and Ahmed Al-Rawi. Public Sentiment and Critical Framing in Social Media Content During the 2012 U.S. Presidential Campaign. Social Science Computer Review.","paperID":"None"},{"content":"Vassia Gueorguieva. 2008. Votes, MySpace, and YouTube. The Impact of Alternative Communication Channels on the 2006 Election Cycle and Beyond. Social Science Computer Review. 26 (3). 288--300.","paperID":"None"},{"content":"Nils Gustafsson. 2012. The Subtle Nature of Facebook Politics: Swedish Social Network Site Users and Political Participation. New Media & Society. 14. 11111127.","paperID":"None"},{"content":"Jürgen Habermas. 1991. The Structural Transformation of the Public Sphere. An Inquiry into a Category of Bourgeois Society. MIT Press.","paperID":"None"},{"content":"Eszter Hargittai and Aaron Shaw. 2013. Digitally Savvy Citizenship: The Role of Internet Skills and Engagement in Young Adults' Political Participation around the 2008 Presidential Election. Journal of Broadcasting & Electronic Media. 57 (2). 115--134.","paperID":"None"},{"content":"Martin Harrop. 2001. An Apathetic Landslide: The British General Election of 2001. Government and Opposition. 36 (03). 295--313.","paperID":"None"},{"content":"John Hartley. 1992. The Politics of Pictures: The Creation of the Public in the Age of Popular Media. Psychology Press.","paperID":"None"},{"content":"Gerry Hassan, Eleanor Yule, Cat Boyd, and Anni Pues. 2015. Scotland's Road to the Future. Soundings. 59 (59). 23--40.","paperID":"None"},{"content":"Gerard A. Hauser and Erin Daina McClellan. 2009. Vernacular Rhetoric and Social Movements: Performances of Resistance in the Rhetoric of the Everyday. In Active Voices. Composing a Rhetoric for Social Movements, Sharon McKenzie Stevens and Patricia M. Malesh (eds). State University of NY Press, Albany. 23--46.","paperID":"None"},{"content":"Bernie Hogan. 2010. The Presentation of Self in the Age of Social Media: Distinguishing Performances and Exhibitions Online. Bulletin of Science, Technology and Society. 0270467610385893.","paperID":"None"},{"content":"Steven Holiday, Matthew J. Lewis and Jack L. LaBaugh. 2015. Are You Talking to Me? The Socio-Political Visual Rhetoric of the Syrian Presidency's Instagram Account. Southwestern Mass Communication Journal. 30. 2.","paperID":"None"},{"content":"Yuheng Hu, Lydia Manikonda and Subbarao Kambhampati. 2014. What We Instagram: A First Analysis of Instagram Photo Content and User Types. Proceedings of ICWSM 2014.","paperID":"None"},{"content":"Instagram. Tag Endpoints. Available at: https://instagram.com/developer/endpoints/tags/#get_ta gs_media_recent","paperID":"None"},{"content":"Instagram. Celebrating a Community of 400 Million. Available at: http://blog.instagram.com/post/ 129662501137/150922-400million","paperID":"None"},{"content":"Jin Yea Jang, Kyungsik Han, Patrick C. Shih, and Dongwon Lee. Generation Like: Comparative Characteristics on Instagram. Proceedings of the 33rd annual ACM conference on Human factors in computing systems (CHI '15). 4039--4042.","paperID":"None"},{"content":"Tabitha James, Lara Khansa, Deborah Cook and Divakaran Liginlal. 2011. Technology and US Politics. Technology and Society Magazine. 30, 1. 20--27.","paperID":"None"},{"content":"Jeffrey J. Juris. 2012. Reflections on #Occupy Everywhere: Social Media, Public Space, and Emerging Logics of Aggregation. American Ethnologist. 39 (2). 259--279.","paperID":"None"},{"content":"Chante Karimkhani, Jessica Connett, Lindsay Boyers, Tyler Quest, Robert P. Dellavalle. 2014. Dermatology on Instagram. Dermatology Online Journal. 20 (7).","paperID":"None"},{"content":"Kate Kenski and Natalie Jomini Stroud. 2006. Connections between Internet Use and Political Efficacy, Knowledge and Participation. Journal of Broadcasting & Electronic Media. 173--192","paperID":"None"},{"content":"Lina Khatib. 2012. Image Politics in the Middle East: The Role of the Visual in Political Struggle. IB Tauris.","paperID":"None"},{"content":"Richard H. Kimberlee. 2002. Why Don't British Young People Vote at General Elections? Journal of Youth Studies. 5 (1). 85--98.","paperID":"None"},{"content":"Ayelet Kohn. 2015. Instagram as a Naturalized Propaganda Tool. The Israel Defense Forces Web Site and the Phenomenon of Shared Values. Convergence: The International Journal of Research into New Media Technologies.","paperID":"None"},{"content":"Sanne Kruikemeier, Guda van Noort, Rens Vliegenthart and Claes H de Vreese. 2013. Getting Closer: The Effects of Personalized and Interactive Online Political Communication. Europeans Journal of Communication.","paperID":"None"},{"content":"Richard J. Landis and Gary G. Koch. 1977. The Measurement of Observer Agreement for Categorical Data. Biometrics. 159--174.","paperID":"None"},{"content":"Kevin Lewis, Kurt Gray, and Jens Meierhenrich. 2014. The Structure of Online Activism. Sociological Science. 1--9.","paperID":"None"},{"content":"Merlyna Lim. Clicks, Cabs, and Coffee Houses: Social Media and Oppositional Movements in Egypt, 20042011. Journal of Communication 62: 231--248.","paperID":"None"},{"content":"Peter Lynch. 2015. Bottom-Up Versus Top-Down Campaigning at the Scottish Independence Referendum 2014. French Journal of British Studies.","paperID":"None"},{"content":"Jose Marichal. 2013. Political Facebook Groups: MicroActivism and the Digital Front Stage. First Monday. 18 (12).","paperID":"None"},{"content":"Hazel Markus and Paula Nurius. 1986. Possible Selves. American Psychologist. 41 (9). 954--969.","paperID":"None"},{"content":"Elaine Massung, David Coyle, Kirsten Cater, Marc Jay, and Chris Preist. 2013. Using Crowdsourcing to Support Pro-Environmental Community Activism. Proceedings of the 31st annual ACM conference on Human factors in computing systems (CHI '13). 371--380.","paperID":"None"},{"content":"Alice Mattoni, and Simon Teune. 2014. Visions of Protest. A Media-Historic Perspective on Images in Social Movements. Sociology Compass 8, 6: 876--887.","paperID":"None"},{"content":"Bo Nilsson and Eric Carlsson. 2014. Swedish Politicians and New Media: Democracy, Identity and Populism in a Digital Discourse. New Media & Society. 16 (4). 655--671.","paperID":"None"},{"content":"Elif Yolbulan Okan, Ayper Topcu and Serhat Akyuz. 2014. The Role of Social Media in Political Marketing: 2014 Local Elections of Turkey. European Journal of Business and Management. 6 (22), 131--140.","paperID":"None"},{"content":"Katy Parry. 2015. Visibility and Visualities: 'Ways of Seeing' Politics in the Digital Media Environment. In Handbook of Digital Politics, Stephen Coleman and Deen Freelon (eds). Elgar, UK, 417--432.","paperID":"None"},{"content":"Sarah Pedersen, Graeme Baxter, Simon Burnett, Ayse Göker, David Corney, and Carlos Martin. 2015. Backchannel Chat: Peaks and Troughs in a Twitter Response to Three Televised Debates during the 2014 Scottish Independence Referendum Campaign. In CeDEM15: Conference for E-Democracy and Open Government. 105--117.","paperID":"None"},{"content":"Natalie Pennington, Kelly L. Winfrey, Benjamin R. Warner, and Michael W. Kearney. 2015. Liking Obama and Romney (on Facebook) : An Experimental Evaluation of Political Engagement and Efficacy during the 2012 General Election. Computers in Human Behavior. 44. 279--283.","paperID":"None"},{"content":"Stephen Quinlan, Mark Shepherd, and Lindsay Paterson. Online Discussion and the 2014 Scottish independence referendum: Flaming Keyboards or Forums for Deliberation? Electoral Studies. 38. 192--205.","paperID":"None"},{"content":"Ellen Quintelier and Sara Vissers. 2008. The Effect of Internet Use of Political Participation: An Analysis of Survey Results for 16-Year Olds in Belgium. Social Science Computer Review. Feb 2008. 411--427.","paperID":"None"},{"content":"Lee Rainie and Aaron Smith. 2012. Politics on Social Networking Sites. Pew Research Center Internet and American Life Project.","paperID":"None"},{"content":"Iris Rogoff. 1998. Studying Visual Culture. In Visual Culture Reader, Nicholas Mirzoeff (ed). Routledge: NY. 14--27","paperID":"None"},{"content":"Jerry Saltz. Art at Arm's Length: A History of the Selfie. NY Magazine 47, 2: 71--75.","paperID":"None"},{"content":"Bryan Semaan, Heather Faucett, Scott P. Robertson, Misa Maruyama and Sara Douglas. 2015a. Designing Political Deliberation Environments to Support Interactions in the Public Sphere. Proceedings of the 33rd annual ACM conference on Human factors in computing systems (CHI '15). 3167--3176.","paperID":"None"},{"content":"Bryan Semaan, Heather Faucett, Scott P. Robertson, Misa Maruyama and Sara Douglas. 2015b. Navigating Imagined Audiences: Motivations for Participating in the Online Public Sphere. Proceedings of the 33rd annual ACM conference on Human factors in computing systems (CHI '15). 1158--1169.","paperID":"None"},{"content":"Dhavan V. Shah, Nojin Kwak and R. Lance Holbert. 2001. \"Connecting\" and \"Disconnecting\" With Civic Life: Patterns of Internet Use and the Production of Social Capital. Political Communication. 18: 141--162. Taylor and Francis.","paperID":"None"},{"content":"Pavica Sheldon and Katherine Bryant. 2016. Instagram: Motives for its Use and Relationship to Narcissism and Contextual Age. Computers in Human Behavior. 58, 89--97.","paperID":"None"},{"content":"Eli Skogerbo and Arne H. Krumsvik. 2015. Newspapers, Facebook and Twitter. Intermedial Agenda Setting in Local Election Campaigns. Journalism Practice. 9 (3), 350 --366.","paperID":"None"},{"content":"Flavio Souza, Diego de Las Casas, Vinicius Flores, SunBum Youn, Meeyoung Cha, Daniele Quercia and Virgilio Almeida. 2015. Dawn of the Selfie Era: The Whos, Wheres and Hows of Selfies on Instagram. In Proceedings of the 2015 ACM Conference on Online Social Networks. 221--231.","paperID":"None"},{"content":"Jakob Svensson. 2012. Negotiating the Political Self on Social Media Platforms: An In-Depth Study of ImageManagement in an Election-Campaign in a Multi-Party Democracy. eJournal of eDemocracy & Open Government 4, 2: 183--197","paperID":"None"},{"content":"Andrew Tickell. 2014. Regulating #IndyRef: Social Media and the Scottish Independence Referendum Act 2013. Edinburgh Law Review 18, 3: 406--410.","paperID":"None"},{"content":"Emma Tonkin, Heather D Pfeiffer, and Greg Tourte. 2011. Twitter, Information Sharing and the London Riots. Bulletin of the American Society for Information Science and Technology 38, 2: 49--57","paperID":"None"},{"content":"Karen Tracy and Jessica S. Robles. 2013. Everyday Talk: Building and Reflecting Identities. Guildford Press.","paperID":"None"},{"content":"Theo van Leeuwen and Carey Jewitt, eds. 2001. The Handbook of Visual Analysis. Sage.","paperID":"None"},{"content":"Volker Wulf, Konstantin Aal, Ibrahim Abu Kteish, Meryem Atam, Kai Schubert, Markus Rohde, George P. Yerousis, and David Randall. 2013. Fighting against the wall: social media use by political activists in a Palestinian village. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1979--1988","paperID":"None"},{"content":"Shanyang Zhao, Sherri Grasmuck and Jason Martin. 2008. Identity Construction on Facebook: Digital Empowerment in Anchored Relationships. Computers in Human Behavior. 24, 1816--1836.","paperID":"None"}],"title":"Constructing the Visual Online Political Self: An Analysis of Instagram Use by the Scottish Electorate","filename":"CHI16/p3339","authors":["Jamie Mahoney","Tom Feltwell","Obinna Ajuruchi","Shaun Lawson"],"conference":"CHI '16"}