{"paperId":2858329,"citation":[],"reference":[{"content":"Daniel G Aliaga, Yu Hong Yeung, Alvin Law, Behzad Sajadi, and Aditi Majumder. 2012. Fast high-resolution appearance editing using superimposed projections. ACM Transactions on Graphics (TOG) 31, 2 (2012), 13.","paperID":"None"},{"content":"Kuwahara Asai, Sakata Lacroix, Koyaku Kobayashi, Yamato Noda, Hiraoka Nakamura, and Doi Nagashio. 2014. \"Face Hacking. (2014). http://www.face-hacking.com","paperID":"None"},{"content":"Deepak Bandyopadhyay, Ramesh Raskar, and Henry Fuchs. 2001. Dynamic shader lamps: Painting on movable objects. In Augmented Reality, 2001. Proceedings. IEEE and ACM International Symposium on. IEEE, 207--216.","paperID":"None"},{"content":"Hrvoje Benko, Ricardo Jota, and Andrew Wilson. 2012. MirageTable: freehand interaction on a projected augmented reality tabletop. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 199--208.","paperID":"None"},{"content":"Hrvoje Benko, Andrew D Wilson, Federico Zannier, and Hrvoje Benko. 2014. Dyadic projected spatial augmented reality. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 645--655.","paperID":"None"},{"content":"Paul J Besl and Neil D McKay. 1992. Method for registration of 3-D shapes. In Robotics-DL tentative. International Society for Optics and Photonics, 586--606.","paperID":"None"},{"content":"Robert Bridson. 2007. Fast Poisson disk sampling in arbitrary dimensions. In ACM SIGGRAPH, Vol. 2007. ACM, 5.","paperID":"None"},{"content":"Daniel Cotting, Martin Naef, Markus Gross, and Henry Fuchs. 2004. Embedding imperceptible patterns into projected images for simultaneous acquisition and display. In Mixed and Augmented Reality, 2004. ISMAR 2004. Third IEEE and ACM International Symposium on. IEEE, 100--109.","paperID":"None"},{"content":"Ali O Ercan, Abbas El Gamal, and Leonidas J Guibas. 2013. Object tracking in the presence of occlusions using multiple cameras: A sensor network approach. ACM Transactions on Sensor Networks (TOSN) 9, 2 (2013), 16.","paperID":"None"},{"content":"Vincent Gay-Bellile, Adrien Bartoli, and Patrick Sayd. 2010. Direct estimation of nonrigid registrations with image-based self-occlusion reasoning. Pattern Analysis and Machine Intelligence, IEEE Transactions on 32, 1 (2010), 87--104.","paperID":"None"},{"content":"Chris Harrison, Hrvoje Benko, and Andrew D Wilson. 2011. OmniTouch: wearable multitouch interaction everywhere. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 441--450.","paperID":"None"},{"content":"Robert Held, Ankit Gupta, Brian Curless, and Maneesh Agrawala. 2012. 3D puppetry: a kinect-based interface for 3D animation.. In UIST. Citeseer, 423--434.","paperID":"None"},{"content":"David Holman, Roel Vertegaal, Mark Altosaar, Nikolaus Troje, and Derek Johns. 2005. Paper windows: interaction techniques for digital paper. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 591--599.","paperID":"None"},{"content":"Shahram Izadi, David Kim, Otmar Hilliges, David Molyneaux, Richard Newcombe, Pushmeet Kohli, Jamie Shotton, Steve Hodges, Dustin Freeman, Andrew Davison, and others. 2011. KinectFusion: real-time 3D reconstruction and interaction using a moving depth camera. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 559--568.","paperID":"None"},{"content":"Tyler Johnson and Henry Fuchs. 2007. Real-time projector tracking on complex geometry using ordinary imagery. In Computer Vision and Pattern Recognition, 2007. CVPR'07. IEEE Conference on. IEEE, 1--8.","paperID":"None"},{"content":"Andreas Jordt and Reinhard Koch. 2013. Direct model-based tracking of 3d object deformations in depth and color video. International journal of computer vision 102, 1--3 (2013), 239--255.","paperID":"None"},{"content":"Shingo Kagami and Koichi Hashimoto. 2015. Sticky projection mapping: 450-fps tracking projection onto a moving planar surface. In SIGGRAPH Asia 2015 Emerging Technologies. ACM, 23.","paperID":"None"},{"content":"Mohammadreza Khalilbeigi, Roman Lissermann, Wolfgang Kleine, and Jurgen Steimle. 2012. FoldMe: interacting with double-sided foldable displays. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction. ACM, 33--40.","paperID":"None"},{"content":"Mohammadreza Khalilbeigi, Roman Lissermann, Max Muhlhauser, and Jurgen Steimle. 2011. Xpaaand: interaction techniques for rollable displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2729--2732.","paperID":"None"},{"content":"Alvin J Law, Daniel G Aliaga, Behzad Sajadi, Aditi Majumder, and Zygmunt Pizlo. 2011. Perceptually based appearance modification for compliant appearance editing. In Computer Graphics Forum, Vol. 30. Wiley Online Library, 2288--2300.","paperID":"None"},{"content":"Johnny C Lee, Scott E Hudson, and Edward Tse. 2008. Foldable interactive displays. In Proceedings of the 21st annual ACM symposium on User interface software and technology. ACM, 287--290.","paperID":"None"},{"content":"David G Lowe. 1999. Object recognition from local scale-invariant features. In Computer vision, 1999. The proceedings of the seventh IEEE international conference on, Vol. 2. Ieee, 1150--1157.","paperID":"None"},{"content":"David Molyneaux, Hans Gellersen, and Joe Finney. 2013. Cooperative augmentation of mobile smart objects with projected displays. ACM Transactions on Interactive Intelligent Systems (TiiS) 3, 2 (2013), 7.","paperID":"None"},{"content":"Daniel Moreno and Gabriel Taubin. 2012. Simple, accurate, and robust projector-camera calibration. In 3D Imaging, Modeling, Processing, Visualization and Transmission (3DIMPVT), 2012 Second International Conference on. IEEE, 464--471.","paperID":"None"},{"content":"Richard A Newcombe, Dieter Fox, and Steven M Seitz. 2015. DynamicFusion: Reconstruction and Tracking of Non-rigid Scenes in Real-Time. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 343--352.","paperID":"None"},{"content":"Richard A Newcombe, Shahram Izadi, Otmar Hilliges, David Molyneaux, David Kim, Andrew J Davison, Pushmeet Kohi, Jamie Shotton, Steve Hodges, and Andrew Fitzgibbon. 2011. KinectFusion: Real-time dense surface mapping and tracking. In Mixed and augmented reality (ISMAR), 2011 10th IEEE international symposium on. IEEE, 127--136.","paperID":"None"},{"content":"Kohei Okumura, Hiromasa Oku, and Masatoshi Ishikawa. 2012. Lumipen: Projection-based mixed reality for dynamic objects. In Multimedia and Expo (ICME), 2012 IEEE International Conference on. IEEE, 699--704.","paperID":"None"},{"content":"Christoph Resch, Peter Keitler, and Gudrun Klinker. 2014. Sticky projections: a new approach to interactive shader lamp tracking. In Mixed and Augmented Reality (ISMAR), 2014 IEEE International Symposium on. IEEE, 151--156.","paperID":"None"},{"content":"Szymon Rusinkiewicz and Marc Levoy. 2001. Efficient variants of the ICP algorithm. In 3-D Digital Imaging and Modeling, 2001. Proceedings. Third International Conference on. IEEE, 145--152.","paperID":"None"},{"content":"Behzad Sajadi, Mahdi Abbaspour Tehrani, Mehdi Rahimzadeh, and Aditi Majumder. 2015. High-resolution lighting of 3D reliefs using a network of projectors and cameras. In 3DTV-Conference: The True Vision-Capture, Transmission and Display of 3D Video (3DTV-CON), 2015. IEEE, 1--4.","paperID":"None"},{"content":"Christian Siegl, Matteo Colaianni, Lucas Thies, Justus Thies, Michael Zollhofer, Shahram Izadi, Marc Stamminger, and Frank Bauer. 2015. Real-time pixel luminance optimization for dynamic multi-projection mapping. ACM Transactions on Graphics (TOG) 34, 6 (2015), 237.","paperID":"None"},{"content":"Martin Spindler and Raimund Dachselt. 2009. PaperLens: advanced magic lens interaction above the tabletop. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces. ACM, 7.","paperID":"None"},{"content":"Jurgen Steimle, Andreas Jordt, and Pattie Maes. 2013. Flexpad: highly flexible bending interactions for projected handheld displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 237--246.","paperID":"None"},{"content":"Jay Summet and Rahul Sukthankar. 2005. Tracking locations of moving hand-held displays using projected light. In Pervasive Computing. Springer, 37--46.","paperID":"None"},{"content":"Junchen Wang, Hiromichi Suenaga, Keika Hoshi, Liangjing Yang, Etsuko Kobayashi, Ichiro Sakuma, and Hongen Liao. 2014. Augmented reality navigation with automatic marker-free image registration using 3-D image overlay for dental surgery. Biomedical Engineering, IEEE Transactions on 61, 4 (2014), 1295--1304.","paperID":"None"},{"content":"Andrew Wilson, Hrvoje Benko, Shahram Izadi, and Otmar Hilliges. 2012. Steerable augmented reality with the beamatron. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM, 413--422.","paperID":"None"},{"content":"Ruigang Yang and Greg Welch. 2001. Automatic and continuous projector display surface calibration using every-day imagery. In Proc. of 9th International Conf. in Central Europe in Computer Graphics, Visualization, and Computer Vision. Citeseer.","paperID":"None"},{"content":"Zhengyou Zhang. 2000. A flexible new technique for camera calibration. Pattern Analysis and Machine Intelligence, IEEE Transactions on 22, 11 (2000), 1330--1334.","paperID":"None"},{"content":"Feng Zheng, Ryan Schubert, and Greg Weich. 2013. A general approach for closed-loop registration in AR. In Virtual Reality (VR), 2013 IEEE. IEEE, 47--50.","paperID":"None"}],"abstract":"We introduce Pmomo (acronym of projection mapping on movable object), a dynamic projection mapping system that tracks the 6-DOF position of real-world object, and shades it with virtual 3D contents by projection. The system can precisely lock the projection on the moving object in real-time, even the one with complex geometry. Based on depth camera, we developed a novel and robust tracking method that samples the structure of the object into low-density point cloud, then performs an adaptive searching scheme for the registration procedure. As a fully interactive system, our method can handle both internal and external complex occlusions, and can quickly track back the object even when losing track. In order to further improve the realism of the projected virtual textures, our system innovatively culls occlusions away from projection, which is achieved by a facet-covering method. As a result, the Pmomo system enables the possibility of new interactive Augmented Reality applications that require high-quality dynamic projection effect.","title":"Pmomo: Projection Mapping on Movable 3D Object","filename":"CHI16/p781","authors":["Yi Zhou","Shuangjiu Xiao","Ning Tang","Zhiyong Wei","Xu Chen"],"conference":"CHI '16"}