{"paperId":2858206,"citation":[],"reference":[{"content":"Alexander T. Adams, Jean Costa, Malte F. Jung, and Tanzeem Choudhury. 2015. Mindless computing: designing technologies to subtly influence behavior. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 719--730. DOI=http://dx.doi.org/10.1145/2750858.2805843","paperID":"None"},{"content":"Eytan Adar, Desney S. Tan, and Jaime Teevan. 2013. Benevolent deception in human computer interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI '13). ACM, New York, NY, USA, 1863--1872. DOI=http://dx.doi.org/10.1145/2470654.2466246","paperID":"None"},{"content":"Albert Bandura and David C. McClelland. 1977. Social learning theory. Prentice-Hall Englewood Cliffs, NJ. DOI=http://dx.doi.org/10.2307/2065952","paperID":"None"},{"content":"Richard Bartle. 1996. Hearts, clubs, diamonds, spades: Players who suit MUDs. Journal of MUD research 1, 19.","paperID":"None"},{"content":"David A. Bergin. 1999. Influences on classroom interest. In Educational psychologist 34, 2, 87--98. Taylor & Francis. DOI=http://dx.doi.org/10.1207/s15326985ep3402_2","paperID":"None"},{"content":"Lucas Blair. 2011. The use of video game achievements to enhance player performance, self-efficacy, and motivation. University of Central Florida Orlando, Florida.","paperID":"None"},{"content":"Jason T. Bowey, Max V. Birk, and Regan L. Mandryk. 2015. Manipulating Leaderboards to Induce Player Experience. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, New York, NY, USA, 115--120. DOI=http://dx.doi.org/10.1145/2793107.2793138","paperID":"None"},{"content":"Sunny Consolvo, Predrag Klasnja, David W. McDonald, and James A. Landay. 2009. Goal-setting considerations for persuasive technologies that encourage physical activity. In Proceedings of the 4th International Conference on Persuasive Technology (Persuasive '09). ACM, New York, NY, USA, Article 8, 8 pages. DOI=http://dx.doi.org/10.1145/1541948.1541960","paperID":"None"},{"content":"E. L. Deci, R. M. Ryan. 2005. Intrinsic motivation inventory (IMI). Retrieved July 23, 2006.","paperID":"None"},{"content":"Leon Festinger. 1954. A theory of social comparison processes. In Human relations 7, 2, 117--140. DOI=http://dx.doi.org/10.1177/001872675400700202","paperID":"None"},{"content":"Stephen Garcia, Avishalom Tor, Tyrone Schiff. 2013. The Psychology of Competition: A Social Comparison Perspective. In Perspectives on Psychological Science 8, 6, 634--650. Sage Publications. DOI=http://dx.doi.org/10.1177/1745691613504114","paperID":"None"},{"content":"Frederick X. Gibbons and Bram P. Buunk. 1999. Individual differences in social comparison: development of a scale of social comparison orientation. In Journal of personality and social psychology 76, 1, 129. American Psychological Association. DOI=http://dx.doi.org/10.1037/0022--3514.76.1.129","paperID":"None"},{"content":"F. Maxwell Harper, Joseph Konstan and Sherry Xin Li. 2010. Social comparisons and contributions to online communities: A field experiment on movielens. In The American economic review 1358--1398. JSTOR. DOI=http://dx.doi.org/10.1257/aer.100.4.1358","paperID":"None"},{"content":"Sasha Issenberg. October 31, 2012. The \"Voter Report Card\" MoveOn Hopes Will Shame Slackers. In Slate.com. Accessed July 23, 2015. Retrieved from http://www.slate.com/blogs/victory_lab/2012/10/31/mov eon_can_its_voter_report_card_shame_slackers_into_tu rning_out.html","paperID":"None"},{"content":"Daniel King, Paul Delfabbro and Mark Griffiths. 2010. Video game structural characteristics: A new psychological taxonomy. In International Journal of Mental Health and Addiction 8, 1, 90--106. Springer. DOI=http://dx.doi.org/10.1007/s11469-009--9206--4","paperID":"None"},{"content":"Robert E. Kraut, Paul Resnick, Sara Kiesler, Moira Burke, Yan Chen, Niki Kittur, Joseph Konstan, Yuqing Ren and John Riedl. 2012. Building successful online communities: Evidence-based social design. MIT Press.","paperID":"None"},{"content":"Fitbit. Retrieved from https://www.fitbit.com/","paperID":"None"},{"content":"Richard W. Robins, Holly M. Hendin and Kali H. Trzesniewski. 2001. Measuring global self-esteem: Construct validation of a single-item measure and the Rosenberg Self-Esteem Scale. In Personality and social psychology bulletin 27, 2, 151--161. Sage Publications. DOI=http://dx.doi.org/10.1177/0146167201272002","paperID":"None"},{"content":"Jen Shang and Rachel Croson. 2009. A field experiment in charitable contribution: The impact of social information on the voluntary provision of public goods. The Economic Journal 119, 540, 1422--1439. Wiley Online Library. DOI=http://dx.doi.org/10.1111/j.14680297.2009.02267.x","paperID":"None"},{"content":"Edward R. Tufte. The visual display of quantitative information. 2, 9, Graphics press Cheshire, CT. DOI=http://dx.doi.org/10.1016/0195--6663(91)90030-v","paperID":"None"},{"content":"Ladd Wheeler, René Martin and Jerry Suls. 1997. The proxy model of social comparison for self-assessment of ability. In Personality and Social Psychology Review 1, 1, 54--61. Sage Publications. DOI=http://dx.doi.org/10.1207/s15327957pspr0101_4","paperID":"None"}],"abstract":"Designers often make use of social comparisons to motivate people to perform better. In this paper, we present the concept of closeness to comparison to improve the efficacy of social comparison feedback. Specifically, we test two design strategies related to closeness: (1) comparing users to a target described as a similarly experienced player and (2) adjusting the visual representation of performance so player scores appear closer to the comparison target. We evaluate the effects of these strategies for social comparison on player performance in an online game. In a controlled experiment with 425 participants, both feedback techniques improved game performance, but only for experienced players. We conclude with design implications for helping designers create social comparisons that motivate higher game performance.","title":"Designing Closeness to Increase Gamers' Performance","filename":"CHI16/p3020","authors":["Lucas Colusso","Gary Hsieh","Sean A. Munson"],"conference":"CHI '16"}