{"paperId":2858446,"citation":[],"reference":[{"content":"Paul Atkinston. 2013. Delete: A Design History Of Computer Vapourware. Bloomsbury, London & NY.","paperID":"None"},{"content":"James Auger. 2013. Speculative design: crafting the speculation. Digital Creativity 24, 1: 11-35. http://doi.org/10.1080/14626268.2013.767276","paperID":"None"},{"content":"Mark Blythe and Elizabeth Buie. 2014. Chatbots of the Gods: Imaginary Abstracts for Techno Spirituality Research. Proc. NordiCHI 2014: 227-236. http://doi.org/10.1145/2639189.2641212","paperID":"None"},{"content":"Mark Blythe, Jamie Steane, Jenny Roe, and Caroline Oliver. 2015. Solutionism, the Game. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 3849-3858. http://doi.org/10.1145/2702123.2702491","paperID":"None"},{"content":"Mark Blythe. 2014. Research through design fiction. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 703-712. http://doi.org/10.1145/2556288.2557098","paperID":"None"},{"content":"Pam Briggs, Patrick Olivier, Mark Blythe, et al. 2012. Invisible design: exploring insights and ideas through ambiguous film scenarios. Proc. DIS 2012, 11-15. http://doi.org/10.1145/2317956.2318036","paperID":"None"},{"content":"Laura Buttrick and Conor Linehan. 2014. Fifty Shades of CHI: The Perverse and Humiliating Human-Computer Relationship. 825-833. http://doi.org/10.1145/2559206.2578874","paperID":"None"},{"content":"William Buxton. 2007. Sketching User Experiences - getting the design right and the right design. Morgan Kaufmann, Burlington.","paperID":"None"},{"content":"M. J. Carroll. 2000. Making Use: scenario based design of human - computer interactions. The MIT Press, Cambridge, Massachusetts.","paperID":"None"},{"content":"Larry Christensen. 1988. Deception in Psychological Research When is its Use Justified? Personality and Social Psychology Bulletin 14, 4: 664-675.","paperID":"None"},{"content":"Carl Disalvo. 2012. Spectacles and Tropes: Speculative Design and Contemporary Food Cultures. 20: 109-122.","paperID":"None"},{"content":"Paul Dourish and Genevieve Bell. 2014. \"Resistance is futile\": reading science fiction alongside ubiquitous computing. Personal and Ubiquitous Computing 18, 4: 769-778. http://doi.org/10.1007/s00779-013-0678--7","paperID":"None"},{"content":"Nick Foster. 2013. The Future Mundane. hellofosta.com. Retrieved October 7, 2014 from http://hellofosta.com/2013/10/07/the-futuremundane/","paperID":"None"},{"content":"Bill Gaver and John Bowers. 2012. Annotated Portfolios. Interactions 19, 4: 40-49.","paperID":"None"},{"content":"William Gaver. 2012. What should we expect from research through design? Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12: 937. http://doi.org/10.1145/2207676.2208538","paperID":"None"},{"content":"Rodrigo Freese Gonzatto, Frederick M. C. van Amstel, Luiz Ernesto Merkle, and Timo Hartmann. 2013. The ideology of the future in design fictions. Digital Creativity 24, 1: 36-45. http://doi.org/10.1080/14626268.2013.772524","paperID":"None"},{"content":"Erich Goode. 1996. The ethics of deception in social research: A case study. Qualitative Sociology 19, 1: 11-33. http://doi.org/10.1007/BF02393246","paperID":"None"},{"content":"Simon Grand and Martin Wiedmer. 2010. Design Fiction: A Method Toolbox for Design Research in a Complex World. Proceedings of the DRS 2010 conference: Design and Complexity.","paperID":"None"},{"content":"Derek Hales. 2013. Design fictions an introduction and provisional taxonomy. Digital Creativity 24, 1: 1-10.","paperID":"None"},{"content":"Felix Heibeck, Alexis Hope, and Julie Legault. 2014. Sensory Fiction: A Design Fiction of Emotional Computation. 35-40.","paperID":"None"},{"content":"Anab Jain. The Drone Aviary. Retrieved September 17, 2015 from http://www.superflux.in/blog/thedrone-aviary","paperID":"None"},{"content":"David Kirby. 2011. Lab Coats in Hollywood. The MIT Press, Cambridge and London.","paperID":"None"},{"content":"Ben Kirman, Conor Linehan, Shaun Lawson, and Dan O'Hara. 2013. CHI and the future robot enslavement of humankind: a retrospective. CHI '13 Extended Abstracts on Human Factors in Computing Systems on CHI EA '13: 2199. http://doi.org/10.1145/2468356.2468740","paperID":"None"},{"content":"Eva Knutz, Thomas Markussen, and Poul Rind Christensen. 2013. The Role of Fiction in Experiments within Design, Art & Architecture. Nordes 2013, July 2015: 341-348. http://doi.org/10.14434/artifact.v3i2.4045","paperID":"None"},{"content":"T.S. Kuhn. 1970. The Structure of Scientific Revolutions. University of Chicago Press, Chicago.","paperID":"None"},{"content":"Shaun Lawson, Ben Kirman, Conor Linehan, et al. 2015. Problematising Upstream Technology through Speculative Design: The Case of Quantified Cats and Dogs. 2663-2672.","paperID":"None"},{"content":"YK Lim and Erik Stolterman. 2008. The anatomy of prototypes: Prototypes as filters, prototypes as manifestations of design ideas. ACM Transactions on Computer-Human Interaction (TOCHI) 15, 2: 7:1-26.","paperID":"None"},{"content":"Rikard Lindell. 2014. Crafting interaction: The epistemology of modern programming. Personal and Ubiquitous Computing 18, 3: 613-624. http://doi.org/10.1007/s00779-013-0687--6","paperID":"None"},{"content":"Joseph Lindley and Paul Coulton. 2014. Modelling Design Fiction: What's The Story? StoryStorm Workshop at DIS 2014.","paperID":"None"},{"content":"Joseph Lindley and Paul Coulton. 2015. Back to the Future: 10 Years of Design Fiction. British HCI '15 Proceedings of the 2015 British HCI Conference, ACM, 210-211.","paperID":"None"},{"content":"Joseph Lindley and Paul Coulton. 2015. Game of Drones. Proceedings of the second ACM SIGCHI annual symposium on Computer-human interaction in play.","paperID":"None"},{"content":"Joseph Lindley and Robert Potts. 2014. A Machine. Learning: An example of HCI Prototyping With Design Fiction. Proceedings of the 8th Nordic Conference on Human Computer Interaction.","paperID":"None"},{"content":"Joseph Lindley. 2015. A pragmatics framework for design fiction. Proceedings of the European Academy of Design Conference.","paperID":"None"},{"content":"Conor Linehan, Ben J. Kirman, Stuart Reeves, et al. 2014. Alternate endings: using fiction to explore design futures. Proc. CHI EA '14: 45-48. http://doi.org/10.1145/2559206.2560472","paperID":"None"},{"content":"Thomas Markussen and Eva Knutz. 2013. The poetics of design fiction. Proceedings of the 6th International Conference on Designing Pleasurable Products and Interfaces DPPI '13: 231.","paperID":"None"},{"content":"Tim Maughan. 2013. Zero Hours. Medium.com | Nesta Future Londoner Workshop. Retrieved September 21, 2015 from https://medium.com/@timmaughan/zero-hoursf68f17e8c12a","paperID":"None"},{"content":"Eran May-Raz and Daniel Lazo. 2012. Sight. Retrieved October 27, 2014 from http://vimeo.com/46304267","paperID":"None"},{"content":"Evgeny Morozov. 2013. To Save Everything Click Here: Technology, Solutionism and the Urge to Fix Problems That Don't Exist. Allen Lane Penguin Books.","paperID":"None"},{"content":"Lene Nielsen. 2002. From user to character. Proceedings of the conference on Designing interactive systems processes, practices, methods, and techniques DIS '02, 99. http://doi.org/10.1145/778712.778729","paperID":"None"},{"content":"Nicholas Nova and Nancy Kwon. 2012. A Digital Tomorrow. Retrieved September 30, 2014 from http://vimeo.com/48204264","paperID":"None"},{"content":"D. A. Schön. 1992. Designing as reflective converstion with the materials of a design situation. Knowledge-Based Systems 5, 3-14.","paperID":"None"},{"content":"Bruce Sterling. 2005. Shaping Things. The MIT Press.","paperID":"None"},{"content":"Bruce Sterling. 2012. Bruce Sterling Explains the Intriguing New Concept of Design Fiction (Interview by Torie Bosch). Slate.com. Retrieved February 9, 2014 from http://www.slate.com/blogs/future_tense/2012/03/02/bruce_sterling_on_design_fictions_.html","paperID":"None"},{"content":"Bruce Sterling. 2013. Patently untrue: fleshy defibrillators and synchronised baseball are changing the future (Wired UK). Wired. Retrieved March 3, 2014 from http://www.wired.co.uk/magazine/archive/2013/10/ play/patently-untrue","paperID":"None"},{"content":"Superflux. Uninvited Guests. Retrieved September 17, 2015 from http://www.superflux.in/work/uninvited-guests","paperID":"None"},{"content":"Various. 2014. TBD Catalog (Vol.9, Issue 24). Near Future Laboratory.","paperID":"None"},{"content":"Tracee Vetting Wolf, Jennifer a. Rode, Jeremy Sussman, and Wendy a. Kellogg. 2006. Dispelling \"design\" as the black art of CHI. Proceedings of the SIGCHI conference on Human Factors in computing systems CHI '06, 521. http://doi.org/10.1145/1124772.1124853","paperID":"None"},{"content":"John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. Proceedings of the SIGCHI conference on Human factors in computing systems CHI '07: 493. http://doi.org/10.1145/1240624.1240704","paperID":"None"},{"content":"John Zimmerman, Erik Stolterman, and Jodi Forlizzi. 2010. An Analysis and Critique of Research through Design: towards a formalization of a research approach. Proceedings of DIS 2010.","paperID":"None"},{"content":"EmotiDog - A Quantified Pet Product. Retrieved September 17, 2015 from http://www.thequantifiedpet.com/emotidog/index.ht ml","paperID":"None"},{"content":"2012. Corner Convenience // The Near Future // Design Fiction | Near Future Laboratory. Near Future Laboratory. Retrieved October 15, 2014 from http://blog.nearfuturelaboratory.com/2012/03/04/corner-convenience-near-future-design-fiction/","paperID":"None"}],"abstract":"This paper considers how design fictions in the form of 'imaginary abstracts' can be extended into complete 'fictional papers'. Imaginary abstracts are a type of design fiction that are usually included within the content of 'real' research papers, they comprise brief accounts of fictional problem frames, prototypes, user studies and findings. Design fiction abstracts have been proposed as a means to move beyond solutionism to explore the potential societal value and consequences of new HCI concepts. In this paper we contrast the properties of imaginary abstracts, with the properties of a published paper that presents fictional research, Game of Drones. Extending the notion of imaginary abstracts so that rather than including fictional abstracts within a 'non-fiction' research paper, Game of Drones is fiction from start to finish (except for the concluding paragraph where the fictional nature of the paper is revealed). In this paper we review the scope of design fiction in HCI research before contrasting the properties of imaginary abstracts with the properties of our example fictional research paper. We argue that there are clear merits and weaknesses to both approaches, but when used tactfully and carefully fictional research papers may further empower HCI's burgeoning design discourse with compelling new methods.","title":"Pushing the Limits of Design Fiction: The Case For Fictional Research Papers","filename":"CHI16/p4032","authors":["Joseph Lindley","Paul Coulton"],"conference":"CHI '16"}