{"paperId":2858563,"citation":[],"reference":[{"content":"Sami Abuhamdeh and Mihaly Csikszentmihalyi. 2012. The Importance of Challenge for the Enjoyment of Intrinsically Motivated, Goal-Directed Activities. Personality and Social Psychology Bulletin 38, 3: 317330.","paperID":"None"},{"content":"Justin T. Alexander, John Sear, and Andreas Oikonomou. 2013. An investigation of the effects of game difficulty on player enjoyment. Entertainment Computing 4, 1: 53--62.","paperID":"None"},{"content":"Alexander Baldwin, Daniel Johnson, Peta Wyeth, and Penelope Sweetser. 2013. A framework of Dynamic Difficulty Adjustment in competitive multiplayer video games. In 2013 IEEE International Games Innovation Conference (IGIC), 16--19.","paperID":"None"},{"content":"Nicholas D. Bowman. 2008. A PAT on the Back: Media Flow Theory Revis(it)ed. Rocky Mountain Communication Review 4, 1: 27--39.","paperID":"None"},{"content":"Elizabeth A. Boyle, Thomas M. Connolly, Thomas Hainey and James M. Boyle. 2012. Engagement in digital entertainment games: A systematic review. Computers in Human Behavior 28, 3: 771--780.","paperID":"None"},{"content":"Tom Cole, Paul Cairns, and Marco Gillies. 2015. Emotional and Functional Challenge in Core and Avant-grade Games. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15), 121--126. http://dl.acm.org/citation.cfm?doid=2793107.2793147","paperID":"None"},{"content":"Anna L. Cox, Paul Cairns, Pari Shah, and Michael Carroll. 2012. Not Doing But Thinking: The Role of Challenge in the Gaming Experience. In Proceedings of the SIGCHI Conference on Humans Factors in Computing Systems (CHI '12), 79--88. http://dl.acm.org/citation.cfm?doid=2207676.2207689","paperID":"None"},{"content":"Mihaly Csikszentmihalyi. 1990. Flow: The Psychology of Optimal Experience. Harper Perennial.","paperID":"None"},{"content":"Edward L. Deci and Richard M. Ryan. 2000. The \"what\" and \"why\" of goal pursuits: Humans needs and the self-determination of behavior. Psychological Inquiry 11, 4: 227--268.","paperID":"None"},{"content":"Xiaowen Fang, Susy Chan, Jacek Brzezinski and Chitra Nair. 2010. Development of an Instrument to Measure Enjoyment of Computer Game Play. International Journal of Human-Computer Interaction 26, 9: 868--886.","paperID":"None"},{"content":"Carlton Fong, Diana Zaleski, and Jennifer Leach. 2014. The challenge-skill balance and antecedents of flow: a meta-analytic investigation. Journal of Positive Psychology 10, 5: 425--446.","paperID":"None"},{"content":"International Society for Presence Research. 2000. The Concept of Presence: Explication Statement. Retrieved September 18, 2015 from http://ispr.info/","paperID":"None"},{"content":"Charlene Jennett, Anna L. Cox, Paul Cairns, Samira Dhoparee, Andrew Epps, Tim Tijs and Alison Walton. 2008. Measuring and Defining the Experience of Immersion in Games. Internation Journal of Human-Computer Studies 66, 9: 641--661.","paperID":"None"},{"content":"Daniel M. Johnson and John Gardner. 2010. Personality, Motivation and Video Games. In 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction (OZCHI '10), 276--279. http://dl.acm.org/citation.cfm?doid=1952222.1952281","paperID":"None"},{"content":"Johannes Keller and Herbert Bless. 2008. Flow and regulatory compatibility: An experimental approach to the flow model of intrinsic motivation. Journal of Personality and Social Psychology Bulletin 34, 2: 196--209.","paperID":"None"},{"content":"Madison Klarkowski, Daniel Johnson, Peta Wyeth, Simon Smith, and Cody Phillips. 2015. Operationalising and Measuring Flow in Video Games. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15), 114--118. http://dl.acm.org/citation.cfm?doid=2838739.2838826","paperID":"None"},{"content":"Derek Lomas, Kishan Patel, Jodi L. Forlizzi, and Kenneth R. Koedinger. 2013. Optimizing Challenge in an Educational Game Using Large-Scale Design Experiments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 89--98. http://dl.acm.org/citation.cfm?doid=2470654.2470668","paperID":"None"},{"content":"Matthew Lombard and Theresa Ditton. At the Heart of It All: The Concept of Presence. 1997. Journal of Computer-Mediated Communication 3, 2: 0.","paperID":"None"},{"content":"Regan L. Mandryk and M. Stella Atkins. 2007. A fuzzy physiological approach for continuously modelling emotion during interaction with play technologies. International Journal of Human-Computer Studies 65, 4: 329--347.","paperID":"None"},{"content":"Lennart Nacke and Craig A. Lindley. 2008. Flow and immersion in first-person shooters: measuring the player's gameplay experience. In Proceedings of the 2008 Conference on Future Play: Research, Play, Share (Future Play '08), 81--88. http://dl.acm.org/citation.cfm?doid=1496984.1496998","paperID":"None"},{"content":"Andrew K. Przybylski, Netta Weinstein, Kou Murayama, Martin F. Lynch and Richard M. Ryan. 2012. The Ideal Self at Play: The Appeal of Video Games That Let You Be All You Can Be. Psychological Science 23, 1: 69--76.","paperID":"None"},{"content":"Niklas Ravaja, Mikko Salminen, Jussi Holopainen, Timo Saari, Jari Laarni, and Aki Järvinen. 2004. Emotional Response Patterns and Sense of Presence during Video Games: Potential Criterion Variables for Game Design. In Proceedings of the Third Nordic Conference on Human-Computer Interaction (NordiCHI '04), 339--347. http://dl.acm.org/citation.cfm?doid=1028014.1028068","paperID":"None"},{"content":"Niklas Ravaja, Timo Saari, Mikko Salminen, Jari Laarni and Kari Kallinen. 2006. Phasic emotional reactions to video game events: a psychophysiological investigation. Media Psychology 8, 4: 343--367.","paperID":"None"},{"content":"Falko Rheinberg, Regina Vollmeyer and Stefan Engeser. 2003. Die Erfassung des Flow-Erlebens [The assessment of flow experience]. In Diagnostik von Selbstkonzept, Lernmotivation und Selbstregulation [Diagnosis of Motivation and Self-Concept], 261--279.","paperID":"None"},{"content":"Scott Rigby and Richard Ryan. 2007. The Player Experience of Needs Satisfaction (PENS): An applied model and methodology for understanding key components of the player experience. Retrieved from immersyve.com/PENS_Sept07.pdf","paperID":"None"},{"content":"Richard M. Ryan. 1982. Control and Information in the Intrapersonal Sphere: An Extension of Cognitive Evaluation Theory. Journal of Personality and Social Psychology 43, 3: 450--461.","paperID":"None"},{"content":"Richard Ryan., Rigby, C. Scott Rigby, and Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30, 4: 347--363.","paperID":"None"},{"content":"Muniba Saleem, Craig A. Anderson, and Douglas A. Gentile. 2012. Effects of Prosocial, Neutral, and Violent Video Games on College Students' Affect. Aggressive Behavior 38, 4: 263--271.","paperID":"None"},{"content":"John L. Sherry. 2004. Flow and Media Enjoyment. Communication Theory 14, 4: 328--347.","paperID":"None"},{"content":"Andrew Sims. 1988. Symptoms in the Mind: An Introduction to Descriptive Psychopathology. Saunders Ltd.","paperID":"None"},{"content":"Paul Skalski, Francis Dalisay, Matthew Kushin and Yung-I Liu. 2012. Need for Presence and Other Motivations for Video Game Play across Genres. In Proceedings of the Presence Live! International Society for Presence Research Annual Conference (ISPR '12).","paperID":"None"},{"content":"Kellie Vella, Daniel M. Johnson, and Leanne Hides. 2013. Positively playful: When videogames lead to player wellbeing. In Proceedings of the First International Conference on Gameful Design, Research and Applications (Gamification '13), 99--102. http://dl.acm.org/citation.cfm?doid=2583008.2583024","paperID":"None"},{"content":"Peta Wyeth, Daniel M. Johnson, and Penelope Sweetser. 2012. Conceptualising, operationalising and measuring the player experience in video games. In Extended Proceedings of the Fun and Games Conference 2012 (Fun and Games '12), 90--93.","paperID":"None"}],"abstract":"The study examines the relationship of challenge-skill balance and the player experience through evaluation of competence, autonomy, presence, interest/enjoyment, and positive and negative affect states. To manipulate challenge-skill balance, three video game modes -- boredom (low challenge), balance (medium challenge), and overload (high challenge) -- were developed and experimentally tested (n = 45). The study showed that self-reported positive affect, autonomy, presence, and interest/enjoyment differed between the levels. The balance condition generally performed well in terms of positive player experiences, confirming the key role challenge-skill balance plays in designing for optimal play experiences. Interestingly, the study found significantly lower negative affect scores when playing the boredom condition. Greater feelings of competence were also reported for the boredom condition than the balance and overload conditions. Finally, some measures point to overload as a more enjoyable experience than boredom, suggesting possible player preference for challenge > skill imbalance over skill > challenge imbalance. Implications for design and future research are presented.","title":"Operationalising and Evaluating Sub-Optimal and Optimal Play Experiences through Challenge-Skill Manipulation","filename":"CHI16/p5583","authors":["Madison Klarkowski","Daniel Johnson","Peta Wyeth","Mitchell McEwan","Cody Phillips","Simon Smith"],"conference":"CHI '16"}