{"paperId":2858579,"citation":[],"reference":[{"content":"2015. Nike+. (2015). http://www.nikeplus.com.br/.","paperID":"None"},{"content":"2015. Rukeeper. (2015). https://runkeeper.com/.","paperID":"None"},{"content":"Miru Ahn, Sungjun Kwon, Byunglim Park, Kyungmin Cho, Sungwon Peter Choe, Inseok Hwang, Hyukjae Jang, Jaesang Park, Yunseok Rhee, and Junehwa Song. 2009. Running or Gaming. In Proceedings of the International Conference on Advances in Computer Entertainment Technology (ACE '09). ACM, 345--348.","paperID":"None"},{"content":"William Albert and Thomas Tullis. 2013. Measuring the User Experience: Collecting, Analyzing, and Presenting Usability Metrics (2nd. ed.). Newnes.","paperID":"None"},{"content":"Marc Bächlin, Kilian Förster, and Gerhard Tröster. 2009. SwimMaster: A Wearable Assistant for Swimmer. In Proceedings of the 11th International Conference on Ubiquitous Computing (UbiComp '09). ACM, 215--224.","paperID":"None"},{"content":"Mark R. Beauchamp, Albert V. Carron, Serena McCutcheon, and Oliver Harper. 2007. Older Adults' Preferences for Exercising Alone versus in Groups: Considering Contextual Congruence. Annals of Behavioral Medicine 33, 2 (2007), 200--206.","paperID":"None"},{"content":"L. Véronique Billat. 2001. Interval Training for Performance: A Scientific and Empirical Practice. Sports Medicine 31, 1 (2001), 13--31.","paperID":"None"},{"content":"Philip Burnard. 1991. A Method of Analyzing Interview Transcripts in Qualitative Research. Nurse Education Today 11, 6 (1991), 461--466.","paperID":"None"},{"content":"Taj Campbell, Brian Ngo, and James Fogarty. 2008. Game Design Principles in Everyday Fitness Applications. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, 249--252.","paperID":"None"},{"content":"Alan Chatham, Ben A. M. Schouten, Cagdas Toprak, Florian 'Floyd' Mueller, Menno Deen, Regina Bernhaupt, Rohit Khot, and Sebastiaan Pijnappel. 2013. Game Jam. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, 3175--3178.","paperID":"None"},{"content":"Lung-Pan Cheng, Patrick Lühne, Pedro Lopes, Christoph Sterz, and Patrick Baudisch. 2014. Haptic Turk: A Motion Platform Based on People. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 3463--3472.","paperID":"None"},{"content":"Adrian David Cheok, Kok Hwee Goh, Wei Liu, Farzam Farbiz, Siew Wan Fong, Sze Lee Teo, Yu Li, and Xubo Yang. 2004. Human Pacman: A Mobile, Wide-area Entertainment System Based on Physical, Social, and Ubiquitous Computing. Personal and Ubiquitous Computing 8, 2 (2004), 71--81.","paperID":"None"},{"content":"Woohyeok Choi, Jeungmin Oh, Taiwoo Park, Seongjun Kang, Miri Moon, Uichin Lee, Inseok Hwang, and Junehwa Song. 2014. MobyDick: An Interactive Multi-swimmer Exergame. In Proceedings of the 12th ACM Conference on Embedded Network Sensor Systems (SenSys '14). ACM, 76--90.","paperID":"None"},{"content":"Peter Dalsgaard and Christian Dindler. 2014. Between Theory and Practice: Bridging Concepts in HCI Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 1635--1644.","paperID":"None"},{"content":"Rodrigo De Oliveira and Nuria Oliver. 2008. TripleBeat: Enhancing Exercise Performance with Persuasion. In Proceedings of the 10th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '08). ACM, 255--264.","paperID":"None"},{"content":"Guido Heumer, Darren Carlson, Sree H. Kaligiri, Supriya Maheshwari, Waqar-ul Hasan, Bernhard Jung, and Andreas Schrader. 2006. Paranoia Syndrome--A Pervasive Multiplayer Game Using PDAs, RFID, and Tangible Objects. In International Symposium on Pervasive Gaming Applications (PerGames '06).","paperID":"None"},{"content":"Maea Hohepa, Grant Schofield, and Gregory S. Kolt. 2006. Physical Activity: What Do High School Students Think? Journal of Adolescent Health 39, 3 (2006), 328--336.","paperID":"None"},{"content":"Bonifaz Kaufmann and David Ahlström. 2013. Studying Spatial Memory and Map Navigation Performance on Projector Phones with Peephole Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 3173--3176.","paperID":"None"},{"content":"John Komar, Pierre M. Leprêtre, Morgan R. Alberty, Julien Vantorre, Ricardo J. Fernandes, Philippe Hellard, Didier Chollet, and Ludovic M. Seifert. 2012. Effect of Increasing Energy Cost on Arm Coordination in Elite Sprint Swimmers. Human Movement Science 31, 3 (2012), 620--629.","paperID":"None"},{"content":"Sami Laakso and Mikko Laakso. 2006. Design of a Body-Driven Multiplayer Game System. Computers in Entertainment 4, 4, Article 7 (2006).","paperID":"None"},{"content":"Haechan Lee, Miri Moon, Taiwoo Park, Inseok Hwang, Uichin Lee, and Junehwa Song. 2013. Dungeons & Swimmers: Designing an Interactive Exergame for Swimming. In Proceedings of the 2013 ACM Conference on Pervasive and Ubiquitous Computing Adjunct Publication (UbiComp '13 Adjunct). ACM, 287--290.","paperID":"None"},{"content":"Matthew Mauriello, Michael Gubbels, and Jon E. Froehlich. 2014. Social Fabric Fitness: The Design and Evaluation of Wearable E-textile Displays to Support Group Running. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, 2833--2842.","paperID":"None"},{"content":"Sumit Mehra, Peter Werkhoven, and Marcel Worring. 2006. Navigating on Handheld Displays: Dynamic versus Static Peephole Navigation. ACM Transactions on Computer-Human Interaction 13, 4 (2006), 448--457.","paperID":"None"},{"content":"Florian 'Floyd' Mueller, Luke Cole, Shannon O'Brien, and Wouter Walmink. 2006. Airhockey over a Distance: A Networked Physical Game to Support Social Interactions. In Proceedings of the 2006 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology (ACE '06). ACM, Article 70.","paperID":"None"},{"content":"Florian 'Floyd' Mueller and Martin Gibbs. 2006. A Table Tennis Game for Three Players. In Proceedings of the 18th Australia Conference on Computer-Human Interaction: Design: Activities, Artifacts and Environments (OZCHI '06). ACM, 321--324.","paperID":"None"},{"content":"Florian 'Floyd' Mueller, Martin Gibbs, Frank Vetere, Stefan Agamanolis, and Darren Edge. 2014. Designing Mediated Combat Play. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). ACM, 149--156.","paperID":"None"},{"content":"Florian 'Floyd' Mueller and Katherine Isbister. 2014. Movement-based Game Guidelines. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 2191--2200.","paperID":"None"},{"content":"Florian 'Floyd' Mueller and Matthew Muirhead. 2015. Jogging with a Quadcopter. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 2023--2032.","paperID":"None"},{"content":"Florian 'Floyd' Mueller, Frank Vetere, Martin Gibbs, Darren Edge, Stefan Agamanolis, and Jennifer G. Sheridan. 2010. Jogging over a Distance between Europe and Australia. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, 189--198.","paperID":"None"},{"content":"Florian 'Floyd' Mueller, Frank Vetere, Martin Gibbs, Darren Edge, Stefan Agamanolis, Jennifer G. Sheridan, and Jeffrey Heer. 2012. Balancing Exertion Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, 1853--1862.","paperID":"None"},{"content":"Ville Nenonen, Aleksi Lindblad, Ville Häkkinen, Toni Laitinen, Mikko Jouhtio, and Perttu Hämäläinen. 2007. Using Heart Rate to Control an Interactive Game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). 853--856.","paperID":"None"},{"content":"Shannon O'Brien and Florian 'Floyd' Mueller. 2007. Jogging the Distance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, 523--526.","paperID":"None"},{"content":"Taiwoo Park, Inseok Hwang, Uichin Lee, Sunghoon Ivan Lee, Chungkuk Yoo, Youngki Lee, Hyukjae Jang, Sungwon Peter Choe, Souneil Park, and Junehwa Song. 2012. ExerLink: Enabling Pervasive Social Exergames with Heterogeneous Exercise Devices. In Proceedings of the 10th International Conference on Mobile Systems, Applications, and Services (MobiSys '12). ACM, 15--28.","paperID":"None"},{"content":"Taiwoo Park, Uichin Lee, Bupjae Lee, Haechan Lee, Sanghun Son, Seokyoung Song, and Junehwa Song. 2013. ExerSync: Facilitating Interpersonal Synchrony in Social Exergames. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, 409--422.","paperID":"None"},{"content":"Taiwoo Park, Chungkuk Yoo, Sungwon Peter Choe, Byunglim Park, and Junehwa Song. 2012. Transforming Solitary Exercises into Social Exergames. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, 863--866.","paperID":"None"},{"content":"Sarah Jane Pell and Florian 'Floyd' Mueller. 2013. Gravity Well: Underwater Play. In CHI'13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, 3115--3118.","paperID":"None"},{"content":"Roman Rädle, Hans-Christian Jetter, Jens Müller, and Harald Reiterer. 2014. Bigger Is Not Always Better: Display Size, Performance, and Task Load during Peephole Map Navigation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 4127--4136.","paperID":"None"},{"content":"Chad Richards. 2014. Using an Invisible Coach to Help Players Achieve Fitness Goals in Exergames while Retaining Immersion. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '14). ACM, 299--302.","paperID":"None"},{"content":"Richard M. Ryan. 1982. Control and Information in the Intrapersonal Sphere: An Extension of Cognitive Evaluation Theory. Journal of Personality and Social Psychology 43, 3 (1982), 450.","paperID":"None"},{"content":"Jesse Schell. 2014. The Art of Game Design: A Book of Lenses (2nd. ed.). CRC Press.","paperID":"None"},{"content":"Susie Scott. 2009. Reclothing the Emperor: The Swimming Pool as a Negotiated order. Symbolic Interaction 32, 2 (2009), 123--145.","paperID":"None"},{"content":"Tadeusz Stach, T. C. Nicholas Graham, Jeffrey Yim, and Ryan E. Rhodes. 2009. Heart Rate Control of Exercise Video Games. In Proceedings of Graphics Interface (GI '09). Canadian Information Processing Society, 125--132.","paperID":"None"},{"content":"Hanna Strömberg, Antti Väätänen, and Veli-Pekka Räty. 2002. A Group Game Played in Interactive Virtual Space: Design and Evaluation. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '02). ACM, 56--63.","paperID":"None"},{"content":"Yu Ukai and Jun Rekimoto. 2013. Swimoid: A Swim Support System Using an Underwater Buddy Robot. In Proceedings of the 4th Augmented Human International Conference (AH '13). ACM, 170--177.","paperID":"None"},{"content":"Cary H. Wing. 2014. The Evolution of Group Fitness: Shaping the History of Fitness. ACSM's Health & Fitness Journal 18, 6 (2014), 5--7.","paperID":"None"},{"content":"Paweł Wozniak, Kristina Knaving, Staffan Björk, and Morten Fjeld. 2015. RUFUS: Remote Supporter Feedback for Long-Distance Runners. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, 115--124.","paperID":"None"},{"content":"Monica Zaczynski and Anthony D. Whitehead. 2014. Establishing Design Guidelines in Interactive Exercise Gaming: Preliminary Data from Two Posing Studies. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, 1875--1884.","paperID":"None"}],"abstract":"We explore design opportunities for using interactive technologies to enrich group fitness exercises, such as group spinning and swimming, in which an instructor guides a workout program and members synchronously perform a shared physical activity. As a case study, we investigate group fitness swimming. The design challenge is to coordinate a large group of people by considering trade-offs between social awareness and information overload. Our resulting group fitness swimming game, SwimTrain, allows a group of people to have localized synchronous interactions over a virtual space. The game uses competitive and cooperative phases to help group members acquire group-wide awareness. The results of our user study showed that SwimTrain provides socially-enriched swimming experiences, motivates swimmers to follow a training regimen and exert more intensely, and allows strategic game play dealing with skill differences among swimmers. Consequently, we propose several practical considerations for designing group fitness exergames.","title":"SwimTrain: Exploring Exergame Design for Group Fitness Swimming","filename":"CHI16/p1692","authors":["Woohyeok Choi","Jeungmin Oh","Darren Edge","Joohyun Kim","Uichin Lee"],"conference":"CHI '16"}