{"paperId":2858120,"citation":[],"abstract":"We present an approach to protect photos on smartphones from unwanted observations by distorting them in a way that makes it hard or impossible to recognize their content for an onlooker who does not know the photographs. On the other hand, due to the chosen way of distortion, the device owners who know the original images have no problems recognizing photos. We report the results of a user study (n=18) that showed very high usability properties for all tested graphical filters (only 11 out of 216 distorted photos were not correctly identified by their owners). At the same time, two of the filters significantly reduced the observability of the image contents.","reference":[{"content":"Anne Adams and Martina Angela Sasse. 1999. Users Are Not the Enemy. Commun. ACM 42, 12 (Dec. 1999), 40--46.\\showISSN0001-0782\\showDOI%http://dx.doi.org/10.1145/322796.322806","paperID":"None"},{"content":"A. Mike Burton, Stephen Wilson, Michelle Cowan, and Vicki Bruce. 1999. Face Recognition in Poor-Quality Video: Evidence From Security Surveillance. Psychological Science 10, 3 (1999), 243--248. DOI http://dx.doi.org/10.1111/1467--9280.00144","paperID":"None"},{"content":"Daniel Buschek, Moritz Bader, Emanuel von Zezschwitz, and Alexander De Luca. 2015. Automatic Privacy Classification of Personal Photos. In Human-Computer Interaction INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Lecture Notes in Computer Science, Vol. 9297. Springer International Publishing, 428--435. ISBNx978-3-319-226675 DOI http://dx.doi.org/10.1007/978-3-319-22668-2_33","paperID":"None"},{"content":"Tamara Denning, Kevin Bowers, Marten van Dijk, and Ari Juels. 2011. Exploring Implicit Memory for Painless Password Recovery. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2615--2618. ISBNx978-1-4503-0228-9 DOI http://dx.doi.org/10.1145/1978942.1979323","paperID":"None"},{"content":"Sigrid Andrea Ebbinghaus. 2015. Privacy-Respectful Photo Browsing for Smartphones Filter Selection and Evaluation. Technical Report LMU-MI-2015-3. University of Munich (LMU), Department of Computer Science, Media Informatics Group, Munich, Germany. URLwww.medien.ifi.lmu.de/forschung/publikationen/detail?pub=ZezschwitzTR_Privacy","paperID":"None"},{"content":"Adrienne Porter Felt, Serge Egelman, and David Wagner. 2012. I'Ve Got 99 Problems, but Vibration Ain't One: A Survey of Smartphone Users' Concerns. In Proceedings of the Second ACM Workshop on Security and Privacy in Smartphones and Mobile Devices (SPSM '12). ACM, New York, NY, USA, 33--44. ISBNx978-1-4503-1666-8 DOI http://dx.doi.org/10.1145/2381934.2381943","paperID":"None"},{"content":"Richard L. Gregory. 1997. Knowledge in perception and illusion. Philosophical Transactions of the Royal Society of London B: Biological Sciences 352, 1358 (1997), 1121--1127. ISSN0962-8436 http://dx.doi.org/10.1098/rstb.1997.0095","paperID":"None"},{"content":"Atsushi Harada, Takeo Isarida, Tadanori Mizuno, and Masakatsu Nishigaki. 2006. A User Authentication System Using Schema of Visual Memory. In Biologically Inspired Approaches to Advanced Information Technology, AukeJan Ijspeert, Toshimitsu Masuzawa, and Shinji Kusumoto (Eds.). Lecture Notes in Computer Science, Vol. 3853. Springer Berlin Heidelberg, 338--345. ISBNx978-3-540-31253-6 http://dx.doi.org/10.1007/11613022_28","paperID":"None"},{"content":"Marian Harbach, Emanuel von Zezschwitz, Andreas Fichtner, Alexander De Luca, and Matthew Smith. 2014. It's a Hard Lock Life: A Field Study of Smartphone (Un)Locking Behavior and Risk Perception. In Symposium on Usable Privacy and Security (SOUPS). USENIX Association, 213--230. ISBNx978-1-931971-13--3 URL https://www.usenix.org/system/files/conference/soups2014/soups14-paper-harbach.pdf","paperID":"None"},{"content":"Eiji Hayashi, Rachna Dhamija, Nicolas Christin, and Adrian Perrig. 2008. Use Your Illusion: Secure Authentication Usable Anywhere. In Proceedings of the 4th Symposium on Usable Privacy and Security (SOUPS '08). ACM, New York, NY, USA, 35--45. ISBNx978-1-60558-276-4 DOI http://dx.doi.org/10.1145/1408664.1408670","paperID":"None"},{"content":"Amy K. Karlson, A.J. Bernheim Brush, and Stuart Schechter. 2009. Can I Borrow Your Phone?: Understanding Concerns when Sharing Mobile Phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1647--1650. ISBNx978-1-60558-246-7 DOI http://dx.doi.org/10.1145/1518701.1518953","paperID":"None"},{"content":"Hikari Kinjo and Joan Gay Snodgrass. 2000. Does the generation effect occur for pictures? The American journal of psychology 113, 1 (2000), 95. URL http://www.jstor.org/stable/1423462","paperID":"None"},{"content":"Zhan Wang, Jiwu Jing, and Liang Li. 2013. Time Evolving Graphical Password for Securing Mobile Devices. In Proceedings of the 8th ACM SIGSAC Symposium on Information, Computer and Communications Security (ASIA CCS '13). ACM, New York, NY, USA, 347--352. ISBNx978-1-4503-1767-2 DOI http://dx.doi.org/10.1145/2484313.2484358","paperID":"None"}],"title":"You Can't Watch This!: Privacy-Respectful Photo Browsing on Smartphones","filename":"CHI16/p4320","authors":["Emanuel von Zezschwitz","Sigrid Ebbinghaus","Heinrich Hussmann","Alexander De Luca"],"conference":"CHI '16"}