{"paperId":2858398,"citation":[],"reference":[{"content":"Morgan Ames and Mor Naaman. 2007. Why we tag: motivations for annotation in mobile and online media. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 971--980.","paperID":"None"},{"content":"Mikhail M Bakhtin and PN Medvedev. 1978. The formal method in literary scholarship (AJ Wehrle, Trans.). London, England: The John Hopkins University Press.","paperID":"None"},{"content":"Eric PS Baumer, Jordan Sinclair, and Bill Tomlinson. 2010. America is like Metamucil: fostering critical and creative thinking about metaphor in political blogs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1437--1446.","paperID":"None"},{"content":"W Lance Bennett and Alexandra Segerberg. 2011. Digital media and the personalization of collective action: Social technology and the organization of protests against the global economic crisis. Information, Communication & Society 14, 6 (2011), 770--799.","paperID":"None"},{"content":"Yi Chang, Lei Tang, Yoshiyuki Inagaki, and Yan Liu. 2014. What is tumblr: A statistical overview and comparison. ACM SIGKDD Explorations Newsletter 16, 1 (2014), 21--29.","paperID":"None"},{"content":"Michael Conover, Jacob Ratkiewicz, Matthew Francisco, Bruno Gonçalves, Filippo Menczer, and Alessandro Flammini. 2011. Political Polarization on Twitter. In Proceedings of ICWSM. AAAI.","paperID":"None"},{"content":"Cristian Danescu-Niculescu-Mizil, Robert West, Dan Jurafsky, Jure Leskovec, and Christopher Potts. 2013. No country for old members: User lifecycle and linguistic change in online communities. In Proceedings of the 22nd international conference on World Wide Web. 307--318.","paperID":"None"},{"content":"Caitlin Dewey. 2014. Bringbackourgirls,#Kony2012, and the complete, divisive history of 'hashtag activism'. Washington Post (2014).","paperID":"None"},{"content":"John Eligon. 2015. One Slogan, Many Methods: Black Lives Matter Enters Politics. The New York Times (Nov 18 2015).","paperID":"None"},{"content":"John R Firth. 1957. A synopsis of linguistic theory, 1930--1955. Studies in Linguistic Analysis (1957), 1--32.","paperID":"None"},{"content":"Sarah Warshauer Freedman and Arnetha Ball. 2004. Ideological Becoming: Bakhtinian Concepts to Guide the Study of Language. In Bakhtinian Perspectives on Language, Literacy, and Learning. Cambridge University Press, Cambridge, 3--33.","paperID":"None"},{"content":"Scott A Golder and Bernardo A Huberman. 2006. Usage patterns of collaborative tagging systems. Journal of information science 32, 2 (2006), 198--208.","paperID":"None"},{"content":"Sandra González-Bailón, Javier Borge-Holthoefer, Alejandro Rivero, and Yamir Moreno. 2011. The dynamics of protest recruitment through an online network. Scientific reports 1 (2011).","paperID":"None"},{"content":"Asmelash Teka Hadgu, Kiran Garimella, and Ingmar Weber. 2013. Political hashtag hijacking in the US. In Proceedings of the 22nd international conference on World Wide Web companion. International World Wide Web Conferences Steering Committee, 55--56.","paperID":"None"},{"content":"Shih-Wen Huang, Minhyang Mia Suh, Benjamin Mako Hill, and Gary Hsieh. 2015. How Activists Are Both Born and Made: An Analysis of Users on Change. org. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 211--220.","paperID":"None"},{"content":"Travis Kriplean, Michael Toomim, Jonathan Morgan, Alan Borning, and Andrew Ko. 2012. Is this what you meant?: promoting listening on the web with reflect. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1559--1568.","paperID":"None"},{"content":"Yu-Ru Lin, Drew Margolin, Brian Keegan, Andrea Baronchelli, and David Lazer. 2013. #Bigbirds Never Die: Understanding Social Dynamics of Emergent Hashtags. In ICWSM.","paperID":"None"},{"content":"Brian D Loader and Dan Mercea. 2011. Networking democracy? Social media innovations and participatory politics. Information, Communication & Society 14, 6 (2011), 757--769.","paperID":"None"},{"content":"Susana Loza. 2014. Hashtag feminism, #SolidarityIsForWhiteWomen, and the other #FemFuture. Ada: A Journal of Gender, New Media, and Technology 5 (2014).","paperID":"None"},{"content":"Isabella Peters, Margaret EI Kipp, Tamara Heck, Jacek Gwizdka, Kun Lu, Diane Rasmussen Neal, and Louise Spiteri. 2011. Social tagging & folksonomies: Indexing, retrieving ... and beyond? Proceedings of the American Society for Information Science and Technology 48, 1 (2011), 1--4.","paperID":"None"},{"content":"Michelle Rodino-Colocino. 2014. #YesAllWomen: Intersectional Mobilization Against Sexual Assault is Radical (Again). Feminist Media Studies 14, 6 (2014), 1113--1115.","paperID":"None"},{"content":"Daniel M Romero, Brendan Meeder, and Jon Kleinberg. 2011. Differences in the mechanics of information diffusion across topics: idioms, political hashtags, and complex contagion on twitter. In Proceedings of the 20th international conference on World wide web. 695--704.","paperID":"None"},{"content":"Tamara A Small. 2011. What the hashtag? A content analysis of Canadian politics on Twitter. Information, Communication & Society 14, 6 (2011), 872--895.","paperID":"None"},{"content":"Lara C Stache. 2015. Advocacy and Political Potential at the Convergence of Hashtag Activism and Commerce. Feminist Media Studies 15, 1 (2015), 162--164.","paperID":"None"},{"content":"Kate Starbird and Leysia Palen. 2012. (How) will the revolution be retweeted?: information diffusion and the 2011 Egyptian uprising. In Proceedings of the acm 2012 conference on computer supported cooperative work. ACM, 7--16.","paperID":"None"},{"content":"Claudia Wagner, Philipp Singer, Markus Strohmaier, and Bernardo A Huberman. 2014. Semantic stability in social tagging streams. In Proceedings of the 23rd international conference on World Wide Web. ACM, 735--746.","paperID":"None"}],"abstract":"Sociologists and political scientists have drawn attention to the importance of hashtags as tools for political organizing and protest online. Examining a set of political hashtags on Tumblr, we discover linguistic changes in the ways that the hashtags are used over time. As time passes, the community uses a more diverse vocabulary of hashtags in conjunction with the central political tag, suggesting that the meaning of the tag expands or proliferates -- a phenomenon we dub hashtag drift. We also find evidence that this occurs not just on the level of the community but at the level of individual users who, as time progresses, use the hashtag in conjunction with a more diverse vocabulary of other tags. This study sheds light on the dynamics of political engagement through hashtag activism.","title":"Hashtag Drift: Tracing the Evolving Uses of Political Hashtags Over Time","filename":"CHI16/p2401","authors":["Kyle Booten"],"conference":"CHI '16"}