{"paperId":2858415,"citation":[],"reference":[{"content":"Alessandro Acquisti and Ralph Gross. 2006. Imagined communities: Awareness, information sharing, and privacy on the Facebook. In Privacy enhancing technologies, 4258, 36--58.","paperID":"None"},{"content":"Shane Ahern, Dean Eckles, Nathaniel S. Good, Simon King, More Naaman, and Rahul Nair. 2007. Overexposed?: Privacy patterns and considerations in online and mobile photo sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 357--366. ACM.","paperID":"None"},{"content":"Irwin Altman. 1975. The Environment and Social Behavior: Privacy, Personal Space, Territory, and Crowding. Brooks/Cole Publishing Company.","paperID":"None"},{"content":"James L. Arbuckle. 2013. IBM® SPSS® Amos™ 22 User's Guide.","paperID":"None"},{"content":"Albert Bandura. 2000. Exercise of human agency through collective efficacy. Current Directions in Psychological Science 9, 3: 75--78.","paperID":"None"},{"content":"Albert Bandura. 2006. Toward a psychology of human agency. Perspectives on Psychological Science 1, 2: 164--180.","paperID":"None"},{"content":"Andrew Besmer and Heather Richter Lipford. 2009. Moving beyond untagging: Photo privacy in a tagged world. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1563--1572.","paperID":"None"},{"content":"Edward J. Bloustein. 1976. Group privacy: The right to huddle. Rutgers-Camden Law Journal 8, 219.","paperID":"None"},{"content":"danah m. boyd and Nicole B. Ellison. 2007. Social network sites: Definition, history, and scholarship. Journal of Computer-Mediated Communication 13, 1: 210--230.","paperID":"None"},{"content":"Donald T. Campbell and Donald W. Fiske. Convergent and discriminant validation by the multitrait multimethod matrix. Psychological Bulletin 56, 2: 81105.","paperID":"None"},{"content":"Jeffrey T. Child, Judy C. Pearson, and Sandra Petronio. 2009. Blogging, communication, and privacy management: Development of the blogging privacy management measure. Journal of the American Society for Information Science and Technology 60, 10: 2079--2094.","paperID":"None"},{"content":"Thomas D. Cook, Donald Thomas Campbell, and Arles Day. 1979. Quasi-Experimentation: Design & Analysis Issues for Field Settings. Houghton Mifflin.","paperID":"None"},{"content":"Lee J. Cronbach. 1971. Test validation. In Educational Measurement.","paperID":"None"},{"content":"Leucio Antonio Cutillo, Refik Molva, and Thorsten Strufe. 2009. Safebook: A privacy-preserving online social network leveraging on real-life trust. Communications Magazine, IEEE 47, 12: 94--101.","paperID":"None"},{"content":"Nicole B. Ellison, Charles Steinfield, and Cliff Lampe. 2007. The benefits of Facebook \"friends:\" social capital and college students' use of online social networking sites. Journal of Computer-Mediated Communication 12, 1143--1168.","paperID":"None"},{"content":"Philip W. L. Fong, Mohd Anwar, and Zhen Zhao. 2009. A privacy preservation model for Facebook-style social network systems. In Computer Security-ESORICS, 303--320.","paperID":"None"},{"content":"Wyndol Furman and Duane Buhrmester. 2009. Methods and measures: The network of relationships inventory: Behavioral systems version. International Journal of Behavioral Development 33, 5: 470--478.","paperID":"None"},{"content":"Michael Hart, Rob Johnson, and Amanda Stent. 2007. More content - less control: Access control in the web 2.0. IEEE Web 2.","paperID":"None"},{"content":"David J. Houghton and Adam N. Joinson. 2010. Privacy, social network sites, and social relations. Journal of Technology in Human Services 28, 1--2: 7494.","paperID":"None"},{"content":"Hongxin Hu, Gail-Joon Ahn, and Jan Jorgensen. 2011. Detecting and resolving privacy conflicts for collaborative data sharing in online social networks. In Proceedings of the 27th Annual Computer Security Applications Conference.","paperID":"None"},{"content":"Li-tze Hu and Peter M. Bentler. 1999. Cutoff criteria for fit indexes in covariance structure analysis: Conventional criteria versus new alternatives. Structural Equation Modeling: A Multidisciplinary Journal 6, 1: 1--55.","paperID":"None"},{"content":"Carlos Jensen and Colin Potts. 2004. Privacy policies as decision-making tools: an evaluation of online privacy notices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04), 471--478. ACM.","paperID":"None"},{"content":"Fred N. Kerlinger. 1986. Foundations of Behavioral Research (3rd Ed.).","paperID":"None"},{"content":"Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08).","paperID":"None"},{"content":"Airi Lampinen, Vilma Lehtinen, Asko Lehmuskallio, and Sakari Tamminen. 2011. We're in it together: interpersonal management of disclosure in social network services. 2011. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11).","paperID":"None"},{"content":"Kelly Lyons, Steven Chuang, and Chun-Wei Choo. 2012. Towards a conceptual framework for managing social media in enterprise online communities. In Proc. 2012 iConference.","paperID":"None"},{"content":"Robert C. MacCallum, Michael W. Browne, and Hazuki M. Sugawara. 1996. Power analysis and determination of sample size for covariance structure modeling. Psychological Methods 1, 2: 130.","paperID":"None"},{"content":"Scott B. MacKenzie, Philip M. Podsakoff, and Nathan P. Podsakoff. 2011. Construct measurement and validation procedures in MIS and behavioral research: Integrating new and existing techniques. MIS Quarterly 35, 2: 293--334.","paperID":"None"},{"content":"Kristen Martin. 2015. Understanding privacy online: Development of a social contract approach to privacy. Journal of Business Ethics, 1--19.","paperID":"None"},{"content":"Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior Research Methods 44, 1: 1--23.","paperID":"None"},{"content":"Miriam J. Metzger. 2007. Communication privacy management in electronic commerce. Journal of Computer-Mediated Communication 12, 2: 335--361.","paperID":"None"},{"content":"Alison R. Murphy, Madhu C. Reddy, and Heng Xu. 2014. Privacy practices in collaborative environments: a study of emergency department staff. In Proceedings of the 2014 conference on Computer Supported Cooperative Work (CSCW '14), 269--282. ACM.","paperID":"None"},{"content":"Helen Nissenbaum. 2004. Privacy as contextual integrity. Washington Law Review 79, 1: 101--139.","paperID":"None"},{"content":"Leysia Palen and Paul Dourish. 2003. Unpacking \"privacy\" for a networked world. CHI Letters 5, 1: 129--136.","paperID":"None"},{"content":"Gabriele Paolacci, Jesse Chandler, and Panagiotis G. Ipeirotis. 2010. Running experiments on Amazon Mechanical Turk. Judgment and Decision making 5, 5: 411--419.","paperID":"None"},{"content":"Sandra Petronio. 2002. Boundaries of Privacy: Dialectics of Disclosure.","paperID":"None"},{"content":"Pew Research Center. 2014. Public Perceptions of Privacy and Security in the Post-Snowden Era. Retrieved from http://www.pewinternet.org/2014/11/12/publicprivacy-perceptions/","paperID":"None"},{"content":"Lee Rainie and Mary Madden. 2015. Americans' Privacy Strategies Post-Snowden. Retrieved from http://www.pewinternet.org/2015/03/16/AmericansPrivacy-Strategies-Post-Snowden/","paperID":"None"},{"content":"H. Jeff Smith, Tamara Dinev, and Heng Xu. 2011. Information privacy research: an interdisciplinary review. MIS Quarterly 35, 4: 989--1016.","paperID":"None"},{"content":"H. Jeff Smith, Sandra J. Milberg, and Sandra J. Burke. 1996. Information privacy: Measuring individuals' concerns about organizational practices. MIS Quarterly 20, 2: 167--196","paperID":"None"},{"content":"Jai-Yeol Son and Sung S. Kim. 2008. Internet users' information privacy-protective responses: A taxonomy and a nomological model. MIS Quarterly 32, 3: 503529.","paperID":"None"},{"content":"Anna Cinzia Squicciarini, Mohamed Shehab, and Federica Paci. 2009. Collective privacy management in social networks. In Proceedings of the 18th international conference on World Wide Web, 521--530. ACM.","paperID":"None"},{"content":"Jeffrey M. Stanton and Kathryn R. Stam. 2002. Information technology, privacy, and power within organizations: A view from boundary theory and social exchange perspectives. Surveillance & Society 1, 2: 152--190.","paperID":"None"},{"content":"H. Colleen Stuart, Laura Dabbish, Sara Kiesler, Peter Kinnaird, and Ruogu Kang. 2012. Social transparency in networked information exchange: A theoretical framework. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, 451--460. ACM.","paperID":"None"},{"content":"Fred Stutzman, Robert Capra, and Jamila Thompson. 2011. Factors mediating disclosure in social network sites. Computers in Human Behavior 27, 1: 590--598.","paperID":"None"},{"content":"Fred Stutzman and Woodrow Hartzog. 2012. Boundary regulation in social media. In Proceedings of the 2012 ACM Conference on Computer Supported Cooperative Work (CSCW '12), 769--778. ACM.","paperID":"None"},{"content":"Fred Stutzman and Jacob Kramer-Duffield. 2010. Friends only: Examining a privacy-enhancing behavior in Facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10).","paperID":"None"},{"content":"Orit E. Tykocinski, Dana Pick, and Dana Kedmi. 2002. Retroactive pessimism: A different kind of hindsight bias. European Journal of Social Psychology 32, 4: 577--588.","paperID":"None"},{"content":"Na Wang, Jens Grossklags, and Heng Xu. 2013. An online experiment of privacy authorization dialogues for social applications. In Proceedings of the 2013 conference on Computer Supported Cooperative Work (CSCW '13), 261--272. ACM.","paperID":"None"},{"content":"Pamela Wisniewski, Heather Lipford, and David Wilson. 2012. Fighting for my space: Coping mechanisms for SNS boundary regulation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 609--618. ACM.","paperID":"None"},{"content":"Jessica Vitak and Jinyoung Kim. 2014. You can't block people offline: Examining how Facebook's affordances shape the disclosure process. In Proceedings of the 17th ACM conference on Computer Supported Cooperative Work & Social Computing, 461--474. ACM.","paperID":"None"},{"content":"Ralf De Wolf, Koen Willaert, and Jo Pierson. 2014. Managing privacy boundaries together: Exploring individual and group privacy management strategies in Facebook. Computers in Human Behavior 35, 444--454.","paperID":"None"},{"content":"Heng Xu. 2012. Reframing privacy 2.0 in online social network. University of Pennsylvania Journal of Constitutional Law 14, 4: 1077--1102.","paperID":"None"},{"content":"Heng Xu, Tamara Dinev, Jeff Smith, and Paul Hart. 2011. Information privacy concerns: Linking individual perceptions with institutional privacy assurances. Journal of the Association for Information Systems 12, 12: 798--824.","paperID":"None"}],"abstract":"Although information sharing on social networking sites (SNSs) usually involves multiple stakeholders, limited attention has been paid so far to conceptualizing users' information practices as a collaborative process. To fill this gap in the literature, we develop a survey study to examine collaborative privacy management strategies involving co-owners of shared content. By conducting two online surveys (N = 304, 427) with different samples, our findings show how individuals protect online privacy collaboratively and how their autonomous decision making regarding privacy management is shaped by the interdependent use of SNSs with their social connections. We discuss theoretical implications to privacy research and suggest design guidelines for better supporting users' needs for collaborating with their social ties to achieve collective privacy goals.","title":"Autonomous and Interdependent: Collaborative Privacy Management on Social Networking Sites","filename":"CHI16/p4286","authors":["Haiyan Jia","Heng Xu"],"conference":"CHI '16"}