{"paperId":2858566,"citation":[],"reference":[{"content":"Android's Notification Listener Service. http://developer.android.com/reference/android/service/notification/NotificationListenerService.html.","paperID":"None"},{"content":"Android's Speech Recognizer API. http://developer.android.com/reference/android/speech/SpeechRecognizer.html.","paperID":"None"},{"content":"Google's Activity Recognition API. http://developer.android.com/training/location/activity-recognition.html.","paperID":"None"},{"content":"Heads-up Notifications. http://developer.android.com/guide/topics/ui/notifiers/notifications.html#Heads-up.","paperID":"None"},{"content":"Piotr D Adamczyk and Brian P Bailey. 2004. If not now, when?: the effects of interruption at different moments within task execution. In CHI'04. ACM, Vienna, Austria, 271--278.","paperID":"None"},{"content":"Erik M Altmann and J Gregory Trafton. 2002. Memory for goals: An activation-based model. Cognitive science 26, 1 (2002), 39--83.","paperID":"None"},{"content":"Brian P Bailey and Joseph A Konstan. 2006. On the need for attention-aware systems: Measuring effects of interruption on task performance, error rate, and affective state. Computers in Human Behavior 22, 4 (2006), 685--708.","paperID":"None"},{"content":"Brian P Bailey, Joseph A Konstan, and John V Carlis. 2000. Measuring the effects of interruptions on task performance in the user interface. In SMC'00, Vol. 2. IEEE, Nashville,TN, USA, 757--762.","paperID":"None"},{"content":"Jelmer P Borst, Niels A Taatgen, and Hedderik van Rijn. 2010. The problem state: a cognitive bottleneck in multitasking. Journal of Experimental Psychology: Learning, memory, and cognition 36, 2 (2010), 363.","paperID":"None"},{"content":"Herbert H Clark. 1996. Using language. Vol. 1996. Cambridge University Press Cambridge.","paperID":"None"},{"content":"Edward Cutrell, Mary Czerwinski, and Eric Horvitz. 2001. Notification, disruption, and memory: Effects of messaging interruptions on memory and performance. In Interact'01. IOS Press, Tokyo, Japan, 263--270.","paperID":"None"},{"content":"Mary Czerwinski, Edward Cutrell, and Eric Horvitz. 2000a. Instant messaging and interruption: Influence of task type on performance. In OZCHI'00. ACM, Sydney, Australia, 361--367.","paperID":"None"},{"content":"Mary Czerwinski, Edward Cutrell, and Eric Horvitz. 2000b. Instant messaging: Effects of relevance and timing. People and computers XIV: Proceedings of HCI 2 (2000), 71--76.","paperID":"None"},{"content":"Joel E Fischer, Chris Greenhalgh, and Steve Benford. 2011. Investigating episodes of mobile phone activity as indicators of opportune moments to deliver notifications. In MobileHCI'11. ACM, Stockholm, Sweden, 181--190.","paperID":"None"},{"content":"Joel E Fischer, Nick Yee, Victoria Bellotti, Nathan Good, Steve Benford, and Chris Greenhalgh. 2010. Effects of Content and Time of Delivery on Receptivity to Mobile Interruptions. In MobileHCI'10. ACM, Lisbon, Portugal, 103--112.","paperID":"None"},{"content":"Lewis R Goldberg. 1992. The development of markers for the Big-Five factor structure. Psychological Assessment 4, 1 (1992), 26.","paperID":"None"},{"content":"Victor M. Gonzalez and Mark. Gloria. 2004. Constant, Constant, Multi-Tasking Craziness: Managing Multiple Working Spheres. In CHI'04. ACM, Vienna, Austria, 113--120.","paperID":"None"},{"content":"Joyce Ho and Stephen S. Intille. 2005. Using Context-Aware Computing to Reduce the Perceived Burden of Interruptions from Mobile Devices. In CHI'05. ACM, Seoul, Korea, 909--918.","paperID":"None"},{"content":"Eric Horvitz and Johnson Apacible. 2003. Learning and Reasoning about Interruption. In ICMI'03. ACM, Vancouver, Canada, 20--27.","paperID":"None"},{"content":"Shamsi T Iqbal and Eric Horvitz. 2010. Notifications and awareness: a field study of alert usage and preferences. In CSCW'10. ACM, Savannah, Georgia, USA, 27--30.","paperID":"None"},{"content":"Shamsi T Iqbal, Xianjun Sam Zheng, and Brian P Bailey. 2004. Task-evoked pupillary response to mental workload in human-computer interaction. In CHI'04 Extended Abstracts. ACM, Vienna, Austria, 1477--1480.","paperID":"None"},{"content":"Neal Lathia, Kiran K. Rachuri, Cecilia Mascolo, and George Roussos. 2013. Open Source Smartphone Libraries for Computational Social Science. In MCSS'13. ACM, Zurich, Switzerland, 911--920.","paperID":"None"},{"content":"Abhinav Mehrotra, Mirco Musolesi, Robert Hendley, and Veljko Pejovic. 2015. Designing Content-driven Intelligent Notification Mechanisms for Mobile Applications. In UbiComp'15. ACM, Osaka, Japan, 813--824.","paperID":"None"},{"content":"Yoshiro Miyata and Donald A. Norman. 1986. Psychological Issues in Support of Multiple Activities. User Centered System Design: New Perspectives on Human-Computer Interaction (1986), 265--284.","paperID":"None"},{"content":"Christopher A Monk, Deborah A Boehm-Davis, and J Gregory Trafton. 2002. The attentional costs of interrupting task performance at various stages. In HFES'02, Vol. 46. SAGE Publications, Baltimore, MD, 1824--1828.","paperID":"None"},{"content":"Antti Oulasvirta, Tye Rattenbury, Lingyi Ma, and Eeva Raita. 2012. Habits make smartphone use more pervasive. Personal and Ubiquitous Computing 16, 1 (2012), 105--114.","paperID":"None"},{"content":"Veljko Pejovic, Abhinav Mehrotra, and Mirco Musolesi. 2015. Investigating The Role of Task Engagement in Mobile Interruptibility. In MobileHCI'15 Adjunct. ACM, Copenhagen, Denmark.","paperID":"None"},{"content":"Veljko Pejovic and Mirco Musolesi. 2014. InterruptMe: designing intelligent prompting mechanisms for pervasive applications. In UbiComp'14. ACM, Seattle, WA, USA, 897--908.","paperID":"None"},{"content":"Martin Pielot, Karen Church, and Rodrigo de Oliveira. 2014a. An in-situ study of mobile phone notifications. In MobileHCI'14. ACM, Toronto, ON, Canada, 233--242.","paperID":"None"},{"content":"Martin Pielot, Rodrigo de Oliveira, Haewoon Kwak, and Nuria Oliver. 2014b. Didn't you see my message?: predicting attentiveness to mobile instant messages. In CHI'14. ACM, Toronto, ON, Canada, 3319--3328.","paperID":"None"},{"content":"Martin Pielot, Tilman Dingler, Jose San Pedro, and Nuria Oliver. 2015. When attention is not scarce-detecting boredom from mobile phone usage. In UbiComp'15. ACM, Osaka, Japan, 825--836.","paperID":"None"},{"content":"Alireza Sahami Shirazi, Niels Henze, Tilman Dingler, Martin Pielot, Dominik Weber, and Albrecht Schmidt. 2014. Large-scale assessment of mobile notifications. In CHI'14. ACM, Toronto, ON, Canada, 3055--3064.","paperID":"None"},{"content":"Cary Stothart, Ainsley Mitchum, and Courtney Yehnert. 2015. The attentional cost of receiving a cell phone notification. Journal of Experimental Psychology: Human Perception and Performance 41, 4 (2015), 893.","paperID":"None"}],"abstract":"Notifications are extremely beneficial to users, but they often demand their attention at inappropriate moments. In this paper we present an in-situ study of mobile interruptibility focusing on the effect of cognitive and physical factors on the response time and the disruption perceived from a notification. Through a mixed method of automated smartphone logging and experience sampling we collected 10372 in-the-wild notifications and 474 questionnaire responses on notification perception from 20 users. We found that the response time and the perceived disruption from a notification can be influenced by its presentation, alert type, sender-recipient relationship as well as the type, completion level and complexity of the task in which the user is engaged. We found that even a notification that contains important or useful content can cause disruption. Finally, we observe the substantial role of the psychological traits of the individuals on the response time and the disruption perceived from a notification.","title":"My Phone and Me: Understanding People's Receptivity to Mobile Notifications","filename":"CHI16/p1021","authors":["Abhinav Mehrotra","Veljko Pejovic","Jo Vermeulen","Robert Hendley","Mirco Musolesi"],"conference":"CHI '16"}