{"paperId":2858114,"reference":[{"content":"Alyssa Alcorn, Helen Pain, Gnanathusharan Rajendran, Tim Smith, Oliver Lemon, Kaska Porayska-Pomsta, Mary Ellen Foster, Katerina Avramides, Christopher Frauenberger, and Sara Bernardini. 2011. Social communication between virtual characters and children with autism. In Artificial Intelligence in Education, 714. Springer Berlin Heidelberg. http://dx.doi.org/10.1007/978--3--642--21869--9_4","paperID":"None"},{"content":"Thomas Armstrong. 2013. Neurodiversity: Discovering the extraordinary gifts of autism, ADHD, dyslexia, and other brain differences. Da Capo Press.","paperID":"None"},{"content":"Simon Baron-Cohen, Ofer Golan, Sally Wheelwright, and Jacqueline J. Hill. 2004. Mind Reading: The Interactive Guide to Emotions. London: Jessica Kingsley Limited.","paperID":"None"},{"content":"Alberto Battocchi, Fabio Pianesi, Daniel Tomasini, Massimo Zancanaro, Gianluca Esposito, Paola Venuti, A. Ben Sasson, Eynat Gal, and Patrice L. Weiss. 2009. Collaborative Puzzle Game: a tabletop interactive game for fostering collaboration in children with Autism Spectrum Disorders (ASD).\" In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces, 197--204. http://dx.doi.org/10.1145/1731903.1731940","paperID":"None"},{"content":"Marty Beech. 2012. Disability Awareness through Language Arts and Literacy: Resources for Prekindergarten and Elementary School. Florida Developmental Disabilities Council, Inc.","paperID":"None"},{"content":"Sven Bölte, Sabine Feineis-Matthews, Simone Leber, Thomas Dierks, Daniela Hubl, and Fritz Poustka. 2002. The development and evaluation of a computer-based program to test and to teach the recognition of facial affect. International Journal of Circumpolar Health, 61. http://dx.doi.org/10.3402/ijch.v61i0.17503","paperID":"None"},{"content":"Louanne E. Boyd, Kathryn E. Ringland, Oliver L. Haimson, Helen Fernandez, Maria Bistarkey, and Gillian R. Hayes. 2015. Evaluating a collaborative iPad game's impact on social relationships for children with autism spectrum disorder. ACM Transactions on Accessible Computing (TACCESS), 7(1), 3. http://dx.doi.org/10.1145/2751564","paperID":"None"},{"content":"Bas Brederode, Panos Markopoulos, Mathieu Gielen, Arnold Vermeeren, and Huib De Ridder. 2005. pOwerball: the design of a novel mixed-reality game for children with mixed abilities. In Proceedings of the 2005 Conference on Interaction design and children, 32--39. http://dx.doi.org/10.1145/1109540.1109545","paperID":"None"},{"content":"Mindy Brooks. 2012. Sesame's Best Practices Guide for Children's App Development. Sesame Workshop. Retrieved October 10, 2014 from http://www.sesameworkshop.org/ourblog/2012/12/17/sesames-best-practices-guide-forchildrens-app-development/.","paperID":"None"},{"content":"Junia Byrnes and Barbara A. Wasik. 2009. Picture this: Using photography as a learning tool in early childhood classrooms. Childhood Education 85(4), 243--248. http://dx.doi.org/10.1080/00094056.2009.10523090","paperID":"None"},{"content":"Sandra L. Calvert, Bonnie L. Strong, Eliza L. Jacobs, and Emily E. Conger. 2007. Interaction and participation for young Hispanic and Caucasian girls' and boys' learning of media content. Media Psychology, 9(2), 431--445. http://dx.doi.org/10.1080/15213260701291379","paperID":"None"},{"content":"Bernie Carter, Lucy Bray, Janine Arnott, Karen Ford, Annette Dickinson, Tineke Water, Cassandra Tichanow, and Karyn Sanson. 2014. Making Research 'Click' with Children.","paperID":"None"},{"content":"Alice Frazeur Cross, Elizabeth K. Traub, Lois Hutter-Pishgahi, and Gen Shelton. 2004. Elements of successful inclusion for children with significant disabilities. Topics in Early Childhood Special Education, 24(3), 169--183. http://dx.doi.org/10.1177/02711214040240030401","paperID":"None"},{"content":"Tim Fidgeon. 2011. Why Children Love Tablet PCs Usability Implications. Retrieved September 17, 2015 from http://www.spotless.co.uk/insights/why-childrenlove-tablet-pcs.","paperID":"None"},{"content":"Christopher Frauenberger. 2015. Disability and technology: A critical realist perspective. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15), 89--96. http://dx.doi.org/10.1145/2700648.2809851","paperID":"None"},{"content":"Christopher Frauenberger. 2015. Rethinking autism and technology. interactions, 22(2), 57--59. http://dx.doi.org/10.1145/2728604","paperID":"None"},{"content":"Kenneth R. Ginsburg. 2007. The importance of play in promoting healthy child development and maintaining strong parent-child bonds. Pediatrics, 119(1), 182--191. http://dx.doi.org/10.1111/j.1365--2214.2007.00799_8.x","paperID":"None"},{"content":"Isabela Granic, Adam Lobel, and Rutger C. M. E. Engels. The benefits of playing video games. American Psychologist, 69(1), 66--78. http://dx.doi.org/10.1037/a0034857","paperID":"None"},{"content":"Raymond Holt, Anne-Marie Moore, and Angharad Beckett. 2014. Together through play: Facilitating meaningful play for disabled & non-disabled children through participatory design. Inclusive Designing, 245255. Springer International Publishing. http://dx.doi.org/10.1007/978--3--319-05095--9_22","paperID":"None"},{"content":"Donald Horton and R. Richard Wohl. 1956. Mass communication and para-social interaction: Observations on intimacy at a distance. Psychiatry, 19(1), 215--229. http://dx.doi.org/10.1007/978--3--658-09923--7_7","paperID":"None"},{"content":"Juan Pablo Hourcade, Stacy R. Williams, Ellen A. Miller, Kelsey E. Huebner, and Lucas J. Liang. 2013. Evaluation of tablet apps to encourage social interaction in children with autism spectrum disorders. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3197--3206. http://dx.doi.org/10.1145/2470654.2466438","paperID":"None"},{"content":"Julie A. Kientz, Matthew S. Goodwin, Gillian R. Hayes, and Gregory D. Abowd. 2013. Interactive technologies for autism. Synthesis Lectures on Assistive, Rehabilitative, and Health-Preserving Technologies, 2(2), 1--177. http://dx.doi.org/10.2200/s00533ed1v01y201309arh00","paperID":"None"},{"content":"Tomi Kinnunen and Haizhou Li. An overview of textindependent speaker recognition: From features to supervectors. Speech communication, 52(1), 12--40. http://dx.doi.org/10.1016/j.specom.2009.08.009","paperID":"None"},{"content":"Robert L. Koegel, Grace A. Werner, Laurie A. Vismara, and Lynn Kern Koegel. 2005. The effectiveness of contextually supported play date interactions between children with autism and typically developing peers. Research and Practice for Persons with Severe Disabilities 30(2), 93--102. http://dx.doi.org/10.2511/rpsd.30.2.93","paperID":"None"},{"content":"Marina Krcmar. 2010. Can social meaningfulness and repeat exposure help infants and toddlers overcome the video deficit? Media Psychology, 13(1), 31--53. http://dx.doi.org/10.1080/15213260903562917","paperID":"None"},{"content":"Alexis R. Lauricella, Alice Ann Howard Gola, and Sandra L. Calvert. 2011. Toddlers' learning from socially meaningful video characters. Media Psychology, 14(2), 216--232. http://dx.doi.org/10.1080/15213269.2011.573465","paperID":"None"},{"content":"Stuart Lester and Wendy Russell. 2010. Children's Right to Play: An Examination of the Importance of Play in the Lives of Children Worldwide. Working Papers in Early Childhood Development, No. 57. Bernard van Leer Foundation.","paperID":"None"},{"content":"Jennifer Mankoff, Gillian R. Hayes, and Devva Kasnitz. 2010. Disability studies as a source of critical inquiry for the field of assistive technology. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '10), 3--10. http://doi.acm.org/10.1145/1878803.1878807","paperID":"None"},{"content":"Emily Mower, Matthew P. Black, Elisa Flores, Marian Williams, and Shrikanth Narayanan. 2011. Rachel: Design of an emotionally targeted interactive agent for children with autism. In IEEE International Conference on Multimedia and Expo (ICME), 1--6. http://dx.doi.org/10.1109/icme.2011.6011990","paperID":"None"},{"content":"PBS Kids. \"Feelings Games.\" Retrieved September 1, 2015 from http://pbskids.org/games/feelings/.","paperID":"None"},{"content":"Jean Piaget and Bärbel Inhelder. 1969. The psychology of the child. Basic Books.","paperID":"None"},{"content":"Anne Marie Piper, Eileen O'Brien, Meredith Ringel Morris, and Terry Winograd. 2006. SIDES: a cooperative tabletop computer game for social skills development. In Proceedings of the Conference on Computer Supported Cooperative Work, 1--10. http://dx.doi.org/10.1145/1180875.1180877","paperID":"None"},{"content":"Tal-Chen Rabinowitch and Ariel Knafo-Noam. 2015. Synchronous Rhythmic Interaction Enhances Children's Perceived Similarity and Closeness towards Each Other. PloS One, 10(4). http://dx.doi.org/10.1371/journal.pone.0120878","paperID":"None"},{"content":"Hayes Raffle, Rafael Ballagas, Glenda Revelle, Hiroshi Horii, Sean Follmer, Janet Go, Emily Reardon, Koichi Mori, Joseph Kaye, and Mirjana Spasojevic. 2010. Family story play: reading with young children (and Elmo) over a distance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1583--1592. http://dx.doi.org/10.1145/1753326.1753563","paperID":"None"},{"content":"Janet C. Read and Stuart MacFarlane. 2006. Using the fun toolkit and other survey methods to gather opinions in child computer interaction. In Proceedings of the Conference on Interaction design and children, 81--88. http://dx.doi.org/10.1145/1139073.1139096","paperID":"None"},{"content":"Kiley Sobel, Katie O'Leary, and Julie A. Kientz. 2015. Maximizing children's opportunities with inclusive play: considerations for interactive technology design. In Proceedings of the 14th International Conference on Interaction Design and Children, 39--48. http://dx.doi.org/10.1145/2771839.2771844","paperID":"None"},{"content":"James W. Tanaka, Samantha Lincoln, and Logan Hegg. 2003. A framework for the study and treatment of face processing deficits in autism. The development of face processing, 101--119.","paperID":"None"},{"content":"Andrea Tartaro and Justine Cassell. 2008. Playing with virtual peers: bootstrapping contingent discourse in children with autism. In Proceedings of the International Conference for the Learning Sciences, 382--389.","paperID":"None"},{"content":"Lev Semenovich Vygotsky. 1980. Mind in society: The development of higher psychological processes. Harvard University Press.","paperID":"None"}],"citation":[],"abstract":"Every child should have an equal opportunity to learn, play, and participate in his or her life. In this work, we investigate how interactive technology design features support children with and without disabilities with inclusion during play. We developed four versions of Incloodle, a two-player picture-taking tablet application, designed to be inclusive of children with different abilities and needs. Each version of the application varied in (1) whether or not it enforced co-operation between children; and in (2) whether it prompted interactions through in-app characters or more basic instructions. A laboratory study revealed technology-enforced cooperation was helpful for child pairs who needed scaffolding, but character-based prompting had little effect on children's experiences. We provide an empirical evaluation of interactive technology for inclusive play and offer guidance for designing technology that facilitates inclusive play between young neurotypical and neurodiverse children.","title":"Incloodle: Evaluating an Interactive Application for Young Children with Mixed Abilities","filename":"CHI16/p165","authors":["Kiley Sobel","Kyle Rector","Susan Evans","Julie A. Kientz"],"conference":"CHI '16"}