{"paperId":2858471,"citation":[],"reference":[{"content":"Janos Abonyi and Balázs Feil. 2007. Cluster Analysis for Data Mining and System Identification. Birkhäuser Boston.","paperID":"None"},{"content":"Lyn Y. Abramson, Martin E. Seligman, and John D. Teasdale. 1978. Learned helplessness in humans: critique and reformulation. Journal of abnormal psychology 87: 49--74. http://doi.org/10.1037/0021843X.87.1.49","paperID":"None"},{"content":"Lyn Y. Abramson, Gerald I. Metalsky, and Lauren B. Alloy. 1989. Hopelessness depression: A theory-based subtype of depression. Psychological Review 96, 358--372. http://doi.org/10.1037/0033--295X.96.2.358","paperID":"None"},{"content":"Johann Bacher, Andreas Pöge, and Knut Wenzig. 2010. Clusteranalyse: Anwendungsorientierte Einführung in Klassifikationsverfahren. Oldenbourg Wissenschaftsverlag.","paperID":"None"},{"content":"Jacob Cohen. 1988. Statistical power analysis for the behavioral sciences. Erlbaum, Hillsdale. http://doi.org/10.1234/12345678","paperID":"None"},{"content":"Oliver Dickhäuser and Joachim Stiensmeier-Pelster. 2002. Erlernte Hilflosigkeit am Computer? Geschlechtsunterschiede in computerspezifischen Attributionen [Learned helplessness in working with computers? Gender differences in computer-related attributions]. Psychologie in Erziehung und Unterricht 49: 44--55.","paperID":"None"},{"content":"Oliver Dickhäuser and Joachim Stiensmeier-Pelster. 2002. Entwicklung eines Fragebogens zur Erfassung computerspezifischer Attributionen. Diagnostica 46, 2: 103--111. http://doi.org/10.1026//0012--1924.46.2.103","paperID":"None"},{"content":"Carol S. Dweck. 1999. Self-theories: Their role in motivation, personality, and development. Psychology Press, Hove. http://doi.org/10.1007/BF01544611","paperID":"None"},{"content":"Valerie S. Folkes. 1988. Recent Attribution Research in Consumer Behavior: A Review and New Directions. Journal of Consumer Research 14, 548. http://doi.org/10.1086/209135","paperID":"None"},{"content":"Friedrich Försterling. 2001. Attribution. An introduction to theories, research, and applications. Psychology Press, Hove.","paperID":"None"},{"content":"Nicolas Gillet, Robert J. Vallerand, and Elisabeth Rosnet. 2009. Motivational clusters and performance in a real-life setting. Motivation and Emotion 33, 1: 49--62.","paperID":"None"},{"content":"Sascha R. Guczka and Monique Janneck. 2012. Erfassung von Attributionsstilen in der MCI -- eine empirische Annäherung. Reiterer, H., Deussen, O. (Hrsg.), Mensch & Computer 2012: interaktiv informiert -- allgegenwärtig und allumfassend!? In Reiterer, H., Deussen, O. (Hrsg.), 223--232.","paperID":"None"},{"content":"Stephanie J. Hanrahan, J. Robert Grove, and John A. Hattie. 1989. Development of a questionnaire measure of sportrelated attributional style. International Journal of Sport Psychology Vol 20(2): 114--134.","paperID":"None"},{"content":"Andreas Hinderks, Martin Schrepp, and Jörg Thomaschewski. Analyzing the User Experience Questionnaire. Retrieved 22 September 2015 from http://www.ueq-online.org/","paperID":"None"},{"content":"Monique Janneck and Sascha R Guczka. 2013. The Resigned, the Confident, and the Humble: A Typology of Computer-Related Attribution Styles, In Human Factors in Computing and Informatics (Proc. SouthCHI 2013).","paperID":"None"},{"content":"Robin H. Kay. 1990. The relation between locus of control and computer literacy. Journal of Research on Computing in Education 22, 2: 464. Retrieved from https://vpn.cut.ac.cy/","paperID":"None"},{"content":"Grace Kovenklioglu and Jeffrey H. Greenhaus. 1978. Causal attributions, expectations, and task performance. Journal of Applied Psychology 63, 698--705. http://doi.org/10.1037/0021--9010.63.6.698","paperID":"None"},{"content":"Bettina Laugwitz, Theo Held, and Martin Schrepp. 2008. Construction and Evaluation of a User Experience Questionnaire. In HCI and Usability for education and work, proceedings, 63--76.","paperID":"None"},{"content":"Robert G. Lord and Jonathan E. Smith. 1983. Theoretical, Information Processing, and Situational Factors Affecting Attribution Theory Models of Organizational Behavior. Academy of Management Review 8, 1: 50--60.","paperID":"None"},{"content":"Herbert W. Marsh, Barbara M. Byrne, and Richard J. Shavelson. 1988. A multifaceted academic selfconcept: Its hierarchical structure and its relation to academic achievement. Journal of Educational Psychology 80: 366--380. http://doi.org/10.1037/00220663.80.3.366","paperID":"None"},{"content":"Adelka Niels, Sascha R. Guczka, and Monique Janneck. 2015. Computer-related Causal Attributions: The Role of Sociodemographic Factors. In Proceedings of 6th International Conference on Applied Human Factors and Ergonomics (AHFE 2015) and the Affiliated Conferences, AHFE 2015. Elsevier, pp. 2483--2490.","paperID":"None"},{"content":"Adelka Niels and Monique Janneck. 2015. ComputerRelated Attribution Styles: Typology and Data Collection Methods. In J. Abascal et al. (Eds.), INTERACT 2015, Part II, LNCS 9297, pp. 274--291.","paperID":"None"},{"content":"Jakob Nielsen and Thomas K. Landauer. 1993. A mathematical model of the finding of usability problems. In CHI '93 Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems, pp. 206--213.","paperID":"None"},{"content":"Christopher Peterson, Amy Semmel, Carl von Baeyer, Lyn Y. Abramson, Gerald I. Metalsky, and Martin E. Seligman. 1982. The attributional Style Questionnaire. Cognitive Therapy and Research 6, 3: 287--299. http://doi.org/10.1007/BF01173577","paperID":"None"},{"content":"Martin Schrepp, Andreas Hinderks, and Jörg Thomaschewski. 214AD. Applying the User Experience Questionnaire (UEQ) in Different Evaluation Scenarios. In Design, User Experience, and Usability. Theories, Methods, and Tools for Designing the User Experience, Marcus Aaron (ed.). Springer International Publishing, Springer International Publishing, 383--392.","paperID":"None"},{"content":"Ralf Schwarzer. 1994. Causal attributions as healthrelated cognitions. In F. Försterling & J. StiensmeierPelster, Attributionstheorie. Grundlagen und Anwendungen, pp. 213--234.","paperID":"None"},{"content":"Astrid M. Sølvberg. 2002. Gender differences in computer-related control beliefs and home computer use. Scandinavian Journal of Educational Research 46: 409--426.","paperID":"None"},{"content":"Bernard Weiner. 1985. An attributional theory of achievement motivation and emotion. Psychological review 92, 4: 548--573. http://doi.org/10.1037/0033295X.92.4.548","paperID":"None"},{"content":"Bernard Weiner. 1974. Achievement motivation and attribution theory. General Learning Press, Moristown.","paperID":"None"}],"abstract":"Causal Attribution research deals with the explanations people find in situations of success and failure for why things happened the way they did, and the extent of control they feel to have over the situation. Attributing success and failure differently has an impact on our emotions, our motivation, and behavior. However, so far research on computer-related attributions has not answered the question whether different attribution patterns influence system evaluation in usability tests. This question formed the basis for our investigation. Two standardized questionnaires were used to measure users' attribution patterns and users' system evaluations. The usability tests were conducted in our laboratory with N=51 participants. At large, our results suggest that there are notable influences of users' attribution patterns on their evaluation of system quality, especially in situations of success.","title":"The Impact of Causal Attributions on System Evaluation in Usability Tests","filename":"CHI16/p3115","authors":["Adelka Niels","Sascha R. Guczka","Monique Janneck"],"conference":"CHI '16"}