{"paperId":2858098,"reference":[{"content":"Mara Balestrini, Jon Bird, Paul Marshall, Alberto Zaro, and Yvonne Rogers. 2014. Understanding sustained community engagement. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 2675--2684. http://doi.org/10.1145/2556288.2557323","paperID":"None"},{"content":"Peter van den Besselaar. 2005. Communities and Technologies 2005: Proceedings of the Second Communities and Technologies Conference, Milano 2005. Springer Science & Business Media.","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2008. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2:77--101.","paperID":"None"},{"content":"Michael M Burgess. 2014. From \"trust us\" to participatory governance: Deliberative publics and science policy. Public understanding of science (Bristol, England) 23, 1: 48--52.","paperID":"None"},{"content":"John M. Carroll, Michael Horning, Blaine Hoffman, Craig Ganoe, Harold Robinson, and Mary Beth Rosson. 2011. Community Network 2.0: Visions, Participation, and Engagement in New Information Infrastructures. In End-User Development, Maria Francesca Costabile, Yvonne Dittrich, Gerhard Fischer and Antonio Piccinno (eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 270--275.","paperID":"None"},{"content":"John M. Carroll and Mary Beth Rosson. 2007. Participatory design in community informatics. Design Studies 28, 3: 243--261.","paperID":"None"},{"content":"Alan Chamberlain, Andy Crabtree, and Mark Davies. 2013. Community engagement for research. Proceedings of the 6th International Conference on Communities and Technologies C&T '13, ACM Press, 131--139. http://doi.org/10.1145/2482991.2483001","paperID":"None"},{"content":"Sandy Claes, Niels Wouters, Karin Slegers, and Andrew Vande Moere. 2015. Controlling In-the-Wild Evaluation Studies of Public Displays. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 81--84. http://doi.org/10.1145/2702123.2702353","paperID":"None"},{"content":"V. Clarke and V. Braun. 2013. Teaching thematic analysis: Overcoming challenges and developing strategies for effective learning. The Psychologist 26, 2:120--123.","paperID":"None"},{"content":"A Cornwall and R Jewkes. 1995. What is participatory research? Social science & medicine (1982) 41, 12: 1667--76.","paperID":"None"},{"content":"Clara Crivellaro, Rob Comber, John Bowers, Peter C. Wright, and Patrick Olivier. 2014. A pool of dreams. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 3573--3582. http://doi.org/10.1145/2556288.2557100","paperID":"None"},{"content":"Christopher A. Le Dantec, Mariam Asad, Aditi Misra, and Kari E. Watkins. 2015. Planning with Crowdsourced Data. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15, ACM Press, 1717--1727. http://doi.org/10.1145/2675133.2675212","paperID":"None"},{"content":"Christopher A. Le Dantec and Sarah Fox. 2015. Strangers at the Gate. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15, ACM Press, 1348--1358. http://doi.org/10.1145/2675133.2675147","paperID":"None"},{"content":"Christopher Le Dantec. 2012. Participation and publics. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, ACM Press, 1351--1360. http://doi.org/10.1145/2207676.2208593","paperID":"None"},{"content":"Rogério DePaula. 2004. Lost in translation. Proceedings of the eighth conference on Participatory design Artful integration: interweaving media, materials and practices - PDC 04, ACM Press, 162. http://doi.org/10.1145/1011870.1011890","paperID":"None"},{"content":"John S. Dryzek. 2000. Deliberative Democracy and Beyond: Liberals, Critics, Contestations. Oxford University Press.","paperID":"None"},{"content":"Karen E. Fisher, Joan C. Durrance, and Marian Bouch Hinton. 2004. Information grounds and the use of need-based services by immigrants in Queens, New York: A context-based, outcome evaluation approach. Journal of the American Society for Information Science and Technology 55, 8: 754--766.","paperID":"None"},{"content":"Karen E. Fisher and Charles M. Naumer. 2006. Information Grounds: Theoretical Basis and Emperical Findings on Information Flow in Social Settings. In New Directions in Human Information Behaviour, A Spink and C Cole (eds.). Springer, 93--111.","paperID":"None"},{"content":"JS Fishkin and RC Luskin. 2005. Experimenting with a Democratic Ideal: Deliberative Polling and Public Opinion. Acta Politica 40: 284--298.","paperID":"None"},{"content":"Sarah Gallacher, Connie Golsteijn, Lorna Wall, Lisa Koeman, Sami Andberg, Licia Capra and Yvonne Rogers. 2015. Getting quizzical about physical. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing UbiComp '15, ACM Press, 263--273. http://doi.org/10.1145/2750858.2807529","paperID":"None"},{"content":"Björn-Sören Gigler, Samantha Custer, Savita Bailur, Elizabeth Dodds, Saher Asad, and Elena GagievaPetrova. 2014. Closing the Feedback Loop: Can Technology Amplify Citezen Voices? In Closing the feedback Loop: Can Technology Briidge the Accountability Gap?, Björn-Sören Gigler and Savita Bailur (eds.). The World Bank, 211--270.","paperID":"None"},{"content":"Connie Golsteijn, Sarah Gallacher, Lisa Koeman, Lorna Wall, Sami Andberg, Yvonne Rogers and Licia Capra. 2015. VoxBox. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '14, ACM Press, 201--208. http://doi.org/10.1145/2677199.2680588","paperID":"None"},{"content":"Jorge Goncalves, Denzil Ferreira, Simo Hosio, Yong Liu, Jakob Rogstadius, Hannu Kukka and Vassilis Kostakos. 2013. Crowdsourcing on the spot. Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing UbiComp '13, ACM Press, 753. http://doi.org/10.1145/2493432.2493481","paperID":"None"},{"content":"Jorge Goncalves, Simo Hosio, Yong Liu, and Vassilis Kostakos. 2014. Eliciting situated feedback: A comparison of paper, web forms and public displays. Displays 35, 1: 27--37. http://doi.org/10.1016/j.displa.2013.12.002","paperID":"None"},{"content":"Derek L. Hansen, Jes A. Koepfler, Paul T. Jaeger, John C. Bertot, and Tracy Viselli. 2014. Civic action brokering platforms. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14, ACM Press, 1308--1322. http://doi.org/10.1145/2531602.2531714","paperID":"None"},{"content":"Mike Harding, Bran Knowles, Nigel Davies, and Mark Rouncefield. 2015. HCI, Civic Engagement & Trust. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 2833--2842. http://doi.org/10.1145/2702123.2702255","paperID":"None"},{"content":"Simo Hosio, Jorge Goncalves, Hannu Kukka, Alan Chamberlain, and Alessio Malizia. 2014. What's in it for me. Proceedings of The International Symposium on Pervasive Displays - PerDis '14, ACM Press, 174--179. http://doi.org/10.1145/2611009.2611012","paperID":"None"},{"content":"Lisa Koeman, Vaiva Kalnikaité, and Yvonne Rogers. 2015. \"Everyone Is Talking about It!\" Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 3127--3136. http://doi.org/10.1145/2702123.2702263","paperID":"None"},{"content":"Ajit Krishnaswamy. 2004. Participatory Research: Strategies and Tools. Practitioner: Newsletter of the National Network of Forest Practitioner 22: 17--22.","paperID":"None"},{"content":"Yu-Hao Lee and Gary Hsieh. 2013. Does slacktivism hurt activism? Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13, ACM Press, 811. http://doi.org/10.1145/2470654.2470770","paperID":"None"},{"content":"Cristiano Maciel, Licínio Roque, and Ana Cristina Bicharra Garcia. 2009. Democratic citizenship community: a social network to promote e-deliberative process. Proceedings from the 10th Digital Government Society of North America, 25--34. 7","paperID":"None"},{"content":"Jane Mansbridge. 1999. Everyday talk in the deliberative system. In Deliberative Politics: Essays on Democracy and Disagreement., Stephen Macedo (ed.). Oxford University Press, Oxford.","paperID":"None"},{"content":"Viktor Mayer-Schönberger and Kenneth Cukier. 2013. Big Data: A Revolution that Will Transform how We Live, Work, and Think. Houghton Mifflin Harcourt.","paperID":"None"},{"content":"Cecelia B. Merkel, Lu Xiao, Umer Farooq, Craig H. Ganoe, Roderick Lee, John M. Carroll and Mary Beth Rosson. 2004. Participatory design in community computing contexts. Proceedings of the eighth conference on Participatory design Artful integration: interweaving media, materials and practices - PDC 04, ACM Press, 1. http://doi.org/10.1145/1011870.1011872","paperID":"None"},{"content":"Giles Moss and Stephen Coleman. 2013. Deliberative Manoeuvres in the Digital Darkness: e-Democracy Policy in the UK. The British Journal of Politics & International Relations 16: 410--427.","paperID":"None"},{"content":"Ray Oldenburg. 2001. Celebrating the Third Place: Inspiring Stories about the \"great Good Places\" at the Heart of Our Communities. Da Capo Press.","paperID":"None"},{"content":"Jeremy Pitt, Lloyd Kamara, Marek Sergot, and Alexander Artikis. 2005. Voting in online deliberative assemblies. Proceedings of the 10th international conference on Artificial intelligence and law - ICAIL '05, ACM Press, 195. http://doi.org/10.1145/1165485.1165516","paperID":"None"},{"content":"Bryan C. Semaan, Scott P. Robertson, Sara Douglas, and Misa Maruyama. 2014. Social media supporting political deliberation across multiple public spheres. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14, ACM Press, 1409--1421. http://doi.org/10.1145/2531602.2531605","paperID":"None"},{"content":"Bryan Semaan, Heather Faucett, Scott Robertson, Misa Maruyama, and Sara Douglas. 2015. Navigating Imagined Audiences. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15, ACM Press, 1158--1169. http://doi.org/10.1145/2675133.2675187","paperID":"None"},{"content":"Bryan Semaan, Heather Faucett, Scott P. Robertson, Misa Maruyama, and Sara Douglas. 2015. Designing Political Deliberation Environments to Support Interactions in the Public Sphere. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 3167--3176. http://doi.org/10.1145/2702123.2702403","paperID":"None"},{"content":"Lisa J. Servon. 2008. Bridging the Digital Divide: Technology, Community and Public Policy. Wiley, Hoboken.","paperID":"None"},{"content":"Kate Starbird and Leysia Palen. 2012. (How) will the revolution be retweeted? Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work CSCW '12, ACM Press, 7. http://doi.org/10.1145/2145204.2145212","paperID":"None"},{"content":"Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasilis Vlachokyriakos, Lillie Grainger and Jessa Lingel. 2015. Data-in-Place. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 2863--2872. http://doi.org/10.1145/2702123.2702558","paperID":"None"},{"content":"Nick Taylor, Keith Cheverst, Peter Wright, and Patrick Olivier. 2013. Leaving the wild. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13, ACM Press, 1549. http://doi.org/10.1145/2470654.2466206","paperID":"None"},{"content":"Nick Taylor, Justin Marshall, Alicia Blum-Ross, Justin Marshall, Alicia Blum-Ross, John Mills, Jon Rogers, Paul Egglestone, David M. Frohlich, Peter Wright and Patrick Olivier. 2012. Viewpoint. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, ACM Press, 1361. http://doi.org/10.1145/2207676.2208594","paperID":"None"},{"content":"Aaron S. Veenstra, Narayanan Iyer, Mohammad Delwar Hossain, and Jiwoo Park. 2014. Time, place, technology: Twitter as an information source in the Wisconsin labor protests. Computers in Human Behavior 31: 65--72.","paperID":"None"},{"content":"Vasilis Vlachokyriakos, Rob Comber, Karim Ladha, Nick Taylor, Paul Dunphy, Patrick McCorry and Patrick Olivier. 2014. PosterVote. Proceedings of the 2014 conference on Designing interactive systems DIS '14, ACM Press, 795--804. http://doi.org/10.1145/2598510.2598523","paperID":"None"},{"content":"William Foote Whyte. 1995. Encounters with participatory action research. Qualitative Sociology 18, 3: 289--299.","paperID":"None"}],"abstract":"In recent years there has been an increased focus upon developing platforms for community decision-making, and an awareness of the importance of handing over civic platforms to community organisations to oversee the process of decision-making at a local level. In this paper, we detail fieldwork from working with two community organisations who used our distributed situated devices as part of consultation processes. We focus on some of the mundane and often-untold aspects of this type of work: how questions for consultations were formed, how locations for devices were determined, and the ways in which the data collected fed into decision-making processes. We highlight a number of challenges for HCI and civic technology research going forward, related to the role of the researcher, the messiness of decision making in communities, and the ability of community organisations to influence how citizens participate in democratic processes.","citation":[],"title":"Reflections on Deploying Distributed Consultation Technologies with Community Organisations","filename":"CHI16/p2945","authors":["Ian G. Johnson","John Vines","Nick Taylor","Edward Jenkins","Justin Marshall"],"conference":"CHI '16"}