{"paperId":2858551,"citation":[],"abstract":"Rumors are regular features of crisis events due to the extreme uncertainty and lack of information that often characterizes these settings. Despite recent research that explores rumoring during crisis events on social media platforms, limited work has focused explicitly on how individuals and groups express uncertainty. Here we develop and apply a flexible typology for types of expressed uncertainty. By applying our framework across six rumors from two crisis events we demonstrate the role of uncertainty in the collective sensemaking process that occurs during crisis events.","reference":[{"content":"Gordon W. Allport and Leo Postman. 1947. The Psychology of Rumor. Henry Holt and Company.","paperID":"None"},{"content":"Cynthia Andrews, Elodie Fichet, Stella Ding, Emma S. Spiro, and Kate Starbird. 2016. Keeping Up with the Tweet-Dashians: The Impact of 'Official' Accounts on Online Rumoring. In Proceedings of the ACM 2016 Computer Supported Cooperative Work (CSCW 2016).","paperID":"None"},{"content":"Susan Anthony. 1973. Anxiety and rumor. The Journal of Social Psychology, 89, 1: 91--98","paperID":"None"},{"content":"Ahmer Arif, Kelley Shanahan, Fang-Ju Chou, Yoanna Dosouto, Kate Starbird, Emma S. Spiro. 2016. How Information Snowballs: Exploring the Role of Exposure in Online Rumor Propagation. In Proceedings of the ACM 2016 Computer Supported Cooperative Work (CSCW 2016).","paperID":"None"},{"content":"Austin S. Babrow, Chris R. Kasch, and Leigh A. Ford. 1998. The many meanings of uncertainty in illness: Toward a systematic accounting. Health Communication, 10(1), 1--23.","paperID":"None"},{"content":"Austin S. Babrow, Stephen C. Hines, and Chris R. Kasch. 2000. Managing uncertainty in illness explanation: An application of problematic integration theory. Explaining illness: Research, theory, and strategies, 41--67.","paperID":"None"},{"content":"Prashant Bordia, and Nicholas DiFonzo. 2004. Problem solving in social interactions on the Internet: Rumor as social cognition. Social Psychology Quarterly 67, no. 1 (2004): 33--49.","paperID":"None"},{"content":"Dale E. Brashers. 2001. Communication and uncertainty management. Journal of Communication, 51(3), 477--497.","paperID":"None"},{"content":"Carlos Castillo, Marcelo Mendoza, and Barbara Poblete. 2013. Predicting information credibility in time-sensitive social media. Internet Research 23, no. 5: 560--588.","paperID":"None"},{"content":"Nicholas DiFonzo and Prashant Bordia. 2007. Rumor psychology: Social and organizational approaches. American Psychological Association.","paperID":"None"},{"content":"Edward R. Geiselman, Ronald P. Fisher, Gina Cohen, and Heidi Holland. 1986. Eyewitness responses to leading and misleading questions under the cognitive interview. Journal of Police Science & Administration.","paperID":"None"},{"content":"Amanda L. Hughes, and Leysia Palen. 2012. The evolving role of the public information officer: An examination of social media in emergency management. Journal of Homeland Security and Emergency Management, 9(1).","paperID":"None"},{"content":"Starr Roxanne Hiltz, Jane Kushma, and Linda Plotnick. 2014. Use of social media by US public sector emergency managers: Barriers and wish lists. In Proceedings of ISCRAM (2014).","paperID":"None"},{"content":"Amanda L. Hughes, Lise A. St Denis, Leysia Palen, and Kenneth M. Anderson. 2014. Online public communications by police & fire services during the 2012 Hurricane Sandy. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, pp. 1505--1514.","paperID":"None"},{"content":"Amanda L. Hughes, and Leysia Palen (2012). The Evolving Role of the Public Information Officer: An Examination of Social Media in Emergency Management. Journal of Homeland Security and Emergency Management, 9 (1).","paperID":"None"},{"content":"Elizabeth F. Loftus, (1975). Leading questions and the eyewitness report. Cognitive psychology, 7(4), 560--572.","paperID":"None"},{"content":"Jim Maddock, Kate Starbird, Haneen J. Al-Hassani, Daniel E. Sandoval, Mania Orand, and Robert M. Mason. Characterizing online rumoring behavior using multi-dimensional signatures. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (ACM 2015) 228--241.","paperID":"None"},{"content":"Jim Maddock, Kate Starbird and Robert M. Mason. (2015). Using Historical Twitter Data for Research: Ethical Challenges of Tweet Deletions. Presented at CSCW '15 Workshop on Ethics at the 2015 Conference on Computer Supported Cooperative Work (CSCW 2015), Vancouver, Canada.","paperID":"None"},{"content":"Mendoza, Marcelo, Barbara Poblete, and Carlos Castillo. 2010. Twitter Under Crisis: Can we trust what we RT?. In Proceedings of the first workshop on social media analytics, pp. 71--79. ACM.","paperID":"None"},{"content":"Onook Oh, Kyounghee Hazel Kwon, and H. Raghav Rao. 2010. An Exploration of Social Media in Extreme Events: Rumor Theory and Twitter during the Haiti Earthquake 2010. In ICIS, p. 231.","paperID":"None"},{"content":"Onook Oh, Manish Agrawal and H. Raghav Rao. Community Intelligence and Social Media Services: A Rumor Theoretical Analysis of Tweets during Social Crises. Mis. Quarterly 37(2), 407--426.","paperID":"None"},{"content":"Susan Coppess Pendleton. 1998. Rumor research revisited and expanded. Language & Communication, 18,1: 69--86.","paperID":"None"},{"content":"Ellen F. Prince, Joel Frader, and Charles Bosk. 1982. On hedging in physician-physician discourse. Linguistics and the Professions, 8: 83--97.","paperID":"None"},{"content":"Ralph L. Rosnow. 1980. Psychology of rumor reconsidered. Psychological Bulletin. 87, 3: 578--591.","paperID":"None"},{"content":"Ralph L. Rosnow, 1991. Inside rumor: A personal journey. American Psychologist, 46, 5: 484.","paperID":"None"},{"content":"Tamotsu Shibutani. 1966. Improvised News: A Sociological Study of Rumor. NY: Bobbs-Merrill.","paperID":"None"},{"content":"Emma S. Spiro, Sean Fitzhugh, Jeannette Sutton, Nicole Pierski, Matt Greczek, and Carter T. Butts. 2012. Rumoring during extreme events: A case study of Deepwater Horizon 2010. In Proceedings of the 4th Annual ACM Web Science Conference (ACM 2012), 275--283.","paperID":"None"},{"content":"Kate Starbird, Dharma Dailey, Ann Hayward Walker, Thomas M. Leschine, Robert Pavia, and Ann Bostrom. 2015. Social Media, Public Participation, and the 2010 BP Deepwater Horizon Oil Spill. Human and Ecological Risk Assessment: An International Journal, 21, 3: 605--630.","paperID":"None"},{"content":"Kate Starbird, Jim Maddock, Mania Orand, Peg Achterman, and Robert M. Mason, (2014). Rumors, False Flags, and Digital Vigilantes: Misinformation on Twitter after the 2013 Boston Marathon Bombings. Short paper. iConference 2014, Berlin, Germany.","paperID":"None"},{"content":"Kate Starbird, and Leysia Palen. 2010. Pass it on?: Retweeting in mass emergency. In Proceedings of the International Conference on Information Systems for Crisis Response and Management (ISCRAM 2010).","paperID":"None"},{"content":"Kate Starbird, and Leysia Palen. 2011. Voluntweeters: Self-organizing by digital volunteers in times of crisis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (ACM 2011), 10711080.","paperID":"None"},{"content":"William B. Swann, Toni Giuliano, and Daniel M. Wegner. 1982. Where leading questions can lead: The power of conjecture in social interaction. Journal of Personality and Social Psychology 42(6): 1025.","paperID":"None"},{"content":"Jeannette Sutton. 2010. \"Twittering TN: Distributed Networks and Collaboration following a Technological Disaster. In Proceedings of the International Conference on Information Systems for Crisis Response and Management (ISCRAM 2010).","paperID":"None"},{"content":"Jeannette Sutton, Leysia Palen, and Irina Shklovski. 2008. Backchannels on the Front Lines: Emergent Uses of Social Media in the 2007 Southern California Wildfires. In Proceedings of the 5th International ISCRAM Conference, 1--9.","paperID":"None"},{"content":"Jeannette C. Sutton, Ben Gibson, Emma S. Spiro, Cedar League, Sean M. Fitzhugh, and Carter T. Butts. 2015. What it takes to get passed on: message content, style, and structure as predictors of retransmission in the Boston Marathon bombing response. PLoS one 10(8): e0134452.","paperID":"None"},{"content":"Ralph H. Turner, and Lewis M. Killian. 1957. Collective Behavior. Prentice-Hall, Englewood Cliffs, NJ.","paperID":"None"},{"content":"Charles J. Walker & Carol A. Beckerle. 1987. The effect of anxiety on rumor transmission. Journal of Social Behavior and Personality, 2, 353--360.","paperID":"None"},{"content":"Karl E. Weick, and Kathleen M. Sutcliffe. 2011. Managing the unexpected: Resilient performance in an age of uncertainty. John Wiley & Sons..","paperID":"None"},{"content":"Zhe Zhao, Paul Resnick, and Qiaozhu Mei. 2015. Enquiring Minds: Early Detection of Rumors in Social Media from Enquiry Posts. In Proceedings of the 24th International Conference on World Wide Web, pp. 1395--1405. International World Wide Web Conferences Steering Committee.","paperID":"None"}],"title":"Could This Be True?: I Think So! Expressed Uncertainty in Online Rumoring","filename":"CHI16/p360","authors":["Kate Starbird","Emma Spiro","Isabelle Edwards","Kaitlyn Zhou","Jim Maddock","Sindhuja Narasimhan"],"conference":"CHI '16"}