{"paperId":2858395,"citation":[],"abstract":"Autonomy experience constitutes a core part of the intrinsic motivation of playing games. While research has explored how autonomy is afforded by a game's design, little is known about the role of the social context of play. Particularly, engaging with serious games or gamified applications is often obligatory, which may thwart autonomy. To tease out contextual factors that affect autonomy, we conducted a qualitative interview study that compared game-play experience in leisure and work contexts. We found that leisure contexts, particularly solitary play, support autonomy through a time and space shielded from outer demands, the license to (dis)engage with and configure the situation to fit one's spontaneous interests, and a lack of social and material consequence. Thwarted autonomy occurs both in leisure and work contexts when players' spontaneous interests mismatch socially demanded gameplay. We discuss implications for entertainment and applied gaming.","reference":[{"content":"Gordon M. Burghardt. 2005. The Genesis of Animal Play: Testing the Limits. MIT Press.","paperID":"None"},{"content":"Roger Caillois. 200 Man, Play, and Games. University of Illinois Press.","paperID":"None"},{"content":"Thomas M. Connolly, Elizabeth A. Boyle, Ewan Mac-Arthur, Thomas Hainey, James M. Boyle. 2012. A Systematic Literature Review of Empirical Evidence on Computer Games and Serious Games. Computers & Education 59, 2: 661-686.","paperID":"None"},{"content":"Juliet Corbin, Anselm L. Strauss. 2008. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. (3rd ed.). Sage.","paperID":"None"},{"content":"Yvonne A. De Kort, Wijnand A. Ijsselsteijn. 2008. People, Places, and Play: Player Experience in a Socio-Spatial Context. Computers in Entertainment 6, 2: Art. 18.","paperID":"None"},{"content":"Edward L. Deci, Richard M. Ryan. 2012. Motivation, Personality, and Development Within Embedded Social Contexts: An Overview of Self-Determination Theory. In The Oxford Handbook of Human Motivation, Richard M. Ryan (ed.). Oxford University Press, New York, 85-107.","paperID":"None"},{"content":"Menno Deen. 2015. G.A.M.E. Games Autonomy Moti-vation & Education: How Autonomy-Supportive Game Design May Improve Motivation to Learn. Ph.D Dissertation, Technische Universiteit Eindhoven, Eindhoven, NL.","paperID":"None"},{"content":"Sebastian Deterding. 2011. Situated Motivational Affordances of Game Elements: A Conceptual Model. In CHI 2011 Workshop Gamification. http://gamification-research.org/chi2011/papers.","paperID":"None"},{"content":"Sebastian Deterding. 2015. The Joys of Absence: Emotion, Emotion Display, and Interaction Tension in Video Game Play. In Proceedings of the 10th International Conference on the Foundations of Digital Games (FDG'15).","paperID":"None"},{"content":"Sebastian Deterding. 2015. The Lens of Intrinsic Skill Atoms: A Method for Gameful Design. Human-Computer Interaction 30, 3--4: 294-335.","paperID":"None"},{"content":"Julian Dibbell. 2008. The Chinese Game Room: Play, Productivity, and Computing at Their Limits. Artifact 2, 3: 1-6.","paperID":"None"},{"content":"Uwe Flick. 1997. The Episodic Interview: Small-Scale Narratives as Approach to Relevant Experiences. LSE Methodology Institute Discussion Papers - Qualitative Series. London.","paperID":"None"},{"content":"Uwe Flick. 2010. Qualitative Sozialforschung: Eine Einführung. (3rd ed.). Rowohlt.","paperID":"None"},{"content":"Brian J. Gajadhar. Understanding Player Experience in Social Digital Games: The Role of Social Presence. Ph.D. Dissertation, TU Eindhoven, Eindhoven, NL.","paperID":"None"},{"content":"Harold Garfinkel. 1967. Studies in Ethnomethodology. Polity Press.","paperID":"None"},{"content":"Erving Goffman. 1986. Frame Analysis: An Essay on the Organization of Experience. Northeastern University Press.","paperID":"None"},{"content":"Frederik de Grove, Jan van Looy, Joyce Neys, Jeroen Jansz. 2012. Playing in School or at Home? An Exploration of the Effects of Context on Educational Game Experience. Electronic Journal of E-Learning 10, 2: 199-208.","paperID":"None"},{"content":"Greg Guest, Arwen Bunce, Laura Johnson. 2006. How Many Interviews Are Enough? An Experiment with Data Saturation and Variability. Field Methods 18, 1: 59-82.","paperID":"None"},{"content":"Carrie Heeter, Yu-Hao Lee, Brian Magerko, Ben Med-ler. 2011. Impacts of Forced Serious Game Play on Vulnerable Subgroups. International Journal of Gaming and Computer-Mediated Simulations 3, 3: 34-53.","paperID":"None"},{"content":"J. Howard, K. McInnes. 2013. The Impact of Children's Perception of an Activity as Play rather than Not Play on Emotional Well-Being. Child: Care, Health and Development 39, 5: 737-742.","paperID":"None"},{"content":"Johan Huizinga. 1949. Homo Ludens: A Study of the Play-Element in Culture. Routledge & Kegan Paul.","paperID":"None"},{"content":"Gail Jefferson. 2004. Glossary of Transcript Symbols with an Introduction. In Conversation Analysis: Studies from the First Generation, Gene H. Lerner (ed.). John Benjamins, Amsterdam, Philadelphia, 13-31.","paperID":"None"},{"content":"Jesper Juul. 2005. Half-Real: Video Games between Real Rules and Fictional Worlds. MIT Press.","paperID":"None"},{"content":"Linda K. Kaye, Jo Bryce. 2012. Putting The 'Fun Factor' Into Gaming: The Influence of Social Contexts on Experiences of Playing Videogames. International Journal of Internet Science 7, 1: 23-37.","paperID":"None"},{"content":"Keunyeong Kim, Michael G. Schmierbach, Saraswathi (Saras) Bellur, Mun-Young Chung, Julia Daisy Fraustino, Frank Dardis, Lee Ahern. 2015. Is It a Sense of Autonomy, Control, or Attachment? Exploring the Effects of in-Game Customization on Game Enjoyment. Computers in Human Behavior 48: 695-705.","paperID":"None"},{"content":"Andreas Lieberoth. 2015. Shallow Gamification: Testing Psychological Effects of Framing an Activity as a Game. Games and Culture 10, 3: 229-248.","paperID":"None"},{"content":"Holin Lin, Chuen-Tsai Sun. 2011. The Role of On-lookers in Arcade Gaming: Frame Analysis of Public Behaviours. Convergence 17, 2: 125-137.","paperID":"None"},{"content":"Karen Littleton, Helen Ashman, Paul Light, Jayne Artis, Tony Roberts, Annerieke Oosterwegel. 1999. Gender, Task Contexts, and Children's Performance on a Computer-Based Task. European Journal of Psychology of Education 14, 1: 129-139.","paperID":"None"},{"content":"Ethan Mollick, Nancy Rothbard. 2014. Mandatory Fun: Consent, Gamification and the Impact of Games at Work. http://ssrn.com/abstract=2277103.","paperID":"None"},{"content":"Bonnie A. Nardi. 2009. My Life as a Night Elf Priest: An Anthropological Account of World of Warcraft. University of Michigan Press.","paperID":"None"},{"content":"Jason Nolan, Melanie McBride. 2014. Beyond Gamification: Reconceptualizing Game-Based Learning in Early Childhood Environments. Information, Communication & Society 17, 5: 594-608.","paperID":"None"},{"content":"Anthony D. Pellegrini. The Role of Play in Human Development. Oxford University Press.","paperID":"None"},{"content":"Wei Peng, Jih-Hsuan Lin, Karin A. Pfeiffer, Brian Winn. 2012. Need Satisfaction Supportive Game Features as Motivational Determinants: An Experimental Study of a Self-Determination Theory Guided Exergame. Media Psychology 15, 2: 175-196.","paperID":"None"},{"content":"Andrew K. Przybylski, Netta Weinstein, Kou Murayama, Martin F Lynch, and Richard M Ryan. 2012. The Ideal Self at Play: The Appeal of Video Games That Let You Be All You Can Be. Psychological Science 23, 1: 69-76.","paperID":"None"},{"content":"Andrew K. Przybylski, C. Scott Rigby, Richard M. Ryan. 2010. A Motivational Model of Video Game Engagement. Review of General Psychology 14, 2: 154-166.","paperID":"None"},{"content":"Leonard Reinecke, Ron Tamborini, Matthew Grizzard, Robert Lewis, Allison Eden, and Nicholas David Bowman. 2012. Characterizing Mood Management as Need Satisfaction: The Effects of Intrinsic Needs on Selective Exposure and Mood Repair. Journal of Communication 62, 3: 437-453.","paperID":"None"},{"content":"Scott Rigby, Richard M. Ryan. 2011. Glued to Games: How Video Games Draw Us in and Hold Us Spell-bound. Praeger.","paperID":"None"},{"content":"Richard M. Ryan, Edward L Deci. 2002. An Overview of Self-Determination Theory: An Organismic-Dialectical Perspective. In Handbook of Self-Determination Research, Edward L Deci, Richard M. Ryan (eds.). University of Rochester Press, Rochester, 3--36.","paperID":"None"},{"content":"Richard M. Ryan, C. Scott Rigby, Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30, 4: 344-360.","paperID":"None"},{"content":"Katie Seaborn, Deborah I. Fels. 2015. Gamification in Theory and Action: A Survey. International Journal of Human-Computer Studies 74, 2: 14--31.","paperID":"None"},{"content":"Kennon M. Sheldon, Vincent Filak. 2008. Manipulating Autonomy, Competence, and Relatedness Support in a Game-Learning Context: New Evidence That All Three Needs Matter. British Journal of Social Psychology 47, 2: 267-283.","paperID":"None"},{"content":"Jaakko Stenros. 2014. In Defence of a Magic Circle: The Social, Mental and Cultural Boundaries of Play. Transactions of the Digital Games Research Association 1, 2: 147-185.","paperID":"None"},{"content":"Yu Lan Su, Johnmarshall Reeve. 2011. A Meta-Analysis of the Effectiveness of Intervention Programs Designed to Support Autonomy. Educational Psychology Review 23, 1: 159-188.","paperID":"None"},{"content":"Ron Tamborini, Matthew Grizzard, Nicholas David Bowman, Leonard Reinecke, Robert J. Lewis, Allison Eden. 2011. Media Enjoyment as Need Satisfaction: The Contribution of Hedonic and Nonhedonic Needs. Journal of Communication 61, 6: 1025-1042.","paperID":"None"},{"content":"Ron Tamborini, Nicholas David Bowman, Allison Eden, Matthew Grizzard, Ashley Organ. 2010. Defining Media Enjoyment as the Satisfaction of Intrinsic Needs. Journal of Communication 60, 4: 758-777.","paperID":"None"},{"content":"T.L. Taylor. 2006. Play Between Worlds: Exploring Online Game Culture. MIT Press.","paperID":"None"},{"content":"Selen Turkay, Daniel Hoffman, Charles K. Kinzer, Pantiphar Chantes, Christopher Vicari. 2014. Toward Understanding the Potential of Games for Learning: Learning Theory, Game Design Characteristics, and Situating Video Games in Classrooms. Computers in the Schools 31, 1: 2-22.","paperID":"None"},{"content":"Selen Turkay. 2013. The Long Term Effects of Customization on User Experiences in an Online Social Game: A Mixed Method Study. Ph.D Dissertation. Columbia University, New York, NY.","paperID":"None"},{"content":"Mark Twain. 1876. The Adventures of Tom Sawyer. The American Publishing Company.","paperID":"None"},{"content":"Netta Weinstein, Andrew K Przybylski, Richard M. Ryan. 2009. Can Nature Make Us More Caring? Effects of Immersion in Nature on Intrinsic Aspirations and Generosity. Personality & Social Psychology Bulletin 35, 10: 1315-1329.","paperID":"None"},{"content":"Nick Yee. 2006. The Labor of Fun: How Video Games Blur the Boundaries of Work and Play. Games and Culture 1, 1: 68-71.","paperID":"None"},{"content":"Mihaly Csikszentmihalyi. 1975. Beyond Boredom and Anxiety: The Experience of Play in Work and Games. Jossey-Bass Publishers.","paperID":"None"},{"content":"Thomas Malaby. 2007. Beyond Play: A New Approach to Games. Games and Culture 2, 2: 95-113.","paperID":"None"},{"content":"Sebastian Deterding. 2015. Forced to Be Free, Partially: Participation Norms in Leisurely Video Gaming Encounters. In DiGRA 2015.","paperID":"None"},{"content":"Staffan Björk, Jussi Holopainen. 2005. Patterns in Game Design. Charles River Media.","paperID":"None"},{"content":"Sebastian Deterding. 2014. Modes of Play: A Frame Analytic Account of Video Game Play. Ph.D. Dissertation, Hamburg University, Hamburg, Germany, http://ediss.sub.uni-hamburg.de/volltexte/2014/6863/.","paperID":"None"},{"content":"Nicholas Gillet, Robert J. Vallerand, Sofiane Amoura, Brice Baldes. 2010. Influence of coaches' autonomy support on athletes' motivation and sport performance: A test of the hierarchical model of intrinsic and extrinsic motivation. Psychology of Sport and Exercise 11, 2: 155-161.","paperID":"None"},{"content":"Steven Conway. 2014. Zombification?: Gamification, motivation, and the user. Journal of Gaming & Virtual Worlds 6, 2: 129-141.","paperID":"None"},{"content":"Marigo Raftopoulos. 2014. Towards gamification transparency: A conceptual framework for the development of responsible gamified enterprise systems. Journal of Gaming & Virtual Worlds 6, 2: 159-178.","paperID":"None"},{"content":"Kellie Vella, Daniel Johnson, Leanne Hides. 2015. Playing Alone, Playing With Others: Differences in Player Experience and Indicators of Wellbeing. In Proceedings of the ACM SIGCHI annual symposium on Computer-human interaction in play (CHI PLAY'15), 3-12.","paperID":"None"},{"content":"Scott Nicholson. 2012. A User-Centered Theoretical Framework for Meaningful Gamification. In Proceedings of Games Learning Society 8.0, 223-229.","paperID":"None"},{"content":"José P. Zagal, Staffan Björk, Chris Lewis. 2013. Dark Patterns in the Design of Games. In Proceedings of Foundations of Digital Games 2013.","paperID":"None"},{"content":"Jaakko Stenros. 2015. Behind Games: Playful Mindset as Basis for Ludic Transformative Practice. In The Gameful World: Approaches, Issues, Applications, Steffen P. Walz, Sebastian Deteding (eds.). MIT Press, Cambridge, MA, 201-222.","paperID":"None"},{"content":"Edward L. Deci, Richard Koestner, Richard M. Ryan. 1999. A Meta-Analytic Review of Experiments Examining the Effects of Extrinsic Rewards on Intrinsic Motivation. Psychological Bulletin 125: 6, 627-668.","paperID":"None"},{"content":"Ross Smith. 2010. Communicate Hope: Using Games and Play to Improve Productivity: 42projects. Management Innovation eXchange. http://www.managementexchange.com/story/communicate-hope-using-games-and-play-improve-productivity-42projects","paperID":"None"},{"content":"Ross Smith. 2012. How Play and Games Transform the Culture of Work: An Interview with Ross Smith. American Journal of Play 5, 1: 1-21.","paperID":"None"},{"content":"Kevin Werbach, Dan Hunter. 2012. For the Win: How Game Thinking Can Revolutionize Your Business. Wharton Digital Press.","paperID":"None"},{"content":"Sebastian Deterding. 2012. Paidia as Paideia: From Game-Based Learning to a Life Well-Played. Keynote, Games Learning Society 8.0.","paperID":"None"}],"title":"Contextual Autonomy Support in Video Game Play: A Grounded Theory","filename":"CHI16/p3931","authors":["Sebastian Deterding"],"conference":"CHI '16"}