{"paperId":2858202,"citation":[],"abstract":"In HCI research, attention has focused on understanding external influences on workplace multitasking. We explore instead how multitasking might be influenced by individual factors: personality, stress, and sleep. Forty information workers' online activity was tracked over two work weeks. The median duration of online screen focus was 40 seconds. The personality trait of Neuroticism was associated with shorter online focus duration and Impulsivity-Urgency was associated with longer online focus duration. Stress and sleep duration showed trends to be inversely associated with online focus. Shorter focus duration was associated with lower assessed productivity at day's end. Factor analysis revealed a factor of lack of control which significantly predicts multitasking. Our results suggest that there could be a trait for distractibility where some individuals are susceptible to online attention shifting in the workplace. Our results have implications for information systems (e.g. educational systems, game design) where attention focus is key.","reference":[{"content":"John A. Bargh. 1992. The ecology of automaticity: Toward establishing the conditions needed to produce automatic processing effects. American Journal of Psychology, 105, 181--199.","paperID":"None"},{"content":"Eran Chajut and Daniel Algom. 2003. Selective attention improves under stress: implications for theories of social cognition. Journal of personality and social psychology 85.2: 231.","paperID":"None"},{"content":"Sheldon Cohen, Tom Kamarck, and Robin Mermelstein. 1983. A global measure of perceived stress. Journal of health and social behavior 1983: 385--396.","paperID":"None"},{"content":"Allessandro Couyoumdjian, Stefano Sdoia, Daniela Tempesta, Giuseppe Curcio, Elisabetta Rastellini, Luigi De Gennaro, and Michele Ferrara. 2010. The effects of sleep and sleep deprivation on task-switching performance. Journal of Sleep Research, 19, 64--70.","paperID":"None"},{"content":"Mary Czerwinski, Eric Horvitz and Susan Wilhite. 2004. A diary study of task switching and interruptions. in Proceedings CHI'04, 175--182.","paperID":"None"},{"content":"Laura Dabbish, and Robert E. Kraut. 2004. Controlling interruptions: awareness displays and social motivation for coordination. Proceedings of the 2004 ACM conference on Computer supported cooperative work, 182--191.","paperID":"None"},{"content":"Lloyd J. Edwards, Keith E. Muller, Russell D. Wolfinger, Bahjat F. Qaqish, and Oliver Schabenberger. 2008. An R2 statistic for Fixed Effects in the Linear Mixed Model. Stat Med. 2008 (27(29)). 6137.","paperID":"None"},{"content":"John L. Evenden. 1999. Varieties of impulsivity. Psychopharmacology, 146(4), 348--361.","paperID":"None"},{"content":"Hans J. Eysenck, Hans J. and Michael W. Eysenck. 1987. Personality and individual differences. Plenum.","paperID":"None"},{"content":"Kerry Fairbrother and James Warn. 2003. Workplace dimensions, stress and job satisfaction. Journal of managerial psychology 18.1: 8--21.","paperID":"None"},{"content":"Sophie Forster and Nilli Lavie. 2015. Establishing the attention-distractibility trait. Psychological science. Dec. 14. 0956797615617761.","paperID":"None"},{"content":"Michael R. Frone, Marcia Russell, and M. Lyme Cooper. 1994. Relationship between job and family satisfaction: Causal or noncausal covariation? Journal of Management. 20:565--579.","paperID":"None"},{"content":"Richard Gendreau. 2007. The new techno culture in the workplace and at home. Journal of American Academy of Business, Cambridge, 11(2), 191--196.","paperID":"None"},{"content":"Namni Goel, Hengyi Rao, Jeffrey S. Durmer, and David F. Dinges. 2009. Neurocognitive consequences of sleep deprivation. Seminars in Neurology, 29, 320--339.","paperID":"None"},{"content":"Victor M. Gonzalez and Gloria Mark. 2004. \"Constant, Constant, Multi-tasking Craziness?: Managing Multiple Working Spheres. Proceedings CHI'04, 113120.","paperID":"None"},{"content":"Sture Holm. 1979. A simple sequentially rejective multiple test procedure. Scandinavian journal of statistics, 6, 65--70.","paperID":"None"},{"content":"Briana N Horwitz, Gloria Luong, and Susan T. Charles. 2008. Neuroticism and extraversion share genetic and environmental effects with negative and positive mood spillover in a nationally representative sample. Personality and individual differences, 45(7), 636--642.","paperID":"None"},{"content":"Pascal Huguet, Marie P. Galvaing, Jean M. Monteil, and Florence Dumas. 1999. Social presence effects in the Stroop task: Further evidence for an attentional view of social facilitation. Journal of Personality and Social Psychology, 77, 1011--1025.","paperID":"None"},{"content":"Shamsi T. Iqbal and Eric Horvitz. 2007. Disruption and Recovery of Computing Tasks: Field Study, Analysis and Directions. in Proceedings of CHI'07, 677--686.","paperID":"None"},{"content":"Steven W.Keele, and Harold L. Hawkins. 1982. Explorations of Individual Differences Relevant to High Level Skill. Journal of Motor Behavior, 14(1), 323.","paperID":"None"},{"content":"Derrick N. Lawley, and Albert E. Maxwell. 1971. Factor Analysis as a Statistical Method. New York: American Elsevier Pub. Co.","paperID":"None"},{"content":"Archana Laxmisan, Forogh Hakimzada, Osman R. Sayan, Robert A. Green, Jiajie Zhang, and Vimla L. Patel. 2007. The multitasking clinician: decisionmaking and cognitive demand during and after team handoffs in emergency care. International journal of medical informatics, 76(11), 801--811.","paperID":"None"},{"content":"Richard S.Lazarus, Psychological stress in the workplace. 1995. Occupational stress: A handbook 1: 3--14.","paperID":"None"},{"content":"Julian Lim and David F. Dinges. 2008. Sleep deprivation and vigilant attention. Annals of the New York Academy of Sciences, 1129, 305--322.","paperID":"None"},{"content":"Gloria Mark, Shamsi T. Iqbal, Mary Czerwinski, and Paul Johns. 2014. Bored Tuesdays and focused afternoons: The rhythm of attention and online activity in the workplace. Proceedings of CHI'14, ACM Press, 3025--3034.","paperID":"None"},{"content":"Robert R. McCrae and Paul T. Costa. 1999. The five factor theory of personality. in Handbook of Personality: Theory and Research, L.A. Pervin, O.P. Johns, NY: Guilford, 139--153.","paperID":"None"},{"content":"Eyal Ophir, Clifford Nass, and Anthony D. Wagner. 2009. Cognitive control in media multitaskers. Proceedings of the National Academy of Sciences 106.37: 15583--15587.","paperID":"None"},{"content":"Rita Orji, Julita Vassileva, and Regan L. Mandryk. 2014. Modeling the efficacy of persuasive strategies for different gamer types in serious games for health.\" User Modeling and User-Adapted Interaction 24, no. 5: 453--498.","paperID":"None"},{"content":"Joshua S. Rubinstein, David E. Meyer, and Jeffrey E. Evans. 2001. Executive control of cognitive processes in task switching. Journal of Experimental Psychology: Human Perception and Performance 27.4: 763.","paperID":"None"},{"content":"Blazej Szymura, and Edward Necka. 2005. Three superfactors of personality and three aspects of attention.\" Advances in personality psychology: 75--90.","paperID":"None"},{"content":"Hans PA Van Dongen, Greg Maislin, Janet M. Mullington, and David F. Dinges. 2003. The cumulative cost of additional wakefulness: Doseresponse effects on neurobehavioral functions and sleep physiology from chronic sleep restriction and total sleep deprivation. Sleep, 26, 117--126.","paperID":"None"},{"content":"Kavita Vedhara, J. Hyde, Iain Gilchrist, Michelle Tytherleigh, and Sue Plummer. 2000. Acute stress, memory, attention and cortisol. Psychoneuroendocrinology 25, 6: 535--549.","paperID":"None"},{"content":"Richard M.Wenzlaff, and Daniel M. Wegner. 2000. Thought suppression. Annual Review of Psychology, 51, 59--91.","paperID":"None"},{"content":"Stephen P. Whiteside and Donald R. Lynam. 2001. The five factor model and impulsivity: Using a structural model of personality to understand impulsivity. Personality and individual differences, 30(4), 669--689.","paperID":"None"},{"content":"Christopher D.Wickens. 1980. The structure of attentional resources. Attention and performance VIII, 8.","paperID":"None"}],"title":"Neurotics Can't Focus: An in situ Study of Online Multitasking in the Workplace","filename":"CHI16/p1739","authors":["Gloria Mark","Shamsi T. Iqbal","Mary Czerwinski","Paul Johns","Akane Sano"],"conference":"CHI '16"}