{"paperId":2858396,"reference":[{"content":"Pankaj Aggarwal. 2004. The effects of brand relationship norms on consumer attitudes and behavior. Journal of consumer research, 31(1), 87--101.","paperID":"None"},{"content":"Omar Al-Ubaydli, Daniel Houser, John Nye, Maria Pia Paganelli, and Xiaofei Sophia Pan. 2013. The causal effect of market priming on trust: an experimental investigation using randomized control. PloS one, 8(3), e55968.","paperID":"None"},{"content":"Roland Bénabou, and Jean Tirole. 2005. Incentives and prosocial behavior (No. w11535). National Bureau of Economic Research.","paperID":"None"},{"content":"Michael S. Bernstein, Desney Tan, Greg Smith, Mary Czerwinski, and Eric Horvitz. 2010. Personalization via friendsourcing. ACM Transactions on ComputerHuman Interaction (TOCHI), 17(2).","paperID":"None"},{"content":"Peter Michael Blau. 2005. Exchange and power in social life. New Brunswick, NJ/London: Transaction Publishers. (Original work published 1964).","paperID":"None"},{"content":"Victoria E. Bonnell. 2007. The Purchase of Intimacy. Contemporary Sociology: A Journal of Reviews, 36(3), 544--545. doi:10.1177/009430610703600616.","paperID":"None"},{"content":"Samuel Bowles, and Sandra Polania-Reyes. 2012. Economic incentives and social preferences: substitutes or complements?. Journal of Economic Literature, 368425.","paperID":"None"},{"content":"Erin L. Brady, Yu Zhong, Meredith Ringel Morris, and Jeffrey P. Bigham. 2013. Investigating the appropriateness of social network question asking as a resource for blind users. CSCW '13.","paperID":"None"},{"content":"Moira Burke, Cameron Marlow, and Thomas Lento. 2010. Social network activity and social well-being. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 1909--1912). ACM.","paperID":"None"},{"content":"Moira Burke, Robert Kraut, and Cameron Marlow. 2011. Social capital on Facebook: Differentiating uses and users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 571580). ACM.","paperID":"None"},{"content":"Margaret S. Clark, and Judson Mills. 1979. Interpersonal attraction in exchange and communal relationships. Journal of Personality and Social Psychology, 37 (1), 12.","paperID":"None"},{"content":"Karen S Cook, and Eric RW Rice. 2003. Social Exchange Theory. Handbook of Social Psychology, edited by John Delamater. Kluwer Academic/Plenum Publishers, NY.","paperID":"None"},{"content":"Elizabeth W. Dunn, Lara B. Aknin, and Michael I. Norton. 2008. Spending money on others promotes happiness. Science, 319(5870), 1687--1688.","paperID":"None"},{"content":"Eric Gilbert, and Karrie Karahalios. 2009. Predicting tie strength with social media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 211--220). CHI'2009.","paperID":"None"},{"content":"Nicole B. Ellison, Charles Steinfield, and Cliff Lampe. 2007. The benefits of Facebook \"friends:\" Social capital and college students' use of online social network sites. Journal of Computer-Mediated Communication, 12(4), 1143--1168.","paperID":"None"},{"content":"Alan P. Fiske. 1992. The four elementary forms of sociality: Framework for a unified theory of social relations. Psychological Review, 99, 689--723.","paperID":"None"},{"content":"Bruno S. Frey, and Felix Oberholzer-Gee. 1997. \"The Cost of Price Incentives: An Empirical Analysis of Motivation Crowding-Out.\" American Economic Review, 87, 746--755.","paperID":"None"},{"content":"Alvin W. Gouldner. 1960. The norm of reciprocity: A preliminary statement. American Sociological Review, 25(2), 161--178.","paperID":"None"},{"content":"Maxwell F. Harper, Daphne Raban, Sheizaf Rafaeli, and Joseph A. Konstan. 2008. Predictors of answer quality in online Q&A sites. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 865--874.","paperID":"None"},{"content":"Kieran Healy. 2010. Last best gifts: Altruism and the market for human blood and organs. University of Chicago Press.","paperID":"None"},{"content":"James Heyman, and Dan Ariely. 2004. Effort for payment a tale of two markets. Psychological science, 15(11), 787--793.","paperID":"None"},{"content":"Jin-Woo Jeong, Meredith Ringel Morris, Jaime Teevan, and Daniel J. Liebling. 2013. A CrowdPowered Socially Embedded Search Engine. ICWSM '13.","paperID":"None"},{"content":"Nicola Lacetera, Mario Macis, and Robert Slonim. 2013. Economic rewards to motivate blood donations. Science, 340(6135), 927--928.","paperID":"None"},{"content":"Nicola Lacetera, Mario Macis, and Robert Slonim. 2012. Will there be blood? Incentives and displacement effects in pro-social behavior. American Economic Journal: Economic Policy, 186--223.","paperID":"None"},{"content":"Nicola Lacetera, and Mario Macis. 2013. Time for blood: The effect of paid leave legislation on altruistic behavior. Journal of Law, Economics, and Organization, 29(6), 1384--1420.","paperID":"None"},{"content":"Edward J. Lawler, and Jeongkoo Yoon. 1993. Power and the emergence of commitment behavior in negotiated exchange. American Sociological Review, 58, 465--481.","paperID":"None"},{"content":"Edward J. Lawler, and Jeongkoo Yoon. 1996. Commitment in exchange relations: Test of a theory of relational cohesion. American Sociological Review, 61, 89--108.","paperID":"None"},{"content":"Edward J. Lawler, and Jeongkoo Yoon. 1998. Network structure and emotion in exchange relations. American Sociological Review, 63, 871--894.","paperID":"None"},{"content":"Peter V. Marsden, and Karen E. Campbell. 1984. Measuring tie strength. Social forces, 63(2), 482--501.","paperID":"None"},{"content":"Winter Mason, and Duncan J. Watts. 2010. Financial incentives and the performance of crowds. ACM SigKDD Explorations Newsletter, 11(2), 100--108.","paperID":"None"},{"content":"Nicole L. Mead, and Anika Stuppy. 2014. Two sides of the same coin: Money can promote and hinder interpersonal processes. In (Eds). The psychological science of money Springer, 243--262.","paperID":"None"},{"content":"Carl Mellström, and Magnus Johannesson. 2008. Crowding out in blood donation: Was Titmuss right? Journal of the European Economic Association, 6(June), 845--863.","paperID":"None"},{"content":"Richard F. Meyer. 1976. Preferences over time. Decisions with multiple objectives, 473--89.","paperID":"None"},{"content":"Meredith Ringel Morris, Kori Inkpen, and Gina Venolia. 2014. Remote Shopping Advice: Enhancing In-Store Shopping with Social Technologies. CSCW '14.","paperID":"None"},{"content":"Meredith Ringel Morris, Jaime Teevan, and Katrina Panovich. 2010. What do people ask their social networks, and why?: a survey study of status message q&a behavior. CHI '10.","paperID":"None"},{"content":"Sharoda A. Paul, Lichan Hong, and Ed H. Chi. 2011. Is Twitter a Good Place for Asking Questions? A Characterization Study. ICWSM '11.","paperID":"None"},{"content":"Jakob Rogstadius, Vassilis Kostakos, Aniket Kittur, Boris Smus, Jim Laredo, and Maja Vukovic. 2011. An Assessment of Intrinsic and Extrinsic Motivation on Task Performance in Crowdsourcing Markets. In ICWSM'11.","paperID":"None"},{"content":"Lee Ross, and Richard E. Nisbett. 1991. The Person and the Situation: Perspectives of Social Psychology. Philadelphia: Temple University Press.","paperID":"None"},{"content":"Jeffrey M. Rzeszotarski, and Meredith Ringel Morris. 2014. Estimating the social costs of friendsourcing. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14 (pp. 2735--2744). NY, NY, USA: ACM Press.","paperID":"None"},{"content":"Jaime Teevan, Meredith Ringel Morris, and Katrina Panovich. 2011. Factors affecting response quantity, quality, and speed for questions asked via social network status messages. ICWSM '11.","paperID":"None"},{"content":"Richard M. Titmuss, 1970. The Gift Relationship. Allen and Unwin.","paperID":"None"},{"content":"Amos Tversky, and Daniel Kahneman. 1981. \"The Framing of Decisions and the Psychology of Choice.\" Science 211 (4481): 453--58.","paperID":"None"},{"content":"Edwina S. Uehara. 1995. Reciprocity reconsidered: Gouldner's 'moral norm of reciprocity' and social support. Journal of Social and Personal Relationships, 12(4), 483--502.","paperID":"None"},{"content":"Matt Vella. 2012. The \"mega trend\" that swallowed Silicon Valley. CNN Money. Retrieved from http://fortune.com/2012/10/03/the-mega-trend-thatswallowed-silicon-valley/","paperID":"None"},{"content":"Kathleen D. Vohs, Nicole L. Mead, and Miranda R. Goode. 2006. The psychological consequences of money. Science, 314(5802), 1154--1156.","paperID":"None"},{"content":"Michael Walzer. 1983. Spheres of Justice. NY: Basic Books.","paperID":"None"}],"citation":[],"abstract":"Friendsourcing consists of broadcasting questions and help requests to friends on social networking sites. Despite its potential value, friendsourcing requests often fall on deaf ears. One way to improve response rates and motivate friends to undertake more effortful tasks may be to offer extrinsic rewards, such as money or a gift, for responding to friendsourcing requests. However, past research suggests that these extrinsic rewards can have unintended consequences, including undermining intrinsic motivations and undercutting the relationship between people. To explore the effects of extrinsic reward on friends' response rate and perceived relationship, we conducted an experiment on a new friendsourcing platform - Mobilyzr. Results indicate that large extrinsic rewards increase friends' response rates without reducing the relationship strength between friends. Additionally, the extrinsic rewards allow requesters to explain away the failure of friendsourcing requests and thus preserve their perceptions of relationship ties with friends.","title":"A Market in Your Social Network: The Effects of Extrinsic Rewards on Friendsourcing and Relationships","filename":"CHI16/p598","authors":["Haiyi Zhu","Sauvik Das","Yiqun Cao","Shuang Yu","Aniket Kittur","Robert Kraut"],"conference":"CHI '16"}