{"paperId":2858391,"citation":[],"abstract":"This paper describes how people who lead communities on online platforms join together in mass collective action to influence platform operators. I investigate this by analyzing a protest against the social news platform reddit by moderators of 2,278 subreddit communities in July 2015. These moderators collectively disabled their subreddits, preventing millions of readers from accessing major parts of reddit and convincing the company to negotiate over their demands. This paper offers a descriptive analysis of the protest, combining qualitative content analysis, interviews, and quantitative analysis with the population of 52,735 active subreddits. Through participatory hypotheses testing with moderators, this study reveals social factors including the grievances of moderators, relations with platform operators, relations among moderators, subreddit resources, subreddit isolation, and moderators' relations with their subreddits that can lead to participation in mass collective action against a platform.","reference":[{"content":"2015. Wikipedia:Administrators. (Sept. 2015). https://en.wikipedia.org/w/index.php?title=Wikipedia:Administrators&oldid=681136693 Page Version ID: 681136693.","paperID":"None"},{"content":"Andrew Abbott. 2004. Methods of Discovery: Heuristics for the Social Sciences (Contemporary Societies). (2004). http://www.citeulike.org/ group/1118/article/150521","paperID":"None"},{"content":"Lada Adamic and others. 2015. The Diffusion of Support in an Online Social Movement: Evidence from the Adoption of Equal-Sign Profile Pictures. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 1741--1750. http://dl.acm.org/citation.cfm?id=2675290","paperID":"None"},{"content":"Clem Adelman. 1993. Kurt Lewin and the origins of action research. Educational action research 1, 1 (1993), 7--24. http://www.tandfonline.com/doi/pdf/10.1080/0965079930010102","paperID":"None"},{"content":"Cecilia Aragon, Joseph Bayer, Andy Echenique, Yun Huang, Clayton Hutto, Jinyoung Kim, Gina Neff, and Wanli Xing. 2015. Human Centered Data Science (CSCW '16 Workshop). ACM. https://cscw2016hcds.wordpress.com/","paperID":"None"},{"content":"Francois Bar, Melissa Brough, Sasha Costanza-Chock, Carmen Gonzalez, C. J. Wallis, and Amanda Garces. 2009. Mobile voices: A mobile, open source, popular communication platform for first-generation immigrants in Los Angeles. In Pre-conference workshop at the International Communication Association (ICA) Conference Chicago, Illinois. http://lirneasia.net/wp-content/uploads/ 2009/05/final-paper_bar_et_al.pdf","paperID":"None"},{"content":"Darin Barney. 2013. Pipelines and the politics of sabotage. (Oct. 2013). https://www.youtube.com/watch?v=UjJO5_fjMGU","paperID":"None"},{"content":"Jason Michael Baumgartner. 2015. I have every publicly available Reddit comment for research. ~ 1.7 billion comments @ 250 GB compressed. Any interest in this? • /r/datasets. (July 2015). https://www.reddit.com/r/datasets/comments/3bxlg7/i_have_every_publicly_available_reddit_comment/","paperID":"None"},{"content":"Yochai Benkler, Hal Roberts, Robert Faris, Alicia Solow-Niederman, and Bruce Etling. 2013. Social Mobilization and the Networked Public Sphere: Mapping the SOPA-PIPA Debate. SSRN Scholarly Paper ID 2295953. Social Science Research Network, Rochester, NY. http://papers.ssrn.com/abstract=2295953","paperID":"None"},{"content":"Rahul Bhargava. 2013. Towards a Concept of \"Popular Data\" | MIT Center for Civic Media. (Nov. 2013). https://civic.mit.edu/blog/rahulb/ towards-a-concept-of-popular-data","paperID":"None"},{"content":"Tom Boellstorff, Bonnie Nardi, and Celia Pearce. 2012. Ethnography and virtual worlds: A handbook of method. Princeton University Press.","paperID":"None"},{"content":"danah boyd. 2008. Taken out of context: American teen sociality in networked publics. PhD Dissertation. University of California-Berkeley, School of Information.","paperID":"None"},{"content":"Amy Bruckman. 1998. Finding one's own in cyberspace. High Wired: On the Design, Use, and Theory of Educational MOOs. Ed. Cynthia Haynes and Jan Rune Holmevik. Ann Arbor, MI: U of Michigan P (1998), 15--24.","paperID":"None"},{"content":"Amy Bruckman, Pavel Curtis, Cliff Figallo, and Brenda Laurel. 1994. Approaches to managing deviant behavior in virtual communities. In CHI Conference Companion. 183--184. http://www.researchgate.net/profile/Brenda_Laurel/publication/221515969_Approaches_to_managing_deviant_behavior_in_virtual_communities/links/00b495374f7baae77f000000.pdf","paperID":"None"},{"content":"Brian Butler, Lee Sproull, Sara Kiesler, and Robert Kraut. 2002. Community effort in online groups: Who does the work and why. Leadership at a distance: Research in technologically supported work (2002), 171--194.","paperID":"None"},{"content":"James Samuel Coleman. 1973. Mathematics of collective action. Transaction Publishers. https://books.google.com/books?hl=en&lr=&id=KTatmFs_dwAC&oi=fnd&pg=PR7&dq=james+coleman+mathematics+of+collective+action&ots=hGAFwFBWG1&sig=nlGmUboP9iJ4ll8Epv3fS62e1s4","paperID":"None"},{"content":"Kate Crawford and Tarleton L. Gillespie. 2014. What is a Flag for? Social Media Reporting Tools and the Vocabulary of Complaint. New Media & Society (Aug. 2014). http://papers.ssrn.com/abstract=2476464","paperID":"None"},{"content":"Ethan Dalool. 2015. amageddon - GoldTesting. (July 2015). https://www.reddit.com/r/GoldTesting/wiki/amageddon","paperID":"None"},{"content":"Catherine D'Ignazio and Rahul Bhargava. 2015. Approaches to Building Big Data Literacy. Bloomberg Data For Good Conference. https://datatherapy.files.wordpress.com/2015/09/big_data_literacy.pdf","paperID":"None"},{"content":"Jill P. Dimond, Michaelanne Dye, Daphne Larose, and Amy S. Bruckman. 2013. Hollaback!: the role of storytelling online in a social movement organization. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, NY, NY, USA, 477--490. DOI: http://dx.doi.org/10.1145/2441776.2441831","paperID":"None"},{"content":"Karthik Dinakar, Birago Jones, Catherine Havasi, Henry Lieberman, and Rosalind Picard. 2012. Common sense reasoning for detection, prevention, and mitigation of cyberbullying. ACM Transactions on Interactive Intelligent Systems (TiiS) 2, 3 (2012), 18. http://dl.acm.org/citation.cfm?id=2362400","paperID":"None"},{"content":"Jessica Elgot. 2015. Reddit users rebel over banning of fat-shaming subforums. The Guardian (June 2015). http://www.theguardian.com/technology/2015/jun/11/reddit-users-rebel-banning-fat-shaming-subforums","paperID":"None"},{"content":"Facebook. 2015. Group Admin Basics: What is a Group Admin? (2015). https://www.facebook.com/help/418065968237061/","paperID":"None"},{"content":"David Firth. 1993. Bias reduction of maximum likelihood estimates. Biometrika 80, 1 (1993), 27--38. http://biomet.oxfordjournals.org/content/ 80/1/27.short","paperID":"None"},{"content":"R. Stuart Geiger. 2014. Successor Systems: The Role of Reflexive Algorithms in Enacting Ideological Critique. Selected Papers of Internet Research 4 (2014). http://spir.aoir.org/index.php/spir/ article/view/942","paperID":"None"},{"content":"Eric Gilbert. 2013. Widespread underprovision on reddit. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 803--808. http://dl.acm.org/citation.cfm?id=2441866","paperID":"None"},{"content":"Tarleton Gillespie. 2010. The politics of \"platforms\". New Media & Society 12, 3 (2010), 347--364. http://nms.sagepub.com/content/12/3/347.short","paperID":"None"},{"content":"Owen Good. 2013. Does Your Gamertag Have Herpes? Beware Xbox Live Enforcement United. Kotaku (Aug. 2013).","paperID":"None"},{"content":"James Grimmelmann. 2015. The Virtues of Moderation. SSRN Scholarly Paper ID 2588493. Social Science Research Network, Rochester, NY. http://papers.ssrn.com/abstract=2588493","paperID":"None"},{"content":"Alexander Halavais. 2013. Home made big data: Challenges and opportunities for participatory social research. First Monday 18, 10 (Oct. 2013). DOI: http://dx.doi.org/10.5210/fm.v18i10.4876","paperID":"None"},{"content":"Gillian R. Hayes. 2011. The relationship of action research to human-computer interaction. ACM Transactions on Computer-Human Interaction (TOCHI) 18, 3 (2011), 15. http://dl.acm.org/citation.cfm?id=1993065","paperID":"None"},{"content":"Steve Huffman. 2006. what's new on reddit: for those of you with a private office... (Jan. 2006). http://www.redditblog.com/2006/01/for-those-of-you-with-private-office.html","paperID":"None"},{"content":"Steve Huffman. 2007. what's new on reddit: brace yourself, ads are coming. (March 2007). http://www.redditblog.com/2007/03/brace-yourself-ads-are-coming.html","paperID":"None"},{"content":"Steve Huffman. 2008. what's new on reddit: new features. (Jan. 2008). http://www.redditblog.com/2008/01/new-features.html","paperID":"None"},{"content":"Mike Isaac. 2015. Reddit Moderators Shut Down Parts of Site Over Employee's Dismissal. The NY Times (July 2015).","paperID":"None"},{"content":"Mike Isaac and David Streitfeld. 2015. It's Silicon Valley 2, Ellen Pao 0: Fighter of Sexism Is Out at Reddit. The NY Times (July 2015). http://www.nytimes.com/2015/07/11/technology/ellen-pao-reddit-chief-executive-resignation.html","paperID":"None"},{"content":"Nadia Kayyali and Danny O'Brien. 2015. Facing the Challenge of Online Harassment. Electronic Frontier Foundation (2015). https://www.eff.org/deeplinks/2015/01/facing-challenge-online-harassment","paperID":"None"},{"content":"David King. 2008. what's new on reddit: per-reddit automated spam filters. (June 2008). http://www.redditblog.com/2008/06/per-reddit-automated-spam-filters.html","paperID":"None"},{"content":"Lauren Kirchner. 2011. AOL Settled with Unpaid \"Volunteers\" for $15 Million. Columbia Journalism Review (Feb. 2011). http://www.cjr.org/the_news_frontier/aol_settled_with_unpaid_volunt.php","paperID":"None"},{"content":"Chih-Hui Lai. 2014. Can Our Group Survive? An Investigation of the Evolution of Mixed-Mode Groups. J Comput-Mediat Comm 19, 4 (July 2014), 839--854. DOI: http://dx.doi.org/10.1111/jcc4.12075","paperID":"None"},{"content":"Cliff Lampe. 2012. The role of reputation systems in managing online communities. H. Masum, M. Tovey, eds (2012), 77--88. https://books.google.com/books?hl=en&lr=&id=Mk81XgHfh1cC&oi=fnd&pg=PA77&dq=cliff+lampe+slashdot&ots=TGeImxj1FJ&sig=tAUuDkJDWF4xXpuY3lQCCrG_Zxc","paperID":"None"},{"content":"Cliff Lampe and Paul Resnick. 2004. Slash (dot) and burn: distributed moderation in a large online conversation space. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 543--550. http://dl.acm.org/citation.cfm?id=985761","paperID":"None"},{"content":"Cliff Lampe, Paul Zube, Jusil Lee, Chul Hyun Park, and Erik Johnston. 2014. Crowdsourcing civility: A natural experiment examining the effects of distributed moderation in online forums. Government Information Quarterly 31, 2 (2014), 317--326. http://www.sciencedirect.com/science/article/pii/S0740624X14000021","paperID":"None"},{"content":"Alex Leavitt. 2015. This is a Throwaway Account: Temporary Technical Identities and Perceptions of Anonymity in a Massive Online Community. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 317--327. http://dl.acm.org/citation.cfm?id=2675175","paperID":"None"},{"content":"Alex Leavitt and Joshua A. Clark. 2014. Upvoting Hurricane Sandy: Event-based News Production Processes on a Social News Site. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1495--1504. DOI: http://dx.doi.org/10.1145/2556288.2557140","paperID":"None"},{"content":"Philip Leifeld. 2013. texreg: Conversion of Statistical Model Output in R to LATEX and HTML Tables. Journal of Statistical Software 55, 8 (2013), 1--24. http://www.jstatsoft.org/v55/i08/","paperID":"None"},{"content":"Seymour Martin Lipset, Martin A. Trow, James Samuel Coleman, and Clark Kerr. 1956. Union democracy: The internal politics of the International Typographical Union. Free Press Glencoe. http://library.wur.nl/WebQuery/clc/1627266","paperID":"None"},{"content":"Brian Lynch and Courtnie Swearingen. 2015. Why We Shut Down Reddit's 'Ask Me Anything' Forum. The NY Times (July 2015). http://www.nytimes.com/2015/07/08/opinion/why-we-shut-down-reddits-ask-me-anything-forum.html","paperID":"None"},{"content":"Adrienne Massanari. 2015a. # Gamergate and The Fappening: How Reddit's algorithm, governance, and culture support toxic technocultures. New Media & Society (2015), 1461444815608807. http://nms.sagepub.com/content/early/2015/10/07/1461444815608807.abstract","paperID":"None"},{"content":"Adrienne L Massanari. 2015b. Participatory Culture, Community, and Play: Learning from Reddit (Digital Formations): Adrienne L. Massanari: 9781433126789: Amazon.com: Books. Number 75 in Digital Formations. Peter Lang Publishing Inc.","paperID":"None"},{"content":"J. Nathan Matias, Amy Johnson, Whitney Erin Boesel, Brian Keegan, Jaclyn Friedman, and Charlie DeTar. 2015. Reporting, Reviewing, and Responding to Harassment on Twitter. arXiv:1505.03359 [cs] (May 2015). http://arxiv.org/abs/1505.03359 arXiv: 1505.03359.","paperID":"None"},{"content":"Doug McAdam. 1986. Recruitment to high-risk activism: The case of freedom summer. American journal of sociology (1986), 64--90. http://www.jstor.org/stable/2779717","paperID":"None"},{"content":"John D. McCarthy and Mayer N. Zald. 1977. Resource mobilization and social movements: A partial theory. American journal of sociology (1977), 1212--1241. http://www.jstor.org/stable/2777934","paperID":"None"},{"content":"Amanda Menking and Ingrid Erickson. 2015. The Heart Work of Wikipedia: Gendered, Emotional Labor in the World's Largest Online Encyclopedia. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 207--210.","paperID":"None"},{"content":"David S. Meyer. 2004. Protest and political opportunities. Annual review of sociology (2004), 125--145. http://www.jstor.org/stable/29737688","paperID":"None"},{"content":"Robert Michels. 1915. Political parties: A sociological study of the oligarchical tendencies of modern democracy. Hearst's International Library Company. https://books.google.com/books?hl=en&lr=&id=8XXl87CLp5cC&oi=fnd&pg=PA1&dq=michels+political+parties&ots=ebokKnRgFJ&sig=pcJkICos-chsYI0nW1k4u3bAKkc","paperID":"None"},{"content":"Jessica Moreno, Ellen Pao, and Alexis Ohanian. 2015a. Removing harassing subreddits • /r/announcements. (June 2015). https://www.reddit.com/r/announcements/comments/39bpam/removing_harassing_subreddits/","paperID":"None"},{"content":"Jessica Moreno, Ellen Pao, and Alexis Ohanian. 2015b. what's new on reddit: Promote ideas, protect people. (May 2015). http://www.redditblog.com/2015/05/promote-ideas-protect-people.html","paperID":"None"},{"content":"Drew Olanoff. 2015. Reddit Names Marty Weiner, Founding Engineer At Pinterest, Its First CTO. TechCrunch (Aug. 2015).","paperID":"None"},{"content":"Mancur Olson. 1965. The logic of collective action. Vol. 124. Harvard University Press. https://books.google.com/books?hl=en&lr=&id=jv8wTarzmsQC&oi=fnd&pg=PR9&dq=mancur+olson&ots=m9kOjQWqW3&sig=6dPuxxTsiUFHjN_6cjCe0UX_JX8","paperID":"None"},{"content":"Ellen Pao. 2015. We apologize : modnews. (July 2015). https://www.reddit.com/r/modnews/comments/3cbnuu/we_apologize/","paperID":"None"},{"content":"Hector Postigo. 2003. Emerging sources of labor on the Internet: The case of America Online volunteers. International review of social History 48, S11 (2003), 205--223. http://journals.cambridge.org/abstract_S0020859003001329","paperID":"None"},{"content":"Hector Postigo. 2009. America Online volunteers. International Journal of Cultural Studies 12, 5 (Sept. 2009), 451--469. http://ics.sagepub.com/libproxy.mit.edu/content/12/5/451","paperID":"None"},{"content":"Howard Rheingold. 1993. The virtual community: Homesteading on the electronic frontier. MIT press.","paperID":"None"},{"content":"Niloufar Salehi, Lilly C. Irani, and Michael S. Bernstein. 2015. We Are Dynamo: Overcoming Stalling and Friction in Collective Action for Crowd Workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1621--1630.","paperID":"None"},{"content":"Molly Sauter. 2014. The Coming Swarm: DDOS Actions, Hacktivism, and Civil Disobedience on the Internet. Bloomsbury Publishing USA.","paperID":"None"},{"content":"Trebor Scholz. 2012. Digital labor: The internet as playground and factory. Routledge.","paperID":"None"},{"content":"Aaron Shaw. 2012. Centralized and decentralized gatekeeping in an open online collective. Politics & Society 40, 3 (2012), 349--388. http://pas.sagepub.com/content/40/3/349.short","paperID":"None"},{"content":"Aaron Shaw and Benjamin M. Hill. 2014. Laboratories of Oligarchy? How the Iron Law Extends to Peer Production. J Commun 64, 2 (April 2014), 215--238. DOI: http://dx.doi.org/10.1111/jcom.12082","paperID":"None"},{"content":"Christian Steglich, Tom AB Snijders, and Michael Pearson. 2010. Dynamic networks and behavior: Separating selection from influence. Sociological methodology 40, 1 (2010), 329--393. http://onlinelibrary.wiley.com/doi/10.1111/j.1467--9531.2010.01225.x/full","paperID":"None"},{"content":"Tiziana Terranova. 2000. Free labor: Producing culture for the digital economy. Social text 18, 2 (2000), 33--58. http://muse.jhu.edu/journals/soc/summary/v018/18.2terranova.html","paperID":"None"},{"content":"Haiyi Zhu, Robert E. Kraut, and Aniket Kittur. 2014. The impact of membership overlap on the survival of online communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 281--290. http://dl.acm.org/citation.cfm?id=2557213","paperID":"None"}],"title":"Going Dark: Social Factors in Collective Action Against Platform Operators in the Reddit Blackout","filename":"CHI16/p1138","authors":["J. Nathan Matias"],"conference":"CHI '16"}