{"paperId":2858322,"citation":[],"reference":[{"content":"American Psychiatric Association. (2013). Diagnostic and statistical manual of mental disorders (5th ed.). Washington, DC: Author","paperID":"None"},{"content":"Baio J. (2014) Prevalence of Autism Spectrum Disorder Among Children Aged 8 Years--Autism and Developmental Disabilities Monitoring Network, 11 Sites, USA, 2010 Surveillance Summaries. March 28, 2014 / 63(SS02);1--21. http://www.cdc.gov/mmwr/preview/mmwrhtml/ss6302a1.htm?s_cid=ss6302a1_w","paperID":"None"},{"content":"Bartoli L., Corradi C., Garzotto F., Valoriani M. (2013). Exploring Motion-based Touchless Games for Autistic Children's Learning. In Proc. of IDC'13, pp.102--111","paperID":"None"},{"content":"Benton L., Johnson H., Ashwin E., Brosnan M., Grawemeyer B. (2012). Developing IDEAS: Supporting children with autism within a participatory design team. In Proc. of CHI'12, pp. 2599--2608","paperID":"None"},{"content":"Benton L., Johnson H. (2014). Structured approaches to participatory design for children: can targeting the needs of children with autism provide benefits for a broader child population? Journal of Instructional Science, 42, pp. 47--65","paperID":"None"},{"content":"Benton, L. & Johnson, H. (2015). Widening participation in technology design: a review of the involvement of children with special educational needs and disabilities. International Journal of Child-Computer Interaction, 3--4, 23--40","paperID":"None"},{"content":"Bernardini S., Porayska-Pomsta K., Smith T.J. (2014). ECHOES: An intelligent serious game for fostering social communication in children with autism. Journal of Information Sciences, 264, pp. 41--60.","paperID":"None"},{"content":"Bianchi-Berthouze N., Kim W., Patel D. (2007). Does body movement engage you more in digital game play? And Why? Affective Computing and Intelligent Interaction, pp. 102--113. Springer","paperID":"None"},{"content":"Bossavit B., Marzo A., Ardaiz O. and Pina A. (2014). Hierarchical Menu Selection with a Body-Centered Remote Interface. Journal of Interacting with Computers, 26(5), pp. 389--402","paperID":"None"},{"content":"Bossavit B., Pina, A. (2014). Designing educational tools, based on body interaction, for children with special needs who present different motor skills. In Proc. of iTAG'14, pp. 63--70.","paperID":"None"},{"content":"Bratteteig T., Wagner I. (2012). Disentangling power and decision-making in participatory design. Participatory Design Conference","paperID":"None"},{"content":"Davis M., Dautenhahn K., Powell S., Nehaniv C. (2010). Guidelines for researchers and practitioners designing software and software trials for children with autism. Journal of Assistive Technologies, 4(1), 38--48","paperID":"None"},{"content":"Druin A. (2002). The role of children in the design of new technology. Behaviour and IT, 21(1), pp. 1--25","paperID":"None"},{"content":"Frauenberger C., Good J., Keay-Bright W., Pain H. (2012). Interpreting input from children: a designerly approach. In Proc. of CHI '12, pp. 2377--2386","paperID":"None"},{"content":"Frauenberger C., Good J., Alcorn A., Pain H. (2013). Conversing through and about technologies: Design critique as an opportunity to engage children with autism and broaden research(er) perspectives. International Journal of Child-Computer Interaction, 1(2), 38--49","paperID":"None"},{"content":"Frauenberger C., Good J., Fitzpatrick G., Iversen O.S. (2015) In pursuit of rigour and accountability in participatory design, International journal of Human.Computer. Studies. 74, pp. 93--106","paperID":"None"},{"content":"Guha M.L., Druin A., Fails J. (2008). Designing With and for Children With Special Needs: an Inclusionary Model. In Proc. of IDC'08, pp 61--64","paperID":"None"},{"content":"Guha M.L., Druin A., Fails J.A. (2013). Cooperative Inquiry revisited: Reflections of the past and guidelines for the future of intergenerational co-design. Journal of Child-Computer Interaction, 1(1), pp. 14--23.","paperID":"None"},{"content":"Harrison, S., Sengers, P., & Tatar, D. (2011). Making epistemological trouble: Third-paradigm HCI as successor science. Interacting with Computers, 23(5), 385--392","paperID":"None"},{"content":"Kapp, K. M. (2012). The gamification of learning and instruction: Game-based methods and strategies for training and education. San Francisco, CA: Pfeifer.","paperID":"None"},{"content":"Knight V., McKissick B.R., Saunders A. (2013). A review of technology-based interventions to teach academic skills to students with autism spectrum disorder. Autism and Developmental Disorders, 43(11), pp. 2628--2648","paperID":"None"},{"content":"Kynigos C., Smyrnaiou Z., Roussou M. (2010). Exploring rules and underlying concepts while engaged with collaborative full-body games. In Proc. of IDC'10, pp. 222--225","paperID":"None"},{"content":"Latham S.O., Stockman I.J. (2014). Effect of Augmented Sensorimotor Input on Learning Verbal and Nonverbal Tasks Among Children with Autism Spectrum Disorders. Journal of autism and developmental disorders, 44(6), 1288--1302","paperID":"None"},{"content":"Lavelle T. A., Weinstein M. C., Newhouse J. P., Munir K., Kuhlthau K. A., Prosser L. A. (2014). Economic burden of childhood autism spectrum disorders. Pediatrics, 133(3), 520--529","paperID":"None"},{"content":"Microsoft Kinect. https://dev.windows.com/enus/kinect. [Accessed on January 2016]","paperID":"None"},{"content":"Millen L., Cobb S., Patel H. (2011). Participatory design approach with children with autism. International Journal on Disability and Human Development, 10(4), 289--294","paperID":"None"},{"content":"Molins-Ruano P., Sevilla C., Santini S., Haya P.A., Rodríguez P., Sacha G.M. (2014). Designing video games to improve students' motivation. Journal of Computers in Human Behavior, 31, pp. 571--579","paperID":"None"},{"content":"Montes G., Halterman J. S. (2008). Association of childhood autism spectrum disorders and loss of family income. Pediatrics, 121(4), e821-e826","paperID":"None"},{"content":"Muller M.J. (2003). chapter Participatory Design: The third Space in HCI. The Human-Computer Interaction Hand- book, pp. 1051--1068. Lawrence Erlbaum Associates, London, UK","paperID":"None"},{"content":"Neale H., Cobb S., Kerr S. (2003). An inclusive design toolbox for development of educational Virtual Environments. Presented at: Include2003, Royal College of Art, London, 25--28 March 2003","paperID":"None"},{"content":"Parsons S., Charman T., Faulkner R., Ragan J., Wallace S., Wittemeyer K. (2013). Commentary--bridging the research and practice gap in autism: The importance of creating research partnerships with schools. Journal of Autism, 17(3), pp.268--280.","paperID":"None"},{"content":"Parsons S., Cobb S. (2014). Reflections on the role of the \"users\": challenges in a multi-disciplinary context of learner-centered design for children on the autism spectrum. International Journal of Research & Method in Education, 37(4), 421--441.","paperID":"None"},{"content":"Pennington, R. C. (2010). Computer-assisted instruction for teaching academic skills to students with autism spectrum disorders: A review of literature. Focus on Autism and Other Developmental Disabilities, 25(4), pp. 239--248","paperID":"None"},{"content":"Porayska-Pomsta (2015) Processes contra outcomes: On the uncomfortable search for balance between inclusive participation, design and engineering. Presentation at the ESRC seminar series: Innovative technologies for autism-critical reflections on digital bubbles. University of Bath, 9th July 2015. http://digitalbubbles.org.uk/wpcontent/uploads/2015/09/DigitalBubbleBathfinal.compressed.pdf","paperID":"None"},{"content":"Ruland C.M., Starren J., Vatne T.M. (2008). Participatory design with children in the development of a support system for patient-centered care in pediatric oncology, Journal of Biomedical Informatics. 41(4), pp. 624--635","paperID":"None"},{"content":"Saiano M., Pellegrino L., Casadio M., Summa S., Garbarino E., Rossi V., Dall-Agata D., Sanguineti V. (2015). Natural interfaces and virtual environments for the acquisition of street crossing and path following skills in adults with Autism Spectrum Disorders: a feasibility study. Journal of NeuroEngineering and Rehabilitation, 12","paperID":"None"},{"content":"Wass S.V., Porayska-Pomsta K. (2014) The uses of cognitive training technologies in the treatment of autism spectrum disorders Autism, 18(8), 851--871","paperID":"None"},{"content":"Whyte E.M., Smyth J.M., Scherf K.S. (2014). Designing Serious Game Interventions for Individuals with Autism. Journal of Autism and Developmental Disorders","paperID":"None"},{"content":"Wrzesien M., Raya M.A. (2010) Learning in serious virtual worlds: evaluation of learning effectiveness and appeal to students in the E-Junior project. Computers & Education 55, pp. 178--187","paperID":"None"}],"abstract":"This paper presents a project that developed a Serious Game with a Natural User Interface, via a Participatory Design approach with two adolescents with High-Functioning Autism (HFA). The project took place in a highly specialized school for young people with Special Educational Needs (SEN). The teenagers were empowered by assigning them specific roles across several sessions. They could express their voice as user, informant, designer and tester. As a result, teachers and young people developed a digital educational game based on their experience as video gamers to improve academic skills in Geography. This paper contributes by describing the sensitive and flexible approach to the design process which promoted stakeholders' participation.","title":"\"This is how I want to learn\": High Functioning Autistic Teens Co-Designing a Serious Game","filename":"CHI16/p1294","authors":["Benoît Bossavit","Sarah Parsons"],"conference":"CHI '16"}