{"paperId":2858172,"citation":[],"reference":[{"content":"Sami Abuhamdeh, Mihaly Csikszentmihalyi, and Baland Jalal. 2014. Enjoying the possibility of defeat: Outcome uncertainty, suspense, and intrinsic motivation. Motivation and Emotion 39, 1 (Sep 2014), 1--10. http://dx.doi.org/10.1007/s11031-014-9425-2","paperID":"None"},{"content":"Phillip L. Ackerman. 2007. New Developments in Understanding Skilled Performance. Current Directions in Psychological Science 16, 5 (Oct 2007), 235--239. http://dx.doi.org/10.1111/j.14678721.2007.00511.x","paperID":"None"},{"content":"Ernest Adams. 2014. Fundamentals of game design. Pearson Education.","paperID":"None"},{"content":"Aim400kg. 2015. Reflex Training for Gamers. Retrieved September 20, 2015, from: http://aim400kg.com/.","paperID":"None"},{"content":"AimBooster. 2015. Retrieved September 20, 2015, from: http://www.aimbooster.com/.","paperID":"None"},{"content":"Erik Andersen, Eleanor O'Rourke, Yun-En Liu, Rich Snider, Jeff Lowdermilk, David Truong, Seth Cooper, and Zoran Popovic. 2012. The impact of tutorials on games of varying complexity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 59--68. http://doi.acm.org/10.1145/2207676.2207687","paperID":"None"},{"content":"Scott Bateman, Regan L. Mandryk, Tadeusz Stach, and Carl Gutwin. 2011. Target assistance for subtly balancing competitive play. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2355--2364. http://doi.acm.org/10.1145/1978942.1979287","paperID":"None"},{"content":"Jared E. Cechanowicz, Carl Gutwin, Scott Bateman, Regan Mandryk, and Ian Stavness. 2014. Improving player balancing in racing games. In Proceedings of the first ACM SIGCHI annual symposium on Computerhuman interaction in play (CHI PLAY '14). ACM, NY, NY, USA, 47--56. http://doi.acm.org/10.1145/2658537.2658701","paperID":"None"},{"content":"Jenova Chen. 2007. Flow in games (and everything else). Commun. ACM 50, 4 (April 2007), 31--34. http://doi.acm.org/10.1145/1232743.1232769","paperID":"None"},{"content":"Andy Cockburn, Carl Gutwin, Joey Scarr, and Sylvain Malacria. 2014. Supporting Novice to Expert Transitions in User Interfaces. ACM Comput. Surv. 47, 2, Article 31 (November 2014), 36 pages. http://doi.acm.org/10.1145/2659796","paperID":"None"},{"content":"David Conroy, Peta Wyeth, and Daniel Johnson. 2013. Understanding player threat responses in FPS games. In Proceedings of The 9th Australasian Conference on Interactive Entertainment: Matters of Life and Death (IE '13). ACM, NY, NY, USA, Article 32, 3 pages. http://doi.acm.org/10.1145/2513002.2513019","paperID":"None"},{"content":"Yvonne A. W. De Kort and Wijnand A. Ijsselsteijn. 2008. People, places, and play. Comput. Entertain. 6, 2 (Jul 2008), 1. http://dx.doi.org/10.1145/1371216.1371221","paperID":"None"},{"content":"Duolingo. 2015. Retrieved September 20, 2015, from: http://www.duolingo.com.","paperID":"None"},{"content":"K. Anders Ericsson, Michael J. Prietula, and Edward T. Cokely. 2007. The making of an expert. Harvard business review 85, no. 7/8: 114.","paperID":"None"},{"content":"Andy Field. 2003. Discovering statistics using IBM SPSS statistics. Sage.","paperID":"None"},{"content":"Paul Morris Fitts, and Michael I. Posner. 1967. Human performance. Brookes/Cole, Belmont, CA.","paperID":"None"},{"content":"Dennis Fong. 1998. Thresh's Quake Bible. Retrieved September 4, 2015, from: http://www.quaketerminus.com/quakebible/index.htm.","paperID":"None"},{"content":"James Paul Gee. 2005. Learning by design: Good video games as learning machines. E-Learning and Digital Media 2, no. 1: 5--16. http://dx.doi.org/10.2304/elea.2005.2.1.5","paperID":"None"},{"content":"James Paul Gee. 2014. What video games have to teach us about learning and literacy. Macmillan.","paperID":"None"},{"content":"Kathrin Gerling, and Regan L. Mandryk. 2014. Designing video games for older adults and caregivers. In Meaningful Play 2014, East Lansing, MI, USA.","paperID":"None"},{"content":"Kathrin Gerling, Matthew Miller, Regan L. Mandryk, Max V. Birk, and Jan D. Smeddinck. 2014. Effects of balancing for physical abilities on player performance, experience and self-esteem in exergames. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2201--2210. http://doi.acm.org/10.1145/2556288.2556963","paperID":"None"},{"content":"Janet Go, Rafael Ballagas, and Mirjana Spasojevic. 2012. Brothers and sisters at play: exploring game play with siblings. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 739--748. http://doi.acm.org/10.1145/2145204.2145316","paperID":"None"},{"content":"Carl Gutwin, Andy Cockburn, and Benjamin Lafreniere. 2015. Testing the rehearsal hypothesis with two FastTap interfaces. In Proceedings of the 41st Graphics Interface Conference (GI '15). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 223--231.","paperID":"None"},{"content":"Alexandra Holloway, Robert DeArmond, Michelle Francoeur, David Seagal, Amy Zuill, and Sri Kurniawan. 2011. Visualizing Audio in a First-Person Shooter with Directional Sound Display. In 1st Workshop on Game Accessibility: Xtreme Interaction Design (GAXID'11) at Foundations of Digital Games, Bordeaux, France.","paperID":"None"},{"content":"Robin Hunicke. 2005. The case for dynamic difficulty adjustment in games. In Proceedings of the 2005 ACM SIGCHI International Conference on Advances in computer entertainment technology (ACE '05). ACM, NY, NY, USA, 429--433. http://doi.acm.org/10.1145/1178477.1178573","paperID":"None"},{"content":"Kristine Jørgensen. 2008. Left in the Dark: Playing Computer Games with the Sound Turned off. In From Pac-Man to Pop Music. Interactive Audio in Games and New Media, pages 163--176. Ashgate.","paperID":"None"},{"content":"Kristian Kiili. 2005. Digital game-based learning: Towards an experiential gaming model. The Internet and higher education 8, 1 (jan 2005), 13--24. http://dx.doi.org/10.1016/j.iheduc.2004.12.001","paperID":"None"},{"content":"David A. Kolb. 1984. Experiential learning: Experience as the source of learning and development. Prentice Hall. http://dx.doi.org/10.1002/job.4030080408","paperID":"None"},{"content":"Raph Koster. 2013. Theory of fun for game design. O'Reilly Media, Inc.","paperID":"None"},{"content":"Ove Daae Lampe, and Helwig Hauser. 2011. Interactive visualization of streaming data with kernel density estimation. In Pacific Visualization Symposium (PacificVis), 2011 IEEE, pp. 171--178. IEEE. http://dx.doi.org/10.1109/pacificvis.2011.5742387","paperID":"None"},{"content":"Peter Laurens, Richard F. Paige, Phillip J. Brooke, and Howard Chivers. 2007. A novel approach to the detection of cheating in multiplayer online games. In Engineering Complex Computer Systems, 2007. 12th IEEE International Conference on, pp. 97--106. IEEE. http://dx.doi.org/10.1109/iceccs.2007.11","paperID":"None"},{"content":"Gioacchino Noris. 2011. Basic Timing Guide. ESReality. Retrieved April 3, 2015 from: http://www.esreality.com/?a=post&id=2028953.","paperID":"None"},{"content":"Kent L. Norman. 2011. Assessing the Components of Skill Necessary for Playing Video Games. HumanComputer Interaction Technical Report 11-11-11, University of MD, November 2011.","paperID":"None"},{"content":"Randy J. Pagulayan, Kevin Keeker, Dennis Wixon, Ramon L. Romero, and Thomas Fuller. 2002. Usercentered design in games. 883--906.","paperID":"None"},{"content":"Emil Protalinski. 2015. 100M users strong, Duolingo raises $45M led by Google at $470M valuation to grow language-learning platform. Venture Beat. June 10, 2015. Retrieved September 15, 2015, from: http://venturebeat.com/2015/06/10/100m-users-strong","paperID":"None"},{"content":"Katrina E. Ricci, Eduardo Salas, and Janis A. CannonBowers. 1996. Do computer-based games facilitate knowledge acquisition and retention? Military Psychology 8, 4 (1996), 295--307. http://dx.doi.org/10.1207/s15327876mp0804_3","paperID":"None"},{"content":"Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30, 4 (Nov 2006), 344--360. http://dx.doi.org/10.1007/s11031-006-9051-8","paperID":"None"},{"content":"Walter Schneider, and Richard M. Shiffrin. 1977. Controlled and automatic human information processing: I. Detection, search, and attention. Psychological Review 84, 1 (1977), 1--66. http://dx.doi.org/10.1037/0033-295x.84.1.1","paperID":"None"},{"content":"Nicholas Shim, Ronald Baecker, Jeremy Birnholtz, and Karyn Moffatt. 2010. TableTalk Poker: an online social gaming environment for seniors. In Proceedings of the International Academic Conference on the Future of Game Design and Technology (Futureplay '10). ACM, NY, NY, USA, 98--104. http://doi.acm.org/10.1145/1920778.1920792","paperID":"None"},{"content":"Jane K. Seale and Alan J. Cann. 2000. Reflection online or off-line: the role of learning technologies in encouraging students to reflect. Computers & Education 34, 3--4 (Apr 2000), 309--320. http://dx.doi.org/10.1016/s0360--1315(99)00052--4","paperID":"None"},{"content":"Jan-Paul Van Staalduinen, and Sara de Freitas. 2011. A Game-Based Learning Framework: Linking Game Design and Learning. Learning to play: exploring the future of education with video games 53: 29.","paperID":"None"},{"content":"Axel Stockburger. 2003. The game environment from an auditive perspective. Level Up: 4--6.","paperID":"None"},{"content":"Keith Stuart. 2010. Can first-person shooter skills really be taught? The Guardian. December 23, 2010. Retrieved September 15, 2015, from: http://www.theguardian.com/technology/gamesblog/20 10/dec/23/first-person-shooter-skills-training.","paperID":"None"},{"content":"Wee Hoe Tan. 2013. Game Coaching System Design and Development: A Retrospective Case Study of FPS Trainer. Int. J. Game-Based Learn. 3, 2 (April 2013), http://dx.doi.org/10.4018/ijgbl.2013040105","paperID":"None"},{"content":"Roumen Vesselinov, and John Grego. 2012. Duolingo effectiveness study. City University of NY, USA.","paperID":"None"},{"content":"Rodrigo Vicencio-Moreira, Regan L. Mandryk, and Carl Gutwin. 2015. Now You Can Compete With Anyone: Balancing Players of Different Skill Levels in a First-Person Shooter Game. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2255--2264. http://doi.acm.org/10.1145/2702123.2702242","paperID":"None"},{"content":"Rodrigo Vicencio-Moreira, Regan L. Mandryk, Carl Gutwin, and Scott Bateman. 2014. The effectiveness (or lack thereof) of aim-assist techniques in first-person shooter games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 937--946. http://doi.acm.org/10.1145/2556288.2557308","paperID":"None"},{"content":"Gerald A. Voorhees, Joshua Call, and Katie Whitlock, eds. 2012. Guns, Grenades, and Grunts: First-person Shooter Games. Bloomsbury Publishing USA. http://dx.doi.org/10.5040/9781628927948","paperID":"None"},{"content":"Donghee Yvette Wohn, Cliff Lampe, Rick Wash, Nicole Ellison, and Jessica Vitak. 2011. The \"S\" in social network games: Initiating, maintaining, and enhancing relationships. In 2011 44th Hawaii International Conference on System Sciences. Institute of Electrical & Electronics Engineers (IEEE). http://dx.doi.org/10.1109/hicss.2011.400","paperID":"None"},{"content":"Jeff Yan and Brian Randell. 2005. A systematic classification of cheating in online games. In Proceedings of 4th ACM SIGCOMM workshop on Network and system support for games (NetGames '05). ACM, NY, NY, USA, 1--9. http://doi.acm.org/10.1145/1103599.1103606","paperID":"None"}],"abstract":"Digital games require players to learn various skills, which is often accomplished through play itself. In multiplayer games, novices can feel overwhelmed if competing against better players, and can fail to improve, which may lead to unsatisfying play and missed social play opportunities. To help novices learn the requisite skills, we first determined how experts accomplish an important task in multiplayer FPS games -- locating their opponent. After determining that an understanding of audio cues and how to leverage them was critical, we designed and evaluated two systems for introducing this skill of locating opponents through audio cues -- a training system, and a modified game interface. We found that both systems improved accuracy and confidence, but that the training system led to more audio cues being recognized. Our work may help people of disparate skill play together, by scaffolding novices to learn and use a strategy commonly employed by experts.","title":"Scaffolding Player Location Awareness through Audio Cues in First-Person Shooters","filename":"CHI16/p3450","authors":["Colby Johanson","Regan L. Mandryk"],"conference":"CHI '16"}