{"paperId":2858534,"citation":[],"abstract":"Geographic dispersion has been proposed as one means to promote cooperation and coordination in teams high in perceived diversity. However, research has found mixed support for this assertion. This study proposes that the inclusion of perceived distance helps to explain these mixed results. To test this assertion, we examined 121 teams-62 collocated and 59 geographically dispersed. Results demonstrate that perceived distance explains when geographic dispersion benefits teams high in perceived diversity. Results also indicate that the type of perceived diversity matters (surface-level vs. deep-level diversity). This study contributes to our understanding of distance and diversity in teams.","reference":[{"content":"F. Pincar Acer. 2010. Analyzing the effects of diversity perceptions and shared leadership on emotional conflict: A dynamic approach. Int J Hum Res Manage 21, 10: 1733--1753.","paperID":"None"},{"content":"Lillemor Adrianson. 2001. Gender and computermediated communication: Group processes in problem solving. Comp Hum Behav 17, 1: 71--94.","paperID":"None"},{"content":"Leona S. Aiken and Stephen G. West. 1991. Multiple regression: Testing and interpreting interactions. Sage, Newbury Park, CA, 132--136.","paperID":"None"},{"content":"Petra Saskia Bayerl and Kristina Lauche. 2008. Coordinating high-interdependency tasks in asymmetric distributed teams. In Proceedings of the 2008 ACM conference on Computer Supported Cooperative Work, ACM, 417--426.","paperID":"None"},{"content":"Anita D. Bhappu, Terri L. Griffith, Gregory B. Northcraft. 1997. Media effects and communication bias in diverse groups. Organ Behav Hum Dec 70, 3: 199--205.","paperID":"None"},{"content":"Pernille Bjørn, Morten Esbensen, Rasmus Eskild Jensen, Stina Matthiesen. 2014. Does distance still matter? Revisiting the CSCW fundamentals on distributed collaboration. ACM T Comput-Hum Int 21, 5: 27.","paperID":"None"},{"content":"Paul D. Bliese. 2000. Within-group agreement, nonindependence, and reliability: Implications for data aggregation and analysis. In Multilevel Theory, Research, and Methods in Organizations, Katherine J. Klein and Steve W. J. Kozlowski (eds.) Jossey-Bass, San Francisco, CA, 349--381.","paperID":"None"},{"content":"Nathan D. Bos, Ayse Buyuktur, Judith S. Olson, Gary M. Olson, Amy Voida. 2010. Shared identity helps partially distributed teams, but distance still matters. In Proceedings of the 16th ACM international conference on Supporting Group Work. ACM, 89--96.","paperID":"None"},{"content":"Erin Bradner and Gloria Mark. 2002. Why distance matters: effects on cooperation, persuasion and deception. In Proceedings of the 2002 ACM conference on Computer Supported Cooperative Work. ACM, 226--235.","paperID":"None"},{"content":"Marilynn B. Brewer. 1979. In-group bias in the minimal intergroup situation: A cognitive-motivational analysis. Psychol Bull 86, 2: 307.","paperID":"None"},{"content":"Kristen Byron. 2008. Carrying too heavy a load? The communication and miscommunication of emotion by email. Acad Manage Rev 33, 2: 309--327.","paperID":"None"},{"content":"Michael A. Campion, Ellen M., Papper, Gina J. Medsker. 1996. Relations between work team characteristics and effectiveness: A replication and extension. Pers Psychol 49, 429--452.","paperID":"None"},{"content":"Traci Carte and Laku Chidambaram. 2004. A capabilities-based theory of technology deployment in diverse teams: Leapfrogging the pitfalls of diversity and leveraging its potential with collaborative technology. J Assoc Inform Syst 5, 11: 4.","paperID":"None"},{"content":"Andrew M. Carton and J. N. Cummings. 2012. A theory of subgroups in work teams. Acad Manage Rev 37, 4: 441--470.","paperID":"None"},{"content":"Joseph Cesario and Carlos David Navarrete. 2014. Perceptual bias in threat distance the critical roles of ingroup support and target evaluations in defensive threat regulation. Soc Psychol Pers Sci 5, 1: 12--17.","paperID":"None"},{"content":"Myungsuk Cha, Jun-Gi Park, Jungwoo Lee. 2014. Effects of team member psychological proximity on teamwork performance. Team Perform Manage 20, ½: 81--96.","paperID":"None"},{"content":"Jennifer A. Chatman. 2010. Norms in mixed sex and mixed race work groups. Acad Manage Ann 4, 1: 447--484.","paperID":"None"},{"content":"Kristina B. Dahlin, Laurie R. Weingart, Pamela J. Hinds. 2005. Team diversity and information use. Acad Manage J 48, 6: 1107--1123.","paperID":"None"},{"content":"Alan R Dennis. 1996. Information exchange and use in group decision making: You can lead a group to information, but you can't make it think. MIS Quart 20, 4: 433--457.","paperID":"None"},{"content":"Stacy T. Kowalczyk, Bryan K. Hasty. 2012. Research note Trust Is in the eye of the beholder: A vignette study of postevent behavioral controls' effects on individual trust in virtual teams. Information Systems Research 23, 2: 546--558.","paperID":"None"},{"content":"E. Ilana Diamant, Susan R. Fussell, Fen-ly Lo. 2008. Where did we turn wrong?: Unpacking the effect of culture and technology on attributions of team performance. In Proceedings of the 2008 ACM conference on Computer Supported Cooperative Work, ACM, 383--392.","paperID":"None"},{"content":"Janice L. Dreachslin, Portia L. Hunt, Elaine Sprainer. 2000. Workforce Diversity: Implications for the effectiveness of health care delivery teams. Soc Sci Med 50, 10: 1403--1414","paperID":"None"},{"content":"Claes Fornell and David F. Larcker. 1981. Evaluating structural equation models with unobservable variables and measurement error. J Marketing Res, 18, 1: 39--50.","paperID":"None"},{"content":"Gary Garrison, Robin L. Wakefield, Xiaobo Xu, Sang Hyun Kim. 2010. Globally distributed teams: The effect of diversity on trust, cohesion and individual performance. ACM SIGMIS Database 41, 3: 27--48.","paperID":"None"},{"content":"Robert C. Giambatista and Anita D. Bhappu. 2010. Diversity's harvest: Interactions of diversity sources and communication technology on creative group performance. Organ Behav Hum Dec 111, 2: 116--126.","paperID":"None"},{"content":"Cristina B. Gibson and Jennifer L. Gibbs. 2006. Unpacking the concept of virtuality: The effects of geographic dispersion, electronic dependence, dynamic structure, and national diversity on team innovation. Admin Sci Quart 51, 3: 451--495.","paperID":"None"},{"content":"Sandeep Goyal, Likoebe Maruping, and Lionel Robert. 2008. Diversity and conflict in teams: A faultline model perspective. In Academy of Management Proceedings, 1: 1--6.","paperID":"None"},{"content":"Raja Gumienny, Lutz Gericke, Matthias Wenzel, Christoph Meinel. 2013. Supporting creative collaboration in globally distributed companies. In Proceedings of the 2013 conference on Computer Supported Cooperative Work, ACM, 995--1007.","paperID":"None"},{"content":"David A. Harrison, Kenneth H. Price, Joanne H. Gavin, Anna T. Florey. 2002. Time, teams, and task performance: Changing effects of surface- and deeplevel diversity on group functioning. Acad Manage J 45, 5: 1029--1045.","paperID":"None"},{"content":"Tanja Hentschel, Meir Shemla, JürgenWegge, Eric Kearney. 2013. Perceived diversity and team functioning: The role of diversity beliefs and affect. Small Gr Res 44, 33--61. doi: 10.1177/1046496412470725","paperID":"None"},{"content":"Pamela J. Hinds and Diane E. Bailey. 2003. Out of sight, out of sync: Understanding conflict in distributed teams. Organ Sci 14, 6: 615--632. doi:10.1287/orsc.14.6.615.24872","paperID":"None"},{"content":"Pamela J. Hinds and Mark Mortensen. 2005. Understanding conflict in geographically distributed teams: The moderating effects of shared identity, shared context, and spontaneous communication. Organ Sci 16, 3: 290--307.","paperID":"None"},{"content":"Elizabeth V. Hobman, Prashant Bordia, Cynthia Gallois. 2004. Perceived dissimilarity and work group involvement: The moderating effects of group openness to diversity. Group Organ Manage 29, 5: 560--587.","paperID":"None"},{"content":"Martin Hoegl, Katharina Weinkauf, Hans Georg Gemuenden. 2004. Interteam coordination, project commitment, and teamwork in multiteam R&D projects: A longitudinal study. Organ Sci 15, 1: 38--55.","paperID":"None"},{"content":"Astrid C. Homan, Daan Van Knippenberg, Gerben A. Van Kleef, Carsten K.W. De Dreu. 2007. Bridging fault lines by valuing diversity: Diversity beliefs, information elaboration, and performance in diverse work groups. J Appl Psychol 92, 5: 1189.","paperID":"None"},{"content":"Karen A. Jehn, Gregory B. Northcraft, Margaret A. Neale (1999). Why differences make a difference: A field study of diversity, conflict, and performance in workgroups. Admin Sci Quart 44, 741--763.","paperID":"None"},{"content":"Aparna Joshi, Mila B. Lazarova, Hui Liao. 2009. Getting everyone on board: The role of inspirational leadership in geographically dispersed teams. Organ Sci 20, 1: 240--252.","paperID":"None"},{"content":"Benjamin Koehne, Patrick C. Shih, Judith S. Olson. 2012. Remote and alone: Coping with being the remote member on the team. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 1257--1266.","paperID":"None"},{"content":"Dora C. Lau, J. Keith Murnighan. 1998. Demographic diversity and fault lines: The compositional dynamics of organizational groups. Acad Manage Rev 23, 2: 325--340.","paperID":"None"},{"content":"Dora C. Lau and J. Keith Murnighan. 2005. Interactions within groups and subgroups: The effects of demographic fault lines. Acad Manage J 48, 4: 645659.","paperID":"None"},{"content":"Charlotte P. Lee and Drew Paine. 2015. From the matrix to a model of coordinated action (MoCA): A conceptual framework of and for CSCW. In Proceedings of the 18th ACM conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, 179--194.","paperID":"None"},{"content":"Min Kyung Lee, Nathaniel Fruchter, Laura Dabbish. 2015. Making decisions from a distance: The impact of technological mediation on riskiness and dehumanization. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, 1576--1589.","paperID":"None"},{"content":"Jiatao Li Donald C. Hambrick. 2005. Factional groups: A new vantage on demographic fault lines, conflict, and disintegration in work teams. Acad Manage J 48, 5: 794--813.","paperID":"None"},{"content":"Luis L. Martins, Frances J. Milliken, Batia M. Wiesenfeld, Susan R. Salgado. 2003. Racioethnic diversity and group members' experiences: The role of the racioethnic diversity of the organizational context. Group Organ Manage 28, 75","paperID":"None"},{"content":"Sean A. Munson, Karina Kervin, Lionel P. Robert Jr. 2014. Monitoring email to indicate project team performance and mutual attraction. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, ACM, 542--549.","paperID":"None"},{"content":"Seongtaek Lim, Sang Yun Cha, Chala Park, Inseong Lee, Jinwoo Kim. 2012. Getting closer and experiencing together: Antecedents and consequences of psychological distance in social media-enhanced real-time streaming video. Comput Hum Behav 28, 4: 1365--1378.","paperID":"None"},{"content":"Jennifer Marlow and Laura Dabbish. 2012. Designing interventions to reduce psychological distance in globally distributed teams. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion, ACM, 163--166.","paperID":"None"},{"content":"Duyen T. Nguyen and Susan R. Fussell. 2013. Effect of message content on communication processes in intercultural and same-culture instant messaging conversations. Proceedings of the 2013 conference on Computer Supported Cooperative Work, ACM, 19--32.","paperID":"None"},{"content":"Michael Boyer O'Leary, Jeanne M. Wilson, Anca Metiu. 2014. Beyond being there: The symbolic role of communication and identification in perceptions of proximity to geographically dispersed colleagues. MIS Quart 38, 4: 1219--1243.","paperID":"None"},{"content":"Gary M. Olson and Judith S. Olson. 2000. Distance matters. Hum-Comput Interact 15, 2: 139--178.","paperID":"None"},{"content":"Judith Olson. 2009. Even small distance matters: Social ergonomics in collocated and remote teams. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM.","paperID":"None"},{"content":"Ana Ortiz de Guinea, Jane Webster, D. Sandy Staples. 2012. A meta-analysis of the consequences of virtualness on team functioning. Inform Manage 49, 6: 301--308.","paperID":"None"},{"content":"Sherry M.B. Thatcher and Pankaj C. Patel. 2011. Demographic fault lines: A meta-analysis of the literature. J Appl Psychol 96, 6: 1119--1139.","paperID":"None"},{"content":"Jeffrey Pfeffer. 1983. Organizational demography. Res Organ Behav. Retrieved May 22, 2015 from http://psycnet.apa.org/psycinfo/1984--10945-001","paperID":"None"},{"content":"Stephen A. Rains. 2005. Leveling the organizational playing field -- virtually a meta-analysis of experimental research assessing the impact of group support system use on member influence behaviors. Commun Res 32, 2: 193--234.","paperID":"None"},{"content":"Christine M. Riordan and Lynn M. Shore. 1997. Demographic diversity and employee attitudes: An empirical examination of relational demography within work units. J Appl Psychol 82, 3: 342--358.","paperID":"None"},{"content":"Lionel P. Robert. 2013. A multi-level analysis of the impact of shared leadership in diverse virtual teams. In Proceedings of the 2013 conference on Computer Supported Cooperative Work. ACM, 363--374.","paperID":"None"},{"content":"Lionel P. Robert, Alan R. Dennis, Yu-Ting Caisy Hung. 2009. Individual swift trust and knowledge-based trust in face-to-face and virtual team members. J Manage Inform Syst 26, 2: 241--279.","paperID":"None"},{"content":"Lionel P. Robert, Alan R. Dennis, Manju K. Ahuja. 2008. Social capital and knowledge integration in digitally enabled teams. Inform Syst Res 19, 3: 314--334. http://doi.org/10.1287/isre.1080.0177","paperID":"None"},{"content":"Lionel Robert and Daniel M. Romero. 2015. Crowd size, diversity and performance. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 1379--1382.","paperID":"None"},{"content":"Judith A. Ross. 2006. Trust makes the team go round. Harvard Manage Update 11, 6: 3--6.","paperID":"None"},{"content":"Victor Savicki, Merle Kelley, Dawn Lingenfelter. 1997. Gender, group composition, and task type in small task groups using computer-mediated communication. Comput Hum Behav 12, 4: 549--565.","paperID":"None"},{"content":"Debra L., Shapiro, Staci A. Furst, Gretchen M. Spreitzer, Mary Ann Von Glinow. 2002. Transnational teams in the electronic age: Are team identity and high performance at risk? J Organ Behav 23, 4: 455--467.","paperID":"None"},{"content":"Meir Shemla, Bertolt Meyer, Lindred Greer, Karen A. Jehn. 2014. A review of perceived diversity in teams: Does how members perceive their team's composition affect team processes and outcomes? J Organ Behav doi: 10.1002/job.1957","paperID":"None"},{"content":"Frank Siebdrat, Martin Hoegl, Holger Ernst. 2014. Subjective distance and team collaboration in distributed teams. J Prod Innovat Manag 31, 4: 765--779.","paperID":"None"},{"content":"D. Sandy Staples and Lina Zhao. 2006. The effects of cultural diversity in virtual teams versus face-to-face teams. Group Decis Negot 15, 4: 389--406.","paperID":"None"},{"content":"Henri Tajfel and John C. Turner. 1979. An integrative theory of intergroup conflict. Soc Psychol Intergroup Relat 33, 47: 74.","paperID":"None"},{"content":"Elizabeth E. Umphress, Kristin Smith-Crowe, Arthur P. Brief, Joerg Dietz, Marla Baskerville Watkins. 2007. When birds of a feather flock together and when they do not: Status composition, social dominance orientation, and organizational attractiveness. J Appl Psychol 92, 2: 396.","paperID":"None"},{"content":"Bogdan Vasilescu, Daryl Posnett, Baishakhi Ray, Mark G.J. van den Brand, Alexander Serebrenik, Premkumar Devanbu, Vladimir Filkov. 2015. Gender and tenure diversity in GitHub teams. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 3789--3798.","paperID":"None"},{"content":"Katherine Y. Williams and Charles A. O'Reilly. 1998. Demography and diversity in organizations: A review of 40 years of research. In Research in Organizational Behavior (vol. 20), Barry M. Staw and Larry L. Cummings (eds.). JAI Press, Greenwich, CT, 77--140.","paperID":"None"},{"content":"Jeanne M. Wilson, Michael O'Leary, Anca Metiu, Quintus R. Jett. 2008. Perceived proximity in virtual work: Explaining the paradox of far-but-close. Organ Stud 29, 7: 979--1002.","paperID":"None"},{"content":"Jamie. Windeler, Likoebe Maruping, Lionel. P. Robert, Cindy Riemenschneider. 2015. E-identity, conflict and shared understanding in distributed teams. J Assoc Inform Syst 16, 7: 608--645.","paperID":"None"},{"content":"Rolf Van Dick, Daan Van Knippenberg, Sylvia Hagele, Yves R., Guillaume, Felix C. Brodbeck. 2008. Group diversity and group identification: The moderating role of diversity beliefs. Hum Relat 61, 1463--1492.","paperID":"None"},{"content":"Daan Van Knippenberg, Carsten K.W. De Dreu, Astrid C. Homan. 2004. Work group diversity and group performance: An integrative model and research agenda. J Appl Psychol 89, 6: 1008--1022.","paperID":"None"},{"content":"Daan Van Knippenberg and Michaela C. Schippers. 2007. Work group diversity. Annu Rev Psychol 58, 515--541.","paperID":"None"},{"content":"Mary E. Zellmer-Bruhn, Mary M. Maloney, Anita D. Bhappu, Rommel Bombie Salvador. 2008. When and how do differences matter? An exploration of perceived similarity in teams. Organ Behav Hum Dec 107, 1: 41--59.","paperID":"None"},{"content":"Dongsong Zhang, Paul Benjamin Lowry, Lina Zhou, Xiaolan Fu. 2007. The impact of individualism -- collectivism, social presence, and group diversity on group decision making under majority influence. J Manage Inform Syst 23, 4: 53--80.","paperID":"None"}],"title":"Far but Near or Near but Far?: The Effects of Perceived Distance on the Relationship between Geographic Dispersion and Perceived Diversity","filename":"CHI16/p2461","authors":["Lionel P. Robert"],"conference":"CHI '16"}