{"paperId":2858571,"reference":[{"content":"2013. Technical Assistance Document for the Reporting of Daily Air Quality. (2013). http://www3.epa.gov/airnow/aqi-technical-assistance-document-dec2013.pdf","paperID":"None"},{"content":"2014. WHO Ambient (outdoor) air quality and health. (2014). http://www.who.int/mediacentre/factsheets/fs313/en/","paperID":"None"},{"content":"Paul M. Aoki, R. J. Honicky, Alan Mainwaring, Chris Myers, Eric Paulos, Sushmita Subramanian, and Allison Woodruff. A vehicle for research: using street sweepers to explore the landscape of environmental community action. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2009). ACM, 375--384. http://dl.acm.org/citation.cfm?id=1518762","paperID":"None"},{"content":"E. Bales, N. Nikzad, N. Quick, C. Ziftci, K. Patrick, and W. Griswold. Citisense: Mobile air quality sensing for individuals and communities Design and deployment of the Citisense mobile air-quality system. In 2012 6th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth) (2012-05). 155--158. DOI: http://dx.doi.org/10.4108/icst.pervasivehealth.2012.248724","paperID":"None"},{"content":"Matthias Budde, Mathias Busse, and Michael Beigl. Investigating the use of commodity dust sensors for the embedded measurement of particulate matter. In Networked Sensing Systems (INSS), 2012 Ninth International Conference on (2012).","paperID":"None"},{"content":"Jeffrey A. Burke, D. Estrin, Mark Hansen, Andrew Parker, Nithya Ramanathan, Sasank Reddy, and Mani B. Srivastava. 2006. Participatory sensing. Center for Embedded Network Sensing (2006). http://escholarship.org/uc/item/19h777qd","paperID":"None"},{"content":"Carl DiSalvo, Illah Nourbakhsh, David Holstius, Ayça Akin, and Marti Louw. The Neighborhood Networks project: a case study of critical engagement and creative expression through participatory design. In Proceedings of the Tenth Anniversary Conference on Participatory Design 2008 (2008). Indiana University, 41-50. http://dl.acm.org/citation.cfm?id=1795241","paperID":"None"},{"content":"David Hasenfratz, Olga Saukh, Christoph Walser, Christoph Hueglin, Martin Fierz, Tabita Arn, Jan Beutel, and Lothar Thiele. 2015. Deriving high-resolution urban air pollution maps using mobile sensor nodes. Pervasive and Mobile Computing 16, Part B (2015), 268--285. DOI: http://dx.doi.org/10.1016/j.pmcj.2014.11.008 Selected Papers from the Twelfth Annual {IEEE} International Conference on Pervasive Computing and Communications (PerCom 2014).","paperID":"None"},{"content":"Sunyoung Kim and Eric Paulos. inAir: Measuring and Visualizing Indoor Air Quality. In Proceedings of the 11th International Conference on Ubiquitous Computing (2009) (UbiComp '09). ACM, 81--84. DOI: http://dx.doi.org/10.1145/1620545.1620557","paperID":"None"},{"content":"Sunyoung Kim, Eric Paulos, and Mark D. Gross. WearAir: expressive t-shirts for air quality sensing. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction (2010). ACM, 295--296. http://dl.acm.org/citation.cfm?id=1709949","paperID":"None"},{"content":"Stacey Kuznetsov, George Noel Davis, Eric Paulos, Mark D. Gross, and Jian Chiu Cheung. Red balloon, green balloon, sensors in the sky. In Proceedings of the 13th international conference on Ubiquitous computing (2011). ACM, 237--246. http://dl.acm.org/citation.cfm?id=2030145","paperID":"None"},{"content":"N.D. Lane, E. Miluzzo, Hong Lu, D. Peebles, T. Choudhury, and A.T. Campbell. 2010. A survey of mobile phone sensing. Communications Magazine, IEEE 48, 9 (Sept 2010), 140--150. DOI: http://dx.doi.org/10.1109/MCOM.2010.5560598","paperID":"None"},{"content":"Nima Nikzad, Nakul Verma, Celal Ziftci, Elizabeth Bales, Nichole Quick, Piero Zappi, Kevin Patrick, Sanjoy Dasgupta, Ingolf Krueger, Tajana Šimunić Rosing, and others. CitiSense: improving geospatial environmental assessment of air quality using a wireless personal exposure monitoring system. In Proceedings of the conference on Wireless Health (2012). ACM, 11. http://dl.acm.org/citation.cfm?id=2448107","paperID":"None"},{"content":"Amanda L. Northcross, Rufus J. Edwards, Michael A. Johnson, Zhong-Min Wang, Kunning Zhu, Tracy Allen, and Kirk R. Smith. 2013. A low-cost particle counter as a realtime fine-particle mass monitor. Environ. Sci.: Processes Impacts 15 (2013), 433--439. Issue 2. DOI: http://dx.doi.org/10.1039/C2EM30568B","paperID":"None"},{"content":"Christine Outram, Carlo Ratti, and Assaf Biderman. The Copenhagen Wheel: An innovative electric bicycle system that harnesses the power of real-time information and crowd sourcing. In EVER Monaco International Exhibition & Conference on Ecologic Vehicles & Renewable Energies (2010).","paperID":"None"},{"content":"Eric Paulos, R. Honicky, and Ben Hooker. 2008. Citizen science: Enabling participatory urbanism. Urban Informatics: Community Integration and Implementation (2008), 414--436.","paperID":"None"},{"content":"Eric Paulos, Chris Myers, Rundong Tian, and Paxton Paulos. Sensory Triptych: Here, Near, out There. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (2014) (UIST '14). ACM, 491--496. DOI: http://dx.doi.org/10.1145/2642918.2647410","paperID":"None"},{"content":"Sameera Poduri, Anoop Nimkar, and Gaurav S. Sukhatme. 2010. Visibility monitoring using mobile phones. Annual Report: Center for Embedded Networked Sensing (2010), 125--127. http://robotics.usc.edu/mobilesensing/visibility/MobileAirQualitySensing.pdf","paperID":"None"},{"content":"C. Arden Pope, Majid Ezzati, and Douglas W. Dockery. 2009. Fine-Particulate Air Pollution and Life Expectancy in the USA. New England Journal of Medicine 360, 4 (2009), 376--386. DOI: http://dx.doi.org/10.1056/NEJMsa0805646","paperID":"None"},{"content":"Tobias Skog, Sara Ljungblad, and Lars Erik Holmquist. Between aesthetics and utility: designing ambient information visualizations. In Information Visualization, 2003. INFOVIS 2003. IEEE Symposium on (2003). IEEE, 233--240. http://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=1249031","paperID":"None"},{"content":"J. Sundell. 2004. On the history of indoor air quality and health. Indoor Air 14 (2004), 51--58. DOI: http://dx.doi.org/10.1111/j.1600-0668.2004.00273.x","paperID":"None"},{"content":"M. D. Taylor and I. R. Nourbakhsh. 2015. A low-cost particle counter and signal processing method for indoor air pollution. Air Pollution XXIII 198 (2015), 337--348.","paperID":"None"},{"content":"Sean White and Steven Feiner. SiteLens: Situated Visualization Techniques for Urban Site Visits. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2009) (CHI '09). ACM, 1117--1120. DOI: http://dx.doi.org/10.1145/1518701.1518871","paperID":"None"}],"abstract":"In 2012, air pollution in both cities and rural areas was estimated to have caused 3.7 million premature deaths, 88% of those in at risk communities. The primary pollutant was small airborne particulate matter of 10 microns or less in diameter which led to the development of cardiovascular and respiratory diseases. In response, we developed MyPart, the first personal, portable, and accurate particle sensor under $50 capable of distinguishing and counting differently sized particles. We demonstrate how MyPart offers substantial enhancements over most existing air particle sensors by simultaneously improving accessibility, flexibility, portability, and accuracy. We describe the evolution and implementation of the sensor design, demonstrate its performance across twenty everyday urban environments versus a calibrated instrument, and conduct a preliminary user study to report on the overall user experience of MyPart. We also present a novel smart-phone visualization interface and a series of simple form factor adaptations of our design.","citation":[],"title":"MyPart: Personal, Portable, Accurate, Airborne Particle Counting","filename":"CHI16/p1338","authors":["Rundong Tian","Christine Dierk","Christopher Myers","Eric Paulos"],"conference":"CHI '16"}