{"paperId":2858503,"citation":[],"reference":[{"content":"Syed Ishtiaque Ahmed, Nusrat Jahan Mim, and Steven J. Jackson. 2015. Residual Mobilities: Infrastructural Displacement and Post-Colonial Computing in Bangladesh. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. (CHI '15), 437446. http://dl.acm.org/citation.cfm?id=2702573","paperID":"None"},{"content":"Arjun Appadurai. 1996. Modernity at Large: Cultural Dimensions of Globalization. Vol. 1. U of MN Press.","paperID":"None"},{"content":"S Batra, S Ahuja, V Lauria, N Harshe. 2015. Using Mobile Technology for Effective Detection and Prevention. Antimicrobial Resistance and Infection Control, 252.","paperID":"None"},{"content":"Maria Puig de la Bellacasa. 2011. Matters of Care in Technoscience: Assembling Neglected Things. Social Studies of Science 41.1: 85--106.","paperID":"None"},{"content":"Edna Bonachich and Khaleelah Hardie. 2006. Walmart and the Logistics Revolution. In Walmart: The Face of Twenty-First Century Capitalism, Nelson Lichtensstein (ed.). The New Press, 163--188","paperID":"None"},{"content":"Donald J Bowersox, David J. Closs, M. Bixby Cooper. 2007. Supply Chain Logistics Management. McGrawHill.","paperID":"None"},{"content":"Richard Chbeir, Asanee, Kawtrakul, Dominique Laurent, Nicholas Spyratos. 2013. DiseaseMedia: An Information System for Helping Diagnosing and Treating Rice Diseases. Information Search, Integration and Personalization. 71--80.","paperID":"None"},{"content":"Deborah Cowen. 2014. The Deadly Life of Logistics: Mapping Violence in Global Trade. University of MN Press.","paperID":"None"},{"content":"Paul N Edwards. 2006. Meteorology as Infrastructural Globalism. Osiris 21.1, 229--250.","paperID":"None"},{"content":"Arturo Escobar. 2008. Territories of Difference: Place, Movements, Life, Redes. Duke University Press.","paperID":"None"},{"content":"Michel Foucault. 1981. \"Omnes et Singulatim: Towards a Criticism of \"Political Reason.\" In The Tanner Lectures on Human Values, II. Salt Lake City: University of Utah Press.","paperID":"None"},{"content":"Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial Computing: A Lens on Design and Development. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1311--1320. http://dl.acm.org/citation.cfm?id=1753522","paperID":"None"},{"content":"Steven J. Jackson, Paul Edwards, Geoffrey Bowker, and Cory Knobel. 2007. Understanding Infrastructure: History, Heuristics and Cyberinfrastructure Policy. First Monday 12.6","paperID":"None"},{"content":"Steven J. Jackson and Sarah Barbrow. 2015. Standards and/as Innovation: Protocols, Creativity, and Interactive Systems Development in Ecology. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1769--1778. http://dl.acm.org/citation.cfm?id=301692","paperID":"None"},{"content":"Robert Jensen. 2007. The digital provide: Information (Technology), Market Performance, and Welfare in the South Indian Fisheries Sector. The Quarterly Journal of Economics, 879--924.","paperID":"None"},{"content":"Alexander Klose. 2015. The Container Principle: How a Box Changes the Way We Think. MIT Press.","paperID":"None"},{"content":"Karen Levy. 2015. The Contexts of Control: Information, Power, and Truck-Driving Work. The Information Society 31.2,160--174.","paperID":"None"},{"content":"Silvia Lindtner, Ken Anderson, and Paul Dourish. 2012. Cultural Appropriation: Information Technologies as Sites of Transnational Imagination. Proceedings of the ACM Conference on Computer Supported Cooperative Work. (CSCW '12). http://dl.acm.org/citation.cfm?id=2145220","paperID":"None"},{"content":"Annemarie Mol, Ingunn Moser, and Jeannette Pols. 2010. Care: Putting Practice into Theory. In Care in Practice: On Tinkering in Clinics, Homes and Farms. Vol. 8. Verlag, 7--27.","paperID":"None"},{"content":"Annemarie Mol. 2008. The Logic of Care: Health and the Problem of Patient Choice. Routledge.","paperID":"None"},{"content":"Eric Monteiro, Neil Pollock, Ole Hanseth, Robin Williams. 2013. From Artefacts to Infrastructures. Proceedings of the ACM Conference on Computer Supported Cooperative Work. (CSCW '13), 575--607. http://dl.acm.org/citation.cfm?id=2560945","paperID":"None"},{"content":"Meena Natarajan and Tapan Parikh. 2013. Understanding Barriers to Information Access and Disclosure for HIV+ Women. Proceedings of the Sixth International Conference on Information and Communication Technologies and Development. (ICTD '13), 143--152. http://dl.acm.org/citation.cfm?id=2516627","paperID":"None"},{"content":"Udai Singh Pawar, Joyojeet Pal, Rahul Gupta, and Kentaro Toyama. 2007. Multiple Mice for Retention Tasks in Disadvantaged Schools. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 1769--1778 http://dl.acm.org/citation.cfm?id=1240864","paperID":"None"},{"content":"Knut H Rolland and Eric Monteiro. 2002. Balancing the Local and the Global in Infrastructural Information Systems. The Information Society 18.2, 87--100.","paperID":"None"},{"content":"Ned Rossiter and Soehnke Zehle. 2015. Locative Media as Logistical Media: Situating Infrastructure and the Governance of Labor in Supply-chain Capitalism. In Locative Media, Gerard Goggin and Rowan Wilken (eds.). Routledge, NY, 208--223.","paperID":"None"},{"content":"Ned Rossiter. 2014. Logistical Worlds. Cultural Studies Review 20.1, 53--76.","paperID":"None"},{"content":"Kjeld Schmidt and Liam Bannon. 1992. Taking CSCW Seriously: Supporting Articulation Work. Computer Supported Cooperative Work (CSCW): An International Journal. 1.1--2, 7--40.","paperID":"None"},{"content":"Kjeld Schmidt and Carla Simone. 1996. Coordination mechanisms: Towards a conceptual foundation of CSCW systems design. Computer Supported Cooperative Work (CSCW): An International Journal. 5.2--3,155--200.","paperID":"None"},{"content":"Susan Leigh Star and Karen Ruhleder. 1996. Steps toward an ecology of infrastructure: Design and access for large information spaces. Information Systems Research 7.1, 111--134.","paperID":"None"},{"content":"Susan Leigh Star and Geoffrey C. Bowker. 2007. Enacting silence: Residual categories as a challenge for ethics, information systems, and communication. Ethics and Information Technology 9.4, 273--280.","paperID":"None"},{"content":"Susan Leigh Star and Anselm Strauss. 1999. Layers of silence, arenas of voice: The ecology of visible and invisible work. Computer Supported Cooperative Work (CSCW): An International Journal. 8.1--2, 9--30.","paperID":"None"},{"content":"Anselm Strauss. 1988. The articulation of project work: An organizational process. The Sociological Quarterly 29.2, 163--178.","paperID":"None"},{"content":"Anselm Strauss and Juliet Corbin (eds.). 1997. Grounded Theory in Practice. London: Sage Publications.","paperID":"None"},{"content":"Lucy Suchman. 2007. Human-machine Reconfigurations: Plans and Situated Actions. Cambridge University Press.","paperID":"None"},{"content":"Alex S Taylor. 2011. Out There. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. (CHI '11), 685--694. http://dl.acm.org/citation.cfm?id=1979042","paperID":"None"},{"content":"Anna Tsing. 2004. Friction: An Ethnography of Global Connection. Princeton University Press.","paperID":"None"},{"content":"Anna Tsing. 2009. Supply Chains and the Human Condition. Rethinking Marxism. 21.2,148--176.","paperID":"None"},{"content":"Janet Vertesi. 2014. Seamful Spaces: Heterogeneous Infrastructures in Interaction. Science, Technology & Human Values. 29(2), 264--284.","paperID":"None"},{"content":"Amanda Williams, Silvia Lindtner, Ken Anderson and Paul Dourish. 2014. Multisited Design: An Analytical Lens for Transnational HCI. Human-Computer Interaction 29.1: 78--108.","paperID":"None"}],"abstract":"This paper investigates emerging practices and infrastructures in global humanitarian relief to argue for logistics as an essential but often neglected component of ICTD and broader HCI work. Logistics -- the artful coordination of human and material flows -- leverages scholarship on \"coordination,\" \"articulation\" and \"infrastructure\" to provide insight into the complex role of new IT systems (and HCI as a field) in the global circulation of goods and relations. Drawing on fieldwork with the UNICEF Supply Division, we argue that contemporary logistics operates simultaneously as a form of care and control. We demonstrate that logisticians at Supply traverse messy and dynamic information and material infrastructures, and that effective logistical work must marry and bridge these worlds. Our work extends ICTD and postcolonial computing research by casting light on the nature, experience and ambivalence of the global flows that enable and support HCI work in development and postcolonial settings.","title":"Logistics as Care and Control: An Investigation into the UNICEF Supply Division","filename":"CHI16/p2209","authors":["Margaret Jack","Steven J. Jackson"],"conference":"CHI '16"}