{"paperId":2858431,"citation":[],"abstract":"Software ecosystems as a paradigm for large-scale software development encompass a complex mix of technical, business, and social aspects. While significant research has been conducted to understand both the technical and business aspects, the social aspects of software ecosystems are less well understood. To close this gap, this paper presents the results of an empirical study aimed at understanding the influence of social aspects on developers' participation in software ecosystems. We conducted 25 interviews with mobile software developers and an online survey with 83 respondents from the mobile software development community. Our results point out a complex social system based on continued interaction and mutual support between different actors, including developers, friends, end users, developers from large companies, and online communities. These findings highlight the importance of social aspects in the sustainability of software ecosystems both during the initial adoption phase as well as for long-term permanence of developers.","reference":[{"content":"Ron Adner. 2012. The Wide Lens: A New Strategy for Innovation. Portfolio Hardcover.","paperID":"None"},{"content":"Mohsen Anvaari and Slinger Jansen. 2010. Evaluating Architectural Openness in Mobile Software Platforms. In Proc. of the Fourth European Conference on Software Architecture: Companion Volume (ECSA '10). ACM, NY, NY, USA, 85--92.","paperID":"None"},{"content":"Olavo Barbosa, Rodrigo Santos, Carina Alves, Claudia Werner, and Slinger Jansen. 2013. Software Ecosystems: Analyzing and Managing Business Networks in Software Industry. Edward Elgar, Chapter A Systematic Mapping Study on Software Ecosystems through a Three-dimensional Perspective.","paperID":"None"},{"content":"Jan Bosch and Petra Bosch-Sijtsema. 2010. From integration to composition: On the impact of software product lines, global development and ecosystems. Journal of Systems and Software 83, 1 (2010), 67--76.","paperID":"None"},{"content":"Kathy Charmaz. 2006. Constructing Grounded Theory: A Practical Guide through Qualitative Analysis. SAGE Publications.","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Matthew Dunlap, Richard Fung, and Túlio Souza. 2011. How Do Developers Choose APIs-- (2011). University of Calgary, Canada.","paperID":"None"},{"content":"Juliet Corbin and Anselm Strauss. 2008. Basics of qualitative research: Techniques and procedures for developing grounded theory (3rd ed.). Sage Publications.","paperID":"None"},{"content":"Simone da Silva Amorim, John D. McGregor, Eduardo Santana de Almeida, and Christina von Flach G. Chavez. 2014. Flexibility in Ecosystem Architectures. In Proc. of the European Conf. on Software Architecture Workshops. Article 14, 6 pages.","paperID":"None"},{"content":"Alan R. Dennis, Sridar K. Pootheri, and Vijaya L. Natarajan. 1998. Lessons from the Early Adopters of Web Groupware. J. Manage. Inf. Syst. 14, 4 (1998), 65--86.","paperID":"None"},{"content":"Deepak Dhungana, Iris Groher, Elisabeth Schludermann, and Stefan Biffl. 2010. Software Ecosystems vs. Natural Ecosystems: Learning from the Ingenious Mind of Nature. In Proc. of the 4th European Conf. on Software Architecture: Companion Volume. 96--102.","paperID":"None"},{"content":"Sebastian Draxler and Gunnar Stevens. 2011. Supporting the Collaborative Appropriation of an Open Software Ecosystem. Computer Supported Cooperative Work 20, 4--5 (2011), 403--448.","paperID":"None"},{"content":"Andrea Forte, Niki Kittur, Vanessa Larco, Haiyi Zhu, Amy Bruckman, and Robert E. Kraut. 2012. Coordination and Beyond: Social Functions of Groups in Open Content Production. In Proc. of the Conf. on Computer Supported Cooperative Work. 417--426.","paperID":"None"},{"content":"Samuel Fricker. 2009. Specification and Analysis of Requirements Negotiation Strategy in Software Ecosystems. In Proc. of the First Intl. Workshop on Software Ecosystems. 19--33.","paperID":"None"},{"content":"Jungpil Hahn, Jae Y. Moon, and Chen Zhang. 2008. Emergence of New Project Teams from Open Source Software Developer Networks: Impact of Prior Collaboration Ties. Information Systems Research 19, 3 (2008), 369--391.","paperID":"None"},{"content":"Guido Hertel, Sven Niedner, and Stefanie Herrmann. 2003. Motivation of software developers in Open Source projects: an Internet-based survey of contributors to the Linux kernel. Research Policy 32, 7 (2003), 1159 -- 1177.","paperID":"None"},{"content":"Marco Iansiti and Roy Levien. 2004. The keystone advantage: what the new dynamics of business ecosystems mean for strategy, innovation, and sustainability. Harvard Business Press.","paperID":"None"},{"content":"Chris Jensen and Walt Scacchi. 2007. Role Migration and Advancement Processes in OSSD Projects: A Comparative Case Study. In Proc. of the 29th Intl. Conf. on Software Engineering. 364--374.","paperID":"None"},{"content":"Corey Jergensen, Anita Sarma, and Patrick Wagstrom. 2011. The Onion Patch: Migration in Open Source Ecosystems. In Proc. of the 19th SIGSOFT Symp. and the 13th European Conf. on Foundations of Software Engineering. 70--80.","paperID":"None"},{"content":"Kimmo Karhu, Tingan Tang, and Matti Hämäläinen. 2014. Analyzing Competitive and Collaborative Differences Among Mobile Ecosystems Using Abstracted Strategy Networks. Telemat. Inf. 31, 2 (2014), 319--333.","paperID":"None"},{"content":"Stefan Koch and Markus Kerschbaum. 2014. Joining a smartphone ecosystem: Application developers' motivations and decision criteria. Information and Software Technology 56, 11 (2014), 1423--1435.","paperID":"None"},{"content":"Cliff Lampe, Rick Wash, Alcides Velasquez, and Elif Ozkaya. 2010. Motivations to Participate in Online Communities. In Proc. of the Conf. on Human Factors in Computing Systems. 1927--1936.","paperID":"None"},{"content":"Konstantinos Manikas and Klaus Marius Hansen. 2013. Software ecosystems -- A systematic literature review. Journal of Systems and Software 86, 5 (2013), 1294--1306.","paperID":"None"},{"content":"Tom Mens, Maëlick Claes, and Philippe Grosjean. 2014. ECOS: Ecological studies of open source software ecosystems. In Proc. of the Conf. on Software Maintenance, Reengineering and Reverse Engineering. 403--406.","paperID":"None"},{"content":"Müller Miranda, Renato Ferreira, Cleidson R. B. de Souza, Fernando Figueira Filho, and Leif Singer. 2014. An Exploratory Study of the Adoption of Mobile Development Platforms by Software Engineers. In Proc. of the 1st ACM Intl. Conf. on Mobile Software Engineering and Systems. 50--53.","paperID":"None"},{"content":"Jenny Preece. 2001. Sociability and usability in online communities: determining and measuring success. Behaviour & IT 20, 5 (2001), 347--356.","paperID":"None"},{"content":"Catherine M. Ridings and David Gefen. 2004. Virtual Community Attraction: Why People Hang Out Online. J. Computer-Mediated Communication 10, 1 (2004).","paperID":"None"},{"content":"Martin P. Robillard. 2009. What Makes APIs Hard to Learn-- Answers from Developers. IEEE Softw. 26, 6 (2009), 27--34.","paperID":"None"},{"content":"Everett M. Rogers. 2003. Diffusion of innovations (5th ed.). Free Press. 576 pages.","paperID":"None"},{"content":"Walt Scacchi. 2007. Free/Open Source Software Development: Recent Research Results and Methods. In Architectural Issues, Marvin V. Zelkowitz (Ed.). Advances in Computers, Vol. 69. Academic Press Inc., 243--295.","paperID":"None"},{"content":"Sonali K. Shah. 2006. Motivation, Governance, and the Viability of Hybrid Forms in Open Source Software Development. Manage. Sci. 52, 7 (2006), 1000--1014.","paperID":"None"},{"content":"Lee Sproull and Samer Faraj. 1995. Atheism, Sex, and Databases: The Net As a Social Technology. In Public Access to the Internet, Brian Kahin and James Keller (Eds.). MIT Press, 62--81.","paperID":"None"},{"content":"Igor Steinmacher, Tayana Conte, Marco Aurélio Gerosa, and David Redmiles. 2015. Social Barriers Faced by Newcomers Placing Their First Contribution in Open Source Software Projects. In Proc. of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1379--1392.","paperID":"None"},{"content":"Margaret-Anne Storey, Leif Singer, Brendan Cleary, Fernando Figueira Filho, and Alexey Zagalsky. 2014. The (R) Evolution of Social Media in Software Engineering. In Proceedings of the on Future of Software Engineering (FOSE 2014). ACM, NY, NY, USA, 100--116.","paperID":"None"},{"content":"Colleen Stuart, Laura Dabbish, Sara Kiesler, Peter Kinnaird, and Ruogu Kang. 2012. Social Transparency in Networked Information Exchange: A Theoretical Framework. In Proc. of the Conf. on Computer Supported Cooperative Work. 451--460.","paperID":"None"},{"content":"Christoph Treude and Margaret-Anne Storey. 2011. Effective Communication of Software Development Knowledge Through Community Portals. In Proc. of the 19th SIGSOFT Symp. and the 13th European Conf. on Foundations of Software Engineering. 91--101.","paperID":"None"},{"content":"Eric S. K. Yu and Stephanie Deng. 2011. Understanding Software Ecosystems: A Strategic Modeling Approach. In Proc. of the 3rd Intl. Workshop on Software Ecosystems. 65--76.","paperID":"None"}],"title":"The Social Side of Software Platform Ecosystems","filename":"CHI16/p3204","authors":["Cleidson R.B. de Souza","Fernando Figueira Filho","Müller Miranda","Renato Pina Ferreira","Christoph Treude","Leif Singer"],"conference":"CHI '16"}