{"paperId":2858321,"abstract":"We present Speeching, a mobile application that uses crowdsourcing to support the self-monitoring and management of speech and voice issues for people with Parkinson's (PwP). The application allows participants to audio record short voice tasks, which are then rated and assessed by crowd workers. Speeching then feeds these results back to provide users with examples of how they were perceived by listeners unconnected to them (thus not used to their speech patterns). We conducted our study in two phases. First we assessed the feasibility of utilising the crowd to provide ratings of speech and voice that are comparable to those of experts. We then conducted a trial to evaluate how the provision of feedback, using Speeching, was valued by PwP. Our study highlights how applications like Speeching open up new opportunities for self-monitoring in digital health and wellbeing, and provide a means for those without regular access to clinical assessment services to practice and get meaningful feedback on their speech.","citation":[],"reference":[{"content":"Melissa M Ahern and Michael S Hendryx. 2003. Social capital and trust in providers. Social Science & Medicine 57, 7: 1195-1203. http://doi.org/10.1016/S0277--9536(02)00494-X","paperID":"None"},{"content":"S Arora, V Venkataraman, A Zhan, et al. 2015. Detecting and monitoring the symptoms of Parkinson's disease using smartphones: A pilot study. Parkinsonism & Related Disorders 21, 6: 650-653. http://doi.org/10.1016/j.parkreldis.2015.02.026","paperID":"None"},{"content":"Kartik Audhkhasi, Panayiotis G. Georgiou, and Shrikanth S. Narayanan. 2011. Reliability-weighted acoustic model adaptation using crowd sourced transcriptions. Proceedings of the Annual Conference of the International Speech Communication Association, INTERSPEECH, 3045-3048.","paperID":"None"},{"content":"Julie Barlow, Chris Wright, Janice Sheasby, Andy Turner, and Jenny Hainsworth. 2002. Self-management approaches for people with chronic conditions: A review. Patient Education and Counseling 48, 177-187. http://doi.org/10.1016/S0738--3991(02)00032-0","paperID":"None"},{"content":"Jeffrey P. Bigham, Richard E. Ladner, and Yevgen Borodin. 2011. The design of human-powered access technology. The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility - ASSETS '11, ACM Press, 3. http://doi.org/10.1145/2049536.2049540","paperID":"None"},{"content":"Jeffrey P. Bigham, Samual White, Tom Yeh, et al. 2010. VizWiz. Proceedings of the 23nd annual ACM symposium on User interface software and technology UIST '10, ACM Press, 333. http://doi.org/10.1145/1866029.1866080","paperID":"None"},{"content":"Riley Bove, Elizabeth Secor, Brian C Healy, et al. 2013. Evaluation of an online platform for multiple sclerosis research: patient description, validation of severity scale, and exploration of BMI effects on disease course. PloS one 8, 3: e59707. http://doi.org/10.1371/journal.pone.0059707","paperID":"None"},{"content":"V. Braun and V. Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3: 77-101. http://doi.org/10.1191/1478088706qp063oa","paperID":"None"},{"content":"Michele A. Burton, Erin Brady, Robin Brewer, Callie Neylan, Jeffrey P. Bigham, and Amy Hurst. 2012. Crowdsourcing subjective fashion advice using VizWiz. Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility - ASSETS '12, ACM Press, 135. http://doi.org/10.1145/2384916.2384941","paperID":"None"},{"content":"Tara McAllister Byun, Peter F Halpin, and Daniel Szeredi. 2015. Online crowdsourcing for efficient rating of speech: A validation study. Journal of Communication Disorders 53, 0: 70-83. http://doi.org/http://dx.doi.org/10.1016/j.jcomdis.2014.1 1.003","paperID":"None"},{"content":"Gerald J. Canter. 1963. Speech Characteristics of Patients with Parkinson's Disease: I. Intensity, Pitch, and Duration. Journal of Speech and Hearing Disorders 28, 3: 221. http://doi.org/10.1044/jshd.2803.221","paperID":"None"},{"content":"Anna C. Cavender, Daniel S. Otero, Jeffrey P. Bigham, and Richard E. Ladner. 2010. Asl-stem forum. Proceedings of the 28th international conference on Human factors in computing systems CHI '10, ACM Press, 2075. http://doi.org/10.1145/1753326.1753642","paperID":"None"},{"content":"Rumi Chunara, Vina Chhaya, Sunetra Bane, et al. 2012. Online reporting for malaria surveillance using micromonetary incentives, in urban India 2010--2011. Malaria Journal 11, 1: 43. http://doi.org/10.1186/1475--2875--11-","paperID":"None"},{"content":"Seth Cooper, Firas Khatib, Adrien Treuille, et al. 2010. Predicting protein structures with a multiplayer online game. Nature 466, 7307: 756-60. http://doi.org/10.1038/nature09304","paperID":"None"},{"content":"Nicolas Côté. 2011. Integral and Diagnostic Intrusive Prediction of Speech Quality. Springer Science & Business Media. Retrieved September 12, 2015 from https://books.google.com/books?id=utLeUB2H34C&pgis=1","paperID":"None"},{"content":"F Darley, A Aronson, and J Brown. 1969. Differential Diagnostic Patterns of Dysarthria. Journal of Speech Language and Hearing Research 12, 2: 246. http://doi.org/10.1044/jshr.1202.246","paperID":"None"},{"content":"F Darley, A Aronson, and J Brown. 1975. Motor speech disorders. W.B. Saunders Company., Philadelphia, PA.","paperID":"None"},{"content":"Julie McDonough Dolmaya. 2011. The ethics of crowdsourcing. Linguistica Antverpiensia, New Series - Themes in Translation Studies. Retrieved September 25, 2015 from https://lans-tts.ua.ac.be/index.php/LANSTTS/article/view/279","paperID":"None"},{"content":"Keelan Evanini and Klaus Zechner. 2011. Using crowdsourcing to provide prosodic annotations for nonnative speech. Proceedings of the Annual Conference of the International Speech Communication Association, INTERSPEECH, 3069-3072.","paperID":"None"},{"content":"James Evans. 1996. Straightforward statistics for the behavioral sciences. Brooks/Cole Pub. Co., Pacific Grove.","paperID":"None"},{"content":"C Fox, C Morrison, L Ramig, and S Shapir. 2002. Current Perspectives on the Lee Silverman Voice Treatment (LSVT) for Individuals With Idiopathic Parkinson Disease. American Journal of SpeechLanguage Pathology 11: 111-123.","paperID":"None"},{"content":"Masataka Goto and Jun Ogata. 2011. PodCastle: Recent advances of a spoken document retrieval service improved by anonymous user contributions. Proceedings of the Annual Conference of the International Speech Communication Association, INTERSPEECH, 3073-3076.","paperID":"None"},{"content":"John Green, Anne Forster, Sue Bogle, and John Young. 2002. Physiotherapy for patients with mobility problems more than 1 year after stroke: A randomised controlled trial. Lancet 359, 9302: 199-203. http://doi.org/10.1016/S0140--6736(02)07443--3","paperID":"None"},{"content":"Aileen K. Ho, Robert Iansek, Caterina Marigliani, John L. Bradshaw, and Sandra Gates. 1998. Speech impairment in a large sample of patients with Parkinson's disease. Behavioural neurology 11: 131- 137. http://doi.org/10.1155/1999/327643","paperID":"None"},{"content":"R Holmes, J Oates, D Phyland, and A Hughes. 2000. Voice characteristics in the progression of Parkinson's disease. International Journal of Language & Communication Disorders 35, 3: 407-418. http://doi.org/10.1080/136828200410654","paperID":"None"},{"content":"I Kawachi, B P Kennedy, and R Glass. 1999. Social capital and self-rated health: a contextual analysis. American Journal of Public Health 89, 8: 1187-1193. http://doi.org/10.2105/AJPH.89.8.1187","paperID":"None"},{"content":"Sophie Landa, Lindsay Pennington, Nick Miller, Sheila Robson, Vicki Thompson, and Nick Steen. 2014. Association between objective measurement of the speech intelligibility of young people with dysarthria and listener ratings of ease of understanding. International journal of speech-language pathology 16, 4: 408-16. http://doi.org/10.3109/17549507.2014.927922","paperID":"None"},{"content":"J R Landis and G G Koch. 1977. The measurement of observer agreement for categorical data. Biometrics 33, 1: 159-174. http://doi.org/10.2307/2529310","paperID":"None"},{"content":"Walter S. Lasecki, Jaime Teevan, and Ece Kamar. 2014. Information extraction and manipulation threats in crowd-powered systems. 17th ACM conference on Computer supported cooperative work & social computing, 248-256. http://doi.org/10.1145/2531602.2531733","paperID":"None"},{"content":"Matthew Marge, Satanjeev Banerjee, and Alexander I Rudnicky. 2010. Using the Amazon Mechanical Turk to Transcribe and Annotate Meeting Speech for Extractive Summarization. Proceedings of the NAACL HLT 2010 Workshop on Creating Speech and Language Data with Amazon's Mechanical Turk, Association for Computational Linguistics, 99-107.","paperID":"None"},{"content":"Matthew Marge, Satanjeev Banerjee, and Alexander I. Rudnicky. 2010. Using the Amazon Mechanical Turk for transcription of spoken language. 2010 IEEE International Conference on Acoustics, Speech and Signal Processing, IEEE, 5270-5273. http://doi.org/10.1109/ICASSP.2010.5494979","paperID":"None"},{"content":"Ian McGraw, Alexander Gruenstein, and Andrew Sutherland. 2009. A self-labeling speech corpus: Collecting spoken words with an online educational game. Proceedings of the Annual Conference of the International Speech Communication Association, INTERSPEECH, 3031-3034.","paperID":"None"},{"content":"J A McKenzie. 1992. The provision of speech, language and hearing services in a rural district of South Africa. The South African journal of communication disorders = Die Suid-Afrikaanse tydskrif vir Kommunikasieafwykings 39: 50-4. Retrieved September 21, 2015 from http://europepmc.org/abstract/med/1345506","paperID":"None"},{"content":"Nick Miller, Liesl Allcock, Diana Jones, Emma Noble, Anthony J Hildreth, and David J Burn. 2007. Prevalence and pattern of perceived intelligibility changes in Parkinson's disease. Journal of neurology, neurosurgery, and psychiatry 78, 11: 1188-1190. http://doi.org/10.1136/jnnp.2006.110171","paperID":"None"},{"content":"Nick Miller, Katherine H O Deane, Diana Jones, Emma Noble, and Catherine Gibb. 2011. National survey of speech and language therapy provision for people with Parkinson's disease in the United Kingdom: therapists' practices. International Journal of Language & Communication Disorders 46, 2: 189-201. http://doi.org/10.3109/13682822.2010.484849","paperID":"None"},{"content":"Nick Miller, Emma Noble, Diana Jones, Liesl Allcock, and David J Burn. 2008. How do I sound to me? Perceived changes in communication in Parkinson's disease. Clinical rehabilitation 22, 1: 14-22. http://doi.org/10.1177/0269215507079096","paperID":"None"},{"content":"Nick Miller, Emma Noble, Diana Jones, and David Burn. 2006. Life with communication changes in Parkinson's disease. Age and Ageing 35, 3: 235-239. http://doi.org/10.1093/ageing/afj053","paperID":"None"},{"content":"Nick Miller, Emma Noble, Diana Jones, Katherine H O Deane, and Catherine Gibb. 2011. Survey of speech and language therapy provision for people with Parkinson's disease in the United Kingdom: patients' and carers' perspectives. International journal of language & communication disorders / Royal College of Speech & Language Therapists 46, 2: 179-188. http://doi.org/10.3109/13682822.2010.484850","paperID":"None"},{"content":"Nick Miller. 2013. Measuring up to speech intelligibility. International Journal of Language and Communication Disorders 48, 601-612. http://doi.org/10.1111/1460--6984.12061","paperID":"None"},{"content":"Tan B Nguyen, Shijun Wang, Vishal Anugu, et al. 2012. Distributed human intelligence for colonic polyp classification in computer-aided detection for CT colonography. Radiology 262, 3: 824-33. http://doi.org/10.1148/radiol.11110938","paperID":"None"},{"content":"M J Nijkrake, S H J Keus, J G Kalf, et al. 2007. Allied health care interventions and complementary therapies in Parkinson's disease. Parkinsonism & related disorders 13 Suppl 3: S488-S494. http://doi.org/10.1016/S1353--8020(08)70054--3","paperID":"None"},{"content":"Francisco Nunes and Geraldine Fitzpatrick. 2015. Selfcare technologies and collaboration. International Journal of Human-Computer Interaction: 150730080814008. http://doi.org/10.1080/10447318.2015.1067498","paperID":"None"},{"content":"Gabriel Parent and Maxine Eskenazi. 2011. Speaking to the Crowd: Looking at past achievements in using crowdsourcing for speech and predicting future challenges. Proceedings of the Annual Conference of the International Speech Communication Association, INTERSPEECH, 3037-3040.","paperID":"None"},{"content":"Patientslikeme. 2015. Live Better, Together! Retrieved from https://www.patientslikeme.com/","paperID":"None"},{"content":"Megan Perry, Robert L Williams, Nina Wallerstein, and Howard Waitzkin. 2008. Social capital and health care experiences among low-income individuals. American journal of public health 98, 2: 330-6. http://doi.org/10.2105/AJPH.2006.086306","paperID":"None"},{"content":"R Putnam. 2001. Bowling Alone: The Collapse and Revival of American Community. Simon & Schuster. Retrieved September 25, 2015 from http://bowlingalone.com/","paperID":"None"},{"content":"L O Ramig, S Sapir, S Countryman, et al. 2001. Intensive voice treatment (LSVT) for patients with Parkinson's disease: a 2 year follow up. http://doi.org/10.1136/jnnp.71.4.493","paperID":"None"},{"content":"M Swan, K Hathaway, C Hogg, R McCauley, and A Vollrath. 2010. Citizen science genomics as a model for crowdsourced preventive medicine research. J Participat Med 2: e20. Retrieved from http://www.jopm.org/evidence/research/2010/12/23/citizen-science-genomics-as-a-model-for-crowdsourcedpreventive-medicine-research","paperID":"None"},{"content":"M Swan. 2012. Health 2050: The Realization of Personalized Medicine through Crowdsourcing, the Quantified Self, and the Participatory Biocitizen. Journal of personalized medicine 2, 3: 93-118. http://doi.org/10.3390/jpm2030093","paperID":"None"},{"content":"Kris Tjaden. 2008. Speech and Swallowing in Parkinson's Disease. Topics in geriatric rehabilitation 24, 2: 115-126. http://doi.org/10.1097/01.TGR.0000318899.87690.44","paperID":"None"},{"content":"Gary Weismer and Jacqueline S Laures. 2002. Direct magnitude estimates of speech intelligibility in dysarthria: effects of a chosen standard. Journal of speech, language, and hearing research : JSLHR 45, 3: 421-433. http://doi.org/10.1044/1092--4388(2002/033)","paperID":"None"},{"content":"Paul Wicks, Dorothy L Keininger, Michael P Massagli, et al. 2012. Perceived benefits of sharing health data between people with epilepsy on an online platform. Epilepsy & behavior : E&B 23, 1: 16-23. http://doi.org/10.1016/j.yebeh.2011.09.026","paperID":"None"},{"content":"Sheila Wight and Nick Miller. 2015. Lee Silverman Voice Treatment for people with Parkinson's: audit of outcomes in a routine clinic. International journal of language & communication disorders / Royal College of Speech & Language Therapists 50, 2: 215-25. http://doi.org/10.1111/1460--6984.12132","paperID":"None"},{"content":"Maria K. Wolters, Karl B. Isaac, and Steve Renals. 2011. Evaluating speech synthesis intelligibility using Amazon Mechanical Turk. Retrieved August 27, 2015 from https://www.era.lib.ed.ac.uk/handle/1842/4660","paperID":"None"},{"content":"Xian-Hong Xiang, Xiao-Yu Huang, Xiao-Ling Zhang, Chun-Fang Cai, Jian-Yong Yang, and Lei Li. 2014. Many Can Work Better than the Best: Diagnosing with Medical Images via Crowdsourcing. Entropy 16, 7: 3866-3877. http://doi.org/10.3390/e16073866","paperID":"None"},{"content":"Wolfram Ziegler and Andreas Zierdt. 2008. Telediagnostic assessment of intelligibility in dysarthria: A pilot investigation of MVP-online. Journal of Communication Disorders. http://doi.org/10.1016/j.jcomdis.2008.05.001","paperID":"None"},{"content":"Wolfram Ziegler and Andreas Zierdt. 2008. Telediagnostic assessment of intelligibility in dysarthria: A pilot investigation of MVP-online. Journal of Communication Disorders 41, 6: 553-577. http://doi.org/10.1016/j.jcomdis.2008.05.001","paperID":"None"},{"content":"Crowdmed. Retrieved from https://www.crowdmed.com/","paperID":"None"}],"title":"Speeching: Mobile Crowdsourced Speech Assessment to Support Self-Monitoring and Management for People with Parkinson's","filename":"CHI16/p4464","authors":["Róisín McNaney","Mohammad Othman","Dan Richardson","Paul Dunphy","Telmo Amaral","Nick Miller","Helen Stringer","Patrick Olivier","John Vines"],"conference":"CHI '16"}