{"paperId":2858244,"citation":[],"reference":[{"content":"Gery Casiez, Daniel Vogel, Ravin Balakrishnan, and Andy Cockburn. 2008. The Impact of Control-Display Gain on User Performance in Pointing Tasks. Human-Computer Interaction 23, 3 (2008), 215--250. DOI: http://dx.doi.org/10.1080/07370020802278163","paperID":"None"},{"content":"Sarah A. Douglas, Arthur E. Kirkpatrick, and I. Scott MacKenzie. 1999. Testing Pointing Device Performance and User Assessment with the ISO 9241, Part 9 Standard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 215--222. DOI: http://dx.doi.org/10.1145/302979.303042","paperID":"None"},{"content":"Stephen R. Ellis. 1991. Nature and origins of virtual environments: A bibliographical essay. Computing Systems in Engineering 2, 4 (May 1991), 321--347.","paperID":"None"},{"content":"Paul M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology 47, 6 (1954), 381--391.","paperID":"None"},{"content":"Evan D. Graham. 1996. Pointing on a computer display. Ph.D. Dissertation. Simon Fraser University.","paperID":"None"},{"content":"Evan D. Graham and Christine L. MacKenzie. 1996. Physical Versus Virtual Pointing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '96). ACM, NY, NY, USA, 292--299. DOI: http://dx.doi.org/10.1145/238386.238532","paperID":"None"},{"content":"K.N. Iyer, M. Chari, and H. Kannan. 2008. A Novel Approach to Depth Image Based Rendering Based on Non-Uniform Scaling of Depth Values. In Future Generation Communication and Networking Symposia, 2008. FGCNS '08. Second International Conference on, Vol. 3. 31--34. DOI: http://dx.doi.org/10.1109/FGCNS.2008.46","paperID":"None"},{"content":"Graham R. Jones, Delman Lee, Nicolas S. Holliman, and David Ezra. 2001. Controlling perceived depth in stereoscopic images. Proc. SPIE Stereoscopic Displays and Virtual Reality Systems VIII 4297 (June 2001), 42--53.","paperID":"None"},{"content":"Newell C. Kerphart. 1971. The slow learner in the classroom (2 ed.). Columbus, OH: Merrill.","paperID":"None"},{"content":"Heidi Horstmann Koester, Edmund LoPresti, and Richard C. Simpson. 2005. Toward Goldilocks' pointing device: Determining a \"just right\" gain setting for users with physical impairments. In Proceedings of the 7th international ACM SIGACCESS conference on Computers and accessibility (Assets '05). ACM, NY, NY, USA, 84--89. DOI: http://dx.doi.org/10.1145/1090785.1090802","paperID":"None"},{"content":"Regis Kopper, Doug A. Bowman, Mara G. Silva, and Ryan P. McMahan. 2010. A human motor behavior model for distal pointing tasks. Int. J. Hum.-Comput. Stud. 68, 10 (Oct. 2010), 603--615. DOI: http://dx.doi.org/10.1016/j.ijhcs.2010.05.001","paperID":"None"},{"content":"Ian Scott MacKenzie. 1991. Fitts' law as a performance model in human-computer interaction. Ph.D. Dissertation. University of Toronto, Toronto, ON, Canada.","paperID":"None"},{"content":"I. Scott MacKenzie. 1992. Fitts' Law As a Research and Design Tool in Human-computer Interaction. Hum.-Comput. Interact. 7, 1 (March 1992), 91--139. DOI: http://dx.doi.org/10.1207/s15327051hci0701_3","paperID":"None"},{"content":"Ian Scott MacKenzie and Stan Riddersma. 1994. Effects of output display and control-display gain on human performance in interactive systems. Behaviour and Information Technology 13 (1994), 328--337.","paperID":"None"},{"content":"Brian Peek. 2012. WiimoteLib - .NET Managed Library for the Nintendo Wii Remote. (2012). brianpeek.com/page/wiimotelib","paperID":"None"},{"content":"W. N. Schofield. 1976. Do children find movements which cross the body midline difficult? Quarterly Journal of Experimental Psychology 28, 4 (1976), 571--582. DOI: http://dx.doi.org/10.1080/14640747608400584","paperID":"None"},{"content":"Garth Shoemaker, Takayuki Tsukitani, Yoshifumi Kitamura, and Kellogg S. Booth. 2012. Two-part models capture the impact of gain on pointing performance. ACM Trans. Comput.-Hum. Interact. 19, 4, Article 28 (Dec. 2012), 34 pages. DOI: http://dx.doi.org/10.1145/2395131.2395135","paperID":"None"},{"content":"R. William Soukoreff and I. Scott MacKenzie. 2004. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. Int. J. Hum.-Comput. Stud. 61, 6 (Dec. 2004), 751--789. DOI: http://dx.doi.org/10.1016/j.ijhcs.2004.09.001","paperID":"None"},{"content":"William Strunk, Jr. and E. B. White. 1959. Elements of style. NY, NY: Macmillan.","paperID":"None"},{"content":"R.J. Teather and W. Stuerzlinger. 2011. Pointing at 3D targets in a stereo head-tracked virtual environment. In 3D User Interfaces (3DUI), 2011 IEEE Symposium on. 87--94. DOI: http://dx.doi.org/10.1109/3DUI.2011.5759222","paperID":"None"},{"content":"Robert J. Teather and Wolfgang Stuerzlinger. 2012. A System for Evaluating 3D Pointing Techniques. In Proceedings of the 18th ACM Symposium on Virtual Reality Software and Technology (VRST '12). ACM, NY, NY, USA, 209--210. DOI: http://dx.doi.org/10.1145/2407336.2407383","paperID":"None"},{"content":"Robert J. Teather and Wolfgang Stuerzlinger. 2013. Pointing at 3D Target Projections with One-eyed and Stereo Cursors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 159--168. DOI: http://dx.doi.org/10.1145/2470654.2470677","paperID":"None"},{"content":"Robert J. Teather and Wolfgang Stuerzlinger. 2014a. Depth Cues and Mouse-based 3D Target Selection. In Proceedings of the 2nd ACM Symposium on Spatial User Interaction (SUI '14). ACM, NY, NY, USA, 156--156. DOI: http://dx.doi.org/10.1145/2659766.2661221","paperID":"None"},{"content":"Robert J. Teather and Wolfgang Stuerzlinger. 2014b. Visual Aids in 3D Point Selection Experiments. In Proceedings of the 2Nd ACM Symposium on Spatial User Interaction (SUI '14). ACM, NY, NY, USA, 127--136. DOI: http://dx.doi.org/10.1145/2659766.2659770","paperID":"None"},{"content":"Robert J. Teather and Wolfgang Stuerzlinger. 2015. Factors Affecting Mouse-Based 3D Selection in Desktop VR Systems. In Proceedings of the 3rd ACM Symposium on Spatial User Interaction (SUI '15). ACM, NY, NY, USA, 10--19. DOI: http://dx.doi.org/10.1145/2788940.2788946","paperID":"None"},{"content":"Robert J. Teather, Wolfgang Stuerzlinger, and Andriy Pavlovych. 2014. Fishtank Fitts: A Desktop VR Testbed for Evaluating 3D Pointing Techniques. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 519--522. DOI: http://dx.doi.org/10.1145/2559206.2574810","paperID":"None"},{"content":"A. T. Welford. 1968. Fundamentals of skill. London: Methuen.","paperID":"None"},{"content":"Chang Yuan, Hao Pan, and Scott Daly. 2011. Stereoscopic 3D content depth tuning guided by human visual models. SID Symposium Digest of Technical Papers 42, 1 (2011), 916--919.","paperID":"None"},{"content":"Shumin Zhai, Jing Kong, and Xiangshi Ren. 2004. Speed-accuracy tradeoff in Fitts' law tasks: On the equivalency of actual and nominal pointing precision. Int. J. Hum.-Comput. Stud. 61, 6 (Dec. 2004), 823--856. DOI: http://dx.doi.org/10.1016/j.ijhcs.2004.09.007","paperID":"None"}],"abstract":"An important visual cue for the distance to a target is its binocular depth, the disparity between the left and right eyes. We examined mid-air pointing on a large screen, varying the physical distances (depths) to targets. Welford's two-part formulation provided a better model than the one-part Fitts's Law formulation to predict movement time from movement amplitude and target width. Angular measures suggested by Kopper et al. did not improve the model. Consistent variations of Shoemaker et al.'s k-factor suggest target depth plays a role similar to gain for mid-air pointing. We compared both physical and virtual targets to determine if artificial binocular depth cues induce the same performance as purely physical binocular depth cues. Variation of the k-factor was different when virtual depth and physical depth were not identical. This has implications for calibrating 3-D virtual environments and for the design of interactive 3-D pointing techniques for those environments.","title":"Modeling the Impact of Depth on Pointing Performance","filename":"CHI16/p188","authors":["Izabelle Janzen","Vasanth K. Rajendran","Kellogg S. Booth"],"conference":"CHI '16"}