{"paperId":2858483,"citation":[],"reference":[{"content":"Daniel Ashbrook, Patrick Baudisch, and Sean White. 2011. Nenya: Subtle and Eyes-free Mobile Input with a Magnetically-tracked Finger Ring. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2043--2046. DOI: http://dx.doi.org/10.1145/1978942.1979238","paperID":"None"},{"content":"Joanna Bergstrom-Lehtovirta and Antti Oulasvirta. 2014. Modeling the Functional Area of the Thumb on Mobile Touchscreen Surfaces. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1991--2000. DOI: http://dx.doi.org/10.1145/2556288.2557354","paperID":"None"},{"content":"Andrew Bragdon, Eugene Nelson, Yang Li, and Ken Hinckley. 2011. Experimental Analysis of Touch-screen Gesture Designs in Mobile Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 403--412. DOI: http://dx.doi.org/10.1145/1978942.1979000","paperID":"None"},{"content":"Liwei Chan, Yi-Ling Chen, Chi-Hao Hsieh, Rong-Hao Liang, and Bing-Yu Chen. 2015. CyclopsRing: Enabling Whole-Hand and Context-Aware Interactions Through a Fisheye Ring. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15). ACM, NY, NY, USA, 549--556. DOI:http://dx.doi.org/10.1145/2807442.2807450","paperID":"None"},{"content":"Liwei Chan, Rong-Hao Liang, Ming-Chang Tsai, Kai-Yin Cheng, Chao-Huai Su, Mike Y. Chen, Wen-Huang Cheng, and Bing-Yu Chen. 2013. FingerPad: Private and Subtle Interaction Using Fingertips. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 255--260. DOI: http://dx.doi.org/10.1145/2501988.2502016","paperID":"None"},{"content":"Ke-Yu Chen, Kent Lyons, Sean White, and Shwetak Patel. 2013. uTrack: 3D Input Using Two Magnetic Sensors. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 237--244. DOI: http://dx.doi.org/10.1145/2501988.2502035","paperID":"None"},{"content":"Artem Dementyev and Joseph A. Paradiso. 2014. WristFlex: Low-power Gesture Input with Wrist-worn Pressure Sensors. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 161--166. DOI: http://dx.doi.org/10.1145/2642918.2647396","paperID":"None"},{"content":"Niloofar Dezfuli, Mohammadreza Khalilbeigi, Jochen Huber, Florian Muller, and Max Muhlhauser. 2012. PalmRC: Imaginary Palm-based Remote Control for Eyes-free Television Interaction. In Proceedings of the 10th European Conference on Interactive Tv and Video (EuroiTV '12). ACM, NY, NY, USA, 27--34. DOI: http://dx.doi.org/10.1145/2325616.2325623","paperID":"None"},{"content":"Sean Gustafson, Christian Holz, and Patrick Baudisch. 2011. Imaginary Phone: Learning Imaginary Interfaces by Transferring Spatial Memory from a Familiar Device. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 283--292. DOI: http://dx.doi.org/10.1145/2047196.2047233","paperID":"None"},{"content":"Sean G. Gustafson, Bernhard Rabe, and Patrick M. Baudisch. 2013. Understanding Palm-based Imaginary Interfaces: The Role of Visual and Tactile Cues when Browsing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 889--898. DOI: http://dx.doi.org/10.1145/2470654.2466114","paperID":"None"},{"content":"Chris Harrison, Hrvoje Benko, and Andrew D. Wilson. 2011. OmniTouch: Wearable Multitouch Interaction Everywhere. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 441--450. DOI: http://dx.doi.org/10.1145/2047196.2047255","paperID":"None"},{"content":"Chris Harrison, Desney Tan, and Dan Morris. 2010. Skinput: Appropriating the Body As an Input Surface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 453--462. DOI: http://dx.doi.org/10.1145/1753326.1753394","paperID":"None"},{"content":"Hsin-Liu (Cindy) Kao, Artem Dementyev, Joseph A. Paradiso, and Chris Schmandt. 2015. NailO: Fingernails As an Input Surface. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3015--3018. DOI: http://dx.doi.org/10.1145/2702123.2702572","paperID":"None"},{"content":"Amy K. Karlson and Benjamin B. Bederson. 2006. Studies in One-Handed Mobile Design: Habit, Desire and Agility. Technical Report HCIL-2006-02.","paperID":"None"},{"content":"Hamed Ketabdar, Mehran Roshandel, and Kamer Ali Yuksel. 2010. MagiWrite: Towards Touchless Digit Entry Using 3D Space Around Mobile Devices. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, NY, NY, USA, 443--446. DOI: http://dx.doi.org/10.1145/1851600.1851701","paperID":"None"},{"content":"L.-C. Kuo, H.-Y. Chiu, C.-W. Chang, H.-Y. Hsu, and Y.-N Sun. 2009. Functional workspace for precision manipulation between thumb and fingers in normal hands. In J. Electromyogr. Kines. 829--839.","paperID":"None"},{"content":"Z.-M. Li and J. Tang. 2009. Coordination of thumb joints during opposition. In J. Electromyogr. Kines. 502--510.","paperID":"None"},{"content":"Shu-Yang Lin, Chao-Huai Su, Kai-Yin Cheng, Rong-Hao Liang, Tzu-Hao Kuo, and Bing-Yu Chen. 2011. Pub - Point Upon Body: Exploring Eyes-free Interaction and Methods on an Arm. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 481--488. DOI: http://dx.doi.org/10.1145/2047196.2047259","paperID":"None"},{"content":"Roman Lissermann, Jochen Huber, Aristotelis Hadjakos, Suranga Nanayakkara, and Max Muhlhauser. 2014. EarPut: Augmenting Ear-worn Devices for Ear-based Interaction. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (OzCHI '14). ACM, NY, NY, USA, 300--307. DOI: http://dx.doi.org/10.1145/2686612.2686655","paperID":"None"},{"content":"Christian Loclair, Gustafson Sean, and Patrick Baudisch. 2010. PinchWatch: A Wearable Devices for One-Handed Microinteractions. In Proc. MobileHCI '10 Workshop on Ensembles of On-Body Devices.","paperID":"None"},{"content":"Pranav Mistry and Pattie Maes. 2009. SixthSense: A Wearable Gestural Interface. In ACM SIGGRAPH ASIA 2009 Sketches (SIGGRAPH ASIA '09). ACM, NY, NY, USA, Article 11, 11:1--11:1 pages. DOI: http://dx.doi.org/10.1145/1667146.1667160","paperID":"None"},{"content":"Adiyan Mujibiya, Xiang Cao, Desney S. Tan, Dan Morris, Shwetak N. Patel, and Jun Rekimoto. 2013. The Sound of Touch: On-body Touch and Gesture Sensing Based on Transdermal Ultrasound Propagation. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, NY, NY, USA, 189--198. DOI: http://dx.doi.org/10.1145/2512349.2512821","paperID":"None"},{"content":"Tao Ni and Patrick Baudisch. 2009. Disappearing Mobile Devices. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, NY, NY, USA, 101--110. DOI: http://dx.doi.org/10.1145/1622176.1622197","paperID":"None"},{"content":"Masa Ogata, Yuta Sugiura, Yasutoshi Makino, Masahiko Inami, and Michita Imai. 2013. SenSkin: Adapting Skin As a Soft Interface. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 539--544. DOI: http://dx.doi.org/10.1145/2501988.2502039","paperID":"None"},{"content":"Keith B. Perry and Juan Pablo Hourcade. 2008. Evaluating One Handed Thumb Tapping on Mobile Touchscreen Devices. In Proceedings of Graphics Interface 2008 (GI '08). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 57--64. http://dl.acm.org/citation.cfm?id=1375714.1375725","paperID":"None"},{"content":"Manuel Pratorius, Dimitar Valkov, Ulrich Burgbacher, and Klaus Hinrichs. 2014. DigiTap: An Eyes-free VR/AR Symbolic Input Device. In Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology (VRST '14). ACM, NY, NY, USA, 9--18. DOI: http://dx.doi.org/10.1145/2671015.2671029","paperID":"None"},{"content":"T. Scott Saponas, Desney S. Tan, Dan Morris, Ravin Balakrishnan, Jim Turner, and James A. Landay. 2009. Enabling Always-available Input with Muscle-computer Interfaces. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, NY, NY, USA, 167--176. DOI: http://dx.doi.org/10.1145/1622176.1622208","paperID":"None"},{"content":"Marcos Serrano, Barrett M. Ens, and Pourang P. Irani. 2014. Exploring the Use of Hand-to-face Input for Interacting with Head-worn Displays. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3181--3190. DOI: http://dx.doi.org/10.1145/2556288.2556984","paperID":"None"},{"content":"K. Tsukada and M Yasamura. 2004. Ubi-finger: A simple gesture input device for mobile and ubiquitous environment. Journal of Asian Information, Science and Life 2, 2 (2004), 111--120.","paperID":"None"},{"content":"Cheng-Yao Wang, Min-Chieh Hsiu, Po-Tsung Chiu, Chiao-Hui Chang, Liwei Chan, Bing-Yu Chen, and Mike Y. Chen. 2015. PalmGesture: Using Palms As Gesture Interfaces for Eyes-free Input. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, NY, NY, USA, 217--226. DOI: http://dx.doi.org/10.1145/2785830.2785885","paperID":"None"},{"content":"Martin Weigel, Vikram Mehta, and Jurgen Steimle. 2014. More Than Touch: Understanding How People Use Skin As an Input Surface for Mobile Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 179--188. DOI: http://dx.doi.org/10.1145/2556288.2557239","paperID":"None"},{"content":"Jacob O. Wobbrock, Andrew D. Wilson, and Yang Li. 2007. Gestures Without Libraries, Toolkits or Training: A $1 Recognizer for User Interface Prototypes. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, NY, NY, USA, 159--168. DOI: http://dx.doi.org/10.1145/1294211.1294238","paperID":"None"},{"content":"Sang Ho Yoon, Ke Huo, Vinh P. Nguyen, and Karthik Ramani. 2015. TIMMi: Finger-worn Textile Input Device with Multimodal Sensing in Mobile Interaction. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, NY, NY, USA, 269--272. DOI: http://dx.doi.org/10.1145/2677199.2680560","paperID":"None"}],"abstract":"Thumb-to-fingers interfaces augment touch widgets on fingers, which are manipulated by the thumb. Such interfaces are ideal for one-handed eyes-free input since touch widgets on the fingers enable easy access by the stylus thumb. This study presents DigitSpace, a thumb-to-fingers interface that addresses two ergonomic factors: hand anatomy and touch precision. Hand anatomy restricts possible movements of a thumb, which further influences the physical comfort during the interactions. Touch precision is a human factor that determines how precisely users can manipulate touch widgets set on fingers, which determines effective layouts of the widgets. Buttons and touchpads were considered in our studies to enable discrete and continuous input in an eyes-free manner. The first study explores the regions of fingers where the interactions can be comfortably performed. According to the comfort regions, the second and third studies explore effective layouts for button and touchpad widgets. The experimental results indicate that participants could discriminate at least 16 buttons on their fingers. For touchpad, participants were asked to perform unistrokes. Our results revealed that since individual participant performed a coherent writing behavior, personalized $1 recognizers could offer 92% accuracy on a cross-finger touchpad. A series of design guidelines are proposed for designers, and a DigitSpace prototype that uses magnetic-tracking methods is demonstrated.","title":"DigitSpace: Designing Thumb-to-Fingers Touch Interfaces for One-Handed and Eyes-Free Interactions","filename":"CHI16/p1526","authors":["Da-Yuan Huang","Liwei Chan","Shuo Yang","Fan Wang","Rong-Hao Liang","De-Nian Yang","Yi-Ping Hung","Bing-Yu Chen"],"conference":"CHI '16"}