{"paperId":2858524,"citation":[],"reference":[{"content":"Mark Altosaar, Roel Vertegaal, Changuk Sohn, and Daniel Cheng. 2006. AuraOrb. Proceedings of the 20th conference of the computer-human interaction special interest group (CHISIG) of Australia on Computer-human interaction: design: activities, artefacts and environments (OZCHI '06), 159-166. http://doi.org/10.1145/1228175.1228204","paperID":"None"},{"content":"Alec Azad, Jaime Ruiz, Daniel Vogel, Mark Hancock, and Edward Lank. 2012. Territoriality and behaviour on and around large vertical publiclyshared displays. Proceedings of the Designing Interactive Systems Conference ( DIS '12), 468-477. http://doi.org/10.1145/2317956.2318025","paperID":"None"},{"content":"Robert Ball and Chris North. 2008. The effects of peripheral vision and physical navigation on large scale visualization. Proceedings of Graphics Interface 2008: 9-16. Retrieved August 22, 2014 from http://portal.acm.org/citation.cfm?id=1375714.1375","paperID":"None"},{"content":"Lyn Bartram, Colin Ware, and Tom Calvert. 2001. Moving Icons : Detection And Distraction. 157-166. Retrieved September 22, 2015 from http://www.ccom.unh.edu/vislab/PDFs/Interact2001 .pdf","paperID":"None"},{"content":"Patrick Baudisch, Nathaniel Good, and Paul Stewart. 2001. Focus plus context screens. Proceedings of the 14th annual ACM symposium on User interface software and technology (UIST '01), 31-40. http://doi.org/10.1145/502348.502354","paperID":"None"},{"content":"Patrick Baudisch and Ruth Rosenholtz. 2003. Halo. Proceedings of the SIGCHI Conference on Human factors in Computing Systems (CHI '03), 481-488. http://doi.org/10.1145/642611.642695","paperID":"None"},{"content":"Simon H.A. Begemann. 2005. A scientific study on the effects of Ambilight in flat-panel displays. 2005. Retrieved September 25, 2015 from http://www.embedded.com/design/real-time-andperformance/4012996/A-scientific-study-on-theeffects-of-Ambilight-in-flat-panel-displays","paperID":"None"},{"content":"A Bezerianos and P Isenberg. 2012. Perception of Visual Variables on Tiled Wall-Sized Displays for Information Visualization Applications. IEEE transactions on visualization and computer graphics (GI '08) 18, 12: 2516-25. http://doi.org/10.1109/TVCG.2012.251","paperID":"None"},{"content":"Jeremy Birnholtz, Lindsay Reynolds, Eli Luxenberg, Carl Gutwin, and Maryam Mustafa. 2010. Awareness Beyond the Desktop : Exploring Attention and Distraction with a Projected Peripheral-Vision Display. Proceedings of Graphics Interface 2010 (GI '10), 55-62. http://doi.org/10.1306/74D71041--2B21--11D78648000102C1865D","paperID":"None"},{"content":"John D. Bullough, Yukio Akashi, Charles R. Fay, and Mariana G. Figueiro. 2006. Impact of surrounding illumination on visual fatigue and eyestrain while viewing television. Journal of Applied Sciences 6, 8: 1664-1670. http://doi.org/10.3923/jas.2006.1664.1670","paperID":"None"},{"content":"Phillip Burgess. LED Tricks: Gamma Correction. Retrieved September 23, 2015 from https://learn.adafruit.com/led-tricks-gammacorrection/the-issue","paperID":"None"},{"content":"Niklas Elmqvist, Nathalie Henry, Yann Ri he, and Jean-Daniel Fekete. 2008. Mélange: Space Folding for Multi-Focus Interaction. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 1333-1342. http://doi.org/10.1145/1357054.1357263","paperID":"None"},{"content":"Mark D. Fairchild. 2013. Color Appearance Models. Wiley, Chinester.","paperID":"None"},{"content":"Sean Gustafson, Patrick Baudisch, Carl Gutwin, and Pourang Irani. 2008. Wedge: Clutter-Free Visualization of Off-Screen Locations. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 787-796. http://doi.org/10.1145/1357054.1357179","paperID":"None"},{"content":"Michael Haller, Jakob Leitner, Thomas Seifried, et al. 2010. The NICE discussion room. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 609-618. http://doi.org/10.1145/1753326.1753418","paperID":"None"},{"content":"Chris Harrison, John Horstman, Gary Hsieh, and Scott Hudson. 2012. Unlocking the expressivity of point lights. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1683-1692. http://doi.org/10.1145/2207676.2208296","paperID":"None"},{"content":"Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. http://doi.org/10.1016/S0166--4115(08)62386--9","paperID":"None"},{"content":"Doris Hausen, Sebastian Boring, Clara Lueling, Simone Rodestock, and Andreas Butz. 2012. StaTube: facilitating state management in instant messaging systems. Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), 283-290. http://doi.org/10.1145/2148131.2148191","paperID":"None"},{"content":"Doris Hausen, Christine Wagner, Sebastian Boring, and Andreas Butz. 2013. Comparing modalities and feedback for peripheral interaction. CHI '13 Extended Abstracts on Human Factors in Computing Systems on (CHI EA '13), 1263-1268. http://doi.org/10.1145/2468356.2468582","paperID":"None"},{"content":"Valentin Heun, Anette von Kapri, and Pattie Maes. 2012. Perifoveal display. Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12), 1150-155. http://doi.org/10.1145/2370216.2370460","paperID":"None"},{"content":"Alexandra Ion, Y.-L. Betty Chang, Michael Haller, Mark Hancock, and Stacey D. Scott. 2013. Canyon: Providing Location Awareness of Multiple Moving Objects in a Detail View on Large Displays. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 3149- 3158. http://doi.org/10.1145/2470654.2466431","paperID":"None"},{"content":"Hiroshi Ishii, Craig Wisneski, Scott Brave, et al. 1998. ambient ROOM: Integrating Ambient Media with Architectural Space. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '98), 173-174. http://doi.org/10.1145/286498.286652","paperID":"None"},{"content":"Brett R. Jones, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2013. IllumiRoom: peripheral projected illusions for interactive experiences. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 869-878. http://doi.org/10.1145/2470654.2466112","paperID":"None"},{"content":"Wendy Ju, Brian a. Lee, and Scott R. Klemmer. 2008. Range: Exploring Implicit Interaction through Electronic Whiteboard Design. Proceedings of the ACM 2008 Conference on Computer Supported Cooperative Work (CSCW '08), 17-26. http://doi.org/10.1145/1460563.1460569","paperID":"None"},{"content":"Min H. Kim, Tim Weyrich, and Jan Kautz. 2009. Modeling human color perception under extended luminance levels. ACM Transactions on Graphics 28, 3: 1. http://doi.org/10.1145/1531326.1531333","paperID":"None"},{"content":"Brian Y. Lim, Aubrey Shick, Chris Harrison, and Scott E. Hudson. 2011. Pediluma: motivating physical activity through contextual information and social influence. Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction (TEI '11), 173-180. http://doi.org/10.1145/1935701.1935736","paperID":"None"},{"content":"Andreas Löcken, Heiko Müller, Wilko Heuten, and Susanne Cj Boll. 2014. Exploring the design space of ambient light displays. Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems (CHI EA '14), 387-390. http://doi.org/10.1145/2559206.2574793","paperID":"None"},{"content":"Blair MacIntyre, Elizabeth D. Mynatt, Stephen Voida, Klaus M. Hansen, Joe Tullio, and Gregory M. Corso. 2001. Support for multitasking and background awareness using interactive peripheral displays. Proceedings of the 14th annual ACM symposium on User interface software and technology (UIST '01), 41-50. http://doi.org/10.1145/502348.502355","paperID":"None"},{"content":"Jock Mackinlay. 1986. Automating the design of graphical presentations of relational information. ACM Transactions on Graphics 5, 2: 110-141. http://doi.org/10.1145/22949.22950","paperID":"None"},{"content":"Tara Matthews, Anind K Dey, Jennifer Mankoff, Scott Carter, and Tye Rattenbury. 2004. A toolkit for managing user attention in peripheral displays. Proceedings of the 17th annual ACM symposium on User interface software and technology (UIST '04), 247-256. http://doi.org/10.1145/1029632.1029676","paperID":"None"},{"content":"Heiko Müller, Jutta Fortmann, Martin Pielot, et al. 2012. Ambix: Designing Ambient Light Information Displays. Designing Interactive Lighting Workshop at DIS 2012. Retrieved June 20, 2014 from http://www.researchgate.net/publication/257186115_AmbiX_Designing_Ambient_Light_Information_Displays/file/60b7d526240c2a9e2b.pdf","paperID":"None"},{"content":"Heiko Müller, Anastasia Kazakova, Martin Pielot, Wilko Heuten, and Susanne Boll. 2013. Ambient Timer - Unobtrusively Reminding Users of Upcoming Tasks with Ambient Light. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). 211-228. http://doi.org/10.1007/978--3--642--40483--2_15","paperID":"None"},{"content":"Heiko Müller, Andreas Löcken, Wilko Heuten, and Susanne Boll. 2014. Sparkle : An Ambient Light Display for Dynamic Off-Screen Points of Interest. Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordCHI '14), 51-60.","paperID":"None"},{"content":"Valentina Occhialini, Harm van Essen, and Berry Eggen. 2011. Design and Evaluation of an Ambient Display to Support Time Management during Meetings. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). 263-280. http://doi.org/10.1007/978--3--642--237713_20","paperID":"None"},{"content":"Z. Pousman and J. Stasko. 2006. A taxonomy of ambient information systems: four patterns of design. Proceedings of the working conference on Advanced visual interfaces (AVI '06), 67-74. http://doi.org/10.1145/1133265.1133277","paperID":"None"},{"content":"Thorsten Prante, Carsten Röcker, Norbert Streitz, et al. 2003. Hello . Wall - Beyond Ambient Displays AMBIENTE - Workspaces of the Future. 5th International Conference on Ubiquitous Computing (UBICOMP '03), 277 - 278.","paperID":"None"},{"content":"Hanan Samet. 2014. Using minimaps to enable toponym resolution with an effective 100% rate of recall. Proceedings of the 8th Workshop on Geographic Information Retrieval - GIR '14, ACM Press, 1-8. http://doi.org/10.1145/2675354.2675698","paperID":"None"},{"content":"Izadi Shahram, Harry Brignull, Tom Rodden, Yvonne Rogers, and Mia Underwood. 2003. Dynamo: A public interactive surface supporting the cooperative sharing and exchange of media. Proceedings of the 16th annual ACM symposium on User interface software and technology (UIST '03), 159-168. http://doi.org/10.1145/964696.964714","paperID":"None"},{"content":"Izadi Sharam, Geraldine Fitzpatrick, Tom Rodden, Harry Brignull, Yvonne Rogers, and Siân Lindley. 2005. The iterative design and study of a large display for shared and sociable spaces. Proceedings of the 2005 conference on Designing for User eXperience (DUX '05): 59. Retrieved September 8, 2014 from http://discovery.ucl.ac.uk/1324312/","paperID":"None"},{"content":"Xiaobin Shen. 2007. An Evaluation Methodology for Ambient Displays. Journal of Engineering, Computing and Architecture 1, 2. Retrieved from http://www.scientificjournals.org/journals2007/articles/1129.pdf","paperID":"None"},{"content":"Daniel Vogel and Ravin Balakrishnan. 2004. Interactive public ambient displays. Proceedings of the 2004 ACM Symposium on User Interface Software and Technology (UIST '04), 137-146. http://doi.org/10.1145/1029632.1029656","paperID":"None"},{"content":"Colin Ware. 2004. Information Visualization. Morgan Kaufmann, San Francisco.","paperID":"None"},{"content":"Harald Wasser. 2007. Im Auge des Betrachters. Stäubli-Verlag, Zürich.","paperID":"None"},{"content":"Daniel Wigdor, Hao Jiang, Clifton Forlines, Michelle Borkin, and Chia Shen. 2009. WeSpace: The Design, Development, and Deployment of a Walk-Up and Share Multi-Surface Collaboration System. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 09), 1237-1246. http://doi.org/10.1145/1518701.1518886","paperID":"None"},{"content":"Günther Wyszecki and W. S. Stiles. 1982. Color Science: Concepts and Methods. Wiley, New York.","paperID":"None"},{"content":"Jakob Zillner, Christoph Rhemann, Shahram Izadi, and Michael Haller. 2014. 3D-board. Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14), 471-479. http://doi.org/10.1145/2642918.2647393","paperID":"None"}],"abstract":"Ambient light is starting to be commercially used to enhance the viewing experience for watching TV. We believe that ambient light can add value in meeting and control rooms that use large vertical interactive surfaces. Therefore, we equipped a large interactive whiteboard with a peripheral ambient light display and explored its utility for different scenarios by conducting two controlled experiments. In the first experiment, we investigated how ambient light can be used for peripheral notifications, and how perception is influenced by the user's position and the type of work they are engaged in. The second experiment investigated the utility of ambient light for off-screen visualization. We condense our findings into several design recommendations that we then applied to application scenarios to show the versatility and usefulness of ambient light for large surfaces.","title":"Glowworms and Fireflies: Ambient Light on Large Interactive Surfaces","filename":"CHI16/p5849","authors":["Florian Perteneder","Eva-Maria Beatrix Grossauer","Joanne Leong","Wolfgang Stuerzlinger","Michael Haller"],"conference":"CHI '16"}