{"paperId":2858544,"citation":[],"reference":[{"content":"B. Ahmad and R. Pratap. 2010. Elasto-Electrostatic Analysis of Circular Microplates Used in Capacitive Micromachined Ultrasonic Transducers. Sensors Journal, IEEE 10, 11 (Nov 2010), 1767--1773. ISSN1530--437X http://dx.doi.org/10.1109/JSEN.2010.2049017","paperID":"None"},{"content":"Jason Alexander, Andrés Lucero, and Sriram Subramanian. 2012. Tilt Displays: Designing Display Surfaces with Multi-axis Tilting and Actuation. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 161--170. ISBNx978--1--4503--1105--2 http://dx.doi.org/10.1145/2371574.2371600","paperID":"None"},{"content":"Olivier Bau, Uros Petrevski, and Wendy Mackay. 2009. BubbleWrap: A Textile-based Electromagnetic Haptic Display. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, New York, NY, USA, 3607--3612. ISBNx978--1--60558--247--4 http://dx.doi.org/10.1145/1520340.1520542","paperID":"None"},{"content":"Olivier Bau, Ivan Poupyrev, Ali Israr, and Chris Harrison. 2010. TeslaTouch: Electrovibration for Touch Surfaces. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 283--292. ISBNx978--1--4503-0271--5 http://dx.doi.org/10.1145/1866029.1866074","paperID":"None"},{"content":"BMW. 2008. Kinetc Sculpture - The shapes of things to come. (2008). https://artcom.de/en/project/kinetic-sculpture/","paperID":"None"},{"content":"Tom Carter, Sue Ann Seah, Benjamin Long, Bruce Drinkwater, and Sriram Subramanian. 2013. UltraHaptics: Multi-point Mid-air Haptic Feedback for Touch Surfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 505--514. ISBNx978--1--4503--2268--3 http://dx.doi.org/10.1145/2501988.2502018","paperID":"None"},{"content":"Marcelo Coelho, Hiroshi Ishii, and Pattie Maes. 2008. Surflex: A Programmable Surface for the Design of Tangible Interfaces. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, New York, NY, USA, 3429--3434. ISBNx978--1--60558-012--8 http://dx.doi.org/10.1145/1358628.1358869","paperID":"None"},{"content":"Marcelo Coelho and Jamie Zigelbaum. 2011. Shape-changing Interfaces. Personal Ubiquitous Comput. 15, 2 (Feb. 2011), 161--173. ISSN1617--4909 http://dx.doi.org/10.1007/s00779-010-0311-y","paperID":"None"},{"content":"Paul Dietz and Darren Leigh. 2001. DiamondTouch: A Multi-user Touch Technology. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, New York, NY, USA, 219--226. ISBNx1--58113--438-X http://dx.doi.org/10.1145/502348.502389","paperID":"None"},{"content":"Nicola J. Ferrier and Roger W. Brockett. 2000. Reconstructing the Shape of a Deformable Membrane from Image Data. The International Journal of Robotics Research 19, 9 (2000), 795--816. http://dx.doi.org/10.1177/02783640022067184","paperID":"None"},{"content":"Fibersource. 1959. Spandex Fiber - Spandex Textile Filament Fiber. (1959). http://www.fibersource.com/f-tutor/spandex.htm","paperID":"None"},{"content":"Sean Follmer, Micah Johnson, Edward Adelson, and Hiroshi Ishii. 2011. Form: An Interactive Malleable Surface for Capturing 2.5D Arbitrary Objects, Tools and Touch. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 527--536. ISBNx978--1--4503-0716--1 http://dx.doi.org/10.1145/2047196.2047265","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Nadia Cheng, and Hiroshi Ishii. 2012. Jamming User Interfaces: Programmable Particle Stiffness and Sensing for Malleable and Shape-changing Devices. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 519--528. ISBNx978--1--4503--1580--7 http://dx.doi.org/10.1145/2380116.2380181","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic Physical Affordances and Constraints Through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 417--426. ISBNx978--1--4503--2268--3 http://dx.doi.org/10.1145/2501988.2502032","paperID":"None"},{"content":"Antonio Gomes, Andrea Nesbitt, and Roel Vertegaal. 2013. MorePhone: A Study of Actuated Shape Deformations for Flexible Thin-film Smartphone Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 583--592. ISBNx978--1--4503--1899-0 http://dx.doi.org/10.1145/2470654.2470737","paperID":"None"},{"content":"K. S. Hale and K. M. Stanney. 2004. Deriving haptic design guidelines from human physiological, psychophysical, and neurological foundations. IEEE Computer Graphics and Applications 24, 2 (March 2004), 33--39. ISSN0272--1716 http://dx.doi.org/10.1109/MCG.2004.1274059","paperID":"None"},{"content":"Jaehyun Han, Jiseong Gu, and Geehyuk Lee. 2014a. Trampoline: A Double-sided Elastic Touch Device for Creating Reliefs. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 383--388. ISBNx978--1--4503--3069--5 http://dx.doi.org/10.1145/2642918.2647381","paperID":"None"},{"content":"Jaehyun Han, Seongkook Heo, Jiseong Gu, and Geehyuk Lee. 2014b. Trampoline: A Double-sided Elastic Touch Device for Repoussé and Chasing Techniques. In Proceedings of the Extended Abstracts of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 1627--1632. ISBNx978--1--4503--2474--8 http://dx.doi.org/10.1145/2559206.2581252","paperID":"None"},{"content":"John Hardy, Christian Weichel, Faisal Taher, John Vidler, and Jason Alexander. 2015. ShapeClip: Towards Rapid Prototyping with Shape-Changing Displays for Designers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 19--28. ISBNx978--1--4503--3145--6 http://dx.doi.org/10.1145/2702123.2702599","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2009. Providing dynamically changeable physical buttons on a visual display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 299--308. ISBNx978--1--60558--246--7 http://dx.doi.org/10.1145/1518701.1518749","paperID":"None"},{"content":"K. Hirota and M. Hirose. 1995. Simulation and Presentation of Curved Surface in Virtual Reality Environment Through Surface Display. In Proceedings of the Virtual Reality Annual International Symposium (VRAIS'95) (VRAIS '95). IEEE Computer Society, Washington, DC, USA, 211--. ISBNx0--8186--7084--3 http://dx.doi.org/10.1109/VRAIS.1995.512498","paperID":"None"},{"content":"K. Inoue and Y. Okamoto. 2009. Vision-based detection of finger touch for haptic device using transparent flexible sheet. In Robotics and Automation, 2009. ICRA '09. IEEE International Conference on. 665--670. ISSN1050--4729 http://dx.doi.org/10.1109/ROBOT.2009.5152427","paperID":"None"},{"content":"Hiroshi Ishii, Daniel Leithinger, Sean Follmer, Amit Zoran, Philipp Schoessler, and Jared Counts. 2015. TRANSFORM: Embodiment of \"Radical Atoms\" at Milano Design Week. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 687--694. ISBNx978--1--4503--3146--3 http://dx.doi.org/10.1145/2702613.2702969","paperID":"None"},{"content":"Shingo Itoh and Toshihiro Tanaka. 2015. Elastic polyurethane fiber and method for manufacturing same. World Patent WO2013089137A1, European Patent EP2829642 A1. (28 January 2015). https://register.epo.org/application?number=EP12858566","paperID":"None"},{"content":"Hiroo Iwata, Hiroaki Yano, Fumitaka Nakaizumi, and Ryo Kawamura. 2001. Project FEELEX: Adding Haptic Surface to Graphics. In Proceedings of the 28th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '01). ACM, New York, NY, USA, 469--476. ISBNx1--58113--374-X http://dx.doi.org/10.1145/383259.383314","paperID":"None"},{"content":"Yvonne Jansen, Thorsten Karrer, and Jan Borchers. 2011. MudPad: Tactile Feedback for Touch Surfaces. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 323--328. ISBNx978--1--4503-0268--5 http://dx.doi.org/10.1145/1979742.1979702","paperID":"None"},{"content":"Sumit Jindal and Sanjeev Raghuwanshi. 2015. Modelling of simply supported circular diaphragm for touch mode capacitive sensors. Journal of Theoretical and Applied Mechanics 53, 2 (2015). http://www.ptmts.org.pl/jtam/index.php/jtam/article/view/2544","paperID":"None"},{"content":"Roland S. Johansson and Randall J. Flanagan. 2009. Coding and use of tactile signals from the fingertips in object manipulation tasks. Nat Rev Neurosci 10, 5 (08 April 2009), 345--359. ISSN1471-0048 http://dx.doi.org/10.1038/nrn2621","paperID":"None"},{"content":"K.A. Kaczmarek, K. Nammi, A.K. Agarwal, M.E. Tyler, S.J. Haase, and D.J. Beebe. 2006. Polarity Effect in Electrovibration for Tactile Display. Biomedical Engineering, IEEE Transactions on 53, 10 (Oct 2006), 2047--2054. ISSN0018--9294 http://dx.doi.org/10.1109/TBME.2006.881804","paperID":"None"},{"content":"Hyunjung Kim and Woohun Lee. 2008. Shade Pixel. In ACM SIGGRAPH 2008 Posters (SIGGRAPH '08). ACM, New York, NY, USA, Article 34, 1 pages. ISBNx978--1--60558--466--9 http://dx.doi.org/10.1145/1400885.1400922","paperID":"None"},{"content":"Seoktae Kim, Hyunjung Kim, Boram Lee, Tek-Jin Nam, and Woohun Lee. 2008. Inflatable Mouse: Volume-adjustable Mouse with Air-pressure-sensitive Input and Haptic Feedback. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 211--224. ISBNx978--1--60558-011--1 http://dx.doi.org/10.1145/1357054.1357090","paperID":"None"},{"content":"Phil Kingsley. 2012. eTable: A haptic elastic table for 3D multi-touch interations. (2012). https://www.youtube.com/watch?v=v2A4bLSiX6A","paperID":"None"},{"content":"Takuro Kuribara, Buntarou Shizuki, and Jiro Tanaka. 2013. Sinkpad: A Malleable Mouse Pad Consisted of an Elastic Material. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 1251--1256. ISBNx978--1--4503--1952--2 http://dx.doi.org/10.1145/2468356.2468580","paperID":"None"},{"content":"Ki-Uk Kyung, Jeong Mook Lim, Yo-An Lim, Suntak Park, Seung Koo Park, Inwook Hwang, Seungmoon Choi, Jongman Seo, Sang-Youn Kim, Tae-Heon Yang, and Dong-Soo Kwon. 2011. TAXEL: Initial progress toward self-morphing visio-haptic interface. In World Haptics Conference (WHC), 2011 IEEE. 37--42. http://dx.doi.org/10.1109/WHC.2011.5945458","paperID":"None"},{"content":"E. Marianne Kärrholm and Bengt Schröder. 1953. Bending Modulus of Fibers Measured with the Resonance Frequency Method. Textile Research Journal 23, 4 (1953), 207--224. http://dx.doi.org/10.1177/004051755302300401","paperID":"None"},{"content":"Daniel Leithinger, Sean Follmer, Alex Olwal, Samuel Luescher, Akimitsu Hogge, Jinha Lee, and Hiroshi Ishii. 2013. Sublimate: State-changing Virtual and Physical Rendering to Augment Interaction with Shape Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1441--1450. ISBNx978--1--4503--1899-0 http://dx.doi.org/10.1145/2470654.2466191","paperID":"None"},{"content":"Daniel Leithinger and Hiroshi Ishii. 2010. Relief: A Scalable Actuated Shape Display. In Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '10). ACM, New York, NY, USA, 221--222. ISBNx978--1--60558--841--4 http://dx.doi.org/10.1145/1709886.1709928","paperID":"None"},{"content":"Daniel Leithinger, David Lakatos, Anthony DeVincenzi, Matthew Blackshaw, and Hiroshi Ishii. 2011. Direct and Gestural Interaction with Relief: A 2.5D Shape Display. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 541--548. ISBNx978--1--4503-0716--1 http://dx.doi.org/10.1145/2047196.2047268","paperID":"None"},{"content":"Edward Mallinckrodt, A. L. Hughes, and William Sleator. 1953. Perception by the Skin of Electrically Induced Vibrations. Science 118, 3062 (1953), 277--278. http://dx.doi.org/10.1126/science.118.3062.277","paperID":"None"},{"content":"Adiyan Mujibiya. 2015. Corona: Interactivity of Body Electrostatics in Mobile Scenarios Using Wearable High-Voltage Static Charger. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 435--444. ISBNx978--1--4503--3652--9 http://dx.doi.org/10.1145/2785830.2785888","paperID":"None"},{"content":"Mathias Müller, Anja Knöfel, Thomas Gründer, Ingmar Franke, and Rainer Groh. 2014. FlexiWall: Exploring Layered Data with Elastic Displays. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, New York, NY, USA, 439--442. ISBNx978--1--4503--2587--5 http://dx.doi.org/10.1145/2669485.2669529","paperID":"None"},{"content":"Yusuke Nakagawa, Akiya Kamimura, and Yoichiro Kawaguchi. 2012. MimicTile: A Variable Stiffness Deformable User Interface for Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 745--748. ISBNx978--1--4503--1015--4 http://dx.doi.org/10.1145/2207676.2207782","paperID":"None"},{"content":"M. Nakatani, H. Kajimoto, K. Vlack, D. Sekiguchi, N. Kawakami, and S. Tachi. 2005. Control Method for a 3D Form Display with Coil-type Shape Memory Alloy. In Robotics and Automation, 2005. ICRA 2005. Proceedings of the 2005 IEEE International Conference on. 1332--1337. http://dx.doi.org/10.1109/ROBOT.2005.1570300","paperID":"None"},{"content":"Ryuma Niiyama, Xu Sun, Lining Yao, Hiroshi Ishii, Daniela Rus, and Sangbae Kim. 2015. Sticky Actuator: Free-Form Planar Actuators for Animated Objects. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 77--84. ISBNx978--1--4503--3305--4 http://dx.doi.org/10.1145/2677199.2680600","paperID":"None"},{"content":"NIST. 2008. EEEL Safety Rules for Moderate and High Voltages. (2008). www.nist.gov/el/isd/mmc/upload/high_voltage_rules_revised.pdf","paperID":"None"},{"content":"Simon Olberding, Nan-Wei Gong, John Tiab, Joseph A. Paradiso, and Jürgen Steimle. 2013. A Cuttable Multi-touch Sensor. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 245--254. ISBNx978--1--4503--2268--3 http://dx.doi.org/10.1145/2501988.2502048","paperID":"None"},{"content":"Esben W. Pedersen, Sriram Subramanian, and Kasper Hornbæk. 2014.showarticletitleIs My Phone Alive?: A Large-scale Study of Shape Change in Handheld Devices Using Videos. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2579--2588. ISBNx978--1--4503--2473--1 http://dx.doi.org/10.1145/2556288.2557018","paperID":"None"},{"content":"Ivan Poupyrev, Tatsushi Nashida, Shigeaki Maruyama, Jun Rekimoto, and Yasufumi Yamaji. 2004.showarticletitleLumen: Interactive Visual and Shape Display for Calm Computing. In ACM SIGGRAPH 2004 Emerging Technologies (SIGGRAPH '04). ACM, New York, NY, USA, 17--. ISBNx1--58113--896--2 http://dx.doi.org/10.1145/1186155.1186173","paperID":"None"},{"content":"Ivan Poupyrev, Tatsushi Nashida, and Makoto Okabe. 2007. Actuation and Tangible User Interfaces: The Vaucanson Duck, Robots, and Shape Displays. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (TEI '07). ACM, New York, NY, USA, 205--212. ISBNx978--1--59593--619--6 http://dx.doi.org/10.1145/1226969.1227012","paperID":"None"},{"content":"Jie Qi and Leah Buechley. 2012. Animating Paper Using Shape Memory Alloys. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 749--752. ISBNx978--1--4503--1015--4 http://dx.doi.org/10.1145/2207676.2207783","paperID":"None"},{"content":"%Hayes Solos Raffle, Amanda J. Parkes, and Hiroshi Ishii. 2004. Topobo: A Constructive Assembly System with Kinetic Memory. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 647--654. ISBNx1--58113--702--8 http://dx.doi.org/10.1145/985692.985774","paperID":"None"},{"content":"M. Rahman and S. Chowdhury. 2009. A highly accurate closed-form model for pull-in voltage of circular diaphragms under large deflection. Micro and Nanosystems 1, 2 (2009), 139--146. ISSN1876--4029/1876--4037 http://dx.doi.org/10.2174/1876402910901020139","paperID":"None"},{"content":"Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shape-changing Interfaces: A Review of the Design Space and Open Research Questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 735--744. ISBNx978--1--4503--1015--4 http://dx.doi.org/10.1145/2207676.2207781","paperID":"None"},{"content":"Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: Toward High \"Shape Resolution\" in Self-actuated Flexible Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 593--602. ISBNx978--1--4503--1899-0 http://dx.doi.org/10.1145/2470654.2470738","paperID":"None"},{"content":"Taiki Shimba and Joo-Ho Lee. 2014. Shadow-free Interaction: A Proposal for Rear Projection Based Shape Display. Procedia Technology 18 (2014), 140 -- 144. ISSN2212-0173 http://dx.doi.org/10.1016/j.protcy.2014.11.026 International workshop on Innovations in Information and Communication Science and Technology, IICST 2014, 3--5 September 2014, Warsaw, Poland.","paperID":"None"},{"content":"Jürgen Steimle, Andreas Jordt, and Pattie Maes. 2013. Flexpad: Highly Flexible Bending Interactions for Projected Handheld Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 237--246. ISBNx978--1--4503--1899-0 http://dx.doi.org/10.1145/2470654.2470688","paperID":"None"},{"content":"Andrew Stevenson, Christopher Perez, and Roel Vertegaal. 2011. An Inflatable Hemispherical Multi-touch Display. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, New York, NY, USA, 289--292. ISBNx978--1--4503-0478--8 http://dx.doi.org/10.1145/1935701.1935766","paperID":"None"},{"content":"Faisal Taher, John Hardy, Abhijit Karnik, Christian Weichel, Yvonne Jansen, Kasper Hornbæk, and Jason Alexander. 2015. Exploring Interactions with Physically Dynamic Bar Charts. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3237--3246. ISBNx978--1--4503--3145--6 http://dx.doi.org/10.1145/2702123.2702604","paperID":"None"},{"content":"Shohei Takei, Makoto Iida, and Takeshi Naemura. 2011. KineReels: Extension Actuators for Dynamic 3D Shape. In ACM SIGGRAPH 2011 Posters (SIGGRAPH '11). ACM, New York, NY, USA, Article 84, 1 pages. ISBNx978--1--4503-0971--4 http://dx.doi.org/10.1145/2037715.2037810","paperID":"None"},{"content":"Stephan P. Timoshenko. 1964. Theory of Plates and Shells (2 ed.). McGraw-Hill. ISBNx978-0070858206","paperID":"None"},{"content":"Giovanni Maria Troiano, Esben Warming Pedersen, and Kasper Hornbæk. 2014. User-defined Gestures for Elastic, Deformable Displays. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, New York, NY, USA, 1--8. ISBNx978--1--4503--2775--6 http://dx.doi.org/10.1145/2598153.2598184","paperID":"None"},{"content":"Jessica Tsimeris, Colin Dedman, Michael Broughton, and Tom Gedeon. 2013. ForceForm: A Dynamically Deformable Interactive Surface. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, New York, NY, USA, 175--178. ISBNx978--1--4503--2271--3 http://dx.doi.org/10.1145/2512349.2512807","paperID":"None"},{"content":"Kevin Vlack, Terukazu Mizota, Naoki Kawakami, Kazuto Kamiyama, Hiroyuki Kajimoto, and Susumu Tachi. 2005. GelForce: A Vision-based Traction Field Computer Interface. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, New York, NY, USA, 1154--1155. ISBNx1--59593-002--7 http://dx.doi.org/10.1145/1056808.1056859","paperID":"None"},{"content":"Akira Wakita, Akito Nakano, and Nobuhiro Kobayashi. 2011. Programmable Blobs: A Rheologic Interface for Organic Shape Design. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, New York, NY, USA, 273--276. ISBNx978--1--4503-0478--8 http://dx.doi.org/10.1145/1935701.1935760","paperID":"None"},{"content":"Y. Watanabe, A. Cassinelli, T. Komuro, and M. Ishikawa. 2008. The deformable workspace: A membrane between real and virtual space. In Horizontal Interactive Human Computer Systems, 2008. TABLETOP 2008. 3rd IEEE International Workshop on. 145--152. http://dx.doi.org/10.1109/TABLETOP.2008.4660197","paperID":"None"},{"content":"Daniel Wigdor, Darren Leigh, Clifton Forlines, Samuel Shipman, John Barnwell, Ravin Balakrishnan, and Chia Shen. 2006. Under the Table Interaction. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, New York, NY, USA, 259--268. ISBNx1--59593--313--1 http://dx.doi.org/10.1145/1166253.1166294","paperID":"None"},{"content":"Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically Actuated Soft Composite Materials for Shape Changing Interfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 13--22. ISBNx978--1--4503--2268--3 http://dx.doi.org/10.1145/2501988.2502037","paperID":"None"},{"content":"Kyungwon Yun, JunBong Song, Keehong Youn, Sungmin Cho, and Hyunwoo Bang. 2013. ElaScreen: Exploring Multi-dimensional Data Using Elastic Screen. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 1311--1316. ISBNx978--1--4503--1952--2 http://dx.doi.org/10.1145/2468356.2468590","paperID":"None"}],"abstract":"We present TableHop, a tabletop display that provides controlled self-actuated deformation and vibro-tactile feedback to an elastic fabric surface while retaining the ability for high-resolution visual projection. The surface is made of a highly stretchable pure spandex fabric that is electrostatically actuated using electrodes mounted on its top or underside. It uses transparent indium tin oxide electrodes and high-voltage modulation to create controlled surface deformations. Our setup actuates pixels and creates deformations in the fabric up to +/- 5 mm. Since the electrodes are transparent, the fabric surface functions as a diffuser for rear-projected visual images, and avoid occlusion by users or actuators. Users can touch and interact with the fabric to experience expressive interactions as with any fabric based shape-changing interface. By using frequency modulation in the high-voltage circuit, it can also create localized tactile sensations on the user's fingertip when touching the surface. We provide simulation and experimental results for the shape of the deformation and frequency of the vibration of the surface. These results can be used to build prototypes of different sizes and form-factors. We present a working prototype of TableHop that has 30x40 cm2 surface area and uses a grid of 3x3 transparent electrodes. It uses a maximum of 9.46 mW and can create tactile vibrations of up to 20 Hz. TableHop can be scaled to make large interactive surfaces and integrated with other objects and devices. TableHop will improve user interaction experience on 2.5D deformable displays.","title":"TableHop: An Actuated Fabric Display Using Transparent Electrodes","filename":"CHI16/p3767","authors":["Deepak Ranjan Sahoo","Kasper Hornbæk","Sriram Subramanian"],"conference":"CHI '16"}