{"paperId":2858064,"citation":[],"abstract":"Crowdsourcing experiments online allows for low-cost data gathering with large participant pools; however, collecting data online does not give researchers access to certain metrics. For example, physiological measures such as heart rate (HR) can provide high-resolution data about the physical, emotional, and mental state of the participant. We investigate and characterize the feasibility of gathering HR from videos of online participants engaged in single user and social tasks. We show that room lighting, head motion, and network bandwidth influence measurement quality, but that instructing participants in good practices substantially improves measurement quality. Our work takes a step towards online physiological data collection.","reference":[{"content":"Jans Aasman, Gijsbertus Mulder, and Lambertus JM Mulder. 1987. Operator effort and the measurement of heart-rate variability. Human Factors: The Journal of the Human Factors and Ergonomics Society 29, 2 (1987), 161-170.","paperID":"None"},{"content":"P-O Åstrand and Irma Ryhming. 1954. A nomogram for calculation of aerobic capacity (physical fitness) from pulse rate during submaximal work. Journal of applied physiology 7, 2 (1954), 218-221.","paperID":"None"},{"content":"John T Cacioppo, Louis G Tassinary, and Gary Berntson. 2007. Handbook of psychophysiology. Cambridge University Press.","paperID":"None"},{"content":"James A Coan and John JB Allen. 2007a. Handbook of emotion elicitation and assessment. Oxford University Press, USA, Chapter 14.","paperID":"None"},{"content":"James A Coan and John JB Allen. 2007b. Handbook of emotion elicitation and assessment. Oxford University Press, USA, Chapter 15.","paperID":"None"},{"content":"Lawrence T DeCarlo. 1997. On the meaning and use of kurtosis. Psychological methods 2, 3 (1997), 292.","paperID":"None"},{"content":"Anders Drachen, Lennart E Nacke, Georgios Yannakakis, and Anja Lee Pedersen. 2010. Correlation between heart rate, electrodermal activity and player experience in first-person shooter games. In Proceedings of the 5th ACM SIGGRAPH Symposium on Video Games. ACM, 49-54.","paperID":"None"},{"content":"Clayton Epp, Michael Lippold, and Regan L Mandryk. 2011. Identifying emotional states using keystroke dynamics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 715- 724.","paperID":"None"},{"content":"Kimmo Eriksson and Brent Simpson. 2010. Emotional reactions to losing explain gender differences in entering a risky lottery. Judgment and Decision Making 5, 3 (2010), 159-163.","paperID":"None"},{"content":"Joseph K Goodman, Cynthia E Cryder, and Amar Cheema. 2013. Data collection in a flat world: The strengths and weaknesses of Mechanical Turk samples. Journal of Behavioral Decision Making 26, 3 (2013), 213-224.","paperID":"None"},{"content":"Tristan A. Hearn. 2014. Software for Non-Contact Measurement of an Individual's Heart Rate Using a Common Camera. In NASA Tech Briefs, Vol. Vol. 38 No. 2.","paperID":"None"},{"content":"Tristan A. Hearn. 2016. webcam-pulse-detector. Github. (4 January 2016). Retrieved January 4, 2016 from https://github.com/thearn/webcam-pulsedetector.","paperID":"None"},{"content":"AB Hertzman and CR Spealman. 1937. Observations on the finger volume pulse recorded photoelectrically. Am. J. Physiol 119, 334 (1937), 3.","paperID":"None"},{"content":"Eckhard H Hess and James M Polt. 1964. Pupil size in relation to mental activity during simple problemsolving. Science 143, 3611 (1964), 1190-1192.","paperID":"None"},{"content":"Nis Hjortskov, Dag Rissén, Anne Katrine Blangsted, Nils Fallentin, Ulf Lundberg, and Karen Søgaard. 2004. The effect of mental stress on heart rate variability and blood pressure during computer work. European journal of applied physiology 92, 1--2 (2004), 84-89.","paperID":"None"},{"content":"Aniket Kittur, Ed H Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 453-456.","paperID":"None"},{"content":"Aniket Kittur, Boris Smus, Susheel Khamkar, and Robert E Kraut. 2011. Crowdforge: Crowdsourcing complex work. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 43-52.","paperID":"None"},{"content":"Brigitte M Kudielka, Nicole C Schommer, Dirk H Hellhammer, and Clemens Kirschbaum. 2004. Acute HPA axis responses, heart rate, and mood changes to psychosocial stress (TSST) in humans at different times of day. Psychoneuroendocrinology 29, 8 (2004), 983-992.","paperID":"None"},{"content":"Yuriy Kurylyak, Francesco Lamonaca, and Domenico Grimaldi. 2012. Smartphone based photoplethysmogram measurement. Digital Image and Signal Processing for Measurement Systems, FJ Duro and FL Pena, eds (2012), 135-164.","paperID":"None"},{"content":"K. Lange Andersen, V. Seliger, J. Butenfranz, and I. Berndt. 1974. Physical performance capacity of children in Norway. European Journal of Applied Physiology and Occupational Physiology 33, 3 (1974), 197-206. DOI: http://dx.doi.org/10.1007/BF00421147","paperID":"None"},{"content":"Regan L. Mandryk. 2008. Game usability: advice from the experts for advancing the player experience. Elsevier/Morgan Kaufmann, Amsterdam a.o., Chapter 14, 207-235.","paperID":"None"},{"content":"Regan L Mandryk and M Stella Atkins. 2007. A fuzzy physiological approach for continuously modeling emotion during interaction with play technologies. International journal of human-computer studies 65, 4 (2007), 329-347.","paperID":"None"},{"content":"Regan L Mandryk, Kori M Inkpen, and Thomas W Calvert. 2006. Using psychophysiological techniques to measure user experience with entertainment technologies. Behaviour & information technology 25, 2 (2006), 141-158.","paperID":"None"},{"content":"Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior research methods 44, 1 (2012), 1-23.","paperID":"None"},{"content":"Tanushree Mitra, CJ Hutto, and Eric Gilbert. 2015. Comparing Person-and Process-centric Strategies for Obtaining Quality Data on Amazon Mechanical Turk. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1345-1354.","paperID":"None"},{"content":"Bilge Mutlu, Andreas Krause, Jodi Forlizzi, Carlos Guestrin, and Jessica Hodgins. 2007. Robust, low-cost, non-intrusive sensing and recognition of seated postures. In Proceedings of the 20th annual ACM symposium on User interface software and technology. ACM, 149-158.","paperID":"None"},{"content":"Lennart E Nacke. 2015. Games User Research and Physiological Game Evaluation. In Game User Experience Evaluation. Springer, 63-86.","paperID":"None"},{"content":"Michael J Owren and Jo-Anne Bachorowski. 2007. Measuring emotion-related vocal acoustics. Handbook of emotion elicitation and assessment (2007), 239-266.","paperID":"None"},{"content":"Gabriele Paolacci, Jesse Chandler, and Panagiotis G Ipeirotis. 2010. Running experiments on amazon mechanical turk. Judgment and Decision making 5, 5 (2010), 411-419.","paperID":"None"},{"content":"Ming-Zher Poh, Daniel J McDuff, and Rosalind W Picard. 2010. Non-contact, automated cardiac pulse measurements using video imaging and blind source separation. Optics express 18, 10 (2010), 10762-10774.","paperID":"None"},{"content":"T Pursche, J Krajewski, and Reinhard Moeller. 2012. Video-based heart rate measurement from human faces. In Consumer Electronics (ICCE), 2012 IEEE International Conference on. IEEE, 544-545.","paperID":"None"},{"content":"John E Richards and Betty Jo Casey. 1991. Heart rate variability during attention phases in young infants. Psychophysiology 28, 1 (1991), 43-53.","paperID":"None"},{"content":"Neville Anthony Stanton, Alan Hedge, Karel Brookhuis, Eduardo Salas, and Hal W Hendrick. 2004. Estimating Mental Effort Using Heart Rate and Heart Rate Variability. In Handbook of human factors and ergonomics methods. CRCPress, 20-1-20-8.","paperID":"None"},{"content":"Yu Sun, Sijung Hu, Vicente Azorin-Peris, Stephen Greenwald, Jonathon Chambers, and Yisheng Zhu. 2011. Motion-compensated noncontact imaging photo plethysmography to monitor cardio respiratory status during exercise. Journal of biomedical optics 16, 7 (2011), 077010-077010.","paperID":"None"},{"content":"Wim Verkruysse, Lars O Svaasand, and J Stuart Nelson. 2008. Remote plethysmographic imaging using ambient light. Optics express 16, 26 (2008), 21434- 21445.","paperID":"None"},{"content":"Paul Viola and Michael Jones. 2001. Rapid object detection using a boosted cascade of simple features. In Computer Vision and Pattern Recognition, 2001. CVPR 2001. Proceedings of the 2001 IEEE Computer Society Conference on, Vol. 1. IEEE, I-511.","paperID":"None"},{"content":"Wenjin Wang, Sander Stuijk, and Gerard de Haan. 2015. Exploiting Spatial Redundancy of Image Sensor for Motion Robust rPPG. Biomedical Engineering, IEEE Transactions on 62, 2 (2015), 415-425.","paperID":"None"},{"content":"Sebastian Zaunseder, Andreas Heinke, Alexander Trumpp, and Hagen Malberg. 2014. Heart beat detection and analysis from videos. In Electronics and Nanotechnology (ELNANO), 2014 IEEE 34th International Conference on. IEEE, 286-290.","paperID":"None"}],"title":"Extracting Heart Rate from Videos of Online Participants","filename":"CHI16/p4562","authors":["Thomas Muender","Matthew K. Miller","Max V. Birk","Regan L. Mandryk"],"conference":"CHI '16"}