{"paperId":2858545,"abstract":"Disasters and their impacts have unavoidable spatial characteristics. As such, maps are necessary and omnipresent features of the information landscapes that surround and support disaster response. Professional and volunteer GIS services are increasingly in demand to support map-based information visualization during crises. This paper investigates the work of mapmakers working on the response to the 2015 Nepal earthquakes. In comparison to prior events, we found significantly more collaboration and spatial data sharing took place between map producers working across humanitarian organizations and parts of the Nepal government. Collaboration between mapping practitioners was supported by a complex and emergent information infrastructure composed of social and technical elements, some of which were brought through experience with prior disaster events, and some which were shaped anew by the availability and acceptance of open data sources. Our research investigates these elements of the spatial information infrastructure in post-earthquake Nepal to consider infrastructural emergence.","citation":[],"reference":[{"content":"Richard Bentley, John A. Hughes, David Randall, Tom Rodden, Peter Sawyer, Dan Shapiro, and Ian Sommerville. \"Ethnographically-informed systems design for air traffic control.\" In Proceedings of the 1992 ACM conference on Computer-supported cooperative work, pp. 123--129. ACM, 1992.","paperID":"None"},{"content":"Geoffrey C. Bowker, Karen Baker, Florence Millerand, David Ribes. 2010. Toward information infrastructure studies: Ways of knowing in a networked environment. In International Handbook of Internet Research, pp. 97--117. Springer.","paperID":"None"},{"content":"Shideh Dashti, Leysia Palen, Mehdi Haris, Ken Anderson, Scott Anderson, Jennings Anderson. 2014. Supporting Disaster Reconnaissance with Social Media Data: A Design-Oriented Case Study of the 2013 CO Floods. In Proceedings of the Conference on Information Systems for Crisis Response and Management (ISCRAM '14).","paperID":"None"},{"content":"Martin Dittus, Giovanni Quattrone, Licia Capra. 2016. Analysing Volunteer Engagement in Humanitarian Mapping: Building Contributor Communities at Large Scale. In Proceedings of Conference on ComputerSupported Cooperative Work and Social Computing (CSCW '16)","paperID":"None"},{"content":"Russell Rowe Dynes. 1970. Organized Behavior in Disaster. Heath.","paperID":"None"},{"content":"Harry W. Fischer III. 1998. Response to Disaster: Fact Versus Fiction & Perpetuation, 2nd edition. University Press of America: NY.","paperID":"None"},{"content":"Charles. E. Fritz and John H. Mathewson. 1957. Convergence Behavior in Disasters: A Problem in Social Control, Committee on Disaster Studies, Washington, DC, National Academy of Sciences, National Research Council.","paperID":"None"},{"content":"Government of Nepal. 2015. Nepal Earthquake 2015: Post Disaster Needs Assessment.","paperID":"None"},{"content":"Global Facility for Disaster Reduction & Recovery (GFDRR). 2015. Guide to the Open Data for Resilience Initiative. World Bank.","paperID":"None"},{"content":"Haklay, Mordechai. 2010. How Good is Volunteered Geographical Information? A Comparative Study of OpenStreetMap and Ordnance Survey Datasets. Environment and planning. B, Planning & design 37, no. 4 (2010): 682.","paperID":"None"},{"content":"Heath, C., & Luff, P. (1992). Collaboration and control Crisis management and multimedia technology in London Underground Line Control Rooms. Computer Supported Cooperative Work (CSCW), 1(1), 69--94.","paperID":"None"},{"content":"Amanda Lee Hughes and Leysia Palen. Twitter adoption and use in mass convergence and emergency events. International Journal of Emergency Management 6, no. 3--4 (2009): 248--260.","paperID":"None"},{"content":"Edwin Hutchins. 1995. Cognition In the Wild. MIT Press.","paperID":"None"},{"content":"James M. Kendra and Tricia Wachtendorf, 2003. Reconsidering Convergence and Converger Legitimacy in Response to the World Trade Center Disaster. In Terrorism and Disaster: New Threats, New Ideas, Lee Clarke (ed). Research in Social Problems and Public Policy (11), 97- 122.","paperID":"None"},{"content":"Steven J. Jackson and Sarah Barbrow. 2015. Standards and/as Innovation: Protocols, Creativity, and Interactive Systems Development in Ecology. In Proceedings of the Conference on Human Factors in Computing Systems.","paperID":"None"},{"content":"Alison Kidd. The Marks are on the Knowledge Worker. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems, (CHI '94).","paperID":"None"},{"content":"Rob Kitchin. 2014. The data revolution: Big data, open data, data infrastructures and their consequences. Sage.","paperID":"None"},{"content":"Gary A. Kreps & Susan L. Bosworth. Organizing, Role Enactment, and Disaster: A Structural Theory. Cranbury, NJ: Associated University Presses, 1994.","paperID":"None"},{"content":"Jean Lave and Etienne Wenger. Situated learning: Legitimate peripheral participation. Cambridge, 1991.","paperID":"None"},{"content":"Benedikt Lay, Volkmar Pipek, Christian Reuter, Torben Wiedenhoefer. 2012. Supporting improvisation work in inter-organizational crisis management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (CHI '12).","paperID":"None"},{"content":"Charlotte P. Lee, Paul Dourish, and Gloria Mark. 2006. The human infrastructure of cyberinfrastructure. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work (CSCW '06). ACM, NY, NY, USA, 483--492.","paperID":"None"},{"content":"Gloria Mark and Bryan Semaan. 2008. Resilience in collaboration: technology as a resource for new patterns of action. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08). ACM, NY, NY, USA, 137146. DOI=http://dx.doi.org/10.1145/1460563.1460585","paperID":"None"},{"content":"Afra Mashhadi, Giovanni Quattrone, and Licia Capra. 2013. Putting ubiquitous crowd-sourcing into context. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13).","paperID":"None"},{"content":"Eric Monteiro, Neil Pollock, Ole Hanseth, Robin Williams. \"From artefacts to infrastructures.\" Computer Supported Cooperative Work (CSCW) 22, no. 4--6 (2013): 575--607.","paperID":"None"},{"content":"Leysia Palen and Sophia B. Liu. 2007. Citizen Communications in Crisis: Anticipating a Future of ICT-Supported Participation, Proceedings of the ACM Conference on Human Factors in Computing Systems/Computer Human Interaction (CHI '07), 727-","paperID":"None"},{"content":"Leysia Palen, Robert Soden, T. Jennings Anderson, Mario Barrenechea. 2015. Success & Scale in a Data Producing Organization: The Socio-Technical Evolution of OpenStreetMap in Response to Humanitarian Events. In Proceedings of the ACM Conference on Human Factors in Computing Systems, (CHI '15).","paperID":"None"},{"content":"Leysia Palen, Jeannette Sutton, Sophia Liu, and Sarah Vieweg. 2008. \"Site-Seeing\" in Disaster: An Examination of On-Line Social Convergence. In Proceedings of the Information Systems for Crisis Response and Management Conference (ISCRAM '08).","paperID":"None"},{"content":"Volkmar Pipek and Volker Wulf. 2009. Infrastructuring: Toward an integrated perspective on the design and use of information technology. Journal of the Association for Information Systems 10, no. 5 (2009): 1.","paperID":"None"},{"content":"Giovanni Quattrone, Licia Capra, and Pasquale De Meo. 2015. There's No Such Thing as the Perfect Map: Quantifying Bias in Spatial Crowd-sourcing Datasets. In Proceedings of the Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15).","paperID":"None"},{"content":"Christian Reuter, Oliver Heger, and Volkmar Pipek. \"Combining real and virtual volunteers through social media.\" Proc. ISCRAM (2013): 780--790","paperID":"None"},{"content":"David Ribes and Thomas A. Finholt. 2009. The long now of technology infrastructure: articulating tensions in development. Journal of the Association for Information Systems 10, no. 5 (2009): 5.","paperID":"None"},{"content":"David Ribes and Charlotte P. Lee. 2010. Sociotechnical Studies of Cyberinfrastructure and EResearch: Current Themes and Future Trajectories. Computer Supported Cooperative Work (CSCW '10).","paperID":"None"},{"content":"Lise St. Denis, Leysia Palen, and Ken Anderson. 2014. Mastering Social Media: An Analysis of Jefferson County's Communications during the 2013 CO Floods. In Proceedings of the Conference on Information Systems for Crisis Response and Management (ISCRAM '14).","paperID":"None"},{"content":"Abigail J. Sellen and Richard HR Harper. 2002. The Myth of the Paperless Office. MIT.","paperID":"None"},{"content":"Bryan Semaan and Gloria Mark. \"Technologymediated social arrangements to resolve breakdowns in infrastructure during ongoing disruption.\" ACM Transactions on Computer-Human Interaction (TOCHI) 18, no. 4 (2011): 21","paperID":"None"},{"content":"Robert Soden and Leysia Palen. 2014. From crowdsourced mapping to community mapping: The post-earthquake work of OpenStreetMap Haiti. In Proceedings of the International Conference on the Design of Cooperative Systems, (COOP '14).","paperID":"None"},{"content":"Robert Soden, Nama Budhathoki, Leysia Palen. 2014. Resilience-Building and the Crisis Informatics Agenda: Lessons Learned from Open Cities Kathmandu. In Proceedings of the International Conference on Information Systems for Crisis Response and Management (ISCRAM '14).","paperID":"None"},{"content":"Susan Leigh Star and Karen Ruhleder. 1996. Steps toward an Ecology of Infrastructure: Design and access for large information spaces.\" Information systems Research 7.1 (1996): 111--134.","paperID":"None"},{"content":"Kate Starbird and Leysia Palen. 2011. Voluntweeters: Self-Organizing by Digital Volunteers in Times of Crisis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (CHI '11).","paperID":"None"},{"content":"Kate Starbird and Leysia Palen. 2013. Working and Sustaining the Virtual Disaster Desk. In Proceedings of the Conference on Computer Supported Cooperative Work (CSCW '13).","paperID":"None"},{"content":"Andrea H Tapia, Nicholas LaLone, Hyun-Woo Kim. 2014. Run amok: group crowd participation in identifying the bomb and bomber from the boston marathon bombing. In Proceedings of the Conference on Information Systems for Crisis Response and Management (ISCRAM '14).","paperID":"None"},{"content":"Kathleen Tierney and Enrico L. Quarantelli. 1989. Needed Innovation in the Delivery of Emergency Medical Services in Disasters: Present and Future. Disaster Management, 2(2): 70--76.","paperID":"None"},{"content":"United Nations Office for Coordination of Humanitarian Affairs (OCHA). 2015. Nepal Earthquake Situation Report. May 11, 2015.","paperID":"None"},{"content":"Tricia Wachtendorf and James M. Kendra. 2005. Improvising disaster in the city of jazz: Organizational response to Hurricane Katrina. Understanding Katrina: Perspectives from the Social Sciences.","paperID":"None"},{"content":"Joanne White, Leysia Palen. 2015. Expertise in the Wired Wild West. In Proceedings of the Conference on Computer Supported Cooperative Work, (CSCW '15).","paperID":"None"},{"content":"Joanne White, Leysia Palen, Kenneth Anderson. 2014. Digital Mobilization in Disaster Response: The Work & Self-Organization of On-Line Pet Advocates in Response to Hurricane Sandy. In Proceedings of the Conference on Computer Supported Cooperative Work, (CSCW '14).","paperID":"None"}],"title":"Infrastructure in the Wild: What Mapping in Post-Earthquake Nepal Reveals about Infrastructural Emergence","filename":"CHI16/p2796","authors":["Robert Soden","Leysia Palen"],"conference":"CHI '16"}