{"paperId":2858221,"citation":[],"reference":[{"content":"2015. Bayesia. (2015). http://www.bayesia.com/ Accessed: January 8, 2016.","paperID":"None"},{"content":"2015. F# Compiler Services. http: //fsharp.github.io/FSharp.Compiler.Service/. (2015). Accessed: January 8, 2016.","paperID":"None"},{"content":"2015. Light Table. http://lighttable.com/. (2015). Accessed: January 8, 2016.","paperID":"None"},{"content":"2015. Netica. (2015). https://www.norsys.com/netica.html Accessed: January 8, 2016.","paperID":"None"},{"content":"Christopher M Bishop, David Spiegelhalter, and John Winn. 2002. VIBES: A variational inference engine for Bayesian networks. In Advances in neural information processing systems. 777--784.","paperID":"None"},{"content":"Richard Bornat, Saeed Dehnadi, and others. 2008. Mental models, consistency and programming aptitude. In Proceedings of the tenth conference on Australasian computing education-Volume 78. Australian Computer Society, Inc., 53--61.","paperID":"None"},{"content":"Wray L. Buntine. 1994. Operations for learning with graphical models. JAIR 2 (1994), 159--225.","paperID":"None"},{"content":"Sebastian Burckhardt, Manuel Fahndrich, Peli de Halleux, Jun Kato, Sean McDirmid, Michal Moskal, and Nikolai Tillmann. 2013. It's Alive! Continuous Feedback in UI Programming. In PLDI. ACM SIGPLAN. http://research.microsoft.com/apps/ pubs/default.aspx?id=189242","paperID":"None"},{"content":"Andrew D Gordon, Thore Graepel, Nicolas Rolland, Claudio Russo, Johannes Borgstrom, and John Guiver. 2013. Tabular: A Schema-Driven Probabilistic Programming Language. Technical Report MSR-TR-2013--118. http://research.microsoft. com/apps/pubs/default.aspx?id=204661","paperID":"None"},{"content":"F.R. Kschischang, B.J. Frey, and H.-A. Loeliger. 2001. Factor graphs and the sum-product algorithm. IEEE Transactions on Information Theory 47, 2 (2001), 498--519. DOI: http://dx.doi.org/10.1109/18.910572","paperID":"None"},{"content":"David J Lunn, Andrew Thomas, Nicky Best, and David Spiegelhalter. 2000. WinBUGS-a Bayesian modelling framework: concepts, structure, and extensibility. Statistics and computing 10, 4 (2000), 325--337.","paperID":"None"},{"content":"T Minka, J M Winn, J P Guiver, S Webster, Y Zaykov, B Yangel, A Spengler, and J Bronskill. 2014. Infer.NET 2.6. (2014).","paperID":"None"},{"content":"Kevin Murphy. 1998. A brief introduction to graphical models and Bayesian networks. (1998).","paperID":"None"},{"content":"P Sedlmeier and G Gigerenzer. 2001. Teaching Bayesian reasoning in less than two hours. Journal of experimental psychology. General 130, 3 (Sept. 2001), 380--400. http://www.ncbi.nlm.nih.gov/pubmed/11561916","paperID":"None"},{"content":"Alistair Stead and Alan F. Blackwell. Learning Syntax as Notational Expertise when using DrawBridge. In Psychology of Programming Interest Group Annual Conference 2014. 41.","paperID":"None"},{"content":"Kozo Sugiyama, Shojiro Tagawa, and Mitsuhiko Toda. 1981. Methods for visual understanding of hierarchical system structures. Systems, Man and Cybernetics, IEEE Transactions on 11, 2 (1981), 109--125.","paperID":"None"},{"content":"Steven L Tanimoto. 1990. VIVA: A visual language for image processing. Journal of Visual Languages & Computing 1, 2 (1990), 127--139.","paperID":"None"},{"content":"Uan-Diego Zapata-Rivera and Jim E. Greer. 2004. Interacting with Inspectable Bayesian Student Models. International Journal of Artificial Intelligence in Education Volume 14, Number 2/2004 - IOS Press (2004). http://iospress.metapress.com/content/rj0wwc454vvll8xn/","paperID":"None"}],"abstract":"We present a live, multiple-representation novice environment for probabilistic programming based on the Infer.NET language. When compared to a text-only editor in a controlled experiment on 16 participants, our system showed a significant reduction in keystrokes during introductory probabilistic programming exercises, and subsequently, a significant improvement in program description and debugging tasks as measured by task time, keystrokes and deletions.","title":"A Live, Multiple-Representation Probabilistic Programming Environment for Novices","filename":"CHI16/p2533","authors":["Maria I. Gorinova","Advait Sarkar","Alan F. Blackwell","Don Syme"],"conference":"CHI '16"}