{"paperId":2858449,"citation":[],"reference":[{"content":"Gábor Blaskó, Franz Coriand, and Steven Feiner. 2005. Exploring interaction with a simulated wristworn projection display. Proceedings International Symposium on Wearable Computers, ISWC 2005: 2--9. http://doi.org/10.1109/ISWC.2005.21","paperID":"None"},{"content":"Mark Bolas and D.M. Krum. 2010. Augmented reality applications and user interfaces using headcoupled near-axis personal projectors with novel retroreflective props and surfaces. Ubiprojection Workshop, Pervasive '10, Helsinki, Finland: 5--8. Retrieved from http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.169.7803&rep=rep1&type=pdf","paperID":"None"},{"content":"Olivier Borg, Remy Casanova, and Reinoud J. Bootsma. 2015. Reading from a Head-Fixed Display during Walking: Adverse Effects of Gaze Stabilization Mechanisms. Plos One 10, 6: e0129902. http://doi.org/10.1371/journal.pone.0129902","paperID":"None"},{"content":"Julie Carmigniani, Borko Furht, Marco Anisetti, Paolo Ceravolo, Ernesto Damiani, and Misa Ivkovic. 2011. Augmented reality technologies, systems and applications. Multimedia Tools and Applications 51, 1: 341--377. http://doi.org/10.1007/s11042-010-0660--6","paperID":"None"},{"content":"Alexandru Dancu, Qualisys Ab, and Morten Fjeld. 2015. Interaction in Motion with Mobile Projectors': Design Considerations.","paperID":"None"},{"content":"Thomas H. Harding, Clarence E. Rash, and Gregory T. Lang. 2010. Perceptual and cognitive effects on the use of helmet-mounted displays due to external operational factors. Proc. SPIE 7688, Table 1: 76880C-76880C-11. http://doi.org/10.1117/12.848931","paperID":"None"},{"content":"Chris Harrison and Andrew D Wilson. 2011. OmniTouch: Wearable Multitouch Interaction Everywhere. 441--450.","paperID":"None"},{"content":"Dalma Héricz, Tamás Sarkadi, Viktor Lucza, Viktor Kovács, and Pál Koppa. 2014. Investigation of a 3D head-mounted projection display using retro-reflective screen. Optics Express 22, 15: 17823. http://doi.org/10.1364/OE.22.017823","paperID":"None"},{"content":"H Hua, A Girardot, C Gao, and J P Rolland. 2000. Engineering of head-mounted projective displays. Applied optics 39, 22: 3814--3824. http://doi.org/10.1364/AO.39.003814","paperID":"None"},{"content":"Jochen Huber. 2014. A Research Overview of Mobile Projected User Interfaces. Informatik Spektrum: 464--473. http://doi.org/10.1007/s00287014-0819-z","paperID":"None"},{"content":"Daniel Kade, Kaan Akşit, Hakan Ürey, and Oğuzhan Özcan. 2015. Head-mounted mixed reality projection display for games production and entertainment. Personal and Ubiquitous Computing: 509--521. http://doi.org/10.1007/s00779-015-0847-y","paperID":"None"},{"content":"R. Kijima and T. Ojika. 1997. Transition between virtual environment and workstation environment with projective head mounted display. 130--137. http://doi.org/10.1109/VRAIS.1997.583062","paperID":"None"},{"content":"Teppei Konishi, Keisuke Tajimi, Nobuchika Sakata, and Shogo Nishida. 2009. Projection Stabilizing Method for Palm-top. ISWC 2009: Proceedings of the 13th international symposium on Wearable Computers.","paperID":"None"},{"content":"David M. Krum, Evan a. Suma, and Mark Bolas. 2012. Augmented reality using personal projection and retroreflection. Personal and Ubiquitous Computing 16, 1: 17--26. http://doi.org/10.1007/s00779-011-0374--4","paperID":"None"},{"content":"Takeshi Kurata, Nobuchika Sakata, Masakatsu Kourogi, Takashi Okuma, and Yuichi Ohta. 2008. Interaction using nearby-and-far projection surfaces with a body-worn ProCam system. Proceedings of SPIE 6804: 68040D-68040D-12. http://doi.org/10.1117/12.759311","paperID":"None"},{"content":"Felix Lauber and Andreas Butz. 2014. In-Your-Face, Yet Unseen Improving Head-Stabilized Warnings to Reduce Reaction Time. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: 3201--3204.","paperID":"None"},{"content":"Li Li, Bernard D. Adelstein, and Stephen R. Ellis. 2009. Perception of image motion during head movement. ACM Transactions on Applied Perception 6, 1: 1--15. http://doi.org/10.1145/1462055.1462060","paperID":"None"},{"content":"Diego Martinez. 2014. ReflectoSlates: Personal Overlays for Tabletops Combining Camera projector Systems and Retroreflective Materials. CHI'14 Extended Abstracts on Human Factors in Computing Systems: 2071--2076.","paperID":"None"},{"content":"Daniel C Mcfarlane, Steven M Wilder, Executive Campus, and Cherry Hill. 2009. Interactive Dirt: Increasing Mobile Work Performance with a Wearable Projector-Camera System. Proceedings of the 11th international conference on Ubiquitous computing: 205--214.","paperID":"None"},{"content":"Satoshi Murata and Kaori Fujinami. 2011. Stabilization of Projected Image for Wearable Walking Support System Using Pico-projector. 2011 IEEE 17th International Conference on Embedded and Real-Time Computing Systems and Applications: 113--116. http://doi.org/10.1109/RTCSA.2011.53","paperID":"None"},{"content":"Shuhei Ota, Yoshinari Takegawa, Tsutomu Terada, and Masahiko Tsukamoto. 2010. A Method for Wearable Projector Selection that Considers the Viewability of Projected Images. Computers in Entertainment (CIE) 8, 3. http://doi.org/10.1145/1902593.1902596.http","paperID":"None"},{"content":"Robert Patterson, Marc D Winterbottom, and Byron J Pierce. 2006. Perceptual issues in the use of head-mounted visual displays. Human factors 48, 3: 555--573. http://doi.org/10.1518/001872006778606877","paperID":"None"},{"content":"James B. Sampson. 1993. Cognitive Performance of Individuals using a Head-Mounted Display while walking. Proceedings of the Human Factors and Ergonomics Society 37th Annual Meeting: 338--342.","paperID":"None"},{"content":"Antti Sand, Tampereen Yliopisto, and Tampereen Yliopisto. 2013. Mixed Reality with Multimodal Head-mounted Pico Projector. VRIC '13 Proceeding of the Virtual Reality International Conference: Laval Virtual, 1--2.","paperID":"None"},{"content":"Keisuke Tajimi, Keiji Uemura, Yasuhiro Kajiwara, Nobuchika Sakata, and Shogo Nishida. 2010. Stabilization Method for Floor Projection with a Hip-Mounted Projector. ICAT 2010: Proceedings of 20th international conference on Artificial Reality and Telexistence, 1--3.","paperID":"None"},{"content":"D. J. Uribe and M. E. Miller. 2013. Eye Movements When Viewing a HMD Under Vibration. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 57, 1: 1139--1143. http://doi.org/10.1177/1541931213571254","paperID":"None"},{"content":"Christian Winkler, Julian Seifert, David Dobbelstein, and Enrico Rukzio. 2014. Pervasive Information through Constant Personal Projection: The Ambient Mobile Pervasive Display ( AMP-D ). Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: 4117--4126.","paperID":"None"}],"abstract":"The Head Mounted Projection Display (HMPD) is a growing interest area in HCI. Although various aspects of HMPDs have been investigated, there is not enough information regarding the effect of HMPDs (i.e., head referenced static and dynamic displays while a user is in motion and standing) on visual attentional performance. For this purpose, we conducted a user study (N=18) with three experimental conditions (control, standing, walking) and two visual perceptual tasks (with dynamic and static displays). Significant differences between conditions were only found for the task with dynamic display; accuracy was lower in walking condition compared to the other two conditions. Our work contributes an empirical investigation of the effect of HMPDs on visual attentional performance by providing data-driven benchmarks for developing graphical user interface design guidelines for HMPDs.","title":"Head Mounted Projection Display & Visual Attention: Visual Attentional Processing of Head Referenced Static and Dynamic Displays while in Motion and Standing","filename":"CHI16/p1538","authors":["Çağlar Genç","Shoaib Soomro","Yalçın Duyan","Selim Ölçer","Fuat Balcı","Hakan Ürey","Oğuzhan Özcan"],"conference":"CHI '16"}