{"paperId":2858038,"citation":[],"reference":[{"content":"American Psychiatric Association. 2013. Diagnostic and Statistical Manual of Mental Disorders.","paperID":"None"},{"content":"Michael Arthur, Sandra Bochner, and Nancy Butterfield. 1999. Enhancing Peer Interactions Within the Context of Play. International Journal of Disability, Development and Education 46, 3: 367--381. http://doi.org/10.1080/103491299100551","paperID":"None"},{"content":"Nirit Bauminger, Cory Shulman, and Galit Agam. 2003. Peer interaction and loneliness in high functioning children with autism. Journal of autism and developmental disorders 33, 5: 489--507.","paperID":"None"},{"content":"Tom Boellstorff. 2010. Coming of Age in Second Life: An Anthropologist Explores the Virtually Human. Princeton University Press.","paperID":"None"},{"content":"Tom Boellstorff, Bonnie Nardi, Celia Pearce, and T.L. Taylor. 2012. Ethnography and Virtual Worlds: A Handbook of Method. Princeton University Press.","paperID":"None"},{"content":"Louanne E. Boyd, Kathryn E. Ringland, Oliver L. Haimson, Helen Fernandez, Maria Bistarkey, and Gillian R. Hayes. 2015. Evaluating a Collaborative iPad Game's Impact on Social Relationships for Children with Autism Spectrum Disorder. ACM Transactions on Accessible Computing 7, 1: 1--18. http://doi.org/10.1145/2751564","paperID":"None"},{"content":"Moira Burke, Robert Kraut, and Diane Williams. 2010. Social use of computer-mediated communication by adults on the autism spectrum. Proceedings of the 2010 ACM conference on Computer supported cooperative work, 425--434. Retrieved January 12, 2014 from http://dl.acm.org/citation.cfm?id=1718991","paperID":"None"},{"content":"Kathry Charmaz. 2006. Constructing Grounded Theory: A Practical Guide to Qualitative Analysis. Sage Publications Ltd.","paperID":"None"},{"content":"Neil S. Coulson, Heather Buchanan, and Aimee Aubeeluck. 2007. Social support in cyberspace: A content analysis of communication within a Huntington's disease online support group. Patient Education and Counseling 68, 2: 173--178. http://doi.org/10.1016/j.pec.2007.06.002","paperID":"None"},{"content":"Joshua J. Diehl, Loisa Bennetto, and Edna Carter Young. 2006. Story Recall and Narrative Coherence of High-Functioning Children with Autism Spectrum Disorders. Journal of Abnormal Child Psychology 34, 1: 83--98. http://doi.org/10.1007/s10802-005--9003-x","paperID":"None"},{"content":"Florence D. DiGennaro Reed, Sarah R. Hyman, and Jason M. Hirst. 2011. Applications of technology to teach social skills to children with autism. Research in Autism Spectrum Disorders 5, 3: 1003--1010. http://doi.org/10.1016/j.rasd.2011.01.022","paperID":"None"},{"content":"Sean C. Duncan. 2011. Minecraft, beyond construction and survival. Well Played: a journal on video games, value and meaning 1, 1: 1--22.","paperID":"None"},{"content":"Jacquelynne S. Eccles, Diane Early, Kari Fraser, Elaine Belansky, and Karen McCarthy. 1997. The Relation of Connection, Regulation, and Support for Autonomy to Adolescents' Functioning. Journal of Adolescent Research 12, 2: 263--286.","paperID":"None"},{"content":"Marilyn Evans, Lorie Donelle, and Laurie HumeLoveland. 2012. Social support and online postpartum depression discussion groups: A content analysis. Patient Education and Counseling 87, 3: 405--410. http://doi.org/10.1016/j.pec.2011.09.011","paperID":"None"},{"content":"Eynat Gal, Dina Goren-Bar, E. Gazit, et al. 2005. Enhancing social communication through story-telling among high-functioning children with autism. In Intelligent Technologies for Interactive Entertainment. Springer, 320--323. Retrieved January 29, 2015 from http://link.springer.com/chapter/10.1007/11590323_43","paperID":"None"},{"content":"Catherine Garvey. 1990. Play. Harvard University Press, Cambridge, MA.","paperID":"None"},{"content":"Dan Goodley and Katherine Runswick-Cole. 2010. Emancipating play: dis/abled children, development and deconstruction. Disability & Society 25, 4: 499--512. http://doi.org/10.1080/09687591003755914","paperID":"None"},{"content":"Roy Richard Grinker. 2007. Unstrange minds: remapping the world of autism. Basic Books, New York.","paperID":"None"},{"content":"William A. Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on twitch: fostering participatory communities of play within live mixed media. ACM Press, 1315--1324. http://doi.org/10.1145/2556288.2557048","paperID":"None"},{"content":"Ken Hartsook, Alexander Zook, Sauvik Das, and Mark Owen Riedl. 2011. Toward supporting stories with procedurally generated game worlds. Computational Intelligence and Games (CIG), 2011 IEEE Conference on, IEEE, 297--304. Retrieved August 10, 2015 from http://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=60","paperID":"None"},{"content":"Sameer Hinduja and Justin W. Patchin. 2008. Cyberbullying: An Exploratory Analysis of Factors Related to Offending and Victimization. Deviant Behavior 29, 2: 129--156. http://doi.org/10.1080/01639620701457816","paperID":"None"},{"content":"H. Honda and Y. Shimizu. 2002. Early Intervention System for Preschool Children with Autism in the Community: The Discovery Approach in Yokohama, Japan. Autism 6, 3: 239--257. http://doi.org/10.1177/1362361302006003003","paperID":"None"},{"content":"Hwajung Hong, Eric Gilbert, Gregory D. Abowd, and Rosa I. Arriaga. 2015. In-group Questions and Outgroup Answers: Crowdsourcing Daily Living Advice for Individuals with Autism. Retrieved February 18, 2015 from http://comp.social.gatech.edu/papers/chi15.autismQA.hong.pdf","paperID":"None"},{"content":"Hwajung Hong, Jennifer G. Kim, Gregory D. Abowd, and Rosa I. Arriaga. 2012. Designing a social network to support the independence of young adults with autism. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, ACM, 627--636. Retrieved April 28, 2014 from http://dl.acm.org/citation.cfm?id=2145300","paperID":"None"},{"content":"Hwajung Hong, Jennifer G. Kim, Gregory D. Abowd, and Rosa I. Arriaga. 2012. SocialMirror: motivating young adults with autism to practice life skills in a social world. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion, ACM, 41--42. Retrieved May 2, 2015 from http://dl.acm.org/citation.cfm?id=2141533","paperID":"None"},{"content":"Juan Pablo Hourcade, Natasha E. Bullock-Rest, and Thomas E. Hansen. 2011. Multitouch tablet applications and activities to enhance the social skills of children with autism spectrum disorders. Personal and Ubiquitous Computing 16, 2: 157--168. http://doi.org/10.1007/s00779-011-0383--3","paperID":"None"},{"content":"Juan Pablo Hourcade, Stacy R. Williams, Ellen A. Miller, Kelsey E. Huebner, and Lucas J. Liang. 2013. Evaluation of tablet apps to encourage social interaction in children with autism spectrum disorders. Proceedings of the 2013 ACM annual conference on Human factors in computing systems, ACM, 3197--3206. Retrieved March 9, 2014 from http://dl.acm.org/citation.cfm?id=2466438","paperID":"None"},{"content":"Lilly C. Irani, Gillian R. Hayes, and Paul Dourish. 2008. Situated practices of looking: visual practice in an online world. Proceedings of the 2008 ACM conference on Computer supported cooperative work, ACM, 187--196. Retrieved January 31, 2014 from http://dl.acm.org/citation.cfm?id=1460592","paperID":"None"},{"content":"Ellen Isaacs, Margaret Szymanski, Yutaka Yamauchi, James Glasnapp, and Kyohei Iwamoto. 2012. Integrating local and remote worlds through channel blending. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, ACM, 617--626. Retrieved August 10, 2015 from http://dl.acm.org/citation.cfm?id=2145299","paperID":"None"},{"content":"Mizuko Ito, Sonja Baumer, Matteo Bittanti, et al. 2010. Hanging Out, Messing Around, and Geeking Out: Kids Living and Learning with New Media. MIT Press, Cambridge, MA.","paperID":"None"},{"content":"Erik Jahr, Sigmund Eldevik, and Svein Eikeseth. 2000. Teaching children with autism to initiate and sustain cooperative play. Research in Developmental Disabilities 21, 2: 151--169.","paperID":"None"},{"content":"Lisa E. Jobe and Susan Williams White. 2007. Loneliness, social relationships, and a broader autism phenotype in college students. Personality and Individual Differences 42, 8: 1479--1489. http://doi.org/10.1016/j.paid.2006.10.021","paperID":"None"},{"content":"Rita Jordan. 2003. Social Play and Autistic Spectrum Disorders: A Perspective on Theory, Implications and Educational Approaches. Autism 7, 4: 347--360. http://doi.org/10.1177/1362361303007004002","paperID":"None"},{"content":"Rita Jordan. 2008. THE GULLIFORD LECTURE: Autistic spectrum disorders: a challenge and a model for inclusion in education. British Journal of Special Education 35, 1: 11--15.","paperID":"None"},{"content":"Janet E. Lainhart and Susan E. Folstein. 1994. Affective disorders in people with autism: A review of published cases. Journal of autism and developmental disorders 24, 5: 587--601.","paperID":"None"},{"content":"Mathias Lasgaard, Annette Nielsen, Mette E. Eriksen, and Luc Goossens. 2010. Loneliness and Social Support in Adolescent Boys with Autism Spectrum Disorders. Journal of Autism and Developmental Disorders 40, 2: 218--226. http://doi.org/10.1007/s10803-009-0851-z","paperID":"None"},{"content":"Brenda Laurel. 2004. Narrative construction as play. interactions 11, 5: 73--74.","paperID":"None"},{"content":"Sarah Libby, Stuart Powell, David Messer, and Rita Jordan. 1998. Spontaneous play in children with autism: A reappraisal. Journal of autism and developmental disorders 28, 6: 487--497.","paperID":"None"},{"content":"Leslie S. Liu, Kori M. Inkpen, and Wanda Pratt. 2015. \"I'm Not Like My Friends\": Understanding How Children with a Chronic Illness Use Technology to Maintain Normalcy. ACM Press, 1527--1539. http://doi.org/10.1145/2675133.2675201","paperID":"None"},{"content":"Molly Losh and Lisa Capps. 2003. Narrative ability in high-functioning children with autism or Asperger's syndrome. Journal of autism and developmental disorders 33, 3: 239--251.","paperID":"None"},{"content":"Hazel Markus and Paula Nurius. 1986. Possible selves. American psychologist 41, 9: 954.","paperID":"None"},{"content":"Pat Mirenda. 2001. Autism, Augmentative Communication, and Assistive Technology: What Do We Really Know? Focus on Autism and Other Developmental Disabilities 16, 3: 141--151.","paperID":"None"},{"content":"Mojang. 2014. Minecraft. Minecraft. Retrieved January 10, 2014 from https://minecraft.net/","paperID":"None"},{"content":"James Morgan and Yagiz Mungan. 2014. Fine Arts, Culture, and Creativity in Minecraft. In Understanding Minecraft: Essays on Play, Community, and Possibilities, Nate Garrelts (ed.). McFarland & Company, Inc., Jefferson, NC, 175--190.","paperID":"None"},{"content":"Eve Müller, Adriana Schuler, and Gregory B. Yates. 2008. Social challenges and supports from the perspective of individuals with Asperger syndrome and other autism spectrum disabilities. Autism 12, 2: 173--190. http://doi.org/10.1177/1362361307086664","paperID":"None"},{"content":"Bonnie Nardi. 2010. My Life as a Night Elf Priest An Anthropological Account of World of Warcraft. University of Michigan Press.","paperID":"None"},{"content":"Bonnie Nardi and Justin Harris. 2006. Strangers and friends: Collaborative play in World of Warcraft. Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work, ACM, 149--158. Retrieved February 12, 2014 from http://dl.acm.org/citation.cfm?id=1180898","paperID":"None"},{"content":"Elinor Ochs and Olga Solomon. 2010. Autistic Sociality. Ethos 38, 1: 69--92. http://doi.org/10.1111/j.1548--1352.2009.01082.x","paperID":"None"},{"content":"Gael I. Orsmond, Marty Wyngaarden Krauss, and Marsha Mailick Seltzer. 2004. Peer relationships and social and recreational activities among adolescents and adults with autism. Journal of autism and developmental disorders 34, 3: 245--256.","paperID":"None"},{"content":"Tyler Pace, Shaowen Bardzell, and Jeffrey Bardzell. 2010. The rogue in the lovely black dress: intimacy in world of warcraft. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 233--242. Retrieved November 11, 2014 from http://dl.acm.org/citation.cfm?id=1753361","paperID":"None"},{"content":"Celia Pearce and Artemesia. 2009. Communities of Play: Emergent Cultures in Multiplayer Games and Virtual Worlds. MIT Press.","paperID":"None"},{"content":"Amit Pinchevski and John Durham Peters. 2015. Autism and new media: Disability between technology and society. New Media & Society: 1461444815594441.","paperID":"None"},{"content":"Anne Marie Piper, Eileen O'Brien, Meredith Ringel Morris, and Terry Winograd. 2006. SIDES: a cooperative tabletop computer game for social skills development. Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work, ACM, 1--10. Retrieved January 23, 2014 from http://dl.acm.org/citation.cfm?id=1180877","paperID":"None"},{"content":"Amit Pitaru. 2008. E is for everyone: The Case for inclusive game design. The Ecology of Games: Connecting Youth, Games, and Learning: 67--86.","paperID":"None"},{"content":"Michael D. Resnick, Peter S. Bearman, Robert Wm Blum, et al. 1997. Protecting adolescents from harm: findings from the National Longitudinal Study on Adolescent Health. Jama 278, 10: 823--832.","paperID":"None"},{"content":"Michael D. Resnick, L.J. Harris, and Robert Wm Blum. 1993. The impact of caring and connectedness on adolescent health and well-being. Journal Paediatric Child Health 29.","paperID":"None"},{"content":"Catherine M. Ridings and David Gefen. 2004. Virtual Community Attraction: Why People Hang Out Online. Journal of Computer-Mediated Communication 10, 1. http://doi.org/0.1111/j.1083--6101.2004.tb00229.x","paperID":"None"},{"content":"Kathryn E. Ringland, Christine T. Wolf, Lynn Dombrowski, and Gillian R. Hayes. 2015. Making \"Safe\": Community-Centered Practices in a Virtual World Dedicated to Children with Autism. Proceedings of the ACM 2015 Conference on Computer Supported Cooperative Work, ACM.","paperID":"None"},{"content":"Marsha Mailick Seltzer, Marty Wyngaarden Krauss, Paul T. Shattuck, Gael Orsmond, April Swe, and Catherine Lord. 2003. The symptoms of autism spectrum disorders in adolescence and adulthood. Journal of autism and developmental disorders 33, 6: 565--581.","paperID":"None"},{"content":"Chantal Sicile-Kira. 2004. Autism Spectrum Disorders: The Complete Guide to Understanding Autism, Asperger's Syndrome, Pervasive Developmental Disorder, and Other ASDs. The Berkeley Publishing Group, New York, New York.","paperID":"None"},{"content":"Laurence Steinburg. 1997. Beyond the Classroom: Why School Reform Has Failed and What Parents Need to Do. Simon & Schuster, New York.","paperID":"None"},{"content":"P. S. Strain and I. Schwartz. 2001. ABA and the Development of Meaningful Social Relations for Young Children with Autism. Focus on Autism and Other Developmental Disabilities 16, 2: 120--128. http://doi.org/10.1177/108835760101600208","paperID":"None"},{"content":"Michael Thomét. 2014. Look What Just Happened: Communicating Play in Online Communities. In Understanding Minecraft: Essays on Play, Community, and Possibilities, Nate Garrelts (ed.). McFarland & Company, Inc., Jefferson, NC, 121--131.","paperID":"None"},{"content":"Robert S. Tokunaga. 2010. Following you home from school: A critical review and synthesis of research on cyberbullying victimization. Computers in Human Behavior 26, 3: 277--287. http://doi.org/10.1016/j.chb.2009.11.014","paperID":"None"},{"content":"Patti M. Valkenburg and Jochen Peter. 2009. Social consequences of the internet for adolescents a decade of research. Current Directions in Psychological Science 18, 1: 1--5.","paperID":"None"},{"content":"Emily C. Weinstein, Robert L. Selman, Sara Thomas, Jung-Eun Kim, Allison E. White, and Karthik Dinakar. 2015. How to Cope With Digital Stress The Recommendations Adolescents Offer Their Peers Online. Journal of Adolescent Research: 0743558415587326.","paperID":"None"},{"content":"Susan W. White and Roxann Roberson-Nay. 2009. Anxiety, Social Deficits, and Loneliness in Youth with Autism Spectrum Disorders. Journal of Autism and Developmental Disorders 39, 7: 1006--1013. http://doi.org/10.1007/s10803-009-0713--8","paperID":"None"},{"content":"Dmitri Wiliams, Nicolas Ducheneaut, Li Xiong, Yuanyuan Zhang, Nick Yee, and Eric Nickell. 2006. From Tree House to Barracks: The Social Life of Guilds in World of Warcraft. Games and Culture 1, 4: 338--361.","paperID":"None"},{"content":"Keith L. Williams and Renee V. Galliher. 2006. Predicting depression and self-esteem from social connectedness, support, and competence. Journal of Social and Clinical Psychology 25, 8: 855--874.","paperID":"None"},{"content":"Pamela Wolfberg, Kristen Bottema-Beutel, and Mila DeWitt. 2012. Including Children with Autism in Social and Imaginary Play with Typical Peers. American Journal of Play 5, 1. Retrieved February 20, 2014 from http://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=19380399&AN=83926198&h=XG6m1I3MccHsrbv%2FUCoH1VSYm%2FfZzGkU1f0CeeMjx8ZzeRG2rfYtiJkawjQby9TL3fqt8ErFyEISGFM%2BUQj3lw%3D%3D&crl=c","paperID":"None"},{"content":"Pamela J. Wolfberg. 2009. Play & Imagination in Children with Autism. Teachers College Press, New York City, New York, USA.","paperID":"None"},{"content":"2002. Developing Adolescents: A Reference for Professionals. American Psychological Association, Washington, D.C.","paperID":"None"}],"abstract":"Traditional face-to-face social interactions can be challenging for individuals with autism, leading some to perceive and categorize them as less social than their typically-developing peers. Individuals with autism may even see themselves as less social relative to their peers. Online communities can provide an alternative venue for social expression, enabling different types of communication beyond face-to-face, oral interaction. Using ethnographic methods, we studied the communication ecology that has emerged around a Minecraft server for children with autism and their allies. Our analysis shows how members of this community search for, practice, and define sociality through a variety of communication channels. These findings suggest an expansion in how sociality has traditionally been conceptualized for individuals with autism.","title":"\"Will I always be not social?\": Re-Conceptualizing Sociality in the Context of a Minecraft Community for Autism","filename":"CHI16/p1256","authors":["Kathryn E. Ringland","Christine T. Wolf","Heather Faucett","Lynn Dombrowski","Gillian R. Hayes"],"conference":"CHI '16"}