{"paperId":2858210,"abstract":"Families are becoming more culturally heterogeneous due to a rise in intermarriage, geographic mobility, and access to a greater diversity of cultural perspectives online. Investigating the challenges of cross-cultural parenting can help us support this growing demographic, as well as better understand how families integrate and negotiate advice from diverse online and offline sources in making parenting decisions. We interviewed parents from 18 families to understand the practices they adopt to meet the challenges of cross-cultural parenting. We investigated how these families respond to conflicts while integrating diverse cultural views, as well as how they utilize the wealth of parenting resources available online in navigating these tasks. We identify five themes focused on how these families find and evaluate advice, connect with social support, resolve intra-family tensions, incorporate multicultural practices, and seek out diverse views. Based on our findings, we contribute three implications for design and translations of these implications to concrete technology ideas that aim to help families better integrate multiple cultures into everyday life.","citation":[],"reference":[{"content":"Mark S Ackerman and David W Mcdonald. 1996. Answer Garden 2?: Merging Organizational Memory with Collaborative Help. Proc. of CSCW, 97--105.","paperID":"None"},{"content":"M. S. Ackerman and T. W. Malone. 1990. Answer Garden: A Tool for Growing Organizational Memory. Proceedings of the ACM SIGOIS and IEEE CS TC-OA Conference on Office Information Systems, ACM, 31--39. http://doi.org/10.1145/91474.91485","paperID":"None"},{"content":"Tawfiq Ammari, Priya Kumar, Cliff Lampe, and Sarita Schoenebeck. 2015. Managing Children's Online Identities: How Parents Decide What to Disclose About Their Children Online. Proc. of CHI, 1895--1904.","paperID":"None"},{"content":"Tawfiq Ammari and Sarita Schoenebeck. 2015. Understanding and Supporting Fathers and Fatherhood on Social Media Sites. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1905--1914. http://doi.org/10.1145/2702123.2702205","paperID":"None"},{"content":"Tawfiq Ammari, Sarita Yardi Schoenebeck, and Meredith Ringel Morris. 2014. Accessing Social Support and Overcoming Judgment on Social Media among Parents of Children with Special Needs. Eighth International AAAI Conference on Weblogs and Social Media.","paperID":"None"},{"content":"Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: A Location-Mapping Mobile Application for Breastfeeding Women. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1709--1718. http://doi.org/10.1145/2702123.2702328","paperID":"None"},{"content":"Mitchell K. Bartholomew, Sarah J. Schoppe-Sullivan, Michael Glassman, Claire M. Kamp Dush, and Jason M. Sullivan. 2012. New Parents' Facebook Use at the Transition to Parenthood. Family Relations 61, 3: 455--469. http://doi.org/10.1111/j.1741--3729.2012.00708.x","paperID":"None"},{"content":"Nanyi Bi, Susan R. Fussell, and Jeremy Birnholtz. 2014. To Be Like You to Be Liked by You: Cultural Effects on Adjusting Awareness Information Gathering Behavior. Proc. of Conference on Collaboration Across Boundaries: Culture, Distance & Technology, 31--40. http://doi.org/10.1145/2631488.2631494","paperID":"None"},{"content":"Marc H. Bornstein. 1991. Cultural Approaches to Parenting. Psychology Press.","paperID":"None"},{"content":"Deana Brown and Rebecca E. Grinter. 2012. Takes a Transnational Network to Raise a Child: The Case of Migrant Parents and Left-behind Jamaican Teens. Proc. of Ubicomp, ACM, 123--132. http://doi.org/10.1145/2370216.2370237","paperID":"None"},{"content":"A. P. Buunk, J. H. Park, and L. A. Duncan. 2010. Cultural Variation in Parental Influence on Mate Choice. Cross-Cultural Research 44, 1: 23--40. http://doi.org/10.1177/1069397109337711","paperID":"None"},{"content":"Justin B. Cranshaw, Kurt Luther, Patrick Gage Kelley, and Norman Sadeh. 2014. Curated City: Capturing Individual City Guides Through Social Curation. Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3249--3258. http://doi.org/10.1145/2556288.2557401","paperID":"None"},{"content":"Cheryl Crippen and Leah Brew. 2007. Intercultural Parenting and the Transcultural Family: A Literature Review. The Family Journal 15, 2: 107--115. http://doi.org/10.1177/1066480706297783","paperID":"None"},{"content":"Cheryl Crippen and Leah Brew. 2013. Strategies of Cultural Adaption in Intercultural Parenting. The Family Journal 21, 3: 263--271. http://doi.org/10.1177/1066480713476664","paperID":"None"},{"content":"T. Dalsgaard, M. B. Skov, M. Stougaard, and B. Thomassen. 2006. Mediated intimacy in families: understanding the relation between children and parents. Proc. of IDC, ACM, 145--152.","paperID":"None"},{"content":"Nancy Darling and Laurence Steinberg. 1993. Parenting style as context: An integrative model. Psychological Bulletin 113, 3: 487--496. http://doi.org/10.1037/0033--2909.113.3.487","paperID":"None"},{"content":"Scott Davidoff, Brian D Ziebart, John Zimmerman, and Anind K Dey. 2011. Learning Patterns of Pick-ups and Drop-offs to Support Busy Family Coordination. Proc. of CHI, 1175--1184.","paperID":"None"},{"content":"J Diamond, L Wang, and K Gomez. 2004. AfricanAmerican and Chinese-American parent involvement: The importance of race, class, and culture. Research Digest. FINE Network: Harvard Family Research Project.","paperID":"None"},{"content":"W. J. Doherty and J. M. Beaton. 2004. Mothers and Fathers Parenting Together. In Handbook of Family Communication. Lawrence Erlbaum Associates, Mahwah, NJ, 269--286.","paperID":"None"},{"content":"Pamela Druckerman. 2012. Bringing Up Bebe: One American Mother Discovers the Wisdom of French Parenting. Penguin Press HC.","paperID":"None"},{"content":"Dworkin, Jodi, Connell, Jessica, and Doty, Jennifer. 2013. A literature review of parents' online behavior. 7, 2.","paperID":"None"},{"content":"Lorna Gibson and Vicki L. Hanson. 2013. Digital Motherhood: How Does Technology Help New Mothers? Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 313--322. http://doi.org/10.1145/2470654.2470700","paperID":"None"},{"content":"Christine Gross-Loh. 2013. Parenting Without Borders: Surprising Lessons Parents Around the World Can Teach Us. Avery.","paperID":"None"},{"content":"Pamela Hinds and Katharina Reinecke. 2014. Advancing Methodologies for Cross- Cultural Studies of Collaborative Systems. Proc. of CSCW, 323--326. http://doi.org/10.1145/2556420.2558856","paperID":"None"},{"content":"Geert Hofstede. 1984. The Cultural Relativity of the Quality of Life Concept. Academy of Management Review 9, 3: 389--398. http://doi.org/10.5465/AMR.1984.4279653","paperID":"None"},{"content":"Mei-Ling Hopgood. 2012. How Eskimos Keep Their Babies Warm: And Other Adventures in Parenting. Algonquin Books, Chapel Hill, N.C.","paperID":"None"},{"content":"Jaci Huws, Robert Jones, and David Ingledew. 2001. Parents of Children with Autism using an Email Group: A Grounded Theory Study. Journal of Health Psychology 6, 5: 569--584.","paperID":"None"},{"content":"Jean S. Phinney. The Multigroup Ethnic Identity Measure A New Scale for Use with Diverse Groups. 7, 2: 156--176.","paperID":"None"},{"content":"Michelle Jones. 2007. Hofstede-Culturally questionable? Oxford Business & Economics Conference.","paperID":"None"},{"content":"Teresa W Julian, Patrick C McKenry, and Mary W McKelvey. 1994. Cultural Variations in Parenting: Perceptions of Caucasian, African-American, Hispanic, and Asian-American Parents. Family Relations 43, 1: 30--37. http://doi.org/10.2307/585139","paperID":"None"},{"content":"Boris Katz, Jimmy Lin, and Sue Felshin. 2001. Gathering Knowledge for a Question Answering System from Heterogeneous Information Sources. Proceedings of the Workshop on Human Language Technology and Knowledge Management - Volume 2001, Association for Computational Linguistics, 9:1--9:8. http://doi.org/10.3115/1118220.1118229","paperID":"None"},{"content":"Shipra Kayan, Susan R. Fussell, and Leslie D. Setlock. 2006. Cultural Differences in the Use of Instant Messaging in Asia and North America. Proc. of CSCW, 525--528. http://doi.org/10.1145/1180875.1180956","paperID":"None"},{"content":"Tracey A. Laszloffy Kerry Ann Rockquemore. 2005. Raising Biracial Children. AltaMira Press. Retrieved from http://books.google.com/books?hl=en&lr=&id=1VknA AAAQBAJ&oi=fnd&pg=PR3&dq=Raising+Biracial+ Children&ots=HKPLQS8isM&sig=C1tmyrYjdw7350cFan _exl8eLI#v=onepage&q=Raising%20Biracial%20Childre n&f=false","paperID":"None"},{"content":"Dion K.K and Dion, K.L. 1996. Cultural perspectives on romantic love. Personal Relationships 3: 5--17. http://doi.org/http://dx.doi.org/10.1111/j.14756811.1996.tb00101.x","paperID":"None"},{"content":"Helen Klein. 2004. Cognition in Natural Settings: The Cultural Lens Model. In Cultural Ergonomics (Advances in Human Performance and Cognitive Engineering Research, Volume 4). Emerald Group Publishing Limited, 249--280.","paperID":"None"},{"content":"S. Kothaneth. 2010. A Pilot Study on the CrossCultural Acceptance of Technology. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 54, 23: 1951--1955. http://doi.org/10.1177/154193121005402310","paperID":"None"},{"content":"Jens Manuel Krogstad. 2014. 5 facts about the modern American family. Pew Research Center. Retrieved September 11, 2014 from http://www.pewresearch.org/fact-tank/2014/04/30/5facts-about-the-modern-american-family/","paperID":"None"},{"content":"Daniel W. L. Lai. 2007. Cultural predictors of caregiving burden of Chinese-Canadian family caregivers. Canadian Journal on Aging = La Revue Canadienne Du Vieillissement 26 Suppl 1: 133--147. http://doi.org/10.3138/cja.26.suppl_1.133","paperID":"None"},{"content":"Mary Madden, Sandra Cortesi, Urs Gasser, Amanda Lenhart, and Maeve Duggan. 2012. Parents, Teens, and Online Privacy. Pew Internet & American Life Project.","paperID":"None"},{"content":"Kristin D Mickelson. 1997. Seeking social support: parents in electronic support groups. In Culture of the Internet, Sara Kiesler (ed.). Lawrence Erlbaum Associates, 157--178. Retrieved from http://books.google.com/books?hl=de&lr=&id=ugjDsU eM5hIC&pgis=1","paperID":"None"},{"content":"Kristin D Mickelson. 1997. Seeking social support: parents in electronic support groups. In Culture of the Internet, Sara Kiesler (ed.). Lawrence Erlbaum Associates, 157--178. Retrieved from http://books.google.com/books?hl=de&lr=&id=ugjDsU eM5hIC&pgis=1","paperID":"None"},{"content":"Monica McGoldrick, Joe Giordano, and Nydia GarciaPreto (eds.). 2005. Ethnicity and Family Therapy. The Guilford Press. Retrieved from http://books.google.com/books?hl=en&lr=&id=6Al1k B_6GyMC&oi=fnd&pg=PA1&dq=multicultural+famil y+struggle&ots=cV0kiTJiJ6&sig=AuT0mbLwqwDlGd h7hh64KpaEkyU#v=onepage&q=multicultural%20fam ily%20struggle&f=false","paperID":"None"},{"content":"Meredith Ringel Morris. 2014. Social Networking Site Use by Mothers of Young Children. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1272--1282. http://doi.org/10.1145/2531602.2531603","paperID":"None"},{"content":"Hannakaisa Niela-Vilén, Anna Axelin, Sanna Salanterä, and Hanna-Leena Melender. Internet-based peer support for parents: A systematic integrative review. International Journal of Nursing Studies. http://doi.org/10.1016/j.ijnurstu.2014.06.009","paperID":"None"},{"content":"Nielsen. 2009. Where the Moms Are: Shopping, Blogging, Networking and Strategizing Online.","paperID":"None"},{"content":"William Odom, Mark Selby, Abigail Sellen, David Kirk, Richard Banks, and Tim Regan. 2012. Photobox: On the Design of a Slow Technology. Proceedings of the Designing Interactive Systems Conference, ACM, 665--668. http://doi.org/10.1145/2317956.2318055","paperID":"None"},{"content":"M. Perry-Jenkins, C. P. Pierce, and A. E. Goldberg. 2004. Discourses on Diapers and Dirty Laundry: family communication about child care and housework. In Handbook of Family Communication. Lawrence Erlbaum Associates, Mahwah, NJ, 541--561.","paperID":"None"},{"content":"Pew Forum on Religion & Public Life Project. 2013. U.S. Religious Landscape Survey. Pew Research Center, Washington DC.","paperID":"None"},{"content":"Lars Plantin and Kristian Daneback. 2009. Parenthood, information and support on the internet. A literature review of research on parents and professionals online. BMC Family Practice 10, 1: 34.","paperID":"None"},{"content":"Katharina Reinecke and Krzysztof Gajos. 2015. LabintheWild: Conducting Large-Scale Online Experiments With Uncompensated Samples. Proc. of CSCW, To Appear.","paperID":"None"},{"content":"Katharina Reinecke and Krzysztof Z. Gajos. 2014. Quantifying Visual Preferences Around the World. Proc. of CHI, 11--20. http://doi.org/10.1145/2556288.2557052","paperID":"None"},{"content":"M. Rodriguez, M. Donovick, and S. Crowley. 2009. Parenting Styles in a Cultural Context: Observations of \"Protective Parenting\" in First-Generation Latinos. Family Process 48, 2: 195--210.","paperID":"None"},{"content":"A Sarkadi and S Bremberg. 2005. Socially unbiased parenting support on the Internet: a cross-sectional study of users of a large Swedish parenting website. Child care health and development 31, 1: 43--52.","paperID":"None"},{"content":"Sarita Yardi Schoenebeck. 2013. The Secret Life of Online Moms: Anonymity and Disinhibition on YouBeMom.com. ICWSM 2013.","paperID":"None"},{"content":"Aaron D. Shaw, John J. Horton, and Daniel L. Chen. 2011. Designing Incentives for Inexpert Human Raters. Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work, ACM, 275--284. http://doi.org/10.1145/1958824.1958865","paperID":"None"},{"content":"A. Sillars, D. J. Canary, and M. Tafoya. 2004. Communication, Conflict, and the Quality of Family Relationships. In Handbook of Family Communication. Lawrence Erlbaum Associates, Mahwah, NJ, 413--446.","paperID":"None"},{"content":"David R. Thomas. 2006. A General Inductive Approach for Analyzing Qualitative Evaluation Data. American Journal of Evaluation 27, 2: 237--246. http://doi.org/10.1177/1098214005283748","paperID":"None"},{"content":"F. Vetere, M. R. Gibbs, J. Kjeldskov, et al. 2005. Mediating intimacy: designing technologies to support strong-tie relationships. Proc. of CHI, ACM, 471--480.","paperID":"None"},{"content":"Wendy Wang. Interracial marriage: Who is \"marrying out\"? Pew Research Center.","paperID":"None"},{"content":"Svetlana Yarosh and Gregory D. Abowd. 2011. Mediated parent-child contact in work-separated families. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1185--1194.","paperID":"None"},{"content":"Zeliha Yazıcı. 2013. Family interaction in multicultural environment: Turkish immigrant family case. International Journal of Academic Research 5, 4: 420--423. http://doi.org/10.7813/2075--4124.2013/5--4/B.61","paperID":"None"},{"content":"Bo Yu and Guoray Cai. 2009. Facilitating Participatory Decision-making in Local Communities Through Mapbased Online Discussion. Proceedings of the Fourth International Conference on Communities and Technologies, ACM, 215--224. http://doi.org/10.1145/1556460.1556492","paperID":"None"}],"title":"\"Best of Both Worlds\": Opportunities for Technology in Cross-Cultural Parenting","filename":"CHI16/p635","authors":["Svetlana Yarosh","Sarita Schoenebeck","Shreya Kothaneth","Elizabeth Bales"],"conference":"CHI '16"}