{"paperId":2858264,"citation":[],"reference":[{"content":"Jason Alexander, Andrés Lucero, and Sriram Subramanian. 2012. Tilt Displays: Designing Display Surfaces with Multi-axis Tilting and Actuation. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, NY, NY, USA, 161-170. DOI: http://dx.doi.org/10.1145/2371574.2371600","paperID":"None"},{"content":"Olivier Bau, Ivan Poupyrev, Ali Israr, and Chris Harrison. 2010. TeslaTouch: Electrovibration for Touch Surfaces. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, NY, NY, USA, 283-292. DOI: http://dx.doi.org/10.1145/1866029.1866074","paperID":"None"},{"content":"Patrick Baudisch and Gerry Chu. 2009. Back-of-device Interaction Allows Creating Very Small Touch Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1923-1932. DOI: http://dx.doi.org/10.1145/1518701.1518995","paperID":"None"},{"content":"Mohamed Benali-Khoudja, Moustapha Hafez, Jean-Marc Alexandre, and Abderrahmane Kheddar. 2004. Tactile interfaces: a state-of-the-art survey. In International Symposium on Robotics, Vol. 31. Citeseer.","paperID":"None"},{"content":"Gábor Blaskó and Steven Feiner. 2004. Single-handed Interaction Techniques for Multiple Pressure-sensitive Strips. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, NY, NY, USA, 1461-1464. DOI: http://dx.doi.org/10.1145/985921.986090","paperID":"None"},{"content":"Stephen Brewster, Faraz Chohan, and Lorna Brown. 2007. Tactile Feedback for Mobile Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 159-162. DOI: http://dx.doi.org/10.1145/1240624.1240649","paperID":"None"},{"content":"Alex Butler, Shahram Izadi, and Steve Hodges. 2008. SideSight: Multi-\"Touch\" Interaction Around Small Devices. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, NY, NY, USA, 201-204. DOI: http://dx.doi.org/10.1145/1449715.1449746","paperID":"None"},{"content":"Angela Chang, Sile O'Modhrain, Rob Jacob, Eric Gunther, and Hiroshi Ishii. 2002. ComTouch: Design of a Vibrotactile Communication Device. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '02). ACM, NY, NY, USA, 312-320. DOI: http://dx.doi.org/10.1145/778712.778755","paperID":"None"},{"content":"Craig Michael Ciesla and Micah B Yairi. 2012. Tactus User interface system. (April 10 2012). US Patent 8,154,527.","paperID":"None"},{"content":"Panteleimon Dimitriadis and Jason Alexander. 2014. Evaluating the Effectiveness of Physical Shape-change for In-pocket Mobile Device Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2589-2592. DOI: http://dx.doi.org/10.1145/2556288.2557164","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic Physical Affordances and Constraints Through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 417-426. DOI: http://dx.doi.org/10.1145/2501988.2502032","paperID":"None"},{"content":"S C Gandevia, L A Hall, D I McCloskey, and E K Potter. 1983. Proprioceptive sensation at the terminal joint of the middle finger. The Journal of Physiology 335, 1 (1983), 507-517. DOI: http://dx.doi.org/10.1113/jphysiol.1983.sp014547","paperID":"None"},{"content":"George A Gescheider. 2013. Psychophysics: the fundamentals. Psychology Press.","paperID":"None"},{"content":"Antonio Gomes, Andrea Nesbitt, and Roel Vertegaal. 2013. MorePhone: A Study of Actuated Shape Deformations for Flexible Thin-film Smartphone Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 583-592. DOI: http://dx.doi.org/10.1145/2470654.2470737","paperID":"None"},{"content":"L A Hall and D I McCloskey. 1983. Detections of movements imposed on finger, elbow and shoulder joints. The Journal of Physiology 335, 1 (1983), 519-533. DOI: http://dx.doi.org/10.1113/jphysiol.1983.sp014548","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2009. Providing Dynamically Changeable Physical Buttons on a Visual Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 299-308. DOI: http://dx.doi.org/10.1145/1518701.1518749","paperID":"None"},{"content":"Fabian Hemmert, Susann Hamann, Matthias Löwe, Josefine Zeipelt, and Gesche Joost. 2010. Shape-changing Mobiles: Tapering in Two-dimensional Deformational Displays in Mobile Phones. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, NY, NY, USA, 3075-3080. DOI: http://dx.doi.org/10.1145/1753846.1753920","paperID":"None"},{"content":"Fabian Hemmert, Gesche Joost, André Knörig, and Reto Wettach. 2008. Dynamic Knobs: Shape Change As a Means of Interaction on a Mobile Phone. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, NY, NY, USA, 2309-2314. DOI: http://dx.doi.org/10.1145/1358628.1358675","paperID":"None"},{"content":"Eve Hoggan, Sohail Anwar, and Stephen A. Brewster. 2007. Mobile Multi-actuator Tactile Displays. In Proceedings of the 2Nd International Conference on Haptic and Audio Interaction Design (HAID'07). Springer-Verlag, Berlin, Heidelberg, 22-33. http://dl.acm.org/citation.cfm?id=1775512.1775518","paperID":"None"},{"content":"David Holman, Andreas Hollatz, Amartya Banerjee, and Roel Vertegaal. 2013. Unifone: Designing for Auxiliary Finger Input in One-handed Mobile Interactions. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13). ACM, NY, NY, USA, 177-184. DOI: http://dx.doi.org/10.1145/2460625.2460653","paperID":"None"},{"content":"Hiroo Iwata, Hiroaki Yano, Fumitaka Nakaizumi, and Ryo Kawamura. 2001. Project FEELEX: Adding Haptic Surface to Graphics. In Proceedings of the 28th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '01). ACM, NY, NY, USA, 469-476. DOI: http://dx.doi.org/10.1145/383259.383314","paperID":"None"},{"content":"K. O. Johnson and S. S. Hsiao. 1992. Neural mechanisms of tactual form and texture perception. Annu. Rev. Neurosci. 15 (1992), 227-250.","paperID":"None"},{"content":"K. O. Johnson and J. R. Phillips. 1981. Tactile spatial resolution. I. Two-point discrimination, gap detection, grating resolution, and letter recognition. J. Neurophysiol. 46, 6 (Dec 1981), 1177-1192.","paperID":"None"},{"content":"Y. Kato, T. Sekitani, M. Takamiya, M. Doi, K. Asaka, T. Sakurai, and T. Someya. 2007. Sheet-Type Braille Displays by Integrating Organic Field-Effect Transistors and Polymeric Actuators. Electron Devices, IEEE Transactions on 54, 2 (Feb 2007), 202-209. DOI: http://dx.doi.org/10.1109/TED.2006.888678","paperID":"None"},{"content":"Dong-Soo Kwon and Seung-Chan Kim. 2008. Haptic Interfaces for Mobile Devices: A Survey of the State of the Art. Recent Patents on Computer Science 1, 2 (2008), 84-92. DOI: http://dx.doi.org/10.2174/2213275910801020084","paperID":"None"},{"content":"Sangwon Lee, Kwangmok Jung, Jachoon Koo, Sungil Lee, Hoogon Choi, Jaewook Jeon, Jaedo Nam, and Hyoukryeol Choi. 2004. Braille display device using soft actuator. Proc. SPIE 5385 (2004), 368-379. DOI: http://dx.doi.org/10.1117/12.539739","paperID":"None"},{"content":"V. Levesque, L. Oram, and K. MacLean. 2012. Exploring the design space of programmable friction for scrolling interactions. In Haptics Symposium (HAPTICS), 2012 IEEE. 23-30. DOI: http://dx.doi.org/10.1109/HAPTIC.2012.6183765","paperID":"None"},{"content":"Joseph Luk, Jerome Pasquero, Shannon Little, Karon MacLean, Vincent Levesque, and Vincent Hayward. 2006. A Role for Haptics in Mobile Interaction: Initial Design Using a Handheld Tactile Display Prototype. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 171-180. DOI: http://dx.doi.org/10.1145/1124772.1124800","paperID":"None"},{"content":"J. Pasquero, J. Luk, V. Levesque, Qi Wang, V. Hayward, and K.E. MacLean. 2007. Haptically Enabled Handheld Information Display With Distributed Tactile Transducer. Multimedia, IEEE Transactions on 9, 4 (June 2007), 746-753. DOI: http://dx.doi.org/10.1109/TMM.2007.895672","paperID":"None"},{"content":"Ivan Poupyrev and Shigeaki Maruyama. 2003. Tactile Interfaces for Small Touch Screens. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03). ACM, NY, NY, USA, 217-220. DOI:http://dx.doi.org/10.1145/964696.964721","paperID":"None"},{"content":"Ivan Poupyrev, Shigeaki Maruyama, and Jun Rekimoto. 2002a. Ambient Touch: Designing Tactile Interfaces for Handheld Devices. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (UIST '02). ACM, NY, NY, USA, 51-60. DOI:http://dx.doi.org/10.1145/571985.571993","paperID":"None"},{"content":"Ivan Poupyrev, Jun Rekimoto, and Shigeaki Maruyama. 2002b. TouchEngine: A Tactile Display for Handheld Devices. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, NY, NY, USA, 644-645. DOI: http://dx.doi.org/10.1145/506443.506525","paperID":"None"},{"content":"Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: Toward High \"Shape Resolution\" in Self-actuated Flexible Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 593-602. DOI: http://dx.doi.org/10.1145/2470654.2470738","paperID":"None"},{"content":"Scott S. Snibbe, Karon E. MacLean, Rob Shaw, Jayne Roderick, William L. Verplank, and Mark Scheeff. 2001. Haptic Techniques for Media Control. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, NY, NY, USA, 199-208. DOI: http://dx.doi.org/10.1145/502348.502387","paperID":"None"},{"content":"Ian R Summers, Craig M Chanter, Anna L Southall, and Alan C Brady. 2001. Results from a Tactile Array on the Fingertip. In Proceedings of Eurohaptics. 26-28.","paperID":"None"},{"content":"R. W. Van Boven and K. O. Johnson. 1994. The limit of tactile spatial resolution in humans: grating orientation discrimination at the lip, tongue, and finger. Neurology 44, 12 (Dec 1994), 2361-2366.","paperID":"None"},{"content":"Qi Wang and Vincent Hayward. 2010. Biomechanically Optimized Distributed Tactile Transducer Based on Lateral Skin Deformation. The International Journal of Robotics Research 29, 4 (2010), 323-335. DOI: http://dx.doi.org/10.1177/0278364909345289","paperID":"None"}],"abstract":"Current mobile devices do not leverage the rich haptic channel of information that our hands can sense, and instead focus primarily on touch based graphical interfaces. Our goal is to enrich the user experience of these devices through bi-directional haptic and tactile interactions (display and control) around the edge of hand-held devices. We propose a novel type of haptic interface, a Haptic Edge Display, consisting of actuated pins on the side of a display, to form a linear array of tactile pixels (taxels). These taxels are implemented using small piezoelectric actuators, which can be made cheaply and have ideal characteristics for mobile devices. We developed two prototype Haptic Edge Displays, one with 24 actuated pins (3.75mm in pitch) and a second with 40 pins (2.5mm in pitch). This paper describes several novel haptic interactions for the Haptic Edge Display including dynamic physical affordances, shape display, non-dominant hand interactions, and also in-pocket ``pull' style haptic notifications. In a laboratory experiment we investigated the limits of human perception for Haptic Edge Displays, measuring the just-noticeable difference for pin width and height changes for both in-hand and simulated in-pocket conditions.","title":"Haptic Edge Display for Mobile Tactile Interaction","filename":"CHI16/p3706","authors":["Sungjune Jang","Lawrence H. Kim","Kesler Tanner","Hiroshi Ishii","Sean Follmer"],"conference":"CHI '16"}