{"paperId":2858143,"abstract":"We present a novel model to predict error rates in temporal pointing. With temporal pointing, a target is about to appear within a limited time window for selection. Unlike in spatial pointing, there is no movement to control in the temporal domain; the user can only determine when to launch the response. Although this task is common in interactions requiring temporal precision, rhythm, or synchrony, no previous HCI model predicts error rates as a function of task properties. Our model assumes that users have an implicit point of aim but their ability to elicit the input event at that time is hampered by variability in three processes: 1) an internal time-keeping process, 2) a response-execution stage, and 3) input processing in the computer. We derive a mathematical model with two parameters from these assumptions. High fit is shown for user performance with two task types, including a rapidly paced game. The model can explain previous findings showing that touchscreens are much worse in temporal pointing than physical input devices. It also has novel implications for design that extend beyond the conventional wisdom of minimising latency.","citation":[],"reference":[{"content":"Luigi Acerbi, Daniel M Wolpert, and Sethu Vijayakumar. 2012. Internal representations of temporal statistics and feedback calibrate motor-sensory interval timing. (2012).","paperID":"None"},{"content":"Rasmus Baath. 2015. Estimating the distribution of sensorimotor synchronization data: A Bayesian hierarchical modeling approach. Behavior research methods (2015), 1--12.","paperID":"None"},{"content":"James J Belisle. 1963. Accuracy, reliability, and refractoriness in a coincidence-anticipation task. Research Quarterly. American Association for Health, Physical Education and Recreation 34, 3 (1963), 271--281.","paperID":"None"},{"content":"Anne-Marie Brouwer, Jeroen BJ Smeets, and Eli Brenner. 2005. Hitting moving targets: effects of target speed and dimensions on movement time. Experimental Brain Research 165, 1 (2005), 28--36.","paperID":"None"},{"content":"Kimberly Chu and Chui Yin Wong. 2011. Mobile input devices for gaming experience. In User Science and Engineering (i-USEr), 2011 International Conference on. IEEE, 83--88.","paperID":"None"},{"content":"ERFW Crossman and PJ Goodeve. 1983. Feedback control of hand-movement and Fitts' law. The Quarterly Journal of Experimental Psychology 35, 2 (1983), 251--278.","paperID":"None"},{"content":"David A Engstrom, JA Scott Kelso, and Tom Holroyd. 1996. Reaction-anticipation transitions in human perception-action patterns. Human Movement Science 15, 6 (1996), 809--832.","paperID":"None"},{"content":"Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of experimental psychology 47, 6 (1954), 381.","paperID":"None"},{"content":"Khai-chung Gan and Errol R Hoffmann. 1988. Geometrical conditions for ballistic and visually controlled movements. Ergonomics 31, 5 (1988), 829--839.","paperID":"None"},{"content":"Yves Guiard and Olivier Rioul. 2015. A mathematical description of the speed/accuracy trade-off of aimed movement. In Proceedings of the 2015 British HCI Conference. ACM, 91--100.","paperID":"None"},{"content":"Peter A Hancock and Karl M Newell. 1985. The movement speed-accuracy relationship in space-time. In Motor Behavior. Springer, 153--188.","paperID":"None"},{"content":"Errol R Hoffmann. 2013. Which version/variation of Fitts law? A critique of information-theory models. Journal of motor behavior 45, 3 (2013), 205--215.","paperID":"None"},{"content":"Tsung-Yu Hsieh, Yeou-Teh Liu, Gottfried Mayer-Kress, and Karl M Newell. 2013. The movement speed-accuracy relation in space-time. Human movement science 32, 1 (2013), 257--269.","paperID":"None"},{"content":"Ray Hyman. 1953. Stimulus information as a determinant of reaction time. Journal of experimental psychology 45, 3 (1953), 188.","paperID":"None"},{"content":"Steven W Keele. 1968. Movement control in skilled motor performance. Psychological bulletin 70, 6p1 (1968), 387.","paperID":"None"},{"content":"Seonjin Kim, Les G Carlton, Yeou-Teh Liu, and Karl M Newell. 1999. Impulse and Movement SpaceTime Variability. Journal of motor behavior 31, 4 (1999), 341--357.","paperID":"None"},{"content":"David N Lee and others. 1976. A theory of visual control of braking based on information about time-to-collision. Perception 5, 4 (1976), 437--459.","paperID":"None"},{"content":"Jirí Mates, Ulrike Muller, Tomas Radil, and Ernst Poppel. 1994. Temporal integration in sensorimotor synchronization. Journal of cognitive neuroscience 6, 4 (1994), 332--340.","paperID":"None"},{"content":"David E Meyer, Richard A Abrams, Sylvan Kornblum, Charles E Wright, and JE Keith Smith. 1988. Optimality in human motor performance: ideal control of rapid aimed movements. Psychological review 95, 3 (1988), 340.","paperID":"None"},{"content":"David E Meyer, JE Smith, and Charles E Wright. 1982. Models for the speed and accuracy of aimed movements. Psychological Review 89, 5 (1982), 449.","paperID":"None"},{"content":"George P Moore and Jessie Chen. 2010. Timings and interactions of skilled musicians. Biological cybernetics 103, 5 (2010), 401--414.","paperID":"None"},{"content":"KM Newell. 1980. 30 The Speed-Accuracy Paradox in Movement Control: Errors of Time and space. Advances in Psychology 1 (1980), 501--510.","paperID":"None"},{"content":"KM Newell, Les G Carlton, and Seonjin Kim. 1994. Time and space-time movement accuracy. Human Performance 7, 1 (1994), 1--21.","paperID":"None"},{"content":"Rejean Plamondon and Adel M Alimi. 1997. Speed/accuracy trade-offs in target-directed movements. Behavioral and Brain Sciences 20, 02 (1997), 279--303.","paperID":"None"},{"content":"Jeff Pressing. 1999. The referential dynamics of cognition and action. Psychological Review 106, 4 (1999), 714.","paperID":"None"},{"content":"Roger Ratcliff and Hans PA Van Dongen. 2011. Diffusion model for one-choice reaction-time tasks and the cognitive effects of sleep deprivation. Proceedings of the National Academy of Sciences 108, 27 (2011), 11285--11290.","paperID":"None"},{"content":"Bruno H Repp. 2005. Sensorimotor synchronization: a review of the tapping literature. Psychonomic bulletin & review 12, 6 (2005), 969--992.","paperID":"None"},{"content":"Bruno H Repp. 2006. Rate limits of sensorimotor synchronization. Advances in Cognitive Psychology 2, 2--3 (2006), 163--181.","paperID":"None"},{"content":"Bruno H Repp and Yi-Huang Su. 2013. Sensorimotor synchronization: a review of recent research (2006--2012). Psychonomic Bulletin & Review 20, 3 (2013), 403--452.","paperID":"None"},{"content":"Andries F Sanders and Andries Sanders. 2013. Elements of human performance: Reaction processes and attention in human skill. Psychology Press.","paperID":"None"},{"content":"Richard A Schmidt. 1968. Anticipation and timing in human motor performance. Psychological Bulletin 70, 6p1 (1968), 631.","paperID":"None"},{"content":"Richard A Schmidt and David E Sherwood. 1982. An inverted--U relation between spatial error and force requirements in rapid limb movements: Further evidence for the impulse-variability model. Journal of Experimental Psychology: Human Perception and Performance 8, 1 (1982), 158.","paperID":"None"},{"content":"Richard A Schmidt, Howard Zelaznik, Brian Hawkins, James S Frank, and John T Quinn Jr. 1979. Motor-output variability: a theory for the accuracy of rapid motor acts. Psychological review 86, 5 (1979), 415.","paperID":"None"},{"content":"J Tresilian, J Oliver, and T Carroll. 2003. Temporal precision of interceptive action: differential effects of target size and speed. Experimental brain research 148, 4 (2003), 425--438.","paperID":"None"},{"content":"James R Tresilian. 2005. Hitting a moving target: perception and action in the timing of rapid interceptions. Perception & Psychophysics 67, 1 (2005), 129--149.","paperID":"None"},{"content":"James R Tresilian and Andrew Lonergan. 2002. Intercepting a moving target: effects of temporal precision constraints and movement amplitude. Experimental Brain Research 142, 2 (2002), 193--207.","paperID":"None"},{"content":"Eric-Jan Wagenmakers, Han LJ Van Der Maas, and Raoul PPP Grasman. 2007. An EZ-diffusion model for response time and accuracy. Psychonomic bulletin & review 14, 1 (2007), 3--22.","paperID":"None"},{"content":"Alan M Wing and AB Kristofferson. 1973a. The timing of interresponse intervals. Perception & Psychophysics 13, 3 (1973), 455--460.","paperID":"None"},{"content":"Alan M Wing and Alfred B Kristofferson. 1973b. Response delays and the timing of discrete motor responses. Perception & Psychophysics 14, 1 (1973), 5--12.","paperID":"None"},{"content":"Jacob O Wobbrock, Edward Cutrell, Susumu Harada, and I Scott MacKenzie. 2008. An error model for pointing based on Fitts' law. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1613--1622.","paperID":"None"},{"content":"Daniel M Wolpert and Michael S Landy. 2012. Motor control is decision-making. Current opinion in neurobiology 22, 6 (2012), 996--1003.","paperID":"None"},{"content":"Loutfouz Zaman and I Scott MacKenzie. 2013. Evaluation of nano-stick, foam buttons, and other input methods for gameplay on touchscreen phones. In International Conference on Multimedia and Human-Computer Interaction-MHCI 2013. 69--1.","paperID":"None"},{"content":"Loutfouz Zaman, Daniel Natapov, and Robert J Teather. 2010. Touchscreens vs. traditional controllers in handheld gaming. In Proceedings of the International Academic Conference on the Future of Game Design and Technology. ACM, 183--190.","paperID":"None"}],"title":"Modelling Error Rates in Temporal Pointing","filename":"CHI16/p1857","authors":["Byungjoo Lee","Antti Oulasvirta"],"conference":"CHI '16"}