{"paperId":2858079,"citation":[],"reference":[{"content":"Sarah Atkinson. 2011. Stereoscopic-3D storytelling? Rethinking the conventions, grammar and aesthetics of a new medium. Journal of Media Practice 12(2):139--156. http://dx.doi.org/10.1386/jmpr.12.2.139_1","paperID":"None"},{"content":"Maurice Patel. 2009. Whitepaper. The New Art of Virtual Moviemaking. Autodesk.","paperID":"None"},{"content":"Seok-Hyung Bae, Ravin Balakrishnan, and Karan Singh. 2008. ILoveSketch: as-natural-as-possible sketching system for creating 3d curve models. In Proceedings of the ACM symposium on Users software and technology (UIST'08). 151--160. http://dx.doi.org/10.1145/1449715.1449740","paperID":"None"},{"content":"Bruce Block, and Philip McNally .2013. 3D Storytelling: How Stereoscopic 3D Works and How to Use It. Focal Press.","paperID":"None"},{"content":"Nora Broy, Stefan Schneegass, Florian Alt, and Albrecht Schmidt,. 2014. FrameBox and MirrorBox: tools and guidelines to support designers in prototyping interfaces for 3D displays. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI'14). 20372046. http://dx.doi.org/10.1145/2556288.2557183","paperID":"None"},{"content":"Jonathan M. Cohen, John F. Hughes, and Robert C. Zeleznik. 2000. Harold: a world made of drawings. In Proceedings of the 1st international symposium on Nonphotorealistic animation and rendering (NPAR '00). 83--90. http://doi.acm.org/10.1145/340916.340927","paperID":"None"},{"content":"Tomas Dorta, Gokce Kinayoglu, and Michael Hoffmann. 2014. Hyve-3D: a new embodied interface for immersive collaborative 3D sketching. In ACM SIGGRAPH 2014 Studio (SIGGRAPH '14), page 37. http://doi.acm.org/10.1145/2619195.2656325","paperID":"None"},{"content":"Julie Dorsey, Songhua Xu, Gabe Smedresman, Holly Rushmeier, and Leonard McMillan. 2007. The Mental Canvas: A Tool for Conceptual Architectural Design and Analysis. In Proceedings of the 15th Pacific Conference on Computer Graphics and Applications (PG '07). 201--210. http://dx.doi.org/10.1109/PG.2007.62","paperID":"None"},{"content":"Song-Pei Du, Belen Masia, Shi-Min Hu, and Diego Gutierrez. 2013. A metric of visual comfort for stereoscopic motion. ACM Trans. Graph. 32, 6, Article 222 (November 2013), 9 pages. http://doi.acm.org/10.1145/2508363.2508387","paperID":"None"},{"content":"Yotam Gingold, Takeo Igarashi, and Denis Zorin. 2009. Structured annotations for 2D-to-3D modeling. ACM Trans. Graph. 28, 5, Article 148 (December 2009), 9 pages. http://doi.acm.org/10.1145/1618452.1618494","paperID":"None"},{"content":"Saul Greenberg, Sheelagh Carpendale, and Nicolai Marquardt. 2011. Sketching user experiences: the workbook. Morgan Kaufmann.","paperID":"None"},{"content":"Tovi Grossman, Ravin Balakrishnan, and Karan Singh. 2003. An interface for creating and manipulating curves using a high degree-of-freedom curve input device. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). 185--192. http://doi.acm.org/10.1145/642611.642645","paperID":"None"},{"content":"John Hart. 2007. The Art of the Storyboard: A Filmmaker's Introduction (2nd Ed.). Focal Press.","paperID":"None"},{"content":"Ken Hinckley, Michel Pahud, Hrvoje Benko, Pourang Irani, François Guimbretière, Marcel Gavriliu, Xiang 'Anthony' Chen, Fabrice Matulic, William Buxton, and Andrew Wilson. 2014. Sensing techniques for tablet+stylus interaction. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). 605--614. http://doi.acm.org/10.1145/2642918.2647379","paperID":"None"},{"content":"Ken Hinckley, Koji Yatani, Michel Pahud, Nicole Coddington, Jenny Rodenhouse, Andy Wilson, Hrvoje Benko, and Bill Buxton. 2010. Pen + touch = new tools. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10). 2736. http://doi.acm.org/10.1145/1866029.1866036","paperID":"None"},{"content":"How to Create 3D Anaglyph Images in Photoshop. Retrieved September 2, 2015. http://designinstruct.com/photography/3d-anaglyphphotoshop/","paperID":"None"},{"content":"How to Create Anaglyph 3D Images That Really Work! Retrieved Sept. 2, 2015. http://blog.spoongraphics.co.uk/tutorials/how-to-createanaglyph-3d-images-that-really-work","paperID":"None"},{"content":"How to Create Anaglyph Stereo Image Using Adobe Illustrator and Phantasm CS. Retrieved September 2, 2015. http://astutegraphics.com/blog/how-to-create-anaglyphstereo-image-using-adobe-illustrator-and-phantasm-cs/","paperID":"None"},{"content":"How to Create an Anaglyphic Text Effect in Adobe Illustrator - Tuts+ Design & Illustration Tutorial. Retrieved September 2, 2015 from http://design.tutsplus.com/tutorials/how-to-create-ananaglyphic-text-effect-in-adobe-illustrator--vector-18526","paperID":"None"},{"content":"Takeo Igarashi, Satoshi Matsuoka, and Hidehiko Tanaka. 1999. Teddy: a sketching interface for 3D freeform design. In Proceedings of the 26th annual conference on Computer graphics and interactive techniques (SIGGRAPH '99). 409--416. http://dx.doi.org/10.1145/311535.311602","paperID":"None"},{"content":"Kiia Kallio. 2005. 3D6B Editor: Projective 3D sketching with line-based rendering. In Eurographics Workshop on Sketch-Based Interfaces and Modeling. 1--7.","paperID":"None"},{"content":"Steve Katz. 1991. Film directing shot by shot: visualizing from concept to screen. Focal Press","paperID":"None"},{"content":"Daniel F. Keefe, Robert C. Zeleznick, and David H. Laidlaw. 2007. Drawing on air: input techniques for controlled 3D line illustration. IEEE Trans. Vis. Comp. Graph. 13, 5: 1067.","paperID":"None"},{"content":"Yongjin Kim, Yunjin Lee, Henry Kang, and Seungyong Lee. 2013. Stereoscopic 3D line drawing. ACM Trans. Graph. 32, 4, Article 57 (July 2013), 13 pages. http://doi.acm.org/10.1145/2461912.2462001","paperID":"None"},{"content":"Yongjin Kim, Holger Winnemöller, and Seungyong Lee. 2013. WYSIWYG stereo painting. In Proceedings of the ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games (I3D '13), 169--176. http://doi.acm.org/10.1145/2448196.2448223","paperID":"None"},{"content":"Paul Lapides, Ehud Sharlin, Mario Costa Sousa, and Lisa Streit. 2006. The 3D Tractus: A Three-Dimensional Drawing Board. In Proceedings of the First IEEE International Workshop on Horizontal Interactive HumanComputer Systems (TABLETOP '06). 169--176. http://dx.doi.org/10.1109/TABLETOP.2006.33","paperID":"None"},{"content":"Yunjin Lee, Yongjin Kim, Henry Kang, and Seungyong Lee. 2013. Binocular depth perception of stereoscopic 3D line drawings. In Proceedings of the ACM Symposium on Applied Perception (SAP '13). 31--34. http://doi.acm.org/10.1145/2492494.2492513","paperID":"None"},{"content":"Lenny Lipton. 1982. Foundations of the Stereoscopic Cinema: A Study in Depth. Van Nostrand Reinhold Inc.","paperID":"None"},{"content":"Chun-Wei Liu, Tz-Huan Huang, Ming-Hsu Chang, KenYi Lee, Chia-Kai Liang, and Yung-Yu Chuang. 2011. 3D cinematography principles and their applications to stereoscopic media processing. In Proceedings of the 19th ACM international conference on Multimedia (MM '11). 253--262. http://doi.acm.org/10.1145/2072298.2072332","paperID":"None"},{"content":"Xueting Liu, Xiangyu Mao, Xuan Yang, Linling Zhang, and Tien-Tsin Wong. 2013. Stereoscopizing cel animations. ACM Trans. Graph. 32, 6, Article 223 (November 2013), 10 pages. http://doi.acm.org/10.1145/2508363.2508396","paperID":"None"},{"content":"Wan-Yen Lo, Jeroen van Baar, Claude Knaus, Matthias Zwicker, and Markus Gross. 2010. Stereoscopic 3D copy & paste. In ACM SIGGRAPH Asia 2010 papers (SIGGRAPH ASIA '10). Article 147, 10 pages. http://doi.acm.org/10.1145/1866158.1866173","paperID":"None"},{"content":"Making Anaglyph Images in Adobe Photoshop. Retrieved September 2, 2015. http://www.scec.org/geowall/makeanaglyph.html","paperID":"None"},{"content":"Bernard Mendiburu. 2009. 3D Movie Making: Stereoscopic Digital Cinema from Script to Screen. Focal Press.","paperID":"None"},{"content":"Bernard Mendiburu. 2011. 3D TV and 3D Cinema: tools and processes for creative stereoscopy. Focal Press.","paperID":"None"},{"content":"Luke Olsen, Faramarz F. Samavati, Mario Costa Sousa, and Joaquim A. Jorge. 2009. Sketch-based modeling: A survey. Computers & Graphics, 33(1), 85--103. http://dx.doi.org/10.1016/j.cag.2008.09.013","paperID":"None"},{"content":"Marcy Page (Producer) and Munro Ferguson (Director). Animation. 2003. Falling in Love Again (3D). Canada. National Film Board.","paperID":"None"},{"content":"Adrian Pennington and Carolyn Giardina. 2012. Exploring 3D: The New Grammar of Stereoscopic Filmmaking. Focal Press.","paperID":"None"},{"content":"Daniel J. Rea, Takeo Igarashi, and James E. Young. 2014. PaintBoard: prototyping interactive character behaviors by digitally painting storyboards. In Proceedings of the second international conference on Humanagent interaction (HAI '14). 315--322. http://doi.acm.org/10.1145/2658861.2658886","paperID":"None"},{"content":"Alec Rivers, Takeo Igarashi, and Frédo Durand. 2010. 2.5D cartoon models. In ACM SIGGRAPH 2010 papers (SIGGRAPH '10), Article 59, 7 pages. http://doi.acm.org/10.1145/1833349.1778796","paperID":"None"},{"content":"Barbara Robertson. 2008. Rethinking Moviemaking. Computer Graphics World 31(11).","paperID":"None"},{"content":"SANDDE. 2015. Retrieved September 2, 2015 from http://www.sandde.com","paperID":"None"},{"content":"Ryan Schmidt, Azam Khan, Karan Singh, and Gord Kurtenbach. 2009. Analytic drawing of 3D scaffolds. ACM Trans. Graph. 28, 5, Article 149 (December 2009), 10 pages. http://doi.acm.org/10.1145/1618452.1618495","paperID":"None"},{"content":"Ivan E. Sutherland. 1963. Sketchpad: a man-machine graphical communication system. In Proceedings of the May 21--23, 1963, spring joint computer conference (AFIPS '63 (Spring)). 329--346. http://doi.acm.org/10.1145/1461551.1461591","paperID":"None"},{"content":"Osama Tolba, Julie Dorsey, and Leonard McMillan. 1999. Sketching with projective 2D strokes. In Proceedings of the 12th annual ACM symposium on User interface software and technology (UIST '99). 149--157. http://doi.acm.org/10.1145/320719.322596","paperID":"None"},{"content":"Min Xin, Ehud Sharlin, and Mario Costa Sousa. 2008. Napkin sketch: handheld mixed reality 3D sketching. In Proceedings of the 2008 ACM symposium on Virtual reality software and technology (VRST '08). 223--226. http://doi.acm.org/10.1145/1450579.1450627","paperID":"None"},{"content":"Baoxuan Xu, William Chang, Alla Sheffer, Adrien Bousseau, James McCrae, and Karan Singh. 2014. True2Form: 3D curve networks from 2D sketches via selective regularization. ACM Trans. Graph. 33, 4, Article 131 (July 2014), 13 pages. http://doi.acm.org/10.1145/2601097.2601128","paperID":"None"},{"content":"Ray Zone. 2007. Stereoscopic cinema & the origins of 3D film. The University Press of Kentucky.","paperID":"None"},{"content":"Susan Zwerman and Jeffrey A. Okun. 2014. The VES Handbook of Visual Effects: Industry Standard VFX Practices and Procedures, Focal Press.","paperID":"None"}],"abstract":"We present Storeoboard, a system for stereo-cinematic conceptualization, via storyboard sketching directly in stereo. The resurgence of stereoscopic media has motivated filmmakers to evolve a new stereo-cinematic vocabulary, as many principles for stereo 3D film are unique. Concepts like plane separation, parallax position, and depth budgets are missing from early planning due to the 2D nature of existing storyboards. Storeoboard is the first of its kind, allowing filmmakers to explore, experiment and conceptualize ideas in stereo early in the film pipeline, develop new stereo-cinematic constructs and foresee potential difficulties. Storeoboard is the design outcome of interviews and field work with directors, stereographers, and storyboard artists. We present our design guidelines and implementation of a tool combining stereo-sketching, depth manipulations and storyboard features into a coherent and novel workflow. We report on feedback from storyboard artists, industry professionals and the director of a live action, feature film on which Storeoboard was deployed.","title":"Storeoboard: Sketching Stereoscopic Storyboards","filename":"CHI16/p4587","authors":["Rorik Henrikson","Bruno De Araujo","Fanny Chevalier","Karan Singh","Ravin Balakrishnan"],"conference":"CHI '16"}