{"paperId":2858454,"citation":[],"abstract":"As technology is increasingly integrated into the classroom, understanding the facilitators and barriers for deployment becomes an important part of the process. While systems that employ traditional WIMP-based interfaces have a well-established body of work describing their integration into classroom environments, more novel technologies generally lack such a foundation to guide their advancement. In this paper we present Robo-Tangible Activities for Geometry (rTAG), a tangible learning environment that utilizes a teachable agent framing, together with a physical robotic agent. We describe its deployment in a school environment, qualitatively analyzing how teachers chose to orchestrate its use, the value they saw in it, and the barriers they faced while organizing the sessions with their students. Based on this analysis, we extract four recommendations that aid in designing and deploying systems that make use of affordances that are similar to those of the rTAG system.","reference":[{"content":"Abdulkareem E. S. Al-Alwani. 2005. Barriers to integrating information technology in Saudi Arabia science education.","paperID":"None"},{"content":"Sasha Barab, Michael Thomas, Tyler Dodge, Robert Carteaux, and Hakan Tuzun. 2005. Making learning fun: Quest Atlantis, a game without guns. Educational Technology Research and Development 53, 1: 86--107.","paperID":"None"},{"content":"Becta. 2004. A review of the research literature on barriers to the uptake of ICT by teachers: British Educational Communications and Technology Agency (Becta). June.","paperID":"None"},{"content":"Khalid Abdullah Bingimlas. 2009. Barriers to the successful integration of ICT in teaching and learning environments: A review of the literature. Eurasia Journal of Mathematics, Science & Technology Education 5, 3: 235--245.","paperID":"None"},{"content":"Gautam Biswas, Krittaya Leelawong, Daniel Schwartz, Nancy Vye, and V-TAG. 2005. Learning by teaching: A new agent paradigm for educational software. Applied Artificial Intelligence 19, 3--4: 363--392.","paperID":"None"},{"content":"John Seely Brown and Richard Adler. 2008. Mind on Fire: Open education, the long tail and Learning 2.0. Educause Review 43, 1: 16--32.","paperID":"None"},{"content":"Catherine C. Chase, Doris B. Chin, Marily A. Oppezzo, and Daniel L. Schwartz. 2009. Teachable Agents and the Protégé Effect: Increasing the Effort Towards Learning. Journal of Science Education and Technology 18, 4: 334--352.","paperID":"None"},{"content":"Common Core State Standards Initiative. 2010. Common core state standards for English language arts & literacy in history/social studies, science, and technical subjects. Retrieved Sept. 25, 2015 from http://www.corestandards.org/assets/CCSSI_ELA%20Standards.pdf","paperID":"None"},{"content":"Peggy A. Ertmer. 1999. Addressing first-and second order barriers to change: Strategies for technology integration. Educational Technology Research and Development 47, 4: 47--61.","paperID":"None"},{"content":"Lucinda Gray, Nina Thomas, Laurie Lewis, and Peter Tice. 2010. Teachers' use of educational technology in US public schools, 2009: First look. National Center for Education Statistics.","paperID":"None"},{"content":"Margarete Grimus. 2000. ICT and multimedia in the primary school. 16th conference on educational uses of information and communication technologies, 21--25.","paperID":"None"},{"content":"Gillian R. Hayes, Lamar M. Gardere, Gregory D. Abowd, and Khai N. Truong. 2008. CareLog: a selective archiving tool for behavior management in schools. Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems CHI '08: 685--694.","paperID":"None"},{"content":"Khe Foon Hew and Thomas Brush. 2007. Integrating technology into K-12 teaching and learning: Current knowledge gaps and recommendations for future research. Educational Technology Research and Development 55, 3: 223--252.","paperID":"None"},{"content":"Deanna Hood, Séverin Lemaignan, and Pierre Dillenbourg. 2015. When Children Teach a Robot to Write: An Autonomous Teachable Humanoid Which Uses Simulated Handwriting. ACM Press, 83--90.","paperID":"None"},{"content":"Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. Proceedings of the ACM SIGCHI Conference, 234--241.","paperID":"None"},{"content":"Takayuki Kanda and Rumi Sato. 2007. A two-month field trial in an elementary school for long-term human-robot interaction. Robotics, IEEE Transactions on 23, 5: 962--971.","paperID":"None"},{"content":"Ahmed Kharrufa, Madeline Balaam, and Phil Heslop. 2013. Tables in the wild: lessons learned from a largescale multi-tabletop deployment. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1021--1030.","paperID":"None"},{"content":"Krittaya Leelawong and Gautam Biswas. 2008. Designing learning by teaching agents: The Betty's Brain system. International journal of artificial intelligence in education 18, 3: 181--208.","paperID":"None"},{"content":"Iolanda Leite, Samuel Mascarenhas, André Pereira, Carlos Martinho, Rui Prada, and Ana Paiva. 2010. \"Why Can't We Be Friends?\" An Empathic Game Companion for Long-Term Interaction. Intelligent Virtual Agents: 315--321.","paperID":"None"},{"content":"Michelle Lui, Alex C. Kuhn, Alisa Acosta, Chris Quintana, and James D. Slotta. 2014. Supporting learners in collecting and exploring data from immersive simulations in collective inquiry. ACM Press, 2103--2112.","paperID":"None"},{"content":"Noboru Matsuda, William W. Cohen, Jonathan Sewall, Gustavo Lacerda, and Kenneth R. Koedinger. 2007. Predicting students' performance with simstudent: Learning cognitive skills from observation. FRONTIERS IN ARTIFICIAL INTELLIGENCE AND APPLICATIONS 158: 467.","paperID":"None"},{"content":"Tom Moher. 2006. Embedded phenomena: supporting science learning with classroom-sized distributed simulations. Proceedings of the SIGCHI conference on human factors in computing systems, 691--700.","paperID":"None"},{"content":"Kasia Muldner, Victor Girotto, Cecil Lozano, Winslow Burleson, and Erin Walker. 2014. The Impact of a Social Robot's Attributions for Success and Failure in a Teachable Agent Framework Tangible Activities for Geometry (TAG). International Conference of the Learning Sciences.","paperID":"None"},{"content":"Kasia Muldner, Cecil Lozano, Victor Girotto, Winslow Burleson, and Erin Walker. 2013. Designing a Tangible Learning Environment with a Teachable Agent. Artificial Intelligence in Education, 299--308.","paperID":"None"},{"content":"Shazia Mumtaz. 2000. Factors affecting teachers' use of information and communications technology: a review of the literature. Journal of Information Techology for Teacher Education 9, 3: 319--342.","paperID":"None"},{"content":"Seymour Papert. 1980. Mindstorms: Computers, children, and powerful ideas. NY: Basic Books.","paperID":"None"},{"content":"Lena Pareto, Tobias Arvemo, Ylva Dahl, Magnus Haake, and Agneta Gulz. 2011. A teachable-agent arithmetic game's effects on mathematics understanding, attitude and self-efficacy. Artificial Intelligence in Education, 247--255.","paperID":"None"},{"content":"Rolf Ploetzner, Pierre Dillenbourg, Michael Preier, and David Traum. 1999. Learning by explaining to oneself and to others. Collaborative learning: Cognitive and computational approaches, 103--121.","paperID":"None"},{"content":"Erika Shehan Poole, Andrew D Miller, Yan Xu, Elsa Eiriksdottir, Richard Catrambone, and Elizabeth D Mynatt. 2011. The Place for Ubiquitous Computing in Schools: Lessons Learned from a School-based Intervention for Youth Physical Activity. Proceedings of the 13th International Conference on Ubiquitous Computing: 395--404.","paperID":"None"},{"content":"Frederick Reif and Lisa A. Scott. 1999. Teaching scientific thinking skills: Students and computers coaching each other. American Journal of Physics 67, 9: 819--831.","paperID":"None"},{"content":"Rod D. Roscoe and Michelene T. H. Chi. 2007. Understanding tutor learning: Knowledge-building and knowledge-telling in peer tutors' explanations and questions. Review of Educational Research 77, 4: 534--547.","paperID":"None"},{"content":"Martin Saerbeck, Tom Schut, Cristoph Bartneck, and Maddy D. Janse. 2010. Expressive robots in education: varying the degree of social supportive behavior of a robotic tutor. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1613--1622.","paperID":"None"},{"content":"Rana M. Tamim, Robert M. Bernard, Eugene Borokhovskim Philip C. Abrami, and Richard F. Schmid. 2011. What forty years of research says about the impact of technology on learning a second-order meta-analysis and validation study. Review of Educational Research 81, 1: 4--28.","paperID":"None"},{"content":"David R. Thomas. 2006. A General Inductive Approach for Analyzing Qualitative Evaluation Data. American Journal of Evaluation 27, 2: 237--246.","paperID":"None"},{"content":"Kurt Vanlehn. 2006. The Behavior of Tutoring Systems. International journal of artificial intelligence in education 16, 3: 227--265.","paperID":"None"},{"content":"Angela F. L. Wong, Choon-Lang Quek, Shanti Divaharan, Woon-Chia Liu, Jarina Peer, and Michael D. Williams. 2006. Singapore students' and teachers' perceptions of computer-supported project work classroom learning environments. Journal of Research on Technology in Education 38, 4: 449--479.","paperID":"None"},{"content":"Elizabeth Forward lab enables teachers to use technical tactic dubbed embodied learning. Retrieved Sept. 25, 2015 from http://triblive.com/neighborhoods/257556374/students-learning-tactic-elizabeth-forward-gamesmallab-eighth-madison-arizona","paperID":"None"}],"title":"Lessons Learned from In-School Use of rTAG: A Robo-Tangible Learning Environment","filename":"CHI16/p919","authors":["Victor Girotto","Cecil Lozano","Kasia Muldner","Winslow Burleson","Erin Walker"],"conference":"CHI '16"}