{"paperId":2858209,"citation":[],"reference":[{"content":"2015. Impinj Far Field Antenna Datasheets. (2015). https://support.impinj.com/hc/en-us/article_attachments/200774708/IPJ-A1000-A1001-USA_ Antenna_Spec.pdf","paperID":"None"},{"content":"2015. Impinj Speedway Reader Product Brief Datasheet. (2015). https://support.impinj.com/hc/en-us/article_attachments/202942578/Impinj_ SpeedwayReaders_ProductBrief_080715.pdf","paperID":"None"},{"content":"2015. Kinect for Windows. (sep 2015). https://dev.windows.com/en-us/kinect","paperID":"None"},{"content":"Samer Al Moubayed, Jonas Beskow, Gabriel Skantze, and Björn Granström. 2012. Furhat: a back-projected human-like robot head for multiparty human-machine interaction. In Cognitive Behavioural Systems. Springer, 114--130. DOI: http://dx.doi.org/10.1007/978-3-642-34584-5_9","paperID":"None"},{"content":"Samer Al Moubayed and Jill Lehman. 2015. Regulating Turn-Taking in Multi-child Spoken Interaction. In Intelligent Virtual Agents. Springer, 363--374. DOI: http://dx.doi.org/10.1007/978-3-319-21996-7_40","paperID":"None"},{"content":"Francesco Cafaro, Alessandro Panella, Leilah Lyons, Jessica Roberts, and Josh Radinsky. 2013. I See You There!: Developing Identity-preserving Embodied Interaction for Museum Exhibits. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1911--1920. DOI: http://dx.doi.org/10.1145/2470654.2466252","paperID":"None"},{"content":"John C Curlander and Robert N McDonough. 1991. Synthetic aperture radar. John Wiley & Sons.","paperID":"None"},{"content":"T. Deyle, H. Nguyen, M. Reynolds, and C.C. Kemp. 2009. RF vision: RFID receive signal strength indicator (RSSI) images for sensor fusion and mobile manipulation. In Intelligent Robots and Systems, 2009. IROS 2009. IEEE/RSJ International Conference on. 5553--5560. DOI: http://dx.doi.org/10.1109/IROS.2009.5354047","paperID":"None"},{"content":"Federal Communication Commission (FCC). 2011. Title 47: Telecommunication, Part 15 Radio Frequency Devices. www.fcc.gov. (January, 31 2011). http://www.fcc.gov/","paperID":"None"},{"content":"M. Goller, C. Feichtenhofer, and A. Pinz. 2014. Fusing RFID and computer vision for probabilistic tag localization. In RFID (IEEE RFID), 2014 IEEE International Conference on. 89--96. DOI: http://dx.doi.org/10.1109/RFID.2014.6810717","paperID":"None"},{"content":"W. Gueaieb and Md.S. Miah. 2008. An Intelligent Mobile Robot Navigation Technique Using RFID Technology. Instrumentation and Measurement, IEEE Transactions on 57, 9 (Sept 2008), 1908--1917. DOI: http://dx.doi.org/10.1109/TIM.2008.919902","paperID":"None"},{"content":"D. Hahnel, W. Burgard, D. Fox, K. Fishkin, and M. Philipose. 2004. Mapping and localization with RFID technology. In Robotics and Automation, 2004. Proceedings. ICRA '04. 2004 IEEE International Conference on, Vol. 1. 1015--1020 Vol.1. DOI: http://dx.doi.org/10.1109/ROBOT.2004.1307283","paperID":"None"},{"content":"Cory Hekimian-Williams, Brandon Grant, Xiuwen Liu, Zhenghao Zhang, and Piyush Kumar. Accurate localization of RFID tags using phase difference. In RFID, 2010 IEEE International Conference on. http://dx.doi.org/10.1109/RFID.2010.5467268","paperID":"None"},{"content":"Jeffrey Hightower, Roy Want, and Gaetano Borriello. 2000. SpotON: An indoor 3D location sensing technology based on RF signal strength. UW CSE 00-02-02, University of Washington, Department of Computer Science and Engineering, Seattle, WA 1 (2000).","paperID":"None"},{"content":"Sherry Hsi and Holly Fait. 2005. RFID Enhances Visitors' Museum Experience at the Exploratorium. Commun. ACM 48, 9 (Sept. 2005), 60--65. DOI: http://dx.doi.org/10.1145/1081992.1082021","paperID":"None"},{"content":"Hanchuan Li, Can Ye, and Alanson P. Sample. 2015. IDSense: A Human Object Interaction Detection System Based on Passive UHF RFID. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2555--2564. DOI: http://dx.doi.org/10.1145/2702123.2702178","paperID":"None"},{"content":"Hui Liu, H. Darabi, P. Banerjee, and Jing Liu. 2007. Survey of Wireless Indoor Positioning Techniques and Systems. Systems, Man, and Cybernetics, Part C: Applications and Reviews, IEEE Transactions on 37, 6 (nov. 2007), 1067--1080. DOI: http://dx.doi.org/10.1109/TSMCC.2007.905750","paperID":"None"},{"content":"R. Miesen, F. Kirsch, and M. Vossiek. 2013. UHF RFID Localization Based on Synthetic Apertures. Automation Science and Engineering, IEEE Transactions on 10, 3 (July 2013), 807--815. DOI: http://dx.doi.org/10.1109/TASE.2012.2224656","paperID":"None"},{"content":"L.M. Ni, Yunhao Liu, Yiu Cho Lau, and A.P. Patil. 2003. LANDMARC: indoor location sensing using active RFID. In Pervasive Computing and Communications, 2003. (PerCom 2003). Proceedings of the First IEEE International Conference on. 407--415. DOI: http://dx.doi.org/10.1109/PERCOM.2003.1192765","paperID":"None"},{"content":"P.V. Nikitin, R. Martinez, S. Ramamurthy, H. Leland, G. Spiess, and K.V.S. Rao. 2010. Phase based spatial identification of UHF RFID tags. In RFID, 2010 IEEE International Conference on. 102--109. DOI: http://dx.doi.org/10.1109/RFID.2010.5467253","paperID":"None"},{"content":"Sunhong Park and S. Hashimoto. 2009. Autonomous Mobile Robot Navigation Using Passive RFID in Indoor Environment. Industrial Electronics, IEEE Transactions on 56, 7 (July 2009), 2366--2373. DOI: http://dx.doi.org/10.1109/TIE.2009.2013690","paperID":"None"},{"content":"Patrick J. Grother; George W. Quinn; P J. Phillips;. 2010. Report on the Evaluation of 2D Still-Image Face Recognition Algorithms. Technical Report. National Institute of Standards and Technology. http://www.nist.gov/manuscript-publication-search.cfm?pub_id=905968","paperID":"None"},{"content":"Mahsan Rofouei, Andrew Wilson, A.J. Brush, and Stewart Tansley. 2012. Your Phone or Mine?: Fusing Body, Touch and Device Sensing for Multi-user Device-display Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1915--1918. DOI: http://dx.doi.org/10.1145/2207676.2208332","paperID":"None"},{"content":"S. Sarkka, V. Viikari, M. Huusko, and K. Jaakkola. 2011. Phase-Based UHF RFID Tracking with Non-Linear Kalman Filtering and Smoothing. Sensors Journal, IEEE PP, 99 (2011), 1. DOI: http://dx.doi.org/10.1109/JSEN.2011.2164062","paperID":"None"},{"content":"V. Cadenat T. Germa, F. Lerasle N. Ouadah. 2010. Vision and RFID data fusion for tracking people in crowds by a mobile robot. Computer Vision and Image Understanding 114, Issue 6 (jun 2010), Pages 641651. DOI: http://dx.doi.org/10.1016/j.cviu.2010.01.008","paperID":"None"},{"content":"Y. Taigman, Ming Yang, M. Ranzato, and L. Wolf. 2014. DeepFace: Closing the Gap to Human-Level Performance in Face Verification. In Computer Vision and Pattern Recognition (CVPR), 2014 IEEE Conference on. 1701--1708. DOI: http://dx.doi.org/10.1109/CVPR.2014.220","paperID":"None"},{"content":"Jue Wang and Dina Katabi. 2013. Dude, Where's My Card?: RFID Positioning That Works with Multipath and Non-line of Sight. In Proceedings of the ACM SIGCOMM 2013 Conference on SIGCOMM (SIGCOMM '13). ACM, NY, NY, USA, 51--62. DOI:http://dx.doi.org/10.1145/2486001.2486029","paperID":"None"},{"content":"Jue Wang, Deepak Vasisht, and Dina Katabi. 2014. RF-IDraw: Virtual Touch Screen in the Air Using RF Signals. SIGCOMM Comput. Commun. Rev. 44, 4 (Aug. 2014), 235--246. DOI: http://dx.doi.org/10.1145/2740070.2626330","paperID":"None"},{"content":"Jie Xiong and Kyle Jamieson. 2013. ArrayTrack: A Fine-Grained Indoor Location System.. In NSDI. 71--84. http://dl.acm.org/citation.cfm?id=2482635","paperID":"None"},{"content":"Lei Yang, Yekui Chen, Xiang-Yang Li, Chaowei Xiao, Mo Li, and Yunhao Liu. 2014. Tagoram: Real-time Tracking of Mobile RFID Tags to High Precision Using COTS Devices. In Proceedings of the 20th Annual International Conference on Mobile Computing and Networking (MobiCom '14). ACM, NY, NY, USA, 237--248. DOI: http://dx.doi.org/10.1145/2639108.2639111","paperID":"None"}],"abstract":"Technologies that allow autonomous robots and computer systems to quickly recognize and interact with individuals in a group setting has the potential to enable a wide range of personalized experiences. However, existing solutions fail to both identify and locate individuals with enough speed to enable seamless interactions in very dynamic environments that require fast, implicit, non-intrusive, and ubiquitous recognition of users. In this work, we present a hybrid computer vision and RFID system that uses a novel reverse synthetic aperture technique to recover the relative motion paths of an RFID tags worn by people and correlate that to physical motion paths of individuals as measured with a 3D depth camera. Results show that our real-time system is capable of simultaneously recognizing and correctly assigning IDs to individuals within 4 seconds with 96.6% accuracy and groups of five people in 7 seconds with 95% accuracy. In order to test the effectiveness of this approach in realistic scenarios, groups of five participants play an interactive quiz game with an autonomous robot, resulting in an ID assignment accuracy of 93.3%.","title":"ID-Match: A Hybrid Computer Vision and RFID System for Recognizing Individuals in Groups","filename":"CHI16/p4933","authors":["Hanchuan Li","Peijin Zhang","Samer Al Moubayed","Shwetak N. Patel","Alanson P. Sample"],"conference":"CHI '16"}