{"paperId":2858590,"citation":[],"abstract":"Much attention has focused on the lack of diversity in access and participation in digital media available to youth. Far less attention has been paid to the diversity of youth creators and the content that is produced by youth. We examined the diversity of project creators, content, and comments in one of the largest youth programming sites called Scratch (scratch.mit.edu), with over 7 million registered members between ages 6-16, over 10 million posted projects and 16 million comments. We used keyword and webcrawler searches to reveal that only a small number of users (<.01%) self-disclosed their racial and ethnic identities. Case studies further illuminated how project designs and comments delved into race, provided cultural critique or addressed racial harassment. In the discussion, we address these blind spots of diversity in massive online DIY youth communities, discuss methodological limitations, and provide recommendations for future directions in supporting diversity.","reference":[{"content":"Rebecca W. Black. 2008. Adolescents and online fan fiction. Peter Lang Press.","paperID":"None"},{"content":"Karen Brennan, Amanda Valverde, Joe Prempeh, Ricarose Roque, and Michelle Chung. 2011. More than code: The significance of social interactions in young people's development as interactive media creators. In Proceedings of World Conference on Educational Multimedia, Hypermedia and Telecommunications (EdMedia'11), 2147--2156.","paperID":"None"},{"content":"Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. 2008. The LilyPad Arduino: using computational textiles to investigate engagement, aesthetics, and diversity in computer science education. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI'08), 423--432.","paperID":"None"},{"content":"Quinn Burke and Yasmin B. Kafai. 2014. A decade of programming games for learning: From tools to communities. In The Handbook of Digital Games: Institute of Electrical and Electronics Engineers (IEEE), Marios C. Angelides and Harry Agius (eds.). John Wiley & Sons, New York, NY, 689--709.","paperID":"None"},{"content":"Joanne Cohoon and William Aspray. 2006. Women and information technology: Research on underrepresentation. MIT Press.","paperID":"None"},{"content":"Brady A. Curlew. 2005. Liberal Sims: Simulated difference and the commodity of social diversity. In Proceedings of the 2005 Digital Games Research Conference (DiGRA), 1--7.","paperID":"None"},{"content":"Betsy DiSalvo, Mark Guzdial, Charles Meadows, Ken Perry, Tom McKlin, and Amy Bruckman. 2013. Workifying games: successfully engaging African American gamers with computer science. In Proceeding of the 44th ACM Technical Symposium on Computer Science Education (SIGSCE'13), 317322.","paperID":"None"},{"content":"Anna Everett and S. Craig Watkins. 2008. The power of play: The portrayal and performance of race in video games. In The ecology of games: Connecting youth, games, and learning, Katie Salen (ed.). The John D. and Catherine T. MacArthur Foundation Series on Digital Media and Learning. MIT Press, Cambridge, MA, 141--166.","paperID":"None"},{"content":"Deborah A. Fields, Michael Giang, and Yasmin B. Kafai 2013. Understanding Collaborative Practices in the Scratch Online Community: Patterns of Participation among Youth Designers. In Proceedings of the 10th International Conference on Computersupported Collaborative Learning (CSCL '13), 200208.","paperID":"None"},{"content":"Deborah A. Fields, Michael Giang, and Yasmin Kafai. 2014. Programming in the wild: trends in youth computational participation in the online scratch community. In Proceedings of the 9th workshop in primary and secondary computing education (WiPSCE'14), 2--11.","paperID":"None"},{"content":"Deborah A. Fields, Yasmin Kafai and Michael Giang. 2016. Coding by Choice: A Transitional Analysis of Social Participation Patterns and Programming Contributions in the Online Scratch Community. In Mass Collaboration and Education, Ulrike Cress, Johannes J. Moskaliuk & Heisawn Jeong (eds.), Springer, 213--244.","paperID":"None"},{"content":"Deborah A. Fields, Katarina Pantic, and Yasmin B. Kafai. 2015. \"I have a tutorial for this\": the language of online peer support in the scratch programming community. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC'2015), 229--238.","paperID":"None"},{"content":"James Paul Gee. 2014. What video games have to teach us about learning and literacy. St. Martin's Press.","paperID":"None"},{"content":"Amy Golod. 2015. No Boys Allowed: Tackling the Coding Gender Gap. April 2015. US News and World Report, Retrieved August 20, 2015 from: http://www.usnews.com/news/stemsolutions/articles/2015/04/22/girls-who-code-takes-ongender-gap-in-computer-science","paperID":"None"},{"content":"Joanna Goode. 2010. The digital identity divide: how technology knowledge impacts college students. New media & society 12, 3 (May 2010), 497--513.","paperID":"None"},{"content":"Kishonna L. Gray. 2012. Intersecting oppressions and online communities: examining the experiences of women of color in xbox live. Information, Communication & Society 15, 3 (March 2012), 411--428.","paperID":"None"},{"content":"Sarah M. Grimes and Deborah A. Fields. 2012. Kids online: A new research agenda for understanding social networking forums. The Joan Ganz Cooney Center at Sesame Workshop, 1--69.","paperID":"None"},{"content":"Mark Guzdial, Barbara Ericson, Tom Mcklin, and Shelly Engelman. 2014. Georgia computes! an intervention in a US state, with formal and informal education in a policy context. ACM Transactions on Computing Education (TOCE) 14, 2 (June 2014), 1--13.","paperID":"None"},{"content":"Eszter Hargittai and Gina Walejko. The participation divide: content creation and sharing in the digital age. Information, Community and Society 11, 2 (March 2008), 239--256.","paperID":"None"},{"content":"Hour of Code. Retrieved September 1, 2015 from https://hourofcode.com/us","paperID":"None"},{"content":"Mizuko Ito, Heather Horst, Matteo Bittanti, Danah Boyd, Becky Herr-Stephenson, Patricia G. Lange, C. J. Pascoe, and Laura Robinson. 2008. Living and Learning with New Media: Summary of Findings from the Digital Youth Project. John D. and Catherine T. MacArthur Foundation.","paperID":"None"},{"content":"Henry Jenkins. 2006. Fans, bloggers, and gamers: Exploring participatory culture. NYU Press.","paperID":"None"},{"content":"Stacy Jones and Jaclyn Trop. 2015. See how the big tech companies compare on employee diversity. Fortune Magazine. (July 2015). Retrieved September 2, 2015 from: http://fortune.com/2015/07/30/techcompanies-diveristy/","paperID":"None"},{"content":"Yasmin B. Kafai. 1995. Minds in play: Computer game design as a context for children's learning. Routledge.","paperID":"None"},{"content":"Yasmin B. Kafai and Quinn Burke. 2014. Connected code: Why children need to learn programming. MIT Press.","paperID":"None"},{"content":"Yasmin B. Kafai, Melissa S. Cook, and Deborah A. Fields. 2010. \"Blacks Deserve Bodies Too!\": Design and Discussion About Diversity and Race in a Tween Virtual World. Games and Culture 5, 1 (January 2010), 43--63.","paperID":"None"},{"content":"Yasmin B. Kafai, Deborah A. Fields, and William Q. Burke. 2012. Entering the Clubhouse: Case Studies of Young Programmers. In End-User Computing, Development, and Software Engineering: New Challenges: New Challenges, Ashish Dwivedi and Steve Clarke (eds.). Information Science Reference, Hershey, PA, 279--294.","paperID":"None"},{"content":"Yasmin B. Kafai, Deborah A. Fields, Ricarose Roque, William Q. Burke, and Andres Monroy-Hernandez. 2012. Collaborative agency in youth online and offline creative production in Scratch. Research and Practice in Technology Enhanced Learning, 7, 2 (July 2012), 63--87.","paperID":"None"},{"content":"Yasmin B. Kafai and Kylie A. Peppler. 2011. Youth, Technology, and DIY: Developing Participatory Competencies in Creative Media Production. Review of Research in Education, 35, 1 (March 2011), 89--119.","paperID":"None"},{"content":"Yasmin B. Kafai and Kristin A. Searle. 2011. Safeguarding Play in Virtual Worlds: Designs and Perspectives on Tween Player Participation in Community Management. International Journal of Learning and Media, 2, 4 (Fall 2010), 1--14.","paperID":"None"},{"content":"Caitlin Kelleher and Randy Pausch. 2005. Lowering the barriers to programming: A taxonomy of programming environments and languages for novice programmers. ACM Computing Surveys (CSUR) 37, 2 (June 2005), 83--137.","paperID":"None"},{"content":"Stacey Kuznetsov, Laura C. Trutoiu, Casey Kute, Iris Howley, Eric Paulos, and Dan Siewiorek. 2011. Breaking boundaries: strategies for mentoring through textile computing workshops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11), 2957--2966.","paperID":"None"},{"content":"Michael Lachney, William Babbitt, and Ron Eglash. Forthcoming. Software Design in the \"Construction Genre\" of Learning Technology: Content Aware Versus Content Agonistic. Computational Culture: A Journal of Software Studies.","paperID":"None"},{"content":"Wendy Lazarus and Laurie Lipper. 2003. The Search for High-quality Online Content for Low-income and Underserved Communities: Evaluating and Producing What's Needed: an Issue Brief and Action Plan with Research Appendices. Children's Partnership. Retrieved July 2, 2015 from http://www.childrenspartnership.org/publications/144","paperID":"None"},{"content":"Jong-Eun Roselyn Lee and Sung Gwan Park. 2011. \"Whose Second Life Is This\"? How Avatar-Based Racial Cues Shape Ethno-Racial Minorities' Perception of Virtual Worlds. Cyberpsychology, Behavior, and Social Networking 14, 11 (November 2011), 637--642.","paperID":"None"},{"content":"Kurt Luther and Amy Bruckman. 2008. Leadership in online creative collaboration. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW'08), 343--352.","paperID":"None"},{"content":"Jane Margolis, Rachel Estrella, Johanna Goode, Jennifer J. Holme and Kim Nao. 2008. Stuck in the shallow end: Race, education, and computing. MIT press.","paperID":"None"},{"content":"Jane Margolis and Allan Fisher. 2003. Unlocking the clubhouse: Women in computing. MIT Press.","paperID":"None"},{"content":"Lisa Nakamura. 1995. Race in/for cyberspace: Identity tourism and racial passing on the Internet. Works and Days 25/26, 13, 1--2 (1995), 181--193.","paperID":"None"},{"content":"Mitchel Resnick, John Maloney, Andrés MonroyHernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner Eric Rosenbaum, Jay Silver, Brian Silverman and Yasmin Kafai. 2009. Scratch: programming for all. Communications of the ACM 52, 11 (November 2009), 60--67.","paperID":"None"},{"content":"Mitchel Resnick and Brian Silverman. 2005. Some reflections on designing construction kits for kids. In Proceedings of the 2005 conference on Interaction design and children (IDC'05), 117--122.","paperID":"None"},{"content":"Gabriela T. Richard. 2014. Supporting visibility and resilience in play: Gender-supportive online gaming communities as a model of identity and confidence building in play and learning. In Identity and Leadership in Virtual Communities: Establishing Credibility and Influence: Establishing Credibility and Influence, Donna J. Hickey and Joe Essid (eds.), IGI Global, 170--186.","paperID":"None"},{"content":"Gabriela T. Richard, Yasmin B. Kafai, Barrie Adleberg and Orkan Telhan. 2015. StitchFest: Diversifying a College Hackathon to Broaden Participation and Perceptions in Computing. In Proceedings of the 46th ACM Technical Symposium on Computer Science Education (SIGSCE'15), 114--119.","paperID":"None"},{"content":"Ricarose Roque, Yasmin Kafai, and Deborah Fields. 2012. From tools to communities: Designs to support online creative collaboration in Scratch. In Proceedings of the 11th International Conference on Interaction Design and Children (IDC'12), 220--223.","paperID":"None"},{"content":"Scratch Statistics. 2015. Retrieved July 1, 2015 from: https://scratch.mit.edu/statistics/","paperID":"None"},{"content":"Brendesha M. Tynes, Adriana J. Umana-Taylor, Chad A. Rose, Johnny Lin, and Carolyn J. Anderson. 2012. Online racial discrimination and the protective function of ethnic identity and self-esteem for African American adolescents. Developmental psychology, 48, 2 (March 2012), 343--355.","paperID":"None"},{"content":"Eric Westervelt. 2015. Disrupting' Tech's Diversity Problem With A Code Camp For Girls Of Color. August 2015. NPR Ed, Retrieved August 30, 2015 from:http://www.npr.org/sections/ed/2015/08/17/43227 8262/hacking-tech-s-diversity-problem-black-girlscode","paperID":"None"},{"content":"Dmitri Williams, Nicole Martins, Mia Consalvo, and James D. Ivory. 2009. The virtual census: Representations of gender, race and age in video games. New Media & Society 11, 5 (August 2009), 815--834.","paperID":"None"}],"title":"Blind Spots in Youth DIY Programming: Examining Diversity in Creators, Content, and Comments within the Scratch Online Community","filename":"CHI16/p1473","authors":["Gabriela T. Richard","Yasmin B. Kafai"],"conference":"CHI '16"}