{"paperId":2858441,"citation":[],"reference":[{"content":"Abboudeh, M. 2014. Palestinian Parametric Patterns {P}3 . Retrieved December 21, 2015, from http://www.muabboudeh.com/palestinian-parametricpatterns/","paperID":"None"},{"content":"Buechley, L., Eisenberg, M., Catchen, J. and Crockett, A. 2008. \"The LilyPad Arduino: Using Computational Textiles to Investigate Engagement, Aesthetics, and Diversity in Computer Science Education\", In Proc. of the SIGCHI on Human factors in Computing Systems (CHI '08), pp. 423--432.","paperID":"None"},{"content":"Buechley. L., and Perner-Wilson, H. 2012. Crafting technology: Reimagining the processes, materials, and cultures of electronics. ACM Trans. Comput.-Hum. Interact. 19, 3, Article 21, October, 21 pages.","paperID":"None"},{"content":"Cane, O., and Hodges, J. 1985. Smocking, Traditional and Modern Approach. B T Batsford Ltd; First edition (August 1985).","paperID":"None"},{"content":"D.dress. (n.d.). Continuum. Retrieved December 21, 2015, from http://www.continuumfashion.com/D.php","paperID":"None"},{"content":"Devendorf, L., and Ryokai, K. 2015. Being the Machine: Reconfiguring Agency and Control in Hybrid Fabrication. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2477--2486.","paperID":"None"},{"content":"Floraine Berthouzoz, Akash Garg, Danny M. Kaufman, Eitan Grinspun, and Maneesh Agrawala. 2013. Parsing sewing patterns into 3D garments. ACM Trans. Graph.","paperID":"None"},{"content":"Gostelow, M. 2003. The Complete Guide to Needlework, Technique and Materials. QUANTUM PUBLISHING (January 1, 2003)","paperID":"None"},{"content":"Hall, M. 2008. Smocks (Shire Library). Shire (March 4, 2008)","paperID":"None"},{"content":"Harel, I., and Papert, S. 1991. Situating Constructionism [first chapter]. In Constructionism: Research Reports and Essays, 1985--1990. Ablex Publishing (January 1, 1991).","paperID":"None"},{"content":"Hudson, S. E. 2014. Printing teddy bears: a technique for 3D printing of soft interactive objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 459--468.","paperID":"None"},{"content":"Ingold, T. 2010. The textility of making. Cambridge Journal of Economics 34, 1 (2010), 91--102.","paperID":"None"},{"content":"Jacobs, J., and Buechley, L. 2013. Codeable objects: computational design and digital fabrication for novice programmers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1589--1598.","paperID":"None"},{"content":"Jacobs, J., Resnick, M., and Buechley, L. 2014. Dresscode: supporting youth in computational design and making. In Proceedings of Constructionism 2014 Conference. Vienna, Austria.","paperID":"None"},{"content":"Jacobs, J., and Zoran, A. 2015. Hybrid Practice in the Kalahari: Design Collaboration through Digital Tools and Hunter-Gatherer Craft. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 619--628.","paperID":"None"},{"content":"Johnson, J. S., Hawley, J. (2004) Technology's impact on creative traditions: Pieceful coexistence in quilting. In Clothing and Textiles Research Journal, 22(1/2), pp. 69--78.","paperID":"None"},{"content":"KINEMATICS. 2013. Nervous System. Retrieved September 5, 2015, from http://n-er-v-o-u-s.com/","paperID":"None"},{"content":"Knyttan. (n.d.). Retrieved September 5, 2015, from http://knyttan.com/","paperID":"None"},{"content":"Lévi-Strauss, C. (1966). The savage mind. Chicago, IL: University of Chicago Pres","paperID":"None"},{"content":"McCullough, M. 1998. Abstracting Craft: The Practiced Digital Hand. The MIT Press.","paperID":"None"},{"content":"Melnikova,R., Ehrmann, A., and Finsterbusch, K. 2014. 3D printing of textilebased structures by Fused Deposition Modelling (FDM) with different polymer materials. IOP Conference Series: Materials Science and Engineering, Volume 62, conference 1.","paperID":"None"},{"content":"Mueller, S., Kruck, B., and Baudisch, P. (2013) \"LaserOrigami: laser-cutting 3D objects\", In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems (CHI '13), pp. 2585--2592.","paperID":"None"},{"content":"Nobuyuki Umetani, Danny M. Kaufman, Takeo Igarashi, and Eitan Grinspun. 2011. Sensitive couture for interactive garment modeling and editing. ACM Trans. Graph. 30, 4, Article 90 (July 2011)","paperID":"None"},{"content":"Oehlberg, L., Willett, W., and Mackay, W. E. 2015. Patterns of Physical Design Remixing in Online Maker Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 639--648.","paperID":"None"},{"content":"Peng, H., Mankoff, J., Hudson, S. E. and McCann, J. 2015. A Layered Fabric 3D Printer for Soft Interactive Objects. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1789--1798.","paperID":"None"},{"content":"Project Jacquard. 2015. Google. Retrieved September 5, 2015, from http://www.google.com/atap/projectjacquard/.","paperID":"None"},{"content":"Reas, C., McWilliams, C., and LUST. 2010. Form and Code: In Design, Art and Architecture, A Guide to Computational Aesthetics. Princeton Architectural Press.","paperID":"None"},{"content":"Resnick, M., and Rosenbaum, E. 2013. DESIGNING FOR TINKERABILITY [Chapter 10]. In Honey, M., and Kanter, D. E. (Eds.) Design, Make, Play: Growing the Next Generation of STEM Innovators (pp. 163181), Routledge; 1st edition (March 15, 2013).","paperID":"None"},{"content":"Ritchie, D., Kejriwal, A. A., and Klemmer, S. R. d.tour: Style-based exploration of design example galleries. In Proc. UIST'11, ACM (2011), 165-174.","paperID":"None"},{"content":"Rosner, D., and Ryokai, K., (2009) \"Reflections on craft: probing the creative process of everyday knitters\", In Proc. of the ACM Conf. on Creativity and Cognition, pp. 195--204.","paperID":"None"},{"content":"Sennet, R. 2008. The Craftsman. New Haven: Yale University Press.","paperID":"None"},{"content":"Serriere, F. 2015, June 23. KnitYak: Custom mathematical knit scarves. Retrieved September 5, 2015, from https://www.kickstarter.com/projects/fbz/knit yak-custom-mathematical-knit-scarves","paperID":"None"},{"content":"Sosanya, O. 2014. 3D Weaver. Retrieved September 5, 2015, from http://www.sosafresh.com/3d-weave","paperID":"None"},{"content":"Torres, C., and Paulos, E. 2015. MetaMorphe: Designing Expressive 3D Models for Digital Fabrication. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15). ACM, NY, NY, USA, 73--82.","paperID":"None"},{"content":"Urquiola, Patricia. 2005. Smock, Sofa. Moroso. Retrieved September 5, 2015, from http://www.moroso.it/catalogo/smockdivani/?lang=en.","paperID":"None"},{"content":"Zoran, A. 2013. Hybrid basketry: interweaving digital practice within contemporary craft. In ACM SIGGRAPH 2013 Art Gallery (SIGGRAPH '13). ACM, NY, NY, USA, 324--331.","paperID":"None"},{"content":"Zoran, A. 2015. Hybrid craft: showcase of physical and digital integration of design and craft skills. In ACM SIGGRAPH Art Gallery (SIGGRAPH '15). ACM, NY, NY, USA, 384--398.","paperID":"None"},{"content":"Zoran, A. and Buechley, L. 2013. Hybrid reAssemblage: An Exploration of Craft, Digital Fabrication and Artifact Uniqueness. Leonardo, Journal of Arts, Sciences and Technology, volume 46, issue 1, February 2013.","paperID":"None"},{"content":"Zoran, A., Shilkrot, R., Nanyakkara, S., and Paradiso, J.A. 2014. The Hybrid Artisans: A Case Study in Smart Tools. ACM Trans. Comput.-Hum. Interact. 21, 3, Article 15 (June 2014), 29 pages.","paperID":"None"}],"abstract":"The digital design space, unlimited by its virtual freedom, differs from traditional craft, which is bounded by a fixed set of given materials. We study how to introduce parametric design tools to craftspersons. Our hypothesis is that the arrangement of parametric design in modular representation, in the form of a catalog, can assist makers unfamiliar with this practice. We evaluate this assumption in the realm of bag design, through a Honeycomb Smocking Pattern Catalog and custom Computer-Aided Smocking (CAS) design software. We describe the technical work and designs made with our tools, present a user study that validates our assumptions, and conclude with ideas for future work developing additional tools to bridge computational design and craft.","title":"The Hybrid Bricolage: Bridging Parametric Design with Craft through Algorithmic Modularity","filename":"CHI16/p5984","authors":["Tamara Anna Efrat","Moran Mizrahi","Amit Zoran"],"conference":"CHI '16"}