{"paperId":2858569,"citation":[],"reference":[{"content":"Alliance for Wireless Power. Technical Specification. 2015. Retrieved September 17, 2015 from http://www.rezence.com/technology/technicalspecification","paperID":"None"},{"content":"Amazon.com, Inc. DiGiYes Ultra Slim Compatible Wireless Charging Receiver Module with Micro USB. 2015. Retrieved September 17, 2015 from http://www.amazon.co.uk/dp/B00HI89O3Q/","paperID":"None"},{"content":"Nilanjan Banerjee, Ahmad Rahmati, Mark D. Corner, Sami Rollins and Lin Zhong. 2007. Users and Batteries: Interactions and Adaptive Energy Management in Mobile Systems. In Proceedings of the 9th ACM International Conference on Ubiquitous Computing (UbiComp '07). 217--234. http://dx.doi.org/10.1007/978--3--540--74853--3_13","paperID":"None"},{"content":"Bell Media. 2014. Battery life trumps all other smartphone features for consumers: survey. Retrieved September 01, 2015 from http://www.ctvnews.ca/scitech/battery-life-trumps-all-other-smartphone-featuresfor-consumers-survey-1.1821084","paperID":"None"},{"content":"Bristol Interaction Group. PowerShake. 2016. Retrieved January 7, 2016 from http://big.cs.bris.ac.uk/projects/powershake","paperID":"None"},{"content":"T. Campi, S. Cruciani, M. Feliziani, and A. Hirata. 2014.Wireless power transfer system applied to an active implantable medical device. In Proceedings of Wireless Power Transfer Conference (WPTC). 134137. http://dx.doi.org/10.1109/WPT.2014.6839612","paperID":"None"},{"content":"J.J. Casanova, Zhen Ning Low and Jenshan Lin. 2009. Design and Optimization of a Class-E Amplifier for a Loosely Coupled Planar Wireless Power System. In IEEE Transactions on Circuits and Systems II. 56, 11. 830--834. http://dx.doi.org/10.1109/TCSII.2009.2032465","paperID":"None"},{"content":"ConsumerScape 360: Wearable Tech Device Adoption Drivers and Privacy Concern - Presentation - 254950. Retrieved September 22, 2015 from http://www.idc.com/getdoc.jsp?containerId=254950","paperID":"None"},{"content":"T. Deyle and M. Reynolds. 2008. PowerPACK: A wireless power distribution system for wearable devices. In Proceedings of the 12th IEEE International Symposium on Wearable Computers (ISWC 2008). 91- 98. http://dx.doi.org/10.1109/ISWC.2008.4911592","paperID":"None"},{"content":"Amandeep Dhir, Puneet Kaur,Nobert Jere and Ibrahim A. Albidewi. 2012. Understanding Mobile Phone Battery - Human Interaction for Developing World A Perspective of Feature Phone Users in Africa. In Proceedings of the 2012 2nd Baltic Congress on Future Internet Communications (BCFIC '12). 127134. http://dx.doi.org/10.1109/BCFIC.2012.6217992","paperID":"None"},{"content":"Etón Corporation. Retrieved September 15, 2015 from http://www.etoncorp.com/en/products","paperID":"None"},{"content":"Denzil Ferreira, Anind K. Dey and Vassilis Kostakos. 2011. Understanding Human-smartphone Concerns: A Study of Battery Life. In Proceedings of the 9th International Conference on Pervasive Computing (Pervasive '11). 19--33. http://dl.acm.org/citation.cfm?id=2021975.2021978","paperID":"None"},{"content":"Denzil Ferreira, Eija Ferreira, Jorge Goncalves, Vassilis Kostakos and Anind K. Dey. 2013. Revisiting Human-Battery Interaction with an Interactive Battery Interface. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13), 563--572. http://doi.acm.org/10.1145/2493432.2493465","paperID":"None"},{"content":"Google Store. Nexus 6. 2016. Retrieved January 7, 2016 from https://store.google.com/product/nexus_6","paperID":"None"},{"content":"GMYLE. Round Qi Wireless Charging Pad. 2015. Retrieved September 17, 2015 from http://www.gmyle.com/collections/wireslesscharger/products/qi1000t2st?variant=968975721","paperID":"None"},{"content":"IEEE. C95.1--2005 IEEE Standard for Safety Levels with Respect to Human Exposure to Radio Frequency Electromagnetic Fields, 3 kHz to 300 GHz. Retrieved September 23, 2015 from https://standards.ieee.org/findstds/standard/C95.12005.html","paperID":"None"},{"content":"Inter IKEA Systems. Wireless Charging: Charge where you are. 2015. Retrieved September 17, 2015 from http://www.ikea.com/gb/en/catalog/categories/departm ents/wireless_charging/","paperID":"None"},{"content":"International Commission on Non-Ionizing Radiation Protection, [ICNIRP]. 1998. Guidelines for limiting exposure to time-varying electric, magnetic, and electromagnetic fields. Health Physics. 74, 4. http://www.icnirp.org/cms/upload/publications/ICNIRPemfgdl.pdf","paperID":"None"},{"content":"Tiina Jaatinen. World's first Lumia wireless-charging trousers. 2014. Retrieved September 15, 2015 from http://lumiaconversations.microsoft.com/2014/06/18/charge-go-first-ever-wireless-charging-trousers-lumiasmartphones/","paperID":"None"},{"content":"Jouya Jadidian and Dina Katabi. 2014. Magnetic MIMO: How to Charge Your Phone in Your Pocket. In Proceedings of the 20th Annual International Conference on Mobile Computing and Networking (MobiCom '14). 495-506. http://doi.acm.org/10.1145/2639108.2639130","paperID":"None"},{"content":"Syed Asim Jalal, Nicholas Gibbins, David Millard, Bashir M. Al-Hashimi and Naif Radi Aljohani. 2014. Evaluating Battery Aging on Mobile Devices. In Proceedings of the 13th International Conference on Mobile and Ubiquitous Multimedia (MUM '14). 216219. http://doi.acm.org/10.1145/2677972.2678005","paperID":"None"},{"content":"Adrian Kingsley-Hughes. Apple Watch: Official battery life data. 2015. Retrieved September 01, 2015 from http://www.zdnet.com/article/apple-watchofficial-battery-data/.","paperID":"None"},{"content":"André Kurs, Aristeidis Karalis, Robert Moffatt, J. D. Joannopoulos, Peter Fisher and Marin Soljačić. 2007. Wireless power transfer via strongly coupled magnetic resonances. Science. 317, 5834. 83-86. http://dx.doi.org/10.1126/science.1143254","paperID":"None"},{"content":"Jaeseong Lee, Yohan Chon and Hojung Cha. 2015. Evaluating Battery Aging on Mobile Devices. In Proceedings of the 52nd Annual Design Automation Conference (DAC '15). 136. 1--6. http://doi.acm.org/10.1145/2744769.2744838","paperID":"None"},{"content":"David Ma. The Juicer: Phone-to-Phone Charging Cable. 2015. Retrieved September 15, 2015 from http://www.indiegogo.com/projects/the-juicer-phoneto-phone-charging-cable","paperID":"None"},{"content":"Grace Metri, Weisong Shi, Monica Brockmeyer and Abhishek Agrawal. 2014. BatteryExtender: An Adaptive User-guided Tool for Power Management of Mobile Devices. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). 33--43. http://doi.acm.org/10.1145/2632048.2632082","paperID":"None"},{"content":"Microsoft. Detailed specifications for the Nokia Portable Wireless Charging Plate. 2015. Retrieved September 15, 2015 from http://www.microsoft.com/en-gb/mobile/accessory/dc50/specifications/","paperID":"None"},{"content":"Jussi Mikkonen, Ramyah Gowrishankar, Miia Oksanen, Harri Raittinen and Arto Kolinummi. 2014. OJAS: Open Source Bi-directional Inductive Power Link. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 1049-1058. http://doi.acm.org/10.1145/2556288.2557041","paperID":"None"},{"content":"Alan Murray. What do consumers want? Better batteries, not wearables. 2015. Retrieved September 01, 2015 from http://fortune.com/2015/01/07/what-doconsumers-want-better-batteries-not-wearables/","paperID":"None"},{"content":"Niccol, A. In Time. 2011.","paperID":"None"},{"content":"Tekla Perry. CES 2013: Share Battery Power Between Mobile Devices. 2013. Retrieved September 08, 2015 from http://spectrum.ieee.org/tech-talk/consumerelectronics/portable-devices/mobile-devices-shareeverything","paperID":"None"},{"content":"Lily Prasuethsut. Best portable chargers: 20 we recommend. Retrieved September 15, 2015 from http://www.techradar.com/news/portabledevices/other-devices/best-portable-chargers-14-werecommend-1178873","paperID":"None"},{"content":"Ahmad Rahmati, Angela Qian, and Lin Zhong. 2007. Understanding Human-Battery Interaction on Mobile Phones. In Proceedings of the 9th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI'07). 265272. http://doi.acm.org/10.1145/1377999.1378017","paperID":"None"},{"content":"James E. Schuessler. Bi-directional wireless charger, US. Patent 20,120,229,071. Filled March 9, 2011, issued September 13, 2012.","paperID":"None"},{"content":"Starbucks Corporation. Powermat Wireless Charging. 2014. Retrieved September 17, 2015 from http://www.starbucks.co.uk/coffeehouse/powermat","paperID":"None"},{"content":"Eberhard Waffenschmidt and Toine Staring. 2009. Limitation of inductive power transfer for consumer applications. In Proceedings European Conference on Power Electronics and Applications (EPE '09). 1--10. http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=5278868","paperID":"None"},{"content":"Wireless Power Consortium. 2013. System Description. Wireless Power Transfer Volume I: Low Power Part 1: Interface Definition. Version 1.1.2. June 2013. Retrieved August 10, 2015 from http://www.wirelesspowerconsortium.com/downloads/wireless-power-specification-part-1.html","paperID":"None"},{"content":"Wireless Power Consortium. Qi. 2015. Retrieved September 17, 2015 from http://www.wirelesspowerconsortium.com/","paperID":"None"},{"content":"Paul Worgan, Lindsay R. Clare, Plamen Proynov, Bernard H. Stark and David Coyle. 2015. Inductive Power Transfer for On-body Sensors. Defining a design space for safe, wirelessly powered on-body health sensors. In Proceedings of Pervasive Computing Technologies for Healthcare (Pervasive Health '15). http://dx.doi.org/10.4108/icst.pervasivehealth.2015.259","paperID":"None"},{"content":"Hatem Zeine. 2012. Wireless power transmission system, US. Patent 8,159,364. Filled August 23, 2010, issued April 17, 2012.","paperID":"None"}],"abstract":"Current devices have limited battery life, typically lasting less than one day. This can lead to situations where critical tasks, such as making an emergency phone call, are not possible. Other devices, supporting different functionality, may have sufficient battery life to enable this task. We present PowerShake; an exploration of power as a shareable commodity between mobile (and wearable) devices. PowerShake enables users to control the balance of power levels in their own devices (intra-personal transactions) and to trade power with others (inter-personal transactions) according to their ongoing usage requirements. This paper demonstrates Wireless Power Transfer (WPT) between mobile devices. PowerShake is: simple to perform on-the-go; supports ongoing/continuous tasks (transferring at ~3.1W); fits in a small form factor; and is compliant with electromagnetic safety guidelines while providing charging efficiency similar to other standards (48.2% vs. 51.2% in Qi). Based on our proposed technical implementation, we run a series of workshops to derive candidate designs for PowerShake enabled devices and interactions, and to bring to light the social implications of power as a tradable asset.","title":"PowerShake: Power Transfer Interactions for Mobile Devices","filename":"CHI16/p4734","authors":["Paul Worgan","Jarrod Knibbe","Mike Fraser","Diego Martinez Plasencia"],"conference":"CHI '16"}