{"paperId":2858205,"abstract":"There are inherent associations between temperature and emotion in language, cognition and subjective experience [22,42]. However, there exists no systematic mapping of thermal feedback to models of emotion that could be used by designers and users to convey a range of emotions in HCI. A common way of classifying emotions and quantifying emotional experience is through ratings along valence and arousal dimensions, originating from Russell's circumplex model [32]. Therefore, the research in this paper mapped subjective ratings of a range of thermal stimuli to the circumplex model to understand the range of emotions that might be conveyed through thermal feedback. However, as the suitability of the model varies depending on the type of emotional stimuli [31], we also compared the goodness of fit of ratings between the circumplex and vector [8,31] models of emotion. The results showed that thermal feedback was interpreted as representing a limited range of emotions concentrated in just two quadrants or categories of the circumplex: high valence, low arousal and low valence, high arousal. Warm stimuli were perceived as more pleasant/positive than cool stimuli and altering either the rate or extent of temperature change affected both valence and arousal axes simultaneously. The results showed a significantly better fit to a vector model than to the circumplex.","citation":[],"reference":[{"content":"Akshita, Harini Sampath, Bipin Indurkhya, Eunhwa Lee, and Yudong Bae. 2015. Towards Multimodal Affective Feedback?: Interaction between Visual and Haptic Modalities. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 2043--2052. http://doi.acm.org/10.1145/2702123.2702288","paperID":"None"},{"content":"Betsy App, Daniel N McIntosh, Catherine L Reed, and Matthew J Hertenstein. 2011. Nonverbal channel use in communication of emotion: how may depend on why. Emotion 11, 3: 603--617. http://doi.org/10.1037/a0023164","paperID":"None"},{"content":"Solomon E Asch. 1946. Forming impressions of personality. Journal of abnormal psychology 41: 258--290. http://doi.org/10.1037/h0060423","paperID":"None"},{"content":"Pascal Belin, Sarah Fillion-Bilodeau, and Frédéric Gosselin. 2008. The Montreal Affective Voices: a validated set of nonverbal affect bursts for research on auditory affective processing. Behavior research methods 40, 2: 531--539. http://doi.org/10.3758/BRM.40.2.531","paperID":"None"},{"content":"John Bowlby. 1969. Attachment and Loss. Hogarth Press, London.","paperID":"None"},{"content":"Margaret Bradley and Peter J Lang. 2007. The International Affective Picture System (IAPS) in the Study of Emotion and Attention. In Handbook of Emotion Elicitation and Assessment, Richard J. Davidson, Paul Ekman and Klaus R. Scherer (eds.). Oxford Press, Oxford.","paperID":"None"},{"content":"Margaret Bradley and Peter Lang. 1999. International Affective Digitized Sounds (IADS): Stimuli, Instruction Manual and Affective Ratings. Gainesville, FL.","paperID":"None"},{"content":"Margaret M Bradley, Mark K Greenwald, Margaret C Petry, and Peter J Lang. 1992. Remembering Pictures?: Pleasure and Arousal in Memory. Journal of Experimental Psychology: Learning, Memory and Cognition 18, 2: 379--390. http://dx.doi.org/10.1037/0278--7393.18.2.379","paperID":"None"},{"content":"Erik Cambria, Andrew Livingstone, and Amir Hussain. 2012. The hourglass of emotions. Cognitive Behavioural Systems 7403 LNCS: 144--157. http://doi.org/10.1007/978--3--642--34584--5_11","paperID":"None"},{"content":"Olivier Collignon, Simon Girard, Frederic Gosselin, Dave Saint-amour, Franco Lepore, and Maryse Lassonde. 2010. Women process multisensory emotion expressions more efficiently than men. Neuropsychologia 48: 220--225. http://doi.org/10.1016/j.neuropsychologia.2009.09.007","paperID":"None"},{"content":"Paul Ekman. 1993. Facial Expression and Emotion. American Psychologist 48, 4: 376--379.","paperID":"None"},{"content":"Susan T. Fiske, Amy J.C. Cuddy, and Peter Glick. 2007. Universal dimensions of social cognition: warmth and competence. Trends in Cognitive Sciences 11, 2: 77--83. http://doi.org/10.1016/j.tics.2006.11.005","paperID":"None"},{"content":"Johnny R J Fontaine, Klaus R. Scherer, Etienne B. Roesch, and Phoebe C. Ellsworth. 2007. The world of emotions is not two-dimensional. Psychological Science 18, 12: 1050--1057. http://doi.org/10.1111/j.1467--9280.2007.02024.x","paperID":"None"},{"content":"Alf Gabrielsson. 2002. Emotion perceived and emotion felt?: same or different? Musicae Scientiae, 2001: 123--147.","paperID":"None"},{"content":"Daniel Gooch and Leon Watts. 2010. Communicating social presence through thermal hugs. Proceedings of Workshop on Social Interaction in Spatially Separated Environments (SISSI '10), 11--19.","paperID":"None"},{"content":"Lincoln Gray, Joseph C Stevens, and Lawrence E Marks. 1982. Thermal Stimulus Thresholds: Sources of variability. Physiology & Behavior 29, 2: 355--360. http://dx.doi.org/10.1016/0031--9384(82)90026--9","paperID":"None"},{"content":"Martin Halvey, Michael Henderson, Stephen A. Brewster, Graham Wilson, and Stephen A. Hughes. 2012. Augmenting Media with Thermal Stimulation. Proceedings of International Workshop on Haptic and Audio Interaction Design (HAID '12), 91--100. http://dx.doi.org/10.1007/978--3--642--32796--4_10","paperID":"None"},{"content":"Martin Halvey, Graham Wilson, Stephen A. Brewster, and Stephen Hughes. 2012. \"Baby It's Cold Outside\": The Influence of Ambient Temperature and Humidity on Thermal Feedback. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 715--724. http://dx.doi.org/10.1145/2207676.2207779.","paperID":"None"},{"content":"Harry F. Harlow. 1958. The Nature of Love. American Psychologist 13: 673--685.","paperID":"None"},{"content":"Matthew J Hertenstein, Rachel Holmes, Margaret McCullough, and Dacher Keltner. 2009. The communication of emotion via touch. Emotion 9, 4: 566--573. http://dx.doi.org/10.1037/a0016108","paperID":"None"},{"content":"Matthew J Hertenstein, Dacher Keltner, Betsy App, Brittany a Bulleit, and Ariane R Jaskolka. 2006. Touch communicates distinct emotions. Emotion 6, 3: 528--533. http://doi.org/10.1037/1528--3542.6.3.528","paperID":"None"},{"content":"Hans Ijzerman and Gun R Semin. 2009. The Thermometer of Social Relations. Psychological Science 20, 10: 1214--1220. http://doi.org/10.1111/j.1467--9280.2009.02434.x","paperID":"None"},{"content":"George Lakoff and Mark Johnson. 1999. Philosophy in the Flesh: The embodied mind and its challenge to Western thought. Harper-Collins, NY.","paperID":"None"},{"content":"Peter J Lang, Margaret M Bradley, and BN Cuthbert. 2008. International Affective Picture System (IAPS): Technical Manual and Affective Ratings. Gainesville, FL.","paperID":"None"},{"content":"Wonjun Lee and Youn-kyung Lim. 2012. Explorative research on the heat as an expression medium: focused on interpersonal communication. Personal and Ubiquitous Computing 16: 1039--1049. http://dx.doi.org/10.1007/s00779-011-0424-y","paperID":"None"},{"content":"Mutsuhiro Nakashige, Minoru Kobayashi, Yuriko Suzuki, Hidekazu Tamaki, and Suguru Higashino. 2009. \"Hiya-Atsu\" media: augmenting digital media with temperature. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09) Extended Asbtracts, 3181--3186. http://dx.doi.org/10.1145/1520340.1520453","paperID":"None"},{"content":"Lauri Nummenmaa, Enrico Glerean, Riitta Hari, and Jari K Hietanen. 2013. Bodily maps of emotions. Proceedings of the National Academy of Sciences 111, 2: 646--651. http://doi.org/10.1073/pnas.1321664111/","paperID":"None"},{"content":"Marianna Obrist, Sriram Subramanian, Elia Gatti, Benjamin Long, and Thomas Carter. 2015. Emotions Mediated Through Mid-Air Haptics. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 2053--2062. http://doi.acm.org/10.1145/2702123.2702361","paperID":"None"},{"content":"Ranier Reisenzein. 1994. Pleasure-arousal theory and the intensity of emotions. Journal of Personality and Social Psychology 67, 3: 525--539. http://doi.org/10.1037/0022--3514.67.3.525","paperID":"None"},{"content":"Michael D Robinson and Gerald L Clore. 2002. Belief and feeling: evidence for an accessibility model of emotional self-report. Psychological bulletin 128, 6: 934--960. http://doi.org/10.1037/0033--2909.128.6.934","paperID":"None"},{"content":"David C Rubin and Jennifer M Talarico. 2009. A comparison of dimensional models of emotion: evidence from emotions, prototypical events, autobiographical memories, and words. Memory 17, 8: 802--808. http://doi.org/10.1080/09658210903130764","paperID":"None"},{"content":"James A Russell. 1980. A Circumplex Model of Affect. Journal of Personality and Social Psychology 39, 6: 1161--1178. http://dx.doi.org/10.1037/h0077714","paperID":"None"},{"content":"Katri Salminen, Veikko Surakka, Jukka Raisamo, Jani Lylykangas, Johannes Pystynen, Roope Raisamo, Kalle Makela and Teemu Ahnaniemi. 2011. Emotional Responses to Thermal Stimuli. Proceedings of ICMI 2011, 193--196. http://doi.acm.org/10.1145/2070481.2070513","paperID":"None"},{"content":"Katri Salminen, Veikko Surakka, Jukka Raisamo, Jani Lylykangas, Roope Raisamo, Kalle Makela and Teemu Ahnaniemi. 2013. Cold or hot? How thermal stimuli are related to human emotional system? Proceedings of International Workshop on Haptic and Audio Interaction Design (HAID '13) 7989: 20--29. http://doi.org/10.1007/978--3--642--41068-0_3","paperID":"None"},{"content":"Katri Salminen, Veikko Surakka, Jani Lylykangas, Jukka Raisamo, Rami Saarinen, Roope Raisamo, Jussi Rantala and Grigori Evreinov. 2008. Emotional and behavioral responses to haptic stimulation. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 1555--1562. http://dx.doi.org/10.1145/1357054.1357298","paperID":"None"},{"content":"Marc Schröder. 2003. Experimental study of affect bursts. Speech Communication 40, 1--2: 99--116. http://doi.org/10.1016/S0167--6393(02)00078-X","paperID":"None"},{"content":"Hasti Seifi and Karon E. Maclean. 2013. A first look at individuals' affective ratings of vibrations. Proceedings of World Haptics 2013, 605--610. http://doi.org/10.1109/WHC.2013.6548477","paperID":"None"},{"content":"Joseph C Stevens. 1991. Thermal Sensibility. In The Psychology of Touch, MA Heller and W Schiff (eds.). Lawrence Erlbaum, NJ.","paperID":"None"},{"content":"Katja Suhonen, Sebastian Muller, Jussi Rantala, Kaisa Vaananen-Vainio-Mattila, Roope Raisamo, and Vuokko Lantz. 2012. Haptically Augmented Remote Speech Communication: A Study of User Practices and Experiences. Proceedings of the Nordic Conference on Human-Computer Interaction (NordiCHI '12), 361--369. http://doi.acm.org/10.1145/2399016.2399073","paperID":"None"},{"content":"Katja Suhonen, Kaisa Väänänen-Vainio-Mattila, and Kalle Mäkelä. 2012. User experiences and expectations of vibrotactile, thermal and squeeze feedback in interpersonal communication. Proceedings of the Annual BCS Interaction Specialist Group Conference on People and Computers (BCS-HCI '12), 205--214. http://dl.acm.org/citation.cfm?id=2377916.2377939","paperID":"None"},{"content":"David Watson and Auke Tellegen. 1985. Toward a consensual structure of mood. Psychological bulletin 98, 2: 219--235. http://doi.org/10.1037/00332909.98.2.219","paperID":"None"},{"content":"Lawrence Williams and John A. Bargh. 2008. Experiencing physical warmth promotes interpersonal warmth. Science 322, 1: 606--607. http://dx.doi.org/10.1126/science.1162548","paperID":"None"},{"content":"Graham Wilson, Gavin Davidson, and Stephen Brewster. 2015. In the Heat of the Moment?: Subjective Interpretations of Thermal Feedback During Interaction. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 2063--2072. http://doi.acm.org/10.1145/2702123.2702219","paperID":"None"},{"content":"Graham Wilson, Martin Halvey, Stephen A Brewster, and Stephen A Hughes. 2011. Some Like it Hot? Thermal Feedback for Mobile Devices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2555--2564. http://doi.acm.org/10.1145/1978942.1979316","paperID":"None"},{"content":"Taekbeom Yoo, Yongjae Yoo, and Seungmoon Choi. 2014. An Explorative Study on Crossmodal Congruence Between Visual and Tactile Icons Based on Emotional Responses. Proceedings of ICMI 2014, 96--103. http://doi.org/10.1145/2663204.2663231","paperID":"None"},{"content":"Yongjae Yoo, Taekbeom Yoo, Jihyun Kong, and Seungmoon Choi. 2015. Emotional Responses of Tactile Icons?: Effects of Amplitude , Frequency , Duration , and Envelope. Proceedings of World Haptics 2015, 235--240. http://dx.doi.org/10.1109/WHC.2015.7177719","paperID":"None"}],"title":"Hot Under the Collar: Mapping Thermal Feedback to Dimensional Models of Emotion","filename":"CHI16/p4838","authors":["Graham Wilson","Dobromir Dobrev","Stephen A. Brewster"],"conference":"CHI '16"}