{"paperId":2858586,"abstract":"Parents are often responsible for finding, selecting, and facilitating their children's out-of-school learning experiences. One might expect that the recent surge in online educational tools and the vast online network of information about informal learning would make this easier for all parents. Instead, the increase in these free, accessible resources is contributing to an inequality of use between children from lower and higher socio-economic status (SES). Through over 60 interviews with a diverse group of parents, we explored parents' ability to find learning opportunities and their role in facilitating educational experiences for their children. We identified differences in the use of online social networks in finding learning opportunities for their children based on SES. Building upon these findings, we conducted a national survey in partnership with ACT, an educational testing services organization, to understand if these differences were generalizable to and consistent among a broader audience.","citation":[],"reference":[{"content":"Paul Attewell. 200 Comment: First and Second Digital Divides. Sociology of Education 74, 3: 252--259.","paperID":"None"},{"content":"Albert Bandura. 1994. Self-efficacy. Wiley Online Library.","paperID":"None"},{"content":"Brigid Barron, Caitlin Kennedy Martin, Lori Takeuchi, and Rachel Fithian. 2009. Parents as learning partners in the development of technological fluency. International Journal of Learning and Media 1, 2: 55--77.","paperID":"None"},{"content":"Moira Burke, Cameron Marlow, and Thomas Lento. 2010. Social network activity and social well-being. Proceedings of SIGCHI Conference on Human Factors in Computing Systems, ACM, 1909--1912.","paperID":"None"},{"content":"Raj Chetty, Nathaniel Hendren, Patrick Kline, and Emmanuel Saez. 2013. The Equality of Opportunity Project. Retrieved January 8, 2016 from http://obs.rc.fas.harvard.edu/chetty/website/IGE/Executive%20Summary.pdf","paperID":"None"},{"content":"Jacob Cohen. 1960. A coefficient of agreement for nominal scales. Educational and psychological measurement 20, 1: 37--4","paperID":"None"},{"content":"James S Coleman. 1988. Social capital in the creation of human capital. American Journal of Sociology: S95--S120.","paperID":"None"},{"content":"Kevin Crowley, Maureen A Callanan, Harriet R Tenenbaum, and Elizabeth Allen. 2001. Parents explain more often to boys than to girls during shared scientific thinking. Psychological Science 12, 3: 258--261.","paperID":"None"},{"content":"Paul DiMaggio, Eszter Hargittai, Celeste Celeste, and Steven Shafer. 2004. Digital inequality: From unequal access to differentiated use. Social Inequality: 355--400.","paperID":"None"},{"content":"Betsy DiSalvo and Parisa Khanipour Roshan. 2014. Medium probes: exploring the medium not the message. Proceedings of the 2014 Conference on Designing Interactive Systems, ACM, 239--248. Retrieved September 25, 2015 from http://dl.acm.org/citation.cfm?id=2598580","paperID":"None"},{"content":"1Silvia Dominguez and Celeste Watkins. 2003. Creating networks for survival and mobility: Social capital among African-American and Latin-American low-income mothers. Social Problems 50, 1: 111--135.","paperID":"None"},{"content":"Patricia Drentea and Jennifer L. Moren-Cross. 2005. Social capital and social support on the web: the case of an internet mother site. Sociology of health & illness 27, 7: 920--943.","paperID":"None"},{"content":"Mikaela J Dufur, Toby L Parcel, and Kelly P Troutman. 2012. Does capital at home matter more than capital at school?: Social capital effects on academic achievement*. Research in Social Stratification and Mobility, 31, 1--21.","paperID":"None"},{"content":"Matthew S. Eastin and Robert LaRose. 2000. Internet self-efficacy and the psychology of the digital divide. Journal of Computer-Mediated Communication 6, 1: 0--0.","paperID":"None"},{"content":"Mark S Granovetter. 1973. The strength of weak ties. American journal of sociology: 1360--1380.","paperID":"None"},{"content":"Eszter Hargittai. 2007. Whose space? Differences among users and non-users of social network sites. Journal of Computer-Mediated Communication 13, 1: 276--297.","paperID":"None"},{"content":"Eszter Hargittai and Amanda Hinnant. 2008. Digital inequality differences in young adults? use of the Internet. Communication Research 35, 5: 602--621.","paperID":"None"},{"content":"Eszter Hargittai and Steven Shafer. 2006. Differences in actual and perceived online skills: the role of gender*. Social Science Quarterly 87, 2: 432--448.","paperID":"None"},{"content":"Richard James Havis. 2015. Andrew Ng, who co-founded Coursera, driven by desire to improve world. South China Morning Post. Retrieved July 13, 2015 from http://www.scmp.com/lifestyle/families/article/1820600/scientist-who-co-founded-coursera-driven-desire-improve-world","paperID":"None"},{"content":"Nancy E. Hill and Lorraine C. Taylor. 2004. Parental school involvement and children's academic achievement pragmatics and issues. Current Directions in Psychological Science 13, 4: 161--164.","paperID":"None"},{"content":"Hee Young Jeong, Sun Young Park, and John Zimmerman. 2008. Opportunities to support parents in managing their children's health. ACM, 3225--3230.","paperID":"None"},{"content":"Parisa Khanipour Roshan, Maia Jacobs, Michaelanne Dye, and Betsy DiSalvo. 2014. Exploring how parents in economically depressed communities access learning resources. Proceedings of the 18th International Conference on Supporting Group Work, ACM, 131--141. Retrieved May 8, 2015 from http://dl.acm.org/citation.cfm?id=2660415","paperID":"None"},{"content":"Sal Khan and James Manyika. 2013. Education for Everyone: An Interview with Sal Khan. Retrieved May 21, 2015 from http://www.mckinsey.com/insights/social_sector/education_for_everyone_an_interview_with_sal_khan","paperID":"None"},{"content":"Priya Kumar and Sarita Schoenebeck. 2015. The modern day baby book: Enacting good mothering and stewarding privacy on facebook. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1302--1312. Retrieved January 8, 2016 from http://dl.acm.org/citation.cfm?id=2675149","paperID":"None"},{"content":"J. Richard Landis and Gary G. Koch. 1977. The measurement of observer agreement for categorical data. Biometrics: 159--174.","paperID":"None"},{"content":"Nan Lin and Mary Dumin. 1986. Access to occupations through social ties. Social Networks 8, 4: 365--385.","paperID":"None"},{"content":"Eden Litt, Erin Spottswood, Jeremy Birnholtz, Jeff T. Hancock, Madeline E. Smith, and Lindsay Reynolds. 2014. Awkward encounters of an other kind: collective self-presentation and face threat on Facebook. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, ACM, 449--460. Retrieved January 8, 2016 from http://dl.acm.org/citation.cfm?id=2531646","paperID":"None"},{"content":"Clare Madge and Henrietta O'Connor. 2006. Parenting gone wired: empowerment of new mothers on the internet? Social & Cultural Geography 7, 02: 199--220.","paperID":"None"},{"content":"J.C. Na and S.W. Chia. 2008. Impact of online resources on informal learners: Parents' perception of their parenting skills. Computers & Education 51, 1: 173--186.","paperID":"None"},{"content":"Sasha Palmquist and Kevin Crowley. 2007. From teachers to testers: How parents talk to novice and expert children in a natural history museum. Science Education 91, 5: 783--804.","paperID":"None"},{"content":"Laura Portwood-Stacer. 2012. Media refusal and conspicuous non-consumption: The performative and political dimensions of Facebook abstention. New Media & Society: 1461444812465139.","paperID":"None"},{"content":"Robert D. Putnam. 1995. Bowling alone: America's declining social capital. Journal of Democracy 6: 68.","paperID":"None"},{"content":"Sean F Reardon. 2011. The widening academic achievement gap between the rich and the poor: New evidence and possible explanations. Whither opportunity: 91--116.","paperID":"None"},{"content":"Sean F. Reardon. 2013. No rich child left behind. New York Times 28. Retrieved January 5, 2016 from http://www.schoolinfosystem.org/archives/lifelong_learni/","paperID":"None"},{"content":"Justin Reich. 2012. Open educational resources expand educational inequalities. Educational Technology Debate. Retrieved from https://edutechdebate.org/oer-and-digital-divide/open-educational-resources-expand-educational-inequalities/","paperID":"None"},{"content":"Justin Reich, Richard Murnane, and John Willett. 2012. The state of wiki usage in US K-12 schools leveraging web 2.0 data warehouses to assess quality and equity in online learning environments. Educational Researcher 41, 1: 7--15.","paperID":"None"},{"content":"David J. Solomon. 2001. Conducting Web-based surveys. ERIC Digest. Retrieved January 10, 2016 from http://ericae.net/edo/ed458291.htm","paperID":"None"},{"content":"Xavier De Souza Briggs. 1998. Brown kids in white suburbs: Housing mobility and the many faces of social capital. Housing Policy Debate 9, 1: 177--221.","paperID":"None"},{"content":"Charles Steinfield, Nicole B. Ellison, and Cliff Lampe. 2008. Social capital, self-esteem, and use of online social network sites: A longitudinal analysis. Journal of Applied Developmental Psychology 29, 6: 434--445.","paperID":"None"},{"content":"Stella Ting-Toomey. 1999. Communicating Across Cultures. The Guilford Press.","paperID":"None"},{"content":"4US Census Bureau. 2007. Annual estimates of the population by sex, race, and hispanic origin for the USA: April 1, 2000 to July 1, 2007. NC-EST2007-03.","paperID":"None"}],"title":"Information Seeking Practices of Parents: Exploring Skills, Face Threats and Social Networks","filename":"CHI16/p623","authors":["Betsy DiSalvo","Parisa Khanipour Roshan","Briana Morrison"],"conference":"CHI '16"}