{"paperId":2858594,"citation":[],"abstract":"This short paper extends the existing conceptualization of intermediated use in the developing world by demonstrating a range of informal practices that are conducted outside of a discrete (intermediary/beneficiary) user-interface interaction in a given point in time. Further, this paper also demonstrates how low-literate users may often voluntarily relinquish custody of an information resource in order to create and maintain intermediation. In this way we describe a broader conceptualization of intermediated use in the developing world that needs to take into account the entire sociotechnical workflow. This is particularly critical when explicitly designing for secondary/beneficiary users; it considers their specific requirements that often get overlooked while simultaneously revealing their vulnerabilities within the formal-informal continuum. We present findings from ethnographic work conducted in India and Ghana.","reference":[{"content":"Marshini Chetty and Rebecca E. Grinter. 2007. HCI4D: hci challenges in the global south. CHI'07 Extended Abstracts on Human Factors in Computing Systems.","paperID":"None"},{"content":"Tapan S. Parikh and Kaushik Ghosh. 2006. Understanding and designing for intermediated information tasks in India. Pervasive Computing, IEEE 5, no. 2, 32--39.","paperID":"None"},{"content":"Nithya Sambasivan, Ed Cutrell, Kentaro Toyama, and Bonnie Nardi. 2010. Intermediated technology use in developing communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2583--2592.","paperID":"None"},{"content":"Basudeb Guha-Khasnobis, Ravi Kanbur, and Elinor Ostrom. 2007. Linking the formal and informal economy: concepts and policies. Oxford University Press.","paperID":"None"},{"content":"Martha Alter Chen. 2005. Rethinking the informal economy: Linkages with the formal economy and the formal regulatory environment.","paperID":"None"},{"content":"Ishita Ghosh. 2013. The agent in a transformational mbanking ecosystem: interface or intermediary?. In Proceedings of the Sixth International Conference on Information and Communications Technologies and Development, 33--36. ACM.","paperID":"None"},{"content":"Ishita Ghosh, Jay Chen, Joy Ming, and Azza Abouzied. 2015. The persistence of paper: a case study in microfinance from Ghana. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. ACM.","paperID":"None"},{"content":"Indrani Medhi, Aishwarya Ratan, and Kentaro Toyama. 2009. Mobile-banking adoption and usage by low-literate, low-income users in the developing world. In Internationalization, Design and Global Development, 485--44. Springer Berlin Heidelberg.","paperID":"None"}],"title":"Contextualizing Intermediated Use in the Developing World: Findings from India & Ghana","filename":"CHI16/p355","authors":["Ishita Ghosh"],"conference":"CHI '16"}