{"paperId":2858307,"citation":[],"abstract":"Thermal stimulation is a feedback channel that has the potential to influence the emotional response of people to media such as images. While previous work has demonstrated that thermal stimuli might have an effect on the emotional perception of images, little is understood about the exact emotional responses different thermal properties and presentation techniques can elicit towards images. This paper presents two user studies that investigate the effect thermal stimuli parameters (e.g. intensity) and timing of thermal stimuli presentation have on the emotional perception of images. We found that thermal stimulation increased valence and arousal in images with low valence and neutral to low arousal. Thermal augmentation of images also reduced valence and arousal in high valence and arousal images. We discovered that depending on when thermal augmentation is presented, it can either be used to create anticipation or enhance the inherent emotion an image is capable of evoking.","reference":[{"content":"Shimon Akiyama, Katsunari Sato, Yasutoshi Makino, and Takashi Maeno. 2013. ThermOn-Thermo-musical Interface for an Enhanced Emotional Experience. Proceedings of the 17th annual international symposium on International symposium on wearable computers ISWC '13, ACM Press, 45-52.","paperID":"None"},{"content":"David Beattie, Lynne Baillie, and Martin Halvey. 2015. A Comparison of Artificial Driving Sounds for Automated Vehicles. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 451-462.","paperID":"None"},{"content":"Lynne Baillie, Lee Morton, David C. Moffat, and Stephen Uzor. 2010. Capturing the response of players to a location-based game. Personal and Ubiquitous Computing 15, 1, 13-24.","paperID":"None"},{"content":"Margaret M. Bradley. and Peter J. Lang. 1994. Measuring Emotion: The Self-Assessment Manikin and the Semantic Differential. Journal of Behavior Therapy and Experimental Psychiatry 25, 1, 49-59.","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology Using thematic analysis in psychology. Qualitative research in psychology 3, 2, 77 - 101.","paperID":"None"},{"content":"Ella A. Cooper, John Garlick, Eric Featherstone, Valerie Voon, Tania Singer, Hugo D. Critchley, and Neil A. Harrison. 2014. You Turn Me Cold: Evidence for Temperature Contagion. PloS one 9, 12, e116126.","paperID":"None"},{"content":"Sylvain Delplanque, Karim N'diaye, Klaus Scherer, and Didier Grandjean. 2007. Spatial frequencies or emotional effects?. A systematic measure of spatial frequencies for IAPS pictures by a discrete wavelet analysis. Journal of Neuroscience Methods 165, 1, 144-150.","paperID":"None"},{"content":"Daniel Gooch and Leon Watts. 2010. Communicating Social Presence Through Thermal Hugs. Proceedings of the first Workshop on Social Interaction in Spatially Separated Environments SISSI2010, 11-19.","paperID":"None"},{"content":"Lincoln Gray, Joseph C. Stevens and Lawrence E. Marks. 1982. Thermal stimulus thresholds: Sources of variability. Physiology & Behavior 29, 2, 355-360.","paperID":"None"},{"content":"Martin Halvey, Michael Henderson, Stephen A. Brewster, Graham Wilson and Stephen A. Hughes. 2012. Augmenting media with thermal stimulation. Haptic and Audio Interaction Design 7468, 91-100.","paperID":"None"},{"content":"Martin Halvey, Graham Wilson, Stephen Brewster and Stephen Hughes. 2012. \"Baby it's cold outside\": The Influence of Ambient Temperature and Humidity on Thermal Feedback. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, ACM Press, 715-724.","paperID":"None"},{"content":"Martin Halvey, Graham Wilson, Stephen A. Brewster and Stephen A. Hughes. 2013. Perception of thermal stimuli for continuous interaction. CHI '13 Extended Abstracts on Human Factors in Computing Systems on CHI EA '13, ACM Press, 1587.","paperID":"None"},{"content":"Martin Halvey, Graham Wilson, Yolanda Vazquez-Alvarez, Stephen A. Brewster and Stephen A. Hughes. 2011. The Effect of Clothing on Thermal Feedback Perception. Proceedings of the 13th international conference on multimodal interfaces ICMI '11, ACM Press, 217-220.","paperID":"None"},{"content":"Kenneth O. Johnson, Ian Darian-Smith, and Carole LaMotte. 1973. Peripheral neural determinants of temperature discrimination in man: a correlative study of responses to cooling skin. Journal of Neurophysiology 36, 2, 347-370.","paperID":"None"},{"content":"Lynette A. Jones, and Michal Berris. 2002. The psychophysics of temperature perception and thermal interface design. Proceedings 10th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. HAPTICS 2002, IEEE Comput. Soc, 137-142.","paperID":"None"},{"content":"Kazuyuki Kanosue, Norihiro Sadato, Tomohisa Okada, et al. 2002. Brain activation during whole body cooling in humans studied with functional magnetic resonance imaging. Neuroscience Letters 329, 2, 157-160.","paperID":"None"},{"content":"Dan R. Kenshalo, Charles E. Holmes, and Paul B. Wood. 1968. Warm and cool thresholds as a function of rate of stimulus temperature change. Perception & Psychophysics 3, 2, 81-84.","paperID":"None"},{"content":"Dan R. Kenshalo, and Harley A. Scott Jr. 1966. Temporal course of thermal adaptation. Science 151, 3714, 1095-1096.","paperID":"None"},{"content":"Dan R. Kenshalo. 1986. Somesthetic Sensitivity in Young and Elderly Humans. Journal of Gerontology 41, 6, 732-742.","paperID":"None"},{"content":"Peter J. Lang, Margaret M. Bradley, and Bruce N. Cuthbert. 2008. International Affective Picture System (IAPS): Affective ratings of pictures and instruction manual. Technical Report A-8. University of FL, Gainesville, FL.","paperID":"None"},{"content":"Markus Löchtefeld, Nadine Lautemann, Sven Gehring, and Antonio Krüger. 2014. AmbiPad: Enriching Mobile Digital Media with Ambient Feedback. Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services - MobileHCI '14, ACM Press, 295-298.","paperID":"None"},{"content":"Mutsuhiro Nakashige, Minoru Kobayashi, Yuriko Suzuki, Hidekazu Tamaki, and Suguru Higashino. 2009. \"Hiya-Atsu\" Media: Augmenting Digital Media with Temperature. Proceedings of the 27th international conference extended abstracts on Human factors in computing systems CHI EA '09, ACM Press, 3181-3186.","paperID":"None"},{"content":"James A. Russell. 1980 A circumplex model of affect. Journal of Personality and Social Psychology 39, 6, 1161-1178.","paperID":"None"},{"content":"Dean Sabatinelli, Tobias Flaisch, Margaret M. Bradley, Jeffrey R. Fitzsimmons, and Peter J. Lang. 2004. Affective picture perception: gender differences in visual cortex? Neuroreport 15, 7, 1109--1112.","paperID":"None"},{"content":"Katri Salminen, Veikko Surakka, Jukka Raisamo, Jani Lylykangas, et al. 2011. Emotional responses to thermal stimuli. Proceedings of the 13th international conference on multimodal interfaces ICMI '11, ACM Press, 193-196.","paperID":"None"},{"content":"Eun_Jung Sung, Seung-Schik Yoo, Hyo W. Yoon, Sung-Suk Oh, and Hyun W. Park. 2007. Brain activation related to affective dimension during thermal stimulation in humans: a functional magnetic resonance imaging study. The International journal of neuroscience 117, 7, 1011-27.","paperID":"None"},{"content":"Auke Tellegen. 1985. Structures of mood and personality and their relevance to assessing anxiety, with an emphasis on self-report.","paperID":"None"},{"content":"Anaya B. Weddle, and Hua Yu. 2013. How does audio-haptic enhancement influence emotional response to mobile media? 5th International Workshop on Quality of Multimedia Experience, QoMEX Proceedings, 158-163.","paperID":"None"},{"content":"Graham Wilson, Stephen Brewster, Martin Halvey and Stephen Hughes. 2012. Thermal Icons: Evaluating Structured Thermal Feedback for Mobile Interaction. Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services - MobileHCI '12, ACM Press, 309--309.","paperID":"None"},{"content":"Graham Wilson, Stephen Brewster, Martin Halvey, and Stephen Hughes. 2013. Thermal Feedback Identification in a Mobile Environment. Haptic and Audio Interaction Design, 10-19.","paperID":"None"},{"content":"Graham Wilson, Gavin Davidson, and Stephen Brewster. 2015. In the Heat of the Moment : Subjective Interpretations of Thermal Feedback During Interaction. CHI'15 Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2063-2072.","paperID":"None"},{"content":"Graham Wilson, Martin Halvey, Stephen Brewster, and Stephen Hughes. 2011. Some Like it Hot: Thermal Feedback for Mobile Devices. Proceedings of the SIGCHI conference on Human Factors in Computing Systems. CHI '11.","paperID":"None"}],"title":"The Effect of Thermal Stimuli on the Emotional Perception of Images","filename":"CHI16/p4401","authors":["Moses Akazue","Martin Halvey","Lynne Baillie","Stephen Brewster"],"conference":"CHI '16"}