{"paperId":2858543,"reference":[{"content":"Astrophysical Research Consortium. 1989. Principles of Operation of the Sky Survey Project.","paperID":"None"},{"content":"Astrophysical Research Consortium. 1997. A Digital Sky Survey of the Northern Galactic Cap. Astrophysical Research Consortium. Retrieved from https://catalog.lib.uchicago.edu/vufind/Record/839388","paperID":"None"},{"content":"Astrophysical Research Consortium. 2000. Principles of operation for the Sloan Digital Sky Survey. Retrieved from http://classic.sdss.org/policies/sdss_poo.html","paperID":"None"},{"content":"Astrophysical Research Consortium. 2005. Principles of operation for the Sloan Digital Sky Survey II (PoOII). Retrieved from http://classic.sdss.org/surveyops/docs/PoO-II-10a.pdf","paperID":"None"},{"content":"Australian National Data Service. 2014. ANDS: Australian National Data Service. Retrieved January 24, 2014 from http://www.ands.org.au/","paperID":"None"},{"content":"Anne Beaulieu. 2010. Research Note: From colocation to co-presence: Shifts in the use of ethnography for the study of knowledge. Social Studies of Science 40, 3: 453--470. Retrieved October 13, 2014 from http://sss.sagepub.com/content/40/3/453.short","paperID":"None"},{"content":"Sean Bechhofer, Iain Buchan, David De Roure, et al. 2013. Why Linked Data is Not Enough for Scientists. Future Generation Computer Systems 29, 2: 599--611. http://doi.org/10.1016/j.future.2011.08.004","paperID":"None"},{"content":"Sean Bechhofer, David De Roure, Matthew Gamble, Carole Goble, and Iain Buchan. 2010. Research objects: Towards exchange and reuse of digital knowledge. Nature Proceedings, 713. http://doi.org/10.1038/npre.2010.4626.1","paperID":"None"},{"content":"Dennis A. Benson, Mark Cavanaugh, Karen Clark, et al. 2013. GenBank. Nucleic Acids Research 41, Database issue: D36--D42. http://doi.org/10.1093/nar/gks1195","paperID":"None"},{"content":"Christian Bizer, Tom Heath, and Tim Berners-Lee. 2009. Linked Data - The story so far. International Journal on Semantic Web and Information Systems 5, 3: 1--22. http://doi.org/10.4018/jswis.2009081901","paperID":"None"},{"content":"Christine L. Borgman. 2012. The conundrum of sharing research data. Journal of the American Society for Information Science and Technology 63, 6: 1059--1078. http://doi.org/10.1002/asi.22634","paperID":"None"},{"content":"Christine L. Borgman. 2015. Big data, little data, no data: Scholarship in the networked world. The MIT Press, Cambridge, MA. Retrieved from http://mitpress.mit.edu/big-data","paperID":"None"},{"content":"Maged N. Kamel Boulos, Bernd Resch, David N. Crowley, et al. 2011. Crowdsourcing, citizen sensing and sensor web technologies for public and environmental health surveillance and crisis management: trends, OGC standards and application examples. International Journal of Health Geographics 10. http://doi.org/10.1186/1476-072X-10-","paperID":"None"},{"content":"Geoffrey Boulton, Michael Rawlins, Patrick Vallance, and Mark Walport. 2011. Science as a public enterprise: The case for open data. The Lancet 377, 9778: 1633--1635. http://doi.org/10.1016/S01406736(11)60647--8","paperID":"None"},{"content":"Center for Dark Energy Biosphere Investigations. 2012. C-DEBI Data Management Philosophy and Policy. Retrieved from http://www.darkenergybiosphere.org/internal/docs/CDEBIDataManagementPlan_2012draft.pdf","paperID":"None"},{"content":"Center for Dark Energy Biosphere Investigations. 2014. Center for Dark Energy Biosphere Investigations STC Annual Report 2013. Retrieved from http://www.darkenergybiosphere.org/internal/docs/CDEBI-Annual-Report-2013.pdf","paperID":"None"},{"content":"Allan Chapman. 1998. The Victorian amateur astronomer: independent astronomical research in Britain, 1820--1920. Wiley published in association with Praxis Publishing, Chichester, Chichester; NY.","paperID":"None"},{"content":"Carol Christian, Chris Lintott, Arfon Smith, Lucy Fortson, and Steven Bamford. 2012. Citizen Science: Contributions to Astronomy Research. arXiv:1202.2577. Retrieved April 6, 2012 from http://arxiv.org/abs/1202.2577","paperID":"None"},{"content":"Peter T. Darch, Christine L. Borgman, Sharon Traweek, Rebekah L. Cummings, Jillian C. Wallis, and Ashley E. Sands. 2015. What lies beneath?: Knowledge infrastructures in the subseafloor biosphere and beyond. International Journal on Digital Libraries 16, 1: 61--77. http://doi.org/10.1007/s00799-015-0137-","paperID":"None"},{"content":"Peter T. Darch and Ashley E. Sands. 2015. Beyond big or little science: Understanding data lifecycles in astronomy and the deep subseafloor biosphere. iConference 2015 Proceedings, iSchools. Retrieved from https://www.ideals.illinois.edu/handle/2142/73655","paperID":"None"},{"content":"DataCite. 2014. About DataCite. Retrieved September 22, 2015 from https://www.datacite.org/about-datacite","paperID":"None"},{"content":"Katrina Edwards. 2009. Center for Dark Energy Biosphere Investigations (C-DEBI): A Center for Resolving the Extent, Function, Dynamics and Implications of the Subseafloor Biosphere. Retrieved July 15, 2014 from http://www.darkenergybiosphere.org/internal/docs/2009C-DEBI_FullProposal.pdf","paperID":"None"},{"content":"Paul N. Edwards, Steven J. Jackson, Melissa K. Chalmers, et al. 2013. Knowledge infrastructures: Intellectual frameworks and research challenges. University of MI, Ann Arbor, MI. Retrieved July 15, 2013 from http://deepblue.lib.umich.edu/handle/2027.42/97552","paperID":"None"},{"content":"European Commission High Level Expert Group on Scientific Data. 2010. Riding the wave: How Europe can gain from the rising tide of scientific data. European Union. Retrieved from http://ec.europa.eu/information_society/newsroom/cf/itemlongdetail.cfm?item_id=6204","paperID":"None"},{"content":"Martyn Hammersley and Paul Atkinson. 2007. Ethnography: Principles in Practice. Routledge, London. Retrieved from https://www.routledge.com/products/9780415396059","paperID":"None"},{"content":"Christine Hine. 2007. Connective Ethnography for the Exploration of e-Science. Journal of Computer-Mediated Communication 12, 2: 618--634. http://doi.org/10.1111/j.1083--6101.2007.00341.x","paperID":"None"},{"content":"Scott Hissam, Barbara Russo, and Fabio Kon. 2011. Open Source Systems: Grounding Research: 7th IFIP 2.13 International Conference, OSS 2011, Salvador, Brazil, October 6--7, 2011, Proceedings. Springer Science & Business Media.","paperID":"None"},{"content":"C. H. Huang, J. Munn, B. Yanny, et al. 1995. Object-oriented modeling and design for Sloan Digital Sky Survey retained data. Fermi National Accelerator Lab., Batavia, IL (USA). Retrieved May 22, 2014 from http://www.osti.gov/scitech/biblio/220453","paperID":"None"},{"content":"IODP. 2014. International Ocean Discovery Program. Retrieved June 13, 2014 from http://iodp.org/","paperID":"None"},{"content":"Steven J. Jackson and Sarah Barbrow. 2013. Infrastructure and vocation: Field, calling and computation in ecology. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2873--2882. http://doi.org/10.1145/2470654.2481397","paperID":"None"},{"content":"Steven J. Jackson and Sarah Barbrow. 2015. Standards and/as innovation: Protocols, creativity, and interactive systems development in ecology. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1769--1778. http://doi.org/10.1145/2702123.2702564","paperID":"None"},{"content":"Steven J. Jackson, Stephanie B. Steinhardt, and Ayse Buyuktur. 2013. Why CSCW needs science policy (and vice versa). Proceedings of the 2013 Conference on Computer Supported Cooperative Work, ACM, 1113--1124. http://doi.org/10.1145/2441776.2441902","paperID":"None"},{"content":"Marijn Janssen, Yannis Charalabidis, and Anneke Zuiderwijk. 2012. Benefits, Adoption Barriers and Myths of Open Data and Open Government. Information Systems Management 29, 4: 258--268. http://doi.org/10.1080/10580530.2012.716740","paperID":"None"},{"content":"Marina Jirotka, Rob Procter, Mark Hartswood, et al. 2005. Collaboration and trust in healthcare innovation: The eDiaMoND case study. Computer Supported Cooperative Work (CSCW) 14, 4: 369--398. http://doi.org/10.1007/s10606-005--9001-0","paperID":"None"},{"content":"Marina Jirotka, Rob Procter, Tom Rodden, and Geoffrey C. Bowker. 2006. Special Issue: Collaboration in e-Research. Computer Supported Cooperative Work (CSCW) 15, 4: 251--255. http://doi.org/10.1007/s10606-006--9028-x","paperID":"None"},{"content":"Tomi Kauppinen and Giovana Mira de Espindola. 2011. Linked open science-communicating, sharing and evaluating data, methods and results for executable papers. Procedia Computer Science, 726--731. http://doi.org/10.1016/j.procs.2011.04.076","paperID":"None"},{"content":"Stefanie Kethers, Xiaobin Shen, Andrew E. Treloar, and Ross G. Wilkinson. 2010. Discovering Australia's research data. Proceedings of the 10th annual joint conference on Digital libraries, ACM, 345--348. http://doi.org/10.1145/1816123.1816175","paperID":"None"},{"content":"Karin Knorr-Cetina. 1999. Epistemic Cultures: How the Sciences Make Knowledge. Harvard University Press, Cambridge Mass.","paperID":"None"},{"content":"Stacy Kowalczyk and Kalpana Shankar. 2011. Data sharing in the sciences. Annual Review of Information Science and Technology 45, 1: 247--294. http://doi.org/10.1002/aris.2011.1440450113","paperID":"None"},{"content":"Richard G. Kron, James E. Gunn, David H. Weinberg, William N. Boroski, and Michael L. Evans. 2008. Final Report to the Alfred P. Sloan Foundation. Retrieved from http://classic.sdss.org/surveyops/annual_reports/SDSSII_final_rep.pdf","paperID":"None"},{"content":"Bruno Latour and Steve Woolgar. 1979. Laboratory Life: The Social Construction of Scientific Facts. Sage Publications, Beverly Hills.","paperID":"None"},{"content":"Sabina Leonelli. 2013. Why the current insistence on open access to scientific data? Big data, knowledge production, and the political economy of contemporary biology. Bulletin of Science, Technology & Society 33, 1--2: 6--11. http://doi.org/10.1177/0270467613496768","paperID":"None"},{"content":"Philip J. Marshall, Chris J. Lintott, and Leigh N. Fletcher. 2015. Ideas for Citizen Science in Astronomy. Annual Review of Astronomy and Astrophysics 53, 1: 247--278. http://doi.org/10.1146/annurev-astro-081913-035959","paperID":"None"},{"content":"Fiona Murphy. 2014. Data and scholarly publishing: The transforming landscape. Learned Publishing 27, 5: 3--7. http://doi.org/10.1087/20140502","paperID":"None"},{"content":"Peter Murray-Rust. 2008. Open Data in science. Serials Review 34, 1: 52--64. http://doi.org/10.1080/00987913.2008.10765152","paperID":"None"},{"content":"National Science Foundation. 2002. Award#0225645 SkySurvey: Using SDSS Data in the Classroom. Retrieved September 19, 2015 from http://nsf.gov/awardsearch/showAward?AWD_ID=0225645&HistoricalAwards=false","paperID":"None"},{"content":"National Science Foundation. 2010. NSF Data Management Plans. National Science Foundation, Washington, D.C. Retrieved from http://www.nsf.gov/pubs/policydocs/pappguide/nsf11001/gpg_2.jsp#dmp","paperID":"None"},{"content":"Tom O'Donoghue and Keith Punch. 2004. Qualitative Educational Research in Action: Doing and Reflecting. Routledge.","paperID":"None"},{"content":"Gary M Olson, Ann S. Zimmerman, and Nathan Bos (eds.). 2008. Scientific Collaboration on the Internet. MIT Press, Cambridge, Mass. Retrieved from http://ieeexplore.ieee.org/xpl/bkabstractplus.jsp?bkn=6","paperID":"None"},{"content":"Open Knowledge Foundation. 2014. Open Knowledge: What is Open? Retrieved October 19, 2014 from https://okfn.org/opendata/","paperID":"None"},{"content":"Beth N. Orcutt, Douglas E. LaRowe, Jennifer F. Biddle, et al. 2013. Microbial Activity in the Marine Deep Biosphere: Progress and Prospects. Frontiers in Microbiology 4: 189. http://doi.org/10.3389/fmicb.2013.00189","paperID":"None"},{"content":"Organisation for Economic Co-operation and Development. 2007. OECD Principles and Guidelines for Access to Research Data from Public Funding. Organisation for Economic Co-Operation and Development, Paris. Retrieved from http://www.oecd.org/dataoecd/9/61/38500813.pdf","paperID":"None"},{"content":"Irene V. Pasquetto, Ashley E. Sands, and Christine L. Borgman. 2015. Exploring Openness in Data and Science: What is \"Open,\" to Whom, When, and Why? Proceedings of the 78th ASIS&T Annual Meeting. Retrieved from https://www.asist.org/files/meetings/am15/proceedings/submissions/posters/296poster.pdf","paperID":"None"},{"content":"RDA Europe. 2014. The Data Harvest: How sharing research data can yield knowledge, jobs and growth. Retrieved December 4, 2014 from http://www.europe.rdalliance.org/documents/publications-reports/dataharvest-how-sharing-research-data-can-yieldknowledge-jobs-and","paperID":"None"},{"content":"David Ribes. 2014. Ethnography of scaling, or, how to a fit a national research infrastructure in the room. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, ACM, 158--170. Retrieved October 10, 2014 from http://dl.acm.org/citation.cfm?id=2531624","paperID":"None"},{"content":"Sloan Digital Sky Survey. 2014. SDSS SkyServer DR12. Sloan Digital Sky Survey. Retrieved July 7, 2015 from http://skyserver.sdss.org/dr12/en/credits/creditshome.aspx","paperID":"None"},{"content":"Susan Leigh Star. 1999. The ethnography of infrastructure. American Behavioral Scientist 43, 3: 377--391. Retrieved January 11, 2014 from http://abs.sagepub.com/content/43/3/377.short","paperID":"None"},{"content":"Chris Stoughton, Robert H. Lupton, Mariangela Bernardi, et al. 2002. Sloan Digital Sky Survey: Early data release. The Astronomical Journal 123, 1: 485--548. http://doi.org/10.1086/324741","paperID":"None"},{"content":"Alexander S. Szalay, Jim Gray, Aniruddha R. Thakar, et al. 2002. The SDSS SkyServer: Public access to the Sloan Digital Sky Server data. Microsoft Research. Retrieved December 3, 2009 from http://arxiv.org/abs/cs/0202013","paperID":"None"},{"content":"Alexander S. Szalay, Peter Kunszt, Aniruddha R. Thakar, and Jim Gray. 1999. Designing and mining multi-terabyte astronomy archives: The Sloan Digital Sky Survey (Original). Retrieved December 3, 2009 from http://adsabs.harvard.edu/abs/1999cs........7009S","paperID":"None"},{"content":"Alexander S. Szalay, Peter Z. Kunszt, Aniruddha R. Thakar, Jim Gray, and Don Slutz. 2000. The Sloan Digital Sky Survey and its archive. Astronomical Data Analysis Software and Systems IX, Astronomical Society of the Pacific, 405. Retrieved November 14, 2009 from http://www.adass.org/adass/proceedings/adass99/O102/","paperID":"None"},{"content":"Sharon Traweek. 1988. Beamtimes and Lifetimes: The World of High Energy Physicists. Harvard University Press, Cambridge, Mass.","paperID":"None"},{"content":"Paul F. Uhlir. 2007. Open data for global science: A review of recent developments in national and international scientific data policies and related proposals. Data Science Journal 6: OD1--OD3. http://doi.org/10.2481/dsj.6.OD1","paperID":"None"},{"content":"Paul F. Uhlir. 2012. The Future of Scientific Knowledge Discovery in Open Networked Environments: Summary of a Workshop. The National Academies Press, Washington, D.C.","paperID":"None"},{"content":"Paul F. Uhlir and Peter Schröder. 2007. Open Data for Global Science. Data Science Journal 6: OD36--OD53. http://doi.org/10.2481/dsj.6.OD36","paperID":"None"},{"content":"Herbert Van de Sompel, Robert Sanderson, Martin Klein, et al. 2012. A perspective on resource synchronization. D-Lib Magazine 18, 9/10. http://doi.org/10.1045/september2012-vandesompel","paperID":"None"},{"content":"Jeremy Vetter. 2011. Introduction: Lay Participation in the History of Scientific Observation. Science in Context 24, 02: 127--141. http://doi.org/10.1017/S0269889711000032","paperID":"None"},{"content":"Robert Viseur and Nicolas Devos. 2015. How openness can change scientific practice. ERCIM News 100, 37. Retrieved April 17, 2015 from http://ercimnews.ercim.eu/en100/special/how-openness-canchange-scientific-practice","paperID":"None"},{"content":"Robert B. Waide and McOwiti O. Thomas. 2012. Long-Term Ecological Research Network. In Encyclopedia of Sustainability Science and Technology, Robert A. Meyers (ed.). Springer NY, NY, NY, 6216--6240. Retrieved December 27, 2015 from DOI:10.1007/978--1--44190851--3_749","paperID":"None"},{"content":"Jillian C. Wallis, S. Milojevic, Christine L. Borgman, and William A. Sandoval. 2006. The Special Case of Scientific Data Sharing with Education. Annual Meeting of the American Society for Information Science & Technology, Information Today, Inc., 1--13. http://doi.org/10.1002/meet.14504301169","paperID":"None"},{"content":"Jillian C. Wallis, Elizabeth Rolando, and Christine L. Borgman. 2013. If we share data, will anyone use them? Data sharing and reuse in the long tail of science and technology. PLoS ONE 8, 7: e67332. http://doi.org/10.1371/journal.pone.0067332","paperID":"None"},{"content":"Jian Zhang and Chaomei Chen. 2010. Collaboration in an open data eScience: A case study of Sloan Digital Sky Survey. iConference 2010. Retrieved November 9, 2015 from https://www.ideals.illinois.edu/handle/2142/14948","paperID":"None"},{"content":"Anneke Zuiderwijk, Marijn Janssen, Sunil Choenni, Ronald Meijer, and R. Sheikh Alibaks. 2012. Sociotechnical impediments of open data. Electronic Journal of e-Government 10, 2: 156--172. Retrieved December 27, 2015 from http://www.ejeg.com/issue/download.html?idArticle=2","paperID":"None"},{"content":"2003. SDSS scientific and technical publication policy. Retrieved February 2, 2010 from http://classic.sdss.org/policies/pub_policy.html","paperID":"None"},{"content":"2010. Dryad. Retrieved from http://datadryad.org/","paperID":"None"},{"content":"2014. Publication policy | SDSS. Retrieved July 25, 2015 from http://www.sdss.org/collaboration/publication-policy/","paperID":"None"},{"content":"2015. International Virtual Observatory Alliance. Retrieved from http://www.ivoa.net/","paperID":"None"},{"content":"2015. Sloan Digital Sky Survey | Home. Retrieved November 8, 2015 from http://www.sdss.org/","paperID":"None"},{"content":"2015. Large Synoptic Survey Telescope: Home. Retrieved November 8, 2015 from http://www.lsst.org/lsst","paperID":"None"}],"abstract":"Open access to data is commonly required by funding agencies, journals, and public policy, despite the lack of agreement on the concept of \"open data.\" We present findings from two longitudinal case studies of major scientific collaborations, the Sloan Digital Sky Survey in astronomy and the Center for Dark Energy Biosphere Investigations in deep subseafloor biosphere studies. These sites offer comparisons in rationales and policy interpretations of open data, which are shaped by their differing scientific objectives. While policy rationales and implementations shape infrastructures for scientific data, these rationales also are shaped by pre-existing infrastructure. Meanings of the term \"open data\" are contingent on project objectives and on the infrastructures to which they have access.","citation":[],"title":"Open Data in Scientific Settings: From Policy to Practice","filename":"CHI16/p1585","authors":["Irene V. Pasquetto","Ashley E. Sands","Peter T. Darch","Christine L. Borgman"],"conference":"CHI '16"}