{"paperId":2858314,"citation":[],"reference":[{"content":"Teemu T. Ahmaniemi, Johan Kildal, and Merja Haveri. 2014. What is a Device Bend Gesture Really Good for?. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3503-3512. http://doi.acm.org/10.1145/2556288.2557306","paperID":"None"},{"content":"Rufino Ansara and Audrey Girouard. 2014. Augmenting Bend Gestures with Pressure Zones on Flexible Displays. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14). ACM, NY, NY, USA, 531-536. http://doi.acm.org/10.1145/2628363.2634228","paperID":"None"},{"content":"Ravin Balakrishnan, George Fitzmaurice, Gordon Kurtenbach, and Karan Singh. 1999. Exploring Interactive Curve and Surface Manipulation Using a Bend and Twist Sensitive Input Strip. In Proceedings of the 1999 Symposium on Interactive 3D Graphics (I3D '99). ACM, NY, NY, USA, 111-118. http://doi.acm.org/10.1145/300523.300536","paperID":"None"},{"content":"Ravin Balakrishnan and Ken Hinckley. 1999. The Role of Kinesthetic Reference Frames in Two-handed Input Performance. In Proceedings of the 12th Annual ACM Symposium on User Interface Software and Technology (UIST '99). ACM, NY, NY, USA, 171-178. http://doi.acm.org/10.1145/320719.322599","paperID":"None"},{"content":"Barnes and Noble International LLC. 2015. http://www.nook.com. (2015).","paperID":"None"},{"content":"Patrick Baudisch and Gerry Chu. 2009. Back-of-device Interaction Allows Creating Very Small Touch Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1923-1932. http://doi.acm.org/10.1145/1518701.1518995","paperID":"None"},{"content":"Christopher M. Bishop. 2006. Pattern Recognition and Machine Learning (Information Science and Statistics). Springer-Verlag NY, Inc.","paperID":"None"},{"content":"Jesse Burstyn, Amartya Banerjee, and Roel Vertegaal. 2013. FlexView: An Evaluation of Depth Navigation on Deformable Mobile Devices. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13). ACM, NY, NY, USA, 193-200. http://doi.acm.org/10.1145/2460625.2460655","paperID":"None"},{"content":"Alex Butler, Shahram Izadi, and Steve Hodges. 2008. SideSight: Multi-\"Touch\" Interaction Around Small Devices. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, NY, NY, USA, 201-204. http://doi.acm.org/10.1145/1449715.1449746","paperID":"None"},{"content":"Nicholas Chen, Francois Guimbretiere, and Abigail Sellen. 2012. Designing a Multi-slate Reading Environment to Support Active Reading Activities. ACM Trans. Comput.-Hum. Interact. 19, 3, Article 18 (Oct. 2012), 35 pages. http://doi.acm.org/10.1145/2362364.2362366","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Tovi Grossman, Daniel J. Wigdor, and George Fitzmaurice. 2014. Duet: Exploring Joint Interactions on a Smart Phone and a Smart Watch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 159-168. http://doi.acm.org/10.1145/2556288.2556955","paperID":"None"},{"content":"Lung-Pan Cheng, Meng Han Lee, Che-Yang Wu, Fang-I Hsiao, et al. 2013. IrotateGrasp: Automatic Screen Rotation Based on Grasp of Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3051-3054. http://doi.acm.org/10.1145/2470654.2481424","paperID":"None"},{"content":"Lee A Danisch, Kevin Englehart, and Andrew Trivett. 1999. Spatially continuous six-degrees-of-freedom position and orientation sensor. In Photonics East (ISAM, VVDC, IEMB). International Society for Optics and Photonics, 48-56.","paperID":"None"},{"content":"Artem Dementyev, Jeremy Gummeson, Derek Thrasher, Aaron Parks, Deepak Ganesan, Joshua R. Smith, and Alanson P. Sample. 2013. Wirelessly Powered Bistable Display Tags. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, NY, NY, USA, 383-386. http://doi.acm.org/10.1145/2493432.2493516","paperID":"None"},{"content":"David T. Gallant, Andrew G. Seniuk, and Roel Vertegaal. 2008. Towards More Paper-like Input: Flexible Input Devices for Foldable Interaction Styles. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, NY, NY, USA, 283-286. http://doi.acm.org/10.1145/1449715.1449762","paperID":"None"},{"content":"Audrey Girouard, Aneesh Tarun, and Roel Vertegaal. 2012. DisplayStacks: Interaction Techniques for Stacks of Flexible Thin-film Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2431-2440. http://doi.acm.org/10.1145/2207676.2208406","paperID":"None"},{"content":"Mayank Goel, Jacob Wobbrock, and Shwetak Patel. 2012. GripSense: Using Built-in Sensors to Detect Hand Posture and Pressure on Commodity Mobile Phones. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, NY, NY, USA, 545-554. http://doi.acm.org/10.1145/2380116.2380184","paperID":"None"},{"content":"Antonio Gomes, Andrea Nesbitt, and Roel Vertegaal. 2013. MorePhone: A Study of Actuated Shape Deformations for Flexible Thin-film Smartphone Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 583-592. http://doi.acm.org/10.1145/2470654.2470737","paperID":"None"},{"content":"Antonio Gomes and Roel Vertegaal. 2015. PaperFold: Evaluating Shape Changes for Viewport Transformations in Foldable Thin-Film Display Devices. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, NY, NY, USA, 153-160. http://doi.acm.org/10.1145/2677199.2680572","paperID":"None"},{"content":"Ken Hinckley, Morgan Dixon, Raman Sarin, Francois Guimbretiere, and Ravin Balakrishnan. 2009. Codex: A Dual Screen Tablet Computer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1933-1942. http://doi.acm.org/10.1145/1518701.1518996","paperID":"None"},{"content":"Ken Hinckley, Michel Pahud, Hrvoje Benko, Pourang Irani, et al. 2014. Sensing Techniques for Tablet+Stylus Interaction. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 605-614. http://doi.acm.org/10.1145/2642918.2647379","paperID":"None"},{"content":"David Holman, Roel Vertegaal, Mark Altosaar, Nikolaus Troje, and Derek Johns. 2005. Paper Windows: Interaction Techniques for Digital Paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 591-599. http://doi.acm.org/10.1145/1054972.1055054","paperID":"None"},{"content":"Joanneum Research Forschungsgesellschaft mbH. 2016. http://www.joanneum.at/en/materials/researchareas/pyzo?exr.html. (2016).","paperID":"None"},{"content":"Paul Kabbash, William Buxton, and Abigail Sellen. 1994. Two-handed Input in a Compound Task. In Conference Companion on Human Factors in Computing Systems (CHI '94). ACM, NY, NY, USA, 230-. http://doi.acm.org/10.1145/259963.260425","paperID":"None"},{"content":"Mohammadreza Khalilbeigi, Roman Lissermann, Wolfgang Kleine, and Jurgen Steimle. 2012. FoldMe: Interacting with Double-sided Foldable Displays. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12). ACM, NY, NY, USA, 33-40. http://doi.acm.org/10.1145/2148131.2148142","paperID":"None"},{"content":"Mohammadreza Khalilbeigi, Roman Lissermann, Max Muhlhauser, and Jurgen Steimle. 2011. Xpaaand: Interaction Techniques for Rollable Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2729-2732. http://doi.acm.org/10.1145/1978942.1979344","paperID":"None"},{"content":"Johan Kildal, Susanna Paasovaara, and Viljakaisa Aaltonen. 2012. Kinetic Device: Designing Interactions with a Deformable Mobile Interface. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, NY, NY, USA, 1871-1876. http://doi.acm.org/10.1145/2212776.2223721","paperID":"None"},{"content":"Byron Lahey, Audrey Girouard, Winslow Burleson, and Roel Vertegaal. 2011. PaperPhone: Understanding the Use of Bend Gestures in Mobile Devices with Flexible Electronic Paper Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1303-1312. http://doi.acm.org/10.1145/1978942.1979136","paperID":"None"},{"content":"Mathieu Le Goc, Stuart Taylor, Shahram Izadi, and Cem Keskin. 2014. A Low-cost Transparent Electric Field Sensor for 3D Interaction on Mobile Devices. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3167-3170. http://doi.acm.org/10.1145/2556288.2557331","paperID":"None"},{"content":"Johnny C. Lee, Scott E. Hudson, and Edward Tse. 2008. Foldable Interactive Displays. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, NY, NY, USA, 287-290. http://doi.acm.org/10.1145/1449715.1449763","paperID":"None"},{"content":"Flora M. Li, Sandeep Unnikrishnan, Peter van de Weijer, Ferdie van Assche, et al. 2013. Flexible Barrier Technology for Enabling Rollable AMOLED Displays and Upscaling Flexible OLED Lighting. SID Symposium Digest of Technical Papers 44, 1 (2013), 199-202. http://stacks.iop.org/0268--1242/26/i=3/a=034001","paperID":"None"},{"content":"Markus Löchtefeld, Christoph Hirtz, and Sven Gehring. 2013. Evaluation of Hybrid Front- and Back-of-device Interaction on Mobile Devices. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia (MUM '13). ACM, NY, NY, USA, Article 17, 4 pages. http://doi.acm.org/10.1145/2541831.2541865","paperID":"None"},{"content":"David C. McCallum, Edward Mak, Pourang Irani, and Sriram Subramanian. 2009. PressureText: Pressure Input for Mobile Phone Text Entry. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, NY, NY, USA, 4519-4524. http://doi.acm.org/10.1145/1520340.1520693","paperID":"None"},{"content":"Ross McLachlan and Stephen Brewster. 2013. Can You Handle It?: Bimanual Techniques for Browsing Media Collections on Touchscreen Tablets. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 3095-3098. http://doi.acm.org/10.1145/2468356.2479619","paperID":"None"},{"content":"Oaxis Inc. 2015. http://www.inkcase.com. (2015).","paperID":"None"},{"content":"Jin-Seong Park, Heeyeop Chae, Ho Kyoon Chung, and Sang In Lee. 2011. Thin film encapsulation for flexible AM-OLED: a review. Semiconductor Science and Technology 26, 3 (2011), 034001. http: //dx.doi.org/10.1002/j.2168-0159.2013.tb06178.x","paperID":"None"},{"content":"Ken Perlin and David Fox. 1993. Pad: An Alternative Approach to the Computer Interface. In Proceedings of the 20th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '93). ACM, NY, NY, USA, 57-64. http://doi.acm.org/10.1145/166117.166125","paperID":"None"},{"content":"popSLATE Media, Inc. 2015. http://www.popslate.com. (2015).","paperID":"None"},{"content":"Ali Rahimi and Benjamin Recht. 2007. Random features for large-scale kernel machines. In Advances in neural information processing systems. 1177-1184.","paperID":"None"},{"content":"Christian Rendl, Patrick Greindl, Michael Haller, Martin Zirkl, et al. 2012. PyzoFlex: Printed Piezoelectric Pressure Sensing Foil. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, NY, NY, USA, 509-518. http://doi.acm.org/10.1145/2380116.2380180","paperID":"None"},{"content":"Christian Rendl, David Kim, Sean Fanello, Patrick Parzer, et al. 2014. FlexSense: A Transparent Self-sensing Deformable Surface. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 129-138. http://doi.acm.org/10.1145/2642918.2647405","paperID":"None"},{"content":"Carsten Schwesig, Ivan Poupyrev, and Eijiro Mori. 2004. Gummi: A Bendable Computer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 263-270. http://doi.acm.org/10.1145/985692.985726","paperID":"None"},{"content":"Andrew Sears and Ben Shneiderman. 1991. High Precision Touchscreens: Design Strategies and Comparisons with a Mouse. Int. J. Man-Mach. Stud. 34, 4 (April 1991), 593-613. http://dx.doi.org/10.1016/0020--7373(91)90037--8","paperID":"None"},{"content":"Katie A. Siek, Yvonne Rogers, and Kay H. Connelly. 2005. Fat Finger Worries: How Older and Younger Users Physically Interact with PDAs. In Human-Computer Interaction - INTERACT 2005, Maria Francesca Costabile and Fabio Patern (Eds.). Lecture Notes in Computer Science, Vol. 3585. Springer Berlin Heidelberg, 267-280. http://dx.doi.org/10.1007/11555261_24","paperID":"None"},{"content":"Hyunyoung Song, Hrvoje Benko, Francois Guimbretiere, Shahram Izadi, et al. 2011. Grips and Gestures on a Multi-touch Pen. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1323-1332. http://doi.acm.org/10.1145/1978942.1979138","paperID":"None"},{"content":"Jie Song, Gabor Soros, Fabrizio Pece, Sean Ryan Fanello, et al. 2014. In-air Gestures Around Unmodified Mobile Devices. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 319-329. http://doi.acm.org/10.1145/2642918.2647373","paperID":"None"},{"content":"Jurgen Steimle, Andreas Jordt, and Pattie Maes. 2013. Flexpad: A Highly Flexible Handheld Display. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 2873-2874. http://doi.acm.org/10.1145/2468356.2479555","paperID":"None"},{"content":"Taichi Tajika, Tomoko Yonezawa, and Noriaki Mitsunaga. 2008. Intuitive Page-turning Interface of e-Books on Flexible e-Paper Based on User Studies. In Proceedings of the 16th ACM International Conference on Multimedia (MM '08). ACM, NY, NY, USA, 793-796. http://doi.acm.org/10.1145/1459359.1459489","paperID":"None"},{"content":"Aneesh P. Tarun, Peng Wang, Audrey Girouard, Paul Strohmeier, et al. 2013. PaperTab: An Electronic Paper Computer with Multiple Large Flexible Electrophoretic Displays. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 3131-3134. http://doi.acm.org/10.1145/2468356.2479628","paperID":"None"},{"content":"Andrea Vedaldi and Andrew Zisserman. 2012. Efficient Additive Kernels via Explicit Feature Maps. IEEE Transactions on Pattern Analysis and Machine Intelligence 34, 3 (March 2012), 480-492.","paperID":"None"},{"content":"Nicolas Villar, Shahram Izadi, Dan Rosenfeld, Hrvoje Benko, et al. 2009. Mouse 2.0: Multi-touch Meets the Mouse. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, NY, NY, USA, 33-42. http://doi.acm.org/10.1145/1622176.1622184","paperID":"None"},{"content":"Julie Wagner, Stephane Huot, and Wendy Mackay. 2012. BiTouch and BiPad: Designing Bimanual Interaction for Hand-held Tablets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2317-2326. http://doi.acm.org/10.1145/2207676.2208391","paperID":"None"},{"content":"Daniel Wigdor, Clifton Forlines, Patrick Baudisch, John Barnwell, and Chia Shen. 2007. Lucid Touch: A See-through Mobile Device. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, NY, NY, USA, 269-278. http://doi.acm.org/10.1145/1294211.1294259","paperID":"None"},{"content":"Raphael Wimmer and Sebastian Boring. 2009. HandSense: Discriminating Different Ways of Grasping and Holding a Tangible User Interface. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (TEI '09). ACM, NY, NY, USA, 359-362. http://doi.acm.org/10.1145/1517664.1517736","paperID":"None"},{"content":"Yota Devices. 2015. http://yotaphone.com. (2015).","paperID":"None"},{"content":"Martin Zirkl, Anurak Sawatdee, Uta Helbig, Markus Krause, et al. 2011. An All-Printed Ferroelectric Active Matrix Sensor Network Based on Only Five Functional Materials Forming a Touchless Control Interface. Advanced Materials 23, 18 (2011), 2069-2074. http://dx.doi.org/10.1002/adma.201100054","paperID":"None"}],"abstract":"FlexCase is a novel flip cover for smartphones, which brings flexible input and output capabilities to existing mobile phones. It combines an e-paper display with a pressure- and bend-sensitive input sensor to augment the capabilities of a phone. Due to the form factor, FlexCase can be easily transformed into several different configurations, each with different interaction possibilities. Users can use FlexCase to perform a variety of touch, pressure, grip and bend gestures in a natural manner, much like interacting with a sheet of paper. The secondary e-paper display can act as a mechanism for providing user feedback and persisting content from the main display. In this paper, we explore the rich design space of FlexCase and present a number of different interaction techniques. Beyond, we highlight how touch and flex sensing can be combined to support a novel type of gestures, which we call Grip & Bend gestures. We also describe the underlying technology and gesture sensing algorithms. Numerous applications apply the interaction techniques in convincing real-world examples, including enhanced e-paper reading and interaction, a new copy and paste metaphor, high degree of freedom 3D and 2D manipulation, and the ability to transfer content and support input between displays in a natural and flexible manner.","title":"FlexCase: Enhancing Mobile Interaction with a Flexible Sensing and Display Cover","filename":"CHI16/p5138","authors":["Christian Rendl","David Kim","Patrick Parzer","Sean Fanello","Martin Zirkl","Gregor Scheipl","Michael Haller","Shahram Izadi"],"conference":"CHI '16"}