{"paperId":2858062,"citation":[],"abstract":"Fostering intrinsic motivation with interactive applications can increase the enjoyment that people experience when using technology, but can also translate into more invested effort. We propose that identifying with an avatar in a game will increase the intrinsic motivation of the player. We analyzed data from 126 participants playing a custom endless runner game and show that similarity identification, embodied identification, and wishful identification increases autonomy, immersion, invested effort, enjoyment, and positive affect. We also show that greater identification translates into motivated behaviour as operationalized by the time that players spent in an unending version of the infinite runner. Important for the design of games for entertainment and serious purposes, we discuss how identification with an avatar can be facilitated to cultivate intrinsic motivation within and beyond games.","reference":[{"content":"http://www.theesa.com/wpcontent/uploads/2015/04/ESA-Essential-Facts2015.pdf - accessed 24th of Sept. 2015"},{"content":"http://theesa.ca/wp-content/uploads/2014/11/ESACEssential-Facts-2014.pdf - accessed 24th of Sept. 2015"},{"content":"http://www.mcvuk.com/news/read/more-money-isspent-on-games-than-movies-and-music-combinedsays-ihs/0151059 - accessed 24th of Sept. 2015"},{"content":"Sami Abuhamdeh, Mihaly Csikszentmihalyi, and Baland Jalal. 2015. Enjoying the possibility of defeat: Outcome uncertainty, suspense, and intrinsic motivation. Motivation and Emotion, 39 (1), 1--10. http://dx.doi.org/10.1007/s11031-014--9425--2","paperID":"None"},{"content":"Katherine Bessière, A. Fleming Seay, and Sara Kiesler. 2007. The ideal elf: Identity exploration in World of Warcraft. Cyber-Psychology & Behavior, 10 (4), 530535. http://dx.doi.org/10.1089/cpb.2007.9994","paperID":"None"},{"content":"Max Birk and Regan L. Mandryk. 2013. Control your game-self: effects of controller type on enjoyment, motivation, and personality in game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 685--694. http://dx.doi.org/10.1145/2470654.2470752.","paperID":"None"},{"content":"Max V. Birk, Dereck Toker, Regan L. Mandryk, and Cristina Conati. 2011. Modeling Motivation in a Social Network Game using Player-Centric Traits and Personality Traits. In Proceedings of the 23rd Conference on User Modelling, Adaptation, and Personalization UMAP '11. Dublin, Ireland, 18--30. http://dx.doi.org/10.1007/978--3--319--20267--9_2","paperID":"None"},{"content":"Max V. Birk, Regan L. Mandryk, Matthew K. Miller, and Kathrin M. Gerling. 2015. How Self-Esteem Shapes our Interactions with Play Technologies. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, NY, NY, USA, 35--45. http://dx.doi.org/10.1145/2793107.2793111","paperID":"None"},{"content":"Jason Bowey, Max V. Birk, and Regan L. Mandryk. 2015. Manipulating Leaderboards to Induce Player Experience. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, NY, NY, USA, 115--120. http://dx.doi.org/10.1145/2793107.2793138","paperID":"None"},{"content":"Jeanne H. Brockmyer, Christine M. Fox, Kathleen A. Curtiss, Evan McBroom, Kimberly M. Burkhart, and Jacquelyn N. Pidruzny. 2009. The development of the Game Engagement Questionnaire: A measure of engagement in video game-playing. Journal of Experimental Social Psychology, 45(4), 624--634. http://dx.doi.org/10.1093/iwc/iwt003","paperID":"None"},{"content":"Edward Castronova. 2004. The price of bodies: A hedonic pricing model of avatar attributes in a synthetic world. Kyklos, 57(2), 173--196. http://dx.doi.org/10.1111/j.0023--5962.2004.00249.x","paperID":"None"},{"content":"Terry L. Childers, Christopher L. Carr, Joann Peck, and Stephen Carson. 2002. Hedonic and utilitarian motivations for online retail shopping behavior. Journal of Retailing, 77(4), 511--535. http://dx.doi.org/10.1016/s0022--4359(01)00056--2","paperID":"None"},{"content":"Nicole Crenshaw, and Bonnie Nardi. 2014. What's in a name?: naming practices in online video games. In Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play (CHI PLAY '14). ACM, NY, NY, USA, 67--76. http://dx.doi.org/10.1145/2658537.2658685","paperID":"None"},{"content":"Jonathan Cohen. 2001. Defining identification: A theoretical look at the identification of audiences with media characters. Mass Communication & Society, 4(3), 245--264. http://dx.doi.org/10.1207/s15327825mcs0403_01","paperID":"None"},{"content":"Seth Cooper, Firas Khatib, Adrien Treuille, Janos Barbero, Jeehyung Lee, Michael Beenen, Andrew LeaverFay, David Baker, and Zoran Popović. 2010. Predicting protein structures with a multiplayer online game. Nature 466(7307), 756--760. http://dx.doi.org/10.1038/nature09304","paperID":"None"},{"content":"Edward L. Deci, and Richard M. Ryan. 2000. The \"what\" and \"why\" of goal pursuits: Human needs and the self-determination of behavior. Psychological Inquiry 11 (4), 227--268. http://dx.doi.org/10.1207/s15327965pli1104_01","paperID":"None"},{"content":"T. A. Dennis and L. J. O'Toole. 2014. Mental Health on the Go: Effects of a Gamified Attention-Bias Modification Mobile Application in Trait-Anxious Adults. Clinical Psychological Science 2 (5), 576--590. http://dx.doi.org/10.1177/2167702614522228","paperID":"None"},{"content":"Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: defining \"gamification\". In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (MindTrek '11). ACM, NY, NY, USA, 9--15. http://doi.acm.org/10.1145/2181037.2181040","paperID":"None"},{"content":"Nicolas Ducheneaut, Ming-Hui Wen, Nicholas Yee, and Greg Wadley. 2009. Body and mind: a study of avatar personalization in three virtual worlds. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1151--1160. http://doi.acm.org/10.1145/1518701.1518877","paperID":"None"},{"content":"Andy Field. 2013. Discovering statistics using IBM SPSS statistics. Sage Publications Inc., London, UK.","paperID":"None"},{"content":"Tracy Fullerton. 2014. Game design workshop: a playcentric approach to creating innovative games. Taylor & Francis Ltd., Leiden, Netherlands","paperID":"None"},{"content":"Melvin E. Gonnerman, Christopher P. Parker, Howard Lavine, and Joseph Huff. 2000. The relationship between self-discrepancies and affective states: The moderating roles of self-monitoring and standpoints on the self. Personality and Social Psychology Bulletin, 26(7) 810--819. http://dx.doi.org/10.1177/0146167200269006","paperID":"None"},{"content":"David J. Hauser and Norbert Schwarz. 2015. Attentive Turkers: MTurk participants perform better on online attention checks than do subject pool participants. Behavior Research Methods, 1--8 . http://dx.doi.org/10.3758/s13428-015-0578-z","paperID":"None"},{"content":"Michael D. Hanus, and Jesse Fox. 2015. Persuasive avatars: The effects of customizing a virtual salesperson's appearance on brand liking and purchase intentions. International Journal of Human-Computer Studies 84, 33--40. http://dx.doi.org/10.1016/j.ijhcs.2015.07.004","paperID":"None"},{"content":"Alexander Hars, and Shaosong Ou. 2001. Working for free? Motivations of participating in open source projects. Proceedings of the 34th Annual Hawaii International Conference on System Sciences 2001, 9. http://dx.doi.org/10.1109/hicss.2001.927045","paperID":"None"},{"content":"Andrew F Hayes. 2013. Introduction to mediation, moderation, and conditional process analysis: A regression-based approach. Guilford Press, NY, NY.","paperID":"None"},{"content":"Dorothée Hefner, Christoph Klimmt, and Peter Vorderer. 2007. Identification with the player character as determinant of video game enjoyment. In Entertainment Computing (ICEC), 39--48. http://dx.doi.org/10.1007/978--3--540--74873--1_6","paperID":"None"},{"content":"Cynthia Hoffner. 1996. Children's wishful identification and parasocial interaction with favorite television characters. Journal of Broadcasting & Electronic Media, 40(3), 389--402. http://dx.doi.org/10.1080/08838159609364360","paperID":"None"},{"content":"Cynthia Hoffner, and Martha Buchanan. 2005. Young adults' wishful identification with television characters: The role of perceived similarity and character attributes. Media Psychology, 7(4), 325--351. http://dx.doi.org/10.1207/s1532785xmep0704_2","paperID":"None"},{"content":"Zaheer Hussain, and Mark D. Griffiths. 2008. Gender swapping and socializing in cyberspace: An exploratory study. Cyber-Psychology & Behavior, 11(1), 47--53. http://dx.doi.org/10.1089/cpb.2007.0020","paperID":"None"},{"content":"Rilla Khaled, Ronald Fischer, James Noble, and Robert Biddle. 2008. A Qualitative Study of Culture and Persuasion in a Smoking Cessation Game. In Persuasive Technology, 224--236. http://dx.doi.org/10.1007/978--3540--68504--3_20","paperID":"None"},{"content":"Youjeong Kim, and S. Shyam Sundar. 2012. Visualizing ideal self vs. actual self through avatars: Impact on preventive health outcomes. Computers in Human Behavior 28 (4), 1356--1364. http://dx.doi.org/10.1016/j.chb.2012.02.021","paperID":"None"},{"content":"Christoph Klimmt, Dorothée Hefner, and Peter Vorderer. 2009. The Video Game Experience as \"True\" Identification: A Theory of Enjoyable Alterations of Players' Self-Perception. Communication theory 19, (4), 351--373. http://dx.doi.org/10.1111/j.14682885.2009.01347.x","paperID":"None"},{"content":"Christoph Klimmt, Dorothée Hefner, Peter Vorderer, Christian Roth, and Christopher Blake. 2010. Identification with video game characters as automatic shift of self-perceptions. Media Psychology, 13(4), 323--338. http://dx.doi.org/10.1080/15213269.2010.524911","paperID":"None"},{"content":"Elly A. Konijn, Marije Nije Bijvank, and Brad J. Bushman. 2007. I wish I were a warrior: the role of wishful identification in the effects of violent video games on aggression in adolescent boys. Developmental Psychology, 43(4), 1038. http://dx.doi.org/10.1037/0012--1649.43.4.1038","paperID":"None"},{"content":"Ian J. Livingston, Carl Gutwin, Regan L. Mandryk, and Max Birk. 2014. How Players value their Characters in World of Warcraft. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 1333--1343. http://dx.doi.org/10.1145/2531602.2531661","paperID":"None"},{"content":"Bride Mallon and Brian Webb. 2005. Stand up and take your place: identifying narrative elements in narrative adventure and role-play games. In Computer Entertainment, 3(1), 6--6. http://doi.acm.org/10.1145/1057270.1057285","paperID":"None"},{"content":"Winter Mason, and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior Research Methods, 44(1), 1--23. http://dx.doi.org/10.3758/s13428-011-0124--6","paperID":"None"},{"content":"Edward McAuley, Terry Duncan, and Vance V. Tammen. 1989. Psychometric properties of the Intrinsic Motivation Inventory in a competitive sport setting: A confirmatory factor analysis. Research Quarterly for Exercise and Sport, 60(1), 48--58. http://dx.doi.org/10.1080/02701367.1989.10607413","paperID":"None"},{"content":"Daniel G. McDonald, and Hyeok Kim. 2001. When I die, I feel small: Electronic game characters and the social self. Journal of Broadcasting & Electronic Media, 45(2), 241--258. http://dx.doi.org/10.1207/s15506878jobem4502_3","paperID":"None"},{"content":"David R. Michael, and Sandra L. Chen. 2005. Serious games: Games that educate, train, and inform. Cengage Learning PTR.","paperID":"None"},{"content":"Emily MoyerGusé, and Robin L. Nabi. 2010. Explaining the effects of narrative in an entertainment television program: Overcoming resistance to persuasion. Human Communication Research, 36(1), 26--52. http://dx.doi.org/10.1111/j.1468--2958.2009.01367.x","paperID":"None"},{"content":"Emily MoyerGusé, Adrienne H. Chung, and Parul Jain. 2011. Identification with characters and discussion of taboo topics after exposure to an entertainment narrative about sexual health. Journal of Communication, 61, (3), 387--406. http://dx.doi.org/10.1111/j.14602466.2011.01551.x","paperID":"None"},{"content":"Tobias Greitemeyer and Silvia Osswald. 2010. Effects of prosocial video games on prosocial behavior. Journal of Personality and Social Psychology 98(2), 211--221. http://dx.doi.org/10.1037/a0016997","paperID":"None"},{"content":"Sheila C. Murphy. 2004 'Live in your world, play in ours': The spaces of video game identity. Journal of Visual Culture, 3(2), 223--238. http://dx.doi.org/10.1177/1470412904044801","paperID":"None"},{"content":"Carman Neustaedter and Elena Fedorovskaya. 2009. Presenting identity in a virtual world through avatar appearances. In Proceedings of Graphics Interface (GI '09). Canadian Information Processing Society, Toronto, ON, Canada, 183--190.","paperID":"None"},{"content":"Andrew K. Przybylski, Netta Weinstein, Kou Murayama, Martin F. Lynch, and Richard M. Ryan. 2011. The Ideal Self at Play The Appeal of Video Games That Let You Be All You Can Be. Psychological science, 23(1), 69--76, http://dx.doi.org/10.1177/0956797611418676","paperID":"None"},{"content":"Andrew K. Przybylski,, C. Scott Rigby, and Richard M. Ryan. 2010. A motivational model of video game engagement. Review of General Psychology, 14 (2), 154. http://dx.doi.org/10.1037/a0019440","paperID":"None"},{"content":"Beatrice Rammstedt, and Oliver P. John. 2007. Measuring personality in one minute or less: A 10-item short version of the Big Five Inventory in English and German. Journal of Research in Personality, 41(1), 203212. http://dx.doi.org/10.1016/j.jrp.2006.02.001","paperID":"None"},{"content":"C. Scott Rigby, and Andrew K. Przybylski. 2009. Virtual worlds and the learner hero How today's video games can inform tomorrow's digital learning environments. Theory and Research in Education 7(2), 214--223. http://dx.doi.org/10.1177/1477878509104326","paperID":"None"},{"content":"Richard M. Ryan, Richard Koestner, and Edward L. Deci. 1991. Ego-involved persistence: When freechoice behavior is not intrinsically motivated. Motivation and Emotion, 15(3), 185--205. http://dx.doi.org/10.1007/bf00995170","paperID":"None"},{"content":"Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and Emotion, 30(4), 344--360. http://dx.doi.org/10.1007/s11031-006--9051--8","paperID":"None"},{"content":"Richard M. Ryan, Heather Patrick, Edward L. Deci, and Geoffrey C. Williams. 2008. Facilitating health behaviour change and its maintenance: Interventions based on self-determination theory. European Health Psychologist 10 (1), 2--5.","paperID":"None"},{"content":"Carol Sansone, Charlene Weir, Lora Harpster, and Carolyn Morgan. 1992. Once a boring task always a boring task? Interest as a self-regulatory mechanism. Journal of Personality and Social Psychology, 63, (3), 379. http://dx.doi.org/10.1037//0022--3514.63.3.379","paperID":"None"},{"content":"Edward F. Schneider. 2004. Death with a Story: How Story Impacts Emotional, Motivational, and Physiological Responses to First-Person Shooter Video Games. Human Communication Research, 30 (3), 361--375. http://dx.doi.org/10.1111/j.1468--2958.2004.tb00736.x","paperID":"None"},{"content":"Mike Sheinin and Carl Gutwin. 2014. Jelly Polo: Increasing Richness and Competition in Sports Games Using Small-Scale Exertion. In Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play (CHI PLAY '14). ACM, NY, NY, USA, 367--370. http://doi.acm.org/10.1145/2658537.2662981","paperID":"None"},{"content":"David Smahel, Lukas Blinka, and Ondrej Ledabyl. 2008. Playing MMORPGs: Connections between addiction and identifying with a character. Cyber-Psychology & Behavior, 11 (6), 715--718. http://dx.doi.org/10.1089/cpb.2007.0210","paperID":"None"},{"content":"Sharon T. Steinemann, Elisa D. Mekler, and Klaus Opwis. 2015. Increasing Donating Behavior Through a Game for Change: The Role of Interactivity and Appreciation. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, NY, NY, USA, 319--329. http://dx.doi.org/10.1145/2793107.2793125","paperID":"None"},{"content":"Penelope Sweetser, and Peta Wyeth. 2005. GameFlow: a model for evaluating player enjoyment in games. Computers in Entertainment (CIE'05) 3(3),3--3. http://dx.doi.org/10.1145/1077246.1077253","paperID":"None"},{"content":"Bill Tomlinson. 2005. From linear to interactive animation: how autonomous characters change the process and product of animating. Computer Entertainment. 3, (1), 5--5. http://doi.acm.org/10.1145/1057270.1057282","paperID":"None"},{"content":"Sabine Trepte, and Leonard Reinecke. 2010. Avatar Creation and Video Game Enjoyment. Journal of Media Psychology, 22 (4), 171--184. http://dx.doi.org/10.1027/1864--1105/a000022","paperID":"None"},{"content":"Jason VandenBerghe. 2014. Keynote: Engines of Play, CHI Play'14, http://goo.gl/dQvc3i - accessed 24th of Sept. 2015","paperID":"None"},{"content":"Jan Van Looy, Cédric Courtois, Melanie De Vocht, and Lieven De Marez. 2012. Player identification in online games: Validation of a scale for measuring identification in MMOGs. Media Psychology, 15(2), 197--221. http://dx.doi.org/10.1080/15213269.2012.674917","paperID":"None"},{"content":"Asimina Vasalou, and Adam N. Joinson. 2009. Me, Myself and I: The Role of Interactional Context on Self-Presentation through Avatars. Computers in Human Behavior, 25 (2), 510--520. http://dx.doi.org/10.1016/j.chb.2008.11.007","paperID":"None"},{"content":"Eva A.Van Reijmersdal, Jeroen Jansz, Oscar Peters, and Guda Van Noort. 2013. Why girls go pink: Game character identification and game-players' motivations. Computers in Human Behavior, 29(6), 2640--2649. http://dx.doi.org/10.1016/j.chb.2013.06.046","paperID":"None"},{"content":"David Watson, Lee A. Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: the PANAS scales. Journal of Personality and Social Psychology, 54(6), 1063. http://dx.doi.org/10.1037/0022--3514.54.6.1063","paperID":"None"},{"content":"Nick Yee. 2006. Motivations for play in online games. Cyber-Psychology & Behavior, 9(6), 772--775. http://dx.doi.org/10.1037/t32427-000","paperID":"None"},{"content":"Nick Yee, and Jeremy Bailenson. 2007. The Proteus effect: The effect of transformed self-representation on behavior. Human Communication Research, 33(3), 271--290. http://dx.doi.org/10.1111/j.14682958.2007.00299.x","paperID":"None"},{"content":"David Zendle, Paul Cairns, and Daniel Kudenko. 2015. Higher Graphical Fidelity Decreases Players' Access to Aggressive Concepts in Violent Video Games.\" In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, pp. 241--251. ACM, 2015. http://dx.doi.org/10.1145/2793107.2793113","paperID":"None"}],"title":"Fostering Intrinsic Motivation through Avatar Identification in Digital Games","filename":"CHI16/p2982","authors":["Max V. Birk","Cheralyn Atkins","Jason T. Bowey","Regan L. Mandryk"],"conference":"CHI '16"}