{"paperId":2858541,"abstract":"People accumulate huge assortments of virtual possessions, but it is not yet clear how systems and system designers can help people make meaning from these large archives. Early research in HCI has suggested that people generally appear to value their virtual things less than their material things, but theory on material possessions does not entirely explain this difference. To investigate if changes to the form and behavior of virtual things may surface valued elements of a virtual archive, we designed a technology probe that selected snippets from old emails and mailed them as physical postcards to participating households. The probe uncovered features of emails that trigger meaningful reflection, and how contextual information can help people engage in reminiscence. Our study revealed insights about how materializing virtual possessions influences factors shaping how people draw on, understand, and value those possessions. We conclude with implication and strategies for aimed at supporting people in having more meaningful interactions and experiences with their virtual possessions.","citation":[],"reference":[{"content":"Aaron D. Ahuvia. 2005. Beyond the extended self: Loved objects and consumers' identity narratives. Journal of Consumer Research 32, 1: 171--184.","paperID":"None"},{"content":"Russell Belk. 1998. Possessions and Self. John Wiley & Sons, Ltd.","paperID":"None"},{"content":"Russell W. Belk. 2013. Extended self in a digital world. Journal of Consumer Research 40, 3: 477--500.","paperID":"None"},{"content":"Abhay Bhushan, Ken Pogran, Ray Tomlinson, and Jim White. 1973. RFC #561: Standardizing Network Mail Headers. Retrieved from https://tools.ietf.org/html/rfc733","paperID":"None"},{"content":"Kirsten Boehner, Janet Vertesi, Phoebe Sengers, and Paul Dourish. 2007. How HCI interprets the probes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 1077--1086.","paperID":"None"},{"content":"Barry Brown and Abigail Sellen. 2006. Sharing and listening to music. In Consuming music together: social and collaborative aspects of music. K. O'Hara and B. Brown (eds.), Springer Netherlands, 37--56.","paperID":"None"},{"content":"Moira Burke, Robert Kraut, and Cameron Marlow. 2011. Social capital on Facebook: differentiating uses and users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 571--580.","paperID":"None"},{"content":"Dan Cosley, Victoria Schwanda Sosik, Jonathan Schultz, S. Tejaswi Peesapati, and Soyoung Lee. 2012. Experiences with designing tools for everyday reminiscing. Journal of Human-Computer Interaction, 27, 1--2: 175--198.","paperID":"None"},{"content":"Andy Crabtree, Tom Rodden, Terry Hemmings, and Steve Benford. 2003. Finding a place for UbiComp in the home. In Proceedings of the 5th International Conference on Ubiquitous Computing, 208--226.","paperID":"None"},{"content":"Mihaly Csikszenthmihalyi and Eugene RochbergHalton. 1981. The Meaning of Things: Domestic Symbols and the Self. Cambridge University Press.","paperID":"None"},{"content":"Doménique van Gennip, Elise van den Hoven, and Panos Markopoulos. 2015. Things that make us reminisce: Everyday memory cues as opportunities for interaction design. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, NY, NY, USA, 3443--3452.","paperID":"None"},{"content":"Erving Goffman. 1959. The presentation of self in everyday life. Anchor Books.","paperID":"None"},{"content":"Connie Golsteijn, Elise van den Hoven, David Frohlich, and Abigail Sellen. 2012. Towards a more cherishable digital object. In Proceedings of the 2012 Conference on Designing Interactive Systems (DIS '12). ACM, NY, NY, USA, 655--664.","paperID":"None"},{"content":"Lars Hallnäs and Johan Redström. 2001. Slow technology -- Designing for reflection. In Proceedings of the 2001 ACM International Conference on Personal and Ubiquitous Computing. ACM, NY, NY, USA, 201--212.","paperID":"None"},{"content":"Sudheendra Hangal, Monica S. Lam, and Jeffrey Heer. 2011. MUSE: Reviving memories using email archives. In Proceedings of the 24th annual ACM symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 75--84.","paperID":"None"},{"content":"Daniel Hawkins, Carman Neustaedter, and Jason Procyk. 2015. Postulater: the design and evaluation of a time-delayed media sharing system. In Proceedings of the 41st Graphics Interface Conference. Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 249--256.","paperID":"None"},{"content":"Catherine Hobbs. 2001. The character of personal archives: Reflections on the value of records of individuals. Archivaria 52: 126--135.","paperID":"None"},{"content":"Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 17--24.","paperID":"None"},{"content":"William James. 1890. The Principles of Psychology. Henry Holt, NY.","paperID":"None"},{"content":"William Jones. 2007. Personal information management. In Annual Review of Information Science and Technology 41, 1, 453--504.","paperID":"None"},{"content":"Chris Kennedy. 2005. 'Just perfect!': The pragmatics of evaluation in holiday postcards. In Discource, communication, and tourism. A. Jaworski and A. Pritchard (eds.), Channel View Publications, 223--246.","paperID":"None"},{"content":"Liadh Kelly, Yi Chen, Marguerite Fuller, and Gareth J.F. Jones. 2008. A study of remembered context for information access from personal digital archives. In Proceedings of the Second International Symposium on Information Interaction in Context, 44--50.","paperID":"None"},{"content":"David Kirk, Abigail Sellen, Carsten Rother, and Ken Wood. 2006. Understanding photowork. In Proceedings of the ACM Conference on Human Factors in Computing Systems, Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (eds.). ACM, NY, NY, USA, 761--770.","paperID":"None"},{"content":"David Kirk, Abigail Sellen, Richard Harper, and Ken Wood. 2007. Understanding videowork. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 61--70.","paperID":"None"},{"content":"Robert E. Kleine and Susan Schultz Kleine. 2000. Consumption and self-schema changes throughout the identity project life cycle. Advances in Consumer Research, 27, 279--285.","paperID":"None"},{"content":"Susan Schultz Kleine and Stacey Menzel Baker. 2004. An integrative review of material possession attachment. Academy of Marketing Science Review 1, 1: 1--39.","paperID":"None"},{"content":"Siân E. Lindley, Catherine C. Marshall, Richard Banks, Abigail Sellen, and Tim Regan. 2013. Rethinking the web as a personal archive. In Proceedings of the 22nd International Conference on World Wide Web, 749--760.","paperID":"None"},{"content":"Catherine C. Marshall. 2007. How people manage personal information over a lifetime. Personal Information Management, 57--75.","paperID":"None"},{"content":"Catherine C. Marshall and Frank M. Shipman. 2014. An argument for archiving Facebook as a heterogeneous personal store. In Proceedings of the 14th ACM/IEEE-CS Joint Conference on Digital Libraries, 11--20.","paperID":"None"},{"content":"Kathryn McGarr. 9 Reasons to Archive. 2008. Retrieved from: http://gmailblog.blogspot.com/2008/04/9-reasonsto-archive.html","paperID":"None"},{"content":"Matthew B. Miles, A. Michael Huberman, and Johnny Saldaña. 2013. Qualitative data analysis: A methods sourcebook. SAGE Publications, Incorporated.","paperID":"None"},{"content":"Daniel Miller and Fiona Parrott. 2009. Loss and material culture. Journal of the Royal Anthropological Institute 15, 3: 502--519.","paperID":"None"},{"content":"Rani Molla. Gmail finally beats Hotmail, according to third-party data. 2012. Retrieved from: http://gigaom.com/2012/10/31/gmail-finally-beatshotmail-according-to-third-party-data-chart/","paperID":"None"},{"content":"Tiffany Ng, Ou Jie Zhao, and Dan Cosley. 2011. pieTime: Visualizing Communication Patterns. In Proceedings of Privacy, Security, Risk and Trust, 720--723.","paperID":"None"},{"content":"William Odom, Abigail J. Sellen, Richard Banks, David S. Kirk, Tim Regan, Mark Selby, Jodi L. Forlizzi, and John Zimmerman. 2014. Designing for slowness, anticipation and re-visitation: a long term field study of the photobox. In Proceedings of the 32nd annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1961--1970.","paperID":"None"},{"content":"William Odom, John Zimmerman, and Jodi Forlizzi. 2011. Teenagers and their virtual possessions: Design opportunities and issues. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1491--1500.","paperID":"None"},{"content":"William Odom, John Zimmerman, Jodi Forlizzi, Hajin Choi, Stephanie Meier, and Angela Park. 2012. Investigating the presence, form and behavior of virtual possessions in the context of a teen bedroom. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 327--336.","paperID":"None"},{"content":"William Odom, John Zimmerman, and Jodi Forlizzi. 2014. Placelessness, spacelessness, and formlessness: Experiential qualities of virtual possessions. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA, 985--994.","paperID":"None"},{"content":"William Odom. 2015. Understanding long-term interactions with a slow technology: An investigation of experiences with FutureMe. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 575--584.","paperID":"None"},{"content":"S. Tejaswi Peesapati, Victoria Schwanda, Johnathon Schultz, Matt Lepage, So-yae Jeong, and Dan Cosley. 2010. Pensieve: Supporting everyday reminiscence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2027--2036.","paperID":"None"},{"content":"Daniela Petrelli, Simon Bowen, Nick Dulake, and Ann Light. 2012. Digital Christmas: An exploration of festive technology. In Proceedings of Designing Interactive System Conference (DIS '12). ACM, NY, NY, USA, 348--357.","paperID":"None"},{"content":"Daniela Petrelli and Steve Whittaker. 2010. Family memories in the home: Contrasting physical and digital mementos. Personal and Ubiquitous Computing 14, 2: 153--169.","paperID":"None"},{"content":"Linda L. Price, Eric J. Arnould, and Carolyn Folkman Curasi. 2000. Older consumers' disposition of special possessions. Journal of Consumer Research 27, 179--201.","paperID":"None"},{"content":"Catherine A. Roster. 2001. Letting go: The process and meaning of dispossession in the lives of consumers. Advances in Consumer Research 28, 425--430.","paperID":"None"},{"content":"Abigail J. Sellen, Andrew Fogg, Mike Aitken, Steve Hodges, Carsten Rother, and Ken Wood. 2007. Do lifelogging technologies support memory for the past?: an experimental study using sensecam. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 81--90.","paperID":"None"},{"content":"Victoria Schwanda Sosik, Xuan Zhao, and Dan Cosley. 2012. See friendship, sort of: how conversation and digital traces might support reflection on friendships. In Proceedings of the ACM 2012 Conference on Computer Support Cooperative Work (CSCW '12). ACM, NY, NY, USA, 1145--1154.","paperID":"None"},{"content":"Daniel Smilkov, Deepak Jagdish, and César Hidalgo. Immersion: a people-centric view of your email life. 2013. Retrieved from: https://immersion.media.mit.edu/","paperID":"None"},{"content":"Timehop Application. Retrieved from: http://timehop.com/","paperID":"None"},{"content":"Fernanda B. Viégas, danah boyd, David H. Nguyen, Jeffrey Potter, and Judith Donath. 2004. Digital artifacts for remembering and storytelling: posthistory and social network fragments. In Proceedings of the Hawaii International Conference on System Sciences, 1--10.","paperID":"None"},{"content":"Fernanda B. Viégas, Scott Golder, and Judith Donath. 2006. Visualizing email content: portraying relationships from conversational histories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 979--988.","paperID":"None"},{"content":"Amy Voida, Rebecca E. Grinter, Nicolas Ducheneaut, W. Keith Edwards, and Mark W. Newman. 2005. Listening in: practices surrounding iTunes music sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 191--200.","paperID":"None"},{"content":"Yang Wang and Scott D. Mainwaring. 2008. Humancurrency interaction: learning from virtual currency use in China. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 81--90.","paperID":"None"},{"content":"Peter Williams, Jeremy Leighton, and John Ian Rowland. 2009. The personal curation of digital objects. In Aslib Proceedings 61, 4: 340--363.","paperID":"None"},{"content":"Steve Whittaker. 2011. Personal information management: From information consumption to curation. Annual Review of Information Science and Technology 45, 1.","paperID":"None"},{"content":"Steve Whittaker, Ofer Bergman, and Paul Clough. 2010. Easy on that trigger dad: a study of long term family photo retrieval. In Proceedings of the 2010 ACM International Conference on Personal and Ubiquitous Computing. ACM, NY, NY, USA, 31--43.","paperID":"None"},{"content":"Steve Whittaker, Vaiva Kalnikaite, Daniella Petrelli, Abigail Sellen, Nicolas Villar, Ofer Bergman, Paul Clough, and Jens Brockmeier. 2012. Socio-technical lifelogging: Deriving design principles for a future proof digital past. Journal of Human-Computer Interaction 27, 1--2: 37--62.","paperID":"None"},{"content":"Steve Whittaker, and Candace Sidener. 1996. Email overload: Exploring personal information management of email. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '96). ACM, NY, NY, USA, 276--283.","paperID":"None"},{"content":"Xuan Zhao, Niloufar Salehi, Sasha Naranjit, Sara Alwaalan, Stephen Voida, and Dan Cosley. 2013. The many faces of Facebook: Experiencing social media as performance, exhibition, and personal archive. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1--10.","paperID":"None"},{"content":"Xuan Zhao and Siân Lindley 2014. Curation through use: Understanding the personal value of social media. In Proceedings of the 32nd annual Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2431--2440.","paperID":"None"}],"title":"Mailing Archived Emails as Postcards: Probing the Value of Virtual Collections","filename":"CHI16/p1187","authors":["David B. Gerritsen","Dan Tasse","Jennifer K. Olsen","Tatiana A. Vlahovic","Rebecca Gulotta","William Odom","Jason Wiese","John Zimmerman"],"conference":"CHI '16"}