{"paperId":2858577,"citation":[],"abstract":"This paper introduces a new framework to guide the design of interactive music learning systems, focusing on the piano. Taking a Reflective approach, we identify the implicit assumption behind most existing systems-that learning music is learning to play correctly according to the score-and offer an alternative approach. We argue that systems should help cultivate higher levels of musicianship beyond correctness alone for students of all levels. Drawing from both pedagogical literature and the personal experience of learning to play the piano, we identify three skills central to musicianship-listening, embodied understanding, and creative imagination-which we generalize to the Inspect, Embody, Invent framework. To demonstrate how this framework translates to design, we discuss two existing interfaces from our own research-MirrorFugue and Andante-both built on a digitally controlled player piano augmented by in-situ projection. Finally, we discuss the framework's relevance toward bigger themes of embodied interactions and learning beyond the domain of music.","reference":[{"content":"American Off-Schulwerk Association. What is Orff Schulwerk? http://aosa.org/about/what-is-orffschulwerk/. Accessed: 2015-09-25.","paperID":"None"},{"content":"Berklee. Berklee Online. https://online.berklee.edu/school/courses/music_education. Accessed: 2015-08-25.","paperID":"None"},{"content":"Berlitz. The Berlitz Method. http://www.berlitz.us/berlitz- method/. Accessed: 2015-09-25.","paperID":"None"},{"content":"Ran Blake. 2010. Primacy of the Ear. Lulu.com.","paperID":"None"},{"content":"Casio. Lighted Keys. http://www.casio-usa.com/products/Digital_Pianos_%26_Keyboards/Lighted_Keys/. Accessed: 2015-09-20.","paperID":"None"},{"content":"Mihaly Csikszentmihalyi. 1990. Flow: the Psychology of Optimal Experience. Harper Perennial.","paperID":"None"},{"content":"Roger B. Dannenberg, M. Sanchez, A. Joseph, P. Capell, R Joseph, and R Saul. 1990. A Computer-Based Multi-Media Tutor for Beginning Piano Students. Interface - Journal of New Music Research 19 (1990), 155-173. Issue 2--3.","paperID":"None"},{"content":"Paul Dourish. 2004. Where the Action: The Foundations of Embodied Interaction. The MIT Press.","paperID":"None"},{"content":"Claire-Lise Dutoit. 1965. Music Movement Therapy. The Riverside Press.","paperID":"None"},{"content":"Betty Edwards. 1989. Drawing on the Right Side of the Brain. Tarcher.","paperID":"None"},{"content":"Y. Fukuya, Takegawa Y., and H. Yanagi. 2013. A Piano Learning Support System Considering Motivation. (2013).","paperID":"None"},{"content":"Rolf Inge Godoy and Marc Leman (Eds.). 2010. Musical Gestures: Sound, Movement, and Meaning. Routeledge.","paperID":"None"},{"content":"W. Goebl and G. Widmer. 2006. Unobtrusive Practice Tools for Pianists. In Proceedings of the 9th International Conference on Music Perception and Cognition.","paperID":"None"},{"content":"Lucy Green. 2002. How Popular Musicians Learn: A Way Ahead for Music Education. Ashgate Publishing, Ltd.","paperID":"None"},{"content":"A. Hadjakos, E. Aitenbichler, and M. Mühlhäuser. 2008. The Elbow Piano: Signification of Piano Playing Movements. In Proceedings of NIME '08.","paperID":"None"},{"content":"Kristina Höök. 2010. Transferring Qualities from Horseback Riding to Design. In Proc. NordiCHI '10.","paperID":"None"},{"content":"Kevin Huang, Ellen Yi-Luen Do, and Thad Starner. 2008. PianoTouch: A Wearable Haptic Piano Instruction System for Passive Learning of Piano Skills. In Proc. ISWC '08. IEEE Computer Society, Washington, DC, USA, 41-44.","paperID":"None"},{"content":"Caroline Hummels, Kees C. Overbeeke, and Sietske Klooster. 2007. Move to Get Moved: A Search for Methods, Tools and Knowledge to Design for Expressive and Rich Movement-based Interaction. Personal Ubiquitous Comput. 11, 8 (Dec. 2007).","paperID":"None"},{"content":"Vijay S. Iyer. 1998. Microstructures of Feel, Macrostructures of Sound: Embodied Cognition in West African and Africa-American Musics. Ph.D. Dissertation. UC Berkeley.","paperID":"None"},{"content":"Emile Jacques-Dalcroze. 1967. Rhythm, Music, and Education. The Riverside Press.","paperID":"None"},{"content":"Alan Kay. Doing with Images Makes Symbols. https://archive.org/details/AlanKeyD1987. Accessed: 2015-09-25.","paperID":"None"},{"content":"T. Kitamura and M. Miura. 2006. Constructing a Support System for Self-Learning Playing the Piano at the Beginning Stage. In Proceedings of the 9th International Conference on Music Perception and Cognition.","paperID":"None"},{"content":"Gerald Klickstein. 2009. The Musician's Way: A Guide to Practice, Performance, and Wellness. Oxford University Press.","paperID":"None"},{"content":"George Lakoff and Mark Johnson. 2003. Metaphors We Live By. University of Chicago Press.","paperID":"None"},{"content":"Chih-Chun Lin and Damon Shing-Min Liu. 2006. An Intelligent Virtual Piano Tutor. In Proc. VRCIA '06.","paperID":"None"},{"content":"Synthesia LLC. Synthesia. http://www.synthesiagame.com/. Accessed: 2015-09- 20.","paperID":"None"},{"content":"Lian Loke and Toni Robertson. 2013. Moving and Making Strange: An Embodied Approach to Movement-based Interaction Design. ACM Trans. Comput.-Hum. Interact. 20, 1 (April 2013).","paperID":"None"},{"content":"Michael Matthews. 18 Benefits of Playing a Musical Instrument. http://www.effectivemusicteaching.com/articles/directors/18-benefits-of-playing-a-musical-instrument/. Accessed: 2015-09-25.","paperID":"None"},{"content":"David McGill. 2007. Sound in Motion: A Performer's Guide to Greater Musical Expression. Indiana University Press.","paperID":"None"},{"content":"Andrew P. McPherson, Adrian Gierakowski, and Adam M. Stark. 2013. The Space Between the Notes: Adding Expressive Pitch Control to the Piano Keyboard. In Proc. CHI '13 (CHI '13).","paperID":"None"},{"content":"P. Molenberghs, R. Cunnington, and J. Mattingley. Is the Mirror Neuron System Involved in Imitation? A short review and meta-analysis. Neuroscience and Biobehavioral Reviews 33, 975-980. Issue 7.","paperID":"None"},{"content":"R. Montes, M. Bedmar, and M. Sol Martin. 1993. EMG Biofeedback of the Abductor Pollicis Brevis in Piano Performance. Biofeedback and Self-Regulation 18, 67-77. Issue 2.","paperID":"None"},{"content":"J. Mora, W.-S. Lee, G. Comeau, S. Shiromohammadi, and A. El Saddik. 2006. Assisted Piano Pedagogy Through 3D Visualization of Piano Playing. (2006).","paperID":"None"},{"content":"Heinrich Neuhaus. 1995. The Art of Piano Playing. Hollowbrook Pub.","paperID":"None"},{"content":"K. Ng and P. Nesi. 2008. i-Maestro: Technology Enhanced Learning and Teaching for Music. In Proceedings of NIME '08.","paperID":"None"},{"content":"Kia C. Ng, Tillman Weyde, Oliver Larkin, Kerstin Neubarth, Thijs Koerselman, and Bee Ong. 2007. 3D Augmented Mirror: A Multimodal Interface for String Instrument Learning and Teaching with Gesture Support. In Proceedings of the 9th International Conference on Multimodal Interfaces (ICMI '07). ACM, New York, NY, USA, 339-345.","paperID":"None"},{"content":"The Swiss Website of Willems Music Education Teachers. Willems Music Teaching System. http://www.willems.ch/en/education.htm. Accessed: 2015-09-25.","paperID":"None"},{"content":"C. Oshima, Y. Miyazawa, and K. Nishimoto. 2002. Color-in Piano: A Piano that Allows a Performer to Concentrate on Musical Expression. In Proceedings of the 7th International Conference on Music Perception and Cognition.","paperID":"None"},{"content":"Chika Oshima, Kazushi Nishimoto, and Norihiro Hagita. 2007. A Piano Duo Support System for Parents to Lead Children to Practice Musical Performances. ACM Trans. Multimedia Comput. Commun. Appl. 3, 2, Article 9 (May 2007).","paperID":"None"},{"content":"Seymour Papert. 1993. Windstorms: Children, Computers, and Powerful Ideas. Basic Books.","paperID":"None"},{"content":"Graham Percival, Ye Wang, and George Tzanetakis. 2007. Effective Use of Multimedia for Computerassisted Musical Instrument Tutoring. In Proc. EMME '07.","paperID":"None"},{"content":"Ken Perlin and Athomas Goldberg. 1996. Improv: A System for Scripting Interactive Actors in Virtual Worlds. Computer Graphics 29, 3 (1996).","paperID":"None"},{"content":"Sebastiaan Pijnappel and Florian Mueller. 2013. 4 Design Themes for Skateboarding. In Proc. CHI '13.","paperID":"None"},{"content":"P. Puentes and P. Godall. 2012. Evaluation of the Dalcroze Rhythmic Approach in First Steos of Music Education. Master project research. Barcelona: UAB.","paperID":"None"},{"content":"Kathleen Riley. 2007. New Views of Piano Playing Through Motion Analysis and MIDI Technology. Journal of Technology in Music Learning 4 (2007), 17-30. Issue 1.","paperID":"None"},{"content":"Katja Rogers, Amrei Röhlig, Matthias Weing, Jan Gugenheimer, Bastian Könings, Melina Klepsch, Florian Schaub, Enrico Rukzio, Tina Seufert, and Michael Weber. 2014. P.I.A.N.O.: Faster Piano Learning with Interactive Projection. In Proc. ITS '14 (ITS '14). ACM, New York, NY, USA, 149-158.","paperID":"None"},{"content":"Thecla Schiphorst. 2011. Self-evidence: Applying Somatic Connoisseurship to Experience Design. In CHI '11 Extended Abstracts.","paperID":"None"},{"content":"N. Schnell, F. Bevilacqua, D. Schwarz, N. Rasamimanana, and F. Guédy. 2006. Technology and Paradigms to Support the Learning of Music Performance. (2006).","paperID":"None"},{"content":"Harold C. Schonberg. 1987. The Great Pianists: From Mozart to the Present. Simon and Schuster.","paperID":"None"},{"content":"Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective Design. In Proc. Critical Computing '05 (CC '05). ACM, New York, NY, USA, 49-58.","paperID":"None"},{"content":"S. Shiromohammadi, A. Khanafar, and G. Comeau. 2006. Midiator A Tool for Analyzing Students' Piano Performance. Revue de recherche en Education Musicale 24 (2006).","paperID":"None"},{"content":"Stephen W. Smoliar, John A. Waterworth, and Peter R. Kellock. 1995. pianoFORTE: A System for Piano Education Beyond Notation Literacy. In Proc. ACM Multimedia '95.","paperID":"None"},{"content":"International Kodály Society. The Kodály Concept. http://www.iks.hu/index.php/home1/the-kodalyconcept. Accessed: 2015-09-25.","paperID":"None"},{"content":"Steinway & Sons. Steinway Artists. http://eu.steinway.com/en/concert-artist/artistsalphabet/. Accessed: 2016-01-07.","paperID":"None"},{"content":"David Sudnow. 1993. Ways of the Hand. The MIT Press.","paperID":"None"},{"content":"Shinichi Suzuki. 1974. The Suzuki Concept: An Introduction to a Successful Method for Early Music Education. Diablo Press.","paperID":"None"},{"content":"Yoshinari Takegawa, Tsutomu Terada, and Masahiko Tsukamoto. 2012. A Piano Learning Support System Considering Rhythm. In Proc. ICMC '12.","paperID":"None"},{"content":"Jakob Tholander and Carolina Johansson. 2010. Design Qualities for Whole Body Interaction: Learning from Golf, Skateboarding and Body Bugging. In Proc. NordiCHI '10.","paperID":"None"},{"content":"Michel Thomas. The Michel Thomas Method. http://www.michelthomas.com/. Accessed: 2015-09-25.","paperID":"None"},{"content":"Mary Toy. 2003. The Video Camera: A Teacher's Best Friend. The Piano Adventures Teacher (2003).","paperID":"None"},{"content":"Type Writing Machine. Scientific American. Vol. 1017. Issue 1.","paperID":"None"},{"content":"F.J. Varela, E. T. Thompson, and E. Rosch. 1992. The Embodied Mind: Cognitive Science and Human Experience. The MIT Press.","paperID":"None"},{"content":"Kenny Werner. 1996. Effortless Mastery: Liberating the Master Musician Within. James Aeberold.","paperID":"None"},{"content":"Abby Whiteside. 1955. Indispensables of Piano Playing. Charles Scribner's Sons.","paperID":"None"},{"content":"Chris Wilson, Google, and Jussi Kalliokoski. Web MIDI API. https://webaudio.github.io/web-midi-api/. Accessed: 2015-06-15.","paperID":"None"},{"content":"Victor Wooten. Music As a Language. http://http://ed.ted.com/lessons/victor-wooten-music-as-alanguage. Accessed: 2014-02-04.","paperID":"None"},{"content":"Craig Wright. 2013. City, Chant and the Topography of Early Music. Harvard University Press, Chapter Quantification in Medieval Paris and How it Changed Western Music.","paperID":"None"},{"content":"Xiao Xiao and Hiroshi Ishii. 2011. MirrorFugue: Communicating Hand Gesture in Remote Piano Collaboration. In Proc. TEI '11.","paperID":"None"},{"content":"Xiao Xiao, Anna Pereira, and Hiroshi Ishii. 2013a. MirrorFugue III: Conjuring the Recorded Pianist. In Proc. NIME '13.","paperID":"None"},{"content":"Xiao Xiao, Basheer Tome, and Hiroshi Ishii. 2013b. Andante:. In Proc. NIME '13.","paperID":"None"},{"content":"Yamaha. Disklavier Pianos. http://usa.yamaha.com/products/musical-instruments/keyboards/disklaviers/. Accessed: 2016-01-07.","paperID":"None"}],"title":"Inspect, Embody, Invent: A Design Framework for Music Learning and Beyond","filename":"CHI16/p5397","authors":["Xiao Xiao","Hiroshi Ishii"],"conference":"CHI '16"}