{"paperId":2858042,"citation":[],"reference":[{"content":"Kath Albury. 2015. Selfies, sexts, and sneaky hats: Young people's understandings of gendered practices of self-representation. International Journal of Communication 9, Feature 1734-1745. http://ijoc.org/index.php/ijoc/article/view/3132/1396","paperID":"None"},{"content":"Jeremy Barksdale, Kori Inkpen, Mary Czerwinski, Aaron Hoff, Paul Johns, Asta Roseway, and Gina Venolia. 2012. Video threads: Asynchronous video sharing for temporally distributed teams. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12), 1101--1104. http://doi.acm.org/10.1145/2145204.2145367","paperID":"None"},{"content":"Bayer, J. B., Ellison, N., Schoenebeck, S., & Falk, E. B. (in press). \"Sharing the Small Moments: Ephemeral Social Interaction on Snapchat.\" Information, Communication & Society.","paperID":"None"},{"content":"Nancy K. Baym. 2015. Personal Connections in the Digital Age, 2nd Edition. Polity Press, Cambridge, MA, USA.","paperID":"None"},{"content":"danah boyd. 2008. Why youth (heart) social network sites: The role of networked publics in teenage social life. In MacArthur Foundation Series on Digital Learning - Youth, Identity, and Digital Media Volume, David Buckingham (ed.). MIT Press, Cambridge, MA, USA, 119--142. http://dx.doi.org/10.1162/dmal.97802625248","paperID":"None"},{"content":"Tatiana Buhler, Carman Neustaedter, and Serena Hillman. 2013. How and why teenagers use video chat. In Proceedings of the 2013 conference on Computer Supported Cooperative Work (CSCW '13), 759--768. http://doi.acm.org/10.1145/2441776.2441861","paperID":"None"},{"content":"Russell W. Burns. 1998. Television: An International History of the Formative Years. Institution of Electrical Engineers, London, UK.","paperID":"None"},{"content":"Anna Cavender, Richard E. Ladner, and Eve A. Riskin. 2006. MobileASL: Intelligibility of sign language video as constrained by mobile phone technology. In Proceedings of the 8th international ACM SIGACCESS conference on Computers and accessibility (Assets '06), 71--78. http://doi.acm.org/10.1145/1168987.1169001.","paperID":"None"},{"content":"Karen Church and Rodrigo de Oliveira. 2013. What's up with WhatsApp?: Comparing mobile instant messaging behaviors with traditional SMS. In Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services (MobileHCI '13), 352--361. http://doi.acm.org/10.1145/2493190.2493225.","paperID":"None"},{"content":"Yanqing Cui, Jari Kangas, Jukka Holm, and Guido Grassel. 2013. Front-camera video recordings as emotion responses to mobile photos shared within close-knit groups. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 981--990. http://doi.acm.org/10.1145/2470654.2466125","paperID":"None"},{"content":"Audubon Dougherty. 2011. Live-streaming mobile video: Production as civic engagement. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11), 425--434. http://doi.acm.org/10.1145/2037373.2037437","paperID":"None"},{"content":"Paul Dourish. 2001. Where the Action is: The Foundations of Embodied Interaction. MIT Press,","paperID":"None"},{"content":"Kathleen E. Finn, Abigail J. Sellen, Sylvia B. Wilbur (eds). 1997. Video-Mediated Communication. L. Erlbaum Associates Inc., Hillsdale, NJ, USA.","paperID":"None"},{"content":"Harold Garfinkel. 1984. Studies in Ethnomethodology. Polity Press, Cambridge, UK.","paperID":"None"},{"content":"Michail N. Giannakos, Konstantinos Chorianopoulos, Kori Inkpen, Honglu Du, and Paul Johns. 2013. Understanding children's behavior in an asynchronous video-mediated communication environment. Personal Ubiquitous Comput. 17, 8 (December 2013), 16211629. http://dx.doi.org/10.1007/s00779-012-0525--2","paperID":"None"},{"content":"Erving Goffman.1959. The Presentation of Self in Everyday Life. Anchor Books, New York, NY, USA.","paperID":"None"},{"content":"Erving Goffman. 1971. Relations in Public: Microstudies of the Public Order. Basic Books, New York, NY, USA.","paperID":"None"},{"content":"Rebecca E. Grinter, Leysia Palen, and Margery Eldridge. 2006. Chatting with teenagers: Considering the place of chat technologies in teen life. ACM Trans. Comput.-Hum. Interact. 13, 4 (December 2006), 423447. http://doi.acm.org/10.1145/1188816.1188817","paperID":"None"},{"content":"Richard H. R. Harper. 2010. Texture: Human Expression in the Age of Communications Overload. MIT Press, Cambridge, MA, USA.","paperID":"None"},{"content":"Steven Harrison. 2009. Media Space: 20+ Years of Mediated Life. Springer-Verlag, London, UK.","paperID":"None"},{"content":"Ryno T. L. Hoorn and Isabella M. Venter. 2011. Using mass video notification methods to assist deaf people. In Proceedings of the South African Institute of Computer Scientists and Information Technologists Conference on Knowledge, Innovation and Leadership in a Diverse, Multidisciplinary Environment (SAICSIT '11), 275--278. http://doi.acm.org/10.1145/2072221.2072256","paperID":"None"},{"content":"Kori Inkpen, Honglu Du, Asta Roseway, Aaron Hoff, and Paul Johns. 2012. Video kids: Augmenting close friendships with asynchronous video conversations in videopal. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2387--2396. http://doi.acm.org/10.1145/2207676.2208400","paperID":"None"},{"content":"David S. Kirk, Abigail Sellen, and Xiang Cao. 2010. Home video communication: Mediating 'closeness'. In Proceedings of the 2010 ACM conference on Computer supported cooperative work (CSCW '10), 135--144. http://doi.acm.org/10.1145/1718918.1718945","paperID":"None"},{"content":"Natasha Lomas. 2014. Yo, The One-Word Messaging App, Updates So It's Not Quite So Absurdly Simple Anymore. TechCrunch. Retrieved March 27, 2015 http://techcrunch.com/2014/08/12/yo-grows-up/","paperID":"None"},{"content":"Christian Licoppe and Julien Morel. 2009. The collaborative work of producing meaningful shots in mobile video telephony. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '09), Article 35, 10 pages. http://doi.acm.org/10.1145/1613858.1613903","paperID":"None"},{"content":"Bronisław Malinowski. 1923. The problem of meaning in primitive languages. In The Meaning of Meaning, Charles K. Ogden and Ivor A. Richards (eds.). Routledge, London, 146--152.","paperID":"None"},{"content":"Carman Neustaedter, Carolyn Pang, Azadeh Forghani, Erick Oduor, Serena Hillman, Tejinder K. Judge, Michael Massimi, and Saul Greenberg. 2015. Sharing domestic life through long-term video connections. ACM Trans. Comput.-Hum. Interact. 22, 1, Article 3 (February 2015), 29 pages. http://doi.acm.org/10.1145/2696869","paperID":"None"},{"content":"Donald A. Norman. 2013. The Design of Everyday Things: Revised and Expanded Edition. Basic Books, New York, NY.","paperID":"None"},{"content":"Kenton O'Hara, Alison Black, and Matthew Lipson. 2006. Everyday practices with mobile video telephony. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 871--880. http://doi.acm.org/10.1145/1124772.1124900","paperID":"None"},{"content":"Kenton P. O'Hara, Michael Massimi, Richard Harper, Simon Rubens, and Jessica Morris. 2014. Everyday dwelling with WhatsApp. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14), 1131--1143. http://doi.acm.org/10.1145/2531602.2531679","paperID":"None"},{"content":"Hyesook Kim, Andrew Monk, Gavin Wood, Mark Blythe, Jayne Wallace, and Patrick Olivier. 2013. TimelyPresent: Connecting families across continents. Int. J. Hum.-Comput. Stud. 71, 10 (October 2013), 1003--1011. http://dx.doi.org/10.1016/j.ijhcs.2013.05.001","paperID":"None"},{"content":"Sarah Perez. 2013. Video Texting App Glide Is Going \"Viral,\" Now Ranked Just Ahead Of Instagram In App Store. TechCrunch. Retrieved October 2, 2014 from http://techcrunch.com/2013/07/24/video-texting-appglide-is-going-viral-now-ranked-just-ahead-ofinstagram-in-app-store/","paperID":"None"},{"content":"Anita Pomerantz. 1984. Agreeing and disagreeing with assessments: Some features of preferred/dispreferred turn shapes. In Structures of Social Action: Studies in Conversation Analysis, J. Maxwell Atkinson and John Heritage (eds.). Cambridge University Press, Cambridge, UK, 57--101.","paperID":"None"},{"content":"Anita Pomerantz. 2005. Using participants' video stimulated comments to complement analyses of interactional practices. In Talk and Cognition: Discourse, Mind and Social Interaction, Hedwig te Molder and Jonathan Potter (eds.). Cambridge University Press, Cambridge, UK, 93--113.","paperID":"None"},{"content":"Kristen Purcell. 2013. Online Video. PEW Internet. Retrieved March 22, 2015 from http://www.pewinternet.org/2013/10/10/online-video2013/","paperID":"None"},{"content":"Irene Rae, Gina Venolia, John C. Tang, and David Molnar. 2015. A framework for understanding and designing telepresence. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1552--1566. http://doi.acm.org/10.1145/2675133.2675141","paperID":"None"},{"content":"Hayes Raffle, Rafael Ballagas, Glenda Revelle, Koichi Mori, Hiroshi Horii, Chris Paretti, and Mirjana Spasojevic. 2011. Pop goes the cell phone: Asynchronous messaging for preschoolers. In Proceedings of the 10th International Conference on Interaction Design and Children (IDC '11), 99--108. http://doi.acm.org/10.1145/1999030.1999042","paperID":"None"},{"content":"Howard Rheingold. 1993. The Virtual Community: Homesteading on the Electronic Frontier. MIT Press, Cambridge, MA, USA.","paperID":"None"},{"content":"Ronald E. Rice and Gail Love. 1987. Electronic emotion: Socioemotional content in a computer-mediated communication network. Communication Research. 14, 1, 85--108.","paperID":"None"},{"content":"Harvey Sacks. 1992. Lectures on Conversation, Volume II. Basil Blackwell, Oxford, UK.","paperID":"None"},{"content":"Harvey Sacks, Emmanuel A. Schegloff, and Gail Jefferson. 1974. A simplest systematics for the organization of turn-taking for conversation. Language. 50, 4, 696--735. Retrieved March 20, 2015 from http://www.jstor.org/stable/412243","paperID":"None"},{"content":"Steve Schnaars and Cliff Wymbs. 2004. On the persistence of lackluster demand--the history of the video telephone, Technological Forecasting and Social Change, 71, 3, 197--216.","paperID":"None"},{"content":"Slack Technologies. 2015. 722 Ways To Say \"I Got Your Message\". Several people are typing: The Slack blog. Retrieved July 8, 2015 from http://slackhq.com/post/123561085920/reactions","paperID":"None"},{"content":"Anne Soronen and Veijo Tuomisto. 2002. Mobile image messaging - Anticipating the outlines of the usage culture. In Proceedings of the 4th International Symposium on Mobile Human-Computer Interaction (Mobile HCI '02), 359--363. Retrieved March 18, 2015 from http://dl.acm.org/citation.cfm?id=645739.666590","paperID":"None"},{"content":"Alex S. Taylor and Richard Harper. 2002. Age-old practices in the 'new world': A study of gift-giving between teenage mobile phone users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02), 439--446. http://doi.acm.org/10.1145/503376.503455","paperID":"None"},{"content":"Sherry Turkle. 1995. Life on the Screen: Identity in the Age of the Internet. Simon and Schuster, New York, NY, USA.","paperID":"None"},{"content":"Alan Weinkrantz. 2015. Watch How Glide's RealTime Video Texting Helps The Deaf Connect In New Ways. Geektime. Retrieved March 25, 2015 from http://www.geektime.com/2015/03/24/watch-howglides-real-time-video-texting-helps-the-deaf-connectin-new-ways/","paperID":"None"}],"abstract":"This paper reports on how asynchronous mobile video messaging presents users with a challenge to doing 'being ordinary'. 53 participants from three countries were recruited to try Skype Qik at launch for two weeks. Some participants embraced Skype Qik as a gift economy, emphasizing a special relationship enacted through crafted self-presentation. However, gift exchange makes up only a small proportion of conversation. Many participants struggled with the self-presentation obligations of video when attempting more everyday conversation. Faced with the 'tyranny of the everyday', many participants reverted to other systems where content forms reflected more lightweight exchange. We argue that designing for fluid control of the obligations of turn exchange is key to mobile applications intended to support everyday messaging.","title":"The Tyranny of the Everyday in Mobile Video Messaging","filename":"CHI16/p4781","authors":["Sean Rintel","Richard Harper","Kenton O'Hara"],"conference":"CHI '16"}