{"paperId":2858095,"citation":[],"reference":[{"content":"Michelle Annett, Tovi Grossman, Daniel Wigdor, George Fitzmaurice. 2011. Medusa: A Proximity-Aware Multi-touch Tabletop. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11), 337--346. http://dx.doi.org/10.1145/2047196.2047240","paperID":"None"},{"content":"Michelle Annett, Anoop Gupta, Walter F. Bischof. 2014. Exploring and Understanding Unintended Touch during Direct Pen Interaction. ACM Trans. Comput.Hum. Interact. 21, 5: Article 28 (39pp). http://doi.acm.org/10.1145/2674915","paperID":"None"},{"content":"Victoria Bellotti, Maribeth Back, W. Keith Edwards, Rebecca E. Grinter, Austin Henderson, Cristina Lopes. 2002. Making sense of sensing systems: five questions for designers and researchers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02), 415--422. http://doi.acm.org/10.1145/503376.503450.","paperID":"None"},{"content":"Joanna Bergstrom-Lehtovirta and Antti Oulasvirta. 2014. Modeling the functional area of the thumb on mobile touchscreen surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1991--2000. http://doi.acm.org/10.1145/2556288.2557354.","paperID":"None"},{"content":"Peter Brandl, Jakob Leitner, Thomas Seifried, Michael Haller, Bernard Doray, Paul To. 2009. Occlusion-aware menu design for digital tabletops. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09), 3223--28. http://doi.acm.org/10.1145/1520340.1520461.","paperID":"None"},{"content":"W. Buxton. 1986. Chunking and Phrasing and the Design of Human-Computer Dialogues. In Proceedings of the IFIP World Computer Congress, 475--480.","paperID":"None"},{"content":"W. Buxton. 1995. Integrating the Periphery and Context: A New Taxonomy of Telematics. In Proceedings of Graphics Interface '95, 239--246.","paperID":"None"},{"content":"William Buxton. 1990. A three-state model of graphical input. In Proceedings of the IFIP TC13 Third Interational Conference on Human-Computer Interaction, 449--456.","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Julia Schwarz, Chris Harrison, Jennifer Mankoff, Scott E. Hudson. 2014. Air+touch: interweaving touch & in-air gestures. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14), 519--525. http://doi.acm.org/10.1145/2642918.2647392.","paperID":"None"},{"content":"Lung-Pan Cheng, Meng Han Lee, Che-Yang Wu, FangI Hsiao, Yen-Ting Liu, Hsiang-Sheng Liang, Yi-Ching Chiu, Ming-Sui Lee, Mike Y. Chen. 2013. iRotateGrasp: automatic screen rotation based on grasp of mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 3051--3054. http://doi.acm.org/10.1145/2470654.2481424","paperID":"None"},{"content":"Lung-Pan Cheng, Hsiang-Sheng Liang, Che-Yang Wu, Mike Y. Chen. 2013. iGrasp: grasp-based adaptive keyboard for mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 3037--3046. http://doi.acm.org/10.1145/2470654.2481422.","paperID":"None"},{"content":"Victor Cheung, Jens Heydekorn, Stacey Scott, Raimund Dachselt. 2012. Revisiting hovering: interaction guides for interactive surfaces. In Proceedings of the 2012 ACM international conference on Interactive tabletops and surfaces (ITS '12), 355--358. http://doi.acm.org/10.1145/2396636.2396699.","paperID":"None"},{"content":"S. H. Creem and D. R. Proffitt. 2001. Grasping objects by their handles: A necessary interaction between cognition and action. Journal of Experimental Psychology: Human Perception and Performance 27: 218--228.","paperID":"None"},{"content":"Paul H. Dietz, Benjamin Eidelson, Jonathan Westhues, Steven Bathiche. 2009. A practical pressure sensitive computer keyboard. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09), 55--58. http://doi.acm.org/10.1145/1622176.1622187.","paperID":"None"},{"content":"Fogale Nanotech. Fogale Sensation Technology. Retrieved September 22, 2015 from: http://www.fogalesensation.com/technology.","paperID":"None"},{"content":"Georg Freitag, Michael Tränkner, Markus Wacker. 2012. Enhanced feed-forward for a user aware multitouch device. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12), 578--586. http://doi.acm.org/10.1145/2399016.2399104.","paperID":"None"},{"content":"M. Goel, A. Jansen, T. Mandel, S. Patel, . N., J. O. Wobbrock. 2013. ContextType: using hand posture information to improve mobile touch screen text entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2795--2798. http://doi.acm.org/10.1145/2470654.2481386.","paperID":"None"},{"content":"Mayank Goel, Jacob Wobbrock, Shwetak Patel. 2012. GripSense: Using Built-In Sensors to Detect Hand Posture and Pressure on Commodity Mobile Phones. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12), 545554. http://doi.acm.org/10.1145/2380116.2380184.","paperID":"None"},{"content":"Tovi Grossman and Ravin Balakrishnan. 2005. A probabilistic approach to modeling two-dimensional pointing. ACM Trans. Comput.-Hum. Interact. 12, 3 (September 2005): 435--459. http://doi.acm.org/10.1145/1096737.1096741.","paperID":"None"},{"content":"Tovi Grossman, Ken Hinckley, Patrick Baudisch, Maneesh Agrawala, Ravin Balakrishnan. 2006. Hover widgets: using the tracking state to extend the capabilities of pen-operated devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'06), 861--870. http://doi.acm.org/10.1145/1124772.1124898.","paperID":"None"},{"content":"Yves Guiard. 1987. Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. Journal of Motor Behavior 19, 4: 486--517.","paperID":"None"},{"content":"Beverly L. Harrison, Kenneth P. Fishkin, Anuj Gujar, Carlos Mochon, Roy Want. 1998. Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'98), 17--24. http://doi.acm.org/10.1145/274644.274647.","paperID":"None"},{"content":"Seongkook Heo and Geehyuk Lee. 2011. Force gestures: augmenting touch screen gestures with normal and tangential forces. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11), 621--626. http://doi.acm.org/10.1145/2047196.2047278.","paperID":"None"},{"content":"Christopher F. Herot and Guy Weinzapfel. 1978. OnePoint Touch Input of Vector Information from Computer Displays. In Proceedings of the 5th annual conference on Computer graphics and interactive techniques (SIGGRAPH '78), 210--216. http://doi.acm.org/10.1145/800248.807392.","paperID":"None"},{"content":"Otmar Hilliges, Shahram Izadi, Andrew D. Wilson, Steve Hodges, Armando Garcia-Mendoza, Andreas Butz. 2009. Interactions in the air: adding further depth to interactive tabletops. In Proceedings of the 22nd annual ACM symposium on User interface software and technology, 139--148. http://doi.acm.org/10.1145/1622176.1622203.","paperID":"None"},{"content":"K. Hinckley, M. Pahud, H. Benko, P. Irani, F. Guimbretiere, M. Gavriliu, X. Chen, F. Matulic, B. Buxton, A. Wilson. 2014. Sensing Techniques for Tablet+Stylus Interaction. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST'14), 605--614. http://dx.doi.org/10.1145/2642918.2647379.","paperID":"None"},{"content":"Ken Hinckley, Jeff Pierce, Eric Horvitz, Mike Sinclair. 2005. Foreground and Background Interaction with Sensor-Enhanced Mobile Devices. ACM Trans. Comput.-Hum. Interact. 12, 1 (Special Issue on SensorBased Interaction) (March 2005): 31--52. http://doi.acm.org/10.1145/1057237.1057240.","paperID":"None"},{"content":"Christian Holz and Patrick Baudisch. 2010. The generalized perceived input point model and how to double touch accuracy by extracting fingerprints. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 581--590. http://doi.acm.org/10.1145/1753326.1753413.","paperID":"None"},{"content":"Bret Jackson, David Schroeder, Daniel F. Keefe. 2012. Nailing down multi-touch: anchored above the surface interaction for 3D modeling and navigation. In Proceedings of Graphics Interface 2012 (GI '12), 181184.","paperID":"None"},{"content":"A. Karlson, B. Bederson, J. Contreras-Vidal. 2006. Understanding single-handed mobile device interaction, in Handbook of research on user interface design and evaluation for mobile technology, 86--101.","paperID":"None"},{"content":"Ji-Sun Kim, Denis Gračanin, Taeyoung Yang, Francis Quek. 2015. Action-Transferred Navigation Technique Design Approach Supporting Human Spatial Learning. ACM Trans. Comput.-Hum. Interact 22, 6: Article 30 (September 2015), 42 pages. . http://dx.doi.org/10.1145/2811258.","paperID":"None"},{"content":"Kee-Eung Kim, Wook Chang, Sung-Jung Cho, Junghyun Shim, Hyunjeong Lee, Joonah Park, Youngbeom Lee, Sangryong Kim. 2006. Hand Grip Pattern Recognition for Mobile User Interfaces. In Proceedings of the 18th conference on Innovative applications of artificial intelligence - Volume 2 (IAAI'06), 1789--1794.","paperID":"None"},{"content":"Sven Kratz and Michael Rohs. 2009. HoverFlow: expanding the design space of around-device interaction. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '09), Article 4, 8 pp. http://doi.acm.org/10.1145/1613858.1613864.","paperID":"None"},{"content":"Yang Li, Ken Hinckley, Zhiwei Guan, James A. Landay. 2005. Experimental analysis of mode switching techniques in pen-based user interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 461--470. http://doi.acm.org/10.1145/1054972.1055036.","paperID":"None"},{"content":"Shenwei Liu and François Guimbretière. 2012. FlexAura: A Flexible Near-Surface Range Sensor. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12), 327--330. http://doi.acm.org/10.1145/2380116.2380158","paperID":"None"},{"content":"Yuexing Luo and Daniel Vogel. 2015. Pin-and-Cross: A Unimanual Multitouch Technique Combining Static Touches with Crossing Selection. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 323--332. http://dx.doi.org/10.1145/2807442.2807444.","paperID":"None"},{"content":"Christine Mackenzie and Thea Iberall. 1994. The Grasping Hand. Advances in Psychology 104, ed. G. Stelmach and P. Vroon. North Holland.","paperID":"None"},{"content":"Nicolai Marquardt, Ricardo Jota, Saul Greenberg, Joaquim A. Jorge. 2011. The Continuous Interaction Space: Interaction Techniques Unifying Touch and Gesture on and Above an Interaction Surface. In Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction - Volume Part III (INTERACT'11), 461--476.","paperID":"None"},{"content":"R. G. Marteniuk, C. L. MacKenzie, M. Jeannerod, S. Athenes, C. Dugas. 1987. Constraints on human arm movement trajectories. Canadian Journal of Psychology 41, 3: 365--378.","paperID":"None"},{"content":"Michael J. McGuffin and Ravin Balakrishnan. 2005. Fitts' law and expanding targets: Experimental studies and designs for user interfaces. ACM Trans. Comput.Hum. Interact. 12, 4 (December 2005): 388--422. http://doi.acm.org/10.1145/1121112.1121115.","paperID":"None"},{"content":"David E Meyer, Richard A Abrams, Sylvan Kornblum, Charles E Wright, J. E. Keith Smith. 1988. Optimality in human motor performance: ideal control of rapid aimed movements. Psychological Review 95: 340--370.","paperID":"None"},{"content":"Matei Negulescu and Joanna McGrenere. 2015. Grip Change as an Information Side Channel for Mobile Touch Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1519--1522. http://doi.acm.org/10.1145/2702123.2702185.","paperID":"None"},{"content":"Mohammad Faizuddin Mohd Noor, Andrew Ramsay, Stephen Hughes, Simon Rogers, John Williamson, Roderick Murray-Smith. 2014. 28 frames later: predicting screen touches from back-of-device grip changes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 20052008. http://doi.acm.org/10.1145/2556288.2557148.","paperID":"None"},{"content":"Halla B. Olafsdottir, Theophanis Tsandilas, Caroline Appert. 2014. Prospective motor control on tabletops: planning grasp for multitouch interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 2893--2902. http://doi.acm.org/10.1145/2556288.2557029.","paperID":"None"},{"content":"Henning Pohl and Roderick Murray-Smith. 2013. Focused and casual interactions: allowing users to vary their level of engagement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2223--2232. http://doi.acm.org/10.1145/2470654.2481307.","paperID":"None"},{"content":"Simon Rogers, John Williamson, Craig Stewart, Roderick Murray-Smith. 2011. AnglePose: robust, precise capacitive touch tracking via 3d orientation estimation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2575--2584. http://doi.acm.org/10.1145/1978942.1979318.","paperID":"None"},{"content":"Samsung. How Do I Use Air Gestures? Retrieved September 23 from: http://www.samsung.com/us/support/howtoguide/N000 0003/10141/120552.","paperID":"None"},{"content":"Itiro Siio and Hitomi Tsujita. 2006. Mobile interaction using paperweight metaphor. In Proceedings of the 19th annual ACM symposium on User interface software and technology (UIST '06), 111--114. http://dx.doi.org/10.1145/1166253.1166271.","paperID":"None"},{"content":"J. R. Smith, E. Garcia, R. Wistort, G. Krishnamoorthy. 2007. Electric field imaging pretouch for robotic graspers. In IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2007), 676--683.","paperID":"None"},{"content":"Jie Song, Gábor Sörös, Fabrizio Pece, Sean Ryan Fanello, Shahram Izadi, Cem Keskin, Otmar Hilliges. 2014. In-air gestures around unmodified mobile devices. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14), 319--329. http://doi.acm.org/10.1145/2642918.2647373.","paperID":"None"},{"content":"Sony. Floating Touch--Developer World Mobile. Retrieved from: http://developer.sonymobile.com/knowledgebase/technologies/floating-touch/.","paperID":"None"},{"content":"Anthony Tang, Michel Pahud, Kori Inkpen, Hrvoje Benko, John C. Tang, Bill Buxton. 2010. Three's company: understanding communication channels in three-way distributed collaboration. In Proceedings of the 2010 ACM conference on Computer supported cooperative work (CSCW '10), 271--280. http://doi.acm.org/10.1145/1718918.1718969.","paperID":"None"},{"content":"John C. Tang and Scott Minneman. 1991. VideoWhiteboard: video shadows to support remote collaboration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '91), 315--322. http://doi.acm.org/10.1145/108844.108932.","paperID":"None"},{"content":"Brandon T. Taylor and Jr. V. Michael Bove. 2009. Graspables: Grasp-Recognition as a User Interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 917--926. http://doi.acm.org/10.1145/1518701.1518842.","paperID":"None"},{"content":"Daniel Vogel and Ravin Balakrishnan. 2010. Occlusionaware interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 263--272. http://doi.acm.org/10.1145/1753326.1753365.","paperID":"None"},{"content":"D. Wigdor and D. Wixon. 2011. Design Guidelines: Self-Revealing Multi-Touch Gestures, in Brave NUI world: designing natural user interfaces for touch and gesture. Elsevier, 150--154.","paperID":"None"},{"content":"Raphael Wimmer and Sebastian Boring. 2009. HandSense - Discriminating Different Ways of Grasping and Holding a Tangible User Interface. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (TEI '09), 359--362. http://doi.acm.org/10.1145/1517664.1517736.","paperID":"None"},{"content":"Katrin Wolf, Christian Müller-Tomfelde, Kelvin Cheng, Ina Wechsung. 2012. PinchPad: performance of touchbased gestures while grasping devices. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), 103110. http://dx.doi.org/10.1145/2148131.2148155.","paperID":"None"},{"content":"Katrin Wolf, Anja Naumann, Michael Rohs, Jörg Müller. 2011. Taxonomy of Microinteractions: Defining Microgestures based on Ergonomic and Scenariodependent Requirements. In Proceedings of the 13th IFIP TC 13 international conference on Humancomputer interaction - Volume Part I (INTERACT'11), 559--575.","paperID":"None"},{"content":"Haijun Xia, Ricardo Jota, Benjamin McCanny, Zhe Yu, Clifton Forlines, Karan Singh, Daniel Wigdor. 2014. Zero-latency tapping: using hover information to predict touch locations and eliminate touchdown latency. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14), 205--214. http://doi.acm.org/10.1145/2642918.2647348.","paperID":"None"},{"content":"Xing-Dong Yang, Tovi Grossman, Pourang Irani, George Fitzmaurice. 2011. TouchCuts and TouchZoom: enhanced target selection for touch displays using finger proximity sensing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2585--2594. http://doi.acm.org/10.1145/1978942.1979319.","paperID":"None"},{"content":"Dongwook Yoon, Ken Hinckley, Hrvoje Benko, François Guimbretière, Pourang Irani, Michel Pahud, Marcel Gavriliu. 2015. Sensing Tablet Grasp + Micromobility for Active Reading. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 477--487. http://dx.doi.org/10.1145/2807442.2807510.","paperID":"None"},{"content":"Chris Ziegler. Apple brings 3D Touch to the iPhone 6S. Retrieved Sept. 9, 2015 from: http://www.theverge.com/2015/9/9/9280599/appleiphone-6s-3d-touch-display-screen-technology.","paperID":"None"}],"abstract":"Touchscreens continue to advance including progress towards sensing fingers proximal to the display. We explore this emerging pre-touch modality via a self-capacitance touchscreen that can sense multiple fingers above a mobile device, as well as grip around the screen's edges. This capability opens up many possibilities for mobile interaction. For example, using pre-touch in an anticipatory role affords an \"ad-lib interface\" that fades in a different UI--appropriate to the context--as the user approaches one-handed with a thumb, two-handed with an index finger, or even with a pinch or two thumbs. Or we can interpret pre-touch in a retroactive manner that leverages the approach trajectory to discern whether the user made contact with a ballistic vs. a finely-targeted motion. Pre-touch also enables hybrid touch + hover gestures, such as selecting an icon with the thumb while bringing a second finger into range to invoke a context menu at a convenient location. Collectively these techniques illustrate how pre-touch sensing offers an intriguing new back-channel for mobile interaction.","title":"Pre-Touch Sensing for Mobile Interaction","filename":"CHI16/p2869","authors":["Ken Hinckley","Seongkook Heo","Michel Pahud","Christian Holz","Hrvoje Benko","Abigail Sellen","Richard Banks","Kenton O'Hara","Gavin Smyth","William Buxton"],"conference":"CHI '16"}