{"paperId":2858078,"abstract":"Most modern stereoscopic 3D applications use fixed stereoscopic 3D parameters (separation and convergence) to render the scene on a 3D display. But, keeping these parameters fixed during usage does not always provide the best experience since it can reduce the amount of depth perception possible in some applications which have large variability in object distances. We developed two stereoscopic rendering techniques which actively vary the stereo parameters based on the scene content. Our first algorithm calculates a low resolution depth map of the scene and chooses ideal stereo parameters based on that depth map. Our second algorithm uses eye tracking data to get the gaze direction of the user and chooses ideal stereo parameters based on the distance of the gazed object. We evaluated our techniques in an experiment that uses three depth judgment tasks: depth ranking, relative depth judgment and path tracing. Our results indicate that variable stereo parameters provide enhanced depth discrimination compared to static parameters and were preferred by our participants over the traditional fixed parameter approach. We discuss our findings and possible implications on the design of future stereoscopic 3D applications.","citation":[],"reference":[{"content":"Nvidia's GTC 2010 presentation. http://www.nvidia.com/content/GTC-2010/pdfs/2010_GTC2010.pdf, 2010.","paperID":"None"},{"content":"Arthur, K. W., Booth, K. S., and Ware, C. Evaluating 3D task performance for fish tank virtual worlds. ACM Transactions on Information Systems 11,3 (1993), 239--265.","paperID":"None"},{"content":"Bernhard, M., Dell'mour, C., Hecher, M., Stavrakis, E., and Wimmer, M. The effects of fast disparity adjustment in gaze-controlled stereoscopic applications. In Proceedings of the Symposium on Eye Tracking Research and Applications, ETRA '14, ACM (NY, NY, USA, 2014), 111--118.","paperID":"None"},{"content":"Dodgson, N. A. Variation and extrema of human interpupillary distance, 2004.","paperID":"None"},{"content":"Duchowski, A. T., House, D. H., Gestring, J., Wang, R. I., Krejtz, K., Krejtz, I., Mantiuk, R., and Bazyluk, B. Reducing visual discomfort of 3d stereoscopic displays with gaze-contingent depth-of-field. In Proceedings of the ACM Symposium on Applied Perception, SAP '14, ACM (NY, NY, USA, 2014), 39--46.","paperID":"None"},{"content":"Fujimoto, M., and Ishibashi, Y. The effect of stereoscopic viewing of a virtual space on a networked game using haptic media. In Proceedings of the ACM SIGCHI international Conference on Advances in Computer Entertainment, ACM (NY, NY, 2005), 317--320.","paperID":"None"},{"content":"Grossman, T., and Balakrishnan, R. An evaluation of depth perception on volumetric displays. In Proceedings of the Working Conference on Advanced Visual Interfaces, AVI '06, ACM (NY, NY, USA, 2006), 193--200.","paperID":"None"},{"content":"Gurrieri, L. Improvements in the visualization of stereoscopic 3d imagery. 3D Research 6, 3 (2015).","paperID":"None"},{"content":"Holm, S. A simple sequentially rejective multiple test procedure. Scandinavian Journal of Statistics 6, 2 (1979), 65--70.","paperID":"None"},{"content":"Howarth, P. A. Potential hazards of viewing 3D stereoscopic television, cinema and computer games: a review. Ophthalmic & Physiological Optics : The Journal of the British College of Ophthalmic Opticians (Optometrists) 31, 2 (2011), 111--122.","paperID":"None"},{"content":"Hubona, G. S., Wheeler, P. N., Shirah, G. W., and Brandt, M. The relative contributions of stereo, lighting, and background scenes in promoting 3D depth visualization. ACM Transactions on Computer-Human Interaction 6,3 (1999), 214--242.","paperID":"None"},{"content":"Kulshreshth, A., and LaViola, Jr., J. J. Enhanced depth discrimination using dynamic stereoscopic 3d parameters. In Proceedings of the ACM Conference Extended Abstracts on Human Factors in Computing Systems, CHI '15, ACM (NY, NY, USA, 2015), 1615--1620.","paperID":"None"},{"content":"Kulshreshth, A., Schild, J., and LaViola Jr., J. J. Evaluating user performance in 3D stereo and motion enabled video games. In Proceedings of the International Conference on the Foundations of Digital Games, ACM (NY, NY, 2012), 33--40.","paperID":"None"},{"content":"Litwiller, T., and LaViola Jr., J. J. Evaluating the benefits of 3D stereo in modern video games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI'11, ACM (NY, NY, USA, 2011), 2345--2354.","paperID":"None"},{"content":"Maiello, G., Chessa, M., Solari, F., and Bex, P. J. Simulated disparity and peripheral blur interact during binocular fusion. Journal of vision 14, 8 (2014), 13.","paperID":"None"},{"content":"Mauderer, M., Conte, S., Nacenta, M. A., and Vishwanath, D. Depth perception with gaze-contingent depth of field. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '14, ACM (NY, NY, USA, 2014), 217--226.","paperID":"None"},{"content":"Schild, J., Bölicke, L., LaViola Jr., J. J., and Masuch, M. Creating and analyzing stereoscopic 3D graphical user interfaces in digital games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (NY, NY, USA, 2013), 169--178.","paperID":"None"},{"content":"Schild, J., LaViola Jr., J. J., and Masuch, M. Understanding user experience in stereoscopic 3D games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '12, ACM (NY, NY, USA, 2012), 89--98.","paperID":"None"},{"content":"Siegel, M., Tobinaga, Y., and Akiya, T. Kinder, gentler stereo. In Electronic Imaging'99, International Society for Optics and Photonics (1999), 18--27.","paperID":"None"},{"content":"Vinnikov, M., and Allison, R. S. Gaze-contingent depth of field in realistic scenes: The user experience. In Proceedings of the Symposium on Eye Tracking Research and Applications, ETRA '14, ACM (NY, NY, USA, 2014), 119--126.","paperID":"None"},{"content":"Wang, O., Lang, M., Stefanoski, N., Sorkine-Hornung, A., Sorkine-Hornung, O., Smolic, A., and Gross, M. Image Domain Warping for Stereoscopic 3D Applications. John Wiley & Sons, Ltd, 2013, 207--230.","paperID":"None"},{"content":"Wanger, L. C., Ferwerda, J. A., and Greenberg, D. P. Perceiving spatial relationships in computer-generated images. IEEE Computer Graphics and Applications, 3 (1992), 44--51.","paperID":"None"},{"content":"Ware, C. Dynamic stereo displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '95, ACM Press/Addison-Wesley Publishing Co. (NY, NY, USA, 1995), 310--316.","paperID":"None"},{"content":"Ware, C., and Franck, G. Evaluating stereo and motion cues for visualizing information nets in three dimensions. ACM Transactions on Graphics 15, 2 (April 1996), 121--140.","paperID":"None"},{"content":"Ware, C., Gobrecht, C., and Paton, M. Dynamic adjustment of stereo display parameters. Systems, Man and Cybernetics, Part A: Systems and Humans, IEEE Transactions on 28, 1 (Jan 1998), 56--65.","paperID":"None"},{"content":"You, J., Jiang, G., Xing, L., and Perkis, A. Quality of visual experience for 3D presentation Stereoscopic image. In High-Quality Visual Experience, M. Mrak, M. Grgic, and M. Kunt, Eds., Signals and Communication Technology. Springer Berlin Heidelberg, 2010, 51--77.","paperID":"None"}],"title":"Dynamic Stereoscopic 3D Parameter Adjustment for Enhanced Depth Discrimination","filename":"CHI16/p177","authors":["Arun Kulshreshth","Joseph J. LaViola, Jr."],"conference":"CHI '16"}