{"paperId":2858367,"abstract":"In this paper we present the design and evaluation of the Temperature Calendar -- a visualization of temperature variation within a workplace over the course of the past week. This highlights deviation from organizational temperature policy, and aims to bring staff \"into the loop\" of understanding and managing heating, and so reduce energy waste. The display was deployed for three weeks in five public libraries. Analysis of interaction logs, questionnaires and interviews shows that staff used the displays to understand heating in their buildings, and took action reflecting this new understanding. Bringing together our results, we discuss design implications for workplace displays, and an analysis of carbon emissions generated in constructing and operating our design. More in general, the findings helped us to reflect on the role of policy on energy consumption, and the potential for the HCI community to engage with its application, as well as its definition or modification.","citation":[],"reference":[{"content":"Eric P.S. Baumer and M. Six Silberman. 2011. When the Implication is Not to Design (Technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2271-2274. DOI: http://dx.doi.org/10.1145/1978942.1979275","paperID":"None"},{"content":"Benjamin Bedwell, Enrico Costanza, and Michael Jewell. 2016. Understanding Energy Consumption at Work: Learning from Arrow Hill. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 12. http://eprints.soton.ac.uk/id/eprint/381093","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77-101.","paperID":"None"},{"content":"Hronn Brynjarsdottir, Maria Hkansson, James Pierce, Eric Baumer, Carl DiSalvo, and Phoebe Sengers. 2012. Sustainably Unpersuaded: How Persuasion Narrows Our Vision of Sustainability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 947-956. DOI: http://dx.doi.org/10.1145/2207676.2208539","paperID":"None"},{"content":"Carbon Trust. 2010. Office based companies: Maximising energy savings in an office environment. Technical Report. Carbon Trust.","paperID":"None"},{"content":"Marshini Chetty, David Tran, and Rebecca E. Grinter. 2008. Getting to Green: Understanding Resource Consumption in the Home. In Proceedings of the 10th International Conference on Ubiquitous Computing (UbiComp '08). ACM, NY, NY, USA, 242-251. DOI: http://dx.doi.org/10.1145/1409635.1409668","paperID":"None"},{"content":"Adrian K. Clear, Janine Morley, Mike Hazas, Adrian Friday, and Oliver Bates. 2013. Understanding Adaptive Thermal Comfort: New Directions for UbiComp. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 113-122. DOI: http://dx.doi.org/10.1145/2493432.2493451","paperID":"None"},{"content":"Adrian K. Clear, Kirstie O'Neill, and Adrian Friday. 2015. Designing for Transitions to Sustainable Lifestyles. interactions 22, 3 (April 2015), 56-58. DOI: http://dx.doi.org/10.1145/2743034","paperID":"None"},{"content":"Sarah Darby. 2006. The Effectiveness of Feedback on Energy Consumption. Technical Report. Environmental Change Institute.","paperID":"None"},{"content":"Tawanna R. Dillahunt and Jennifer Mankoff. 2014. Understanding Factors of Successful Engagement Around Energy Consumption Between and Among Households. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, NY, NY, USA, 1246-1257. DOI: http://dx.doi.org/10.1145/2531602.2531626","paperID":"None"},{"content":"Paul Dourish. 2010. HCI and Environmental Sustainability: The Politics of Design and the Design of Politics. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, NY, NY, USA, 1-10. DOI: http://dx.doi.org/10.1145/1858171.1858173","paperID":"None"},{"content":"M. Feldmeier and J.A. Paradiso. 2010. Personalized HVAC control system. In Internet of Things (IOT), 2010. IoT Conference, Tokyo, JP, 1-8. DOI: http://dx.doi.org/10.1109/IOT.2010.5678444","paperID":"None"},{"content":"Caroline M Fichtenberg and Stanton A Glantz. 2002. Effect of smoke-free workplaces on smoking behaviour: systematic review. BMJ 325, 7357 (2002), 188. DOI: http://dx.doi.org/10.1136/bmj.325.7357.188","paperID":"None"},{"content":"Corinna Fischer. 2008. Feedback on household electricity consumption: a tool for saving energy? Energy efficiency 1, 1 (2008), 79-104. http://dx.doi.org/10.1007/s12053-008--9009--7","paperID":"None"},{"content":"Derek Foster, Shaun Lawson, Jamie Wardman, Mark Blythe, and Conor Linehan. 2012. \"Watts in It for Me?\": Design Implications for Implementing Effective Energy Interventions in Organisations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2357-2366. DOI: http://dx.doi.org/10.1145/2207676.2208396","paperID":"None"},{"content":"Jon Froehlich, Leah Findlater, and James Landay. 2010. The Design of Eco-feedback Technology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1999-2008. DOI: http://dx.doi.org/10.1145/1753326.1753629","paperID":"None"},{"content":"Ashley N. Gearhardt, Sonja Yokum, Eric Stice, Jennifer L. Harris, and Kelly D. Brownell. 2014. Relation of obesity to neural activation in response to food commercials. Social Cognitive and Affective Neuroscience 9, 7 (2014), 932-938. DOI: http://dx.doi.org/10.1093/scan/nst059","paperID":"None"},{"content":"Murray Goulden and Alexa Spence. 2015. Caught in the middle: The role of the Facilities Manager in organisational energy use. Energy Policy 85 (2015), 280 - 287. DOI: http://dx.doi.org/10.1016/j.enpol.2015.06.014","paperID":"None"},{"content":"Mike Hazas, A. J. Bernheim Brush, and James Scott. 2012. Sustainability Does Not Begin with the Individual. interactions 19, 5 (Sept. 2012), 14-17. DOI: http://dx.doi.org/10.1145/2334184.2334189","paperID":"None"},{"content":"William R. Hazlewood, Erik Stolterman, and Kay Connelly. 2011. Issues in Evaluating Ambient Displays in the Wild: Two Case Studies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 877-886. DOI: http://dx.doi.org/10.1145/1978942.1979071","paperID":"None"},{"content":"Eric B. Hekler, Predrag Klasnja, Jon E. Froehlich, and Matthew P. Buman. 2013. Mind the Theoretical Gap: Interpreting, Using, and Developing Behavioral Theory in HCI Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3307-3316. DOI: http://dx.doi.org/10.1145/2470654.2466452","paperID":"None"},{"content":"Tad Hirsch. 2010. Water Wars: Designing a Civic Game About Water Scarcity. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, NY, NY, USA, 340-343. DOI: http://dx.doi.org/10.1145/1858171.1858232","paperID":"None"},{"content":"Mohit Jain, Ankit Agrawal, Sunil K. Ghai, Khai N. Truong, and Deva P. Seetharam. 2013. \"We Are Not in the Loop\": Resource Wastage and Conservation Attitude of Employees in Indian Workplace. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 687-696. DOI: http://dx.doi.org/10.1145/2493432.2493444","paperID":"None"},{"content":"Marc Jentsch, Marco Jahn, Ferry Pramudianto, Jonathan Simon, and Amro Al-Akkad. 2011. An Energy-Saving Support System for Office Environments. In Human Behavior Understanding, Albert-Ali Salah and Bruno Lepri (Eds.). Lecture Notes in Computer Science, Vol. 7065. Springer, Berlin Heidelberg, 83-92. DOI: http://dx.doi.org/10.1007/978--3--642--25446--8_10","paperID":"None"},{"content":"Bran Knowles, Lynne Blair, Paul Coulton, and Mark Lochrie. 2014. Rethinking Plan A for Sustainable HCI. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3593-3596. DOI: http://dx.doi.org/10.1145/2556288.2557311","paperID":"None"},{"content":"Milan Milenkovic, Ulf Hanebutte, Yonghong Huang, David Prendergast, and Han Pham. 2013. Improving User Comfort and Office Energy Efficiency with POEM (Personal Office Energy Monitor). In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 1455-1460. DOI: http://dx.doi.org/10.1145/2468356.2468616","paperID":"None"},{"content":"Donald A Norman. 2013. The design of everyday things. Basic books, NY, USA.","paperID":"None"},{"content":"Daniel Pargman and Barath Raghavan. 2014. Rethinking Sustainability in Computing: From Buzzword to Non-negotiable Limits. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, NY, NY, USA, 638-647. DOI: http://dx.doi.org/10.1145/2639189.2639228","paperID":"None"},{"content":"Therese Peffer, Marco Pritoni, Alan Meier, Cecilia Aragon, and Daniel Perry. 2011. How people use thermostats in homes: A review. Building and Environment 46, 12 (2011), 2529 - 2541. DOI:http: //dx.doi.org/10.1016/j.buildenv.2011.06.002","paperID":"None"},{"content":"James Pierce and Eric Paulos. 2012. Beyond Energy Monitors: Interaction, Energy, and Emerging Energy Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 665-674. DOI: http://dx.doi.org/10.1145/2207676.2207771","paperID":"None"},{"content":"Zachary Pousman, Hafez Rouzati, and John Stasko. 2008. Imprint, a Community Visualization of Printer Data: Designing for Open-ended Engagement on Sustainability. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, NY, NY, USA, 13-16. DOI: http://dx.doi.org/10.1145/1460563.1460568","paperID":"None"},{"content":"Zachary Pousman, John Stasko, and Michael Mateas. 2007. Casual Information Visualization: Depictions of Data in Everyday Life. IEEE Transactions on Visualization and Computer Graphics 13, 6 (Nov. 2007), 1145-1152. DOI: http://dx.doi.org/10.1109/TVCG.2007.70541","paperID":"None"},{"content":"Elizabeth Shove. 2003. Comfort, cleanliness and convenience: The social organization of normality. Vol. 810. Berg, Oxford.","paperID":"None"},{"content":"Elizabeth Shove, Gordon Walker, and Sam Brown. 2014. Material culture, room temperature and the social organisation of thermal energy. Journal of Material Culture 19, 2 (2014), 113-124. DOI: http://dx.doi.org/10.1177/1359183514525084","paperID":"None"},{"content":"Frans W Siero, Arnold B Bakker, Gerda B Dekker, and Marcel TC Van Den Burg. 1996. Changing organizational energy consumption behaviour through comparative feedback. Journal of environmental psychology 16, 3 (1996), 235-246.","paperID":"None"},{"content":"Yolande A.A. Strengers. 2011. Designing Eco-feedback Systems for Everyday Life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2135-2144. DOI: http://dx.doi.org/10.1145/1978942.1979252","paperID":"None"},{"content":"Evangelos Tolias, Enrico Costanza, Alex Rogers, Benjamin Bedwell, and Nick Banks. 2015. IdleWars: an Evaluation of a Pervasive Game to Promote Sustainable Behaviour in the Workplace. In International Conference on Entertainment Computing (ICEC). Springer, Berlin Heidelberg, 14. http://eprints.soton.ac.uk/378861/","paperID":"None"},{"content":"Nina Valkanova, Sergi Jorda, Martin Tomitsch, and Andrew Vande Moere. 2013. Reveal-it!: The Impact of a Social Visualization Projection on Public Awareness and Discourse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3461-3470. DOI: http://dx.doi.org/10.1145/2470654.2466476","paperID":"None"},{"content":"Rayoung Yang, Mark W. Newman, and Jodi Forlizzi. 2014. Making Sustainability Sustainable: Challenges in the Design of Eco-interaction Technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 823-832. DOI: http://dx.doi.org/10.1145/2556288.2557380","paperID":"None"},{"content":"Ray Yun, Azizan Aziz, Peter Scupelli, Bertrand Lasternas, Chenlu Zhang, and Vivian Loftness. 2015. Beyond Eco-Feedback: Adding Online Manual and Automated Controls to Promote Workplace Sustainability. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1989-1992. DOI: http://dx.doi.org/10.1145/2702123.2702268","paperID":"None"}],"title":"'A bit like British Weather, I suppose': Design and Evaluation of the Temperature Calendar","filename":"CHI16/p4061","authors":["Enrico Costanza","Ben Bedwell","Michael O. Jewell","James Colley","Tom Rodden"],"conference":"CHI '16"}