{"paperId":2858227,"citation":[],"abstract":"Emotions are key to the player experience (PX) and interest in the potential of games to provide unique emotional, sometimes uncomfortable experiences is growing. Yet there has been little empirical investigation of what game experiences players consider emotionally moving, their causes and effects, and whether players find these experiences rewarding at all. We analyzed 121 players' accounts of emotionally moving game experiences in terms of the feelings and thoughts they evoked, different PX constructs, as well as game-related and personal factors contributing to these. We found that most players enjoyed and appreciated experiencing negatively valenced emotions, such as sadness. Emotions were evoked by a variety of interactive and non-interactive game aspects, such as in-game loss, character attachment and (lack of) agency, but also personal memories, and were often accompanied by (self-)reflection. Our findings highlight the potential of games to provide emotionally rewarding and thought-provoking experiences, as well as outline opportunities for future research and design of such experiences. They also showcase that negative affect may contribute to enjoyment, thereby extending our notion of positive player experience.","reference":[{"content":"Fraser Allison, Marcus Carter, and Martin Gibbs. 2015. Good Frustrations: The Paradoxical Pleasure of Fearing Death in DayZ. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction. ACM, 119--123.","paperID":"None"},{"content":"Anne Bartsch. 2012. Emotional gratification in entertainment experience. Why viewers of movies and television series find it rewarding to experience emotions. Media Psychology 15, 3 (2012), 267--302.","paperID":"None"},{"content":"Anne Bartsch, Anja Kalch, and Mary Beth Oliver. 2014. Moved to think: The role of emotional media experiences in stimulating reflective thoughts. Journal of Media Psychology: Theories, Methods, and Applications 26, 3 (2014), 125--140.","paperID":"None"},{"content":"Chris Bateman, Rebecca Lowenhaupt, and Lennart E Nacke. 2011. Player typology in theory and practice. In Proceedings of DiGRA.","paperID":"None"},{"content":"Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2005--2014.","paperID":"None"},{"content":"Max V. Birk, Ioanna Iacovides, Daniel Johnson, and Regan Mandryk. 2015. The False Dichotomy between Positive and Negative Affect in Game Play. In CHI PLAY '15. ACM, 799--804.","paperID":"None"},{"content":"Julia Ayumi Bopp, Elisa D Mekler, and Klaus Opwis. 2015. It Was Sad But Still Good: Gratifications of Emotionally Moving Game Experiences. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1193--1198.","paperID":"None"},{"content":"Emily Brown and Paul Cairns. 2004. A grounded investigation of game immersion. In CHI'04 extended abstracts on Human factors in computing systems. ACM, 1297--1300.","paperID":"None"},{"content":"James Brown, Kathrin Gerling, Patrick Dickinson, Ben Kirman, and others. 2015. Dead fun: uncomfortable interactions in a virtual reality game for coffins. In CHI PLAY '15. ACM, 475--480.","paperID":"None"},{"content":"Kaitlyn Burnell. 2012. Breaking the Rules of Game Design: when to go against Autonomy, Competence, and Relatedness. In Game Developers Conference. http://www.gdcvault.com/play/1015398/ Breaking-the-Rules-of-Game","paperID":"None"},{"content":"Tom Cole, Paul Cairns, and Marco Gillies. 2015. Emotional and Functional Challenge in Core and Avant-garde Games. In CHI PLAY '15. ACM, 121--126.","paperID":"None"},{"content":"Gerald C Cupchik. 2011. The Role of Feeling in the Entertainment= Emotion Formula. Journal of Media Psychology 23, 1 (2011), 6--11.","paperID":"None"},{"content":"Sebastian Deterding. 2015. The Joys of Absence: Emotion, Emotion Display, and Interaction Tension in Video Game Play. In Proc. FDG '15.","paperID":"None"},{"content":"Alf Gabrielsson and Siv Lindstrom Wik. 2003. Strong Experiences Related to Music: A descriptive System. Musicae scientiae 7, 2 (2003), 157--217.","paperID":"None"},{"content":"Sabine Harrer. 2013. From Losing to Loss: Exploring the Expressive Capacities of Videogames Beyond Death as Failure. Culture Unbound: Journal of Current Cultural Research 5, 4 (2013), 607--620.","paperID":"None"},{"content":"Ioanna Iacovides and Anna L Cox. 2015. Moving Beyond Fun: Evaluating Serious Experience in Digital Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2245--2254.","paperID":"None"},{"content":"Jeroen Jansz. 2005. The emotional appeal of violent video games for adolescent males. Communication Theory 15, 3 (2005), 219--241.","paperID":"None"},{"content":"Daniel Johnson, Lennart Nacke, and Peta Wyeth. 2015. All about that base: differing player experiences in video game genres and the unique case of MOBA games. In CHI '15. ACM, 2265--2274.","paperID":"None"},{"content":"Daniel Kahneman and Jason Riis. 2005. Living, and thinking about it: Two perspectives on life. The science of well-being (2005), 285--304.","paperID":"None"},{"content":"Nicole Lazzaro. 2009. Why we play: affect and the fun of games. Human-Computer Interaction: Designing for Diverse Users and Domains (2009), 155--176.","paperID":"None"},{"content":"Teresa Lynch and Nicole Martins. 2015. Nothing to Fear? An Analysis of College Students' Fear Experiences With Video Games. Journal of Broadcasting & Electronic Media 59, 2 (2015), 298--317.","paperID":"None"},{"content":"Filipa Madeira, Patrficia Arriaga, Joana Adriao, Ricardo Lopes, Francisco Esteves, and others. 2013. Emotional Gaming. (2013), 11--29.","paperID":"None"},{"content":"Tim Marsh and Brigid Costello. 2012. Experience in serious games: between positive and serious experience. In Serious Games Development and Applications. Springer, 255--267.","paperID":"None"},{"content":"Elisa D Mekler, Julia Ayumi Bopp, Alexandre N Tuch, and Klaus Opwis. 2014. A systematic review of quantitative studies on the enjoyment of digital entertainment games. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 927--936.","paperID":"None"},{"content":"Markus Montola. 2010. The Positive Negative Experience in Extreme Role-Playing. In Proc. Nordic DiGRA.","paperID":"None"},{"content":"Mary Beth Oliver and Anne Bartsch. 2010. Appreciation as audience response: Exploring entertainment gratifications beyond hedonism. Human Communication Research 36, 1 (2010), 53--81.","paperID":"None"},{"content":"Mary Beth Oliver, Nicholas David Bowman, Julia K Woolley, Ryan Rogers, Brett I Sherrick, and Mun-Young Chung. 2015. Video Games as Meaningful Entertainment Experiences. Psychology of Popular Media Culture (2015).","paperID":"None"},{"content":"Mary Beth Oliver and Arthur A Raney. 2011. Entertainment as pleasurable and meaningful: Identifying hedonic and eudaimonic motivations for entertainment consumption. Journal of Communication 61, 5 (2011), 984--1004.","paperID":"None"},{"content":"Richard M Ryan, C Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and emotion 30, 4 (2006), 344--360.","paperID":"None"},{"content":"Jose Luis Gonzalez Sanchez, Francisco Luis Gutierrez Vela, Francisco Montero Simarro, and Natalia Padilla-Zea. 2012. Playability: analysing user experience in video games. Behaviour & Information Technology 31, 10 (2012), 1033--1054.","paperID":"None"},{"content":"Ian Graham Ronald Shaw and Barney Warf. 2009. Worlds of affect: Virtual geographies of video games. Environment and planning. A 41, 6 (2009), 1332--1343.","paperID":"None"},{"content":"Sharon T Steinemann, Elisa D Mekler, and Klaus Opwis. 2015. Increasing Donating Behavior Through a Game for Change: The Role of Interactivity and Appreciation. In CHI PLAY '15. ACM, 319--329.","paperID":"None"},{"content":"Eduard Sioe-Hao Tan. 2008. Entertainment is emotion: The functional architecture of the entertainment experience. Media psychology 11, 1 (2008), 28--51.","paperID":"None"},{"content":"Kellie Vella, Daniel Johnson, and Leanne Hides. 2013. Positively playful: when videogames lead to player wellbeing. In First International Conference on Gameful Design, Research and Applications. ACM, 99--102.","paperID":"None"},{"content":"Douglas Wilson and Miguel Sicart. 2010. Now it's personal: on abusive game design. In Proc. FuturePlay 2010. ACM, 40--47.","paperID":"None"}],"title":"Negative Emotion, Positive Experience?: Emotionally Moving Moments in Digital Games","filename":"CHI16/p2996","authors":["Julia Ayumi Bopp","Elisa D. Mekler","Klaus Opwis"],"conference":"CHI '16"}