{"paperId":2858407,"citation":[],"reference":[{"content":"Apple Insider. First Look: iOS 9's New CursorControlling Gesture Keyboard on iPad. 2015. Retrieved August 22, 2015 from http://appleinsider.com/articles/15/06/11/first-look-ios9s-new-cursor-controlling-gesture-keyboard-on-ipad","paperID":"None"},{"content":"Apple Insider. How to use iOS 9's keyboard as a trackpad with 3D Touch on iPhone 6s. 2015. Retrieved December 30, 2015 from http://appleinsider.com/articles/15/10/11/how-to-useios-9s-keyboard-as-a-trackpad-with-3d-touch-oniphone-6s-","paperID":"None"},{"content":"Ahmed Sabbir Arif, Mauricio H. Lopez, Wolfgang Stuerzlinger. 2010. Two new mobile touchscreen text entry techniques. Poster at the 36th Graphics Interface Conference (GI '10). CEUR-WS.org/Vol-588.","paperID":"None"},{"content":"Ahmed Sabbir Arif, Michel Pahud, Ken Hinckley, and Bill Buxton. 2014. Experimental study of stroke shortcuts for a touchscreen keyboard with gestureredundant keys removed. In Proceedings of Graphics Interface 2014 (GI '14). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 43--50.","paperID":"None"},{"content":"Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2009. Analysis of text entry performance metrics. In Proceedings of IEEE Toronto International Conference on Science and Technology for Humanity (TIC-STH '09). IEEE, Washington, DC, USA, 100105.","paperID":"None"},{"content":"Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2010. Predicting the cost of error correction in characterbased text entry technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 5--14.","paperID":"None"},{"content":"Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2013. Pseudo-pressure detection and its use in predictive text entry on touchscreens. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (OzCHI '13), Haifeng Shen, Ross Smith, Jeni Paay, Paul Calder, and Theodor Wyeld (Eds.). ACM, NY, NY, USA, 383--392.","paperID":"None"},{"content":"Ahmed Sabbir Arif, Wolfgang Stuerzlinger, Ali Mazalek, Sunjun Kim, and Geehyuk Lee. 2015. A smart-restorable backspace to facilitate text entry error correction. In CHI 2015 Workshop on Text Entry on the Edge (April 18, 2015). Seoul, South Korea.","paperID":"None"},{"content":"Ahmed Sabbir Arif, Wolfgang Stuerzlinger, Euclides Jose de Mendonca Filho, and Alec Gordynski. 2014. Error behaviours in an unreliable in-air gesture recognizer. In Proceedings of the Extended Abstracts of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 1603--1608.","paperID":"None"},{"content":"Geoffroy Aulagner, Romain François, Benoît Martin, Dominique Michel, and Mathieu Raynal. 2010. Floodkey: increasing software keyboard keys by reducing needless ones without occultation. In Proceedings of the 10th WSEAS International Conference on Applied Computer Science (ACS' 10), Hamido Fujita and Jun Sasaki (Eds.). World Scientific and Engineering Academy and Society (WSEAS), Stevens Point, Wisconsin, USA, 412--417.","paperID":"None"},{"content":"Matt Bolton. 2014. How to Improve iOS Autocorrect. Mac Life. Retrieved July 21, 2015 from http://www.maclife.com/article/howtos/how-improveautocorrect","paperID":"None"},{"content":"James Clawson, Kent Lyons, Alex Rudnick, Robert A. Iannucci, Jr., and Thad Starner. 2008. Automatic whiteout++: correcting mini-QWERTY typing errors using keypress timing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 573--582.","paperID":"None"},{"content":"John G. Dawes. 2008. Do data characteristics change according to the number of scale points used? An experiment using 5 point, 7 point and 10 point scales. International Journal of Market Research 51, 1.","paperID":"None"},{"content":"Paul M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology 47, 6: 262--269.","paperID":"None"},{"content":"Fleksy Keyboard. 2015. Retrieved August 12, 2015 from https://fleksy.com","paperID":"None"},{"content":"Vittorio Fuccella, Poika Isokoski, and Benoit Martin. 2013. Gestures and widgets: performance in text editing on multi-touch capable mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2785--2794.","paperID":"None"},{"content":"Gartner, Inc. Forecast: PCs, Ultramobiles, and Mobile Phones, Worldwide, 2011--2018, 2Q14 Update. 2015. Retrieved July 21, 2015 from https://www.gartner.com/doc/3077322/forecast-pcsultramobiles-mobile-phones","paperID":"None"},{"content":"Joshua Goodman, Gina Venolia, Keith Steury, and Chauncey Parker. 2002. Language modeling for soft keyboards. In Proceedings of the 7th International Conference on Intelligent User Interfaces (IUI '02). ACM, NY, NY, USA, 194--195.","paperID":"None"},{"content":"James Clawson, Ahmed Sabbir Arif, Stephen Brewster, Mark Dunlop, Per Ola Kristensson, and Antti Oulasvirta. 2015. Text Entry on the Edge. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 2381--2384.","paperID":"None"},{"content":"Google Code. The Diff Match and Patch Libraries. 2012. Retrieved August 10, 2015 from https://code.google.com/p/google-diff-match-patch","paperID":"None"},{"content":"Jonathan T. Grudin. 1983. Error patterns in novice and skilled transcription typing. In Cognitive Aspects of Skilled Typewriting, W. E. Cooper (Ed.). SpringerVerlag, 121--143.","paperID":"None"},{"content":"jQuery Mobile. A Touch-Optimized Web Framework. 2015. Retrieved March 12, 2015 from https://jquerymobile.com","paperID":"None"},{"content":"Sunjun Kim and Geehyuk Lee. 2012. Restorable backspace. In Adjunct proceedings of the 25th annual ACM symposium on User interface software and technology (UIST Adjunct Proceedings '12). ACM, NY, NY, USA, 73--74.","paperID":"None"},{"content":"KeuKey Keyboard. 2014. Retrieved July 21, 2015 from http://www.keukey.com","paperID":"None"},{"content":"Vladimir I. Levenshtein. 1966. Binary codes capable of correcting deletions, insertions, and reversals. In Soviet Physics Doklady 10, 8: 707--710.","paperID":"None"},{"content":"I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase sets for evaluating text entry techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, NY, NY, USA, 754--755.","paperID":"None"},{"content":"Dominik Schmidt, Florian Block, and Hans Gellersen. 2009. A Comparison of Direct and Indirect Multi-touch Input for Large Surfaces. In Proceedings of the 12th IFIP TC 13 International Conference on HumanComputer Interaction: Part I (INTERACT '09), Tom Gross, Jan Gulliksen, Paula Kotzé, Lars Oestreicher, Philippe Palanque, Raquel Oliveira Prates, and Marco Winckler (Eds.). Springer-Verlag, Berlin, Heidelberg, 582.","paperID":"None"},{"content":"Keith Vertanen and Per Ola Kristensson. 2011. A versatile dataset for text entry evaluations based on genuine mobile emails. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, NY, NY, USA, 295--298.","paperID":"None"},{"content":"Keith Vertanen and Per Ola Kristensson. 2014. Complementing text entry evaluations with a composition task. ACM Transactions on ComputerHuman Interaction 21, 2, Article 8 (February 2014), 33 pages.","paperID":"None"},{"content":"Wiktionary. The Most Common Words in Project Gutenberg: Frequency lists/PG/2006/04/1--10000. 2006. Retrieved July 21, 2015 from https://en.wiktionary.org/wiki/Wiktionary:Frequency_l ists/PG/2006/04/1--10000","paperID":"None"}],"abstract":"We present a new smart-restorable backspace technique to facilitate correction of \"overlooked\" errors on touchscreen-based tablets. We conducted an empirical study to compare the new backspace technique with the conventional one. Results of the study revealed that the new technique improves the overall text entry performance, both in terms of speed and operations per character, by significantly reducing error correction efforts. In addition, results showed that most users preferred the new technique to the one they use on their tablets, and found it easy to learn and use. Most of them also felt that it improved their overall text entry performance, thus wanted to keep using it.","title":"Evaluation of a Smart-Restorable Backspace Technique to Facilitate Text Entry Error Correction","filename":"CHI16/p5151","authors":["Ahmed Sabbir Arif","Sunjun Kim","Wolfgang Stuerzlinger","Geehyuk Lee","Ali Mazalek"],"conference":"CHI '16"}