{"paperId":2858506,"abstract":"HCI research has both endorsed \"making\" for its innovation and democratization capacity and critiqued its underlying technosolutionism, i.e., the idea that technology provides solutions to complex social problems. This paper offers a reflexive-interventionist approach that simultaneously takes seriously the critiques of making's claims as technosolutionist while also embracing its utopian project as worth reconstituting in broader sociopolitical terms. It applies anthropological theory of the global and feminist-utopianism to the analysis of findings from research on making cultures in Taiwan and China. More specifically, the paper provides ethnographic snippets of utopian glimmers in order to speculatively imagine and explore alternative futures of making worth pursuing, and in so doing re-constitute the utopian vision of making.","citation":[],"reference":[{"content":"Morgan G. Ames, Daniela K. Rosner and Ingrid Erickson. 2015. Worship, Faith, and Evangelism: Religion as an Ideological Lens for Engineering Worlds. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, CSCW'15, pp. 69--81.","paperID":"None"},{"content":"Morgan Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David Mellis, and Daniela Rosner. 2014. Making Cultures: Empowerment, Participation, and Democracy - or Not? In Proc. Panel at CHI'14, ACM Press (2014), pp. 1087--1092.","paperID":"None"},{"content":"Chris Anderson. 2012. Makers. The New Industrial Revolution. Crown Publishing Group, NY.","paperID":"None"},{"content":"Zachary Bako. 2015. How a Nation of Tech Copycats transformed into a Hub for Innovation. Wired Magazine. http://www.wired.com/2015/12/tech-innovationin-china/, last accessed Jan 3, 2016.","paperID":"None"},{"content":"Liam Bannon and Pelle Ehn. 2012. Design Matters in Participatory Design. In: J. Simonsen and T. Robertson (eds) Routledge Handbook of Participatory Design, pp. 37--63.","paperID":"None"},{"content":"Jeffrey Bardzell and Shaowen Bardzell. 2013. What is \"critical\" about critical design? In Proc. of CHI'2013. ACM: NY.","paperID":"None"},{"content":"Jeffrey Bardzell, Shaowen Bardzell, and Austin Toombs. 2014. \"Now that's definitely a proper hack\": Self-made tools in hackerspaces. In Proc. of CHI'2014. ACM: NY","paperID":"None"},{"content":"Shaowen Bardzell. 2015. Utopian Design. In Reconceptualizing Critical Utopia panel at Aarhus 2015, the Decennial Conference on Critical Alternatives. Aarhus, Denmark.","paperID":"None"},{"content":"Shaowen Bardzell. 2014. Utopias of Participation: Design, Criticality, and Emancipation. Keynote address at the 2014 Participatory Design Conference. In Windhoek, Namibia.","paperID":"None"},{"content":"Shaowen Bardzell, Daniela Rosner, and Jeffrey Bardzell. 2012. Crafting quality in design: Integrity, creativity, and public sensibility. In Proc. of the Designing Interactive Systems Conference, DIS 2012. ACM: NY, pp. 11--20.","paperID":"None"},{"content":"Tom Boellstorff. 2008. The coming of age in Second Life: an anthropologist explores the virtually human. Princeton University Press.","paperID":"None"},{"content":"Seyla Benhabib. 1992. Situating the Self: Gender, Community, and Postmodernism in Contemporary Ethics. Routledge: NY.","paperID":"None"},{"content":"Gareth Branwyn. 2015. An Insider's Guide to Shenzhen Manufacturing. Makezine. http://makezine.com/2015/06/15/making-in-shenzhen/ last accessed September 2015.","paperID":"None"},{"content":"Leah Buechley and Benjamin Mako Hill. 2010. LilyPad in the wild: How hardware's long tail is supporting new engineering and design communities. In Proceedings of the Designing Interactive Systems Conference, DIS 2010. ACM: NY, pp. 199--207.","paperID":"None"},{"content":"Leah Buechley, Qiu, K., and de Boer, Sonja. Sew electric: a collection of DIY projects that combine fabric, electronics, and programming. HLT Press, Cambridge, MA, USA 2013.","paperID":"None"},{"content":"Leah Buechley and H. Perner-Wilson. 2013. Crafting Technology: Reimagining the Processes, Materials, and Cultures of Electronics. Journal ACM Transactions on Computer-Human Interaction (ToCHI), Vol 19, Issue 3, Article No. 21.","paperID":"None"},{"content":"Anita Chan. 2014. Networking Peripheries. Technological Futures and the Myth of Digital Universalism. Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Ruy Cervantes and Bonnie Nardi. 2010. Innovating from the Global South: practices to connect local and global networks of innovation. In Proc. of ICIC'10, pp.259--262.","paperID":"None"},{"content":"Susan Currie Sivek. 2011. \"We Need a Showing of All Hands\" Technological Utopianism in MAKE Magazine. Journal of Communication Inquiry 35, 3, pp. 187--209.","paperID":"None"},{"content":"David Cuartelles. 2014. How Deep is your Love? On Open-Source Hardware. In: Making Futures. Marginal Notes on Innovation, Design and Democracy (eds Pelle Ehn, Elisabet M. Nilsson, Richard Topgaard), Cambridge, Massachusetts: MIT Press.","paperID":"None"},{"content":"Laura Devendorf and Kimiko Ryokai. 2014. Being the machine: exploring new modes of making. In Proc. of the Designing Interactive Systems Conference, DIS'14, pp. 33--36.","paperID":"None"},{"content":"Laura Devendorf and Daniela K. Rosner. 2015. Reimagining Digital Fabrication as Performance Art. In: Extended Abstracts of the ACM conference on Human Factors in Computing Systems (CHI'15), pp. 555--566.","paperID":"None"},{"content":"Paul Dourish. 2006. Implications for Design. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'06), pp. 541--550.","paperID":"None"},{"content":"Paul Dourish and Scott D. Mainwaring. 2012. Ubicomp's Colonial Impulse. In Proceedings. of UbiComp'12, Springer, pp. 133--142.","paperID":"None"},{"content":"Pelle Ehn, Elisabet M. Nilsson, Richard Topgaard (eds). 2014. Making Futures. Marginal Notes on Innovation, Design and Democracy. Cambridge, Massachusetts: MIT Press.","paperID":"None"},{"content":"Daniel Fiton, Janet C. Read, John Dempsey. 2015. Exploring children's designs for maker technologies. In Proc. of IDC'15, pp. 379--382.","paperID":"None"},{"content":"Michel Foucault. (1977). Discipline and Punish: The Birth of the Prison. Alan Sheridan, trans. NY: Vintage Books.","paperID":"None"},{"content":"Sarah Fox, Rachel Rose Ulgado, Daniela Rosner. 2015. Hacking Culture, not Devices: Access and Recognition in Feminist Hackerspaces. In Proc. of CSCW'15, pp. 56--68.","paperID":"None"},{"content":"Neil Gershenfeld. 2005. Fab. The coming revolution on your desktop -- from personal computers to personal fabrication. Basic Books.","paperID":"None"},{"content":"Mel Gregg. 2011. Work's Intimacy. Cambridge: Polity.","paperID":"None"},{"content":"Donna Haraway. 2008. When Species Meet. Minneapolis, MN: University of MN Press.","paperID":"None"},{"content":"Hartman, B., Doorley, S., Klemmer, S. Hacking, Mashing, Gluing: Understanding Opportunistic Design. IEEE Journal of Pervasive Computing, 2008, Vol. 7, No. 3, pp. 46--54.","paperID":"None"},{"content":"Josephine Ho. 2010. Shanzhai: Economic/Cultural Production through the Cracks of Globalization. Crossroads: Cultural Studies Conference.","paperID":"None"},{"content":"Jonathan Hook, Sanne Verbaan, Abigail Durrant, Patrick Olivier, Peter Wright. 2014. A study of the challenges related to DIY assistive technology in the context of children with disabilities. In Proc. of DIS'14, pp. 597--606.","paperID":"None"},{"content":"Scott Hudson. 2014. Printing teddy bears: a technique for 3D printing of soft interactive objects. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems CHI'14, pp.459--458.","paperID":"None"},{"content":"Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca Grinter. 2010. Postcolonial Computing: A Lens on Design and Development. In Proceedings of the ACM Conf. Human Factors in Computing Systems CHI 2010 (Atlanta, GA), pp.1311--1320.","paperID":"None"},{"content":"Lilly Irani. 2015. Hackathons and the Making of Entrepreneurial Citizenship. Science, Technology & Human Values (Sage), Vol. 40, No. 5, pp.799--824.","paperID":"None"},{"content":"Lucas Introna and Helen Nissenbaum. 1999. Sustaining the Public Good Vision of the Internet: The Politics of Search Engines. Center for the Arts and Cultural Policy Studies, Working Paper #9, 1999, Princeton University.","paperID":"None"},{"content":"Steve J. Jackson, Alex Pompe, and Gabriel Krieshok. 2012. Repair worlds: maintenance, repair, and ICT for development in rural Namibia. In Proc. of the ACM 2012 conference on Computer Supported Cooperative Work, pp.107--116.","paperID":"None"},{"content":"Denisa Kera. 2010. \"Bionetworking over DNA and Online Forms of Biological Citizenship: STS and Design Perspectives.\" Genomics, Society and Policy 6 (1): 47--60.","paperID":"None"},{"content":"Denisa Kera and Connor Graham. 2010. Collective Sensor Networks and Future Communities: Designing interaction across multiple scales. In Proc. of OZCHI'10, pp. 396--399.","paperID":"None"},{"content":"Beth Kolko, Alexis Hope, Brook Sattler, Kate MacCorkle, Behzod Sirjani Hackademia: Building Functional Rather than Accredited Engineers. In Proc. of the Participatory Design Conference (ACM), PDC'12, pp.129--138.","paperID":"None"},{"content":"Stacey Kuznetsov, Nathan Wilson, Scott Hudson, Carrie Doonan, Swarna Mohan, and Eric Paulos. 2015. DIYBio Things: Open Source Biology Tools as Platforms for Hybrid Knowledge Production and Scientific Participation. In Proc. of ACM SIGCHI Conference on Human Factors in Computing Systems, pp. 4065--4068.","paperID":"None"},{"content":"Stacey Kuznetsov, Alex Taylor, Nick Villar, Time Regan, and Eric Paulos. 2012. At the Seams: DIYBio and Opportunities for HCI. In Proc. of Designing Interactive Systems (ACM), DIS'12, pp. 258--267.","paperID":"None"},{"content":"Ruth Levitas. 2013. Utopia as Method: The Imaginary Reconstitution of Society. Palgrave Macmillan.","paperID":"None"},{"content":"Silvia Lindtner. 2015. Hacking with Chinese Characteristics: The Promises of the Maker Movement against China's Manufacturing Culture. Science, Technology & Human Values (Sage), Vol. 40, No. 5, pp.854--879.","paperID":"None"},{"content":"Silvia Lindtner, Anna Greenspan, David Li. 2015. Designed in Shenzhen: Shanzhai Manufacturing and Maker Entrepreneurs. In Proc. of 5th Decennial Aarhus Conference on Critical Alternatives, Denmark, Aug 1721, 2015, pp. 85--96.","paperID":"None"},{"content":"Silvia Lindtner, Garnet Hertz, Paul Dourish. 2014. Emerging Sites of HCI Innovation: Hackerspaces, Hardware Start-ups, Incubators. In Proc. of the ACM SIGCHI Conference on Human Factors in Computing Systems (Toronto, Canada), pp.439--448.","paperID":"None"},{"content":"Silvia Lindtner and David Li. 2012. Created in China: The Makings of China's Hackerspace Community. ACM Interactions , XIX. 6 November + December.","paperID":"None"},{"content":"Silvia Lindtner. 2014. Hackerspaces and Internet of Things in China: How Makers are reinventing Industrial Production, Innovation & the Self. Journal of China Information, Special Issue on \"Political Contestation in Chinese Digital Spaces\" (ed. Guobin Yang), Vol. 28, No. 2, pp. 145--167.","paperID":"None"},{"content":"Fengshu Liu. 2011. Urban Youth in China: Modernity, the Internet and the Self. NY: Routledge.","paperID":"None"},{"content":"Boy Lüthje, Stefanie Hürtgen, Peter Pawlicki, and Martina Stroll. 2013. From Silicon Valley to Shenzhen. Global Production and work in the IT industry. Rowman & Littlefield Publishers.","paperID":"None"},{"content":"Rebecca MacKinnon. 2012. Consent of the Networked: The Worldwide Struggle for Internet Freedom. NY: Basic Books.","paperID":"None"},{"content":"David Mellis and Leah Buechley. 2014. Do-It-Yourself Cellphones: An Investigation into the Possibilities and Limits of High-Tech DIY. In Proceedings of the ACM SIGCHI conference on Human factors in computing systems, pp. 1723--1732.","paperID":"None"},{"content":"Gina Neff. 2012. Venture Labor. Work and the Burden of Risk in Innovation Industries. Cambridge, Massachusetts: MIT Press.","paperID":"None"},{"content":"Mary Ann O'Donnell. 2001. Becoming Hong Kong, Razing Baoan, Preserving Xin'an: An Ethnographic Account of Urbanization in the Special Economic Zone. Cultural Studies 15(3/4), 419--443.","paperID":"None"},{"content":"Mary Ann O'Donnell. 2006. Attracting the World's Attention: The Cultural Supplement in Shenzhen Municipality. Positions 14:1.","paperID":"None"},{"content":"Aihwa Ong and Stephen J. Collier (eds.). 2004. Global Assemblages: Technology, Politics, and Ethics as Anthropological Problems. Wiley-Blackwell.","paperID":"None"},{"content":"William Overhault. 2015. The politics of China's anticorruption campaign. EastAsiaForum. http://www.eastasiaforum.org/2015/09/15/the-politicsof-chinas-anti-corruption-campaign/ last accessed September 20, 2015.","paperID":"None"},{"content":"Matt Ratto and Megan Boler (eds). 2014. DIY Citizenship. Critical Making and Social Media. Cambridge, Massachusetts: MIT Press.","paperID":"None"},{"content":"David Roedl, Shaowen Bardzell, Jeffrey Bardzell. 2015. Sustainable Making? Balancing Optimism and Criticism in HCI Discourse, ACM TOCHI Journal, VOl. 22, Issue 3, Article No. 15.","paperID":"None"},{"content":"Daniela K. Rosner and Morgan G. Ames. 2014. Designing for Repair? Infrastructures and Materialities of Breakdown. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, pp. 319--331.","paperID":"None"},{"content":"Ananya Roy and Aiwah Ong. 2011. Worlding Cities. Asian Experiments and the Art of Being Global. Blackwell Publishing.","paperID":"None"},{"content":"Gabriela T. Richard, Yasmin B. Kafai, Barrie Adleberg, Orkan Telhan. 2015. StitchFest: Diversifying a College Hackathon to broaden participation and perceptions in computing. In Proc. of SIGCE'15, pp.114--119.","paperID":"None"},{"content":"Lucy Suchman. 2008. Striking Likeness to Difference. Paper presented at 4S/EASST (annual meeting of Society for Social Studies of Science), Rotterdam.","paperID":"None"},{"content":"Sunflower student movement: http://tinyurl.com/p58tjor","paperID":"None"},{"content":"Tom Phillips. 2015. Families of China's 'disappeared' say country is a place of fear and panic. The Guardian. http://www.theguardian.com/world/2015/aug/31/families-of-chinas-disappeared-say-country-is-a-place-offear-and-panic, last accessed September 20, 2015.","paperID":"None"},{"content":"Jie Qi and Leah Buechley. 2014. Sketching in Circuits: Designing and building electronics on paper. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI'14), pp 1713--1722.","paperID":"None"},{"content":"Yuling Sun, Silvia Lindtner, Xianghua Ding, Tun Lu, Ning Gu. 2015. Reliving the Past & Making a Harmonious Society Today: A Study of Elderly Electronic Hackers in China. In Proc. of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, pp. 44--55.","paperID":"None"},{"content":"Yuri Takhtezev. 2012. Coding Places. Software Practice in a South American City. Cambridge, MA: MIT Press.","paperID":"None"},{"content":"Joshua G. Tanenbaum. Amanda M. Williams, Audrey Desjardins, Karen Tanenbaum. 2013. Democratizing technology: pleasure, utility and expressiveness in DIY and maker practice. In Proc. of ACM CHI'13, pp. 2603--2612.","paperID":"None"},{"content":"Alex Taylor. 2011. Out there. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'11), pp. 685--694.","paperID":"None"},{"content":"Tiziana Terranova. 2000. Free Labor: Producing Culture for the Digital Economy. Social Text 63, Vol. 18, No. 2, Duke University Press.","paperID":"None"},{"content":"Austin L. Toombs, Shaowen Bardzell, Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In Proc. of ACM CHI'15, pp. 629--638.","paperID":"None"},{"content":"vMaker action plan: http://tinyurl.com/o6s38vt","paperID":"None"},{"content":"Ron Wakkary, Markus Lorenz Schilling, Matthew A. Dalton, Sabrina Hauser, Audrey Desjardins, Xiao Zhang, Henry W.J. Lin. 2015. Tutorial Authorship and Hybrid Designers: The Joy (and Frustration) of DIY Tutorials. In Proc. of ACM CHI'15.","paperID":"None"},{"content":"Tricia Wang and Josef 'Jofish' Kaye. 2011. Inventive Leisure Practice: understanding hacking communities as sites of sharing and innovation. In Proc. of ACM CHI Extended Abstracts, pp. 263--272.","paperID":"None"},{"content":"Tom Whitwell. 2014. Inside Shenzhen: China's Silicon Valley. The Guardian. http://www.theguardian.com/cities/2014/jun/13/inside-shenzen-china-silicon-valleytech-nirvana-pearl-river last accessed September 20, 2015.","paperID":"None"},{"content":"Amanda Williams, Silvia Lindtner, Ken Anderson, and Paul Dourish. 2014. Multisited Design: An Analytical Lens for Transnational HCI. Journal of Human-Computer Interaction, Vol. 29, Issue 1, pp. 78--108.","paperID":"None"},{"content":"Guobin Yang. 2011. The Power of the Internet in China: Citizen Activism Online. NY: Columbia University Press.","paperID":"None"}],"title":"Reconstituting the Utopian Vision of Making: HCI After Technosolutionism","filename":"CHI16/p1390","authors":["Silvia Lindtner","Shaowen Bardzell","Jeffrey Bardzell"],"conference":"CHI '16"}