{"paperId":"2858092","citation":[],"reference":[{"content":"Victoria Bellotti, Alexander Ambard, Daniel Turner, Christina Gossmann, Kamila Demkova, and John M. Carroll. 2015. A Muddle of Models of Motivation for Using Peer-to-Peer Economy Systems. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 1085--1094. http://doi.acm.org/10.1145/2702123.2702272","paperID":"None"},{"content":"Victoria Bellotti, Sara Cambridge, Karen Hoy, Patrick C. Shih, Lisa Renery Handalian, Kyungsik Han, and John M. Carroll. 2014. Towards community-centered support for peer-to-peer service exchange: rethinking the timebanking metaphor. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 2975--2984. http://doi.acm.org/10.1145/2556288.2557061","paperID":"None"},{"content":"Paula Bialski. 2012. Becoming intimately mobile. Peter Lang.","paperID":"None"},{"content":"Peter Michael Blau. 1964. Exchange and Power in Social Life. J. Wiley.","paperID":"None"},{"content":"John M. Carroll and Victoria Bellotti. 2015. Creating Value Together: The Emerging Design Space of Peer-to-Peer Currency and Exchange. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). 1500--1510. http://doi.acm.org/10.1145/2675133.2675270","paperID":"None"},{"content":"Coye Cheshire and Karen S. Cook. 2004. The Emergence of trust networks under uncertainty: Implications for Internet interactions. Analyse & Kritik, 26, 1: 220--240.","paperID":"None"},{"content":"Coye Cheshire, Alexandra Gerbasi, and Karen S. Cook. 2010. Trust and Transitions in Modes of Social Exchange. Social Psychology Quarterly 73, 2: 176--195.","paperID":"None"},{"content":"Karen S. Cook and Coye Cheshire. 2013. Social Exchange, Power and Inequality in Networks. In Rational Choice Social Research, Rafael Wittek, Tom Snijders and Victor Nee (eds.) Stanford University Press.","paperID":"None"},{"content":"Couchsurfing. About us (website). 2015. Retrieved May 22, 2015 from http://about.couchsurfing.com/about/about-us/","paperID":"None"},{"content":"John W. Creswell. 2014. Research design: Qualitative, quantitative, and mixed methods approaches. 4th Edition. Sage publications, 2014.","paperID":"None"},{"content":"Benjamin G. Edelman and Michael Luca. 2014. Digital discrimination: The case of airbnb. com. Harvard Business School NOM Unit Working Paper.14--054.","paperID":"None"},{"content":"Richard M. Emerson. 1972. Exchange Theory, Part I: A Psychological Basis for Social Exchange and Exchange Relations in Network Structures. Sociological Theories in Progress. 38--87.","paperID":"None"},{"content":"Richard M. Emerson. 1972. Exchange Theory, Part II: A Psychological Basis for Social Exchange and Exchange Relations in Network Structures. Sociological Theories in Progress, 38--87.","paperID":"None"},{"content":"Bruno S. Frey and Reto Jegen. 2001. Motivation Crowding Theory: A Survey of Empirical Evidence. Journal of Economic Surveys 15, 5: 589--611.","paperID":"None"},{"content":"Eva Ganglbauer, Geraldine Fitzpatrick, Özge Subasi, and Florian Güldenpfennig. 2014. Think globally, act locally: a case study of a free food sharing community and social networking. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). 911--921. http://doi.acm.org/10.1145/2531602.2531664","paperID":"None"},{"content":"Jennie Germann Molz. 2014. Toward a Network Hospitality. First Monday 19(3).","paperID":"None"},{"content":"Jennie Germann Molz. 2011. Couch Surfing and network hospitality: \"It's not just about the furniture\"?. Hospitality & Society 1, 3: 215--225.","paperID":"None"},{"content":"Russell Hardin. 1992. The Street-Level Epistemology of Trust. Analyse & Kritik, 14, 2: 152--176.","paperID":"None"},{"content":"George C. Homans. 1958. Social behavior as exchange. American journal of sociology, 62: 597--606.","paperID":"None"},{"content":"Tapio Ikkala and Airi Lampinen. 2015. Monetizing Network Hospitality: Hospitality and Sociability in the Context of Airbnb. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). 1033--1044. http://doi.acm.org/10.1145/2675133.2675274","paperID":"None"},{"content":"Tapio Ikkala and Airi Lampinen. 2014. Defining the price of hospitality: networked hospitality exchange via Airbnb. In Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW Companion '14). 173--176. http://doi.acm.org/10.1145/2556420.2556506","paperID":"None"},{"content":"Airi Lampinen, Victoria Bellotti, Andrés Monroy Hernández, Coye Cheshire, and Alexandra Samuel. 2015. Studying the \"Sharing Economy\": Perspectives to Peer-to-Peer Exchange. In Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing (CSCW'15 Companion). 117--121. http://doi.acm.org/10.1145/2685553.2699339","paperID":"None"},{"content":"Airi Lampinen, Vilma Lehtinen, Coye Cheshire, and Emmi Suhonen. 2013. Indebtedness and reciprocity in local online exchange. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). 661--672. http://doi.acm.org/10.1145/2441776.2441850","paperID":"None"},{"content":"Debra Lauterbach, Hung Truong, Tanuj Shah, and Lada Adamic. 2009. Surfing a Web of Trust: Reputation and Reciprocity on CouchSurfing.com. In Proceedings of the 2009 International Conference on Computational Science and Engineering - Volume 04 (CSE '09), Vol. 4. 346--353. http://dx.doi.org/10.1109/CSE.2009.345","paperID":"None"},{"content":"Donghun Lee, Woochang Hyun, Jeongwoo Ryu, Woo Jung Lee, Wonjong Rhee, and Bongwon Suh. 2015. An Analysis of Social Features Associated with Room Sales of Airbnb. In Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing (CSCW'15 Companion). 219--222. http://doi.acm.org/10.1145/2685553.2699011","paperID":"None"},{"content":"Mark R. Lepper and David Greene. 1978. The Hidden Costs of Reward: New Perspectives on the Psychology of Human Motivation. Erlsbaum Publishers.","paperID":"None"},{"content":"Claude Lévi-Strauss. 1969. The Elementary Structures of Kinship. Beacon.","paperID":"None"},{"content":"Bronislaw Malinowski. 1922. Argonauts of the Western Pacific. E.P. Dutton.","paperID":"None"},{"content":"James G. March. 1999. The Pursuit of Organizational Intelligence. Blackwell.","paperID":"None"},{"content":"Marcel Mauss. 1925[1954]. The Gift: The Form and Reason for Exchange in Archaic Societies. W.W. Norton.","paperID":"None"},{"content":"Moira McGregor, Barry Brown, and Mareike Glöss. 2015. Disrupting the cab: Uber, ridesharing and the taxi industry. Journal of Peer-Production.","paperID":"None"},{"content":"Linda D. Molm, David R. Schaefer, and Jessica L. Collett. 2009. Risk, Uncertainty, and Trust in Negotiated and Reciprocal Forms of Exchange. Sociological Theory 27:1--32.","paperID":"None"},{"content":"Jennie Germann Molz. 2014. Toward a network hospitality. First Monday, 19, 3.","paperID":"None"},{"content":"Margit Osterloh and Bruno S. Frey. 2000. Motivation, Knowledge Transfer, and Organizational Forms. Organization Science, 11: 538--550.","paperID":"None"},{"content":"Paul Resnick. 2001. The social cost of cheap pseudonyms. Journal of Economics & Management Strategy, 10(2), 173--199.","paperID":"None"},{"content":"Eric R. Rice. 2002. The Effect of Social Uncertainty In Networks of Social Exchange. Ph.D. dissertation. Stanford University, Stanford, CA.","paperID":"None"},{"content":"Jens M. Riegelsberger, Angela Sasse, and John D. McCarthy. 2005. The mechanics of trust: A framework for research and design. International Journal of Human-Computer Studies 62(3), 381--422.","paperID":"None"},{"content":"Ben Schneiderman. 2011. Technology-mediated social participation: the next 25 years of HCI challenges. Human-Computer Interaction. Design and Development Approaches. Springer Berlin Heidelberg. 3--14.","paperID":"None"},{"content":"Patrick C. Shih, Victoria Bellotti, Kyungsik Han, and John M. Carroll. 2015. Unequal Time for Unequal Value: Implications of Differing Motivations for Participation in Timebanking. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 1075--1084. http://doi.acm.org/10.1145/2702123.2702560","paperID":"None"},{"content":"David Silverman. 2006. Interpreting qualitative data: Methods for analyzing talk, text and interaction. Sage.","paperID":"None"},{"content":"Emmi Suhonen, Airi Lampinen, Coye Cheshire, and Judd Antin. 2010. Everyday favors: a case study of a local online gift exchange system. In Proceedings of the 16th ACM international conference on Supporting group work (GROUP '10). 11--20. http://doi.acm.org/10.1145/1880071.1880074","paperID":"None"},{"content":"Jun E. Tan. 2010. The Leap of Faith from Online to Offline: An Exploratory Study of Couchsurfing.org. Lecture Notes In Computer Science, 6101: 367--380.","paperID":"None"},{"content":"Jacob Thebault-Spieker, Loren G. Terveen, and Brent Hecht. 2015. Avoiding the South Side and the Suburbs: The Geography of Mobile Crowdsourcing Markets. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). 265--275. http://doi.acm.org/10.1145/2675133.2675278","paperID":"None"},{"content":"Toshio Yamagishi. (2001) Trust as a Form of Social Intelligence. In Trust in Society, Karen S. Cook (ed.). Russell Sage Foundation, New York, 121--147.","paperID":"None"}],"abstract":"We examine how financial assurance structures and the clearly defined financial transaction at the core of monetized network hospitality reduce uncertainty for Airbnb hosts and guests. We apply the principles of social exchange and intrinsic and extrinsic motivation to a qualitative study of Airbnb hosts to 1) describe activities that are facilitated by the peer-to-peer exchange platform and 2) how the assurance of the initial financial exchange facilitates additional social exchanges between hosts and guests. The study illustrates that the financial benefits of hosting do not necessarily crowd out intrinsic motivations for hosting but instead strengthen them and even act as a gateway to further social exchange and interpersonal interaction. We describe the assurance structures in networked peer-to-peer exchange, and explain how such assurances can reconcile contention between extrinsic and intrinsic motivations. We conclude with implications for design and future research.","title":"Hosting via Airbnb: Motivations and Financial Assurances in Monetized Network Hospitality","filename":"CHI16/p1669","authors":["Airi Lampinen","Coye Cheshire"],"conference":"CHI '16"}