{"paperId":2858576,"citation":[],"reference":[{"content":"Lifecasting. Wikipedia. https://en.wikipedia.org/ wiki/Lifecasting. Retrieved Jan 5, 2016.","paperID":"None"},{"content":"Prosthetic makeup. Wikipedia. https://en.wikipedia.org/ wiki/Prosthetic_makeup. Retrieved Jan 5, 2016.","paperID":"None"},{"content":"Appropriate Audiences. 3d Printer X Tattoo Machine. Instructables. http://www.instructables.com/id/3D-PRINTER-X-TATTOO-MACHINE/. Retrieved Jan 4, 2016.","paperID":"None"},{"content":"Martin Bechthold, Jonathan King, Anthony Kane, Jeffrey Niemasz, Christoph Reinhart. Integrated Environmental Design and Robotic Fabrication Workflow for Ceramic Shading Systems. In Proceedings of the 28th ISARC (ISARC '11), Seoul, Korea, 70--75.","paperID":"None"},{"content":"Liwei Chan, Rong-Hao Liang, Ming-Chang Tsai, Kai-Yin Cheng, Chao-Huai Su, Mike Y. Chen, Wen-Huang Cheng, and Bing-Yu Chen. 2013. FingerPad: private and subtle interaction using fingertips. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 255--260. DOI=10.1145/2501988.2502016","paperID":"None"},{"content":"Ke-Yu Chen, Kent Lyons, Sean White, and Shwetak Patel. 2013. uTrack: 3D input using two magnetic sensors. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 237--244. DOI=10.1145/2501988.2502035","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Stelian Coros, Jennifer Mankoff, and Scott E. Hudson. 2015. Encore: 3D Printed Augmentation of Everyday Objects with Printed-Over, Affixed and Interlocked Attachments. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 73--82. DOI=http://dx.doi.org/10.1145/2807442.2807498","paperID":"None"},{"content":"Laura Devendorf and Kimiko Ryokai. 2015. Being the Machine: Reconfiguring Agency and Control in Hybrid Fabrication. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2477--2486. http://doi.acm.org/10.1145/2702123.2702547","paperID":"None"},{"content":"Nicholas Foley, Ryan Luke Johns, Axel Kilian. 2014. Bouyant Extrusions. Workshop In Robotic Fabrication in Architecture, Art and Design (RobArch '14).","paperID":"None"},{"content":"Jared Friedman and Heamin Kim. 2014. Experiments in Additive Clay Depositions. In Robotic Fabrication in Architecture, Art and Design (RobArch '14), 261--272.","paperID":"None"},{"content":"1Madeline Gannon, Tovi Grossman, and George Fitzmaurice. 2015. Tactum: A Skin-Centric Approach to Digital Design and Fabrication. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1779--1788. http://doi.acm.org/10.1145/2702123.2702581","paperID":"None"},{"content":"N. Gershenfeld (2008). Fab: the coming revolution on your desktop--from personal computers to personal fabrication. Basic Books.","paperID":"None"},{"content":"Sean Gustafson, Christian Holz, and Patrick Baudisch. 2011. Imaginary phone: learning imaginary interfaces by transferring spatial memory from a familiar device. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, New York, NY, USA, 283--292. DOI=10.1145/2047196.2047233","paperID":"None"},{"content":"Brian Harms. Buoyant Depositions. Retrieved Sept 2015. https://vimeo.com/65179063","paperID":"None"},{"content":"Chris Harrison, Desney Tan, and Dan Morris. 2010. Skinput: appropriating the body as an input surface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 453--462. DOI=10.1145/1753326.1753394.","paperID":"None"},{"content":"Chris Harrison, Hrvoje Benko, and Andrew D. Wilson. 2011. OmniTouch: wearable multitouch interaction everywhere. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, New York, NY, USA, 441--450. http://doi.acm.org/10.1145/2047196.2047255","paperID":"None"},{"content":"Christian Holz, Tovi Grossman, George Fitzmaurice, and Anne Agur. 2012. Implanted user interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 503--512. http://doi.acm.org/10.1145/2207676.2207745","paperID":"None"},{"content":"Takeo Igarashi, Satoshi Matsuoka, Sachiko Kawachiya, and Hidehiko Tanaka. 1997. Interactive beautification: a technique for rapid geometric design. In Proceedings of the 10th annual ACM symposium on User interface software and technology (UIST '97). ACM, New York, NY, USA, 105--114. DOI=10.1145/263407.263525 http://doi.acm.org/10.1145/263407.263525","paperID":"None"},{"content":"Kim, J. S., Kim, D. S., & Lee, M. C. (2007, October). 3D printing method of multi Piezo head using a photopolymer resin. In Control, Automation and Systems, 2007. ICCAS'07. International Conference on (pp. 2587--2590). IEEE.","paperID":"None"},{"content":"Joris Laarman. MX3D Metal. Retrieved Sept, 2015. http://mx3d.com/projects/metal/","paperID":"None"},{"content":"2Gierad Laput, Robert Xiao, Xiang 'Anthony' Chen, Scott E. Hudson, and Chris Harrison. 2014. Skin buttons: cheap, small, low-powered and clickable fixed-icon laser projectors. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA, 389--394. http://doi.acm.org/10.1145/2642918.2647356","paperID":"None"},{"content":"2Shu-Yang Lin, Chao-Huai Su, Kai-Yin Cheng, Rong-Hao Liang, Tzu-Hao Kuo, and Bing-Yu Chen. 2011. Pub - point upon body: exploring eyes-free interaction and methods on an arm. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, New York, NY, USA, 481--488. DOI=10.1145/2047196.2047259.","paperID":"None"},{"content":"Achim Menges, Jan Knippers. ICD/ITKE Research Pavilion 2014--15. Retrieved Sept 2015. http://icd.uni-stuttgart.de/?p=12965.","paperID":"None"},{"content":"Adiyan Mujibiya, Xiang Cao, Desney S. Tan, Dan Morris, Shwetak N. Patel, and Jun Rekimoto. 2013. The sound of touch: on-body touch and gesture sensing based on transdermal ultrasound propagation. In Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces (ITS '13). ACM, New York, NY, USA, 189--198. DOI=10.1145/2512349.2512821","paperID":"None"},{"content":"Stefanie Mueller, Pedro Lopes, and Patrick Baudisch. 2012. Interactive construction: interactive fabrication of functional mechanical devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, New York, NY, USA, 599--606. DOI = 10.1145/2380116.2380191","paperID":"None"},{"content":"Tao Ni, Amy K. Karlson, and Daniel Wigdor. 2011. AnatOnMe: facilitating doctor-patient communication using a projection-based handheld device. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 3333--3342. http://doi.acm.org/10.1145/1978942.1979437","paperID":"None"},{"content":"Masa Ogata, Yuta Sugiura, Yasutoshi Makino, Masahiko Inami, and Michita Imai. 2013. SenSkin: adapting skin as a soft interface. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 539--544. DOI=10.1145/2501988.2502039.","paperID":"None"},{"content":"Neri Oxman, J. Laucks, M. Kayser, E. Tsai & M. Firstenberg. 2013. Freeform 3D Printing: toward a Sustainable Approach to Additive Manufacturing. In Green Design, Materials and Manufacturing Processes. Helena Bartolo et al. (eds.). CRC Press.","paperID":"None"},{"content":"Huaishu Peng, Amit Zoran, and François V. Guimbretière. 2015. D-Coil: A Hands-on Approach to Digital 3D Models Design. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1807--1815. DOI=10.1145/2702123.2702381","paperID":"None"},{"content":"Alec Rivers, Andrew Adams, and Frédo Durand. 2012. Sculpting by numbers. ACM Trans. Graph.31, 6, Article 157 (November 2012), 7 pages. http://doi.acm.org/10.1145/2366145.2366176","paperID":"None"},{"content":"3Alec Rivers, Ilan E. Moyer, and Frédo Durand. 2012. Position-correcting tools for 2D digital fabrication. ACM Trans. Graph. 31, 4, Article 88 (July 2012), 7 pages. http://doi.acm.org/10.1145/2185520.2185584","paperID":"None"},{"content":"3Roy Shilkrot, Pattie Maes, Joseph A. Paradiso and Amit Zoran. 2015. \"Augmented Airbrush for Computer Aided Painting (CAP).\" ACM Trans. Graph. (TOG) 34, 2, Article 19, March 2015, 11 pages.","paperID":"None"},{"content":"3Rajinder Sodhi, Hrvoje Benko, and Andrew Wilson. 2012. LightGuide: projected visualizations for hand movement guidance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 179--188. http://doi.acm.org/10.1145/2207676.2207702","paperID":"None"},{"content":"Alexander Teibrich, Stefanie Mueller, François Guimbretière, Robert Kovacs, Stefan Neubert, and Patrick Baudisch. 2015. Patching Physical Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 83--91. DOI=http://dx.doi.org/10.1145/2807442.2807467","paperID":"None"},{"content":"Natalie Walsh. How to Use a Dress Form. Instructables. http://www.instructables.com/id/How-to-Use-a-Dress-Form/. Retrieved Jan. 5, 2016.","paperID":"None"},{"content":"Amy Wibowo, Daisuke Sakamoto, Jun Mitani, and Takeo Igarashi. 2012. DressUp: a 3D interface for clothing design with a physical mannequin. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), Stephen N. Spencer (Ed.). ACM, New York, NY, USA, 99--102. http://doi.acm.org/10.1145/2148131.2148153","paperID":"None"},{"content":"3Xing-Dong Yang, Tovi Grossman, Daniel Wigdor, and George Fitzmaurice. 2012. Magic finger: always-available input through finger instrumentation. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, New York, NY, USA, 147--156. DOI=10.1145/2380116.23801","paperID":"None"},{"content":"3Amit Zoran and Joseph A. Paradiso. 2013. FreeD: a freehand digital sculpting tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2613--2616. http://doi.acm.org/10.1145/2470654.2481361","paperID":"None"},{"content":"3Amit Zoran. 2013. Hybrid basketry: interweaving digital practice within contemporary craft. In ACM SIGGRAPH 2013 Art Gallery (SIGGRAPH '13). ACM, New York, NY, USA, 324--331. http://doi.acm.org/10.1145/2503649.2503651","paperID":"None"},{"content":"Amit Zoran, Roy Shilkrot, Suranga Nanyakkara, and Joseph Paradiso. 2014. The Hybrid Artisans: A Case Study in Smart Tools. ACM Trans. Comput.-Hum. Interact. 21, 3, Article 15 (June 2014), 29 pages. http://doi.acm.org/10.1145/2617570.","paperID":"None"}],"abstract":"There is a long tradition for crafting wearable objects directly on the body, such as garments, casts, and orthotics. However, these high-skill, analog practices have yet to be augmented by digital fabrication techniques. In this paper, we explore the use of hybrid fabrication workflows for on-body printing. We outline design considerations for creating on-body fabrication systems, and identify several human, machine, and material challenges unique to this endeavor. Based on our explorations, we present ExoSkin, a hybrid fabrication system for designing and printing digital artifacts directly on the body. ExoSkin utilizes a custom built fabrication machine designed specifically for on-body printing. We demonstrate the potential of on-body fabrication with a set of sample workflows, and share feedback from initial observation sessions.","title":"ExoSkin: On-Body Fabrication","filename":"CHI16/p5996","authors":["Madeline Gannon","Tovi Grossman","George Fitzmaurice"],"conference":"CHI '16"}