{"paperId":2858241,"abstract":"Sensory Substitution Devices (SSDs) convert visual information into another sensory channel (e.g. sound) to improve the everyday functioning of blind and visually impaired persons (BVIP). However, the range of possible functions and options for translating vision into sound is largely open-ended. To provide constraints on the design of this technology, we interviewed ten BVIPs who were briefly trained in the use of three novel devices that, collectively, showcase a large range of design permutations. The SSDs include the 'Depth-vOICe,' 'Synaestheatre' and 'Creole' that offer high spatial, temporal, and colour resolutions respectively via a variety of sound outputs (electronic tones, instruments, vocals). The participants identified a range of practical concerns in relation to the devices (e.g. curb detection, recognition, mental effort) but also highlighted experiential aspects. This included both curiosity about the visual world (e.g. understanding shades of colour, the shape of cars, seeing the night sky) and the desire for the substituting sound to be responsive to movement of the device and aesthetically engaging.","citation":[],"reference":[{"content":"@SEEINGWITHSOUND. 2015. As of last Thursday, The vOICe for Android has been installed by 269,395 unique users via Google Play https://play.google.com/store/apps/details?id=vOICe.v OICe -- #blind #a11y. Tweet. (13 June, 2015). Retrieved September 21, 2015 from https://twitter.com/seeingwithsound/status/6096238663","paperID":"None"},{"content":"@SEEINGWITHSOUND. 2015. Also during 2015: 21% of all runs of The vOICe for Android is by blind users! Get it on Google Play at https://t.co/XZKnjZMjZc #blind #a11y. Tweet. (13 June, 2015). Retrieved September 21, 2015 from https://twitter.com/seeingwithsound/status/6096349731","paperID":"None"},{"content":"Sami Abboud, Shlomi Hanassy, Shelly Levy-Tzedek, Shachar Maidenbaum and Amir Amedi. 2014. EyeMusic: Introducing a \"visual\" colorful experience for the blind using auditory sensory substitution. Restor Neurol Neurosci 32, 2: 247--257.","paperID":"None"},{"content":"Amir Amedi, William M Stern, Joan A Camprodon, Felix Bermpohl, Lotfi Merabet, Stephen Rotman, Christopher Hemond, Peter Meijer and Alvaro PascualLeone. 2007. Shape conveyed by visual-to-auditory sensory substitution activates the lateral occipital complex. Nat Neurosci 10, 6: 687--689.","paperID":"None"},{"content":"Malika Auvray, Sylvain Hanneton, and J Kevin O'Regan. 2007. Learning to perceive with a visuoauditory substitution system: Localisation and object recognition with 'The vOICe.' Perception 36, 3: 416430.","paperID":"None"},{"content":"Guido Bologna, Benoît Deville, Thierry Pun and Michel Vinckenbosch. 2007. Transforming 3D coloured pixels into musical instrument notes for vision substitution applications. EURASIP J Image Video Process 2: 8--8.","paperID":"None"},{"content":"David J. Brown, Andrew J. R. Simpson and Michael J. Proulx. 2014. Visual objects in the auditory system in sensory substitution: how much information do we need? Multisens Res 27, 5--6: 337--57.","paperID":"None"},{"content":"David J. Brown, Tom Macpherson, and Jamie Ward. 2011. Seeing with sound? Exploring different characteristics of a visual-to-auditory sensory substitution device. Perception 40, 9: 1120--1135.","paperID":"None"},{"content":"Galit Buchs, Shachar Maidenbaum, Shelly Levy-Tzedek and Amir Amedi. 2015. Virtually Zooming-In with Sensory Substitution for Blind Users. Retrieved September 21, 2015 from http://www.rehabweek.org/downloads/ICVR_Buchs.pdf","paperID":"None"},{"content":"Sandrine Ceurstemont. 2015. Substituting senses lets blind people take sonic holiday snaps. Retrieved September 21, 2015 from https://www.newscientist.com/article/dn28040substituting-senses-lets-blind-people-take-sonicholiday-snaps/","paperID":"None"},{"content":"Daniel-Robert Chebat, Fabien C. Schneider, Ron Kupers and Maurice Ptito. 2011. Navigation with a sensory substitution device in congenitally blind individuals. Neuroreport 22, 7: 342--347.","paperID":"None"},{"content":"Karla K. Evans and Anne Treisman. 2010. Natural cross-modal mappings between visual and auditory features. J Vision 10, 1: 6.","paperID":"None"},{"content":"Alexander Fiannaca, Ilias Apostolopoulous, and Eelke Folmer. 2014. Headlock: A wearable navigation aid that helps blind cane users traverse large open spaces. In Proc 16th int ACM SIGACCESS conf on Comp Acc, 19--26.","paperID":"None"},{"content":"Pat Fletcher. 2002. Seeing with sound: A journey into sight. Retrieved September 21, 2015 from http://www.seeingwithsound.com/tucson2002.html","paperID":"None"},{"content":"Reginald Golledge, Roberta Klatzky, Jack Loomis and James Marston. 2004. Stated preferences for components of a personal guidance system for nonvisual navigation. J Visual Imp Blind 98, 3: 135147.","paperID":"None"},{"content":"José Luis González-Mora, Antonio F. RodriguezHernandez, Enrique Burunat, F. Martin and Miguel A. Castellano. 2006. Seeing the world by hearing: Virtual Acoustic Space (VAS) a new space perception system for blind people. In Info Comm Tech, ICTTA'06, 2, 1: 837--842.","paperID":"None"},{"content":"Alastair Haigh, David J. Brown, Peter Meijer, and Michael J. Proulx. 2013. How well do you see what you hear? The acuity of visual-to-auditory sensory substitution. Front Psychol, 4: 1--13.","paperID":"None"},{"content":"Giles Hamilton-Fletcher and Jamie Ward. 2013. Representing colour through hearing and touch in sensory substitution devices. Multisens Res 26, 6; 50332.","paperID":"None"},{"content":"Giles Hamilton-Fletcher and Jamie Ward. 2014. What does red sound like? Establishing and applying aesthetics to sensory substitution. 2014. Retrieved September 21, 2015 from https://www.researchgate.net/publication/280640062_ What_does_red_sound_like_Establishing_and_applyin g_aesthetics_to_sensory_substitution","paperID":"None"},{"content":"Giles Hamilton-Fletcher, Thomas D. Wright, and Jamie Ward. 2015. Cross-modal correspondences enhance performance on a colour-to-sound sensory substitution device. Retrieved January 3rd, 2016 from https://www.researchgate.net/publication/285673654_ CrossModal_Correspondences_Enhance_Performance_on_a _Colour-to-Sound_Sensory_Substitution_Device","paperID":"None"},{"content":"Intel® RealSense™ 3D Camera. 2015. Retrieved September 21, 2015 from http://www.intel.com/content/www/us/en/architectureand-technology/realsense-depth-camera.html","paperID":"None"},{"content":"Ali Israr, Olivier Bau, Seung-Chan Kim and Ivan Poupyrev. 2012. Tactile feedback on flat surfaces for the visually impaired. In CHI 12 Ext Abs Hum Fac Comp Sys 1571--1576.","paperID":"None"},{"content":"Jung-Kyong Kim and Robert J. Zatorre. 2008. Generalized learning of visual-to-auditory substitution in sighted individuals. Brain Res 1242: 263--275.","paperID":"None"},{"content":"Richard E. Ladner. 2015. Design for user empowerment. Interactions 22, 2: 24--29.","paperID":"None"},{"content":"Jörg, Lewald. 2002. Vertical sound localization in blind humans. Neuropsychologia, 40, 12:1868--1872.","paperID":"None"},{"content":"Shachar Maidenbaum, Sami Abboud and Amir Amedi. 2014. Sensory substitution: closing the gap between basic research and widespread practical visual rehabilitation. Neurosci Biobehav Rev 41: 3--15.","paperID":"None"},{"content":"Olena Markaryan. 2015. Seeing with sound: what hidden abilities do we have? Retrieved September 21, 2015 from http://bionic-eyes-armseng.blogspot.co.uk/2015/09/seeing-with-sound-whathidden-abilities.html","paperID":"None"},{"content":"Lawrence E. Marks. 1987. On cross-modal similarity: Auditory-visual interactions in speeded discrimination. J Exp Psy: Hum Percept Perf 13, 3: 384--394.","paperID":"None"},{"content":"Luke R. Mason. 2015. Rewiring the brain to create new senses. Retrieved September 21, 2015 from http://motherboard.vice.com/read/rewiring-the-brainto-create-new-senses","paperID":"None"},{"content":"Peter B. Meijer. 1992. An experimental system for auditory image representations. IEEE Trans Biomed Eng, 39, 2: 112--21.","paperID":"None"},{"content":"Lofti, B. Merabet, Lorella Battelli, Souzana Obretenova, Sara Maguire, Peter Meijer, and Alvaro Pascual-Leone. 2009. Functional recruitment of visual cortex for sound encoded object identification in the blind. Neuroreport 20, 2: 132.","paperID":"None"},{"content":"Project Tango -- Google. 2015. Retrieved September 21, 2015 from https://www.google.com/atap/projecttango/","paperID":"None"},{"content":"Michael J. Proulx, Petra Stoerig, Eva Ludowig, and Inna Knoll. 2008. Seeing 'Where' through the Ears: Effects of Learning-by-Doing and Long-Term Sensory Deprivation on Localization Based on Image-to-Sound Substitution. Plos One, 3, 3: e1840.","paperID":"None"},{"content":"Brigitte Roèder, Wolfgang Teder-Saèlejaèrvi, Anette Sterr, Frank Roèsler, Steven A. Hillyard and Helen J. Neville. 1999. Improved auditory spatial tuning in blind humans. Nature 400, 6740: 162--166.","paperID":"None"},{"content":"Hervé Segond, Déborah Weiss and Eliana Sampaio. 2005. Human spatial navigation via a visuo-tactile sensory substitution system. Perception 34, 10: 12311249.","paperID":"None"},{"content":"Charles Spence. 2011. Crossmodal correspondences: A tutorial review. Atten Percept Psychophy 73, 4: 971995.","paperID":"None"},{"content":"Ella Striem-Amit, Laurent Cohen, Stanislas Dehaene, and Amir Amedi. 2012. Reading with sounds: sensory substitution selectively activates the visual word form area in the blind. Neuron 76, 3: 640--652.","paperID":"None"},{"content":"Ella Striem-Amit, Miriam Guendelman and Amir Amedi. 2012. 'Visual' Acuity of the Congenitally Blind Using Visual-to-Auditory Sensory Substitution. Plos One, 7, 3: 1--6.","paperID":"None"},{"content":"M. Iftekhar Tanveer, A. S. M. Iftekhar Anam, Mohammed Yeasin and Majid Khan. 2013. Do you see what I see?: designing a sensory substitution device to access non-verbal modes of communication. In Proc 15th Int ACM SIGACCESS Conf Com Acc 10.","paperID":"None"},{"content":"TapTapSee - Blind and Visually Impaired Camera. Retrieved September 21, 2015 from http://www.taptapseeapp.com/","paperID":"None"},{"content":"Bijal Trivedi. 2010. Sensory hijack: rewiring brains to see with sound. Retrieved September 21, 2015 from https://www.newscientist.com/article/mg20727731500-sensory-hijack-rewiring-brains-to-see-with-sound/","paperID":"None"},{"content":"Steven Wall and Stephen Brewster. 2006. Feeling what you hear: Tactile feedback for navigation of audio graphs. In Proc SIGCHI conf Hum Fac Com Sys 11231132.","paperID":"None"},{"content":"Jamie Ward and Peter Meijer. 2010. Visual experiences in the blind induced by an auditory sensory substitution device. Consci Cog 19, 1: 492--500.","paperID":"None"},{"content":"Jamie Ward and Thomas Wright. 2014. Sensory Substitution Devices as Advanced Sensory Tools. Retrieved September 21, 2015 from http://www.researchgate.net/profile/Jamie_Ward/publi cation/266315050_Sensory_Substitution_Devices_as_ Advanced_Sensory_Tools/","paperID":"None"},{"content":"Michele A. Williams, Caroline Galbraith, Shaun K. Kane, and Amy Hurst. 2014. \"Just let the cane hit it\": how the blind and sighted see navigation differently. In Proc 16th int ACM SIGACCESS conf on Comp Acc, 217--224.","paperID":"None"},{"content":"Michael Wilson. 2015. \"Who put that there!\" The barriers to blind and partially sighted people getting out and about. Retrieved September 21, 2015 from https://www.rnib.org.uk/sites/default/files/Who%20put%20that%20there!%20Report%20February%202015.pdf","paperID":"None"},{"content":"Thomas D. Wright, Jamie Ward, Sarah Simonon, and Aaron Margolis. 2012. \"Where's Wally? Audio-visual mismatch directs ocular saccades in sensory substitution. See Perc 25: 61--61.","paperID":"None"},{"content":"Hanlu Ye, Meethu Malu, Uran Oh, and Leah Findlater. 2014. Current and future mobile and wearable device use by people with visual impairments. In Proc SIGCHI conf Hum Fac Com Sys 3123--3132.","paperID":"None"},{"content":"David D. Zhou, Jessy D. Dorn, and Robert J. Greenberg. 2013. The Argus® II retinal prosthesis system: An overview. In IEEE Inter Conf Multimed Expo Works (ICMEW), pp. 1--6.","paperID":"None"}],"title":"\"I Always Wanted to See the Night Sky\": Blind User Preferences for Sensory Substitution Devices","filename":"CHI16/p2162","authors":["Giles Hamilton-Fletcher","Marianna Obrist","Phil Watten","Michele Mengucci","Jamie Ward"],"conference":"CHI '16"}