{"paperId":2858169,"citation":[],"reference":[{"content":"Elena Agapie, Jaime Teevan, and Andrés Monroy-Hernández. 2015. Crowdsourcing in the Field: A Case Study Using Local Crowds for Event Reporting. (2015), HCOMP '15.","paperID":"None"},{"content":"Daniel Ashbrook, Kent Lyons, and Thad Starner. 2008. An Investigation into Round Touchscreen Wristwatch Interaction. In Proceedings of the 10th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '08). ACM, NY, NY, USA, 311--314. http://dx.doi.org/10.1145/1409240.1409276","paperID":"None"},{"content":"Michael S. Bernstein, Greg Little, Robert C. Miller, Björn Hartmann, Mark S. Ackerman, David R. Karger, David Crowell, and Katrina Panovich. 2010. Soylent: A Word Processor with a Crowd Inside. In Proceedings of the 23rd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, NY, NY, USA, 313--322. http://dx.doi.org/10.1145/1866029.1866078","paperID":"None"},{"content":"Carrie J. Cai, Philip J. Guo, James Glass, and Robert C. Miller. 2014. Wait-learning: Leveraging Conversational Dead Time for Second Language Education. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 2239--2244. http://dx.doi.org/10.1145/2559206.2581183","paperID":"None"},{"content":"Carrie J. Cai, Shamsi T. Iqbal, and Jaime Teevan. 2016. Chain Reactions: The Impact of Order on Microtask Chains. In Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems (CHI'16). ACM, 6. http://dx.doi.org/10.1145/2858036.2858237","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Tovi Grossman, and George Fitzmaurice. 2014a. Swipeboard: A Text Entry Technique for Ultra-small Interfaces That Supports Novice to Expert Transitions. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 615--620. http://dx.doi.org/10.1145/2642918.2647354","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Tovi Grossman, Daniel J. Wigdor, and George Fitzmaurice. 2014b. Duet: Exploring Joint Interactions on a Smart Phone and a Smart Watch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 159--168. http://dx.doi.org/10.1145/2556288.2556955","paperID":"None"},{"content":"Justin Cheng, Jaime Teevan, Shamsi T. Iqbal, and Michael S. Bernstein. 2015. Break It Down: A Comparison of Macro- and Microtasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15). 4061--4064. http://dx.doi.org/10.1145/2702123.2702146","paperID":"None"},{"content":"Pei-Yu (Peggy) Chi and Yang Li. 2015. Weave: Scripting Cross-Device Wearable Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3923--3932. http://dx.doi.org/10.1145/2702123.2702451","paperID":"None"},{"content":"Steven Dow, Anand Pramod Kulkarni, Scott R. Klemmer, and Björn Hartmann. 2012. Shepherding the Crowd Yields Better Work. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW'12). 1013--1022. http://dx.doi.org/10.1145/2145204.2145355","paperID":"None"},{"content":"Victor M. González and Gloria Mark. 2004. \"Constant, Constant, Multi-tasking Craziness\": Managing Multiple Working Spheres. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 113--120. http://dx.doi.org/10.1145/985692.985707","paperID":"None"},{"content":"Nick Greer, Jaime Teevan, and Shamsi T. Iqbal. 2016. An introduction to technological support for writing. Technical Report. Microsoft Research Tech Report MSR-TR-2016-001.","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2009. Abracadabra: Wireless, High-precision, and Unpowered Finger Input for Very Small Mobile Devices. In Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, NY, NY, USA, 121--124. http://dx.doi.org/10.1145/1622176.1622199","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2010. Minput: Enabling Interaction on Small Mobile Devices with High-precision, Low-cost, Multipoint Optical Tracking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1661--1664. http://dx.doi.org/10.1145/1753326.1753574","paperID":"None"},{"content":"Steven Houben and Nicolai Marquardt. 2015. WatchConnect: A Toolkit for Prototyping Smartwatch-Centric Cross-Device Applications. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1247--1256. http://dx.doi.org/10.1145/2702123.2702215","paperID":"None"},{"content":"Joy Kim, Justin Cheng, and Michael S. Bernstein. 2014. Ensemble: Exploring Complementary Strengths of Leaders and Crowds in Creative Collaboration. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, NY, NY, USA, 745--755. http://dx.doi.org/10.1145/2531602.2531638","paperID":"None"},{"content":"Jungsoo Kim, Jiasheng He, K. Lyons, and T. Starner. 2007. The Gesture Watch: A Wireless Contact-free Gesture based Wrist Interface. In Proceedings of the 11th IEEE International Symposium on Wearable Computers. 15--22. http://dx.doi.org/10.1109/ISWC.2007.4373770","paperID":"None"},{"content":"Joy Kim and Andres Monroy-Hernandez. 2015. Storia: Summarizing Social Media Content based on Narrative Theory using Crowdsourcing. arXiv preprint arXiv:1509.03026 (2015). http://arxiv.org/abs/1509.03026","paperID":"None"},{"content":"Aniket Kittur, Jeffrey V. Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease, and John Horton. 2013. The Future of Crowd Work. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, NY, NY, USA, 1301--1318. http://dx.doi.org/10.1145/2441776.2441923","paperID":"None"},{"content":"Aniket Kittur, Boris Smus, Susheel Khamkar, and Robert E. Kraut. 2011. CrowdForge: Crowdsourcing Complex Work. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 43--52. http://dx.doi.org/10.1145/2047196.2047202","paperID":"None"},{"content":"Anand Kulkarni, Matthew Can, and Björn Hartmann. 2012. Collaboratively Crowdsourcing Workflows with Turkomatic. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 1003--1012. http://dx.doi.org/10.1145/2145204.2145354","paperID":"None"},{"content":"Gierad Laput, Robert Xiao, Xiang 'Anthony' Chen, Scott E. Hudson, and Chris Harrison. 2014. Skin Buttons: Cheap, Small, Low-powered and Clickable Fixed-icon Laser Projectors. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 389--394. http://dx.doi.org/10.1145/2642918.2647356","paperID":"None"},{"content":"Walter S. Lasecki, Juho Kim, Nick Rafter, Onkur Sen, Jeffrey P. Bigham, and Michael S. Bernstein. 2015. Apparition: Crowdsourced User Interfaces That Come to Life As You Sketch Them. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1925--1934. http://dx.doi.org/10.1145/2702123.2702565","paperID":"None"},{"content":"Luis A. Leiva, Alireza Sahami, Alejandro Catala, Niels Henze, and Albrecht Schmidt. 2015. Text Entry on Tiny QWERTY Soft Keyboards. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 669--678. http://dx.doi.org/10.1145/2702123.2702388","paperID":"None"},{"content":"Michael Nebeling and Anind K. Dey. 2016. XDBrowser: User-Defined Cross-Device Web Page Designs. In Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems (CHI'16). http://dx.doi.org/10.1145/2858036.2858169","paperID":"None"},{"content":"Michael Nebeling, Anhong Guo, Kyle I. Murray, Annika Tostengard, Angelos Giannopoulos, Martin Mihajlov, Steven Dow, Jaime Teevan, and Jeffrey P. Bigham. 2015. WearWrite: Orchestrating the Crowd to Complete Complex Tasks from Wearables (We Wrote This Paper on a Watch). CoRR abs/1508.02982 (2015). http://arxiv.org/abs/1508.02982","paperID":"None"},{"content":"Christine M Neuwirth, David S Kaufer, Ravinder Chandhok, and James H Morris. 2001. Computer support for distributed collaborative writing: A coordination science perspective. Coordination Theory and Collaboration Technology, ed. GM Olson, TW Malone, and JB Smith, Lawrence Erlbaum Associates, NJ (2001).","paperID":"None"},{"content":"Sylvie Noél and Jean-Marc Robert. 2004. Empirical Study on Collaborative Writing: What Do Co-authors Do, Use, and Like? Computer Supported Cooperative Work (CSCW) 13, 1 (2004), 63--89. http: //dx.doi.org/10.1023/B:COSU.0000014876.96003.be","paperID":"None"},{"content":"Stephen Oney, Chris Harrison, Amy Ogan, and Jason Wiese. 2013. ZoomBoard: A Diminutive Qwerty Soft Keyboard Using Iterative Zooming for Ultra-small Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2799--2802. http://dx.doi.org/10.1145/2470654.2481387","paperID":"None"},{"content":"Simon T. Perrault, Eric Lecolinet, James Eagan, and Yves Guiard. 2013. Watchit: Simple Gestures and Eyes-free Interaction for Wristwatches and Bracelets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1451--1460. http://dx.doi.org/10.1145/2470654.2466192","paperID":"None"},{"content":"I.R. Posner and R.M. Baecker. 1992. How people write together [groupware]. In System Sciences, 1992. Proceedings of the Twenty-Fifth Hawaii International Conference on, Vol. iv. 127--138 vol.4. http://dx.doi.org/10.1109/HICSS.1992.183420","paperID":"None"},{"content":"M. T. Raghunath and Chandra Narayanaswami. 2002. User Interfaces for Applications on a Wrist Watch. Personal Ubiquitous Comput. 6, 1 (Jan. 2002), 17--30. http://dx.doi.org/10.1007/s007790200002","paperID":"None"},{"content":"Daniela Retelny, Sébastien Robaszkiewicz, Alexandra To, Walter S. Lasecki, Jay Patel, Negar Rahmati, Tulsee Doshi, Melissa Valentine, and Michael S. Bernstein. 2014. Expert Crowdsourcing with Flash Teams. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 75--85. http://dx.doi.org/10.1145/2642918.2647409","paperID":"None"},{"content":"Jaime Teevan, Shamsi T. Iqbal, and Curtis von Veh. 2016. Supporting Collaborative Writing with Microtasks. In Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems (CHI'16). ACM, 6. http://dx.doi.org/10.1145/2858036.2858108","paperID":"None"},{"content":"Jaime Teevan, Daniel J. Liebling, and Walter S. Lasecki. 2014. Selfsourcing Personal Tasks. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 2527--2532. http://dx.doi.org/10.1145/2559206.2581181","paperID":"None"},{"content":"Bill Tomlinson, Joel Ross, Paul Andre, Eric Baumer, Donald Patterson, Joseph Corneli, Martin Mahaux, Syavash Nobarany, Marco Lazzari, Birgit Penzenstadler, Andrew Torrance, David Callele, Gary Olson, Six Silberman, Marcus Stünder, Fabio Romancini Palamedi, Albert Ali Salah, Eric Morrill, Xavier Franch, Florian Floyd Mueller, Joseph 'Jofish' Kaye, Rebecca W. Black, Marisa L. Cohn, Patrick C. Shih, Johanna Brewer, Nitesh Goyal, Pirjo Näkki, Jeff Huang, Nilufar Baghaei, and Craig Saper. 2012. Massively Distributed Authorship of Academic Papers. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, NY, NY, USA, 11--20. http://dx.doi.org/10.1145/2212776.2212779","paperID":"None"},{"content":"Rajan Vaish, Keith Wyngarden, Jingshu Chen, Brandon Cheung, and Michael S. Bernstein. 2014. Twitch Crowdsourcing: Crowd Contributions in Short Bursts of Time. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3645--3654. http://dx.doi.org/10.1145/2556288.2556996","paperID":"None"},{"content":"Edward Vul and Harold Pashler. 2008. Measuring the crowd within probabilistic representations within individuals. Psychological Science 19, 7 (2008), 645--647. http: //dx.doi.org/10.1111/j.1467-9280.2008.02136.x","paperID":"None"},{"content":"Christopher D. Wickens. 2002. Multiple resources and performance prediction. Theoretical Issues in Ergonomics Science 3, 2 (2002), 159--177. http://dx.doi.org/10.1080/14639220210123806","paperID":"None"},{"content":"Robert Xiao, Gierad Laput, and Chris Harrison. 2014. Expanding the Input Expressivity of Smartwatches with Mechanical Pan, Twist, Tilt and Click. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 193--196. http://dx.doi.org/10.1145/2556288.2557017","paperID":"None"},{"content":"Jeffrey M Zacks, Barbara Tversky, and Gowri Iyer. 2001. Perceiving, remembering, and communicating structure in events. Journal of Experimental Psychology: General 130, 1 (2001), 29. http://dx.doi.org/10.1037/0096-3445.130.1.29","paperID":"None"}],"abstract":"The physical constraints of smartwatches limit the range and complexity of tasks that can be completed. Despite interface improvements on smartwatches, the promise of enabling productive work remains largely unrealized. This paper presents WearWrite, a system that enables users to write documents from their smartwatches by leveraging a crowd to help translate their ideas into text. WearWrite users dictate tasks, respond to questions, and receive notifications of major edits on their watch. Using a dynamic task queue, the crowd receives tasks issued by the watch user and generic tasks from the system. In a week-long study with seven smartwatch users supported by approximately 29 crowd workers each, we validate that it is possible to manage the crowd writing process from a watch. Watch users captured new ideas as they came to mind and managed a crowd during spare moments while going about their daily routine. WearWrite represents a new approach to getting work done from wearables using the crowd.","title":"WearWrite: Crowd-Assisted Writing from Smartwatches","filename":"CHI16/p3834","authors":["Michael Nebeling","Alexandra To","Anhong Guo","Adrian A. de Freitas","Jaime Teevan","Steven P. Dow","Jeffrey P. Bigham"],"conference":"CHI '16"}