{"paperId":2858456,"citation":[],"reference":[{"content":"P Bach-y Rita. 1988. Brain plasticity. Rehabilitation Medicine. Mosby (1988), 113--8.","paperID":"None"},{"content":"Elisheva Ben-Artzi and Lawrence E Marks. 1995. Visual-auditory interaction in speeded classification: Role of stimulus difference. Perception & Psychophysics 57, 8 (1995), 1151--1162.","paperID":"None"},{"content":"Elizabeth A. Boyle, Thomas M. Connolly, Thomas Hainey, and James M. Boyle. 2012. Engagement in digital entertainment games: A systematic review. Computers in Human Behavior 28, 3 (May 2012), 771--780. DOI: http://dx.doi.org/10.1016/j.chb.2011.11.020","paperID":"None"},{"content":"Alfred O Effenberg. 2005. Movement sonification: Effects on perception and action. IEEE multimedia 2 (2005), 53--59.","paperID":"None"},{"content":"Karla K Evans and Anne Treisman. 2010. Natural cross-modal mappings between visual and auditory features. Journal of vision 10, 1 (2010), 6.","paperID":"None"},{"content":"Thomas Ferris, Robert Penfold, Shameem Hameed, and Nadine Sarter. 2006. The implications of crossmodal links in attention for the design of multimodal interfaces: A driving simulation study. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 50. Sage Publications, 406--409.","paperID":"None"},{"content":"Mark A Guadagnoli and Timothy D Lee. 2004. Challenge point: a framework for conceptualizing the effects of various practice conditions in motor learning. Journal of motor behavior 36, 2 (2004), 212--224.","paperID":"None"},{"content":"Stephen J Guastello, Katherine Reiter, Matthew Malon, and Anton Shircel. 2015. When auditory and visual signal processing conflict: cross-modal interference in extended work periods. Theoretical Issues in Ergonomics Science 16, 3 (2015), 232--254.","paperID":"None"},{"content":"Eve Hoggan, Topi Kaaresoja, Pauli Laitinen, and Stephen Brewster. 2008. Crossmodal congruence: the look, feel and sound of touchscreen widgets. In Proceedings of the 10th international conference on Multimodal interfaces. ACM, 157--164.","paperID":"None"},{"content":"Michael Xuelin Huang, Will WW Tang, Kenneth WK Lo, CK Lau, Grace Ngai, and Stephen Chan. 2012. MelodicBrush: a novel system for cross-modal digital art creation linking calligraphy and music. In Proceedings of the Designing Interactive Systems Conference. ACM, 418--427.","paperID":"None"},{"content":"Joseph 'Jofish' Kaye, Kirsten Boehner, Jarmo Laaksolahti, and Anna Stahl. 2007. Evaluating experience-focused HCI. In CHI '07 extended abstracts on Human factors in computing systems (CHI EA '07). ACM, NY, NY, USA, 2117--2120. DOI: http://dx.doi.org/10.1145/1240866.1240962","paperID":"None"},{"content":"Ju-Hwan Lee and Charles Spence. 2008. Feeling what you hear: Task-irrelevant sounds modulate tactile perception delivered via a touch screen. Journal on Multimodal User Interfaces 2, 3--4 (2008), 145--156.","paperID":"None"},{"content":"Dominic W Massaro. 1998. Illusions and issues in bimodal speech perception. In AVSP'98 International Conference on Auditory-Visual Speech Processing.","paperID":"None"},{"content":"Harry Mcgurk and John Macdonald. 1976. Hearing lips and seeing voices. Nature 264, 5588 (Dec. 1976), 746--748. DOI: http://dx.doi.org/10.1038/264746a0","paperID":"None"},{"content":"Peter BL Meijer. 1992. An experimental system for auditory image representations. Biomedical Engineering, IEEE Transactions on 39, 2 (1992), 112--121.","paperID":"None"},{"content":"Oussama Metatla, Nick Bryan-Kinns, Tony Stockman, and Fiore Martin. 2012. Supporting cross-modal collaboration in the workplace. In Proceedings of the 26th Annual BCS Interaction Specialist Group Conference on People and Computers. British Computer Society, 109--118.","paperID":"None"},{"content":"Oussama Metatla, Nick Bryan-Kinns, Tony Stockman, and Fiore Martin. 2015. Sonification of reference markers for auditory graphs: Effects on non-visual point estimation tasks. In PeerJ PrePrints.","paperID":"None"},{"content":"Micah M Murray, Sophie Molholm, Christoph M Michel, Dirk J Heslenfeld, Walter Ritter, Daniel C Javitt, Charles E Schroeder, and John J Foxe. 2005. Grabbing your ear: rapid auditory-somatosensory multisensory interactions in low-level sensory cortices are not constrained by stimulus alignment. Cerebral Cortex 15, 7 (2005), 963--974.","paperID":"None"},{"content":"Shaun Musgrave. 2015. \"Dark Echo\" Review Silence Is Golden, And So Is This Game. (Feb. 2015). http://toucharcade.com/2015/02/11/dark-echo-review/","paperID":"None"},{"content":"Lennart E. Nacke, Mark N. Grimshaw, and Craig A. Lindley. 2010. More than a feeling: Measurement of sonic user experience and psychophysiology in a first-person shooter game. Interacting with Computers 22, 5 (Sept. 2010), 336--343. DOI: http://dx.doi.org/10.1016/j.intcom.2010.04.005","paperID":"None"},{"content":"Kent L. Norman. 2013. GEQ (Game Engagement/Experience Questionnaire): A Review of Two Papers. Interacting with Computers 25, 4 (July 2013), 278--283. DOI: http://dx.doi.org/10.1093/iwc/iwt009","paperID":"None"},{"content":"Heather O'Brien and Paul Cairns. 2015. An empirical evaluation of the User Engagement Scale (UES) in online news environments. Information Processing & Management 51, 4 (July 2015), 413--427. DOI: http://dx.doi.org/10.1016/j.ipm.2015.03.003","paperID":"None"},{"content":"Heather L. O'Brien and Elaine G. Toms. 2008. What is User Engagement? A Conceptual Framework for Defining User Engagement with Technology. J. Am. Soc. Inf. Sci. Technol. 59, 6 (April 2008), 938--955. DOI: http://dx.doi.org/10.1002/asi.v59:6","paperID":"None"},{"content":"Heather L. O'Brien and Elaine G. Toms. 2010. The development and evaluation of a survey to measure user engagement. Journal of the American Society for Information Science and Technology 61, 1 (Jan. 2010), 50--69. DOI: http://dx.doi.org/10.1002/asi.21229","paperID":"None"},{"content":"Sharon Oviatt, Rachel Coulston, and Rebecca Lunsford. 2004. When do we interact multimodally?: cognitive load and multimodal communication patterns. In Proceedings of the 6th international conference on Multimodal interfaces. ACM, 129--136.","paperID":"None"},{"content":"Geoffrey R Patching and Philip T Quinlan. 2002. Garner and congruence effects in the speeded classification of bimodal signals. Journal of Experimental Psychology: Human Perception and Performance 28, 4 (2002), 755.","paperID":"None"},{"content":"Mary C. Potter, Brad Wyble, Carl Erick Hagmann, and Emily S. McCourt. 2013. Detecting meaning in RSVP at 13 ms per picture. Attention, Perception, & Psychophysics 76, 2 (Dec. 2013), 270--279. DOI: http://dx.doi.org/10.3758/s13414-013-0605-z","paperID":"None"},{"content":"Rick Raymer. 2011. Gamification: Using Game Mechanics to Enhance eLearning. eLearn 2011, 9 (Sept. 2011). DOI: http://dx.doi.org/10.1145/2025356.2031772","paperID":"None"},{"content":"Paul Rodway. 2005. The modality shift effect and the effectiveness of warning signals in different modalities. Acta Psychologica 120, 2 (2005), 199--226.","paperID":"None"},{"content":"Richard A Schmidt. 1991. Frequent augmented feedback can degrade learning: Evidence and interpretations. In Tutorials in motor neuroscience. Springer, 59--75.","paperID":"None"},{"content":"Ladan Shams, Yukiyasu Kamitani, and Shinsuke Shimojo. 2000. Illusions: What you see is what you hear. Nature 408, 6814 (Dec. 2000), 788--788. DOI: http://dx.doi.org/10.1038/35048669","paperID":"None"},{"content":"Roland Sigrist, Georg Rauter, Robert Riener, and Peter Wolf. 2013. Augmented visual, auditory, haptic, and multimodal feedback in motor learning: A review. Psychonomic bulletin & review 20, 1 (2013), 21--53.","paperID":"None"},{"content":"Charles Spence. 2010. Crossmodal spatial attention. Annals of the NY Academy of Sciences 1191, 1 (2010), 182--200.","paperID":"None"},{"content":"Charles Spence. 2011. Crossmodal correspondences: A tutorial review. Attention and Perceptual Psychophysics (2011). DOI: http://dx.doi.org/DOI10.3758/s13414-010-0073--7","paperID":"None"},{"content":"Charles Spence and Jon Driver. 1997. Cross-modal links in attention between audition, vision, and touch: Implications for interface design. International Journal of Cognitive Ergonomics (1997).","paperID":"None"},{"content":"Charles Spence and Jon Driver. 2004. Crossmodal space and crossmodal attention. Oxford University Press.","paperID":"None"},{"content":"Charles Spence and Cristy Ho. 2015. Multisensory information processing. In APA handbook of human systems integration, D. A. Boehm-Davis, F. T. Durso, and J. D. Lee (Eds.). American Psychological Association, Washington, DC, Ch. 27.","paperID":"None"},{"content":"JK Stefanucci and DR Proffitt. 2005. Multimodal interfaces improve memory. In Proceedings of the 11th International Conference on Human-Computer Interaction (HCI'05).","paperID":"None"},{"content":"Penelope Sweetser and Peta Wyeth. 2005. GameFlow: a model for evaluating player enjoyment in games. Computers in Entertainment (CIE) 3 (July 2005), 3--3. DOI: http://dx.doi.org/10.1145/1077246.1077253 ACM ID: 1077253.","paperID":"None"},{"content":"Andrew Webster. 2013. Gaming in darkness: 'Papa Sangre II' is a terrifying world made entirely of sound. (Oct. 2013). http://www.theverge.com/2013/10/31/5048298/papa-sangre-ii-is-a-terrifying-world-made-of-sound","paperID":"None"},{"content":"Eric N. Wiebe, Allison Lamb, Megan Hardy, and David Sharek. 2014. Measuring engagement in video game-based environments: Investigation of the User Engagement Scale. Computers in Human Behavior 32 (March 2014), 123--132. DOI: http://dx.doi.org/10.1016/j.chb.2013.12.001","paperID":"None"},{"content":"Fredrik Winberg. 2006. Supporting cross-modal collaboration: adding a social dimension to accessibility. In Haptic and Audio Interaction Design. Springer, 102--110.","paperID":"None"},{"content":"Peter Wright, Jayne Wallace, and John McCarthy. 2008. Aesthetics and experience-centered design. ACM Transactions on Computer-Human Interaction 15, 4 (Dec. 2008), 18:1--18:21. DOI: http://dx.doi.org/10.1145/1460355.1460360","paperID":"None"}],"abstract":"There is growing interest in the application of crossmodal perception to interface design. However, most research has focused on task performance measures and often ignored user experience and engagement. We present an examination of crossmodal congruence in terms of performance and engagement in the context of a memory task of audio, visual, and audio-visual stimuli. Participants in a first study showed improved performance when using a visual congruent mapping that was cancelled by the addition of audio to the baseline conditions, and a subjective preference for the audio-visual stimulus that was not reflected in the objective data. Based on these findings, we designed an audio-visual memory game to examine the effects of crossmodal congruence on user experience and engagement. Results showed higher engagement levels with congruent displays with some reported preference for potential challenge and enjoyment that an incongruent display may support, particularly for increased task complexity.","title":"Tap the ShapeTones: Exploring the Effects of Crossmodal Congruence in an Audio-Visual Interface","filename":"CHI16/p1055","authors":["Oussama Metatla","Nuno N. Correia","Fiore Martin","Nick Bryan-Kinns","Tony Stockman"],"conference":"CHI '16"}