{"paperId":2858429,"citation":[],"abstract":"As cycling is increasingly promoted as an environment-friendly, cheap and even fast alternative, there exists an increasing need to civically involve the potentially engaged and opinionated user group of cyclists. Therefore, we designed and evaluated Bicycle Barometer, an interactive bicycle count display that gathers the opinions from cyclists and conveys real-time, multi-dimensional data to them regarding cycling behavior. Our user-centered design process focused on optimizing the user experience by comparing several alternative cyclist-specific interaction designs, which resulted in the combination of a pressure sensitive floor mat, push button and low-resolution LED display. An in-the-wild evaluation study resulted in a set of design recommendations for cyclist-specific interaction, providing concrete insights into how a specifically targeted interaction method for public display is able to afford engagement and enthusiasm from a particular target audience.","title":"The Bicycle Barometer: Design and Evaluation of Cyclist-Specific Interaction for a Public Display","filename":"CHI16/p5824","authors":["Sandy Claes","Karin Slegers","Andrew Vande Moere"],"conference":"CHI '16","reference":[{"content":"Ateliereen Architecten. 2015. Light-Artwork in Bicycle Tunnet at Rijnwijlpad. Artwork. Retrieved September 12, 2015 from http://www.ateliereen.nl/projecten/rijnwaalpad.html.","paperID":"None"},{"content":"Arlene Birt. 2012. Bicycling Counts. Artwork. Retrieved September 12, 2015 from http://backgroundstories.com/portfolio-item/bicyclingcounts/.","paperID":"None"},{"content":"Harry Brignull and Yvonne Rogers. 2003. Enticing People to Interact with Large Public Displays in Public Spaces. In Proceedings of INTERACT. 17--24. http://dx.doi.org/10.1.1.129.603","paperID":"None"},{"content":"Sandy Claes and Andrew Vande Moere. 2015. The Role of Tangible Interaction in Exploring Information on Public Visualization Displays. In International Symposium on Pervasive Displays. 201--207 http://dx.doi.org/10.1145/2757710.2757733","paperID":"None"},{"content":"Copenhagenize.eu. 2014. Holding on to Cyclists in Copenhagen. Urban Intervention. Retrieved September 11, 2015 http://www.copenhagenize.com/2010/01/holding-onto-cyclists-in-copenhagen.html.","paperID":"None"},{"content":"Alexandru Dancu, Zlatko Franjcic and Morten Fjeld. 2014. Smart Flashlight: Map Navigation Using a BikeMounted Projector. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2557289, 3627--3630. http://dx.doi.org/10.1145/2556288.2557289","paperID":"None"},{"content":"Eco-compteur. 2015. Eco Totem Displays Bicycle Count Data. Retrieved September 11, 2015 From http://www.eco-compteur.com/en/products/eco-totem.","paperID":"None"},{"content":"Patrick Tobias Fischer and Eva Hornecker. 2012. Urban Hci: Spatial Aspects in the Design of Shared Encounters for Media Facades. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 307--316. http://dx.doi.org/10.1145/2207676.2207719","paperID":"None"},{"content":"Ray Forrest and Ade Kearns. Social Cohesion, Social Capital and the Neighbourhood. Urban studies 38, 12 (2001), 2125--2143. http://dx.doi.org/10.1080/00420980120087081","paperID":"None"},{"content":"Anne Galloway. Intimations of Everyday Life: Ubiquitous Computing and the City. Cultural studies 18, 2--3 (2004), 384--408. http://dx.doi.org/ 10.1080/0950238042000201572","paperID":"None"},{"content":"Gaby Grix-Saar. 2015. Traffic Light Grip - Ampelgriff. Urban Intervention. Retrieved September 11, 2015 From http://www.ampelgriff.de/.","paperID":"None"},{"content":"Sandra G Hart and Lowell E Staveland. Development of Nasa-Tlx (Task Load Index): Results of Empirical and Theoretical Research. Advances in psychology 52 (1988), 139--183. http://dx.doi.org/10.1016/S01664115(08)62386--9","paperID":"None"},{"content":"Luke Hespanhol, Martin Tomitsch, Ian McArthur, Joel Fredericks, Ronald Schroeter and Marcus Foth. 2015. Vote as You Go: Blending Interfaces for Community Engagement into the Urban Space. In Proceedings of the 7th International Conference on Communities and Technologies (C&T). ACM. http://dx.doi.org/10.1145/2768545.2768553","paperID":"None"},{"content":"Steven Houben and Christian Weichel. 2013. Overcoming Interaction Blindness through Curiosity Objects. In Extended Abstracts on Human Factors in Computing Systems (CHI '13 ). ACM, 2468631, 15391544. http://dx.doi.org/10.1145/2468356.2468631","paperID":"None"},{"content":"Liesbeth Huybrechts, Katrien Dreessen and Selina Schepers. 2012. Mapping Design Practices: On Risk, Hybridity and Participation. In Proceedings of the 12th Participatory Design Conference: Exploratory Papers, Workshop Descriptions, Industry Cases - Volume 2. ACM, 2348155, 29--32. http://dx.doi.org/10.1145/2348144.2348155","paperID":"None"},{"content":"Lisa Koeman, Vaiva Kalnikait and Yvonne Rogers. 2015. \"Everyone Is Talking About It!\": A Distributed Approach to Urban Voting Technology and Visualisations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2702263, 3127--3136. http://dx.doi.org/10.1145/2702123.2702263","paperID":"None"},{"content":"Hannu Kukka, Vassilis Kostakos, Timo Ojala, Johanna Ylipulli, Tiina Suopajärvi, Marko Jurmu and Simo Hosio. This Is Not Classified: Everyday Information Seeking and Encountering in Smart Urban Spaces. Personal and Ubiquitous Computing 17, 1 (2013), 1527. http://dx.doi.org/10.1007/s00779-011-0474--1","paperID":"None"},{"content":"Christopher A Le Dantec, Kari E Watkins, Russ Clark and Elizabeth Mynatt. 2015. Cycle Atlanta and Onebusaway: Driving Innovation through the Data Ecosystems of Civic Computing. Human-Computer Interaction Users and Contexts: Proceedings 17th International Conference, HCI International, 327-338. Springer.","paperID":"None"},{"content":"Matthew Mauriello, Michael Gubbels and Jon E. Froehlich. 2014. Social Fabric Fitness: The Design and Evaluation of Wearable E-Textile Displays to Support Group Running. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2557299, 2833--2842. http://dx.doi.org/10.1145/2556288.2557299","paperID":"None"},{"content":"Nemanja Memarovic, Marc Langheinrich, Florian Alt, Ivan Elhart, Simo Hosio and Elisa Rubegni. 2012. Using Public Displays to Stimulate Passive Engagement, Active Engagement, and Discovery in Public Spaces. In Procedings of Media Architecture Biennale 2012. ACM, 55--64.","paperID":"None"},{"content":"Jörg Müller, Robert Walter, Gilles Bailly, Michael Nischt and Florian Alt. 2012. Looking Glass: A Field Study on Noticing Interactivity of a Shop Window. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 297--306. http://dx.doi.org/10.1145/2207676.2207718","paperID":"None"},{"content":"P. Newman and J. Kenworthy. The End of Automobile Dependence: How Cities Are Moving Beyond CarBased Planning. Island Press, 2015.","paperID":"None"},{"content":"Dietmar Offenhuber and Susanne Seitinger. 2014. Over the Rainbow: Information Design for Low-Resolution Urban Displays. In Proceedings of the 2nd Media Architecture Biennale Conference: World Cities. ACM, 2682886, 40--47. http://dx.doi.org/10.1145/2682884.2682886","paperID":"None"},{"content":"Timo Ojala, Vassilis Kostakos, Hannu Kukka, Tommi Heikkinen, Tomas Linden, Marko Jurmu, Simo Hosio, Fabio Kruger and Daniele Zanni. Multipurpose Interactive Public Displays in the Wild: Three Years Later. Computer 45, 5 (2012), 42--49. http://dx.doi.org/10.1109/mc.2012.115","paperID":"None"},{"content":"Martin Pielot, Benjamin Poppinga, Wilko Heuten and Susanne Boll. 2012. Tacticycle: Supporting Exploratory Bicycle Trips. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services. ACM, 369--378. http://dx.doi.org/10.1145/2371574.2371631","paperID":"None"},{"content":"Duncan Rowland, Martin Flintham, Leif Oppermann, Joe Marshall, Alan Chamberlain, Boriana Koleva, Steve Benford and Citlali Perez. 2009. Ubikequitous Computing: Designing Interactive Experiences for Cyclists. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 21. http://dx.doi.org/10.1145/1613858.1613886","paperID":"None"},{"content":"Enrico Rukzio, Michael Müller and Robert Hardy. 2009. Design, Implementation and Evaluation of a Novel Public Display for Pedestrian Navigation: The Rotating Compass. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 113--122. http://dx.doi.org/10.1145/1518701.1518722","paperID":"None"},{"content":"Purvi Saraiya, Chris North and Karen Duca. An Insight-Based Methodology for Evaluating Bioinformatics Visualizations. Visualization and Computer Graphics, IEEE Transactions on 11, 4 (2005), 443--456. http://dx.doi.org/10.1109/TVCG.2005.53","paperID":"None"},{"content":"Ava Fatah gen. Schieck, Carolina Briones and Chiron Mottram. The Urban Screen as a Socialising Platform: Exploring the Role of Place within the Urban Space. F. Eckardt et al., eds., MEDIACITY: Situations, Practices and Encounters Frank & Timme GmbH, Berlin, Germany, (2008), 285--305.","paperID":"None"},{"content":"Ronald Schroeter. 2012. Engaging New Digital Locals with Interactive Urban Screens to Collaboratively Improve the City. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 227--236. http://dx.doi.org/10.1145/2145204.2145239","paperID":"None"},{"content":"Edward Segel and Jeffrey Heer. Narrative Visualization: Telling Stories with Data. Visualization and Computer Graphics, IEEE Transactions on 16, 6 (2010), 1139--1148. http://dx.doi.org/10.1109/TVCG.2010.179","paperID":"None"},{"content":"Sarang Sheth. 2015. Indicator Innovation. Online Article. Retrieved September 12, 2015 From http://www.yankodesign.com/2015/06/30/indicatorinnovation/.","paperID":"None"},{"content":"Pieter Jan Stallen. 2012. Public Passes. Artwork. Retrieved September 12, 2015 From http://www.publicpasses.com/.","paperID":"None"},{"content":"Fabius Steinberger, Marcus Foth and Florian Alt. 2014. Vote with Your Feet: Local Community Polling on Urban Screens. In Proceedings of The International Symposium on Pervasive Displays. ACM, 44. http://dx.doi.org/10.1145/2611009.2611015","paperID":"None"},{"content":"Alex S. Taylor, Sian Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger and Jessica Lingel. 2015. Data-in-Place: Thinking through the Relations between Data and Community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2702558, 2863--2872. http://dx.doi.org/10.1145/2702123.2702558","paperID":"None"},{"content":"Nina Valkanova, Robert Walter, Andrew Vande Moere and Jörg Müller. 2014. Myposition: A Public Polling Projection Display Designed to Spark Civic Participation. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW'14). 1323--1332. http://dx.doi.org/10.1145/2531602.2531639","paperID":"None"},{"content":"Andrew Vande Moere and Dan Hill. Designing for the Situated and Public Visualization of Urban Data. Journal of Urban Technology 19, 2 (2012), 25--46. http://dx.doi.org/10.1080/10630732.2012.698065","paperID":"None"},{"content":"Verkeersnet. 2015. Surveying Cyclists without Stopping. Retrieved September 12, 2015 from http://www.verkeersnet.nl/15593/fietsers-enqueterenzonder-stoppen/.","paperID":"None"},{"content":"Wouter Walmink, Danielle Wilde and Florian 'Floyd' Mueller. 2014. Displaying Heart Rate Data on a Bicycle Helmet to Support Social Exertion Experiences. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction. ACM, 97--104. http://dx.doi.org/10.1145/2540930.2540970","paperID":"None"}]}