{"paperId":2858554,"citation":[],"reference":[{"content":"Maia L. Jacobs, James Clawson, and Elizabeth D. Mynatt. 2014. My journey compass: a preliminary investigation of a mobile tool for cancer patients. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 663--672.","paperID":"None"},{"content":"Julie Maitland and Matthew Chalmers. 2011. Designing for peer involvement in weight management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 315--324.","paperID":"None"},{"content":"Sebastien Cuendet, Indrani Medhi, Kalika Bali, and Edward Cutrell. 2013. VideoKheti: making video content accessible to low-literate and novice users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2833--2842.","paperID":"None"},{"content":"Ingrid Arreola, Zan Morris, Matthew Francisco, Kay Connelly, Kelly Caine, and Ginger White. 2014. From checking on to checking in: designing for low socioeconomic status older adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1933--1936.","paperID":"None"},{"content":"Martin Ravallion and Shaohua Chen. 2009. Weakly Relative Poverty. World Bank Policy Research Working Paper Series, 4844.","paperID":"None"},{"content":"Mary Margaret Huizinga, Adam J. Carlisle, Kerri L. Cavanaugh, Dianne L. Davis, Rebecca P. Gregory, David G. Schlundt, and Russel L. Rothman. 2009. Literacy, Numeracy and Portion-Size Estimation Skills. Am J Prev Med 36, 4: 324-328.","paperID":"None"},{"content":"Kay Connelly, Katie A Siek, Beenish Chaudry, Josette Jones, Kim Astroth, and Janet L Welch. 2012. An Offline Mobile Nutrition Monitoring Intervention for Varying-Literacy Patients receiving Hemodialysis: A Pilot Study Examining the Usage and Usability. J Am Med Inform Assoc 19, 5: 705--712.","paperID":"None"},{"content":"Jeremy Brown and Ray Fitzpatrick. 1988. Factors influencing compliance with dietary restrictions in dialysis patients. J Psychosom Res 32, 2: 191-196.","paperID":"None"},{"content":"John E. Leggat Jr, Sean M. Orzol, Tempie E. HulbertShearon, Thomas A. Golper, Camille A. Jones, Philip J. Held, and Friedrich K. Port. 1998. Noncompliance in Hemodialysis: Predictors and Survival Analysis. Am J Kidney Dis 32, 1: 139-145.","paperID":"None"},{"content":"Nancy D. Berkman, Stacey L. Sheridan, Katrina E. Donahue, David J. Halpern, and Karen Crotty. 2011. Low Health Literacy and Health Outcomes: An Updated Systematic Review. Ann Intern Med. 155, 2: 97--107.","paperID":"None"},{"content":"Albert Bandura. 2007. Health promotion from the perspective of social cognitive theory. Psychol. Heal. 13, 4: 37-41.","paperID":"None"},{"content":"Erin Carroll, Mary Czerwinski, Asta Roseway, Ashish Kapoor, Paul Johns, Kael Rowan, and M. C. Schraefel. Food and Mood: Just-in-Time Support for Emotional Eating. In Proceedings of IEEE Affective Computing and Intelligent Interaction (ACII '13), 252--257.","paperID":"None"},{"content":"Feng Gao, Enrico Costanza, and M. C. Schraefel. 2012. \"Honey=sugar\" means unhealthy: investigating how people apply knowledge to rate food's healthiness. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12), 71--80.","paperID":"None"},{"content":"Adrienne H. Andrew, Gaetano Borriello and James Fogarty. 2013. Simplifying Mobile Phone Food Diaries: Design and Evaluation of a Food Index-Based Nutrition Diary. In Proceedings of in Pervasive Computing Technologies for Healthcare (PervasiveHealth '13), 260--263.","paperID":"None"},{"content":"Amy F. Subar, Jennifer Crafts, Thea Palmer Zimmerman, Michael Wilson, Beth Mittl, Noemi G. Islam, Suzanne McNutt, Nancy Potischman, Richard Buday, Stephen G. Hull, Tom Baranowski, Patricia M. Guenther, Gordon Willis, Ramsey Tapia, Frances E. Thompson. 2010. Assessment of the Accuracy of Portion Size Reports Using Computer-based Food Photograph Aids in the Development of an Automated Self-Administered 24-hour Recall. J Am Diet Assoc 110, 1: 55--64.","paperID":"None"},{"content":"Carine Vereeckena, Sophie Dohogne, Marc Covents and Lea Maes. 2010. How Accurate are Adolescents in Portion-Size Estimation using the Computer Tool Young Adolescents' Nutrition Assessment on Computer (YANA-C)? British J Nutr. 103, 12: 1844--1850.","paperID":"None"},{"content":"Rob Comber, Jack Weeden, Jennifer Hoare, Stephen Lindsay, Gemma Teal, Alastair Macdonald, Lisa Methven, Paula Moynihan, and Patrick Olivier. 2012. Supporting visual assessment of food and nutrient intake in a clinical care setting. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12, 919--922.","paperID":"None"},{"content":"Beenish Chaudry, Kay Connelly, Katie A. Siek, and Janet L. Welch. 2011. The design of mobile portion size estimation interface for low literacy populations. In Proceedings of the 5th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '11), 160-167.","paperID":"None"},{"content":"Insoo Woo, Karl Otsmo, SungYe Kim, David S. Ebert, Edward J. Delp, and Carol J. Boushey. 2010. Automatic portion estimation and visual refinement in mobile dietary assessment. In Proceedings of Society of Photographic Instrumentation Engineers (SPIE '10), 7533.","paperID":"None"},{"content":"Fengqing Zhu, Marc Bosch, Insoo Woo, SungYe Kim, Carol J. Boushey, David S. Ebert, Edward J. Delp. 2010. The use of mobile devices in aiding dietary assessment and evaluation. IEEE J Sel Top Signal Process 4, 4: 756 - 766.","paperID":"None"},{"content":"Keng-Hao Chang, Shih-Yen Liu, Jr-ben Tian, Hao-Hua Chu, and Cheryl Chen. 2005. Dietary-Aware Dining Table - Tracking What and How Much You Eat. In Proceedings of Workshop on Smart Object Systems, 6168.","paperID":"None"},{"content":"Jonathan Lester, Desney Tan, Shwetak Patel, and A.J. Bernheim Brush. 2010. Automatic Classification of Daily Fluid Intake. In Proceedings of Pervasive Computing Technologies for Healthcare (PervasiveHealth '10), 1--8.","paperID":"None"},{"content":"Sebastian Päßler, Wolf-Joachim Fischer. 2011. Food Intake Activity Detection Using a Wearable Microphone System. In Proceedings of the Seventh International Conference on Intelligent Environments, 298--301.","paperID":"None"},{"content":"Barry D. Weiss, Mary Z. Mays, William Martz, Kelley Merriam Castro, Darren A. DeWalt, Michael P. Pignone, Joy Mockbee, and Frank A. Hale. 2005. Quick Assessment of Literacy in Primary Care: The Newest Vital Sign. Annals of Family Medicine 3, 6: 514--522.","paperID":"None"},{"content":"Terry C. Davis. Sandy W. Long, Robert H. Jackson, EJ Mayeaux, Ronald B. George, Peggy W. Murphy, Michael A. Crouch. 1993. Rapid Estimate of Adult Literacy in Medicine: a Shortened Screening Instrument. Family Medicine 25, 6: 391-395.","paperID":"None"},{"content":"Saima Y. Ibrahim, Fiona Reid, Adrienne Shaw, Gillian Rowlands, Gabriella B. Gomez, M. Chesnokov, Michael Ussher. 2008. Validation of a health literacy screening tool (REALM) in a UK population with coronary heart disease. Journal of Public Health 30, 4: 449--55.","paperID":"None"},{"content":"Guadalupe Xochitl Ayala. 2006. An Experimental Evaluation of Group- versus Computer-based Intervention to Improve Food Portion Size Estimation Skills. Health Education Research 21, 1: 133--145.","paperID":"None"},{"content":"Charles L. Rawls. 2000. Performance Support and Usability: An Experimental Study of Electronic Performance Support Interfaces. PhD Dissertation. University of Central FL, Orlando, FL.","paperID":"None"},{"content":"Predrag Klasnja, Sunny Consolvo, and Wanda Pratt. 2011. How to evaluate technologies for health behavior change in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 3063--3072.","paperID":"None"},{"content":"William T. Riley, Jeannette Beasley, Allison Sowell, and Albert Behar. 2007. Effects of a Web-based Food Portion Training Program on Food Portion Estimation. Journal of Nutrition Education and Behavior 39, 2: 70-76.","paperID":"None"},{"content":"Polly Ryan. 2009. Integrated theory of health behavior change. Clin. Nurse Specialty 23, 3: 161--172.","paperID":"None"},{"content":"Andrea Grimes, Vasudhara Kantroo, and Rebecca E. Grinter. 2010. Let's play!: mobile health games for adults. In Proceedings of the 12th ACM international conference on Ubiquitous computing (UbiComp '10), 241--250.","paperID":"None"},{"content":"Zhengnan Zhang. 2010. Food Volume Estimation from a Single Image using Virtual Reality Technology. MS Thesis. University of Pittsburgh, Pittsburgh, PA.","paperID":"None"},{"content":"Denis Fouque, Marianne Vennegoor, Piet Ter Wee, Christoph Wanner, Ali Basci, Bernard Canaud, Patrick Haage, Klaus Konner, Jeroen Kooman, Alejandro Martin-Malo, Lucianu Pedrini, Francesco Pizzarelli, James Tattersall, Jan Tordoir, and Raymond Vanholder. 2007. EBPG Guideline on Nutrition. Nephrology Dialysis Transplantation 22: 45--87.","paperID":"None"},{"content":"Felicia Cordeiro, Elizabeth Bales, Erin Cherry, and James Fogarty. 2015. Rethinking the Mobile Food Journal: Exploring Opportunities for Lightweight PhotoBased Capture. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 3207--3216.","paperID":"None"},{"content":"Lena Mamykina, Andrew D. Miller, Catherine Grevet, Yevgeniy Medynskiy, Michael A. Terry, Elizabeth D. Mynatt, and Patricia R. Davidson. 2011. Examining the impact of collaborative tagging on sensemaking in nutrition management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 657--666.","paperID":"None"},{"content":"Erik Arsand, Ragnhild Varmedal, and Gunnar Hartvigsen. 2007. Usability of a Mobile Self-help Tool for People with Diabetes: The Easy Health Diary. In Proceedings of IEEE International Conference on Science and Automation (CASE '07), 863--868. http://dx.doi.org/ 10.1109/COASE.2007.4341807.","paperID":"None"},{"content":"Andrea Grimes, Martin Bednar, Jay David Bolter, and Rebecca E. Grinter. 2008. EatWell: sharing nutritionrelated memories in a low-income community. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08), 87--96.","paperID":"None"},{"content":"Chris Schaefbauer, Danish Kahn, Amy Le, Garrett Sczechowski, and Katie Siek. 2015. Snack Buddy: Supporting Healthy Snacking in Low Socioeconomic Status Families. In Proceedings of the 2015 ACM conference on Computer supported cooperative work (CSCW 2015), 1045-1057.","paperID":"None"},{"content":"Andrea Parker, Vasudhara Kantroo, Hee Lee, Miguel Osornio, Mansi Sharma, and Rebecca Grinter. 2012. Health promotion as activism: building community capacity to effect social change. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 99-108.","paperID":"None"},{"content":"Leon Festinger. A theory of cognitive dissonance. Stanford University Press, 1957.","paperID":"None"},{"content":"Sunny Consolvo, David McDonald, and James Landay. 2009. Theory-driven design strategies for technologies that support behavior change in everyday life. In Proceedings of the 27th international conference on Human factors in computing systems (CHI '09), 405- 414.","paperID":"None"},{"content":"Ha He, Saul Greenberg, and Elaine Huang. 2010. One size does not fit all: applying the transtheoretical model to energy feedback technology design. In Proceedings of the Conference on Human in computing systems (CHI '10), 927-936.","paperID":"None"},{"content":"Sahara Byrne, et al. 2012. Caring for Mobile PhoneBased Virtual Pets can Influence Youth Eating Behaviors. J. Child. Media 6; 1: 83-99,","paperID":"None"},{"content":"Victoria Schwanda, Steven Ibara, Lindsay Reynolds, and Dan Cosley. 2011. Side effects and gateway tools: advocating a broader look at evaluating persuasive systems. In Proceedings of the Conference on Human in computing systems (CHI '11), 345-348","paperID":"None"},{"content":"Christina Schwind, Jürgen Buder, and Friedrich Hesse. 2011. I Will Do It, But I Don't Like It: User Reactions to Preference-Inconsistent Recommendations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 349-352.","paperID":"None"},{"content":"Eun Kyoung Choe. 2011. Design of persuasive technologies for healthy sleep behavior. In Proc. 13th Int. Conf. Ubiquitous Comput (UbiComp '11), 507--510.","paperID":"None"},{"content":"Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. In Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems (CHI '08), 477-486.","paperID":"None"},{"content":"Christopher Tsai, et al. 2007. Usability and Feasibility of PmEB: A Mobile Phone Application for Monitoring Real Time Caloric Balance. Mob. Networks Appl. 12; 2-3: 173-184.","paperID":"None"},{"content":"Katie Siek, Kay Connelly, Yvonne Rogers, Paul Rohwer, Desiree Lambert, and Janet Welch. 2006. When do we eat? An evaluation of food items input into an electronic food monitoring application. In Pervasive Health '06.","paperID":"None"},{"content":"Felicia Cordeiro, Elizabeth Bales, Erin Cherry, and James Fogarty. 2015. Rethinking the Mobile Food Journal: Exploring Opportunities for Lightweight PhotoBased Capture. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 3207--3216.","paperID":"None"},{"content":"Eric Robinson, et al. 2013. Development and feasibility testing of a smart phone based attentive eating intervention. BMC Public Health 13: 1: 639--646.","paperID":"None"},{"content":"Yvonne Rogers, William R. Hazlewood, Paul Marshall, Nick Dalton, and Susanna Hertrich. 2010. Ambient influence: can twinkly lights lure and abstract representations trigger behavioral change?. In Proceedings of the 12th ACM international conference on Ubiquitous computing (UbiComp '10). 261--270.","paperID":"None"},{"content":"Katie Siek, Kay Connelly, and Yvonne Rogers. 2006. Pride and prejudice: learning how chronically ill people think about food. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI '06). 947-950.","paperID":"None"},{"content":"Jon Noronha, Eric Hysen, Haoqi Zhang, and Krzysztof Z. Gajos. 2011. Platemate: crowdsourcing nutritional analysis from food photographs. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11).","paperID":"None"}],"abstract":"Portion size estimation is important for managing dietary intake in many chronic conditions. We conducted a 6-week field study with nine varying literacy dialysis patients to explore the usability and feasibility of a dietary intake mobile application that emphasizes portion size estimation. Seven participants demonstrated sustained use of the application and improved their self-efficacy, knowledge, and ability to estimate portion sizes in pre- and post-study assessments. Participants reported moments when portion size information in the application differed from their prior understanding, challenging them to reconcile dissonant information. Although participants acquired new knowledge about portion sizes, they struggled to accurately estimate portion sizes in situ for most foods. Despite using the application consistently, rating it highly, and exhibiting learning, we found that self-efficacy and knowledge are not sufficient to support improved behaviors in everyday life.","title":"Evaluation of a Food Portion Size Estimation Interface for a Varying Literacy Population","filename":"CHI16/p5645","authors":["Beenish M. Chaudhry","Christopher Schaefbauer","Ben Jelen","Katie A. Siek","Kay Connelly"],"conference":"CHI '16"}