{"paperId":2858196,"citation":[],"reference":[{"content":"Jake Abbott, Marayong Panadda, and Okanura Allison. 2007. Haptic Virtual Fixtures for Robot-Assisted Manipulation. Robotics Research: 49--64. http://doi.org/10.1007/978--3--540--48113--3_5","paperID":"None"},{"content":"T. Amemiya and H. Gomi. 2014. Distinct pseudoattraction force sensation by a thumb-sized vibrator that oscillates asymmetrically. In Haptics: Neuroscience, Devices, Modeling, and Applications. Springer Berlin Heidelberg, 88--95. http://doi.org/10.1007/978--3--66244196--1","paperID":"None"},{"content":"Takafumi Aoki, Hironori Mitake, Danial Keoki, Shoichi Hasegawa, and Makoto Sato. 2009. Wearable haptic device to present contact sensation based on cutaneous sensation using thin wire. In Proc. of the International Conference on Advances in Computer Entertainment Technology, 115--122. http://doi.org/10.1145/1690388.1690408","paperID":"None"},{"content":"Wouter M. Bergmann Tiest and Astrid M L Kappers. 2009. Cues for haptic perception of compliance. IEEE Transactions on Haptics 2, 4: 189--199. http://doi.org/10.1109/TOH.2009.16","paperID":"None"},{"content":"Conrad Bullion and Hakan Gurocak. 2010. Haptic Glove with MR Brakes for Distributed Finger Force. Presence 18, 6: 421--433. http://doi.org/10.1162/pres.18.6.421","paperID":"None"},{"content":"William A S Buxton. 1990. A three-state model of graphical input. Human-computer interaction-INTERACT 90: 449--456.","paperID":"None"},{"content":"Tom Carter, Sue Ann Seah, Benjamin Long, Bruce Drinkwater, and Sriram Subramanian. 2013. UltraHaptics: Multi-Point Mid-Air Hpatic Feedback for Touch Surfaces. In Proc. of the 26th annual ACM symposium on User interface software and technology, ACM Press, 505--514. http://doi.org/10.1145/2501988.2502018","paperID":"None"},{"content":"Li-Wei Chan, Hui-Shan Kao, Mike Y Chen, Ming-Sui Lee, Jane Hsu, and Yi-ping Hung. 2010. Touching the Void : Direct-Touch Interaction for Intangible Displays. In Proc. of the 28th international conference on Human factors in computing systems, 2625--2634. http://doi.org/10.1145/1753326.1753725","paperID":"None"},{"content":"David Drascic and Paul Milgram. 1996. Perceptual Issues in Augmented Reality. In Proc. of SPIE 2653, Stereoscopic Displays and Virtual Reality Systems III, 123--134. http://doi.org/10.1117/12.237425","paperID":"None"},{"content":"Paulo Gallotti, Alberto Raposo, and Luciano Soares. 2011. V-glove: A 3D virtual touch interface. In Proc. of 13th Symposium on Virtual Reality, SVR 2011, 242--251. http://doi.org/10.1109/SVR.2011.21","paperID":"None"},{"content":"Sidhant Gupta, Dan Morris, Shwetak N. Patel, and Desney Tan. 2013. AirWave: non-contact haptic feedback using air vortex rings. In Proc. of the 2013 ACM international joint conference on Pervasive and ubiquitous computing, 419--428. http://doi.org/10.1145/2493432.2493463","paperID":"None"},{"content":"H.G. Hoffman. 1998. Physically touching virtual objects using tactile augmentation enhances the realism of virtual environments. In Proc. of IEEE 1998 Virtual Reality Annual International Symposium, 59--63. http://doi.org/10.1109/VRAIS.1998.658423","paperID":"None"},{"content":"Samantha Horvath, John Galeotti, Bing Wu, Roberta Klatzky, Mel Siegel, and George Stetten. 2014. FingerSight: Fingertip Haptic Sensing of the Visual Environment. IEEE Journal of Translational Engineering in Health and Medicine, February: 1--9. http://doi.org/10.1109/JTEHM.2014.2309343","paperID":"None"},{"content":"Takayuki Hoshi, Masafumi Takahashi, Takayuki Iwamoto, and Hiroyuki Shinoda. 2010. Noncontact Tactile Display Based on Radiation Pressure of Airborne Ultrasound. IEEE Transactions on Haptics 3, 3: 155--165. http://doi.org/10.1109/TOH.2010.4","paperID":"None"},{"content":"Go Inaba and Kinya Fujita. 2006. A pseudo-forcefeedback device by fingertip tightening for multi-finger object manipulation. In Proc. of EuroHaptics, 475--478. Retrieved from http://reality.ei.tuat.ac.jp/papers/EH06.pdf","paperID":"None"},{"content":"Exos Inc. 1991. Product Literature on Dexterous Hand Master and Grip Master.","paperID":"None"},{"content":"Seki Inoue, Yasutoshi Makino, and Hiroyuki Shinoda. 2015. Active touch perception produced by airborne ultrasonic haptic hologram. 2015 IEEE World Haptics Conference (WHC), IEEE, 362--367. http://doi.org/10.1109/WHC.2015.7177739","paperID":"None"},{"content":"Johan Kildal. 2010. 3D-press: Haptic Illusion of Compliance when Pressing on a Rigid Surface. In International Conference on Multimodal Interfaces and the Workshop on Machine Learning for Multimodal Interaction (ICMI-MLMI '10), 8. http://doi.org/10.1145/1891903.1891931","paperID":"None"},{"content":"Sunjun Kim and Geehyuk Lee. 2013. Haptic Feedback Design for a Virtual Button Along Force-Displacement Curves. In Proc. of UIST '13, 91--96. http://doi.org/10.1145/2501988.2502041","paperID":"None"},{"content":"Eunjin Koh, Jongho Won, and Changseok Bae. 2008. Vision-based virtual touch screen interface. Digest of Technical Papers IEEE International Conference on Consumer Electronics: 4--5. http://doi.org/10.1109/ICCE.2008.4587900","paperID":"None"},{"content":"R. Komerska and C. Ware. 2003. Haptic task constraints for 3D interaction. In Proc. of 11th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2003. HAPTICS 2003, 270--277. http://doi.org/10.1109/HAPTIC.2003.1191295","paperID":"None"},{"content":"Katherine J. Kuchenbecker, Jonathan Fiene, and Günter Niemeyer. 2006. Improving contact realism through event-based haptic feedback. IEEE Transactions on Visualization and Computer Graphics, 219--229. http://doi.org/10.1109/TVCG.2006.32","paperID":"None"},{"content":"Jinha Lee, Alex Olwal, Hiroshi Ishii, Microsoft Way, and Redmond Wa. 2013. SpaceTop : Integrating 2D and Spatial 3D Interactions in a See-through Desktop Environment. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, 189--192. http://dx.doi.org/10.1145/2470654.2470680","paperID":"None"},{"content":"Rw Lindeman, Jl Sibert, and Jk Hahn. 1999. Towards usable VR: an empirical study of user interfaces for immersive virtual environments. In Proc. of the SIGCHI conference on Human Factors in Computing Systems, 64--71. http://doi.org/10.1145/302979.302995","paperID":"None"},{"content":"Pedro Lopes and Patrick Baudisch. 2013. Musclepropelled force feedback. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, 2577--2580. http://doi.org/10.1145/2470654.2481355","paperID":"None"},{"content":"Kouta Minamizawa and S Fukamachi. 2007. Gravity grabber: wearable haptic display to present virtual mass sensation. ACM SIGGRAPH 2007 emerging technologies, 8. http://doi.org/10.1145/1278280.1278289","paperID":"None"},{"content":"Georgios Nikolakis and Dimitrios Tzovaras. 2004. CyberGrasp and PHANTOM Integration: Enhanced Haptic Access for Visually Impaired Users. In Proc. of Conference Speech and Computer, 507--513. Retrieved from http://www.iscaspeech.org/archive_open/specom_04/spc4_507.html","paperID":"None"},{"content":"Domenico Prattichizzo, Claudio Pacchierotti, Stefano Cenci, Kouta Minamizawa, and Giulio Rosati. 2010. Using a fingertip tactile device to substitute kinesthetic feedback in haptic interaction. In Haptics: Generating and Perceiving Tangible Sensations. 125--130. http://doi.org/10.1007/978--3--642--14064--8_19","paperID":"None"},{"content":"Jun Rekimoto. 2013. Traxion: a tactile interaction device with virtual force sensation. In Proc. of 26th annual ACM symposium on User Interface Software and Technology, 427--431. http://doi.org/10.1145/2501988.2502044","paperID":"None"},{"content":"K Salisbury, D Brock, T Massie, and N Swarup. 1995. Haptic rendering: Programming touch interaction with virtual objects. In Proc. of the 1995 symposium on Interactive 3D graphics, 123--130. http://doi.org/10.1145/199404.199426","paperID":"None"},{"content":"Antti Sand, Ismo Rakkolainen, Poika Isokoski, Jari Kangas, Roope Raisamo, and Karri Palovuori. 2015. Head-mounted display with mid-air tactile feedback. In Proc. of the 21st ACM Symposium on Virtual Reality Software and Technology - VRST '15, ACM Press, 51--58. http://doi.org/10.1145/2821592.2821593","paperID":"None"},{"content":"I. Sarakoglou, N. Tsagarakis, and D.G. Caldwell. 2005. A portable fingertip tactile feedback array - transmission system reliability and modelling. First Joint Eurohaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. World Haptics Conference: 2--3. http://doi.org/10.1109/WHC.2005.17","paperID":"None"},{"content":"Robert Scheibe, Mathias Moehring, and Bernd Froehlich. 2007. Tactile feedback at the finger tips for improved direct interaction in immersive environments. In Proc. of IEEE Symposium on 3D User Interfaces 2007 Proceedings, 3DUI 2007, 123--130. http://doi.org/10.1109/3DUI.2007.340784","paperID":"None"},{"content":"Rajinder Sodhi, Ivan Poupyrev, Matthew Glisson, and Ali Israr. 2013. AIREAL: interactive tactile experiences in free air. ACM Transactions on Graphics 32, 4: 134. http://doi.org/10.1145/2461912.2462007","paperID":"None"},{"content":"M. A. Srinivasan and R. H. LaMotte. 1995. Tactual discrimination of softness. J Neurophysiol 73, 1: 88--101. Retrieved September 24, 2015 from http://jn.physiology.org/content/73/1/88","paperID":"None"},{"content":"M. Tosas and B. Li. 2004. Virtual Touch Screen for Mixed Reality. In Computer Vision in Human-Computer Interaction. 48--59. http://doi.org/10.1007/978--3--54024837--8_6","paperID":"None"},{"content":"Emi Tamaki, Takashi Miyaki, and Jun Rekimoto. 2011. PossessedHand: techniques for controlling human hands using electrical muscles stimuli. In Proc. of the SIGCHI conference on Human factors in computing, 543--552. http://doi.org/10.1145/1978942.1979018","paperID":"None"},{"content":"Yanqing Wang and Christine L. MacKenzie. 2000. The role of contextual haptic and visual constraints on object manipulation in virtual environments. In Proc. of the SIGCHI conference on Human factors in computing systems - CHI '00, 532--539. http://doi.org/10.1145/332040.332494","paperID":"None"},{"content":"Jun Wu, Dangxiao Wang, and Yuru Zhang. 2009. Virtual fixture based haptic rendering of handwriting. 2009 IEEE International Conference on Virtual Environments, Human-Computer Interfaces, and Measurements Systems, VECIMS 2009 - Proceedings, 16--21. http://doi.org/10.1109/VECIMS.2009.5068858","paperID":"None"},{"content":"Thomas G Zimmerman, Jaron Lanier, Chuck Blanchard, Steve Bryson, and Young Harvill. 1986. A hand gesture interface device. ACM SIGCHI Bulletin 18, 4: 189--192. http://doi.org/10.1145/30851.275628","paperID":"None"}],"abstract":"A virtual touch screen concept using an optical see-through head-mounted display has been suggested. With a virtual touch screen, the user's direct-touch interactions are allowed in much the same way as a conventional touch screen, but the absence of haptic feedback and physical constraint leads to poor user performance. To overcome this issue, we developed a wearable haptic device, called HapThimble. It provides various types of haptic feedback (tactile, pseudo-force, and vibrotactile) to the user's fingertip and mimics physical buttons based on force-penetration depth curves. We conducted three experiments with HapThimble. The first experiment confirmed that HapThimble could increase a users' performance when conducting clicking and dragging tasks. The second experiment revealed that users could differentiate between six types of haptic feedback, rendered based on different force-penetration depth curves obtained using HapThimble. Last, we conducted a test to investigate the similarity between the physical buttons and the mimicked haptic buttons and obtained a 90.3% success rate.","title":"HapThimble: A Wearable Haptic Device towards Usable Virtual Touch Screen","filename":"CHI16/p3694","authors":["Hwan Kim","Minhwan Kim","Woohun Lee"],"conference":"CHI '16"}