{"paperId":2858093,"citation":[],"reference":[{"content":"S. A. Ahmad and P. H. Chappell. 2009. Surface EMG pattern analysis of the wrist muscles at different speeds of contraction. Journal of Medical Engineering & Technology 33, 5 (2009), 376--385. DOI: http://dx.doi.org/10.1080/03091900802491246","paperID":"None"},{"content":"Ahmet Alkan and Mücahid Günay. 2012. Identification of EMG Signals Using Discriminant Analysis and SVM Classifier. Expert Syst. Appl. 39, 1 (Jan. 2012), 44--47. DOI: http://dx.doi.org/10.1016/j.eswa.2011.06.043","paperID":"None"},{"content":"Christoph Amma, Thomas Krings, Jonas Böer, and Tanja Schultz. 2015. Advancing Muscle-Computer Interfaces with High-Density Electromyography. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 929--938. DOI: http://dx.doi.org/10.1145/2702123.2702501","paperID":"None"},{"content":"Hyun Jae Baek, Hong Ji Lee, Yong Gyu Lim, and Kwang Suk Park. 2012. Conductive Polymer Foam Surface Improves the Performance of a Capacitive EEG Electrode. Biomedical Engineering, IEEE Transactions on 59, 12 (Dec 2012), 3422--3431. DOI: http://dx.doi.org/10.1109/TBME.2012.2215032","paperID":"None"},{"content":"Chih-Chung Chang and Chih-Jen Lin. 2011. LIBSVM: A library for support vector machines. ACM Transactions on Intelligent Systems and Technology 2 (2011), 27:1--27:27. Issue 3. Software available at http://www.csie.ntu.edu.tw/?cjlin/libsvm.","paperID":"None"},{"content":"Xiang Chen, Xu Zhang, Zhang-Yan Zhao, Ji-Hai Yang, V. Lantz, and Kong-Qiao Wang. 2007. Hand Gesture Recognition Research Based on Surface EMG Sensors and 2D-accelerometers. In Wearable Computers, 2007 11th IEEE International Symposium on. 11--14. DOI: http://dx.doi.org/10.1109/ISWC.2007.4373769","paperID":"None"},{"content":"Artem Dementyev and Joseph A. Paradiso. 2014. WristFlex: Low-power Gesture Input with Wrist-worn Pressure Sensors. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 161--166. DOI: http://dx.doi.org/10.1145/2642918.2647396","paperID":"None"},{"content":"Interlink Electronics. 2015. FSR400 short. (2015). http: //www.interlinkelectronics.com/FSR400short.php.","paperID":"None"},{"content":"Marco Gazzoni, Nicol Celadon, Davide Mastrapasqua, Marco Paleari, Valentina Margaria, and Paolo Ariano. 2014. Quantifying Forearm Muscle Activity during Wrist and Finger Movements by Means of Multi-Channel Electromyography. PLoS ONE 9, 10 (10 2014), e109943. DOI: http://dx.doi.org/10.1371/journal.pone.0109943","paperID":"None"},{"content":"Jeremy Gummeson, Bodhi Priyanth, and Jie Liu. 2014. An Energy Harvesting Wearable Ring Platform for Gesture Input on Surfaces. In Proceedings of the 12th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '14). ACM, NY, NY, USA, 162--175. DOI: http://dx.doi.org/10.1145/2594368.2594389","paperID":"None"},{"content":"S. Sathiya Keerthi and Chih-Jen Lin. 2003. Asymptotic Behaviors of Support Vector Machines with Gaussian Kernel. Neural Comput. 15, 7 (July 2003), 1667--1689. DOI: http://dx.doi.org/10.1162/089976603321891855","paperID":"None"},{"content":"12. Frederic Kerber, Pascal Lessel, and Antonio Krüger. 2015. Same-side Hand Interactions with Arm-placed Devices Using EMG. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 1367--1372. DOI: http://dx.doi.org/10.1145/2702613.2732895","paperID":"None"},{"content":"David Kim, Otmar Hilliges, Shahram Izadi, Alex D. Butler, Jiawen Chen, Iason Oikonomidis, and Patrick Olivier. 2012. Digits: Freehand 3D Interactions Anywhere Using a Wrist-worn Gloveless Sensor. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, NY, NY, USA, 167--176. DOI: http://dx.doi.org/10.1145/2380116.2380139","paperID":"None"},{"content":"Amanda C. Myers, He Huang, and Yong Zhu. 2015. Wearable silver nanowire dry electrodes for electrophysiological sensing. RSC Adv. 5 (2015), 11627--11632. Issue 15. DOI: http://dx.doi.org/10.1039/C4RA15101A","paperID":"None"},{"content":"Myo. 2015. How do you wear the Myo armband? (2015). https://support.getmyo.com/hc/en-us/articles/ 201169525-How-do-you-wear-the-Myo-armband-.","paperID":"None"},{"content":"16. Angkoon Phinyomark, Pornchai Phukpattaranont, and Chusak Limsakul. 2012. Feature reduction and selection for {EMG} signal classification. Expert Systems with Applications 39, 8 (2012), 7420--7431. DOI: http://dx.doi.org/10.1016/j.eswa.2012.01.102","paperID":"None"},{"content":"Jun Rekimoto. 2001. GestureWrist and GesturePad: Unobtrusive Wearable Interaction Devices. In Proceedings of the 5th IEEE International Symposium on Wearable Computers (ISWC '01). IEEE Computer Society, Washington, DC, USA, 21. http://dl.acm.org/citation.cfm?id=580581.856565","paperID":"None"},{"content":"Advancer Technologies. 2015. Muscle sensor v3. (2015). http://www.advancertechnologies.com/p/ muscle-sensor-v3.html.","paperID":"None"},{"content":"M.T. Wolf, C. Assad, A. Stoica, Kisung You, H. Jethani, M.T. Vernacchia, J. Fromm, and Y. Iwashita. 2013. Decoding static and dynamic arm and hand gestures from the JPL BioSleeve. In Aerospace Conference, 2013 IEEE. 1--9. DOI: http://dx.doi.org/10.1109/AERO.2013.6497171","paperID":"None"}],"abstract":"Practical wearable gesture tracking requires that sensors align with existing ergonomic device forms. We show that combining EMG and pressure data sensed only at the wrist can support accurate classification of hand gestures. A pilot study with unintended EMG electrode pressure variability led to exploration of the approach in greater depth. The EMPress technique senses both finger movements and rotations around the wrist and forearm, covering a wide range of gestures, with an overall 10-fold cross validation classification accuracy of 96%. We show that EMG is especially suited to sensing finger movements, that pressure is suited to sensing wrist and forearm rotations, and their combination is significantly more accurate for a range of gestures than either technique alone. The technique is well suited to existing wearable device forms such as smart watches that are already mounted on the wrist.","title":"EMPress: Practical Hand Gesture Classification with Wrist-Mounted EMG and Pressure Sensing","filename":"CHI16/p2332","authors":["Jess McIntosh","Charlie McNeill","Mike Fraser","Frederic Kerber","Markus Löchtefeld","Antonio Krüger"],"conference":"CHI '16"}