{"paperId":2858285,"abstract":"Research claims that users value the battery life of their smartphones, but no study to date has attempted to quantify battery value and how this value changes according to users' current context and needs. Previous work has quantified the monetary value that smartphone users place on their data (e.g., location), but not on battery life. Here we present a field study and methodology for systematically measuring the monetary value of smartphone battery life, using a reverse second-price sealed-bid auction protocol. Our results show that the prices for the first and last 10% battery segments differ substantially. Our findings also quantify the tradeoffs that users consider in relation to battery, and provide a monetary model that can be used to measure the value of apps and enable fair ad-hoc sharing of smartphone resources.","citation":[],"reference":[{"content":"Kumaripaba Athukorala, Eemil Lagerspetz, Maria H. von Kügelgen, Antti Jylhä, Adam J. Oliner, Sasu Tarkoma and Giulio Jacucci. 2014. How Carat Affects User Behavior: Implications for Mobile Battery Awareness Applications. In CHI'14. http://dx.doi.org/http://dx.doi.org/10.1145/2556288.255","paperID":"None"},{"content":"Albert Bandura. 1992. Exercise of personal agency through the self-efficacy mechanism. APA PsycNET.","paperID":"None"},{"content":"Nilanjan Banerjee, Ahmad Rahmati, Mark D. Corner, Sami Rollins and Lin Zhong. 2007. Users and Batteries: Interactions and Adaptive Energy Management in Mobile Systems. In UbiComp 2007: Ubiquitous Computing, Springer Berlin Heidelberg, 217--234. http://dx.doi.org/10.1007/978--3--540--74853--3_13","paperID":"None"},{"content":"Omer Barak, Gabriella Cohen, Alla Gazit and Eran Toch. 2013. The Price is Right?: Economic Value of Location Sharing. In Proceedings of the 2013 ACM Conference on Pervasive and Ubiquitous Computing Adjunct Publication, ACM, 891--900. http://dx.doi.org/10.1145/2494091.2497343","paperID":"None"},{"content":"Raffaele Bolla, Raees Khan, Xavier Parra and Manuela Repetto. 2014. Improving Smartphones Battery Life by Reducing Energy Waste of Background Applications. In International Conference on Next Generation Mobile Apps, Services and Technologies, IEEE, 123--130. http://dx.doi.org/10.1109/NGMAST.2014.10","paperID":"None"},{"content":"Juan P. Carrascal, Christopher Riederer, Vijay Erramilli, Mauro Cherubini and Rodrigo de Oliveira. 2013. Your Browsing Behavior for a Big Mac: Economics of Personal Information Online. In International Conference on World Wide Web, International World Wide Web Conferences Steering Committee, 189--200.","paperID":"None"},{"content":"CES 2013: Share Battery Power Between Mobile Devices IEEE Spectrum. Retrieved 13/08/2015 from http://spectrum.ieee.org/tech-talk/consumerelectronics/portable-devices/mobile-devices-shareeverything","paperID":"None"},{"content":"Russell B. Clayton, Glenn Leshner and Anthony Almond. 2015. The Extended iSelf: The Impact of iPhone Separation on Cognition, Emotion, and Physiology. J Comput-Mediat Comm 20, 2: 119--135. http://dx.doi.org/10.1111/jcc4.12109","paperID":"None"},{"content":"Easley David and Kleinberg Jon. 2010. Networks, Crowds, and Markets: Reasoning About a Highly Connected World. Cambridge University Press.","paperID":"None"},{"content":"Denzil Ferreira, Anind K. Dey and Vassilis Kostakos. 2011. Understanding human-smartphone concerns: a study of battery life. In International Conference on Pervasive Computing, Springer-Verlag, 19--33. http://dx.doi.org/10.1007/978--3--642--21726--5_2","paperID":"None"},{"content":"Denzil Ferreira, Eija Ferreira, Jorge Goncalves, Vassilis Kostakos and Anind K. Dey. 2013. Revisiting HumanBattery Interaction with an Interactive Battery Interface. In International Joint Conference on Pervasive and Ubiquitous Computing , ACM, 563--572. http://dx.doi.org/10.1145/2493432.2493465","paperID":"None"},{"content":"Denzil Ferreira, Vassilis Kostakos and Anind K. Dey. 2015. AWARE: mobile context instrumentation framework. Frontiers in ICT 2, 6: 1--9. http://dx.doi.org/10.3389/fict.2015.00006","paperID":"None"},{"content":"Pedro Ferreira, Moira McGregor and Airi Lampinen. 2015. Caring for Batteries: Maintaining Infrastructures and Mobile Social Contexts. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, ACM, 383--392. http://dx.doi.org/10.1145/2785830.2785864","paperID":"None"},{"content":"Finding those elusive power sockets at airports. Retrieved 16/09/2015 from https://www.kayak.co.uk/news/finding-elusive-powersockets-airports/","paperID":"None"},{"content":"Huber Flores, Pan Hui, Sasu Tarkoma, Yong Li, Satish Srirama and Rajkumar Buyya. 2015. Mobile code offloading: from concept to practice and beyond. Communications Magazine, IEEE 53, 3: 80--88. http://dx.doi.org/10.1109/MCOM.2015.7060486","paperID":"None"},{"content":"Jorge Goncalves. 2015. Situated Crowdsourcing: Feasibility, Performance and Behaviours. Ph.D Dissertation.","paperID":"None"},{"content":"Jorge Goncalves, Vassilis Kostakos, Evangelos Karapanos, Mary Barreto, Tiago Camacho, Anthony Tomasic and John Zimmerman. 2014. Citizen Motivation on the Go: The Role of Psychological Empowerment. Interacting with Computers 26, 3: 196207. http://dx.doi.org/10.1093/iwc/iwt035","paperID":"None"},{"content":"Jens Grossklags and Alessandro Acquisti. 2007. When 25 Cents is Too Much: An Experiment on Willingness-To-Sell and Willingness-To-Protect Personal Information. In WEIS.","paperID":"None"},{"content":"Simo Hosio, Jorge Goncalves, Vili Lehdonvirta, Denzil Ferreira and Vassilis Kostakos. 2014. Situated Crowdsourcing Using a Market Model. In User Interface Software and Technology, ACM, 55--64. http://dx.doi.org/10.1145/2642918.2647362","paperID":"None"},{"content":"How far will we go to charge our phones? - BBC News. Retrieved 18/08/2015 from http://www.bbc.com/news/magazine-33295211","paperID":"None"},{"content":"Simon L. Jones, Denzil Ferreira, Simo Hosio, Jorge Goncalves and Vassilis Kostakos. 2015. Revisitation Analysis of Smartphone App Use. In International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 1197--1208. http://dx.doi.org/10.1145/2750858.2807542","paperID":"None"},{"content":"Aman Kansal, Michel Goraczko and Feng Zhao. 2007. Building a Sensor Network of Mobile Phones. In Proceedings of the 6th International Conference on Information Processing in Sensor Networks, ACM, 547548. http://dx.doi.org/10.1145/1236360.1236433","paperID":"None"},{"content":"Nicholas D. Lane, Emiliano Miluzzo, Hong Lu, Daniel Peebles, Tanzeem Choudhury and Andrew T. Campbell. 2010. A Survey of Mobile Phone Sensing. Communications Magazine, IEEE 48, 9: 140--150. http://dx.doi.org/10.1109/MCOM.2010.5560598","paperID":"None"},{"content":"Reed Larson and Mihaly Csikszentmihalyi. 1983. The Experience Sampling Method. In Flow and the Foundations of Positive Psychology (eds.). Wiley Jossey-Bass, San Francisco, 15, 41--56.","paperID":"None"},{"content":"R. P. McAfee and John McMillan. 1987. Auctions and bidding. Journal of economic literature: 699--738.","paperID":"None"},{"content":"Sandra J. Milberg, Sandra J. Burke, H. J. Smith and Ernest A. Kallman. 1995. Values, Personal Information Privacy, and Regulatory Approaches. Commun. ACM 38, 12: 65--74. http://dx.doi.org/10.1145/219663.219683","paperID":"None"},{"content":"Derek G. Murray, Eiko Yoneki, Jon Crowcroft and Steven Hand. 2010. The Case for Crowd Computing. In Proceedings of the Second ACM SIGCOMM Workshop on Networking, Systems, and Applications on Mobile Handhelds, ACM, 39--44. http://dx.doi.org/10.1145/1851322.1851334","paperID":"None"},{"content":"R. R. Officer and A. N. Halter. 1968. Utility Analysis in a Practical Setting. American Journal of Agricultural Economics 50, 2: 257--277. http://dx.doi.org/10.2307/1237541","paperID":"None"},{"content":"Jaehyun Park and Sung H. Han. 2013. Defining user value: A case study of a smartphone. International Journal of Industrial Ergonomics 43, 4: 274--282. http://dx.doi.org/10.1016/j.ergon.2013.04.005","paperID":"None"},{"content":"Kostas Pentikousis. 2010. In search of energy-efficient mobile networking. Communications Magazine, IEEE 48, 1: 95--103. http://dx.doi.org/10.1109/MCOM.2010.5394036","paperID":"None"},{"content":"Trevor Pering, Yuvraj Agarwal, Rajesh Gupta and Roy Want. 2006. CoolSpots: Reducing the Power Consumption of Wireless Mobile Devices with Multiple Radio Interfaces. In Proceedings of the 4th International Conference on Mobile Systems, Applications and Services, ACM, 220--232. http://dx.doi.org/10.1145/1134680.1134704","paperID":"None"},{"content":"Ahmad Rahmati, Angela Qian and Lin Zhong. 2007. Understanding human-battery interaction on mobile phones. In MobileHCI 2007, 265--272. http://dx.doi.org/10.1145/1377999.1378017","paperID":"None"},{"content":"Ahmad Rahmati and Lin Zhong. 2009. Human-battery interaction on mobile phones. Pervasive and Mobile Computing 5, 5: 465--477. http://dx.doi.org/10.1016/j.pmcj.2008.08.003","paperID":"None"},{"content":"Jacopo Staiano, Nuria Oliver, Bruno Lepri, Rodrigo de Oliveira, Michele Caraviello and Nicu Sebe. 2014. Money Walks: A Human-Centric Study on the Economics of Personal Mobile Data. In UbiComp, ACM. http://dx.doi.org/10.1145/2632048.2632074","paperID":"None"},{"content":"Khai N. Truong, Julie A. Kientz, Timothy Sohn, Alyssa Rosenzweig, Amanda Fonville and Tim Smith. 2010. The Design and Evaluation of a Task-centered Battery Interface. In Proceedings of the 12th ACM International Conference on Ubiquitous Computing, ACM, 341--350. http://dx.doi.org/10.1145/1864349.1864400","paperID":"None"},{"content":"Narseo Vallina-Rodriguez, Christos Efstratiou, Geoffrey Xie and Jon Crowcroft. 2011. Enabling Opportunistic Resources Sharing on Mobile Operating Systems: Benefits and Challenges. In Proceedings of the 3rd ACM Workshop on Wireless of the Students, by the Students, for the Students, ACM, 29--32. http://dx.doi.org/10.1145/2030686.2030696","paperID":"None"},{"content":"Volt. Retrieved 16/09/2015 from http://getvolt.dk/","paperID":"None"},{"content":"Ranti Yulia Wardani and Sony Warsono. 2012. A crosscultural study on the value structure of mobile internet usage: comparison between Indonesia and Japan. Journal of Indonesian Economy and Business : JIEB. 27, 3: 355--372,420--421.","paperID":"None"},{"content":"V. A. R. Zelizer. 1994. The Social Meaning of Money. BasicBooks.","paperID":"None"},{"content":"Lide Zhang, Robert P. Dick, Z. M. Mao, Zhaoguang Wang and Ann Arbor. 2010. Accurate Online Power Estimation and Automatic Battery Behavior Based Power Model Generation for Smartphones. In CODES/ISSS '10, 105--114.","paperID":"None"},{"content":"Marc A. Zimmerman and Julian Rappaport. 1988. Citizen participation, perceived control, and psychological empowerment. American journal of community psychology 16, 5: 725--750.","paperID":"None"}],"title":"Monetary Assessment of Battery Life on Smartphones","filename":"CHI16/p1869","authors":["Simo Hosio","Denzil Ferreira","Jorge Goncalves","Niels van Berkel","Chu Luo","Muzamil Ahmed","Huber Flores","Vassilis Kostakos"],"conference":"CHI '16"}