{"paperId":2858387,"citation":[],"reference":[{"content":"Jae-Wook Ahn, Catherine Plaisant, and Ben Shneiderman. 2014. A Task Taxonomy for Network Evolution Analysis. IEEE Transactions on Visualization and Computer Graphics 20, 3 (2014), 365-376. http://doi.ieeecomputersociety.org/10.1109/ TVCG.2013.238","paperID":"None"},{"content":"Fereshteh Amini, Nathalie Henry Riche, Bongshin Lee, Christophe Hurter, and Pourang Irani. 2015. Understanding Data Videos : Looking at Narrative Visualization through the Cinematography Lens. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). ACM, 1459-1468.","paperID":"None"},{"content":"Sitaram Asur, Srinivasan Parthasarathy, and Duygu Ucar. 2007. An event-based framework for characterizing the evolutionary behavior of interaction graphs. Proceedings of the ACM International Conference on Knowledge Discovery and Data Mining (KDD) (2007), 913. DOI: http://dx.doi.org/10.1145/1281192.1281290","paperID":"None"},{"content":"Benjamin Bach, Pierre Dragicevic, Daniel Archambault, Christophe Hurter, and Sheelagh Carpendale. 2016. A Descriptive Framework for Temporal Data Visualizations Based on Generalized Space-Time Cubes. Computer Graphics Forum (2016). to appear.","paperID":"None"},{"content":"Benjamin Bach, Natalie Henry Riche, Tim Dwyer, Tara Madhyastha, Jean-Daniel Fekete, and Thomas Grabowski. 2015. Small MultiPiles: Piling Time to Explore Temporal Patterns in Dynamic Networks. Computer Graphics Forum 34, 3 (2015), 31-40. DOI: http://dx.doi.org/10.1111/cgf.12615","paperID":"None"},{"content":"Benjamin Bach, Emmanuel Pietriga, and Jean-Daniel Fekete. 2014. GraphDiaries: Animated Transitions and Temporal Navigation for Dynamic Networks. IEEE Transactions on Visualization and Computer Graphics 20, 5 (2014), 740-754. DOI: http://dx.doi.org/ 4077CBD5-B2C4--4EC6--9475-E3D0687E96A4","paperID":"None"},{"content":"Scott Bateman, Regan L. Mandryk, Carl Gutwin, Aaron Genest, David McDine, and Christopher Brooks. 2010. Useful Junk?: The Effects of Visual Embellishment on Comprehension and Memorability of Charts. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). ACM, NY, NY, USA, 2573-2582. DOI: http://dx.doi.org/10.1145/1753326.1753716","paperID":"None"},{"content":"Fabian Beck, Michael Burch, Stephan Diehl, and Daniel Weiskopf. 2014. The State of the Art in Visualizing Dynamic Graphs. In Proceedings of the Eurographics Conference on Visualization (EuroVis), State-of-The-Art-Reports.","paperID":"None"},{"content":"Michelle A. Borkin, Azalea A. Vo, Zoya Bylinskii, Phillip Isola, Shashank Sunkavalli, Aude Oliva, and Hanspeter Pfister. 2013. What Makes a Visualization Memorable? IEEE Transactions on Visualization and Computer Graphics (2013).","paperID":"None"},{"content":"Jeremy Boy, Jean-Daniel Fekete, and Francoise Detienne. 2015. Storytelling in Information Visualizations: Does it Engage Users to Explore Data?. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI), ACM (Ed.). ACM, Seoul, South Korea, 1449-1458. DOI: http://dx.doi.org/10.1145/2702123.2702452","paperID":"None"},{"content":"Ulrik Brandes and Martin Mader. 2012. A Quantitative Comparison of Stress-Minimization Approaches for Offline Dynamic Graph Drawing. In Graph Drawing, Marc Kreveld and Bettina Speckmann (Eds.). Lecture Notes in Computer Science, Vol. 7034. Springer, 99-110. DOI: http://dx.doi.org/10.1007/978--3--642--25878--7_11","paperID":"None"},{"content":"Joshua Caldwell. 2012. Information comics: An overview. IEEE International Professional Communication Conference (2012). DOI: http://dx.doi.org/10.1109/IPCC.2012.6408645","paperID":"None"},{"content":"Wei-Ta Chu, Chia-Hsiang Yu, and Hsin-Han Wang. 2015. Optimized Comics-Based Storytelling for Temporal Image Sequences. Multimedia, IEEE Transactions on 17, 2 (2015), 201-215. DOI: http://dx.doi.org/10.1109/TMM.2014.2383616","paperID":"None"},{"content":"Neil Cohn. 2013. The Visual Language of Comics: Introduction to the Structure and Cognition of Sequential Images. Bloomsburry Academic.","paperID":"None"},{"content":"dtv Verlagsgesellschaft. 2000. dtv-Atlas Weltgeschichte. Band 2: Von der franzoesischen Revolution bis zur Gegenwart.","paperID":"None"},{"content":"N Gershon and W Page. 2001. What Storytelling can do for Information Visualization. Communications of the ACM, 44, 8 (2001), 31-37.","paperID":"None"},{"content":"H. Gibson, J. Faith, and P. Vickers. 2013. A Survey of Two-Dimensional Graph Layout Techniques for Information Visualisation. Information Visualization 12, 3--4 (2013), 324-357. DOI: http://dx.doi.org/10.1177/1473871612455749","paperID":"None"},{"content":"Michael Green and Kimberly Myers. 2010. Graphic Medicine: Use of Comics in Medical Education and Patient Care. British Medical Journal 340, c863 (2010). DOI: http://dx.doi.org/10.1136/bmj.c863","paperID":"None"},{"content":"Steffen Hadlak, Heidrun Schumann, and Hans-Jörg Schulz. 2015. A Survey of Multi-faceted Graph Visualization. In Eurographics Conference on Visualization (EuroVis), State-of-the-Art-Reports, R Borgo, F Ganovelli, and I Viola (Eds.). The Eurographics Association. DOI: http://dx.doi.org/10.2312/eurovisstar.20151109","paperID":"None"},{"content":"Jeffrey Heer, Fernanda B. Viegas, and Martin Wattenberg. 2007. Voyagers and Voyeurs: Supporting Asynchronous Collaborative Information Visualization. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). ACM, NY, NY, USA, 1029-1038. DOI: http://dx.doi.org/10.1145/1240624.1240781","paperID":"None"},{"content":"Ivan Herman, Guy Melancon, and Scott M. Marshall. 2000. Graph Visualization and Navigation in Information Visualization: A Survey. Visualization and Computer Graphics, IEEE Transactions on 6, 1 (2000), 24-43. http://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=841119&tag=1","paperID":"None"},{"content":"Jessica Hullman and Nick Diakopoulos. 2011. Visualization Rhetoric: Framing Effects in Narrative Visualization. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2231-2240. DOI: http://dx.doi.org/10.1109/TVCG.2011.255","paperID":"None"},{"content":"Jessica Hullman, Nicholas Diakopoulos, and Eytan Adar. 2013a. Contextifier: Automatic Generation of Annotated Stock Visualizations. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). ACM, NY, NY, USA, 2707-2716. DOI: http://dx.doi.org/10.1145/2470654.2481374","paperID":"None"},{"content":"Jessica Hullman, Steven Drucker, Nathalie Henry Riche, Bongshin Lee, Danyel Fisher, and Eytan Adar. 2013b. A Deeper Understanding of Sequence in Narrative Visualization. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2406-2415. DOI: http://dx.doi.org/10.1109/TVCG.2013.119","paperID":"None"},{"content":"Aaron Humphrey. 2014. Beyond Graphic Novels: Illustrated Scholarly Discourse and the History of Educational Comics. Media International Australia 73 (2014).","paperID":"None"},{"content":"Daniel McFarland James Moody and Skye Bender-deMoll. 2005. Dynamic Network Visualization. American Journal of Sociololgy (2005).","paperID":"None"},{"content":"Heike Elisabeth Jüngst. 2010. Information Comics: Knowledge Transfer in a Popular Format. Lang, Frankfurt. 366 pages.","paperID":"None"},{"content":"Rubaiat Habib Kazi, Takeo Igarashi, Shengdong Zhao, and Richard DavisNat. 2012. Vignette: Interactive Texture Design and Manipulation with Freeform Gestures for Pen-and-ink Illustration. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). ACM, NY, NY, USA, 1727-1736. DOI: http://dx.doi.org/10.1145/2207676.2208302","paperID":"None"},{"content":"Natalie Kerracher, Jessie Kennedy, and Kevin Chalmers. 2014. The Design Space of Temporal Graph Visualisation. In Proceedings of the Eurographics Conference on Visualization (EuroVis), Short Papers Track, N. Elmqvist, M. Hlawitschka, and J. Kennedy (Eds.). The Eurographics Assocation, Swansea, 7-11. DOI: http://dx.doi.org/10.2312/eurovisshort.20141149","paperID":"None"},{"content":"N Kerracher, J Kennedy, and K Chalmers. 2015. A Task Taxonomy for Temporal Graph Visualisation. IEEE Transactions on Visualization and Computer Graphics 21, 10 (Oct. 2015), 1160-1172. DOI: http://dx.doi.org/10.1109/TVCG.2015.2424889","paperID":"None"},{"content":"Robert Kosara and Jock MacKinlay. 2013. Storytelling: The Next Step for Visualization. IEEE Computer (Special Issue on Cutting-Edge Research in Visualization) 46, 5 (2013), 44-50. DOI: http://dx.doi.org/10.1109/MC.2013.36","paperID":"None"},{"content":"Bongshin Lee, Rubaiat Habib Kazi, and Greg Smith. 2013. SketchStory: Telling more Engaging Stories with Data Through Freeform Sketching. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2416-2425. DOI: http://dx.doi.org/10.1109/TVCG.2013.191","paperID":"None"},{"content":"Bongshin Lee, Catherine Plaisant, Cynthia Sims Parr, Jean-Daniel Fekete, and Nathalie Henry. 2006. Task Taxonomy for Graph Visualization. In Proceedings of the 2006 AVI workshop on BEyond time and errors: novel evaluation methods for information visualization. ACM, 1-5.","paperID":"None"},{"content":"Kwan-Liu Ma, I. Liao, J. Frazier, H. Hauser, and H.-N. Kostis. 2012. Scientific Storytelling Using Visualization. IEEE Computer Graphics and Applications 32, 1 (Jan 2012), 12-19. DOI: http://dx.doi.org/10.1109/MCG.2012.24","paperID":"None"},{"content":"Scott McCloud. 1994. Understanding Comics: The Invisible Art. Harper-Perennial, NY.","paperID":"None"},{"content":"Scott McCloud. 2006. Making Comics: Storytelling Secrets of Comics, Manga and Graphic Novels. Harper, NY.","paperID":"None"},{"content":"Sarah McNicol. 2014. Humanising Illness: Presenting Health Information in Educational Comics. Medical Humanities 40, 1 (2014), 49-55. DOI: http://dx.doi.org/10.1136/medhum-2013-010469","paperID":"None"},{"content":"M.C. Medlock, D. Wixon, M. McGee, and D Welsh. 2005. The Rapid Iterative Test and Evaluation Method: Better Products in Less Time. In Cost-Justifying Usability, Second Edition: An Update for the Internet Age, Randolph G. Bias and Deborah J. Mayhew (Eds.). 489-518.","paperID":"None"},{"content":"Sebastien Rufiange and Michael J McGuffin. 2013. DiffAni: Visualizing Dynamic Graphs With a Hybrid of Difference Maps and Animation. IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec. 2013), 2556-65. DOI: http://dx.doi.org/10.1109/TVCG.2013.149","paperID":"None"},{"content":"Arvind Satyanarayan and Jeffrey Heer. 2014. Authoring Narrative Visualizations with Ellipsis. Computer Graphics Forum 33, 3 (2014), 361-370. DOI: http://dx.doi.org/10.1111/cgf.12392","paperID":"None"},{"content":"Edward Segel and Jeffrey Heer. 2010. Narrative Visualization: Telling Stories with Data. IEEE Transactions on Visualization and Computer Graphics 16, 6 (2010), 1139-48. DOI: http://dx.doi.org/10.1109/TVCG.2010.179","paperID":"None"},{"content":"Ross Shannon, Aaron Quigley, and Paddy Nixon. 2009. Time sequences. In Proceedings of the ACM Conference on Human Factors in Computing Systems, Extended Abstracts (CHI). ACM, 4615-4620.","paperID":"None"},{"content":"Andre Suslik Spritzer, Jeremy Boy, Pierre Dragicevic, Jean-Daniel Fekete, and Carla Maria Dal Sasso Freitas. 2015. Towards a Smooth Design Process for Static Communicative Node-Link Diagrams. In Computer Graphics Forum, Vol. 34. Wiley-Blackwell, 461-470. DOI: http://dx.doi.org/10.1111/cgf.12658","paperID":"None"},{"content":"M. Tatalovic. 2009. Science Comics as Tools for Science Education and Communication: A Brief, Exploratory Study. Journal of Science Communication 8, 4 (2009).","paperID":"None"},{"content":"Edward R. Tufte. 1983. The Visual Display of Quantitative Information. Graphics Press, Cheshire, CT.","paperID":"None"},{"content":"Bret Victor. 2011. Scientific Communication As Sequential Art. http://worrydream.com/#!/ScientificCommunicationAsSequentialArt. (2011). online, last accessed Sept., 24, 2015.","paperID":"None"},{"content":"T. von Landesberger, A. Kuijper, T. Schreck, J. Kohlhammer, J.J. van Wijk, J.-D. Fekete, and D.W. Fellner. 2011. Visual Analysis of Large Graphs: State-of-the-Art and Future Research Challenges. Computer Graphics Forum 30, 6 (April 2011), 1719-1749. DOI: http://dx.doi.org/10.1111/j.1467--8659.2011.01898.x","paperID":"None"},{"content":"Ji Soo Yi, Niklas Elmqvist, and Seungyoon Lee. 2010. TimeMatrix: Analyzing Temporal Social Networks Using Interactive Matrix-Based Visualizations. International Journal of Human-Computer Interaction 26, 11--12 (nov 2010), 1031-1051. DOI: http://dx.doi.org/10.1080/10447318.2010.516722","paperID":"None"},{"content":"Z. Zhao, R. Marr, and N. Elmqvist. 2015. Data Comics: Sequential Art for Data-Driven Storytelling. Technical Report. Human Computer Interaction Lab, University of Maryland.","paperID":"None"}],"abstract":"In this paper, we explore graph comics as a medium to communicate changes in dynamic networks. While previous re- search has focused on visualizing dynamic networks for data exploration, we want to see if we can take advantage of the visual expressiveness and familiarity of comics to present and explain temporal changes in networks to an audience. To understand the potential of comics as a storytelling medium, we first created a variety of comics during a 3 month structured design process, involving domain experts from public education and neuroscience. This process led to the definition of 8 design factors for creating graph comics and propose design solutions for each. Results from a qualitative study suggest that a general audience is quickly able understand complex temporal changes through graph comics, provided with minimal textual annotations and no training.","title":"Telling Stories about Dynamic Networks with Graph Comics","filename":"CHI16/p3670","authors":["Benjamin Bach","Natalie Kerracher","Kyle Wm. Hall","Sheelagh Carpendale","Jessie Kennedy","Nathalie Henry Riche"],"conference":"CHI '16"}