{"paperId":2858233,"citation":[],"reference":[{"content":"Shiri Azenkot and Shumin Zhai. 2012. Touch behavior with different postures on soft smartphone keyboards. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services. ACM, 251-260.","paperID":"None"},{"content":"Russell LC Butsch. 1932. Eye movements and the eye-hand span in typewriting. Journal of Educational Psychology 23, 2 (1932), 104-121.","paperID":"None"},{"content":"Stuart K Card, Allen Newell, and Thomas P Moran. 1983. The psychology of human-computer interaction. (1983).","paperID":"None"},{"content":"John E Coover. 1923. A method of teaching typewriting based on a psychological analysis of expert typing. In National Education Association Addresses and Proceedings, Vol. 61. 561-567.","paperID":"None"},{"content":"August Dvorak and others. 1936. Typewriting behavior; psychology applied to teaching and learning typewriting. (1936).","paperID":"None"},{"content":"Paul Fendrick. 1937. Hierarchical skills in typewriting. Journal of Educational Psychology 28, 8 (1937), 609-620.","paperID":"None"},{"content":"Donald R. Gentner. 1983. Keystroke Timing in Transcription Typing. In Cognitive Aspects of Skilled Typewriting, William E. Cooper (Ed.). Springer NY, 95-120.","paperID":"None"},{"content":"Donald R Gentner. 1988. Expertise in typewriting. The Nature of EExpertise (1988), 1-21.","paperID":"None"},{"content":"Donald R Gentner, Serge Larochelle, and Jonathan Grudin. 1988. Lexical, sublexical, and peripheral effects in skilled typewriting. Cognitive Psychology 20, 4 (1988), 524-548.","paperID":"None"},{"content":"Werner Goebl and Caroline Palmer. 2013. Temporal control and hand movement efficiency in skilled music performance. PloS one 8, 1 (2013), e50901.","paperID":"None"},{"content":"Mayank Goel, Alex Jansen, Travis Mandel, Shwetak N Patel, and Jacob O Wobbrock. 2013. ContextType: using hand posture information to improve mobile touch screen text entry. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 2795-2798.","paperID":"None"},{"content":"Joachim Grabowski. 2008. The internal structure of university students' keyboard skills. Journal of writing research 1, 1 (2008), 27-52.","paperID":"None"},{"content":"Jonathan Grudin. 1983. Non-hierarchic specification of components in transcription typewriting. Acta psychologica 54, 1 (1983), 249-262.","paperID":"None"},{"content":"Yuzuru Hiraga, Yoshihiko Ono, and others. 1980. An analysis of the standard English keyboard. In Proceedings of the 8th Conference on Computational Linguistics. Association for Computational Linguistics, 242-248.","paperID":"None"},{"content":"Bonnie E John. 1996. TYPIST: A theory of performance in skilled typing. Human-Computer Interaction 11, 4 (1996), 321-355.","paperID":"None"},{"content":"Stephen C Johnson. 1967. Hierarchical clustering schemes. Psychometrika 32, 3 (1967), 241-254.","paperID":"None"},{"content":"Nina Keith and K Anders Ericsson. 2007. A deliberate practice account of typing proficiency in everyday typists. Journal of Experimental Psychology: Applied 13, 3 (2007), 135.","paperID":"None"},{"content":"Yili Liu, Robert Feyen, and Omer Tsimhoni. 2006. Queueing Network-Model Human Processor (QN-MHP): A computational architecture for multitask performance in human-machine systems. ACM Transactions on Computer-Human Interaction (TOCHI) 13, 1 (2006), 37-70.","paperID":"None"},{"content":"Cheryl D Metcalf, Thomas A Irvine, Jennifer L Sims, Yu L Wang, Alvin WY Su, and David O Norris. 2014. Complex hand dexterity: a review of biomechanical methods for measuring musical performance. Frontiers in psychology 5 (2014).","paperID":"None"},{"content":"Josip Musi'c and Roderick Murray-Smith. 2015. Nomadic Input on Mobile Devices: the Influence of Touch Input Technique and Walking Speed on Performance and Offset Modeling. Human-Computer Interaction (2015).","paperID":"None"},{"content":"OptiTrack. 2015. Motive:Body.Production Motion Capture Software. (2015). http://www.optitrack.com/products/motive/body/","paperID":"None"},{"content":"David E Rumelhart and Donald A Norman. 1982. Simulating a skilled typist: A study of skilled cognitive-motor performance. Cognitive Science 6, 1 (1982), 1-36.","paperID":"None"},{"content":"Timothy A Salthouse. 1984. Effects of age and skill in typing. Journal of Experimental Psychology: General 113, 3 (1984), 345-371.","paperID":"None"},{"content":"Timothy A Salthouse. 1986. Perceptual, cognitive, and motoric aspects of transcription typing. Psychological bulletin 99, 3 (1986), 303-319.","paperID":"None"},{"content":"Mark A Schmuckler and Elizabeth L Bosman. 1997. Interkey timing in piano performance and typing. Canadian Journal of Experimental Psychology 51, 2 (1997), 99.","paperID":"None"},{"content":"Walter Schneider. 1985. Training high-performance skills: Fallacies and guidelines. Human Factors 27, 3 (1985), 285-300.","paperID":"None"},{"content":"LH Shaffer. 1975. Control processes in typing. The Quarterly Journal of Experimental Psychology 27, 3 (1975), 419-432.","paperID":"None"},{"content":"LH Shaffer. 1978. Timing in the motor programming of typing. The Quarterly Journal of Experimental Psychology 30, 2 (1978), 333-345.","paperID":"None"},{"content":"LH Shaffer and J Hardwick. 1968. Typing performance as a function of text. The Quarterly Journal of Experimental Psychology 20, 4 (1968), 360-369.","paperID":"None"},{"content":"CA Terzuolo and P Viviani. 1980. Determinants and characteristics of motor patterns used for typing. Neuroscience 5, 6 (1980), 1085-1103.","paperID":"None"},{"content":"Paul D Varcholik, Joseph J LaViola, and Charles E Hughes. 2012. Establishing a baseline for text entry for a multi-touch virtual keyboard. International Journal of Human-Computer Studies 70, 10 (2012), 657-672.","paperID":"None"},{"content":"Keith Vertanen and Per Ola Kristensson. 2011. A Versatile Dataset for Text Entry Evaluations Based on Genuine Mobile Emails. In MobileHCI '11: Proceedings of the 13th International Conference on Human-Computer Interaction with Mobile Devices and Services. 295-298.","paperID":"None"},{"content":"Joe H Ward Jr. 1963. Hierarchical grouping to optimize an objective function. Journal of the American statistical association 58, 301 (1963), 236-244.","paperID":"None"},{"content":"Changxu Wu and Yili Liu. 2008. Queuing network modeling of transcription typing. ACM Transactions on Computer-Human Interaction (TOCHI) 15, 1 (2008), 6.","paperID":"None"},{"content":"Eldad Yechiam, Ido Erev, Vered Yehene, and Daniel Gopher. 2003. Melioration and the transition from touch-typing training to everyday use. Human Factors: The Journal of the Human Factors and Ergonomics Society 45, 4 (2003), 671-684.","paperID":"None"},{"content":"Ying Yin, Tom Yu Ouyang, Kurt Partridge, and Shumin Zhai. 2013. Making touchscreen keyboards adaptive to keys, hand postures, and individuals: a hierarchical spatial backoff model approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2775-2784.","paperID":"None"}],"abstract":"This paper revisits the present understanding of typing, which originates mostly from studies of trained typists using the ten-finger touch typing system. Our goal is to characterise the majority of present-day users who are untrained and employ diverse, self-taught techniques. In a transcription task, we compare self-taught typists and those that took a touch typing course. We report several differences in performance, gaze deployment and movement strategies. The most surprising finding is that self-taught typists can achieve performance levels comparable with touch typists, even when using fewer fingers. Motion capture data exposes 3 predictors of high performance: 1) unambiguous mapping (a letter is consistently pressed by the same finger), 2) active preparation of upcoming keystrokes, and 3) minimal global hand motion. We release an extensive dataset on everyday typing behavior.","title":"How We Type: Movement Strategies and Performance in Everyday Typing","filename":"CHI16/p4262","authors":["Anna Maria Feit","Daryl Weir","Antti Oulasvirta"],"conference":"CHI '16"}