{"paperId":2858183,"citation":[],"abstract":"Shape-changing interfaces allow designers to create user interfaces that physically change shape. However, presently, we lack studies of how such interfaces are designed, as well as what high-level strategies, such as metaphors and affordances, designers use. This paper presents an analysis of sketches made by 21 participants designing either a shape-changing radio or a shape-changing mobile phone. The results exhibit a range of interesting design elements, and the analysis points to a need to further develop or revise existing vocabularies for sketching and analyzing movement. The sketches show a prevalent use of metaphors, say, for communicating volume though big-is-on and small-is-off, as well as a lack of conventions. Furthermore, the affordances used were curiously asymmetrical compared to those offered by non-shape-changing interfaces. We conclude by offering implications on how our results can influence future research on shape-changing interfaces.","reference":[{"content":"Pippin Barr, Robert Biddle, and James Noble. 2002. A Taxonomy of User-interface Metaphors. In Proc. CHINZ'02 Symposium on Computer-Human Interaction, ACM, New York, NY, USA, 25--30. http://doi.org/10.1145/2181216.2181221","paperID":"None"},{"content":"Tua A. Björklund. 2013. Initial mental representations of design problems: Differences between experts and novices. Design Studies 34, 2: 135--160. http://doi.org/10.1016/j.destud.2012.08.005","paperID":"None"},{"content":"Alan F. Blackwell. 2006. The Reification of Metaphor As a Design Tool. ACM Trans. Comput.-Hum. Interact. 13, 4: 490--530. http://doi.org/10.1145/1188816.1188820","paperID":"None"},{"content":"Charles M Eastman, W Michael McCraken, and Wendy C Newstetter (ed.). Design Cognition: results from protocol and other empirical studies of design activity. In Design Knowing and Learning: Cognition in Design Education. 79--103.","paperID":"None"},{"content":"Marcelo Coelho. 2007. Programming the Material World: A Proposition for the Application and Design of Transitive Materials. In Proc. UbiComp'07 International Conference on Ubiquitous Computing (UbiComp), ACM, New York, NY, USA.","paperID":"None"},{"content":"Marcelo Coelho and Jamie Zigelbaum. 2011. Shapechanging Interfaces. Personal Ubiquitous Comput. 15, 2: 161--173. http://doi.org/10.1007/s00779-010-0311-y","paperID":"None"},{"content":"Alan Cooper, Robert Reimann, David Cronin, and Christopher Noessel. 2014. About Face: The Essentials of Interaction Design. John Wiley & Sons.","paperID":"None"},{"content":"Nathan Crilly. 2015. Fixation and creativity in concept development: The attitudes and practices of expert designers. Design Studies 38: 54--91. http://doi.org/10.1016/j.destud.2015.01.002","paperID":"None"},{"content":"Nigel Cross. 2007. Designerly Ways of Knowing. Springer Science & Business Media.","paperID":"None"},{"content":"Jessica Q. Dawson, Oliver S. Schneider, Joel Ferstay, et al. 2013. It's Alive! Exploring the Design Space of a Gesturing Phone. Proc GI 2013, 205--2012","paperID":"None"},{"content":"Panteleimon Dimitriadis and Jason Alexander. 2014. Evaluating the Effectiveness of Physical Shape-change for In-pocket Mobile Device Notifications. In Proc. CHI'14 Conference on Human Factors in Computing Systems, ACM, New York, NY, USA, 2589--2592. http://doi.org/10.1145/2556288.2557164","paperID":"None"},{"content":"Kenneth P. Fishkin. 2004. A taxonomy for and analysis of tangible interfaces. Personal and Ubiquitous Computing 8, 5: 347--358. http://doi.org/10.1007/s00779-004-0297--4","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Nadia Cheng, and Hiroshi Ishii. 2012. Jamming user interfaces: programmable particle stiffness and sensing for malleable and shape-changing devices. In Proc. UIST'12 Symposium on User interface software and technology, 519--528. Retrieved from http://dl.acm.org/citation.cfm?id=2380181","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic Physical Affordances and Constraints Through Shape and Object Actuation. Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology, ACM, 417--426. http://doi.org/10.1145/2501988.2502032","paperID":"None"},{"content":"James J. Gibson. 1977. The Theory of Affordances. In Perceiving, Acting, and Knowing, Robert Shaw and John Bransford (eds.).","paperID":"None"},{"content":"Antonio Gomes, Andrea Nesbitt, and Roel Vertegaal. 2013. MorePhone: An Actuated Shape Changing Flexible Smartphone. In Proc. CHI '13 Extended Abstracts on Human Factors in Computing Systems, ACM, New York, NY, USA, 2879--2880. http://doi.org/10.1145/2468356.2479558","paperID":"None"},{"content":"Erik Grönvall, Sofie Kinch, Marianne Graves Petersen, and Majken K. Rasmussen. 2014. Causing Commotion with a Shape-changing Bench: Experiencing Shapechanging Interfaces in Use. In Proc. CHI'14 Conference on Human Factors in Computing Systems, ACM, New York, NY, USA, 2559--2568. http://doi.org/10.1145/2556288.2557360","paperID":"None"},{"content":"M.G. Grünbaum and J.G. Simonsen. 2015. The Affordances of Broken Affordances. INTERACT '15, 185--202.","paperID":"None"},{"content":"Paul Hekkert and Nazlı Cila. 2015. Handle with care! Why and how designers make use of product metaphors. Design Studies 40: 196--217. http://doi.org/10.1016/j.destud.2015.06.007","paperID":"None"},{"content":"Fabian Hemmert, Matthias Löwe, Anne Wohlauf, and Gesche Joost. 2013. Animate mobiles: proxemically reactive posture actuation as a means of relational interaction with mobile phones. Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction, ACM, 267--270. http://doi.org/10.1145/2460625.2460669","paperID":"None"},{"content":"Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical atoms: beyond tangible bits, toward transformable materials. Interactions 19, 1: 38--51. http://doi.org/10.1145/2065327.2065337","paperID":"None"},{"content":"Nadine Jarvis, David Cameron, and Andy Boucher. 2012. Attention to Detail: Annotations of a Design Process. Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, ACM, 11--20. http://doi.org/10.1145/2399016.2399019","paperID":"None"},{"content":"Heekyoung Jung, Youngsuk L. Altieri, and Jeffrey Bardzell. 2010. Computational objects and expressive forms: a design exploration. Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems, ACM, 3433--3438. http://doi.org/10.1145/1753846.1753997","paperID":"None"},{"content":"Victor Kaptelinin and Bonnie Nardi. 2012. Affordances in HCI: Towards a Mediated Action Perspective. In Proc. CHI'12 Conference on Human Factors in Computing Systems, ACM, New York, NY, USA, 967--976.","paperID":"None"},{"content":"Yuichiro Katsumoto, Satoru Tokuhisa, and Masa Inakage. 2013. Ninja track: design of electronic toy variable in shape and flexibility. In Proc. TEI'13 International Conference on Tangible, Embedded and Embodied Interaction, ACM, New York, NY, USA, 17--24. http://doi.org/10.1145/2460625.2460628","paperID":"None"},{"content":"Kazuki Kobayashi and Seiji Yamada. 2013. Shape Changing Device for Notification. In Proc. UIST'13 Symposium on User Interface Software and Technology, ACM, New York, NY, USA, 71--72. http://doi.org/10.1145/2508468.2514715","paperID":"None"},{"content":"Matthijs Kwak, Kasper Hornbaek, Panos Markopoulos, and Miguel Bruns Alonso. 2014. The Design Space of Shape-changing Interfaces: A Repertory Grid Study. In Proc. DIS'14 Conference on Designing Interactive Systems, ACM, New York, NY, USA, 181--190. http://doi.org/10.1145/2598510.2598573","paperID":"None"},{"content":"David Lakatos and Hiroshi Ishii. 2012. Towards Radical Atoms - Form-giving to transformable materials. 2012 IEEE 3rd International Conference on Cognitive Infocommunications (CogInfoCom), 37--40. http://doi.org/10.1109/CogInfoCom.2012.6422023","paperID":"None"},{"content":"George Lakoff and Mark Johnson. 2008. Metaphors We Live By. University of Chicago Press.","paperID":"None"},{"content":"Daniel Leithinger, Sean Follmer, Alex Olwal, et al. 2013. Sublimate: State-changing Virtual and Physical Rendering to Augment Interaction with Shape Displays. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1441--1450. http://doi.org/10.1145/2470654.2466191","paperID":"None"},{"content":"Andrés Lucero. 2012. Framing, Aligning, Paradoxing, Abstracting, and Directing: How Design Mood Boards Work. Proceedings of the Designing Interactive Systems Conference, ACM, 438--447. http://doi.org/10.1145/2317956.2318021","paperID":"None"},{"content":"Tara Matthews, Tejinder Judge, and Steve Whittaker. 2012. How Do Designers and User Experience Professionals Actually Perceive and Use Personas? Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1219--1228. http://doi.org/10.1145/2207676.2208573","paperID":"None"},{"content":"Ryuma Niiyama, Lining Yao, and Hiroshi Ishii. 2013. Weight and Volume Changing Device with Liquid Metal Transfer. In Proc. TEI'14 International Conference on Tangible, Embedded and Embodied Interaction, ACM, New York, NY, USA, 49--52. http://doi.org/10.1145/2540930.2540953","paperID":"None"},{"content":"Mie Nørgaard, Tim Merritt, Majken Kirkegaard Rasmussen, and Marianne Graves Petersen. 2013. Exploring the Design Space of Shape-changing Objects: Imagined Physics. Proceedings of the 6th International Conference on Designing Pleasurable Products and Interfaces, ACM, 251--260. http://doi.org/10.1145/2513506.2513533","paperID":"None"},{"content":"Donald A. Norman. 1988. The Psychology of Everyday Things. Basic Books.","paperID":"None"},{"content":"Donald A. Norman. 1999. Affordance, Conventions, and Design. Interactions 6, 38--43.","paperID":"None"},{"content":"Jifei Ou, Lining Yao, Daniel Tauber, Jürgen Steimle, Ryuma Niiyama, and Hiroshi Ishii. 2013. jamSheets: Thin Interfaces with Tunable Stiffness Enabled by Layer Jamming. In Proc. TEI'14 International Conference on Tangible, Embedded and Embodied Interaction, ACM, New York, NY, USA, 65--72. http://doi.org/10.1145/2540930.2540971","paperID":"None"},{"content":"Amanda Parkes and Hiroshi Ishii. 2009. Kinetic Sketchup: Motion Prototyping in the Tangible Design Process. Proceedings of the 3rd International Conference on Tangible and Embedded Interaction, ACM, 367--372. http://doi.org/10.1145/1517664.1517738","paperID":"None"},{"content":"Young-Woo Park, Joohee Park, and Tek-Jin Nam. 2015. The Trial of Bendi in a Coffeehouse: Use of a Shape-Changing Device for a Tactile-Visual Phone Conversation. In Proc. CHI'15 Conference on Human Factors in Computing Systems, ACM, New York, NY, USA, 2181--2190. http://doi.org/10.1145/2702123.2702326","paperID":"None"},{"content":"Esben W. Pedersen, Sriram Subramanian, and Kasper Hornbæk. 2014. Is My Phone Alive?: A Large-scale Study of Shape Change in Handheld Devices Using Videos. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2579--2588. http://doi.org/10.1145/2556288.2557018","paperID":"None"},{"content":"Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shapechanging interfaces: a review of the design space and open research questions. CHI '12, ACM, 735--744. http://doi.org/10.1145/2207676.2207781","paperID":"None"},{"content":"Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: Toward High \"Shape Resolution\" in Self-actuated Flexible Mobile Devices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 593--602. http://doi.org/10.1145/2470654.2470738","paperID":"None"},{"content":"Corina Sas, Steve Whittaker, Steven Dow, Jodi Forlizzi, and John Zimmerman. 2014. Generating Implications for Design Through Design Research. Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1971--1980. http://doi.org/10.1145/2556288.2557357","paperID":"None"},{"content":"Anna Ståhl and Kristina Höök. 2008. Reflecting on the Design Process of the Affective Diary. Proceedings of the 5th Nordic Conference on Human-computer Interaction: Building Bridges, ACM, 559--564. http://doi.org/10.1145/1463160.1463245","paperID":"None"},{"content":"Martin K. Stacey, Claudia M. Eckert, and Jeanette McFadzean. Sketch interpretation in design communication. Retrieved September 24, 2015 from http://www.researchgate.net/profile/Claudia_Eckert2/p ublication/228540405_Sketch_interpretation_in_desig n_communication/links/00b7d52c186c45eede000000.p df","paperID":"None"},{"content":"Dhaval Vyas, Wim Poelman, Anton Nijholt, and Arnout De Bruijn. 2012. Smart material interfaces: a new form of physical interaction. Proceedings of the 2012 ACM annual conference extended abstracts on Human Factors in Computing Systems Extended Abstracts, ACM, 1721--1726. http://doi.org/10.1145/2223656.2223699","paperID":"None"},{"content":"Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: pneumatically actuated soft composite materials for shape changing interfaces. Proceedings of the 26th annual ACM symposium on User interface software and technology, ACM, 13--22. http://doi.org/10.1145/2501988.2502037","paperID":"None"},{"content":"Jamie Zigelbaum, Angela Chang, James Gouldstone, Joshua Jen Monzen, and Hiroshi Ishii. 2008. SpeakCup: Simplicity, BABL, and Shape Change. Proceedings of the 2nd international conference on Tangible and embedded interaction - TEI '08, 145--146. http://doi.org/10.1145/1347390.1347422","paperID":"None"},{"content":"John Zimmerman, Erik Stolterman, and Jodi Forlizzi. 2010. An Analysis and Critique of Research Through Design: Towards a Formalization of a Research Approach. Proceedings of the 8th ACM Conference on Designing Interactive Systems, ACM, 310--319. http://doi.org/10.1145/1858171.1858228","paperID":"None"}],"title":"Sketching Shape-changing Interfaces: Exploring Vocabulary, Metaphors Use, and Affordances","filename":"CHI16/p2740","authors":["Majken K. Rasmussen","Giovanni M. Troiano","Marianne G. Petersen","Jakob G. Simonsen","Kasper Hornbæk"],"conference":"CHI '16"}