{"paperId":2858362,"citation":[],"reference":[{"content":"Chris Anderson. 2010. The new industrial revolution. Wired magazine18 2 (2010).","paperID":"None"},{"content":"Esther M Arkin, Michael A Bender, Erik D Demaine, Martin L Demaine, Joseph SB Mitchell, Saurabh Sethia, and Steven S Skiena. 2004. When can you fold a map? Computational Geometry 29, 1 (2004), 23--46.","paperID":"None"},{"content":"Marco Attene, Sagi Katz, Michela Mortara, Giuseppe Patane, Michela Spagnuolo, and Ayellet Tal. 2006. Mesh segmentation-a comparative study. In Shape Modeling and Applications, 2006. SMI 2006. IEEE International Conference on. IEEE, 7--7.","paperID":"None"},{"content":"Autodesk. 2014. Autodesk 123D Make. (2014). Retrieved September 17, 2015 from http://www.123dapp.com/make.","paperID":"None"},{"content":"Moritz Bacher, Bernd Bickel, Doug L. James, and Hanspeter Pfister. 2012. Fabricating Articulated Characters from Skinned Meshes. ACM Trans. Graph. 31, 4, Article 47 (July 2012), 9 pages.","paperID":"None"},{"content":"James Barron. 2015. New Inductees at Toy Hall of Fame Join the Ball, the Box and the Barbie Doll. NY Times (2015), Page A18.","paperID":"None"},{"content":"Steven Brown, Bryan Morse, and William Barrett. 2009. Interactive part selection for mesh and point models using hierarchical graph-cut partitioning. Canadian Information Processing Society.","paperID":"None"},{"content":"David Cohen-Steiner, Pierre Alliez, and Mathieu Desbrun. 2004. Variational shape approximation. ACM Transactions on Graphics (TOG) 23, 3 (2004), 905--914.","paperID":"None"},{"content":"Stelian Coros, Bernhard Thomaszewski, Gioacchino Noris, Shinjiro Sueda, Moira Forberg, Robert W. Sumner, Wojciech Matusik, and Bernd Bickel. 2013. Computational Design of Mechanical Characters. ACM Trans. Graph. 32, 4, Article 83 (July 2013), 12 pages.","paperID":"None"},{"content":"E Demaine and Tomohiro Tachi. 2010. Origamizer: A practical algorithm for folding any polyhedron. (2010).","paperID":"None"},{"content":"Erik D Demaine, Martin L Demaine, and Joseph SB Mitchell. 1999. Folding flat silhouettes and wrapping polyhedral packages: New results in computational origami. In Proceedings of the fifteenth annual symposium on Computational geometry. ACM, 105--114.","paperID":"None"},{"content":"M. P. do Carmo. 1976. Differential Geometry of Curves and Surfaces. Prentice-Hall, Englewood Cliffs, NJ.","paperID":"None"},{"content":"Flatfab. 2014. Flatfab. (2014). Retrieved September 17, 2015 from http://www.flatfab.com.","paperID":"None"},{"content":"Wei Gao, Yunbo Zhang, Diogo C. Nazzetta, Karthik Ramani, and Raymond J. Cipra. 2015a. RevoMaker: Enabling Multi-directional and Functionally-embedded 3D Printing Using a Rotational Cuboidal Platform. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 437--446.","paperID":"None"},{"content":"Wei Gao, Yunbo Zhang, Devarajan Ramanujan, Karthik Ramani, Yong Chen, Christopher B. Williams, Charlie C.L. Wang, Yung C. Shin, Song Zhang, and Pablo D. Zavattieri. 2015b. The status, challenges, and future of additive manufacturing in engineering. Computer-Aided Design 69 (2015), 65--89.","paperID":"None"},{"content":"Steven Gray, Nathan Zeichner, Vijay Kumar, and Mark Yim. 2011. A Simulator for Origami-Inspired Self-Reconfigurable Robots. In Origami 5: Fifth International Meeting of Origami Science, Mathematics, and Education. CRC Press, 323.","paperID":"None"},{"content":"Kristian Hildebrand, Bernd Bickel, and Marc Alexa. 2012. crdbrd: Shape fabrication by sliding planar slices. In Computer Graphics Forum, Vol. 31. Wiley Online Library, 583--592.","paperID":"None"},{"content":"Dennis Hine. 1999. Cartons and cartoning. Pira International.","paperID":"None"},{"content":"Margaret Honey and David E Kanter. 2013. Design, make, play: Growing the next generation of STEM innovators. Routledge.","paperID":"None"},{"content":"Pu Huang, Charlie CL Wang, and Yong Chen. 2013. Intersection-free and topologically faithful slicing of implicit solid. Journal of Computing and Information Science in Engineering 13, 2 (2013), 021009.","paperID":"None"},{"content":"Scott E Hudson and Jennifer Mankoff. 2006. Rapid construction of functioning physical interfaces from cardboard, thumbtacks, tin foil and masking tape. In Proceedings of the 19th annual ACM symposium on User interface software and technology. ACM, 289--298.","paperID":"None"},{"content":"Dan Julius, Vladislav Kraevoy, and Alla Sheffer. 2005. D-Charts: Quasi-Developable Mesh Segmentation. In Computer Graphics Forum, Vol. 24. Wiley Online Library, 581--590.","paperID":"None"},{"content":"Squid Labs. 2005. Instructables. (2005). Retrieved September 17, 2015 from http://www.instructables.com.","paperID":"None"},{"content":"Robert J Lang. 1998. Threemaker 4.0: A Program for Origami Design. (1998).","paperID":"None"},{"content":"Manfred Lau, Akira Ohgawara, Jun Mitani, and Takeo Igarashi. 2011. Converting 3D furniture models to fabricatable parts and connectors. In ACM Transactions on Graphics (TOG), Vol. 30. ACM, 85.","paperID":"None"},{"content":"Xian-Ying Li, Chao-Hui Shen, Shi-Sheng Huang, Tao Ju, and Shi-Min Hu. 2010. Popup: automatic paper architectures from 3D models. ACM Transactions on Graphics-TOG 29, 4 (2010), 111.","paperID":"None"},{"content":"Robot Living. 2007. Robot Living. (2007). Retrieved September 17, 2015 from http://www.robotliving.com.","paperID":"None"},{"content":"Kui-Yip Lo, Chi-Wing Fu, and Hongwei Li. 2009. 3D polyomino puzzle. ACM Transactions on Graphics (TOG) 28, 5 (2009), 157.","paperID":"None"},{"content":"Tama Software Ltd. 2014. Pepakura Designer. (2014). Retrieved September 17, 2015 from http://www.tamasoft.co.jp/pepakura-en.","paperID":"None"},{"content":"James McCrae, Karan Singh, and Niloy J Mitra. 2011. Slices: a shape-proxy based on planar sections. ACM Trans. Graph. 30, 6 (2011), 168.","paperID":"None"},{"content":"Vittorio Megaro, Bernhard Thomaszewski, Damien Gauge, Eitan Grinspun, Stelian Coros, and Markus Gross. 2014. ChaCra: An Interactive Design System for Rapid Character Crafting. In Proceedings of the ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA '14). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 123--130.","paperID":"None"},{"content":"Jun Mitani and Hiromasa Suzuki. 2004. Making papercraft toys from meshes using strip-based approximate unfolding. In ACM Transactions on Graphics (TOG), Vol. 23. ACM, 259--263.","paperID":"None"},{"content":"Hyunjoo Oh, Mark D. Gross, and Michael Eisenberg. 2015. FoldMecha: Design for Linkage-Based Paper Toys. In Adjunct Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15 Adjunct). ACM, NY, NY, USA, 91--92.","paperID":"None"},{"content":"Kylie Peppler. 2013. STEAM-powered computing education: Using e-textiles to integrate the arts and STEM. Computer 9 (2013), 38--43.","paperID":"None"},{"content":"Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice, and Bjorn Hartmann. 2014. A Series of Tubes: Adding Interactivity to 3D Prints Using Internal Pipes. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 3--12.","paperID":"None"},{"content":"Yuliy Schwartzburg and Mark Pauly. 2013. Fabrication-aware Design with Intersecting Planar Pieces. In Computer Graphics Forum, Vol. 32. Wiley Online Library, 317--326.","paperID":"None"},{"content":"Idan Shatz, Ayellet Tal, and George Leifman. 2006. Paper craft models from meshes. The Visual Computer 22, 9--11 (2006), 825--834.","paperID":"None"},{"content":"Alla Sheffer, Emil Praun, and Kenneth Rose. 2006. Mesh parameterization methods and their applications. Foundations and Trends® in Computer Graphics and Vision 2, 2 (2006), 105--171.","paperID":"None"},{"content":"Softonic. 2015. Paper Folding 3D. (2015). Retrieved September 17, 2015 from http://origami-windows-8.en.softonic.com/download?ex=SWH-1608.5.","paperID":"None"},{"content":"Milan Sonka, Vaclav Hlavac, and Roger Boyle. 2014. Image processing, analysis, and machine vision. Cengage Learning.","paperID":"None"},{"content":"NGSS Lead States. 2013. Next Generation Science Standards: For States, By States. (2013).","paperID":"None"},{"content":"North Shore-LIJ Health System. 2015. Paper Airplane Factory. (2015). Retrieved September 17, 2015 from http://www.ihi.org/education/ihiopenschool/resources/Pages/Activities/PaperAirplaneFactory.aspx.","paperID":"None"},{"content":"Shigeo Takahashi, Hsiang-Yun Wu, Seow Hui Saw, Chun-Cheng Lin, and Hsu-Chun Yen. 2011. Optimized topological surgery for unfolding 3D meshes. In Computer Graphics Forum, Vol. 30. Wiley Online Library, 2077--2086.","paperID":"None"},{"content":"Diana Twede and Ron Goddard. 1998. Packaging materials. Pira International Leatherhead.","paperID":"None"},{"content":"Kevin Chun-Ho Wong, Tommy Yu-Hang Siu, Pheng-Ann Heng, and Hanqiu Sun. 1998. Interactive volume cutting. In Graphics Interface, Vol. 98.","paperID":"None"},{"content":"Huai-Yu Wu, Chunhong Pan, Jia Pan, Qing Yang, and Songde Ma. 2007. A sketch-based interactive framework for real-time mesh segmentation. In Computer graphics international.","paperID":"None"},{"content":"Shiqing Xin, Chi-Fu Lai, Chi-Wing Fu, Tien-Tsin Wong, Ying He, and Daniel Cohen-Or. 2011. Making burr puzzles from 3D models. ACM Transactions on Graphics (TOG) 30, 4 (2011), 97.","paperID":"None"},{"content":"Sang Ho Yoon, Ansh Verma, Kylie Peppler, and Karthik Ramani. 2015. HandiMate: Exploring a Modular Robotics Kit for Animating Crafted Toys. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC '15). ACM, NY, NY, USA, 11--20.","paperID":"None"},{"content":"Juyong Zhang, Chunlin Wu, Jianfei Cai, Jianmin Zheng, and Xue-cheng Tai. 2010. Mesh snapping: Robust interactive mesh cutting using fast geodesic curvature flow. In Computer Graphics Forum, Vol. 29. Wiley Online Library, 517--526.","paperID":"None"},{"content":"Youyi Zheng, Chiew-Lan Tai, and Oscar Kin-Chung Au. 2012. Dot scissor: a single-click interface for mesh segmentation. Visualization and Computer Graphics, IEEE Transactions on 18, 8 (2012), 1304--1312.","paperID":"None"}],"abstract":"Computer-aided design of flat patterns allows designers to prototype foldable 3D objects made of heterogeneous sheets of material. We found origami designs are often characterized by pre-synthesized patterns and automated algorithms. Furthermore, augmenting articulated features to a desired model requires time-consuming synthesis of interconnected joints. This paper presents CardBoardiZer, a rapid cardboard based prototyping platform that allows everyday sculptural 3D models to be easily customized, articulated and folded. We develop a building platform to allow the designer to 1) import a desired 3D shape, 2) customize articulated partitions into planar or volumetric foldable patterns, and 3) define rotational movements between partitions. The system unfolds the model into 2D crease-cut-slot patterns ready for die-cutting and folding. In this paper, we developed interactive algorithms and validated the usability of CardBoardiZer using various 3D models. Furthermore, comparisons between CardBoardiZer and methods of Autodesk® 123D Make, demonstrated significantly shorter time-to-prototype and ease of fabrication.","title":"CardBoardiZer: Creatively Customize, Articulate and Fold 3D Mesh Models","filename":"CHI16/p897","authors":["Yunbo Zhang","Wei Gao","Luis Paredes","Karthik Ramani"],"conference":"CHI '16"}