{"paperId":2858434,"citation":[],"reference":[{"content":"Mike Ananny. 2016. Toward an Ethics of Algorithms Convening, Observation, Probability, and Timeliness. Science, Technology & Human Values, 41 (1). 93--117. DOI: 10.1177/0162243915606523","paperID":"None"},{"content":"Paul M Aoki, RJ Honicky, Alan Mainwaring, Chris Myers, Eric Paulos, Sushmita Subramanian and Allison Woodruff. 2009. A vehicle for research: using street sweepers to explore the landscape of environmental community action. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 375--384. DOI: 10.1145/1518701.1518762","paperID":"None"},{"content":"Ralf Birken, Gunar Schirner and Ming Wang. 2012. VOTERS: design of a mobile multi-modal multi-sensor system. in Proceedings of the Sixth International Workshop on Knowledge Discovery from Sensor Data, ACM, 8--15. DOI: 10.1145/2350182.2350183","paperID":"None"},{"content":"Jeremy P Birnholtz and Matthew J Bietz. 2003. Data at work: supporting sharing in science and engineering. in Proceedings of the 2003 international ACM SIGGROUP conference on Supporting group work, ACM, 339--348. DOI: 10.1145/958160.958215","paperID":"None"},{"content":"Peter M Blau. 1969. The dynamics of bureaucracy: A study of interpersonal relations in two government agencies. University of Chicago Press Chicago, IL.","paperID":"None"},{"content":"Jan Blom, Divya Viswanathan, Mirjana Spasojevic, Janet Go, Karthik Acharya and Robert Ahonius. 2010. Fear and the city: role of mobile services in harnessing safety and security in urban use contexts. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1841--1850. DOI: 10.1145/1753326.1753602","paperID":"None"},{"content":"Morten Bohøj, Nikolaj Gandrup Borchorst, Niels Olof Bouvin, Susanne Bødker and Pär-Ola Zander. 2010. Timeline collaboration. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 523--532. DOI: 10.1145/1753326.1753404","paperID":"None"},{"content":"Nikolaj Gandrup Borchorst, Susanne Bødker and PärOla Zander. 2009. The boundaries of participatory citizenship. in ECSCW 2009, Springer, 1--20.","paperID":"None"},{"content":"John Bowers, Graham Button and Wes Sharrock. 1995. Workflow from within and without: technology and cooperative work on the print industry shopfloor. in Proceedings of the Fourth European Conference on Computer-Supported Cooperative Work ECSCW'95, Springer, 51--66. DOI: 10.1007/978--94-011-0349--7_4","paperID":"None"},{"content":"Geoffrey C Bowker. 2005. Memory practices in the sciences. MIT Press Cambridge, MA.","paperID":"None"},{"content":"Geoffrey Bowker and Susan Leigh Star. 1999. Sorting things out. Classification and its consequences","paperID":"None"},{"content":"danah boyd and Kate Crawford. 2012. Critical questions for big data: Provocations for a cultural, technological, and scholarly phenomenon. Information, communication & society, 15 (5). 662--679. DOI: 10.1080/1369118X.2012.678878","paperID":"None"},{"content":"F Carrera, S Guerin and JB Thorp. 2013. By the People, for the People: the Crowdsourcing of. ISPRS International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences, 1 (1). 19--23. DOI: 10.5194/isprsarchives-XL-4-W1--19--2013","paperID":"None"},{"content":"Kate Crawford and Megan Finn. 2014. The limits of crisis data: analytical and ethical challenges of using social and mobile data to understand disasters. GeoJournal. 1--12. DOI: 10.1007/s10708-014--9597-z","paperID":"None"},{"content":"Kate Crawford, Mary L Gray and Kate Miltner. 2014. Big Data| Critiquing Big Data: Politics, Ethics, Epistemology| Special Section Introduction. International Journal of Communication, 8. 10. DOI: 1932--8036/20140005","paperID":"None"},{"content":"Clara Crivellaro, Rob Comber, Martyn DadeRobertson, Simon Bowen, Peter Wright and Patrick Olivier. 2015. Contesting the City: Enacting the Political Through Digitally Supported Urban Walks. in Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 28532862. DOI: 10.1145/2702123.2702176","paperID":"None"},{"content":"Kevin Driscoll. 2012. From Punched Cards to \"Big Data\": A Social History of Database Populism. communication+ 1, 1 (1). 4. DOI: 10.7275/R5B8562P","paperID":"None"},{"content":"Thomas Erickson, Mark Podlaseck, Sambit Sahu, Jing D Dai, Tian Chao and Milind Naphade. 2012. The dubuque water portal: evaluation of the uptake, use and impact of residential water consumption feedback. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 675--684. DOI: 10.1145/2207676.2207772","paperID":"None"},{"content":"Matthew Fuller. 2008. Software studies: A lexicon. MIT Press.","paperID":"None"},{"content":"Tarleton Gillespie. 2014. The Relevance of Algorithms. in Media technologies: Essays on communication, materiality, and society, MIT Press, 167.","paperID":"None"},{"content":"Stephen Goldsmith and Susan Crawford. 2014. The Responsive City: Engaging Communities Through Data-Smart Governance. John Wiley & Sons.","paperID":"None"},{"content":"Adam Greenfield. 2013. Against the smart city.","paperID":"None"},{"content":"Kotaro Hara, Vicki Le and Jon Froehlich. 2013. Combining crowdsourcing and google street view to identify street-level accessibility problems. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 631--640. DOI: 10.1145/2470654.2470744","paperID":"None"},{"content":"Mike Harding, Bran Knowles, Nigel Davies and Mark Rouncefield. 2015. HCI, Civic Engagement & Trust. in Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 28332842. DOI: 10.1145/2702123.2702255","paperID":"None"},{"content":"Mark Hartswood, Rob Procter, Mark Rouncefield, Roger Slack, James Soutter and Alex Voss. 2003. \"Repairing\" the Machine: A Case Study of the Evaluation of Computer-Aided Detection Tools in Breast Screening. in ECSCW 2003, Springer, 375--394. DOI: 10.1007/978--94-010-0068-0_20","paperID":"None"},{"content":"Marina Jirotka, Rob Procter, Mark Hartswood, Roger Slack, Andrew Simpson, Catelijne Coopmans, Chris Hinds and Alex Voss. 2005. Collaboration and trust in healthcare innovation: The eDiaMoND case study. Computer Supported Cooperative Work (CSCW), 14 (4). 369--398. DOI: 10.1007/s10606-005--9001-0","paperID":"None"},{"content":"Deborah G Johnson, Priscilla M Regan and Kent Wayland. 2010. Campaign disclosure, privacy and transparency. Wm. & Mary Bill Rts. J., 19. 959.","paperID":"None"},{"content":"Rob Kitchin. 2014. Big Data, new epistemologies and paradigm shifts. Big Data & Society, 1 (1). 2053951714528481. DOI: 10.1177/2053951714528481","paperID":"None"},{"content":"Rob Kitchin. 2014. The real-time city? Big data and smart urbanism. GeoJournal, 79 (1). 1--14. DOI: 10.1007/s10708-013--9516--8","paperID":"None"},{"content":"Rob Kling. 1996. Computerization and controversy: value conflicts and social choices. Morgan Kaufmann.","paperID":"None"},{"content":"Matthias Korn and Jon Back. 2012. Talking it further: From feelings and memories to civic discussions in and about places. in Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, ACM, 189--198. DOI: 10.1145/2399016.2399046","paperID":"None"},{"content":"Christopher A Le Dantec, Mariam Asad, Aditi Misra and Kari E Watkins. 2015. Planning with Crowdsourced Data: Rhetoric and Representation in Transportation Planning. in Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1717--1727. DOI: 10.1145/2675133.2675212","paperID":"None"},{"content":"Christopher A Le Dantec and W Keith Edwards. 2010. Across boundaries of influence and accountability: The multiple scales of public sector information systems. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 113--122. DOI: 10.1145/1753326.1753345","paperID":"None"},{"content":"Paul Luff, Jon Hindmarsh and Christian Heath. 2000. Workplace studies: Recovering work practice and informing system design. Cambridge University Press.","paperID":"None"},{"content":"Lev Manovich. 2013. Software takes command. A&C Black.","paperID":"None"},{"content":"Viktor Mayer-Schönberger and Kenneth Cukier. 2013. Big data: A revolution that will transform how we live, work, and think. Houghton Mifflin Harcourt.","paperID":"None"},{"content":"Donald McNeill. 2015. Global firms and smart technologies: IBM and the reduction of cities. Transactions of the Institute of British Geographers, 40 (4). 562--574. DOI: 10.1111/tran.12098","paperID":"None"},{"content":"Gareth Morgan. 1997. Images of organization. SAGE Publications.","paperID":"None"},{"content":"Gina Neff. 2013. Why big data won't cure us. Big data, 1 (3). 117--123. DOI: 10.1089/big.2013.0029","paperID":"None"},{"content":"Jathan Sadowski and Frank Pasquale. 2015. The spectrum of control: A social theory of the smart city. First Monday, 20 (7) DOI: http://dx.doi.org/10.5210/fm.v20i7.5903","paperID":"None"},{"content":"Christian Sandvig, Kevin Hamilton, Karrie Karahalios and Cedric Langbort. 2014. Auditing algorithms: Research methods for detecting discrimination on internet platforms. Data and Discrimination: Converting Critical Concerns into Productive Inquiry","paperID":"None"},{"content":"Ben Schiller. 2015. 5 Startups Taking On The Big, Unsexy Problems Of City Government: Changing how government works, under the hood. Retrieved 21-072015 from http://www.fastcoexist.com/3046292/5startups-taking-on-the-big-unsexy-problems-of-citygovernment","paperID":"None"},{"content":"Taylor Shelton, Matthew Zook and Alan Wiig. 2015. The \"actually existing smart city\". Cambridge Journal of Regions, Economy and Society, 8 (1). 13--25. DOI: 10.1093/cjres/rsu026","paperID":"None"},{"content":"Alex S Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger and Jessica Lingel. 2015. Data-in-Place: Thinking through the Relations Between Data and Community. in Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 28632872. DOI: 10.1145/2702123.2702558","paperID":"None"},{"content":"Anthony M Townsend. 2013. Smart cities: big data, civic hackers, and the quest for a new utopia. WW Norton & Company.","paperID":"None"},{"content":"D Lawrence Wieder. 1970. On meaning by rule. Understanding everyday life. Chicago: Aldine. 107135.","paperID":"None"},{"content":"Alan Wiig. 2015. The empty rhetoric of the smart city: from digital inclusion to economic promotion in Philadelphia. Urban Geography. 1--19. DOI: 10.1080/02723638.2015.1065686","paperID":"None"},{"content":"Daisy Yoo, John Zimmerman, Aaron Steinfeld and Anthony Tomasic. 2010. Understanding the space for co-design in riders' interactions with a transit service. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1797--1806. DOI: 10.1145/1753326.1753596","paperID":"None"}],"abstract":"We consider how data is produced and used in cities. We draw on our experiences working with city authorities, along with twenty interviews across four cities to understand the role that data plays in city government. Following the development and deployment of innovative data-driven technology projects in the cities, we look in particular at collaborations around open and crowdsourced data, issues with the politicisation of data, and problems in innovating within the highly regulated public sphere. We discuss what this means for cities, citizens, innovators, and for visions of big data in the smart city as a whole.","title":"Data and the City","filename":"CHI16/p2933","authors":["Donald McMillan","Arvid Engström","Airi Lampinen","Barry Brown"],"conference":"CHI '16"}