{"paperId":2858100,"citation":[],"reference":[{"content":"Paarijaat Aditya, Viktor Erd'elyi, Matthew Lentz, Elaine Shi, Bobby Bhattacharjee, and Peter Druschel. 2014. EnCore: Private, Context-based Communication for Mobile Social Apps. In Proceedings of the 12th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '14). ACM, New York, NY, USA, 135--148. DOI: http://dx.doi.org/10.1145/2594368.2594374","paperID":"None"},{"content":"Apple, Inc. 2015. Peripheral Role Tasks - Advertising Your Services. (2015). https://developer.apple.com/ library/prerelease/ios/documentation/ NetworkingInternetWeb/Conceptual/CoreBluetooth_ concepts/PerformingCommonPeripheralRoleTasks/ PerformingCommonPeripheralRoleTasks.html#//apple_ref/doc/uid/TP40013257-CH4-SW5 Retrieved September 25, 2015.","paperID":"None"},{"content":"David Beard, Murugappan Palaniappan, Alan Humm, David Banks, Anil Nair, and Yen-Ping Shan. 1990. A Visual Calendar for Scheduling Group Meetings. In Proceedings of the 1990 ACM Conference on Computer-supported Cooperative Work (CSCW '90). ACM, New York, NY, USA, 279--290. DOI: http://dx.doi.org/10.1145/99332.99361","paperID":"None"},{"content":"Bluetooth SIG. 2014. Core Specification 4.2. (2014). Retrieved September 25, 2015.","paperID":"None"},{"content":"Kuang-Ming Chen, Yu-Cheng Liou, and Mike Chen. 2011. NFC+: NFC-assisted Media Sharing for Mobile Devices. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11). ACM, New York, NY, USA, 575--576. DOI: http://dx.doi.org/10.1145/2030112.2030220","paperID":"None"},{"content":"Giorgio Corbellini, Stefan Schmid, and Stefan Mangold. 2015. Two-Way Communication Protocol Using Bluetooth Low Energy Advertisement Frames. In Proceedings of the 1st International Workshop on Experiences with the Design and Implementation of Smart Objects (SmartObjects '15). ACM, New York, NY, USA, 19--24. DOI: http://dx.doi.org/10.1145/2797044.2797049","paperID":"None"},{"content":"Nigel Davies, Adrian Friday, Peter Newman, Sarah Rutlidge, and Oliver Storz. 2009. Using Bluetooth Device Names to Support Interaction in Smart Environments. In Proceedings of the 7th International Conference on Mobile Systems, Applications, and Services (MobiSys '09). ACM, New York, NY, USA, 151--164. DOI: http://dx.doi.org/10.1145/1555816.1555832","paperID":"None"},{"content":"Trinh Minh Do and Daniel Gatica-Perez. 2013. Human Interaction Discovery in Smartphone Proximity Networks. Personal Ubiquitous Comput. 17, 3 (March 2013), 413--431. DOI: http://dx.doi.org/10.1007/s00779-011-0489-7","paperID":"None"},{"content":"Google, Inc. 2015a. Android Beam. (2015). Retrieved September 25, 2015.","paperID":"None"},{"content":"Google, Inc. 2015b. Nearby. (2015). Retrieved September 25, 2015.","paperID":"None"},{"content":"I. Scott MacKenzie. 2013. Human-Computer Interaction: An Empirical Research Perspective (1 edition ed.). Morgan Kaufmann, Amsterdam.","paperID":"None"},{"content":"Aditya Shekhar Nittala, Xing-Dong Yang, Scott Bateman, Ehud Sharlin, and Saul Greenberg. 2015. PhoneEar: Interactions for Mobile Devices That Hear High-frequency Sound-encoded Data. In Proceedings of the 7th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '15). ACM, New York, NY, USA, 174--179. DOI: http://dx.doi.org/10.1145/2774225.2775082","paperID":"None"},{"content":"Radius Networks. 2015. Android Beacon Library. (2015). Retrieved September 25, 2015.","paperID":"None"},{"content":"John Reynolds and John Postel. 1994. RFC1700 Assigned Numbers. (1994). Retrieved September 25, 2015.","paperID":"None"},{"content":"Emre Sarigöl, Oriana Riva, Patrick Stuedi, and Gustavo Alonso. 2009. Enabling Social Networking in Ad Hoc Networks of Mobile Phones. Proc. VLDB Endow. 2, 2 (Aug. 2009), 1634--1637. DOI: http://dx.doi.org/10.14778/1687553.1687611","paperID":"None"},{"content":"Florian Schaub, Bastian Könings, Peter Lang, Björn Wiedersheim, Christian Winkler, and Michael Weber. 2014. PriCal: Context-adaptive Privacy in Ambient Calendar Displays. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, New York, NY, USA, 499--510. DOI: http://dx.doi.org/10.1145/2632048.2632087","paperID":"None"},{"content":"Saxon Shuttleworth, Rebecca Chan, Julka Trajic, and Henricus Gerardus Spaay. 2003. System and method for synchronous peer-to-peer appointment scheduling facilitation. (July 2003). CIB: G06Q10/10; (IPC1-7): G06F17/60.","paperID":"None"},{"content":"Wai-Tian Tan, Mary Baker, Bowon Lee, and Ramin Samadani. 2013. The Sound of Silence. In Proceedings of the 11th ACM Conference on Embedded Networked Sensor Systems (SenSys '13). ACM, New York, NY, USA, 19:1--19:14. DOI: http://dx.doi.org/10.1145/2517351.2517362","paperID":"None"}],"abstract":"We introduce CalendarCast, a novel method to support the common task of finding a suitable time and date for a shared meeting among co-located participants using their personal mobile devices. In this paper, we describe the Bluetooth-based wireless protocol and interaction concept on which CalendarCast is based, present a prototypical implementation with Android smartphones and dedicated beacons, and report on results of a user study demonstrating improved task performance compared to unaugmented calendars. The motivating scenario for CalendarCast occurs quite often in a variety of contexts, for example at the end of a prior meeting or during ad-hoc conversations in the hallway. Despite a large variety of digital calendar tools, this situation still usually involves a lengthy manual comparison of free and busy time slots. CalendarCast utilizes Bluetooth Low Energy (BTLE) advertisement broadcasts to share the required free/busy information with a limited, localized audience, on demand only, and without revealing detailed personal information. No prior knowledge about the other participants, such as email addresses or account names, is required.","title":"CalendarCast: Setup-Free, Privacy-Preserving, Localized Sharing of Appointment Data","filename":"CHI16/p1374","authors":["Florian Echtler"],"conference":"CHI '16"}