{"paperId":2858218,"citation":[],"reference":[{"content":"ANT Radio. http://www.thisisant.com/, Accessed: January 2016.","paperID":"None"},{"content":"Abbott, H., and Powell, D. Land-vehicle navigation using gps. Proceedings of the IEEE 87, 1 (1999), 145-162.","paperID":"None"},{"content":"Appel, G. Technical analysis: power tools for active investors. FT Press, 2005.","paperID":"None"},{"content":"Aswani, A., and Tomlin, C. Game-theoretic routing of gps-assisted vehicles for energy efficiency. In American Control Conference (ACC), IEEE (2011), 3375-3380.","paperID":"None"},{"content":"Bland, J., and Altman, D. Statistics: notes cronbach's alpha. BMJ 314, 7080 (1997), 572-572.","paperID":"None"},{"content":"Bollinger, J. Bollinger on bollinger band.","paperID":"None"},{"content":"Breiman, L. Random forests. Machine learning 45, 1 (2001), 5-32.","paperID":"None"},{"content":"Brooks, G. C., Vittinghoff, E., Iyer, S., Tandon, D., Kuhar, P., Madsen, K. A., Marcus, G. M., Pletcher, M. J., and Olgin, J. E. Accuracy and usability of a self-administered 6-minute walk test smartphone application. Circulation: Heart Failure 8, 5 (2015), 905-913.","paperID":"None"},{"content":"Brown, R. Smoothing, forecasting and prediction of discrete time series. Courier Corporation, 2004.","paperID":"None"},{"content":"Carroll, E., Czerwinski, M., Roseway, A., Kapoor, A., Johns, P., Rowan, K., and Schraefel, M. Food and mood: Just-in-time support for emotional eating. In IEEE ACII (2013), 252-257.","paperID":"None"},{"content":"Chandola, T., Brunner, E., and Marmot, M. Chronic stress at work and the metabolic syndrome: prospective study. Bmj 332, 7540 (2006), 521-525.","paperID":"None"},{"content":"Choudhary, A. K., Harding, J. A., and Tiwari, M. K. Data mining in manufacturing: a review based on the kind of knowledge. Journal of Intelligent Manufacturing 20, 5 (2009), 501-521.","paperID":"None"},{"content":"Chrousos, G., and Gold, P. The concepts of stress and stress system disorders: overview of physical and behavioral homeostasis. JAMA 267, 9 (1992), 1244.","paperID":"None"},{"content":"Cover, T. M., and Thomas, J. A. Elements of information theory. John Wiley & Sons, 2012.","paperID":"None"},{"content":"Davis, F., Roseway, A., Carroll, E., and Czerwinski, M. Actuating mood: design of the textile mirror. In International Conference on Tangible, Embedded and Embodied Interaction (2013), 99-106.","paperID":"None"},{"content":"Davis, M., Eshelman, E., and McKay, M. The relaxation and stress reduction workbook. New Harbinger Publications, 2008.","paperID":"None"},{"content":"Domingos, P. Metacost: A general method for making classifiers cost-sensitive. In ACM KDD (1999), 155-164.","paperID":"None"},{"content":"Donders, A., van der Heijden, G., Stijnen, T., and Moons, K. Review: a gentle introduction to imputation of missing values. Journal of clinical epidemiology 59, 10 (2006), 1087-1091.","paperID":"None"},{"content":"Epstein, D., Tyburski, M., Craig, I., Phillips, K., Jobes, M., Vahabzadeh, M., Mezghanni, M., Lin, J., Furr-Holden, D., and Preston, K. Real-time tracking of neighborhood surroundings and mood in urban drug misusers: application of a new method to study behavior in its geographical context. Drug and alcohol dependence 134 (2014), 22-29.","paperID":"None"},{"content":"Ertin, E., Stohs, N., Kumar, S., Raij, A., al'Absi, M., and Shah, S. Autosense: Unobtrusively wearable sensor suite for inferring the onset, causality, and consequences of stress in the field. In ACM SenSys (2011), 274-287.","paperID":"None"},{"content":"Esco, M., Olson, M., Williford, H., Blessing, D., Shannon, D., and Grandjean, P. The relationship between resting heart rate variability and heart rate recovery. Clinical Autonomic Research 20, 1 (2010), 33-38.","paperID":"None"},{"content":"Evans, G., Wener, R., and Phillips, D. The morning rush hour predictability and commuter stress. Environment and Behavior 34, 4 (2002), 521-530.","paperID":"None"},{"content":"Fogarty, J., Hudson, S., and Lai, J. Examining the robustness of sensor-based statistical models of human interruptibility. In ACM CHI (2004), 207-214.","paperID":"None"},{"content":"Freeman, J., Dewey, F., Hadley, D., Myers, J., and Froelicher, V. Autonomic nervous system interaction with the cardiovascular system during exercise. Progress in cardiovascular diseases 48, 5 (2006), 342-362.","paperID":"None"},{"content":"Fritz, C., Sonnentag, S., Spector, P., and McInroe, J. The weekend matters: Relationships between stress recovery and affective experiences. Journal of Organizational Behavior 31, 8 (2010), 1137-1162.","paperID":"None"},{"content":"Furr-Holden, D., Smart, M., Pokorni, J., Ialongo, N., Leaf, P., Holder, H., and Anthony, J. The nifety method for environmental assessment of neighborhood-level indicators of violence, alcohol, and other drug exposure. Prevention Science 9, 4 (2008), 245-255.","paperID":"None"},{"content":"Han, T., Xiao, X., Shi, L., Canny, J., and Wang, J. Balancing accuracy and fun: Designing camera based mobile games for implicit heart rate monitoring. In ACM CHI (2015), 847-856.","paperID":"None"},{"content":"Hastie, T., Tibshirani, R., Sherlock, G., Eisen, M., Brown, P., and Botstein, D. Imputing missing data for gene expression arrays, 1999.","paperID":"None"},{"content":"Hernandez, J., Paredes, P., Roseway, A., and Czerwinski, M. Under pressure: sensing stress of computer users. In ACM CHI (2014), 51-60.","paperID":"None"},{"content":"Hirshfield, L. M., Solovey, E. T., Girouard, A., Kebinger, J., Jacob, R. J., Sassaroli, A., and Fantini, S. Brain measurement for usability testing and adaptive interfaces: an example of uncovering syntactic workload with functional near infrared spectroscopy. In ACM CHI, ACM (2009), 2185-2194.","paperID":"None"},{"content":"Hobfoll, S. E. Conservation of resources: A new attempt at conceptualizing stress. American psychologist 44, 3 (1989), 513.","paperID":"None"},{"content":"Hobfoll, S. E., Vinokur, A. D., Pierce, P. F., and Lewandowski-Romps, L. The combined stress of family life, work, and war in air force men and women: A test of conservation of resources theory. International Journal of Stress Management 19, 3 (2012), 217.","paperID":"None"},{"content":"Hong, J., Ramos, J., and Dey, A. Understanding physiological responses to stressors during physical activity. In ACM UbiComp (2012), 270-279.","paperID":"None"},{"content":"Hossain, S., Ali, A., Rahman, M., Ertin, E., Epstein, D., Kennedy, A., Preston, K., Umbricht, A., Chen, Y., and Kumar, S. Identifying drug (cocaine) intake events from acute physiological response in the presence of free-living physical activity. In ACM IPSN (2014), 71-82.","paperID":"None"},{"content":"Hovsepian, K., al'Absi, M., Ertin, E., Kamarck, T., Nakajima, M., and Kumar, S. cstress: towards a gold standard for continuous stress assessment in the mobile environment. In ACM UbiComp (2015), 493-504.","paperID":"None"},{"content":"Iqbal, S., Zheng, X., and Bailey, B. Task-evoked pupillary response to mental workload in human-computer interaction. In ACM CHI Extended Abstracts (2004), 1477-1480.","paperID":"None"},{"content":"Iqbal, S. T., Adamczyk, P. D., Zheng, X. S., and Bailey, B. P. Towards an index of opportunity: understanding changes in mental workload during task execution. In ACM CHI (2005), 311-320.","paperID":"None"},{"content":"Jaimes, L., Llofriu, M., and Raij, A. A stress-free life: just-in-time interventions for stress via real-time forecasting and intervention adaptation. In ICST BODYNETS (2014), 197-203.","paperID":"None"},{"content":"Kapoor, A., and Horvitz, E. Experience sampling for building predictive user models: a comparative study. In ACM CHI (2008), 657-666.","paperID":"None"},{"content":"Kudielka, B., Schommer, N., Hellhammer, D., and Kirschbaum, C. Acute hpa axis responses, heart rate, and mood changes to psychosocial stress (tsst) in humans at different times of day. Psychoneuroendocrinology 29, 8 (2004), 983-992.","paperID":"None"},{"content":"Liao, P., Klasnja, P., Tewari, A., and Murphy, S. A. Micro-randomized trials in mhealth. arXiv preprint arXiv:1504.00238 (2015).","paperID":"None"},{"content":"Lyu, Y., Luo, X., Zhou, J., Yu, C., Miao, C., Wang, T., Shi, Y., and Kameyama, K.-i. Measuring photoplethysmogram-based stress-induced vascular response index to assess cognitive load and stress. In ACM CHI (2015), 857-866.","paperID":"None"},{"content":"MacLean, D., Roseway, A., and Czerwinski, M. Moodwings: a wearable biofeedback device for real-time stress intervention. In ACM PETRA (2013), 66.","paperID":"None"},{"content":"Mark, G., Gudith, D., and Klocke, U. The cost of interrupted work: more speed and stress. In ACM CHI (2008), 107-110.","paperID":"None"},{"content":"Matthews, M., Snyder, J., Reynolds, L., Chien, J. T., Shih, A., Lee, J. W., and Gay, G. Real-time representation versus response elicitation in biosensor data. In ACM CHI (2015), 605-608.","paperID":"None"},{"content":"McDuff, D., Karlson, A., Kapoor, A., Roseway, A., and Czerwinski, M. Affectaura: an intelligent system for emotional memory. In ACM CHI (2012), 849-858.","paperID":"None"},{"content":"McEwen, B. Protection and damage from acute and chronic stress. Ann NY Acad Sci 1032 (2004), 1-7.","paperID":"None"},{"content":"McEwen, B. Stress, adaptation, and disease: Allostasis and allostatic load. Annals of the NY Academy of Sciences 840, 1 (2006), 33-44.","paperID":"None"},{"content":"McEwen, B. Physiology and neurobiology of stress and adaptation: Central role of the brain. Physiological Reviews 87, 3 (2007), 873-904.","paperID":"None"},{"content":"McEwen, B., and Stellar, E. Stress and the individual: mechanisms leading to disease. Archives of Internal Medicine 153, 18 (1993), 2093.","paperID":"None"},{"content":"Murphy, S. Micro-randomized trials & mhealth. 2014.","paperID":"None"},{"content":"Nahum-Shani, I., Hekler, E., and Spruijt-Metz, D. Building health behavior models to guide the development of just-in-time adaptive interventions: a pragmatic framework. Health Psychology.","paperID":"None"},{"content":"Ni, K., Ramanathan, N., Chehade, M., Balzano, L., Nair, S., Zahedi, S., Kohler, E., Pottie, G., Hansen, M., and Srivastava, M. Sensor network data fault types. ACM TOSN 5, 3 (2009), 25.","paperID":"None"},{"content":"Plarre, K., Raij, A., Hossain, S., Ali, A., Nakajima, M., Al'absi, M., Ertin, E., Kamarck, T., Kumar, S., Scott, M., et al. Continuous inference of psychological stress from sensory measurements collected in the natural environment. In IEEE/ACM IPSN (2011), 97-108.","paperID":"None"},{"content":"Purpura, S., Schwanda, V., Williams, K., Stubler, W., and Sengers, P. Fit4life: the design of a persuasive technology promoting healthy behavior and ideal weight. In ACM CHI (2011), 423-432.","paperID":"None"},{"content":"Ragsdale, J., Beehr, T., Grebner, S., and Han, K. An integrated model of weekday stress and weekend recovery of students. International Journal of Stress Management 18, 2 (2011), 153.","paperID":"None"},{"content":"Rahman, M., Bari, R., Ali, A., Sharmin, M., Raij, A., Hovsepian, K., Hossain, S., Ertin, E., Kennedy, A., Epstein, D., Preston, K., Jobes, M., Beck, G., Kedia, S., Ward, K., alAbsi, M., and Kumar, S. Are we there yet? feasibility of continuous stress assessment via wireless physiological sensors. In ACM BCB (2014), 479-488.","paperID":"None"},{"content":"Rasekaba, T., Lee, A., Naughton, M., Williams, T., and Holland, A. The six-minute walk test: a useful metric for the cardiopulmonary patient. Internal medicine journal 39, 8 (2009), 495-501.","paperID":"None"},{"content":"Sapolsky, R. M. Why zebras don't get ulcers: The acclaimed guide to stress, stress-related diseases, and coping-now revised and updated. Macmillan, 2004.","paperID":"None"},{"content":"Sarker, H., Sharmin, M., Ali, A., Rahman, M., Bari, R., Hossain, S., and Kumar, S. Assessing the availability of users to engage in just-in-time intervention in the natural environment. In ACM UbiComp (2014), 909-920.","paperID":"None"},{"content":"Sharmin, M., Raij, A., Epstien, D., Nahum-Shani, I., Beck, J. G., Vhaduri, S., Preston, K., and Kumar, S. Visualization of time-series sensor data to inform the design of just-in-time adaptive stress interventions. In ACM UbiComp (2015), 505-516.","paperID":"None"},{"content":"Speed, T. Statistical analysis of gene expression microarray data. CRC Press, 2004.","paperID":"None"},{"content":"Sun, D., Paredes, P., and Canny, J. Moustress: detecting stress from mouse motion. In ACM CHI (2014), 61-70.","paperID":"None"},{"content":"Tan, C. S. S., Schöning, J., Luyten, K., and Coninx, K. Investigating the effects of using biofeedback as visual stress indicator during video-mediated collaboration. In ACM CHI (2014), 71-80.","paperID":"None"},{"content":"Troyanskaya, O., Cantor, M., Sherlock, G., Brown, P., Hastie, T., Tibshirani, R., Botstein, D., and Altman, R. Missing value estimation methods for dna microarrays. Bioinformatics 17, 6 (2001), 520-525.","paperID":"None"},{"content":"Wilder, J. W. New concepts in technical trading systems. Trend Research Greensboro, NC, 1978.","paperID":"None"},{"content":"Xian, G., and Homer, C. Updating the 2001 national land cover database impervious surface products to 2006 using landsat imagery change detection methods. Remote Sensing of Environment 114, 8 (2010), 1676-1686.","paperID":"None"}],"abstract":"Management of daily stress can be greatly improved by delivering sensor-triggered just-in-time interventions (JITIs) on mobile devices. The success of such JITIs critically depends on being able to mine the time series of noisy sensor data to find the most opportune moments. In this paper, we propose a time series pattern mining method to detect significant stress episodes in a time series of discontinuous and rapidly varying stress data. We apply our model to 4 weeks of physiological, GPS, and activity data collected from 38 users in their natural environment to discover patterns of stress in real life. We find that the duration of a prior stress episode predicts the duration of the next stress episode and stress in mornings and evenings is lower than during the day. We then analyze the relationship between stress and objectively rated disorder in the surrounding neighborhood and develop a model to predict stressful episodes.","title":"Finding Significant Stress Episodes in a Discontinuous Time Series of Rapidly Varying Mobile Sensor Data","filename":"CHI16/p4489","authors":["Hillol Sarker","Matthew Tyburski","Md Mahbubur Rahman","Karen Hovsepian","Moushumi Sharmin","David H. Epstein","Kenzie L. Preston","C. Debra Furr-Holden","Adam Milam","Inbal Nahum-Shani","Mustafa al'Absi","Santosh Kumar"],"conference":"CHI '16"}