{"paperId":2858470,"citation":[],"reference":[{"content":"Tamara Alsheikh, Jennifer A. Rode, and Siân E. Lindley. 2011. (Whose) value-sensitive design: a study of long-distance relationships in an Arabic cultural context. Proceedings of the ACM 2011 conference on Computer supported cooperative work, ACM, 75--84.","paperID":"None"},{"content":"Morgan G. Ames, Janet Go, Joseph 'Jofish' Kaye, and Mirjana Spasojevic. 2011. Understanding technology choices and values through social class. Proceedings of the ACM 2011 conference on Computer supported cooperative work, ACM, 55--64.","paperID":"None"},{"content":"Eli Blevis. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 503--512.","paperID":"None"},{"content":"Alan Borning and Michael Muller. 2012. Next steps for value sensitive design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1125--1134.","paperID":"None"},{"content":"Geoffrey Bowker and Susan Leigh Star. 1999. Sorting things out: Classification and its consequences. MIT Press. Massachusetts, USA.","paperID":"None"},{"content":"Christopher A. Le Dantec, Erika Shehan Poole, and Susan P. Wyche. 2009. Values as lived experience: evolving value sensitive design in support of value discovery. Proceedings of the SIGCHI conference on human factors in computing systems, ACM, 1141--1150.","paperID":"None"},{"content":"Tamara Denning, Alan Borning, Batya Friedman, Brian T. Gill, Tadayoshi Kohno, and William H. Maisel. 2010. Patients, pacemakers, and implantable defibrillators: Human values and security for wireless implantable medical devices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 917--926.","paperID":"None"},{"content":"John Dewey. 1922. Human nature and conduct. Dover Edition. 2012 Print. Dover Publications. Mineola, USA.","paperID":"None"},{"content":"Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1975--1984.","paperID":"None"},{"content":"Paul Dourish. 2010. HCI and environmental sustainability: the politics of design and the design of politics. Proceedings of the 8th ACM Conference on Designing Interactive Systems, ACM, 1--10.","paperID":"None"},{"content":"Mary Flanagan, Daniel C. Howe, and Helen Nissenbaum. 2008. Embodying values in technology: Theory and practice. Information technology and moral philosophy. Jeroen Van Den Hoven and John Weckert (eds.) Cambridge University press, UK. 322--353.","paperID":"None"},{"content":"Kenneth R. Fleischmann, William Wallace, and Justin M. Grimes. 2010. The values of computational modelers and professional codes of ethics: Results from a field study. System Sciences (HICSS), 2010 43rd Hawaii International Conference on, IEEE, 1--10.","paperID":"None"},{"content":"Michel Foucault. 1980. Power/knowledge: Selected interviews and other writings, 1972--1977. Pantheon Books, NY.","paperID":"None"},{"content":"Batya Friedman. 1990. Societal Issues and School Practices: An Ethnographic Investigation of the Social Context of School Computer Use. Annual Meeting of the American Educational Research Association. Boston. April 16--20. Retrieved 8 January 2015 from http://files.eric.ed.gov/fulltext/ED321740.pdf","paperID":"None"},{"content":"Batya Friedman. 1996. Value-sensitive design. Interactions 3, 6: 16--23.","paperID":"None"},{"content":"Batya Friedman and Peter H. Kahn Jr. 2003. Human values, ethics, and design. The Human-Computer Interaction Handbook. Andrew Sears and Julie A. Jacko (eds.) L. Erlbaum Associates Publishers. Mahwah, USA. 1177--1201.","paperID":"None"},{"content":"Batya Friedman, Peter H. Kahn, and Alan Borning. 2008. Value sensitive design and information systems. The Handbook of Information and Computer Ethics Kenneth E. Himma and Herman T. Tavani (eds.) Wiley, Hoboken, USA. 69--101.","paperID":"None"},{"content":"Batya Friedman and Helen Nissenbaum. 1996. Bias in computer systems. ACM Transactions on Information Systems (TOIS) 14, 3: 330--347.","paperID":"None"},{"content":"Batya Friedman and Helen Nissenbaum. 1997. Software agents and user autonomy. Proceedings of the first international conference on Autonomous agents, ACM, 466--469.","paperID":"None"},{"content":"Harold Garfinkel. 1967. Studies in ethnomethodology. 1991 Print. Polity, Cambridge, UK.","paperID":"None"},{"content":"Lara Houston. 2014. Inventive Infrastructure: An Exploration of Mobile Phone Repair Practices in Downtown Kampala, Uganda. PhD Dissertation. Lancaster University, Lancaster, UK.","paperID":"None"},{"content":"Everett Cherrington Hughes. 1971. The sociological eye: Selected papers. 1984 Print. Transaction publishers. Herndon, USA.","paperID":"None"},{"content":"Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial computing: a lens on design and development. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1311--1320.","paperID":"None"},{"content":"Steven J. Jackson. 2014. Rethinking Repair. In Media Technologies: Essays on Communication, Materiality, and Society Tarleton Gillespie, Pablo J. Boczkowski, Kirsten A. Foot (eds.) MIT Press, Cambridge, USA. 221--240.","paperID":"None"},{"content":"Steven J. Jackson, Syed Ishtiaque Ahmed, and Md Rashidujjaman Rifat. 2014. Learning, innovation, and sustainability among mobile phone repairers in Dhaka, Bangladesh. Proceedings of the 2014 conference on Designing interactive systems, ACM, 905--914.","paperID":"None"},{"content":"Steven J. Jackson, Alex Pompe, and Gabriel Krieshok. 2012. Repair worlds: maintenance, repair, and ICT for development in rural Namibia. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, ACM, 107--116.","paperID":"None"},{"content":"Nassim JafariNaimi, Lisa Nathan, and Ian Hargraves. 2015. Values as Hypotheses: The Service that Values Provide. Design Issues 31, 4.","paperID":"None"},{"content":"William James. 1910. The Meaning of Truth. A Sequel to Pragmatism. Longmans, Green, and Company, NY, USA.","paperID":"None"},{"content":"Cory Knobel and Geoffrey C. Bowker. 2011. Values in design. Communications of the ACM 54, 7: 26--28.","paperID":"None"},{"content":"Josh Lepawsky and Charles Mather. 2011. From beginnings and endings to boundaries and edges: rethinking circulation and exchange through electronic waste. Area 43, 3: 242--249.","paperID":"None"},{"content":"Julian Orr. 1996. Talking About Machines: An ethnography of a modern job. Cornell University Press, Ithaca, USA.","paperID":"None"},{"content":"David Ribes and Thomas A. Finholt. 2009. The long now of technology infrastructure: articulating tensions in development. Journal of the Association for Information Systems 10, 5: 5.","paperID":"None"},{"content":"Daniela K. Rosner. 2014. Making citizens, reassembling devices: on gender and the development of contemporary public sites of repair in Northern California. Public Culture 26, 1 72: 51--77.","paperID":"None"},{"content":"Daniela K. Rosner and Morgan Ames. 2014. Designing for repair?: infrastructures and materialities of breakdown. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, ACM, 319--331.","paperID":"None"},{"content":"Harvey Sacks. 1992. Lectures on conversation. Gail Jefferson (ed.) 1995 Print. Blackwell, Malden, USA.","paperID":"None"},{"content":"Susan Leigh Star and Geoffrey C. Bowker. 2007. Enacting silence: Residual categories as a challenge for ethics, information systems, and communication. Ethics and Information Technology 9, 4: 273--280.","paperID":"None"},{"content":"Susan Leigh Star and Karen Ruhleder. 1996. Steps toward an ecology of infrastructure: Design and access for large information spaces. Information systems research 7, 1: 111--134.","paperID":"None"},{"content":"Anselm Strauss and Juliet M. Corbin. 1997. Grounded theory in practice. Sage. Thousand Oaks, USA.","paperID":"None"},{"content":"Anselm Leonard Strauss. 2008. Continual permutations of action. AldineTransaction. New Brunswick, USA.","paperID":"None"},{"content":"Lucy A. Suchman. 1987. Plans and situated actions: the problem of human-machine communication. Cambridge University Press. Cambridge, UK.","paperID":"None"},{"content":"Bill Tomlinson, M. Silberman, Donald Patterson, Yue Pan, and Eli Blevis. 2012. Collapse informatics: augmenting the sustainability & ICT4D discourse in HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 655--664.","paperID":"None"},{"content":"Jill Palzkill Woelfer, Amy Iverson, David G. Hendry, Batya Friedman, and Brian T. Gill. 2011. Improving the safety of homeless young people with mobile phones: Values, form and function. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1707--1716.","paperID":"None"},{"content":"Susan Wyche. 2015. Exploring mobile phone and social media use in a Nairobi slum: a case for alternative approaches to design in ICTD. Proceedings of the Seventh International Conference on Information and Communication Technologies and Development, ACM, 1--8.","paperID":"None"},{"content":"Daisy Yoo, Alina Huldtgren, Jill Palzkill Woelfer, David G. Hendry, and Batya Friedman. 2013. A value sensitive action-reflection model: evolving a co-design space with stakeholder and designer prompts. Proceedings of the SIGCHI conference on human factors in computing systems, ACM, 419--428.","paperID":"None"}],"abstract":"This paper examines the question of \"values in repair\" -- the distinct forms of meaning and care that may be built into human-technology interactions through individual and collective acts of repair. Our work draws on research in HCI and the social sciences and findings from ethnographic studies in four sites -- two amateur \"fixers\" collectives' in Brooklyn and Seattle, USA and two mobile phone repair communities in Uganda and Bangladesh -- to advance two arguments. First, studies of repair account for new sites and processes of value that differ from those appearing at HCI's better-studied moments of design and use. Second, repair may embed modes of human interaction with technology and with each other in ways that surface values as contingent and ongoing accomplishments, suggesting ongoing processes of valuation that can never be fully fixed or commoditized. These insights help HCI account for human relationships to technology built into the world through repair.","title":"Values in Repair","filename":"CHI16/p1403","authors":["Lara Houston","Steven J. Jackson","Daniela K. Rosner","Syed Ishtiaque Ahmed","Meg Young","Laewoo Kang"],"conference":"CHI '16"}