{"paperId":2858073,"abstract":"Makerspaces public workshops where makers can share tools and knowledge are a growing resource for amateurs and professionals alike. While the role of makerspaces in innovation and peer learning is widely discussed, we attempt to look at the wider roles that makerspaces play in public life. Through site visits and interviews at makerspaces and similar facilities across the UK, we have identified additional roles that these spaces play: as social spaces, in supporting wellbeing, by serving the needs of the communities they are located in and by reaching out to excluded groups. Based on these findings, we suggest implications and future directions for both makerspace organisers and community researchers.","citation":[],"reference":[{"content":"Syed Ishtiaque Ahmed, Nusrat Jahan Mim and Steven J. Jackson. 2015. Residual mobilities: infrastructural displacement and post-colonial computing in Bangladesh. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 437--446. http://dx.doi.org/10.1145/2702123.2702573","paperID":"None"},{"content":"Chris Anderson. 2012. Makers: The New Industrial Revolution. Random House.","paperID":"None"},{"content":"Megan L. Ballinger, Lyn A. Talbot and Glenda K. Verrinder. 2009. More than a place to do woodwork: a case study of a community-based Men's Shed. Journal of Men's Health 6, 1 (March 2009), 20--27. http://doi.org/10.1016/j.jomh.2008.09.006","paperID":"None"},{"content":"Jonathan Bean and Daniela Rosner. 2014. Making: movement or brand? Interactions 21, 1 (January 2014), 26--27. http://doi.org/10.1145/254166","paperID":"None"},{"content":"Nicole Belbin and Pat Newcombe. Fab Labs at the Library. 2012. Government Technology 25, 10 (October 2012), 30--33.","paperID":"None"},{"content":"David Best. 2015. Temple. Retrieved July 13, 2015 from http://templederry-londonderry.com","paperID":"None"},{"content":"Leah Buechley and Benjamin Mako Hill. 2010. LilyPad in the wild: how hardware's long tail is supporting new engineering and design communities. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10), 199--207. http://doi.org/10.1145/1858171.1858206","paperID":"None"},{"content":"Erin Buehler, Amy Hurst, and Megan Hofmann. 2014. Coming to grips: 3D printing for accessibility. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14), 291--292. http://doi.org/10.1145/2661334.2661345","paperID":"None"},{"content":"E-Nable. Retrieved September 23, 2015 from http://enablingthefuture.org","paperID":"None"},{"content":"Sarah Fox, Rachel Rose Ulgado and Daniela Rosner. 2015. Hacking culture, not devices: access and recognition in feminist hackerspaces. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 56--68. http://doi.org/10.1145/2675133.2675223","paperID":"None"},{"content":"Neil Gershenfeld. 2005. Fab: The Coming Revolution on Your Desktop. Basic Books.","paperID":"None"},{"content":"Julianne Holt-Lunstad, Timothy B. Smith, J. Bradley Layton. 2010. Social relationships and mortality risk: a meta-analytic review. PLoS Medicine 7, 7 (July 2010), e1000316. http://doi.org/10.1371/journal.pmed.1000316","paperID":"None"},{"content":"Jonathan Hook, Sanne Verbaan, Abigail Durrant, Patrick Olivier, and Peter Wright. 2014. A study of the challenges related to DIY assistive technology in the context of children with disabilities. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14), 597--606. http://doi.org/10.1145/2598510.2598530","paperID":"None"},{"content":"Amy Hurst and Jasmine Tobias. 2011. Empowering individuals with Do-It-Yourself assistive technology. In Proceedings of the 3rd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '11), 11--18. http://doi.org/10.1145/2049536.2049541","paperID":"None"},{"content":"Amy Hurst and Shaun Kane. 2013. Making \"making\" accessible. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13), 635--638. http://doi.org/10.1145/2485760.2485883","paperID":"None"},{"content":"Cindy Kohtala and Camille Bosqué. 2014. The story of MIT-Fablab Norway: community embedding of peer production. Journal of Peer Production, 5 (October 2014).","paperID":"None"},{"content":"Stacey Kuznetsov and Eric Paulos. 2010. Rise of the expert amateur: DIY projects, communities, and cultures. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction (NordiCHI '10), 295--304. http://doi.org/10.1145/1868914.1868950","paperID":"None"},{"content":"Richard E. Ladner. 2015. Design for user empowerment. Interactions 22, 2 (March 2015), 24--29. http://doi.org/10.1145/2723869","paperID":"None"},{"content":"Micah Lande and Shawn Jordan. 2014. Making it together, locally. In Frontiers in Education Conference (FIE '14), 1--7. http://doi.org/10.1109/FIE.2014.7044394","paperID":"None"},{"content":"Breanne K. Litts. 2015. Resources, facilitation, and partnerships: three design considerations for youth makerspaces. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC '15), 347--350. http://doi.org/10.1145/2771839.2771913","paperID":"None"},{"content":"Silvia Lindtner, Garnet D. Hertz, and Paul Dourish. 2014. Emerging sites of HCI innovation: hackerspaces, hardware startups & incubators. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 439--448. http://doi.org/10.1145/2556288.2557132","paperID":"None"},{"content":"Jarkko Moilanen. 2012. Emerging hackerspaces -- peerproduction generation. In: Open Source Systems: LongTerm Sustainability, 94--111. http://doi.org/10.1007/978--3--642--33442--9_7","paperID":"None"},{"content":"Ray Oldenburg. 1989. The Great Good Place: Cafes, Coffee Shops, Community Centers, General Stores, Bars, Hangouts, and How They Get You through the Day. Paragon.","paperID":"None"},{"content":"Matt Ratto and Megan Boler. 2014. DIY Citizenship: Critical Making and Social Media. MIT Press.","paperID":"None"},{"content":"Yvonne Rogers and Gary Marsden. 2013. Does he take sugar?: moving beyond the rhetoric of compassion. Interactions 20, 4 (July 2013), 48--57. http://doi.org/10.1145/2486227.2486238","paperID":"None"},{"content":"Yvonne Rogers, Jeni Paay, Margot Brereton, Kate Vaisutis, Gary Marsden and Frank Vetere. 2014. Never too old: engaging retired people inventing the future with MaKey MaKey. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3913--3922. http://doi.org/10.1145/2556288.2557184","paperID":"None"},{"content":"Daniela Rosner and Jonathan Bean. 2009. Learning from IKEA hacking: I'm not one to decoupage a tabletop and call it a day. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 419--422. http://doi.org/10.1145/1518701.1518768","paperID":"None"},{"content":"Daniela K. Rosner and Morgan G. Ames. 2014. Designing for repair?: infrastructures and materialities of breakdown. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14), 319--331. http://dx.doi.org/10.1145/2531602.2531692","paperID":"None"},{"content":"Kimberly M. Sheridan, Erica Rosenfeld Halverson, Breanne K. Litts, Lisa Brahms, Lynette Jacobs-Priebe and Trevor Owens. 2014. Learning in the making: a comparative case study of three makerspaces. Harvard Educational Review 84, 4 (Winter 2014), 505--531. http://doi.org/10.17763/haer.84.4.brr34733723j648u","paperID":"None"},{"content":"Diane Slatter and Zaana Howard. 2013. A place to make, hack, and learn: makerspaces in Australian public libraries. The Australian Library Journal 64, 4, 272--284. http://doi.org/10.1080/00049670.2013.853335","paperID":"None"},{"content":"Andrew Sleigh, Hannah Stewart and Kathleen Stokes. Open dataset of UK makerspaces: a user's guide. 2015. Retrieved September 8, 2015 from http://www.nesta.org.uk/publications/open-dataset-ukmakerspaces-users-guide","paperID":"None"},{"content":"Adrian Smith. 2015. Tooling up: civic visions, FabLabs, and grassroots activism. Retrieved July 27, 2015 from http://gu.com/p/478pv/sbl","paperID":"None"},{"content":"Joshua G. Tanenbaum, Amanda M. Williams, Audrey Desjardins and Karen Tanenbaum. 2013. Democratizing technology: pleasure, utility and expressiveness in DIY and maker practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2603--2612. http://doi.org/10.1145/2470654.2481360","paperID":"None"},{"content":"Austin L. Toombs, Shaowen Bardzell and Jeffrey Bardzell. 2014. Becoming makers: hackerspace member habits, values, and identities. Journal of Peer Production, 5 (October 2014).","paperID":"None"},{"content":"Austin L. Toombs, Shaowen Bardzell and Jeffrey Bardzell. 2015. The proper care and feeding of hackerspaces: care ethics and cultures of making. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 629--638. http://doi.org/10.1145/2702123.2702522","paperID":"None"},{"content":"Ding Wang, Nick Dunn and Paul Coulton. 2015. Grassroots maker spaces: a recipe for innovation? In 11th European Academy of Design Conference (EAD '15).","paperID":"None"},{"content":"Karen Yair. 2011. Craft and wellbeing. Retrieved September 10, 2015 from http://www.craftscouncil.org.uk/content/files/craft_and_wellbeing.pdf","paperID":"None"}],"title":"Making Community: The Wider Role of Makerspaces in Public Life","filename":"CHI16/p1415","authors":["Nick Taylor","Ursula Hurley","Philip Connolly"],"conference":"CHI '16"}