{"paperId":2858350,"citation":[],"reference":[{"content":"Jodi Aronson. 1995. A pragmatic view of thematic analysis. The qualitative report 2, 1: 1--3.","paperID":"None"},{"content":"Gilles Bailly, Thomas Pietrzak, Jonathan Deber, and Daniel J. Wigdor. 2013. Métamorphe: Augmenting Hotkey Usage with Actuated Keys. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 563--572. http://doi.org/10.1145/2470654.2470734","paperID":"None"},{"content":"Thomas Booth, Srinivas Sridharan, Ann McNamara, Cindy Grimm, and Reynold Bailey. 2013. Guiding Attention in Controlled Real-world Environments. Proceedings of the ACM Symposium on Applied Perception, ACM, 75--82. http://doi.org/10.1145/2492494.2492508","paperID":"None"},{"content":"Imran Chaudhri, Bas Ording, Freddy Allen Anzures, et al. 2011. USA Patent: 8046721 - Unlocking a device by performing gestures on an unlock image.","paperID":"None"},{"content":"Marcelo Coelho and Jamie Zigelbaum. 2011. Shapechanging Interfaces. Personal Ubiquitous Comput. 15, 2: 161--173. http://doi.org/10.1007/s00779-010-0311-y","paperID":"None"},{"content":"Panteleimon Dimitriadis and Jason Alexander. 2014. Evaluating the Effectiveness of Physical Shape-change for In-pocket Mobile Device Notifications. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2589--2592. http://doi.org/10.1145/2556288.2557164","paperID":"None"},{"content":"K. Anders Ericsson and Herbert A Simon. 1993. Protocol analysis verbal reports as data. MIT Press, Cambridge, Mass.","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic Physical Affordances and Constraints Through Shape and Object Actuation. Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology, ACM, 417--426. http://doi.org/10.1145/2501988.2502032","paperID":"None"},{"content":"Georg Freitag, Michael Tränkner, and Markus Wacker. 2012. Enhanced Feed-forward for a User Aware Multitouch Device. Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, ACM, 578--586. http://doi.org/10.1145/2399016.2399104","paperID":"None"},{"content":"Gibson J J. 1977. \"The theory of affordances,\" in Perceiving, Acting, and Knowing. Towards an Ecological Psychology. Hoboken, NJ: John Wiley & Sons Inc.","paperID":"None"},{"content":"Maxime Guillon, François Leitner, and Laurence Nigay. 2015. Investigating Visual Feedforward for Target Expansion Techniques. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2777--2786. http://doi.org/10.1145/2702123.2702375","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2009. Providing dynamically changeable physical buttons on a visual display. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 299--308. http://doi.org/10.1145/1518701.1518749","paperID":"None"},{"content":"Marc Hassenzahl. 2005. The thing and I: understanding the relationship between user and product. In Funology. Springer, 31--42.","paperID":"None"},{"content":"Fabian Hemmert, Susann Hamann, Matthias Löwe, Josefine Zeipelt, and Gesche Joost. 2010. Shapechanging Mobiles: Tapering in Two-dimensional Deformational Displays in Mobile Phones. CHI '10 Extended Abstracts on Human Factors in Computing Systems, ACM, 3075--3080. http://doi.org/10.1145/1753846.1753920","paperID":"None"},{"content":"Fabian Hemmert, Matthias Löwe, Anne Wohlauf, and Gesche Joost. 2013. Animate Mobiles: Proxemically Reactive Posture Actuation As a Means of Relational Interaction with Mobile Phones. Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction, ACM, 267--270. http://doi.org/10.1145/2460625.2460669","paperID":"None"},{"content":"Lars-Erik Janlert. 2014. The Ubiquitous Button. interactions 21, 3: 26--33. http://doi.org/10.1145/2592234","paperID":"None"},{"content":"Seoktae Kim, Hyunjung Kim, Boram Lee, Tek-Jin Nam, and Woohun Lee. 2008. Inflatable Mouse: Volume-adjustable Mouse with Air-pressure-sensitive Input and Haptic Feedback. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 211--224. http://doi.org/10.1145/1357054.1357090","paperID":"None"},{"content":"Sofie Kinch, Erik Grönvall, Marianne Graves Petersen, and Majken Kirkegaard Rasmussen. 2013. Encounters on a Shape-changing Bench: Exploring Atmospheres and Social Behaviour in Situ. Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction, ACM, 233--240. http://doi.org/10.1145/2540930.2540947","paperID":"None"},{"content":"Matthijs Kwak, Kasper Hornbæk, Panos Markopoulos, and Miguel Bruns Alonso. 2014. The Design Space of Shape-changing Interfaces: A Repertory Grid Study. Proceedings of the 2014 Conference on Designing Interactive Systems, ACM, 181--190. http://doi.org/10.1145/2598510.2598573","paperID":"None"},{"content":"Daniel Leithinger, Sean Follmer, Alex Olwal, and Hiroshi Ishii. 2014. Physical Telepresence: Shape Capture and Display for Embodied, Computermediated Remote Collaboration. Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology, ACM, 461--470. http://doi.org/10.1145/2642918.2647377","paperID":"None"},{"content":"Daniel Leithinger and Hiroshi Ishii. 2010. Relief: A Scalable Actuated Shape Display. Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 221--222. http://doi.org/10.1145/1709886.1709928","paperID":"None"},{"content":"G. Michelitsch, J. Williams, M. Osen, B. Jimenez, and S. Rapp. 2004. Haptic Chameleon: A New Concept of Shape-changing User Interface Controls with Force Feedback. CHI '04 Extended Abstracts on Human Factors in Computing Systems, ACM, 1305--1308. http://doi.org/10.1145/985921.986050","paperID":"None"},{"content":"Ryuma Niiyama, Xu Sun, Lining Yao, Hiroshi Ishii, Daniela Rus, and Sangbae Kim. 2015. Sticky Actuator: Free-Form Planar Actuators for Animated Objects. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 77--84. http://doi.org/10.1145/2677199.2680600","paperID":"None"},{"content":"Donald A. Norman. 1988. The psychology of everyday things. Basic Books, NY.","paperID":"None"},{"content":"Donald A. Norman. 1999. Affordance, Conventions, and Design. interactions 6, 3: 38--43. http://doi.org/10.1145/301153.301168","paperID":"None"},{"content":"Donald A. Norman. 2008. THE WAY I SEE IT: Signifiers, Not Affordances. interactions 15, 6: 18--19. http://doi.org/10.1145/1409040.1409044","paperID":"None"},{"content":"Jifei Ou, Lining Yao, Clark Della Silva, Wen Wang, and Hiroshi Ishii. 2014. bioPrint: An Automatic Deposition System for Bacteria Spore Actuators. Proceedings of the Adjunct Publication of the 27th Annual ACM Symposium on User Interface Software and Technology, ACM, 121--122. http://doi.org/10.1145/2658779.2658806","paperID":"None"},{"content":"Joohee Park, Young-Woo Park, and Tek-Jin Nam. 2014. Wrigglo: Shape-changing Peripheral for Interpersonal Mobile Communication. Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3973--3976. http://doi.org/10.1145/2556288.2557166","paperID":"None"},{"content":"Young-Woo Park, Kyoung-Min Baek, and Tek-Jin Nam. 2013. The Roles of Touch During Phone Conversations: Long-distance Couples' Use of POKE in Their Homes. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1679--1688. http://doi.org/10.1145/2470654.2466222","paperID":"None"},{"content":"Young-Woo Park, Joohee Park, and Tek-Jin Nam. 2015. The Trial of Bendi in a Coffeehouse: Use of a Shape-Changing Device for a Tactile-Visual Phone Conversation. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2181--2190. http://doi.org/10.1145/2702123.2702326","paperID":"None"},{"content":"Esben W. Pedersen, Sriram Subramanian, and Kasper Hornbæk. 2014. Is My Phone Alive?: A Large-scale Study of Shape Change in Handheld Devices Using Videos. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2579--2588. http://doi.org/10.1145/2556288.2557018","paperID":"None"},{"content":"Ivan Poupyrev, Tatsushi Nashida, Shigeaki Maruyama, Jun Rekimoto, and Yasufumi Yamaji. 2004. Lumen: Interactive Visual and Shape Display for Calm Computing. ACM SIGGRAPH 2004 Emerging Technologies, ACM, 17. http://doi.org/10.1145/1186155.1186173","paperID":"None"},{"content":"Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shapechanging Interfaces: A Review of the Design Space and Open Research Questions. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 735--744. http://doi.org/10.1145/2207676.2207781","paperID":"None"},{"content":"Majken Kirkegaard Rasmussen, Erik Grönvall, Sofie Kinch, and Marianne Graves Petersen. 2013. \"It's Alive, It's Magic, It's in Love with You\": Opportunities, Challenges and Open Questions for Actuated Interfaces. Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration, ACM, 63--72. http://doi.org/10.1145/2541016.2541033","paperID":"None"},{"content":"Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: toward high shape resolution in self-actuated flexible mobile devices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 593--602. http://doi.org/10.1145/2470654.2470738","paperID":"None"},{"content":"Christian Schönauer, Kenichiro Fukushi, Alex Olwal, Hannes Kaufmann, and Ramesh Raskar. 2012. Multimodal Motion Guidance: Techniques for Adaptive and Dynamic Feedback. Proceedings of the 14th ACM International Conference on Multimodal Interaction, ACM, 133--140. http://doi.org/10.1145/2388676.2388706","paperID":"None"},{"content":"Faisal Taher, John Hardy, Abhijit Karnik, et al. 2015. Exploring Interactions with Physically Dynamic Bar Charts. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3237--3246. http://doi.org/10.1145/2702123.2702604","paperID":"None"},{"content":"Giovanni Maria Troiano, Esben Warming Pedersen, and Kasper Hornbæk. 2014. User-defined Gestures for Elastic, Deformable Displays. Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces, ACM, 1--8. http://doi.org/10.1145/2598153.2598184","paperID":"None"},{"content":"Jo Vermeulen, Kris Luyten, Elise van den Hoven, and Karin Coninx. 2013. Crossing the Bridge over Norman's Gulf of Execution: Revealing Feedforward's True Identity. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1931--1940. http://doi.org/10.1145/2470654.2466255","paperID":"None"},{"content":"Luke Vink, Viirj Kan, Ken Nakagaki, et al. 2015. TRANSFORM As Adaptive and Dynamic Furniture. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 183--183. http://doi.org/10.1145/2702613.2732494","paperID":"None"},{"content":"Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defined Gestures for Surface Computing. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1083--1092. http://doi.org/10.1145/1518701.1518866","paperID":"None"},{"content":"Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically Actuated Soft Composite Materials for Shape Changing Interfaces. Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology, ACM, 13--22. http://doi.org/10.1145/2501988.2502037","paperID":"None"}],"abstract":"Research on shape-changing interfaces has explored various technologies, parameters for shape changes, and transformations between shapes. While much is known about how to implement these variations, it is unclear what affordance they provide, how users understand their relation to the underlying system state, and how feedback via shape change is perceived. We investigated this by studying how 15 participants perceived and used 13 shape-changing buttons. The buttons covered several aspects of affordance, system state, and feedback, including invite-to-touch movements, two styles of transition animation, and two actuation technologies. Participants explored and interacted with the buttons while thinking aloud. The results show that affordances are hard to communicate clearly with shape change; while some movements invited actions, others were seen as a malfunction. The best clue as to button state was provided by the position of the button in combination with vibration. Linear transition animation for changes in button state was the best received form of shape-change feedback. We discuss also how these findings can inform the design of shape-changing interfaces more generally.","title":"Understanding Affordance, System State, and Feedback in Shape-Changing Buttons","filename":"CHI16/p2752","authors":["John Tiab","Kasper Hornbæk"],"conference":"CHI '16"}