{"paperId":2858380,"citation":[],"reference":[{"content":"June Ahn, Tamara Clegg, Jason C. Yip, Elizabeth Bonsignore, Daniel Pauw, Michael Gubbels, Charley Lewites, & Emily Rhodes. 2014. Seeing the unseen learner: Designing and using social media to recognize children's science dispositions in action. Learning Media & Technology. http://dx.doi.org/10.1080/17439884.2014.964254","paperID":"None"},{"content":"Morgan G. Ames, Janet Go, Joseph 'Jofish' Kaye, and Mirjana Spasojevic. 2010. Making love in the network closet: The benefits and work of family videochat. Proceedings of ACM Conference on Computer Supported Cooperative Work (CSCW'10), ACM, 145- 154. http://dl.acm.org/citation.cfm?id=1718946","paperID":"None"},{"content":"Kaisa Aunola and Jari-Erik Nurmi. 2005. The role of parenting styles in children's problem behavior. Child Development 76, 6: 1144-1159.","paperID":"None"},{"content":"Kaisa Aunola, Håkan Stattin, and Jari-Erik Nurmi. 2000. Parenting styles and adolescents' achievement strategies. Journal of Adolescence 23, 2: 205-222.","paperID":"None"},{"content":"Brigid Barron, Caitlin Kennedy Martin, Lori Takeuchi, and Rachel Fithian. 2009. Parents as learning partners in the development of technological fluency. International Journal of Learning and Media 1, 2: 55- 77. http://doi.org/10.1162/ijlm.2009.0021","paperID":"None"},{"content":"Diana Baumrind. 1991. The influence of parenting style on adolescent competence and substance use. The Journal of Early Adolescence 11, 1: 56-95.","paperID":"None"},{"content":"S. Bødker, P. Ehn, D. Sjögren, and Y. Sundblad. 2000. Co-operative design - Perspectives on 20 years with \"the Scandinavian IT Design Model.\" In Proc. of NordiCHI 2000, 1-9.","paperID":"None"},{"content":"Tamara Clegg, Elizabeth Bonsignore, June Ahn, Jason C. Yip, Daniel Pauw, and Michael Gubbels. 2014. Capturing personal and social science: Technology for integrating the building blocks of disposition. In Proceedings of the Eleventh International Conference of the Learning Sciences.","paperID":"None"},{"content":"A. Collins, D. Joseph, and K. Bielaczyc. 2004. Design research: Theoretical and methodological issues. The Journal of the Learning Sciences 13, 1: 15-42.","paperID":"None"},{"content":"Christian M. Connell and Ronald J. Prinz. 2002. The impact of childcare and parent-child interactions on school readiness and social skills development for lowincome African American children. Journal of School Psychology 40, 2: 177-193.","paperID":"None"},{"content":"J. W. Creswell. 1998. Qualitative Inquiry and Research Design: Choosing Among Five Traditions. Sage Publications, Thousand Oaks, CA.","paperID":"None"},{"content":"Thomas Dalsgaard, Mikael B. Skov, Malthe Stougaard, and Bo Thomassen. 2006. Mediated intimacy in families: Understanding the relation between children and parents. Proceedings of the 2006 Conference on Interaction Design and Children, ACM, 145-152. http://dl.acm.org/citation.cfm?id=1139110","paperID":"None"},{"content":"Thomas Dalsgaard, Mikael B. Skov, and Bo Ramsdahl Thomassen. 2007. eKISS: sharing experiences in families through a picture blog. Proceedings of the 21st British HCI Group Annual Conference on People and Computers, British Computer Society, 67-75. http://dl.acm.org/citation.cfm?id=1531304","paperID":"None"},{"content":"Nancy Darling and Laurence Steinberg. 1993. Parenting style as context: An integrative model. Psychological Bulletin 113, 3: 487.","paperID":"None"},{"content":"Eugene Lee Davids and Nicolette Vanessa Roman. 2014. A systematic review of the relationship between parenting styles and children's physical activity. African Journal for Physical, Health Education, Recreation and Dance 20: 228-246.","paperID":"None"},{"content":"Francine DeHue, Catherine Bolman, and Trijntje Völlink. 2008. Cyberbullying: Youngsters' experiences and parental perception. CyberPsychology & Behavior 11, 2: 217-223.","paperID":"None"},{"content":"Allison Druin. 1999. Cooperative Inquiry: Developing new technologies for children with children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99), 592-599.","paperID":"None"},{"content":"Allison Druin. 2002. The role of children in the design of new technology. Behaviour and Information Technology 21, 1: 1-25.","paperID":"None"},{"content":"Allison Druin, Benjamin B. Bederson, and Alex Quinn. 2009. Designing intergenerational mobile storytelling. Proceedings of the 8th International Conference on Interaction Design and Children, ACM, 325-328. http://dl.acm.org/citation.cfm?id=1551875","paperID":"None"},{"content":"Batya Friedman. 1996. Value-sensitive design. Interactions 3, 6: 16-23.","paperID":"None"},{"content":"Batya Friedman, Peter H. Kahn Jr, and Alan Borning. 2003. Value sensitive design: Theory and methods. Retrieved September 10, 2015 from http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1 .1.58.6046","paperID":"None"},{"content":"James Paul Gee. 2000. Identity as an analytic lens for research in education. Review of Research in Education: 99-125.","paperID":"None"},{"content":"Mona Leigh Guha, Allison Druin, Gene Chipman, Jerry Alan Fails, Sante Simms, and Allison Farber. 2004. Mixing ideas: A new technique for working with young children as design partners. In Proceedings of Interaction Design and Children, ACM, 35-42. http://doi.acm.org/10.1145/1017833.1017838","paperID":"None"},{"content":"Mona Leigh Guha, Allison Druin, and Jerry Alan Fails. 2013. Cooperative inquiry revisited: Reflections of the past and guidelines for the future of intergenerational co-design. International Journal of Child-Computer Interaction 1, 1: 14-23.","paperID":"None"},{"content":"Shirley Brice Heath. 1983. Ways with Words: Language, Life and Work in Communities and Classrooms. Cambridge University Press.","paperID":"None"},{"content":"Donell Holloway, Lelia Green, and Sonia Livingstone. 2013. Zero to Eight: Young Children and Their Internet use. EU Kids Online, LSE, London. Retrieved August 19, 2014 from http://www.cci.edu.au/reports/ZerotoEight.pdf","paperID":"None"},{"content":"K. Holtzblatt and S. Jones. 1993. Contextual inquiry: A participatory technique for system design. In Participatory Design: Principles and Practices, Douglas Schuler and Aki Namioka (eds.). CRC Press, 177-210.","paperID":"None"},{"content":"Hilary Hutchinson, Wendy Mackay, Bo Westerlund, et al. 2003. Technology probes: Inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 17-24. http://dl.acm.org/citation.cfm?id=642616","paperID":"None"},{"content":"Sara Isola and Jerry Alan Fails. 2012. Family and design in the IDC and CHI communities. In Proceedings of the 11th International Conference on Interaction Design and Children, ACM, 40-49. http://dl.acm.org/citation.cfm?id=2307102","paperID":"None"},{"content":"Nancy Kaplan and Yoram Chisik. 2005. Reading alone together: Creating sociable digital library books. In Proceedings of the 2005 Conference on Interaction Design and Children, ACM, 88-94. http://dl.acm.org/citation.cfm?id=1109552","paperID":"None"},{"content":"F. Kensing and J. Blomberg. 1998. Participatory design: Issues and concerns. Computer Supported Cooperative Work (CSCW) 7, 3--4: 167-185.","paperID":"None"},{"content":"Jean. Lave and E. Wenger. 1991. Situated Learning: Legitimate Peripheral Participation. Cambridge University Press, Cambridge, England.","paperID":"None"},{"content":"Sinna Lindquist, Bo Westerlund, Yngve Sundblad, Helena Tobiasson, Michel Beaudouin-Lafon, and Wendy Mackay. 2007. Co-designing communication technology with and for families-Methods, experience, results and impact. In The Disappearing Computer, N. Streitz, A. Kameas and I. Mavrommati, (eds.), Springer, 99-119.","paperID":"None"},{"content":"Sonia Livingstone. 2008. Taking risky opportunities in youthful content creation: teenagers' use of social networking sites for intimacy, privacy and selfexpression. New Media & Society 10, 3: 393-411.","paperID":"None"},{"content":"Sonia Livingstone and Magdalena Bober. 2006. Regulating the internet at home: contrasting the perspectives of children and parents. Digital generations: Children, Young People, and New Media: 93-113.","paperID":"None"},{"content":"Gretchen Livingston. Less than half of U.S. kids today live in a \"traditional\" family | Pew Research Center. Retrieved September 11, 2015 from http://www.pewresearch.org/fact-tank/2014/12/22/lessthan-half-of-u-s-kids-today-live-in-a-traditionalfamily/","paperID":"None"},{"content":"May O. Lwin, Andrea JS Stanaland, and Anthony D. Miyazaki. 2008. Protecting children's privacy online: How parental mediation strategies affect website safeguard effectiveness. Journal of Retailing 84, 2: 205-217.","paperID":"None"},{"content":"S.B. Merriam. 2009. Qualitative Research: A Guide to Design and Implementation. John Wiley and Sons, San Francisco, CA.","paperID":"None"},{"content":"Gustavo S. Mesch. 2009. Parental mediation, online activities, and cyberbullying. CyberPsychology & Behavior 12, 4: 387-393.","paperID":"None"},{"content":"Evelyn Milien, Camille Roux, and Caroline Golanski. 2004. Involving families in a design process. PDC, 187-190. Retrieved September 10, 2015 from http://rossy.ruc.dk/ojs/index.php/pdc/article/view/346","paperID":"None"},{"content":"Meredith Minkler. 1994. Grandparents as parents. Ageing International 21, 1: 24-28.","paperID":"None"},{"content":"Carman Neustaedter and A. J. Bernheim Brush. 2006. LINC-ing the family: the participatory design of an inkable family calendar. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 141-150. http://dl.acm.org/citation.cfm?id=1124796","paperID":"None"},{"content":"Elinor Ochs. 1993. Constructing social identity: A language socialization perspective. Research on language and Social Interaction 26, 3: 287-306.","paperID":"None"},{"content":"Mark O'Hara. 2011. Young children's ICT experiences in the home: Some parental perspectives. Journal of Early Childhood Research 9, 3: 220-231. doi:10.1177/1476718X10389145","paperID":"None"},{"content":"C. Pandya, J. Batalova, and M. McHugh. 2011. Limited English Proficient Individuals in the United States: Number, Share, Growth, and Linguistic Diversity. Migration Policy Institute, Washington, D.C.","paperID":"None"},{"content":"Pew Research Center. 2013. A Survey of LGBT Americans: Attitudes, Experiences and Values in Changing Times. Pew Research Center.","paperID":"None"},{"content":"Lydia Plowman and Joanna McPake. 2013. Seven myths about young children and technology. Childhood Education 89, 1: 27-33.","paperID":"None"},{"content":"Lydia Plowman, Joanna McPake, and Christine Stephen. 2010. The technologisation of childhood? Young children and technology in the home. Children & Society 24, 1: 63-74.","paperID":"None"},{"content":"Lydia Plowman, Christine Stephen, and Joanna McPake. 2010. Supporting young children's learning with technology at home and in preschool. Research Papers in Education 25, 1: 93-113.","paperID":"None"},{"content":"Martha Putallaz and Anne Hope Heflin. 1990. Parentchild interaction. In Peer Rejection in Childhood, Steven R. Asher and John D. Coie (eds.). CUP Archive, 189-216.","paperID":"None"},{"content":"Hayes Raffle, Rafael Ballagas, Glenda Revelle, et al. 2010. Family story play: reading with young children (and Elmo) over a distance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1583-1592. http://dl.acm.org/citation.cfm?id=1753563","paperID":"None"},{"content":"Diane Scott-Jones. 1995. Parent-child interactions and school achievement. In The Family-School Connection: Theory, Research, and Practice, Bruce A. Ryan, G.R. Adams, T.P. Gullotta, R.P. Weissberg and R.L. Hampton (eds.). SAGE, 75-107.","paperID":"None"},{"content":"Shaheen Shariff. 2008. Cyber-bullying: Issues and Solutions for the School, the Classroom and the Home. Routledge.","paperID":"None"},{"content":"Christopher Spera. 2005. A review of the relationship among parenting practices, parenting styles, and adolescent school achievement. Educational Psychology Review 17, 2: 125-146.","paperID":"None"},{"content":"A. L Strauss and J. Corbin. 2007. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory, 3rd ed. SAGE Publications.","paperID":"None"},{"content":"Lori Takeuchi and Reed Stevens. 2011. The New Coviewing: Designing for Learning Through Joint Media Engagement. The Joan Ganz Cooney Center at Sesame Workshop. Retrieved January 4, 2014 from http://www.joanganzcooneycenter.org/Reportsasc.html","paperID":"None"},{"content":"Frank Vetere, Martin R. Gibbs, Jesper Kjeldskov, et al. 2005. Mediating intimacy: Designing technologies to support strong-tie relationships. In Proceedings of the SIGCHI Conference on Human factors in Computing Systems, 471-480. http://dl.acm.org/citation.cfm?id=1055038","paperID":"None"},{"content":"Greg Walsh, Allison Druin, Mona Leigh Guha, et al. 2010. Layered elaboration: a new technique for codesign with children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1237-1240. http://doi.org/10.1145/1753326.1753512","paperID":"None"},{"content":"Greg Walsh, Elizabeth Foss, Jason C. Yip, and Allison Druin. 2013. FACIT PD: Framework for analysis and creation of intergenerational techniques for participatory design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2893-2902.","paperID":"None"},{"content":"Wendy Wang and Kim Parker. 2014. Record Share of Americans Have Never Married | Pew Research Center. Retrieved September 11, 2015 from http://www.pewsocialtrends.org/2014/09/24/recordshare-of-americans-have-never-married/","paperID":"None"},{"content":"Ellen Wartella and Michael Robb. 2008. Historical and recurring concerns about children's use of the mass media. In The Handbook of Children, Media, and Development, S.L. Calvert and B.J. Wilson (eds.). John Wiley & Sons, United Kingdom, 7-26.","paperID":"None"},{"content":"Ellen Wartella, Vikki Rideout, Alexis Lauricella, and Sabrina Connell. 2013. Parenting in the Age of Digital Technology: A National Survey. Center on Media and Human Development, Northwestern University, Evanston, IL.","paperID":"None"},{"content":"Bo Westerlund, Sinnna Lindqvist, Wendy Mackay, and Yngve Sundblad. 2003. Co-design methods for designing with and for families. In Proceedings of EAD 3.","paperID":"None"},{"content":"Bo Xie, Allison Druin, Jerry Fails, et al. 2012. Connecting generations: Developing co-design methods for older adults and children. Behaviour & Information Technology 31, 4: 413-423.","paperID":"None"},{"content":"Svetlana Yarosh and Gregory D. Abowd. 2011. Mediated parent-child contact in work-separated families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1185- 1194. http://dl.acm.org/citation.cfm?id=1979120","paperID":"None"},{"content":"Svetlana Yarosh, Yee Chieh, and Gregory D. Abowd. 2009. Supporting parent-child communication in divorced families. International Journal of HumanComputer Studies 67, 2: 192-203.","paperID":"None"},{"content":"Jason C. Yip, June Ahn, Tamara Clegg, Elizabeth Bonsignore, Daniel Pauw, and Michael Gubbels. 2014. \"It helped me do my science.\" A case of designing social media technologies for children in science learning. In Proceedings of the 2014 Conference on Interaction Design and Children, ACM, 155--164","paperID":"None"},{"content":"Jason C. Yip, Tamara Clegg, Elizabeth Bonsignore, Helene Gelderblom, Emily Rhodes, and Allison Druin. 2013. Brownies or Bags-of-Stuff? Domain expertise in Cooperative Inquiry with children. In Proceedings of the 2013 Conference on Interaction Design and Children, ACM, 201-210.","paperID":"None"}],"abstract":"Partnering with parents and children in the design process can be important for producing technologies that take into consideration the rich context of family life. However, to date, few studies have examined the actual process of designing with families and their children. Without understanding the process, we risk making poor design choices in user-interactive experiences that take into account important family dynamics. The purpose of this investigation is to understand how parent-child relationships in families shape co-design processes and how they are reshaped through co-design. We document the evolutionary process and outcomes that exist in co-design partnerships between researchers and families. We found that parents' engagement patterns shifted more slowly than that of children's from observing and facilitating to design partnering practices. Our analysis suggests the importance of establishing and nurturing social bonds among parents, children, and researchers in the co-design process.","title":"The Evolution of Engagements and Social Bonds During Child-Parent Co-design","filename":"CHI16/p3607","authors":["Jason C. Yip","Tamara Clegg","June Ahn","Judith Odili Uchidiuno","Elizabeth Bonsignore","Austin Beck","Daniel Pauw","Kelly Mills"],"conference":"CHI '16"}