{"paperId":2858369,"citation":[],"abstract":"Autonomous systems are designed to take actions on behalf of users, acting autonomously upon data from sensors or online sources. As such, the design of interaction mechanisms that enable users to understand the operation of autonomous systems and flexibly delegate or regain control is an open challenge for HCI. Against this background, in this paper we report on a lab study designed to investigate whether displaying the confidence of an autonomous system about the quality of its work, which we call its confidence information, can improve user acceptance and interaction with autonomous systems. The results demonstrate that confidence information encourages the usage of the autonomous system we tested, compared to a situation where such information is not available. Furthermore, an additional contribution of our work is the method we employ to study users' incentives to do work in collaboration with the autonomous system. In experiments comparing different incentive strategies, our results indicate that our translation of behavioural economics research methods to HCI can support the study of interactions with autonomous systems in the lab.","reference":[{"content":"Alper Alan, Enrico Costanza, Joel Fischer, Sarvapali D. Ramchurn, Tom Rodden, and Nicholas R. Jennings. 2014. A Field Study of Human-agent Interaction for Electricity Tariff Switching. In Proceedings of the 2014 International Conference on Autonomous Agents and Multi-agent Systems (AAMAS '14). International Foundation for Autonomous Agents and Multiagent Systems, Richland, SC, 965-972. http://dl.acm.org/citation.cfm?id=2615731.2617400","paperID":"None"},{"content":"Stavros Antifakos, Nicky Kern, Bernt Schiele, and Adrian Schwaninger. 2005. Towards Improving Trust in Context-aware Systems by Displaying System Confidence. In Proceedings of the 7th International Conference on Human Computer Interaction with Mobile Devices & Services (MobileHCI '05). ACM, NY, NY, USA, 9-14. DOI: http://dx.doi.org/10.1145/1085777.1085780","paperID":"None"},{"content":"Stavros Antifakos, Adrian Schwaninger, and Bernt Schiele. 2004. Evaluating the Effects of Displaying Uncertainty in Context-Aware Applications. In UbiComp 2004: Ubiquitous Computing, Nigel Davies, ElizabethD. Mynatt, and Itiro Siio (Eds.). Lecture Notes in Computer Science, Vol. 3205. Springer Berlin Heidelberg, 54-69. DOI: http://dx.doi.org/10.1007/978--3--540--30119--6_4","paperID":"None"},{"content":"Dan Ariely, Emir Kamenica, and Draen Prelec. 2008. Man's search for meaning: The case of Legos. Journal of Economic Behavior & Organization 67, 34 (2008), 671 - 677. DOI: http://dx.doi.org/10.1016/j.jebo.2008.01.004","paperID":"None"},{"content":"Johannes Beller, Matthias Heesen, and Mark Vollrath. 2013. Improving the Driver-Automation Interaction: An Approach Using Automation Uncertainty. Human Factors 55, 6 (2013), 1130-1141. DOI: http://dx.doi.org/10.1177/0018720813482327","paperID":"None"},{"content":"Jacky Bourgeois, Janet van der Linden, Gerd Kortuem, Blaine A. Price, and Christopher Rimmer. 2014. Conversations with My Washing Machine: An In-the-wild Study of Demand Shifting with Self-generated Energy. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, NY, NY, USA, 459-470. DOI: http://dx.doi.org/10.1145/2632048.2632106","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77-101.","paperID":"None"},{"content":"Enrico Costanza, Joel E. Fischer, James A. Colley, Tom Rodden, Sarvapali D. Ramchurn, and Nicholas R. Jennings. 2014. Doing the Laundry with Agents: A Field Trial of a Future Smart Energy System in the Home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 813-822. DOI: http://dx.doi.org/10.1145/2556288.2557167","paperID":"None"},{"content":"E Greef de Tjerk, FR Arciszewski Henryk, and Mark A Neerincx. 2010. Adaptive automation based on an object-oriented task model: Implementation and evaluation in a realistic c2 environment. Journal of Cognitive Engineering and Decision Making 4, 2 (2010), 152-182.","paperID":"None"},{"content":"David Dearman, Alex Varshavsky, Eyal De Lara, and Khai N. Truong. 2007. An Exploration of Location Error Estimation. In Proceedings of the 9th International Conference on Ubiquitous Computing (UbiComp '07). Springer-Verlag, Berlin, Heidelberg, 181-198. http://dl.acm.org/citation.cfm?id=1771592.1771603","paperID":"None"},{"content":"Frederic Dehais, Vsevolod Peysakhovich, Sebastien Scannella, Jennifer Fongue, and Thibault Gateau. 2015. \"Automation Surprise\" in Aviation: Real-Time Solutions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2525-2534. DOI: http://dx.doi.org/10.1145/2702123.2702521","paperID":"None"},{"content":"Munjal Desai, Poornima Kaniarasu, Mikhail Medvedev, Aaron Steinfeld, and Holly Yanco. 2013. Impact of Robot Failures and Feedback on Real-time Trust. In Proceedings of the 8th ACM/IEEE International Conference on Human-robot Interaction (HRI '13). IEEE Press, Piscataway, NJ, USA, 251-258. http://dl.acm.org/citation.cfm?id=2447556.2447663","paperID":"None"},{"content":"Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From Game Design Elements to Gamefulness: Defining \"Gamification\". In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (MindTrek '11). ACM, NY, NY, USA, 9-15. DOI: http://dx.doi.org/10.1145/2181037.2181040","paperID":"None"},{"content":"Mary T. Dzindolet, Linda G. Pierce, Hall P. Beck, and Lloyd A. Dawe. 2002. The Perceived Utility of Human and Automated Aids in a Visual Detection Task. Human Factors 44, 1 (2002), 79-94. DOI: http://dx.doi.org/10.1518/0018720024494856","paperID":"None"},{"content":"Joel E. Fischer, Sarvapali D. Ramchurn, Michael Osborne, Oliver Parson, Trung Dong Huynh, Muddasser Alam, Nadia Pantidi, Stuart Moran, Khaled Bachour, Steve Reece, Enrico Costanza, Tom Rodden, and Nicholas R. Jennings. 2013. Recommending Energy Tariffs and Load Shifting Based on Smart Household Usage Profiling. In Proceedings of the 2013 International Conference on Intelligent User Interfaces (IUI '13). ACM, NY, NY, USA, 383-394. DOI: http://dx.doi.org/10.1145/2449396.2449446","paperID":"None"},{"content":"Jodi Forlizzi and Carl DiSalvo. 2006. Service Robots in the Domestic Environment: A Study of the Roomba Vacuum in the Home. In Proceedings of the 1st ACM SIGCHI/SIGART Conference on Human-robot Interaction (HRI '06). ACM, NY, NY, USA, 258-265. DOI: http://dx.doi.org/10.1145/1121241.1121286","paperID":"None"},{"content":"Michael A. Goodrich, Timothy W. McLain, Jeffrey D. Anderson, Jisang Sun, and Jacob W. Crandall. 2007. Managing Autonomy in Robot Teams: Observations from Four Experiments. In Proceedings of the ACM/IEEE International Conference on Human-robot Interaction (HRI '07). ACM, NY, NY, USA, 25-32. DOI: http://dx.doi.org/10.1145/1228716.1228721","paperID":"None"},{"content":"Tove Helldin, Goran Falkman, Maria Riveiro, and Staffan Davidsson. 2013. Presenting System Uncertainty in Automotive UIs for Supporting Trust Calibration in Autonomous Driving. In Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '13). ACM, NY, NY, USA, 210-217. DOI: http://dx.doi.org/10.1145/2516540.2516554","paperID":"None"},{"content":"Tove Helldin, Ulrika Ohlander, Goran Falkman, and Maria Riveiro. 2014. Transparency of Automated Combat Classification. In Engineering Psychology and Cognitive Ergonomics. Springer, 22-33. DOI: http://dx.doi.org/10.1007/978--3--319-07515-0_3","paperID":"None"},{"content":"N. R. Jennings, L. Moreau, D. Nicholson, S. Ramchurn, S. Roberts, T. Rodden, and A. Rogers. 2014. Human-agent Collectives. Commun. ACM 57, 12 (Nov. 2014), 80-88. DOI: http://dx.doi.org/10.1145/2629559","paperID":"None"},{"content":"Daniel Kahneman. 2011. Thinking, fast and slow. Macmillan.","paperID":"None"},{"content":"Daniel Kahneman and Amos Tversky. 1984. Choices, values, and frames. American Psychologist 39, 4 (1 April 1984), 341-350. DOI: http://dx.doi.org/10.1037/0003-066x.39.4.341","paperID":"None"},{"content":"Min Kyung Lee, Sara Kiesler, and Jodi Forlizzi. 2011. Mining Behavioral Economics to Design Persuasive Technology for Healthy Choices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 325-334. DOI: http://dx.doi.org/10.1145/1978942.1978989","paperID":"None"},{"content":"Hendrik Lemelson, Thomas King, and Wolfgang Effelsberg. 2008. A Study on User Acceptance of Error Visualization Techniques. In Proceedings of the 5th Annual International Conference on Mobile and Ubiquitous Systems: Computing, Networking, and Services (Mobiquitous '08). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, Brussels, Belgium, Belgium, Article 53, 6 pages. DOI: http://dx.doi.org/10.4108/ICST.MOBIQUITOUS2008.3889","paperID":"None"},{"content":"M. Lewis, Huadong Wang, Shih-Yi Chien, P. Scerri, P. Velagapudi, K. Sycara, and B. Kane. 2010. Teams organization and performance in multi-human/multi-robot teams. In Systems Man and Cybernetics (SMC), 2010 IEEE International Conference on. 1617-1623. DOI: http://dx.doi.org/10.1109/ICSMC.2010.5642379","paperID":"None"},{"content":"Brian Y. Lim and Anind K. Dey. 2011. Investigating Intelligibility for Uncertain Context-aware Applications. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11). ACM, NY, NY, USA, 415-424. DOI: http://dx.doi.org/10.1145/2030112.2030168","paperID":"None"},{"content":"Lanny Lin and Michael A. Goodrich. 2015. Sliding Autonomy for UAV Path-Planning: Adding New Dimensions to Autonomy Management. In Proceedings of the 2015 International Conference on Autonomous Agents and Multiagent Systems (AAMAS '15). International Foundation for Autonomous Agents and Multiagent Systems, Richland, SC, 1615-1624. http://dl.acm.org/citation.cfm?id=2772879.2773357","paperID":"None"},{"content":"John M. McGuirl and Nadine B. Sarter. 2006. Supporting Trust Calibration and the Effective Use of Decision Aids by Presenting Dynamic System Confidence Information. Human Factors: The Journal of the Human Factors and Ergonomics Society 48, 4 (2006), 656-665. DOI: http://dx.doi.org/10.1518/001872006779166334","paperID":"None"},{"content":"Raja Parasuraman, Robert Molloy, and Indramani L. Singh. 1993. Performance Consequences of Automation-Induced 'Complacency'. The International Journal of Aviation Psychology 3, 1 (1993), 1-23. DOI: http://dx.doi.org/10.1207/s15327108ijap0301_1","paperID":"None"},{"content":"Sarvapali Ramchurn, Joel Fischer, Yuki Ikuno, Feng Wu, Jack Flann, and Antony Waldock. 2015. A Study of Human-Agent Collaboration for Multi-UAV Task Allocation in Dynamic Environments. (2015). http://www.orchid.ac.uk/eprints/id/eprint/242","paperID":"None"},{"content":"Tom A. Rodden, Joel E. Fischer, Nadia Pantidi, Khaled Bachour, and Stuart Moran. 2013. At Home with Agents: Exploring Attitudes Towards Future Smart Energy Infrastructures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1173-1182. DOI: http://dx.doi.org/10.1145/2470654.2466152","paperID":"None"},{"content":"Enrico Rukzio, John Hamard, Chie Noda, and Alexander De Luca. 2006. Visualization of Uncertainty in Context Aware Mobile Applications. In Proceedings of the 8th Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '06). ACM, NY, NY, USA, 247-250. DOI: http://dx.doi.org/10.1145/1152215.1152267","paperID":"None"},{"content":"Thomas B Sheridan and William L Verplank. 1978. Human and computer control of undersea teleoperators. Technical Report. DTIC Document.","paperID":"None"},{"content":"P.J. Smith, C.E. McCoy, and C. Layton. 1997. Brittleness in the design of cooperative problem-solving systems: the effects on user performance. Systems, Man and Cybernetics, Part A: Systems and Humans, IEEE Transactions on 27, 3 (May 1997), 360-371. DOI: http://dx.doi.org/10.1109/3468.568744","paperID":"None"},{"content":"Ja-Young Sung, Lan Guo, RebeccaE. Grinter, and HenrikI. Christensen. 2007. My Roomba Is Rambo: Intimate Home Appliances. In UbiComp 2007: Ubiquitous Computing, John Krumm, GregoryD. Abowd, Aruna Seneviratne, and Thomas Strang (Eds.). Lecture Notes in Computer Science, Vol. 4717. Springer Berlin Heidelberg, 145-162. DOI: http://dx.doi.org/10.1007/978--3--540--74853--3_9","paperID":"None"},{"content":"Jijun Wang, Michael Lewis, and Paul Scerri. 2006. Cooperating robots for search and rescue. In Agent Technology for Disaster Management Workshop at AAMAS, Vol. 6.","paperID":"None"},{"content":"Rayoung Yang and Mark W. Newman. 2013. Learning from a Learning Thermostat: Lessons for Intelligent Systems for the Home. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 93-102. DOI: http://dx.doi.org/10.1145/2493432.2493489","paperID":"None"},{"content":"Rayoung Yang, Mark W. Newman, and Jodi Forlizzi. 2014. Making Sustainability Sustainable: Challenges in the Design of Eco-interaction Technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 823-832. DOI: http://dx.doi.org/10.1145/2556288.2557380","paperID":"None"}],"title":"The Effect of Displaying System Confidence Information on the Usage of Autonomous Systems for Non-specialist Applications: A Lab Study","filename":"CHI16/p4908","authors":["Jhim Kiel M. Verame","Enrico Costanza","Sarvapali D. Ramchurn"],"conference":"CHI '16"}