{"paperId":2858207,"citation":[],"abstract":"History of mental illness is a major factor behind suicide risk and ideation. However research efforts toward characterizing and forecasting this risk is limited due to the paucity of information regarding suicide ideation, exacerbated by the stigma of mental illness. This paper fills gaps in the literature by developing a statistical methodology to infer which individuals could undergo transitions from mental health discourse to suicidal ideation. We utilize semi-anonymous support communities on Reddit as unobtrusive data sources to infer the likelihood of these shifts. We develop language and interactional measures for this purpose, as well as a propensity score matching based statistical approach. Our approach allows us to derive distinct markers of shifts to suicidal ideation. These markers can be modeled in a prediction framework to identify individuals likely to engage in suicidal ideation in the future. We discuss societal and ethical implications of this research.","reference":[{"content":"John Aldrich. 1995. Correlations genuine and spurious in Pearson and Yule. Statistical science (1995), 364--376.","paperID":"None"},{"content":"APA American Psychiatric Association, American Psychiatric Association, and others. 1980. Diagnostic and statistical manual of mental disorders. (1980).","paperID":"None"},{"content":"Roy F Baumeister. 1990. Suicide as escape from self. Psychological review 97, 1 (1990), 90.","paperID":"None"},{"content":"Aaron T Beck. 1979. Cognitive therapy of depression. Guilford press.","paperID":"None"},{"content":"Aaron T Beck, Roy Beck, and Maria Kovacs. 1975. Classification of suicidal behaviors: I. Quantifying intent and medical lethality. The American journal of psychiatry (1975).","paperID":"None"},{"content":"Aaron T Beck, Maria Kovacs, and Arlene Weissman. 1979. Assessment of suicidal intention: the Scale for Suicide Ideation. Journal of consulting and clinical psychology 47, 2 (1979), 343.","paperID":"None"},{"content":"Adriel Boals and Kitty Klein. 2005. Word use in emotional narratives about failed romantic relationships and subsequent mental health. Journal of Language and Social Psychology 24, 3 (2005), 252--268.","paperID":"None"},{"content":"Ronald L Bonner and Alexander Rich. 1988. Negative life stress, social problem-solving self-appraisal, and hopelessness: Implications for suicide research. Cognitive Therapy and Research 12, 6 (1988), 549--556.","paperID":"None"},{"content":"Pete Burnap, Walter Colombo, and Jonathan Scourfield. 2015. Machine classification and analysis of suicide-related communication on twitter. In Proceedings of the 26th ACM Conference on Hypertext & Social Media. ACM, 75--84.","paperID":"None"},{"content":"Marco Caliendo and Sabine Kopeinig. 2008. Some practical guidance for the implementation of propensity score matching. Journal of economic surveys 22, 1 (2008), 31--72.","paperID":"None"},{"content":"Jonathan TO Cavanagh, Alan J Carson, Michael Sharpe, and Stephen M Lawrie. 2003. Psychological autopsy studies of suicide: a systematic review. Psychological medicine 33, 03 (2003), 395--405.","paperID":"None"},{"content":"David B Centerbar, Simone Schnall, Gerald L Clore, and Erika D Garvin. 2008. Affective incoherence: when affective concepts and embodied reactions clash. Journal of personality and social psychology 94, 4 (2008), 560.","paperID":"None"},{"content":"Cindy Chung and James W Pennebaker. 2007. The psychological functions of function words. Social communication (2007), 343--359.","paperID":"None"},{"content":"John F Clarkin, RC Friedman, SW Hurt, R Corn, and M Aronoff. 1984. Affective and character pathology of suicidal adolescent and young adult inpatients. Journal of Clinical Psychiatry (1984).","paperID":"None"},{"content":"Gualtiero B Colombo, Pete Burnap, Andrei Hodorog, and Jonathan Scourfield. 2015. Analysing the connectivity and communication of suicidal users on twitter. Computer Communications (2015).","paperID":"None"},{"content":"Glen Coppersmith, Mark Dredze, and Craig Harman. 2014. Quantifying mental health signals in twitter. In ACL Workshop on Computational Linguistics and Clinical Psychology.","paperID":"None"},{"content":"Glen Coppersmith, Mark Dredze, Craig Harman, and Kristy Hollingshead. 2015. From ADHD to SAD: Analyzing the Language of Mental Health on Twitter through Self-Reported Diagnoses. In Proceedings of the Workshop on Computational Linguistics and Clinical Psychology: From Linguistic Signal to Clinical Reality. North American Chapter of the Association for Computational Linguistics, Denver, CO, USA.","paperID":"None"},{"content":"Glen Coppersmith, Craig Harman, and Mark Dredze. 2014. Measuring post traumatic stress disorder in Twitter. In International Conference on Weblogs and Social Media (ICWSM).","paperID":"None"},{"content":"Aron Culotta. 2014. Estimating county health statistics with Twitter. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1335--1344.","paperID":"None"},{"content":"Cristian Danescu-Niculescu-Mizil, Michael Gamon, and Susan Dumais. 2011. Mark my words!: linguistic style accommodation in social media. In Proceedings of the 20th international conference on World wide web. ACM, 745--754.","paperID":"None"},{"content":"Munmun De Choudhury, Scott Counts, and Eric Horvitz. 2013. Predicting postpartum changes in emotion and behavior via social media. In Proceedings of the 2013 ACM annual conference on Human factors in computing systems. ACM, 3267--3276.","paperID":"None"},{"content":"Munmun De Choudhury, Scott Counts, Eric Horvitz, and Aaron Hoff. 2014. Characterizing and Predicting Postpartum Depression from Facebook Data. In Proceedings of the ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM.","paperID":"None"},{"content":"Munmun De Choudhury and Sushovan De. 2014. Mental Health Discourse on reddit: Self-disclosure, Social Support, and Anonymity. In Proc. ICWSM. AAAI.","paperID":"None"},{"content":"Munmun De Choudhury, Michael Gamon, Scott Counts, and Eric Horvitz. 2013. Predicting depression via social media. In AAAI Conference on Weblogs and Social Media.","paperID":"None"},{"content":"Gudrun Dieserud, Espen Røysamb, Øivind Ekeberg, and Pl Kraft. 2001. Toward an integrative model of suicide attempt: A cognitive psychological approach. Suicide and Life-Threatening Behavior 31, 2 (2001), 153--168.","paperID":"None"},{"content":"Thomas E Ellis and Katharine G Ratliff. 1986. Cognitive characteristics of suicidal and nonsuicidal psychiatric inpatients. Cognitive therapy and research 10, 6 (1986), 625--634.","paperID":"None"},{"content":"Yoav Freund and Robert E Schapire. 1999. Large margin classification using the perceptron algorithm. Machine learning 37, 3 (1999), 277--296.","paperID":"None"},{"content":"King-wa Fu, Qijin Cheng, Paul WC Wong, and Paul SF Yip. 2015. Responses to a self-presented suicide attempt in social media. Crisis (2015).","paperID":"None"},{"content":"Lawrence M Glanz, Gretchen L Haas, and John A Sweeney. 1995. Assessment of hopelessness in suicidal patients. Clinical Psychology Review 15, 1 (1995), 49--64.","paperID":"None"},{"content":"Jeffrey T Hancock, Christopher Landrigan, and Courtney Silver. 2007. Expressing emotion in text-based communication. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 929--932.","paperID":"None"},{"content":"Amanda Hass. \"Please Do Not Downvote Anyone Whos Asked for Help\". http://www.slate.com/articles/technology/users/2015 /03/reddit and suicide intervention how social media is changing the cry for.single.html. (????). Accessed: 2015-09-10.","paperID":"None"},{"content":"Christopher M Homan, Naiji Lu, Xin Tu, Megan C Lytle, and Vincent Silenzio. 2014. Social structure and depression in TrevorSpace. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 615--625.","paperID":"None"},{"content":"David J Houghton and Adam N Joinson. 2012. Linguistic markers of secrets and sensitive self-disclosure in Twitter. In System Science (HICSS), 2012 45th Hawaii International Conference on. IEEE, 3480--3489.","paperID":"None"},{"content":"Guido W Imbens and Donald B Rubin. 2015. Causal Inference in Statistics, Social, and Biomedical Sciences. Cambridge University Press.","paperID":"None"},{"content":"Sue Jamison-Powell, Conor Linehan, Laura Daley, Andrew Garbett, and Shaun Lawson. 2012. I can't get no sleep: discussing# insomnia on twitter. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems. ACM, 1501--1510.","paperID":"None"},{"content":"Jared Jashinsky, Scott H Burton, Carl L Hanson, Josh West, Christophe Giraud-Carrier, Michael D Barnes, and Trenton Argyle. 2015. Tracking suicide risk factors through Twitter in the US. Crisis (2015).","paperID":"None"},{"content":"Jody Kashden, William J Fremouw, Ty S Callahan, and Michael D Franzen. 1993. Impulsivity in suicidal and nonsuicidal adolescents. Journal of abnormal child psychology 21, 3 (1993), 339--353.","paperID":"None"},{"content":"Ashiqur R. KhudaBukhsh, Paul N. Bennett, and Ryen W. White. 2015. Building Effective Query Classifiers: A Case Study in Self-harm Intent Detection. In Proceedings of the 24th ACM International Conference on Information and Knowledge Management.","paperID":"None"},{"content":"Mrinal Kumar, Mark Dredze, Glen Coppersmith, and Munmun De Choudhury. 2015. Detecting Changes in Suicide Content Manifested in Social Media Following Celebrity Suicides. In Proceedings of the 26th ACM Conference on Hypertext & Social Media. ACM, 85--94.","paperID":"None"},{"content":"Alex Leavitt. 2015. This is a Throwaway Account: Temporary Technical Identities and Perceptions of Anonymity in a Massive Online Community. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 317--327.","paperID":"None"},{"content":"David Lester. 1974. Demographic versus clinical prediction of suicidal behaviors: A look at some issues. (1974).","paperID":"None"},{"content":"Peter M Lewinsohn, Ian H Gotlib, and John R Seeley. 1995. Adolescent psychopathology: IV. Specificity of psychosocial risk factors for depression and substance abuse in older adolescents. Journal of the American Academy of Child & Adolescent Psychiatry 34, 9 (1995), 1221--1229.","paperID":"None"},{"content":"David D Luxton, Jennifer D June, and Jonathan M Fairall. 2012. Social media and suicide: A public health perspective. American Journal of Public Health 102, S2 (2012), S195--S200.","paperID":"None"},{"content":"Diana MacLean, Sonal Gupta, Anna Lembke, Christopher Manning, and Jeffrey Heer. 2015. Forum77: An Analysis of an Online Health Forum Dedicated to Addiction Recovery. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 1511--1526.","paperID":"None"},{"content":"Daniel McDuff, Amy Karlson, Ashish Kapoor, Asta Roseway, and Mary Czerwinski. 2012. AffectAura: an intelligent system for emotional memory. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 849--858.","paperID":"None"},{"content":"Margaret Mitchell, Kristy Hollingshead, and Glen Coppersmith. 2015. Quantifying the Language of Schizophrenia in Social Media. In Proceedings of the NAACL Workshop on Computational Linguistics and Clinical Psychology.","paperID":"None"},{"content":"Elizabeth L Murnane and Scott Counts. 2014. Unraveling abstinence and relapse: smoking cessation reflected in social media. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 1345--1354.","paperID":"None"},{"content":"Matthew K Nock and Alan E Kazdin. 2002. Examination of affective, cognitive, and behavioral factors and suicide-related outcomes in children and young adolescents. Journal of clinical child and adolescent psychology 31, 1 (2002), 48--58.","paperID":"None"},{"content":"Minsu Park, David W McDonald, and Meeyoung Cha. 2013. Perception Differences between the Depressed and Non-depressed Users in Twitter. In Proceedings of ICWSM.","paperID":"None"},{"content":"Michael J Paul and Mark Dredze. 2011. You Are What You Tweet: Analyzing Twitter for Public Health.. In ICWSM.","paperID":"None"},{"content":"Umashanthi Pavalanathan and Munmun De Choudhury. 2015. Identity Management and Mental Health Discourse in Social Media. In Proceedings of the 24th International Conference on World Wide Web Companion. International World Wide Web Conferences Steering Committee, 315--321.","paperID":"None"},{"content":"C Pawlak, T Pascual-Sanchez, P Rae, W Fischer, and F Ladame. 1999. Anxiety disorders, comorbidity, and suicide attempts in adolescence: A preliminary investigation. European Psychiatry 14, 3 (1999), 132--136.","paperID":"None"},{"content":"Keith Petrie and Richard Brook. 1992. Sense of coherence, self-esteem, depression and hopelessness as correlates of reattempting suicide. British Journal of Clinical Psychology 31, 3 (1992), 293--300.","paperID":"None"},{"content":"Daniel W Prezant and Robert A Neimeyer. 1988. Cognitive predictors of depression and suicide ideation. Suicide and Life-Threatening Behavior 18, 3 (1988), 259--264.","paperID":"None"},{"content":"Michael J Priester and George A Clum. 1993. Perceived problem-solving ability as a predictor of depression, hopelessness, and suicide ideation in a college population. Journal of Counseling Psychology 40, 1 (1993), 79.","paperID":"None"},{"content":"Paul R Rosenbaum and Donald B Rubin. 1983. The central role of the propensity score in observational studies for causal effects. Biometrika 70, 1 (1983), 41--55.","paperID":"None"},{"content":"Donald B Rubin. 2011. Causal inference using potential outcomes. J. Amer. Statist. Assoc. (2011).","paperID":"None"},{"content":"Thomas D Ruder, Gary M Hatch, Garyfalia Ampanozi, Michael J Thali, and Nadja Fischer. 2011. Suicide announcement on Facebook. Crisis: The Journal of Crisis Intervention and Suicide Prevention 32, 5 (2011), 280--282.","paperID":"None"},{"content":"Anita Saltz and Stanley Marsh. 1990. Relationship between hopelessness and ultimate suicide: a replication with psychiatric outpatients. American Journal of Psychiatry 147 (1990), 190--195.","paperID":"None"},{"content":"H Andrew Schwartz, Johannes Eichstaedt, Margaret L Kern, Gregory Park, Maarten Sap, David Stillwell, Michal Kosinski, and Lyle Ungar. 2014. Towards assessing changes in degree of depression through facebook. In Proceedings of the Workshop on Computational Linguistics and Clinical Psychology: From Linguistic Signal to Clinical Reality. 118--125.","paperID":"None"},{"content":"Ralf Schwarzer and Reinhard Fuchs. 1995. Changing risk behaviors and adopting health behaviors: The role of self-efficacy beliefs. Self-efficacy in changing societies (1995), 259--288.","paperID":"None"},{"content":"RJ Senter and EA Smith. 1967. Automated readability index. Technical Report. DTIC Document.","paperID":"None"},{"content":"David Shaffer. 1988. The epidemiology of teen suicide: an examination of risk factors. Journal of Clinical Psychiatry (1988).","paperID":"None"},{"content":"Jianbo Shi and Jitendra Malik. 2000. Normalized cuts and image segmentation. Pattern Analysis and Machine Intelligence, IEEE Transactions on 22, 8 (2000), 888--905.","paperID":"None"},{"content":"Edwin S Shneidman. 1993. Commentary: Suicide as psychache. The Journal of nervous and mental disease 181, 3 (1993), 145--147.","paperID":"None"},{"content":"Morton M Silverman and Ronald W Maris. 1995. The prevention of suicidal behaviors: An overview. Suicide and Life-Threatening Behavior 25, 1 (1995), 10--21.","paperID":"None"},{"content":"Steven John Stack. 2014. Mental Illness and Suicide.","paperID":"None"},{"content":"The Wiley Blackwell Encyclopedia of Health, Illness, Behavior, and Society (2014).","paperID":"None"},{"content":"Hajime Sueki. 2015. The association of suicide-related Twitter use with suicidal behaviour: A cross-sectional study of young internet users in Japan. Journal of affective disorders 170 (2015), 155--160.","paperID":"None"},{"content":"Katherine M Thomas and Marshall Duke. 2007. Depressed writing: Cognitive distortions in the works of depressed and nondepressed poets and writers. Psychology of Aesthetics, Creativity, and the Arts 1, 4 (2007), 204.","paperID":"None"},{"content":"Sho Tsugawa, Yusuke Kikuchi, Fumio Kishino, Kosuke Nakajima, Yuichi Itoh, and Hiroyuki Ohsaki. 2015. Recognizing Depression from Twitter Activity. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3187--3196.","paperID":"None"},{"content":"Hong-Hee Won, Woojae Myung, Gil-Young Song, Won-Hee Lee, Jong-Won Kim, Bernard J Carroll, and Doh Kwan Kim. 2013. Predicting national suicide numbers with social media data. PloS one 8, 4 (2013), e61809.","paperID":"None"},{"content":"G Udny Yule. 1897. On the theory of correlation. Journal of the Royal Statistical Society 60, 4 (1897), 812--854.","paperID":"None"}],"title":"Discovering Shifts to Suicidal Ideation from Mental Health Content in Social Media","filename":"CHI16/p2098","authors":["Munmun De Choudhury","Emre Kiciman","Mark Dredze","Glen Coppersmith","Mrinal Kumar"],"conference":"CHI '16"}