{"paperId":2858262,"abstract":"While email provides numerous benefits in the workplace, it is unclear how patterns of email use might affect key workplace indicators of productivity and stress. We investigate how three email use patterns: duration, interruption habit, and batching, relate to perceived workplace productivity and stress. We tracked email usage with computer logging, biosensors and daily surveys for 40 information workers in their in situ workplace environments for 12 workdays. We found that the longer daily time spent on email, the lower was perceived productivity and the higher the measured stress. People who primarily check email through self-interruptions report higher productivity with longer email duration compared to those who rely on notifications. Batching email is associated with higher rated productivity with longer email duration, but despite widespread claims, we found no evidence that batching email leads to lower stress. We discuss the implications of our results for improving organizational email practices.","reference":[{"content":"U. Rajendra Acharya, K. Paul Joseph, N. Kannathal, Choo Min Lim, and Jasjit S. Suri, 2006. Heart rate variability: A review. Medical & Bio Engineering & Comp 44, 12, 1031--1051.","paperID":"None"},{"content":"Stephen R. Barley, Debra E. Meyerson, and Stine Grodal. 2011. E-mail as a source and symbol of stress. Organization Science 22, 4, 887--906.","paperID":"None"},{"content":"Victoria Bellotti, Nicolas Ducheneaut, Mark Howard, Ian Smith, and Rebecca E. Grinter, R.E. 2005. Quality versus quantity: E-mail-centric task management and its relation with overload. Human-Computer Interaction 20, 1, 89--138.","paperID":"None"},{"content":"Adam Bradley, Duncan P. Brumby, Anna L. Cox, and Jon Bird. 2013. How to manage your inbox: is a once a day strategy best? Proceedings of the 27th International BCS Human Computer Interaction Conference, British Computer Society, 20--26.","paperID":"None"},{"content":"Marta E. Cecchinato, Anna L. Cox, and Jon Bird. 2015. Working 9--5: Professional Differences in Email and Boundary Management Practices. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3989--3998. DOI=10.1145/2702123.2702537 http://doi.acm.org/10.1145/2702123.2702537","paperID":"None"},{"content":"Sheldon Cohen, Tom Kamarck, and Robin Mermelstein. 1983. A global measure of perceived stress. Journal of Health and Social Behavior, 24, 385-","paperID":"None"},{"content":"Fred Collopy. 1996. Biases in retrospective self-reports of time use: An empirical study of computer users. Management Science. 42, 758--767.","paperID":"None"},{"content":"Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A diary study of task switching and interruptions. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI '04). ACM, NY, NY, USA, 175--182. DOI=10.1145/985692.985715 http://doi.acm.org/10.1145/985692.985715","paperID":"None"},{"content":"Laura A. Dabbish and Robert E. Kraut. 2006. Email overload at work: an analysis of factors associated with email strain. Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work (CSCW '06). ACM, NY, NY, USA, 431440. DOI=10.1145/1180875.1180941 http://doi.acm.org/10.1145/1180875.1180941","paperID":"None"},{"content":"Nicolas Ducheneaut and Victoria Bellotti. 2001. Email as habitat: An exploration of embedded personal information management. ACM Interactions. September-October; 8 (5): 30--38.","paperID":"None"},{"content":"Nicolas Ducheneut and Leon A.Watts. 2011. In search of coherence: A review of email research. Human-Computer Interaction, 20:1--2, 11--48.","paperID":"None"},{"content":"Angela Edmunds and Anne Morris. 2000. The problem of information overload in business organizations: a review of the literature. International journal of information management, 20(1), 17--28.","paperID":"None"},{"content":"Martin J. Eppler, and Jeanne Mengis. 2004. The concept of information overload: A review of literature from organization science, accounting, marketing, MIS, and related disciplines. The information society, 20(5), 325--344.","paperID":"None"},{"content":"Danyel Fisher, A. J. Brush, Eric Gleave, and Marc A. Smith. 2006. Revisiting Whittaker & Sidner's \"email overload\" ten years later. Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work (CSCW '06). ACM, NY, NY, USA, 309--312. DOI=10.1145/1180875.1180922 http://doi.acm.org/10.1145/1180875.1180922","paperID":"None"},{"content":"Mario Hair, Karen Renuad, and Judith Ramsay. 2007. The influence of self-esteem and locus of control on perceived email-related stress. Computers in Human Behavior, 23 (6), November 2007, 2791--2803.","paperID":"None"},{"content":"Benjamin V. Hanrahan and Manuel A. Pérez-Quiñones. 2015. Lost in Email: Pulling Users Down a Path of Interaction. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 39813984. DOI=10.1145/2702123.2702351 http://doi.acm.org/10.1145/2702123.2702351","paperID":"None"},{"content":"Shamsi T. Iqbal and Eric Horvitz. 2010. Notifications and awareness: a field study of alert usage and preferences. Proceedings of the 2010 ACM conference on Computer supported cooperative work (CSCW '10). ACM, NY, NY, USA, 27--30. DOI=10.1145/1718918.1718926 http://doi.acm.org/10.1145/1718918.1718926","paperID":"None"},{"content":"Shamsi T. Iqbal and Eric Horvitz. 2007. Disruption and recovery of computing tasks: field study, analysis, and directions. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 677--686. DOI=10.1145/1240624.1240730 http://doi.acm.org/10.1145/1240624.1240730","paperID":"None"},{"content":"Thomas W. Jackson, Ray Dawson, and Darren Wilson. 2003. Understanding email interaction increases organizational productivity. Communications of the ACM 46, 8 (August 2003), 80--84. DOI=10.1145/859670.859673 http://doi.acm.org/10.1145/859670.859673","paperID":"None"},{"content":"Jing Jin and Laura A. Dabbish. 2009. Self-interruption on the computer: a typology of discretionary task interleaving. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1799--1808. DOI=10.1145/1518701.1518979 http://doi.acm.org/10.1145/1518701.1518979","paperID":"None"},{"content":"Robert Karasek, Chantal Brisson, Norito Kawakami, Irene Houtman, Paulien Bongers and Benjamin Amick. 1998. The Job Content Questionnaire (JCQ): an instrument for internationally comparative assessments of psychosocial job characteristics. Journal of occupational health psychology, 3(4), 322--355. DOI= 10.1037/1076--8998.3.4.322.","paperID":"None"},{"content":"Pamela Karr-Wisniewski and Ying Lu. 2010. When more is too much: Operationalizing technology overload and exploring its impact on knowledge worker productivity. Computers in Human Behavior, 26, 1061--1072.","paperID":"None"},{"content":"Kostadin Kushlev and Elizabeth W. Dunn. 2015. Checking email less frequently reduces stress. Computers in Human Behavior, 43, 220--228.","paperID":"None"},{"content":"Daniel J. Levitin, The organized mind: Thinking straight in the age of information overload. Penguin, 2014.","paperID":"None"},{"content":"Rita Mano and Gustavo Mesch. 2010. Email characteristics, work performance and distress. Computers in Human Behavior, 26, 61--69.","paperID":"None"},{"content":"Gloria Mark, Shamsi T. Iqbal, Mary Czerwinski, and Paul Johns. 2015. Focused, aroused, but so distractible: A temporal perspective on multitasking and communications. Proceedings of CSCW 2015, ACM Press, 903--916.","paperID":"None"},{"content":"Gloria Mark, Shamsi T. Iqbal, Mary Czerwinski, and Paul Johns. 2014. Bored Tuesdays and focused afternoons: The rhythm of attention and online activity in the workplace. Proceedings of CHI'14, ACM Press, 3025--3034.","paperID":"None"},{"content":"Gloria Mark, Steven Voida, and Armand Cardello. 2012. \"A Pace Not Dictated by Electrons\": An Empirical Study of Work Without Email. Proceeding of CHI'12, ACM Press, 555--564.","paperID":"None"},{"content":"Robert McCrae and Paul Costa. 1999. The five factor theory of personality. in Handbook of Personality: Theory and Research, L.A. Pervin, O.P. Johns, NY: Guilford, 139--153.","paperID":"None"},{"content":"Laura Marulanda-Carter, and Thomas Jackson. 2012. Effects of e-mail addiction and interruptions on employees. J of Systems and Information Technology,14(1), 82--94.","paperID":"None"},{"content":"Laura Marulanda-Carter, Thomas Jackson, G. Ragsdell. 2010. Developing an email stress measuring methodology to determine the impact email stress has on employee effectiveness. Proceedings of the SQM Conference, March 2010, London.","paperID":"None"},{"content":"Melissa Mazmanian. 2013. Avoiding the trap of constant connectivity: When congruent frames allow for heterogeneous practices. Academy of Management Journal 56.5 (2013): 1225--1250.","paperID":"None"},{"content":"McKinsey (2012). http://www.mckinsey.com/insights/high_tech_telecoms_internet/the_social_economy.","paperID":"None"},{"content":"Catherine Middleton and Wendy Cukier. 2006. Is mobile email functional or dysfunctional? Two perspectives on mobile email usage. European Journal of Information Systems, 15(3) 252--260.","paperID":"None"},{"content":"Karen Renaud, Judith Ramsay, and Mario Hair. 2006. \"You've got e-mail!\"... shall I deal with it now? Electronic mail from the recipient's perspective. International Journal of Human-Computer Interaction, 21(3), 313--332.","paperID":"None"},{"content":"Stever Robbins. 2004.Tips for mastering e-mail overload. Harvard Business School Working Knowledge (2004, Oct 25). http://hbswk.hbs.edu/archive/4438.html.","paperID":"None"},{"content":"Gokturk Sevinc and John D'Ambra. 2010. The Influence of Self-Esteem and Locus of Control on Perceived Email Overload. Proceedings of ECIS 2010.","paperID":"None"},{"content":"Cheri Speier, Joseph S. Valacich, and Iris Vessey. 1999. The influence of task interruption on individual decision making: An information overload perspective. Decision Sciences, 30(2), 337--360.","paperID":"None"},{"content":"David Sumecki, Maxwell Chipulu, and Udechukwu Ojiako. 2011. Email overload: Exploring the moderating role of the perception of email as a \"business critical tool\". International Journal of Information Management 31.5 (2011): 407--414.","paperID":"None"},{"content":"Agnieszka Matysiak Szóstek. 2011. 'Dealing with My Emails': Latent user needs in email management.. Comput. Hum. Behav. 27, 2 (March 2011), 723--729.","paperID":"None"},{"content":"Gail Fann Thomas, Cynthia L. King, Brian Baroni, Linda Cook, Marian Keitelman, Steve Miller, and Adelia Wardle. 2006. Reconceptualizing e-mail overload. J of Business and Technical Communication, 20(3), 252--287.","paperID":"None"},{"content":"Sara Thomée, Annika Härenstam, and Mats Hagberg. 2012. Computer use and stress, sleep disturbances, and symptoms of depression among young adults--a prospective cohort study. BMC psychiatry 12.1 (2012): 176.","paperID":"None"},{"content":"Ian Towers, Linda Duxbury, Christopher Higgins, and John Thomas. 2006. Time thieves and space invaders: technology, work and the organization. Journal of Organizational Change Management, 19(5), 593--618.","paperID":"None"},{"content":"Sherry Turkle. 2010. Alone Together. MIT Press, Cambridge, MA.","paperID":"None"},{"content":"Tanja Vrijkotte, , Lorenz Van Doornen, and Eco De Geus. 2000. Effects of work stress on ambulatory blood pressure, heart rate, and heart rate variability. Hypertension, 35(4), 880--886.","paperID":"None"},{"content":"David Watson, Lee A. Clark, and Auke Tellegen. 1988. A. Development and validation of brief measures of positive and negative affect: The PANAS scales. J of Personality and Social Psychology, 56 (6). 1063--1070.","paperID":"None"},{"content":"Steve Whittaker, Victoria Bellotti, and Jacek Gwizdka. .2006. Email in personal information management. Communications of the ACM, 49(1), Jan. 2006, 68--73.","paperID":"None"},{"content":"Steve Whittaker and Candace Sidner. 1996. Email overload: Exploring personal information management of email. In Proc. CHI 1996, ACM Press, 276--283.","paperID":"None"}],"citation":[],"title":"Email Duration, Batching and Self-interruption: Patterns of Email Use on Productivity and Stress","filename":"CHI16/p1717","authors":["Gloria Mark","Shamsi T. Iqbal","Mary Czerwinski","Paul Johns","Akane Sano","Yuliya Lutchyn"],"conference":"CHI '16"}