{"paperId":2858109,"abstract":"This paper reports on a qualitative interview study of ICT use amongst a population undergoing transition following a life disruption. We interviewed 13 veterans who were re-integrating into civil society. Veterans are unique in that they experience several transitions at once-that is, after returning home, they often suffer from PTSD, become homeless, change occupations, etc. Amongst other things, veterans often undergo identity crises as caused by the lack of continuity between military and civilian social structures. We show how veterans are resilient through their uses of ICTs when navigating identity crises. We find that they use ICTs to develop identity awareness-that is, they connect with a human infrastructure through which they can develop a \"big picture\" understanding of unfamiliar rules and norms and receive support when navigating civil society. We discuss the implications of our study and identify implications for design.","reference":[{"content":"Veterans Health Administration. Review of Alleged Mismanagement at the Health Eligibility Center. Retrieved September 25, 2015 from http://www.va.gov/oig/publications/report-summary.asp?id=3586","paperID":"None"},{"content":"Ash Amin. 2014. Lively infrastructure. Theory, Culture & Society 31, 7--8: 137--161.","paperID":"None"},{"content":"Danah Boyd and Nicole B. Ellison. 2007. Social network sites: Definition, history, and scholarship. Journal of Computer-Mediated Communication 13: 210--230. http://doi.org/10.1111/j.1083--6101.2007.0039x","paperID":"None"},{"content":"William Bridges. 200 Transitions: Making sense of life's changes. Da Capo Press.","paperID":"None"},{"content":"Moira Burke and Robert Kraut. 2013. Using Facebook after losing a job: Differential benefits of strong and weak ties. Proceedings of the 2013 Conference on Computer Supported Cooperative Work, 1419--1430.","paperID":"None"},{"content":"Michel De Certeau. 1998. The practice of everyday life: Living and cooking. U of MN Press.","paperID":"None"},{"content":"Joseph J Collins. 1998. The complex context of American military culture: A practitioner's view. Washington Quarterly 21, 4: 213--228.","paperID":"None"},{"content":"Jonathon Cummings, J Lee, and Robert Kraut. 2006. Communication technology and friendship during the transition from high school to college. Computers, Phones, and the Internet: Domesticating Information Technology: 265--27","paperID":"None"},{"content":"Christopher A Le Dantec and W Keith Edwards. 2008. Designs on dignity: Perceptions of technology among the homeless. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 627--636.","paperID":"None"},{"content":"Christopher A Le Dantec, Robert G Farrell, Jim E Christensen, et al. 2011. Publics in practice: Ubiquitous computing at a shelter for homeless mothers. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1687--1696.","paperID":"None"},{"content":"1Anne Demers. 20 When Veterans return: The role of community in reintegration. Journal of Loss and Trauma 16, 2: 160--179. http://doi.org/10.1080/15325024.2010.519281","paperID":"None"},{"content":"Jill P Dimond, Casey Fiesler, and Amy S Bruckman. 2011. Domestic violence and information communication technologies. Interacting with Computers 23, 5: 413--421.","paperID":"None"},{"content":"Jill P. Dimond, Erika Shehan Poole, and Sarita Yardi. 2010. The effects of life disruptions on home technology routines. Proceedings of the 16th ACM International Conference on Supporting group work, 85--88.","paperID":"None"},{"content":"Tineke M Egyedi and Donna C Mehos. 2012. Inverse infrastructures: Disrupting networks from below. Edward Elgar Publishing.","paperID":"None"},{"content":"Erik H Erikson. 1994. Identity: Youth and crisis. WW Norton & Company.","paperID":"None"},{"content":"Gail Gamache, Robert Rosenheck, and Richard Tessler. 2003. Overrepresentation of women veterans among homeless women. American Journal of Public Health 93, 7: 1132--1136.","paperID":"None"},{"content":"Arnold Van Gennep. 2011. The rites of passage. University of Chicago Press.","paperID":"None"},{"content":"Erving Goffman and others. 1959. The presentation of self in everyday life.","paperID":"None"},{"content":"Oliver L Haimson, Jed R Brubaker, Lynn Dombrowski, and Gillian R Hayes. 2015. Disclosure, stress, and support during gender transition on Facebook. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 1176--1190.","paperID":"None"},{"content":"Pamela Karr-Wisniewski, D Wilson, and H Richter-Lipford. 2011. A new social order: Mechanisms for social network site boundary regulation. Americas Conference on Information Systems.","paperID":"None"},{"content":"2Richard C. Katz. 2009. Application of computers to the treatment of US veterans with aphasia. Aphasiology 23, 9: 1116--1126. http://doi.org/10.1080/02687030701719000","paperID":"None"},{"content":"2Rachel Kimerling, Amy E Street, Joanne Pavao, et al. 2010. Military-related sexual trauma among Veterans Health Administration patients returning from Afghanistan and Iraq. American Journal of Public Health 100, 8: 1409.","paperID":"None"},{"content":"Peter Kollock and Marc Smith. 1996. Managing the virtual commons. Computer-mediated Communication: Linguistic, Social, and Cross-cultural Perspectives: 109--128.","paperID":"None"},{"content":"Debbie Kralik, Kate Visentin, and Antonia Van Loon. 2006. Transition: A literature review. Journal of Advanced Nursing 55, 3: 320--329.","paperID":"None"},{"content":"Airi Lampinen, Vilma Lehtinen, Asko Lehmuskallio, and Sakari Tamminen. 2011. We're in it together: Interpersonal management of disclosure in social network services. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3217--3226.","paperID":"None"},{"content":"Airi Lampinen, Sakari Tamminen, and Antti Oulasvirta. 2009. All my people right here, right now: Management of group co-presence on a social networking site. Proceedings of the ACM 2009 International Conference on Supporting Group Work, 281--290.","paperID":"None"},{"content":"Charlotte P Lee, Paul Dourish, and Gloria Mark. 2006. The human infrastructure of cyberinfrastructure. Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work, 483--492.","paperID":"None"},{"content":"Mary W. Lu, Kathleen I. Woodside, Tracy L. Chisholm, and Mark F. Ward. 2014. Making connections: Suicide prevention and the use of technology with rural veterans. Journal of Rural Mental Health 38, 2: 98--108.","paperID":"None"},{"content":"Gloria Mark and Bryan Semaan. 2008. Resilience in collaboration: technology as a resource for new patterns of action. Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work: 137--146. http://doi.org/10.1145/1460563.1460585","paperID":"None"},{"content":"Mobile Health Marketplace. PE Coach. Retrieved September 25, 2015 from http://www.mobilehealthmarketplace.com/listings/pe-coach-ptsd-support-app/","paperID":"None"},{"content":"3Alice E Marwick and others. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1: 114--133.","paperID":"None"},{"content":"3Michael Massimi, Jill P Dimond, and Christopher A Le Dantec. 2012. Finding a new normal: the role of technology in life disruptions. Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work, 719--728.","paperID":"None"},{"content":"3Ann S Masten. 2001. Ordinary magic: Resilience processes in development. American Psychologist 56, 3: 227.","paperID":"None"},{"content":"MobiHealthNews. 15 Apps from the Department of Veterans Affairs. Retrieved September 25, 2015 from http://mobihealthnews.com/27237/15-apps-from-the-department-of-veterans-affairs/","paperID":"None"},{"content":"Jacquelyn Ford Morie, Jamie Antonisse, Sean Bouchard, and Eric Chance. 2009. Virtual worlds as a healing modality for returning soldiers and Veterans. Studies in Health Technolology and Informatics: Annual Review of Cybertherapy and Telemedicine 7, 1: 273--276. http://doi.org/10.3233/978--1--60750-017--9--273","paperID":"None"},{"content":"National Alliance to End Homelessness. 2015. Veterans. Retrieved September 25, 2015 from http://www.endhomelessness.org/pages/veterans","paperID":"None"},{"content":"3National Institutes of Health. 2015. Post Traumatic Stres Disorder: A Growing Epidemic / Neuroscience and PTSD Treatments. Retrieved September 25, 2015 from https://www.nlm.nih.gov/medlineplus/magazine/issues/winter09/articles/winter09pg10--14.html","paperID":"None"},{"content":"3Blair Nonnecke and Jenny Preece. 2001. Why lurkers lurk. AMCIS 2001 Proceedings: 1--10. Retrieved from http://aisel.aisnet.org/cgi/viewcontent.cgi?article=1733&context=amcis2001","paperID":"None"},{"content":"3Office of Public and Intergovernmental Affairs. 2015. VA Issues New Report on Suicide Data. Retrieved September 25, 2015 from http://www.va.gov/opa/pressrel/pressrelease.cfm?id=2427","paperID":"None"},{"content":"Leysia Palen and Sophia B Liu. 2007. Citizen communications in crisis: Anticipating a future of ICT-supported public participation. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 727--736.","paperID":"None"},{"content":"4Leysia Palen and Sarah Vieweg. 2008. The emergence of online widescale interaction in unexpected events: Assistance, alliance & retreat. Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work, 117--126.","paperID":"None"},{"content":"4Army Career And Alumni Program. Preseparation Timeline. Retrieved September 25, 2015 from https://www.acap.army.mil/pages/transition/preseparation_timeline.aspx","paperID":"None"},{"content":"4Ricardo Ramírez, Balaji Parthasarathy, and Andrew Gordon. 2014. Infomediaries: Brokers of public access.","paperID":"None"},{"content":"4Linda Resnik, Daniel W Bradford, Shirley M Glynn, Alan M Jette, C Johnson Hernandez, and Sharon Wills. 2012. Issues in defining and measuring veteran community reintegration: Proceedings of the working group on community reintegration, VA rehabilitation outcomes conference, Miami, Florida. Journal of Rehabilitation Research and Development 49, 1: 87--100.","paperID":"None"},{"content":"4Jahmeilah Roberson and Bonnie Nardi. 2010. Survival needs and social inclusion: Technology use among the homeless. Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work, 445--448.","paperID":"None"},{"content":"4Corina Sas and Steve Whittaker. 2013. Design for forgetting: Disposing of digital possessions after a breakup. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1823--1832.","paperID":"None"},{"content":"4Nina A Sayer, Siamak Noorbaloochi, Patricia Frazier, Kathleen Carlson, Amy Gravely, and Maureen Murdoch. 2010. Reintegration problems and treatment interests among Iraq and Afghanistan combat veterans receiving VA medical care. Psychiatric Services 61, 6: 589--597.","paperID":"None"},{"content":"4Steven L Sayers. 2011. Family reintegration difficulties and couples therapy for military veterans and their spouses. Cognitive and Behavioral Practice 18, 1: 108--119.","paperID":"None"},{"content":"4Nancy K Schlossberg. 2005. Counseling adults in transition: Linking practice with theory. Springer Publishing Company.","paperID":"None"},{"content":"Bryan Semaan, Heather Faucett, Scott Robertson, Misa Maruyama, and Sara Douglas. 2015. Navigating Imagined Audiences: Motivations for Participating in the Online Public Sphere. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 1158--1169.","paperID":"None"},{"content":"5Bryan Semaan and Gloria Mark. 2011. Technology-mediated social arrangements to resolve breakdowns in infrastructure during ongoing disruption. ACM Transactions on Computer-Human Interaction 18, 4: 1--21. http://doi.org/10.1145/2063231.2063235","paperID":"None"},{"content":"5Irina Shklovski, Robert Kraut, and Jonathon Cummings. 2006. Routine patterns of internet use & psychological well-being: Coping with a residential move. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 969--978.","paperID":"None"},{"content":"5Irina Shklovski, Robert Kraut, and Jonathon Cummings. 2008. Keeping in touch by technology: Maintaining friendships after a residential move. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 807--816.","paperID":"None"},{"content":"5Manya Sleeper, Rebecca Balebako, Sauvik Das, Amber Lynn McConahy, Jason Wiese, and Lorrie Faith Cranor. 2013. The post that wasn't: Exploring self-censorship on facebook. Proceedings of the 2013 Conference on Computer Supported Cooperative Work, 793--802.","paperID":"None"},{"content":"5Madeline E Smith, Duyen T Nguyen, Charles Lai, Gilly Leshed, and Eric P S Baumer. 2012. Going to college and staying connected: Communication between college freshmen and their parents. Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work, 789--798.","paperID":"None"},{"content":"5Susan Leigh Star and Karen Ruhleder. 1996. Steps toward an ecology of infrastructure: Design and access for large information spaces. Information Systems Research 7, 1: 111--134.","paperID":"None"},{"content":"5Anselm Strauss and Juliet M. Corbin. 1990. Basics of qualitative research: Grounded theory procedures and techniques. Sage Publications, Inc.","paperID":"None"},{"content":"5US Census Bureau. 2014. Facts for Feature: Veterans Day 2014: Nov. 11. Retrieved September 25, 2015 from http://www.census.gov/newsroom/facts-for-features/2014/cb14-ff24.html","paperID":"None"},{"content":"5Sarah Vieweg, Amanda L Hughes, Kate Starbird, and Leysia Palen. 2010. Microblogging during two natural hazards events: What twitter may contribute to situational awareness. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1079--1088.","paperID":"None"},{"content":"Karl E Weick. 1993. The collapse of sensemaking in organizations: The Mann Gulch disaster. Administrative Science Quarterly: 628--652.","paperID":"None"},{"content":"6Karl E Weick. 1995. Sensemaking in organizations. Sage.","paperID":"None"},{"content":"6Tom Wengraf. 2001. Qualitative research interviewing: Biographic narrative and semi-structured methods. Sage.","paperID":"None"},{"content":"6Lisa Marin Wexler, Gloria DiFluvio, and Tracey K Burke. 2009. Resilience and marginalized youth: Making a case for personal and collective meaning-making as part of resilience research in public health. Social Science & Medicine 69, 4: 565--570.","paperID":"None"},{"content":"6Aaron B Wildavsky. 1985. Trial without error: Anticipation vs resilience as strategies for risk reduction. Centre for Independent Studies.","paperID":"None"},{"content":"6Todd Woodruff, Ryan Kelty, and David R Segal. 2006. Propensity to serve and motivation to enlist among American combat soldiers. Armed Forces & Society 32, 3: 353--366.","paperID":"None"},{"content":"6Department of Veterans Affairs. Retrieved September 25, 2015 from https://mobile.va.gov/","paperID":"None"},{"content":"6Support for PTSD: PTSD App at Real Warriors. Retrieved September 25, 2015 from http://realwarriors.net/active/treatment/ptsdcoach.php","paperID":"None"}],"citation":[],"title":"Transition Resilience with ICTs: 'Identity Awareness' in Veteran Re-Integration","filename":"CHI16/p2882","authors":["Bryan C. Semaan","Lauren M. Britton","Bryan Dosono"],"conference":"CHI '16"}