{"paperId":2858213,"citation":[],"reference":[{"content":"Zahra S. H. Abad, Craig Anslow and Frank Maurer. 2014. Multi Surface Interactions with Geospatial Data: A Systematic Review. In Proceedings of the 9th ACM International Conference on Interactive Tabletops and Surfaces (ITS '14), 69--78. http://dl.acm.org/citation.cfm?doid=2669485.2669505.","paperID":"None"},{"content":"Jakob E. Bardram. 2005. Activity-based computing: support for mobility and collaboration in ubiquitous computing. Personal Ubiquitous Computing, 9, 5 (September 2005), 312--322. http://dx.doi.org/10.1007/s00779-004-0335--2.","paperID":"None"},{"content":"Jakob E. Bardram, Sofiane Gueddana, Steven Houben and Søren Nielsen. 2012. ReticularSpaces: activitybased computing support for physically distributed and collaborative smart spaces. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2845--2854. http://dx.doi.org/10.1145/2207676.2208689.","paperID":"None"},{"content":"Richard Bentley, J. A. Hughes, D. Randall, T. Rodden, P. Sawyer, D. Shapiro and I. Sommerville. 1992. Ethnographically-informed systems design for air traffic control. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work (CSCW '92), 123--129. http://dx.doi.org/10.1145/143457.143470.","paperID":"None"},{"content":"Mehmet Ilker Berkman and Adem Karahoca. 2012. A direct touch table-top display as a multi-user information kiosk: Comparing the usability of a single display groupware either by a single user or people cooperating as a group. Interacting with Computers, 24, 5 (September 1, 2012), 423--437. http://iwc.oxfordjournals.org/content/24/5/423.abstract.","paperID":"None"},{"content":"Jeanette Blomberg and Helena Karasti. 2013. Reflections on 25 Years of Ethnography in CSCW. Computer Supported Cooperative Work (CSCW), 22, 4--6 (August 2013), 373--423. http://dx.doi.org/10.1007/s10606-0129183-1.","paperID":"None"},{"content":"Susanne Bødker. 2006. When second wave HCI meets third wave challenges. In Proceedings of the 4th Nordic Conference on Human-Computer Interaction (NordiCHI '06), 1--8. http://dx.doi.org/10.1145/1182475.1182476.","paperID":"None"},{"content":"Susanne Bødker and Clemens Nylandsted Klokmose. 2011. The Human-Artifact Model: An Activity Theoretical Approach to Artifact Ecologies. Human-Computer Interaction, 26, 4, 315--371. http://dx.doi.org/10.1080/07370024.2011.626709.","paperID":"None"},{"content":"John Bowers and David Martin. 1999. Informing Collaborative Information Visualisation Through an Ethnography of Ambulance Control. In Proceedings of the 6th European Conference on Computer Supported Cooperative Work (ECSCW '99), 311--330. http://dx.doi.org/10.1007/978-94-011-4441-4_17.","paperID":"None"},{"content":"Brandon Burr. 2006. VACA: a tool for qualitative video analysis. In Proceedings of the CHI '06 Extended Abstracts on Human Factors in Computing Systems 622--627. http://dx.doi.org/10.1145/1125451.1125580.","paperID":"None"},{"content":"Pedro Campos and Alfredo Ferreira. 2015. Collaboration Meets Interactive Surfaces: A Brief Introduction (CSCW). Computer Supported Cooperative Work, 24, 2-3 (June 2015), 75--78. http://dx.doi.org/10.1007/s10606-015-9222-9.","paperID":"None"},{"content":"Haeyong Chung, Chris North, JessicaZeitz Self, Sharon Chu and Francis Quek. 2014. VisPorter: facilitating information sharing for collaborative sensemaking on multiple displays. Personal and Ubiquitous Computing, 18, 5 (June 2014), 1169--1186. http://dx.doi.org/10.1007/s00779-013-0727-2.","paperID":"None"},{"content":"Stéphane Conversy, Hélène Gaspard-Boulinc, Stéphane Chatty, Stéphane Valès, Carole Dupré and Claire Ollagnon. 2011. Supporting air traffic control collaboration with a TableTop system. In Proceedings of the ACM Conference on Computer SupportedCooperative Work (CSCW '11), 425--434. http://dx.doi.org/10.1145/1958824.1958891.","paperID":"None"},{"content":"Pryce Davis, Michael Horn, Florian Block, Brenda Phillips, E. Margaret Evans, Judy Diamond and Chia Shen. 2015. \"Whoa! We're going deep in the trees!\": Patterns of collaboration around an interactive information visualization exhibit. International Journal of Computer-Supported Collaborative Learning, 10, 1 (March 2015), 53--76. http://dx.doi.org/10.1007/s11412015--9209-z.","paperID":"None"},{"content":"Robert Ellis and Peter Goodyear. 2010. Students' experiences of e-learning in higher education: the ecology of sustainable innovation. Routledge, NY.","paperID":"None"},{"content":"Michael Evans and Jochen Rick. 2014. Supporting Learning with Interactive Surfaces and Spaces. In Handbook of Research on Educational Communications and Technology, J. Michael Spector, M. David Merrill, Jan Elen and M. J. Bishop (Eds.). Springer, NY, 689--701.","paperID":"None"},{"content":"Tony Gjerlufsen, Clemens Nylandsted Klokmose, James Eagan, Clément Pillias and Michel BeaudouinLafon. 2011. Shared substance: developing flexible multi-surface applications. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 3383--3392. http://dx.doi.org/10.1145/1978942.1979446.","paperID":"None"},{"content":"Peter Goodyear and Symeon Retalis. 2010. Technologyenhanced learning: design patterns and pattern languages. Sense Publishers, Rotterdam.","paperID":"None"},{"content":"Peter. Goodyear and Lucila. Carvalho. 2014. Framing the analysis of learning network architectures. In The architecture of productive learning networks, Lucila Carvalho & Peter Goodyear (Ed.), Routledge, NY, NY, 48--70.","paperID":"None"},{"content":"Wendy Gunn, Ton Otto and Rachel Charlotte Smith. 2013. Design anthropology: theory and practice. A&C Black, London, UK.","paperID":"None"},{"content":"Christian Heath and Paul Luff. 1991. Collaborative Activity and Technological Design: Task Coordination in London Underground Control Rooms. In Proceedings of the 2nd European Conference on Computer Supported Cooperative Work (ECSCW '91), 65--80. http://dx.doi.org/10.1007/978--94-011--3506--1_5.","paperID":"None"},{"content":"James Hollan, Edwin Hutchins and David Kirsh. 2000. Distributed cognition: toward a new foundation for human-computer interaction research. ACM Transactions on Computer-Human Interaction (TOCHI), 7, 2 (June 2000), 174--196. http://dx.doi.org/10.1145/353485.353487.","paperID":"None"},{"content":"Steven Houben, Paolo Tell and Jakob E. Bardram. 2014. ActivitySpace: Managing Device Ecologies in an Activity-Centric Configuration Space. In Proceedings of the 9th ACM International Conference on Interactive Tabletops and Surfaces (ITS '14), 119--128. http://dx.doi.org/10.1145/2669485.2669493.","paperID":"None"},{"content":"Hans-Christian Jetter, Harald Reiterer and Florian Geyer. 2014. Blended Interaction: understanding natural human-computer interaction in post-WIMP interactive spaces. Personal and Ubiquitous Computing, 18, 5 (June 2014), 1139--1158. http://dx.doi.org/10.1007/s00779-013-0725-4.","paperID":"None"},{"content":"Victor Kaptelinin and Bonnie A Nardi. 2006. Acting with technology: Activity theory and interaction design. MIT Press, Cambridge, MA.","paperID":"None"},{"content":"Michael J. Keppell. 2007. Instructional Design: Case Studies in Communities of Practice. IGI Global, Hershey, PA.","paperID":"None"},{"content":"Ahmed Kharrufa, Roberto Martinez-Maldonado, Judy Kay and Patrick Olivier. 2013. Extending tabletop application design to the classroom. In Proceedings of the 8th ACM International Conference on Interactive Tabletops and Surfaces (ITS '13), 115--124. http://dx.doi.org/10.1145/2512349.2512816.","paperID":"None"},{"content":"Paul Luff, Marina Jirotka, Naomi Yamashita, Hideaki Kuzuoka, Christian Heath and Grace Eden. 2013. Embedded interaction: The accomplishment of actions in everyday and video-mediated environments. ACM Transactions on Computer-Human Interaction (TOCHI), 20, 1 (March 2013), 1--22. http://dx.doi.org/10.1145/2442106.2442112.","paperID":"None"},{"content":"Paul K. Luff, Naomi Yamashita, Hideaki Kuzuoka and Christian Heath. 2015. Flexible Ecologies And Incongruent Locations. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 877--886. http://dx.doi.org/10.1145/2702123.2702286.","paperID":"None"},{"content":"Nicolai Marquardt, Ken Hinckley and Saul Greenberg. 2012. Cross-device interaction via micro-mobility and fformations. In Proceedings of the 25th ACM Symposium on User Interface Software and Technology (UIST '12), 13--22. http://dx.doi.org/10.1145/2380116.2380121.","paperID":"None"},{"content":"Nicolai Marquardt, Frederico Schardong and Anthony Tang. 2015. EXCITE: EXploring Collaborative Interaction in Tracked Environments. In Proceedings of the International Conference on Human-Computer Interaction (INTERACT '15), 89--97. http://dx.doi.org/10.1007/978-3-319-22668-2_8.","paperID":"None"},{"content":"Roberto Martinez-Maldonado, Anthony Collins, Judy Kay and Kalina Yacef. 2011. Who did what? who said that? Collaid: an environment for capturing traces of collaborative learning at the tabletop. In Proceedings of the 6th ACM International Conference on Interactive Tabletops and Surfaces (ITS '11), 172--181. http://dx.doi.org/10.1145/2076354.2076387.","paperID":"None"},{"content":"Roberto Martinez-Maldonado, Peter Goodyear, Yannis Dimitriadis, Kate Thompson, Lucila Carvalho, Luis Pablo Prieto and Martin Parisio. 2015. Learning about Collaborative Design for Learning in a Multi-Surface Design Studio. In Proceedings of the International Conference on Computer-Supported Collaborative Learning (CSCL '15), 174--181. http://infoscience.epfl.ch/record/209190.","paperID":"None"},{"content":"RoshanakZilouchian Moghaddam and Brian Bailey. 2011. VICPAM: A Visualization Tool for Examining Interaction Data in Multiple Display Environments. In Human Interface and the Management of Information. Interacting with Information, Michael J. Smith and Gavriel Salvendy (Eds.). Springer Berlin Heidelberg, 278--287.","paperID":"None"},{"content":"Bonnie A Nardi. 1996. Context and consciousness: activity theory and human-computer interaction. MIT Press, Cambridge MA.","paperID":"None"},{"content":"Donald A Norman. 2005. Human-centered design considered harmful. Interactions, 12, 4 (August, 2005), 14--19. http://dx.doi.org/10.1145/1070960.1070976.","paperID":"None"},{"content":"Pierre Rabardel and Gaëtan Bourmaud. 2003. From computer to instrument system: a developmental perspective. Interacting with Computers, 15, 5 (October 2003), 665--691. http://iwc.oxfordjournals.org/content/15/5/665.abstract.","paperID":"None"},{"content":"Roman Rädle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Adhoc Around-the-Table Collaboration. In Proceedings of the 9th ACM International Conference on Interactive Tabletops and Surfaces 45--54. http://dx.doi.org/10.1145/2669485.2669500.","paperID":"None"},{"content":"Yvonne Rogers and Judi Ellis. 1994. Distributed Cognition: an alternative framework for analysing and explaining collaborative working. Journal of Information Technology, 9, 2 (June 1994), 119--128. http://www.palgravejournals.com/jit/journal/v9/n2/abs/jit199412a.html.","paperID":"None"},{"content":"Yvonne Rogers. 2004. New theoretical approaches for HCI. Annual review of information science and technology, 38, 1 (September 2005), 87--143. http://onlinelibrary.wiley.com/doi/10.1002/aris.1440380 103/abstract.","paperID":"None"},{"content":"Kathy Ryall, Clifton Forlines, Chia Shen and Meredith Ringel Morris. 2004. Exploring the effects of group size and table size on interactions with tabletop shareddisplay groupware. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work (CSCW '04), 284--293. http://dx.doi.org/10.1145/1031607.1031654.","paperID":"None"},{"content":"Kjeld Schmidt and Liam Bannon. 2013. Constructing CSCW: The First Quarter Century. Computer Supported Cooperative Work (CSCW), 22, 4--6 (August 2013), 345372. http://dx.doi.org/10.1007/s10606-013-9193-7.","paperID":"None"},{"content":"Bertrand Schneider, Matthew Tobiasz, Charles Willis and Chia Shen. 2012. WALDEN: multi-surface multitouch simulation of climate change and species loss in thoreau's woods. In Proceedings of the 7th ACM International Conference on Interactive Tabletops and Surfaces (ITS '12), 387--390. http://dx.doi.org/10.1145/2396636.2396707.","paperID":"None"},{"content":"Randall B. Smith, Ranald Hixon and Bernard Horan. 1998. Supporting flexible roles in a shared space. In Proceedings of the ACM Conference on Computer Supported-Cooperative Work (CSCW '98), 197--206. http://dx.doi.org/10.1145/289444.289494.","paperID":"None"},{"content":"Norbert A Streitz, Peter Tandler, Christian MüllerTomfelde and Shin'ichi Konomi. 2001. Roomware: Towards the Next Generation of Human-Computer: Interaction based on an Integrated Design of Real and Virtual Worlds. In Human-Computer Interaction in the New Millenium, John M. Carroll (Ed.), Addison Wesley, NY, NY, 553--578.","paperID":"None"},{"content":"Norbert A. Streitz, Jörg Geißler, Torsten Holmer, Shin'ichi Konomi, Christian Müller-Tomfelde, Wolfgang Reischl, Petra Rexroth, Peter Seitz and Ralf Steinmetz. 1999. i-LAND: an interactive landscape for creativity and innovation. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '99), 120--127. http://dx.doi.org/10.1145/302979.303010.","paperID":"None"},{"content":"Lucy Suchman. 1987. Plans and situated actions: The problem of human-machine communication. Cambridge University Press, Cambridge, UK.","paperID":"None"},{"content":"Noriko Suzuki, Tosirou Kamiya, Ichiro Umata, Sadanori Ito, Shoichiro Iwasawa, Mamiko Sakata and Katsunori Shimohara. 2013. Detection of Division of Labor in Multiparty Collaboration. In Human Interface and the Management of Information. Information and Interaction for Learning, Culture, Collaboration and Business, Sakae Yamamoto (Ed.), Springer Berlin Heidelberg, 362--371.","paperID":"None"},{"content":"A. Tang, M. Pahud, S. Carpendale and B. Buxton. 2010. VisTACO: visualizing tabletop collaboration. In Proceedings of the 5th ACM International Conference on Interactive Tabletops and Surfaces (ITS '10), 29--38. http://dx.doi.org/10.1145/1936652.1936659.","paperID":"None"},{"content":"Anthony Tang, Melanie Tory, Barry Po, Petra Neumann and Sheelagh Carpendale. 2006. Collaborative coupling over tabletop displays. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 1181--1190. http://dx.doi.org/10.1145/1124772.1124950.","paperID":"None"},{"content":"Nadir Weibel, Adam Fouse, Edwin Hutchins and James D. Hollan. 2011. Supporting an integrated paper-digital workflow for observational research. In Proceedings of the 16th International Conference on Intelligent User Interfaces (IUI '11), 257--266. http://dx.doi.org/10.1145/1943403.1943443.","paperID":"None"},{"content":"D Wigdor, H Jiang, C Forlines, M Borkin and C Shen. 2009. WeSpace: the design development and deployment of a walk-up and share multi-surface visual collaboration system. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1237--1246. http://dx.doi.org/10.1145/1518701.1518886.","paperID":"None"},{"content":"Terry Winograd and Fernando Flores. 1986. Understanding computers and cognition: A new foundation for design. Addison Wesley, Menlo Park, California.","paperID":"None"},{"content":"Alain Wisner. 1995. Understanding problem building: ergonomic work analysis. Ergonomics, 38, 3 (July 2010), 595--605. http://www.tandfonline.com/doi/abs/10.1080/00140139 508925133.","paperID":"None"},{"content":"Jialiang Yao, Terrence Fernando, Hissam Tawfik, Richard Armitage and Iona Billing. 2006. Towards a Collaborative Urban Planning Environment. In Computer Supported Cooperative Work in Design II, Wei-ming Shen, Kuo-Ming Chao, Zongkai Lin, JeanPaulA Barthès and Anne James (Eds.). Springer Berlin Heidelberg, 554--562.","paperID":"None"},{"content":"Pippa Yeoman Habits and habitats: An ethnography of learning entanglement. PhD Dissertation, The University of Sydney, Sydney, Australia, 2015.","paperID":"None"},{"content":"Nicola Yuill and Yvonne Rogers. 2012. Mechanisms for collaboration: A design and evaluation framework for multi-user interfaces. ACM Transactions on Computer-Human Interaction (TOCHI), 19, 1 (March 2012), 1--25. http://dx.doi.org/10.1145/2147783.2147784.","paperID":"None"}],"abstract":"There is a steadily growing interest in the design of spaces in which multiple interactive surfaces are present and, in turn, in understanding their role in group activity. However, authentic activities in these multi-surface spaces can be complex. Groups commonly use digital and non-digital artefacts, tools and resources, in varied ways depending on their specific social and epistemic goals. Thus, designing for collaboration in such spaces can be very challenging. Importantly, there is still a lack of agreement on how to approach the analysis of groups' experiences in these heterogeneous spaces. This paper presents an actionable approach that aims to address the complexity of understanding multi-user multi-surface systems. We provide a structure for applying different analytical tools in terms of four closely related dimensions of user activity: the setting, the tasks, the people and the runtime co-configuration. The applicability of our approach is illustrated with six types of analysis of group activity in a multi-surface design studio.","title":"An Actionable Approach to Understand Group Experience in Complex, Multi-surface Spaces","filename":"CHI16/p2062","authors":["Roberto Martinez-Maldonado","Peter Goodyear","Judy Kay","Kate Thompson","Lucila Carvalho"],"conference":"CHI '16"}