{"paperId":2858299,"reference":[{"content":"Jason Alexander, Andy Cockburn, Stephen Fitchett, Carl Gutwin, and Saul Greenberg. 2009. Revisiting read wear: analysis, design, and evaluation of a footprints scrollbar. In Proc. CHI09. ACM, 1665-1674.","paperID":"None"},{"content":"Yoav Benjamini and Yosef Hochberg. 1995. Controlling the false discovery rate: a practical and powerful approach to multiple testing. Journal of the Royal Statistical Society. Series B (Methodological) (1995), 289-300.","paperID":"None"},{"content":"George Buchanan and Fernando Loizides. 2007. Investigating document triage on paper and electronic media. Springer.","paperID":"None"},{"content":"George Buchanan and Tom Owen. 2008. Improving skim reading for document triage. In Proc. IIiX08. ACM, 83-88.","paperID":"None"},{"content":"Christopher Clark and Santosh Divvala. 2015. Looking Beyond Text: Extracting Figures, Tables and Captions from Computer Science Papers. In Workshops at the Twenty-Ninth AAAI Conference on Artificial Intelligence.","paperID":"None"},{"content":"Andy Cockburn, Philip Quinn, Carl Gutwin, and Stephen Fitchett. 2012. Improving Scrolling Devices with Document Length Dependent Gain. In Proc. CHI12 (CHI '12). ACM, 267-276.","paperID":"None"},{"content":"Andy Cockburn and Joshua Savage. 2004. Comparing speed-dependent automatic zooming with traditional scroll, pan and zoom methods. In People and Computers XVII Designing for Society. Springer, 87-102.","paperID":"None"},{"content":"Richard R Day and Jeong-suk Park. 2005. Developing Reading Comprehension Questions. Reading in a foreign language 17, 1 (2005), 60-73.","paperID":"None"},{"content":"Geoffrey B Duggan and Stephen J Payne. 2011. Skim reading by satisficing: evidence from eye tracking. In Proc. CHI11. ACM, 1141-1150.","paperID":"None"},{"content":"George W Furnas and Benjamin B Bederson. 1995. Space-scale diagrams: Understanding multiscale interfaces. In Proc. CHI'15. ACM Press/Addison-Wesley Publishing Co., 234-241.","paperID":"None"},{"content":"Yves Guiard, Yangzhou Du, and Olivier Chapuis. 2007. Quantifying degree of goal directedness in document navigation: Application to the evaluation of the perspective-drag technique. In Proc. CHI'07. ACM, 327-336.","paperID":"None"},{"content":"Beverly L Harrison, Hiroshi Ishii, Kim J Vicente, and William AS Buxton. 1995. Transparent layered user interfaces: An evaluation of a display design to enhance focused and divided attention. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Press/Addison-Wesley Publishing Co., 317-324.","paperID":"None"},{"content":"Sandra G Hart. 2006. NASA-task load index (NASA-TLX); 20 years later. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 50. Sage Publications, 904-908.","paperID":"None"},{"content":"Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. Advances in psychology 52 (1988), 139-183.","paperID":"None"},{"content":"Ken Hinckley, Edward Cutrell, Steve Bathiche, and Tim Muss. 2002. Quantitative analysis of scrolling techniques. In Proc. CHI02. ACM, 65-72.","paperID":"None"},{"content":"Jukka Hyona, Robert F Lorch Jr, and Johanna K Kaakinen. 2002. Individual differences in reading to summarize expository text: Evidence from eye fixation patterns. Journal of Educational Psychology 94, 1 (2002), 44.","paperID":"None"},{"content":"Takeo Igarashi and Ken Hinckley. 2000. Speed-dependent automatic zooming for browsing large documents. In Proc. UIST00. ACM, 139-148.","paperID":"None"},{"content":"Pourang Irani, Carl Gutwin, and Xing Dong Yang. 2006. Improving selection of off-screen targets with hopping. In Proc. CHI06. ACM, 299-308.","paperID":"None"},{"content":"Edward W. Ishak and Steven K. Feiner. 2006. Content-aware scrolling. In Proc. UIST06. ACM, NY, NY, USA, 155-158.","paperID":"None"},{"content":"Victor Kaptelinin, Timo Mantyla, and Jan strom. 2002. Transient visual cues for scrolling: an empirical study. In Ext. Abst. CHI'02. ACM, 620-621.","paperID":"None"},{"content":"Juho Kim, Amy X Zhang, Jihee Kim, Robert C Miller, and Krzysztof Z Gajos. 2014. Content-aware kinetic scrolling for supporting web page navigation. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 123-127.","paperID":"None"},{"content":"Christian Klein and Benjamin B Bederson. 2005. Benefits of animated scrolling. In CHI'05 Extended Abstracts on Human Factors in Computing Systems. ACM, 1965-1968.","paperID":"None"},{"content":"Theresa J Babbitt Kline, Laura M Ghali, Donald W Kline, and Steven Brown. 1990. Visibility distance of highway signs among young, middle-aged, and older observers: Icons are better than text. Human Factors: The Journal of the Human Factors and Ergonomics Society 32, 5 (1990), 609-619.","paperID":"None"},{"content":"Fernando Loizides and George Buchanan. 2009. An Empirical Study of User Navigation during Document Triage. Interfaces (2009).","paperID":"None"},{"content":"Takashi Miyaki and Jun Rekimoto. 2009. GraspZoom: zooming and scrolling control model for single-handed mobile interaction. In Proc. MobileHCI09. ACM, 11.","paperID":"None"},{"content":"Mark R Nieuwenstein, Mary C Potter, and Jan Theeuwes. 2009. Unmasking the attentional blink. Journal of Experimental Psychology: Human Perception and Performance 35, 1 (2009), 159.","paperID":"None"},{"content":"Tom Owen, George Buchanan, Parisa Eslambochilar, and Fernando Loizides. 2010. Supporting early document navigation with semantic zooming. Springer.","paperID":"None"},{"content":"Jane E Raymond, Kimron L Shapiro, and Karen M Arnell. 1992. Temporary suppression of visual processing in an RSVP task: An attentional blink? Journal of Experimental Psychology: Human Perception and Performance 18, 3 (1992), 849.","paperID":"None"},{"content":"Kimron L Shapiro, JE Raymond, and KM Arnell. 1997. The attentional blink. Trends in cognitive sciences 1, 8 (1997), 291-296.","paperID":"None"},{"content":"Matteo Valsecchi, Karl R Gegenfurtner, and Alexander C Schutz. 2013. Saccadic and smooth-pursuit eye movements during reading of drifting texts. Journal of vision 13, 10 (2013), 8.","paperID":"None"},{"content":"Ji Soo Yi. 2014. QnDReview: Read 100 CHI papers in 7 hours. In Ext. Abst. CHI'14. ACM, 805-814.","paperID":"None"},{"content":"Chen-Hsiang Yu and Robert C. Miller. Enhancing web page skimmability. In Ext. Abst. CHI'12. ACM, 2655-2660.","paperID":"None"},{"content":"Jian Zhao, R William Soukoreff, Xiangshi Ren, and Ravin Balakrishnan. 2014. A model of scrolling on touch-sensitive displays. International Journal of Human-Computer Studies 72, 12 (2014), 805-821.","paperID":"None"}],"citation":[],"abstract":"The paper contributes a novel technique that can improve user performance in skim reading. Users typically use a continuous-rate-based scrolling technique to skim works such as longer Web pages, e-books, and PDF files. However, visual attention is compromised at higher scrolling rates because of motion blur and extraneous objects with overly brief exposure times. In response, we present Spotlights. It complements the regular continuous technique at high speeds (2--20 pages/s). We present a novel design rule informed by theories of the human visual system for dynamically selecting objects and placing them on transparent overlays on top of the viewer. This improves the quality of visual processing at high scrolling rates by 1) limiting the number of objects, 2) ensuring minimal processing time per object, and 3) keeping objects static to avoid motion blur and facilitate gaze deployment. Spotlights was compared to continuous scrolling in two studies using long documents (200+ pages). Comprehension levels for long documents were comparable with those in continuous-rate-based scrolling, but Spotlights showed significantly better scrolling speed, gaze deployment, recall, lookup performance, and user-rated comprehension.","title":"Spotlights: Attention-Optimized Highlights for Skim Reading","filename":"CHI16/p5203","authors":["Byungjoo Lee","Olli Savisaari","Antti Oulasvirta"],"conference":"CHI '16"}