{"paperId":2858198,"reference":[{"content":"Harini Alagarai Sampath, Rajeev Rajeshuni, and Bipin Indurkhya. 2014. Cognitively inspired task design to improve user performance on crowdsourcing platforms. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 3665--3674. http://doi.org/10.1145/2556288.2557155","paperID":"None"},{"content":"Sultana Lubna Alam and John Campbell. 2012. Crowdsourcing Motivations in a not-for-profit GLAM context: The Australian Newspapers Digitisation Program. Location, location, location: 23rd Australasian Conference on Information Systems, 1--11.","paperID":"None"},{"content":"Morgan G Ames, Janet Go, Joseph 'Jofish' Kaye, and Mirjana Spasojevic. 2010. Making love in the network closet: the benefits and work of family videochat. Proceedings of the 2010 ACM conference on Computer supported cooperative work, ACM, 145--154. http://doi.org/10.1145/1718918.1718946","paperID":"None"},{"content":"Judd Antin and Aaron Shaw. 2012. Social desirability bias and self-reports of motivation: a study of Amazon Mechanical Turk in the US and India. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems 2012. http://doi.org/10.1145/2207676.2208699","paperID":"None"},{"content":"Erin Brady, Meredith Ringel Morris, and Jeffrey P. Bigham. 2015. Gauging Receptiveness to Social Microvolunteering. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, ACM Press, 1055--1064. http://doi.org/10.1145/2702123.2702329","paperID":"None"},{"content":"Dana Chandler and Adam Kapelner. 2013. Breaking monotony with meaning: Motivation in crowdsourcing markets. Journal of Economic Behavior and Organization 90, 123--133. http://doi.org/10.1016/j.jebo.2013.03.003","paperID":"None"},{"content":"Kathy Charmaz. 2000. Grounded theory: Objectivist and constructivist methods. In The Handbook of Qualitative Research. 509--535. Retrieved from http://books.google.com/books?id=erLspquhd5MC","paperID":"None"},{"content":"Stephanie Chen. 2010. No retirement for these older folks, just work. CNN. Retrieved from http://www.cnn.com/2010/LIVING/09/07/older.worker s.100s.90s/index.html","paperID":"None"},{"content":"Parmit K Chilana, Andrew J Ko, and Jacob O Wobbrock. 2012. LemonAid?: Selection-Based Crowdsourced Contextual Help for Web Applications. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems 2012, 1549--1558. http://doi.org/10.1145/2207676.2208620","paperID":"None"},{"content":"Graeme W Coleman, Lorna Gibson, Vicki L Hanson, Ania Bobrowicz, and Alison McKay. 2010. Engaging the disengaged. Proceedings of the 8th ACM Conference on Designing Interactive Systems 2010, ACM Press, 175--178. http://doi.org/10.1145/1858171.1858202","paperID":"None"},{"content":"Erin York Cornwell and Linda J Waite. 2009. Social Disconnectedness, Perceived Isolation, and Health among Older Adults. Journal of Health and Social Behavior 50, 1, 31--48. http://doi.org/10.1177/002214650905000103","paperID":"None"},{"content":"Fergus I. M. Craik. 1994. Memory Changes in Normal Aging. Current Directions in Psychological Science 3, 155--158. http://doi.org/10.1111/14678721.ep10770653","paperID":"None"},{"content":"CrowdFlower. 2014. Crowd Demographics. Retrieved from https://success.crowdflower.com/hc/enus/articles/202703345-Contributors-CrowdDemographics","paperID":"None"},{"content":"Anna Dickinson, Alan F. Newell, Michael J. Smith, and Robin L. Hill. 2005. Introducing the Internet to the over-60s: Developing an email system for older novice computer users. Interacting with Computers 17, 6, 621--642. http://doi.org/10.1016/j.intcom.2005.09.003","paperID":"None"},{"content":"Alvaro Fernandez and Goldberk Elkhonon. 2009. The SharpBrains Guide to Brain Fitness.","paperID":"None"},{"content":"Thomas A Glass, Carlos Mendes de Leon, Richard A Marottoli, and Lisa F Berkman. 1999. Population based study of social and productive activities as predictors of survival among elderly Americans. BMJ (Clinical research ed.) 319, 478--483.","paperID":"None"},{"content":"Eszter Hargittai. 2009. An Update on Survey Measures of Web-Oriented Digital Literacy. Social Science Computer Review 27, 1, 130--137.","paperID":"None"},{"content":"Dave Harley, Kate Howland, Eric Harris, and Cara Redlich. 2014. Online communities for older users: what can we learn from local community interactions to create social sites that work for older people. Proceedings of the 28th International BCS Human Computer Interaction Conference on HCI, 42--51. http://doi.org/10.14236/ewic/hci2014.5","paperID":"None"},{"content":"Alexis Hope, Ted Schwaba, and Anne Marie Piper. 2014. Understanding digital and material social communications for older adults. Proceedings of the 32nd annual ACM conference on Human factors in computing systems, ACM Press, 3903--3912. http://doi.org/10.1145/2556288.2557133","paperID":"None"},{"content":"Panos Ipeirotis. 2010. Demographics of Mechanical Turk. Working Paper CeDER-10-01. http://doi.org/10.2139/ssrn.1585030","paperID":"None"},{"content":"Panos Ipeirotis. 2010. Analyzing the Amazon Mechanical Turk marketplace. XRDS: Crossroads, The ACM Magazine for Students 17, 2, 16. http://doi.org/10.1145/1869086.1869094","paperID":"None"},{"content":"Susan E. Jackson and Aparna Joshi. 2004. Diversity in social context: A multi-attribute, multilevel analysis of team diversity and sales performance. Journal of Organizational Behavior 25, 675--702. http://doi.org/10.1002/job.265","paperID":"None"},{"content":"Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems CHI '08, 453. http://doi.org/10.1145/1357054.1357127","paperID":"None"},{"content":"Aniket Kittur, Jeffrey V. Nickerson, Michael Bernstein, et al. 2013. The future of crowd work. Proceedings of the 2013 conference on Computer supported cooperative work CSCW '13, 1301. http://doi.org/10.1145/2441776.2441923","paperID":"None"},{"content":"Masatomo Kobayashi, Shoma Arita, Toshinari Itoko, Shin Saito, and Hironobu Takagi. 2015. Motivating Multi-Generational Crowd Workers in Social-Purpose Work. Proc. of CSCW '15, 1813--1824. http://doi.org/10.1145/2675133.2675255","paperID":"None"},{"content":"Masatomo Kobayashi, Tatsuya Ishihara, and Toshinari Itoko. 2013. Age-Based Task Specialization for Crowdsourced Proofreading. HCII, 104--112.","paperID":"None"},{"content":"Karim Lakhani and Robert G Wolf. 2003. Why Hackers Do What They Do: Understanding Motivation and Effort in Free/Open Source Software Projects. Social Science Research Network 49, September, 1--27. http://doi.org/10.2139/ssrn.443040","paperID":"None"},{"content":"Vilma Lehtinen, J Nasanen, and Risto Sarvas. 2009. \"A little silly and empty-headed\": older adults' understandings of social networking sites. BCS-HCI, British Computer Society, 45--54. Retrieved from http://portal.acm.org/citation.cfm?id=1671011.167101","paperID":"None"},{"content":"Siân E Lindley, Richard Harper, and Abigail Sellen. 2009. Desiring to be in touch in a changing communications landscape. Proceedings of the 27th international conference on Human factors in computing systems CHI 09, ACM Press, 1693. http://doi.org/10.1145/1518701.1518962","paperID":"None"},{"content":"David Martin, Benjamin V Hanrahan, Jacki O'Neill, and Neha Gupta. 2014. Being a turker. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14, 224--235. http://doi.org/10.1145/2531602.2531663","paperID":"None"},{"content":"Winter Mason and Duncan J. Watts. 2010. Financial incentives and the \"performance of crowds.\" ACM SIGKDD Explorations Newsletter 11, 100. http://doi.org/10.1145/1809400.1809422","paperID":"None"},{"content":"Nancy Morrow-Howell, Jim Hinterlong, Philip A Rozario, and Fengyan Tang. 2003. Effects of volunteering on the well-being of older adults. The journals of gerontology. Series B, Psychological sciences and social sciences 58, 3, S137-45. http://doi.org/10.2307/3090173.2001-1000900110.2307/3090173r10.1093/geronb/58.3.S137","paperID":"None"},{"content":"Daniel H. Pink. 2009. Drive: The surprising truth about what motivates us. http://doi.org/10.1002/casp","paperID":"None"},{"content":"Jakob Rogstadius, Vassilis Kostakos, Aniket Kittur, Boris Smus, Jim Laredo, and Maja Vukovic. 2011. An Assessment of Intrinsic and Extrinsic Motivation on Task Performance in Crowdsourcing Markets. Fifth International AAAI Conference on Weblogs and Social Media, 321--328.","paperID":"None"},{"content":"Joel Ross, Lilly Irani, and M Silberman. 2010. Who are the crowdworkers?: shifting demographics in mechanical turk. CHI'10 Extended?. Retrieved August 18, 2014 from http://dl.acm.org/citation.cfm?id=1753873","paperID":"None"},{"content":"Richard M Ryan and Edward L Deci. 2000. Selfdetermination theory and the facilitation of intrinsic motivation, social development, and well-being. The American psychologist 55, 68--78. http://doi.org/10.1037/0003-066X.55.1.68","paperID":"None"},{"content":"Shin Saito, Toshihiro Watanabe, Masatomo Kobayashi, and Hironobu Takagi. 2014. Skill Development Framework for Micro-Tasking. HCII, 400--409.","paperID":"None"},{"content":"K W Schaie. 1996. Intellectual Development in Adulthood: The Seattle Longitudinal Study. Cambridge University Press, Cambridge.","paperID":"None"},{"content":"Aaron Smith. 2014. Older Adults and Technology Use. Retrieved from http://pewrsr.ch/1mMIyvW","paperID":"None"},{"content":"Warren E. Watson, Kamalesh. Kumar, and Larry K. Michaelsen. 1993. Cultural Diversity's Impact on Interaction Process and Performance: Comparing Homogeneous and Diverse Task Groups. Academy of Management Journal 36, 590--602. http://doi.org/10.2307/256593","paperID":"None"},{"content":"Wesley Willett, Jeffrey Heer, and Maneesh Agrawala. 2012. Strategies for crowdsourcing social data analysis. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 227--236. http://doi.org/10.1145/2207676.2207709","paperID":"None"},{"content":"Svetlana Yarosh, Kori M Inkpen, and A.J. Bernheim Brush. 2010. Video playdate. Proceedings of the 28th international conference on Human factors in computing systems CHI '10, 1251. http://doi.org/10.1145/1753326.1753514","paperID":"None"},{"content":"Lixiu Yu, Paul André, Aniket Kittur, and Robert Kraut. 2014. A comparison of social, learning, and financial strategies on crowd engagement and output quality. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14, 967--978. http://doi.org/10.1145/2531602.2531729","paperID":"None"},{"content":"Katheryn Zickuhr and Mary Madden. 2012. Older Adults and Internet Use. Retrieved from http://pewinternet.org/Reports/2012/Older-adults-andinternet-use.aspx","paperID":"None"},{"content":"Kathryn Zyskowski, Meredith Ringel Morris, Jeffrey P Bigham, Mary L Gray, and Shaun Kane. 2015. Accessible Crowdwork? Understanding the Value in and Challenge of Microtask Employment for People with Disabilities. CSCW '15, ACM -- Association for Computing Machinery, 1682--1693. http://doi.org/10.1145/2675133.2675158","paperID":"None"}],"abstract":"Diversifying participation in crowd work can benefit the worker and requester. Increasing numbers of older adults are online, but little is known about their awareness of or how they engage in mainstream crowd work. Through an online survey with 505 seniors, we found that most have never heard of crowd work but would be motivated to complete tasks by earning money or working on interesting or stimulating tasks. We follow up results from the survey with interviews and observations of 14 older adults completing crowd work tasks. While our survey data suggests that financial incentives are encouraging, in-depth interviews reveal that a combination of personal and social incentives may be stronger drivers of participation, but only if older adults can overcome accessibility issues and understand the purpose of crowd work. This paper contributes insights into how crowdsourcing sites could better engage seniors and other users.","citation":[],"title":"\"Why would anybody do this?\": Understanding Older Adults' Motivations and Challenges in Crowd Work","filename":"CHI16/p2246","authors":["Robin Brewer","Meredith Ringel Morris","Anne Marie Piper"],"conference":"CHI '16"}