{"paperId":2858313,"citation":[],"abstract":"We present five provocations for ethics, and ethical research, in HCI. We discuss, in turn, informed consent, the researcher-participant power differential, presentation of data in publications, the role of ethical review boards, and, lastly, corporate-facilitated projects. By pointing to unintended consequences of regulation and oversimplifications of unresolvable moral conflicts, we propose these provocations not as guidelines or recommendations but as instruments for challenging our views on what it means to do ethical research in HCI. We then suggest an alternative grounded in the sensitivities of those being studied and based on everyday practice and judgement, rather than one driven by bureaucratic, legal, or philosophical concerns. In conclusion, we call for a wider and more practical discussion on ethics within the community, and suggest that we should be more supportive of low-risk ethical experimentation to further the field.","reference":[{"content":"1992. ACM Code of Ethics and Professional Conduct. Retrieved 22/07/2015 from http://www.acm.org/about/code-of-ethics","paperID":"None"},{"content":"1969. The Chilling Effect in Constitutional Law. Columbia Law Review, 69 (5). 808--842. DOI: 10.2307/1121147","paperID":"None"},{"content":"George J Annas and Michael A Grodin. 1995. The Nazi doctors and the Nuremberg code. The Journal of Pharmacy & Law, 4. 167--245. DOI: 10.1017/S0250569X00020380","paperID":"None"},{"content":"Jeffrey Bardzell and Shaowen Bardzell. 2015. Humanistic HCI: Synthesis Lectures on Human-Centered Informatics. Morgan & Claypool.","paperID":"None"},{"content":"Elizabeth H Bassett and Kate O'Riordan. 2002. Ethics of Internet research: Contesting the human subjects research model. Ethics and Information Technology, 4 (3). 233--247. DOI: 10.1023/A:1021319125207","paperID":"None"},{"content":"Howard S Becker. 1995. Moral entrepreneurs: The creation and enforcement of deviant categories. in (Herman, N.J. ed.). Deviance: A symbolic interactionist approach, AltaMira Press, 169--178.","paperID":"None"},{"content":"Steve Benford, Chris Greenhalgh, Bob Anderson, Rachel Jacobs, Mike Golembewski, Marina Jirotka, Bernd Carsten Stahl, Job Timmermans, Gabriella Giannachi and Matt Adams. 2015. The Ethical Implications of HCI's Turn to the Cultural. ACM Transactions on Computer-Human Interaction (TOCHI), 22 (5). 24. DOI: 10.1145/2775107","paperID":"None"},{"content":"Tom Boellstorff, Bonnie Nardi and Celia Pearce. 2012. Ethnography and Virtual Worlds: A Handbook of Method. Princeton University Press.","paperID":"None"},{"content":"Danah Boyd. 2014. It's Complicated: The Social Lives of Networked Teens. Yale University Press.","paperID":"None"},{"content":"Stacy M Branham, Anja Thieme, Lisa P Nathan, Steve Harrison, Deborah Tatar and Patrick Olivier. 2014. Cocreating & identity-making in CSCW: revisiting ethics in design research. in Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing, ACM, Baltimore, MD, USA, 305--308. DOI: 10.1145/2556420.2558859","paperID":"None"},{"content":"Amy Bruckman, Karrie Karahalios, Robert E Kraut, Erika Shehan Poole, John C Thomas and Sarita Yardi. 2010. Revisiting research ethics in the facebook era: Challenges in emerging CSCW research. in Adjunct Proceedings of the Conference on Computer Supported Cooperative Work ACM, Savannah, GA","paperID":"None"},{"content":"Barrie R Cassileth, Robert V Zupkis, Katherine SuttonSmith and Vicki March. 1980. Informed consent -- why are its goals imperfectly realized? The New England journal of medicine, 302 (16). 896--900. DOI: 10.1056/NEJM198004173021605","paperID":"None"},{"content":"Stanley. Cavell. 1969. Must We Mean What We Say? Cambridge University Press.","paperID":"None"},{"content":"Matthew Chalmers, Donald McMillan, Alistair Morrison, Henriette Cramer, Mattias Rost and Wendy Mackay. 2011. Ethics, logs and videotape: ethics in large scale user trials and user generated content. in CHI'11 Extended Abstracts on Human Factors in Computing Systems, ACM, Vancouver, BC, Canada, 2421--2424. DOI: 10.1145/1979742.1979574","paperID":"None"},{"content":"Pia Christensen and Alan Prout. 2002. Working with ethical symmetry in social research with children. Childhood, 9 (4). 477--497. DOI: 10.1177/0907568202009004007","paperID":"None"},{"content":"Tom Clark. 2008. We're Over-Researched Here!' Exploring Accounts of Research Fatigue within Qualitative Research Engagements. Sociology, 42 (5). 953--970. DOI: 10.1177/0038038508094573","paperID":"None"},{"content":"Sonia Mansoldo Dainesi and Moisés Goldbaum. 2011. Provision of investigational drug after clinical research: review of literature, national and international guidelines. Revista da Associação Médica Brasileira, 57 (6). 710--716. DOI: 10.1590/S0104--42302011000600021","paperID":"None"},{"content":"Robert Dingwall. 2008. The ethical case against ethical regulation in humanities and social science research. Twenty-First Century Society: Journal of the Academy of Social Sciences, 3 (1). 1--12. DOI: 10.1080/17450140701749189","paperID":"None"},{"content":"Mitchell Duneier and Ovie Carter. 1999. Sidewalk. Macmillan.","paperID":"None"},{"content":"Charles Ess. 2002. Ethical decision-making and Internet research: Recommendations from the aoir ethics working committee.","paperID":"None"},{"content":"Casey Fiesler, Alyson Young, Tamara Peyton, Amy S. Bruckman, Mary Gray, Jeff Hancock and Wayne Lutters. 2015. Ethics for Studying Online Sociotechnical Systems in a Big Data World. in Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing, ACM, Vancouver, BC, Canada, 289--292. DOI: 10.1145/2685553.2685558","paperID":"None"},{"content":"Jennifer Golbeck. 2014. What a Toilet Hoax Can Tell Us About the Future of Surveillance. Retrieved 20/08/2015 from http://www.theatlantic.com/technology/archive/2014/04/what-a-toilet-hoax-can-tell-us-about-the-future-ofsurveillance/361408/","paperID":"None"},{"content":"Michael Goodyear. 2009. Medical research for hire: The political economy of pharmaceutical clinical trials. JAMA, 302 (23). 2603--2603. DOI: 10.1001/jama.2009.1779","paperID":"None"},{"content":"Marilys Guillemin and Lynn Gillam. 2004. Ethics, Reflexivity, and \"Ethically Important Moments\" in Research. Qualitative Inquiry, 10 (2). 261--280. DOI: 10.1177/1077800403262360","paperID":"None"},{"content":"Kevin D Haggerty. 2004. Ethics Creep: Governing Social Science Research in the Name of Ethics. Qualitative Sociology, 27 (4). 391--414. DOI: 10.1023/B:QUAS.0000049239.15922.a3","paperID":"None"},{"content":"Jeff T Hancock. 2015. The Facebook Study: A Personal Account of Data Science, Ethics and Change. in Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1--1. DOI: 10.1145/2675133.2697078","paperID":"None"},{"content":"Jay Katz. 1994. Informed Consent - Must it remain a fairy tale. Journal of Contemporary Health, Law & Policy, 10. 69.","paperID":"None"},{"content":"Jay Katz. 1977. Informed Consent-A Fairy Tale? Law's Vision. University of Pittsburgh Law Review, 39(2). 137--174.","paperID":"None"},{"content":"Jofish Kaye, Janet Vertesi, Jennifer Ferreira, Barry Brown and Mark Perry. 2014. #CHImoney: financial interactions, digital cash, capital exchange and mobile money. in CHI '14 Extended Abstracts on Human Factors in Computing Systems, ACM, Toronto, Ontario, Canada, 111--114. DOI: 10.1145/2559206.2559221","paperID":"None"},{"content":"Brian Keegan. 2015. Research in the Time of Technopanics. in CSCW 2015 Workshop on Ethics for Studying Online Sociotechnical Systems in a Big Data World,","paperID":"None"},{"content":"Adam DI Kramer, Jamie E Guillory and Jeffrey T Hancock. 2014. Experimental evidence of massivescale emotional contagion through social networks. Proceedings of the National Academy of Sciences, 111 (24). 8788--8790. DOI: 10.1073/pnas.1320040111","paperID":"None"},{"content":"Michael Lempert. 2013. No ordinary ethics. Anthropological Theory, 13 (4). 370--393. DOI: 10.1177/1463499613505571","paperID":"None"},{"content":"Kevin Lewis, Jason Kaufman, Marco Gonzalez, Andreas Wimmer and Nicholas Christakis. 2008. Tastes, ties, and time: A new social network dataset using Facebook. com. Social Networks, 30 (4). 330--342. DOI: 10.1016/j.socnet.2008.07.002","paperID":"None"},{"content":"Wendy E Mackay. 1995. Ethics, lies and videotape?. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM Press/Addison-Wesley Publishing Co., Denver, CO, USA, 138145. DOI: 10.1145/223904.223922","paperID":"None"},{"content":"Annette Markham and E Buchanan. 2012. Ethical decision-making and Internet research (version 2.0): Recommendations from the AoIR Ethics Working Committee.","paperID":"None"},{"content":"Heidi A McKee and James E Porter. 2009. The ethics of Internet research: A rhetorical, case-based process. Peter Lang.","paperID":"None"},{"content":"Donald McMillan, Alistair Morrison and Matthew Chalmers. 2013. Categorised ethical guidelines for large scale mobile HCI. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Paris, France, 1853--1862. DOI: 10.1145/2470654.2466245","paperID":"None"},{"content":"Cosmin Munteanu, Heather Molyneaux, Wendy Moncur, Mario Romero, Susan O'Donnell and John Vines. 2015. Situational Ethics: Re-thinking Approaches to Formal Ethics Requirements for Human-Computer Interaction. in Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, Seoul, South Korea, 105--114. DOI: 10.1145/2702123.2702481","paperID":"None"},{"content":"Arvind Narayanan and Vitaly Shmatikov. 2008. Robust De-anonymization of Large Sparse Datasets. in Security and Privacy, 2008. SP 2008. IEEE Symposium on, IEEE, 111--125. DOI: 10.1109/SP.2008.33","paperID":"None"},{"content":"Geoff Pearson. 2009. The researcher as hooligan: where 'participant' observation means breaking the law. International Journal of Social Research Methodology, 12 (3). 243--255. DOI: 10.1080/13645570701804250","paperID":"None"},{"content":"Lydia Plowman, Yvonne Rogers and Magnus Ramage. 1995. What Are Workplace Studies For? in Proceedings of the Fourth European Conference on Computer Supported Cooperative Work ECSCW '95, Springer Netherlands, 309--324. DOI: 10.1007/978--94-011-03497_20","paperID":"None"},{"content":"Carl Schneider. 2015. The Censor's Hand: The Misregulation of Human-Subject Research. MIT Press.","paperID":"None"},{"content":"Natasha Dow Schüll. 2012. Addiction by design: Machine gambling in Las Vegas. Princeton University Press.","paperID":"None"},{"content":"Eric Benjamin Seufert. 2013. Freemium Economics: Leveraging Analytics and User Segmentation to Drive Revenue. Elsevier.","paperID":"None"},{"content":"Malin Sveningsson. 2004. Ethics in Internet ethnography. in (Buchanan, E.A. ed.). Readings in Virtual Research Ethics: Issues and Controversies, IGI Global, 45--61.","paperID":"None"},{"content":"Latanya Sweeney. 2002. k-anonymity: A model for protecting privacy. International Journal of Uncertainty, Fuzziness and Knowledge-Based Systems, 10 (05). 557570. DOI: 10.1142/S0218488502001648","paperID":"None"},{"content":"Heli K Väätäjä and Emilia K Pesonen. 2013. Ethical issues and guidelines when conducting HCI studies with animals. in CHI'13 Extended Abstracts on Human Factors in Computing Systems, ACM, Paris, France, 2159--2168. DOI: 10.1145/2468356.2468736","paperID":"None"},{"content":"Willy Carl Van den Hoonaard. 2011. The seduction of ethics: Transforming the social sciences. University of Toronto Press.","paperID":"None"},{"content":"Alexandra Weilenmann, Thomas Hillman and Beata Jungselius. 2013. Instagram at the museum: communicating the museum experience through social photo sharing. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Paris, France, 1843--1852. DOI: 10.1145/2470654.2466243","paperID":"None"},{"content":"Michael Zimmer. 2010. \"But the data is already public\": on the ethics of research in Facebook. Ethics and information technology, 12 (4). 313--325. DOI: 10.1007/s10676-010--9227--5","paperID":"None"}],"title":"Five Provocations for Ethical HCI Research","filename":"CHI16/p852","authors":["Barry Brown","Alexandra Weilenmann","Donald McMillan","Airi Lampinen"],"conference":"CHI '16"}