{"paperId":2858185,"citation":[],"reference":[{"content":"Atmel AT24C01D. http://www.atmel.com/devices/AT24C01D.aspx.","paperID":"None"},{"content":"Commonly Abused Drugs Charts | National Institute on Drug Abuse (NIDA). http://www.drugabuse.gov/drugs-abuse/commonly-abused-drugs-charts.","paperID":"None"},{"content":"DSM-IV Criteria Substance Related Disorders. https://datashare.nida.nih.gov/assessment/d/dsm-iv-criteria-substance-related-disorders.","paperID":"None"},{"content":"Grove - Serial Camera Kit. http://www.seeedstudio.com/wiki/Grove_-_Serial_Camera_Kit.","paperID":"None"},{"content":"Instrument: Timeline Followback Method Assessment. http://cde.drugabuse.gov/instrument/d89c8e23-16e5--625a-e040-bb89ad43465d.","paperID":"None"},{"content":"\"Mindfulness\" Meditation Can Help Reduce Addiction Relapse Rates. http://www.drugfree.org/join-together/mindfulness-meditation-can-help-reduce-addiction-relapse-rates-study/.","paperID":"None"},{"content":"Narcotics Anonymous. https://www.na.org.","paperID":"None"},{"content":"Rapid Response Signal Drug Saliva Test Cassette. http://www.btnx.com/Product.aspx?id=1997.","paperID":"None"},{"content":"Reddit: The Front Page of the Internet. https://www.reddit.com.","paperID":"None"},{"content":"SML-E1 Series : LEDs - Rohm. http://rohmfs.rohm.com/en/products/databook/datasheet/opto/led/chip_mono/sml-e1.pdf.","paperID":"None"},{"content":"Texas Instruments BQ24040. http://www.ti.com/product/bq24040.","paperID":"None"},{"content":"Texas Instruments CC2541. http://www.ti.com/product/cc2541.","paperID":"None"},{"content":"United Nations Office on Drug and Crime (UNODC). World Drug Report 2010. https://www.unodc.org/documents/wdr/WDR_2010/World_Drug_Report_2010_lo-res.pdf.","paperID":"None"},{"content":"Albert Bandura. 1994. Self-efficacy. In V. S. Ramachaudran (Ed.), Encyclopedia of Human Behavior 4 (1994). Academic Press, New York, NY, USA, 71-81.","paperID":"None"},{"content":"Stephanie H. Cook, José A. Bauermeister, Deborah Gordon-Messer, and Marc A. Zimmerman. 2013. Online Network Influences on Emerging Adults' Alcohol and Drug Use. Journal of Youth and Adolescence 42, 11 (2013), 1674-1686. DOI: http://dx.doi.org/10.1007/s10964-012--9869--1 .","paperID":"None"},{"content":"Alim Fatah and Jeffrey P. Cohn. Developments in Drug Testing: Saliva as an Alternate to Urine and Blood. https://www.ncjrs.gov/App/publications/abstract.aspx?ID=232891.","paperID":"None"},{"content":"Caroline Free, Rosemary Knight, Steven Robertson, Robyn Whittaker, Phil Edwards, Weiwei Zhou, Anthony Rodgers, John Cairns, Michael G Kenward, and Ian Roberts. 2011. Smoking Cessation Support Delivered via Mobile Phone Text Messaging (txt2stop): A Single-blind, Randomised Trial. The Lancet 378, 9785 (2011), 49-55. DOI: http://dx.doi.org/10.1016/S0140--6736(11)60701-0.","paperID":"None"},{"content":"Marc Galanter, Helen Dermatis, Stephen Post, and Courtney Santucci. 2013. Abstinence from Drugs of Abuse in Community-based Members of Narcotics Anonymous. Journal of Studies on Alcohol and Drugs 74, 2 (2013), 349-352. DOI: http://dx.doi.org/10.15288/jsad.2013.74.349 .","paperID":"None"},{"content":"David H. Gustafson, Bret R. Shaw, Andrew Isham, Timothy Baker, Michael G. Boyle, and Michael Levy. 2011. Explicating an Evidence-Based, Theoretically Informed, Mobile Technology-Based System to Improve Outcomes for People in Recovery for Alcohol Dependence. Substance Use & Misuse 46, 1 (2011), 96-111. DOI: http://dx.doi.org/10.3109/10826084.2011.521413 .","paperID":"None"},{"content":"Syed Monowar Hossain, Amin Ahsan Ali, Md. Mahbubur Rahman, Emre Ertin, David Epstein, Ashley Kennedy, Kenzie Preston, Annie Umbricht, Yixin Chen, and Santosh Kumar. 2014. Identifying Drug (Cocaine) Intake Events from Acute Physiological Response in the Presence of Free-living Physical Activity. In Proceedings of the 13th International Symposium on Information Processing in Sensor Networks (IPSN 114). IEEE Press, Piscataway, NJ, USA, 71-82. DOI: http://dl.acm.org/citation.cfm?id=2602339.2602348 .","paperID":"None"},{"content":"Ahai Chang Lua, Huei Ru Lin, Yong Te Tseng, An Ren Hu, and Pei Chi Yeh. 2003. Profiles of Urine Samples from Participants at Rave Party in Taiwan: Prevalence of Ketamine and MDMA Abuse. Forensic Science International 136, 1--3 (2003), 47-51. DOI: http://dx.doi.org/10.1016/S0379-0738(03)00261--5.","paperID":"None"},{"content":"Lena Mamykina, Andrew D. Miller, Elizabeth D. Mynatt, and Daniel Greenblatt. 2010. Constructing Identities Through Storytelling in Diabetes Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1203-1212. DOI: http://dx.doi.org/10.1145/1753326.1753507 .","paperID":"None"},{"content":"James R. McKay. 2005. Is There a Case for Extended Interventions for Alcohol and Drug Use Disorders? Addiction 100, 11 (2005), 1594-1610. DOI:http://dx.doi.org/10.1111/j.1360-0443.2005.01208.x.","paperID":"None"},{"content":"James R. McKay. 2009. Continuing Care Research: What We've Learned and Where We're Going. Journal of Substance Abuse Treatment 36, 2 (2009), 131-145. DOI: http://dx.doi.org/10.1016/j.jsat.2008.10.004 .","paperID":"None"},{"content":"A. Thomas McLellan. 2002. Have We Evaluated Addiction Treatment Correctly? Implications from a Chronic Care Perspective. Addiction 97, 3 (2002), 249-252. DOI: http://dx.doi.org/10.1046/j.1360-0443.2002.00127.x .","paperID":"None"},{"content":"A. Thomas McLellan, James R. McKay, Robert Forman, John Cacciola, and Jack Kemp. 2005. Reconsidering the Evaluation of Addiction Treatment: From Retrospective Follow-up to Concurrent Recovery Monitoring. Addiction 100, 4 (2005), 447-458. DOI: http://dx.doi.org/10.1111/j.1360-0443.2005.01012.x .","paperID":"None"},{"content":"Celia J. Morgan and H. Valerie Curran. 2012. Ketamine Use: A Review. Addiction 107, 1 (2012), 27-38. DOI: http://dx.doi.org/10.1111/j.1360-0443.2011.03576.x .","paperID":"None"},{"content":"Annamalai Natarajan, Abhinav Parate, Edward Gaiser, Gustavo Angarita, Robert Malison, Benjamin Marlin, and Deepak Ganesan. 2013. Detecting Cocaine Use with Wearable Electrocardiogram Sensors. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 123-132. DOI: http://dx.doi.org/10.1145/2493432.2493496 .","paperID":"None"},{"content":"S.H. Ng, M.L. Tse, H.W. Ng, and F.L. Lau. 2010. Emergency Department Presentation of Ketamine Abusers in Hong Kong: A Review of 233 Cases. Hong Kong Med. J. 16, 1 (2010), 6-11.","paperID":"None"},{"content":"Shulamith L. A. Straussner. 2013. Clinical Work with Substance-Abusing Clients (3rd Ed.). Guilford Publications.","paperID":"None"},{"content":"Braun Virginia and Clarke Victoria. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (2006), 77-101. DOI: http://dx.doi.org/10.1191/1478088706qp063oa .","paperID":"None"},{"content":"Nora D. Volkow. 2011. Principles of Drug Addiction Treatment: A Research-Based Guide (2nd Ed.). DIANE Publishing Company.","paperID":"None"},{"content":"Chuang-Wen You, Kuo-Cheng Wang, Ming-Chyi Huang, Yen-Chang Chen, Cheng-Lin Lin, Po-Shiun Ho, Hao-Chuan Wang, Polly Huang, and Hao-Hua Chu. 2015. SoberDiary: A Phone-based Support System for Assisting Recovery from Alcohol Dependence. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3839-3848. DOI: http://dx.doi.org/10.1145/2702123.2702289 .","paperID":"None"}],"abstract":"Ketamine is an addictive drug that has been shown to inflict considerable physical and mental damage on users. Due in part to its low cost, ketamine has become one of the most popular club drugs among young adults and teenagers in Southeast Asia. This paper proposes a phone-based support system (KeDiary) with Bluetooth-enabled device for the screening of saliva, as a means of assisting ketamine-dependent patients to self-monitor their ketamine use following acute withdrawal treatment. We also conducted a practical experiment to evaluate the feasibility of the proposed system, wherein three ketamine-dependent patients self-administered tests at least once per day over a period of three weeks. Follow-up interviews with the same users helped in the further refinement of the proposed self-monitoring system.","title":"KeDiary: Using Mobile Phones to Assist Patients in Recovering from Drug Addiction","filename":"CHI16/p5704","authors":["Chuang-Wen You","Ya-Fang Lin","Cheng-Yuan Li","Yu-Lun Tsai","Ming-Chyi Huang","Chao-Hui Lee","Hao-Chuan Wang","Hao-Hua Chu"],"conference":"CHI '16"}