{"paperId":2858301,"citation":[],"abstract":"Increasingly, governments and organisations publish data on expenditure and finance as 'open' data in order to be more transparent to the public in how funding is spent. Accountable is a web-based tool that visualises and relates open financial data provided by local government and non-profit organisations (NPOs) in the UK. A qualitative study was conducted where Accountable was treated as a technology probe, and used by representatives of NPOs and members of the public who invest their time or effort voluntarily into such organisations. The study highlighted how: current open data sets provided by public bodies are inadequate in their representation of funding structures; the focus on finance and fiscal expenditure in such data makes invisible the in-kind effort of volunteers and the wider beneficiaries of an organisation's work; and problems arising from the interoperability of open data technologies. The paper concludes with implications for the design of future systems, considering the domains of transparency and accountability in relation to the findings.","reference":[{"content":"Adobe. 2015. Adobe - Flash Player. (2015). http://www.adobe.com/software/flash/about/","paperID":"None"},{"content":"Michael Bazzell. 2015. Open source intelligence techniques: resources for searching and analyzing online information (4 ed.).","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77--101. DOI: http://dx.doi.org/10.1191/1478088706qp063oa","paperID":"None"},{"content":"Denise K. Conroy. 2005. Non-profit organisations and accountability: A comment on the Mulgan and Sinclair frameworks. Third Sector Review 11, 1 (2005), 103--116. http://eprints.qut.edu.au/9473","paperID":"None"},{"content":"Newcastle City Council. 2015a. Payments over 250 made by Newcastle City Council | Newcastle City Council. (2015). http://www.newcastle.gov.uk/ your-council-and-democracy/ open-data-and-access-to-information/ local-transparency/payments-over-500","paperID":"None"},{"content":"Northumberland County Council. 2015b. Payments to Suppliers. (2015). http://www.northumberland.gov.uk/default.aspx?page=9100","paperID":"None"},{"content":"Angela M. Eikenberry and Jodie Drapal Kluver. 2004. The marketization of the nonprofit sector: civil society at risk? Public administration review (2004), 132--140. http://www.jstor.org/stable/3542607","paperID":"None"},{"content":"Jennifer Ferreira, Mark Perry, and Sriram Subramanian. 2015. Spending time with money: From shared values to social connectivity. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 1222--1234. http://dl.acm.org/citation.cfm?id=2675230","paperID":"None"},{"content":"Jonathan Fox. 2007. The uncertain relationship between transparency and accountability. Development in Practice 17, 4--5 (2007), 663--671. http://www.tandfonline.com/doi/abs/10.1080/ 09614520701469955","paperID":"None"},{"content":"Michael Glassman and Min Ju Kang. 2012. Intelligence in the internet age: The emergence and evolution of Open Source Intelligence (OSINT). Computers in Human Behavior 28, 2 (March 2012), 673--682. DOI: http://dx.doi.org/10.1016/j.chb.2011.11.014","paperID":"None"},{"content":"GOV.UK. 2013. How the Charity Commission ensures charities meet their legal requirements - Publications GOV.UK. (May 2013). https://www.gov.uk/government/publications/ how-we-ensure-charities-meet-their-legal-requirements","paperID":"None"},{"content":"GOV.UK. 2015a. Local government transparency code 2015 - Publications - GOV.UK. (2015). https://www.gov.uk/government/publications/ local-government-transparency-code-2015","paperID":"None"},{"content":"GOV.UK. 2015b. Register Home Page. (2015). http://apps.charitycommission.gov.uk/showcharity/registerofcharities/registerhomepage.aspx","paperID":"None"},{"content":"David Heald. 2003. Fiscal transparency: concepts, measurement and UK practice. Public administration 81, 4 (2003), 723--759. http://www.davidheald.com/publications/ftheald.pdf","paperID":"None"},{"content":"David Heald. 2006. Varieties of transparency. In PROCEEDINGS-BRITISH ACADEMY, Vol. 135. OXFORD UNIVERSITY PRESS INC., 25.","paperID":"None"},{"content":"Dale A. Henderson, Bruce W. Chase, and Benjamin M. Woodson. 2002. Performance Measures for NPOs. Journal of Accountancy 193, 1 (Jan. 2002), 63--68. http://search.ebscohost.com/login.aspx?direct=true&db=buh&AN=5826214&site=ehost-live","paperID":"None"},{"content":"Christopher Hood. 2010. Accountability and transparency: Siamese twins, matching parts, awkward couple? West European Politics 33, 5 (2010), 989--1009. http://www.tandfonline.com/doi/abs/10.1080/ 01402382.2010.486122","paperID":"None"},{"content":"Jonathan Hook, Rachel Clarke, John McCarthy, Kate Anderson, Jane Dudman, and Peter Wright. 2015. Making the Invisible Visible: Design to Support the Documentation of Participatory Arts Experiences. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2583--2592. DOI: http://dx.doi.org/10.1145/2702123.2702187","paperID":"None"},{"content":"Christopher Hope. 2015. True and Fair Foundation: Report claims Britain's biggest charities spend less than half on good works - Telegraph. (2015).","paperID":"None"},{"content":"ddp Houses of Parliament. 2015. Developing with data.parliament data.parliament The Blog. (April 2015). http://www.data.parliament.uk/developers/","paperID":"None"},{"content":"Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Bjrn Eiderbck. 2003. Technology Probes: Inspiring Design for and with Families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 17--24. DOI: http://dx.doi.org/10.1145/642611.642616","paperID":"None"},{"content":"Michael F. Jacobson. 2005. Lifting the veil of secrecy from industry funding of nonprofit health organizations. International journal of occupational and environmental health 11, 4 (2005), 349--355. http://www.maneyonline.com/doi/abs/10.1179/oeh. 2005.11.4.349","paperID":"None"},{"content":"Joseph Jofish Kaye, Mary McCuistion, Rebecca Gulotta, and David A. Shamma. 2014. Money Talks: Tracking Personal Finances. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 521--530. DOI: http://dx.doi.org/10.1145/2556288.2556975","paperID":"None"},{"content":"Michael Krashinsky. 1997. Stakeholder theories of the non-profit sector: One cut at the economic literature. Voluntas: International Journal of Voluntary and Nonprofit Organizations 8, 2 (1997), 149--161. http: //link.springer.com/article/10.1007/BF02354192","paperID":"None"},{"content":"Keith MacMillan, Kevin Money, Arthur Money, and Steve Downing. 2005. Relationship marketing in the not-for-profit sector: an extension and application of the commitment-trust theory. Journal of Business Research 58, 6 (2005), 806--818. http://www.sciencedirect. com/science/article/pii/S0148296303002005","paperID":"None"},{"content":"Heather L. McQuaid, Aradhana Goel, and Mickey McManus. 2003. When You Can't Talk to Customers: Using Storyboards and Narratives to Elicit Empathy for Users. In Proceedings of the 2003 International Conference on Designing Pleasurable Products and Interfaces (DPPI '03). ACM, NY, NY, USA, 120--125. DOI: http://dx.doi.org/10.1145/782896.782926","paperID":"None"},{"content":"Tomasz Miaskiewicz, Susan Jung Grant, and Kenneth A. Kozar. 2009. A preliminary examination of using personas to enhance user-centered design. AMCIS 2009 Proceedings (2009), 697. http://aisel.aisnet.org/cgi/viewcontent.cgi?article=1680&context=amcis2009","paperID":"None"},{"content":"MySociety.org. 2015. TheyWorkForYou. (2015). http://www.theyworkforyou.com","paperID":"None"},{"content":"Richard W Oliver. 2004. What is transparency? McGraw-Hill, NY.","paperID":"None"},{"content":"Andreas Ortmann and Mark Schlesinger. 1997. Trust, repute and the role of non-profit enterprise. Voluntas: International Journal of Voluntary and Nonprofit Organizations 8, 2 (1997), 97--119. http: //link.springer.com/article/10.1007/BF02354189","paperID":"None"},{"content":"Frederick Schauer. 2011. Transparency in three dimensions. U. Ill. L. Rev. (2011), 1339. http://heinonlinebackup.com/hol-cgi-bin/get_pdf.cgi--handle=hein.journals/unilllr2011§ion=47","paperID":"None"},{"content":"Stephen Snow and Dhaval Vyas. 2015. Fostering Collaboration in the Management of Family Finances. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15). ACM, NY, NY, USA, 380--387. DOI:http://dx.doi.org/10.1145/2838739.2838746","paperID":"None"},{"content":"Robert David Steele. 2012. The open-source everything manifesto: transparency, truth, and trust. Evolver Editions, Berkeley, Calif.","paperID":"None"},{"content":"John Vines, Mark Blythe, Paul Dunphy, and Andrew Monk. 2011. Eighty something: banking for the older old. In Proceedings of the 25th BCS Conference on Human-Computer Interaction. British Computer Society, 64--73. http://dl.acm.org/citation.cfm?id=2305330","paperID":"None"},{"content":"John Vines, Paul Dunphy, Mark Blythe, Stephen Lindsay, Andrew Monk, and Patrick Olivier. 2012. The joy of cheques: trust, paper and eighty somethings. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 147--156. http://dl.acm.org/citation.cfm?id=2145229","paperID":"None"},{"content":"John Vines, Paul Dunphy, and Andrew Monk. 2014. Pay or Delay: The Role of Technology when Managing a Low Income. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 501--510. DOI: http://dx.doi.org/10.1145/2556288.2556961","paperID":"None"},{"content":"Dhaval Vyas, Stephen Snow, and Miranda Mallett. 2015. More Than Just Food: Field Visits to an Emergency Relief Centre. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15). ACM, NY, NY, USA, 662--666. DOI: http://dx.doi.org/10.1145/2838739.2838787","paperID":"None"},{"content":"Karl Wilding. 2015. It isn't true or fair to claim charities spend less than half of income on good work. The Guardian (Dec. 2015). http://www.theguardian.com/voluntary-sector-network/2015/dec/14/true-fair-claim-charities-spend-less-income-good-work","paperID":"None"}],"title":"Accountable: Exploring the Inadequacies of Transparent Financial Practice in the Non-Profit Sector","filename":"CHI16/p1620","authors":["Matthew Marshall","David S. Kirk","John Vines"],"conference":"CHI '16"}