{"paperId":2858242,"citation":[],"reference":[{"content":"Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2009. Analysis of text entry performance metrics. In Science and Technology for Humanity (TIC-STH), 2009 IEEE Toronto International Conference. IEEE, 100--105.","paperID":"None"},{"content":"Shiri Azenkot and Shumin Zhai. 2012. Touch Behavior with Different Postures on Soft Smartphone Keyboards. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 251--260. DOI: http://dx.doi.org/10.1145/2371574.2371612","paperID":"None"},{"content":"Xiaojun Bi, Yang Li, and Shumin Zhai. 2013. FFitts Law: Modeling Finger Touch with Fitts' Law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1363--1372. DOI: http://dx.doi.org/10.1145/2470654.2466180","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Tovi Grossman, and George Fitzmaurice. 2014. Swipeboard: A Text Entry Technique for Ultra-small Interfaces That Supports Novice to Expert Transitions. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 615--620. DOI: http://dx.doi.org/10.1145/2642918.2647354","paperID":"None"},{"content":"Jonggi Hong, Seongkook Heo, Poika Isokoski, and Geehyuk Lee. 2015. SplitBoard: A Simple Split Soft Keyboard for Wristwatch-sized Touch Screens. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1233--1236. DOI: http://dx.doi.org/10.1145/2702123.2702273","paperID":"None"},{"content":"Andreas Komninos and Mark Dunlop. 2014. Text Input on a Smart Watch. IEEE Pervasive Computing 13, 4 (2014), 50--58. DOI: http://dx.doi.org/10.1109/MPRV.2014.77","paperID":"None"},{"content":"Per-Ola Kristensson and Shumin Zhai. 2004. SHARK2: A Large Vocabulary Shorthand Writing System for Pen-based Computers. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, New York, NY, USA, 43--52. DOI: http://dx.doi.org/10.1145/1029632.1029640","paperID":"None"},{"content":"Luis A. Leiva, Alireza Sahami, Alejandro Catala, Niels Henze, and Albrecht Schmidt. 2015. Text Entry on Tiny QWERTY Soft Keyboards. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 669--678. DOI: http://dx.doi.org/10.1145/2702123.2702388","paperID":"None"},{"content":"I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, New York, NY, USA, 754--755. DOI: http://dx.doi.org/10.1145/765891.765971","paperID":"None"},{"content":"Stephen Oney, Chris Harrison, Amy Ogan, and Jason Wiese. 2013. ZoomBoard: A Diminutive Qwerty Soft Keyboard Using Iterative Zooming for Ultra-small Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2799--2802. DOI: http://dx.doi.org/10.1145/2470654.2481387","paperID":"None"},{"content":"Shyam Reyal, Shumin Zhai, and Per Ola Kristensson. 2015. Performance and User Experience of Touchscreen and Gesture Keyboards in a Lab Setting and in the Wild. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 679--688. DOI: http://dx.doi.org/10.1145/2702123.2702597","paperID":"None"},{"content":"R. William Soukoreff and I. Scott MacKenzie. 2003. Metrics for Text Entry Research: An Evaluation of MSD and KSPC, and a New Unified Error Metric. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 113--120. DOI: http://dx.doi.org/10.1145/642611.642632","paperID":"None"},{"content":"Keith Vertanen, Haythem Memmi, Justin Emge, Shyam Reyal, and Per Ola Kristensson. 2015. VelociTap: Investigating Fast Mobile Text Entry Using Sentence-Based Decoding of Touchscreen Keyboard Input. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 659--668. DOI: http://dx.doi.org/10.1145/2702123.2702135","paperID":"None"}],"abstract":"We present WatchWriter, a finger operated keyboard that supports both touch and gesture typing with statistical decoding on a smartwatch. Just like on modern smartphones, users type one letter per tap or one word per gesture stroke on WatchWriter but in a much smaller spatial scale. WatchWriter demonstrates that human motor control adaptability, coupled with modern statistical decoding and error correction technologies developed for smartphones, can enable a surprisingly effective typing performance despite the small watch size. In a user performance experiment entirely run on a smartwatch, 36 participants reached a speed of 22-24 WPM with near zero error rate.","title":"WatchWriter: Tap and Gesture Typing on a Smartwatch Miniature Keyboard with Statistical Decoding","filename":"CHI16/p3817","authors":["Mitchell Gordon","Tom Ouyang","Shumin Zhai"],"conference":"CHI '16"}