{"paperId":2858510,"citation":[],"abstract":"How many guns are there in the USA? What is the incidence of breast cancer? Is a billion dollar budget cut large or small? Advocates of scientific and civic literacy are concerned with improving how people estimate and comprehend risks, measurements, and frequencies, but relatively little progress has been made in this direction. In this article we describe and test a framework to help people comprehend numerical measurements in everyday settings through simple sentences, termed perspectives, that employ ratios, ranks, and unit changes to make them easier to understand. We use a crowdsourced system to generate perspectives for a wide range of numbers taken from online news articles. We then test the effectiveness of these perspectives in three randomized, online experiments involving over 3,200 participants. We find that perspective clauses substantially improve people's ability to recall measurements they have read, estimate ones they have not, and detect errors in manipulated measurements. We see this as the first of many steps in leveraging digital platforms to improve numeracy among online readers.","reference":[{"content":"S Bautista, R Hervas, P Gervas, Richard R Power, and Sandra Williams. 2011. How to Make Numerical Information Accessible: Experimental Identification of Simplification Strategies. In INTERACT 2011. Vol. 6946. Springer Berlin Heidelberg, 57--64. http://dx.doi.org/10.1007/978--3--642--23774--4_7","paperID":"None"},{"content":"Daniel B Berch. 2005. Making sense of number sense: implications for children with mathematical disabilities. Journal of Learning Disabilities 38, 4 (2005), 333--339.","paperID":"None"},{"content":"Michael Blastland and Andrew W Dilnot. 2009. The Numbers Game: The Commonsense Guide to Understanding Numbers in the News, in Politics, and in Life. Gotham Books, NY, NY, USA.","paperID":"None"},{"content":"Norman R Brown and Robert S Siegler. 1993. Metrics and mappings: A framework for understanding real-world quantitative estimation. Psychological Review 100, 3 (July 1993), 511--534.","paperID":"None"},{"content":"Egon Brunswik. 1955. Representative design and probabilistic theory in a functional psychology. Psychological Review 62, 3 (1955), 193--217.","paperID":"None"},{"content":"Fergus IM Craik and Endel Tulving. 1975. Depth of processing and the retention of words in episodic memory. Journal of Experimental Psychology 104, 3 (1975), 268--294.","paperID":"None"},{"content":"Sunaina Dowray, Jonas J. Swartz, Danielle Braxton, and Anthony J. Viera. 2013. Potential effect of physical activity based menu labels on the calorie content of selected fast food meals. Appetite 62, 1 (2013), 173--181. http://dx.doi.org/10.1016/j.appet.2012.11.013","paperID":"None"},{"content":"Dedre Gentner and Allan Collins. 1981. Studies of inference from lack of knowledge. Memory & Cognition 9, 4 (1981), 434--443.","paperID":"None"},{"content":"Gerd Gigerenzer. 2014. Risk Savvy: How to Make Good Decisions. Viking Books, NY, NY, USA.","paperID":"None"},{"content":"J Greeno. 1991. Number sense as situated knowing in a conceptual domain. Journal for Research in Mathematics Education 22, 3 (Jan 1991), 170--218. http://www.jstor.org/stable/749074","paperID":"None"},{"content":"David Landy, Noah Silbert, and Aleah Goldin. 2013. Estimating Large Numbers. Cognitive Science 37, 5 (July 2013), 775--799.","paperID":"None"},{"content":"Richard P Larrick and Jack B Soll. 2008. The MPG Illusion. Science 320, 5883 (2008), 1593--1594.","paperID":"None"},{"content":"Raymond Liaw, Ari Zilnik, Mark Baldwin, and Stephanie Butler. 2013. Maater: Crowdsourcing to Improve Online Journalism. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). 2549--2554.","paperID":"None"},{"content":"Isaac M Lipkus, Greg Samsa, and Barbara K Rimer. 2001. General Performance on a Numeracy Scale among Highly Educated Samples. Medical Decision Making 21, 1 (Feb. 2001), 37--44.","paperID":"None"},{"content":"Z Markovits and J Sowder. 1994. Developing number sense: An intervention study in grade 7. Journal for Research in Mathematics Education 25, 1 (Jan 1994), 4--29. http://www.jstor.org/stable/749290","paperID":"None"},{"content":"W Mason and S Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior Research Methods 44, 1 (Jan 2012), 1--23. http://dx.doi.org/10.3758/s13428-011-0124--6","paperID":"None"},{"content":"Alistair McIntosh, Barbara J Reys, and Robert E Reys. 1992. A proposed framework for examining basic number sense. For the Learning of Mathematics 12, 3 (1992), 2--44. http://www.jstor.org/stable/40248053","paperID":"None"},{"content":"Dennis L McNeill and William L Wilkie. 1979. Public policy and consumer information: Impact of the new energy labels. Journal of Consumer Research 6, 1 (1979), 1--11. http://www.jstor.org/stable/2488721","paperID":"None"},{"content":"Edward L Munnich, Michael A Ranney, and Daniel M Appel. 2004. Numerically-Driven Inferencing in instruction: The relatively broad transfer of estimation skills. In Proceedings of the Twenty-sixth Annual Conference of the Cognitive Science Society. 987--992.","paperID":"None"},{"content":"Raymond S Nickerson. 1980. Motivated retrieval from archival memory. In Nebraska Symposium on Motivation. University of Nebraska Press, Lincoln, Nebraska, USA.","paperID":"None"},{"content":"John Allen Paulos. 1988. Innumeracy: Mathematical Illiteracy and Its Consequences. Hill and Wang, NY, NY, USA.","paperID":"None"},{"content":"Michael Andrew Ranney, Luke F Rinne, Louise Yarnall, Edward Munnich, Luke Miratrix, and Patricia Schank. 2008. Designing and Assessing Numeracy Training for Journalists: Toward Improving Quantitative Reasoning Among Media Consumers. Proceedings of the Eighth International Conference for the Learning Sciences (2008), 246--253.","paperID":"None"},{"content":"Luz Rello, Susana Bautista, Ricardo Baeza-Yates, Pablo Gervas, Raquel Hervas, and Horacio Saggion. 2013. One Half or 50%? An Eye-Tracking Study of Number Representation Readability. In INTERACT 2013. Vol. 8120. Springer Berlin Heidelberg, 229--245. http://dx.doi.org/10.1007/978--3--642--40498--6_17","paperID":"None"},{"content":"Endel Tulving. 1962. Subjective organization in free recall of \"unrelated\" words. Psychological Review 69, 4 (1962), 344--354.","paperID":"None"},{"content":"Endel Tulving and Shirley Osler. 1968. Effectiveness of retrieval cues in memory for words. Journal of Experimental Psychology 77, 4 (1968), 593--601.","paperID":"None"}],"title":"Improving Comprehension of Numbers in the News","filename":"CHI16/p2729","authors":["Pablo J. Barrio","Daniel G. Goldstein","Jake M. Hofman"],"conference":"CHI '16"}