{"paperId":2858573,"citation":[],"abstract":"In this work we present a mobile application we designed and engineered to enable people to log their travels near and far, leave notes behind, and build a community around spaces in between destinations. Our design explores new ground for location-based social computing systems, identifying opportunities where these systems can foster the growth of on-line communities rooted at non-places. In our work we develop, explore, and evaluate several innovative features designed around four usage scenarios: daily commuting, long-distance traveling, quantified traveling, and journaling. We present the results of two small-scale user studies, and one large-scale, world-wide deployment, synthesizing the results as potential opportunities and lessons learned in designing social computing for non-places.","title":"Journeys & Notes: Designing Social Computing for Non-Places","filename":"CHI16/p4722","authors":["Justin Cranshaw","Andrés Monroy-Hernández","S.A. Needham"],"conference":"CHI '16","reference":[{"content":"2015. List of birds by common name. (July 2015). https://en.wikipedia.org/w/index.php?title=List_of_birds_by_common_name&oldid=672667630 Page Version ID: 672667630.","paperID":"None"},{"content":"John Agnew. 2011. Space and place. The SAGE handbook of geographical knowledge (2011), 316-330.","paperID":"None"},{"content":"Chris Aniszczyk. 2013. Twitter Typeahead.js: You Autocomplete Me. (2013). https://blog.twitter.com/2013/twitter-typeaheadjs-you-autocomplete-me","paperID":"None"},{"content":"Marc Augé. 1995. Non-Places: An Introduction to Supermodernity (2 edition ed.). Verso, London ; New York.","paperID":"None"},{"content":"Gaston Bachelard and Maria Jolas. 1994. The poetics of space. Vol. 330. Beacon Press.","paperID":"None"},{"content":"Nicolas Belloni, Lars Erik Holmquist, and Jakob Tholander. 2009. See you on the subway: exploring mobile social software. In CHI'09 Extended Abstracts on Human Factors in Computing Systems. ACM, 4543-4548.","paperID":"None"},{"content":"Michael S Bernstein, Andrés Monroy-Hernández, Drew Harry, Paul André, Katrina Panovich, and Greg Vargas. 2011. 4chan and/b: An Analysis of Anonymity and Ephemerality in a Large Online Community. (2011).","paperID":"None"},{"content":"Åsa Blomquist and Mattias Arvola. 2002. Personas in action: ethnography in an interaction design team. In Proceedings of the second Nordic conference on Human-computer interaction. ACM, 197-200.","paperID":"None"},{"content":"Tiago Camacho, Marcus Foth, and Andry Rakotonirainy. 2012. Pervasive technology and public transport: Opportunities beyond telematics. IEEE Pervasive Computing 12, 1 (2012), 18-25.","paperID":"None"},{"content":"Tiago Camacho, Marcus Foth, and Andry Rakotonirainy. 2013. Trainroulette: promoting situated in-train social interaction between passengers. In Proceedings of the 2013 ACM conference on Pervasive and ubiquitous computing adjunct publication. ACM, 1385-1388.","paperID":"None"},{"content":"J.M. Carroll. 2000a. Five reasons for scenario-based design. Interacting with Computers 13, 1 (2000), 43-60. DOI: http://dx.doi.org/10.1016/S0953--5438(00)00023-0","paperID":"None"},{"content":"John M Carroll. 2000b. Making use: scenario-based design of human-computer interactions. MIT press.","paperID":"None"},{"content":"Yen-ning Chang, Youn-kyung Lim, and Erik Stolterman. 2008. Personas: From Theory to Practices. In Proceedings of the 5th Nordic Conference on Human-computer Interaction: Building Bridges (NordiCHI '08). ACM, New York, NY, USA, 439-442. DOI: http://dx.doi.org/10.1145/1463160.1463214","paperID":"None"},{"content":"Paolo Cintia, Luca Pappalardo, and Dino Pedreschi. 2013. \"Engine Matters\": A First Large Scale Data Driven Study on Cyclists' Performance. In Proceedings of the 2013 IEEE 13th International Conference on Data Mining Workshops (ICDMW '13). IEEE Computer Society, Washington, DC, USA, 147-153. DOI: http://dx.doi.org/10.1109/ICDMW.2013.41","paperID":"None"},{"content":"Henriette Cramer, Mattias Rost, and Lars Erik Holmquist. 2011. Performing a check-in: emerging practices, norms and 'conflicts' in location-sharing using foursquare. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services. ACM, 57-66.","paperID":"None"},{"content":"Justin B Cranshaw, Kurt Luther, Patrick Gage Kelley, and Norman Sadeh. 2014. Curated city: capturing individual city guides through social curation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3249-3258.","paperID":"None"},{"content":"Kim-Mai Cutler. 2013. No Fitbit Or Fuelband Necessary. The Moves App Tracks Your Steps From The iPhone. (2013). http://social.techcrunch.com/2013/01/24/moves-app-activity-tracker/","paperID":"None"},{"content":"Paul Dourish. 2006. Re-space-ing Place: \"Place\" and \"Space\" Ten Years on. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (CSCW '06). ACM, New York, NY, USA, 299-308. DOI: http://dx.doi.org/10.1145/1180875.1180921","paperID":"None"},{"content":"J Nicholas Entrikin. 1991. The betweenness of place: Towards a geography of modernity. (1991).","paperID":"None"},{"content":"Steve Harrison and Paul Dourish. 1996. Re-place-ing Space: The Roles of Place and Space in Collaborative Systems. In Proceedings of the 1996 ACM Conference on Computer Supported Cooperative Work (CSCW '96). ACM, New York, NY, USA, 67-76. DOI: http://dx.doi.org/10.1145/240080.240193","paperID":"None"},{"content":"Jane Jacobs. 1961. The death and life of great American cities. Random House, New York.","paperID":"None"},{"content":"Yoojung Kim, Changhoon Oh, Taeyoung Lee, Donghun Lee, Joongseek Lee, and Bongwon Suh. 2015. Travel Q: Questifying Micro Activities Using Travel Photos to Enhance Travel Experience. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1507-1512.","paperID":"None"},{"content":"Robert E Kraut, Paul Resnick, Sara Kiesler, Moira Burke, Yan Chen, Niki Kittur, Joseph Konstan, Yuqing Ren, and John Riedl. 2012. Building successful online communities: Evidence-based social design. Mit Press.","paperID":"None"},{"content":"Nicole Lee. 2014. Shh, it's a Secret: The allure of the anonymous internet. (2014). http://www.engadget.com/2014/04/16/secret-anonymous-internet/","paperID":"None"},{"content":"Henri Lefebvre. 1991. The production of space. Vol. 142. Oxford Blackwell.","paperID":"None"},{"content":"Janne Lindqvist, Justin Cranshaw, Jason Wiese, Jason Hong, and John Zimmerman. 2011. I'm the mayor of my house: examining why people use foursquare - a social-driven location sharing application. In Proceedings of the 2011 annual conference on Human factors in computing systems (CHI '11). ACM, New York, NY, USA, 2409-2418. DOI: http://dx.doi.org/10.1145/1978942.1979295","paperID":"None"},{"content":"Joseph F McCarthy, Shelly D Farnham, Yogi Patel, Sameer Ahuja, Daniel Norman, William R Hazlewood, and Josh Lind. 2009. Supporting community in third places with situated social software. In Proceedings of the fourth international conference on Communities and technologies. ACM, 225-234.","paperID":"None"},{"content":"S Milgram. 1977. The Individual in a Social World: Essays and Experiments. Longman Education, London.","paperID":"None"},{"content":"Lene Nielsen. 2002. From User to Character: An Investigation into User-descriptions in Scenarios. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '02). ACM, New York, NY, USA, 99-104. DOI: http://dx.doi.org/10.1145/778712.778729","paperID":"None"},{"content":"Ray Oldenburg. 1989. The great good place: cafés, coffee shops, community centers, beauty parlors, general stores, bars, hangouts, and how they get you through the day.","paperID":"None"},{"content":"Eric Paulos and Elizabeth Goodman. 2004. The familiar stranger: anxiety, comfort, and play in public places. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '04). ACM, New York, NY, USA, 223-230. DOI: http://dx.doi.org/10.1145/985692.985721","paperID":"None"},{"content":"Jenny Preece. 2000. Online communities: Designing usability and supporting socialbilty. John Wiley & Sons, Inc.","paperID":"None"},{"content":"John Pruitt and Jonathan Grudin. 2003. Personas: practice and theory. In Proceedings of the 2003 conference on Designing for user experiences. ACM, 1-15.","paperID":"None"},{"content":"Robert D. Putnam. 1995. Bowling Alone: America's Declining Social Capital. Journal of Democracy 6, 1 (1995), 65-78. DOI: http://dx.doi.org/10.1353/jod.1995.0002","paperID":"None"},{"content":"Daniela K Rosner, Hidekazu Saegusa, Jeremy Friedland, and Allison Chambliss. 2015. Walking by Drawing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 397-406.","paperID":"None"},{"content":"Mary Beth Rosson and John M Carroll. 2009. Scenario based design. Human-computer interaction. Boca Raton, FL (2009), 145-162.","paperID":"None"},{"content":"Raz Schwartz. 2014. Online place attachment. Mobility and Locative Media: Mobile Communication in Hybrid Spaces (2014), 85.","paperID":"None"},{"content":"Thiago H. Silva, Pedro O. Melo, Aline Carneiro Viana, Jussara M. Almeida, Juliana Salles, and Antonio A. Loureiro. 2013. Traffic Condition Is More Than Colored Lines on a Map: Characterization of Waze Alerts. In Proceedings of the 5th International Conference on Social Informatics - Volume 8238 (SocInfo 2013). Springer-Verlag New York, Inc., New York, NY, USA, 309-318. DOI: http://dx.doi.org/10.1007/978--3--319-03260--3_27","paperID":"None"},{"content":"Yi-Fu Tuan. 1977. Space and place: The perspective of experience. U of Minnesota Press.","paperID":"None"},{"content":"Ahmet Zeynep, Henriette Cramer, Lars Erik Holmquist, and Mattias Rost. 2011. Gamification and location-sharing: some emerging social conflicts. In Proceedings of the Workshop on Gamification, CHI 2011. ACM","paperID":"None"}]}