{"paperId":2858339,"reference":[{"content":"Stuart M. Anstis. 1974. A chart demonstrating variations in acuity with retinal position. Vision Research 14, 7 (1974), 589--592.","paperID":"None"},{"content":"Jacques Bertin. 1983. Semiology of Graphics. University of Wisconsin Press.","paperID":"None"},{"content":"Irving Biederman. 1987. Recognition-by-components: A theory of human image understanding. Psychological Review 94 (1987), 115--147.","paperID":"None"},{"content":"J. J. Cadiz, Gina Venolia, Gavin Jancke, and Anoop Gupta. 2002. Designing and Deploying an Information Awareness Interface. In Proceedings of the 2002 ACM Conference on Computer Supported Cooperative Work (CSCW '02). ACM, NY, NY, USA, 314--323. DOI: http://dx.doi.org/10.1145/587078.587122","paperID":"None"},{"content":"Stuard K. Card, Thomas P. Moran, and Allen Newell. 1986. The Model Human Processor: an Engineering Model for Human Performance. In Handbook of Perception and Human Performance. Vol. 2. Wiley.","paperID":"None"},{"content":"Enrico Costanza, Samuel A. Inverso, Elan Pavlov, Rebecca Allen, and Pattie Maes. 2006. Eye-q: Eyeglass Peripheral Display for Subtle Intimate Notifications. In Proceedings of the 8th Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '06). ACM, NY, NY, USA, 211--218. DOI: http://dx.doi.org/10.1145/1152215.1152261","paperID":"None"},{"content":"Ionut Damian, Chiew Seng (Sean) Tan, Tobias Baur, Johannes Schoning, Kris Luyten, and Elisabeth Andre. 2015. Augmenting Social Interactions: Realtime Behavioural Feedback Using Social Signal Processing Techniques. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 565--574. DOI: http://dx.doi.org/10.1145/2702123.2702314","paperID":"None"},{"content":"Donald Hameluck and Paul Stager. 1987. the Peripheral Vision Horizon Display: A Review. Technical Report 87-03844. York University, Toronto.","paperID":"None"},{"content":"Valentin Heun, Anette von Kapri, and Pattie Maes. 2012. Perifoveal Display: Combining Foveal and Peripheral Vision in One Visualization. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, NY, NY, USA, 1150--1155. DOI: http://dx.doi.org/10.1145/2370216.2370460","paperID":"None"},{"content":"K.J. Holden. 1964. Instrument Displays for Blind Flying. Journal of the Royal Aeronautical Society 68, 833 (1964).","paperID":"None"},{"content":"Hans-Werner Hunziker. 2009. Im Auge des Lesers -- foveale und periphere Wahrnehmung: vom Buchstabieren zur Lesefreude. Transmedia Verlag.","paperID":"None"},{"content":"Robert Keston, Donald Doxtader, and Ronald J. Massa. 1964. Visual Experiments Related to Night Carrier Landing. Human Factors: The Journal of the Human Factors and Ergonomics Society 6, 5 (1964).","paperID":"None"},{"content":"Simon Liversedge, Iain Gilchrist, and Stefan Everling. 2011. The Oxford Handbook of Eye Movements. Oxford Library of Psychology.","paperID":"None"},{"content":"Blair MacIntyre, Elizabeth D. Mynatt, Stephen Voida, Klaus M. Hansen, Joe Tullio, and Gregory M. Corso. 2001. Support for Multitasking and Background Awareness Using Interactive Peripheral Displays. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, NY, NY, USA, 41--50. DOI: http://dx.doi.org/10.1145/502348.502355","paperID":"None"},{"content":"Paul P. Maglio and Christopher S. Campbell. 2000. Tradeoffs in Displaying Peripheral Information. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, NY, NY, USA, 241--248. DOI: http://dx.doi.org/10.1145/332040.332438","paperID":"None"},{"content":"Jennifer Mankoff, Anind K. Dey, Gary Hsieh, Julie Kientz, Scott Lederer, and Morgan Ames. 2003. Heuristic Evaluation of Ambient Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 169--176. DOI: http://dx.doi.org/10.1145/642611.642642","paperID":"None"},{"content":"Tara Matthews. 2006. Designing and Evaluating Glanceable Peripheral Displays. In Proceedings of the 6th Conference on Designing Interactive Systems (DIS '06). ACM, NY, NY, USA, 343--345. DOI: http://dx.doi.org/10.1145/1142405.1142457","paperID":"None"},{"content":"Tara Matthews, Anind K. Dey, Jennifer Mankoff, Scott Carter, and Tye Rattenbury. 2004. A Toolkit for Managing User Attention in Peripheral Displays. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, NY, NY, USA, 247--256. DOI: http://dx.doi.org/10.1145/1029632.1029676","paperID":"None"},{"content":"Tara Matthews, Tye Rattenbury, Scott Carter, Anind K. Dey, and Jennifer Mankoff. 2003. A peripheral display toolkit. Technical Report UCB/CSD-03--1258. EECS Department, University of California, Berkeley. http://www.eecs.berkeley.edu/Pubs/TechRpts/2003/5782.html","paperID":"None"},{"content":"S. Olsson and P.C. Burns. 2000. Measuring driver visual distraction with a peripheral detection task. Department of Education and Psychology, Linköping University, Sweden (2000).","paperID":"None"},{"content":"Elin Rønby Pedersen and Tomas Sokoler. 1997. AROMA: Abstract Representation of Presence Supporting Mutual Awareness. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '97). ACM, NY, NY, USA, 51--58. DOI: http://dx.doi.org/10.1145/258549.258584","paperID":"None"},{"content":"Xiaobin Shen, Andrew Vande Moere, and Peter Eades. 2005. An Intrusive Evaluation of Peripheral Display. In Proceedings of the 3rd International Conference on Computer Graphics and Interactive Techniques in Australasia and South East Asia (GRAPHITE '05). ACM, NY, NY, USA, 289--292. DOI: http://dx.doi.org/10.1145/1101389.1101447","paperID":"None"},{"content":"M. Iftekhar Tanveer, Emy Lin, and Mohammed (Ehsan) Hoque. 2015. Rhema: A Real-Time In-Situ Intelligent Interface to Help People with Public Speaking. In Proceedings of the 20th International Conference on Intelligent User Interfaces (IUI '15). ACM, NY, NY, USA, 286--295. DOI: http://dx.doi.org/10.1145/2678025.2701386","paperID":"None"},{"content":"Colin Ware. 2012. Information Visualization: Perception for Design (3 ed.). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.","paperID":"None"}],"citation":[],"abstract":"In this paper, we set out to find what encompasses an appropriate visual language for information presented on near-eye out-of-focus displays. These displays are positioned in a user's peripheral view, very near to the user's eyes, for example on the inside of the temples of a pair of glasses. We explored the usable display area, the role of spatial and retinal variables, and the influence of motion and interaction for such a language. Our findings show that a usable visual language can be accomplished by limiting the possible shapes and by making clever use of orientation and meaningful motion. We found that especially motion is very important to improve perception and comprehension of what is being displayed on near-eye out-of-focus displays, and that perception is further improved if direct interaction with the content is allowed.","title":"Hidden in Plain Sight: an Exploration of a Visual Language for Near-Eye Out-of-Focus Displays in the Peripheral View","filename":"CHI16/p487","authors":["Kris Luyten","Donald Degraen","Gustavo Rovelo Ruiz","Sven Coppers","Davy Vanacken"],"conference":"CHI '16"}