{"paperId":2858392,"citation":[],"reference":[{"content":"Kat Austen. Out of the Lab and onto the Streets. New Scientist 218, 2923 (2013), 48--51.","paperID":"None"},{"content":"Nebil Buyurgan, Bill C Hardgrave, Janice Lo and Ronald T Walker. Rfid in Healthcare: A Framework of Uses and Opportunities. International Journal of Advanced Pervasive and Ubiquitous Computing 1, 1 (2009), 1--25.","paperID":"None"},{"content":"Joseph R Carvalko. Year. Law and Policy in an Era of Cyborg-Assisted-Life 1: The Implications of Interfacing in-the-Body Technologies to the Outer World 2. In Proceedings of Technology and Society (ISTAS), 2013 IEEE International Symposium on. IEEE, 204--215.","paperID":"None"},{"content":"Louise Cheer. Australian Man Who's Had a Microchip Inserted into His Hand So That He Can Do More with the Iphone 6...Maybe. 2014. http://www.dailymail.co.uk/news/article2746648/Australian-man-microchip-inserted-hand-useiPhone-6.html Ixzz3lOpJkDNN","paperID":"None"},{"content":"Andy Clark. Natural-Born Cyborgs? In Cognitive Technology: Instruments of Mind, Springer, 2001, 1724.","paperID":"None"},{"content":"DangerousThings. Retrieved from https://dangerousthings.com.","paperID":"None"},{"content":"Peter Fernandez. Wearable Technology: Beyond Augmented Reality. Library Hi Tech News 31, 9 (2014).","paperID":"None"},{"content":"Mark N Gasson. Ict Implants. In The Future of Identity in the Information Society, Springer, 2008, 287--295.","paperID":"None"},{"content":"Amal Graafstra, Katina Michael and MG Michael. Year. Social-Technical Issues Facing the Humancentric Rfid Implantee Sub-Culture through the Eyes of Amal Graafstra. In Proceedings of Technology and Society (ISTAS), 2010 IEEE International Symposium on. IEEE, 498--516.","paperID":"None"},{"content":"Chris Harrison, Desney Tan and Dan Morris. Year. Skinput: Appropriating the Body as an Input Surface. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 453--462.","paperID":"None"},{"content":"Christian Holz, Tovi Grossman, George Fitzmaurice and Anne Agur. Year. Implanted User Interfaces. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 503512.","paperID":"None"},{"content":"R Ip, Katina Michael and MG Michael. Amal Graafstra-the Do-It-Yourselfer Rfid Implantee: The Culture, Values and Ethics of Hobbyist Implantees. Faculty of Informatics-Papers (2008), 582.","paperID":"None"},{"content":"Oliver Jonas, Heather M Landry, Jason E Fuller, John T Santini, Jose Baselga, Robert I Tepper, Michael J Cima and Robert Langer. An Implantable Microdevice to Perform High-Throughput in Vivo Drug Sensitivity Testing in Tumors. Science translational medicine 7, 284 (2015), 284ra257--284ra257.","paperID":"None"},{"content":"Eduardo Kac. Time Capsule. AI & SOCIETY 14, 2 (2000), 243--249.","paperID":"None"},{"content":"Hsin-Liu Cindy Kao, Artem Dementyev, Joseph A Paradiso and Chris Schmandt. Year. Nailo: Fingernails as an Input Surface. In Proceedings of Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3015--3018.","paperID":"None"},{"content":"Jakob Eg Larsen, Andrea Cuttone and Sune Lehmann Jørgensen. Year. Qs Spiral: Visualizing Periodic Quantified Self Data. In Proceedings of CHI 2013 Workshop on Personal Informatics in the Wild: Hacking Habits for Health & Happiness.","paperID":"None"},{"content":"Heidi Ledford. Garage Biotech: Life Hackers. Nature News 467, 7316 (2010), 650--652.","paperID":"None"},{"content":"Roman Lissermann, Jochen Huber, Aristotelis Hadjakos, Suranga Nanayakkara and Max Mühlhäuser. Year. Earput: Augmenting Ear-Worn Devices for EarBased Interaction. In Proceedings of Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design. ACM, 300--307.","paperID":"None"},{"content":"Deborah Lupton. Year. Self-Tracking Cultures: Towards a Sociology of Personal Informatics. In Proceedings of Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design. ACM, 77--86.","paperID":"None"},{"content":"Steve Mann. Year. Eudaemonic Computing ('Underwearables'). In Proceedings of Wearable Computers, 1997. Digest of Papers., First International Symposium on. IEEE, 177--178.","paperID":"None"},{"content":"Amelia Masters and Katina Michael. Year. Humancentric Applications of Rfid Implants: The Usability Contexts of Control, Convenience and Care. In Proceedings of Mobile Commerce and Services, 2005. WMCS'05. The Second IEEE International Workshop on. IEEE, 32--41.","paperID":"None"},{"content":"K Michael. Rfid Implantable Devices for Humans and the Risk Versus Reward Debate:\" What Are We Waiting For?\" (2010).","paperID":"None"},{"content":"Katina Michael. Homo Electricus and the Continued Speciation of Humans (2006).","paperID":"None"},{"content":"Katina Michael and MG Michael. Microchipping People: The Rise of the Electrophorus. Faculty of Informatics-Papers (2005), 374.","paperID":"None"},{"content":"Katina Michael and MG Michael. Towards Chipification: The Multifunctional Body Art of the Net Generation (2006).","paperID":"None"},{"content":"Katina Michael and MG Michael. Year. The Diffusion of Rfid Implants for Access Control and Epayments: A Case Study on Baja Beach Club in Barcelona. In Proceedings of Technology and Society (ISTAS), 2010 IEEE International Symposium on. IEEE, 242--252.","paperID":"None"},{"content":"Katina Michael and MG Michael. The Future Prospects of Embedded Microchips in Humans as Unique Identifiers: The Risks Versus the Rewards. Media, Culture & Society 35, 1 (2013), 78--86.","paperID":"None"},{"content":"Katina Michael, MG Michael and Rodney Ip. Microchip Implants for Humans as Unique Identifiers: A Case Study on Verichip. Faculty of Informatics Papers (2008), 586.","paperID":"None"},{"content":"Keiron Monks. Forget Wearable Tech, Embeddable Implants Are Already Here.2014. Retrieved from http://edition.cnn.com/2014/04/08/tech/forgetwearable-tech-embeddable-implants/.","paperID":"None"},{"content":"Scott D Novich and David M Eagleman. Using Space and Time to Encode Vibrotactile Information: Toward an Estimate of the Skin's Achievable Throughput. Experimental brain research (2015), 1--12.","paperID":"None"},{"content":"Fabienne Nsanze. Ict Implants in the Human Body-a Review. The European Group on Ethics in Science and New Technologies to the European Commission2005 (2005).","paperID":"None"},{"content":"Bart Penders. Biotechnology: Diy Biology. Nature 472, 7342 (2011), 167--167.","paperID":"None"},{"content":"Joel S Perlmutter and Jonathan W Mink. Deep Brain Stimulation. Annu. Rev. Neurosci. 29 (2006), 229--257.","paperID":"None"},{"content":"Ashton Pfannenstiel and Barbara S Chaparro. An Investigation of the Usability and Desirability of Health and Fitness-Tracking Devices. In Hci International 2015-Posters' Extended Abstracts, Springer, 2015, 473--477.","paperID":"None"},{"content":"Keith F Punch. Introduction to Social Research: Quantitative and Qualitative Approaches. Sage, 2013.","paperID":"None"},{"content":"Raji Srinivasan. Sources, Characteristics and Effects of Emerging Technologies: Research Opportunities in Innovation. Industrial Marketing Management 37, 6 (2008), 633--640.","paperID":"None"},{"content":"Robert A Stebbins. Amateurs, Professionals, and Serious Leisure. McGill-Queen's Press-MQUP, 1992.","paperID":"None"},{"content":"Stelarc Stelarc. The Cadaver, the Comatose, and the Chimera: Avatars Have No Organs (2013).","paperID":"None"},{"content":"Karl D Stephan, Katina Michael, MG Michael, Laura Jacob and Emily P Anesta. Social Implications of Technology: The Past, the Present, and the Future. Proceedings of the IEEE 100, Special Centennial Issue (2012), 1752--1781.","paperID":"None"},{"content":"Chao-Huai Su, Liwei Chan, Chien-Ting Weng, RongHao Liang, Kai-Yin Cheng and Bing-Yu Chen. Year. Nail display: Bringing an Always Available Visual Display to Fingertips. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1461--1464.","paperID":"None"},{"content":"Hiroaki Tobita and Takuya Kuzi. Year. Smartwig: Wig-Based Wearable Computing Device for Communication and Entertainment. In Proceedings of Proceedings of the International Working Conference on Advanced Visual Interfaces. ACM, 299--302.","paperID":"None"},{"content":"Neil Ungerleider. Biohackers and Diy Cyborgs Clone Silicon Valley Innovation. Fast Company (2012).","paperID":"None"},{"content":"Kate Vaisutis, Margot Brereton, Toni Robertson, Frank Vetere, Jeannette Durick, Bjorn Nansen and Laurie Buys. Year. Invisible Connections: Investigating Older People's Emotions and Social Relations around Objects. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1937--1940.","paperID":"None"},{"content":"NM van Hemel and EE van der Wall. 8 October 1958, D Day for the Implantable Pacemaker. Netherlands Heart Journal 16, 1 (2008), 1--2.","paperID":"None"},{"content":"Katia Vega, Marcio Cunha and Hugo Fuks. Year. Hairware: The Conscious Use of Unconscious Auto Contact Behaviors. In Proceedings of Proceedings of the 20th International Conference on Intelligent User Interfaces. ACM, 78--86.","paperID":"None"},{"content":"Katia Vega and Hugo Fuks. Year. Beauty Technology as an Interactive Computing Platform. In Proceedings of Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces. ACM, 357--360.","paperID":"None"},{"content":"Katia Vega and Hugo Fuks. Beauty Technology: Body Surface Computing. Computer, 4 (2014), 71--75.","paperID":"None"},{"content":"Kevin Warwick. Cyborg Morals, Cyborg Values, Cyborg Ethics. Ethics and information technology 5, 3 (2003), 131--137.","paperID":"None"},{"content":"Martin Weigel, Tong Lu, Gilles Bailly, Antti Oulasvirta, Carmel Majidi and Jürgen Steimle. Year. Iskin: Flexible, Stretchable and Visually Customizable on-Body Touch Sensors for Mobile Computing. In Proceedings of Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2991--3000.","paperID":"None"},{"content":"Malte Weiss, Chat Wacharamanotham, Simon Voelker and Jan Borchers. Year. Fingerflux: Near-Surface Haptic Feedback on Tabletops. In Proceedings of Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 615--620.","paperID":"None"},{"content":"Jeanne Whalen. In Attics and Closets,'Biohackers' Discover Their Inner Frankenstein. The Wall Street Journal (2009).","paperID":"None"},{"content":"Alexandra Witze. People: The Science Life: Contest Brings out the Biohackers. Science News 183, 1 (2013), 32--32.","paperID":"None"}],"abstract":"The human body has emerged as more than a canvas for wearable electronic devices. Devices too go within the body, such as internal medical devices. Within the last decade, individual hobbyists have begun voluntarily inserting non-medical devices in, through and underneath their skin. This paper investigates the current use of insertable devices. Through interviews we report on the types of devices people are inserting into their bodies. We classify the use of insertables and the reasons individuals choose insertables over more traditional wearable or luggable devices. These classifications facilitate understanding of insertables as a legitimate category of device for hardware designers that present new challenges for interaction designers.","title":"You Put What, Where?: Hobbyist Use of Insertable Devices","filename":"CHI16/p1798","authors":["Kayla J. Heffernan","Frank Vetere","Shanton Chang"],"conference":"CHI '16"}