{"paperId":2858225,"citation":[],"abstract":"User experience (UX) research has expanded our notion of what makes interactive technology good, often putting hedonic aspects of use such as fun, affect, and stimulation at the center. Outside of UX, the hedonic is often contrasted to the eudaimonic, the notion of striving towards one's personal best. It remains unclear, however, what this distinction offers to UX research conceptually and empirically. We investigate a possible role for eudaimonia in UX research by empirically examining 266 reports of positive experiences with technology and analyzing its relation to established UX concepts. Compared to hedonic experiences, eudaimonic experiences were about striving towards and accomplishing personal goals through technology use. They were also characterized by increased need fulfillment, positive affect, meaning, and long-term importance. Taken together, our findings suggest that while hedonic UX is about momentary pleasures directly derived from technology use, eudaimonic UX is about meaning from need fulfilment.","reference":[{"content":"Javier A Bargas-Avila and Kasper Hornbæk. 2011. Old wine in new bottles or novel challenges: a critical analysis of empirical studies of user experience. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2689-2698.","paperID":"None"},{"content":"Roy F Baumeister, Kathleen D Vohs, Jennifer L Aaker, and Emily N Garbinsky. 2013. Some key differences between a happy life and a meaningful life. The Journal of Positive Psychology 8, 6 (2013), 505-516.","paperID":"None"},{"content":"Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable interactions. In CHI '12. ACM, 2005-2014.","paperID":"None"},{"content":"Robert Biswas-Diener, Todd B Kashdan, and Laura A King. 2009. Two traditions of happiness research, not two distinct types of happiness. The Journal of Positive Psychology 4, 3 (2009), 208-211.","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77-101.","paperID":"None"},{"content":"Antonella Delle Fave, Ingrid Brdar, Teresa Freire, Dianne Vella-Brodrick, and Marié P Wissing. 2011. The eudaimonic and hedonic components of happiness: Qualitative and quantitative findings. Social Indicators Research 100, 2 (2011), 185-207.","paperID":"None"},{"content":"Pieter Desmet and Marc Hassenzahl. 2012. Towards happiness: Possibility-driven design. In Human-computer interaction: The agency perspective. Springer, 3-27.","paperID":"None"},{"content":"Pieter MA Desmet and Anna E Pohlmeyer. 2013. Positive design: An introduction to design for subjective well-being. International Journal of Design 7, 3 (2013), 5-9.","paperID":"None"},{"content":"Sebastian Deterding, Andrés Lucero, Jussi Holopainen, Chulhong Min, Adrian Cheok, Annika Waern, and Steffen Walz. 2015. Embarrassing Interactions. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2365-2368.","paperID":"None"},{"content":"Sarah Diefenbach, Nina Kolb, and Marc Hassenzahl. 2014. The 'hedonic' in human-computer interaction: history, contributions, and future research directions. In Proceedings of the 2014 conference on Designing interactive systems. ACM, 305-314.","paperID":"None"},{"content":"Barbara Grosse-Hering, Jon Mason, Dzmitry Aliakseyeu, Conny Bakker, and Pieter Desmet. 2013. Slow design for meaningful interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3431-3440.","paperID":"None"},{"content":"Marc Hassenzahl. 2004. The interplay of beauty, goodness, and usability in interactive products. Human-Computer Interaction 19, 4 (2004), 319-349.","paperID":"None"},{"content":"Marc Hassenzahl. 2005. The thing and I: understanding the relationship between user and product. In Funology. Springer, 31-42.","paperID":"None"},{"content":"Marc Hassenzahl, Sarah Diefenbach, and Anja Goritz. 2010. Needs, affect, and interactive products-Facets of user experience. Interacting with computers 22, 5 (2010), 353-362.","paperID":"None"},{"content":"Marc Hassenzahl, Kai Eckoldt, Sarah Diefenbach, Matthias Laschke, Eva Lenz, and Joonhwan Kim. 2013. Designing moments of meaning and pleasure. Experience design and happiness. International Journal of Design 7, 3 (2013), 21-31.","paperID":"None"},{"content":"Marc Hassenzahl and Daniel Ullrich. 2007. To do or not to do: Differences in user experience and retrospective judgments depending on the presence or absence of instrumental goals. Interacting with Computers 19, 4 (2007), 429-437.","paperID":"None"},{"content":"Marc Hassenzahl, Annika Wiklund-Engblom, Anette Bengs, Susanne Hagglund, and Sarah Diefenbach. 2015. Experience-oriented and product-oriented evaluation: psychological need fulfillment, positive affect, and product perception. International Journal of Human-Computer Interaction (2015).","paperID":"None"},{"content":"Veronika Huta and Richard M Ryan. 2010. Pursuing pleasure or virtue: The differential and overlapping well-being benefits of hedonic and eudaimonic motives. Journal of Happiness Studies 11, 6 (2010), 735-762.","paperID":"None"},{"content":"Veronika Huta and Alan S Waterman. 2014. Eudaimonia and its distinction from hedonia: Developing a classification and terminology for understanding conceptual and operational definitions. Journal of Happiness Studies 15, 6 (2014), 1425-1456.","paperID":"None"},{"content":"Julie R Irwin and Gary H McClelland. 2003. Negative consequences of dichotomizing continuous predictor variables. Journal of Marketing Research 40, 3 (2003), 366-371.","paperID":"None"},{"content":"Daniel Kahneman, Edward Diener, and Norbert Schwarz. 1999. Well-being: Foundations of hedonic psychology. Russell Sage Foundation.","paperID":"None"},{"content":"Irene Kamp and Pieter Desmet. 2014. Measuring product happiness. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 2509-2514.","paperID":"None"},{"content":"Evangelos Karapanos, John Zimmerman, Jodi Forlizzi, and Jean-Bernard Martens. 2009. User experience over time: an initial framework. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 729-738.","paperID":"None"},{"content":"Jinhyung Kim, Pyungwon Kang, and Incheol Choi. 2014. Pleasure now, meaning later: Temporal dynamics between pleasure and meaning. Journal of Experimental Social Psychology 55 (2014), 262-270.","paperID":"None"},{"content":"Laura A King, Joshua A Hicks, Jennifer L Krull, and Amber K Del Gaiso. 2006. Positive affect and the experience of meaning in life. Journal of personality and social psychology 90, 1 (2006), 179.","paperID":"None"},{"content":"Laura A King and Christie K Napa. 1998. What makes a life good? Journal of personality and social psychology 75, 1 (1998), 156.","paperID":"None"},{"content":"Livia J Müller, Elisa D Mekler, and Klaus Opwis. 2015. Facets In HCI: Towards Understanding Eudaimonic UX-Preliminary Findings. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2283-2288.","paperID":"None"},{"content":"Mary Beth Oliver and Arthur A Raney. 2011. Entertainment as pleasurable and meaningful: Identifying hedonic and eudaimonic motivations for entertainment consumption. Journal of Communication 61, 5 (2011), 984-1004.","paperID":"None"},{"content":"Timo Partala and Aleksi Kallinen. 2012. Understanding the most satisfying and unsatisfying user experiences: Emotions, psychological needs, and context. Interacting with computers 24, 1 (2012), 25-34.","paperID":"None"},{"content":"Timo Partala and Timo Saari. 2015. Understanding the most influential user experiences in successful and unsuccessful technology adoptions. Computers in Human Behavior 53 (2015), 381-395.","paperID":"None"},{"content":"Christopher Peterson, Nansook Park, and Martin EP Seligman. 2005. Orientations to happiness and life satisfaction: The full life versus the empty life. Journal of happiness studies 6, 1 (2005), 25-41.","paperID":"None"},{"content":"Richard M Ryan and Edward L Deci. 2001. On happiness and human potentials: A review of research on hedonic and eudaimonic well-being. Annual review of psychology 52, 1 (2001), 141-166.","paperID":"None"},{"content":"Richard M Ryan, Veronika Huta, and Edward L Deci. 2008. Living well: A self-determination theory perspective on eudaimonia. Journal of happiness studies 9, 1 (2008), 139-170.","paperID":"None"},{"content":"Kennon M Sheldon, Andrew J Elliot, Youngmee Kim, and Tim Kasser. 2001. What is satisfying about satisfying events? Testing 10 candidate psychological needs. Journal of personality and social psychology 80, 2 (2001), 325.","paperID":"None"},{"content":"Michael F Steger, Todd B Kashdan, and Shigehiro Oishi. 2008. Being good by doing good: Daily eudaimonic activity and well-being. Journal of Research in Personality 42, 1 (2008), 22-42.","paperID":"None"},{"content":"Alexandre N Tuch and Kasper Hornbæk. 2015. Does Herzberg's notion of hygienes and motivators apply to user experience? ACM Transactions on Computer-Human Interaction (TOCHI) 22, 4 (2015), 16.","paperID":"None"},{"content":"Alexandre N Tuch, Rune Trusell, and Kasper Hornbæk. 2013. Analyzing users' narratives to understand experience with interactive products. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2079-2088.","paperID":"None"},{"content":"Alan S Waterman, Seth J Schwartz, and Regina Conti. 2008. The implications of two conceptions of happiness (hedonic enjoyment and eudaimonia) for the understanding of intrinsic motivation. Journal of Happiness Studies 9, 1 (2008), 41-79.","paperID":"None"},{"content":"David Watson and Lee Anna Clark. 1999. The PANAS-X: Manual for the positive and negative affect schedule-expanded form. (1999).","paperID":"None"},{"content":"John Zimmerman. 2009. Designing for the self: making products that help people become the person they desire to be. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 395-404.","paperID":"None"}],"title":"Momentary Pleasure or Lasting Meaning?: Distinguishing Eudaimonic and Hedonic User Experiences","filename":"CHI16/p4509","authors":["Elisa D. Mekler","Kasper Hornbæk"],"conference":"CHI '16"}