{"paperId":2858151,"abstract":"Using personas in requirement analysis and software development is becoming more and more common. The potential and problems with this method of user representation are discussed controversially in HCI research. While personas might help focus on the audience, prioritize, challenge assumptions, and prevent self-referential design, the success of the method depends on how and on what basis the persona descriptions are developed, perceived, and employed. Personas run the risk of reinscribing existing stereotypes and following more of an I-methodological than a user-centered approach. This paper gives an overview of the academic discourse regarding benefits and downfalls of the persona method. A semi-structured interview study researched how usability experts perceive and navigate the controversies of this discourse. The qualitative analysis showed that conflicting paradigms are embedded in the legitimization practices of HCI in the political realities of computer science and corporate settings leading to contradictions and compromises.","citation":[],"reference":[{"content":"Doris Allhutter. 2012. Mind Scripting: A Method for Deconstructive Design. Science, Technology & Human Values 37, 6 (November 1, 2012): 684--707. http://dx.doi.org/10.1177/0162243911401633.","paperID":"None"},{"content":"Reem Alnanih, Olga Ormandjieva, and T. Radhakrishnan. 2013. Context-based User Stereotype Model for Mobile User Interfaces in Health Care Applications. Procedia Computer Science 19, 0: 1020--1027. http://dx.doi.org/10.1016/j.procs.2013. 06.142.","paperID":"None"},{"content":"Emily T. Amanatullah and Catherine H. Tinsley. 2013. Punishing female negotiators for asserting too much-or not enough: Exploring why advocacy moderates backlash against assertive female negotiators. Organizational Behavior and Human Decision Processes 120, 1: 110--122. http://dx.doi.org/10.1016/j.obhdp.201 2.03.006.","paperID":"None"},{"content":"Mahzarin R Banaji and Curtis D Hardin. 1996. Automatic stereotyping. Psychological Science 7, 3: 136141.","paperID":"None"},{"content":"Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: 1301--1310. http://dx.doi.org/10.1145/1753326.1753521.","paperID":"None"},{"content":"Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: 675--684. http://dx.doi.org/10.1145/1978942.1979041.","paperID":"None"},{"content":"Shaowen Bardzell and Elizabeth F. Churchill. 2011. IwC Special Issue \"Feminism and HCI: New Perspectives\" Special Issue Editors' Introduction. Interacting with Computers 23, 5 (September 1, 2011): iii-xi. http://dx.doi.org/10.1016/s0953--5438(11)00089-0.","paperID":"None"},{"content":"John A Bargh. 2013. Social psychology and the unconscious: The automaticity of higher mental processes. Psychology Press.","paperID":"None"},{"content":"Manuela Barreto and Naomi Ellemers. 2005. The burden of benevolent sexism: how it contributes to the maintenance of gender inequalities. European Journal of Social Psychology 35, 5: 633--642. http://dx.doi.org/10.1002/ejsp.270.","paperID":"None"},{"content":"Manuela Barreto and Naomi Ellemers. 2005. The Perils of Political Correctness: Men's and Women's Responses to Old-Fashioned and Modern Sexist Views. Social psychology quarterly 68, 1 (March 1, 2005): 75--88. http://dx.doi.org/10.1177/019027250506800106.","paperID":"None"},{"content":"Manuela Barreto and Naomi Ellemers. 2015. Detecting and Experiencing Prejudice: New Answers to Old Questions. In Advances in experimental social psychology, M. Olson James and P. Zanna Mark Eds. Academic Press, 139--219. http://dx.doi.org/10.1016/bs.aesp.2015.02.001.","paperID":"None"},{"content":"Corinna Bath. 2014. Diffractive Design. In GenderUseIT - HCI, Usability und UX unter Gendergesichtspunkten, Nicola Marsden and Ute Kempf Eds. De Gruyter Oldenbourg, München, 27--36.","paperID":"None"},{"content":"Corinna Bath. 2014. Searching for Methodology. Feminist Technology Design in Computer Science. In Gender in Science and Technology, Waltraud Ernst and Ilona Horwath Eds. transcript, Bielefeld, 57--78.","paperID":"None"},{"content":"Laura Beckwith, Margaret Burnett, Valentina Grigoreanu, and Susan Wiedenbeck. 2006. Gender HCI: What About the Software? Computer 39, 11: 97--101.","paperID":"None"},{"content":"Pedro F Bendassolli. 2013. Theory building in qualitative research: reconsidering the problem of induction. In Forum Qualitative Sozialforschung/Forum: Qualitative Social Research 14, 1: Art. 25.","paperID":"None"},{"content":"Petra Björndal, Mikko J. Rissanen, and Steve Murphy. 2011. Lessons Learned from Using Personas and Scenarios for Requirements Specification of Next Generation Industrial Robots. In Design, User Experience, and Usability, Aaron Marcus Ed. Springer Berlin Heidelberg, 378--387. http://dx.doi.org/10.1007/978--3--642--216756_44.","paperID":"None"},{"content":"Stefan Blomkvist. 2002. The User as a personality. In Using Personas as a tool for design. Position paper for the course workshop \"Theoretical perspectives in Human-Computer Interaction\" at IPLab, KTH.","paperID":"None"},{"content":"Åsa Blomquist and Mattias Arvola. 2002. Personas in action: ethnography in an interaction design team. In Proceedings of the second Nordic conference on Human-computer interaction ACM, 197--200.","paperID":"None"},{"content":"Mark A Blythe and Peter C Wright. 2006. Pastiche scenarios: Fiction as a resource for user centered design. Interacting with Computers 18, 5: 1139--1164.","paperID":"None"},{"content":"Susanne Bødker, Ellen Christiansen, Tom Nyvang, and Pär-Ola Zander. 2012. Personas, people and participation: challenges from the trenches of local government. Proceedings of the 12th Participatory Design Conference: Research Papers - Volume 1: 91--100.","paperID":"None"},{"content":"Susanne Bødker and Clemens Nylandsted Klokmose. 2012. Preparing students for (inter-) action with activity theory. International Journal of Design 6, 3: 99--111.","paperID":"None"},{"content":"Göde Both. 2014. Multidimensional Gendering Processes at the Human-Computer-Interface: The Case of Siri. In Gender-UseIT - HCI, Usability und UX unter Gendergesichtspunkten, Nicola Marsden and Ute Kempf Eds. De Gruyter Oldenbourg, München, 107--112.","paperID":"None"},{"content":"Geoffrey Bowker and Susan Leigh Star. 1999. Sorting things out Classification and its consequences. MIT Press, Campbridge, MA.","paperID":"None"},{"content":"Sandra Buchmüller, Gesche Joost, Nina Bessing, and Stephanie Stein. 2011. Bridging the gender and generation gap by ICT applying a participatory design process. Personal and Ubiquitous Computing 15, 7: 743--758. http://dx.doi.org/10.1007/s00779-011-0388-y.","paperID":"None"},{"content":"Ronald J Burke. 2014. Individual, organizational, and societal backlash against women. In Gender in Organizations: Are Men Allies or Adversaries to Women's Career Advancement?, Ronald J Burke and Debra A Major Eds. Edward Elgar Publishing, 335--363.","paperID":"None"},{"content":"Margaret Burnett. 2010. Gender HCI: what about the software? Proceedings of the 28th ACM International Conference on Design of Communication: 251--251. http://dx.doi.org/10.1145/1878450.1878493.","paperID":"None"},{"content":"Margaret Burnett, Laura Beckwith, Susan Wiedenbeck, Scott D. Fleming, Jill Cao, Thomas H. Park, Valentina Grigoreanu, and Kyle Rector. 2011. Gender pluralism in problem-solving software. Interacting with Computers 23, 5: 450--460. http://dx.doi.org/10.1016/j.intcom.2011.06.004.","paperID":"None"},{"content":"Margaret Burnett, Scott D Fleming, Shamsi Iqbal, Gina Venolia, Vidya Rajaram, Umer Farooq, Valentina Grigoreanu, and Mary Czerwinski. 2010. Gender differences and programming environments: across programming populations. Proceedings of the 2010 ACMIEEE International Symposium on Empirical Software Engineering and Measurement: 28--37.","paperID":"None"},{"content":"Margaret M Burnett and Brad A Myers. 2014. Future of end-user software engineering: beyond the silos. In Proceedings of the on Future of Software Engineering ACM, 201--211.","paperID":"None"},{"content":"Margaret Burnett, Anicia Peters, Charles Hill, and Noha Elarief. 2016. Finding Gender-Inclusiveness Software Issues with GenderMag: A Field Investigation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16) ACM, NY, NY, USA.","paperID":"None"},{"content":"Margaret Burnett, Simone Stumpf, James Macbeth, Laura Beckwith, Stephann Makri, Irwin Kwan, and Anicia Peters. 2015. The GenderMag Kit: How to Use the GenderMag Method to Find Usability Issues through a Gender Lens EUSES Consortium http://eusesconsortium.org/gender.","paperID":"None"},{"content":"Peter A Caprariello, Amy Cuddy, and Susan Fiske. 2009. Social structure shapes cultural stereotypes and emotions: A causal test of the stereotype content model. Group Processes & Intergroup Relations 12, 2: 147--155.","paperID":"None"},{"content":"Yen-Ning Chang, Youn-Kyung Lim, and Erik Stolterman. 2008. Personas: from theory to practices. In Proceedings of the 5th Nordic conference on Human-computer interaction: building bridges ACM, 439--442.","paperID":"None"},{"content":"Christopher N Chapman and Russell P Milham. 2006. The personas' new clothes: methodological and practical arguments against a popular method. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting SAGE Publications, 634--636.","paperID":"None"},{"content":"Sezgin Cihangir, Manuela Barreto, and Naomi Ellemers. 2010. The dark side of ambiguous discrimination: How state self esteem moderates emotional and behavioural responses to ambiguous and unambiguous discrimination. British Journal of Social Psychology 49, 1: 155--174.","paperID":"None"},{"content":"Alan Cooper. 1999. The inmates are running the asylum: Why high-tech products drive us crazy and how to restore the sanity. Sams, Indianapolis.","paperID":"None"},{"content":"Alan Cooper, Robert Reimann, and David Cronin. 2007. About face 3: the essentials of interaction design. John Wiley & Sons.","paperID":"None"},{"content":"Amy Cuddy, Susan Fiske, and Peter Glick. 2004. When professionals become mothers, warmth doesn't cut the ice. Journal of Social Issues 60, 4: 701--718.","paperID":"None"},{"content":"Amy Cuddy, Susan Fiske, and Peter Glick. 2007. The BIAS map: behaviors from intergroup affect and stereotypes. Journal of personality and social psychology 92, 4: 631--648.","paperID":"None"},{"content":"Amy Cuddy, Susan Fiske, and Peter Glick. 2008. Warmth and competence as universal dimensions of social perception: The stereotype content model and the BIAS map. Advances in experimental social psychology 40: 61--149.","paperID":"None"},{"content":"Amy Cuddy, Susan Fiske, Virginia Kwan, Peter Glick, Stephanie Demoulin, Jacques Philippe Leyens, Michael Harris Bond, Jean Claude Croizet, Naomi Ellemers, and Ed Sleebos. 2009. Stereotype content model across cultures: Towards universal similarities and some differences. British Journal of Social Psychology 48, 1: 1--33.","paperID":"None"},{"content":"Alexander M. Czopp and Margo J. Monteith. 2003. Confronting Prejudice (Literally): Reactions to Confrontations of Racial and Gender Bias. Personality and Social Psychology Bulletin 29, 4: 532--544. http://dx.doi.org/10.1177/0146167202250923.","paperID":"None"},{"content":"Nick De Voil. 2010. Personas considered harmful Retrieved December 31, 2015 from http://www.devoil.com/papers/PersonasConsideredHarmful.pdf.","paperID":"None"},{"content":"Anke Dittmar and Maximilian Hensch. 2015. Two Level Personas for Nested Design Spaces. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems: 3265--3274.","paperID":"None"},{"content":"John Partomo Djajadiningrat, William W Gaver, and Jw Fres. 2000. Interaction relabelling and extreme characters: methods for exploring aesthetic interactions. In Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques ACM, 66--71.","paperID":"None"},{"content":"Claude Draude. 2006. Degendering the Species? Gender Studies Encounter Virtual Humans. In Proceedings AVI 2006, A. D. Angeli and N. Bianchi-Berthouze Eds., Venice.","paperID":"None"},{"content":"Claude Draude, Susanne Maaß, and Kamila Wajda. 2014. GERD: ein Vorgehensmodell zur Integration von Gender/Diversity in die Informatik. In Vielfalt der Informatik, Anja Zeising, Claude Draude, Heidi Schelhowe and Susanne Maaß Eds. Staats-und Universitätsbibliothek Bremen, Open-Access. http://suche.suub.unibremen.de/peid=B81685519&LAN=DE&CID=&index=L&Hitnr=9, Bremen, 197--283.","paperID":"None"},{"content":"Thorsten Dresing, Thorsten Pehl, and Christian Schmieder. 2012. Manual (on) transcription: Transcription conventions, software guides and practical hints for qualitative researchers. 2nd English Edition. Marburg.","paperID":"None"},{"content":"Thomas Eckes. 2002. Paternalistic and envious gender stereotypes: Testing predictions from the stereotype content model. Sex Roles 47, 3--4: 99--114.","paperID":"None"},{"content":"Thomas Eckes. 2008. Geschlechterstereotype: Von Rollen, Identitäten und Vorurteilen. In Handbuch Frauen- und Geschlechterforschung, Ruth Becker and Beate Kortendiek Eds. VS Verlag für Sozialwissenschaften, 171--182. http://dx.doi.org/10.1007/978--3531--91972-0_20.","paperID":"None"},{"content":"Shamal Faily and Ivan Flechais. 2011. Persona cases: a technique for grounding personas. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: 2267--2270.","paperID":"None"},{"content":"Susan Fiske, Amy Cuddy, and Peter Glick. 2007. Universal dimensions of social cognition: Warmth and competence. Trends in cognitive sciences 11, 2: 77--83.","paperID":"None"},{"content":"Susan Fiske, Amy Cuddy, Peter Glick, and Jun Xu. 2002. A model of (often mixed) stereotype content: competence and warmth respectively follow from perceived status and competition. Journal of personality and social psychology 82, 6: 878--902.","paperID":"None"},{"content":"Susan T Fiske. 2000. Stereotyping, prejudice, and discrimination at the seam between the centuries: Evolution, culture, mind, and brain. European Journal of Social Psychology 30, 3: 299--322.","paperID":"None"},{"content":"Ingbert R Floyd, M Cameron Jones, and Michael B Twidale. 2008. Resolving incommensurable debates: a preliminary identification of persona kinds, attributes, and characteristics. Artifact 2, 1: 12--26.","paperID":"None"},{"content":"Michael J. Gill. 2004. When information does not deter stereotyping: Prescriptive stereotyping can foster bias under conditions that deter descriptive stereotyping. Journal of experimental social psychology 40, 5 (9): 619--632. http://dx.doi.org/10.1016/j.jesp.2003.12.001.","paperID":"None"},{"content":"Anthony G Greenwald, Debbie E Mcghee, and Jordan Lk Schwartz. 1998. Measuring individual differences in implicit cognition: the implicit association test. Journal of personality and social psychology 74, 6: 1464--1480.","paperID":"None"},{"content":"Anthony G Greenwald, T Andrew Poehlman, Eric Luis Uhlmann, and Mahzarin R Banaji. 2009. Understanding and using the Implicit Association Test: III. Metaanalysis of predictive validity. Journal of personality and social psychology 97, 1: 17--41.","paperID":"None"},{"content":"Jonathan Grudin. 2006. Why personas work: The psychological evidence. In The Persona Lifecycle, Keeping People in Mind Throughout Product Design, John Pruitt and Tamara Adlin Eds. Elsevier, Amsterdam, 642-663.","paperID":"None"},{"content":"Jonathan Grudin and John Pruitt. 2002. Personas, participatory design and product development: An infrastructure for engagement. In PDC, 144--152.","paperID":"None"},{"content":"Cornelia Helfferich. 2011. Die Qualität qualitativer Daten. VS Verlag für Sozialwissenschaften.","paperID":"None"},{"content":"Cornelia Helfferich. 2014. Leitfaden- und Experteninterviews. In Handbuch Methoden der empirischen Sozialforschung, Nina Baur and Jörg Blasius Eds. Springer Fachmedien Wiesbaden, 559--574. http://dx.doi.org/10.1007/978-3-531-18939-0_39.","paperID":"None"},{"content":"Anders Hjalmarsson, Eva Gustafsson, and Stefan Cronholm. 2015. Exploring the Use of Personas in User-Centered Design of Web-based e-services. iConference 2015 Proceedings.","paperID":"None"},{"content":"Karen Holtzblatt and Hugh Beyer. 2015. Contextual Design Evolved. Morgan & Claypool Publishers.","paperID":"None"},{"content":"Iso. 2010. Ergonomics of human-system interaction Part 210: Human-centred design for interactive systems (ISO 9241--210:2010); German version EN ISO 9241--210:2010, Din Normenausschuss Ergonomie (Naerg) and Ergonomics Standards Committee Eds. International Organization for Standardisation, Geneva.","paperID":"None"},{"content":"Mary R Jackman. 1994. The velvet glove: Paternalism and conflict in gender, class, and race relations. Univ of California Press.","paperID":"None"},{"content":"M Cameron Jones, Ingbert R Floyd, and Michael B Twidale. 2008. Teaching design with personas. Proceedings HCIEd, Rome 2008. Magazine of Interaction Design & Architecture(s) 2/3, 3/4: 75--82.","paperID":"None"},{"content":"John T Jost and Brenda Major. 2001. The psychology of legitimacy: Emerging perspectives on ideology, justice, and intergroup relations. Cambridge University Press.","paperID":"None"},{"content":"Daniel Kahneman. 2011. Thinking, fast and slow. Macmillan.","paperID":"None"},{"content":"Eva Källhammer and Åsa Wikberg Nilsson. 2012. Gendered Innovative Design Critical Reflections stimulated by Personas. In Promoting Innovation - Policies, practices and procedures, Susanne Andersson, Karin Berglund, Ewa Gunnarsson and Elisabeth Sundin Eds. VINNOVA, Sweden, 328--350.","paperID":"None"},{"content":"Stephene Kilianski and Lauriea Rudman. 1998. Wanting It Both Ways: Do Women Approve of Benevolent Sexism? Sex Roles 39, 5--6 (1998/09/01): 333--352. http://dx.doi.org/10.1023/A:1018814924402.","paperID":"None"},{"content":"Mary E Kite, Kay Deaux, and Elizabeth L Haines. 2008. Gender stereotypes. Psychology of women: A handbook of issues and theories 2: 205--236.","paperID":"None"},{"content":"Sarah-Jane Leslie, Andrei Cimpian, Meredith Meyer, and Edward Freeland. 2015. Expectations of brilliance underlie gender distributions across academic disciplines. Science 347, 6219: 262--265.","paperID":"None"},{"content":"Ann Light. 2011. HCI as heterodoxy: Technologies of identity and the queering of interaction with computers. Interacting with Computers 23, 5 (September 1, 2011): 430--438. http://dx.doi.org/10.1016/j.intcom.2011.02.002.","paperID":"None"},{"content":"Jasmin Link, Elisabeth Büllesfeld, and Nicola Marsden. 2015. Genderbewusste Erstellung von Persona-Sets. In Gender- und Diversity-Management in der Forschung, Michaela Klemisch, Anne Spitzley and Jürgen Wilke Eds. Fraunhofer-Institut für Arbeitswirtschaft und Organisation IAO, Stuttgart, 152165.","paperID":"None"},{"content":"Frank Long. 2009. Real or imaginary: The effectiveness of using personas in product design. In IES Conference, Dublin, 1--10.","paperID":"None"},{"content":"Eva Louvet. 2007. Social judgment toward job applicants with disabilities: Perception of personal qualities and competences. Rehabilitation Psychology 52, 3: 297.","paperID":"None"},{"content":"Petra Lucht. 2014. Usability und Intersektionalitätsforschung - Produktive Dialoge. In Gender-UseIT HCI, Usability und UX unter Gendergesichtspunkten, Nicola Marsden and Ute Kempf Eds. De Gruyter Oldenbourg, München, 37--52.","paperID":"None"},{"content":"Nicola Marsden and Ute Kempf. 2014. Gender-UseIT HCI, Usability und UX unter Gendergesichtspunkten. De Gruyter Oldenbourg, München.","paperID":"None"},{"content":"Nicola Marsden, Jasmin Link, and Elisabeth Büllesfeld. 2014. Personas und stereotype Geschlechterrollen. In Gender-UseIT - HCI, Usability und UX unter Gendergesichtspunkten, Nicola Marsden and Ute Kempf Eds. De Gruyter Oldenbourg, München, 91--104.","paperID":"None"},{"content":"Nicola Marsden, Jasmin Link, and Elisabeth B. L lesfeld. 2015. Geschlechterstereotype in PersonaBeschreibungen. In Mensch und Computer 2015 Tagungsband, Sarah Diefenbach, Niels Henze and Martin Pielot Eds. Oldenbourg Wissenschaftsverlag, Stuttgart, 113--122.","paperID":"None"},{"content":"Adrienne L Massanari. 2010. Designing for imaginary friends: information architecture, personas and the politics of user-centered design. New media & society 12, 3: 401--416.","paperID":"None"},{"content":"Tara Matthews, Tejinder Judge, and Steve Whittaker. 2012. How do designers and user experience professionals actually perceive and use personas? Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: 1219--1228.","paperID":"None"},{"content":"Philipp Mayring. 2010. Qualitative Inhaltsanalyse. Grundlagen und Techniken Beltz Verlag, Weinheim, Basel.","paperID":"None"},{"content":"David Mellor, Gai Bynon, Jerome Maller, Felicity Cleary, Alex Hamilton, and Lara Watson. 2001. The perception of racism in ambiguous scenarios. Journal of ethnic and migration studies 27, 3: 473--488.","paperID":"None"},{"content":"Tomasz Miaskiewicz and Kenneth A Kozar. 2011. Personas and user-centered design: How can personas benefit product design processes? Design Studies 32, 5: 417--430.","paperID":"None"},{"content":"Corinne A Moss-Racusin. 2014. Male backlash: Organizational penalties for men who violate gender stereotypes. In Gender in Organizations: Are Men Allies or Adversaries to Women's Career Advancement?, Ronald J Burke and Debra A Major Eds. Edward Elgar Publishing, 247--269.","paperID":"None"},{"content":"Miguel Moya, Peter Glick, Francisca Expósito, Soledad De Lemus, and Joshua Hart. 2007. It's for Your Own Good: Benevolent Sexism and Women's Reactions to Protectively Justified Restrictions. Personality and Social Psychology Bulletin 33, 10: 1421--1434. http://dx.doi.org/10.1177/0146167207304790.","paperID":"None"},{"content":"Lene Nielsen. 2004. Engaging personas and narrative scenarios. Samfundslitteratur, Copenhagen.","paperID":"None"},{"content":"Lene Nielsen. 2013. Personas - User Focused Design. Springer.","paperID":"None"},{"content":"Lene Nielsen and Kira Storgaard Hansen. 2014. Personas is applicable: a study on the use of personas in Denmark. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: 1665--1674. http://dx.doi.org/10.1145/2556288.2557080.","paperID":"None"},{"content":"Lene Nielsen, Kira Storgaard Nielsen, Jan Stage, and Jane Billestrup. 2013. Going global with personas. In Human-Computer Interaction-INTERACT 2013 Springer, 350--357.","paperID":"None"},{"content":"Don Norman. 2004. Ad-Hoc Personas & Empathetic Focus. Retrieved December 31, 2015 from http://www.jnd.org/dn.mss/personas_empath.html","paperID":"None"},{"content":"Michael S North and Susan T Fiske. 2013. Act Your (Old) Age Prescriptive, Ageist Biases Over Succession, Consumption, and Identity. Personality and Social Psychology Bulletin 39, 6: 720--734.","paperID":"None"},{"content":"Ciarán O'leary, Fred Mtenzi, and Claire Mcavinia. 2015. Practice-based personas: integrated user and practice models. In At the Vanguard of Design Science Research-in-Progress Papers and Poster Presentations from the 10th International Conference, DESRIST 2015. Dublin, Ireland, 20--22 May. DESRIST 2015.","paperID":"None"},{"content":"Nelly Oudshoorn, Els Rommes, and Marcelle Stienstra. 2004. Configuring the User as Everybody: Gender and Design Cultures in Information and Communication Technologies. Science, Technology & Human Values 29, 1: 30--63. http://dx.doi.org/10.1177/0162243903259190.","paperID":"None"},{"content":"Tanja Paulitz and Bianca Prietl. 2014. Geschlechterund intersektionalitätskritische Perspektiven auf Konzepte der Softwaregestaltung. In Gender-UseIT HCI, Usability und UX unter Gendergesichtspunkten, Nicola Marsden and Ute Kempf Eds. De Gruyter Oldenbourg, München, 79--89.","paperID":"None"},{"content":"Steve Portigal. 2008. Persona non grata. interactions 15, 1: 72--73.","paperID":"None"},{"content":"John Pruitt and Tamara Adlin. 2006. The persona lifecycle: Keeping people in mind throughout the design process Morgan Kaufmann Publishers, San Francisco.","paperID":"None"},{"content":"John Pruitt and Jonathan Grudin. 2003. Personas: practice and theory. In Proceedings of the 2003 conference on Designing for user experiences ACM, 1--15.","paperID":"None"},{"content":"Frank E. Ritter, Gordon D. Baxter, and Elizabeth F. Churchill. 2014. Foundations for Designing UserCentered Systems. Springer London.","paperID":"None"},{"content":"Jennifer A. Rode. 2011. A theoretical agenda for feminist HCI. Interacting with Computers 23, 5 (September 1, 2011): 393--400. http://dx.doi.org/10.1016/j.intcom.2011.04.005.","paperID":"None"},{"content":"Yvonne Rogers. 2004. New theoretical approaches for HCI. Annual review of information science and technology 38, 1: 87--143.","paperID":"None"},{"content":"Els Rommes. 2014. Feminist Interventions in the Design Process. In Gender in Science and Technology, Waltraud Ernst and Ilona Horwath Eds. transcript Verlag, Bielefeld, 41--55.","paperID":"None"},{"content":"Kari Rönkkö. 2005. An empirical study demonstrating how different design constraints, project organization, and contexts limited the utility of personas. In Proceedings of the Hawaii International Conference on System Sciences 2005 (Waikoloa, HI2005).","paperID":"None"},{"content":"Kari Rönkkö, Mats Hellman, Britta Kilander, and Yvonne Dittrich. 2004. Personas is not applicable: local remedies interpreted in a wider context. Proceedings of the eighth conference on Participatory design: Artful integration: interweaving media, materials and practices - Volume 1: 112--120.","paperID":"None"},{"content":"Laurie A Rudman and Peter Glick. 2001. Prescriptive Gender Stereotypes and Backlash Toward Agentic Women. Journal of Social Issues 57, 4: 743--762. http://dx.doi.org/10.1111/0022--4537.00239.","paperID":"None"},{"content":"Laurie A Rudman and Peter Glick. 2008. Social psychology of gender: How power and intimacy shape gender relations. Guilford Press, NY.","paperID":"None"},{"content":"Laurie A Rudman and Kris Mescher. 2013. Penalizing Men Who Request a Family Leave: Is Flexibility Stigma a Femininity Stigma? Journal of Social Issues 69, 2: 322--340. http://dx.doi.org/10.1111/josi.12017.","paperID":"None"},{"content":"Ann Marie T Russell and Susan T Fiske. 2008. It's all relative: Competition and status drive interpersonal perception. European Journal of Social Psychology 38, 7: 1193--1201.","paperID":"None"},{"content":"Ruth Simpson. 2014. Relations, emotions and differences: re-gendering emotional labour in the context of men doing care. In Gender in Organizations: Are Men Allies or Adversaries to Women's Career Advancement?, Ronald J Burke and Debra A Major Eds. Edward Elgar Publishing, 118--132.","paperID":"None"},{"content":"Janet K Swim and Bernadette Campbell. 2003. Sexism: Attitudes, beliefs, and behaviors. Blackwell handbook of social psychology: Intergroup processes: 218--237.","paperID":"None"},{"content":"Phil Turner and Susan Turner. 2011. Is stereotyping inevitable when designing with personas? Design Studies 32, 1: 30--44. http://dx.doi.org/10.1016/j.destud.201 0.06.002.","paperID":"None"},{"content":"Jean M Twenge. 1997. Changes in masculine and feminine traits over time: A meta-analysis. Sex Roles 36, 56: 305--325.","paperID":"None"},{"content":"Jean M Twenge. 2009. Status and gender: The paradox of progress in an age of narcissism. Sex Roles 61, 5--6: 338--340.","paperID":"None"},{"content":"Félice Van Nunspeet, Naomi Ellemers, Belle Derks, and Sander Nieuwenhuis. 2014. Moral concerns increase attention and response monitoring during IAT performance: ERP evidence. Social cognitive and affective neuroscience 9, 2: 141--149.","paperID":"None"},{"content":"Judy Wajcman. 2010. Feminist theories of technology. Cambridge journal of economics 34, 1: 143--152.","paperID":"None"},{"content":"Åsa Wikberg Nilsson, Ylva Fältholm, and Lena Abrahamsson. 2010. Reframing practice through the use of personas. Reflective Practice 11, 3: 285--298.","paperID":"None"}],"title":"Stereotypes and Politics: Reflections on Personas","filename":"CHI16/p4017","authors":["Nicola Marsden","Maren Haag"],"conference":"CHI '16"}