{"paperId":2858420,"citation":[],"abstract":"This paper asks what can we learn from breaking down systems to understand the development of systems. Through ethnographic fieldwork around a large-scale infrastructure development project in the ocean sciences experiencing a scale downward and threat of further defunding, I highlight four often overlooked components of innovation and development that have important implications for the HCI community. The first debunks the mythical liquidation and restart of Western development's \"fail fast, fail often\" mantra by tracing the complexities of breaking down an infrastructure, highlighting that the end of a technology is entrenched in longer-lived social, political and organizational consequences. The second dives deeper into these social consequences, as formalized structures are broken down and new temporary and contingent working orders surface to fill their place. Third, I signal the critical consequences of the thoughtful practices of assessment and evaluation of both human and material resources that occur during the downturn of systems. Last, I discuss the deeply personal connections that amplify through processes of breaking down systems.","reference":[{"content":"Adams, V., Murphy, M. Clarke, A. 2009. Anticipation: Technoscience, Life, Affect, Temporality. Subjectivity, 28, 246--265.","paperID":"None"},{"content":"Anderson, R., Kolko, B., Schlenke, L., Brunette, W., Hope, A., Nathan, R., Gerard, W., Keh, J. Kawooya, M. 2012. The midwife's assistant: designing integrated learning tools to scaffold ultrasound practice. In Proc. of ICTD '12, 200--210.","paperID":"None"},{"content":"Borgman, C.L. 2011. The conundrum of sharing research data. Journal of the American Society for Information Science and Technology, 1--40.","paperID":"None"},{"content":"Bennett, J. 2010. Vibrant Matter: A Political Ecology of Things. Durham, NC: Duke University Press.","paperID":"None"},{"content":"Blevis, E. 2007. Sustainable Interaction Design: Invention & Disposal, Renewal & Reuse. In Proc. CHI '07, 503--512.","paperID":"None"},{"content":"Bowker, G. and Star, S.L. 1999. Sorting Things Out. Cambridge: MIT Press.","paperID":"None"},{"content":"Boym, S. 2010. Ruins of the avant-garde: From Tatlin's tower to paper architecture. Hell, J. and Schonle, A. (eds.) Ruins of Modernity. Durham, NC: Duke University Press, 58--88.","paperID":"None"},{"content":"Bhushan, B. 2015. Perspective: Science and technology policy -- What is at stake and why should scientists participate? Science and Public Policy, 42(6), 887--900.","paperID":"None"},{"content":"Cairns, S. and Jacobs, J. 2014. Buildings Must Die. Boston: MIT Press.","paperID":"None"},{"content":"Carroll, R. 2014. Silicon Valley's Culture of Failure and the Walking Dead it Leaves Behind. The Guardian. Retrieved January 8, 2015 from http://www.theguardian.com/technology/2014/jun/28/sil icon-valley-startup-failure-culture-success-myth","paperID":"None"},{"content":"Cohn, M. 2013. Lifetimes and Legacies: Temporalities of Sociotechnical Change in a Long-Lived System. UCI, dissertation.","paperID":"None"},{"content":"Cohn, M., \"Convivial Decay: Entangled Lifetimes in a Geriatric Infastructure\". In Proc. of CSCW '16, forthcoming.","paperID":"None"},{"content":"Corbin, J.M. and Strauss, A. 2007. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Thousand Oaks, CA: Sage Publications.","paperID":"None"},{"content":"Densmore, M.R. 2010. Claim Mobile: When to Fail a Technology. In Proc. of CHI' 2012, 1833--1842.","paperID":"None"},{"content":"DeSilvey, C. and Edensor, T. 2012. Reckoning with Ruins. Progress in Human Geography, 1--21.","paperID":"None"},{"content":"DeSilvey, C. 2006. Observed Decay: Telling Stories with Mutable Things. Journal of Material Culture, 11(3), 318--338.","paperID":"None"},{"content":"Doughton, S. 2015. Did she blow? NW Submarine volcano likely just erupted. The Seattle Times.","paperID":"None"},{"content":"Edwards, P. 2003. Infrastructure and Modernity: Force, time, and social organization in the History of Sociotechnical Systems. Modernity and technology, 185--225.","paperID":"None"},{"content":"Edwards, P. N., Mayernik, M. S., Batcheller, A. L., Bowker, G. C., & Borgman, C. L. 2011. Science friction: Data, Metadata and collaboration. Social Studies of Science, 41(5), 667--690.","paperID":"None"},{"content":"Gallagher, S. 2013. Why US Government fails so hard, so often, Ars Technica. Retrieved January 8, 2015 from http://arstechnica.com/informationtechnology/2013/10/why-us-government-it-fails-sohard-so-often/","paperID":"None"},{"content":"Glaser, B. and Strauss, A. 1967. The Discovery of Grounded Theory: Strategies for Qualitative Research. Aldine Transaction, Chicago.","paperID":"None"},{"content":"Graham, S. and Thrift, N. 2007. Out of Order: Understanding Repair and Maintenance. Theory, Culture & Society, 24(3), 1--25.","paperID":"None"},{"content":"Heeks R. 2008. ICT4D 2.0: The Next Phase of Applying ICT for International Development. Computer, IEEE Computer Society.","paperID":"None"},{"content":"Howison, J. and Herbsleb, J.D. 2011. Scientific software production: incentives and collaboration. In Proc. of CSCW '11, 513--522.","paperID":"None"},{"content":"Jackson, S.J., Barbrow, S. 2013. Infrastructure and vocation: field, calling and computation in ecology. In Proc. of CHI '13, 2873--2882.","paperID":"None"},{"content":"Jackson, S.J. and Barbrow, S. 2015. Standards and/as Innovation: Protocols, Creativity and Interactive Systems Development in Ecology. In Proc. of CHI '15, 1769--1778.","paperID":"None"},{"content":"Jackson, S.J., and Buyuktur, A. 2014. Who Killed WATERS? Mess, Method, and Forensic Explanation in the Making and Unmaking of Large-Scale Science Networks. Science Technology and Human Values, 39(2), 285--308.","paperID":"None"},{"content":"Jackson, S.J. 2014. Rethinking Repair, in Media Technologies: Essays on Communication, Materiality and Society. Gillespie, T., Boczkowski, P. Foot, K. (eds.), Cambridge: MIT Press, 2014.","paperID":"None"},{"content":"Karasti, H., Baker, K.S., Millerand, F. 2010. Infrastructure Time: Long-term Matters in Collaborative Development. Computer Supported Cooperative Work, 19(3--4), 377--415.","paperID":"None"},{"content":"Kiger, P.J. 2015. Undersea Volcano Erupts a Mile Below the Surface. Discovery. Retrieved January 8, 2015 from http://news.discovery.com/earth/oceans/underseavolcano-erupts-a-mile-below-the-surface-150604.htm","paperID":"None"},{"content":"Lee, C. P., Dourish, P., Mark, G. 2006. The human infrastructure of cyberinfrastructure. In Proc. of CSCW '06, 483--492.","paperID":"None"},{"content":"Linde, C. 1993. Life Stories: The Creation of Coherence. Oxford: Oxford University Press.","paperID":"None"},{"content":"Messeri, L. and Vertesi, J. 2015. Greatest Missions Never Flown: Anticipatory Discourse and the \"Projectory\" in Technological Communities. Technology & Culture, 56(1), 54--85.","paperID":"None"},{"content":"Odom, W. Pierce, J. Stolterman, E., Blevis, E. Understanding why we preserve some things and discard others in the context of interaction design. In Proc. of CHI '09, 1053--1062.","paperID":"None"},{"content":"Perrow, C. 1984. Normal accidents: Living with High Risk Technologies. Princeton: Princeton University Press.","paperID":"None"},{"content":"Ribes, D. and Finholt, T.A. 2009. The Long Now of Technology Infrastructure: Articulating Tensions in Development. Journal of the Association for Information Systems, 10(5), 375--398.","paperID":"None"},{"content":"Ribes, D. 2014. Ethnography of scaling, or, how to fit a national research infrastructure in the room. In Proc. of CSCW '14, 158--170.","paperID":"None"},{"content":"Rosner, D. K. 2012. The material practices of collaboration. In Proc. of CSCW '12, 1155--1164.","paperID":"None"},{"content":"Sims, B. and Henke, C.R. 2012. Repairing Credibility: Repositioning Nuclear Weapons knowledge after the Cold War. Social Studies of Science, 0(0), 1--24.","paperID":"None"},{"content":"Star, S.L. and Ruhleder, K. 1996. Steps Toward an Ecology of Infrastructure: Design and Access for Large Information Spaces. Information Systems Research, 7(1), 111--134.","paperID":"None"},{"content":"Steinhardt, S.B. Jackson, S.J. 2015. Anticipation Work: Plans and temporal alignment in collaborative scientific work. In Proc. of CSCW '14, 134--145.","paperID":"None"},{"content":"Tomlinson, T., Silberman, M., Patterson, D., Pan, Y, Blevis, E. 2012. Collapse informatics: augmenting the sustainability & ICT4D discourse in HCI. In Proc. of CHI '12, 655--664.","paperID":"None"},{"content":"Ureta, S. 2014. Normalizing Transantiago: On the challenges (and limits) of repairing infrastructures. Social Studies of Science, 44(3), 368--392.","paperID":"None"},{"content":"Vaughn, D. 1996. The Challenger Launch Decision: Risky Technology, Culture and Deviance at NASA. Chicago: University of Chicago Press.","paperID":"None"},{"content":"Vertesi, J. and Dourish, P. 2011. The Value of Data: Considering the Context of Production in Data Economies. In Proc. of CSCW '11, 533--542.","paperID":"None"},{"content":"Warschauer, M. and Ames, M. 2010. Can One Laptop Per Child Save the World's Poor? Journal of International Affairs, 64(1), 33--51.","paperID":"None"},{"content":"Wilcock, W. 2015. The Shambolic State of the Ocean Observatories Initiative: Time to Speak Up. Retrieved September 25, 2015 from http://faculty.washington.edu/wilcock/?p=240","paperID":"None"},{"content":"Witze, A. 2013. Marine science: Oceanography's billion-dollar baby, Nature, 501, 480--482.","paperID":"None"},{"content":"Witze, A. 2014. Ocean observatory project hits rough water, Nature, 515, 474--475.","paperID":"None"}],"title":"Breaking Down While Building Up: Design and Decline in Emerging Infrastructures","filename":"CHI16/p2198","authors":["Stephanie B. Steinhardt"],"conference":"CHI '16"}