{"paperId":2858080,"citation":[],"reference":[{"content":"Naomi Alderman. 2012. Zombies, Run!","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2008. Using thematic analysis in psychology. Qualitative Research in Psychology. Retrieved September 1, 2015 from http://www.tandfonline.com/doi/abs/10.1191/1478088706qp063oa#.VeYvgPlVhBc","paperID":"None"},{"content":"Andrew Burn. 2013. Computer games on the playground?: Ludic systems, dramatized narrative and virtual embodiment. In Children, Media And Playground Cultures. Palgrave Macmillan.","paperID":"None"},{"content":"Jared E. Cechanowicz, Carl Gutwin, Scott Bateman, Regan Mandryk, and Ian Stavness. 2014. Improving player balancing in racing games. Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play CHI PLAY '14, ACM Press, 47--56. http://doi.org/10.1145/2658537.2658701","paperID":"None"},{"content":"Woohyeok Choi, Jeungmin Oh, Taiwoo Park, et al. 2014. MobyDick. Proceedings of the 12th ACM Conference on Embedded Network Sensor Systems SenSys '14, ACM Press, 76--90. http://doi.org/10.1145/2668332.2668352","paperID":"None"},{"content":"Alexandru Dancu, Zlatko Franjcic, and Morten Fjeld. 2014. Smart flashlight. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, ACM Press, 3627--3630. http://doi.org/10.1145/2556288.2557289","paperID":"None"},{"content":"Larry de Garis. 2010. Sometimes a bloody nose is just a bloody nose: play and contest in boxing, wrestling, and ethnography. Sport in Society 13, 6, 935--951. http://doi.org/10.1080/17430437.2010.491264","paperID":"None"},{"content":"P David Howe. 2001. Women's Rugby and the Nexus Between Embodiment , Professionalism and Sexuality: An Ethnographic Account. Football Studies 4, 2, 77--92.","paperID":"None"},{"content":"K Isbister and FF Mueller. 2014. Guidelines for the Design of Movement-Based Games and Their Relevance to HCI. Human-Computer Interaction. Retrieved January 21, 2015 from http://www.tandfonline.com/doi/abs/10.1080/07370024 .2014.996647","paperID":"None"},{"content":"Ivo Jirásek and Emanuel Hurych. 2012. Pain and Suffering in Sport. Human Movement 13, 2, 185--189. Retrieved August 27, 2013 from http://www.degruyter.com/view/j/humo.2012.13.issue2/v10038-012-0021--6/v10038-012-0021--6.xml","paperID":"None"},{"content":"F Charles Mace and Joseph S Lalli. 1992. Behavioral momentum in college basketball. Journal of applied behavior analysis 25, 3, 657--63. Retrieved September 4, 2015 from http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid=1279747&tool=pmcentrez&rendertype=abstract","paperID":"None"},{"content":"Elena Márquez Segura, Annika Waern, Jin Moen, and Carolina Johansson. 2013. The design space of body games. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13, ACM Press, 3365. http://doi.org/10.1145/2470654.2466461","paperID":"None"},{"content":"Joe Marshall, Frank Loesche, Conor Linehan, Daniel Johnson, and Bruno Martelli. 2015. Grand Push Auto: A Car-based exertion game. Ext. Abstracts CHI Play.","paperID":"None"},{"content":"Joe Marshall and Paul Tennent. 2013. Mobile interaction does not exist. CHI '13 Extended Abstracts on Human Factors in Computing Systems on CHI EA '13, ACM Press, 2069. http://doi.org/10.1145/2468356.2468725","paperID":"None"},{"content":"Greta Mitchell and Andy Clarke. 2011. Game catcher: playing, recording and archiving playground games. In Museums at play: games, interaction and learning. Museums Etc., 426--439.","paperID":"None"},{"content":"Florian 'Floyd' Mueller, Stefan Agamanolis, Frank Vetere, and Martin Gibbs. 2009. Brute force interactions. Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group on Design: Open 24/7 - OZCHI '09, ACM Press, 57. http://doi.org/10.1145/1738826.1738836","paperID":"None"},{"content":"Florian \"Floyd\" Mueller, Martin Gibbs, Frank Vetere, Stefan Agamanolis, and Darren Edge. 2014. Designing mediated combat play. Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction - TEI '14, ACM Press, 149--156. http://doi.org/10.1145/2540930.2540937","paperID":"None"},{"content":"Florian Mueller, Shannon O'Brien, and Alex Thorogood. 2007. Jogging over a distance. CHI '07 extended abstracts on Human factors in computing systems CHI '07, ACM Press, 1989. http://doi.org/10.1145/1240866.1240937","paperID":"None"},{"content":"Florian Mueller, Cagdas Toprak, Eberhard Graether, Wouter Walmink, Bert Bongers, and Elise van den Hoven. 2012. Hanging off a bar. Proceedings of the 2012 ACM annual conference extended abstracts on Human Factors in Computing Systems Extended Abstracts CHI EA '12, ACM Press, 1055. http://doi.org/10.1145/2212776.2212384","paperID":"None"},{"content":"Florian Mueller, Frank Vetere, Martin Gibbs, et al. 2012. Balancing exertion experiences. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, ACM Press, 1853. http://doi.org/10.1145/2207676.2208322","paperID":"None"},{"content":"John Paul. 2015. Sport and Bodily Empowerment: Female Athletes' Experiences with Roller Derby, Mixed Martial Arts, and Rugby. Journal of Alternative Perspectives in the Social Sciences 6, 4, 402--438.","paperID":"None"},{"content":"A D Pellegrini and P K Smith. 1998. Physical activity play: the nature and function of a neglected aspect of playing. Child development 69, 3, 577--98. Retrieved September 1, 2015 from http://www.ncbi.nlm.nih.gov/pubmed/9680672","paperID":"None"},{"content":"Steve Roud. 2010. The Lore of the Playground: One hundred years of children's games, rhymes and traditions. Random House Books.","paperID":"None"},{"content":"Duncan Rowland, Martin Flintham, Leif Oppermann, et al. 2009. Ubikequitous Computing?: Designing Interactive Experiences for Cyclists. Proceedings of Mobile HCI '09, ACM. http://doi.org/10.1145/1613858.1613886","paperID":"None"},{"content":"Katie Salen and Eric Zimmerman. 2004. Rules of Play: Game Design Fundamentals. MIT Press. Retrieved September 2, 2015 from https://books.google.com/books?id=UMxyczrZuQC&pgis=1","paperID":"None"},{"content":"Michael D. Smith. 1975. The Legitimation of violence. Canadian Review of Sociology and Anthropology 12, 1.","paperID":"None"},{"content":"Amanda L Snyder, Cay Anderson-Hanley, and Paul J Arciero. 2012. Virtual and live social facilitation while exergaming: competitiveness moderates exercise intensity. Journal of sport & exercise psychology 34, 2, 252--9. Retrieved September 16, 2013 from http://www.ncbi.nlm.nih.gov/pubmed/22605365","paperID":"None"},{"content":"Gershon Tenenbaum and Robert C. Eklund (eds.). 2007. Handbook of Sport Psychology. John Wiley & Sons. Retrieved September 4, 2015 from","paperID":"None"},{"content":"https://books.google.co.uk/books/about/Handbook_of_Sport_Psychology.html?id=h2m7I96ZStgC&pgis=1","paperID":"None"},{"content":"Steffen P. Walz and Sebastian Deterding (eds.). 2015. The Gameful World: Approaches, Issues, Applications. MIT Press.","paperID":"None"},{"content":"Marc D. Weinstein, Michael D. Smith, and David L. Wiesenthal. 1995. Masculinity and hockey violence. Sex Roles 33, 11--12, 831--847. http://doi.org/10.1007/BF01544782","paperID":"None"},{"content":"Anthony Whitehead, Hannah Johnston, Nicole Nixon, and Jo Welch. 2010. Exergame effectiveness. Proceedings of the 5th ACM SIGGRAPH Symposium on Video Games Sandbox '10, ACM Press, 55--62. http://doi.org/10.1145/1836135.1836144","paperID":"None"},{"content":"Douglas Wilson. 2011. Brutally Unfair Tactics Totally OK Now: On Self-Effacing Games and Unachievements. Game Studies 11, 1. Retrieved October 22, 2012 from http://gamestudies.org/1101/articles/wilson","paperID":"None"},{"content":"Douglas Wilson. 2012. Designing for the Pleasures of Disputation -- or -- How to make friends by trying to kick them?! Retrieved from http://doougle.net/phd/Designing_for_the_Pleasures_of_Disputation.pdf","paperID":"None"},{"content":"World Squash Federation. 2012. Court Specifications. Retrieved July 21, 2015 from http://www.worldsquash.org/ws/resources/courtconstruction","paperID":"None"}],"abstract":"Non-digital forms of play that allow players to direct brute force directly upon each other, such as martial arts, boxing and full contact team sports, are very popular. However, inter-player brutality has largely been unexplored as a feature of digital gaming. In this paper, we describe the design and study of 2 multi-player games that encourage players to use brute force directly against other players. Balance of Power is a tug-of-war style game implemented with Xbox Kinect, while Bundle is a playground-inspired chasing game implemented with smartphones. Two groups of five participants (n=10) played both games while being filmed, and were subsequently interviewed. A thematic analysis identified five key components of the brutal multiplayer video game experience, which informs a set of seven design considerations. This work aims to inspire the design of engaging game experiences based on awareness and enjoyment of our own and others' physicality.","title":"Designing Brutal Multiplayer Video Games","filename":"CHI16/p2669","authors":["Joe Marshall","Conor Linehan","Adrian Hazzard"],"conference":"CHI '16"}