{"paperId":2858485,"citation":[],"reference":[{"content":"Frances K. Aldrich. 2003. Smart Homes: Past, Present and Future. In Harper, R. (ed.) Inside the Smart Home, 17--39.","paperID":"None"},{"content":"Jordan Ash, Monica Babes, Gal Cohen, et al. Scratchable devices: user-friendly programming for household appliances. In Proc. HCII'11, 137--146.","paperID":"None"},{"content":"Ayah Bdeir, and Paul Rothman. Electronics as material: littleBits. In Proc. TEI'12. 371--374.","paperID":"None"},{"content":"A.J. Bernheim Brush, Bongshin Lee, Ratul Mahajan, et al. Home Automation in the Wild: Challenges and Opportunities. In Proc. CHI'11, 2115--2124.","paperID":"None"},{"content":"Marie Chan, Eric Campo, Daniel Estève, and Jean-Yves Fourniols. 2009. Smart homes -- Current features and future perspectives. Maturitas 64, 2: 90--97.","paperID":"None"},{"content":"Anthony Chen, Stelian Coros, Jennifer Mankoff, and Scott Hudson E. Encore: 3D Printed Augmentation of Everyday Objects with Printed-Over, Affixed and Interlocked Attachments. In Proc. UIST'15, 73--82.","paperID":"None"},{"content":"E.J. Chikofsky and II J.H. Cross. 1990. Reverse engineering and design recovery: a taxonomy. IEEE Software 7, 1: 13--17.","paperID":"None"},{"content":"Scott Davidoff, Nicolas Villar, Alex S. Taylor, and Shahram Izadi. Mechanical Hijacking: How Robots Can Accelerate UbiComp Deployments. In Proc. Ubicomp'11, ACM, 267--270.","paperID":"None"},{"content":"Morgan Dixon and James Fogart. Prefab: Implementing Advanced Behaviors Using Pixel-based Reverse Engineering of Interface Structure. In Proc. CHI'10, 1525--1534.","paperID":"None"},{"content":"James R. Eagan, Michel Beaudouin-Lafon, and Wendy E. Mackay. Cracking the Cocoa Nut: User Interface Programming at Runtime. In Proc. UIST'11, 225--234.","paperID":"None"},{"content":"S. Greenberg and C. Fitchett. Phidgets: easy development of physical interfaces through physical widgets. In Proc. UIST'01, 209--218.","paperID":"None"},{"content":"Sidhant Gupta, Matthew S. Reynolds, and Shwetak N. Patel. ElectriSense: Single-point Sensing Using EMI for Electrical Event Detection and Classification in the Home. In Proc. Ubicomp'10, 139--148.","paperID":"None"},{"content":"Jan Humble, Andy Crabtree, Terry Hemmings, et al. \"Playing with the Bits\" User-Configuration of Ubiquitous Domestic Environments. In Proc. UbiComp'03, 256--263.","paperID":"None"},{"content":"Manfred Lau, Akira Ohgawara, Jun Mitani, et al. Converting 3D Furniture Models to Fabricatable Parts and Connectors. In. Proc. SIGGRAPH'11, 85:1--85:6.","paperID":"None"},{"content":"Amon Millner and Edward Baafi. 2011. Modkit: blending and extending approachable platforms for creating computer programs and interactive objects. In Proc. IDC'11, 250--253.","paperID":"None"},{"content":"Stefanie Mueller, Tobias Mohr, Kerstin Guenther, et al. faBrickation: Fast 3D Printing of Functional Objects by Integrating Construction Kit Building Blocks. In Proc. CHI'14, 3827--3834.","paperID":"None"},{"content":"Makoto Ono, Buntarou Shizuki, and Jiro Tanaka. Touch & Activate: Adding Interactivity to Existing Objects Using Active Acoustic Sensing. In Proc. UIST'13, 31--40.","paperID":"None"},{"content":"Shwetak N. Patel, Thomas Robertson, Julie A. Kientz, et al. At the Flick of a Switch: Detecting and Classifying Unique Electrical Events on the Residential Power Line. In Proc. Ubicomp'07, 271--288.","paperID":"None"},{"content":"Raf Ramakers, Kashyap Todi, and Kris Luyten. PaperPulse: An Integrated Approach for Embedding Electronics in Paper Designs. In Proc. CHI'15, 2457--2466.","paperID":"None"},{"content":"Munehiko Sato, Ivan Poupyrev, and Chris Harrison. Touché: Enhancing Touch Interaction on Humans, Screens, Liquids, and Everyday Objects. In Proc UIST'12, 483--492.","paperID":"None"},{"content":"Valkyrie Savage, Sean Follmer, Jingyi Li, et al. Makers' Marks: Physical Markup for Designing and Fabricating Functional Objects. In Proc. UIST'15, 103--108.","paperID":"None"},{"content":"Valkyrie Savage, Ryan Schmidt, Tovi Grossman, et al. A Series of Tubes: Adding Interactivity to 3D Prints Using Internal Pipes. In Proc. UIST'14, 3--12.","paperID":"None"},{"content":"Ryan Schmidt and Karan Singh. Meshmixer: An Interface for Rapid Mesh Composition. SIGGRAPH'10 Talks, 6:1--6:1.","paperID":"None"},{"content":"Liyanage C. De Silva, Chamin Morikawa, and Iskandar M. Petra. 2012. State of the art of smart homes. Engineering Applications of Artificial Intelligence 25, 7: 1313--1321.","paperID":"None"},{"content":"Alexander Teibrich, Stefanie Mueller, Francois Guimbretiere, et al. Patching Physical Objects. In Proc. UIST'15, 83--91.","paperID":"None"},{"content":"Blase Ur, Elyse McManus, Melwyn Pak Yong Ho, et al. Practical Trigger-action Programming in the Smart Home. In Proc. CHI'14, 803--812.","paperID":"None"},{"content":"Nicolas Villar, James Scott, and Steve Hodges. Prototyping with microsoft .net gadgeteer. In Proc. TEI'11, 377--380.","paperID":"None"},{"content":"Christian Weichel, Manfred Lau, and Hans Gellersen. Enclosed: A Component-centric Interface for Designing Prototype Enclosures. In Proc. TEI'13, 215--218.","paperID":"None"},{"content":"Christian Weichel, Manfred Lau, David Kim, et al. MixFab: A Mixed-reality Environment for Personal Fabrication. In Proc. CHI'14, 3855--3864.","paperID":"None"},{"content":"Home | Nest. Retrieved September 22, 2015 from https://nest.com","paperID":"None"},{"content":"Smart Toast | Breville. Retrieved September 22, 2015 from http://www.breville.ca/smart-toaster.html","paperID":"None"},{"content":"Switchmate. Retrieved September 22, 2015 from http://switchmate.net","paperID":"None"},{"content":"Meld | The future of cooking. Retrieved September 22, 2015 from http://www.meldhome.com","paperID":"None"},{"content":"Lockitron. Retrieved September 22, 2015 from https://lockitron.com","paperID":"None"},{"content":"Connect the apps you love IFTTT. Retrieved September 16, 2015 from https://ifttt.com","paperID":"None"}],"abstract":"We present RetroFab, an end-to-end design and fabrication environment that allows non-experts to retrofit physical interfaces. Our approach allows for changing the layout and behavior of physical interfaces. Unlike customizing software interfaces, physical interfaces are often challenging to adapt because of their rigidity. With RetroFab, a new physical interface is designed that serves as a proxy interface for the legacy controls that are now operated by actuators. RetroFab makes this concept of retrofitting devices available to non-experts by automatically generating an enclosure structure from an annotated 3D scan. This enclosure structure holds together actuators, sensors as well as components for the redesigned interface. To allow retrofitting a wide variety of legacy devices, the RetroFab design tool comes with a toolkit of 12 components. We demonstrate the versatility and novel opportunities of our approach by retrofitting five domestic objects and exploring their use cases. Preliminary user feedback reports on the experience of retrofitting devices with RetroFab.","title":"RetroFab: A Design Tool for Retrofitting Physical Interfaces using Actuators, Sensors and 3D Printing","filename":"CHI16/p409","authors":["Raf Ramakers","Fraser Anderson","Tovi Grossman","George Fitzmaurice"],"conference":"CHI '16"}