{"paperId":2858251,"abstract":"We present the findings from a longitudinal study of iPad use in a Primary school classroom. While tablet devices have found their way into classroom environments, we still lack in-depth and long-term studies of how they integrate into everyday classroom activities. Our findings illustrate in-classroom tablet use and the broad range of learning activities in subjects such as maths, languages, social sciences, and even physical education. Our observations expand current models on teaching and learning supported by tablet technology. Our findings are child-centred, focusing on three different roles that tablets can play as part of learning activities: Friend, Functionary, and Facilitator. This new perspective on in-classroom tablet use can facilitate critical discussions around the integration and impact of these devices in the educational context, from a design and educational point of view.","citation":[],"reference":[{"content":"Heejung An and Sandra Alon. 2013. iPad Implementation Models in K-12 School Environments: An Exploratory Case Study. In Proceedings of Society for Information Technology & Teacher Education International Conference 2013, Ron McBride and Michael Searson (Eds.). Association for the Advancement of Computing in Education (AACE), New Orleans, Louisiana, USA, 3005--3011. http://www.editlib.org/p/48552","paperID":"None"},{"content":"Gary Beauchamp and Emily Hillier. 2014. An Evaluation of iPad Implementation Across A Network of Primary Schools in Cardiff. Cardiff: Cardiff Metropolitan University. http://www.cardiffmet.ac.uk/education/research/Documents/iPadImplementation2014.pdf","paperID":"None"},{"content":"Book Creator for iPad 2015. Red Jumper Ltd. (2015). https://itunes.apple.com/gb/app/book-creator-for-ipad-create/id442378070?mt=8","paperID":"None"},{"content":"Patricia Senn Breivik. 2005. 21st century learning and information literacy. Change: The Magazine of Higher Learning 37, 2 (2005), 21--27. DOI: http://dx.doi.org/10.3200/CHNG.37.2.21--27","paperID":"None"},{"content":"Kevin Burden, Paul Hopkins, Trevor Male, Stewart Martin, and Christine Trala. 2012. iPad Scotland Evaluation. (2012). DOI: http://dx.doi.org/10.13140/2.1.3593.5363 Retrieved on September 20, 2015 from http://www.tablet-academy.com/uploads/news/Scotland-iPad-Evaluation.pdf.","paperID":"None"},{"content":"Kevin Burden and Trevor Male. 2013. Edinburgh 1:1 Mobile Evaluation. https://digitalteachingandlearning.files.wordpress.com/2013/10/edinburgh_mobile_evaluation_2013.pdf","paperID":"None"},{"content":"Cathy Cavanaugh, Jace Hargis, Stephen Munns, and Tayeb Kamali. 2013. iCelebrate teaching and learning: Sharing the iPad experience. Journal of teaching and learning with technology 1, 2 (2013), 1--12. http://jotlt.indiana.edu/article/view/2163","paperID":"None"},{"content":"Daniel Chong. 2015. Division Wiz. The Rocket Studio. (2015). https://itunes.apple.com/gb/app/division-wiz-free/id496191722?mt=8","paperID":"None"},{"content":"Sean Coughlin. 2014. Tablet computers in '70% of schools'. BBC News Article. (December 2014). Retrieved September 20, 2015 from http://www.bbc.co.uk/news/education-30216408.","paperID":"None"},{"content":"Crazy Cursive 2015. MadeByEducators. (2015). https://itunes.apple.com/gb/app/crazy-cursive-letters-joined/id788797222?mt=8","paperID":"None"},{"content":"John W Creswell. 2007. Qualitative enquiry and research design: Choosing among five approaches. (2007).","paperID":"None"},{"content":"Susan Crichton, Nancy Stuewe, Karen Pegler, and Duncan White. 2011. Personal devices in public settings: Lessons learned from an iPod touch/iPad project. In 6th International Conference on e-Learning. http://www.ejel.org/volume10/issue1/p23","paperID":"None"},{"content":"Alma L Culén and Andrea Gasparini. 2011. iPad: a new classroom technology? A report from two pilot studies. INFuture Proceedings (2011), 199--208.","paperID":"None"},{"content":"Allison Druin, Elizabeth Foss, Leshell Hatley, Evan Golub, Mona Leigh Guha, Jerry Fails, and Hilary Hutchinson. 2009. How Children Search the Internet with Keyword Interfaces. In Proceedings of the 8th International Conference on Interaction Design and Children (IDC '09). ACM, NY, NY, USA, 89--96. DOI: http://dx.doi.org/10.1145/1551788.1551804","paperID":"None"},{"content":"Crystal Elliott, Kimberly Livengood, and Mary McGlamery. 2012. Teaching with technology: iPad use in the classroom. In Proceedings of Society for Information Technology & Teacher Education International Conference 2012, Paul Resta (Ed.). Association for the Advancement of Computing in Education (AACE), Austin, TX, USA, 4084--4086. http://www.editlib.org/p/40249","paperID":"None"},{"content":"Andrew Enever. 2015. A+ Spelling Superstar. (2015). https://itunes.apple.com/us/app/a+ -spelling-superstar/id832420917?mt=8","paperID":"None"},{"content":"GarageBand 2015. Apple. (2015). https://itunes.apple.com/gb/app/garageband/id408709785?mt=8","paperID":"None"},{"content":"E Garcia and A Friedman. 2011. \"There's an App for That\": A Study Using Apple iPads in a USA History Classroom. Studies in Teaching 2011 Research Digest (2011), 31. DOI: http://dx.doi.org/10.5923/j.edu.20120205.05","paperID":"None"},{"content":"Clifford Geertz. 2002. Thick description: Toward an interpretive theory of culture. The interpretation of cultures (2002), 537--56.","paperID":"None"},{"content":"Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007. The three paradigms of HCI. In Alt. Chi. Session at the SIGCHI Conference on Human Factors in Computing Systems San Jose, California, USA. 1--18.","paperID":"None"},{"content":"Sarah Henderson and Jeff Yeow. 2012. iPad in Education: A Case Study of iPad Adoption and Use in a Primary School. In Proceedings of the 2012 45th Hawaii International Conference on System Sciences (HICSS '12). IEEE Computer Society, Washington, DC, USA, 78--87. DOI: http://dx.doi.org/10.1109/HICSS.2012.390","paperID":"None"},{"content":"Steve Higgins, Gary Beauchamp, and Dave Miller. 2007. Reviewing the literature on interactive whiteboards. Learning, Media and Technology 32, 3 (2007), 213--225. DOI: http://dx.doi.org/10.1080/17439880701511040","paperID":"None"},{"content":"Juan Pablo Hourcade, Sarah L. Mascher, David Wu, and Luiza Pantoja. 2015. Look, My Baby Is Using an iPad! An Analysis of YouTube Videos of Infants and Toddlers Using Tablets. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1915--1924. DOI: http://dx.doi.org/10.1145/2702123.2702266","paperID":"None"},{"content":"Winnie Hu. 2011. Math That Moves: Schools Embrace the iPad. The NY Times News Article. (January 2011). Retrieved January 5th, 2016 from http://www.nytimes.com/2011/01/05/education/05tablets.html.","paperID":"None"},{"content":"Isa Jahnke, Lars Norqvist, and Andreas Olsson. 2013. Digital Didactical Designs in iPad-Classrooms. In Scaling up Learning for Sustained Impact, Davinia Hernndez-Leo, Tobias Ley, Ralf Klamma, and Andreas Harrer (Eds.). Lecture Notes in Computer Science, Vol. 8095. Springer Berlin Heidelberg, 611--612. DOI: http://dx.doi.org/10.1007/978--3--642--40814--4_76","paperID":"None"},{"content":"Keynote 2015. Apple. (2015). https://itunes.apple.com/gb/app/keynote/id361285480?mt=8","paperID":"None"},{"content":"King of Maths 2015. Oddrobo Software AB. (2015). https://itunes.apple.com/gb/app/king-of-maths/ id473904402?mt=8","paperID":"None"},{"content":"Natalia Kucirkova, David Messer, Kieron Sheehy, and Carmen Fernandez Panadero. 2014. Children's engagement with educational iPad apps: Insights from a Spanish classroom. Computers & Education 71 (2014), 175--184. DOI: http://dx.doi.org/10.1016/j.compedu.2013.10.003","paperID":"None"},{"content":"Robert McCormick and Peter Scrimshaw. 2001. Information and Communications Technology, Knowledge and Pedagogy. Education, Communication & Information 1, 1 (2001), 37--57. DOI: http://dx.doi.org/10.1080/14636310120048047","paperID":"None"},{"content":"Iain McPhee, Lisa Marks, and Dougie Marks. 2013. Examining the impact of the Apple 'iPad' on male and female classroom engagement in a primary school in Scotland. Proceedings of ICICTE 2013 (2013), 443--451. http://www.icicte.org/Proceedings2013/ 12--4-McPhee-Abstract2013.htm","paperID":"None"},{"content":"Bente Meyer. 2015. iPads in Inclusive Classrooms: Ecologies of Learning. In E-Learning Systems, Environments and Approaches, Pedro Isaas, J. Michael Spector, Dirk Ifenthaler, and Demetrios G. Sampson (Eds.). Springer International Publishing, 25--37. DOI: http://dx.doi.org/10.1007/978--3--319-05825--2_3","paperID":"None"},{"content":"Microsoft Excel 2015. Microsoft Corporation. (2015). https://itunes.apple.com/gb/app/microsoft-excel/id586683407?mt=8","paperID":"None"},{"content":"Microsoft PowerPoint 2015. Microsoft Corporation. (2015). https://itunes.apple.com/gb/app/microsoft-powerpoint/id586449534?mt=8","paperID":"None"},{"content":"Microsoft Word 2015. Microsoft Corporation. (2015). https://itunes.apple.com/gb/app/microsoft-word/ id586447913?mt=8","paperID":"None"},{"content":"Tom Moher, Syeda Hussain, Tim Halter, and Debi Kilb. 2005. Roomquake: Embedding Dynamic Phenomena Within the Physical Space of an Elementary School Classroom. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, NY, NY, USA, 1665--1668. DOI: http://dx.doi.org/10.1145/1056808.1056992","paperID":"None"},{"content":"M.R. Morris, A.J.B. Brush, and B.R. Meyers. 2007. Reading Revisited: Evaluating the Usability of Digital Display Surfaces for Active Reading Tasks. In Horizontal Interactive Human-Computer Systems, 2007. TABLETOP '07. Second Annual IEEE International Workshop on. 79--86. DOI: http://dx.doi.org/10.1109/TABLETOP.2007.12","paperID":"None"},{"content":"Meghan Murphy. 2014. Why Some Schools Are Selling All Their iPads. (2014). http://www.theatlantic.com/ education/archive/2014/08/ whats-the-best-device-for-interactive-learning/ 375567/","paperID":"None"},{"content":"David Nagel. 2014. One-Third of U.S. Students Use School-Issued Mobile Devices. BBC News Article. (August 2014). Retrieved September 20, 2015 from https://goo.gl/ovjDuk.","paperID":"None"},{"content":"Cathleen A Norris and Elliot Soloway. 2011. Learning and Schooling in the Age of Mobilism. Educational Technology 51, 6 (2011), 3. http://eric.ed.gov/?id=EJ956471","paperID":"None"},{"content":"Nathaniel Ostashewski and Doug Reid. 2013. The ipad in the classroom: Three implementation cases highlighting pedagogical activities, integration issues, and teacher professional development strategies. Pedagogical applications and social effects of mobile technology integration (2013), 25--41. http://dx.doi.org/10.4018/978--1--4666--2985--1.ch002","paperID":"None"},{"content":"Pages 2015. Apple. (2015). https://itunes.apple.com/gb/app/pages/id361309726?mt=8","paperID":"None"},{"content":"A Sullivan Palincsar. 2005. 12 Social constructivist perspectives on teaching and learning. An introduction to Vygotsky (2005), 285.","paperID":"None"},{"content":"Seymour Papert. 1980. Mindstorms: Children, computers, and powerful ideas. Basic Books, Inc. http://dl.acm.org/citation.cfm?id=1095592","paperID":"None"},{"content":"PicCollage 2015. Cardinal Blue Software Inc.. (2015). https://itunes.apple.com/gb/app/pic-collage-photo-editor-effects/id448639966? mt=8","paperID":"None"},{"content":"Marc Prensky. 2009. H. sapiens digital: From digital immigrants and digital natives to digital wisdom. Innovate: journal of online education 5, 3 (2009), 1. http://www.wisdompage.com/Prensky01.html","paperID":"None"},{"content":"Luis P. Prieto, Martina Holenko Dlab, Israel Gutierrez, Mahmoud Abdulwahed, and Walid Balid. 2011. Orchestrating Technology Enhanced Learning: A Literature Review and a Conceptual Framework. Int. J. Technol. Enhanc. Learn. 3, 6 (Feb. 2011), 583--598. DOI: http://dx.doi.org/10.1504/IJTEL.2011.045449","paperID":"None"},{"content":"Ruben R Puentedura. 2015. SAMR: Guiding development. (2015). http://www.hippasus.com/rrpweblog/archives/2012/01/19/SAMR_GuidingDevelopment.pdf","paperID":"None"},{"content":"Puppet Pals HD 2015. Polished Play, LLC. (2015). https://itunes.apple.com/gb/app/puppet-pals-hd/id342076546?mt=8","paperID":"None"},{"content":"Jeremy Roschelle, Deborah Tatar, S.R. Chaudhury, Y. Dimitriadis, C. Patton, and C. DiGiano. 2007. Ink, Improvisation, and Interactive Engagement: Learning with Tablets. Computer 40, 9 (Sept 2007), 42--48. DOI: http://dx.doi.org/10.1109/MC.2007.321","paperID":"None"},{"content":"Education Scotland. 2015. Introduction - Active spelling strategies - Resources. (2015). http://www.educationscotland.gov.uk/resources/practice/a/activespelling/intro.asp","paperID":"None"},{"content":"Karen Sheingold, Janet Kane, and Mari Endreweit. 1983. Microcomputer Use in Schools: Developing a Research Agenda. Harvard Educational Review 53, 4 (1983), 412--432. DOI: http://dx.doi.org/10.17763/haer.53.4.q42t234826087673","paperID":"None"},{"content":"Christopher Sherman. 2012. TX School District Embarks On Widespread iPad Program To Close Digital Divide. Huffington Post News Article. (Febuary 2012). Retrieved January 5th, 2016 from http://www.huffingtonpost.com/2012/02/27/texas-school-district-emb_n_1305711.html.","paperID":"None"},{"content":"Showme Interactive Whiteboard 2015. Learnbat Inc.. (2015). https://itunes.apple.com/gb/app/showme-interactive-whiteboard/id445066279?mt=8","paperID":"None"},{"content":"Sumdog 2015. Sumdog. Sumdog Ltd. (2015). https://itunes.apple.com/gb/app/sumdog/id783577770?mt=8","paperID":"None"},{"content":"Super Speller 2015. Quiet Spark: Create Your Own Spelling Tests. (2015). https://itunes.apple.com/gb/app/super-speller-create-your/id483480630?mt=8","paperID":"None"},{"content":"Bernie Trilling and Charles Fadel. 2009. 21st century skills: Learning for life in our times. John Wiley & Sons. http://21stcenturyskillsbook.com/","paperID":"None"},{"content":"Robert K Yin. 2009. Case Study Research: Design and Methods (4th ed.).","paperID":"None"},{"content":"Susan A. Zammit. 1992. Factors facilitating or hindering the use of computers in schools. Educational Research 34, 1 (1992), 57--66. DOI: http://dx.doi.org/10.1080/0013188920340106","paperID":"None"}],"title":"Facilitator, Functionary, Friend or Foe?: Studying the Role of iPads within Learning Activities Across a School Year","filename":"CHI16/p1833","authors":["Anne-Marie Mann","Uta Hinrichs","Janet C. Read","Aaron Quigley"],"conference":"CHI '16"}