{"paperId":2858491,"citation":[],"reference":[{"content":"Aruna D. Balakrishnan, Susan R. Fussell, and Sara Kiesler. 2008. Do Visualizations Improve Synchronous Remote Collaboration?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1227--1236. DOI: http://dx.doi.org/10.1145/1357054.1357246","paperID":"None"},{"content":"Rafael Ballagas, Michael Rohs, Jennifer G Sheridan, and Jan Borchers. 2004. BYOD: Bring Your Own Device. Proceedings of the 2004 Workshop on Ubiquitous Display Environments (2004).","paperID":"None"},{"content":"Eric A. Bier, Stuart K. Card, and John W. Bodnar. 2010. Principles and Tools for Collaborative Entity-Based Intelligence Analysis. IEEE Transactions on Visualization and Computer Graphics 16, 2 (March 2010), 178--191. DOI: http://dx.doi.org/10.1109/TVCG.2009.104","paperID":"None"},{"content":"Nicholas Chen, Francois Guimbreti'ere, and Abigail Sellen. 2013. Graduate Student Use of a Multi-slate Reading System. In Proceedings of the 2013 SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1799--1808. DOI: http://dx.doi.org/10.1145/2470654.2466237","paperID":"None"},{"content":"George Chin, Jr., Olga A. Kuchar, and Katherine E. Wolf. 2009. Exploring the Analytical Processes of Intelligence Analysts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 11--20. DOI: http://dx.doi.org/10.1145/1518701.1518704","paperID":"None"},{"content":"Haeyong Chung, Seungwon Yang, Naveed Massjouni, Christopher Andrews, Rahul Kanna, and Chris North. 2010. Vizcept: Supporting synchronous collaboration for constructing visualizations in intelligence analysis. In IEEE Symposium on Visual Analytics Science and Technology (VAST '10). IEEE, 107--114. DOI: http://dx.doi.org/10.1109/VAST.2010.5652932","paperID":"None"},{"content":"Gregorio Convertino, Helena M. Mentis, Mary Beth Rosson, Aleksandra Slavkovic, and John M. Carroll. 2009. Supporting Content and Process Common Ground in Computer-supported Teamwork. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 2339--2348. DOI: http://dx.doi.org/10.1145/1518701.1519059","paperID":"None"},{"content":"Beth Davey. 1983. Think aloud: Modeling the cognitive processes of reading comprehension. Journal of Reading (1983), 44--47.","paperID":"None"},{"content":"Sebastian Denef, Leonardo Ramirez, Tobias Dyrks, and Gunnar Stevens. 2008. Handy Navigation in Ever-changing Spaces: An Ethnographic Study of Firefighting Practices. In Proceedings of the 7th ACM Conference on Designing Interactive Systems (DIS '08). ACM, NY, NY, USA, 184--192. DOI: http://dx.doi.org/10.1145/1394445.1394465","paperID":"None"},{"content":"Kristie Fisher, Scott Counts, and Aniket Kittur. 2012. Distributed Sensemaking: Improving Sensemaking by Leveraging the Efforts of Previous Users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 247--256. DOI: http://dx.doi.org/10.1145/2207676.2207711","paperID":"None"},{"content":"Morten Fjeld, Paweł Wozniak, Josh Cowls, and Bonnie Nardi. 2015. Ad hoc encounters with big data: Engaging citizens in conversations around tabletops. First Monday 20, 2 (Feb. 2015). DOI: http://dx.doi.org/10.5210/fm.v20i2.5611","paperID":"None"},{"content":"Darren Gergle, Robert E Kraut, and Susan R Fussell. 2004. Language efficiency and visual technology minimizing collaborative effort with visual information. Journal of language and social psychology 23, 4 (2004), 491--517.","paperID":"None"},{"content":"Steven Gottlieb, Sheldon I Arenberg, Raj Singh, and others. 1994. Crime analysis: From first report to final arrest. Alpha Publishing Montclair, CA.","paperID":"None"},{"content":"Nitesh Goyal. 2015. Designing for Collaborative Sensemaking: Using Expert & Non-Expert Crowd. arXiv preprint arXiv:1511.06053 (2015).","paperID":"None"},{"content":"Nitesh Goyal and Susan R Fussell. 2015. Designing for Collaborative Sensemaking: Leveraging Human Cognition For Complex Tasks. arXiv preprint arXiv:1511.05737 (2015).","paperID":"None"},{"content":"Nitesh Goyal and Susan R Fussell. 2016. Effects of Sensemaking Translucence on Distributed Collaborative Analysis. (2016). http://www.cs.cornell.edu/?ngoyal/Goyal_CSCW2016_preprint.pdf","paperID":"None"},{"content":"Nitesh Goyal, Gilly Leshed, Dan Cosley, and Susan R. Fussell. 2014. Effects of Implicit Sharing in Collaborative Analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 129--138. DOI: http://dx.doi.org/10.1145/2556288.2557229","paperID":"None"},{"content":"Nitesh Goyal, Gilly Leshed, and Susan R. Fussell. 2013a. Effects of Visualization and Note-taking on Sensemaking and Analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2721--2724. DOI: http://dx.doi.org/10.1145/2470654.2481376","paperID":"None"},{"content":"Nitesh Goyal, Gilly Leshed, and Susan R. Fussell. 2013b. Leveraging Partner's Insights for Distributed Collaborative Sensemaking. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work Companion (CSCW '13). ACM, NY, NY, USA, 15--18. DOI: http://dx.doi.org/10.1145/2441955.2441960","paperID":"None"},{"content":"Saul Greenberg, Nicolai Marquardt, Till Ballendat, Rob Diaz-Marino, and Miaosen Wang. 2011. Proxemic Interactions: The New Ubicom interactions 18, 1 (Jan. 2011), 42--50. DOI: http://dx.doi.org/10.1145/1897239.1897250","paperID":"None"},{"content":"Global Intelligence Working Group and others. 2003. National criminal intelligence sharing plan. US Departent of Justice 12 (2003), 2011.","paperID":"None"},{"content":"Jonathan Haber, Miguel A. Nacenta, and Sheelagh Carpendale. 2014. Paper vs. Tablets: The Effect of Document Media in Co-located Collaborative Work. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, NY, NY, USA, 89--96. DOI: http://dx.doi.org/10.1145/2598153.2598170","paperID":"None"},{"content":"Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: Enabling and Understanding Cross-device Interaction. In Proceedings of the 2014 SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2773--2782. DOI: http://dx.doi.org/10.1145/2556288.2557170","paperID":"None"},{"content":"Sandra G Hart. 2006. NASA-task load index (NASA-TLX); 20 years later. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 50. Sage Publications, 904--908. DOI: http://dx.doi.org/10.1177/154193120605000909","paperID":"None"},{"content":"Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, 139--183. DOI: http://dx.doi.org/10.1016/S0166--4115(08)62386--9","paperID":"None"},{"content":"Khalad Hasan, David Ahlstrom, and Pourang Irani. 2013. Ad-binning: leveraging around device space for storing, browsing and retrieving mobile device content. Proceedings of the 2013 SIGCHI Conference on Human Factors in Computing Systems (2013), 899--908. DOI: http://dx.doi.org/10.1145/2470654.2466115","paperID":"None"},{"content":"Jeffrey Heer and Maneesh Agrawala. 2008. Design considerations for collaborative visual analytics. Information visualization 7, 1 (2008), 49--62.","paperID":"None"},{"content":"Jeffrey Heer, Fernanda B. Viegas, and Martin Wattenberg. 2009. Voyagers and Voyeurs: Supporting Asynchronous Collaborative Visualization. Communications of the ACM - Rural engineering development 52, 1 (Jan. 2009), 87--97. DOI: http://dx.doi.org/10.1145/1435417.1435439","paperID":"None"},{"content":"Tobias Hesselmann, Niels Henze, and Susanne Boll. 2010. FlashLight: Optical Communication Between Mobile Phones and Interactive Tabletops. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10). ACM, NY, NY, USA, 135--138. DOI: http://dx.doi.org/10.1145/1936652.1936679","paperID":"None"},{"content":"Uta Hinrichs, Sheelagh Carpendale, and Stacey D. Scott. 2006. Evaluating the Effects of Fluid Interface Components on Tabletop Collaboration. In Proceedings of the 2006 Working Conference on Advanced Visual Interfaces (AVI '06). ACM, NY, NY, USA, 27--34. DOI: http://dx.doi.org/10.1145/1133265.1133272","paperID":"None"},{"content":"Petra Isenberg, Danyel Fisher, Sharoda A. Paul, Meredith Ringel Morris, Kori Inkpen, and Mary Czerwinski. 2012. Co-Located Collaborative Visual Analytics Around a Tabletop Display. IEEE Transactions on Visualization and Computer Graphics 18, 5 (May 2012), 689--702. DOI: http://dx.doi.org/10.1109/TVCG.2011.287","paperID":"None"},{"content":"Jeroen Janssen, Gijsbert Erkens, Gellof Kanselaar, and Jos Jaspers. 2007. Visualization of participation: Does it contribute to successful computer-supported collaborative learning? Computers & Education 49, 4 (2007), 1037--1065. DOI: http://dx.doi.org/10.1016/j.compedu.2006.01.004","paperID":"None"},{"content":"Sirkka L Jarvenpaa and D Sandy Staples. 2000. The use of collaborative electronic media for information sharing: an exploratory study of determinants. The Journal of Strategic Information Systems 9, 2 (2000), 129--154. DOI: http://dx.doi.org/10.1016/S0963--8687(00)00042--1","paperID":"None"},{"content":"Tero Jokela, Jarno Ojala, and Thomas Olsson. 2015. A Diary Study on Combining Multiple Information Devices in Everyday Activities and Tasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3903--3912. DOI: http://dx.doi.org/10.1145/2702123.2702211","paperID":"None"},{"content":"Ruogu Kang and Sara Kiesler. 2012. Do Collaborators? Annotations Help or Hurt Asynchronous Analysis. In Proceedings of the ACM Conference on Computer Supported Cooperative Work Companion (CSCW '12). ACM, NY, NY, USA, 123--126. DOI: http://dx.doi.org/10.1145/2141512.2141558","paperID":"None"},{"content":"Paul Keel. 2006. Collaborative Visual Analytics: Inferring from the Spatial Organization and Collaborative Use of Information. In 2006 IEEE Symposium On Visual Analytics And Technology. IEEE, 137--144. DOI: http://dx.doi.org/10.1109/VAST.2006.261415","paperID":"None"},{"content":"Jonas Landgren and Urban Nulden. 2007. A Study of Emergency Response Work: Patterns of Mobile Phone Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 1323--1332. DOI: http://dx.doi.org/10.1145/1240624.1240824","paperID":"None"},{"content":"Ming Li and Leif Kobbelt. 2012. Dynamic Tiling Display: Building an Interactive Display Surface Using Multiple Mobile Devices. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia (MUM '12). ACM, NY, NY, USA, Article 24, 4 pages. DOI: http://dx.doi.org/10.1145/2406367.2406397","paperID":"None"},{"content":"Andres Lucero, Jussi Holopainen, and Tero Jokela. 2011. Pass-them-around: collaborative use of mobile phones for photo sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM Press, NY, 1787. DOI: http://dx.doi.org/10.1145/1978942.1979201","paperID":"None"},{"content":"Andres Lucero, Tero Jokela, Arto Palin, Viljakaisa Aaltonen, and Jari Nikara. 2012. EasyGroups: binding mobile devices for collaborative interactions. In Extended Abstracts of the SIGCHI Conference on Human Factors in Computing Systems (CHI EA '12). ACM Press, NY, 2189. DOI: http://dx.doi.org/10.1145/2212776.2223774","paperID":"None"},{"content":"Andres Lucero, Jaakko Keranen, and Hannu Korhonen. 2010. Collaborative Use of Mobile Phones for Brainstorming. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, NY, NY, USA, 337--340. DOI: http://dx.doi.org/10.1145/1851600.1851659","paperID":"None"},{"content":"Sebastian Marwecki, Roman Radle, and Harald Reiterer. 2013. Encouraging Collaboration in Hybrid Therapy Games for Autistic Children. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 469--474. DOI: http://dx.doi.org/10.1145/2468356.2468439","paperID":"None"},{"content":"Robert Morawa, Tom Horak, Ulrike Kister, Annett Mitschick, and Raimund Dachselt. 2014. Combining Timeline and Graph Visualization. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, NY, NY, USA, 345--350. DOI: http://dx.doi.org/10.1145/2669485.2669544","paperID":"None"},{"content":"Miguel A. Nacenta, Mikkel R. Jakobsen, Remy Dautriche, Uta Hinrichs, Marian Dork, Jonathan Haber, and Sheelagh Carpendale. 2012. The LunchTable: A Multi-user, Multi-display System for Information Sharing in Casual Group Interactions. In Proceedings of the International Symposium on Pervasive Displays (PerDis '12). ACM, NY, NY, USA, Article 18, 6 pages. DOI: http://dx.doi.org/10.1145/2307798.2307816","paperID":"None"},{"content":"Greg Newman, Andrea Wiggins, Alycia Crall, Eric Graham, Sarah Newman, and Kevin Crowston. 2012. The future of citizen science: emerging technologies and shifting paradigms. Frontiers in Ecology and the Environment 10, 6 (2012), 298--304.","paperID":"None"},{"content":"Janni Nielsen, Torkil Clemmensen, and Carsten Yssing. 2002. Getting Access to What Goes on in People's Heads?: Reflections on the Think-aloud Technique. In Proceedings of the Second Nordic Conference on Human-computer Interaction (NordiCHI '02). ACM, NY, NY, USA, 101--110. DOI: http://dx.doi.org/10.1145/572020.572033","paperID":"None"},{"content":"Antti Oulasvirta. 2008. FEATURE: When Users \"Do\" the Ubicomp. interactions 15, 2 (March 2008), 6--9. DOI: http://dx.doi.org/10.1145/1340961.1340963","paperID":"None"},{"content":"Sharoda A. Paul and Meredith Ringel Morris. 2009. CoSense: Enhancing Sensemaking for Collaborative Web Search. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1771--1780. DOI: http://dx.doi.org/10.1145/1518701.1518974","paperID":"None"},{"content":"Sharoda A. Paul and Madhu C. Reddy. 2010. Understanding Together: Sensemaking in Collaborative Information Seeking. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, NY, NY, USA, 321--330. DOI: http://dx.doi.org/10.1145/1718918.1718976","paperID":"None"},{"content":"Tommaso Piazza, Morten Fjeld, Gonzalo Ramos, AsimEvren Yantac, and Shengdong Zhao. 2013. Holy Smartphones and Tablets, Batman!: Mobile Interaction's Dynamic Duo. In Proceedings of the 11th Asia Pacific Conference on Computer Human Interaction (APCHI '13). ACM, NY, NY, USA, 63--72. DOI: http://dx.doi.org/10.1145/2525194.2525205","paperID":"None"},{"content":"Peter Pirolli and Stuart Card. 2005. The sensemaking process and leverage points for analyst technology as identified through cognitive task analysis. In Proceedings of international conference on intelligence analysis, Vol. 5. 2--4.","paperID":"None"},{"content":"Roman Radle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer, and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM Press, NY, 45--54. DOI: http://dx.doi.org/10.1145/2669485.2669500","paperID":"None"},{"content":"Roman Radle, Hans-Christian Jetter, Mario Schreiner, Zhihao Lu, Harald Reiterer, and Yvonne Rogers. 2015. Spatially-aware or Spatially-agnostic?. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '15). ACM Press, NY, NY, USA, 3913--3922. DOI: http://dx.doi.org/10.1145/2702123.2702287","paperID":"None"},{"content":"Stephanie Santosa and Daniel Wigdor. 2013. A Field Study of Multi-device Workflows in Distributed Workspaces. In Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 63--72. DOI: http://dx.doi.org/10.1145/2493432.2493476","paperID":"None"},{"content":"Stacey D. Scott, M. Sheelagh T. Carpendale, and Kori M. Inkpen. 2004. Territoriality in Collaborative Tabletop Workspaces. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, NY, NY, USA, 294--303. DOI:http://dx.doi.org/10.1145/1031607.1031655","paperID":"None"},{"content":"Martin Spindler. 2012. Spatially aware tangible display interaction in a tabletop environment. Proceedings of the 2012 ACM international conference on Interactive tabletops and surfaces (2012), 277. DOI: http://dx.doi.org/10.1145/2396636.2396679","paperID":"None"},{"content":"Martin Spindler, Wolfgang Buschel, Charlotte Winkler, and Raimund Dachselt. 2014. Tangible displays for the masses: Spatial interaction with handheld displays by using consumer depth cameras. Personal and Ubiquitous Computing 18 (2014), 1213--1225. DOI: http://dx.doi.org/10.1007/s00779-013-0730--7","paperID":"None"},{"content":"Gene Stanford and Barbara Dodds Stanford. Learning Discussion Skills Through Games. Citation Press. 75 pages.","paperID":"None"},{"content":"Anthony Tang, Melanie Tory, Barry Po, Petra Neumann, and Sheelagh Carpendale. 2006. Collaborative Coupling over Tabletop Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 1181--1190. DOI:http://dx.doi.org/10.1145/1124772.1124950","paperID":"None"},{"content":"James R. Wallace, Stacey D. Scott, and Carolyn G. MacGregor. 2013. Collaborative Sensemaking on a Digital Tabletop and Personal Tablets: Prioritization, Comparisons, and Tableaux. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3345--3354. DOI: http://dx.doi.org/10.1145/2470654.2466458","paperID":"None"},{"content":"James R. Wallace, Daniel Vogel, and Edward Lank. 2014. Effect of Bezel Presence and Width on Visual Search. In Proceedings of the International Symposium on Pervasive Displays (PerDis '14). ACM, NY, NY, USA, Article 118, 6 pages. DOI: http://dx.doi.org/10.1145/2611009.2611019","paperID":"None"},{"content":"C. Weaver. 2007. Is Coordination a Means to Collaboration?. In Fifth International Conference on Coordinated and Multiple Views in Exploratory Visualization (CMV '07). 80--84. DOI: http://dx.doi.org/10.1109/CMV.2007.15","paperID":"None"},{"content":"Sebastian Weise, John Hardy, Pragya Agarwal, Paul Coulton, Adrian Friday, and Mike Chiasson. 2012. Democratizing Ubiquitous Computing: A Right for Locality. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, NY, NY, USA, 521--530. DOI: http://dx.doi.org/10.1145/2370216.2370293","paperID":"None"},{"content":"Paweł Wozniak, Lars Lischke, Benjamin Schmidt, Shengdong Zhao, and Morten Fjeld. 2014a. Thaddeus: A Dual Device Interaction Space for Exploring Information Visualisation. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, NY, NY, USA, 41--50. DOI: http://dx.doi.org/10.1145/2639189.2639237","paperID":"None"},{"content":"Paweł Wozniak, Benjamin Schmidt, Lars Lischke, Zlatko Franjcic, Asim Evren Yantaç, and Morten Fjeld. 2014b. MochaTop: Building Ad-hoc Data Spaces with Multiple Devices. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 2329--2334. DOI: http://dx.doi.org/10.1145/2559206.2581232","paperID":"None"},{"content":"William Wright, David Schroh, Pascale Proulx, Alex Skaburskis, and Brian Cort. 2006. The Sandbox for Analysis: Concepts and Methods. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 801--810. DOI: http://dx.doi.org/10.1145/1124772.1124890","paperID":"None"},{"content":"Kathryn Zickuhr and Lee Rainie. 2013. Tablet ownership 2013. Pew Research Center report, pewinternet.com (2013), 11. http://fullrss.net/r/http/pewinternet.org/?/media/Files/Reports/2013/PIP_Tabletownership2013.pdf","paperID":"None"}],"abstract":"Synchronous colocated collaborative sensemaking requires that analysts share their information and insights with each other. The challenge is to know when is the right time to share what information without disrupting the present state of analysis. This is crucial in ad-hoc sensemaking sessions with mobile devices because small screen space limits information display. To address these tensions, we propose and evaluate RAMPARTS - a spatially aware sensemaking system for collaborative crime analysis that aims to support faster information sharing, clue-finding, and analysis. We compare RAMPARTS to an interactive tabletop and a paper-based method in a controlled laboratory study. We found that RAMPARTS significantly decreased task completion time compared to paper, without affecting cognitive load or task completion time adversely compared to an interactive tabletop. We conclude that designing for ad-hoc colocated sensemaking on mobile devices could benefit from spatial awareness. In particular, spatial awareness could be used to identify relevant information, support diverse alignment styles for visual comparison, and enable alternative rhythms of sensemaking.","title":"RAMPARTS: Supporting Sensemaking with Spatially-Aware Mobile Interactions","filename":"CHI16/p2447","authors":["Paweł Wozniak","Nitesh Goyal","Przemysław Kucharski","Lars Lischke","Sven Mayer","Morten Fjeld"],"conference":"CHI '16"}