{"paperId":2858537,"citation":[],"reference":[{"content":"Blender: https://www.blender.org/","paperID":"None"},{"content":"Michael Argyle. 1988. Bodily Communication. NY: Methuen & Co. (1988).","paperID":"None"},{"content":"Jeremy N. Bailenson, Nick Yee, Scott Brave, Dan Merget, and David Koslow. 2007. Virtual interpersonal touch: expressing and recognizing emotions through haptic devices. Human-Computer Interaction 22, 3, 325-353.","paperID":"None"},{"content":"Moshe Bar and Maital Neta. 2007. Visual elements of subjective preference modulate amygdala activation. Neuropsychologia 45, 10 (2007), 2191-2200.","paperID":"None"},{"content":"Scott Brave and Andrew Dahley. 1997. inTouch: a medium for haptic interpersonal communication. In CHI'97 Extended Abstracts on Human Factors in Computing Systems. ACM, 363-364.","paperID":"None"},{"content":"Jesse Burstyn, Amartya Banerjee, and Roel Vertegaal. 2013. FlexView: An evaluation of depth navigation on deformable mobile devices. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction. ACM, 193-200.","paperID":"None"},{"content":"John T. Cacioppo, Joseph R. Priester, and Gary G. Berntson. 1993. Rudimentary determinants of attitudes: II. Arm flexion and extension have differential effects on attitudes. Journal of Personality and Social Psychology 65, 1, 5.","paperID":"None"},{"content":"Taylor Carman. 1999. The body in Husserl and Merleau-Ponty. Philosophical Topics 27, 2, 205-226.","paperID":"None"},{"content":"Marcelo Coelho, Hiroshi Ishii, and Pattie Maes. 2008. Surflex: A programmable surface for the design of tangible interfaces. In CHI'08 Extended Abstracts on Human Factors in Computing Systems. ACM, 3429-3434.","paperID":"None"},{"content":"Jessica Q. Dawson, Oliver S. Schneider, Joel Ferstay, Dereck Toker, Juliette Link, Shathel Haddad, and Karon MacLean. 2013. It's alive!: Exploring the design space of a gesturing phone. In Proceedings of Graphics Interface. Canadian Information Processing Society, 205-212.","paperID":"None"},{"content":"Daantje Derks, Arjan E.R. Bos, and Jasper Von Grumbkow. 2008. Emoticons in computer-mediated communication: Social motives and social context. CyberPsychology & Behavior 11, 1, 99-101.","paperID":"None"},{"content":"Paul Ekman and Wallace V. Friesen. 1975. Unmasking the face: A guide to recognizing emotions from facial cues.","paperID":"None"},{"content":"Joseph L. Fleiss. 1971. Measuring nominal scale agreement among many raters. Psychological Bulletin 76, 5, 378.","paperID":"None"},{"content":"Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic physical affordances and constraints through shape and object actuation. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, 417-426.","paperID":"None"},{"content":"Antonio Gomes, Andrea Nesbitt, and Roel Vertegaal. 2013. MorePhone: A study of actuated shape deformations for flexible thin-film smartphone notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 583-592.","paperID":"None"},{"content":"Tovi Grossman, Ravin Balakrishnan, and Karan Singh. 2003. An interface for creating and manipulating curves using a high degree-of-freedom curve input device. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 185-192.","paperID":"None"},{"content":"Antal Haans, Christiaan de Nood, and Wijnand A. IJsselsteijn. 2007. Investigating response similarities between real and mediated social touch: A first test. In CHI'07 Extended Abstracts on Human Factors in Computing Systems. ACM, 2405-2410.","paperID":"None"},{"content":"Marti A. Hearst, Susan T. Dumais, Edgar Osman, John Platt, and Bernhard Scholkopf. 1998. Support vector machines. Intelligent Systems and their Applications, IEEE 13, 4, 18-28.","paperID":"None"},{"content":"Fritz Heider and Marianne Simmel. 1944. An experimental study of apparent behavior. The American Journal of Psychology 57, 2, 243-259.","paperID":"None"},{"content":"Fabian Hemmert, Susann Hamann, Matthias Löwe, Anne Wohlauf, and Gesche Joost. 2010. Shapechanging mobiles: Tapering in one-dimensional deformational displays in mobile phones. In Proceedings of the 4th International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 249-252.","paperID":"None"},{"content":"Fabian Hemmert, Susann Hamann, Matthias Löwe, Josefine Zeipelt, and Gesche Joost. 2010. Shapechanging mobiles: Tapering in two-dimensional deformational displays in mobile phones. In CHI'10 Extended Abstracts on Human Factors in Computing Systems. ACM, 3075-3080.","paperID":"None"},{"content":"Fabian Hemmert, Gesche Joost, André Knörig, and Reto Wettach. 2008. Dynamic knobs: Shape change as a means of interaction on a mobile phone. In CHI'08 Extended Abstracts on Human Factors in Computing Systems. ACM, 2309-2314.","paperID":"None"},{"content":"David Holman and Roel Vertegaal. 2008. Organic user interfaces: Designing computers in any way, shape, or form. In Communications of the ACM. ACM 51, 6, 48-55.","paperID":"None"},{"content":"David Holman, Roel Vertegaal, Mark Altosaar, Nikolaus Troje, and Derek Johns. 2005. PaperWindows: Interaction techniques for digital paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 591-599.","paperID":"None"},{"content":"Marco Iacoboni, Istvan Molnar-Szakacs, Vittorio Gallese, Giovanni Buccino, John C. Mazziotta, Giacomo Rizzolatti, and others. 2005. Grasping the intentions of others with one's own mirror neuron system. PLoS Biol 3, 3, e79.","paperID":"None"},{"content":"Byron Lahey, Audrey Girouard, Winslow Burleson, and Roel Vertegaal. 2011. PaperPhone: Understanding the use of bend gestures in mobile devices with flexible electronic paper displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1303-1312.","paperID":"None"},{"content":"George Lakoff and Mark Johnson. 2008. Metaphors we live by. University of Chicago Press.","paperID":"None"},{"content":"Peter J. Lang, Margaret M. Bradley, and Bruce N. Cuthbert. 2008. International affective picture system (IAPS): Affective ratings of pictures and instruction manual. Technical Report A-8.","paperID":"None"},{"content":"Helmut Leder, Pablo P.L. Tinio, and Moshe Bar. 2011. Emotional valence modulates the preference for curved objects. Perception-London 40, 6, 649.","paperID":"None"},{"content":"Rachel McDonnell, Sophie Jörg, Joanna McHugh, Fiona N. Newell, and Carol O'Sullivan. 2009. Investigating the role of body shape on the perception of emotion. ACM Transactions on Applied Perception 6, 3, 14.","paperID":"None"},{"content":"Maurice Merleau-Ponty and Colin Smith. 1996. Phenomenology of perception. Routledge Publishers.","paperID":"None"},{"content":"Mie Nørgaard, Tim Merritt, Majken Kirkegaard Rasmussen, and Marianne Graves Petersen. 2013. Exploring the design space of shape-changing objects: imagined physics. In Proceedings of the 6th International Conference on Designing Pleasurable Products and Interfaces. ACM, 251-260.","paperID":"None"},{"content":"Donald A. Norman. 2004. Emotion design: Why we love (or hate) everyday things. Basic Books.","paperID":"None"},{"content":"Andrew Ortony and Terence J. Turner. 1990. What's basic about basic emotions? Psychological Review 97, 3, 315.","paperID":"None"},{"content":"Joohee Park, Young-Woo Park, and Tek-Jin Nam. 2014. Wrigglo: Shape-changing peripheral for interpersonal mobile communication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3973-3976.","paperID":"None"},{"content":"Young-Woo Park, Kyoung-Min Baek, and Tek-Jin Nam. 2013. The roles of touch during phone conversations: long-distance couples' use of POKE in their homes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1679-1688.","paperID":"None"},{"content":"Eric Paulos. 2003. Connexus: A communal interface. In Proceedings of the 2003 Conference on Designing for User Experiences. ACM, 1-4.","paperID":"None"},{"content":"Marina Pavlova, Arseny A. Sokolov, and Alexander Sokolov. 2005. Perceived dynamics of static images enables emotional attribution. Perception, 34, 9, 1107-116.","paperID":"None"},{"content":"Esben W. Pedersen, Sriram Subramanian, and Kasper Hornbæk. 2014. Is my phone alive?: A large-scale study of shape change in handheld devices using videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2579- 2588.","paperID":"None"},{"content":"Ivan Poupyrev, Tatsushi Nashida, Shigeaki Maruyama, Jun Rekimoto, and Yasufumi Yamaji. 2004. Lumen: Interactive visual and shape display for calm computing. In ACM SIGGRAPH'04 Emerging Technologies. ACM, 17.","paperID":"None"},{"content":"Majken Kirkegaard Rasmussen, Erik Grönvall, Sofie Kinch, and Marianne G. Petersen. 2013. It's alive, it's magic, it's in love with you: Opportunities, challenges and open questions for actuated interfaces. In Proceedings of OzCHI '13: Augmentation, Application, Innovation, Collaboration. ACM, 63-72.","paperID":"None"},{"content":"Majken K Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shapechanging interfaces: A review of the design space and open research questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 735-744.","paperID":"None"},{"content":"Christian Rendl, David Kim, Sean Fanello, Patrick Parzer, Christoph Rhemann, Jonathan Taylor, Martin Zirkl, Gregor Scheipl, Thomas Rothländer, Michael Haller, and others. 2014. FlexSense: A transparent self-sensing deformable surface. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, 129-138.","paperID":"None"},{"content":"Stefan Rosenträger. 2008. Emoticons as a new means of communication in Italy and Germany. University of Bologna.","paperID":"None"},{"content":"Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: Toward high shape resolution in self-actuated flexible mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 593-602.","paperID":"None"},{"content":"Loy Rovers and Harm A. van Essen. 2004. HIM: a framework for haptic instant messaging. In CHI'04 Extended Abstracts on Human Factors in Computing Systems. ACM, 1313-1316.","paperID":"None"},{"content":"Loy Rovers and Harm A. van Essen. 2004. Design and evaluation of hapticons for enriched instant messaging. Virtual Reality 9, 177-191.","paperID":"None"},{"content":"James A. Russell. 1980. A circumplex model of affect. Journal of Personality and Social Psychology 39, 6, 1161.","paperID":"None"},{"content":"Carsten Schwesig, Ivan Poupyrev, and Eijiro Mori. 2004. Gummi: A bendable computer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 263-270.","paperID":"None"},{"content":"Jürgen Steimle, Andreas Jordt, and Pattie Maes. 2013. Flexpad: Highly flexible bending interactions for projected handheld displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 237-246.","paperID":"None"},{"content":"Sabine Stepper and Fritz Strack. 1993. Proprioceptive determinants of emotional and non-emotional feelings. Journal of Personality and Social Psychology 64, 2, 211.","paperID":"None"},{"content":"Fritz Strack, Leonard L. Martin, and Sabine Stepper. 1988. Inhibiting and facilitating conditions of the human smile: a non-obtrusive test of the facial feedback hypothesis. Journal of Personality and Social Psychology 54, 5, 768.","paperID":"None"},{"content":"Paul Strohmeier and Ike Kamphof. 2014. Mediated Touch: Exploring embodied design for remote presence. In Proceedings of the International Society for Presence Research, 131-140.","paperID":"None"},{"content":"Aneesh Tarun, Peng Wang, Paul Strohmeier, Audrey Girouard, Derek Reilly, and Roel Vertegaal. 2013. PaperTab: Tablets as thin and flexible as paper. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 2881-2882.","paperID":"None"},{"content":"Frank Thomas and Ollie Johnston. 1995. The illusion of life: Disney animation. Hyperion, NY.","paperID":"None"},{"content":"Chad C. Tossell, Philip Kortum, Clayton Shepard, Laura H. Barg-Walkow, Ahmad Rahmati and Lin Zhong. 2012. A longitudinal study of emoticon use in text messaging from smartphones. Computers in Human Behavior 28, 2, 659-663.","paperID":"None"},{"content":"Terence J Turner and Andrew Ortony. 1992. Basic emotions: can conflicting criteria converge? Psychological Review 99, 3, 566-571.","paperID":"None"},{"content":"Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defined gestures for surface computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1083-1092.","paperID":"None"}],"abstract":"In this paper, we explore how shape changing interfaces might be used to communicate emotions. We present two studies, one that investigates which shapes users might create with a 2D flexible surface, and one that studies the efficacy of the resulting shapes in conveying a set of basic emotions. Results suggest that shape parameters are correlated to the positive or negative character of an emotion, while parameters related to movement are correlated with arousal level. In several cases, symbolic shape expressions based on clear visual metaphors were used. Results from our second experiment suggest participants were able to recognize emotions given a shape with a good accuracy within 28% of the dimensions of the Circumplex Model. We conclude that shape and shape changes of a 2D flexible surface indeed appear able to convey emotions in a way that is worthy of future exploration.","title":"An Evaluation of Shape Changes for Conveying Emotions","filename":"CHI16/p3781","authors":["Paul Strohmeier","Juan Pablo Carrascal","Bernard Cheng","Margaret Meban","Roel Vertegaal"],"conference":"CHI '16"}