{"paperId":2858287,"abstract":"We use design research to explore ways in which tangible and embodied interaction can be used to create novel experiences of heritage. We identified five design principles and used them to frame the challenge. In collaboration with curators, we co-created an interactive multi-narrative soundscape for the remains of trenches and a fortified camp from World War I. The soundscape is activated by presence and the use of a bespoke device. The design intertwines technology and historical content in context to augment the visitors' experience of the place in an evocative, personal way. The field trial showed that experimenting with different forms is key, as they have an impact on visitors' expectations beyond what they experience directly. It also showed the value in simultaneously designing interaction and content to achieve an effect that goes beyond the contribution of the single components.","citation":[],"reference":[{"content":"Johnson, L., Adams Becker, S., Estrada, V., and Freeman, A. 2015. NMC Horizon Report: 2015 Museum Edition. Austin, TX: The New Media Consortium. Retrieved September 22, 2015 from http://www.nmc.org/publication/nmc-horizon-report2015-museum-edition/","paperID":"None"},{"content":"B. Bonis, J. Stamos, S. Vosinakis, I. Andreou, T. Panayiotopoulos. 2009. A platform for virtual museums with personalized content. Journal of Multimedia Tools and Applications. 42,2: 139--159.","paperID":"None"},{"content":"Luigina Ciolfi and Marc McLoughlin. 2012. Of Turf Fires, Fine Linen and Porter Cake: Design for Living History, ACM Interactions, XIX.5 September + October, 18--21.","paperID":"None"},{"content":"Luigina Ciolfi, Daniela Petrelli, Robin Goldberg, Nick Dulake, Matt Willox, Mark T. Marshall and Fabio Caparrelli. 2013. Exploring historical, social and natural heritage: Challenges for tangible interaction design at Sheffield General Cemetery, Proceedings of Design & Digital Heritage conference (NODEM 2013), Stockholm December 2013","paperID":"None"},{"content":"Areti Damala, Pierre Cubaud, Anne Bationo, Pascal Houlier, Isabelle Marchal. 2008. Bridging the Gap between the Digital and the Physical: Design and Evaluation of a Mobile Augmented Reality Guide for the Museum Visit. Proc. of Digital Interactive Media in Entertertainment and Arts (DIMEA 2008), 120--127.","paperID":"None"},{"content":"Betty Davidson, Candace Lee Heald and George Hein, 1991. Increased exhibit accessibility through multisensory interaction. Curator -- The Museum Journal. 34, 4: 273--290.","paperID":"None"},{"content":"Sandra Dudley. 2010. Museum materialities: Objects, sense and feeling. In Dudley, S. (ed.) Museum Materialities: Objects, Engagements, Interpretations. Routledge, UK, 1--18.","paperID":"None"},{"content":"John Falk. 2009. Identity and the museum visitor experience. Left Coast Press.","paperID":"None"},{"content":"John Falk. 2011. Contextualizing Falk's Identity Related Visitor Motivational Model. Visitors Studies. 14, 2, 141--157.","paperID":"None"},{"content":"Lesley Fosh, Steve Benford, Stuart Reeves, Boriana Koleva and Patrick Brundell. 2013. 'See Me, Feel Me, Touch Me, Hear Me': Trajectories and Interpretations in a Sculpture Garden. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 149--158.","paperID":"None"},{"content":"Gallery One, Cleveland Museum of Art. 2013. Video. (7 March 2013.). Retrieved September 22, 2015 from https://www.youtube.com/watch?v=qWJqd6lyJ-E","paperID":"None"},{"content":"Adrian Hazzard, Steve Benford and Gary Burnett. 2015 Sculpting a mobile music soundtrack. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 387--396.","paperID":"None"},{"content":"Christian Heath, Dirk Vom Lehn and Jonathan Osborne. 2005 Interaction and interactives: collaboration and participation with computer-based exhibits. Public Understanding of Science. 14, 1: 91101.","paperID":"None"},{"content":"Nuala Hancock. 2010. Virginia Wolf's glasses: material encounters in the literary/artistic house museum. In Dudley, S. (ed.) Museum Materialities: Objects, Engagements, Interpretations. Routledge, UK, 114--127.","paperID":"None"},{"content":"Eilean Hooper-Greenhill. 1994. Museums and their visitors. Routledge, UK","paperID":"None"},{"content":"Eva Hornecker. 2008. \"I don't understand it either but it's cool\" -- Visitor Interactions with a Multi-touch Table in a Museum. Proc. of IEEE Tabletop, 121--128.","paperID":"None"},{"content":"Stephen Kaplan, Lisa V. Bardwell and Deborah B. Slakter. 1993. The Museum as a restorative environment. Environment and Behaviour. 26, 6:725742.","paperID":"None"},{"content":"Ilpo Koskinen, John Zimmerman, Thomas Binder, Johan Redström and Stephan Wensveen. 2011. Design Research Through Practice -- From the Lab, Field, and Showroom. Morgan Kaufmann.","paperID":"None"},{"content":"Mike Kuniavsky. 2010. Smart Things -- Ubiquitous Computing User Experience Design. Morgan Kaufmann.","paperID":"None"},{"content":"Esko Kurvinen, Ilpo Koskinen and Katja Battarbee. 2008. Prototyping Social Interaction. Design Issues. 23, 3: 46--57.","paperID":"None"},{"content":"Jonas Löwgren and Erik Stolterman. 2004. Thoughtful Interaction Design -- A Design Perspective on Information Technology. MIT Press.","paperID":"None"},{"content":"Mark Leslie. 2011. Applying basic design principles to technology in museums. Proc. of 2nd Conference on Rethinking Technology in Museums -- Emerging Experiences.","paperID":"None"},{"content":"Mark T. Marshall, Daniela Petrelli, Nick Dulake, Elena Not, Michele Marchesoni, Elisa Trenti and Anna Pisetti. 2016. Audio-based narratives for the Trenches of World War I : intertwining stories, places and interaction for an evocative experience. International Journal of Human-Computer Studies, special issue on Data Sonification and Sound Design in Interactive Systems, 85, 27--39.","paperID":"None"},{"content":"Mark T. Marshall, Nick Dulake, Luigina Ciolfi, Daniele Duranti, Hub Kockelkorn and Daniela Petrelli. 2016 Using Tangible Smart Replicas as Controls for an Interactive Museum Exhibition. Proceedings of Tangible, Embedded and Embodied Interaction (TEI'16).","paperID":"None"},{"content":"David Martin. 2000. Audio Guides. Museum Practice, 5, 1: 71--81.","paperID":"None"},{"content":"David McGookin, Yolanda Vazquez-Alvarez, Stephen Brewster and Joanna Bergstorm-Lehtovirta. 2012 Shaking the Dead: Multimodal Location Based for UnStewarded Archaeological Sites. Proc. of the 7th Nordic Conference on Human-Computer Interaction (NordiCHI'12).","paperID":"None"},{"content":"Jan Packer and Nigel Bond. 2010. Museums as Restorative Environments. Curator -- The Museum Journal. 53, 4: 421--436.","paperID":"None"},{"content":"Daniela Petrelli, Luigina Ciolfi, Dick van Dijk, Eva Hornecker, Elena Not, Albrecht Schmidt. 2013. Integrating Material and Digital: A New Way for Cultural Heritage. ACM Interactions, July + August.","paperID":"None"},{"content":"Daniela Petrelli, Nick Dulake, Mark Marshall, Robin Goldberg, Matt Willox and Fabio Caparrelli. 2014 Prototyping tangibles: Exploring form and interaction. Proc. of the Conference on Tangible, Embedded and Embodied Interaction (TEI'14).","paperID":"None"},{"content":"Daniela Petrelli and Elena Not. 2005 User-centred design of flexible hypermedia for a museum guide: reflections on the Hyper-Audio experience. User Modelling and User Adapted Interaction, 15: 303--338.","paperID":"None"},{"content":"Susan Reilly and Daniela Petrelli. 2008. Engaging with Books You Cannot Touch: Interactive Multimedia to Explore Library Treasures. Co-Design. 3, 1: 199--210.","paperID":"None"},{"content":"Cody Sandifer 2003. Technological novelty and openendedness: Two characteristics of interactive exhibits that contribute to the holding of visitor attention in a science museum. Journal of Research in Science Teaching. 40, 2: 121--137.","paperID":"None"},{"content":"Beverly Serrell. 1997. Paying attention: The duration and allocation of visitors' time in museum exhibitions. Curator -- The Museum Journal. 40, 2: 109--125.","paperID":"None"},{"content":"Beverly Serrell and Britt Raphling. 1992 Computers on the Exhibit Floor. Curator -- The Museum Journal, 35, 3: 181--189.","paperID":"None"},{"content":"Lois H. Silverman. 1995. Visitors Meaning-Making in Museums for a New Age. Curator -- The Museum Journal.38, 3: 161--170.","paperID":"None"},{"content":"Smithsonian Institution. 2002. The Making of Exhibitions: Purpose, Structure, Roles and Process. Report (October 2002.). Retrieved September 22, 2015 http://www.si.edu/Content/opanda/docs/Rpts2002/02.10.MakingExhibitions.Final.pdf","paperID":"None"},{"content":"Margaret H. Szymanski, Paul M. Aoki, Rebecca E. Grinter, Amy Hurst, James Thornton, and Alison Woodruff. 2007. Sotto Voce: Facilitating Social Learning in a Historic House. Computer Supported Cooperative Work, 17: 5--34.","paperID":"None"},{"content":"Bradley L. Taylor. 2010. Reconsidering Digital Surrogates. In Dudley S. (ed.) Museum Materialities Objects, Engagements, Interpretations, Routledge, UK, 175--184.","paperID":"None"},{"content":"Peter Tolmie, Steve Benford, Chris Greenhalgh, Tom Rodden, Stuart Reeves. 2014. Supporting Group Interaction in Museum Visiting. Proc. of Computer Supported Cooperative Work (CSCW '14), 1049--1059.","paperID":"None"},{"content":"Tessa J. van Schijndel, Rooske K. Franse and Maartje E. J. Raijmakers. 2010. The exploratory behaviour scale: Assessing young visitors' hands-on behaviour in science museums. Science Education. 94,5: 794--809.","paperID":"None"},{"content":"Dirk vom Lehn and Christian Heath. 2003. Displacing the object: mobile technology and interpretive resources. Proc. of Cultural Institution and Digital Technology. http://www.archimuse.com/publishing/ichim03/088C.pdf","paperID":"None"},{"content":"Dirk vom Lehn, Jon Hindmarsh, Paul Luff, Christian Heath. 2007. Engaging Constable: Revealing art with new technology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 1485--1494.","paperID":"None"},{"content":"Ron Wakkary and Marek Hatala. 2007. Situated play in a tangible interface and adaptive audio museum guide. Personal and Ubiquitous Computing, 11: 171--191.","paperID":"None"},{"content":"Ron Wakkary, Kevin Muise, Karen Tenenbaum, and Marek Hatala. 2007 Situating Approaches to Museum Guides for Families and Groups.","paperID":"None"},{"content":"Kirsten Wehner and Martha Sear. 2010. Engaging the material world: object knowledge and Australian Journeys. In Dudley S. (ed.) Museum Materialities -- Objects, Engagement, Interpretations, Routledge,143161.","paperID":"None"},{"content":"Andreas Zimmermann and Andras Lorenz. 2008 LISTEN: A User-Adaptive Audio-Augmented Museum Guide. UMUAI - User Modeling and User-Adapted Interaction, 18: 389--416.","paperID":"None"},{"content":"Robyn Taylor, John Bowers, Bettina Nissen, Gavin Wood, Peter Wright, Qasim Chaudhry, Lindsey Bruce, Sarah Glynn, Helen Mallinson and Roy Bearpark. 2015. Making Magic: Designing for Open Interactions in Museum Settings. In Proceedings of the Conference on Creativity and Cognition (C&C '15). 313--322.","paperID":"None"}],"title":"Voices from the War: Design as a Means of Understanding the Experience of Visiting Heritage","filename":"CHI16/p1033","authors":["Daniela Petrelli","Nick Dulake","Mark T. Marshall","Anna Pisetti","Elena Not"],"conference":"CHI '16"}