{"paperId":2858256,"citation":[],"reference":[{"content":"Halda Space Discovery Watch, http://www.ablogtowatch.com/halda-space-discovery-watch-review/","paperID":"None"},{"content":"Jaeger LeCoultre Reverso Watches, http://www.jaeger-lecoultre.com/US/en/collections/reverso","paperID":"None"},{"content":"Piaget Altiplano Double Jeu Watch, http://www.piaget.com/watches/rose-gold-ultra-thin-mechanical-watch-g0a35153","paperID":"None"},{"content":"Porsche's P'6520 Heritage Compass Watch, http://www.ablogtowatch.com/porsche-design-p6520-heritage-compass-watch-hands-on/","paperID":"None"},{"content":"Ritmo Mundo Persepolis, http://www.wristwatchreview.com/2012/04/05/review-ritmo-mundo-persepolis-part-1/","paperID":"None"},{"content":"Titanium Two Face watch, http://shop.nordstrom.com/s/titanium-two-face-watch-20mm-juniors/3384115","paperID":"None"},{"content":"Daniel Ashbrook, Kent Lyons, and Thad Starner. 2008. An investigation into round touchscreen wristwatch interaction. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services (MobileHCI '08). ACM, NY, NY, USA, 311--314. DOI=10.1145/1409240.1409276 http://doi.acm.org/10.1145/1409240.1409276","paperID":"None"},{"content":"Gabor Blasko and Steven Feiner. 2004. An Interaction System for Watch Computers Using Tactile Guidance and Bidirectional Segmented Strokes. In Proceedings of the Eighth International Symposium on Wearable Computers (ISWC '04). IEEE Computer Society, Washington, DC, USA, 120--123. DOI=10.1109/ISWC.2004.6 http://dx.doi.org/10.1109/ISWC.2004.6","paperID":"None"},{"content":"Gabor Blasko, Chandra Narayanaswami, and Steven Feiner. 2006. Prototyping retractable string-based interaction techniques for dual-display mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (Eds.). ACM, NY, NY, USA, 369--372. DOI=10.1145/1124772.1124827 http://doi.acm.org/10.1145/1124772.1124827","paperID":"None"},{"content":"Jesse Burstyn, Paul Strohmeier, and Roel Vertegaal. 2015. DisplaySkin: Exploring Pose-Aware Displays on a Flexible Electrophoretic Wristband. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, NY, NY, USA, 165--172. DOI=1145/2677199.2680596 http://doi.acm.org/10.1145/2677199.2680596","paperID":"None"},{"content":"Ron Van Buskirk and Mary LaLomia. 1995. A comparison of speech and mouse/keyboard GUI navigation. In Conference Companion on Human Factors in Computing Systems (CHI '95), I. Katz, R. Mack, and L. Marks (Eds.). ACM, NY, NY, USA, 96-. DOI=10.1145/223355.223447 http://doi.acm.org/10.1145/223355.223447","paperID":"None"},{"content":"Ke-Yu Chen, Kent Lyons, Sean White, and Shwetak Patel. 2013. uTrack: 3D input using two magnetic sensors. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, NY, NY, USA, 237--244. DOI=10.1145/2501988.2502035 http://doi.acm.org/10.1145/2501988.2502035","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Tovi Grossman, and George Fitzmaurice. 2014. Swipeboard: a text entry technique for ultra-small interfaces that supports novice to expert transitions. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, NY, NY, USA, 615--620. DOI=10.1145/2642918.2647354 http://doi.acm.org/10.1145/2642918.2647354","paperID":"None"},{"content":"Xiang 'Anthony' Chen, Tovi Grossman, Daniel J. Wigdor, and George Fitzmaurice. 20 Duet: exploring joint interactions on a smart phone and a smart watch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 159--168. DOI=10.1145/2556288.2556955 http://doi.acm.org/10.1145/2556288.2556955","paperID":"None"},{"content":"Antonio Gomes and Roel Vertegaal. 20 PaperFold: Evaluating Shape Changes for Viewport Transformations in Foldable Thin-Film Display Devices. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, NY, NY, USA, 153--160. DOI=10.1145/2677199.2680572 http://doi.acm.org/10.1145/2677199.2680572","paperID":"None"},{"content":"Chris Harrison and Scott E. Hudson. 2009. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09). ACM, NY, NY, USA, 121--124. DOI=10.1145/1622176.1622199 http://doi.acm.org/10.1145/1622176.1622199","paperID":"None"},{"content":"Ken Hinckley, Morgan Dixon, Raman Sarin, Francois Guimbretiere, and Ravin Balakrishnan. 2009. Codex: a dual screen tablet computer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1933--1942. DOI=10.1145/1518701.1518996 http://doi.acm.org/10.1145/1518701.1518996","paperID":"None"},{"content":"Da-Yuan Huang, Ming-Chang Tsai, Ying-Chao Tung, Min-Lun Tsai, Yen-Ting Yeh, Liwei Chan, Yi-Ping Hung, and Mike Y. Chen. 2014. TouchSense: expanding touchscreen input vocabulary using different areas of users' finger pads. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 189--192. DOI=10.1145/2556288.2557258 http://doi.acm.org/10.1145/2556288.2557258","paperID":"None"},{"content":"Jungsoo Kim, Jiasheng He, Kent Lyons, and Thad Starner. 2007. The Gesture Watch: A Wireless Contact-free Gesture based Wrist Interface. In Proceedings of the 2007 11th IEEE International Symposium on Wearable Computers (ISWC '07). IEEE Computer Society, Washington, DC, USA, 1--8. DOI=10.1109/ISWC.2007.4373770 http://dx.doi.org/10.1109/ISWC.2007.4373770","paperID":"None"},{"content":"Gierad Laput, Robert Xiao, Xiang 'Anthony' Chen, Scott E. Hudson, and Chris Harrison. 2014. Skin buttons: cheap, small, low-powered and clickable fixed-icon laser projectors. InProceedings of the 27th annual ACM symposium on User interface software and technology(UIST '14). ACM, NY, NY, USA, 389--394. DOI=10.1145/2642918.2647356 http://doi.acm.org/10.1145/2642918.2647356","paperID":"None"},{"content":"Kent Lyons, David Nguyen, Daniel Ashbrook, and Sean White. 2012. Facet: a multi-segment wrist worn system. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, NY, NY, USA, 123--130. DOI=10.1145/2380116.2380134 http://doi.acm.org/10.1145/2380116.2380134","paperID":"None"},{"content":"David Merrill, Jeevan Kalanithi, and Pattie Maes. 2007. Siftables: towards sensor network user interfaces. In Proceedings of the 1st international conference on Tangible and embedded interaction (TEI '07). ACM, NY, NY, USA, 75--78. DOI=10.1145/1226969.1226984 http://doi.acm.org/10.1145/1226969.1226984","paperID":"None"},{"content":"Ian Oakley and Doyoung Lee. 2014. Interaction on the edge: offset sensing for small devices. InProceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 169--178. DOI=10.1145/2556288.2557138 http://doi.acm.org/10.1145/2556288.2557138","paperID":"None"},{"content":"Simon Olberding, Kian Peen Yeo, Suranga Nanayakkara, and Jurgen Steimle. 2013. Augmented Forearm: exploring the design space of a display-enhanced forearm. In Proceedings of the 4th Augmented Human International Conference (AH '13). ACM, NY, NY, USA, 9--12. DOI=10.1145/2459236.2459239 http://doi.acm.org/10.1145/2459236.2459239","paperID":"None"},{"content":"Stephen Oney, Chris Harrison, Amy Ogan, and Jason Wiese. 2013. Zoom Board: a diminutive qwerty soft keyboard using iterative zooming for ultra-small devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2799--2802. DOI=10.1145/2470654.2481387 http://doi.acm.org/10.1145/2470654.2481387","paperID":"None"},{"content":"Jerome Pasquero, Scott J. Stobbe, and Noel Stonehouse. 2011. A haptic wristwatch for eyes-free interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI '11). ACM, NY, NY, USA, 3257--3266. DOI=10.1145/1978942.1979425 http://doi.acm.org/10.1145/1978942.1979425","paperID":"None"},{"content":"Simon T. Perrault, Eric Lecolinet, James Eagan, and Yves Guiard. 2013. Watchit: simple gestures and eyes-free interaction for wristwatches and bracelets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1451--1460. DOI=10.1145/2470654.2466192 http://doi.acm.org/10.1145/2470654.2466192","paperID":"None"},{"content":"Norman Pohl, Steve Hodges, John Helmes, Nicolas Villar, and Tim Paek. 2013. An interactive belt-worn badge with a retractable string-based input mechanism. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1465--1468. DOI=10.1145/2470654.2466194 http://doi.acm.org/10.1145/2470654.2466194","paperID":"None"},{"content":"Raf Ramakers, Johannes Schöning, and Kris Luyten. 2014. Paddle: highly deformable mobile devices with physical controls. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 191--192. DOI=10.1145/2559206.2579524 http://doi.acm.org/10.1145/2559206.2579524","paperID":"None"},{"content":"Jun Rekimoto. 2001. GestureWrist and GesturePad: Unobtrusive Wearable Interaction Devices. InProceedings of the 5th IEEE International Symposium on Wearable Computers (ISWC '01). IEEE Computer Society, Washington, DC, USA, 21-.","paperID":"None"},{"content":"Katie A. Siek, Yvonne Rogers, and Kay H. Connelly. 2005. Fat finger worries: how older and younger users physically interact with PDAs. In Proceedings of the 2005 IFIP TC13 international conference on Human-Computer Interaction (INTERACT'05), Maria Francesca Costabile and Fabio Paternò (Eds.). Springer-Verlag, Berlin, Heidelberg, 267--280. DOI=10.1007/11555261_24 http://dx.doi.org/10.1007/11555261_24","paperID":"None"},{"content":"Robert Xiao, Gierad Laput, and Chris Harrison. 2014. Expanding the input expressivity of smartwatches with mechanical pan, twist, tilt and click. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 193--196. DOI=10.1145/2556288.2557017 http://doi.acm.org/10.1145/2556288.2557017","paperID":"None"},{"content":"Cheng Xu and Kent Lyons. 2015. Shimmering Smartwatches: Exploring the Smartwatch Design Space. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, NY, NY, USA, 69--76. DOI=10.1145/2677199.2680599 http://doi.acm.org/10.1145/2677199.2680599","paperID":"None"}],"abstract":"Doppio is a reconfigurable smartwatch with two touch sensitive display faces. The orientation of the top relative to the base and how the top is attached to the base, creates a very large interaction space. We define and enumerate possible configurations, transitions, and manipulations in this space. Using a passive prototype, we conduct an exploratory study to probe how people might use this style of smartwatch interaction. With an instrumented prototype, we conduct a controlled experiment to evaluate the transition times between configurations and subjective preferences. We use the combined results of these two studies to generate a set of characteristics and design considerations for applying this interaction space to smartwatch applications. These considerations are illustrated with a proof-of-concept hardware prototype demonstrating how Doppio interactions can be used for notifications, private viewing, task switching, temporary information access, application launching, application modes, input, and sharing the top.","title":"Doppio: A Reconfigurable Dual-Face Smartwatch for Tangible Interaction","filename":"CHI16/p4675","authors":["Teddy Seyed","Xing-Dong Yang","Daniel Vogel"],"conference":"CHI '16"}