{"paperId":2858517,"citation":[],"reference":[{"content":"Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2009. Analysis of text entry performance metrics. In 2009 IEEE Toronto International Conference Science and Technology for Humanity (TIC-STH). IEEE, 100-105. DOI: http://dx.doi.org/10.1109/TIC-STH.2009.5444533","paperID":"None"},{"content":"Stuart K. Card, Allen Newell, and Thomas P. Moran. 1983. The Psychology of Human-Computer Interaction. L. Erlbaum Associates Inc., Hillsdale, NJ, USA.","paperID":"None"},{"content":"Frank E. Ritter; Gordon D. Baxter; Elizabeth F. Churchill. 2014. Foundations for Designing User-Centered Systems: What System Designers Need to Know about People. Springer Publishing Company, Incorporated. 442 pages.","paperID":"None"},{"content":"John Paulin Hansen, Kristian Tørning, Anders Sewerin Johansen, Kenji Itoh, and Hirotaka Aoki. 2004. Gaze typing compared with input by head and hand. In Proceedings of the 2004 symposium on Eye Tracking Research & Applications (ETRA '04). ACM, NY, NY, USA, 131-138. DOI: http://dx.doi.org/10.1145/968363.968389","paperID":"None"},{"content":"Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, 139 - 183. DOI: http://dx.doi.org/10.1016/S0166--4115(08)62386--9","paperID":"None"},{"content":"Anke Huckauf and Mario H. Urbina. 2008. Gazing with pEYEs: towards a universal input for various applications. In Proceedings of the 2008 symposium on Eye tracking research & applications (ETRA '08). ACM, NY, NY, USA, 51-54. DOI: http://dx.doi.org/10.1145/1344471.1344483","paperID":"None"},{"content":"Kenji Itoh, Hirotaka Aoki, and John Paulin Hansen. 2006. A Comparative Usability Study of Two Japanese Gaze Typing Systems. In Proceedings of the 2006 Symposium on Eye Tracking Research & Applications (ETRA '06). ACM, NY, NY, USA, 59-66. DOI: http://dx.doi.org/10.1145/1117309.1117344","paperID":"None"},{"content":"H.H. Koester and S.P. Levine. 1994. Modeling the speed of text entry with a word prediction interface. Rehabilitation Engineering, IEEE Transactions on 2, 3 (Sep 1994), 177-187. DOI: http://dx.doi.org/10.1109/86.331567","paperID":"None"},{"content":"T.K. Landauer. 1987. Relations between cognitive psychology and computer systems design. (1987).","paperID":"None"},{"content":"I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, NY, NY, USA, 754-755. DOI: http://dx.doi.org/10.1145/765891.765971","paperID":"None"},{"content":"I. Scott MacKenzie and Xuang Zhang. 2008. Eye typing using word and letter prediction and a fixation algorithm. In Proceedings of the 2008 symposium on Eye tracking research & applications (ETRA '08). ACM, NY, NY, USA, 55-58. DOI: http://dx.doi.org/10.1145/1344471.1344484","paperID":"None"},{"content":"Paivi Majaranta. 2009. Text Entry by Eye Gaze. Ph.D. Dissertation. University of Tampere, Dept. of Computer Science, Tampere, Finland.","paperID":"None"},{"content":"Paivi Majaranta, Ulla-Kaija Ahola, and Oleg Spakov. 2009. Fast gaze typing with an adjustable dwell time. In Proceedings of the 27th international conference on Human factors in computing systems (CHI '09). ACM, NY, NY, USA, 357-360. DOI: http://dx.doi.org/10.1145/1518701.1518758","paperID":"None"},{"content":"Paivi Majaranta, Hirotaka Aoki, Mick Donegan, Dan Witzner Hansen, and John Paulin Hansen. 2011. Gaze Interaction and Applications of Eye Tracking: Advances in Assistive Technologies (1st ed.). Information Science Reference Imprint of: IGI Publishing, Hershey, PA.","paperID":"None"},{"content":"Paivi Majaranta, Scott MacKenzie, Anne Aula, and Kari-Jouko Raiha. 2006. Effects of feedback and dwell time on eye typing speed and accuracy. Univers. Access Inf. Soc. 5, 2 (July 2006), 199-208. DOI: http://dx.doi.org/10.1007/s10209-006-0034-z","paperID":"None"},{"content":"Paivi Majaranta and Kari-Jouko Raiha. 2002. Twenty years of eye typing: systems and design issues. In Proceedings of the 2002 symposium on Eye tracking research & applications (ETRA '02). ACM, NY, NY, USA, 15-22. DOI: http://dx.doi.org/10.1145/507072.507076","paperID":"None"},{"content":"Carlos H. Morimoto and Arnon Amir. 2010. Context switching for fast key selection in text entry applications. In Proceedings of the 2010 Symposium on Eye-Tracking Research & Applications (ETRA '10). ACM, NY, NY, USA, 271-274. DOI: http://dx.doi.org/10.1145/1743666.1743730","paperID":"None"},{"content":"Marco Porta, Alice Ravarelli, and Giovanni Spagnoli. 2010. ceCursor, a Contextual Eye Cursor for General Pointing in Windows Environments. In Proceedings of the 2010 Symposium on Eye-Tracking Research & Applications (ETRA '10). ACM, NY, NY, USA, 331-337. DOI: http://dx.doi.org/10.1145/1743666.1743741","paperID":"None"},{"content":"Samuel Pouplin, Johanna Robertson, Jean-Yves Antoine, Antoine Blanchet, Jean Loup Kahloun, Philippe Volle, Justine Bouteille, Frederic Lofaso, and Djamel Bensmail. 2014. Effect of dynamic keyboard and word-prediction systems on text input speed in persons with functional tetraplegia. Journal of rehabilitation research and development 51, 3 (2014), 467-79. DOI: http://dx.doi.org/10.1682/JRRD.2012.05.0094","paperID":"None"},{"content":"Kari-Jouko Raiha and Saila Ovaska. 2012. An exploratory study of eye typing fundamentals: dwell time, text entry rate, errors, and workload. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 3001-3010. DOI: http://dx.doi.org/10.1145/2208636.2208711","paperID":"None"},{"content":"Daniel Rough, Keith Vertanen, and Per Ola Kristensson. 2014. An Evaluation of Dasher with a High-performance Language Model As a Gaze Communication Method. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, NY, NY, USA, 169-176. DOI: http://dx.doi.org/10.1145/2598153.2598157","paperID":"None"},{"content":"Timothy a. Salthouse. 1986. Perceptual, cognitive, and motoric aspects of transcription typing. Psychological Bulletin 99, 3 (1986), 303-319. DOI: http://dx.doi.org/10.1037//0033--2909.99.3.303","paperID":"None"},{"content":"Elizabeth R. Schotter, Bernhard Angele, and Keith Rayner. 2012. Parafoveal processing in reading. Attention, Perception, & Psychophysics 74, 1 (2012), 5-35. DOI: http://dx.doi.org/10.3758/s13414-011-0219--2","paperID":"None"},{"content":"R. William Soukoreff and I. Scott MacKenzie. 2001. Measuring Errors in Text Entry Tasks: An Application of the Levenshtein String Distance Statistic. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, NY, NY, USA, 319-320. DOI: http://dx.doi.org/10.1145/634067.634256","paperID":"None"},{"content":"Keith Trnka, John McCaw, Debra Yarrington, Kathleen F. McCoy, and Christopher Pennington. 2009. User Interaction with Word Prediction: The Effects of Prediction Quality. ACM Trans. Access. Comput. 1, 3, Article 17 (Feb. 2009), 34 pages. DOI: http://dx.doi.org/10.1145/1497302.1497307","paperID":"None"},{"content":"Outi Tuisku, Paivi Majaranta, Poika Isokoski, and Kari-Jouko Raiha. 2008. Now Dasher! Dash Away!: Longitudinal Study of Fast Text Entry by Eye Gaze. In Proceedings of the 2008 Symposium on Eye Tracking Research & Applications (ETRA '08). ACM, NY, NY, USA, 19-26. DOI: http://dx.doi.org/10.1145/1344471.1344476","paperID":"None"},{"content":"Mario H. Urbina and Anke Huckauf. 2010. Alternatives to single character entry and dwell time selection on eye typing. In Proceedings of the 2010 Symposium on Eye-Tracking Research & Applications (ETRA '10). ACM, NY, NY, USA, 315-322. DOI: http://dx.doi.org/10.1145/1743666.1743738","paperID":"None"},{"content":"Matteo Vescovi. 2004. Soothsayer: un sistema multi-sorgente per la predizione del testo. Master's thesis. Politecnico di Milano, Dipartimento di elettronica e informazione.","paperID":"None"},{"content":"Oleg Spakov. 2013. Previewable scrolling by gaze. In Book of Abstracts of the 17th European Conference on Eye Movements, Vol. 6. K. Holmqvist, F. Mulvey & R. Johansson (Eds.), 469.","paperID":"None"},{"content":"David J. Ward and David J. C. MacKay. 2002. Fast Hands-free Writing by Gaze Direction. Nature 418, 6900 (2002), 838.","paperID":"None"},{"content":"Jacob O. Wobbrock, James Rubinstein, Michael W. Sawyer, and Andrew T. Duchowski. 2008. Longitudinal evaluation of discrete consecutive gaze gestures for text entry. In Proceedings of the 2008 symposium on Eye Tracking Research & Applications (ETRA '08). ACM, NY, NY, USA, 11-18. DOI: http://dx.doi.org/10.1145/1344471.1344475","paperID":"None"}],"abstract":"Eye-typing is an important tool for people with physical disabilities and, for some, it is their main form of communication. By observing expert typists using physical keyboards, we notice that visual throughput is considerably reduced in current eye-typing solutions. We propose AugKey to improve throughput by augmenting keys with a prefix, to allow continuous text inspection, and suffixes to speed up typing with word prediction. AugKey limits the visual information to the foveal region to minimize eye movements (i.e., reduce eye work). We have applied AugKey to a dwell-time keyboard and compared its performance with two conditions with no augmented feedback: a keyboard with and one without word prediction. Results show that AugKey can be about 28% faster than no word prediction and 20% faster than traditional word prediction, with a smaller workload index.","title":"AugKey: Increasing Foveal Throughput in Eye Typing with Augmented Keys","filename":"CHI16/p3533","authors":["Antonio Diaz-Tula","Carlos H. Morimoto"],"conference":"CHI '16"}