{"paperId":2858110,"citation":[],"abstract":"Crowdfunding, the practice of funding a project by soliciting donations via the internet, allows organizations and individuals alike to raise funds for a variety of causes. In this paper, we present the results of a study of philanthropic crowdfunding, aimed at understanding some of the practices and needs associated with raising money for charitable causes. Our analysis highlights the diversity of stakeholders and roles in philanthropic crowdfunding and the immense amount of work associated with legitimizing many of these roles, including the fundraiser, organization, platform, and project. We introduce the construct of legitimacy work and discuss ways in which current crowdfunding systems both support and thwart this work.","reference":[{"content":"Ada Guan, Wes Branch, parents of baby Chloe born on plane, regret seeking $50K. (2015, May 19). Retrieved from: http://www.cbc.ca/news/canada/britishcolumbia/ada-guan-wes-branch-parents-of-baby-chloeborn-on-plane-regret-seeking-50k-1.3077703?cmp=rss","paperID":"None"},{"content":"Aksartova, S. (2003). In search of legitimacy: Peace grant making of US philanthropic foundations, 19881996. Nonprofit and Voluntary Sector Quarterly, 32(1), 25-46.","paperID":"None"},{"content":"Belleflamme, P., Lambert, T. & Schwienbacher, A. (2014). Crowdfunding: Tapping the Right Crowd. Journal of Business Venturing, 29(5), 585-609.","paperID":"None"},{"content":"Benjamin, L.M. & D.C. Campbell. (2014). Programs aren't everything. Stanford Social Innovation Review, Spring, 42-47.","paperID":"None"},{"content":"Bourricaud, F. (1987). Legitimacy and legitimization. Current Sociology, 35(2), 57--67.","paperID":"None"},{"content":"Brown, E. & Ferris, J.M. (2007). Social capital and philanthropy: An analysis of the impact of social capital on individual giving and volunteering. Nonprofit and Voluntary Sector Quarterly, 36(1), 85- 99.","paperID":"None"},{"content":"Brubaker, J. R., Dombrowski, L., Gilbert, A., Kusumakaulika, N. & Hayes, G. R. Stewarding a legacy: Responsibilities and relationships in the management of post-mortem data. In Proc. CHI. NY: ACM Press, 4157-4166.","paperID":"None"},{"content":"Corbin, J. & Strauss, A. (2008). Basics of qualitative research: Techniques and procedures for developing grounded theory (3rd ed.). Los Angeles: Sage.","paperID":"None"},{"content":"Frydrych, D., Bock, A. J., Kinder, T. & Koeck, B. (2014). Exploring entrepreneurial legitimacy in reward-based crowdfunding. Venture Capital, 16(3), 247-269.","paperID":"None"},{"content":"Gasser, L. (1986). The integration of computing and routine work. ACM Transactions on Information Systems, 4(3), 205-225.","paperID":"None"},{"content":"Gerber, E. & Hui, J. (2013). Crowdfunding: Motivations and deterrents for participation. ACM Transactions on Computer-Human Interaction 20(6), Article No. 34.","paperID":"None"},{"content":"Goecks, J., Voida, A., Voida, S. & Mynatt, E.D. (2008). Charitable technologies: Opportunities for collaborative computing in nonprofit fundraising. In Proc. CSCW. NY: ACM Press, 689-698.","paperID":"None"},{"content":"Goffman, E. (1959). The presentation of self in everyday life. NY: Anchor Books.","paperID":"None"},{"content":"Graddy, E. & Wang, L. (2009). Community foundation development and social capital. Nonprofit and Voluntary Sector Quarterly, 38(3), 392-412.","paperID":"None"},{"content":"Greenberg, M. & Gerber, E. (2014). Learning to fail: Experiencing public failure online through crowdfunding. In Proc. CHI. NY: ACM Press, 581-590.","paperID":"None"},{"content":"Grudin, J. (1994). Groupware and social dynamics: Eight challenges for developers. Communications of the ACM, 37(1), 92-105.","paperID":"None"},{"content":"Heydemann, S. & Toepler, S. (2006). Foundations and the challenge of legitimacy in comparative perspective. In K. Prewitt, M. Dogan, S. Heydemann & S. Toepler (Eds.), The Legitimacy of Philanthropic Foundations: USA and European Perspectives (3-26). NY: Russell Sage Foundation.","paperID":"None"},{"content":"Hemer, J. (2011). A snapshot on crowdfunding. Working Papers Firms and Region. No. R2/2011. Retrieved from: http://www.econstor.eu/bitstream/ 10419/52302/1/671522264.pdf","paperID":"None"},{"content":"Hui, J., Greenberg, M. & Gerber, E. (2013). Understanding crowdfunding work: Implications for support tools. In Extended Abstracts of CHI. NY: ACM Press, 889-894.","paperID":"None"},{"content":"Hui, J. S., Greenberg, M. D. & Gerber, E. M. (2014). Understanding the role of community in crowdfunding work. In Proc. CSCW. NY: ACM Press, 62-74.","paperID":"None"},{"content":"Klein, K. (2007). Fundraising for Social Change (5th ed.). San Francisco: Jossey-Bass.","paperID":"None"},{"content":"Kumar, P. & Schoenebeck, S.Y. (2015). The modern day baby book: Enacting good mothering and stewarding privacy on Facebook. In Proc. CSCW. NY: ACM Press, 1302-1312.","paperID":"None"},{"content":"Liu, L.S., Hirano, S. H., Tentori, M., Cheng, K.G., George, S., Park, S.Y. & Hayes, G.R. (2011). Improving communication and social support for caregivers of high-risk infants through mobile technologies. In Proc. CSCW. NY: ACM Press, 475-484.","paperID":"None"},{"content":"Meer, J. (2011). Brother, can you spare a dime? Peer pressure in charitable solicitation. Journal of Public Economics, 95(7--8), 926-941.","paperID":"None"},{"content":"Merkel, C., Farooq, U., Xiao, L., Ganoe, C., Rosson, M. B. & Carroll, J. M. (2007). Managing technology use and learning in nonprofit community organizations: methodological challenges and opportunities. In Proc. CHIMIT. NY: ACM Press, Article No. 8.","paperID":"None"},{"content":"Mitra, T. & Gilbert, E. (2014). The language that gets people to give: Phrases that predict success on Kickstarter. In Proc. CSCW. NY: ACM Press, 49--61.","paperID":"None"},{"content":"Saxton, G. D. & Wang, L. 2013. The social network effect: The determinants of giving through social media. Nonprofit and Voluntary Sector Quarterly, 43(5), 850-868.","paperID":"None"},{"content":"Schmidt, K. & Bannon, L. (1992). Taking CSCW seriously. Computer Supported Cooperative Work, 1(12), 7-40.","paperID":"None"},{"content":"Sharma, R. (2014). Democratization of philanthropy through crowdfunding. Huffington Post. Retrieved from: http://www.huffingtonpost.com/ritusharma/ democratization-of-philanthropy-throughcrowdfunding_b_ 6228654.html","paperID":"None"},{"content":"Sharp, M. (2004). De Tocqueville meets eBay: Giving, volunteering, and doing good in the new social sector. New Directions for Philanthropic Fundraising, 45, 85- 93.","paperID":"None"},{"content":"Smith, S., Windmeijer, F. & Wright, E. (2014). Peer effects in charitable giving: Evidence from the (running) field. The Economic Journal, 125, 1053- 1071.","paperID":"None"},{"content":"Star, S. L. & Strauss, A. (1999). Layers of silence, arenas of voice: The ecology of visible and invisible work. Computer Supported Cooperative Work, 8(1-2), 9-30.","paperID":"None"},{"content":"Strauss, A. (1985). Work and the division of labor. The Sociological Quarterly, 26(1), 1-19.","paperID":"None"},{"content":"Suchman, L. (1995). Making work visible. Communications of the ACM, 38(9), 56-64","paperID":"None"},{"content":"Voida, A., Harmon, E. & Al-Ani, B. (2012). Bridging between organizations and the public: Volunteer coordinators' uneasy relationship with social computing. In Proc. CHI. NY: ACM Press, 1967-1976.","paperID":"None"},{"content":"Voida, A., Yao, Z., & Korn, M. (2015). (Infra) structures of Volunteering. In Proc. CSCW. NY: ACM Press, pp. 1704-1716.","paperID":"None"},{"content":"Walsh, R. & Solomon, J. (2014). Coordinating donors on crowdfunding websites. In Proc. CSCW. NY: ACM Press, 38-48.","paperID":"None"},{"content":"Wood, R. (2015, May 21). Appalling $187 million cancer charity fraud case settles -- When 97% of money isn't for charity. Forbes. Retrieved from http://www.forbes.com/sites/robertwood/2015/05/21/ap palling-187-million-cancer-charity-fraud-case-settleswhen-97-of-money-isnt-for-charity/","paperID":"None"}],"title":"Legitimacy Work: Invisible Work in Philanthropic Crowdfunding","filename":"CHI16/p4550","authors":["Katie G. Tanaka","Amy Voida"],"conference":"CHI '16"}