{"paperId":2858585,"citation":[],"abstract":"Interactive Voice Response (IVR) platforms have been widely deployed in resource-limited settings. These systems tend to afford asynchronous push interactions, and within the context of health, provide medication reminders, descriptions of symptoms and tips on self-management. Here, we present the development of an IVR system for resource-limited settings that enables real-time, synchronous interaction. Inspired by community radio, and calls for health systems that are truly local, we developed \"Sehat ki Vaani\". Sehat ki Vaani is a real-time IVR platform that enables hosting and participation in radio chat shows on community-led topics. We deployed Sehat ki Vaani with two communities in North India on topics related to the management of Type 2 diabetes and maternal health. Our deployments highlight the potential for synchronous IVR systems to offer community connection and localised sharing of experience, while also highlighting the complexity of producing, hosting and participating in radio shows in real time through IVR. We discuss the relative strengths and weaknesses of synchronous IVR systems, and highlight lessons learnt for interaction design in this area.","reference":[{"content":"Sheetal K. Agarwal, Arun Kumar, Amit Anil Nanavati, and Nitendra Rajput. 2009. Content creation and dissemination by-and-for users in rural areas. Proceedings of the 3rd International Conference on Information and Communication Technologies and Development, IEEE Press, 56--65.","paperID":"None"},{"content":"Abdullah Al Mahmud and David V. Keyson. 2013. Designing with Midwives: Improving prenatal care in low resource regions. In Proceedings of the 7th International Conference on Pervasive Computing Technologies for Healthcare, ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), 180--183. http://doi.org/10.4108/icst.pervasivehealth.2013.25203","paperID":"None"},{"content":"Christophe Boudry. 2015. Web 2.0 applications in medicine: trends and topics in the literature. Medicine 2.0 4, 1: e2. http://doi.org/10.2196/med20.3628","paperID":"None"},{"content":"Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101. http://doi.org/10.1191/1478088706qp063oa","paperID":"None"},{"content":"Dipanjan Chakraborty and Aaditeshwar Seth. 2015. Building Citizen Engagement into the Implementation of Welfare Schemes in Rural India. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development, ACM, 22:1--22:10. http://doi.org/10.1145/2737856.2738027","paperID":"None"},{"content":"Arul Chib, Michelle Helena van Velthoven, and Josip Car. 2015. mHealth adoption in low-resource environments: A review of the use of mobile healthcare in developing countries. Journal of Health Communication 20, 1: 4--34. http://doi.org/10.1080/10810730.2013.864735","paperID":"None"},{"content":"Krittika D'Silva, Meghana Marathe, Aditya Vashistha, Gaetano Borriello, and William Thies. 2014. A Mobile Application for Interactive Voice Forums: Design and Pilot Deployment in Rural India. In Proceedings of the Fifth ACM Symposium on Computing for Development (ACM DEV-5 '14). 121--122. http://dx.doi.org/10.1145/2674377.2678270","paperID":"None"},{"content":"Dean Giustini. 2006. How Web 2.0 is changing medicine. BMJ 333, 7582: 1283--1284. http://doi.org/10.1136/bmj.39062.555405.80","paperID":"None"},{"content":"Andrea Grimes, Martin Bednar, Jay David Bolter, and Rebecca E. Grinter. 2008. EatWell: Sharing Nutritionrelated Memories in a Low-income Community. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work, ACM, 87--96. http://doi.org/10.1145/1460563.1460579","paperID":"None"},{"content":"Michele Heisler and John D. Piette. 2005. \"I help you, and you help me\": facilitated telephone peer support among patients with diabetes. The Diabetes Educator 31, 6: 869--879. http://doi.org/10.1177/0145721705283247","paperID":"None"},{"content":"Tad Hirsch. 2009. Communities real and imagined: designing a communication system for zimbabwean activists. In Proceedings of the fourth international conference on Communities and technologies (C&T '09). 71--76. http://dx.doi.org/10.1145/1556460.1556472","paperID":"None"},{"content":"Anirudha Joshi, Mandar Rane, Debjani Roy, Nagraj Emmadi, Padma Srinivasan, N. Kumarasamy, Sanjay Pujari, Davidson Solomon, Rashmi Rodrigues, D.G. Saple, Kamalika Sen, Els Veldeman, and Romain Rutten. 2014. Supporting treatment of people living with HIV / AIDS in resource limited settings with IVRs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 1595--1604. http://dx.doi.org/10.1145/2556288.2557236","paperID":"None"},{"content":"Zahir Koradia, Piyush Aggarwal, Aaditeshwar Seth, and Gaurav Luthra. 2013. Gurgaon idol: a singing competition over community radio and IVRS. In Proceedings of the 3rd ACM Symposium on Computing for Development (ACM DEV '13), Article 6 , 10 pages. http://dx.doi.org/10.1145/2442882.2442890","paperID":"None"},{"content":"Zahir Koradia, C. Balachandran, Kapil Dadheech, Mayank Shivam, and Aaditeshwar Seth. 2012. Experiences of deploying and commercializing a community radio automation system in India. In Proceedings of the 2nd ACM Symposium on Computing for Development (ACM DEV '12), Article 8, 10 pages. http://dx.doi.org/10.1145/2160601.2160612","paperID":"None"},{"content":"Zahir Koradia and Aaditeshwar Seth. 2012. PhonePeti: exploring the role of an answering machine system in a community radio station in India. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development (ICTD '12). 278--288. http://dx.doi.org/10.1145/2160673.2160708","paperID":"None"},{"content":"Neha Kumar and Richard J. Anderson. 2015. Mobile Phones for Maternal Health in Rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 427--436. http://doi.org/10.1145/2702123.2702258","paperID":"None"},{"content":"Anutosh Maitra and Nataraj Kuntagod. 2013. A Novel Mobile Application to Assist Maternal Health Workers in Rural India. In Proceedings of the 5th International Workshop on Software Engineering in Health Care, IEEE Press, 75--78.","paperID":"None"},{"content":"Akhil Mathur and Sharad Jaiswal. 2013. Exploring the interplay between community media and mobile web in developing regions. In Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services (MobileHCI '13). 318--327. http://dx.doi.org/10.1145/2493190.2493201","paperID":"None"},{"content":"Indrani Medhi, Somani Patnaik, Emma Brunskill, S.N. Nagasena Gautama, William Thies, and Kentaro Toyama. 2011. Designing mobile interfaces for novice and low-literacy users. ACM Trans. Comput.-Hum. Interact. 18, 1, Article 2 (May 2011), 28 pages. http://dx.doi.org/10.1145/1959022.1959024","paperID":"None"},{"content":"Preeti Mudliar, Jonathan Donner, and William Thies. 2012. Emergent practices around CGNet Swara, voice forum for citizen journalism in rural India. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development (ICTD '12). 159--168. http://dx.doi.org/10.1145/2160673.2160695","paperID":"None"},{"content":"S. L. Norris., F. M. Chowdhury., K. Le Van., T. Horsley., J. N. Brownstein., X. Zhang., L. Jack, and D. W. Satterfield, (2006), Effectiveness of community health workers in the care of persons with diabetes. Diabetic Medicine, 23: 544--556. doi: 10.1111/j.1464--5491.2006.01845.x","paperID":"None"},{"content":"Adeline Nyamathi, Benissa E. Salem, Visha Meyer, Kalyan K. Ganguly, Sanjeev Sinha, and Padma Ramakrishnan. 2012. Impact of an Asha Intervention on Depressive Symptoms among Rural Women Living with AIDS in India: Comparison of the Asha-Life and Usual Care Program. AIDS Education and Prevention 24, 3: 280--293. http://doi.org/10.1521/aeap.2012.24.3.280","paperID":"None"},{"content":"Josefien van Olmen, Grace Marie Ku, Maurits van Pelt, et al. 2013. The effectiveness of text messages support for diabetes self-management: protocol of the TEXT4DSM study in the democratic Republic of Congo, Cambodia and the Philippines. BMC Public Health 13, 1: 423. http://doi.org/10.1186/1471-2458-13-423","paperID":"None"},{"content":"Neil Patel, Deepti Chittamuru, Anupam Jain, Paresh Dave, and Tapan S. Parikh. 2010. Avaaj Otalo: A Field Study of an Interactive Voice Forum for Small Farmers in Rural India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 733--742. http://doi.org/10.1145/1753326.1753434","paperID":"None"},{"content":"Vikram Patel, Somnath Chatterji, Dan Chisholm, et al. 2011. Chronic diseases and injuries in India. The Lancet 377, 9763: 413--428.","paperID":"None"},{"content":"Trevor Perrier, Nicola Dell, Brian DeRenzi, et al. 2015. Engaging Pregnant Women in Kenya with a Hybrid Computer-Human SMS Communication System. In of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1429--1438, ACM Press. http://doi.org/10.1145/2702123.2702124","paperID":"None"},{"content":"J. D. Piette. 2000. Interactive voice response systems in the diagnosis and management of chronic disease. The American Journal of Managed Care 6, 7: 817--827.","paperID":"None"},{"content":"John D. Piette, Milton O. Mendoza-Avelares, Martha Ganser, Muhima Mohamed, Nicolle Marinec, and Sheila Krishnan. 2011. A Preliminary Study of a Cloud-Computing Model for Chronic Illness Self-Care Support in an Underdeveloped Country. American Journal of Preventive Medicine 40, 6: 629--632. http://doi.org/10.1016/j.amepre.2011.02.014","paperID":"None"},{"content":"Robin Reid Rudy, Lawrence B. Rosenfeld, John P. Galassi, Joanna Parker, and Rachel Schanberg. 2001. Participants' Perceptions of a Peer-Helper, TelephoneBased Social Support Intervention for Melanoma Patients. Health Communication 13, 3: 285--305. http://doi.org/10.1207/S15327027HC1303_4","paperID":"None"},{"content":"Jahanzeb, Sherwani., Nosheen Ali, Sarwat Mirza, Anjum Fatma, Yousuf Memon, Mehtab Karim, Rahul Tongia, and Roni Rosenfeld. \"Healthline: Speechbased access to health information by low-literate users.\" In Information and Communication Technologies and Development, 2007. ICTD 2007. International Conference on, pp. 1--9. IEEE, 2007.","paperID":"None"},{"content":"Elizabeth L. Tung and Monica E. Peek. 2015. Linking Community Resources in Diabetes Care: a Role for Technology? Current Diabetes Reports 15, 7: 1--9. http://doi.org/10.1007/s11892-015-0614--5","paperID":"None"},{"content":"Aditya Vashistha, Edward Cutrell, Gaetano Borriello, and William Thies. 2015. Sangeet Swara: A Community-Moderated Voice Forum in Rural India. In Proceeding of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 417--426. http://doi.org/10.1145/2702123.2702191","paperID":"None"},{"content":"Jerome White, Mayuri Duggirala, Krishna Kummamuru, and Saurabh Srivastava. 2012. Designing a Voice-based Employment Exchange for Rural India. Proceedings of the Fifth International Conference on Information and Communication Technologies and Development, ACM, 367--373. http://doi.org/10.1145/2160673.2160717","paperID":"None"},{"content":"gramvaani | community-powered-technology. Retrieved September 1, 2015 from http://www.gramvaani.org/","paperID":"None"},{"content":"Community Radio In India: The Key To Propel Rural Development. Youth Ki Awaaz. Retrieved August 26, 2015 from http://www.youthkiawaaz.com/2011/02/communityradio-for-rural-development/","paperID":"None"}],"title":"A Real-Time IVR Platform for Community Radio","filename":"CHI16/p343","authors":["Konstantinos Kazakos","Siddhartha Asthana","Madeline Balaam","Mona Duggal","Amey Holden","Limalemla Jamir","Nanda Kishore Kannuri","Saurabh Kumar","Amarendar Reddy Manindla","Subhashini Arcot Manikam","GVS Murthy","Papreen Nahar","Peter Phillimore","Shreyaswi Sathyanath","Pushpendra Singh","Meenu Singh","Pete Wright","Deepika Yadav","Patrick Olivier"],"conference":"CHI '16"}