{"paperId":2858039,"citation":[],"reference":[{"content":"Christopher Andrews, Alex Endert, and Chris North. 2010. Space to think: Large high-resolution displays for sensemaking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, 55--64. DOI: 10.1145/1753326.1753336","paperID":"None"},{"content":"Robert Ball, Chris North, and Doug A. Bowman. 2007. Move to improve: promoting physical navigation to increase user performance with large displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, 191--200. DOI: 10.1145/1240624.1240656","paperID":"None"},{"content":"Lauren Bradel, Alex Endert, Kristen Koch, Christopher Andrews, and Chris North. 2013. Large high resolution displays for co-located collaborative sensemaking: Display usage and territoriality. Int. J. Hum.-Comput. Stud. 71, 11, 1078--1088. DOI: 10.1016/j.ijhcs.2013.07.004","paperID":"None"},{"content":"Paul Dourish and Victoria Bellotti. 1992. Awareness and coordination in shared workspaces. In Proceedings of the 1992 ACM Conference on Computer-supported Cooperative Work (CSCW '92). ACM, 107--114. DOI: 10.1145/143457.143468","paperID":"None"},{"content":"Michael Fitze. 2006. Discourse and participation in ESL face-to-face and written electronic conferences. Language Learning & Technology 10, 1, 67--86. http://www.editlib.org/p/74430/","paperID":"None"},{"content":"Carl Gutwin and Saul Greenberg. 2002. A descriptive framework of workspace awareness for real-time groupware. Comput. Supported Coop. Work 11, 3, 411--446. DOI: 10.1023/A:1021271517844","paperID":"None"},{"content":"Kirstie Hawkey, Melanie Kellar, Derek Reilly, Tara Whalen, and Kori M. Inkpen. 2005. The proximity factor: Impact of distance on co-located collaboration. In Proceedings of the 2005 International ACM SIGGROUP Conference on Supporting Group Work (GROUP '05). ACM, 31--40. DOI: 10.1145/1099203.1099209","paperID":"None"},{"content":"Juan David Hincapié-Ramos, Xiang Guo, Paymahn Moghadasian, and Pourang Irani. 2014. Consumed endurance: A metric to quantify arm fatigue of mid-air interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 1063--1072. DOI: 10.1145/2556288.2557130","paperID":"None"},{"content":"Eva Hornecker, Paul Marshall, Nick Sheep Dalton, and Yvonne Rogers. 2008. Collaboration and interference: Awareness with mice or touch input. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, 167--176. DOI:","paperID":"None"},{"content":"1145/1460563.1460589 10. Petra Isenberg, Danyel Fisher, Sharoda A. Paul, Meredith Ringel Morris, Kori Inkpen, and Mary Czerwinski. 2012. Co-located collaborative visual analytics around a tabletop display. IEEE Trans. Visual. Comput. Graphics 18, 5, 689--702. DOI: 10.1109/TVCG.2011.287","paperID":"None"},{"content":"Mikkel R. Jakobsen and Kasper Hornbaek. 2014. Up close and personal: Collaborative work on a high-resolution multitouch wall display. ACM Trans. Comput.-Hum. Interact. 21, 2, Article 11, 34 pages. DOI: 10.1145/2576099","paperID":"None"},{"content":"Mikkel R. Jakobsen and Kasper Hornbæk. 2015. Is moving improving?: Some effects of locomotion in wall-display interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 4169--4178. DOI: 10.1145/2702123.2702312","paperID":"None"},{"content":"Can Liu, Olivier Chapuis, Michel Beaudouin-Lafon, Eric Lecolinet, and Wendy Mackay. 2014. Effects of display size and navigation type on a classification task. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 4147--4156. DOI: 10.1145/2556288.2557020","paperID":"None"},{"content":"Meredith Ringel Morris, Anthony Cassanego, Andreas Paepcke, Terry Winograd, Anne Marie Piper, and Anqi Huang. 2006a. Mediating group dynamics through tabletop interface design. IEEE Comput. Graph. Appl. 26, 5, 65--73. DOI: 10.1109/MCG.2006.114","paperID":"None"},{"content":"Meredith Ringel Morris, Anqi Huang, Andreas Paepcke, and Terry Winograd. 2006b. Cooperative gestures: Multi-user gestural interactions for co-located groupware. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, 1201--1210. DOI: 10.1145/1124772.1124952","paperID":"None"},{"content":"Miguel A. Nacenta, David Pinelle, Dane Stuckel, and Carl Gutwin. 2007. The effects of interaction technique on coordination in tabletop groupware. In Proceedings of Graphics Interface 2007 (GI '07). ACM, 191--198. DOI: 10.1145/1268517.1268550","paperID":"None"},{"content":"Tao Ni, Doug A. Bowman, and Jian Chen. 2006. Increased display size and resolution improve task performance in information-rich virtual environments. In Proceedings of Graphics Interface (GI '06). CIPS, 139--146. http://dl.acm.org/citation.cfm?id=1143079.1143102","paperID":"None"},{"content":"Emmanuel Pietriga, Stephane Huot, Mathieu Nancel, and Romain Primet. 2011. Rapid development of user interfaces on cluster-driven wall displays with jBricks. In Proceedings of the 3rd ACM SIGCHI symposium on Engineering interactive computing systems (EICS '11). ACM, 185--190. DOI: 10.1145/1996461.1996518","paperID":"None"},{"content":"David Pinelle, Carl Gutwin, and Saul Greenberg. 2003. Task analysis for groupware usability evaluation: Modeling shared-workspace tasks with the mechanics of collaboration. ACM Trans. Comput.-Hum. Interact. 10, 4, 281--311. DOI: 10.1145/966930.966932","paperID":"None"},{"content":"Gonzalo Ramos, Kenneth Hinckley, Andy Wilson, and Raman Sarin. 2009. Synchronous gestures in multi-display environments. Hum. Comput. Interact. 24, 1--2, 117--169. DOI: 10.1080/07370020902739288","paperID":"None"},{"content":"Khairi Reda, Andrew E. Johnson, Michael E. Papka, and Jason Leigh. 2015. Effects of display size and resolution on user behavior and insight acquisition in visual exploration. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 2759--2768. DOI: 10.1145/2702123.2702406","paperID":"None"},{"content":"Roy A. Ruddle, Rhys G. Thomas, Rebecca S. Randell, Phil Quirke, and Darren Treanor. 2015. Performance and interaction behaviour during visual search on large, high-resolution displays. Information Visualization 14, 2, 137--147. DOI: 10.1177/1473871613500978","paperID":"None"},{"content":"Stacey D. Scott, M. Sheelagh T. Carpendale, and Kori M. Inkpen. 2004. Territoriality in collaborative tabletop workspaces. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, 294--303. DOI: 10.1145/1031607.1031655","paperID":"None"},{"content":"Desney S. Tan, Darren Gergle, Regan Mandryk, Kori Inkpen, Melanie Kellar, Kirstie Hawkey, and Mary Czerwinski. 2008. Using job-shop scheduling tasks for evaluating collocated collaboration. Pers. Ubiquit. Comput. 12, 3, 255--267. DOI: 10.1007/s00779-007-0154--3","paperID":"None"},{"content":"Anthony Tang, Melanie Tory, Barry Po, Petra Neumann, and Sheelagh Carpendale. 2006. Collaborative coupling over tabletop displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, 1181--1190. DOI: 10.1145/1124772.1124950","paperID":"None"},{"content":"Edward Tse, Jonathan Histon, Stacey D. Scott, and Saul Greenberg. 2004. Avoiding interference: How people use spatial separation and partitioning in SDG workspaces. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, 252--261. DOI: 10.1145/1031607.1031647","paperID":"None"},{"content":"James R. Wallace, Stacey D. Scott, and Carolyn G. MacGregor. 2013. Collaborative sensemaking on a digital tabletop and personal tablets: Prioritization, comparisons, and tableaux. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 3345--3354. DOI: 10.1145/2470654.2466458","paperID":"None"},{"content":"Nicola Yuill and Yvonne Rogers. 2012. Mechanisms for collaboration: A design and evaluation framework for multi-user interfaces. ACM Trans. Comput.-Hum. Interact. 19, 1, Article 1, 25 pages. DOI: 10.1145/2147783.2147784","paperID":"None"}],"abstract":"Wall-sized displays support small groups of users working together on large amounts of data. Observational studies of such settings have shown that users adopt a range of collaboration styles, from loosely to closely coupled. Shared interaction techniques, in which multiple users perform a command collaboratively, have also been introduced to support co-located collaborative work. In this paper, we operationalize five collaborative situations with increasing levels of coupling, and test the effects of providing shared interaction support for a data manipulation task in each situation. The results show the benefits of shared interaction for close collaboration: it encourages collaborative manipulation, it is more efficient and preferred by users, and it reduces physical navigation and fatigue. We also identify the time costs caused by disruption and communication in loose collaboration and analyze the trade-offs between parallelization and close collaboration. These findings inform the design of shared interaction techniques to support collaboration on wall-sized displays.","title":"Shared Interaction on a Wall-Sized Display in a Data Manipulation Task","filename":"CHI16/p2075","authors":["Can Liu","Olivier Chapuis","Michel Beaudouin-Lafon","Eric Lecolinet"],"conference":"CHI '16"}