{"paperId":2858230,"citation":[],"abstract":"Refugees undergoing resettlement in a new country post exile and migration face disruptive life changes. They rely on a network of individuals in the host country to help them rebuild their lives and livelihoods. We investigated whether technology could contribute to minimizing the vulnerabilities resettling refugees face. We designed Rivrtran, a messaging platform that provides 'human-in-the-loop' interpretation between individuals who don't share a common language. We report the findings from the deployment of Rivrtran to mediate communication between resettling refugee families in the United States and the American families they are paired with who serve as their mentors. Our findings suggest that scaffolding communication in such a way provides refugees one means of accessing diversified help outside their cultural group. Moreover human-in-the-loop interpretation may help to mitigate the effects of cultural barriers between those communicating. We establish the notion of designing for transient use in the development of systems to scaffold communication for short-term use by resettling refugees.","reference":[{"content":"Deana Brown, Victoria Ayo, and Rebecca E Grinter. 2014. Reflection Through Design: Immigrant Women's Self-Reflection on Managing Health and Wellness. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14: 1605--1614.","paperID":"None"},{"content":"M Fazel and A Stein. 2002. The Mental Health of Refugee Children. Archives of disease in childhood 87, 5: 366--70.","paperID":"None"},{"content":"Karen E Fisher, Ann Peterson Bishop, and Phil Fawcett. 2014. Action! Co-Designing Interactive Technology with Immigrant Teens. 345--348.","paperID":"None"},{"content":"Batya Friedman, Peter H Kahn Jr., and Alan Borning. 2006. Value Sensitive Design and Information Systems. Human-Computer Interaction and Management Information Systems: Foundations: 1--27.","paperID":"None"},{"content":"M S Granovetter. 1973. The strength of weak ties. American journal of sociology: 1360--1380.","paperID":"None"},{"content":"Mark Guzdial. 1999. Supporting Learners as Users. Journal of Computer Documentation 23, 2.","paperID":"None"},{"content":"Fern R. Hauck, Elsbeth Lo, Anne Maxwell, and P. Preston Reynolds. 2014. Factors Influencing the Acculturation of Burmese, Bhutanese, and Iraqi Refugees Into American Society: Cross-Cultural Comparisons. Journal of Immigrant & Refugee Studies 12, 3: 331--352.","paperID":"None"},{"content":"Tad Hirsch and Jeremy Liu. 2004. Speakeasy. Proceedings of the 2004 conference on Designing interactive systems processes, practices, methods, and techniques DIS '04, ACM Press, 345.","paperID":"None"},{"content":"Hilary Hutchinson, Wendy Mackay, Bosse Westerlund, et al. 2003. Technology probes: inspiring design for and with families. CHI '03: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 17--24.","paperID":"None"},{"content":"Zahir Koradia and Aaditeshwar Seth. 2012. PhonePeti: Exploring the Role of an Answering Machine System in a Community Radio Station in India Categories and Subject Descriptors.","paperID":"None"},{"content":"Arun Kumar and Sheetal K Agarwal. 2012. Spoken Web: Using Voice as an Accessibility Tool for Disadvantaged People in Developing Regions. 3--11.","paperID":"None"},{"content":"Egon F. Kunz. 1981. Exile and Resettlement: Refugee Theory. International Migration Review 15, 1/2: 45--51.","paperID":"None"},{"content":"Martha Larkin. 2002. Using Scaffolded Instruction to Optimize Learning.","paperID":"None"},{"content":"NP. 2015. Office of Refugee Resettlement: Fiscal Year 2014 Refugee Arrivals. Retrieved from http://www.acf.hhs.gov/programs/orr/resource/fiscal-year2014-refugee-arrivals","paperID":"None"},{"content":"NP. 2015. Instructional Scaffolding. informEd by OpenColleges. Retrieved June 25, 2015 from http://www.opencolleges.edu.au/informed/teacherresources/scaffolding-in-education-a-definitive-guide/","paperID":"None"},{"content":"Neil Patel, Deepti Chittamuru, Anupam Jain, Paresh Dave, and Tapan S Parikh. 2010. Avaaj Otalo -- A Field Study of an Interactive Voice Forum for Small Farmers in Rural India. CHI '10: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 733--742.","paperID":"None"},{"content":"Neil Patel. 2010. Designing and Evaluating VoiceBased Virtual Communities. Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems CHI EA '10, ACM Press, 2963.","paperID":"None"},{"content":"Jun Rekimoto and Hitomi Tsuijita. Inconvenient Interactions: An Alternative Design Approach to Enrich our Lives.","paperID":"None"},{"content":"Georgios Saslis-Lagoudakis, Keith Cheverst, Alan Dix, Dan Fitton, and Mark Rouncefield. 2006. Hermes@Home: supporting awareness and intimacy between distant family members. OZCHI '06: Proceedings of the 18th Australia conference on Computer-Human Interaction, ACM, 23--30.","paperID":"None"},{"content":"David R Thomas. 2003. A General Inductive Approach for Qualitative Data Analysis. Auckland, New Zealand.","paperID":"None"},{"content":"Hitomi Tsujita and Jun Rekimoto. 2011. HappinessCounter: smile-encouraging appliance to increase positive mood. Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems (CHI '11).: 117--126.","paperID":"None"},{"content":"Mark Weiser. 1991. The computer for the 21st century. Scientific American 3, 3: 3--11.","paperID":"None"},{"content":"Jie Zong and Jeanne Batalova. 2015. Frequently Requested Statistics on Immigrants and Immigration in the USA. Retrieved May 27, 2015 from http://www.migrationpolicy.org/article/frequentlyrequested-statistics-immigrants-and-immigration-unitedstates","paperID":"None"}],"title":"Designing for Transient Use: A Human-in-the-loop Translation Platform for Refugees","filename":"CHI16/p321","authors":["Deana Brown","Rebecca E. Grinter"],"conference":"CHI '16"}