{"paperId":2858430,"citation":[],"reference":[{"content":"Robin Abraham, Martin Erwig, Steve Kollmansberger, and Ethan Seifert. 2005. Visual specifications of correct spreadsheets. Visual Languages and Human-Centric Computing, 2005 IEEE Symposium on, 189--196. http://doi.org/10.1109/VLHCC.2005.70","paperID":"None"},{"content":"Eirik Bakke, David Karger, and Rob Miller. 2011. A Spreadsheet-based User Interface for Managing Plural Relationships in Structured Data. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2541--2550. http://doi.org/10.1145/1978942.1979313","paperID":"None"},{"content":"Margaret Burnett, John Atwood, Rebecca Walpole Djang, James Reichwein, Herkimer Gottfried, and Sherry Yang. 2001. Forms/3: A First-order Visual Language to Explore the Boundaries of the Spreadsheet Paradigm. J. Funct. Program. 11, 2: 155--206. Retrieved from http://dl.acm.org/citation.cfm?id=968486.968487","paperID":"None"},{"content":"Kerry Shih-Ping Chang and Brad A Myers. 2014. Creating Interactive Web Data Applications with Spreadsheets. Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology, ACM, 87--96. http://doi.org/10.1145/2642918.2647371","paperID":"None"},{"content":"Kerry Shih-Ping Chang and Brad A Myers. 2014. A spreadsheet model for using web service data. Visual Languages and Human-Centric Computing (VL/HCC), 2014 IEEE Symposium on, 169--176. http://doi.org/10.1109/VLHCC.2014.6883042","paperID":"None"},{"content":"Kerry Shih-Ping Chang and Brad A Myers. 2015. A Spreadsheet Model for Handling Streaming Data. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3399--3402. http://doi.org/10.1145/2702123.2702587","paperID":"None"},{"content":"Zhe Chen, Michael Cafarella, Jun Chen, Daniel Prevo, and Junfeng Zhuang. 2013. Senbazuru: A Prototype Spreadsheet Database Management System. Proc. VLDB Endow. 6, 12: 1202--1205. http://doi.org/10.14778/2536274.2536276","paperID":"None"},{"content":"Zhe Chen and Michael Cafarella. 2014. Integrating Spreadsheet Data via Accurate and Low-effort Extraction. Proceedings of the 20th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, ACM, 1126--1135. http://doi.org/10.1145/2623330.2623617","paperID":"None"},{"content":"William R Harris and Sumit Gulwani. 2011. Spreadsheet Table Transformations from Examples. Proceedings of the 32Nd ACM SIGPLAN Conference on Programming Language Design and Implementation, ACM, 317--328. http://doi.org/10.1145/1993498.1993536","paperID":"None"},{"content":"Felienne Hermans, Martin Pinzger, and Arie van Deursen. 2010. Automatically Extracting Class Diagrams from Spreadsheets. Proceedings of the 24th European Conference on Object-oriented Programming, Springer-Verlag, 52--75. Retrieved from http://dl.acm.org/citation.cfm?id=1883978.1883984","paperID":"None"},{"content":"Felienne Hermans, Martin Pinzger, and Arie van Deursen. 2011. Supporting Professional Spreadsheet Users by Generating Leveled Dataflow Diagrams. Proceedings of the 33rd International Conference on Software Engineering, ACM, 451--460. http://doi.org/10.1145/1985793.1985855","paperID":"None"},{"content":"Simon Peyton Jones, Alan Blackwell, and Margaret Burnett. 2003. A User-centred Approach to Functions in Excel. Proceedings of the Eighth ACM SIGPLAN International Conference on Functional Programming, ACM, 165--176. http://doi.org/10.1145/944705.944721","paperID":"None"},{"content":"Sean Kandel, Andreas Paepcke, Joseph Hellerstein, and Jeffrey Heer. 2011. Wrangler: Interactive Visual Specification of Data Transformation Scripts. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3363--3372. http://doi.org/10.1145/1978942.1979444","paperID":"None"},{"content":"Max Van Kleek, Daniel A Smith, Heather S Packer, Jim Skinner, and Nigel R Shadbolt. 2013. Carpe Data: Supporting Serendipitous Data Integration in Personal Information Management. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2339--2348. http://doi.org/10.1145/2470654.2481324","paperID":"None"},{"content":"Stephen Oney, Brad Myers, and Joel Brandt. 2012. ConstraintJS: Programming Interactive Behaviors for the Web by Integrating Constraints and States. Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology, ACM, 229--238. http://doi.org/10.1145/2380116.2380146","paperID":"None"},{"content":"Vijayshankar Raman and Joseph M Hellerstein. 2001. Potter's Wheel: An Interactive Data Cleaning System. Proceedings of the 27th International Conference on Very Large Data Bases, Morgan Kaufmann Publishers Inc., 381--390. Retrieved from http://dl.acm.org/citation.cfm?id=645927.672045","paperID":"None"},{"content":"Jeffrey Wong and Jason I Hong. 2007. Making mashups with marmite: towards end-user programming for the web. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1435--1444. http://doi.org/10.1145/1240624.1240842","paperID":"None"},{"content":"Yahoo Pipes. Retrieved from http://pipes.yahoo.com/","paperID":"None"}],"abstract":"More and more data nowadays exist in hierarchical formats such as JSON due to the increasing popularity of web applications and web services. While many end-user systems support getting hierarchical data from databases without programming, they provide very little support for using hierarchical data beyond turning the data into a flat string or table. In this paper, we present a spreadsheet tool for using and exploring hierarchical datasets. We introduce novel interaction techniques and algorithms to manipulate and visualize hierarchical data in a spreadsheet using the data's relative hierarchical relationships with the data in its adjacent columns. Our tool leverages the data's structural information to support selecting, grouping, joining, sorting and filtering hierarchical data in spreadsheets. Our lab study showed that our tool helped spreadsheet users complete data exploration tasks nearly two times faster than using Excel and even outperform programmers in most tasks.","title":"Using and Exploring Hierarchical Data in Spreadsheets","filename":"CHI16/p2497","authors":["Kerry Shih-Ping Chang","Brad A. Myers"],"conference":"CHI '16"}