{"paperId":2858356,"citation":[],"reference":[{"content":"Brian Butler, Elisabeth Joyce, and Jacqueline Pike. 2008. Don't Look Now, but We've Created a Bureaucracy: The Nature and Roles of Policies and Rules in Wikipedia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1101--1110. DOI: http://dx.doi.org/10.1145/1357054.1357227","paperID":"None"},{"content":"Brian S. Butler. 2001. Membership Size, Communication Activity, and Sustainability: A Resource-Based Model of Online Social Structures. Information Systems Research 12, 4 (Dec. 2001), 346--362. DOI: http://dx.doi.org/10.1287/isre.12.4.346.9703","paperID":"None"},{"content":"Kathy Charmaz. 2006. Constructing Grounded Theory: A Practical Guide through Qualitative Analysis (1 ed.). Sage Publications Ltd.","paperID":"None"},{"content":"Eric Gilbert. 2013. Widespread Underprovision on Reddit. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, New York, NY, USA, 803--808. DOI: http://dx.doi.org/10.1145/2441776.2441866","paperID":"None"},{"content":"Andreea Gorbatai. 2012. Aligning Collective Production with Demand: Evidence from Wikipedia. (2012). http://faculty.chicagobooth.edu/workshops/orgsmarkets/past/pdf/gorbatai.pdf","paperID":"None"},{"content":"Wendy Grossman. 1998. net.wars. NYU Press, New York.","paperID":"None"},{"content":"Aaron Halfaker, R. Stuart Geiger, Jonathan T. Morgan, and John Riedl. 2013. The Rise and Decline of an Open Collaboration System How Wikipedia's Reaction to Popularity Is Causing Its Decline. American Behavioral Scientist 57, 5 (May 2013), 664--688. DOI: http://dx.doi.org/10.1177/0002764212469365","paperID":"None"},{"content":"Aaron Halfaker, R. Stuart Geiger, and Loren G. Terveen. 2014. Snuggle: Designing for Efficient Socialization and Ideological Critique. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 311--320. DOI: http://dx.doi.org/10.1145/2556288.2557313","paperID":"None"},{"content":"Aaron Halfaker, Aniket Kittur, and John Riedl. 2011. Don't bite the newbies: how reverts affect the quantity and quality of Wikipedia work. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym '11). ACM, New York, NY, USA, 163--172. DOI: http://dx.doi.org/10.1145/2038558.2038585","paperID":"None"},{"content":"Robin Jeffries, Sara Kiesler, Jennifer Goetz, and Lee Sproull. 2005. Systers: Contradictions in community. (2005). http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.111.9648&rep=rep1&type=pdf","paperID":"None"},{"content":"Quentin Jones, Gilad Ravid, and Sheizaf Rafaeli. 2004. Information Overload and the Message Dynamics of Online Interaction Spaces: A Theoretical Model and Empirical Exploration. Information Systems Research 15, 2 (June 2004), 194--210. DOI: http://dx.doi.org/10.1287/isre.1040.0023","paperID":"None"},{"content":"Nicolas Jullien, Kevin Crowston, and Felipe Ortega. 2015. The Rise and Fall of an Online Project: Is Bureaucracy Killing Efficiency in Open Knowledge Production?. In Proceedings of the 11th International Symposium on Open Collaboration (OpenSym '15). ACM, New York, NY, USA, 13:1--13:10. DOI: http://dx.doi.org/10.1145/2788993.2789844","paperID":"None"},{"content":"Robert E. Kraut and Paul Resnick. 2012. Building Successful Online Communities: Evidence-Based Social Design. The MIT Press.","paperID":"None"},{"content":"Jonathan T. Morgan, Siko Bouterse, Heather Walls, and Sarah Stierch. 2013. Tea and sympathy: crafting positive new user experiences on wikipedia. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 839--848. DOI: http://dx.doi.org/10.1145/2441776.2441871","paperID":"None"},{"content":"Kevin Morris. 2012. Reddit moderator bots arrive to protect and serve. (Jan. 2012). http://www.dailydot.com/news/reddit-automoderator-bots/","paperID":"None"},{"content":"Mikolaj Jan Piskorski and Andreea D. Gorbatai. 2013. Testing Coleman's Social-Norm Enforcement Mechanism: Evidence from Wikipedia. SSRN Scholarly Paper ID 1926284. Social Science Research Network, Rochester, NY. http://papers.ssrn.com/abstract=1926284","paperID":"None"},{"content":"Charles Schweik and Robert English. 2012. Internet Success: A Study of Open Source Software Commons. MIT Press, Cambridge, Massachusetts. http://mitpress.mit.edu/catalog/item/default.asp?ttype=2&tid=12792","paperID":"None"},{"content":"Bongwon Suh, Gregorio Convertino, Ed H. Chi, and Peter Pirolli. 2009. The Singularity is Not Near: Slowing Growth of Wikipedia. In Proceedings of the 5th International Symposium on Wikis and Open Collaboration (WikiSym '09). ACM, New York, NY, USA, 8:1--8:10. DOI: http://dx.doi.org/10.1145/1641309.1641322","paperID":"None"},{"content":"Jan E. Trost. 1986. Statistically non-representative stratified sampling: A sampling technique for qualitative studies. Qualitative Sociology 9, 1 (March 1986), 54--57. DOI: http://dx.doi.org/10.1007/BF00988249","paperID":"None"},{"content":"Charlie Warzel. 2015. Reddit Moderators Are Fed Up: \"I Thought It Couldn't Get Worse\" - BuzzFeed News. (July 2015). http://www.buzzfeed.com/charliewarzel/i-thought-itcouldnt-get-worse-reddit-moderators-are-fed-up","paperID":"None"},{"content":"Haiyi Zhu, Jilin Chen, Tara Matthews, Aditya Pal, Hernan Badenes, and Robert E. Kraut. 2014a. Selecting an Effective Niche: An Ecological View of the Success of Online Communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 301--310. DOI: http://dx.doi.org/10.1145/2556288.2557348","paperID":"None"},{"content":"Haiyi Zhu, Robert E. Kraut, and Aniket Kittur. 2014b. The Impact of Membership Overlap on the Survival of Online Communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 281--290. DOI: http://dx.doi.org/10.1145/2556288.2557213","paperID":"None"}],"abstract":"We present a qualitative analysis of interviews with participants in the NoSleep community within Reddit where millions of fans and writers of horror fiction congregate. We explore how the community handled a massive, sudden, and sustained increase in new members. Although existing theory and stories like Usenet's infamous \"Eternal September\" suggest that large influxes of newcomers can hurt online communities, our interviews suggest that NoSleep survived without major incident. We propose that three features of NoSleep allowed it to manage the rapid influx of newcomers gracefully: (1) an active and well-coordinated group of administrators, (2) a shared sense of community which facilitated community moderation, and (3) technological systems that mitigated norm violations. We also point to several important trade-offs and limitations.","title":"Surviving an \"Eternal September\": How an Online Community Managed a Surge of Newcomers","filename":"CHI16/p1152","authors":["Charles Kiene","Andrés Monroy-Hernández","Benjamin Mako Hill"],"conference":"CHI '16"}