{"paperId":2858138,"citation":[],"reference":[{"content":"Attar, R., Aish, R., Stam, J., Brinsmead, D., Tessier, A., Glueck, M., & Khan, A. (2009). Physics-based generative design. In CAAD Futures Conference (pp. 231--244).","paperID":"None"},{"content":"Autodesk. Maya. tinyurl.com/Adsk-maya.","paperID":"None"},{"content":"Autodesk. Meshmixer. http://meshmixer.com.","paperID":"None"},{"content":"Baudisch, P., Tan, D., Collomb, M., Robbins, D., Hinckley, K., Agrawala, M., & Ramos, G. (2006). Phosphor: explaining transitions in the user interface using afterglow effects. ACM UIST (pp. 169--178).","paperID":"None"},{"content":"Braun, M. (1994). Picturing time: the work of EtienneJules Marey (1830--1904). University of Chicago Press.","paperID":"None"},{"content":"Ceylan, D., Li, W., Mitra, N. J., Agrawala, M., & Pauly, M. (2013). Designing and fabricating mechanical automata from mocap sequences. ACM Trans. Graph, 32(6), 186.","paperID":"None"},{"content":"Coros, S., Thomaszewski, B., Noris, G., Sueda, S., Forberg, M., Sumner, R. W., et al. (2013). Computational design of mechanical characters. ACM Trans on Graph (TOG), 32(4), 83.","paperID":"None"},{"content":"Cutting, J. E. (2002). Representing motion in a static image: constraints and parallels in art, science, and popular culture. PERCEPTION-LONDON, 31(10), 1165--1194.","paperID":"None"},{"content":"Dragicevic, P., and Jansen, Y. List of physical visualizations. tinyurl.com/physvis, 2013.","paperID":"None"},{"content":"Haller, M., Hanl, C., & Diephuis, J. (2004). Nonphotorealistic rendering techniques for motion in computer games. CIE, 2(4), 11--11.","paperID":"None"},{"content":"Jansen, Y., Dragicevic, P., & Fekete, J. D. (2013, April). Evaluating the efficiency of physical visualizations. ACM CHI (pp. 2593--2602).","paperID":"None"},{"content":"Lake, A., Marshall, C., Harris, M., & Blackstein, M. (2000, June). Stylized rendering techniques for scalable real-time 3D animation. ACM NPAR .13--20.","paperID":"None"},{"content":"Lynn, G., & Kelly, T. (1999). Animate form.","paperID":"None"},{"content":"Marinetti, F. T. (1909). The founding and manifesto of Futurism. Marinetti: Selected writings, 39--44.","paperID":"None"},{"content":"Masuch, M., Schlechtweg, S., & Schulz, R. (1999, July). Speedlines: depicting motion in motionless pictures. ACM SIGGRAPH (p. 277).","paperID":"None"},{"content":"McCloud, S. (1993). Understanding comics: The invisible art. Northampton, Mass.","paperID":"None"},{"content":"Mori, Y., & Igarashi, T. (2007, August). Plushie: an interactive design system for plush toys. ACM Trans. Graph (TOG) (Vol. 26, No. 3, p. 45).","paperID":"None"},{"content":"Mueller, S., Lopes, P., & Baudisch, P. (2012, October). Interactive construction: interactive fabrication of functional mechanical devices. ACM UIST. 599--606.","paperID":"None"},{"content":"Muybridge, E. (1957). Animals in motion. Courier Dover Publications.","paperID":"None"},{"content":"Nienhaus, M., & Dollner, J. (2005). Depicting dynamics using principles of visual art and narrations. Computer Graphics and Applications, IEEE, 25(3), 40--51.","paperID":"None"},{"content":"Prévost, R., Whiting, E., Lefebvre, S., & SorkineHornung, O. (2013). Make it stand: balancing shapes for 3d fabrication. ACM Trans. Graph, 32(4), 81.","paperID":"None"},{"content":"Ramachandran, V. S., & Anstis, S. M. (1986). The perception of apparent motion. Scientific American, 254(6), 102--109.","paperID":"None"},{"content":"Saul, G., Lau, M., Mitani, J., & Igarashi, T. (2011, January). SketchChair: an all-in-one chair design system for end users. TEI (pp. 73--80). ACM.","paperID":"None"},{"content":"Savage, V., Chang, C., & Hartmann, B. (2013, October). Sauron: embedded single-camera sensing of printed physical user interfaces. ACM UIST (pp. 447--456).","paperID":"None"},{"content":"Savage, V., Schmidth, R., Grossman, T., Fitzmaurice, G., & Hartmann, B. (2014). A Series of Tubes: Adding Interactivity to 3D Prints Using Internal Pipes. ACM UIST.","paperID":"None"},{"content":"Schmid, J., Sumner, R. W., Bowles, H., & Gross, M. (2010). Programmable motion effects. ACM SIGGRAPH. (pp. 1--9).","paperID":"None"},{"content":"Shah, J. J. (1995). Parametric and feature-based CAD/CAM: concepts, techniques, and applications. John Wiley & Sons.","paperID":"None"},{"content":"Skouras, M., Thomaszewski, B., Coros, S., Bickel, B., & Gross, M. (2013). Computational design of actuated deformable characters. ACM Trans. Graph, 32(4), 82","paperID":"None"},{"content":"Sung, K., Pearce, A., & Wang, C. (2002). Spatialtemporal antialiasing. Visualization and Computer Graphics, IEEE Transactions on, 8(2), 144--153.","paperID":"None"},{"content":"Swaminathan, S., Shi, C., Jansen, Y., Dragicevic, P., Oehlberg, L. A., & Fekete, J. D. (2014, April). Supporting the design and fabrication of physical visualizations. ACM CHI (pp. 3845--3854).","paperID":"None"},{"content":"Teramoto, O., Park, I. K., & Igarashi, T. (2010). Interactive motion photography from a single image. The Visual Computer, 26(11), 1339--1348.","paperID":"None"},{"content":"Thomaszewski, B., Coros, S., Gauge, D., Megaro, V., Grinspun, E., & Gross, M. (2014). Computational design of linkage-based characters. ACM Trans. Graph (TOG), 33(4), 64.","paperID":"None"},{"content":"Umetani, N., & Schmidt, R. (2013). Cross-sectional structural analysis for 3D printing optimization. SIGGRAPH Asia, 19--22.","paperID":"None"},{"content":"Willis, K., Brockmeyer, E., Hudson, S., & Poupyrev, I. (2012, October). Printed optics: 3d printing of embedded optical elements for interactive devices. ACM UIST (pp. 589--598).","paperID":"None"},{"content":"Zhu, L., Xu, W., Snyder, J., Liu, Y., Wang, G., & Guo, B. (2012). Motion-guided mechanical toy modeling. ACM Trans. Graph., 31(6), 127.","paperID":"None"}],"abstract":"We present ChronoFab, a 3D modeling tool to craft motion sculptures, tangible representations of 3D animated models, visualizing an object's motion with static, transient, ephemeral visuals that are left behind. Our tool casts 3D modeling as a dynamic art-form by employing 3D animation and dynamic simulation for the modeling of motion sculptures. Our work is inspired by the rich history of stylized motion depiction techniques in existing 3D motion sculptures and 2D comic art. Based on a survey of such techniques, we present an interface that enables users to rapidly explore and craft a variety of static 3D motion depiction techniques, including motion lines, multiple stroboscopic stamps, sweeps and particle systems, using a 3D animated object as input. In a set of professional and non-professional usage sessions, ChronoFab was found to be a superior tool for the authoring of motion sculptures, compared to traditional 3D modeling workflows, reducing task completion times by 79%.","title":"ChronoFab: Fabricating Motion","filename":"CHI16/p908","authors":["Rubaiat Habib Kazi","Tovi Grossman","Cory Mogk","Ryan Schmidt","George Fitzmaurice"],"conference":"CHI '16"}