{"paperId":2858130,"citation":[],"reference":[{"content":"Amazon Mechanical Turk. Access date: November 24, 2015. http://www.mturk.com/","paperID":"None"},{"content":"Patrick Carrington, Amy Hurst, and Shaun K. Kane. 2014. Wearables and Chairables: inclusive design of mobile input and output techniques for power wheelchair users. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, New York, NY, USA, 31033112. http://doi.acm.org/10.1145/2556288.2557237","paperID":"None"},{"content":"Jacob Cohen, 1960. A coefficient of agreement for nominal scales. Educational and psychological measurement, 20(1), 37--46.","paperID":"None"},{"content":"Julie Corbin and Anselm Strauss. 2014. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage Publications.","paperID":"None"},{"content":"Katherine Deibel. 2013. A convenient heuristic model for understanding assistive technology adoption. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA, Article 32, 2 pages. http://doi.acm.org/10.1145/2513383.2513427","paperID":"None"},{"content":"Tamara Denning, Zakariya Dehlawi, and Tadayoshi Kohno. 2014. In situ with bystanders of augmented reality glasses: perspectives on recording and privacymediating technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2377--2386. http://dx.doi.org/10.1145/2556288.2557352","paperID":"None"},{"content":"Olive Jean Dunn, 1961. Multiple comparisons among means. Journal of the American Statistical Association, 56.293, 52--64.","paperID":"None"},{"content":"Lucy E Dunne, Halley Profita, Clint Zeagler, James Clawson, Ellen Yi-Luen Do, and Jim Budd. 2014. The social comfort of wearable technology and gestural interaction. In Proceedings of the 36th Annual International Conference of the IEEE on Engineering in Medicine and Biology Society (EMBC), 4159--4162. http://ieeexplore.ieee.org/xpl/articleDetails.jsp?arnumb er=6944540","paperID":"None"},{"content":"Alexander Fiannaca, Ilias Apostolopoulous, and Eelke Folmer. 2014. Headlock: a wearable navigation aid that helps blind cane users traverse large open spaces. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility (ASSETS '14). ACM, New York, NY, USA, 19--26. http://doi.acm.org/10.1145/2661334.2661453","paperID":"None"},{"content":"Google Glass. Access date: November 24, 2015. http://www.google.com/glass/start/","paperID":"None"},{"content":"Betsy Isaacson. 2013. 5 places Google Glass has already been banned. The Huffington Post. Access date: November 24, 2015. http://www.huffingtonpost.com/2013/04/10/googleglass-banned_n_3039935.html","paperID":"None"},{"content":"Paul T. Jaeger, 2015. Disability, human rights, and social justice: The ongoing struggle for online accessibility and equality. First Monday, 20, 9.","paperID":"None"},{"content":"Dhruv Jain, Leah Findlater, Jamie Gilkeson, Benjamin Holland, Ramani Duraiswami, Dmitry Zotkin, Christian Vogler, and Jon E. Froehlich. 2015. Headmounted display visualizations to support sound awareness for the deaf and hard of hearing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 241--250. http://doi.acm.org/10.1145/2702123.2702393","paperID":"None"},{"content":"Shaun K. Kane, Chandrika Jayant, Jacob O. Wobbrock, and Richard E. Ladner. 2009. Freedom to roam: a study of mobile device adoption and accessibility for people with visual and motor disabilities. In Proceedings of the 11th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '09). ACM, New York, NY, USA, 115--122. http://doi.acm.org/10.1145/1639642.1639663","paperID":"None"},{"content":"Thorsten Karrer, Moritz Wittenhagen, Leonhard Lichtschlag, Florian Heller, and Jan Borchers. 2011. Pinstripe: eyes-free continuous input on interactive clothing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1313--1322. http://doi.acm.org/10.1145/1978942.1979137","paperID":"None"},{"content":"Reuben Kirkham. 2015. Exploring the overlap between wearable computing and disability discrimination law. In Proceedings of the 2015 British HCI Conference (British HCI '15). ACM, New York, NY, USA, 136137. http://doi.acm.org/10.1145/2783446.2783591","paperID":"None"},{"content":"Catherine Kudlick. Black bike, white cane: nonstandard deviations of a special self. Disability Studies Quarterly, 31, 1.","paperID":"None"},{"content":"Kai Kunze, Niels Henze, and Koichi Kise. 2014. Wearable computing for older adults: initial insights into head-mounted display usage. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, New York, NY, USA, 83--86. http://doi.acm.org/10.1145/2638728.2638747","paperID":"None"},{"content":"Bonnie Mader, Lynette A. Hart, and Bonita Bergin. (1989). Social acknowledgments for children with disabilities: Effects of service dogs. Child Development, 60, 1529--1534.","paperID":"None"},{"content":"Meethu Malu and Leah Findlater. 2015. Personalized, wearable control of a head-mounted display for users with upper body motor impairments. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 221--230. http://doi.acm.org/10.1145/2702123.2702188","paperID":"None"},{"content":"Roisin McNaney, John Vines, Daniel Roggen, Madeline Balaam, Pengfei Zhang, Ivan Poliakov, and Patrick Olivier. 2014. Exploring the acceptability of google glass as an everyday assistive device for people with Parkinson's. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2551--2554. http://doi.acm.org/10.1145/2556288.2557092","paperID":"None"},{"content":"Uran Oh and Leah Findlater. 2014. Design of and subjective response to on-body input for people with visual impairments. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility (ASSETS '14). ACM, New York, NY, USA, 115--122. http://doi.acm.org/10.1145/2661334.2661376","paperID":"None"},{"content":"OrCam. Access date: September 24, 2015. http://www.orcam.com/","paperID":"None"},{"content":"Phil Parette and Marcia Scherer. 2004. Assistive technology use and stigma. Education and Training in Developmental Disabilities, 217--226. http://eric.ed.gov/?id=EJ754131","paperID":"None"},{"content":"Halley P. Profita, James Clawson, Scott Gilliland, Clint Zeagler, Thad Starner, Jim Budd, and Ellen Yi-Luen Do. 2013. Don't mind me touching my wrist: a case study of interacting with on-body technology in public. In Proceedings of the 2013 International Symposium on Wearable Computers (ISWC '13). ACM, New York, NY, USA, 89--96. http://doi.acm.org/10.1145/2493988.2494331","paperID":"None"},{"content":"Julie Rico and Stephen Brewster. 2009. Gestures all around us: user differences in social acceptability perceptions of gesture based interfaces. In Proceedings of the 11th International Conference on HumanComputer Interaction with Mobile Devices and Services (MobileHCI '09). ACM, New York, NY, USA, Article 64, 2 pages. http://doi.acm.org/10.1145/1613858.1613936","paperID":"None"},{"content":"Julie Rico and Stephen Brewster. 2010. Usable gestures for mobile interfaces: evaluating social acceptability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 887--896. http://doi.acm.org/10.1145/1753326.1753458","paperID":"None"},{"content":"Abigail J. Sellen, Andrew Fogg, Mike Aitken, Steve Hodges, Carsten Rother, and Ken Wood. 2007. Do lifelogging technologies support memory for the past?: an experimental study using SenseCam. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 81--90. http://doi.acm.org/10.1145/1240624.1240636","paperID":"None"},{"content":"Kristen Shinohara and Jacob O. Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 705--714. http://doi.acm.org/10.1145/1978942.1979044","paperID":"None"},{"content":"SurveyGizmo. Access date: November 24, 2015. http://www.surveygizmo.com/","paperID":"None"},{"content":"Enrico Tanuwidjaja, Derek Huynh, Kirsten Koa, Calvin Nguyen, Churen Shao, Patrick Torbett, Colleen Emmenegger, and Nadir Weibel. 2014. Chroma: a wearable augmented-reality solution for color blindness. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, New York, NY, USA, 799--810. http://doi.acm.org/10.1145/2632048.2632091","paperID":"None"},{"content":"Aaron Toney, Barrie Mulley, Bruce H. Thomas, and Wayne Piekarski. 2003. Social weight: designing to minimise the social consequences arising from technology use by the mobile professional. Personal and Ubiquitous Computing 7, 5 (October 2003), 309320. http://dx.doi.org/10.1007/s00779-003-0245--8","paperID":"None"},{"content":"Cindy Wiggett-Barnard, and Henry Steel. (2008). The experience of owning a guide dog. Disability and Rehabilitation, 20, 1014--1026. http://www.ncbi.nlm.nih.gov/pubmed/18953747","paperID":"None"},{"content":"Kristin Williams, Karyn Moffatt, Denise McCall, and Leah Findlater. 2015. Designing conversation cues on a head-worn display to support persons with aphasia. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 231--240. http://doi.acm.org/10.1145/2702123.2702484","paperID":"None"},{"content":"Hanlu Ye, Meethu Malu, Uran Oh, and Leah Findlater. 2014. Current and future mobile and wearable device use by people with visual impairments. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, New York, NY, USA, 3123--3132. http://doi.acm.org/10.1145/2556288.2557085","paperID":"None"}],"abstract":"Wearable computing devices offer new possibilities to increase accessibility and independence for individuals with disabilities. However, the adoption of such devices may be influenced by social factors, and useful devices may not be adopted if they are considered inappropriate to use. While public policy may adapt to support accommodations for assistive technology, emerging technologies may be unfamiliar or unaccepted by bystanders. We surveyed 1200 individuals about the use of a head-mounted display in a public setting, examining how information about the user's disability affected judgments of the social acceptability of the scenario. Our findings reveal that observers considered head-mounted display use more socially acceptable if the device was being used to support a person with a disability.","title":"The AT Effect: How Disability Affects the Perceived Social Acceptability of Head-Mounted Display Use","filename":"CHI16/p4884","authors":["Halley Profita","Reem Albaghli","Leah Findlater","Paul Jaeger","Shaun K. Kane"],"conference":"CHI '16"}