{"paperId":2858217,"abstract":"Robots that can leverage help from people could accomplish much more than robots that cannot. We present the results of two experiments that examine how robots can more effectively request help from people. Study 1 is a video prototype experiment (N=354), investigating the effectiveness of four linguistic politeness strategies as well as the effects of social status (equal, low), size of request (large, small), and robot familiarity (high, low) on people's willingness to help a robot. The results of this study largely support Politeness Theory and the Computers as Social Actors paradigm. Study 2 is a physical human-robot interaction experiment (N=48), examining the impact of source orientation (autonomous, single operator, multiple operators) on people's behavioral willingness to help the robot. People were nearly 50% faster to help the robot if they perceived it to be autonomous rather than being teleoperated. Implications for research design, theory, and methods are discussed.","reference":[{"content":"T. Beran, A. Ramirez-Serrano, R. Kuzyk, S. Nugent, and M. Fior. 2011. Would Children Help a Robot in Need? International Journal of Social Robotics 3, 1 (2011), 83-93.","paperID":"None"},{"content":"P. Brown and S.C. Levinson. 1978. Universals in language usage: Politeness phenomena. Cambridge University Press. 56-311 pages.","paperID":"None"},{"content":"D.J. Butler, J. Huang, Fr. Roesner, and M. Cakmak. 2015. The Privacy-Utility Tradeoff for Remotely Teleoperated Robots. In Proceedings of HRI 2015. ACM, 27-34.","paperID":"None"},{"content":"D. Eckles, D. Wightman, C. Carlson, A. Thamrongrattanarit, M. Bastea-Forte, and B.J. Fogg. 2009. Social Responses in Mobile Messaging: Influence Strategies, Self-disclosure, and Source Orientation. In Proceedings of CHI 2009. ACM, 1651-1654.","paperID":"None"},{"content":"S. Fukushima. 2003. Requests and Culture: Politeness in British English and Japanese, 3rd edition. Peter Lang International Academic Publishers.","paperID":"None"},{"content":"H. Huttenrauch and K. Severinson Eklundh. 2006. To help or not to help a service robot: Bystander intervention as a resource in human-robot collaboration. Interaction Studies 7, 3 (2006), 455-477.","paperID":"None"},{"content":"K. Kinzer. 2009. Tweenbots. (2009). http://www.tweenbots.com/ Accessed: 2015-09--13.","paperID":"None"},{"content":"W. Labov and D. Fanshel. 1977. Therapeutic discourse: Psychotherapy as conversation. Academic Press.","paperID":"None"},{"content":"M.K. Lee, S. Kielser, J. Forlizzi, S. Srinivasa, and P. Rybski. 2010. Gracefully Mitigating Breakdowns in Robotic Services. In Proceedings of HRI 2010. IEEE Press, 203-210.","paperID":"None"},{"content":"N.C. Macrae and L. Johnston. 1998. Help, I need somebody: Automation action and inaction. Social Cognition 16 (1998), 400-417. Issue 4.","paperID":"None"},{"content":"P.P. Maglio, S.J. Matlock, T.and Gould, D. Koons, and C.S Campbell. 2002. On understanding discourse in human-computer interaction. In Proceedings of Cognitive Science.","paperID":"None"},{"content":"M.P. Michalowski, C. DiSalvo, D. Busquets, L.M. Hiatt, N.A. Melchior, R. Simmons, and S. Sabanovic. 2006. Socially Distributed Perception. In Proceedings of HRI 2006. ACM, 349-350.","paperID":"None"},{"content":"D.T. Nguyen and J. Canny. 2009. More Than Face-to-face: Empathy Effects of Video Framing. In Proceedings of CHI 2009. ACM, 423-432.","paperID":"None"},{"content":"A. Parasuraman, V.A. Zeithaml, and L.L. Berry. 1988. Servqual. Journal of Retailing 64, 1 (1988), 12-40.","paperID":"None"},{"content":"B. Reeves and C. Nass. 1996. The Media Equation: How people treat computers, television, and new media like real people and places. CSLI Publications and Cambridge university press.","paperID":"None"},{"content":"S. Rosenthal, M. Veloso, and A.K. Dey. 2012. Is Someone in this Office Available to Help Me? Journal of Intelligent Robotic Systems 66, 1--2 (April 2012), 205-221.","paperID":"None"},{"content":"F. Smith, D.and Zeller. 2014. HitchBot. (2014). http://m.hitchbot.me/ Accessed: 2015-09--13.","paperID":"None"},{"content":"I. Straub, S. Nishio, and H. Ishiguro. 2010. Incorporated identity in interaction with a teleoperated android robot: A case study. In Proceedings of RO-MAN 2010. 119-124.","paperID":"None"},{"content":"S.S. Sundar and C. Nass. 2000. Source Orientation in Human-Computer Interaction Programmer, Networker, or Independent Social Actor. Journal of Communication Research 27, 6 (2000), 683-703.","paperID":"None"},{"content":"J.-Y. Sung, L. Guo, R. Grinter, and H. Christensen. 2007. My Roomba Is Rambo: Intimate Home Appliances. Proceedings of UbiComp 2007 (2007), 145-162.","paperID":"None"},{"content":"A. Tapus, M.J. Mataric, and B. Scasselati. 2007. Socially assistive robotics: Grand challenges in robotics. Robotics Automation Magazine, IEEE 14, 1 (March 2007), 35-42.","paperID":"None"},{"content":"C. Torrey, S. Fussell, and S. Kiesler. 2013. How a robot should give advice. In Proceedings of HRI 2013. IEEE Press, 275-282.","paperID":"None"},{"content":"K. Tracy, R. T. Craig, M. Smith, and E. Spisak. 1984. The discourse of requests: Assessment of a compliance-gaining approach. Human Communication Research 10 (1984), 513-538.","paperID":"None"},{"content":"E.A. Weinstein and C.R. Black. 1969. Factors mediating the effects of others' responses on the self. Sociological Inquiry 39 (1969), 189-193. Issue 12.","paperID":"None"},{"content":"A. Weiss, J. Igelsbock, M. Tscheligi, A. Bauer, K. Kuhnlenz, D. Wollherr, and M. Buss. 2010. Robots asking for directions: the willingness of passers-by to support robots. In Proceedings of HRI 2010. IEEE Press, 23-30.","paperID":"None"},{"content":"L.R. Wheeless and J. Grotz. 1977. The measurement of trust and its relationship to self-disclosure. Human Communication Research 3, 3 (1977), 250-257.","paperID":"None"},{"content":"Y. Yamamoto, M. Sato, K. Hiraki, N. Yamasaki, and Y. Anzai. 1992. A request of the robot: an experiment with the human-robot interactive system HuRIS. In Proceedings of the IEEE International Workshop on Robot and Human Communication. 204 -209.","paperID":"None"}],"citation":[],"title":"Help Me Please: Robot Politeness Strategies for Soliciting Help From Humans","filename":"CHI16/p4945","authors":["Vasant Srinivasan","Leila Takayama"],"conference":"CHI '16"}