{"paperId":2858422,"citation":[],"abstract":"We present a study of 10-month Twitter discussions on the controversial topic of Edward Snowden. We demonstrate how behavioral differences of opinion groups can distort the presence of opinions on a social media platform. By studying the differences between a numerical minority (anti-Snowden) and a majority (pro-Snowden) group, we found that the minority group engaged in a \"shared audiencing\" practice with more persistent production of original tweets, focusing increasingly on inter-personal interactions with like-minded others. The majority group engaged in a \"gatewatching\" practice by disseminating information from the group, and over time shifted further from making original comments to retweeting others'. The findings show consistency with previous social science research on how social environment shapes majority and minority group behaviors. We also highlight that they can be further distorted by the collective use of social media design features such as the \"retweet\" button, by introducing the concept of \"amplification'\" to measure how a design feature biases the voice of an opinion group. Our work presents a warning to not oversimplify analysis of social media data for inferring social opinions.","reference":[{"content":"2013. Post-ABC poll: NSA surveillance and Edward Snowden. (24 July 2013). http://www.washingtonpost.com.","paperID":"None"},{"content":"2013. Public Split over Impact of NSA Leak, But Most Want Snowden Prosecuted. (17 June 2013). http://www.people-press.org.","paperID":"None"},{"content":"2014. How Twitter Reacted To The Snowden Interview. (19 May 2014). http://www.nbcnews.com.","paperID":"None"},{"content":"2014. Poll Results: Snowden. (28 March 2014). https://today.yougov.com.","paperID":"None"},{"content":"Lada A Adamic and Natalie Glance. 2005. The political blogosphere and the 2004 US election: divided they blog. In Proceedings of the 3rd international workshop on Link discovery. ACM, 36-43.","paperID":"None"},{"content":"Sushil Bikhchandani, David Hirshleifer, and Ivo Welch. 1992. A theory of fads, fashion, custom, and cultural change as informational cascades. Journal of political Economy (1992), 992-1026.","paperID":"None"},{"content":"Johan Bollen, Huina Mao, and Xiaojun Zeng. 2011. Twitter mood predicts the stock market. Journal of Computational Science 2, 1 (2011), 1-8.","paperID":"None"},{"content":"Javier Borge-Holthoefer, Walid Magdy, Kareem Darwish, and Ingmar Weber. 2015. Content and network dynamics behind egyptian political polarization on twitter. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 700-711.","paperID":"None"},{"content":"Danah Boyd, Scott Golder, and Gilad Lotan. 2010. Tweet, tweet, retweet: Conversational aspects of retweeting on twitter. In System Sciences (HICSS), 2010 43rd Hawaii International Conference on. IEEE, 1-10.","paperID":"None"},{"content":"Axel Bruns and Stefan Stieglitz. 2012. Quantitative approaches to comparing communication patterns on Twitter. Journal of Technology in Human Services 30, 3--4 (2012), 160-185.","paperID":"None"},{"content":"Axel Bruns and Stefan Stieglitz. 2013. Towards more systematic Twitter analysis: Metrics for tweeting activities. International Journal of Social Research Methodology 16, 2 (2013), 91-108.","paperID":"None"},{"content":"Pedro Henrique Calais Guerra, Adriano Veloso, Wagner Meira Jr, and Virgílio Almeida. 2011. From bias to opinion: a transfer-learning approach to real-time sentiment analysis. In Proceedings of the 17th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 150-158.","paperID":"None"},{"content":"Meeyoung Cha, Hamed Haddadi, Fabricio Benevenuto, and P Krishna Gummadi. 2010. Measuring User Influence in Twitter: The Million Follower Fallacy. ICWSM 10, 10--17 (2010), 30.","paperID":"None"},{"content":"Lu Chen, Wenbo Wang, and Amit P Sheth. 2012. Are twitter users equal in predicting elections? A study of user groups in predicting 2012 US Republican presidential primaries. In Social informatics. Springer, 379-392.","paperID":"None"},{"content":"Christian Christensen. 2013. Wave-riding and hashtag-jumping: Twitter, minority third parties and the 2012 US elections. Information, Communication & Society 16, 5 (2013), 646-666.","paperID":"None"},{"content":"Robert B Cialdini and Melanie R Trost. 1998. Social influence: Social norms, conformity and compliance. (1998).","paperID":"None"},{"content":"Raviv Cohen and Derek Ruths. 2013. Classifying Political Orientation on Twitter: It's Not Easy!. In ICWSM.","paperID":"None"},{"content":"Michael Conover, Jacob Ratkiewicz, Matthew Francisco, Bruno Goncalves, Filippo Menczer, and Alessandro Flammini. 2011. Political polarization on twitter.. In ICWSM.","paperID":"None"},{"content":"Michael D Conover, Bruno Gonçalves, Alessandro Flammini, and Filippo Menczer. 2012. Partisan asymmetries in online political activity. EPJ Data Science 1, 1 (2012), 1-19.","paperID":"None"},{"content":"Munmun De Choudhury, Andres Monroy-Hernandez, and Gloria Mark. 2014. Narco emotions: affect and desensitization in social media during the mexican drug war. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 3563-3572.","paperID":"None"},{"content":"Nicholas Diakopoulos. 2014. Algorithmic Accountability: Journalistic investigation of computational power structures. Digital Journalism ahead-of-print (2014), 1-18.","paperID":"None"},{"content":"Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. I always assumed that I wasnt really that close to [her]: Reasoning about invisible algorithms in the news feed. In Proceedings of the 33rd Annual SIGCHI Conference on Human Factors in Computing Systems. 153-162.","paperID":"None"},{"content":"Huiji Gao, Jalal Mahmud, Jilin Chen, Jeffrey Nichols, and Michelle Zhou. 2014. Modeling user attitude toward controversial topics in online social media. In Eighth International AAAI Conference on Weblogs and Social Media.","paperID":"None"},{"content":"Daniel Gayo-Avello. 2013. A meta-analysis of state-of-the-art electoral prediction from Twitter data. Social Science Computer Review (2013), 0894439313493979.","paperID":"None"},{"content":"William Hart, Dolores Albarracín, Alice H Eagly, Inge Brechan, Matthew J Lindberg, and Lisa Merrill. 2009. Feeling validated versus being correct: a meta-analysis of selective exposure to information. Psychological bulletin 135, 4 (2009), 555.","paperID":"None"},{"content":"Avery E Holton and Seth C Lewis. 2011. Journalists, social media, and the use of humor on Twitter. Electronic Journal of Communication 21, 1/2 (2011).","paperID":"None"},{"content":"Bernard J Jansen, Mimi Zhang, Kate Sobel, and Abdur Chowdury. 2009. Twitter power: Tweets as electronic word of mouth. Journal of the American society for information science and technology 60, 11 (2009), 2169-2188.","paperID":"None"},{"content":"Matthew Kay, Cynthia Matuszek, and Sean A Munson. 2015. Unequal Representation and Gender Stereotypes in Image Search Results for Occupations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3819-3828.","paperID":"None"},{"content":"Geoffrey J Leonardelli and Marilynn B Brewer. 2001. Minority and majority discrimination: When and why. Journal of Experimental Social Psychology 37, 6 (2001), 468-485.","paperID":"None"},{"content":"Q Vera Liao and Wai-Tat Fu. 2013. Beyond the filter bubble: interactive effects of perceived threat and topic involvement on selective exposure to information. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2359-2368.","paperID":"None"},{"content":"Q Vera Liao and Wai-Tat Fu. 2014. Can you hear me now?: mitigating the echo chamber effect by source position indicators. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 184-196.","paperID":"None"},{"content":"Simon Lindgren and Ragnar Lundstrom. 2011. Pirate culture and hacktivist mobilization: The cultural and social protocols of# WikiLeaks on Twitter. New Media & Society 13, 6 (2011), 999-1018.","paperID":"None"},{"content":"Zhe Liu and Ingmar Weber. 2014. Is twitter a public sphere for online conflicts? A cross-ideological and cross-hierarchical look. In Social Informatics. Springer, 336-347.","paperID":"None"},{"content":"Joseph A Maxwell. 2012. Qualitative research design: An interactive approach: An interactive approach. Sage.","paperID":"None"},{"content":"Eni Mustafaraj, Samantha Finn, Carolyn Whitlock, and Panagiotis Takis Metaxas. 2011. Vocal minority versus silent majority: Discovering the opionions of the long tail. In Privacy, Security, Risk and Trust (PASSAT) and 2011 IEEE Third Inernational Conference on Social Computing (SocialCom), 2011 IEEE Third International Conference on. IEEE, 103-110.","paperID":"None"},{"content":"Elisabeth Noelle-Neumann. 1974. The spiral of silence a theory of public opinion. Journal of communication 24, 2 (1974), 43-51.","paperID":"None"},{"content":"Brendan O'Connor, Ramnath Balasubramanyan, Bryan R Routledge, and Noah A Smith. 2010. From tweets to polls: Linking text sentiment to public opinion time series. ICWSM 11 (2010), 122-129.","paperID":"None"},{"content":"Thomas Poell and Erik Borra. 2012. Twitter, YouTube, and Flickr as platforms of alternative journalism: The social media account of the 2010 Toronto G20 protests. Journalism 13, 6 (2012), 695-713.","paperID":"None"},{"content":"Derek Ruths and Jurgen Pfeffer. 2014. Social media for large studies of behavior. Science 346, 6213 (2014), 1063-1064.","paperID":"None"},{"content":"Matthew J Salganik, Peter Sheridan Dodds, and Duncan J Watts. 2006. Experimental study of inequality and unpredictability in an artificial cultural market. science 311, 5762 (2006), 854-856.","paperID":"None"},{"content":"Dietram A Scheufle and Patricia Moy. 2000. Twenty-five years of the spiral of silence: A conceptual review and empirical outlook. International journal of public opinion research 12, 1 (2000), 3-28.","paperID":"None"},{"content":"Bernd Simon, Birgit Aufderheide, and Claudia Kampmeier. 2001. The Social Psychology of Minority-Majority Relations. Blackwell handbook of social psychology: Intergroup processes (2001), 303-323.","paperID":"None"},{"content":"Laura M Smith, Linhong Zhu, Kristina Lerman, and Zornitsa Kozareva. 2013. The role of social media in the discussion of controversial topics. In Social Computing (SocialCom), 2013 International Conference on. IEEE, 236-243.","paperID":"None"},{"content":"Stefan Stieglitz and Nina Kruger. 2011. Analysis of sentiments in corporate Twitter communication-A case study on an issue of Toyota. Analysis 1 (2011), 1-2011.","paperID":"None"},{"content":"Bongwon Suh, Lichan Hong, Peter Pirolli, and Ed H Chi. 2010. Want to be retweeted? large scale analytics on factors impacting retweet in twitter network. In Social computing (socialcom), 2010 IEEE second international conference on. IEEE, 177-184.","paperID":"None"},{"content":"Cass R Sunstein. 2002. The law of group polarization. Journal of political philosophy 10, 2 (2002), 175-195.","paperID":"None"},{"content":"Ingmar Weber, Venkata R Kiran Garimella, and Alaa Batayneh. 2013. Secular vs. islamist polarization in egypt on twitter. In Proceedings of the 2013 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining. ACM, 290-297.","paperID":"None"},{"content":"Michael J Welch, Uri Schonfeld, Dan He, and Junghoo Cho. 2011. Topical semantics of twitter links. In Proceedings of the fourth ACM international conference on Web search and data mining. ACM, 327-336.","paperID":"None"},{"content":"Sarita Yardi and Danah Boyd. 2010. Dynamic debates: An analysis of group polarization over time on twitter. Bulletin of Science, Technology & Society 30, 5 (2010), 316-327.","paperID":"None"},{"content":"William Lafi Youmans and Jillian C York. 2012. Social media and the activist toolkit: User agreements, corporate interests, and the information infrastructure of modern social movements. Journal of Communication 62, 2 (2012), 315-329.","paperID":"None"}],"title":"#Snowden: Understanding Biases Introduced by Behavioral Differences of Opinion Groups on Social Media","filename":"CHI16/p3352","authors":["Q. Vera Liao","Wai-Tat Fu","Markus Strohmaier"],"conference":"CHI '16"}