{"paperId":2858211,"citation":[],"reference":[{"content":"Jason Alexander, Andy Cockburn, Stephen Fitchett, Carl Gutwin, and Saul Greenberg. 2009. Revisiting read wear. In Proceedings of the 27th international conference on Human factors in computing systems (CHI '09), 1665-1674. http://dx.doi.org/10.1145/1518701.1518957","paperID":"None"},{"content":"Jussi -ngeslevä, Ian Oakley, Stephen Hughes and Sile O'Modhrain. 2003. Body Mnemonics - Portable device interaction design concept. In Proceedings of the 16th annual ACM symposium on User interface software and technology (UIST '03).","paperID":"None"},{"content":"Oscar Kin-Chung Au and Chiew-Lan Tai. 2010. Multitouch finger registration and its applications. In Proceedings of the 22nd Conference of the ComputerHuman Interaction Special Interest Group of Australia on Computer-Human Interaction (OZCHI '10), 41--48. http://dx.doi.org/10.1145/1952222.1952233","paperID":"None"},{"content":"Gilles Bailly, Eric Lecolinet, and Laurence Nigay. 2008. Flower menus. In Proceedings of the working conference on Advanced visual interfaces (AVI '08), 15--22. http://dx.doi.org/10.1145/1385569.1385575","paperID":"None"},{"content":"Gilles Bailly, Jörg Müller, and Eric Lecolinet. 2012. Design and evaluation of finger-count interaction: Combining multitouch gestures and menus. Int. J. Hum.-Comput. Stud. 70, 10 (October 2012), 673--689. http://dx.doi.org/10.1016/j.ijhcs.2012.05.006","paperID":"None"},{"content":"Olivier Bau and Wendy E. Mackay. 2008. OctoPocus. In Proceedings of the 21st annual ACM symposium on User interface software and technology (UIST '08), 37--46. http://dx.doi.org/10.1145/1449715.1449724","paperID":"None"},{"content":"Hrvoje Benko, T. Scott Saponas, Dan Morris, and Desney Tan. 2009. Enhancing input on and above the interactive surface with muscle sensing. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '09), 93--100. http://dx.doi.org/10.1145/1731903.1731924","paperID":"None"},{"content":"Eric A. Bier, Maureen C. Stone, Ken Pier, William Buxton, Tony D. DeRose. 1993. Toolglass and magic lenses: the see-through interface. In Proceedings of the 20th annual conference on Computer graphics and interactive techniques (SIGGRAPH '93), 73--80.","paperID":"None"},{"content":"Volkert Buchmann, Stephen Violich, Mark Billinghurst, and Andy Cockburn. 2004. FingARtips. In Proceedings of the 2nd international conference on Computer graphics and interactive techniques in Austalasia and Southe East Asia (GRAPHITE '04), 212--221. http://dx.doi.org/10.1145/988834.988871","paperID":"None"},{"content":"Andy Cockburn, Philip Quinn, Carl Gutwin, Gonzalo Ramos, and Julian Looser. 2011. Air pointing: Design and evaluation of spatial target acquisition with and without visual feedback. Int. J. Hum.-Comput. Stud. 69, 6 (June 2011), 401--414. http://dx.doi.org/10.1016/j.ijhcs.2011.02.005","paperID":"None"},{"content":"Kiran Dandekar, Balasundar I. Raju, and Mandayam A. Srinivasan. 2003. 3-D Finite-Element Models of Human and Monkey Fingertips to Investigate the Mechanics of Tactile Sense. Journal of Biomechanical Engineering 125, 5 (2003), 682--691. http://dx.doi.org/10.1115/1.1613673","paperID":"None"},{"content":"Chi Tai Dang, Martin Straub, and Elisabeth André. 2009. Hand distinction for multi-touch tabletop interaction. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '09), 101--108. http://doi.acm.org/10.1145/1731903.1731925","paperID":"None"},{"content":"Rudolph P. Darken and John L. Sibert. 1996. Wayfinding strategies and behaviors in large virtual worlds. In Proceedings of the SIGCHI conference on Human factors in computing systems common ground (CHI '96), 142--150. http://dx.doi.org/10.1145/238386.238459","paperID":"None"},{"content":"Paul Dietz and Darren Leigh. 2001. DiamondTouch. In Proceedings of the 14th annual ACM symposium on User interface software and technology (UIST '01), 219--226. http://dx.doi.org/10.1145/502348.502389","paperID":"None"},{"content":"Brian D. Ehret. 2002. Learning where to look. In Proceedings of the SIGCHI conference on Human factors in computing systems Changing our world, changing ourselves (CHI '02), 211--218. http://dx.doi.org/10.1145/503376.503414","paperID":"None"},{"content":"Philipp Ewerling, Alexander Kulik, and Bernd Froehlich. 2012. Finger and hand detection for multitouch interfaces based on maximally stable extremal regions. In Proceedings of the 2012 ACM international conference on Interactive tabletops and surfaces (ITS '12, 173--182. http://dx.doi.org/10.1145/2396636.2396663","paperID":"None"},{"content":"Aaron M. Genest, Carl Gutwin, Anthony Tang, Michael Kalyn, and Zenja Ivkovic. 2013. KinectArms: a toolkit for capturing and displaying arm embodiments in distributed tabletop groupware. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13, 157--166. http://dx.doi.org/10.1145/2441776.2441796","paperID":"None"},{"content":"Emilien Ghomi, Stéphane Huot, Olivier Bau, Michel Beaudouin-Lafon, and Wendy E. Mackay. 2013. Arpège: learning multitouch chord gestures vocabularies. In Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces (ITS '13), 209--218. http://dx.doi.org/10.1145/2512349.2512795","paperID":"None"},{"content":"Yves Guiard. 1987. Asymmetric Division of Labor in Human Skilled Bimanual Action: The Kinematic Chain as a Model. Journal of Motor Behaviour 1987, Vo1. 19, No. 4, 486--517.","paperID":"None"},{"content":"François Guimbretiére and Terry Winograd. 2000. FlowMenu: combining command, text, and data entry. In Proceedings of the 13th annual ACM symposium on User interface software and technology (UIST '00), 213--216. http://dx.doi.org/10.1145/354401.354778","paperID":"None"},{"content":"Sean Gustafson, Daniel Bierwirth, and Patrick Baudisch. 2010. Imaginary interfaces: spatial interaction with empty hands and without visual feedback. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10), 3--12. http://dx.doi.org/10.1145/1866029.1866033","paperID":"None"},{"content":"Sean Gustafson, Christian Holz, and Patrick Baudisch. 2011. Imaginary phone: learning imaginary interfaces by transferring spatial memory from a familiar device. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11), 283--292. http://dx.doi.org/10.1145/2047196.2047233","paperID":"None"},{"content":"Carl Gutwin, Andy Cockburn, Joey Scarr, Sylvain Malacria, and Scott C. Olson. 2014. Faster command selection on tablets with FastTap. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14), 2617--2626. http://dx.doi.org/10.1145/2556288.2557136","paperID":"None"},{"content":"Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In P. A. Hancock and N. Meshkati (Eds.) Human Mental Workload. Amsterdam: North Holland Press.","paperID":"None"},{"content":"Christian Holz and Patrick Baudisch. 2010. The generalized perceived input point model and how to double touch accuracy by extracting fingerprints. In Proceedings of the 28th international conference on Human factors in computing systems (CHI '10), 581590. http://dx.doi.org/10.1145/1753326.1753413","paperID":"None"},{"content":"Paul Kabbash, William Buxton, and Abigail Sellen. 1994. Two-handed input in a compound task. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '94), 417--423. http://dx.doi.org/10.1145/191666.191808","paperID":"None"},{"content":"Kenrick Kin, Björn Hartmann, and Maneesh Agrawala. 2011. Two-handed marking menus for multitouch devices. ACM Transactions on Computer-Human Interaction 18, 3, Article 16 (August 2011), 23 pages. http://dx.doi.org/10.1145/1993060.1993066","paperID":"None"},{"content":"Gordon Paul Kurtenbach. 1993. The design and evaluation of marking menus. PhD Thesis, University of Toronto.","paperID":"None"},{"content":"Gordon Kurtenbach and William Buxton. 1994. User learning and performance with marking menus. In Conference companion on Human factors in computing systems (CHI '94), 258--264. http://dx.doi.org/10.1145/259963.260376","paperID":"None"},{"content":"Gordon Kurtenbach, George W. Fitzmaurice, Russell N. Owen, and Thomas Baudel. 1999. The Hotbox: efficient access to a large number of menu-items. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '99), 231--237. http://dx.doi.org/10.1145/302979.303047","paperID":"None"},{"content":"Gordon Kurtenbach, Thomas P. Moran, and William Buxton. 1994. Contextual animation of gestural commands. Computer Graphics Forum. Vol. 13. No. 5. Blackwell Science Ltd.","paperID":"None"},{"content":"Gordon Kurtenbach, Abigail Sellen, and William Buxton. 1993. An Empirical Evaluation of Some Articulatory and Cognitive Aspects of Marking Menus. Human-Comp. Interaction 8, 1 (mar 1993), 123. http://dx.doi.org/10.1207/s15327051hci0801_1","paperID":"None"},{"content":"G. Julian Lepinski, Tovi Grossman, and George Fitzmaurice. 2010. The design and evaluation of multitouch marking menus. In Proceedings of the 28th international conference on Human factors in computing systems (CHI '10), 2233--2242. http://dx.doi.org/10.1145/1753326.1753663","paperID":"None"},{"content":"Julien Letessier and François Bérard. 2004. Visual tracking of bare fingers for interactive surfaces. In Proceedings of the 17th annual ACM symposium on User interface software and technology (UIST '04), 119--122. http://doi.acm.org/10.1145/1029632.1029652","paperID":"None"},{"content":"Frank Chun Yat Li, David Dearman, and Khai N. Truong. 2009. Virtual shelves: interactions with orientation aware devices. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09), 125--128. http://dx.doi.org/10.1145/1622176.1622200","paperID":"None"},{"content":"Hao Lü and Yang Li. 2011. Gesture avatar: a technique for operating mobile user interfaces using gestures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11, 207--216. http://dx.doi.org/10.1145/1978942.1978972","paperID":"None"},{"content":"Sylvain Malacria, Gilles Bailly, Joel Harrison, Andy Cockburn, and Carl Gutwin. 2013. Promoting Hotkey use through rehearsal with ExposeHK. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13, 573--582. http://dx.doi.org/10.1145/2470654.2470735","paperID":"None"},{"content":"Pekka Parhi, Amy K. Karlson, and Benjamin B. Bederson. 2006. Target size study for one-handed thumb use on small touchscreen devices. In Proceedings of the 8th conference on Humancomputer interaction with mobile devices and services (MobileHCI '06), 203--210. http://dx.doi.org/10.1145/1152215.1152260","paperID":"None"},{"content":"George Robertson, Mary Czerwinski, Kevin Larson, Daniel C. Robbins, David Thiel, and Maarten van Dantzich. 1998. Data mountain. In Proceedings of the 11th annual ACM symposium on User interface software and technology (UIST '98), 153--162. http://dx.doi.org/10.1145/288392.288596","paperID":"None"},{"content":"Quentin Roy, Sylvain Malacria, Yves Guiard, Eric Lecolinet, and James Eagan. 2013. Augmented letters: mnemonic gesture-based shortcuts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13, 2325--2328. http://dx.doi.org/10.1145/2470654.2481321","paperID":"None"},{"content":"Joey Scarr, Andy Cockburn, Carl Gutwin, and Andrea Bunt. 2012. Improving command selection with CommandMaps. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems (CHI '12), 257--266. http://dx.doi.org/10.1145/2207676.2207713","paperID":"None"},{"content":"Dominik Schmidt, Ming Ki Chong, and Hans Gellersen. 2010. HandsDown. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction Extending Boundaries (NordiCHI '10), 432-441. http://dx.doi.org/10.1145/1868914.1868964","paperID":"None"},{"content":"Dominik Schmidt, Ming Ki Chong, and Hans Gellersen. 2010. IdLenses. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10), 131-134. http://dx.doi.org/10.1145/1936652.1936678","paperID":"None"},{"content":"Daniel Vogel. 2010. Direct Pen Input and Hand Occlusion. Ph.D Dissertation. University of Toronto. Retrieved from http://tspace.library.utoronto.ca/handle/1807/24905","paperID":"None"},{"content":"Daniel Vogel and Géry Casiez. 2012. Hand occlusion on a multi-touch tabletop. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). 2307--2316. http://dx.doi.org/10.1145/2207676.2208390","paperID":"None"},{"content":"Julie Wagner, Eric Lecolinet, and Ted Selker. 2014. Multi-finger chords for hand-held tablets: recognizable and memorable. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 2883--2892. http://dx.doi.org/10.1145/2556288.2556958","paperID":"None"},{"content":"Robert Y. Wang and Jovan Popović. 2009. Real-time hand-tracking with a color glove. ACM Trans. Graph. 28, 3, Article 63 (July 2009), 8 pages. http://doi.acm.org/10.1145/1531326.1531369","paperID":"None"},{"content":"Mike Wu and Ravin Balakrishnan. 2003. Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays. In Proceedings of the 16th annual ACM symposium on User interface software and technology (UIST '03), 193--202. http://dx.doi.org/10.1145/964696.964718","paperID":"None"},{"content":"Shengdong Zhao, Maneesh Agrawala, and Ken Hinckley. 2006. Zone and polygon menus. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI '06), 1077--1086. http://dx.doi.org/10.1145/1124772.1124933","paperID":"None"}],"abstract":"Command selection on large multi-touch surfaces can be difficult, because the large surface means that there are few landmarks to help users build up familiarity with controls. However, people's hands and fingers are landmarks that are always present when interacting with a touch display. To explore the use of hands as landmarks, we designed two hand-centric techniques for multi-touch displays -- one allowing 42 commands, and one allowing 160 -- and tested them in an empirical comparison against standard tab widgets. We found that the small version (HandMark-Fingers) was significantly faster at all stages of use, and that the large version (HandMark-Multi) was slower at the start but equivalent to tabs after people gained experience with the technique. There was no difference in error rates, and participants strongly preferred both of the HandMark menus over tabs. We demonstrate that people's intimate knowledge of their hands can be the basis for fast and feasible interaction techniques that can improve the performance and usability of interactive tables and other multi-touch systems.","title":"HandMark Menus: Rapid Command Selection and Large Command Sets on Multi-Touch Displays","filename":"CHI16/p5836","authors":["Md. Sami Uddin","Carl Gutwin","Benjamin Lafreniere"],"conference":"CHI '16"}