{"paperId":2858255,"citation":[],"abstract":"Temporal terms, such as 'winter', 'Christmas', or 'January' are often used in search queries for personal images. But how do people's memories and perceptions of time match with the actual dates when their images were captured? We compared the temporal terms that 74 Flickr users used to search their own photo collections, and compared them to the date captured data in the target image. We also conducted a larger study across several billion images, comparing user-applied tags for holidays and seasons to the dates the images were captured. We demonstrate that various query terms and tags can be in conflict with the actual dates photos were taken for specific types of temporal terms up to 40% of the time. We will conclude by highlighting implications for search systems where users are querying for personal content by date.","reference":[{"content":"Morgan Ames, Dean Eckles, Mor Naaman, Mirjana Spasojevic, and Nancy Van House. 2010. Requirements for mobile photoware. Personal and Ubiquitous Computing 14, 2 (2010), 95--109.","paperID":"None"},{"content":"Frank Bentley and Crysta Metcalf. 2006. Flexible Views: Annotating and finding context-tagged mobile content. In Ubicomp 2006 workshop on Pervasive Image Capture and Sharing. Citeseer.","paperID":"None"},{"content":"W Bruce Croft, Donald Metzler, and Trevor Strohman. 2010. Search engines: Information retrieval in practice. Addison-Wesley Reading.","paperID":"None"},{"content":"Marc Davis, Simon King, Nathan Good, and Risto Sarvas. 2004. From context to content: leveraging context to infer media metadata. In Proceedings of the 12th annual ACM international conference on Multimedia. ACM, 188--195.","paperID":"None"},{"content":"David Frohlich, Allan Kuchinsky, Celine Pering, Abbe Don, and Steven Ariss. 2002. Requirements for photoware. In Proceedings of the 2002 ACM conference on Computer supported cooperative work. ACM, 166--175.","paperID":"None"},{"content":"Mary Meeker. 2014. 2014 Internet Trends. (2014). http://www.kpcb.com/internet-trends","paperID":"None"},{"content":"Mor Naaman, Susumu Harada, QianYing Wang, Hector Garcia-Molina, and Andreas Paepcke. 2004. Context data in geo-referenced digital photo collections. In Proceedings of the 12th annual ACM international conference on Multimedia. ACM, 196--203.","paperID":"None"},{"content":"Meredith Ringel, Edward Cutrell, Susan Dumais, and Eric Horvitz. 2003. Milestones in time: The value of landmarks in retrieving information from personal stores. In Proc. Interact, Vol. 2003. 184--191.","paperID":"None"},{"content":"Bart Thomee, Jose G Moreno, and David A Shamma. 2014. Who's Time Is It Anyway?: Investigating the Accuracy of Camera Timestamps. In Proceedings of the ACM International Conference on Multimedia. ACM, 909--912.","paperID":"None"},{"content":"Steve Whittaker, Ofer Bergman, and Paul Clough. 2010. Easy on that trigger dad: a study of long term family photo retrieval. Personal and Ubiquitous Computing 14, 1 (2010), 31--43.","paperID":"None"}],"title":"The 32 Days of Christmas: Understanding Temporal Intent in Image Search Queries","filename":"CHI16/p5710","authors":["Frank R. Bentley","Joseph 'Jofish' Kaye","David A. Shamma","John Alexis Guerra-Gomez"],"conference":"CHI '16"}