{"paperId":2858051,"abstract":"Many technologies assume a single user will use an account or device. But account and device sharing situations (when 2+ people use a single device or account) may arise during everyday life. We present results from a multiple-methods study of device and account sharing practices among household members and their relations. Among our findings are that device and account sharing was common, and mobile phones were often shared despite being considered \"personal\" devices. Based on our study results, we organize sharing practices into a taxonomy of six sharing types--distinct patterns of what, why, and how people shared. We also present two themes that cut across sharing types: that (1) trust in sharees and (2) convenience highly influenced sharing practices. Based on these findings, we discuss implications for study and technology design.","citation":[],"reference":[{"content":"Lalit Agarwal, Nisheeth Shrivastava, Sharad Jaiswal, and Saurabh Panjwani. 2013. Do Not Embarrass: Reexamining User Concerns for Online Tracking and Advertising. Proceedings of the Ninth Symposium on Usable Privacy and Security, 8:1-8:13. http://doi.org/10.1145/2501604.2501612","paperID":"None"},{"content":"Mario Aguilar. Go Check Up On Your Google Privacy Settings in the New Accounts Page. Gizmodo. Retrieved August 21, 2015 from http://gizmodo.com/gocheck-up-on-your-google-privacy-settings-in-the-new-","paperID":"None"},{"content":"Deena Alghamdi, Ivan Flechais, and Marina Jirotka. 2015. Security Practices for Households Bank Customers in the Kingdom of Saudi Arabia. Eleventh Symposium On Usable Privacy and Security (SOUPS 2015), 297-308.","paperID":"None"},{"content":"Antonella De Angeli, Uday Athavankar, Anirudha Joshi, Lynne Coventry, and Graham I. Johnson. 2004. Introducing ATMs in India: a contextual inquiry. Interacting with Computers 16, 1: 29-44.","paperID":"None"},{"content":"Jakob E. Bardram. 2005. The trouble with login: on usability and computer security in ubiquitous computing. Personal Ubiquitous Computing 9: 357-367. http://doi.org/10.1007/s00779-005-0347--6","paperID":"None"},{"content":"Susanne Bødker and Ellen Christiansen. 2012. Poetry in motion - Appropriation of the world of Apps. ACM.","paperID":"None"},{"content":"Susanne Bødker and Erik Grönvall. 2013. Calendars: Time Coordination and Overview in Families and Beyond. Proceedings of the 13th European Conference on Computer Supported Cooperative Work, SpringerVerlag.","paperID":"None"},{"content":"A. J. Bernheim Brush and Kori M. Inkpen. 2007. Yours, Mine and Ours? Sharing and Use of Technology in Domestic Environments. Proceedings of the 9th International Conference on Ubiquitous Computing (UbiComp '07), 109-126.","paperID":"None"},{"content":"Britta Busse and Marek Fuchs. 2013. Prevalence of Cell Phone Sharing. Survey Methods: Insights from the Field. http://doi.org/10.13094/SMIF-2013-00004","paperID":"None"},{"content":"Ivan Cherapau, Ildar Muslukhov, Nalin Asanka, and Konstantin Beznosov. 2015. On the Impact of Touch ID on iPhone Passcodes. Eleventh Symposium On Usable Privacy and Security (SOUPS 2015), 257-276.","paperID":"None"},{"content":"Serge Egelman, A.J. Bernheim Brush, and Kori M. Inkpen. 2008. Family Accounts: A New Paradigm for User Accounts Within the Home Environment. Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08), 669-678. http://doi.org/10.1145/1460563.1460666","paperID":"None"},{"content":"Serge Egelman, Sakshi Jain, Rebecca S. Portnoff, Kerwell Liao, Sunny Consolvo, and David Wagner. 2014. Are You Ready to Lock? Understanding User Motivations for Smartphone Locking Behaviors. Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security (CCS '14), 750-761. http://doi.org/10.1145/2660267.2660273","paperID":"None"},{"content":"Bob Evans. 2014. PACO. Retrieved from https://www.pacoapp.com/","paperID":"None"},{"content":"David Frohlich and Robert Kraut. 2003. The Social Context of Home Computing. In Inside the Smart Home, R. Harper (ed.). Springer-Verlag, London, 127- 162.","paperID":"None"},{"content":"Rebecca E. Grinter, W. Keith Edwards, Mark W. Newman, and Nicolas Ducheneaut. 2005. The Work to Make a Home Network Work. Proceedings of the Ninth Conference on European Conference on Computer Supported Cooperative Work (ECSCW '05), 469-488.","paperID":"None"},{"content":"Alina Hang, Emanuel Von Zezschwitz, Er De Luca, and Heinrich Hussmann. 2012. Too much Information! User Attitudes towards Smartphone Sharing. Proceedings of the 7th Nordic Conference on HumanComputer Interaction (NordiCHI '12), 284-287. http://doi.org/10.1145/2399016.2399061","paperID":"None"},{"content":"Eiji Hayashi, Oriana Riva, Karin Strauss, A.J. Bernheim Brush, and Schechter Stuart. 2012. Goldilocks and the Two Mobile Devices: Going Beyond All-OrNothing Access to a Device's Applications. Symposium On Usable Privacy and Security (SOUPS). http://doi.org/10.1145/2335356.2335359","paperID":"None"},{"content":"Jeffrey James and Mila Versteeg. 2007. Mobile phones in Africa: How much do we really know? Social Indicators Research 84, 1: 117-126. http://doi.org/10.1007/s11205-006--9079-x","paperID":"None"},{"content":"Amy K. Karlson, A.J. Bernheim Brush, and Stuart Schechter. 2009. Can I Borrow Your Phone?: Understanding Concerns when Sharing Mobile Phones. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1647-1650. http://doi.org/10.1145/1518701.1518953","paperID":"None"},{"content":"Yunxin Liu, Ahmad Rahmati, Yuanhe Huang, et al. 2009. xShare: Supporting Impromptu Sharing of Mobile Phones. Proceedings of the 7th international conference on Mobile systems, applications, and services (MobiSys '09), 15-28. http://doi.org/10.1145/1555816.1555819","paperID":"None"},{"content":"Michelle L. Mazurek, J.P. Arsenault, Joanna Bresee, et al. 2010. Access Control for Home Data Sharing: Attitudes, Needs and Practices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). http://doi.org/10.1145/1753326.1753421","paperID":"None"},{"content":"Andrew D. Miller and W. Keith Edwards. 2007. Give and Take: A Study of Consumer Photo-sharing Culture and Practice. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 347-356. http://doi.org/10.1145/1240624.1240682","paperID":"None"},{"content":"M.R. Morris, A. Cassanego, A. Paepcke, T. Winograd, A.M. Piper, and A. Huang. 2006. Mediating Group Dynamics through Tabletop Interface Design. IEEE Computer Graphics and Applications 26, 5: 65-73. http://doi.org/10.1109/MCG.2006.114","paperID":"None"},{"content":"Hendrik Muller, Jennifer L. Gove, and John S. Webb. 2012. Understanding Tablet Use: A Multi-Method Exploration. Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services (MobileHCI '12), 1-10. http://doi.org/10.1145/2371574.2371576","paperID":"None"},{"content":"Laura L. Murphy and Alexandra E. Priebe. 2011. \"My co-wife can borrow my mobile phone!\" Gendered Geographies of Cell Phone Usage and Significance for Rural Kenyans. Gender Technology and Development 15, 1: 1-23. http://doi.org/10.1177/097185241101500101","paperID":"None"},{"content":"Elizabeth D. Mynatt, Takeo Igarashi, W. Keith Edwards, and Anthony LaMarca. 1999. Flatland: New Dimensions in Office Whiteboards. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99), 346-353. http://doi.org/10.1145/302979.303108","paperID":"None"},{"content":"Stuart Schechter. 2013. The User IS the Enemy, and (S)he Keeps Reaching for that Bright Shiny Power Button! The Security and Privacy Impacts of Children and Childhood on Technology for the Home. Symposium On Usable Privacy and Security (SOUPS), Workshop on Home Usable Privacy and Security (HUPS).","paperID":"None"},{"content":"Julian Seifert, Alexander De Luca, Bettina Conradi, and Heinrich Hussmann. 2010. TreasurePhone: Context-sensitive User Data Protection on Mobile Phones. Proceedings of the 8th International Conference on Pervasive Computing (Pervasive '10), 130-137. http://doi.org/10.1007/978--3--642--12654--3_8","paperID":"None"},{"content":"N. Sadat Shami, Michael Muller, and David Millen. 2011. Browse and discover: Social file sharing in the enterprise. Proceedings of the ACM 2011 conference on Computer supported cooperative work (CSCW '11), 295-304. http://doi.org/10.1145/1958824.1958868","paperID":"None"},{"content":"Supriya Singh, Anuja Cabraal, Catherine Demosthenous, Gunela Astbrink, and Michele Furlong. 2007. Password Sharing: Implications for Security Design Based on Social Practice. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), 895-904. http://doi.org/10.1145/1240624.1240759","paperID":"None"},{"content":"Molly Wright Steenson and Jonathan Donner. 2008. Beyond the Personal and Private: Modes of Mobile Phone Sharing in Urban India. In The Reconstruction of Space and Time: Mobile Communication Practices, S.W. Campbell and R. Ling (eds.). Transaction Publishers, 231-250.","paperID":"None"},{"content":"David R. Thomas. 2006. A General Inductive Approach for Analyzing Qualitative Evaluation Data. American Journal of Evaluation 27, 2: 237-246. http://doi.org/10.1177/1098214005283748","paperID":"None"},{"content":"Eran Toch, Yang Wang, and Lorrie Faith Cranor. 2012. Personalization and privacy: a survey of privacy risks and remedies in personalization-based systems. User Modeling and User-Adapted Interaction 22, 1--2: 203- 220. http://doi.org/10.1007/s11257-011--9110-z","paperID":"None"},{"content":"Charlotte D. W. Vinkers, Catrin Finkenauer, and Skyler T. Hawk. 2011. Why do close partners snoop? Predictors of intrusive behavior in newlywed couples. Personal Relationships 18: 110-124. http://doi.org/10.1111/j.1475--6811.2010.01314.x","paperID":"None"},{"content":"Blue dinosaur to help Facebook privacy push. BBC News. Retrieved August 21, 2015 from http://www.bbc.com/news/technology-29111393","paperID":"None"}],"title":"\"She'll just grab any device that's closer\": A Study of Everyday Device & Account Sharing in Households","filename":"CHI16/p5921","authors":["Tara Matthews","Kerwell Liao","Anna Turner","Marianne Berkovich","Robert Reeder","Sunny Consolvo"],"conference":"CHI '16"}