{"paperId":2858426,"citation":[],"reference":[{"content":"Matthias Böhmer, Brent Hecht, Johannes Schöning, Antonio Krüger, and Gernot Bauer. 2011. Falling asleep with Angry Birds, Facebook and Kindle: A large scale study on mobile application usage. In Proceedings of the conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '11), 47--56. http://dx.doi.org/10.1145/2037373.2037383","paperID":"None"},{"content":"Jessica Cauchard, Markus Löchtefeld, Mike Fraser, Antonio Krüger, and Sriram Subramanian. 2012. m+pSpaces: virtual workspaces in the spatially-aware mobile environment. In Proceedings of the conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '12). http://dx.doi.org/10.1145/2371574.2371601","paperID":"None"},{"content":"Ayumi Fukuchi, Koji Tsukada, and Itiro Siio. 2013. AwareCover: Interactive cover fif the smartphone for awareness sharing. In Universal Access in Human-Computer Interaction: Applications and Services for Quality of Life, Constantine Stephanidis and Margherita Antona (eds.). Springer Berlin Heidelberg, New York, 620-625. http://dx.doi.org/10.1007/978--3--642--39194--1_71","paperID":"None"},{"content":"Gizmag. Prototype mobile phone covers foreshadow new wave of E Ink displays, Retrieved August 6, 2015 from http://www.gizmag.com/e-ink-mobile-phonecovers/29063/","paperID":"None"},{"content":"Jaemin Jo, Bohyoung Kim, and Jinwook Seo. 2015. EyeBookmark: Assisting recovery from interruption during reading. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 2963-2966. http://doi.org/10.1145/2702123.2702340","paperID":"None"},{"content":"Philip Kortum and Mary Sorber. 2015. Measuring the usability of mobile applications for phones and tablets. International Journal of Human-Computer Interaction 31, 8: 518--529. http://doi.org/10.1080/10447318.2015.1064658","paperID":"None"},{"content":"Luis Leiva, Matthias Böhmer, Sven Gehring, and Antonio Krüger.2012. Back to the app: the costs of mobile application interruptions. In Proceedings of the conference on Human-computer interaction with mobile devices and services (MobileHCI'12). http://dx.doi.org/10.1145/2371574.2371617","paperID":"None"},{"content":"Nielsen Norman Group. Multitasking on Mobile Devices, Retrieved August 5, 2015 from http://www.nngroup.com/articles/multitasking-mobile","paperID":"None"},{"content":"Martin Pielot, Karen Church, and Rodrigo de Oliveira. 2014. An in-situ study of mobile phone notifications. In Proceedings of the conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '14), 233--242. http://dx.doi.org/10.1145/2628363.2628364","paperID":"None"},{"content":"Christian Rendl, David Kim, Sean Fanello, Patrick Parzer, Christoph Rhemann, Jonathan Taylor, Martin Zirkl, Gregor Scheipl, Thomas Rothländer, Michael Haller, and Shahram Izadi. 2014. FlexSense: A transparent self-sensing deformable surface. In Proceedings of the symposium on User interface software and technology (UIST '14), 129-138. http://doi.org/10.1145/2642918.2647405","paperID":"None"},{"content":"Meredith Ringel. 2003. When one isn't enough. In Proceedings of the SIGCHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI '03), 762763. http://doi.org/10.1145/765891.765976","paperID":"None"},{"content":"Fletcher R. Rothkopf. 2012. Cover attachment with display, Patent No. US20120194448, Filed August 11, 2011, issued August 2, 2012.","paperID":"None"},{"content":"Martin Spindler, Marcel Martsch, and Raimund Dachselt. 2012. Going Beyond the Surface: Studying Multi-Layer Interaction Above the Tabletop. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12), 1277--1286. http://dx.doi.org/10.1145/2207676.2208583","paperID":"None"},{"content":"Martin Spindler, Wolfgang Büschel, and Raimund Dachselt. 2012. Use Your Head: Tangible Windows for 3D Information Spaces in a Tabletop Environment. In Proceedings of the 2012 ACM international conference on Interactive tabletops and surfaces (ITS'12), 245254. http://dx.doi.org/10.1145/2396636.2396674","paperID":"None"},{"content":"Statista. Most used instant messaging apps 2015, Retrieved September 10, 2015 from http://www.statista.com/statistics/258749/mostpopular-global-mobile-messenger-apps/","paperID":"None"},{"content":"Martina Ziefle. 1998. Effects of display resolution on visual performance. The Journal of the Human Factors and Ergonomics Society 40, 4: 554--568. http://dx.doi.org/10.1518/001872098779649355","paperID":"None"}],"abstract":"Most smartphones support multi-tasking with several means to switch between apps (e.g., a \"recent apps\" button or a \"back\" button). However, switching between apps is cumbersome when one has to do it frequently for example, when notifications keep interrupting one's current task. We introduce Peek-a-View, a fully transparent flipping screen cover that can reduce task switching overhead by providing an additional virtual screen space for subtasks. We assessed its feasibility in handling notifications. Upon receiving a notification, users can peek into the content of the notification without actually switching apps by slightly lifting the cover. If necessary, users can completely flip the cover to switch to the app that fired the notification. Two user studies showed that flipping and peeking interaction provided improved performance and proved to be useful for tasks that involve subtasks.","title":"Peek-a-View: Smartphone Cover Interaction for Multi-Tasking","filename":"CHI16/p4658","authors":["Koeun Choi","Hyunjoo Song","Kyle Koh","Jinwook Bok","Jinwook Seo"],"conference":"CHI '16"}