{"paperId":2858067,"citation":[],"reference":[{"content":"Erik M. Altmann, Gregory J. Trafton, and David Z. Hambrick. 2013. Momentary Interruptions Can Derail the Train of Thought. Journal of Experimental Psychology: General 143, 1: 215-226. http://doi.org/10.1037/a0030986","paperID":"None"},{"content":"Gerry Armitage. 2008. Double checking medicines: defence against error or contributory factor? Journal of Evaluation in Clinical Practice 14, 4: 513-519. http://doi.org/10.1111/j.1365--2753.2007.00907.x","paperID":"None"},{"content":"Jonathan Back, Duncan P. Brumby, and Anna L Cox. 2010. Locked-out: investigating the effectiveness of system lockouts to reduce errors in routine tasks. CHI '10 Extended Abstracts on Human Factors in Computing Systems, ACM, 3775-3780. http://doi.org/10.1145/1753846.1754054","paperID":"None"},{"content":"Jelmer P. Borst, Trudy A. Buwalda, Hedderik van Rijn, and Niels A. Taatgen. 2013. Avoiding the problem state bottleneck by strategic use of the environment. Acta Psychologica 144, 2: 373-379. http://doi.org/10.1016/j.actpsy.2013.07.016","paperID":"None"},{"content":"Jelmer P. Borst, Niels A. Taatgen, and Hedderik van Rijn. 2015. What Makes Interruptions Disruptive?: A Process-Model Account of the Effects of the Problem State Bottleneck on Task Interruption and Resumption. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2971-2980. http://doi.org/10.1145/2702123.2702156","paperID":"None"},{"content":"Juliana J. Brixey, Zhihua Tang, David J. Robinson, et al. 2008. Interruptions in a level one trauma center: A case study. International Journal of Medical Informatics 77, 4: 235-241. http://doi.org/10.1016/j.ijmedinf.2007.04.006","paperID":"None"},{"content":"Duncan P. Brumby, Anna L. Cox, Jonathan Back, and Sandy J. J. Gould. 2013. Recovering from an interruption: Investigating speed-accuracy trade-offs in task resumption behavior. Journal of Experimental Psychology: Applied 19, 2: 95-107. http://doi.org/10.1037/a0032696","paperID":"None"},{"content":"Michael D. Byrne and Susan Bovair. 1997. A Working Memory Model of a Common Procedural Error. Cognitive Science 21, 1: 31-61. http://doi.org/10.1207/s15516709cog2101_2","paperID":"None"},{"content":"Paul Cairns, Pratyush Pandab, and Christopher Power. 2014. The Influence of Emotion on Number Entry Errors. Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2293-2296. http://doi.org/10.1145/2556288.2557065","paperID":"None"},{"content":"Jesse Chandler, Pam Mueller, and Gabriele Paolacci. 2014. Nonnaïveté among Amazon Mechanical Turk workers: Consequences and solutions for behavioral researchers. Behavior Research Methods 46, 1: 112- 130. http://doi.org/10.3758/s13428-013-0365--7","paperID":"None"},{"content":"Suzanne C. Charman and Andrew Howes. 2003. The Adaptive User: An Investigation Into the Cognitive and Task Constraints on the Generation of New Methods. Journal of Experimental Psychology: Applied 9, 4: 236-248. http://doi.org/10.1037/1076--898X.9.4.236","paperID":"None"},{"content":"Carey D Chisholm, Edgar K Collison, David R Nelson, and William H Cordell. 2000. Emergency Department Workplace Interruptions Are Emergency Physicians \"Interrupt-driven\" and \"Multitasking\"? Academic Emergency Medicine 7, 11: 1239-1243. http://doi.org/10.1111/j.1553--2712.2000.tb00469.x","paperID":"None"},{"content":"Laura Dabbish, Gloria Mark, and Víctor M González. 2011. Why do I keep interrupting myself?: environment, habit and self-interruption. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3127-3130. http://doi.org/10.1145/1978942.1979405","paperID":"None"},{"content":"Serge Egelman, Lorrie Faith Cranor, and Jason Hong. 2008. You've Been Warned: An Empirical Study of the Effectiveness of Web Browser Phishing Warnings. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1065-1074. http://doi.org/10.1145/1357054.1357219","paperID":"None"},{"content":"William Gardner, Edward P. Mulvey, and Esther C. Shaw. 1995. Regression analyses of counts and rates: Poisson, overdispersed Poisson, and negative binomial models. Psychological Bulletin 118, 3: 392-404. http://doi.org/10.1037/0033--2909.118.3.392","paperID":"None"},{"content":"Laura Germine, Ken Nakayama, Bradley C. Duchaine, Christopher F. Chabris, Garga Chatterjee, and Jeremy B. Wilmer. 2012. Is the Web as good as the lab? Comparable performance from Web and lab in cognitive/perceptual experiments. Psychonomic Bulletin & Review 19, 5: 847-857. http://doi.org/10.3758/s13423-012-0296--9","paperID":"None"},{"content":"Victor M. González and Gloria Mark. 2004. \"Constant, constant, multi-tasking craziness\": managing multiple working spheres. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 113-120. http://doi.org/10.1145/985692.985707","paperID":"None"},{"content":"Joseph K. Goodman, Cynthia E. Cryder, and Amar Cheema. 2013. Data Collection in a Flat World: The Strengths and Weaknesses of Mechanical Turk Samples. Journal of Behavioral Decision Making 26, 3: 213-224. http://doi.org/10.1002/bdm.1753","paperID":"None"},{"content":"Sandy J. J. Gould, Anna L. Cox, and Duncan P. Brumby. 2013. Frequency and Duration of Selfinitiated Task-switching in an Online Investigation of Interrupted Performance. Human Computation and Crowdsourcing: Works in Progress and Demonstration Abstracts AAAI Technical Report CR-13-01, AAAI, 22-23.","paperID":"None"},{"content":"Sandy J. J. Gould, Anna L. Cox, Duncan P. Brumby, and Sarah Wiseman. 2015. Home is Where the Lab is: A Comparison of Online and Lab Data From a Time sensitive Study of Interruption. Human Computation 2, 1: 45-67. http://doi.org/10.15346/hc.v2i1.4","paperID":"None"},{"content":"Wayne D. Gray and Deborah A. Boehm-Davis. 2000. Milliseconds matter: An introduction to microstrategies and to their use in describing and predicting interactive behavior. Journal of Experimental Psychology: Applied 6, 4: 322-335. http://doi.org/10.1037/1076898X.6.4.322","paperID":"None"},{"content":"Robert A. Green, George Hripcsak, Hojjat Salmasian, et al. 2015. Intercepting Wrong-Patient Orders in a Computerized Provider Order Entry System. Annals of Emergency Medicine 65, 6: 679-686.e1. http://doi.org/10.1016/j.annemergmed.2014.11.017","paperID":"None"},{"content":"Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 203-212. http://doi.org/10.1145/1753326.1753357","paperID":"None"},{"content":"Helen M. Hodgetts and Dylan M. Jones. 2006. Interruption of the Tower of London task: Support for a goal-activation approach. Journal of Experimental Psychology: General 135, 1: 103-115. http://doi.org/10.1037/0096--3445.135.1.103","paperID":"None"},{"content":"Ling Jiang, C. Wagner, and B. Nardi. 2015. Not Just in it for the Money: A Qualitative Investigation of Workers' Perceived Benefits of Micro-task Crowdsourcing. 2015 48th Hawaii International Conference on System Sciences (HICSS), 773-782. http://doi.org/10.1109/HICSS.2015.98","paperID":"None"},{"content":"Jing Jin and Laura A Dabbish. 2009. Self-interruption on the computer: a typology of discretionary task interleaving. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1799-1808. http://doi.org/10.1145/1518701.1518979","paperID":"None"},{"content":"Adam Kapelner and Dana Chandler. 2010. Preventing Satisficing in online surveys. CrowdConf.","paperID":"None"},{"content":"Ioanna Katidioti and Niels A. Taatgen. 2014. Choice in Multitasking How Delays in the Primary Task Turn a Rational Into an Irrational Multitasker. Human Factors: The Journal of the Human Factors and Ergonomics Society 56, 4: 728-736. http://doi.org/10.1177/0018720813504216","paperID":"None"},{"content":"Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 453-456. http://doi.org/10.1145/1357054.1357127","paperID":"None"},{"content":"Steven Komarov, Katharina Reinecke, and Krzysztof Z. Gajos. 2013. Crowdsourcing Performance Evaluations of User Interfaces. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 207-216. http://doi.org/10.1145/2470654.2470684","paperID":"None"},{"content":"Ross Koppel, Tosha Wetterneck, Joel Leon Telles, and Ben-Tzion Karsh. 2008. Workarounds to Barcode Medication Administration Systems: Their Occurrences, Causes, and Threats to Patient Safety. Journal of the American Medical Informatics Association 15, 4: 408-423. http://doi.org/10.1197/jamia.M2616","paperID":"None"},{"content":"Paul T Lee, Frankie Thompson, and Harold Thimbleby. 2012. Analysis of infusion pump error logs and their significance for health care. British Journal of Nursing 21, Sup5: S12-S20. http://doi.org/10.12968/bjon.2012.21.Sup5.S12","paperID":"None"},{"content":"Simon Y. W. Li, Ann Blandford, Paul Cairns, and Richard M. Young. 2008. The Effect of Interruptions on Post-completion and Other Procedural Errors: An Account Based on the Activation-Based Goal Memory Model. Journal of Experimental Psychology: Applied 14, 4: 314-328. http://doi.org/10.1037/a0014397","paperID":"None"},{"content":"Simon Y. W. Li, Anna L. Cox, Ann Blandford, Paul Cairns, and A. Abeles. 2006. Further investigations into post-completion error: the effects of interruption position and duration. Proceedings of the 28th Annual Meeting of the Cognitive Science Conference, Cognitive Science Society, 471-476.","paperID":"None"},{"content":"Gloria Mark, Victor M González, and Justin Harris. 2005. No task left behind?: examining the nature of fragmented work. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 321-330. http://doi.org/10.1145/1054972.1055017","paperID":"None"},{"content":"Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior Research Methods 44, 1: 1-23. http://doi.org/10.3758/s13428-011-0124--6","paperID":"None"},{"content":"Christopher A. Monk, J. Gregory Trafton, and Deborah A. Boehm-Davis. 2008. The Effect of Interruption Duration and Demand on Resuming Suspended Goals. Journal of Experimental Psychology: Applied 14, 4: 299-313. http://doi.org/10.1037/a0014402","paperID":"None"},{"content":"Kenton P. O'Hara and Stephen J. Payne. 1998. The Effects of Operator Implementation Cost on Planfulness of Problem Solving and Learning. Cognitive Psychology 35, 1: 34-70. http://doi.org/10.1006/cogp.1997.0676","paperID":"None"},{"content":"Kenton P. O'Hara and Stephen J. Payne. 1999. Planning and the user interface: the effects of lockout time and error recovery cost. International Journal of Human-Computer Studies 50, 1: 41-59. http://doi.org/10.1006/ijhc.1998.0234","paperID":"None"},{"content":"Patrick Oladimeji, Harold Thimbleby, and Anna Cox. 2011. Number Entry Interfaces and Their Effects on Error Detection. In Human-Computer Interaction - INTERACT 2011, Pedro Campos, Nicholas Graham, Joaquim Jorge, Nuno Nunes, Philippe Palanque and Marco Winckler (eds.). Springer Berlin Heidelberg, 178-185. http://doi.org/10.1007/978--3--642--237683_15","paperID":"None"},{"content":"Kai A. Olsen. 2008. The $100,000 Keying Error. Computer 41, 106-108. http://doi.org/10.1109/MC.2008.135","paperID":"None"},{"content":"Antti Oulasvirta and Pertti Saariluoma. 2006. Surviving task interruptions: Investigating the implications of long-term working memory theory. International Journal of Human-Computer Studies 64, 10: 941-961. http://doi.org/10.1016/j.ijhcs.2006.04.006","paperID":"None"},{"content":"Gabriele Paolacci and Jesse Chandler. 2014. Inside the Turk Understanding Mechanical Turk as a Participant Pool. Current Directions in Psychological Science 23, 3: 184-188. http://doi.org/10.1177/0963721414531598","paperID":"None"},{"content":"Gabriele Paolacci, Jesse Chandler, and Panagiotis G. Ipeirotis. 2010. Running experiments on Amazon Mechanical Turk. Judgment and Decision Making 5, 5: 411-419.","paperID":"None"},{"content":"Stephen J. Payne and Andrew Howes. 2013. Adaptive Interaction: A Utility Maximization Approach to Understanding Human Interaction with Technology. Synthesis Lectures on Human-Centered Informatics 6, 1: 1-111. http://doi.org/10.2200/S00479ED1V01Y201302HCI01","paperID":"None"},{"content":"Eyal Peer, Joachim Vosgerau, and Alessandro Acquisti. 2014. Reputation as a sufficient condition for data quality on Amazon Mechanical Turk. Behavior Research Methods 46, 4: 1023-1031. http://doi.org/10.3758/s13428-013-0434-y","paperID":"None"},{"content":"Raj M. Ratwani, J. Malcolm McCurry, and J. Gregory Trafton. 2008. Predicting postcompletion errors using eye movements. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 539-542. http://doi.org/10.1145/1357054.1357141","paperID":"None"},{"content":"L. T. C Rolt. 2007. Red for danger: the classic history of British railway disasters. Sutton, Stroud.","paperID":"None"},{"content":"Jeffrey M. Rzeszotarski and Aniket Kittur. 2012. CrowdScape: interactively visualizing user behavior and output. Proceedings of the 25th annual ACM symposium on User interface software and technology, ACM, 55-62. http://doi.org/10.1145/2380116.2380125","paperID":"None"},{"content":"Dario D. Salvucci. 2010. On reconstruction of task context after interruption. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 89-92. http://doi.org/10.1145/1753326.1753341","paperID":"None"},{"content":"Harold Thimbleby. 2008. Ignorance of interaction programming is killing people. interactions 15, 5: 52- 57. http://doi.org/10.1145/1390085.1390098","paperID":"None"},{"content":"Harold Thimbleby and Paul Cairns. 2010. Reducing number entry errors: solving a widespread, serious problem. Journal of The Royal Society Interface 7, 51: 1429-1439. http://doi.org/10.1098/rsif.2010.0112","paperID":"None"},{"content":"Ricardo Mark Villamarín-Salomón and José Carlos Brustoloni. 2010. Using Reinforcement to Strengthen Users' Secure Behaviors. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 363-372. http://doi.org/10.1145/1753326.1753382","paperID":"None"},{"content":"Johanna I Westbrook, Enrico Coiera, William T M Dunsmuir, et al. 2010. The impact of interruptions on clinical task completion. Quality and Safety in Health Care 19, 4: 284-289. http://doi.org/10.1136/qshc.2009.039255","paperID":"None"},{"content":"Sarah Wiseman, Duncan P. Brumby, Anna L. Cox, and Orla Hennessy. 2013. Tailoring Number Entry Interfaces To The Task of Programming Medical Infusion Pumps. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 57, 1: 683- 687. http://doi.org/10.1177/1541931213571148","paperID":"None"},{"content":"Sarah Wiseman, Paul Cairns, and Anna Cox. 2011. A Taxonomy of Number Entry Error. Proceedings of the 25th BCS Conference on Human-Computer Interaction, British Computer Society, 187-196.","paperID":"None"},{"content":"Sarah Wiseman, Anna L. Cox, Duncan P. Brumby, Sandy J.J. Gould, and Sarah O'Carroll. 2013. Using Checksums to Detect Number Entry Error. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2403-2406. http://doi.org/10.1145/2470654.2481332","paperID":"None"}],"abstract":"Data-entry is a common activity that is usually performed accurately. When errors do occur though, people are poor at spotting them even if they are told to check their input. We considered whether making people pause for a brief moment before confirming their input would make them more likely to check it. We ran a lab experiment to test this idea. We found that task lockouts encouraged checking. Longer lockout durations made checking more likely. We ran a second experiment on a crowdsourcing platform to find out whether lockouts would still be effective in a less controlled setting. We discovered that longer lockouts induced workers to switch to other activities. This made the lockouts less effective. To be useful in practice, the duration of lockouts needs to be carefully calibrated. If lockouts are too brief they will not encourage checking. If they are too long they will induce switching.","title":"Now Check Your Input: Brief Task Lockouts Encourage Checking, Longer Lockouts Encourage Task Switching","filename":"CHI16/p3311","authors":["Sandy J.J. Gould","Anna L. Cox","Duncan P. Brumby","Alice Wickersham"],"conference":"CHI '16"}