{"paperId":2858574,"citation":[],"reference":[{"content":"Ernest Adams. 2010. Fundamentals of Game Design. New Riders.","paperID":"None"},{"content":"Gazihan Alankus, Amanda Lazar, Matt May, and Caitlin Kelleher. 2010. Towards customizable games for stroke rehabilitation. Proceedings of the 28th international conference on Human factors in computing systems, ACM, 2113-2122. http://doi.org/10.1145/1753326.1753649","paperID":"None"},{"content":"Christine Bailey and Michael Katchabaw. 2005. An experimental testbed to enable auto-dynamic difficulty in modern video games. Proceedings of the 2005 GameOn North America Conference, 18-22. Retrieved September 21, 2015 from http://mmm.csd.uwo.ca/faculty/katchab/pubs/gameonn a2005_add.pdf","paperID":"None"},{"content":"Roger Bakeman. 2005. Recommended effect size statistics for repeated measures designs. Behavior Research Methods 37, 3: 379-384. http://doi.org/10.3758/BF03192707","paperID":"None"},{"content":"Gary Bente. 2009. Making the implicit explicit. Embedded measurement in serious games.","paperID":"None"},{"content":"Max Birk and Regan L. Mandryk. 2013. Control your game-self: effects of controller type on enjoyment, motivation, and personality in game. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 685-694. http://doi.org/10.1145/2470654.2470752","paperID":"None"},{"content":"Max V. Birk, Regan L. Mandryk, Matthew K. Miller, and Kathrin M. Gerling. 2015. How Self-Esteem Shapes Our Interactions with Play Technologies. Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, ACM, 35-45. http://doi.org/10.1145/2793107.2793111","paperID":"None"},{"content":"Guillaume Chanel, Cyril Rebetez, Mireille Bétrancourt, and Thierry Pun. 2008. Boredom, engagement and anxiety as indicators for adaptation to difficulty in games. Proceedings of the 12th international conference on Entertainment and media in the ubiquitous era, ACM, 13-17. http://doi.org/10.1145/1457199.1457203","paperID":"None"},{"content":"Darryl Charles and Michaela Black. 2004. Dynamic player modeling: A framework for player-centered digital games. Proc. of the International Conference on Computer Games: Artificial Intelligence, Design and Education, 29-35. Retrieved November 26, 2012 from http://research.rmutp.ac.th/paper/cu/DynamicPlayerModelling.pdf","paperID":"None"},{"content":"Jenova Chen. 2006. fl0w - source code. Retrieved September 25, 2015 from http://www.thatgamecompany.com/forum/viewtopic.php?p=4255&sid=5af8dfad64831dfb41b7bc4e66c1a165#p4255","paperID":"None"},{"content":"Jenova Chen. 2007. Flow in games (and everything else). Commun. ACM 50, 4: 31-34. http://doi.org/10.1145/1232743.1232769","paperID":"None"},{"content":"Jenova Chen. Flow in Games. Retrieved September 19, 2011 from http://jenovachen.com/flowingames/Flow_in_games_final.pdf","paperID":"None"},{"content":"Ben Cowley, Darryl Charles, Michaela Black, and Ray Hickey. 2008. Toward an Understanding of Flow in Video Games. Comput. Entertain. 6, 2: 20:1-20:27. http://doi.org/10.1145/1371216.1371223","paperID":"None"},{"content":"Chris Crawford. 1984. The Art of Computer Game Design. Osborne/McGraw-Hill.","paperID":"None"},{"content":"John R. Crawford and Julie D. Henry. 2004. The Positive and Negative Affect Schedule (PANAS): Construct validity, measurement properties and normative data in a large non-clinical sample. British Journal of Clinical Psychology 43, 3: 245-265.","paperID":"None"},{"content":"Mihaly Csikszentmihalyi. 1990. Flow: The Psychology of Optimal Experience. Harper & Row, New York.","paperID":"None"},{"content":"Mihaly Csikszentmihalyi and K. Rathunde. 1992. The measurement of flow in everyday life: toward a theory of emergent motivation. Nebraska Symposium on Motivation. Nebraska Symposium on Motivation 40: 57-97.","paperID":"None"},{"content":"Anders Drachen, Alessandro Canossa, and Georgios N. Yannakakis. 2009. Player modeling using self-organization in tomb raider: underworld. Computational Intelligence and Games, 2009. CIG 2009. IEEE Symposium on, 1-8.","paperID":"None"},{"content":"David M. Erceg-Hurn and Vikki M. Mirosevich. 2008. Modern robust statistical methods: An easy way to maximize the accuracy and power of your research. American Psychologist 63, 7: 591-601. http://doi.org/10.1037/0003-066X.63.7.591","paperID":"None"},{"content":"Terri Flowerday and Gregory Schraw. 2003. Effect of Choice on Cognitive and Affective Engagement. The Journal of Educational Research 96, 4: 207-215. http://doi.org/10.1080/00220670309598810","paperID":"None"},{"content":"Sandro Franceschini, Simone Gori, Milena Ruffino, Simona Viola, Massimo Molteni, and Andrea Facoetti. 2013. Action Video Games Make Dyslexic Children Read Better. Current Biology. http://doi.org/10.1016/j.cub.2013.01.044","paperID":"None"},{"content":"Yue Gao and Regan L. Mandryk. 2012. The Acute Cognitive Benefits of Casual Exergame Play. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems, 1863-1872.","paperID":"None"},{"content":"Kathrin Maria Gerling, Frank Paul Schulte, Jan Smeddinck, and Maic Masuch. 2012. Game Design for Older Adults: Effects of Age-Related Changes on Structural Elements of Digital Games. In Entertainment Computing ICEC 2012, Marc Herrlich, Rainer Malaka and Maic Masuch (eds.). Springer Berlin Heidelberg, 235-242. Retrieved January 18, 2013 from http://link.springer.com/chapter/10.1007/978--3--64233542--6_20","paperID":"None"},{"content":"Kathrin M. Gerling, Kristen K. Dergousoff, and Regan L. Mandryk. 2013. Is Movement Better?: Comparing Sedentary and Motion-based Game Controls for Older Adults. Proceedings of Graphics Interface 2013, Canadian Information Processing Society, 133-140. Retrieved September 21, 2015 from http://dl.acm.org/citation.cfm?id=2532129.2532153","paperID":"None"},{"content":"Kathrin M. Gerling, Regan L. Mandryk, Matthew Miller, Michael R. Kalyn, Max Birk, and Jan D. Smeddinck. 2015. Designing Wheelchair-Based Movement Games. ACM Trans. Access. Comput. 6, 2: 6:1-6:23. http://doi.org/10.1145/2724729","paperID":"None"},{"content":"Kathrin M. Gerling, Matthew Miller, Regan L. Mandryk, Max Birk, and Jan Smeddinck. 2014. Effects of Balancing for Physical Abilities on Player Performance, Experience and Self-Esteem in Exergames. CHI'14: Proceedings of the 2014 CHI Conference on Human Factors in Computing Systems. Retrieved February 11, 2014 from https://hci.usask.ca/uploads/331-paper122.pdf","paperID":"None"},{"content":"Kiel M. Gilleade and Alan Dix. 2004. Using frustration in the design of adaptive videogames. Proceedings of the 2004 ACM SIGCHI International Conference on Advances in computer entertainment technology, ACM, 228-232. http://doi.org/10.1145/1067343.1067372","paperID":"None"},{"content":"Hamilton A. Hernandez, T. C. Graham, Darcy Fehlings, et al. 2012. Design of an exergaming station for children with cerebral palsy. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems, 2619-2628. Retrieved May 24, 2013 from http://dl.acm.org/citation.cfm?id=2208652","paperID":"None"},{"content":"Johan Huizinga. 2008. Homo ludens: proeve eener bepaling van het spel-element der cultuur. Amsterdam University Press.","paperID":"None"},{"content":"Robin Hunicke. 2005. The case for dynamic difficulty adjustment in games. Proceedings of the 2005 ACM SIGCHI International Conference on Advances in computer entertainment technology, 429-433.","paperID":"None"},{"content":"Marshall G. Jones. 1998. Creating Electronic Learning Environments: Games, Flow, and the User Interface. Retrieved September 17, 2015 from http://eric.ed.gov/?id=ED423842","paperID":"None"},{"content":"Arvid Kappas. 2010. Smile when you read this, whether you like it or not: Conceptual challenges to affect detection. IEEE Transactions on Affective Computing, 1, 1: 38-41.","paperID":"None"},{"content":"Pamela M. Kato. 2012. Evaluating Efficacy and Validating Games for Health. Games for Health Journal 1, 1: 74-76. http://doi.org/10.1089/g4h.2012.1017","paperID":"None"},{"content":"K. Kuikkaniemi, T. Laitinen, M. Turpeinen, T. Saari, I. Kosunen, and N. Ravaja. 2010. The influence of implicit and explicit biofeedback in first-person shooter games. Proceedings of the 28th international conference on Human factors in computing systems, 859-868. Retrieved August 17, 2012 from http://dl.acm.org/citation.cfm?id=1753453","paperID":"None"},{"content":"E McAuley, T Duncan, and V V Tammen. 1989. Psychometric properties of the Intrinsic Motivation Inventory in a competitive sport setting: a confirmatory factor analysis. Research quarterly for exercise and sport 60, 1: 48-58.","paperID":"None"},{"content":"Giovanni B. Moneta. 2012. On the Measurement and Conceptualization of Flow. In Advances in Flow Research, Stefan Engeser (ed.). Springer New York, 23-50. Retrieved September 17, 2015 from http://link.springer.com/chapter/10.1007/978--1--46142359--1_2","paperID":"None"},{"content":"A. Quilici. 1994. Forming user models by understanding user feedback. User Modeling and User-Adapted Interaction 3, 4: 321-358.","paperID":"None"},{"content":"Leonard Reinecke, Ron Tamborini, Matthew Grizzard, Robert Lewis, Allison Eden, and Nicholas David Bowman. 2012. Characterizing Mood Management as Need Satisfaction: The Effects of Intrinsic Needs on Selective Exposure and Mood Repair. Journal of Communication 62, 3: 437-453. http://doi.org/10.1111/j.1460--2466.2012.01649.x","paperID":"None"},{"content":"Scott Rigby and Richard Ryan. 2007. The Player Experience of Need Satisfaction(PENS): an applied model and methodology for understanding key components of the player experience.","paperID":"None"},{"content":"Scott Rigby and Richard Ryan. 2011. Glued to Games: How Video Games Draw Us In and Hold Us Spellbound. Praeger.","paperID":"None"},{"content":"Ute Ritterfeld, Michael Cody, and Peter Vorderer. 2009. Serious Games: Mechanisms and Effects. Routledge.","paperID":"None"},{"content":"Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30, 4: 344-360. http://doi.org/10.1007/s11031-006--9051--8","paperID":"None"},{"content":"Katie Salen and Eric Zimmerman. 2003. Rules of play: game design fundamentals. MIT Press, Cambridge, Mass.","paperID":"None"},{"content":"Rosa García Sánchez, Alasdair G. Thin, Jannicke Baalsrud Hauge, et al. 2012. Value Propositions for Serious Games in Health and Well-Being. In Serious Games Development and Applications, Minhua Ma, Manuel Fradinho Oliveira, Jannicke Baalsrud Hauge, Heiko Duin and Klaus-Dieter Thoben (eds.). Springer Berlin Heidelberg, 150-157. Retrieved July 5, 2013 from http://link.springer.com/chapter/10.1007/978--3642--33687--4_12","paperID":"None"},{"content":"Thomas B. Sheridan. 2001. Rumination on automation, 1998. Annual Reviews in Control 25: 89-97. http://doi.org/10.1016/S1367--5788(01)00009--8","paperID":"None"},{"content":"Jan David Smeddinck, Marc Herrlich, and Rainer Malaka. 2015. Exergames for Physiotherapy and Rehabilitation: A Medium-term Situated Study of Motivational Aspects and Impact on Functional Reach. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 4143- 4146. http://doi.org/10.1145/2702123.2702598","paperID":"None"},{"content":"Jan Smeddinck, Sandra Siegel, and Marc Herrlich. 2013. Adaptive Difficulty in Exergames for Parkinson's disease Patients. Proceedings of Graphics Interface 2013.","paperID":"None"},{"content":"Penelope Sweetser and Peta Wyeth. 2005. GameFlow: A Model for Evaluating Player Enjoyment in Games. Comput. Entertain. 3, 3: 3-3. http://doi.org/10.1145/1077246.1077253","paperID":"None"},{"content":"Jane Webster and And Others. 1993. The Dimensionality and Correlates of Flow in Human-Computer Interactions. Computers in Human Behavior 9, 4: 411-26.","paperID":"None"},{"content":"Philip Zigoris and Yi Zhang. 2006. Bayesian adaptive user profiling with explicit & implicit feedback. Proceedings of the 15th ACM international conference on Information and knowledge management, ACM, 397-404. http://doi.org/10.1145/1183614.1183672","paperID":"None"}],"abstract":"Matching game difficulty to player ability is a crucial step toward a rewarding player experience, yet making difficulty adjustments that are effective yet unobtrusive can be challenging. This paper examines the impact of automatic and player-initiated difficulty adjustment on player experience through two studies. In the first study, 40 participants played the casual game THYFTHYF either in motion-based or sedentary mode, using menu-based, embedded, or automatic difficulty adjustment. In the second study, we created an adapted version of the commercially available game fl0w to allow us to carry out a more focused study of sedentary casual play. Results from both studies demonstrate that the type of difficulty adjustment has an impact on perceived autonomy, but other player experience measures were not affected as expected. Our findings suggest that most players express a preference for manual difficulty choices, but that overall game experience was not notably impacted by automated difficulty adjustments.","title":"How to Present Game Difficulty Choices?: Exploring the Impact on Player Experience","filename":"CHI16/p5595","authors":["Jan D. Smeddinck","Regan L. Mandryk","Max V. Birk","Kathrin M. Gerling","Dietrich Barsilowski","Rainer Malaka"],"conference":"CHI '16"}