{"paperId":2858065,"citation":[],"reference":[{"content":"Jens Ahrens, Matthias Geier, and Sascha Spors. 2008. The SoundScape Renderer: A unified spatial audio reproduction framework for arbitrary rendering methods. In Audio Engineering Society Convention. Audio Engineering Society. http://www.aes.org/e-lib/browse.cfm?elib=14460","paperID":"None"},{"content":"David Alais and David Burr. 2004. Ventriloquist Effect Results from Near-Optimal Bimodal Integration. Current Biology 14, 3 (2004), 257--262. DOI: http://dx.doi.org/10.1016/S0960--9822(04)00043-0","paperID":"None"},{"content":"Paul W. Anderson and Pavel Zahorik. 2014. Auditory/visual distance estimation: accuracy and variability. Frontiers in Psychology 5 (2014), 1--11. DOI: http://dx.doi.org/10.3389/fpsyg.2014.01097","paperID":"None"},{"content":"Daniel Artaega. 2013. An ambisonics decoder for irregular 3D loudspeaker arrays. In Journal of the Audio Engineering Society. Audio Engineering Society. https://www.researchgate.net/publication/256802720","paperID":"None"},{"content":"Peter W. Battaglia, Robert A. Jacobs, and Richard N. Aslin. 2003. Bayesian integration of visual and auditory signals for spatial localization. Journal of the Optical Society of America. A, Optics, image science, and vision 20, 7 (2003), 1391--1397. DOI: http://dx.doi.org/10.1364/JOSAA.20.001391","paperID":"None"},{"content":"Daphne Bavelier, Matthew W.G. Dye, and Peter C. Hauser. 2006. Do deaf individuals see better? Trends in Cognitive Sciences 10, 11 (2006), 512--518. DOI: http://dx.doi.org/10.1016/j.tics.2006.09.006","paperID":"None"},{"content":"Leslie E. Cameron, Joanna C. Tai, and Marisa Carrasco. 2002. Covert attention affects the psychometric function of contrast sensitivity. Vision Research 42, 8 (2002), 949--967. DOI: http://dx.doi.org/10.1016/S0042--6989(02)00039--1","paperID":"None"},{"content":"Jason S. Chan, Corrina Maguinness, Danuta Lisiecka, Annalisa Setti, and Fiona N. Newell. 2012. Evidence for crossmodal interactions across depth on target localisation performance in a spatial array. Perception 41, 7 (2012), 757--773. DOI: http://dx.doi.org/10.1068/p7230","paperID":"None"},{"content":"Marc O. Ernst and Martin S. Banks. 2002. Humans integrate visual and haptic information in a statistically optimal fashion. Nature 415, 6870 (2002), 429--433. DOI: http://dx.doi.org/10.1038/415429a","paperID":"None"},{"content":"Simone Fug, Stephan Werner, and Karlheinz Brandenburg. 2012. Controlled Auditory Distance Perception using Binaural Headphone Reproduction Algorithms and Evaluation. Tonmeistertagung - VDT International Conference November (2012). https://www.researchgate.net/publication/235707006","paperID":"None"},{"content":"Miguel A. Garca-Perez. 1998. Forced-choice staircases with fixed step sizes: asymptotic and small-sample properties. Vision Research 38, 12 (1998), 1861--1881. DOI: http://dx.doi.org/10.1016/S0042--6989(97)00340--4","paperID":"None"},{"content":"Marcin Gorzel, David Corrigan, Gavin Kearney, John Squires, and Frank Boland. 2012. Distance Perception in Virtual Audio-Visual Environments. 25th UK Conference of the Audio Engineering Society: Spatial Audio In Today's 3D World (2012), 1--8. http://www.researchgate.net/publication/230751682","paperID":"None"},{"content":"Timofey Y. Grechkin, Tien Dat Nguyen, Jodie M. Plumert, James F. Cremer, and Joseph K. Kearney. 2010. How does presentation method and measurement protocol affect distance estimation in real and virtual environments? ACM Transactions on Applied Perception 7, 4 (2010), 1--18. DOI: http://dx.doi.org/10.1145/1823738.1823744","paperID":"None"},{"content":"Adam J. Jones, Edward J. Swan II, and Mark Bolas. 2013. Peripheral Stimulation and its Effect on Perceived Spatial Scale in Virtual Environments. IEEE Transactions on Visualization and Computer Graphics 19, 4 (2013), 701--710. DOI: http://dx.doi.org/10.1109/TVCG.2013.37","paperID":"None"},{"content":"Gavin Kearney, Marcin Gorzel, Frank Boland, and Henry Rice. 2010. Depth Perception in Interactive Virtual Acoustic Environments Using Higher Order Ambisonic Soundfields. Proc. of the 2nd International Symposium on Ambisonics and Spherical Acoustics, 2010, May 6--7, Paris, France (2010). https://www.researchgate.net/publication/228448070","paperID":"None"},{"content":"Hae Young Kim, Yôiti Suzuki, Shouichi Takane, and Toshio Sone. 2001. Control of auditory distance perception based on the auditory parallax model. Applied Acoustics 62, 3 (2001), 245--270. DOI: http://dx.doi.org/10.1016/S0003-682X(00)00023-2","paperID":"None"},{"content":"Andrew J. Kolarik, Brian C. J. Moore, Pavel Zahorik, Silvia Cirstea, and Shahina Pardhan. 2015. Auditory distance perception in humans: a review of cues, development, neuronal bases, and effects of sensory loss. Attention, Perception, & Psychophysics (2015). DOI: http://dx.doi.org/10.3758/s13414-015-1015-1","paperID":"None"},{"content":"Scott. A. Kuhl, Sarah H. Creem-Regehr, and William B. Thompson. 2006a. Individual differences in accuracy of blind walking to targets on the floor. Journal of Vision 6, 6 (2006), 726--726. DOI: http://dx.doi.org/10.1167/6.6.726","paperID":"None"},{"content":"Scott A. Kuhl, William B. Thompson, and Sarah H. Creem-Regehr. 2006b. Minification influences spatial judgments in virtual environments. Proceedings of the 3rd Symposium on Applied Perception in Graphics and Visualization - APGV '06 1, 212 (2006), 15. DOI: http://dx.doi.org/10.1145/1140491.1140494","paperID":"None"},{"content":"Scott A. Kuhl, William B. Thompson, and Sarah H. Creem-Regehr. 2009. HMD calibration and its effects on distance judgments. ACM Transactions on Applied Perception 6, 3 (2009), 1--20. DOI: http://dx.doi.org/10.1145/1577755.1577762","paperID":"None"},{"content":"Chiuhsiang Joe Lin, Bereket Haile Woldegiorgis, Dino Caesaron, and Lai-Yu Cheng. 2015. Distance estimation with mixed real and virtual targets in stereoscopic displays. Displays 36 (2015), 41--48. DOI: http://dx.doi.org/10.1016/j.displa.2014.11.006","paperID":"None"},{"content":"Jack M. Loomis, Jose A. Da Silva, Naofumi Fujita, and Sergio S. Fukusima. 1992. Visual space perception and visually directed action. Journal of Experimental Psychology: Human Perception and Performance 18, 4 (1992), 906--921. DOI: http://dx.doi.org/10.1037/0096--1523.18.4.906","paperID":"None"},{"content":"Jack M. Loomis and John W. Philbeck. 2008. Measuring spatial perception with spatial updating and action. Taylor and Francis, Chapter 1, 1--43. http://www.tandf.net/books/details/9780805862881/","paperID":"None"},{"content":"Catarina Mendonça, Jorge A. Santos, Guilherme Campos, Paulo Dias, and Joao P. Ferreira. 2010. On the Impact of Training HRTF-Based Auralisation. Interaccao 2010 4 Conferencia Interaccao Pessoa-Maquina (2010), 1--5. http://webs.psi.uminho.pt/lvp/site/Publications","paperID":"None"},{"content":"Jorg Muller, Matthias Geier, Christina Dicke, and Sascha Spors. 2014. The boomRoom. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14. ACM Press, NY, NY, USA, 247--256. DOI: http://dx.doi.org/10.1145/2556288.2557000","paperID":"None"},{"content":"Gaetan Parseihian, Christophe Jouffrais, and Brian F. G. Katz. 2014. Reaching nearby sources: comparison between real and virtual sound and visual targets. Frontiers in Neuroscience 8, September (2014), 1--13. DOI: http://dx.doi.org/10.3389/fnins.2014.00269","paperID":"None"},{"content":"Achille Pasqualotto and Michael J. Proulx. 2012. The role of visual experience for the neural basis of spatial cognition. Neuroscience & Biobehavioral Reviews 36, 4 (2012), 1179--1187. DOI: http://dx.doi.org/10.1016/j.neubiorev.2012.01.008","paperID":"None"},{"content":"Ivelina V. Piryankova, Stephan De La Rosa, Uwe Kloos, Heinrich H. Bulthoff, and Betty J. Mohler. 2013. Egocentric distance perception in large screen immersive displays. Displays 34, 2 (2013), 153--164. DOI: http://dx.doi.org/10.1016/j.displa.2013.01.001","paperID":"None"},{"content":"Marc Rebillat, Xavier Boutillon, Etienne Corteel, and Brian F. G. Katz. 2012. Audio, Visual, and Audio-visual Egocentric Distance Perception by Moving Subjects in Virtual Environments. ACM Trans. Appl. Percept. 9, 4 (2012), 19:1--19:17. DOI: http://dx.doi.org/10.1145/2355598.2355602","paperID":"None"},{"content":"Rebekka S. Renner, Boris M. Velichkovsky, and Jens R. Helmert. 2013. The perception of egocentric distances in virtual environments - A review. Comput. Surveys 46, 2 (2013), 1--40. DOI: http://dx.doi.org/10.1145/2543581.2543590","paperID":"None"},{"content":"Monika Rychtarikova, Tim van den Bogaert, Gerrit Vermier, and Jan Wouters. 2009. Binaural sound source localization in real and virtual rooms. Journal of the Audio Engineering Society 57, 4 (2009), 205--220. http://www.aes.org/e-lib/browse.cfm?elib=14814","paperID":"None"},{"content":"Cynthia S. Sahm, Sarah H. Creem-Regehr, William B. Thompson, and Peter Willemsen. 2005. Throwing versus walking as indicators of distance perception in similar real and virtual environments. ACM Transactions on Applied Perception 2, 1 (2005), 35--45. DOI: http://dx.doi.org/10.1145/1048687.1048690","paperID":"None"},{"content":"Adalberto L Simeone, Eduardo Velloso, and Hans Gellersen. 2015. Substitutional Reality. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15. ACM Press, NY, NY, USA, 3307--3316. DOI: http://dx.doi.org/10.1145/2702123.2702389","paperID":"None"},{"content":"Charles Spence. 2013. Just how important is spatial coincidence to multisensory integration? Evaluating the spatial rule. Annals of the NY Academy of Sciences 1296, 1 (2013), 31--49. DOI: http://dx.doi.org/10.1111/nyas.12121","paperID":"None"},{"content":"Hong-Jin Sun, Jennifer L. Campos, and George S. W. Chan. 2004. Multisensory integration in the estimation of relative path length. Experimental Brain Research 154, 2 (2004), 246--254. DOI: http://dx.doi.org/10.1007/s00221-003--1652--9","paperID":"None"},{"content":"R Core Team. 2015. R: A language and environment for statistical computing. https://www.r-project.org/","paperID":"None"},{"content":"Amy Turner, Jonathan Berry, and Nick Holliman. 2011. Can the perception of depth in stereoscopic images be influenced by 3D sound? Displays 7863, February (2011). DOI: http://dx.doi.org/10.1117/12.871960","paperID":"None"},{"content":"David Waller and Adam R. Richardson. 2008. Correcting distance estimates by interacting with immersive virtual environments: effects of task and available sensory information. Journal of Experimental Psychology: Applied 14, 1 (2008), 61--72. DOI: http://dx.doi.org/10.1037/1076--898X.14.1.61","paperID":"None"},{"content":"Hadley Wickham. 2009. ggplot2 : Elegant graphics for data analysis. http://had.co.nz/ggplot2/book","paperID":"None"},{"content":"Peter Willemsen, Mark B. Colton, Sarah H. Creem-Regehr, and William B. Thompson. 2004. The effects of head-mounted display mechanical properties and field of view on distance judgments in virtual environments. ACM Transactions on Applied Perception 6, 2 (2004), 1--14. DOI: http://dx.doi.org/10.1145/1498700.1498702","paperID":"None"},{"content":"Haojie Wu, Daniel H. Ashmead, and Bobby Bodenheimer. 2009. Using immersive virtual reality to evaluate pedestrian street crossing decisions at a roundabout. Proceedings of the 6th Symposium on Applied Perception in Graphics and Visualization APGV '09 1, 212 (2009), 35. DOI: http://dx.doi.org/10.1145/1620993.1621001","paperID":"None"},{"content":"Pavel Zahorik. 2000. Distance localization using nonindividualized head-related transfer functions. The Journal of the Acoustical Society of America 108, 5 (2000), 2597. DOI: http://dx.doi.org/10.1121/1.4743664","paperID":"None"},{"content":"Pavel Zahorik. 2002a. Assessing auditory distance perception using virtual acoustics. The Journal of the Acoustical Society of America 111, 4 (2002), 1832--1846. DOI: http://dx.doi.org/10.1121/1.1458027","paperID":"None"},{"content":"Pavel Zahorik. 2002b. Direct-to-reverberant energy ratio sensitivity. The Journal of the Acoustical Society of America 112, 5 (2002), 2110--2117. DOI: http://dx.doi.org/10.1121/1.1506692","paperID":"None"},{"content":"Pavel Zahorik, Douglas S. Brungart, and Adelbert W. Bronkhorst. 2005. Auditory Distance Perception in Humans: A Summary of Past and Present Research. Acta Acustica united with Acustica 91, 3 (2005), 409--420. http://www.ingentaconnect.com/content/dav/aaua/2005/00000091/00000003/art00003","paperID":"None"},{"content":"Zhiying Zhou, Adrian David Cheok, Xubo Yang, and Yan Qiu. 2004. An experimental study on the role of software synthesized 3D sound in augmented reality environments. Interacting with Computers 16, 5 (2004), 989--1016. DOI: http://dx.doi.org/10.1016/j.intcom.2004.06.014","paperID":"None"}],"abstract":"A key requirement for a sense of presence in Virtual Environments (VEs) is for a user to perceive space as naturally as possible. One critical aspect is distance perception. When judging distances, compression is a phenomenon where humans tend to underestimate the distance between themselves and target objects (termed egocentric or absolute compression), and between other objects (exocentric or relative compression). Results of studies in virtual worlds rendered through head mounted displays are striking, demonstrating significant distance compression error. Distance compression is a multisensory phenomenon, where both audio and visual stimuli are often compressed with respect to their distances from the observer. In this paper, we propose and test a method for reducing crossmodal distance compression in VEs. We report an empirical evaluation of our method via a study of 3D spatial perception within a virtual reality (VR) head mounted display. Applying our method resulted in more accurate distance perception in a VE at longer range, and suggests a modification that could adaptively compensate for distance compression at both shorter and longer ranges. Our results have a significant and intriguing implication for designers of VEs: an incongruent audiovisual display, i.e. where the audio and visual information is intentionally misaligned, may lead to better spatial perception of a virtual scene.","title":"Compensating for Distance Compression in Audiovisual Virtual Environments Using Incongruence","filename":"CHI16/p200","authors":["Daniel J. Finnegan","Eamonn O'Neill","Michael J. Proulx"],"conference":"CHI '16"}