{"paperId":2858194,"citation":[],"reference":[{"content":"Apple Inc. Pages for iOS (iPad): Touchscreen basics. https://support.apple.com/kb/PH3571. Accessed: 2015-08-22.","paperID":"None"},{"content":"Au, O. K.-C., and Tai, C.-L. Multitouch finger registration and its applications. In Proc. OZCHI (2010), 41--48.","paperID":"None"},{"content":"Avery, J., Choi, M., Vogel, D., and Lank, E. Pinch-to-zoom-plus: An enhanced pinch-to-zoom that reduces clutching and panning. In Proc. UIST (2014), 595--604.","paperID":"None"},{"content":"Azenkot, S., and Zhai, S. Touch behavior with different postures on soft smartphone keyboards. In Proc. MobileHCI (2012), 251--260.","paperID":"None"},{"content":"Bachynskyi, M., Palmas, G., Oulasvirta, A., Steimle, J., and Weinkauf, T. Performance and ergonomics of touch surfaces: A comparative study using biomechanical simulation. In Proc. CHI (2015), 1817--1826.","paperID":"None"},{"content":"Banovic, N., Li, F. C. Y., Dearman, D., Yatani, K., and Truong, K. N. Design of unimanual multi-finger pie menu interaction. In Proc. ITS (2011), 120--129.","paperID":"None"},{"content":"Benko, H., Saponas, T. S., Morris, D., and Tan, D. Enhancing input on and above the interactive surface with muscle sensing. In Proc. ITS (2009), 93--100.","paperID":"None"},{"content":"Bi, X., Li, Y., and Zhai, S. Fitts law: Modeling finger touch with fitts' law. In Proc. CHI (2013), 1363--1372.","paperID":"None"},{"content":"Casiez, G., and Roussel, N. No more bricolage!: Methods and tools to characterize, replicate and compare pointing transfer functions. In Proc. UIST (2011), 603--614.","paperID":"None"},{"content":"Cockburn, A., Ahlström, D., and Gutwin, C. Understanding performance in touch selections: Tap, drag and radial pointing drag with finger, stylus and mouse. Int. J. Hum.-Comput. Stud. 70, 3 (Mar. 2012), 218--233.","paperID":"None"},{"content":"Colle, H. A., and Hiszem, K. J. Standing at a kiosk: Effects of key size and spacing on touch screen numeric keypad performance and user preference. Ergonomics 47, 13 (2004), 1406--1423. PMID: 15513716.","paperID":"None"},{"content":"Colley, A., and Häkkilä, J. Exploring finger specific touch screen interaction for mobile phone user interfaces. In Proc. OzCHI (2014), 539--548.","paperID":"None"},{"content":"Ewerling, P., Kulik, A., and Froehlich, B. Finger and hand detection for multi-touch interfaces based on maximally stable extremal regions. In Proc. ITS (2012), 173--182.","paperID":"None"},{"content":"Forlines, C., Wigdor, D., Shen, C., and Balakrishnan, R. Direct-touch vs. mouse input for tabletop displays. In Proc. CHI (2007), 647--656.","paperID":"None"},{"content":"Ghomi, E., Huot, S., Bau, O., Beaudouin-Lafon, M., and Mackay, W. E. Arpège: Learning multitouch chord gestures vocabularies. In Proc. ITS (2013), 209--218.","paperID":"None"},{"content":"Goguey, A., Casiez, G., Pietrzak, T., Vogel, D., and Roussel, N. Adoiraccourcix: Multi-touch Command Selection Using Finger Identification. In Proc. IHM (2014), 28--37.","paperID":"None"},{"content":"Goguey, A., Casiez, G., Vogel, D., Chevalier, F., Pietrzak, T., and Roussel, N. A Three-step Interaction Pattern for Improving Discoverability in Finger Identification Techniques. In Proc. UIST Adjunct (2014), 33--34.","paperID":"None"},{"content":"Gutwin, C., Cockburn, A., Scarr, J., Malacria, S., and Olson, S. C. Faster command selection on tablets with fasttap. In Proc. CHI (2014), 2617--2626.","paperID":"None"},{"content":"Hall, A. D., Cunningham, J. B., Roache, R. P., and Cox, J. W. Factors affecting performance using touch-entry systems: Tactual recognition fields and system accuracy. Journal of applied psychology 73, 4 (1988), 711.","paperID":"None"},{"content":"Hoggan, E., Williamson, J., Oulasvirta, A., Nacenta, M., Kristensson, P. O., and Lehtiö, A. Multi-touch rotation gestures: Performance and ergonomics. In Proc. CHI (2013), 3047--3050.","paperID":"None"},{"content":"Holz, C., and Baudisch, P. Understanding touch. In Proc. CHI (2011), 2501--2510.","paperID":"None"},{"content":"Holz, C., and Baudisch, P. Fiberio: A touchscreen that senses fingerprints. In Proc. UIST (2013), 41--50.","paperID":"None"},{"content":"ISO, I. 9241--9 ergonomic requirements for office work with visual display terminals (vdts)-part 9: Requirements for non-keyboard input devices (fdis-final draft international standard), 2000. International Organization for Standardization.","paperID":"None"},{"content":"Lepinski, G. J., Grossman, T., and Fitzmaurice, G. The design and evaluation of multitouch marking menus. In Proc. CHI (2010), 2233--2242.","paperID":"None"},{"content":"Ljubic, S., Glavinic, V., and Kukec, M. Finger-based pointing performance on mobile touchscreen devices: Fitts' law fits. In Universal Access in Human-Computer Interaction. Access to Today's Technologies, vol. 9175 of Lecture Notes in Computer Science, Springer International Publishing (2015), 318--329.","paperID":"None"},{"content":"Luo, Y., and Vogel, D. Crossing-based Selection with Direct Touch Input. In Proc. CHI (2014), 2627--2636.","paperID":"None"},{"content":"MacKenzie, I. S. A note on the information-theoretic basis for fitts' law. Journal of motor behavior 21, 3 (1989), 323--330.","paperID":"None"},{"content":"MacKenzie, I. S. Fitts' law as a research and design tool in human-computer interaction. Hum.-Comput. Interact. 7, 1 (Mar. 1992), 91--139.","paperID":"None"},{"content":"MacKenzie, I. S. A note on the validity of the shannon formulation for fitts' index of difficulty. Open Journal of Applied Sciences 3, 06 (2013), 360.","paperID":"None"},{"content":"Malik, S., Ranjan, A., and Balakrishnan, R. Interacting with large displays from a distance with vision-tracked multi-finger gestural input. In Proc. UIST (2005), 43--52.","paperID":"None"},{"content":"Marquardt, N., Kiemer, J., Ledo, D., Boring, S., and Greenberg, S. Designing user-, hand-, and handpart-aware tabletop interactions with the TouchID toolkit. In Proc. ITS (2011), 21--30.","paperID":"None"},{"content":"McManus, I., Kemp, R., and Grant, J. Differences between fingers and hands in tapping ability: dissociation between speed and regularity. Cortex 22, 3 (1986), 461--473.","paperID":"None"},{"content":"Micire, M., Schedlbauer, M., and Yanco, H. Horizontal selection: An evaluation of a digital tabletop input device. In Proc. AMCIS (2007), 164.","paperID":"None"},{"content":"Möllers, M., Dumont, N., Ladwig, S., and Borchers, J. Improving touch accuracy on large tabletops using predecessor and successor. In Proc. CHI (2013), 755--758.","paperID":"None"},{"content":"Moscovich, T., and Hughes, J. F. Multi-finger cursor techniques. In Proc. GI (2006), 1--7.","paperID":"None"},{"content":"Murugappan, S., Vinayak, Elmqvist, N., and Ramani, K. Extended multitouch: recovering touch posture and differentiating users using a depth camera. In Proc. UIST (2012), 487--496.","paperID":"None"},{"content":"Ng, A., Brewster, S. A., and Williamson, J. H. Investigating the effects of encumbrance on one- and two- handed interactions with mobile devices. In Proc. CHI (2014), 1981--1990.","paperID":"None"},{"content":"Ng, A., Lepinski, J., Wigdor, D., Sanders, S., and Dietz, P. Designing for low-latency direct-touch input. In Proc. UIST (2012), 453--464.","paperID":"None"},{"content":"Parhi, P., Karlson, A. K., and Bederson, B. B. Target size study for one-handed thumb use on small touchscreen devices. In Proc. MobileHCI (2006), 203--210.","paperID":"None"},{"content":"Park, Y. S., and Han, S. H. One-handed thumb interaction of mobile devices from the input accuracy perspective. International Journal of Industrial Ergonomics 40, 6 (2010), 746--756.","paperID":"None"},{"content":"Perry, K. B., and Hourcade, J. P. Evaluating one handed thumb tapping on mobile touchscreen devices. In Proc. GI (2008), 57--64.","paperID":"None"},{"content":"Po, B. A., Fisher, B. D., and Booth, K. S. Mouse and touchscreen selection in the upper and lower visual fields. In Proc. CHI (2004), 359--366.","paperID":"None"},{"content":"Potter, R. L., Weldon, L. J., and Shneiderman, B. Improving the accuracy of touch screens: an experimental evaluation of three strategies. In Proc. of the SIGCHI conference on Human factors in computing systems (1988), 27--32.","paperID":"None"},{"content":"Roy, Q., Guiard, Y., Bailly, G., Lecolinet, E., and Rioul, O. Glass+skin: An empirical evaluation of the added value of finger identification to basic single-touch interaction on touch screens. In Proc. INTERACT (2015), 55--71.","paperID":"None"},{"content":"Sasangohar, F., MacKenzie, I. S., and Scott, S. D. Evaluation of mouse and touch input for a tabletop display using fitts' reciprocal tapping task. In Proc. HFES (2009), 839--843.","paperID":"None"},{"content":"Scott MacKenzie, I. Fitts' throughput and the remarkable case of touch-based target selection. In Human-Computer Interaction: Interaction Technologies, M. Kurosu, Ed., vol. 9170 of Lecture Notes in Computer Science, Springer International Publishing (2015), 238--249.","paperID":"None"},{"content":"Sears, A., and Shneiderman, B. High precision touchscreens: Design strategies and comparisons with a mouse. Int. J. Man-Mach. Stud. 34, 4 (Apr. 1991), 593--613.","paperID":"None"},{"content":"Sugiura, A., and Koseki, Y. A user interface using fingerprint recognition: holding commands and data objects on fingers. In Proc. UIST (1998), 71--79.","paperID":"None"},{"content":"Vega, K., and Fuks, H. Beauty tech nails: Interactive technology at your fingertips. In Proc. TEI, ACM (2013), 61--64.","paperID":"None"},{"content":"Wagner, J., Lecolinet, E., and Selker, T. Multi-finger chords for hand-held tablets: Recognizable and memorable. In Proc. CHI (2014), 2883--2892.","paperID":"None"},{"content":"Wang, F., and Ren, X. Empirical Evaluation for Finger Input Properties in Multi-touch Interaction. In Proc. CHI (2009), 1063--1072.","paperID":"None"},{"content":"Wang, J., and Canny, J. FingerSense: augmenting expressiveness to physical pushing button by fingertip identification. In CHI EA (2004), 1267--1270.","paperID":"None"},{"content":"Westerman, W. Hand tracking, finger identification, and chordic manipulation on a multi-touch surface. PhD thesis, University of Delaware, 1999.","paperID":"None"},{"content":"Zhao, J., Soukoreff, R. W., and Balakrishnan, R. Exploring and modeling unimanual object manipulation on multi-touch displays. International Journal of Human-Computer Studies 78, 0 (2015), 68--80.","paperID":"None"}],"abstract":"The development of robust methods to identify which finger is causing each touch point, called \"finger identification,\" will open up a new input space where interaction designers can associate system actions to different fingers. However, relatively little is known about the performance of specific fingers as single touch points or when used together in a \"chord.\" We present empirical results for accuracy, throughput, and subjective preference gathered in five experiments with 48 participants exploring all 10 fingers and 7 two-finger chords. Based on these results, we develop design guidelines for reasonable target sizes for specific fingers and two-finger chords, and a relative ranking of the suitability of fingers and two-finger chords for common multi-touch tasks. Our work contributes new knowledge regarding specific finger and chord performance and can inform the design of future interaction techniques and interfaces utilizing finger identification.","title":"The Performance and Preference of Different Fingers and Chords for Pointing, Dragging, and Object Transformation","filename":"CHI16/p4250","authors":["Alix Goguey","Mathieu Nancel","Géry Casiez","Daniel Vogel"],"conference":"CHI '16"}