{"paperId":2858154,"citation":[],"abstract":"Sharing is an important facet of human relationships, yet there is a lack of research on how people share ownership of possessions. This paper reports on a study that investi-gates shared ownership of physical and digital possessions through interviews with couples and families in 13 house-holds. We offer a more nuanced definition of shared owner-ship and show that certain practices, which are central to sharing physical objects, are not supported in the sharing of digital content. We suggest potential approaches to address this, focusing in particular on how the sharing of posses-sions plays a role in the building of relationships and is done against a backdrop of trust.","reference":[{"content":"Liam Bannon and Susanne Bødker. 1997. Constructing Common Information Spaces. In Proceedings of the 5th European Conference on Computer Supported Cooperative Work (ECSCW '97), 81--96.","paperID":"None"},{"content":"Russell Belk. 2010. Sharing. Journal of Consumer Research 36, 5: 715--734. http://doi.org/10.1086/612649","paperID":"None"},{"content":"Russell Belk and Rosa Llamas. The Nature and Effects of Sharing in Consumer Behavior. In Transformative Consumer Research for Personal and Collective WellBeing, David Mick, Simone Pettigrew, Cornelia Pechmann and Julie Ozanne (eds.). 625--646.","paperID":"None"},{"content":"Ofer Bergman, Steve Whittaker, and Noa Falk. 2014. Shared files: The retrieval perspective. Journal of the Association for Information Science and Technology 65, 10: 1949--1963. http://doi.org/10.1002/asi.23147","paperID":"None"},{"content":"Jeremy Birnholtz and Steven Ibara. 2012. Tracking Changes in Collaborative Writing: Edits, Visibility and Group Maintenance. In Proceedings of the 2012 Conference on Computer Supported Cooperative Work (CSCW '12), 809--818. http://doi.org/10.1145/2145204.2145325","paperID":"None"},{"content":"Barry Brown, Alex S. Taylor, Shahram Izadi, Abigail Sellen, Joseph 'Jofish' Kaye, and Rachel Eardley. 2007. Locating Family Values: A Field Trial of the Whereabouts Clock. In Proceedings of the 9th international conference on Ubiquitous Computing (UbiComp '07), 354--371.","paperID":"None"},{"content":"A. J. Bernheim Brush and Kori M. Inkpen. 2007. Yours, Mine and Ours? Sharing and Use of Technology in Domestic Environments. In Proceedings of the 9th international conference on Ubiquitous Computing (UbiComp '07), 109--126.","paperID":"None"},{"content":"Juliet Corbin and Anselm Strauss. 2008. Basics of Qualitative Research. SAGE Publications, Los Angeles, CA.","paperID":"None"},{"content":"Andy Crabtree and Tom Rodden. 2004. Domestic Routines and Design for the Home. In Proceedings of the 2004 Conference on Computer Supported Cooperative Work (CSCW '04) 13, 2: 191--220. http://doi.org/10.1023/B:COSU.0000045712.26840.a4","paperID":"None"},{"content":"Serge Egelman, A.J. Bernheim Brush, and Kori M. Inkpen. 2008. Family Accounts: A New Paradigm for User Accounts Within the Home Environment. In Proceedings of the 2008 Conference on Computer Supported Cooperative Work (CSCW '08), 669--678. http://doi.org/10.1145/1460563.1460666","paperID":"None"},{"content":"Kathryn Elliot, Carman Neustaedter, and Saul Greenberg. 2005. Time, Ownership and Awareness: The Value of Contextual Locations in the Home. In Proceedings of the 7th international conference on Ubiquitous Computing (UbiComp '05), 251--268.","paperID":"None"},{"content":"Lita Furby. 1980. Collective Possession and Ownership: A Study of its Judged Feasibility and Desirability. Social Behavior and Personality: an international journal 8, 2: 165--183. http://doi.org/10.2224/sbp.1980.8.2.165","paperID":"None"},{"content":"Andrew Gorman-Murray. 2006. Gay and Lesbian Couples at Home: Identity Work in Domestic Space. Home Cultures 3, 2: 145--167. http://doi.org/10.2752/174063106778053200","paperID":"None"},{"content":"Rebecca Gulotta, William Odom, Jodi Forlizzi, and Haakon Faste. 2013. Digital Artifacts As Legacy: Exploring the Lifespan and Value of Digital Data. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1813--1822. http://doi.org/10.1145/2470654.2466240","paperID":"None"},{"content":"Richard Harper, Siân Lindley, Eno Thereska, et al. 2013. What is a File? In Proceedings of the 2013 Conference on Computer Supported Cooperative Work, (CSCW '13), 1125--1136. http://doi.org/10.1145/2441776.2441903","paperID":"None"},{"content":"Cathy Marshall and John C. Tang. 2012. That Syncing Feeling: Early User Experiences with the Cloud. In Proceedings of the Designing Interactive Systems Conference (DIS '12), 544--553. http://doi.org/10.1145/2317956.2318038","paperID":"None"},{"content":"Charlotte Massey, Thomas Lennig, and Steve Whittaker. 2014. Cloudy Forecast: An Exploration of the Factors Underlying Shared Repository Use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 2461--2470. http://doi.org/10.1145/2556288.2557042","paperID":"None"},{"content":"Helena M. Mentis, Siân E. Lindley, Stuart Taylor, Paul Dunphy, Tim Regan, and Richard Harper. 2012. Taking As an Act of Sharing. In Proceedings of the 2012 Conference on Computer Supported Cooperative Work (CSCW '12), 1091--1100. http://doi.org/10.1145/2145204.2145366","paperID":"None"},{"content":"William Odom, Abi Sellen, Richard Harper, and Eno Thereska. 2012. Lost in Translation: Understanding the Possession of Digital Things in the Cloud. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 781--790.","paperID":"None"},{"content":"William Odom, John Zimmerman, and Jodi Forlizzi. 2011. Teenagers and Their Virtual Possessions: Design Opportunities and Issues. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1491--1500. http://doi.org/10.1145/1978942.1979161","paperID":"None"},{"content":"William Odom, John Zimmerman, Jodi Forlizzi, et al. 2013. Fragmentation and Transition: Understanding Perceptions of Virtual Possessions Among Young Adults in Spain, South Korea and the USA. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1833--1842. http://doi.org/10.1145/2470654.2466242","paperID":"None"},{"content":"Emilee Rader. 2009. Yours, Mine and (Not) Ours: Social Influences on Group Information Repositories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09) , 2095--2098. http://doi.org/10.1145/1518701.1519019","paperID":"None"},{"content":"Suzanne Reimer and Deborah Leslie. 2004. Identity, Consumption, and the Home. Home Cultures 1, 2: 187--210. http://doi.org/10.2752/174063104778053536","paperID":"None"},{"content":"Mark Rouncefield and Peter Tolmie. 2011. Digital Words: Reading and the 21st Century Home. In The Connected Home: The Future of Domestic Life, Richard Harper (ed.). Springer London, 133--162. Retrieved September 24, 2015 from http://link.springer.com.ezproxy.lib.utexas.edu/chapter /10.1007/978-0--85729--476-0_8","paperID":"None"},{"content":"Amy Voida, Judith S. Olson, and Gary M. Olson. 2013. Turbulence in the Clouds: Challenges of Cloudbased Information Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2273--2282. http://doi.org/10.1145/2470654.2481313","paperID":"None"}],"title":"Things We Own Together: Sharing Possessions at Home","filename":"CHI16/p1176","authors":["Jane Gruning","Siân Lindley"],"conference":"CHI '16"}