{"paperId":2858163,"citation":[],"abstract":"Donors on crowdfunding sites must coordinate their actions to identify and collectively fund projects prior to their deadline. Some projects receive vast support immediately upon launch. Other seemingly worthwhile projects have more modest success or no success at raising funds. We examine how the presence of high-performing \"superstar' projects on a crowdfunding site affects donors' ability to coordinate their actions and fund other less popular but still worthwhile projects on the site. In a lab experiment where users simulate the dynamics of a crowdfunding site, we found that superstar projects reduce the likelihood that other projects are funded by the crowd, even when the super project has no opportunity to steal away donations form other projects. We argue that this is due to superstar projects setting too high of a standard of what a \"fundable\" project looks like, leading donors to underestimate the amount of support within a crowd for less exceptional projects.","reference":[{"content":"Ajay Agrawal, Christian Catalini, and Avi Goldfarb. 2011. The Geography of Crowdfunding. NBER Working Paper #16820. (February 2011). http://www.nber.org/papers/w16820","paperID":"None"},{"content":"Jisun An, Daniele Quercia, and Jon Crowcroft. 2014. Recommending investors for crowdfunding projects. In Proceedings of the 23rd international conference on World wide web. ACM, 261-270. DOI: http://dx.doi.org/10.1145/2566486.2568005","paperID":"None"},{"content":"Mark Bagnoli and Barton L. Lipman. 1989. Provision of Public Goods: Fully Implementing the Core through Private Contributions. The Review of Economic Studies 56, 4 (1989), pp. 583-601. http://www.jstor.org/stable/2297502","paperID":"None"},{"content":"Charles Bram Cadsby and Elizabeth Maynes. 1999. Voluntary provision of threshold public goods with continuous contributions: experimental evidence. Journal of Public Economics 71, 1 (1999), 53 - 73. DOI: http://dx.doi.org/10.1016/S0047--2727(98)00049--8","paperID":"None"},{"content":"Anil Doshi. 2014. Star Impact on Two-Sided Platforms: Evidence from Crowdfunding. Available at SSRN 2422111 (2014). http://papers.ssrn.com/sol3/ papers.cfm?abstract_id=2422111","paperID":"None"},{"content":"Julie S. Hui, Michael D. Greenberg, and Elizabeth M. Gerber. 2014. Understanding the Role of Community in Crowdfunding Work. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '14). ACM, New York, NY, USA, 62-74. DOI: http://dx.doi.org/10.1145/2531602.2531715","paperID":"None"},{"content":"Kickstarter. 2015. Statistics. (September 2015). https://www.kickstarter.com/help/stats?ref=footer","paperID":"None"},{"content":"Tanushree Mitra and Eric Gilbert. 2014. The Language That Gets People to Give: Phrases That Predict Success on Kickstarter. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '14). ACM, New York, NY, USA, 49-61. DOI: http://dx.doi.org/10.1145/2531602.2531656","paperID":"None"},{"content":"Ethan Mollick. 2012. The Dynamics of Crowdfunding: Determinants of Success and Failure. Technical Report 2088298. Social Science Research Network (SSRN).","paperID":"None"},{"content":"Vineeth Rakesh, Jaegul Choo, and Chandan K Reddy. 2015. Project Recommendation Using Heterogeneous Traits in Crowdfunding. In Ninth International AAAI Conference on Web and Social Media. http://www.aaai.org/ocs/index.php/ICWSM/ ICWSM15/paper/view/10581","paperID":"None"},{"content":"Vernon L. Smith. 1976. Experimental Economics: Induced Value Theory. American Economic Review 66, 2 (May 1976), 274-279. http://www.jstor.org/stable/1817233?seq=1","paperID":"None"},{"content":"Jacob Solomon, Wenjuan Ma, and Rick Wash. 2015. Don't Wait! How Timing Affects Coordination of Crowdfunding Donations. In Proceedings of the ACM 2015 Conference on Computer Supported Cooperative Work and Social Computing CSCW '15. DOI: http://dx.doi.org/10.1145/2675133.2675296","paperID":"None"},{"content":"Rick Wash and Jacob Solomon. 2014. Coordinating Donors on Crowdfunding Websites. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '14). ACM, New York, NY, USA, 38-48. DOI: http://dx.doi.org/10.1145/2531602.2531678","paperID":"None"},{"content":"Anbang Xu, Xiao Yang, Huaming Rao, Wai-Tat Fu, Shih-Wen Huang, and Brian P. Bailey. 2014. Show Me the Money!: An Analysis of Project Updates During Crowdfunding Campaigns. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 591-600. DOI: http://dx.doi.org/10.1145/2556288.2557045","paperID":"None"}],"title":"Highly Successful Projects Inhibit Coordination on Crowdfunding Sites","filename":"CHI16/p4568","authors":["Jacob Solomon","Wenjuan Ma","Rick Wash"],"conference":"CHI '16"}