{"paperId":2858136,"citation":[],"abstract":"Digital artifacts on social media can challenge individuals during identity transitions, particularly those who prefer to delete, separate from, or hide data that are representative of a past identity. This work investigates concerns and practices reported by transgender people who transitioned while active on Facebook. We analyze open-ended survey responses from 283 participants, highlighting types of data considered problematic when separating oneself from a past identity, and challenges and strategies people engage in when managing personal data in a networked environment. We find that people shape their digital footprints in two ways: by editing the self-presentational data that is representative of a prior identity, and by managing the configuration of people who have access to that self-presentation. We outline the challenging interplay between shifting identities, social networks, and the data that suture them together. We apply these results to a discussion of the complexities of managing and forgetting the digital past.","reference":[{"content":"Shane Ahern, Dean Eckles, Nathaniel S. Good, Simon King, Mor Naaman, and Rahul Nair. 2007. Overexposed?: Privacy patterns and considerations in online and mobile photo sharing. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 357--366. http://doi.org/10.1145/1240624.1240683","paperID":"None"},{"content":"Oshrat Ayalon and Eran Toch. 2013. Retrospective privacy: Managing longitudinal privacy in online social networks. Proceedings of the Ninth Symposium on Usable Privacy and Security, ACM, 4:1--4:13. http://doi.org/10.1145/2501604.2501608","paperID":"None"},{"content":"Lujo Bauer, Lorrie Faith Cranor, Saranga Komanduri, et al. 2013. The post anachronism: The temporal dimension of Facebook privacy. Proceedings of the 12th ACM Workshop on Privacy in the Electronic Society, ACM Press, 1--12. http://doi.org/10.1145/2517840.2517859","paperID":"None"},{"content":"Peter L. Berger and Thomas Luckmann. 1966. The social construction of reality. Penguin Books.","paperID":"None"},{"content":"Andrew Besmer and Heather Richter Lipford. 2010. Moving beyond untagging: Photo privacy in a tagged world. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1563--1572. http://doi.org/10.1145/1753326.1753560","paperID":"None"},{"content":"Geoffrey C. Bowker. 2008. Memory Practices in the Sciences. MIT Press.","paperID":"None"},{"content":"danah boyd. 2008. Taken Out of Context: American Teen Sociality in Networked Publics.","paperID":"None"},{"content":"danah boyd. 2010. Social network sites as networked public: Affordances, dynamics, and implications. In Networked Self: Identity, Community, and Culture on Social Network Sites, Zizi Papacharissi (ed.). Routledge, 39--58.","paperID":"None"},{"content":"Judith Butler. 1993. Bodies That Matter: On the Discursive Limits of \"Sex.\" Routledge.","paperID":"None"},{"content":"Sheldon Cohen, Tom Kamarck, and Robin Mermelstein. 1983. A global measure of perceived stress. Journal of Health and Social Behavior 24, 4: 385--396. http://doi.org/10.2307/2136404","paperID":"None"},{"content":"Juliet Corbin and Anselm Strauss. 2008. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage.","paperID":"None"},{"content":"José van Dijck. 2008. Digital photography: Communication, identity, memory. Visual Communication 7, 1: 57--76. http://doi.org/10.1177/1470357207084865","paperID":"None"},{"content":"Maeve Duggan, Nicole B. Ellison, Cliff Lampe, Amanda Lenhart, and Mary Madden. 2014. Social Media Update 2014. Pew Research Center: Internet, Science & Tech. Retrieved December 21, 2015 from http://www.pewinternet.org/2015/01/09/social-mediaupdate-2014/","paperID":"None"},{"content":"Doménique van Gennip, Elise van den Hoven, and Panos Markopoulos. 2015. Things that make us reminisce: Everyday memory cues as opportunities for interaction design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM Press, 3443--3452. http://doi.org/10.1145/2702123.2702460","paperID":"None"},{"content":"Erving Goffman. 1959. Presentation of Self in Everyday Life. Doubleday Anchor Books, NY, NY.","paperID":"None"},{"content":"Jane Gruning, Julia Bullard, and Melissa Ocepek. 2015. Medium, access, and obsolescence: What kinds of objects are lasting objects? Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3433--3442. http://doi.org/10.1145/2702123.2702238","paperID":"None"},{"content":"Rebecca Gulotta, Haakon Faste, and Jennifer Mankoff. 2012. Curation, provocation, and digital identity: Risks and motivations for sharing provocative images online. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 387--390. http://doi.org/10.1145/2207676.2207729","paperID":"None"},{"content":"Rebecca Gulotta, William Odom, Jodi Forlizzi, and Haakon Faste. 2013. Digital artifacts as legacy: Exploring the lifespan and value of digital data. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1813--1822. http://doi.org/10.1145/2470654.2466240","paperID":"None"},{"content":"Rebecca Gulotta, Alex Sciuto, Aisling Kelliher, and Jodi Forlizzi. 2015. Curatorial agents: How systems shape our understanding of personal and familial digital information. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3453--3462. http://doi.org/10.1145/2702123.2702297","paperID":"None"},{"content":"Oliver L. Haimson, Anne E. Bowser, Edward F. Melcer, and Elizabeth F. Churchill. 2015. Online inspiration and exploration for identity reinvention. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3809--3818. http://doi.org/10.1145/2702123.2702270","paperID":"None"},{"content":"Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, stress, and support during gender transition on Facebook. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1176--1190. http://doi.org/10.1145/2675133.2675152","paperID":"None"},{"content":"Laura Horak. 2014. Trans on YouTube: Intimacy, visibility, temporality. TSQ: Transgender Studies Quarterly 1, 4: 572--585. http://doi.org/10.1215/23289252-","paperID":"None"},{"content":"Nancy Van House and Elizabeth F. Churchill. 2008. Technologies of memory: Key issues and critical perspectives. Memory Studies 1, 3: 295--310. http://doi.org/10.1177/1750698008093795","paperID":"None"},{"content":"Adam N. Joinson. 2001. Self-disclosure in computermediated communication: The role of self-awareness and visual anonymity. European Journal of Social Psychology 31, 2: 177--192.","paperID":"None"},{"content":"Meg Leta (Ambrose) Jones. 2012. It's about time: Privacy, information lifecycles, and the right to be forgotten. Social Science Research Network, Rochester, NY. Retrieved August 6, 2015 from http://papers.ssrn.com/abstract=2154374","paperID":"None"},{"content":"Joseph 'Jofish' Kaye, Janet Vertesi, Shari Avery, et al. 2006. To have and to hold: Exploring the personal archive. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 275--284. http://doi.org/10.1145/1124772.1124814","paperID":"None"},{"content":"Bert-Jaap Koops. 2011. Forgetting footprints, shunning shadows: A critical analysis of the \"right to be forgotten\" in big data practice. Social Science Research Network, Rochester, NY. Retrieved August 6, 2015 from http://papers.ssrn.com/abstract=1986719","paperID":"None"},{"content":"Priya Kumar. 2014. A Digital Footprint From Birth: New Mothers? Decisions to Share Baby Pictures Online.","paperID":"None"},{"content":"Priya Kumar and Sarita Schoenebeck. 2015. The modern day baby book: Enacting good mothering and stewarding privacy on Facebook. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1302--1312. http://doi.org/10.1145/2675133.2675149","paperID":"None"},{"content":"Karen Locke, Martha S. Feldman, and Karen GoldenBiddle. 2015. Discovery, validation, and live coding. In Handbook of Qualitative Organizational Research: Innovative Pathways and Methods, Kimberly D. Elsbach and Roderick M. Kramer (eds.). Routledge, 371--380.","paperID":"None"},{"content":"S. F. Lovibond and Peter F. Lovibond. 1995. Manual for the Depression Anxiety Stress Scales. Psychology Foundation.","paperID":"None"},{"content":"Catherine C. Marshall and Frank M. Shipman. 2015. Exploring the ownership and persistent value of Facebook content. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM Press, 712--723. http://doi.org/10.1145/2675133.2675203","paperID":"None"},{"content":"Alice E. Marwick. 2005. I'm more than just a Friendster profile: Edentity, authenticity, and power in social networking services. Association for Internet Researchers 6.0, October 5-9.","paperID":"None"},{"content":"Alice E. Marwick and danah boyd. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1: 114--133. http://doi.org/10.1177/1461444810365313","paperID":"None"},{"content":"Viktor Mayer-Schönberger. 2009. Delete: The Virtue of Forgetting in the Digital Age. Princeton University Press.","paperID":"None"},{"content":"George Herbert Mead. 1934. Mind, Self, and Society: From the Standpoint of a Social Behaviorist. University of Chicago Press.","paperID":"None"},{"content":"Edited by Paul Muljadi. Digital Marketing Handbook. Paul Muljadi.","paperID":"None"},{"content":"Helen Nissenbaum. 2004. Privacy as contextual integrity. Washington Law Review 79: 119.","paperID":"None"},{"content":"Alexander Novotny. 2015. Signs of time: Designing social networking site profile interfaces with temporal contextual integrity. In Human Aspects of Information Security, Privacy, and Trust, Theo Tryfonas and Ioannis Askoxylakis (eds.). Springer International Publishing, 547--558.","paperID":"None"},{"content":"William Odom, Richard Banks, David Kirk, Richard Harper, Siân Lindley, and Abigail Sellen. 2012. Technology heirlooms?: Considerations for passing down and inheriting digital materials. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 337--346. http://doi.org/10.1145/2207676.2207723","paperID":"None"},{"content":"Leysia Palen and Paul Dourish. 2003. Unpacking \"privacy\" for a networked world. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 129--136. http://doi.org/10.1145/642611.642635","paperID":"None"},{"content":"S. Tejaswi Peesapati, Victoria Schwanda, Johnathon Schultz, Matt Lepage, So-yae Jeong, and Dan Cosley. 2010. Pensieve: Supporting everyday reminiscence. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2027--2036. http://doi.org/10.1145/1753326.1753635","paperID":"None"},{"content":"Andrea Peterson. 2014. Facebook's \"Year in Review\" app swings from merely annoying to tragic. The Washington Post. Retrieved May 5, 2015 from http://www.washingtonpost.com/blogs/theswitch/wp/2014/12/26/facebooks-year-in-review-appswings-from-merely-annoying-to-tragic/","paperID":"None"},{"content":"Radiolab. The Trust Engineers. Retrieved May 21, 2015 from http://www.radiolab.org/story/trust-engineers/","paperID":"None"},{"content":"Jeffrey Rosen. 2012. The right to be forgotten. Stanford Law Review Online 64: 88.","paperID":"None"},{"content":"Corina Sas and Steve Whittaker. 2013. Design for forgetting: Disposing of digital possessions after a breakup. Proceedings of the 2013 ACM Annual Conference on Human Factors in Computing Systems, ACM, 1823--1832. http://doi.org/10.1145/2466110.2466241","paperID":"None"},{"content":"Victoria Schwanda Sosik, Xuan Zhao, and Dan Cosley. 2012. See friendship, sort of: How conversation and digital traces might support reflection on friendships. Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work, ACM, 1145--1154. http://doi.org/10.1145/2145204.2145374","paperID":"None"},{"content":"Susan Stryker. 2009. Transgender History. Seal Press.","paperID":"None"},{"content":"John Suler. 2004. The online disinhibition effect. CyberPsychology & Behavior 7, 3: 321--326. http://doi.org/10.1089/1094931041291295","paperID":"None"},{"content":"David Valentine. 2007. Imagining Transgender: An Ethnography of a Category. Duke University Press.","paperID":"None"},{"content":"Nancy A. Van House. 2011. Feminist HCI meets Facebook: Performativity and social networking sites. Interacting with Computers 23, 5: 422--429. http://doi.org/10.1016/j.intcom.2011.03.003","paperID":"None"},{"content":"Jessica Vitak and Jinyoung Kim. 2014. You can't block people offline: Examining how Facebook's affordances shape the disclosure process. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, ACM, 461--474. http://doi.acm.org/10.1145/2531602.2531672","paperID":"None"},{"content":"Rolf H. Weber. 2011. The right to be forgotten: More than a Pandora's box? Journal of Intellectual Property, Information Technology and E-Commerce Law 2, 2.","paperID":"None"},{"content":"Allison Woodruff. 2014. Necessary, unpleasant, and disempowering: Reputation management in the Internet Age. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 149--158. http://doi.org/10.1145/2556288.2557126","paperID":"None"},{"content":"Xuan Zhao and Siân E. Lindley. 2014. Curation through use: Understanding the personal value of social media. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM Press, 2431--2440. http://doi.org/10.1145/2556288.2557291","paperID":"None"},{"content":"Xuan Zhao, Niloufar Salehi, Sasha Naranjit, Sara Alwaalan, Stephen Voida, and Dan Cosley. 2013. The many faces of Facebook: Experiencing social media as performance, exhibition, and personal archive. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1--10. http://doi.org/10.1145/2470654.2470656","paperID":"None"}],"title":"Digital Footprints and Changing Networks During Online Identity Transitions","filename":"CHI16/p2895","authors":["Oliver L. Haimson","Jed R. Brubaker","Lynn Dombrowski","Gillian R. Hayes"],"conference":"CHI '16"}