{"paperId":2858152,"citation":[],"reference":[{"content":"Urs-Vito Albrecht, Ute von Jan, Joachim Kuebler, Christoph Zoeller, Martin Lacher, Oliver J Muensterer, Max Ettinger, Michael Klintschar, and Lars Hagemeier. 2014. Google Glass for documentation of medical findings: evaluation in forensic medicine. Journal of medical Internet research 16, 2 (2014).","paperID":"None"},{"content":"Cheng Bo, Lan Zhang, Xiang-Yang Li, Qiuyuan Huang, and Yu Wang. 2013. SilentSense: Silent User Identification Via Touch and Movement Behavioral Biometrics. Proceedings of the 19th annual international conference on Mobile computing & networking - MobiCom '13 (2013), 187. DOI: http://dx.doi.org/10.1145/2500423.2504572","paperID":"None"},{"content":"Pedro Cano, Eloi Batlle, E Batle, T Kalker, and J Haitsma. 2002. A review of algorithms for audio fingerprinting. In Multimedia Signal Processing, 2002 IEEE Workshop on. 169--173. DOI: http://dx.doi.org/10.1109/MMSP.2002.1203274","paperID":"None"},{"content":"M. Conti, I. Zachia-Zlatea, and Bruno Crispo. 2011. Mind how you answer me!: transparently authenticating the user of a smartphone when answering or placing a call. Proceedings of the 6th ACM Symposium on Information, Computer and Communications Security (2011), 249--259. DOI: http://dx.doi.org/10.1145/1966913.1966945","paperID":"None"},{"content":"Cory Cornelius, Ronald Peterson, Joseph Skinner, Ryan Halter, and David Kotz. 2014. A Wearable System That Knows Who Wears It. In Proceedings of the 12th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '14). ACM, New York, NY, USA, 55--67. DOI: http://dx.doi.org/10.1145/2594368.2594369","paperID":"None"},{"content":"S. Davis and P. Mermelstein. 1980. Comparison of parametric representations for monosyllabic word recognition in continuously spoken sentences. IEEE Transactions on Acoustics, Speech, and Signal Processing 28, 4 (1980). DOI: http://dx.doi.org/10.1109/TASSP.1980.1163420","paperID":"None"},{"content":"Paula Henry and Tomasz R Letowski. 2007. Bone Conduction : Anatomy , Physiology , and Communication. May (2007).","paperID":"None"},{"content":"Christian Holz, Senaka Buthpitiya, and Marius Knaust. 2015. Bodyprint: Biometric User Identification on Mobile Devices Using the Capacitive Touchscreen to Scan Body Parts. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3011--3014. DOI: http://dx.doi.org/10.1145/2702123.2702518","paperID":"None"},{"content":"Grace Hu, Lily Chen, Johanna Okerlund, and Orit Shaer. 2015. Exploring the Use of Google Glass in Wet Laboratories. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2103--2108.","paperID":"None"},{"content":"Nikolaos Karapanos, Claudio Marforio, Claudio Soriente, and Srdjan Capkun. 2015. Sound-Proof: Usable Two-Factor Authentication Based on Ambient Sound. arXiv:1503.03790 [cs] (2015). http://arxiv.org/abs/1503.03790","paperID":"None"},{"content":"Paul Lukowicz, Andreas Poxrucker, Jens Weppner, B. Bischke, Jochen Kuhn, and Michael Hirth. 2015. Glass-physics: Using Google Glass to Support High School Physics Experiments. In Proceedings of the 2015 ACM International Symposium on Wearable Computers. 151--154. DOI: http://dx.doi.org/10.1145/2802083.2808407","paperID":"None"},{"content":"Emanuele Maiorana, Patrizio Campisi, Noelia Gonzalez-Carballo, and Alessandro Neri. 2011. Keystroke dynamics authentication for mobile phones. Proceedings of the 2011 ACM Symposium on Applied Computing SAC 11 (2011), 21--26. DOI: http://dx.doi.org/10.1145/1982185.1982190","paperID":"None"},{"content":"J Mantyjarvi, M Lindholm, E Vildjiounaite, S.-M. Makela, and H A Ailisto. 2005. Identifying users of portable devices from gait pattern with accelerometers. In Acoustics, Speech, and Signal Processing, 2005. Proceedings. (ICASSP '05). IEEE International Conference on, Vol. 2. ii/973--ii/976 Vol. 2. DOI: http://dx.doi.org/10.1109/ICASSP.2005.1415569","paperID":"None"},{"content":"Oliver J Muensterer, Martin Lacher, Christoph Zoeller, Matthew Bronstein, and Joachim Kübler. 2014. Google Glass in pediatric surgery: An exploratory study. International Journal of Surgery 12, 4 (2014), 281--289.","paperID":"None"},{"content":"William D. Jr. O'Brien and Y Liu. 2005. Evaluation of acoustic propagation paths into the human head. 2005 (2005), 1--24. http://oai.dtic.mil/oai/oai?verb= getRecord&metadataPrefix=html&identifier= ADA437351","paperID":"None"},{"content":"P. Jonathon Phillips, Alvin Martin, C. L. Wilson, and Mark Przybocki. 2000. Introduction to evaluating biometric systems. Computer 33, 2 (2000), 56--63. DOI: http://dx.doi.org/10.1109/2.820040","paperID":"None"},{"content":"Axel Plinge, Rene Grzeszick, and Gernot A. Fink. 2014. A Bag-of-Features approach to acoustic event detection. In 2014 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). 3704--3708. DOI: http://dx.doi.org/10.1109/ICASSP.2014.6854293","paperID":"None"},{"content":"Sandra Pruzansky. 1963. Pattern Matching Procedure for Automatic Talker Recognition. The Journal of the Acoustical Society of America 35, 3 (1963), 214--215.","paperID":"None"},{"content":"Cynthia E Rogers, Alexander W Witt, Alexander D Solomon, and Krishna K Venkatasubramanian. 2015. An Approach for User Identification for Head-mounted Displays. In Proceedings of the 2015 ACM International Symposium on Wearable Computers (ISWC '15). ACM, New York, NY, USA, 143--146. DOI: http://dx.doi.org/10.1145/2802083.2808391","paperID":"None"},{"content":"Stefan Schneegass, Frank Steimle, Andreas Bulling, Florian Alt, and Albrecht Schmidt. 2014. SmudgeSafe: Geometric Image Transformations for Smudge-resistant User Authentication. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, New York, NY, USA, 775--786. DOI: http://dx.doi.org/10.1145/2632048.2636090","paperID":"None"},{"content":"Mark Simkin, Dominique Schrder, Andreas Bulling, and Mario Fritz. 2014. Ubic: Bridging the Gap between Digital Cryptography and the Physical World. In Proc. of the 19th European Symposium on Research in Computer Security (ESORICS 2014) (2014-09-01), Vol. 8712. Springer International Publishing, 56--75. http://dx.doi.org/10.1007/978--3--319--11203--9_ 4https://perceptual.mpi-inf.mpg.de/files/2014/ 09/Simkin14_ubic1.pdf","paperID":"None"},{"content":"Stefan Stenfelt and Richard L Goode. 2005. Transmission properties of bone conducted sound: measurements in cadaver heads. The Journal of the Acoustical Society of America 118, 4 (2005), 2373--2391. DOI: http://dx.doi.org/10.1121/1.2005847","paperID":"None"}],"abstract":"Secure user identification is important for the increasing number of eyewear computers but limited input capabilities pose significant usability challenges for established knowledge-based schemes, such as passwords or PINs. We present SkullConduct, a biometric system that uses bone conduction of sound through the user's skull as well as a microphone readily integrated into many of these devices, such as Google Glass. At the core of SkullConduct is a method to analyze the characteristic frequency response created by the user's skull using a combination of Mel Frequency Cepstral Coefficient (MFCC) features as well as a computationally light-weight 1NN classifier. We report on a controlled experiment with 10 participants that shows that this frequency response is person-specific and stable -- even when taking off and putting on the device multiple times -- and thus serves as a robust biometric. We show that our method can identify users with 97.0% accuracy and authenticate them with an equal error rate of 6.9%, thereby bringing biometric user identification to eyewear computers equipped with bone conduction technology.","title":"SkullConduct: Biometric User Identification on Eyewear Computers Using Bone Conduction Through the Skull","filename":"CHI16/p1379","authors":["Stefan Schneegass","Youssef Oualil","Andreas Bulling"],"conference":"CHI '16"}