{"paperId":2858246,"citation":[],"abstract":"Online communities can promote illness recovery and improve well-being in the cases of many kinds of illnesses. However, for challenging mental health condition like anorexia, social media harbor both recovery communities as well as those that encourage dangerous behaviors. The effectiveness of such platforms in promoting recovery despite housing both communities is underexplored. Our work begins to fill this gap by developing a statistical framework using survival analysis and situating our results within the cognitive behavioral theory of anorexia. This model identifies content and participation measures that predict the likelihood of recovery. From our dataset of over 68M posts and 10K users that self-identify with anorexia, we find that recovery on Tumblr is protracted - only half of the population is estimated to exhibit signs of recovery after four years. We discuss the effectiveness of social media in improving well-being around anorexia, a unique health challenge, and emergent questions from this line of work.","reference":[{"content":"American Psychiatric Association and others. 2003. Diagnostic and Statistical Manual of Mental Disorders:: DSM-5. ManMag.","paperID":"None"},{"content":"Anna M Bardone-Cone and Kamila M Cass. 2006. Investigating the impact of pro-anorexia websites: A pilot study. European Eating Disorders Review 14, 4 (2006), 256--262.","paperID":"None"},{"content":"Dina LG Borzekowski, Summer Schenk, Jenny L Wilson, and Rebecka Peebles. 2010. e-Ana and e-Mia: A Content Analysis of Pro-Eating Disorder Web Sites. American journal of public health 100, 8 (2010), 1526.","paperID":"None"},{"content":"Hilde Bruch. 1973. Eating disorders: Obesity, anorexia nervosa, and the person within. Vol. 5052. Basic Books.","paperID":"None"},{"content":"Cynthia M Bulik, Nancy D Berkman, Kimberly A Brownley, Jan A Sedway, and Kathleen N Lohr. 2007. Anorexia nervosa treatment: a systematic review of randomized controlled trials. International Journal of Eating Disorders 40, 4 (2007), 310--320.","paperID":"None"},{"content":"Stevie Chancellor, Jessica Pater, Trustin Clear, Eric Gilbert, and Munmun De Choudhury. 2016. #thyghgapp: Instagram Content Moderation and Lexical Variation in Pro-Eating Disorder Communities. In Proceedings of the 2016 Conference on Computer Supported Cooperative Work (CSCW). ACM.","paperID":"None"},{"content":"Cindy Chung and James W Pennebaker. 2007. The psychological functions of function words. Social communication (2007), 343--359.","paperID":"None"},{"content":"TG Clark, MJ Bradburn, SB Love, and DG Altman. 2003. Survival analysis part I: basic concepts and first analyses. British journal of cancer 89, 2 (2003), 232--238.","paperID":"None"},{"content":"David R Cox. 1992. Regression models and life-tables. In Breakthroughs in Statistics. Springer, 527--541.","paperID":"None"},{"content":"Munmun De Choudhury. 2015. Anorexia on Tumblr: A Characterization Study. In Proc. Digital Health.","paperID":"None"},{"content":"Munmun De Choudhury, Scott Counts, Eric Horvitz, and Aaron Hoff. 2014. Characterizing and Predicting Postpartum Depression from Facebook Data. In Proc. CSCW.","paperID":"None"},{"content":"Munmun De Choudhury, Michael Gamon, Scott Counts, and Eric Horvitz. 2013. Predicting depression via social media. In Proc. ICWSM.","paperID":"None"},{"content":"T Emmens and A Phippen. 2010. Evaluating Online Safety Programs. Harvard Berkman Center for Internet and Society.[23 July 2011] (2010).","paperID":"None"},{"content":"Gunther Eysenbach, John Powell, Marina Englesakis, Carlos Rizo, Anita Stern, and others. 2004. Health related virtual communities and electronic support groups: systematic review of the effects of online peer to peer interactions. Bmj 328, 7449 (2004), 1166.","paperID":"None"},{"content":"Christopher G Fairburn, Roz Shafran, and Zafra Cooper. 1999. A cognitive behavioural theory of anorexia nervosa. Behaviour Research and Therapy 37, 1 (1999), 1--13.","paperID":"None"},{"content":"Rachel A Fleming-May and Laura E Miller. 2010. I'm scared to look. But I'm dying to know: Information seeking and sharing on Pro-Ana weblogs. Proc. ASIST 47, 1 (2010), 1--9.","paperID":"None"},{"content":"Nick Fox, Katie Ward, and Alan O'Rourke. 2005. Pro-anorexia, weight-loss drugs and the internet: an \"anti-recovery\" explanatory model of anorexia. Sociology of Health & Illness 27, 7 (2005), 944--971.","paperID":"None"},{"content":"Jeff Gavin, Karen Rodham, and Helen Poyer. 2008. The presentation of \"pro-anorexia\" in online group interactions. Qualitative Health Research 18, 3 (2008), 325--333.","paperID":"None"},{"content":"Erving Goffman. 1959. The presentation of self in everyday life. (1959).","paperID":"None"},{"content":"Andrea Grimes, Brian M Landry, and Rebecca E Grinter. 2010. Characteristics of shared health reflections in a local community. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. ACM, 435--444.","paperID":"None"},{"content":"Frank E Harrell. 2001. Regression Modeling Strategies: With Applications to Linear Models, Logistic Regression, and Survival Analysis. Springer.","paperID":"None"},{"content":"Andrea Hartzler and Wanda Pratt. 2011. Managing the personal side of health: how patient expertise differs from the expertise of clinicians. Journal of medical Internet research 13, 3 (2011).","paperID":"None"},{"content":"David B Herzog, David J Dorer, Pamela K Keel, Sherrie E Selwyn, Elizabeth R Ekeblad, Andrea T Flores, Dara N Greenwood, Rebecca A Burwell, and Martin B Keller. 1999. Recovery and relapse in anorexia and bulimia nervosa: a 7.5-year follow-up study. Journal of the American Academy of Child & Adolescent Psychiatry 38, 7 (1999), 829--837.","paperID":"None"},{"content":"Sharlene Hesse-Biber, Patricia Leavy, Courtney E Quinn, and Julia Zoino. 2006. The mass marketing of disordered eating and eating disorders: The social psychology of women, thinness and culture. In Women's studies international forum, Vol. 29. Elsevier, 208--224.","paperID":"None"},{"content":"Hans Wijbrand Hoek. 2006. Incidence, prevalence and mortality of anorexia nervosa and other eating disorders. Current opinion in psychiatry 19, 4 (2006), 389--394.","paperID":"None"},{"content":"Christopher M Homan, Naiji Lu, Xin Tu, Megan C Lytle, and Vincent Silenzio. 2014. Social structure and depression in TrevorSpace. In Proc. CSCW.","paperID":"None"},{"content":"Yan Hong, Ninfa C Pena-Purcell, and Marcia G Ory. 2012. Outcomes of online support and resources for cancer survivors: A systematic literature review. Patient education and counseling 86, 3 (2012), 288--296.","paperID":"None"},{"content":"Mette Terp Høybye, Christoffer Johansen, and Tine Tjørnhøj-Thomsen. 2005. Online interaction. Effects of storytelling in an internet breast cancer support group. Psycho-Oncology 14, 3 (2005), 211--220.","paperID":"None"},{"content":"Jina Huh and Mark S Ackerman. 2012. Collaborative help in chronic disease management: supporting individualized problems. In Proc. CSCW.","paperID":"None"},{"content":"Jina Huh, Leslie S Liu, Tina Neogi, Kori Inkpen, and Wanda Pratt. 2014. Health vlogs as social support for chronic illness management. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 4 (2014), 23.","paperID":"None"},{"content":"Grace J Johnson and Paul J Ambrose. 2006. Neo-tribes: The power and potential of online communities in health care. Commun. ACM 49, 1 (2006), 107--113.","paperID":"None"},{"content":"Adam N Joinson. 2001. Self-disclosure in computer-mediated communication: The role of self-awareness and visual anonymity. European Journal of Social Psychology 31, 2 (2001), 177--192.","paperID":"None"},{"content":"Adrienne S Juarascio, Amber Shoaib, and C Alix Timko. 2010. Pro-eating disorder communities on social networking sites: a content analysis. Eating disorders 18, 5 (2010), 393--407.","paperID":"None"},{"content":"Edward L Kaplan and Paul Meier. 1958. Nonparametric estimation from incomplete observations. Journal of the American statistical association 53, 282 (1958), 457--481.","paperID":"None"},{"content":"John P Klein and Melvin L Moeschberger. 2003. Survival analysis: techniques for censored and truncated data. Springer Science & Business Media.","paperID":"None"},{"content":"David G Kleinbaum. 1998. Survival Analysis, a Self-Learning Text. Biometrical Journal 40, 1 (1998), 107--108.","paperID":"None"},{"content":"Stephen P Lewis and Alexis E Arbuthnott. 2012. Searching for thinspiration: the nature of internet searches for pro-eating disorder websites. Cyberpsychology, Behavior, and Social Networking 15, 4 (2012), 200--204.","paperID":"None"},{"content":"Elizabeth J Lyons, Matthias R Mehl, and James W Pennebaker. 2006. Pro-anorexics and recovering anorexics differ in their linguistic Internet self-presentation. Journal of Psychosomatic Research 60, 3 (2006), 253--256.","paperID":"None"},{"content":"Diana MacLean, Sonal Gupta, Anna Lembke, Christopher Manning, and Jeffrey Heer. 2015. Forum77: An Analysis of an Online Health Forum Dedicated to Addiction Recovery. In Proc. CSCW.","paperID":"None"},{"content":"Lena Mamykina, Andrew D Miller, Elizabeth D Mynatt, and Daniel Greenblatt. 2010. Constructing identities through storytelling in diabetes management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1203--1212.","paperID":"None"},{"content":"Lena Mamykina, Drashko Nakikj, and Noemie Elhadad. 2015. Collective Sensemaking in Online Health Forums. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3217--3226.","paperID":"None"},{"content":"Jennifer Mankoff, Kateryna Kuksenok, Sara Kiesler, Jennifer A Rode, and Kelly Waldman. 2011. Competing online viewpoints and models of chronic illness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 589--598.","paperID":"None"},{"content":"Phoenix KH Mo and Neil S Coulson. 2008. Exploring the communication of social support within virtual communities: A content analysis of messages posted to an online HIV/AIDS support group. Cyberpsychology & behavior 11, 3 (2008), 371--374.","paperID":"None"},{"content":"Elizabeth L Murnane and Scott Counts. 2014. Unraveling abstinence and relapse: smoking cessation reflected in social media. In Proc. CHI.","paperID":"None"},{"content":"Mark W Newman, Debra Lauterbach, Sean A Munson, Paul Resnick, and Margaret E Morris. 2011. It's not that I don't have problems, I'm just not putting them on Facebook: challenges and opportunities in using online social networks for health. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. ACM, 341--350.","paperID":"None"},{"content":"Greta Noordenbos, Anna Oldenhave, Jennifer Muschter, and Nynke Terpstra. 2002. Characteristics and treatment of patients with chronic eating disorders. Eating disorders 10, 1 (2002), 15--29.","paperID":"None"},{"content":"Thomas E Oxman, Stanley D Rosenberg, and Gary J Tucker. 1982. The language of paranoia. The American Journal of Psychiatry (1982).","paperID":"None"},{"content":"Mahesh KB Parmar and David Machin. 1995. Survival analysis: a practical approach. John Wiley & Sons Chichester.","paperID":"None"},{"content":"Michael J Paul and Mark Dredze. 2011. You Are What You Tweet: Analyzing Twitter for Public Health.. In Proc. ICWSM.","paperID":"None"},{"content":"James W Pennebaker, Tracy J Mayne, and Martha E Francis. 1997. Linguistic predictors of adaptive bereavement. Journal of personality and social psychology 72, 4 (1997), 863.","paperID":"None"},{"content":"Kathleen M Pike. 1998. Long-term course of anorexia nervosa: response, relapse, remission, and recovery. Clinical psychology review 18, 4 (1998), 447--475.","paperID":"None"},{"content":"Jenny Preece and Diane Maloney-Krichmar. 2005. Online communities: Design, theory, and practice. Journal of Computer-Mediated Communication 10, 4 (2005), 00--00.","paperID":"None"},{"content":"Shelly Rodgers and Qimei Chen. 2005. Internet community group participation: Psychosocial benefits for women with breast cancer. Journal of Computer-Mediated Communication 10, 4 (2005), 00--00.","paperID":"None"},{"content":"Philip Rowe. 2007. Essential statistics for the pharmaceutical sciences. John Wiley & Sons.","paperID":"None"},{"content":"Stephanie Rude, Eva-Maria Gortner, and James Pennebaker. 2004. Language use of depressed and depression-vulnerable college students. Cognition & Emotion 18, 8 (2004), 1121--1133.","paperID":"None"},{"content":"Leslie Regan Shade. 2003. Weborexics: The Ethical Issues Surrounding Pro-Ana Websites. SIGCAS Comput. Soc. 33, 4 (Dec. 2003).","paperID":"None"},{"content":"Meredith M Skeels, Kenton T Unruh, Christopher Powell, and Wanda Pratt. 2010. Catalyzing social support for breast cancer patients. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 173--182.","paperID":"None"},{"content":"Nalini M Srinivasagam, Walter H Kaye, Katherine H Plotnicov, Catherine Greeno, Theodore E Weltzin, and Radhika Rao. 1995. Persistent perfectionism, symmetry, and exactness after long-term recovery from anorexia nervosa. American Journal of Psychiatry 152, 11 (1995), 1630--1634.","paperID":"None"},{"content":"Michael Strober, Roberta Freeman, and Wendy Morrell. 1998. The long-term course of severe anorexia nervosa in adolescents: survival analysis of recovery, relapse, and outcome predictors over 10--15 years in a prospective study. International Journal of Eating Disorders 22 (1998), 339--60.","paperID":"None"},{"content":"Sarah Swan and Bernice Andrews. 2003. The relationship between shame, eating disorders and disclosure in treatment. British journal of clinical psychology 42, 4 (2003), 367--378.","paperID":"None"},{"content":"Shabbir Syed-Abdul, Luis Fernandez-Luque, Wen-Shan Jian, Yu-Chuan Li, Steven Crain, Min-Huei Hsu, Yao-Chin Wang, Dorjsuren Khandregzen, Enkhzaya Chuluunbaatar, Phung Anh Nguyen, and others. 2013. Misleading health-related information promoted through video-based social media: anorexia on YouTube. Journal of medical Internet research 15, 2 (2013).","paperID":"None"},{"content":"Stephanie Tierney. 2006. The dangers and draw of online communication: Pro-anorexia websites and their implications for users, practitioners, and researchers. Eating Disorders 14, 3 (2006), 181--190.","paperID":"None"},{"content":"Federica Tozzi, Patrick F Sullivan, Jennifer L Fear, Jan McKenzie, and Cynthia M Bulik. 2003. Causes and recovery in anorexia nervosa: The patient's perspective. International Journal of Eating Disorders 33, 2 (2003), 143--154.","paperID":"None"},{"content":"Kelly Bemis Vitousek, Jennifer Daly, and Christopher Heiser. 1991. Reconstructing the internal world of the eating-disordered individual: Overcoming denial and distortion in self-report. International Journal of Eating Disorders 10, 6 (1991), 647--666.","paperID":"None"},{"content":"Paul Wicks, Michael Massagli, Jeana Frost, Catherine Brownstein, Sally Okun, Timothy Vaughan, Richard Bradley, and James Heywood. 2010. Sharing health data for better outcomes on PatientsLikeMe. Journal of medical Internet research 12, 2 (2010).","paperID":"None"},{"content":"John B Willett and Judith D Singer. 1993. Investigating onset, cessation, relapse, and recovery: why you should, and how you can, use discrete-time survival analysis to examine event occurrence. Journal of consulting and clinical psychology 61, 6 (1993), 952.","paperID":"None"},{"content":"Markus Wolf, Jan Sedway, Cynthia M Bulik, and Hans Kordy. 2007. Linguistic analyses of natural written language: Unobtrusive assessment of cognitive style in eating disorders. International journal of eating disorders 40, 8 (2007), 711--717.","paperID":"None"},{"content":"Markus Wolf, Florian Theis, and Hans Kordy. 2013. Language Use in Eating Disorder Blogs Psychological Implications of Social Online Activity. Journal of Language and Social Psychology 32, 2 (2013), 212--226.","paperID":"None"},{"content":"Elad Yom-Tov, Luis Fernandez-Luque, Ingmar Weber, and Steven P Crain. 2012. Pro-anorexia and pro-recovery photo sharing: A tale of two warring tribes. Journal of medical Internet research 14, 6 (2012).","paperID":"None"}],"title":"Recovery Amid Pro-Anorexia: Analysis of Recovery in Social Media","filename":"CHI16/p2111","authors":["Stevie Chancellor","Tanushree Mitra","Munmun De Choudhury"],"conference":"CHI '16"}