{"paperId":2858324,"abstract":"In a series of interviews and observations conducted over the past two years, we examined how designers have created, adopted, and evolved design methods into practice. These studies have led us to question the processes used and assumptions held by those who have been involved in developing new design methods. Our studies have shown that even though user-centered design is advocated by most researchers and practitioners, when it comes to their own way of developing design methods for others, it is not done using a user-centered approach. However, we found interesting differences among the three categories of interviewees; practitioners, researchers and practitioner/researchers.","citation":[],"reference":[{"content":"Argyris, M. & Schön, D. 1974. Theory in Practice. Increasing professional effectiveness. Jossey-Bass.","paperID":"None"},{"content":"Dickson, G., & Siegel, M. (2014). \"Board Game Design: A Metaphor for the Development of Interaction and Experience Design Methods.\" In Proceedings of AIGA Connecting Dots Conference.","paperID":"None"},{"content":"Dubberly, H. (2004). How do you design. A Compendium of Models. Retrieved September 21, 2015 from http://www.dubberly.com/articles/how-do-youdesign.html","paperID":"None"},{"content":"Goodman, E., Stolterman, E., & Wakkary, R. (2011). Understanding interaction design practices. In Proc. CHI 2011 (pp. 1061-1070). ACM Press.","paperID":"None"},{"content":"Hanington, B., & Martin, B. (2012). Universal methods of design: 100 ways to research complex problems, develop innovative ideas, and design effective solutions. Rockport Publishers.","paperID":"None"},{"content":"Kumar, V. (2012). 101 design methods: A structured approach for driving innovation in your organization. John Wiley & Sons.","paperID":"None"},{"content":"Poggenpohl, S. H., & Sato, K. (2009). Design integrations: research and collaboration. Intellect Books.","paperID":"None"},{"content":"Roedl, D. J., & Stolterman, E. (2013, April). Design research at CHI and its applicability to design practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 1951--1954). ACM.","paperID":"None"},{"content":"Rogers, Y. (2004). New theoretical approaches for human-computer interaction. Annual review of information science and technology, 38(1), 87-143.","paperID":"None"},{"content":"Sennett, R. 2008. The Craftsman . Yale University Press","paperID":"None"},{"content":"Stolterman, E. (2008). The nature of design practice and implications for interaction design research. International Journal of Design, 2(1), 55-65.","paperID":"None"},{"content":"Sutcliffe, A. (2000). On the effective use and reuse of HCI knowledge. ACM Trans. Comput.-Hum. Interact., 7(2), 197-221.","paperID":"None"}],"title":"Why Design Method Development is Not Always Carried Out as User-Centered Design","filename":"CHI16/p4056","authors":["Gary Dickson","Erik Stolterman"],"conference":"CHI '16"}